[{"title":"Forget Henry James, forget The Innocents and just enjoy","rating":8,"date":"3 March 2006","review":"As with many Winner films it is necessary to not make the mistake of expecting his film to be exactly as you expect, or very much like it at all actually. Forget Henry James, forget The Innocents and just enjoy Mr Winner's take on how the children lost their innocence. The SM and bondage scenes were more explicit than I remember on a previous viewing and it may be that the earlier video had been trimmed. Certainly here there is no mistaking the powerful relationship between Brando and Beacham and I for one found the playing out of these scenes by the children fairly powerful. I suppose the pace is a little slow which is perhaps particularly noticeable because of how quickly does the effective ending unfold. Not for purists but if you are looking for that something just a little bit differentUPDATE 7.2.17 Just watched this again, on blu ray this time and enjoyed it even more. Once again I felt the bondage scenes more explicit than I remember from before! Funny thing memory.","user":"christopher-underwood","rank":[27,37]},{"title":"Typical Winner mish mash - Brando still in Last Tango mode","rating":3,"date":"3 December 2002","review":"Conceived as a prequel to The Turn Of The Screw, Winner's film is a curious vehicle for Marlon Brando, as well as a example of a failed attempt to film gothic, period drama satisfactorily. Brando plays Peter Quint, the sexually aggressive former valet, now locum gardener at Bly House, an English county estate. Bly is run jointly by housekeeper,  Mrs Grose (Thora Hird), and a governess, the repressed Miss Jessell (Stephanie Beacham). The only other inhabitants of this curious domicile are two children, Miles (Christopher Ellis) and Flora (Verna Harvey), nominally the wards of the absent Master of the House (a splendid Harry Andrews), obliged with their care after the death of their parents in an overseas automobile accident. The children regard Quint as something of a surrogate father, and feel that they can ingratiate themselves by manipulating his private life, notably his intense relationship with Miss Jessell. <br><br>Jack Claytons The Innocents (1962) is the closest point of reference for Winner's effort, as the earlier film is the definitive telling of the Henry James tale, the events of which spring from this. Presumably the appointment, and despatch to Bly of the (unnamed) new governess at the film's end is that of Miss Giddings, the character played by Deborah Kerr. But where Clayton's film was completely successful in transmitting a feeling of supernatural unease and psychological dread, Winner's ham-fisted approach to his material comes across as almost entirely without atmosphere or charm. James' characters may act out their allotted parts in The Nightcomers, but its presentation of situation and personality veers uncertainly between the childhood gormlessness of Chitty Chitty Bang Bang and the compulsions of Lady Chatterley's Lover, as much as evoking any genuine  atmosphere of psychic foreboding. <br><br>Perhaps such foreboding was the last thing the director had in mind. Brando of course regularly exudes magnetism, even in his less successful films, and the animal sexuality of the gardener towards the governess is one of the most dynamic things about Winner's film. UK TV viewers, used to seeing Beacham as the staple of such programmes as Tenko and Dynasty, will raise eyebrows as she gamely submits her buxom charms to Quint's hands - at one point hogtied and squirming in an impromptu Edwardian bondage session. Jessell despises herself, and yet craves what Quint brings during his nocturnal visits. These scenes, verging on the embarrassing for viewer and participants alike, at least provide  vivid entertainment sadly missing elsewhere. Unfortunately such adult titillation also disrupts the progress of a film which required the screw turned of increasing tension and menace and proves a distraction from the growing relationship between Miles and Flora, the children at the centre of the film.<br><br>As rounded dramatic characters, the youngsters have a hard job convincing the audience. Alternating between school children's pranks, nascent sexuality, naïve hero-worship and psychosis, it is difficult to discover an internal consistency in their actions. The gauche imitations by Miles and Flora of Quint's sexual performance, including a 'bondage' session of their own, and Miles' announcement to the shocked interrogation of Mrs Grose afterwards (\"I'll tell you exactly what we have been doing. We have been doing sex!\") are an amusing diversion. And this imitation of the adult affair they have witnessed serves as an ironic parody of their elders,  if it hardly prepares the viewer for their final, violent, actions. Accordingly our interest is reduced, and dramatic curiosity falls readily upon the relationship between Quint and Jessell, rather than the peculiar wards they shepherd. <br><br>Winner clearly thought so too, for his camera dwells too much on those headline adult liaisons for the film's good. This 'false' emphasis (no matter how good sex is for the box office) means that, when the children ultimately take matters into their own hands, events seem rather lame, their motivation too unconvincing and bald. The paramount influence of Quint of course goes some way to explaining the kids' increasingly odd behaviour, notably his announcement, taken on faith, that \"if you love someone, sometimes you really want to kill them.\" But there is a world of difference between his power games with Miss Jessell and the children's attempts to retain them both in their service, as \"the dead have nowhere to go.\" A handful more scenes of the children, talking through their convictions together, would have gone a long way. <br><br>Outside of problems with characterisation, many of the film's faults can be place at the door of Winner. Never the subtlest of directors, he was an odd choice to helm a project of this sort which required emotional tact and physical suggestion. Although the location filming at 'Bly' is effective enough, Winner's weakness for jerky zooms, for exploitation, his stiff direction of actors (only the method-trained Brando seems at ease, even with a faintly ludicrous Irish accent), as well as an over-insistent score, provided by the normally excellent Jerry Fielding, are distracting. Beecham and Hird perhaps saw the film as a stepping-stone to better things and do their best. Fresh from Last Tango In Paris, Brando carries over some of the appetites of Paul, his character in the previous production. The blunt Quint, however, is miles away from the sophisticates who inhabited Bertolucci's classic. <br><br>Perhaps in the hands of a flamboyant Ken Russell, or even a cool Terence Fisher, The Nightcomers would have congealed more into a worthwhile experience. As it is the film remains an uneven oddity: explicitly sexual between consenting adults, and confused and coy when it comes to those far more interesting shadows of psychology.","user":"FilmFlaneur","rank":[30,42]},{"title":"It's The Explanation","rating":7,"date":"6 May 2006","review":"For the inscrutable yet precocious personalities of Miles and Flora evident in the 1961 film 'The Innocents'. As well, the ghosts of that movie are fleshed out nicely in this prequel. Quint is a morally repugnant character, sadistic and controlling, but he's also darkly magnetic as the corrupter of the lovely young governess who submits to (and even embraces) his perverted ideas of sexuality. Together they are fated to become the imprisoned souls that haunt the estate. Together they have inflicted unknowable damage to the psyches of the children.<br><br>Brando is very good in the role of Quint. He gives the character a credibility and powerfulness that one would expect from a personality who will ultimately refuse to leave, even after his bizarre death. Few actors would be convincing enough to portray such a reprehensible protagonist and still be vaguely, mysteriously likable. That Brando can deliver this affect with legitimacy is not surprising, genius that he is. Another who might have been very interesting to watch in this role is Dirk Bogarde.<br><br>The director's visual styling of the film is it's most unfavorable aspect and prevents it from being excellent. In any case, this unusual little entry has always been a tad underrated. I suspect that now that Marlon has passed on an overdue re-assessment is likely.","user":"worldsofdarkblue","rank":[21,29]}]