[{"title":"Dare, you say...","rating":6,"date":"10 February 2009","review":"H.P Lovercraft's short story 'The Unnamable' is brought to the screen in a low-rent looking, small-scale production by first time writer/director Jean-Paul Ouellette. Maybe not as commanding as the likes of 'Re-Animator', 'From Beyond' and even 'Necronomicon', but Ouellette manages to invoke a twisted Gothic monster tale filled with menacing atmosphere and dripping with modest blood and gore. The latter actually surprised me how competently it was achieved, and the demon design is a horrifically creative design. Special effects/make-up artists R. Christopher Biggs and Camille Calvet did an excellent job, and I have healthy resume to back up their professional work.<br><br>Other than being quite graphic and stemming with eerily howling sound effects, the whole supernatural set-up for the story is quite conventionally light (little in the way of exploring the back-history and the climax is quite sudden) with the usual shocks and developments within an secluded rundown house that breathes spookiness. Really the premise's outline seemed more interesting than what Ouellette's execution could make of it, although the 90 minutes do breeze by with compact editing and the creaky roughness gives it some grit. Ouellette's systematic script is dramatically thin and strictly serious, save some dark humorous spots.<br><br>Legend has it that Joshua Winthrop kept in his family's house locked away his demon child that he and his wife were so ashamed about that called it 'the Unnamable'. It trying to keep it hidden, the creature turns on him and brutally murders him. Now in the present, students at the nearby Miskatonic College spend a night in the supposedly haunted house, which there only chance of survival rests on the open-mind of Randolph Carter.<br><br>Mark Kinsey Stephenson installs a brash, self-assured attitude to the Randolph Carter character, even though his screen time is limited it's always felt. While surrounding him are appealing turns by Charles Klausmeyer, Alexandra Durrell and Laura Albert.<br><br>David Bergeaud's racy, unhinged score is a shamble. One second it's nervously ominous then it changes to something playfully cute. Obviously these sudden shifts in the score were to match up to the moods of the characters/situation (from gruesome activities, suspense driven or humorous inclusion), but more often it felt forced upon. Ouellette's tightly staged handling relies on dim lighting with blue filtering to etch out an imposingly forlorn house and surroundings (like the graveyard) thanks to art director Ann Job. The demon is mainly kept hidden with sweeping POV shots, silhouette outlining, and glimpses of legs until we see it in full glory towards the end but what stays with you is constant high-pitch screaming it unleashes.<br><br>Nothing formidable, but acceptable 80s monster gruel.","user":"lost-in-limbo","rank":[17,22]},{"title":"Film well rooted in Lovecraft's story","rating":8,"date":"18 July 1999","review":"Many Lovecraft films stray far from the original Lovecraft story. THE UNNAMEABLE is only seven pages long, but the screenwriters crafted their story very well using the source material for the story.  As for film gore, that is just \"fluff\" for modern horror film fans who seldom notice the underlying themes and concepts of the story.  This is a good attempt to use original Lovecraft material and update to a modern setting without violating the concept of the original story.","user":"CPM25","rank":[15,21]},{"title":"One of my favorites","rating":9,"date":"10 May 2002","review":"One of the really nice late 1980s horror films that told a great story without having a huge budget to work with, The Unnamable is among my favorites in the genre. It came out about the same time as Pumpkinhead and Rawhead Rex. I would put it at the top of that little group.<br><br>I'm not sure why this one isn't rated higher. To me it has everything you need for a cool horror flick: a great creature, some creepy Gothic backdrops and an interesting story. It also has some appealing characters.<br><br>There is also a bit of a tongue-in-cheek feel, similar to The Lost Boys, which came out not long afterward. The hero, Randolph Carter (Mark Kinsey Stephenson) is calm, cool and collected almost to the brink of satire. The director Ouellette has a little fun with us also in a little moving camera sequence in which we think the monster or some other harm is stalking Carter on campus – only to find out it is Howard (Charles Klausmeyer or King) trying to catch up with him.<br><br>My only criticism is that the abandoned house, sealed off for apparently some 200 years (The minister and Dr. Winthrop certainly appeared to be from the 17th or 18th century.), looks like it has only been abandoned for 10 years or so. Of course a frame house left unattended would not even STAND 200 years, but that's beside the point.<br><br>The film has all the trappings most A and B horror fans expect: A cool creature, some blood and gore, and a sex scene. At least in this case the sex scene is somewhat within the context of the plot.<br><br>The acting is solid, with gorgeous Laura Albert and Alexandra Durrell as the coeds, Eben Ham and Blane Wheatley as the campus studs who get more than they bargained for in the old house, and Mark Parra as the cock-sure skeptic. Stephenson is engaging as the laid-back, unruffled brainiac Carter and Klausmeyer is convincing as the over-eager freshman Howard.<br><br>Stephenson does well to bring the hideous Alyda into view gradually, so that her appearance is still a shock when we begin seeing full-frame shots of her. The image of her sidling over to a prone victim is one that has given me shivers for years.<br><br>This is a very good horror flick. I would not even call it a B horror film. Like Pumpkinhead, Rawhead Rex, Fright Night and the Lost Boys, it is one of a string of solid horror films that didn't rely on CGI to scare audiences during the late 1980s and early 1990s.","user":"mlevans","rank":[12,17]}]