[{"title":"One of the better sports-related movies","rating":5,"date":"5 January 2002","review":"This was a much more difficult Joe Jackson story to tell than `Field of Dreams.'<br><br>Sports movies are never easy to do and making one that reaches beyond the bounds of sports fans is especially challenging. While `Eight Men Out' may not quite grab the non-sports enthusiast as well as `Field of Dreams,' `Hoosiers' or `A League of Their Own,' (my own nominations for the three best sports-related movies of all-time), it DOES more than hold its own among the top third of the ever-growing list of baseball movies.<br><br>This is largely because it is not really a  BASEBALL movie. Like the aforementioned films, it is a movie about people who happen to PLAY baseball. Based on the Eliot Asinof novel, the movie is, by and large, historically accurate. It also seems to be fairly even-handed in dishing out guilt. Yes, the players played for skinflint Charles `Old Roman' Comiskey, yes they were easy prey for the gambling element, yes they were lacking in education and common sense  yet they are not portrayed as innocent victims, either.<br><br>I have been a huge David Strathairn fan ever since `Eight Men Out.' His sensitive portrayal of star pitcher Eddie Cicotte was pivotal to the movie's success. Asinof correctly focused on Cicotte as the pivotal figure in the World Series fix. `Eddie's the key!' more than one character exclaimed. Other players, approached with the idea of throwing the series, reacted with shock when finding out the highly-respected Cicotte was involved. This was certainly no easy choice for Cicotte, a man of some integrity and conscience, but a pitcher nearing the end of his salad days and a man bitter at his mistreatment by Comiskey. Strathairn plays the intelligent, stressed character under the gun as well as any actor of his generation.<br><br>The rest of the cast is fine, too, with despicable Chick Gandil (Michael Rooker) and Swede Risberg (Don Harvey) playing the odds and pressuring teammates to go along. James Read is excellent as henpecked southern pitcher Claude `Lefty' Williams, probably the second most respected player on the team.  Of course Buck Weaver (John Cusack) is a huge figure, considering the gamblers' pitch, then opting to pass when the money isn't immediately forthcoming. <br><br>The movie isn't shy about its version of good guys &amp; bad guys. Gandil, Risberg &amp; Swede's buddy Fred McMullin (Perry Lang) are the villains, while Williams, Weaver, Joe Jackson (D.B. Sweeney) and Manager Kid Gleason (John Mahoney) are victims. Hall of Famer Eddie Collins (Bill Irwin) and no-nonsense catcher (and controversial Hall of Famer) Ray Schalk (Gordon Clapp) are frustrated on-lookers, while Dickie Kerr (Jace Alexander) is the wide-eyed &amp; naïve rookie. All turn in fine work and I find myself loving the taciturn Schalk, the kind of catcher every manager wants. Most interesting is the movie's portrayal of Shoeless Joe, who is interpreted as being mildly retarded, rather than just illiterate.<br><br>The baseball scenes are quite realistic, as are the ballpark backdrops. I first saw it the year after visiting Old Comiskey Park (the year before it was torn down) and felt right at home on the movie set  even the turnstiles looked authentic.<br><br>In closing, I can't honestly say that someone with NO knowledge or interest in baseball would flip over this film. Yet, one doesn't have to be a bleacher bum to enjoy it  and not knowing the outcome may actually make it MORE fun for the neophyte! Overall, a fine movie.","user":"mlevans","rank":[41,42]},{"title":"Great Eight","rating":9,"date":"19 January 2005","review":"Although I generally agree with Roger Ebert's reviews, I just can't understand how he was annoyed enough with this movie to give it a measly two stars. He claims that there wasn't enough exposition. I found everything explained satisfactorily, even for the non-fan or baseball history buff. And it is period-piece film-making at its finest. I cannot imagine a better telling of this story. And the baseball action is excellent. One factual error, though: Bucky Weaver (John Cusack) would never mention Babe Ruth as better (or even comparable) to Cobb, Speaker and Wheat in 1919 or 1920. It shocks me that Sayles kept that line. USA Today heralded \"Eight Men Out\" as the greatest baseball movie ever, and though there is some fine company, I find it hard to disagree.","user":"active18yos","rank":[40,45]},{"title":"Interesting Film for all Baseball Fans","rating":8,"date":"13 April 2007","review":"Eight Men Out provides a \"Reader's Digest\" version of the complicated events surrounding the 1919 World Series.<br><br>If you forgive the fact the film has to simplify certain aspects of the conspiracy in order to make the film easier to digest, then you will find that Eight Men Out is a worthy film and in the category of \"baseball movies\" it's one of the best.<br><br>There are anachronisms in the film here and there, the worst of which is Buck Weaver's question asking which of the lawyers was the \"Babe Ruth\" of law. Sure Babe Ruth was coming into his own by 1920, but most ballplayers in that era would not have place Ruth in the class of Cobb, Tris Speaker or Walter Johnson. For baseball fans, this line in particular really comes off as shallow, especially since the rest of the film really tries to capture the \"dead-ball\" era. For the most part though, this film feels and sounds a lot like America right after World War I ends, a fascinating time and place.<br><br>Studs Terkel steals the show in my estimation. His character in the film is not far from whom he is in real life and his authenticity is undeniable. John Sayles is a little stiff by comparison and his singing in the railway car (which according to legend did actually happen), is rather difficult to bear. None the less, his direction makes up for his foibles as an actor.<br><br>Straitharn is another gem in this movie, and once again this actor seems to get right to the soul of the characters he is given to play. Eddie Cicotte's dilemmas are written all over Straitharn's face in every scene, he's also given some of the best dialog in the film. Cusack plays his part well, despite the fact that many of his scenes are reduced to clichés. Cusack's best moments are when he is frustrated about his inclusion in the conspiracy trial, despite the fact he gave his all to try and win the series. His outbursts in the courtroom seem perfect, as if drawn from the trial transcripts themselves.<br><br>Joe Jackson is given unfair treatment. If \"Field of Dreams\" mythologizes Jackson to point of hyperbole, \"Eight Men Out\" plays up his illiteracy with too much of a heavy hand. Joe Jackson wasn't stupid, indeed if you read his last major interview before he died, he speaks about the \"Black Sox\" with great alacrity and clarity. He was not as ignorant as this film would have you believe. One day someone will produce a film about Joe Jackson, that will portray him accurately, but Eight Men Out is not that film.<br><br>Although their roles are very minor, Kid Gleason and Ray Schalk are really well played and written. These two went through a very difficult time during the series, and this is well demonstrated. One minor beef is that Nemo Leibold, Shano Collins and other players outside of the conspiracy are never touched upon at all. This is understandable to a degree given the relatively short length of the film, despite the complexity of the subject matter.<br><br>The baseball scenes themselves are well done. The bats, balls, gloves and uniforms look like the equipment of that era and the ballparks are successful mock ups for the most part. There are even a couple of nifty athletic displays in the outfield that must have taken several takes to pull off.<br><br>Overall, this is my second favorite baseball movie, next to \"Bull Durham\". Its a little light on some of the details of the conspiracy, but it makes up for it in other areas. It has some great music, some great sets, some solid acting and overall seems genuine and fair to all the major players in the conspiracy.<br><br>Eight Men Out isn't perfect, but it isn't as flawed as Roger Ebert would have you believe. If you a fan of baseball in fact, I'd say its mandatory viewing.","user":"snazel","rank":[18,19]}]