[{"title":"Excellent characters, excellent story","rating":7,"date":"12 July 2006","review":"Excellent, riveting story. I watched it on DVD (not having been alive to see the theatrical run) and did not pause once for refreshments or breaks. If a movie can captivate you start to finish, immersing you to the extent that you do not want to break the spell, then it is excellent film-making.<br><br>I believe it is misclassified. Mildred Pierce did not really strike me as Film Noir. That may be because I went into it expecting Film Noir and, while some of the genre elements are present, it really never stayed in that territory. Mildred Pierce is very much a simple character study, almost a biopic. It starts and ends addressing a murder, and Mildred's flashbacks occur while she's at the police station, but that's pretty much the extent of the Film Noir influence.<br><br>Instead the movie focuses on who Mildred is and how she became that way. At the time of the murder she is an accomplished and successful businesswoman. She did not start out that way and the movie traces her life path at a steady and interesting pace.<br><br>Joan Crawford is well, she's Joan Crawford in the title role. The only flaw I can find in the movie is that Joan has difficulty expressing vulnerability. She looks so imperious and so strong that it is sometimes tricky to accept that her character is so downtrodden. One cannot completely excuse Joan for this either as, even when Mildred is a single mom of two daughters, desperately broke, she still wears clothes that look far above her particular station. This was always a signature quirk of Crawford's where she was loathe to appear in public looking anything less than the glamorous movie star and, likewise, did not want to appear unattractive in her movies. Compare this to Bette Davis or more recently Charlize Theron (in \"Monster\"), two actresses who happily \"uglied\" themselves for certain roles.<br><br>That is a rather negative tangent though and I should state that this aspect of Joan's presentation of Mildred was, to me, a minor flaw. Overall she was solid throughout, demonstrating quiet dignity when faced with challenges, unwanted advances and even heartbreak. Her two moments of rage were presented in an authentic contrast. So, Crawford delighted this viewer and I cannot imagine anyone else in the role.<br><br>The supporting cast was excellent as well. Jack Carson (one of my favorite character actors) shined as the wolfish friend who really treated her better than either husband. Zachary Scott was so authentic as the lazy, formerly rich hanger-on both in acting and appearance that he was almost a caricature. Eve Arden's role was smaller but it contained plenty of her famous sarcastic wit. Bruce Bennett was the weak link in the cast but, to his defense, his character of Bert didn't really have much to do other than be a catalyst for Mildred's success in the early part, and then a mildly sympathetic shoulder in the later.<br><br>The best performance possibly goes to Ann Blyth as the hateful daughter Veda. Blyth played Veda as porcelain, untouchable and wholly uncompassionate. Veda barely bothered to hide her contempt from her love-blind mother and feigned sadness or remorse when the situation demanded it. She was unapologetic to the end. A fascinating portrayal.<br><br>Highly recommended if you have an opportunity to see it. Like a novel, the movie is best viewed in an otherwise quiet, dark environment so that it can be afforded full focus.","user":"CMUltra","rank":[35,37]},{"title":"Joan Crawford's Signature Role","rating":8,"date":"2 October 2007","review":"With those broad shoulders, those wall-to-wall eyebrows, that steely look on her face, and wrapped in those expensive clothes, the inimitable Joan Crawford exudes glamour and resolve as famed Mildred Pierce, housewife turned businesswoman, in this Michael Curtiz-directed film, part mystery, part melodrama.<br><br>The film's story, told in flashbacks, begins with mystery, and it is helped along by terrific B&amp;W lighting. Most of the rest of the story is sheer melodrama, with talky dialogue that erupts from confrontations between various characters. The most important confrontations occur between Mildred and her ungrateful, scheming daughter Veda, who requires tons of money to be happy. As the story moves along, Mildred buys and successfully operates a restaurant, but it's not enough to win approval from her odious daughter. Mildred's love for Veda is deep. But Mildred, we learn, is also a take-charge woman who won't take any guff from anyone, at least from caddy suitors or prospective in-laws.<br><br>It's a great story. And in addition to the topnotch cinematography, the film has great production design, costumes, and editing. We're also treated to some pleasantly nostalgic music from the 1940s. Crawford gets good support performances from Ann Blyth, Eve Arden, and Jack Carson. I also liked Butterfly McQueen, the little lady with the high-pitched voice who plays Mildred's maid.<br><br>I suspect this film would have been worthy of praise, even with someone else playing the title character; the film is that good. But no other actress would have had the stage presence of the impressive Joan Crawford. It's mostly because of her that \"Mildred Pierce\" will be remembered and loved, for generations to come. It's also partly because of \"Mildred Pierce\" that Joan Crawford will be admired as a Hollywood legend, for generations to come.","user":"Lechuguilla","rank":[36,39]},{"title":"Film Noir Classic","rating":21,"date":"21 August 2002","review":"Joan Crawford won the Academy Award for Best Actress for her portrayal of the title character in this 1945 offering by Warner Brothers. Ms. Crawford was in her prime then and members of my generation, who remember her in films such as 1968's Berserk and 1970's Trog, are sometimes surprised to learn how attractive and talented she was in her heyday. \tThe mean-spirited commentary of her life which we have been subjected to since her death in 1977 notwithstanding, still there was a certain hard edge to her personality which shown through in her screen roles. That she was able to win filmdom's greatest prize by playing a willing victim and vulnerable woman is perhaps the greatest tribute to her abilities as an artist. At any rate, she was the star of this film noir classic, a story that holds up well after 57 years. \tMildred Pierce was an ordinary housewife of the era. No skills, relied on her husband for sustenance and leadership and was crushed when he ditched her for another woman. Her daughters were her whole life, doting unhealthily on Veda, the older one, especially (a very young Ann Blyth, herself nominated for Best Supporting Actress for this film). But, Veda was a schemer, conniver and social climber from the word go and it was ultimately her actions which brought an interesting human interest story to a thunderous climax. The story fascinates as we see Crawford, through iron will and determination, become an independent, successful business woman even as she makes tragic error after tragic error in her personal life. \tMildred Pierce really is a rare animal, as it truly is more of a human interest story than any other in the film noir genre. The cast is great: Jack Carson, outstanding as Mildred's lifelong friend and would-be suitor, Bruce Bennett as Mildred's nice but weak-willed husband, Zachary Scott as the caddish successor to Bruce Bennett for Mildred's affections, and Eve Arden (still another nomination for Best Supporting Actress) in one of her trademark roles as a no nonsense gal pal. In Mildred Pierce, we have murder, love, misguided love, love not reciprocated, jealousy, misunderstanding, and good intentions/bad results. Could it be this film is so intriguing because we see in our own lives one or more of these very human conditions?","user":"Tommy-5","rank":[50,58]}]