[{"title":"Pure Western Delight","rating":9,"date":"13 January 1999","review":"Surely one of the purest westerns ever made, a simple tale of a lawman tracking down an outlaw. This film is raised way above the norm in almost all respects: The photography is superb, with the hills, mountains, valleys and forests being the real stars; the acting is first rate, with not a weak performance in sight from even the lowliest minor character; the direction is well paced as we ride along with the 3-person-posse through the landscape and experience the minor twists of the actual hunt, as well as the evolution of the relationships between the group. The episode in which they take over a cabin by a stream and then ambush the following villains is even better than the well known finale.<br><br>Why this film hasn't had more votes and a higher rating in imdb is a complete mystery to me. I'm English, and I always thought the Americans really loved their westerns and John Wayne in particular. Can anyone explain please?","user":"Darren-12","rank":[100,126]},{"title":"Beware The One-Eyed Duke","rating":8,"date":"8 May 2006","review":"\"Come see a fat old man sometime!\"<br><br>John Wayne's parting comment in this film is directed as much at us the viewers as it is at the young woman his Rooster Cogburn character is addressing. In a way, Wayne throughout the film plays off the image he cemented in dozens of great and near-great westerns, with a nod that by 1969, he along with the western genre had fallen behind the times, that his shoot-first approach to law and order had worn thin with the critical establishment just as it does in Judge Parker's courtroom.<br><br>In that way, playing a character of such dogged homicidal cussedness as the hard-drinking, one-eyed ex-Quantrill Raider Rooster Cogburn and giving him a teenaged girl seeking justice to play off so as to showcase his essential decency seems a clever means to win Wayne an Oscar, which he finally did here, a sentimental triumph over some more heralded performances. With such an attitude, you might think \"True Grit\" would come off a bit of a one-trick pony 37 years on. But it doesn't. In many ways, both the film and Wayne's performance come off better than ever.<br><br>Helping matters a lot is the support Wayne receives from two women. As the heroine, Matty Ross, Kim Darby provides Wayne with a fantastic foil, doughty to the point of rudeness, forever finding fault in others but earning your good will through her simple faith in justice and loyalty to the memory of her slain father, for whom she wants Rooster's help avenging. As she is told by a horse dealer she banters with: \"I admire your sand.\"<br><br>The other is Marguerite Roberts, whose adaptation of Charles Portis' novel bristles with good humor and an ear for the period. \"If ever I meet one of you Texas waddies who ain't drunk water from a hoofprint, I think I'll... I'll shake their hand or buy 'em a Daniel Webster cee-gar,\" Rooster tells his braggart riding companion, a young Texas Ranger played by country singer and ex-Beach Boy Glen Campbell.<br><br>Campbell may be a novice and a third wheel in the interplay between Wayne and Darby, but he acquits himself well and delivers a worthy performance in a cast stacked with talented actors like Robert Duvall, Jeremy Slate, and Strother Martin, not to mention Dennis Hopper, hiding the long hair he made famous in \"Easy Rider\" that same year. Some of these actors portray bad guys, but Roberts' script and director Henry Hathaway's languid pacing allow them to present some humanizing qualities that go a long way toward making \"True Grit\" more than your typical shoot-em-up oater.<br><br>Even Jeff Corey, who plays a no-account named Chaney who shot Matty's father, has a funny scene when he tells Matty how to cock her pistol, then whines after she shoots him with it: \"Everything happens to me!\"<br><br>About the only fault I can find with the film is Elmer Bernstein's bombastic score, which employs overly ornate orchestration like kettledrums when Matty has her showdown with Chaney and is tuneless apart from the title song, which is Campbell's best moment here. Hathaway's direction is somewhat pedestrian but serves the script, and showcases some incredible autumnal vistas of tall birch and pine where Rooster and Matty search for Chaney, photographed by Lucien Ballard in a style akin to (but more dreamy than) his work on the same year's \"The Wild Bunch.\"<br><br>1969 was the last great year for westerns, with this, \"The Wild Bunch,\" \"Butch Cassidy And The Sundance Kid,\" \"Support Your Local Sheriff\" and \"Once Upon A Time In the West,\" and its interesting how Ballard, Corey, and Strother Martin turned up in more than one of them. But good westerns never really go out of style, they just sit on the shelf awhile like an old Stetson waiting to be rediscovered. Nobody wore a Stetson better, or deserved an Oscar more, than John Wayne. \"True Grit\" does the double duty of showing why he was a star and further burnishing his luster.","user":"slokes","rank":[96,125]},{"title":"A Western adventure on its own account...","rating":7,"date":"3 June 2005","review":"Henry Hathaway's \"True Grit\" can stand up very well as Western adventure on its own accountthe story of a young girl (Kim Darby) coolly hiring an old lawman (John Wayne) to seek out the murderer (Jeff Corey) of her father Texas Ranger Glen Campbell rides along in the hope of collecting reward money <br><br>Suspense, actionthe film has more than its shareand the practiced hand of Hathaway sees that justice is done in these terms But when this has faded, when perhaps even the engaging and forceful Kim Darby has extent in time, Wayne's portrait of that fat, mean, greedy, eye-patched, Whisky drinking and yet in some strange way lovable lawman will remain It will remain as a fine comedy performance, not as self-parody of his many Western roles, as has been rather ungraciously suggested...<br><br>Marshal Rooster Cogburn is a kind of a tough U.S. Marshal with a cutting edge Without any doubt the West knew characters like him... John Ford would know exactly what Wayne was about in this role <br><br>When he says in the declining moments of this picture: 'Come and see a fat old man some time,' that's a standing invitation Audiences will want a peek at this portrait for some considerable time to come","user":"Nazi_Fighter_David","rank":[27,32]}]