[{"title":"The Adventure Continues...or so we thought!","rating":24,"date":"24 March 2004","review":"This film can be summed up in two words. Superman Trouble. That is the case. There are two versions of the film \"Superman II.\" One is the vision of acclaimed director Richard Donner, full of color flourishes, and camera work by the late Geoffrey Unsworth. The second, is the vision put on director Richard Lester, by choice of the film's producers, Alexander and Ilya Salkind. Both the films contain the same story and characters, but each was shot with a different tone, different dialogue and footage, which clash with intention. So in the end, footage from each are woven into one movie which film buffs all over the world will notice is somewhat difficult to grasp. Due to the different directing styles of each director, the final cut of Superman II ends up being a cliche work of special effects, mismatched character analysis, and central themes. The film deals with Superman and Lois falling in love, and the three super villains from the prologue of the first film landing on earth and ultimately trying to take over. Very intense stuff. But this is where we as an audience need to know all the facts, and here they are: The first version of Superman II, known as \"Superman II: The Adventure Continues\" was directed by Richard Donner and supposed to be straight forward with serious tones and action packed sequences. This version was shot simultaneously with the original \"Superman\" in 1977-78. Originally to be released back to back with the original, \"Superman II\" was filmed with vigorous explosions, dangerous situations, and tense, irrefutable drama. In the opening, a female liberation symbol, Lois Lane, tries to prove that Clark Kent is Superman by throwing herself out a window, knowing that Clark(Superman) will fly out and save her. In another scene, Superman gives up his powers and nearly kills himself, only to get them back later on, nearly killing himself again. This nailbittingly tense script brought back old characters and was to bring the original \"Superman\" to a full closure. All actors are fully concentrated and the print is a paragon. 80&amp; of this film was finished when the producers fired director Donner due to some arguments that are still unknown to this day, and replaced him with director Richard Lester, and thusly, \"Superman II: The Adventure Continues\" was culminated. This is where the Richard Lester vision of the film comes into place. Simply titles \"Superman II\", the Richard Lester version is full of clumsy comedy, amateur plotting, and is nowhere near as affective as the Donner version. Lester is a comic director, whom had worked on the previous Beatles films, \"Help\" and \"Hard Days Night\" and had no experience directing any international blockbusters. To give him more credit than Richard Donner, the producers rewrote most of the footage that Donner shot and went in with the actors for re-shoots...even though Donner had already taken care of this! The villains are portrayed here as careless and comic, whereas in Donner's version they were cold as steel, and not to be messed with. In one re-shot scene, we see three villains who are Superman's foes land on earth and take interest in a snake. The snake bites the female villain and instead of showing her wrath on nature, as was seen in Donner's moon scene which she kills an innocent astronaut in cold blood, she sets the reptile on fire and giggles about it! Central themes of love and home were lost because of this as well. Because of budget problems and deadline, the producers could not finish the re-shoot and \"Superman II\", and had to fill the gaps with Donner footage from the vault, making \"Superman II\" confusing and abstruce, and that is what made \"Superman II\" an atavistic failure. 70% of the film is clumsy, contrived comedy and useless violence, while 30% of the film is straight forward, full of munificent morals and such. The final cut has one scene showing the villains breaking into the white house and consequently taking over the world, with sheer John Williams music, the next scene you see them bored and incoherently complaining about being on a world where \"mankind doesn't even resist.\" The first film \"Superman\" had morals of justice, and the American way, while the second film was supposed to show morals of love and home, and earthly pleasures that remind people of the good in the world-in a sense, taking along with the \"truth, justice, and the American way.\" This message was lost between the footage by raconteur Donner and comic Lester. Nonetheless, the film was a box office success, and many critics, including the late Pauline Kael and Roger Ebert praised the film for it's portrayal of good versus evil in the modern day society. Some of the footage shot by Donner that was not put into the final cut of the film has since been seen on network television showings and bootlegs, but not all of it. The original opening which gave the film a better sense of dangerous excitement, scenes involving Kal-El and his father were scrapped(Due to the Marlon Brando court case) and the full original ending have all been locked away in London vaults and never before seen by anyone. So on the all in all level, \"Superman II\" fails because it is nothing more than two films put together, one a comedy, one an action drama, and this keeps \"Superman II' from being anything close to what the original has become.","user":"TruPretender","rank":[130,179]},{"title":"Best Of The Superman Series","rating":8,"date":"31 October 2005","review":"This is the best of the Superman movies because of the three villains, played by Terrence Stamp, Sarah Douglas and Jack O'Halloran.<br><br>Those three are so good, particularly Stamp, that they make this easily the most memorable of the four films. The scenes with them on the moon, their first encounter on earth and their climactic fight against Superman in the skies above Metropolis are all outstanding.<br><br>Once again, Superman goes a little overboard in his romance to Lois Lane (do you believe some reviewers are upset there weren't explicit sex scenes in the film?) Hey, folks, it's just a comic book and it's supposed to be innocent, clean fun. Sorry that turns you off. For the rest of us, this is generally very enjoyable film from start to finish, with no real lulls.","user":"ccthemovieman-1","rank":[74,99]},{"title":"Superman's only worthy sequel","rating":9,"date":"23 June 2003","review":"For those who are into the comic book movie craze today, this one is one of the best comic-y movies from the beginning of the summer blockbuster heyday. The original Superman is really an excellent film with solid, honest direction by Richard Donner. Donner shot around half of this sequel and his scenes are all excellent (Note: Every Gene Hackman scene was shot by Donner - Hackman refused to return to production after Donner was fired).<br><br>There is still much hope that Donner's footage will re-surface. Most importantly of all there are vital scenes with Marlon Brando returning as Superman's father, Jor-El and giving his \"life\" to save his son and save the planet from the evil villains he vanquished from Krypton. It would also be interesting for audiences to see the difference between Donner's scenes and the ones re-shot by Lester.<br><br>The characters are great. Superman, played by Christopher Reeve, is in solid form and he and Lois are given the opportunity to enhance their relationship from the original story. Jackie Cooper is once again great as Perry White, the chief editor of the Daily Planet.<br><br>What makes this movie move is the villains. Gene Hackman is funnier and still up to no good and the villains from Krypton are menacing. His dialogue is truly witty and Hackman's timing is perfect. Terence Stamp is the power hungry General Zod, out for revenge against the son of Jor-El. Stamp plays it straight and his scenes directed by Donner show a true megalomaniac. Jack O'Halloran is solid as the hulking Non.<br><br>Best of all is Sarah Douglas as the cold and evil Ursa in a truly underrated performance. She is the most curious and most interesting of the bunch. She collects badges as trophies for her conquering of earth, wearing them to mock male hierarchy. Ursa seems to be a forerunner of all of the sexy female superwomen today, but her role is not overstated and stale. She is not given gratuitous cleavage shots or anything of the sort. Ursa is a beautiful vamp and a tease, and if anything we wish she would have more screen time. Sarah Douglas constantly gives us hints as to Ursa's wishes, and we can only try to surmise what evil plans she is up to.<br><br>The music is John Williams' score from the first film, but used differently. Not sure if much of the music is original. Ken Thorne does a good job here of accenting cuts with Williams' original score (Williams too refused to return after Donner was fired.) Some great cues are Superman returning to fight the villains, which is wonderfully heroic; Ursa's shocking appearance to both the astronauts on the moon (a violent scene that uses the darkest motifs from Krypton in the first film); and the whole Metropolis battle in the end, which is well supported by the music.<br><br>The effects are very good for 1980. I keep reading how people are unhappy and always apologize for the FX in any movie more than a couple of years old. This one is solid and for the film it serves, does well. The only major goof is when Superman delivers the American Flag at the end - The water fountain in front of the White House is clearly a model with \"frozen\" bursting water! The scene in the de-powering chamber is not well-handled either.<br><br>Overall, this is a very entertaining film, and really amazingly considering it is obviously the work of two directors. Of all the comic book movies made from the 60s thru the 90s, this one definitely rates in the top five along with the first Superman, the first two Batmans. Supermans 3 and 4 were really poor. It is too bad that Christopher Reeve did not make more good Superman films. This one has some camp, but it's way too entertaining and it's the only sequel to still have the flavor of the original. And please, let's see a special edition DVD with all of the missing Richard Donner footage!!!!!","user":"the_mysteriousx","rank":[45,58]}]