[{"title":"Bud&Lou Go a Feudin'","rating":6,"date":"6 May 2006","review":"The feud is on between the Wingfields and the McCoys when Bud Abbott discovers his clients, hopeless magician Lou Costello and the Park Avenue hillbilly Dorothy Shay are both McCoys and Costello's inherited concertina holds the secret to a treasure of hidden gold. So off they go to the Appalachins where Costello's arrival sets off the feud that had pretty much died down.<br><br>Bud and Lou get themselves a good supporting cast with a group of players used to rustic roles. I'm wondering how the folks at Universal missed getting Judy Canova and Marjorie Main and Percy Kilbride in this film. Lou's best scene involves him haggling with a hag played by Margaret Hamilton in her wicked witch makeup over some love potion with each making a voodoo doll of the other to poke holes in.<br><br>Dorothy Shay was just about at the end of her peak of popularity which started post World War II. She was a singer with a warm contralto who decided to play up her southern roots. Dorothy made a whole lot of hillbilly ditties popular back in those days and her big hit song, Feudin' a Fussin' and a Fightin' was still selling good in 1951 when Comin' Round the Mountain came out. I have it and also a vinyl record of a Bing Crosby radio show where she sang that song as a trio number with herself, Bing, and Groucho Marx. She did what very few did in Abbott and Costello pictures, hold her own with the boys and not get lost in the supporting cast.<br><br>It's not the best of their films, but still enjoyable and just wait till you see the treasure that they do find.","user":"bkoganbing","rank":[10,10]},{"title":"Wacky Abbott & Costello comedy spoof of backwoods feuds.","rating":6,"date":"28 September 2001","review":"The Hatfield/McCoy feud is legendary in history, and films have either spoofed it or filmed it seriously.  There was the Wheeler and Woolsey comedy \"Kentucky Kernels\" in 1934, and then the Rod Steiger/Lee Marvin film of 1974.  In between was this Abbott and Costello comedy which is not as well known as some of their other vehicles, but is definately worth a look.<br><br>The opening of the film shows Lou as an untalented magician trying (rather unsuccessully) to do a Houdini routine.  With his manager Bud,<br><br>Lou meets a distant cousin (singer Dorothy Shay) who recognizes Lou's yell as a hereditary trait of the McCoy clan.  Taking Bud and Lou into the backwoods (presumably Kentucky or nearby), the trio encounters their family (lead by character actress Ida Moore).  The McCoys have been feuding for years with the local Winfield family.  Granny Moore wants Lou to marry Shay, who already has a beau (Kirby Grant).  Bud and Lou then go to visit a local mountain witch (Margaret Hamilton, the witch from \"The Wizard of Oz\") who gives them a love potion after a hysterical sequence where Costello and Hamilton make clay voodoo dolls of each other, and continuously poke them with pins.  Hamilton, made up to look more like a hag than a witch, is hysterical in her five minutes on screen.  She shrieks and laughs, giving no doubt that underneath that ugly makeup is the wicked witch of the west. This leads to a hysterical conclusion where the potion ends up in all the wrong glasses.<br><br>\"Comin' Round the Mountain\" came towards the end of the team's successful years; they were slowly being replaced by the younger Dean Martin and Jerry Lewis, but were still giving it their all.  There are few of the plot-diverting routines of their earlier films, making this faster moving and more entertaining than some of their other films.  As usual (with the exception of Hamilton and Ida Moore), the supporting cast is upstaged by the boys.  Dorothy Shay isn't all bad, but lacks the screen presence of some of the female comics they worked with in their earlier films.<br><br>Available on video (but one I have not found easily for rent), \"Comin' Round the Mountain\" may be pure corn, but its a great time filler for a Saturday or Sunday afternoon.","user":"mark.waltz","rank":[9,9]},{"title":"A Few Highlights Here, just not enough for the Boys","rating":6,"date":"6 March 2005","review":"There is too little of prime Abbott &amp; Costello in this but there is some crackling dialog when they arrive in Kentucky and Abbott says to Costello \"Smell that Kentucky Bluegrass..\" Costellos retort to this is by far the best dialog in the film.<br><br>The section with Margaret Hamilton is corny but well done. While not their best work, these highlights make it worth viewing. It does not sink as far as Africa Screams, &amp; the music in it is almost as obtrusive as some of their early military comedies. At least Costello clowns around with some corny instruments in some of the jug-band sequences. <br><br>I do think it is far from their worst film. If the plot was more centered on the family feud &amp; less on insane romances, it would work a lot better.","user":"DKosty123","rank":[7,8]}]