[{"title":"A Hard Western Look","rating":9,"date":"20 April 2018","review":"I knew I had seen it, I had a black and white James Wong Howe Cinemascope memory and Paul Newman's body language. How he walks, how he stands. I remember thinking that Jake Gyllenhaal had borrowed that physicality for his character in \"Brokeback Mountain\" and I just realized that Larry McMurtry is the author of both \"Brokeback Mountain\" and \"Hud\". He provides us with a look into the modern cowboy that is not only unique but mesmerizing. Paul Newman's Hud is a cad and yet you feel we sense that behind the bravado hides a desperate man looking for something. Something personal and unspoken. Hud is one of my favorite Newman performances. Soulless and yet needy. Is it a coincidence that the only woman that\"got away\" from Hud is named Alma? - Alma in Spanish means soul - Alma is played by Patricia Neal with power and humanity and she won the Oscar for it. Melvyn Douglas also won the Oscar for his superb performance and Brandon de Wilde deserved one of his own. He is extraordinary. Hud has become an important film in my life and in future viewings in years to come I may discover why.","user":"terencebells","rank":[51,56]},{"title":"The film that crashed Newman into the top echelon..","rating":9,"date":"10 September 2002","review":"The title character, a cattleman in contemporary Texas, is the quintessence of Newman's amoral, opportunistic loners: he's arrogant, seething with ambition, incapable of much warmth or affection He quarrels, drinks heavily, takes women with crude assurance (\"The only question I ever ask any woman is 'What time is your husband coming home?' \"), and doesn't give a damn about anyone except himself <br><br>Newman brings his familiar characteristics to perfection: the cynical, cold in manner; the nasty, contemptuous voice; the sly, insinuating smile He's a model of casual defiance and detachment, as he drinks a pint of bourbon or stands insolently, hands on hips, hat down low over his forehead, or roars through the dusty town in his convertible Cadillac, making business deals or picking up loose women...<br><br>Hud resembles Ben Quick, which isn't surprising, since director Martin Ritt and writers Irving Ravetch and Harriet Frank Jr. also did \"The Long, Hot Summer.\" Like Quick, he is considerably sexy and charming, which attracts women and drinking buddies He's the best example of Newman's idea of the glamorous, captivating, virile, but essentially rotten men we mistakenly admire; according to Newman, the film is meant to expose his underlying corruption <br><br>The drama revolves around the discovery of Hud's amorality by Lon (Brandon de Wilde), his seventeen-year-o1d nephew Lon admires his uncle, but is ultimately torn between Hud's hedonism and the high moral principles of Hud's father, aging Homer Bannon (Melvyn Douglas).<br><br>When Homer's cattle become diseased, Hud wants to sell them quickly, but Homer refuses to spread an epidemic, and has them destroyed Hud really becomes despicable as he tries to have his father certified incompetent, so that he can take over the ranch Like Chance Wayne (\"Sweet Bird of Youth\"), he's afraid of ending up in poverty: \"You don't look out for yourself, the only helping hand you'll ever get is when they lower the box.\"<br><br>Whereas Quick turned out to be a good guy after all, and Fast Eddie and Chance matured through pain and punishment, Hud is untouched and unregenerate to the very end Refusing to accept his guilt, he says he's only as corrupt as everyone else; before he goes into the house, he angrily yells, \"The world's so full of crap a man's going to get into it sooner or later, whether he's careful or not. \" <br><br>Many people considered Hud a hero But this is natural, since the film is actually filled with compromises For instance, Homer, the representative of goodness, is self-righteous, inflexible, full of solemn, pious platitudes, and generally unappealing, while Hud is vital, life-affirming and humorous Furthermore, Homer's contempt for Hud, which he justifies by Hud's having never given a damn, seems unfair Apparently he soured on Hud when the latter was in his teens, and thus the boy was denied love when he most needed it This again brings up the father-son alienation theme, and it makes us sympathetic toward Hud<br><br>Even in his relations with others, Hud is not entirely despicable He displays some tenderness toward Lon, especially in the scene in which they get drunk together There's a touching moment as Hud says, somewhat sadly, \"Get all the good you can out of seventeen, because it sure wears out in one hell of a hurry.\" In his cynical conversations with Alma, he has Quick's insolent sexual confidence, but Alma is experienced, earthy and just as cynical, and she even seems to encourage his sly innuendos, making it a match of equals rather than a one-sided sexual pursuit<br><br>Finally, how does an actor play a man whose overpowering charm attracts people, without attracting the audience as well? Of course this is a problem inherent in all of Newman's sexy villains, but at least with Quick and Eddie the charming traits prepare us for their reformations, while with Hud they work against the concept of his worthlessness At this stage in his career, Newman was so appealing that it was hard to consider him as completely rotten<br><br>\"Hud\" was nominated for seven Oscars Awards went to Neal, Douglas and cinematographer James Wong Howe Newman, up for his third Oscar, said, \"I'd like to see Sidney Poitier get it. I'd be proud to win it for a role I really had to reach for.\" He got his wish: Poitier (\"Lilies of the Field\") won In any case, \"Hud\" found Newman near the top of his form, and it was a culmination of the \"seed of corruption\" theme To be sure, subsequent characters would be corrupt, and would coldly reject the world, but never as a result of such intense ambition","user":"Nazi_Fighter_David","rank":[66,78]},{"title":"Great American prose poem","rating":10,"date":"13 September 2002","review":"One Hell of a movie, and very nearly perfect. Paul Newman, Melvyn Douglas, and Brandon De Wilde star as three generations of a ranching family. Douglas is the patriarch, stern and strong, but clearly moving ever closer to the end of his life. Paul Newman, who plays the title character, is his youngest and only surviving son. There is an obvious but unspoken conflict between the two of them. In the middle is Brandon De Wilde, actually the film's main character (although all the choice acting moments belong to Douglas and Newman, and the yet to be mentioned Patricia Neal). His father, Newman's brother, died when he was very young. Growing up in Douglas' shadow, he worships the man and tries to emulate his moral code. However, his wilder side sees the untamed Newman as a sort of folk hero, and the rare times when he gets to hang out with his uncle seem to him to be the best of his life. Patricia Neal plays their maid (brilliantly, I should immediately state), after whom both uncle and nephew lust. A different conflict arises from this. As Hud, Paul Newman has many chances to be a second James Dean, exploding with emotion. Those scenes are excellent, of course, but where Hud succeeds most is at the edges of the screen. It is an enormously subtle film. The filmmakers should especially be commended for their amazing use of musical score. There is a really beautiful score, but it is never used, not once, to steer the audience's emotions. A good 90% of the film has no music in the background. Hud is an American masterpiece. 10/10.","user":"zetes","rank":[63,76]}]