[{"title":"A Perfect Saturday Morning Western","rating":8,"date":"23 January 2005","review":"This is the most enjoyable \"B\" Western I'd seen in quite awhile. It is fast-paced, mostly light-hearted yet doesn't stint on the serious implications of the dramatic sequences; it makes you feel and believe the human tragedies that would occur if town boss Bender (Ward Bond, marvelously effective and subtle as smooth-talking and thoughtful villain) were to be successful at bankrupting his fellow townspeople, paving the future railroad towns with the rubes' broken dreams. John Wayne was starting to solidify the nucleus of the stock company of supporting actors he would make many movies with in the future (on hand besides Bond are Paul Fix, Walter Brennan, Grant Withers, Olin Howard, Bruce Cabot, and Mike Mazurki.<br><br>Wayne is perfectly cast as the rough-and-tumble gambler who falls for railroad heiress Vera Rhuba Ralston, much to father Hugo Haas' chagrin who is a rather slick and powerful operator himself. The twist here is that Ralston is as cunning and devious as her Dad and new husband combined, and is continually effective in steering things in the direction she wants them to flow. Not normally a Ralston fan, I thought she played the role with flair, attractiveness, and a perfect energy level. She doesn't have the on-screen chemistry with Wayne that Maureen O'Hara or Gail Russell later did, but when your husband owns the studio, you don't want to allow the chemistry to get too real-looking. Ona Munson as \"Jersey\" is hotter and makes both her scenes memorable. Walter Brennan is perfectly cast as a persnickety riverboat captain, and Nick Stewart provides able comic assistance as his blunt first mate(Racially stereotyped, of course, but still very funny, and not at all demeaning if you look at it objectively). Bond and Mazurki are excellent as the deceptive villains. Fix and Withers are professional and provide subtle special touches as Bond's hired guns.<br><br>Given the budget and the generally pedestrian record of Director Kane, this is actually a surprisingly well made. My demands/expectations of this oater were small when I tuned it in on the Encore Western channel. I was looking for a fast-paced, check-your-brains-at-the-door oater to have on in the background as I picked up around the apartment. Instead, not only is it tautly directed, fast-paced, wry, and well-acted, but it has an extremely well-crafted adapted screenplay from Carl (\"High Noon\") Foreman. The insights conveyed by the script, even including some of the background and \"throwaway\" lines, are literate and register long after the lines have passed.<br><br>Overall, this movie can be recommended on many levels. Deapite it's quite modest roots, it is a durable, high-spirited, well-acted, and well-directed oater that also is exceptionally well-written. Not the type of title that will impress your art-house buddies, unless they accept your challenge and actually watch it before they write it off. Those actually watch it are in for special treats.","user":"herb_at_qedi","rank":[16,19]},{"title":"Enjoyable old western","rating":7,"date":"14 January 2018","review":"I thoroughly enjoyed this early movie with John Wayne. He was very good in his part I thought. He was truly becoming the guy most Americans Identify with.\nI read elsewhere that movies Vera Ralston appeared in did not make money. I'm not sure why unless Americans just had a hard time with her accent. She was lovely, acted her part well, even added a good degree of humor from time to time. This movie was released on Christmas day 1945. I wonder if folks were so happy to have the war over and short of cash that they passed on the movie for those two reasons. John was well liked by then so he should have been a box office draw,0 and Vera was not well known such that she would be a deterrent.<br><br>Anyway, I liked it. Hope you do too.<br><br>I found it on Youtube. It had two or three short commercials, just a bit distracting not too bad.","user":"headhunter46","rank":[5,5]},{"title":"Effective black and white settler western with John Wayne","rating":6,"date":"25 March 2017","review":"DAKOTA is a surprisingly decent John Wayne western, well-shot in 1945 and featuring the famous actor playing a small-time gambler who elopes with his love to the West, only to discover that his intended homestead is controlled by a pair of criminals who are up to all kinds of no good in order to keep an iron grip on the land. Conflict ensues.<br><br>Despite some indifferent reviews, I thought this film told its story very effectively and with a maximum of intrigue and excitement. Wayne gives a fine fine and assured performance as the smooth hero and Vera Ralston matches him as a love interest you can get behind. Ward Bond and Mike Mazurki make an imposing couple of villains and the rest of the cast is full of familiar faces and/or larger than life characters. There's not really a wealth of action here, but that which does occur is great fun; the hold up on the river boat and the climactic shoot-out are the highlights.","user":"Leofwine_draca","rank":[3,3]}]