[{"title":"A neglected treasure","rating":9,"date":"3 May 2006","review":"This is a wonderful story of love, ambition and sacrifice among the buskers (street performers) of London. Everybody's good, but Laughton and Leigh will stay in your mind and your heart long after you've seen this great film. <br><br>Laughton's performance should be studied by every acting student. He gives us a Charlie Staggers who is funny, resourceful, honest and pathetic and with a great capacity to love and do right by others. He is a simple and good man with a deep soul, and his audition in the theatre at the climax of the picture is both sad and uplifting.<br><br>Viven Leigh demonstrates a great talent and the characteristics that made her so successful the following year as Scarlett O'Hara in \"Gone With the Wind.\" In this film she begins as a self righteous and petty thief and by the end she has grown to become a highly successful but humbled actress. Leigh carries this change superbly and makes it completely believable. By any measure it is a great performance.<br><br>\"Sidewalks of London\" is also very well written, directed and edited. I rank this as one of the best English language films of the 1930s.","user":"Silents","rank":[30,32]},{"title":"Forgotten Classic","rating":10,"date":"22 September 1999","review":"I cannot praise this film enough. ST. MARTIN'S LANE captures the feeling and mood of the time so well. The performances are outstanding. In one film you have 3 of the centurie's greatest actors  Rex Harrison, Vivian Leigh, and Charles Laughton.<br><br>Vivian Leigh was never more fetching,gutsy or charming.not even in Gone with the wind or waterloo bridge. Harrison make the most of his typical leading man role and Laughton evokes such sympathy. it is his finest performance as well. my onlt question is why has this gem been almost forgotten? I was lucky enough to catch it on television about 8 years ago. it is only now being released on video.My advice...purchase this film,you need it in your personal collection !","user":"peacham","rank":[23,25]},{"title":"A treat for film coinnesseurs","rating":9,"date":"27 November 1999","review":"This is a rare treat for coinnesseurs, a film where three of the greatest actors of Hollywood, Rex Harrison, Charles Laughton, and Vivien Leigh, strut their considerable stuff! They were all still relatively young in 1938, but already you can see the promise of great things to come, for the three, especially Laughton, who was already one of the world's finest actors.<br><br>In many ways the story resembles Harrison's later role as Professor Higgins in \"My Fair Lady\"(1964). Laughton and Leigh play buskers in the street, and Harrison plays a toff who gives Leigh a chance at stardom. Laughton plays quite a similar role to his later \"Hunchback of Notre Dame\" (1939) who falls in love with the girl but recognises he is too ugly for her, and eventually contents himself with her kindness towards him. You can see Laughton's superb acting skills, when she kisses him, and his eyes shine with satisfaction and pride, as they wave goodbye to each other. It is truly a precious moment in films, a moment to savour.<br><br>The following year saw the release of Leigh's \"Gone With The Wind\" and of course \"The Wizard of Oz\", two of the greatest films ever made, so minor films like this tended to be forgotten quickly. It's worth taking another look, though, at this film, which deserves far more recognition than it got.","user":"Eva Ionesco","rank":[26,29]}]