[{"title":"Haunting Vivien, Murky Film","rating":10,"date":"3 November 2003","review":"Vivien Leigh is even better in this film than she was in GONE WITH THE WIND. She has a fragile, hunted beauty which works perfectly for her role as the unwilling spy forced into romantic entanglements and deceptions. The story is murky, but that doesn't really matter. Watch the sequence where Vivien has been marched aboard ship and locked into her stateroom for deportment as an unwanted spy. Using just her eyes and her expression, Vivien does an entire scene of tossing in her sleep, going to the porthole, and lying back down to sleep again, showing every emotion from fear, suspicion, and doubt to acceptance of her own guilt. Then there's an explosion and she sits bolt upright, looking as fragile and unspeakably lovely as a hunted deer. This is a movie where the sheer radiance of the lead actress makes everything else seem dull by comparison.","user":"Dan1863Sickles","rank":[25,25]},{"title":"Vivien Leigh and Conrad Veidt - Fire and Ice","rating":10,"date":"28 June 2010","review":"Vivien Leigh and Conrad Veidt - what an interesting and unusual pairing! In my opinion, \"Dark Journey\" is Vivien's greatest pre-GWTW movie. The script is full of memorable lines, but there are also some great romantic moments between the actors. The combination between Vivien and Conrad is just like having fire and ice in love. It's a palpable, strong, glacial romanticism. Conrad said once: \"The one thing I look for everywhere is beauty. I find it everywhere, and in almost every person. A lovely painting, a good book, or music moves me. It has a life of its own.\" In my favorite scene from the movie, which is the kissing scene, you could see that even after the kiss, Conrad is still holding Vivien in his arms, admiring for a few more seconds her beautiful, perfect, feminine, heart-shaped face, with those two big emerald eyes and the sweet, little lips. He is visibly enchanted by Vivien's unique beauty, as she is telling him \"Now, I want you to take me away from my friends and the business, from everyone but you\"; and he tells her \"That's my dream\". This is a lovely, unforgettable scene, in which Vivien and the apparently implacable Conrad Veidt make together a wonderful couple of lovers, despite the differences between them. I would recommend to any fan of the two great actors to watch this spy and romantic film. It would be even nicer if they put back the deleted scenes. The original movie is at least 15 minutes longer than the actual version, of 75 minutes. For example, there was a scene where Karl (Veidt) is trying to seduce Madeleine (Leigh) at the first dinner party they meet. There is a famous photo from that deleted scene with Conrad and Vivien smiling at each other, and clinking two glasses of wine. And this is just one of the many deleted and important sequences from the film. But, the latest DVD version is 79 minutes in length, because it contains more sequences. I was very happy when I bought it, not only because I found some extra-sequences, but also because the quality of the picture and sound was far superior to all the versions I had previously seen. All in all, this is an extraordinary movie and it certainly is among my favorites. I give a 10 to this movie because of Vivien Leigh's unusual beauty and talent, Conrad Veidt's outstanding performance and great charm, because of their unique and fascinating chemistry, because of the interesting, complex and realistic plot,the very good dialogue - many lines are really remarkable, because of the lovely costumes (designed by Rene Hubert) and impressive sets (especially the one at the Grand Hotel), because of the wonderful music score, because of the unforgettable atmosphere which combines love, fashion, war and espionage. If Dark Journey were made in Hollywood, it would've been on the top list of classic movies. Do you need any more reasons?<br><br>P.S.: I would appreciate very much if the fan who posted on IMDb the quotes from Dark Journey would contact me at conradveidtforever@yahoo.com","user":"monikgwtw","rank":[10,10]},{"title":"Firefly Without the Music","rating":7,"date":"23 February 2007","review":"One of the first reviews I ever did for IMDb was of The Firefly, the 1937 MGM musical that starred Allan Jones and Jeanette MacDonald. The original book of the Broadway operetta was scrapped for a plot involving espionage agents working for the exiled King of Spain and for Napoleon and they were played by MacDonald and Jones respectively. <br><br>It seems as though I may have discovered where the story came from as Dark Journey is in fact based on a couple of real life French and German agents operating during World War I. Both are stationed in neutral Stockholm and serve as conduits for intelligence for their respective governments. <br><br>Like in The Firefly both fall for each other and in the end the female uses all her feminine charms to trap the male as the British use a Trojan horse gambit as well as Vivien Leigh's considerable charms to nail Conrad Veidt. What do they do, you have to watch Dark Journey for that, but I have to say it is rather clever.<br><br>Dark Journey and Fire Over England with her then husband Laurence Olivier are the films that got Vivien Leigh her first real critical notice. Ultimately in her career which in point of fact has very few films to her credit, it led to double Academy Awards for Gone With the Wind and A Streetcar Named Desire. Her beauty is stunning in Dark Journey and no hint of the physical and mental problems that plagued her tragically all her adult life.<br><br>Conrad Veidt who escaped Nazi Germany was also making quite a mark in the British cinema. His career role there would be Jaffa in The Thief of Bagdad and later on of course as Major Stroesser in Casablanca in the USA. He made a good living playing a lot of Nazis during World War II although he was as rabidly anti-Nazi as they come. He left Germany because he had a Jewish wife. He died way too young and never saw the ultimate triumph against Hitler.<br><br>If any of you have seen The Firefly you know exactly what happens to both Leigh and Veidt. You could do a lot worse than seeing both of them back to back.","user":"bkoganbing","rank":[20,23]}]