[{"title":"A Gal With TOO Much Personality!!!","rating":8,"date":"16 November 2007","review":"I suppose the one thing Eve White could never be accused of, in the 1957 movie \"The Three Faces of Eve,\" is not having enough of a personality! In fact--to the consternation of her dullard Georgian husband, and the amazement of shrink Lee J. Cobb--she's got three distinct personalities that tend to emerge quite unexpectedly. The first is Eve White herself, a mousy dishrag of a housewife; then there's \"Eve Black,\" an extroverted, hard-drinking party girl; and finally \"Jane,\" a nice, well-spoken young woman. As portrayed by Joanne Woodward in her Oscar-winning role, this mixed-up gal becomes a very believable and sympathetic figure. Woodward is actually pretty amazing here, and it is quite remarkable how she is able to switch on a dime from one personality to another, using all the actor's tricks of mannerisms, voice inflections, accents and so on. Cobb is also excellent, as usual, as the soft-spoken, patient doctor who tries for years to help her, and David Wayne is also fine as Eve's husband, who, in one fascinating scene, seems to cheat on his wife WITH HIS OWN WIFE! The psychological explanation of why Eve has become what she is may strike some as too pat, but we shouldn't forget that this is all based on a real-life case history. However, as Danny Peary reminds us in his fun book \"Alternate Oscars,\" the real-life Eve had not been cured at the time this film was made, but rather required 17 years' worth of additional therapy, during which time a full 22 personalities came forth! But I guess that would have made for a very depressing 10-hour movie! And I wholeheartedly agree with Peary that Woodward deserved an Oscar for her work here. Heck, under the circumstances, they should've given her three!","user":"ferbs54","rank":[20,20]},{"title":"Three People Inside Your Skin","rating":9,"date":"21 February 2006","review":"For dramatic effect movies about mental illness always have the psychiatrist coming up with a miracle cure of the patient. You saw that in Spellbound with Gregory Peck and in The Snake Pit with Olivia DeHavilland. It's not that easy, but it does make for good cinema. To give credit where it is do, The Three Faces of Eve is about a real case of multiple personality disorder and Alistair Cooke's narration does give it a proper time frame, the cure is a matter of years here.<br><br>In only her third feature film Joanne Woodward became the Best Actress for 1957, ironically beating out Elizabeth Taylor who was descending into madness in Raintree County instead of being cured. I read somewhere that the Southern born Ms. Woodward remarked ironically that it took years of training for her to lose her southern accent and then she has to find it all over again to win her Oscar. I guess the Academy voters that year were as impressed as I was how she was able to flip into three different characters in many scenes. She's drab homemaker Eve White, a Tennessee Williams sexpot as Eve Black, and as Jane who's trying to leave both behind.<br><br>As good as Woodward is, my favorite scene in The Three Faces of Eve is when psychiatrist Lee J. Cobb tries to explain to Woodward's working class husband David Wayne about multiple personality disorder. The patient looks on Cobb's face and the blank expression on Wayne's face say more than ten pages of dialog. Another performance to look for is that of future TV physician Ben Casey, Vincent Edwards as a soldier trying to pick up Woodward in her sex kitten self.<br><br>Nunnally Johnson gets some real good performances out of his cast and a once in a lifetime role for Joanne Woodward.","user":"bkoganbing","rank":[35,37]},{"title":"Needs to be seen from the 1957 perspective","rating":10,"date":"14 April 2008","review":"I saw this while in my mid 20's and found it a most daring and powerful movie. Joanne Woodward's acting was phenomenal, especially her ability to switch personalities instantly. And while much credit needs to be given Nunnaly Johnson's direction, I believe Woodward's performance fueled each of the other actors in reacting to her personalities.<br><br>These days, the film doesn't have the same power which is why I feel it needs to be seen from the mid 50's viewpoint.<br><br>I heartily disagree with those who feel there wasn't enough difference between the Eve White personality and the Jane personality. Woodward definitely brought out the submissiveness and lack of self confidence in Eve White and the level headed attitude of Jane.<br><br>It's true that the true story didn't end where the movie did. However it does stand as a great movie.<br><br>One does wonder if either Judy Garland or June Allyson, both of whom were offered the role, could have done as well. Orson Welles reportedly stated that any actress successfully doing the role would win an Oscar. However, Woodward did the switch so effortlessly that I feel she was destined for the role.<br><br>As for those who argue that MPD doesn't actually exist, I personally knew a woman afflicted with the disorder. It indeed exists.","user":"Eightythreeyearoldguy","rank":[13,14]}]