[{"title":"Insect Aside","rating":8,"date":"7 December 2003","review":"This is an above-par gigantic monster thriller from the golden age, well-presented. A thawed, flesh-eating prehistoric preying mantis from the Arctic circle makes way for New York. Director Nathan Juran handles scenes well, including nostalgic map graphics detailing radar sites in the introduction, and using eerie nighttime photography covered in fog-shrouded atmosphere. Musical score is forceful and suspenseful, Clifford Stine special effects are fine for its era. Stock footage abounds but is not uninteresting, leads Craig Stevens and William Hopper are stalwart and wooden, but Alix Talton, a husky voiced former Miss Georgia and resembling Jane Wyman, is fun and natural. Last sequence still thrills, when we start to feel a little sympathy for this wounded animal, roaring and wailing as he meets inevitable doom.","user":"twanurit","rank":[47,49]},{"title":"A fine example of 50's Sci-fi movies.","rating":10,"date":"7 February 1999","review":"The Deadly Mantis is a fine example of the best of the 1950's vintage science fiction movies.  A good story line with enjoyable character interaction. The movies use of documentary footage to introduce scientific or geographic fact into the setting of the fiction was classic 50's. I actual learned something about the multi-million dollar \"DEW\" Line. Today's modern viewer may complain about the special effects, but remember that the movie was made in 1957 not 1997. With that in mind, rent the movie, pretend you're at the drive-in, and have an enjoyable evening.","user":"Pike-6","rank":[38,40]},{"title":"Very entertaining movie!","rating":9,"date":"26 December 2005","review":"I don't know why everyone thinks they're a great movie critic. If you get a kick out of old sci-fi flicks, this one was a lot of fun. Where else can you find a giant bug making war on the American military! My favorite scene is when the mantis is hiding in a ditch and cocks it's head to watch it's enemy fly overhead. And I didn't think a mantis was a strategist. I wish they would have forgotten the romance part, because the leading man really sucked. Through the whole movie, I was waiting for his demise, which unfortunately did not come! And then he ended up in bed with the girl. (not really, but you get the idea). I thought it was a very watchable movie if you've got an imagination.","user":"lrb-leeds","rank":[24,25]}]