[{"title":"Deserves better","rating":16,"date":"16 September 2010","review":"Andrea Fletcher (Ellen Barber) is recently out of a mental hospital and still unhinged. Declared an unfit mother prior to her hospital stay, she's desperate to get back her young daughter. Jude (Richard Lynch) is an acquaintance she met while institutionalized. Now working as a carnival clown, he keeps an eye out for Andrea's daughter. He spots the girl one day with her adoptive mother, Sheri (Sharon Farrell). After sharing the news with Andrea, the two plan to kidnap little Janie from her foster parents. The stress of the events sets off a series of psychic visions in Sheri. With the help of her husband's colleague, a professor in parapsychology, she attempts to use her abilities to get Janie back.<br><br>This Mississippi-lensed slice of regional horror is one of the most underrated films I've ever come across. Just take a look at that absurd IMDb rating. In no way, shape or form does this haunting little chiller deserve to be rated that low. Yes, it does have it's problems. The early scenes between Sheri's husband and Dr. Kingsly feel shoehorned in, and the development of ESP in Sheri later on seems to be a bit too coincidental. Her husband has just met an expert on the subject a day or two before this all happens. The metaphysical elements also never come together as cohesively as director Robert Allen Schnitzer likely hoped. They certainly add to the intrigue of the picture, however, not to mention the mood. What doesn't add to the mood are some scene transitions that are really jarring.<br><br>With all of that said, this is a beautiful film. The hypnotic atmosphere is vividly rendered, striking me as a mixture between Val Lewton, \"Carnival of Souls\" and \"Let's Scare Jessica to Death\". The haunting tone and emphasis on character are also things that \"The Premonition\" has in common with the aforementioned films. The people on display here are emotionally wounded, be it Andrea's unbearable need for her daughter or Sheri's desire to have a child of her own, which she's incapable of. Even Jude has his issues. He clearly wishes to settle down with Andrea, but she's only intent on using him. Her rant about him never being a father to Janie or anyone else gets under his skin to the point that he keeps the kid when he has no real reason to later on. Sharon Farrell and Richard Lynch are both very good in their roles, though it's Ellen Barber who really shines. At first appearance, her Andrea looks to be a normal young woman, but she flies off the deep end at the drop of a hat. There's an intense hatred behind her eyes, one to which even her partner in crime isn't immune.<br><br>Another thing in the film's favor is that it's never predictable. There was one big surprise about midway through, and Schnitzer takes a unique approach to his ending. I think it paid off, as the climactic sequence is a thing of beauty in regard to how it relates to our characters. That's the gist of it, too. This is a strictly low key affair, very character-driven. Is it a masterpiece? No, but it is a damn fine sleeper that deserves much more respect than it's been given in the 34 years since it's release.","user":"Cujo108","rank":[18,18]},{"title":"Strange and haunting.","rating":8,"date":"10 October 2010","review":"A neurotic Andrea Fletcher(Ellen Barber)returns from a mental institution.The woman is looking for her daughter Janie.With the help of a circus employee Jude(Richard Lynch)Andrea wants to kidnap the girl from her adoptive parents.But the plan goes wrong and the supernatural visions begin...I can't believe that Robert Allen Schnitzer's \"The Premonition\" is rated so low.The script is imaginative as it delves into the bond of motherhood,telepathy and precognition.The acting is strong,the direction by Schnitzer is competent and there is some powerful suspense.The shock moments are very effective for example the scene where Andrea in a red evening gown slips into Janie's bedroom is very eerie and sad.A must-see for fans of \"The Brood\" and \"Don't Look Now\".8 out of 10.","user":"HumanoidOfFlesh","rank":[12,13]},{"title":"touching and moving","rating":10,"date":"23 September 2006","review":"If you view this as some occult B flick, you can't enjoy much and maybe couldn't get the point. About me, I almost cried at the end of the film, because of the beauty of this directors vision for distressed people. I got surprised, because he sure knew how to express! It's a joy to find these underrated artists from B flicks. There're so many of them really. Well ,about the film, this is the story of a woman who wants to love her own child but who can't. That's very sad. Not only the direction and the plot. You can't forget the actors in this films. Considering how low the budget was, but they're acting was so full of enthusiasm. Well no wonder most American actors are great so maybe that's not the consideration though. However, this is the most underrated film I ever saw.","user":"ANCHINN","rank":[17,22]}]