[{"title":"Perhaps the last great movie of Lee Marvin...","rating":8,"date":"29 February 2000","review":"Some movies are like buried treasure; someone manages to slip them into the theater, practically under every critic's nose, where they either thrive or famish and then vanish into the nearest video catalog. \"The Big Red One\" is one of those films. For all the hoopla created by \"Saving Private Ryan\" (another excellent film, which, in my opinion, had a better understanding of it's subject than a lot of it's critics gave it credit for), it owed a great deal to what Sam Fuller did a decade and a half before.<br><br>Lee Marvin, an actual WWII veteran himself, holds the film together as the tough but exhausted seargent. When he tells Mark Hamill (yes, Luke Skywalker, folks) that you don't murder animals, you kill them, the look on his face after that seems to say that he wished it could be some other way. It's hard to grab defining moments in this film as stand-out, but the two sequences that stick the most to my mind are the taking of the insane asylum and the horrors of the concentration camp. While other movies have focused on specific campaigns, \"The Big Red One\" deserves high marks for painting the broad canvass of the Second World War from the perspective of the guys who actually had to do the work.","user":"keihan","rank":[60,77]},{"title":"Good personal story from Sam Fuller","rating":18,"date":"18 April 2000","review":"This film is really about the experiences that Sam Fuller had during WWII. It is a bit dated, and the low budget really shows, but SF clearly did the best with what he had, and it stands as a great monument on war from a director who was really there.  <br><br>All of the characters are very likeable, and well acted by Lee Marvin, Mark Hamill, Robert Carradine, and company.  The movie is fiction but influenced by real events.  Many of the scenes, especially one involving a group of older sicilian women who cook a big meal for the squad, ring very true, since a fiction writer would obviously try and spice them up--the film is very honest, and it is good that Fuller left this story for us.  I also like how it ends on a positive, optimistic note.<br><br>\"The real glory of war is surviving.\"","user":"JAM-31","rank":[34,43]},{"title":"Groundbreaking war film, as misunderstood as the title.","rating":8,"date":"27 September 2003","review":"Less than 5 years after the Vietnam War officially ended, Director and acclaimed (but aged) film writer Sam Fuller attempted to recount the experiences he encountered while serving as an infantry soldier in the European Theatre of WW2. He had written many war scripts in his day, but fully realized that the world would not be ready for the true story of WW2, (He is quoted infamously as saying that a truly realistic war picture would involve live grenades and machine guns in the theatre). As his career ended and the world changed, he decided to make a go of his life long pet project... to make a film about the REAL story of WW2, about his own experiences in the Big Red One, or The First Infantry Division.<br><br>Too ahead of it's time to be appreciated during it's birth, and too dated to be appreciated in hindsight.<br><br>Some of the other user comments suggest this film is inferior to modern war films. Of course this film is not at the caliber of Saving Private Ryan or Band of Brothers in it's war scenes. How could it? When it is of a time closer to The Green Berets (John Wayne wins The Vietnam War) then to anything that came after it. Infact I would go as far as to say that this film broke the first ground, and made films like Platoon, Hamburger Hill, and Full Metal Jacket socially acceptable, and paved the way for films like Saving Private Ryan. Sure, Apocalypse Now has better War scenes, but is so fictional in it's scripting and \"epic\" war moments that it missed the point of the soldier on the front (and is widely regarded as being unrealistic by Vietnam Vets). The Big Red One tells the story from a WW2 Vet's point of view, Sam Fuller, and is wonderfully acted by a WW2 vet, Lee Marvin. Perhaps the last film to have such credits.<br><br>Sure, The Big Red One is cheesy, and harkens to a time when war films were more about the characters, then the violence. Still, there is something charming about the scripting, and Lee Marvin holds the movie together, while being surrounded by actors who were trendy on the cheap for 1979. The film also has technical inaccuracy, as in the Sherman tanks used as Panzers. However, the real strength of the film is in the script, and not in the battles. It breaks ground in it's defiance of films like the Sands of Iwa Jima. The soldier is not a clean sterile fighter for the holiest do goodynest army of all time, he is a human being locked in a battle for survival, and most importantly, he hasn't lost his sense of humor, or his libido.<br><br>Regardless of it's dated, almost 70's TV movie feel, I must mention that this film was first to show D-Day in a light other than that cast by The Longest Day, and uses some very clever cinematography to illustrate the violence. Sam Fuller consciously decided to make the battles less violent, and choose to focus on the characters instead, depicted the main characters as cynical and the fallen as humorous tragically short lived figures. This film also was first to introduce words like \"replacement\", \"non-Coms\" and \"Krouts\" to the war movie dictionary. It has the entire bangalore scene from Saving Private Ryan (although merely a concept compared to SPR) and shows North Africa, Italy, France, Germany, and a concentration camp. Before this film, WW2 was only depicted in such an epic manor that Bible films are seemingly tame.<br><br>THE BOTTOM LINE: This film was one of the last war pictures to emerge from the dying studio system, and is comparable in the way of battles to The Green Berets, Longest Day, etc. However it shines in the script category. and was first to show soldiers as young clumsy men, and not heroes. It attempts almost too much and that is it's strongest limitation. Still, a must see for war movie fans who can appreciate the older films. 7/10.","user":"D_Psypher","rank":[99,137]}]