[{"title":"One heck of a moist movie.","rating":6,"date":"6 April 2005","review":"I have a penchant for applying my own little award system to genre pictures. \"Salo\" takes the most disturbing award; \"Dead Alive\" (aka Brain Dead) wins the goriest film award; \"Caligula\" runs away with the most over-sexed honor. Well, film lovers, here we have my vote for nastiest film ever. If you've seen it, you know why.<br><br>The story concerns a young couple with a predilection for all things dead. This works out well for them, as the boyfriend works for a crime scene clean-up crew. As luck would have it, one day he comes across a rather well preserved corpse ('rather well' as in it's a rotted, blue hunk of tissue) while on duty. He manages to sneak the body home, much to the delight of his lady-friend, and they go about having their dirty little way with it. It soon becomes clear that the girl is enjoying the company of the corpse more than her still breathing boyfriend and runs off with it. Needless to say, this does nothing healthy for his already deranged mental state (being dumped for another guy is bad, being dumped for a dead one is even worse).<br><br>Believe it or not, watching them have sex with the gooey body is NOT the nastiest thing you'll see here. All manners of assorted atrocities are committed for your viewing un-pleasure, most all of them rank in the 'so sick you can hardly watch' category. I will not spoil the best of them, just rest assured that gore-hounds will most certainly be pleased (if not disgusted).<br><br>For better or worse, the film is not very competently made. The corpse and gore effects are very good, but the film stock and technique are both pretty sub-standard. And with the script being so barren and the acting merely passable, the shock moments are all that will keep hardened viewers watching 'till the gruesome conclusion.<br><br>If you are looking for good story telling, look else where. If you're looking for a good sex flick, look else where. If you are looking for the ultimate stomach churner, you've found it.<br><br>6/10","user":"Ky-D","rank":[55,66]},{"title":"Hard To Say...","rating":8,"date":"22 May 2006","review":"I have to admit that I like this film. At the same time, I don't know whether or not I can sit through it again. Jorg Buttgeireit proves himself as quite a revolutionary director in this field of film-making, and since has gone on to make even better films.<br><br>Nekromantik is actually not a very complicated story. Robert and Betty are in love. Robert and Betty have some sick fetish's. Robert works for a company that cleans up dead bodies, and one day Robert brings home a rather rotten cadaver pulled out from a swamp. When I say rotten, I mean disgustingly rotten. Well, after Robert and Betty have a rather disgusting threesome with there new found friend, Robert gets fired from his job. It is at this point that Betty leaves him and takes the rotten corpse with her. The rest of the movie is Robert trying to cope with his loss.<br><br>This movie has to be seen to believe. I wouldn't recommend this to just the average horror fan. You have to be wanting to look for something new. In my case, I had seen everything. My collection of horror films is in the hundreds. But I hadn't seen this. The second film is rather good also, and I am having a hard time deciding which movie had the sickest ending. I hope this comment helps. 8/10","user":"CMRKeyboadist","rank":[33,42]},{"title":"Disturbing, gory and strong.","rating":10,"date":"24 September 2004","review":"Nekromantik is an authentic piece of horror. And that is what many people feel about this work. Some people wish had not cross paths with something so dark. That is true horror.<br><br>Nekromantik is very hardcore and graphic. There are only a few movies that can be in the same league in its genre. The Texas Chainsaw Massacre (the first one and original) had demented characters that finally are not punished like they always are in moral guided horror films. Cannibal Holocaust has a graphic approach similar to this film. Some moments of the first Hellraiser (it included a romantic scene of a woman and a resurrected corpse) could be compared. <br><br>But Nekromantik dares to go further than those movies (with less money), there's no moral view over the necrophilia... it is treated lightly, like ordinary everyday stuff. I don't want to spoil anything but I suggest you to pay attention to the last scene... if that's not completely disgusting I don't know where is the disgusting stuff in cinema. <br><br>Buttgereit like many filmmakers used horrifying and gory elements in his first steps. In most cases when an amateur director does 'zombie movie', intentionally or unintentionally, the final result is a comedy. Even if they want to be taken seriously, in most cases people just laugh at what they see. This author made a comedy that most people feel it's not funny at all. Maybe it's because of the particular German sense of humor or something else. Buttgereit's cinema is shocking and bizarre. Those are two compliments that Buttgereit achieved with Blood (many blood and guts also), sweat and tears. But I don't want to be misunderstood; I challenge people to see this movie, because it's ground breaking (even today) not like the typical 'Scream-clones' out there.","user":"mrphantasm","rank":[38,53]}]