[{"title":"An enriching experience","rating":8,"date":"22 February 1999","review":"As of 1998 I've seen the film four times.  It's one of those rare films that when I've finished viewing it, I feel as if my intelligence has gained something.  Despite the stylization (barely any acting), the film works exceptionally well for those who are willing to let their ideas be challenged.<br><br>Incidentally, the version of the film with English-language subtitles provide the only alternative translation of the text that I know, and one that is more faithful to the German.  All other English texts are based on the singing text of the vocal score, and thus is shaped to fit to the rhythms of the notes rather than absolutely fidelity to the original meaning.","user":"kos-3","rank":[8,10]},{"title":"Uncompromising","rating":8,"date":"27 November 1998","review":"Schoenberg's music will not be to all tastes, but I bought the Michael Gielen / ORF soundtrack recording after seeing this film, something I didn't do after viewing The Lion King or Titanic. Gielen, incidentally, is Schoenberg's son-in-law.<br><br>I found this production riveting with intense performances from the two principals. An austere staging suits the score.<br><br>I would love an opportunity to see this film again. Any chance that Cinematheque Ontario will reprise their Opera As Cinema series? The other films in the series to rival Moses and Aaron in quality if not in style were Katerina Izmailova, Boris Godunov, and Tales of Hoffman.<br><br>Schoenberg returned to the faith of his forefathers after experiencing persecution at the hands of us Christians. He really came back with a vengeance.","user":"Varlaam","rank":[7,10]},{"title":"Uncompromising: yes","rating":8,"date":"10 May 2009","review":"One of the more watchable filmed operas -- even if one is not terribly fond of the opera. Of course it's not a \"gustatory\" work (in Brecht's terms) -- meant not for enjoyment but edification. This fits well with the Straub-Huillet aesthetic -- their films are, if nothing else, difficult, so it's a good match between text and director(s). I am somehow (perhaps it is pure snobbishness!) fond of their work. Certainly the earlier short films, \"Not Reconciled\" and \"Machorka Muff\" affected me deeply when I saw them in the early 70s. (Their cut-up narratives are appealing to the puzzle-solver in me; their strong ethical stances to the priest in me.) And while the austerity of the Moses/Aron/People scenes is very stark, there is also plenty of vitality in the Golden Calf/orgy scenes. The sacrifice of the virgins, in fact, made me think of Pasolini: visually beautiful yet morally chilling.","user":"tentender","rank":[5,7]}]