[{"title":"A sorely underrated film","rating":10,"date":"22 October 2009","review":"From the reviews I've read online (both current &amp; from the time of the original release) I think that The Mind Benders is sorely underrated. Here is my attempt to convince you that the film is really one of the best! -- I think that generally there are two kinds of films -- films that you watch and films that you experience. The Mind Benders is definitely the latter. And though \"scary\" is usually defined as monsters and ghouls, this movie scared me out of my wits without one hint of the supernatural.<br><br>Conventional monster movies always give me the spooks, but I'm only really petrified when the terror in a film seems like it could actually happen - or when the main character is so dreadfully afraid in the film that you become just as afraid yourself. The Mind Benders deals with one of the most frightening experiences that man could suffer through- complete isolation. Isolation from sight, sound, touch, taste, smell and human contact. The experience is made so real, so absolutely horrifying that I actually felt sick to my stomach at one point. Now this might not seem like a selling point, but it is. I was so engulfed in this film that I want to pop the disc in my DVD player again tonight. I want to be with it again, to see it again. I'm not a sadist or anything- the film isn't torture. While it has it's unsettling moments, it is actually incredibly moving and really makes you think.<br><br>The film opens with an elderly scientist committing suicide by jumping off of a moving train. Next to his body they find a suitcase filled with cash, apparently the money he was given for leaking top-secret scientific information to the Communists. What seems like a simple open-and-shut case of treason is actually much, much more complicated. The scientist, Dr. Sharpey, was working on a disturbing project called Isolation in which he was attempting to find out what happens to the human brain when all of the senses are taken away. The guinea pigs in the study were Dr. Sharpey himself, and his colleague, Dr. Longman-- played by Dirk Bogarde.<br><br>Longman realizes that the only way to prove that Sharpey wasn't the kind of man who would commit treason is to show that once you go through \"Isolation\" you don't come out the same man. The only way to prove this is to go through Isolation himself. While the plot seems to be about espionage and proving someone's innocence, it really isn't. It's about what makes us human, and how fragile that something is.<br><br>I can't tell you how much I want to go into more detail about the plot and the twists, and how Dirk Bogarde's character progresses throughout the film but I think that if I had known any of that before I watched it, the intensity of the movie would have definitely been blunted. You need to see this film fresh for the first time, with no preconceptions in order to full appreciate it. One thing to look out for, though-- Dirk Bogarde's eyes before and after Isolation. They seem to get darker in color, but they don't. It's not a special effect; it's a cold, icy look -- and it is remarkable.<br><br>This was by far, hands down the best Dirk Bogarde performance I've seen so far. I don't know how he didn't have a nervous breakdown while acting this part. He is so emotional and intense it is almost incomprehensible. When I first discovered Dirk Bogarde, I had no idea how much talent he had-- I thought he was a handsome, skilled actor and that I'd like to see more of his films. I am so glad that I followed through, because I think his might be the single best performance I've seen by an actor in my entire life. It was absolutely brilliant, and I think that it actually enriches my life to have seen him in this movie.<br><br>I loved this film so much (can you tell?) that I really wanted to write the most brilliant post ever about it, but I'm so tongue tied (or keyboard tied, as it were) that I can't express myself. Good films do this to me, they knock all of the wordiness out and just leave me gaping and staring at the screen. Since I watched it last night, I've gone to sleep, woken up, eaten breakfast, lunch and dinner, worked and had fun. But inside I am still gaping and staring at the screen. It has a hold on me and I think I need to watch it again tonight. I'm sorry, I mean I need to experience it.","user":"silentsandtalkies103","rank":[25,26]},{"title":"another strange Bogarde film","rating":6,"date":"27 July 2010","review":"Dirk Bogarde can be described as a great actor who was never in a classic film. Popular films, like the Doctor series, certainly; good films like The Tale of Two Cities; excellent films like The Servant; fascinating, discussed films like Death in Venice and The Night Porter. But classic films like Casablanca - maybe Darling comes closest, and that's not even his movie.<br><br>\"The Mind Benders\" is another Bogarde film on the bizarre side. When an elderly scientist is suspected of treason, an investigator endeavors to find out whether his experiments in isolation made him do something - betray his government - that he ordinarily wouldn't have done. One of his coworkers (Bogarde) agrees to go into the isolation tank; when he emerges, he is told things about his wife that, if he believes them, will threaten his seemingly happy marriage.<br><br>The film holds one's interest; with his science fiction bent, it has the distinctive '60s stamp on it.<br><br>Mary Ure plays Bogarde's wife. The acting is good, with the usual fine performance from Bogarde, a man who, once he got away from Rank, was attracted to unusual roles and unusual films. This isn't as wild as it gets for Bogarde. It's not great, but it's not bad either.","user":"blanche-2","rank":[16,17]},{"title":"Astonishing and gripping early story about sensory deprivation phenomena","rating":3,"date":"3 January 2011","review":"This is an extremely important and early film about the effects of sensory deprivation upon the human mind and personality. The term 'sensory deprivation' is not used, and instead the phenomenon is called both 'isolation' and 'sensation reduction'. I think perhaps the reason why this excellent film, one of the best ever made by director Basil Dearden, is not better known is that this subject became so sensitive that information about it became subjected to security restrictions, and pressure may have been applied to prevent the subsequent showings of this film after 1963. The film contains one of the finest and widest-ranging of all the performances in his career by Dirk Bogarde, who plays the lead. Mary Ure plays his wife. She comes in for a lot of abuse and bad treatment from her husband, which reminded me of her role as Alison in LOOK BACK IN ANGER (1959), where she was similarly abused and humiliated by her husband. Ure had been married in real life to John Osborne, and had originated the role of Alison in his play on stage at the Royal Court Theatre before later recreating it on screen, with Richard Burton playing her husband. Her amazingly quiet, superior, and serene beauty seemed to provoke and invite hysterical males to wish to torment her, and she submitted with such meekness to their abuse that the tormenting and the submission in both films set off virtual firestorms of sado-masochistic display. Poor Mary Ure died at the age of only 42, and after that perhaps she finally escaped her tormentors who had all been 'driven crazy by her'. Her submissiveness was really like the silent eye of a hurricane, with all the sadistic alpha males raging round her like violent storm winds gone mad. Some women just seem to do that to men, though fortunately not very often. This film is a riveting story, very dramatically and excellently presented, of the hazards of total sensory deprivation, and of how it can within a matter of hours break down a man's personality and reduce him to a screaming loony or a helpless quivering jelly of a person. In this same year, Jack Vernon's classic book 'Inside the Black Room: Studies of Sensory Deprivation' was published, describing experiments carried out at Princeton University. It was only two years earlier, in 1961, that Harvard University Press had brought out a scholarly book edited by Philip Solomon called 'Sensory Deprivation: A Symposium Held at Harvard Medical School'. So for a few brief years, this subject was allowed to go public, before the lids of the security services clamped down tightly, and information ceased getting out. We now all know that sensory deprivation is a fundamental and systematic tool of torture and interrogation, and useful for brain-washing. Subsequent technical studies in the field of hypnosis have emphasized the connection with hypnotic techniques of suggestion. See the book 'Open to Suggestion: the Uses and Abuses of Hypnosis' (1989). The standard narrowing of attention in hypnotic induction techniques is itself a minor form of sensory deprivation, since it reduces the stimuli and above all must focus the attention on a single thing (a point of the wall opposite, a swinging watch, or whatever). All leaders of sinister cults and sects know that to capture converts they have to whisk them off to some remote spot and keep them isolated for a minimum of three days. Their contacts with family and friends must be cut off. They must become captives of the new cult, and as captives they will then accept conversion and even become fanatical. This is similar to the 'Patty Hearst Syndrome' where you become so attached to your captors that you cannot and will not leave them, but end up identifying with them. The human mind and personality are malleable and susceptible to pressure and suggestion. When any form of sensory deprivation is used, however restricted, susceptibility and suggestibility are increased. If advertisers could trap us all in private rooms while being forced to look at their ads, they would! The battle of life is largely a battle of competing illusions. There is the illusion of normality, and the illusion of the everyday. And then there are the propagated illusions which try to capture us, swallow us, and use us. The more enfeebled our own abilities to think are, the more isolated we are, the less support we have, the easier we are to manipulate. In today's world, we are all being manipulated every day. Ads are manipulation, peer pressure is manipulation, commercial imperatives are manipulation, traffic wardens are manipulators, unreasonable government restrictions and red tape are manipulation: we are all victims, and it gets worse every week. Now we are bombarded 24 hours a day with information and communications, most of which we cannot absorb properly, and we are becoming beings who are pounded to pulp and who merely exist in order to pay taxes and shut up. This film was an early warning more than half a century ago, which was largely ignored. Everyone should watch it, wonder how much worse things have become since 1963, and think the unthinkable: what will it be like by 2063? Or will we all by then have become robotised so that we will not even be aware anymore of anything but the orders we are given and the imperative need to obey, obey, obey? Anyone who thinks that hypnotic and other forms of suggestion cannot coerce individuals to go against their moral principles is utterly wrong.","user":"robert-temple-1","rank":[12,13]}]