[{"title":"Bubbly, Over-Looked, Pre-Code Musical Gem","rating":10,"date":"14 August 2001","review":"This is a delightful, free-spirited musical gem from MGM.  It has the feel of the risque Paramount musicals of the era.  Jeanette MacDonald and Ramon Novarro are lovers who co-habitat (not an issue here!) and nurture each other in their respective musical careers.  Jerome Kern's score is wonderful -- the kind of tunes that stay with you, \"Try to Forget\", \"The Night Was Made For Love\", \"She Didn't Say Yes\".  Great dialogue and comic relief and a few emotional snarls give the film some complexity.  The musical numbers are innovative and interestingly filmed -- they compliment the score.  The atmosphere in Brussels is highlighted by a variety of characters in the arts community.  The film has a musical fluidity.  Other than the stilted staging of the 3-strip Technicolor ending, this film deserves more attention.","user":"sobaok","rank":[10,10]},{"title":"Two Stars Shine in Forgotten Musical","rating":10,"date":"9 October 2000","review":"Two struggling young composers share adjoining pensions in Brussels. A romance ensues, and they soon find themselves sharing more than just the view. When the lady finds success, the gentleman departs, seeking for fame of his own. Fate conspires to keep them apart - can they ever, like THE CAT AND THE FIDDLE, make sweet music together?<br><br>Although virtually forgotten today, this musical romance has much to recommend it, including sophisticated performances from its two stars, Ramon Novarro &amp; Jeanette MacDonald. The lavish production values may have been the Studio's way of pumping MacDonald in this, her first MGM film. Both of the stars exude charm &amp; handle the Kern/Hammerstein score quite nicely.<br><br>\nThis would be their only film together. MacDonald would soon begin her celebrated collaboration with Nelson Eddy and become one of the Studio's superstars. Not so for Novarro. Although he gives a fine performance here, after only two more (negligible) films, Novarro would be released from his MGM contract. Tastes in male leads had shifted away from the Latin Lover, but also the Studio bosses were doubtless concerned that Novarro's private life might prove a scandal and an embarrassment, a la William Haines. Be that as it may, THE CAT AND THE FIDDLE would prove to be Novarro's last decent starring role.<br><br>Some very fine supporting actors appear: Charles Butterworth, as a befuddled benefactor; Jean Hersholt, as a kindly music professor; Henry Armetta, as a furious cab driver; and Frank Morgan, as a comically lecherous impresario. In unbilled roles, movie mavens will recognize Paul Porcasi, as an unfriendly cafe owner; Herman Bing, as the speechless leader of the Fireman's Band; Sterling Hollowly, as a delivery boy; and Christian Rub, as a stage actor.<br><br>Best song? `The Night Was Made For Love.' The film segues into eye-pleasing early Technicolor for the final scene.","user":"Ron Oliver","rank":[10,10]},{"title":"Unjustly forgotten","rating":8,"date":"1 August 2004","review":"Charming musical/drama/comedy.<br><br>A penniless composer in Brussels named Victor Florescu (Ramon Novarro) meets American singer Shirley Sheridan (Jeanette MacDonald).  He is immediately (and understandably) attracted to her.  She hates him but then they start collaborating and fall in love.  She becomes successful and he doesn't. Will this tear them apart?<br><br>The story is obvious from the beginning but who cares?  This was MacDonald's first movie for MGM and they pulled out all the stops for her.  The movie is beautifully done with lavish sets and costumes and a beautiful score. MacDonald and Novarro have no sexual charisma between them (a kiss at the end looks horrible) but they both can sing and play off each other nicely.<br><br>MacDonald is very good at acting and singing.  She's beautiful and what a voice!  Novarro sometimes overacts (especially at the beginning) and he doesn't look too good (he was sadly suffering from alcoholism at the time and it shows) but he still has that boyish charm and smile and he can sing very well.  And there's an interesting closing sequence in VERY bright two-color Technicolor (love Novarro's green suit!).<br><br>It's well-done with beautiful sets, acting, stars and songs.  This really should be better known.  Also one of Novarro's best final roles before homophobia ruined his career.  I give it an 8.","user":"preppy-3","rank":[10,11]}]