[{"title":"He approaches the character in a completely serious manner and the results are marvelous.","rating":7,"date":"7 June 2004","review":"I've enjoyed most of the Alec Guiness films, especially The Ladykillers. I must say that I wasn't expecting much from this film and it was only because the VCR did not get turned off that I saw it. I believe it to be one of the most amusing films I've ever seen and one of Guiness' best. He approaches the character in a completely serious manner and the results are marvelous. The incongruity of a naval man who gets seasick and dock turned into a \"ship\" are very funny. At first, the character seems stiff and military, but he is anything but. One of the best scenes is of him dancing with teenagers. Every one of Guiness' Ealing Studios films are gems, but this is the top. This needs to be put out on DVD/VHS.","user":"order-7","rank":[28,29]},{"title":"\"Everything Pier-Shape and Blackpool-Fashion\"","rating":8,"date":"4 April 2014","review":"It was a bit of a shock that, when Alec Guinness passed away many, so many of his obituaries insisted that \"Star Wars\" was his most memorable film. For those unfortunates who remember him that way, the Ealing Films he made during the 1950s are absolutely essential viewing. <br><br>Not least among those films is this little opus, in which Guinness portrays an ex-naval officer who suffers from catastrophic mal-de-mer. Unable to go at sea but not wishing to be away from it, he assumes command of the only type of \"vessel\" he can endure, an amusement pier.<br><br>It is Guinness's characterization that makes this film work. The very fact that he plays Captain Ambrose absolutely straight is what makes the character so funny, including a wonderfully spot-on parody of Noel Coward's speech to his crew from \"In Which We Serve\": \"An efficient pier is a happy pier\". Of course, it is granted that audiences back in 1957 undoubtedly picked up on allusions such as that much more readily than audiences would today.<br><br>The film also features a running theme prevalent in many British comedies of that period, namely the individual overcoming big bureaucracy or big business. In this case, when the local town council threatens to close down his amusement pier, the imperturbable Captain Ambrose outwits them by means of the clever expedient of registering his pier as a ship, under a foreign flag of convenience. It's just the sort of solution one would expect from the inventive studio that brought audiences \"Passport to Pimlico\".<br><br>I understand this film was also released under an alternative title, \"Barnacle Bill\". However, under any title, it is a worthy addition to the seemingly limitless pantheon of characters portrayed by the remarkable Alec Guinness.","user":"robertguttman","rank":[16,16]},{"title":"Another great Guinness performance","rating":7,"date":"18 October 2000","review":"The great Alec Guinness gives one of his usual fine performance in this lightweight comedy, wrapped around a typically wacky Ealing conceit - the sailor who can't go to sea buying a pier and running it like a ship. The early set-up sequences, featuring a montage of Guinness playing his ancestors at sea through the ages, are the usual silly, slapstick fun, and our hero's exploits getting his 'ship' up and running, fending off the crooked local council, and generally having a good time are heartwarming and cannot fail to raise a smile. One sequence, where he tries to run a dance hall at the end of the pier and is merrily strutting his stuff on the dancefloor with some local hottie when the authorities arrive to complain, is particularly memorable if only for the mad grin on Guinness' face as he boogies. Lacking the deeper satirical bite or wealth of really hilarious moments and characters powering the true classics of Ealing, this is nevertheless a thoroughly enjoyable little film, featuring the standard role-call of vaguely familiar faces (watch out for a youngish Donald Pleasence in an early scene).  Not brilliant, but fun.","user":"thehumanduvet","rank":[22,24]}]