[{"title":"Up a Creek...","rating":27,"date":"27 May 2004","review":"Decent story about an eighteen year old student visiting her parents in the Amazon. On a cruise down the river her boat is attacked and her parents are beheaded as she is taken captive by the natives. As she tells the details of her captivity to a court while on trial for murder she provides the tales of strange tribal customs and barbarism. Told mockumentary style (ala Cannibal Holocaust), Slave is a halfway decent attempt to give a little narrative force to the ample nudity and rather tame violence. The photography is nice and the acting is passable but the court scenes are rather laughable because the prosecutor says some seriously stupid things. A good way to pass the time if you are into cannibal flicks or a fan of exploitation.","user":"suspiria10","rank":[15,16]},{"title":"A pleasant surprise in this subgenre","rating":6,"date":"20 February 2007","review":"White Slave starts off looking like it's going to be a really lame pastiche of Cannibal Holocaust, what with an opening montage of the Amazon set to ho-hum music imitating Riz Ortolani's famous score for that other film. And actually it stays lame for a fair while - but then it gets good! Amazon headhunters ambush the boat of some well-to-do white landowners and their daughter, who's back fresh from studying in London. They remove the heads of the parents and drag the daughter back to their village, where gradually (and after much gnashing of teeth by all concerned) she's absorbed into their tribal lifestyle - which never seems to involve any more headhunting for the rest of the film, but don't dwell on that.<br><br>The film makes sure to include a little bit from all of the major food groups of this horror subgenre: gore, hazardous jungle treks, badly graded stock footage of wildlife, animals stupidly killing each other for real, tribal warfare, cruel and probably entirely fictitious tribal customs and punishments meted out left, right and centre, and plenty of nudity. Interestingly, there's no cannibalism at all. While the first third of the film really seems to be going through the motions with these things, there's a whole bunch of plot from then onwards and dare I say a good degree of human warmth. Once Catherine is fully ensconced in the tribe, she deals with character rivalries, tribal customs and conflicting loyalties and emotions. There's some honour and romance at stake, plus a minor mystery to be dealt with and revenge to be had. White Slave mobilises from being an extremely by-the-numbers exploitation film to one with an involving story and human qualities you can get into. You still have to put up with one of the silliest court trials in the world (it's used as a framing device), but overall, I found this film to be a pleasant surprise.","user":"Bloomer","rank":[11,12]},{"title":"Sleazy fun.","rating":6,"date":"16 September 2003","review":"Mario Gariazzo's \"Amazonia:The Katherine Miles Story\"(1986)is an Italian exploitation film set in the Amazon.Supposedly based on a true story it has plenty of gore,but no actual cannibalism.Elvire Audray plays an 18 years old girl abducted by native tribe and she is pretty terrible actress.Fortunately she is naked through most of the film,so fans of sleaze won't be disappointed.The gore is pretty good(there are numerous decapitation scenes,stabbings etc.)and the film has an obligatory animal cruelty scene.So if you're a fan of Italian exploitation cinema or cannibal sub-genre give this one a look-just don't expect another \"Cannibal Holocaust\"(1979).","user":"HumanoidOfFlesh","rank":[16,21]}]