[{"title":"It was a student film","rating":5,"date":"24 October 2006","review":"If you read the biography of Aziz Ghazal (writer/director) you'll glean that a lot of the work and equipment on this low budget film was provided by and done by USC film students. <br><br>Editors put in temporary music (they could not afford to pay royalties for) but fell in love with it and insisted on sound-a-likes instead of original music. The songwriters Richards &amp; Rocco, did a brilliant job of being musical chameleons at the behest of their employers. (Of note, the first two words of the seminal track \"Kiss My Butt\" are \"Kiss It\" - not \"kick it\" as another reviewer opined. <br><br>The film wasn't ever intended to be campy but came out that way due to the poor production values, bad writing and acting.","user":"golfgirlgolf","rank":[9,10]},{"title":"Not exactly ripe for rediscovery.","rating":4,"date":"5 February 2016","review":"The lovely and appealing Virginia Madsen stars here as Andrea, a young woman who wins a scholarship to a snooty prep school, which has only recently begun accepting female students. Her boyfriend Barry (James Wilder) has his misgivings about this institute of higher learning right from the start, but she tries to make a go of things. She eventually discovers that there is a sinister plot being engineered by the faculty, who are turning their students into emotionless automatons.<br><br>The student film \"Zombie High\" is hard to completely dislike, but overall it misses the mark. An odd, awkward horror comedy, it's nothing more than a minor variation on the old \"Stepford Wives\" theme. Its attempts to be irreverent are sometimes amusing, but more often than not, they fall flat. It's got a few action sequences, but nothing terribly impressive. The makeup effects are basically adequate. There's an omnipresent rock soundtrack to sort of make things interesting.<br><br>The performances are better than the material deserves. Also starring are Richard Cox (\"Cruising\") as a nice guy professor, Kay E. Kuter ('Green Acres', \"The Last Starfighter\"), who gives the best performance in the movie as the diabolical Dean Eisner, future film director Paul Feig (\"Bridesmaids\"), who has his moments as the aggressive, amorous Emerson, the extremely foxy Sherilyn Fenn, Scott Coffey (\"Satisfaction\") and Clare Carey ('Coach', \"Waxwork\").<br><br>At least \"Zombie High\" manages some poignancy in its final act. It needs to get a demerit, though, for including one of the worst closing credits rock songs that this viewer has ever heard.<br><br>Four out of 10.","user":"Hey_Sweden","rank":[3,3]},{"title":"Not bad.","rating":26,"date":"26 June 2000","review":"Virgina Madsen ( looking a bit too old for her role ) stars as a student at a prep school who discovers that the staff is stealing brain tissue from the students and using it to keep their youth. The idea is nothing new, but the film is given decent treatment and remains entertaining for most of its running time. The ending feels rushed though, but it is nice to see a zombie film with only mild violence that manages to scare and entertain these days. Rating: 6 out of 10.","user":"bigpappa1--2","rank":[7,12]}]