[{"title":"Revolting, disgusting, stupid- I loved it!","rating":3,"date":"3 May 2000","review":"As a child I loved to stay up late and watch \"USA Up All Night\" (with Gilbert Gottfried or Rhonda Shear, I wasn't picky). This allowed me to sample pretty much every major Troma movie, and I discovered the meaning of the phrase \"guilty pleasure\". As I got older I stayed away from Troma, as their movies radiated the kind of feeling you get from wearing a shoddy Halloween mask too long and getting nauseous inhaling the cheap rubber fumes. But after sampling the delightful \"Tromeo &amp; Juliet\" I decided to return to my roots and check out the directors edition of the classic \"Toxic Avenger\".<br><br>While I was right in remembering the films as the guiltiest of pleasure, the cheap charm of the film was undeniable, and there was a ton of gore in the movie that I never saw on T.V.  Arms are severed, guts are ripped out, seeing-eye dogs are shot, and children's heads are crushed- and it all looks pretty good! Some of the acting will make you wince, some of the jokes are atrocious (there are mother-in-law jokes), and some scenes go on too long (the idiotic out-of-control-car sequence) or too short (Toxie taking his revenge on his tormenters is strangely gore-free, which is explained in the director's commentary), but I can't bad-mouth a movie that has it's hero stuff a little old lady in a washing machine. If you're a gore fan with a high thresh hold for bad taste, then give the Toxic Avenger another shot- I did, and I'm a better person for it. I think.","user":"zmaturin","rank":[46,52]},{"title":"The posterchild for the 'so bad it's good' film brigade...","rating":7,"date":"1 July 1999","review":"Lacklustre direction by Lloyd Kaufman and Michael Herz, a goofy script (by Joe Ritter), truly poor FX and even worse acting all add up to, for some strange, abstract reason, a stupidly enjoyable film experience.<br><br>Maybe it's the camp sounding music, the over the top (and in some cases *way* over the top) 'acting', or perhaps it's just the fact that it's so unashamedly weird and downright cheesy that makes it such fun to watch, who knows? Whatever the reason this definitely isn't a film to spend long hours contemplating such things, instead just sit back and enjoy the crazy show.<br><br>Performance wise, as already mentioned, none of the actors give even remotely decent performances, with the exception of Andree Miranda who's actually pretty good in her role as Toxie's blind girlfriend. All of the other actors are so far over the top (or indeed just so downright terrible) that by films end they too have somehow managed to take on their own distinctly cheesy charm and add greatly to the whole 'so bad it's good' motif.<br><br>As I may have mentioned once or twice before 'The Toxic Avenger' is cheesier than a block of cheese factories, and as such it takes a special type of person to enjoy 'this type of thing', however for those with their tongue planted firmly in cheek, and for lovers of schlock cinema and 50's z-grade monster movies this is a must see. For most everyone else though it's probably best avoided and will most likely induce headaches and annoyance rather than belly laughs and amusement. Which of the above descriptions best suits you I'll leave you to decide for yourself.<br><br>7/10","user":"Adec","rank":[47,54]},{"title":"The beginning of a new era...","rating":10,"date":"3 November 2003","review":"The Toxic Avenger (1985) was the flagship of Troma's movie line during the early to mid 80's. This film was responsible for keeping the company a float during this time period and it also marked a turning point in the company's history. For years, Lloyd Kaufman and company were making cheesy sex comedies. With the birth of the Toxic Avenger, they started to expand their horizons, focusing on low budget horror/comedy trashy spoofs films. Instant cult classics were being produced by Team Troma. The Toxic Avenger is a Charles Atlas tale gone a wry. A weak nerd is transformed into a superhero of \"superhuman size and strength.\" Melvin Junko is his name. Melvin was a mop boy for a local health spa. One day when a mean prank turned into a horrible accident, he was exposed to an open drum of toxic waste. That unfortunate mishap transforms and mutates Melvin into an avenger, a TOXIC AVENGER. Troma becomes a worldwide phenomenon and the Toxic Avenger becomes one of the most famous cult films of all time. A must for all campy cult film fans!!<br><br>Highly recommended!","user":"Captain_Couth","rank":[43,53]}]