[{"title":"Powerful political thriller","rating":9,"date":"13 August 2000","review":"\"Missing\" is a strong, powerful political thriller about the real life story of a man and woman who search for their missing son/husband during the 1973 coup in a volatile South American country. Jack Lemmon and Sissy Spacek give brilliant, Oscar-nominated performances as Ed and Beth Horman, the father and wife of their beloved one who has disappeared without a trace. The film follows their frustrating search in a country (which is Chile even though the movie never reveals) that I would not dare live in. Things get more frustrating for the Hormans when they start to believe that the American representatives there are not telling them everything. Directed by Costa-Gavras (\"Z\"), \"Missing\" is an emotional film that keep me interested for its entire two hours. Lemmon and Spacek are great as usual, and there are supporting roles for Melanie Mayron and Joe Regalbuto, a couple of years before they turned up on TV's \"Thirtysomething\" and \"Murphy Brown\", respectably. \"Missing\" is one of the best, strongest political thrillers ever made. <br><br>***1/2 (out of four)","user":"jhaggardjr","rank":[29,33]},{"title":"Propulsive, Real-Life Political Thriller Shows Costa-Gavras and Lemmon at Their Peak","rating":9,"date":"19 October 2006","review":"Accomplished Greek-French filmmaker Costa-Gavras has a compelling way of bringing the emotional resonance out of stories with overtly political themes. He hits the mail on the head with this searing indictment of American involvement in the 1973 military coup that ejected Allende from power in Chile. Facts are not discretely presented, even the country in which the story takes place is not disclosed (except for specific references to the cities of Santiago and Vina Del Mar). Yet, Costa-Gavras creates an atmosphere of palpable tension that doesn't let up in this 1982 film, and the unraveling mystery at the heart of the movie echoes the unsettling political situation surrounding the characters.<br><br>Adapted by Costa-Gavras and Donald Stewart from Thomas Hauser's non-fiction book documenting the true case, the plot focuses on American expatriate Charles Horman whose sudden disappearance in the days after the Pinochet coup brings together two familial adversaries, his wife Beth and his father Ed, who has flown in from New York. Charles and Beth had been leading a vagabond existence with his work in children's animation and their relatively passive support of Allende's reform measures. Charles' back story is revealed in carefully constructed flashback episodes that show him to be curious about the presence of U.S. military personnel in the area. Once he disappears, Ed and Beth seek help from the U.S. Consulate but face a seemingly insurmountable wall of bureaucracy. Frustrated, Ed, a highly conservative Christian Scientist, lashes out at Beth for what he considers her undesirable influence over his son. However, as they absorb the scope of the violence and the culpability of the U.S. government, they bond intractably toward their objective of finding Charles.<br><br>For once, Jack Lemmon, unafraid to convey his character's prejudices, is able to use his neurotically coiled energy in a suitable dramatic role as Ed. The result is a startlingly raw performance that ranks among his best. Sissy Spacek is terrific as Beth, though her character does not experience as big an arc of self-revelation. In the elliptical flashback role of Charles, John Shea provides solid support, as do Janice Rule as a political activist and a number of familiar TV faces - Melanie Mayron as friend Terry and David Clennon as U.S. consul Phil Putnam, both from \"thirtysomething\", and Joe Regalbuto, Frank from \"Murphy Brown\", playing another Frank, a possible victim of the coup. There are unfortunately no extras with the 2004 DVD.","user":"EUyeshima","rank":[25,29]},{"title":"This film changed my life","rating":9,"date":"10 June 2002","review":"I was 17 when I first saw the film in 1982 and I can say, that it changed my life. Up to that I believe in my own government an I believe in the US, as a strong friend of all democratic countries. After this film I'd never take the things for real. I questioned everything and this is good. Use your mind, try to get informations from all sides. I think Chile is one reason, that the US doesn't sign the treaty for the international court, because guys like Kissinger had to be scared, that he has to take responsability for Chile and Vietnam. Everything was said of the great performance of the actors in this film. This is the best political thriller ever made.","user":"Ucurian","rank":[98,130]}]