[{"title":"A Cult Classic","rating":10,"date":"15 August 1999","review":"Now that Curtis Hanson is on the Hollywood A-List after the excellent neo-noir \"L.A. Confidential\", perhaps \"Bad Influence\" will be re-discovered for what it is, a contemporary noir classic.  Michael, played by James Spader, is one step away from a nervous breakdown.  His fiancee is planning a wedding he is none-to-thrilled about, while his career is at a crossroads. Someone will get that key promotion, but Michael won't unless he can find his schedule report which has mysteriously disappeared.  He suspects his work rival, Patterson, but is too much of a wimp to confront him.  He has been doubling up in pain from what he thinks is an ulcer from the stress. He leaves work for a fateful drink at a beach dive bar.  He lamely hits on a woman, whose boyfriend Michael does not back down from.  Michael gets saved by Alex or Tony (?), played by Rob Lowe, who menacingly breaks a beer bottle and threatens the boyfriend.  Alex we see at the beginning of the movie as leaving a beautiful woman's bed stealthily.  The photo he destroys of him and the woman shooting guns together foreshadows the violence that comes later.  Alex leaves Michael at the bar and Michael discovers his wallet is gone, but does not know how he lost it.  While jogging later, Alex stops by the bar to leave his name for the wallet.  He finishes his run at one of the L.A. piers, he sees Alex, who, of course, is with a woman pleading with him to stay with her.  Alex blows off the woman and he and Michael have a drink together.  Alex starts teaching him how to use the side of him that didn't back down to the gorilla at the bar.  What ensues is a Freudian Cain and Abel story with Faustian overtones.  Alex becomes Michael's tutor in the art of becoming a bad-ass, while Michael becomes something Alex hasn't had in quite some time: a friend.  When Michael's backbone becomes strong enough to stand up to the unpredictably violent Alex, the movie becomes a cunning duel between two guys who know L.A. isn't big enough for both of them.  The scenes of L.A.'s sinister club life and the people, like Alex, who thrive in it serve as superb snapshots of the decadence of the late-80s.  The conspicuous consumption of yuppies and the advent of the home video camera as a sexual metaphor are wickedly exposed.  This movie was simply ahead of its time.  It's Rob Lowe's best work and James Spader is awesome, his transformation is expertly done.  Plus, I'm eagerly awaiting Curtis Hanson's next movie.  Has anyone ever captured the evil that lurks underneath the surface of L.A. better?  \"Bad Influence\" is a must-see for the serious film enthusiast.","user":"Rich-NYC","rank":[42,61]},{"title":"Beyond good and evil","rating":8,"date":"8 November 2000","review":"This is the most textbook demonstration of Nietzsche I've ever seen.  Rob Lowe is the gifted liar prepared to go all the way to get whatever he wants and keep himself entertained.  Spader is the timid, uptight yuppie who doesn't understand just how much he's in for when Lowe's \"will to power\" rubs off on him.  What ensues would bring anybody back to good old fashioned organized religion.  A morality play taken to extremes that nonetheless works as a thriller, too.  Worth seeing.  8.","user":"russmillerwy","rank":[32,47]},{"title":"\"Alex\" - One Of The More Evil Characters Of The '90s","rating":8,"date":"15 January 2007","review":"\"Bad Influeince:\" Yup, that's a good title for one of the main characters in this movie: \"Alex,\" played by Rob Lowe. His grin alone is pure evil! In fact, Lowe's character is one of the lowest I've encountered in these modern-day thrillers. This also could be called a modern \"noir,\" because it has a lot of that genre's qualities. This also is different from the normal cops-vs.- crooks film.<br><br>As bad as \"Alex\" was, I couldn't root for the other main character, either: \"Michael Boll\" (James Spader). Spader is one of these actors that seems to play very snotty, unlikeable people. Maybe he's just good at play annoying characters.<br><br>An odd character, and one that added to this film, was the guy (Christian Clemenson) who played Spader's older, stoned-out brother \"Pismo.\" What a loser.....but an interesting person.<br><br>I really was intrigued by this film the first time I saw it but less so in the next two viewings, finally trading this in for something else. But for one viewing, it's recommended for crime fans, or people who just plain like evil characters.","user":"ccthemovieman-1","rank":[24,36]}]