[{"title":"Great Cast in Underrated Gem","rating":10,"date":"16 January 2005","review":"Wonderful music and terrific English performers make this spoof of 30s musicals a must. Twiggy is wonderful as the understudy who must fill in for the injured star (Glenda Jackson in a funny cameo). And a Hollywood big shot is in the audience.... Hmmmm. Superb turns by Antonia Ellis as Maisie, Christopher Gable as Tony, and the rest: Max Adrian, Georgina Hale, Moyra Fraser, Barbara Windsor, Bryan Pringle, Catherine Willmer, Tommy Tune, and Murray Melvin. Great sets and costumes and all those musical numbers. Twiggy (yes, she can sing and dance) and Tune teamed up on Broadway years later in Me and My Girl. And this is the show that made a star of Julie Andrews on Broadway in 1954. Great Sandy Wilson show made into a glorious film by Ken Russell. His gentle spoof of 30s musicals, including the famous Busby Berkley dance routines and many inside jokes and lines from 30s musicals make this a total treat for fans of the genre. Jackson's \"now go out there and be so great.... you'll make me hate you,\" is a direct quote from 42nd St, where Bebe Daniels says the line to Ruby Keeler. Also with Graham Armitage, Caryl Little, Sally Bryant, Brian Murphy, Vladel Shaybal as DeThrill, and Peter Greenwell as the pianist (who won an Oscar nomination for his orchestration). What fun! And one of Russell's best films.<br><br>Ken Russell takes a straightforward show and adds layers by having characters imagine bigtime Hollywood versions of the small touring company's musical numbers. This opens up the movie and makes for a dazzling spectacle of music, dance, and color. But without terrific performances, this would all be for nothing. Twiggy is really good as the shy Polly the stand-in. She and Christopher Gable make a nice dance team in several numbers. Max Adrian and Catherine Willmer are hilarious as the troop manager and his wife Hilda, as are Moyra Fraser and Bryan Pringle as the haughty star and his wife. My favorites are Antonia Ellis as the ferocious Maisie, Georgina Hale as the fog-horn voiced Fay, and Barbara Windsor as busty Hortense.<br><br>The music is great. Twiggy gets to sing \"You Are My Lucky Star\" and \"All I Do the Whole Day Through.\" Hale and Adrian are memorable in \"Never Too Old to Fall in Love.\" Fraser and Pringle are fun in \"You Don't Want to Play with Me Blues,\" and the closing \"Doing the Riviera\" is a fond homage to Berkley with the famous chorus girls on winged plane number. Also love \"The Boy Friend,\" \"We're Perfect Young Ladies,\" \"Nicer in Niece,\" \"A Room in Bloomsbury,\" \"Fancy Your Forgetting,\" and \"Sur La Plage.\"<br><br>THE BOY FRIEND is a fond and loving spoof of old-time musicals and beautifully done. A must-see for all fans of classic musicals. Amazingly, Shirley Russell didn't get an Oscar nomination for the fabulous costumes.<br><br>2011 UPDATE: Warners has issued a remastered DVD and the color is spectacular!","user":"drednm","rank":[57,62]},{"title":"Fantastic!!!!!!","rating":29,"date":"29 November 2003","review":"9 out of 10<br><br>     Excellent musical that should be the basis for all other musicals. Seamless, flawless, and visually stunning.  A wide variety of backdrops and settings are used.  There is everything from the conventional dance line to a fairy tale setting where the performers are dressed like ladybugs and living in giant mushrooms.  There is also a fun take off on Greek mythology done in a scenic forest setting.  <br><br>     By far the two best segments take place with them dancing on a giant record player and another with them made to look like characters on a giant playing card.  The giant record player one as got to be the most impressive because they show them on not one, but two giant record players, side by side and from overhead.  The dancers than dance on top of the giant turntables and , as a group, make unique symmetrical designs with their bodies.  It's like a old Busby Berkley number and yet almost out does even him.<br><br>     This is a rare film that can carry itself on visual level alone.  The story is at best just a standard musical plot. It involves a group of underpaid actors who put on a tacky low budget musical for a small group of people.  The film than interweaves between the low budget numbers, which are all still really good, and their visual fantasies of what things would look like if they had a big budget.  Twiggy plays the shy awkward crew hand that comes on as the star when the leading lady breaks her leg. <br><br>\n     Sure it is, at times, predictable, corny, and lightweight yet it also has a really good sense of humor.  The songs ALL have a good score and the dances are certainly fun to watch.  Twiggy may never score as a great actress, but she hits the mark here.  She has a cute bob haircut and a constantly perplexed expression that is really amusing.  All the other characters have amusing idiosyncracies also.  Jackson is fun, of course, as the injured leading lady who comes back and is none too happy to see how successful her replacement is.  <br><br>     Some of director Russell's films have been considered excessive and nonsensical. Yet that is not the case here.  His visual flair and indulgence really work.  This guy has talent.  He use of primary colors in every shot is nice.<br><br>     This is truly a visual delight that is impressive even by todays standards.  This is a really fun to watch.","user":"rwint","rank":[25,28]},{"title":"truly hilarious","rating":8,"date":"21 February 2004","review":"As hilarious today as it was in 1971, this much loved comedy is probably to musicals what Blazing Saddles is to westerns. I know that might sound odd but the analogy describes how much of a very funny send up of Busby Berkeley musicals and wobbly British seaside theatre this film really is. I saw the longer 139 min version in a 1997 reissue in Australia, and it actually is not as tidy as the shorter 109 min version originally released, It is too excessive and impromptu (cast laughing etc) whereas the shorter version does work better. However it does allow for 2 more songs and some extras in the dance numbers that you will want to see... Twiggy is gorgeous, the art direction superb and the end result hilarious and charming. Interestingly it was made because MGM fumbled the possibility of a straight stage reworking with Julie Andrews (she made Thoroughly Modern Millie instead), and by 1968 the world went to hell in the Vietnam war and street riots. The Boyfriend has aged well, and so has Twiggy. Alert viewers will see some of the same clothes previously in Women In Love because Shirley Russell used to buy the real 1920s garments from London markets and used them in several films her husband made. BRIGHT YOUNG THINGS is a good 2003 equivalent in art direction and style.","user":"ptb-8","rank":[27,31]}]