[{"title":"Brilliant!","rating":9,"date":"5 August 2006","review":"Hammer Films, the British studio famous for their horror films of the 50s and 60s, produced \"Captain Clegg\" based on Russell Thorndike's novel, \"Doctor Syn: A Tale of the Romney Marsh\". An atypical choice for Hammer, this swashbuckling melodrama had the bad luck of being produced the same year as Disney's version of another Dr. Syn novel (\"The Scarecrow of Romney Marsh\"), which forced Hammer to change the names of the characters to avoid legal issues. Disney's competition and the fact that it was not exactly a horror movie (despite being called \"Night Creatures\" in the U.S.) contributed to send the film to oblivion for several years. After being lost in limbo, \"Captain Clegg\" is finally available again, and now it's possible to see this wonderful lost treasure in all its glory.<br><br>Set back in the 18th-century, the Royal Crown suspects that smuggling is being done near Dymchurch, so Captain Collier (Patrick Allen) and his crew to investigate. After they arrive, they learn of the legends of the ghosts of Romney Marsh and the curse of the pirate Captain Clegg, but Collier believes that it's all superstitions, and continues his investigations. Collier suspects that the kind village priest, the Reverend Dr. Blyss (Peter Cushing) knows more about the smuggling that what it seems and he'll do whatever is necessary to discover the truth. Even if that means to face the curse of Captain Clegg.<br><br>\"Captain Clegg\" is a wonderful and sadly forgotten film that mixes everything that made Hammer famous in the horror genre with the classic swashbuckling adventures of old. The amazing and beautiful sets and costumes, the cleverly written plots, and the brilliant performances of the cast combine to create a terrific and very enjoyable film. The fact that its director, Peter Graham Scott had a lot of experience with drama and ensemble casts definitely was a defining factor in the result, and while certainly different than most of other Hammer films, the movie retains that certain magic the Studio gave to everything it did.<br><br>The film is a better adaptation to Russell Thorndike's novel than Disney's mainly in the fact that the screenplay (by John Temple-Smith) retains the character's anti-hero status, and plays with his dubious morality. Forecasting the renewal of cinema of the 60s, the film has not a definite good and evil, it's all gray scales and the very well constructed characters move from one side to the other in a very realistic manner. The film also makes an interesting point of how our past actions can affect us in the future. Like they did with the horror genre, Hammer modernizes the swashbuckling melodrama with great power and superb care.<br><br>The acting is the film's strongest feature and basically every member of the cast is remarkably good. Hammer regular Peter Cushing gives one of his best performances ever and he seems to enjoy the whole movie. It's a joy to watch him in a more complex character than his usual heroic Van Helsing or his wickedly evil Victor Frankenstein. Oliver Reed is also present and his performance as young Harry Cobtree is quite effective. Along with Yvonne Romain they form the romance side of the film and both of them have great chemistry. Patrick Allen and Michael Ripper complete the cast with equally good performances as the script gives everyone a chance to shine.<br><br>The film is near perfect and very enjoyable, as it delivers its mix of action, well-handled suspense and old school melodrama blends together smoothly delivering high doses of entertainment. However, some of its scenes at first sight seem definitely outdated (as always happen), later they become part of the film's charm and add to the fun of the story. It was near tragic that the film nearly got lost due to its legal problems and probably bad marketing, as while its American title and its Hammer pedigree suggest Horror, it's far from being in the genre which may turn off viewers expecting a scare-fest.<br><br>\"Captain Clegg\" is a very enjoyable film that modernizes swashbuckling films and gives the chance to watch a different side of Hammer and a wonderful performance by Peter Cushing. It's definitely a must-see and fans of period films filled with suspense and adventure will feel right at home here. A wonderful lost treasure that finally sees light again. 9/10","user":"jluis1984","rank":[29,32]},{"title":"Hammer at their very best","rating":10,"date":"18 April 2004","review":"This is one spooky film, yet there are no horror or supernatural elements per se, even though it feels like there are. Probably my favorite film from my childhood along with Disney's \"The Scarecrow of Romney Marsh\". It was years later before I discovered that they had the same source material and they were released the same year. Disney sued Hammer over rights to the character of Dr. Syn, so Hammer changed the main characters name to Dr. Blyss, and the Scarecrow became a supporting character instead of the lead.<br><br>I have to disagree with the reviewer who called this a confusing mess, as the storyline is pretty basic and quite clear cut. The movie is filled with such atmosphere that you can practically get a cough from the constant fog. The highlight of the film is the Marsh Phantoms, a group of smugglers who dress up as skeleton and ride skeleton horses. It is a very eerie sight to see. <br><br>Special mention should be made of the incredibly beautiful Yvonne Romaine. She only made a handful of films yet she may possibly be the most beautiful woman who ever appeared on screen. <br><br>I have heard that the reason this film is not available is that Universal (I think) has the rights to it and refuses to do anything with it. Sad for all of us.","user":"RDenial","rank":[29,32]},{"title":"One of Hammer's very best.","rating":8,"date":"2 February 2005","review":"While Britains's Hammer film company made their reputation with remakes of the hoary old horror staple potboilers such as their Draculas and their Frankensteins, their true strength was in the creation of relatively small budget genre films that shone with matchless originality and talent. \"Captain Clegg\" is Hammer Films at their very best. <br><br>The story concerns Captain Collier of the English Customs Service arriving in a small seaside town in search of smugglers and of his old arch nemesis, the pirate, Captain Clegg. he soon discovers that things in the village are not as simple as they seem. For a start, there are the \"marsh phantoms\" which are more than capable of frightening people to death, and then there is evidence of large quantities of illegal rum. The plot thickens as Collier seizes the trail and as the villagers fight back in ways quite unexpected for people familiar with this kind of story. Captain Clegg is a rare blend of horror, suspense and swashbuckling comedy that would not be emulated until 2003's \"Pirates of the Caribbean: Legend of the Black Pearl.\" The plot is full of twists and evil jokes and never lets anything get in the way of what is after all, simply a rollicking good yarn. <br><br>The acting is frequently nothing short of breathtaking. Peter Cushing as the Reverend Doctor Blyss is at the top of his very considerable form and delivers an masterful performance. \"Doctor Blyss\" is a fully rounded and complex antihero character of undeniable magnetism and amazing power. A young and almost unbelievably handsome Oliver Reed delivers an arch and catlike performance that with have viewers rolling in the aisles on one hand and swooning on the other. Michael Ripper delivers what may have been the performance of his career, his character, \"Jeremiah Mipps\" is worthy of the great Leonard Rossiter at his best.<br><br>\"Captain Clegg\" AKA \"Night Creatures\" is not a perfect film, but it is one which has found an abiding place in my heart. A true classic, I cannot remember it without smiling.","user":"crisotto","rank":[20,22]}]