[{"title":"Perhaps the most imaginative and entertaining nightmare ever put on film","rating":10,"date":"11 November 2015","review":"A virtual celebration of writer/director Terry Gilliam's singular creative vision and seemingly limitless imagination, Brazil is a unique movie experience. And it is kind of hard to put the label of any one particular genre on the film; it's generally referred to as \"dystopian science fiction\" (which certainly isn't wrong), but it's also a satire, a drama, a black comedy and perhaps even a fantasy film. Like many other dystopian sci-fi films (e.g. Fahrenheit 451, Equilibrium, The Hunger Games), Brazil depicts a totalitarian society, but that's about as far as the similarities with other films go.<br><br>The whole design of Brazil's crazy world is unlike anything I've ever seen in other movies (with the exception perhaps of those made by the same filmmaker). Where films with similar themes typically go for a futuristic look that is defined by all the technological advancements the writers and filmmakers can dream of, Terry Gilliam chooses the complete opposite direction. In his film, technology seems to have made no progress since somewhere around the forties or fifties, and what technology there is doesn't exactly look very reliable. And unlike other dystopian films, it's not primarily the bleak aspects of a totalitarian society Gilliam wants to explore; in his film, he wants to show how hilariously insane, inept and ridiculous many of the mechanisms and instruments of oppression truly are. In that sense, Brazil is mainly a satire (at least that's how I perceive it), and it is often either darkly funny or downright hilarious.<br><br>There is simply not a dull moment in the film: it's a wild ride that never lets up and almost every image on the screen practically bursts with clever (often hilarious) details; from the way food is served in restaurants to how the benefits of plastic surgery are presented, Gilliam's imagination can only be marveled at. His vision of a bureaucracy gone mad is probably the most entertaining nightmare ever put on film (I'm talking about the director's cut, of course). A masterpiece that gets even better after repeat viewings: 10 stars out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/","user":"gogoschka-1","rank":[145,159]},{"title":"An extraordinary movie, original, funny and frightening. Terry Gilliam's masterpiece.","rating":6,"date":"6 April 2003","review":"I really can't tell you how much my first viewing of this movie knocked me out. Nearly twenty years ago, before Terry Gilliam's reputation is what it is today, seeing this in a cinema without knowing ANYTHING about it, it was one of the most unforgettable movie experiences of my life! Still is. I was a Python fan since childhood and well aware of Gilliam's animation work, but nothing could prepare you for just how bizarre, funny, scary and disturbing 'Brazil' is. It's still one of the most original and inventive science fiction movies ever made, with a surreal, retro future quite unlike anything seen on a movie screen before or since. Gilliam mixes Python's anarchic, intellectual humour with Orwell, Kafka and Theatre Of The Absurd elements and comes up with something really special. John Sladek kinda sorta wrote some stories in a similar territory before this, and Dean Motter has written some comics since, but 'Brazil' is really in a world of its own! Jonathan Pryce was fairly obscure at the time and an odd choice to play the leading role, but is perfectly cast, and it's hard to think of an actor who would have been as convincing and sympathetic. The rest of the cast includes an amusing cameo from Robert De Niro, Kim Greist (only her second movie, after 'C.H.U.D.' of all things!) as Pryce's love interest, Python's Michael Palin, and a bunch of excellent Brit character actors - Bob Hoskins, Ian Richardson, Ian Holm, Jim Broadbent, etc.etc. It goes without saying that when I praise 'Brazil' I am ONLY referring to Gilliam's cut. This is still an utterly brilliant movie, one of the very best of the last twenty-five years. I can't recommend this movie highly enough, it is a masterpiece pure and simple.","user":"Infofreak","rank":[297,349]},{"title":"Perhaps the greatest of all films","rating":10,"date":"18 October 2002","review":"I have read a lot of understandably negative reviews of the movie 'Brazil.' Brazil(in its proper form) is a long film at well over two hours, it has many cutaways to dream sequences that are only loosely related to the rest of the film, and the narrative story is not always the driving force of the film which many people find confusing.  With all these things going against it, Brazil is clearly not a film for everyone.<br><br>All that being said, Brazil is my very favorite movie.  Those things previously described as reasons that some people will dislike the movie are the very reasons I love it.  The story is both simple and complex depending on how you look at it, and this kind of paradox is what makes for great art. There, I did it!  I used the 'A' word, and not lightly.  Brazil is an art film, and don't let anyone tell you otherwise.<br><br>Sam Lowry(Jonathan Pryce) is our hero, an unambitious bureaucrat within the ranks of the Ministry of Information.  The only place he is willing to be more than a drone is in his dreams where he is some sort of angelic knight fighting to save his dream girl.  While running an errand for work, Sam comes face to face with a woman who is the very image of the dream girl, and his life is forever changed when he surrenders his tranquil unambitious life in the attempt to pursue the woman.<br><br>This movie is less about the story than it is about the atmosphere in my opinion.  Terry Gilliam is a visual genius, and this movie marks his peak(so far) in producing a visually stunning film, with due apologies to Adventures of Baron Munchausen and 12 Monkeys which are beautiful in their own rights. The oppression of the bureaucratic life is felt by anyone who watches this film, and the freedom experienced in the dreams is a fantastic counterpoint. This film does a wonderful job of evoking emotional responses for me, and I suspect for most of the fans of the film as well.<br><br>The film can be viewed at many different levels of complexity, from fairly simple to fully allegorical.  The simple view would be that the movie is about the dreams we create to escape our dull lives, and the potentially disastrous results of pursuing them in waking life.  Symbolically the film can be interpreted as a vicious attack on the status quo as an impersonal, consumer/beauty oriented beast that is upheld by a draconian adherence to regulations and invasive public policy.  There are many other ways to see it, most of which are probably unintended, but certainly completely valid.<br><br>The best part about Brazil is that it is absolutely hilarious.  Jonathan Pryce shows remarkable aptitude for physical comedy.  The dialogue is as funny as any movie you'll ever see, though the humor is very dry, and often so subtle that you might not get a joke until a minute after it has passed. There are the occasional tidbits of out loud guffaws one would expect from a script that was partly written by Tom Stoppard, but there is not a constant barrage of this material.<br><br>Brazil is a very cerebral film, so if you are thinking, \"What does cerebral mean?\" you can probably skip it.  Anyone who expects to have a story clearly spelled out for them, and done so in a concise manner with little background interference will hate Brazil.  Brazil is a film for those who want texture, emotional involvement and some sort of deeper meaning.<br><br>Brazil is my favorite movie, but it is clearly not for everyone!","user":"JackLint","rank":[668,806]}]