[{"title":"Cinema at its best!","rating":10,"date":"12 April 2002","review":"Each time I see this film, I know how truly wonderful cinema can be at its best. This film, which amazingly is 16 years old (don't know where the time went - frightening!!) is still as fresh, witty and engrossing as it ever was. The story revolves about a group of academics, getting ready to attend a dinner party, the men and women separately(prior to the dinner) discussing with each other their lives loves hopes and fears - sounds dull doesn't it? Well dont you believe it!! Considering its such a dialogue based film, the time flies by due to the superb performances by all involved. Yves Jacques is outstanding as the gay character, whose facial expressions and body language in the film convey what only an actor of the finest calibre could. Louise Portal as the unattached woman longing for a meaningful relationship is also worth a mention amongst the cast. I enjoyed this film so much, that I turned my rusty 'o' level French into fluency so that I could appreciate other French language movies fully, prompted my first visit of several to Montreal where once I actually, believe it or not, bumped into Remy Girard (one of the actors) in the street and started a lasting love of non-English speaking /and or art house movies when previously I had only watched popular box office. I can't guarantee you will love this movie as much as I do, but if you approach it with an open mind, I am sure that you will thoroughly enjoy it. By the way, its about time this movie was released on DVD, especially when you consider some of the junk which has!!!","user":"hesketh27","rank":[25,27]},{"title":"A serious comedy","rating":8,"date":"24 July 2006","review":"If you do not like dialog driven movies, then you will not like this, since it consists primarily of talk about sex with some general philosophizing added. With \"The Decline of the American Empire\" I don't know if director Arcand has served up a sweet dessert with a core of bitter almonds or a drink of Angostura bitters sweetened with a sugar cube. I lean toward the latter. <br><br>I liked the leisurely pace of the opening credits which play over a long tracking shot moving down a long concourse terminating in our meeting two of the main characters - Dominique and Diane. Diane, a journalist for \"Writers Today,\" is interviewing Dominique about her new book, \"Changing Concepts of Happiness.\" Right up front we are introduced to the main thesis which is that a society is in decline when it becomes more concerned with individual happiness and instant gratification rather than with the general good. In such a society people resist sacrifice and marriages break down as people pursue personal happiness. What happens in the rest of the movie illustrates the point.<br><br>In short order we are introduced to two more women, Louise and Danielle, who are working out in a gym. They are joined by Diane and Dominique and, during their workouts, the women discuss in intimate detail some of their past sexual exploits.<br><br>Then we are introduced to four men (Remy, Pierre, Alain, Claude) who are preparing an elegant dinner for the four women we have already met. Remy, Pierre, Claude are faculty in the history department of a Quebec university and Alain is a student. Dominique is the chairman of the department, Diane is a teaching assistant there, Louise is the wife of Remy and Danielle is Pierre's partner and an undergraduate, so it's a pretty close-knit bunch of intellectuals. As the men prepare the meal they talk endlessly about their sexual exploits as well, but, as can be imagined, the tone of their conversation is a bit different from the women's. We are clearly well into the post sexual revolution era as much adultery is confessed and sexual fantasies revealed, and Claude's homosexuality is totally accepted. It is an ironic twist that the men are preparing dinner and the women are in the gym, *but* the women are in the gym so that they can be more sexually attractive to men.<br><br>I asked myself why I found the men's banter more entertaining than what I have overheard many times in men's locker rooms, and the answer is that it is witty and literate rather than crude and unimaginative. Perhaps more importantly all the actors seem to be having such fun and deliver their lines with such enthusiasm that it rubs off. Also, while \"The Decline of the American Empire\" is no \"Big Night,\" the dinner preparations and ultimate product are not without interest. Unless you are a gourmet cook, you will learn, as I did, about \"vesiga,\" \"velouté,\" \"coulibiac,\" and \"mousseline.\"<br><br>And there are some special treats like when the four men act out a little dance about how they have to engage in that activity to please their women. While dancing they give voice to topics that they pretend interest in, for the same purpose. Their dance is clever, tightly choreographed, and hilarious.<br><br>The musical score is suitably highbrow, with a little help from Handel and Francois Dompierre.<br><br>So, why do I think that \"The Decline of the American Empire\" is ultimately depressing? Because it illustrates too well the destructive effects of the selfish pursuit of personal happiness, particularly with regard to sexual gratification. None of the relationships here is stable. And the philosophizing at the end espouses a cynical pessimism that intellectuals seem particularly good at. There is discussion to the effect that people should speak about what they know, and that's it. For example, \"the Pope knows all about masturbation and prostate ailments. He can talk about that - and the CIA. Don't underestimate the Pope.\" The group goes on to skewer Marx, Freud, Jung, sociologists, psychologists, and even themselves. They quote Wittgenstein to justify some of their behavior: \"Our only certainty is to act with our bodies.\" Academics, you gotta love 'em.<br><br>If you go on to see the sequel, \"The Barbarian Invasions\" (same actors, same characters, seventeen years later) you will see that Remy's life is a metaphor for the more general thesis expounded in \"The Decline of the American Empire.\" Each movie stands alone, but each benefits from having seen the other.","user":"bandw","rank":[17,19]},{"title":"Personal Luck Addiction","rating":9,"date":"25 June 2007","review":"The title sounds like as if it comes from Ancient Rome, and in a very galvanized way, this witty-sarcastic tragicomedy from Canada has something to do with it: The easier is life, the looser are the dos. And that is why during a country house weekend stay all the participating intellectual bourgeois charmers, who usually teach history and write books, waffle about sex, sex and sex, while they kick at the fitness center (the women) or prepare a fish plate in the kitchen (the men).<br><br>With perfidious lust Denys Arcand contra-dots male and female sex fantasies. When you listen to the gent club between stove and sink, your ears seem to fall off. When you hear the rants of the lady squad between sauna and bodybuilding, the ears of the gents ought to fall off. However, after the gender cliques unite at the table for dinner, a more complicated inner life becomes visible beneath all these ludicrous orgasm rants from before. Friends came together here who are kind to, who lie to, who hurt each other. Bitterness and resignation, but also safety and tolerance remain in the autumn dawn. And after all, it's a film of a verbally disarming sexual humour, adorably acted and with gentle ironies of absurd experiences of life: The human being is multifaceted. Simple are only theories.","user":"zolaaar","rank":[13,16]}]