[{"title":"Sternberg, Dietrich reach their zenith in opulently photographed romantic intrigue as extraordinary today as it was 70 years ago","rating":10,"date":"3 January 2003","review":"When Josef von Sternberg's Shanghai Express chugs out of Peking, squeezing through a teeming alleyway as it picks up steam, it marks the start of a momentous journey  not only for its motley of passengers but for Hollywood. In this fourth teaming of the Svengali-like director and his Trilby of a star  Marlene Dietrich  they reach the zenith of their legendary collaboration and strike a template for the kind of movies America would do best and like best: voluptuous hybrids of adventure and intrigue, romance and raffish fun.<br><br>Leaving for Shanghai to operate on the stricken British Consul-General, army physician Clive Brook climbs aboard only to find the woman he loved but lost five years ago (Dietrich). Now, however, she goes by another appellation; as she explains, in the script's most emblematic line, `It took more than one man to change my name to Shanghai Lily.'  Her presence on the train, and that of one of her sisters-in-sin (Anna May Wong) is cause for scandal and indignation among the other passengers: prim boarding-house proprietress Louise Closser Hale (with her pooch Waffles smuggled on board); sputtering man of the cloth Lawrence Grant; sardonic gambling man Eugene Pallette; a Frenchman; a German; and the inscrutable, pre-Charlie Chan Warner Oland.<br><br>Soon, China being embroiled in a civil war, they have more to worry about than Dietrich's morals.  Rebel troops halt the journey lead the passengers, one by one, to be interrogated by their warlord, who turns out to be Oland. The various eccentricities, secrets and agendas of the passengers get brought into the open, affording Oland opportunity to avenge any number of racial and personal slights.  But finally he finds what he's been looking for  a valuable hostage to serve as a bargaining chip  in Brook.  And from then on Shanghai Express becomes a drama of reckoning, with all the characters scheming to save their own (and occasionally one anothers') skins.<br><br>None of the players can be faulted, except for Brook, who gives a dead-earnest impersonation of the stick that stirs the fire; that Dietrich should have fallen for him is like believing several impossible things before breakfast.  (Cary Grant was around in 1932; too bad Sternberg didn't catch up with him until his next movie, Blonde Venus.)  But in his handling of Dietrich, Sternberg all but patents what came to be called star treatment.  Stunningly lighted, her feline face is caught in a breathtaking range of moods and attitudes.  But she's more than a passive vessel for the director's intentions  her blend of worldly savvy and steely spine is hers and hers alone.<br><br>She isn't the only beneficiary of Sternberg's eye.   He shoots the movie in a haunting, intense chiaroscuro (few movies from this early in the 1930s were so richly and handsomely photographed).  He cuts from scene to scene teasingly, layering new shots on fading images, adding a little rubato to relate incidents of the story to one another.  Shanghai Express may be the first masterpiece of the sound era, one that's still no less extraordinary today than it was 70 years ago.","user":"bmacv","rank":[73,79]},{"title":"An \"Oh my God!\" movie from the early 30's","rating":10,"date":"15 May 2018","review":"Every frame, with Marlene Dietrich in it, is a masterpiece of lights and shadows. The artistic marriage of Dietrich and his director Josef Von Sternberg is all consuming and therefore we're trapped, happily so. Look at what the camera does with Dietrich's face when she delivers the iconic line: \"It took more than one man to change my name to Shanghai Lilly\" I had to rewind immediately and see the moment again, one, two, three times. Dietrich is dressed, lit and photographed like a goddess, the human kind. I wonder if we're ever going to see the likes of her, the likes of them, ever again.","user":"fanaticusanonymous","rank":[34,36]},{"title":"A dream of a ghostly train and shades of black","rating":29,"date":"29 August 1999","review":"Shanghai Express is another von Sternberg masterpiece, probably not appreciated in his day (no academy awards) and lesser known that it should be in this day.  Film theory says this film was an attempt to shade degrees of blackness.  At one point, Marlene Dietrich's face blooms like a white flower out of the shadows, then closes again.<br><br>Beautiful is not a big enough word enough to describe the cinematography in Shanghai Express.  The plot is dreamlike and unrealistic (Sternberg hated realism), the costumes are excessive (impossible to contain in Dietrich's supposed luggage), the atmosphere is deliciously layered with decadence, exoticism (good part for Anna Mae Wong) and deterioration (broken walls, slats and fantasies), punctuated by von Sternberg's caprice (chickens wandering in front of the train -- a symbol of Dietrich's husband's profession as a chicken farmer?).  <br><br>The storyline is basically a broken romance seeking to be healed between Clive Brook and Dietrich or \"Shanghai Lily,\" the naughty lady who has sold her body the past few years to keep herself in glittery costumes and furs.<br><br>The real \"story\" is \"Dietrich and von Sternberg visit China\" on some movie lot, on their way from or to Russia (The Scarlet Empress), Spain (The Devil is a Woman), North Africa (Morocco), or somewhere in the U.S. (Blonde Venus).  <br><br>Gorgeous and lots of fun!","user":"Lin-4","rank":[37,41]}]