[{"title":"Average","rating":4,"date":"4 August 2009","review":"The premise is promising—a cavalry garrison divided evenly between Northerners and Southerners on the eve of the Civil War. That's inside the fort. On the outside is a riled-up Sioux nation looking for white-man scalps that the rebs will have to ride through if they want to get to Dixie. So who would want to be the commanding officer with killer complications of this sort. And if that's not bad enough, add a wagonload of gold due at the fort that the budding Johnnie-rebs want to take south. Poor Major Bradner, he has an oath to the army, but family roots in the South. So there's more than enough plot for any 70-minute movie. Then too, Bel Air Productions popped for scenic Kanab, Utah locations that produce a lot of commanding red rock scenery even if the terrain looks nothing like Laramie-area Wyoming. <br><br>So, with these promising ingredients, why aren't the results better than they are. In my book, the acting lacks the intensity that these conflicting cross-currents should realistically produce. Basically, the actors (even the great John Dehner) stand there and speak their lines, but without much feeling, so the drama never really gels the way it should. I guess director Selander's specialty is action and not acting. Still, there are a couple of good battle scenes— especially the unusual skirmish between soldiers on rafts and Indians on the riverbank. Anyhow, if you're not too expectant, this is a decent enough oater made at the peak of the Western craze of the 1950's.","user":"dougdoepke","rank":[14,14]},{"title":"Not revolting at all.","rating":6,"date":"7 August 2017","review":"Revolt at Fort Laramie is directed by Lesley Selander and written by Robert C. Dennis. It stars John Dehner, Gregg Palmer, Frances Helm, Don Gordon and Robert Keys. Music is by Les Baxter and cinematography by William Margulies.<br><br>Upon watching this above average Oater one word kept coming to mind, brief! Be it the battle scenes, the finale and of course the running time, it'as all so brief. Which when you have such a powder-keg premise at the core of the pic, is hugely annoying.<br><br>We have the Fort of the title made up of Southern and Northern soldiers, all standing together to repel the Red Cloud led Sioux Army. Then the First Battle of Fort Sumter opens on April 12, 1861, and what was once a harmonious force is now divided. Into the mix is shifty shenanigans involving gold, a lovers relationship under strain and murder! If only we could have had a bigger budget, another thirty minutes run time, and someone to throw a firecracker over it and BOOM!<br><br>Still, it's an entertaining piece with well staged battles - one a siege and one on the river - good scenes such as the opposing soldiers singing against each other with their respective \"homeland\" anthems, and fun moments like Dehner's Major Bradner being restrained in leg irons to stop him sleepwalking to his doom! Baxter's score is mostly standard stuff but occasionally shows inspiration like incorporating the said North/South anthems, while the Kanab locations are beautifully utilised (so not Laramie then? So what). <br><br>If only everything wasn't so brief. Grrrr. 6/10","user":"hitchcockthelegend","rank":[5,5]},{"title":"\"Major, you are in command of a troop of imbeciles!\"","rating":7,"date":"2 January 2017","review":"I can't tell you how many Civil War films I've seen that pitted brother against brother, but this story had an interesting idea I haven't seen before. It had to do with a Cavalry outfit literally days before the start of the Civil War that's sent into turmoil when news is announced that Confederate forces have fired on Fort Sumter. I guess it's something you don't think about in history class, but here you had Southern soldiers ready to break with their Northern counterparts over their divided loyalties while serving together at a remote Western post. The kicker here is that a warring tribe of Sioux are waiting nearby to receive a ransom payoff to keep the peace, but now the Southern cohort has their eyes on a gold shipment that was intended for that purpose.<br><br>If all that weren't enough, you have your Northern soldier (Gregg Palmer), Southern belle (Frances Helm) romance that's threatened by the new circumstance. The Major in charge of the fort is himself a Virginian, and in a scene I wouldn't have expected, Seth Bradner (John Dehner) promotes Captain James Tenslip (Palmer) to the same rank in order to resign his post and lead the Southern sympathizers across Indian territory on their way to a Confederate assignment.<br><br>Sioux Chief Red Cloud (Eddie Little Sky, cool name!) doesn't quite know how to process this bit of information, so holds Major Bradner in exchange for the ransom they expected in the first place. Tenslip sees it as his duty to come to the rescue of his former brothers-in-arms, and leads his forces to battle the Sioux, but the film ends rather abruptly when the fighting's over, with the Southerners continuing to go on their way. It all ended rather anti-climactically, but at just over an hour, the story didn't leave much time to reflect on what just happened.","user":"classicsoncall","rank":[5,5]}]