[{"title":"Deodato's Bizarre Horror/Action Experiment","rating":14,"date":"14 April 2006","review":"Cut and Run is one of Deodato's strangest films due to the bizarre mix of genres. The film balances horror, action and adventure elements with gritty cocaine smuggling and hostage situation subplots. There is even an Apocalypse Now inspired crazy Colonel living with natives in the jungle. To say that the film bites off more than it can chew is an understatement, but that the fact that the film works at all is a great testament to Deodato's unique talent.<br><br>There is little point passing comment on the film's plot because it virtually makes no sense. There is, for example, no explanation at how the Indian killings in the Amazon jungle simultaneously take place in Miami and the entire subplot involving Colonel Horne remains a mystery. The jumbled plot does have the advantage of giving Deodato the opportunity to dabble in different genres and he shows yet again why he is such an underrated filmmaker. Deodato's direction is technically brilliant and he brings his usual sense of flair to the film's action and horror set pieces. The dramatic moments are less successfully handled and unusually for a Deodato film, some sentimentality creeps in towards the end of the film.<br><br>The film really picks up every time the Indians attack. Horror fans might be annoyed by the infrequency of the gore, but when the killings do occur, Deodato does not disappoint. There are beheadings, spears through the neck, darts in the neck and one of Deodato's best ever deaths when a man is literally ripped limb from limb (according to Deodato, inspired by the Vietcong). Part of the fun is watching legendary genre actor Michael Berryman camping it up as a demented Indian. He has several great moments in what is one of his more memorable roles. The other actors are also pretty good. Lisa Blount makes an impression as Fran and Richard Lynch always does a good job of acting crazy, making a perfect Colonel Horne.<br><br>Also worth a mention are Claudio Simonetti's great synth score and the beautiful photography of the jungle landscape (Venezuela doubling for Colombia). Fans of Deodato should check out the accompanying \"Uncut and Run\" documentary in which Deodato rather amusingly talks about the shoot, stealing Wes Craven's job as the director and even bluntly says which actors he did not enjoy working with. Cut and Run might lack cohesion but it remains a highly enjoyable minor work from a truly great director.","user":"Crap_Connoisseur","rank":[14,14]},{"title":"Run through the jungle.","rating":7,"date":"28 December 2015","review":"From Ruggero Deodato, the infamous director of \"Cannibal Holocaust\", comes this return to gory and sadistic jungle-based goings-on. It's an interesting mixture of the Italian jungle genre (albeit without cannibalism), drug-based action pictures, and blood and guts horror. Overall, it doesn't make nearly the same impact as \"Cannibal Holocaust\", but it's still a solid diversion for any cult movie lover who is into this sort of thing.<br><br>Lisa Blount and Leonard Mann play reporter Fran Hudson and her cameraman Mark Ludman, who are hot on the trail of a story involving wars between competing drug cartels. They come to realize that a man named Brian Horne (Richard Lynch) is involved. It turns out Horne was a prominent associate of the notorious cult leader Jim Jones. Fran and Mark are also trying to find Tommy Allo (Willie Aames), son of their boss Bob (Richard Bright); Tommy has been prisoner to one of these cartels for some time.<br><br>As you can see, there are a fair amount of familiar American actors in this rousing bit of entertainment. Karen Black makes a \"special appearance\", a young Eriq La Salle plays an informant, and the legendary cult actor Michael Berryman turns up repeatedly as a relentless and REALLY nasty white henchman. His scenes tend to be the most fun. Blount doesn't look too happy to be here, and Aames is too whiny and annoying, but the rest of the cast do some good work. Sexy Valentina Forte, Deodatos' girlfriend at the time, exploitation veteran John Steiner, Barbara Magnolfi (\"Suspiria\"), and Ottaviano Dell'Acqua (the worm eye zombie in \"Zombi 2\") co-star.<br><br>One gory highlight involves a person being ripped in half. The location shooting adds a lot of atmosphere. And ever reliable Claudio Simonetti of the groups Goblin and Daemonia composed the groovy music score.<br><br>Not too memorable once it's over, but it does hold ones' attention.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[7,7]},{"title":"Ruggero Deodato delivers in this violent action-adventure","rating":7,"date":"24 January 2000","review":"From the director of Cannibal Holocaust - undoubtedly one of the most impressive movies ever made - comes this action packed thriller about drug dealing and ruthless murder. The film has also a strong adventure-oriented impact that makes other adventure-films as the Indiana Jones-trilogy look like The Adventures of Winnie Pooh (oops - I'm not even sure how to spell this cuddly bear...). Michael Berryman and Richard Lynch give fine performances, and make sure you get the strong uncut version of this film: unfortunately, it was released in two different cuts, the more common one looks like an arbitrary action movie, while the rare version is packed with gross gore FX that strengthen the impact of this enjoyable pic.","user":"rundbauchdodo","rank":[9,12]}]