[{"title":"Class Act","rating":8,"date":"6 November 2004","review":"Mysterious puzzle of who or what is behind a young girl, having just returned from a boarding school in the English countryside, becoming increasingly paranoid and psychotic. The girl witnessed her mother killing her father years ago and has nightmares of the event. She believes that she has the same mania and starts seeing her mother, other apparitions, and various things connected with the event that happened on her birthday so long ago. She is heir to the house, but her uncle manages her estate. A nurse is supplied for her and the home is run by an elderly couple of servants that have been with the family for a long time. What starts out as something you keep thinking you have seen before - swiftly and adroitly changes direction and becomes something I had never seen before. This is above all a well-crafted film made with creating suspense and maintaining suspense as its primary objectives. Director Freddie Francis, the Hammer stalwart, directs with his usual keen, meticulous detail for the lens. He paces the film very nicely, and he is aided by very good performances from all concerned. The real credit for the film's success though must go to veteran Hammer writer Jimmy Sangster. Above all this is a script-driven vehicle. Certainly one of the lesser known Hammer horror films but definitely one of the better psycho films I have seen.","user":"BaronBl00d","rank":[25,27]},{"title":"Clever but grim screenplay; haunting images.","rating":8,"date":"5 May 2001","review":"Jimmy Sangster's screenplay for \"Nightmare\" is an excellent contemporary (early 1960s) thriller with Gothic touches. However, the script falters about halfway through when the young heroine Janet, who has been driven almost out of her mind by a series of terrifying events, is removed from the action of the story.<br><br>Instead of centering the action of the second half on characters sympathetic to the heroine who might take up her cause, identify the conspirators and bring them to justice - as happens in, for example, \"Psycho\" - the script reveals to the audience who the conspirators are, and then, until the final scene, makes them the center of the action.<br><br>It is asking a lot of an audience to identify with those whose machinations have brought about the committal of a sympathetic heroine, and this may well explain why the second half of \"Nightmare\" is less gripping than the first - especially as the plot of the second half is a variation on what has gone before, this time with an unsympathetic character experiencing terrifying events. This part of the screenplay also stretches credibility, since it seems unlikely that an antagonist with an alert and cunning mind would not detect a plot which is dividing him from his female accomplice.<br><br>The real strength of \"Nightmare\", however, is in director Freddie Francis' visual flair. A former cameraman/director of photography, using black and white 'scope and obviously influenced by his work on Jack Clayton's \"The Innocents\", he succeeds in creating a real sense of fear and isolation around his vulnerable heroine.<br><br>He achieves this by using the expanse of the 'scope frame, often surrounding Janet with shadows or, in daylight, setting her in a frame devoid of anything or anybody reassuring. For example: when Janet travels home from school, the railway station is almost deserted; we do not see the departing train from which she has presumably just alighted. There are no other cars on the road as she is driven home. As they pass the asylum she dreads, there are no signs of human activity within the grounds. Once back home she is dwarfed by the mansion \"High Towers\" she has become heir to, and her isolation is compounded by her home being located in remote snow-covered countryside.  <br><br>Janet's isolation is social as well as physical; ostracized at boarding school in the early scenes, and clinging to a grotesque doll and a small transistor radio, she is never seen with anyone her own age (mid-teens). Her only friend at the school is a sympathetic teacher. At \"High Towers\" the guardian she dotes on, Henry Baxter, is at least twice her age - as are her other household companions.<br><br>In addition to traditional Gothic trappings (heroines wandering dark corridors in flowing night-dresses, candlelight illumination, door handles seen turning slowly and ghostly nocturnal figures) Freddie Francis endows several everyday objects with fearful connotations - Janet's doll, her transistor radio that forever blares out fast jazz, and above all, a birthday cake with lighted candles. The latter becomes a powerful image of dread, since it was on Janet's eleventh birthday the horrific event occurred that started the cycle of nightmares and fear of inherited insanity.<br><br>\"Nightmare\" has a particularly bleak atmosphere: most of the action is set during a harsh winter, the dialogue has virtually no humor and the ending - which should give the audience a sense of satisfaction - is grimly downbeat. This is probably because in achieving justice for Janet, her sympathizers have virtually duplicated the methods of the conspirators and brought about a similar result - a gruesome death and a woman on the edge of madness.<br><br>Highly recommended viewing.","user":"rockallnight","rank":[21,23]},{"title":"A diamond in Hammer's list of lesser known films","rating":7,"date":"14 October 2005","review":"I've been a fan of Hammer horror for a while, and have only recently discovered this whole new side of theirs. Hammer have become synonymous with fun horror films, but their serious little black and white flicks show that they're certainly not limited to doing just what we know they're good at! Like Freddie Francis' Paranoiac a year earlier, Freddie Francis' Nightmare works through it's thick macabre atmosphere, tight plotting and great acting performances. The film is also very paranoid, which helps you to get under the skin of the plot and into the heads of the characters. The film starts off following young Janet. Janet's mother stabbed her father to death on her birthday many years ago and has spent her life in an insane asylum ever since. Janet is now having horrible dreams of her mother, and fears that she may go the same way...but after being sent home, her problems really start. The plot for this film is odd because once we reach the half-way point, it makes a full turnaround and we begin following two of the smaller characters from the first part of the film.<br><br>The second half of the story is definitely more interesting than the first, so the switch is a good thing as far as I'm concerned. This film appears to have been an obvious influence on Pete Walker's exploitation flick 'Frightmare', as the two follow pretty much the same theme. Hammer's version of the story is far better, though. The ensemble cast here are excellent, with everyone giving a terrific performance. Jennie Linden is convincing as the young girl being terrified by her dreams and more than does justice to the role. The greatness of the plot can be summed up by the fact that I often find myself giving low ratings to Hammer's black and white films, simply because I love to see the colours that Hammer do so well. This film is so professionally handled, however, that the lack of colour doesn't harm the film at all - and actually helps it. The atmosphere would never be the same in colour, and the colours are made up for anyway by the wonderful use of lighting. On the whole, this isn't one of Hammer's most important films - but it is a very good one, and I highly recommend it! Just one thing to note...it's not recommended that you watch this film with a headache - there's a lot of screaming!","user":"The_Void","rank":[20,22]}]