[{"title":"Excellent","rating":10,"date":"1 July 2000","review":"An excellent courtroom drama with a unique twist. Instead of following the trial itself, the viewer has a unique chance to observe the events behind the closed doors of a jury room. The film begins with the end of the trial. The jurors retire to deliberate the case. A preliminary vote is taken and the result is 11:1 in favour of the guilty verdict. Eleven jurors have raised their hands to convict a young man of killing his father. Only Juror #8 has doubts. At first even he does not truly believe the young man to be innocent but notes (rightfully) that the case for the defence might have been presented in a more convincing manner and that the boy might be given the benefit of a doubt. Since the boy is to be executed if found guilty his life is now in the hands of the jury and juror #8 reasons that the least they could do is talk about the case a bit. As time goes on some of the jurors change their minds and find that there is perhaps enough reasonable doubt not to convict the young man after all. But not everyone is easy to convince.<br><br>Although the plot of the film is excellent and it is fascinating to see what little things can influence which way a verdict goes, where this film really succeeds is in presenting the characters of the 12 jurors. The character of each of the jurors emerges through a wonderful mix of perfect casting, excellent dialogue and near-flawless acting.<br><br>Juror #1 - a simple man who clearly does not understand the full complexity of the task that lies before him but is trying to do everything not to let anyone else find this out. He appears at ease only once during the film - when he talks about football. He has the misfortune to be selected foreman of the jury - a task he clearly does not relish.<br><br>Juror #2 - a small, quite man, clearly unaccustomed to giving his own opinion much less to expecting his views to be of any importance. Apparently he finds solace in his job - he is an accountant.<br><br>Juror #3 - probably the most complex personality in the film. Starts off like a pleasant self-made successful businessman, he analyses the case impartially, explains his arguments well and is reasonably self assured. As time goes on he becomes more and more passionate and seems to be somehow personally involved with the case.  He also starts to show some signs of slight mental instability. Wonderfully played by Lee J. Cobb - this is the character you remember after the film is over.<br><br>Juror #4 - self assured, slightly arrogant stockbroker. Obviously considers himself more intelligent than anyone else in the room, he approaches the case with cool heartless logic but (as one of the jurors says - \"this is not an exact science\") he does not take into account the feelings, the passions, the characters of the people involved in the case. He is conspicuous by the fact that he is the only juror that does not take his jacket off (it is a very hot day).<br><br>Juror #5 - here is a man under great emotional stress. He comes from the same social background as the accused boy - with who he almost unwillingly seems to identify with. Paradoxically this appears one of the main reasons for him voting guilty - he does not want compassion to influence him - so ironically it does.<br><br>Juror #6 - a simple man, quite readily admitting that everyone in the room is better qualified than he is to make decisions and offer explanations. But he really wants to see justice done and it worries him that he might make a mistake.<br><br>Juror #7 - the only one that really has no opinion on this case. Literally throughout the film his thoughts are never on the case - he talks of baseball, of the heat, of fixing the fan but the only reason he has for voting this way or that is to speed things up a bit so he might be out of the jury room as soon as possible. Not an evil man he just has no sense of morality whatsoever - he can tell right from wrong but does not seem to think it's worth the bother.<br><br>Juror #8- a caring man, has put more thought into the case than any of the other jurors. He tries to do his best even in the face of seemingly impossible odds.<br><br>Juror #9 - a wise old man with his great life experience has quite a unique way of looking at the case.<br><br>Juror #10 - the most horrifying character in the film. Votes guilty and does not even try to hide the fact that he does so only because of the boy's social background. The tragedy comes from the fact that his own social position is only a cut above the boy's - which makes him all the more eager to accentuate the difference.<br><br>Juror #11 - an immigrant watchmaker, careful methodical man, well mannered and soft spoken. respects the right of people to have different opinion to his - and is willing to look at both sides of the problem. Loses his temper only once - horrified by the complete indifference of juror #7.<br><br>Juror #12 - a young business type - perhaps he has his own opinions - but is careful to hide them. What he has learnt out of life seems to be that intelligence is equal with agreeing with what the majority of people think.<br><br>The film succeeds in doing something very rare today - developing an intelligent plot while also developing 12 believable, memorable and distinct characters.","user":"vukodlak","rank":[748,812]},{"title":"No bombs, no car chases but edge of the seat stuff none the less","rating":10,"date":"18 September 2002","review":"This film is superb, in fact as Shakespeare once said \"Its the bees' knees\". The film captivates the audience from the beginning.  Each of the twelve jurors are introduced to us as they are introduced to themselves. The characters are well draw out and individual, each with his own personality.<br><br>The tension of the characters draws the audience in from the start.  We imagine that the case is open and shut, 11 me saying guilty and 1 not.  We feel the discomfort of Henry Fonda as the other characters belittle and mock how he can see any reasonable doubt in the case.  But we also share his victories and the enthusiasm as he proceeds to refute or add doubt to the arguments for guilty and are captivated and draw in as other jurors begin to see doubt in the proceedings.<br><br>The audience can also see the arguments for guilty and wonder if Fonda's character is correct in saying that he doubts. Yet they also feel the shame of the characters as he disproves that a previously sound theory is iron tight, joining his side as members of the jury do.<br><br>On top of this they are wonderfully woven in human elements such as the misconceptions that influence people and the growing tension between different characters.  This is brought to life even more by the amazing performances, Fonda, Lee J Cobb and Joseph Sweeney are of particular note.<br><br>I started watching this film on a bored relaxed laying about day but by the end i was on the edge of the seat with my hands on my knees feeling more tense than a politician on results day.<br><br>How a film should be made.  Modern directors take note(thats ur telling off for the day) 10/10","user":"Andrew Devonshire","rank":[579,638]},{"title":"Simple but great.","rating":9,"date":"23 October 2004","review":"'12 Angry Men' is an outstanding film. It is proof that, for a film to be great, it does not need extensive scenery, elaborate costumes or expensive special effects - just superlative acting.<br><br>The twelve angry men are the twelve jurors of a murder case. An eighteen-year-old boy from a slum background is accused of stabbing his father to death and faces the electric chair if convicted. Eleven of the men believe the boy to be guilty; only one (Henry Fonda) has doubts. Can he manage to convince the others?<br><br>The court case provides only a framework, however. The film's greatness lies in its bringing-together of twelve different men who have never met each other before and the interaction of their characters as each man brings his own background and life experiences into the case. Thus, we have the hesitant football coach (Martin Balsam), the shy, uncertain bank clerk (John Fiedler), the aggressive call company director (Lee J. Cobb), the authoritative broker (E.G. Marshall), the self-conscious slum dweller (Jack Klugman), the solid, dependable painter (Edward Binns), the selfish salesman (Jack Warden), the calm, collected architect (Fonda), the thoughtful, observant older man (Joseph Sweeney), the racially bigoted garage owner (Ed Begley), the East European watchmaker (George Voskovec) and the beefcake advertising agent (Robert Webber) who has plenty of chat and little else.<br><br>Almost the entire film takes place in just one room, the jury room, where the men have retired to consider their verdict. The viewer finds him or herself sweating it out with the jury as the heat rises, literally and metaphorically, among the men as they make their way towards their final verdict. Interestingly, the jurors (apart from two at the end) are never named. They do not need to be. Their characters speak for them.<br><br>Henry Fonda is eminently suitable and excellently believable as the dissenter who brings home the importance of a jury's duty to examine evidence thoroughly and without prejudice. Joseph Sweeney is delightful as Juror No. 9, the quiet but shrewd old man who misses nothing, whilst E.G. Marshall brings his usual firmness and authority to the role of Juror No. 4. All the actors shine but perhaps the best performance is that of Lee J. Cobb as Juror No. 3, the hard, stubborn, aggressive, vindictive avenger who is reduced to breaking down when forced to confront the failure of his relationship with his own son.<br><br>Several of the stars of '12 Angry Men' became household names. Henry Fonda continued his distinguished career until his death in 1982, as well as fathering Jane and Peter. Lee J. Cobb landed the major role of Judge Henry Garth in 'The Virginian'. E.G. Marshall enjoyed a long, reputable career on film and t.v., including playing Joseph P. Kennedy in the 'Kennedy' mini-series. Jack Klugman was 'Quincy' whilst John Fiedler voiced Piglet in the 'Winnie The Pooh' films and cartoons.<br><br>Of the twelve, only John Fiedler, Jack Klugman and Jack Warden* are still alive. Although around the eighty mark, they are all still acting. The film was still available on video last year and it is shown on t.v. fairly frequently. I cannot recommend it too highly!<br><br>(*John Fiedler died June 2005. Jack Warden died July 2006.)","user":"juho69","rank":[503,560]}]