[{"title":"A timeless classic","rating":10,"date":"23 November 2003","review":"Oh, come on, IMDb users. How could this film get only a 6.5? Yes, it's a kid's movie, but I know plenty of adults(not including myself) who loved this film. It touches our hearts, and tickles our funny bones. Not to mention I think in one way or another we could relate to it. That's why it remains a classic Christmas comedy.<br><br>Home Alone is not only one of the highest box office successes of all time, but it deserves more praise. Mac showed a talent that very little child stars have now-a-days. He brought in a great comedy about a boy who accidentally is left home alone when his family goes on vacation and takes on two burglars. <br><br>Yeah, it's quit unrealistic about the burglars, but honestly, this is a terrific family film. Joe Pesci and Daniel Stern are the perfect comedy duo of two idiots who can't rob the place because a 8 year old child has out witted them and set some clever and very funny traps around the house.<br><br>Please give this movie a chance, it's just terrific and I guarantee nothing but great laughs for you and the whole family.<br><br>10/10","user":"Smells_Like_Cheese","rank":[394,440]},{"title":"Funny and highly entertaining.","rating":8,"date":"1 May 2002","review":"Home Alone (1990) Rating: 8/10<br><br>It might be dumb and corny, but I've actually liked this highly entertaining flick. The plot's unbelievable, but who cares: it's funny! Macaulay Culkin plays 8 year-old Kevin, a misunderstood kid who lives in a big ass house with his family. They're about to leave for Paris, where they're gonna spend Christmas. About 20 people are running around the house, frenetically preparing for the trip. Kevin's mad at everyone, because no one pays attention to him, unless it's to yell at him. Hence, Kevin goes to sleep wishing that his whole family would disappear, and the next morning, they do! The thing is that they somehow woke up late, left home in a hurry, and hey, they forget Lil Kev! At first, he's happy as a monkey, but after a while, things get messy. Two dumbass robbers are planning to rob his house, but Kev ain't gonna let them!<br><br>Okay, I know, this is one stupid story, but it's developed into a wonderful family film, as enjoyable as it is warmhearted. Mac Culkin is awesome in the lead. He really carries the film: he's got style, he's funny and he's even a good actor! Too bad his personal life screwed up, because he had the talent to become a grown-up movie star. The idiotic criminals are also really cool, because they cast good actors instead of some Ernest-style lame-o over-actors. Oscar-winner Joe Pesci and Daniel Stern (the narrator on The Wonder Years) are hilarious, but they also bring a bit more depth to what could have been cardboard characters. Pesci plays an aggressive thug, and anyone who's seen him in a Scorsese film knows how good he is at it. Stern plays a total dufus, and he's also really convincing at it. The film's humor might seem dumb, but hey, it's funny. John Hughes' screenplay has Kevin protecting his home by turning the thieves into human Wile E. Coyotes, and like the cartoon, it made me laugh. The gags might be old, but they're played with inventiveness, and the acting is always right. I just love this film, and you will too if you look beyond the fact that it's a family film.","user":"Twizm","rank":[119,138]},{"title":"Heartwarming Holiday family classic.","rating":10,"date":"18 February 2003","review":"'Home Alone' has succeeded in establishing itself as a Christmas tradition, spawning off three sequels (including a made-for-television flop), and a whole franchise in and of it.<br><br>Macaulay Culkin plays Kevin McCallister, the average American child. He has an attitude almost expected of a Chris Columbus film from the eighties. He lives with a large family, which, right now, being around Christmas time, is about quadrupled, flooded by relatives' children, all of whom pick on poor, poor Kevin (sympathy long lost later into the film).<br><br>One day Kevin wakes up from his sleep to find his wish has come true: his parents (John Heard and Catherine O'Hara) have disappeared. Enthralled by this, he proceeds to do everything and anything he was not allowed to do before, including eating ice cream in the morning, watching violent gangster films, jumping on the bed, wrecking his brother's room, and having some fun with a BB gun. Unfortunately for Kevin, his parents have not just disappeared - they have accidentally left him at home before going to Paris!<br><br>Trouble really starts when two pesky burglars, Harry Lime (Joe Pesci) and Marv Merchants (Daniel Stern), decide that their next burglary will be at the McCallister residence. Little do they know Kevin is more than prepared, arming the house with an array of booby-traps that would impress top spies in the American government.<br><br>John Hughes, writer/director/producer of my favorite comedy, 'Planes, Trains and Automobiles,' wrote this film, and it is no wonder. It is just like Hughes' humor. It mixes emotion, belly laughs and a warm-hearted ending all into one little bundle called a movie. John Hughes' films, in my experience, are usually very good, mainly because he approaches films at a very classic level. He doesn't resort to crude, kid jokes, like 'The Master of Disguise' or 'The Tuxedo,' to name a few recent flops. He almost always levels everything out perfectly in his scripts, and nothing is different here. Also, he places Kevin and co. in a large brick home in a large neighborhood in Chicago; a home that very much resembles those in 'Planes.' and 'Uncle Buck' (I would not be surprised if it is the same home).<br><br>As for the acting.<br><br>Macaulay Culkin is not at his best here. His best performance would have to be in an earlier John Hughes film named 'Uncle Buck,' where he had more of a cute charm than an acting charm. Here, he could barely act his way out of a plastic bag. Fortunately, with great performances by John Heard, Catherine O'Hara, Pesci and Stern, his bad acting is long forgotten by the time we become absorbed into the film.<br><br>John Heard and Catherine O'Hara bring Kevin's parents to life. They seem almost complete opposites. Kevin's father, Peter (Heard), is very calm and laidback. His mother, Kate (O'Hara) is extremely nervous almost all the time, fretting throughout the film. She is aggravated very easily and, like all mothers, her instinctive nature to care for her child is what drives her to the point she goes to in the film.<br><br>And then there's Pesci and Stern. My favorite lot of the film. They perfectly blend humor, pain and aggravation to the film.<br><br>Pesci's character Harry is very strict, easily agitated and picks on Marv for a great many things. Marv, the stereotypical 'tall, stupid one,' is completely stupid. He does things that would make a hamster blush. Yet he is the character I have found many like the most, mainly because he is so stupid you have to feel sorry for him. Stern brings a great trait to the character of Marv, and I am very pleased he got the part. It's a hard choice to decide which baddie is better, so I just say I like them both the same.<br><br>All in all, 'Home Alone' is probably the best Christmas movie to rise out of the film industry in the last twenty years. It seamlessly blends humor, pain, emotion, human instinct and some great booby-traps all into one little bundle. This film has stood the test of time greatly.<br><br>4.5/5 stars -","user":"MovieAddict2016","rank":[141,172]}]