[{"title":"Another Fleischer Film Noir Gem","rating":9,"date":"23 December 2005","review":"Wow, this was a neat little film, far better than I had hoped. I don't tape many shows on TV, but this was one I'm sure glad I did, especially since it is not available on VHS or DVD.<br><br>I say \"little\" film because it's only 67 minutes long. Richard Fleischer, who directed THE NARROW MARGIN (1952), another short and fast-moving crime story, directed this movie, too, and you can see some similarities. The major similarity is how fast-paced these films are. Another is the presence of one of the best 'B' tough guys ever: Charles McGraw.<br><br>Because of that, and it's so interesting to view, it's one I plan on viewing a number of times. McGraw, as the cop, and William Talman, as the leader of the gang, are fun to watch.<br><br>It's a heist tale and most of the film is about the gang trying to escape after the robbery and what happens to each one. In that regards, it reminds me a bit of another great film: THE ASPHALT JUNGLE, which also came out at this time. This isn't up to that level, but it's good and highly recommended viewing if you see it listed on TCM, where I saw it.","user":"ccthemovieman-1","rank":[56,58]},{"title":"Showcase for William Talman","rating":8,"date":"22 January 2003","review":"Remembered mostly as Hamilton Berger, TV's Perry Mason's opponent always doomed to fail, William Talman radiates with star quality as the anti-hero in this taut programmer.  With few words and with no fanfare, Talman etches a finely tuned portrayal of a brainy and fussy gangster.  The man is a portrait of self-discipline and clean-living except that he is a crook. Charles McGraw does well as his adversary, the detective, but it's Talman who captures our imagination and leaves indelible imprint on our minds as the meticulous crook who has figured out everything to the most infinitessimal detail.  There's just one thing he doesn't know: this is an early 50's movie, so his character must learn that crime doesn't pay!","user":"herbqedi","rank":[42,44]},{"title":"Solid little cops-n-robbers flick","rating":8,"date":"13 April 2000","review":"Director Richard Fleischer was responsible for two of the best of the low-budget '50s cops-n-robbers flicks, both notable for starring Charles McGraw, one of the great movie bad guys, as a tough detective. One, \"The Narrow Margin,\" is quite well known; this is the other one, and while not as well known, it certainly should be. The story is about a vicious gang of robbers, headed by a murderous psychopath (William Talman, who seemed to have a corner on that market in the '50s), pulls off an armored car robbery that goes awry. Detective McGraw is out to track down the gang. The film is a textbook example of the best of the B movie--swiftly paced, tightly edited, with a good story and a cast of veteran character actors that work together like a well-oiled machine. Some clever plot twists and startling (for the time) violence make this one a keeper. Very highly recommended.","user":"BrianG","rank":[37,39]}]