[{"title":"A film that influenced a generation.","rating":10,"date":"28 October 2003","review":"Let me put in my two cents about this film.<br><br>If you weren't around when this film was released...you're going to miss much when writing a review. Let me try to help:<br><br>This film IS about an urban drug dealer that \"sticks it to the man\". This was NOT a known concept of that time which is why it attracted so many movie goers. What was ALSO interesting was the casting of the light skinned, straight haired actor Ron O'Neal as \"Superfly\" to \"stick it to the man\". \"The Man\", usually white in these films, formatically had to brace the rath of very dark skinned blacks. But here was something... different! \"The Man\", was really \"The Law Establishment\". And was \"Superfly\"...urban? New Concepts of the time.<br><br>Another thing: Curtis Mayfield HATED the theme of this movie. He was going to turn down writing the soundtrack when he thought it may be better to counteract this theme by writing POSITIVE messages for the audience to hear. Before \"Saturday Night Fever\", Curtis Mayfield wrote the ground breaking music to \"Superfly\". This made the film even more popular.<br><br>This was a low budget film released at the very beginning of the black film experience, and was meant to be the opposite of \"Shaft\" not a parellel to it. But based on the success of Shaft, Warner Bro's needed a project to enter in this arena and greenlighted \"Superfly\".<br><br>This film began a M-A-J-O-R fashion trend that was hard to overcome (only the Disco era of the late 70's knocked this one out.)<br><br>And that is \"Superfly\" in a nutshell.<br><br>\"Priest\", played by Ron O'Neal was 'supercool', he was slick, he had a nice existence, he was a drug dealer that you DIDN'T know was one -- not by outward appearances anyway...that didn't get his come-uppence at the end of the film, he GAVE it.<br><br>It is amazing what an impact \"Superfly\" had on the culture of that time. In looking at it now, it may look cheap, but it IS a timecapsule of fashion, of music and of breaking a movie taboo that all drug dealers are lowlifes and must be killed in the end.<br><br>About that fashion: This began the trend of white surban-ites dressing like pimps trying to be cool. Little white kids were wearing \"maxi\" coats with \"Superfly\" hats to Jr. High School and High School!!! Dancers were wearing platform shoes, etc., on American Bandstand!!! You think Hip-Hop did it? Where have you BEEN!!!<br><br>\"Superfly\" is one of the rare films that you must experience beyond judging it on how good or bad it is to watch...Rent this film to see how a film can INFLUENCE a culture.","user":"lambiepie-2","rank":[59,66]},{"title":"Not just a great blaxploitation movie, a great movie period.","rating":5,"date":"5 December 2002","review":"'Superfly' is the best movie of the short-lived 1970s blaxploitation boom which gave the world the better known, but less substantial 'Shaft'. The 'Shaft' series are incredibly entertaining movies, no argument there, but most of the films from this period starring Richard Roundtree, Fred Williamson, Jim Kelly,et al are essentially action movies which feature \"a black Dirty Harry\", \"a black Bruce Lee\", \"a black Philip Marlowe\" or even \"a black James Bond\". In other words they are genre action thrillers with black protagonists. 'Superfly' is very different from most of those movies because Ron O'Neal plays Priest, who isn't a private eye or a \"righteous dude\" but a DRUG DEALER. And while Priest is tired of \"the life\" and wants to retire the movie doesn't feature any knee-jerk anti-drug stance or moralizing. This meant that many in the black community at the time detested it and what they perceived as being the glamorization of drugs and drug dealing. All these years later, in an era that is in many ways even more conservative (or at least more hypocritical!), this is what gives the movie a genuine edge, especially when what is on the screen is given a musical debate by Curtis Mayfield's superb score, one of the greatest of all time. O'Neal is charismatic and super cool and displays some genuine acting talent. Which makes it such a shame that his career quickly went down the toilet with little more than small supporting roles in 80s garbage like 'Red Dawn' and 'Hero and the Terror'. O'Neal is supported by an excellent cast of mainly obscure actors such as the late Carl Lee and Charles MacGregor ('Blazing Saddles') as Fat Freddy. The best known face is veteran Julius Harris ('Live And Let Die') who has a pivotal role as Priest's former mentor Scatter. Director Gordon Parks Jr. went on to make 'Three The Hard Way' starring Fred Williamson and Jims Brown and Kelly, but never fulfilled the his potential before being cut down in a plane crash in the late 70s. What a pity. At least he left us with 'Superfly', which is not just a great blaxploitation movie, but a great movie period. Highly recommended to all fans of gritty 70s crime movies.","user":"Infofreak","rank":[20,26]},{"title":"Seventies classic that only happens to be blaxploitation","rating":30,"date":"30 October 2008","review":"Ron Earl is the Priest, independent Harlem coke dealer who is out for the big deal, one last push before he's out of there and out of the street. He also happens to be the protagonist and the one character we're called to empathize with and if that pose a problem for some, it's a directorial choice I applaud even only for its disregard of PC norm. In a genre populated for the most part by cops, private dicks and other manifestations of the law, having a drug dealer kicking ass and not in the name of some higher value, without him renouncing his past or seeing the error of his ways and becoming goodie two-shoes in a last minute, flimsy attempt to redeem the movie in the eyes of moral censors, without being heavy-handed or trashy is certainly admirable. Those that enjoy taking the moral high ground against the movie they're watching will find plenty of ground here to do so. I don't. I might oppose a movie on a political level but only when it tries to make a political statement out of it and Superfly sure as hell doesn't, at least not beyond what genre conventions might dictate (i.e. whitey is bad). The Priest however renounces the hypocrisy of \"Black Nation\" scumballs going around asking him for money just as much as he rails against the \"redneck faggot\" captain who doubletimes as the local drug lord.<br><br>So if Super Fly is so good, it's because The Priest's desire comes across so transparent, strong and clear. Get off the street. A home, a vine, his woman, that's all he wants out of life now, despite (or perhaps because of) him being a societal leech feeding off people's addiction. Dealing drugs is just a job for him, a means to an end. His partner Eddie rambles on at one point early in the movie about how \"it's all whitey left them to do\" on which I call shenanigans; that way of thinking is never further expounded upon in relation to the Priest's goal and Eddie in the end proves himself to be a backstabbing, greedy son of a bitch. I think the best way to sketch out The Priest's character is by using Lee Marvin's words when he was asked what it felt like to have played so many bad guys in his life: \"My characters weren't bad. They were just trying to get through the day\". That's pretty much the wavelength Super Fly channels its protagonist through. Neither condemnation, nor approval, it's just the way it is.<br><br>Super Fly is so damn good however, not just because its drug dealer protagonist comes across as genuine and sympathetic, but more so because it never allows itself to be drawn to the sillier end of blaxploitation. No 'mack daddy' sleazy pimpin' fabulousness here, the movie is constantly rooted in reality, taking itself serious before asking the viewer to do the same, but also groovy and funky as only blaxploitation flicks can be. A big part of that distinct seventies charm is due to Curtis Mayfield's stupendous score, playing over most of the film, but also the seedy back-alleys and rundown neighborhoods of then contemporary Harlem, the grime almost reaching across the screen.<br><br>Grade A blaxpoitation then, but also a smokin' hot crime flick with characterization that is better than most, good pace, all-around good acting, booty-shaking' music, afros and a few punches thrown in for good measure, Super Fly is among the best of its kind. Strongly recommended.","user":"chaos-rampant","rank":[15,20]}]