[{"title":"Another timeless piece of that good old Don Bluth magic","rating":10,"date":"29 August 2002","review":"What do you get when you cross a bunch of dinosurs and Don Bluth?? Answer: this memorable classic!!!<br><br>My mum bought me this film when I was 5 or 6 years and I loved it. 13 years on and my mind hasnt changed. I was watching it this morning and there was still that Bluth magic. <br><br>In case you dont know, the film is about 5 dinosaurs- a \"long neck\", a \"three horn\", a \"big mouth\", a \"flyer\" and a \"spike tail\". Theyre travelling to the Great Valley whilst trying to fight off Sharp tooth.<br><br>What makes this film a classic is the way things are named. Its educational to kids on dinosaurs and is done in a childish way. Its brilliant!!!! There are lessons to be learn with friendships.<br><br>The sequels dont match up to it but what do you expect?? They werent done by Bluth!!!!<br><br>Bluth may not have done as many animation as Disney but each of his films have shown something that Disney cannot do. <br><br>Definelty one to own and keep on watching until the end of time!!!!<br><br>Helen xxxxx","user":"Bon_Jovi_chick","rank":[58,60]},{"title":"Don's Best - Endearing Cast,Exquisite Animation","rating":10,"date":"29 August 2001","review":"I've adored this film ever since I first saw it at the cinema in '88. Sweet Littlefoot, Bold Cera, Chatty Ducky, Timid Petrie &amp; Greedy Spike are the cutest dinosaurs ever. Anyone unmoved by their adventures must have a heart of stone. The animation is superb and so is the soundtrack. Each dinosaur has a distinctive personality and you laugh and cry with them throughout. I only wish the film had been longer. The sequels are cute but it is the original that has the most heart. 10/10","user":"Cylex","rank":[72,77]},{"title":"One of the best animated films.","rating":1,"date":"1 October 1999","review":"A group of young dinosaurs in a world which is nearing the end of the reign of the mighty reptiles set out to find a legendary valley which is still lush and green.<br><br>This is one of the best animation films ever made, as it is moving and entertaining.  Not only is it a story of friendship, courage and love, but it also demonstrates childhood friendships which are 'not allowed' due to classism or racism - \"Three-horns never play with Longnecks\".  'Land Before Time', with its tribe of various dinosaurs plus a pterodactyl, is a story about putting aside so-called 'differences' and striving together in 'united we stand, divided we fall' fashion in order to leave the unlovely wilderness and find a land of freedom and equality (in this case the Great Valley).<br><br>An excellent and unmissable adventure which will appeal to anybody of any age.<br><br>The sequels sadly did away with the grittyness of this first film and instead turned to TV cartoonishness and pointless songs, but most of them (the boring Part 4 aside) are still very enjoyable.  But in the tradition of most series of films, the original is the best.","user":"G.Spider","rank":[49,53]}]