[{"title":"Sweet movie not without social comment","rating":15,"date":"15 September 2004","review":"This is certainly a lovely warmhearted movie, but since other reviewers have described the plot in detail, I'll move on to other topics.<br><br>I love movies like this for the insight they provide into the customs of a lost era. Watch the clothing - everybody is so dressed up! - women in dresses, gloves, and hats, men in hats and suits. Notice that when O'Hara enters a room filled with Macy's executives, even though they are the bosses and she is lower management, they all stand up instantly.<br><br>The social satire, most on display in the courtroom scenes, also is very 1940s. Apparently audiences of that era took a kind of genial corruption in the judicial system in stride. Business leaders, like \"Mr. Macy\" were expected to be sharp and profit-oriented, but also decent people like the rest of us. It's a much more nuanced view than the \"businessman as criminal villain\" so common in today's movies.<br><br>The character played by Maureen O'Hara probably needs explanation for modern viewers. Late 1940s audiences knew that the social and economic situation of a divorced working woman with a child was much more precarious than it is now. Divorce was still somewhat shocking - this is brought out neatly in the movie when her would-be lover does a double take when he learns from her daughter about the divorce - he probably had assumed she was a war widow. Divorced moms were still rare in the middle classes. Society universally agreed that women should stay home to raise their children. Economically, women in management positions were still very rare, couldn't expect promotion, and were last hired, first fired. I think O'Hara's performance brings out these qualities in a way that the audience of the 1940s would have understood easily. The character's stiffness, fear of losing control, and anxiety about her job make a great deal of sense. It would have been nice to see a few scenes showing her loosening up, perhaps at dinner with her boyfriend; no doubt those got left on the cutting room floor.<br><br>I really like the scene where Santa talks to the little Dutch orphan. First, this scene also must have resonated with the audience; in 1947 the western European countries had only started to recover from World War II, and probably many Americans were familiar with the idea of adopting a war orphan, just as many sent CARE packages. Second, by making Santa fluent in Dutch, the writer cleverly left the viewer thinking that hey, he might really be Santa Claus (isn't Santa Claus fluent in all languages)? <br><br>Some reviewers don't like the acting and think that modern actors are \"better\". I think the older actors aren't better or worse, just different. The audiences of the 1940s expected a certain style of acting, and the directors and actors gave that to them. Then as now, Hollywood paid top dollar and got very talented people, but like all of us they were shaped by their own time and place, more particularly the requirement to make movies that audiences would like. Move Maureen O'Hara to 2004, or Tom Cruise to 1947, and you'd see them acting in the style of that decade.","user":"whitey54","rank":[144,147]},{"title":"Santa is in New York!","rating":10,"date":"9 December 2003","review":"The movie starts out in a festive atmosphere. It is Thanksgiving and the employees of Macy's department store are busy with preparations for the annual Thanksgiving day parade. Doris. Walker (Maureen O'Hare) is in charge of the parade. She  anxiously hires  Kris Kringle (Edmund Gwenn) to replace the man she hired to play Santa Claus when she discovers the original Santa is too intoxicated to even get on the float. Kris does such a good job that Mrs. Walker asks him to stay on in the role and be the department store's Santa. She soon  has serious doubts about her decision when she discovers that her new Santa really believes he is Santa Claus.<br><br>Mrs. Walker is  working, single mother, who works for  Macy's Department Store in New York City. Natalie Wood plays her daughter, Susan.  As the result of a  failed Marriage, Doris raises her daughter to accept reality. There is  no room for fantasy or make believe in her life. Susan is a quiet, child who acts more like a grown up than a 6 year old. She has difficulty using her imagination, and has become just as skeptical as her mother.<br><br>Since Kris, believes that \"the important thing is to make children happy,\" winning the affection of Susan and her mother is his main objective.<br><br>Whether or not Kris is the real Santa Claus, there is no doubt that he seem to have an influence on almost everyone he meets--except for Macy's staff psychologist .Mr. Sawyer believes that Kris  is delusional, and has him committed to thrown into a mental institution. In  order to get out, Kris must face a court hearing, where not only is his sanity questioned, but the state of New York will decide if there really is a Santa Claus. Fred Gailey (played by John Payne) a neighbor of Doris Susan Walker agrees to represent Kris. The predictable end to the story is that Fred and Doris become attracted to each other, and as Fred works hard to secure Kris' freedom, Doris finds herself not only believing in Kris, but also in  believing in fantasy.<br><br>Maureen O'Hara portrays Doris Walker with poise and sophistication. Although the movie is over 55 years old, the idea of a single working mom  trying to raise her daughter after a bitter divorce, tells a story that is relevant by today's standards. Natalie Wood  does such a good job at playing as the bright six year old, Susan,  that you can almost imagine her going straight from being a baby  to being an adult. John Payne, as Fred Gailey, predictably plays the handsome attorney who falls in love with Mrs. Walker. Even though it seems a bit unbelievable, this movie is all about fantasy, so we'll allow a bit of romance. Finally, Edmund Gwenn's portrayal of Santa Claus is so believable, that you almost believe that  truly is the jolly old elf himself! <br><br>\nThis reviewer would give the movie a 5 out of 5 rating. It is a Christmas classic that will be remembered for years to come as one of the best Christmas movies ever filmed. The message of the movie is not about the real meaning of Christmas, nor is it about the commercialism that has overshadowed the holiday for years. The message of the movie is that make believe and fantasy play an important role in our live. Without them we would have no basis for our hopes and dreams","user":"ericglunneborg","rank":[65,70]},{"title":"The Genuine Article, Still A Miracle","rating":25,"date":"25 December 2001","review":"There's a \"legend\" connected with this film, one which has recently gained new life via AMC: Supposedly, upon completion of principle filmmaking, 1947's \"Miracle On 34th Street\" then had to be submitted to the heads of Macy's and Gimble's department stores who -- had either man withheld approval -- could have cost 20th Century Fox a small fortune in rewrites and reshootings.<br><br>Frankly, in view of the fact that much of \"Miracle\" had already been shot on location in Macy's New York City store (to say nothing of the fact that studio heads of that era -- or any era, for that matter -- were notoriously prone not to take such financial risks), this \"legend\" is likely just so much \"hype,\" otherwise known as \"nonsense.\"<br><br>Thankfully, this is the only trace of phoniness attached to this jewel of a movie.  \"Miracle On 34th Street\" is just that, in every sense of the word: a miracle.<br><br>Take a perfectly-crafted, thoughtful screenplay.  Add an impeccable cast (from top-to-bottom, by the way; catch, just as one example, Thelma Ritter's uncredited turn as \"Peter's Mother\").  Throw into this mix an on-location \"shoot\" (along with Macy's, there's the store's actual 1946 Thanksgiving Parade, footage in a post office facility and a courthouse) which gives this film a nice sense of verisimilitude . . .  just in case you're not already prepared (courtesy of Edmund Gwenn, in a totally-deserved Oscar-winning performance) to recapture your belief in Santa Claus.<br><br>\"Miracle On 34th Street\" is many things: a celebration of the Christmas spirit, a heartfelt plea against the \"over-commercialism\" (even in 1947)of Christmas, an examination of faith itself . . .  just to name a few.<br><br>It works on every level.  Every bit as well today, 54 years after its initial release, as then.  Don't waste your time with the remakes -- both on TV as well as theatrical productions (and the less said about an abortive 1963 Broadway musical adaptation, \"Here's Love,\" the better.)<br><br>Go for the original film.  Go for the genuine article.  Again and again and again.","user":"bigpurplebear","rank":[44,47]}]