[{"title":"This movie is great!!!!!!!!!!!!!","rating":8,"date":"19 August 2005","review":"Summary:<br><br>I can't believe all of the unfair comments I have read posted about this film. Sure it may not be one of Chan's best but one cannot deny the good aspects of the film. A few examples:<br><br>1. Jackie Chan has long hair, and not only long hair but unbelievably long sideburns. These sideburns let me tell ya, there so good right, they don't even grow from his face as much as they are extensions of his hair. Awesome.<br><br>2. There's a guy, a ghost or specter, I can't tell, and he comes from nowhere during the first 10 Min's. of the film and screams at Chan and his family to \"return my hand, return my hand\" in full scary movie voice, and Chan throws the hand to the guy. He laughs maniacally and then runs/disappears in a series of laughably bad cuts. Classic.<br><br>3. Shortly after that we are introduced to the main villain's/teacher and her gang of weirdo, all girl, henchmen.Get this \"THE DREADED KILLER BEE GANG!\" who apparently were disgraced by Chan's father. Now this gang of Killer Bees or whatever, they all have these weird flower masks as well as Chinese lanterns on poles. WHY? I don't know either. Anyway, the main villain's and two other Killer Bees shoot out of these caskets like jack in the boxes, laugh maniacally and proceed to massacre Chan's entire family. Obviously sending Chan into a full on hate-fest for the Killer Bees. But he's out of luck to do anything as he gets his rear handed to him by the girl.And folks this all takes place before we hit the 30 min. mark.<br><br>4. After Chan gets knocked out over he's laying in a bed, seemingly pretty comfortable, until 3 Chinese/Mogonlian/Mexican henchmen decide to float up in THROUGH the window to attack poor sleepy Chan. Guy can't catch a break! Anyway, he easily dispatches the gang killing one of them by kicking him through the window, in full bad reverse, too bad we didn't have more than $13.94 for a SFX budget, motion. Just a barrel of laughs, man I'm telling ya.<br><br>5. All I'm gonna say for this one is the main bad guy is posing as three different people. Chan's best friend Chu Chuk, The Governor, and the main bad guy, and they all look the same, same actor same duds, but none of the stupid cast figures it out. At one point before handing these two guys butts to them, he says: \"So you now know that I am Chu Chuk as well as the Governor, but I'm also a THIRD person. Who do you think?\" and the two guys just look dumbfounded, as would I if I heard such a laughably bad line. \"Who do you think?\" HAHAHAHA that is the best man, and the way he delivers it, classic.<br><br>Listen, if you truly like Kung Fu films, and I don't mean HALF PAST DEAD, or CRADLE 2 THE GRAVE or any of those crappy Hollywood films, I mean old school Kung Fu 1977 style, pick up this movie. It cost me $3.99 at Wal-Mart and it was ten times funnier than I expected, and if your into these old movies your looking for funny.<br><br>Just sit back relax, smoke a joint, and get ready to bask in the overwhelmingly bad, funny and weird To Kill With Intrigue.<br><br>At one point Chan actually has half his face burned off, you can't beat that.","user":"sluaghan-macdonald-1","rank":[9,10]},{"title":"An unusual Jackie Chan movie! But not necessarily in a good way...","rating":3,"date":"27 August 2012","review":"I had hoped, and thought, that this movie would be somewhat better than the earlier movies of Jackie Chan's impressive career. However, I was sadly disappointed to find out that it was not to be.<br><br>The story in \"To Kill with Intrigue\" (\"Jian Hua Yan Yu Jiang Nan\") was sort of trying to be everything at once, trying to accomplish a lot, but just ending up in a sort of strange confusion and semi-coherent story. Which made it not overly enjoyable, and quickly had my attention drifting elsewhere, and only pay attention to the movie with half an eye.<br><br>And part of the lack of interest in it, on my part, is that the DVD I acquired from Amazon only had a horrible English dubbed language track. I could not even if my life depended on it understand why English dubbing is appealing or acceptable to anyone? It is poorly done, it totally destroyed the feeling (or mood) of the movie, and it just makes it come off as a very low budget production.<br><br>Now for the good parts about \"To Kill with Intrigue\", well you have Jackie Chan in a very unusual role (if you compare it to his other roles throughout his career), as he is not really the goody two-shoes that he usually plays. Plus this movie doesn't have the usual slapstick comedy either. It is a serious movie, and the martial arts in it was actually quite nicely choreographed and executed, whereas many of his movies before this one, the martial arts was horrible staged and rigid.<br><br>This movie sort of has a weird mutated mixture of traditional, old Chinese warrior movies mixed with Chinese Opera-like characters. Not really sure what director Wei Lo was aiming for here.<br><br>\"To Kill with Intrigue\" is the type of movie that you watch if you are a hardcore fan of Jackie Chan or old Chinese cinema. For me, this was not one of Jackie Chan's better movie, despite it being a venture away from the slapstick comedy. If the movie only had been with its original language track, it would at least have scored a 4/10 rating, but now has to settle for a 3/10 rating from me.","user":"paul_haakonsen","rank":[2,2]},{"title":"Entertaining and Fun if Nonsensical.","rating":6,"date":"23 June 2006","review":"A young master named Cao Lei (Jackie Chan) drives away his pregnant girlfriend from the family castle because he knows it's about to be raided by a gang of deadly bandits determined to kill his family. He charges a new friend with her care and protection. Following the attack on his family by the gang lead by a mysterious veiled woman who possesses tremendous, perhaps even mystical, fighting skills, Cao Lei somehow finds himself spared as the veiled woman seems to take a peculiar interest in him following him around like a shadow. Meanwhile the man Cao Lei had entrusted to care for his girlfriend is not quite the honorable fellow Cao Lei had thought. We soon discover his plans do not mirror those of Cao Lei.<br><br>This 1970s Martial Arts film is a lot of fun to watch unfold. Filled with unexpected surprises and unusual plot twists, it really keeps the viewer guessing when he or she's not shaking their head in confusion. The most confusion stems from the relationship with the veiled woman who all reason suggests should be Cao Lei's sworn enemy yet...<br><br>Still I love the action sequences and although the wire stuff just never looks believable, there's the suggestion of something mystical at work in our story that helps make some of these scenes somehow a little more credible that they would be without it. Jackie Chan may be the star of this movie Feng Hsu steals the show.","user":"Space_Mafune","rank":[3,4]}]