[{"title":"This movie is very special to me. It's a part of my childhood. I love it so much.","rating":10,"date":"5 April 2005","review":"When One Magic Christmas came out in 1985 on TV, my mom recorded it on to a VHS tape. We had this beat up, bad copy of the movie. You had to turn the volume up all the way in order to hear anything, still this movie was amazing to me. Mary Steenbergen doesn't believe in Christmas or Santa. She is such a scrooge about the season, that not even her kids' excitement could change the way she feels. With an angels' help, her daughter Abby, tries to get her into the spirit. It's full of magic, adventure, enchantment, and many lessons learned. One Magic Christmas is funny, dramatic, and wholesome. It's one of those movies that you truly can watch with your whole family, and everyone will like it. My sister and I loved it so much when we were kids that we used to watch it year round. I love this movie very much. They just recently re-released it on DVD, so now I have a good copy of the movie that has meant so much to me growing up. I still say that it's one of my all time favorite movies!!!!","user":"Amy2081","rank":[54,76]},{"title":"One of the best (and most underrated) Christmas movies ever!","rating":9,"date":"25 December 2005","review":"One Magic Christmas is one of my favorite Christmas movies of all time. While I don't remember seeing it in the theater (apparantly I did, but I had just turned 3 years old), I watched our videotaped copy (recorded off of the Disney Channel circa 1986) so many times as a little girl(regardless of the season), the first few minutes of the tape literally wore out, filling with snow and static. This, and the fact that I had every line memorized, has become something of Christmas Lore in my family. Tonight (Christmas 2005), I watched the film again with my parents and sister for the first time in many years, and was stuck by several things: first, how well the film has held up over the last twenty-years; second, how special and unique the message is from \"traditional\" family holiday movies that were made in the 80s and 90s; and third, how I still remember many of the lines of dialog -- they are indelibly etched into my brain after literally hundreds of viewings.<br><br>\"One Magic Christmas\" is sort of an alternate take on \"It's a Wonderful Life\" -- centering around a family who has fallen on hard times with a mother who never says \"Merry Christmas\" and is generally devoid of any holiday sentiment altogether. Her daughter Abbie, together with the Christmas Angel Gideon, embark on a plan to help her re-find the Christmas spirit.<br><br>Mary Steenburgen is fantastic as the loving, but icy mother. Her performance is very real -- she is both funny and dramatic, and her character is developed in a way that most family films omit. Harry Dean Stanton is perfect as Gideon, the angel - calming and knowing. You believe he is who he says he is. The child actors in the film are equally fantastic. In a family film, the kids can either make it or break it. These children act like real kids -- they aren't trying to be cute for the camera (although they really are adorable -- and this is coming from someone who dislikes most children on TV/movies) and they hold their own with their adult counterparts with ease. The little girl that plays Abbie is effortless in her portrayal of a girl with an non-wavering belief in Santa Clause.<br><br>Honestly, one of the things I think that I like best about this film is how real it seems. Considering magic and faith are primary elements of the story - this really says something. The acting is so good, the dialog believable, that the more mystical situations do not seem out of bounds. The film also delves into darker, more realistic themes than you get in most family fare. This is really exceptional, especially considering this was a Disney picture. The ultimate message of the film is heartening and poignant - even for those of us who are grown and long-since stopped believing in Santa and magic.<br><br>This is one of those movies that just feels good to watch. I can honestly say, even if this film didn't have the sentimental value it does for me, I would still recommend it as an excellent Christmas movie.","user":"filmmakker","rank":[41,62]},{"title":"Best contemporary Christmas movie!","rating":10,"date":"18 December 2004","review":"I've been watching this movie every Christmas since it first appeared on CBC in the '80s, and I have to say, I spend most of the movie misty-eyed. In this familiar story of a woman who has lost the Christmas spirit and rediscovers it through being shown how fortunate she is, there are several excellent performances<br><br>and a strong feeling of magic throughout.<br><br>Mary Steenburgen, who plays Ginnie Grainger, the woman who has lost the<br><br>Christmas spirit, undergoes an amazing transformation and some of the most<br><br>heart-wrenching moments I've seen on film. Harry Dean Stanton, as the angel<br><br>Gideon, plays his part with sensitivity, and Gary Basaraba is excellent as Jack, Ginnie's husband. Abbie, the six-year old daughter of the main character, steals the show, however. She never seems to be acting, and carries the innocence of childhood and the magic of Christmas with her. Keep an eye out for a very<br><br>young Sarah Polley as Molly Monaghan, and veteran Canadian actor Jan<br><br>Rubes as the best Santa Claus on film to date, if only for his amazing costume.<br><br>Keep a box of tissues on hand when you watch this movie! It demonstrates that a movie can be magical without overwhelming special effects, and that a<br><br>Christmas movie can be sentimental without being schmaltzy.","user":"kmjones","rank":[32,53]}]