[{"title":"An unexplainable attraction to this film...","rating":1,"date":"1 February 1999","review":"I saw this movie when I was a kid, and it instantly became one of my personal favorites.  Helen Slater's performance is unforgettable about a young girl and her instant rebel/outlaw status.  This is definitely a cult favorite, and appropriately so.  For some undescribable reason, this film grabs at you in a way that most movies never do.  You seem to care a lot for Billie Jean, and want her to get the justice she deserves.  Every rebellious youth should see this film so they can see what happens on both sides of the law, and for a highly entertaining movie.  Full of 80's music (especially the kick-ass Pat Benatar theme song), The Legend of Billie Jean is truly a remarkable film that was overlooked by too many people for its brilliance.","user":"Deviant-7","rank":[24,24]},{"title":"We've got the right to be angry!","rating":7,"date":"6 April 2004","review":"Why does everyone knock the Legend of Billie Jean so much? For me, it's one of my favorite 80s teen movies. And it's a good exploration into the concept of vigilante justice as a natural response to not only a cumbersome justice system, but also a discriminatory one.<br><br>Helen Slater is teenager Billie Jean, a nice girl from \"the trailers\" of Corpus Christi, Texas. When Hubie Pyat (Barry Tubbs) and some other local pranksters trash her brother Binx's (Christian Slater) motor scooter, she demands compensation. But Hubie refuses to pay and his father uses the opportunity to offer that Billie Jean trade some sexual favors to him for the cash. In the midst of her flight from the pervert, there's scuffle, and Mr. Pyat is accidentally shot. So, Billie Jean, her brother, and two friends involved in the accident, suddenly finds themselves on the run from the police. <br><br>Rather than surrendering, they use their new teenage fugitive status to stage something of a protest (\"fair is fair\"), and Billie Jean becomes their hero and icon for teenage rebellion as well as feminism. They become the martyrs of teenagers while the adults dismiss the entire thing as a bunch of rambunctious teenagers gone out of control. So, there is political significance in the story of Billie Jean in looking at the criminal justice system (although some of the discrimination against Billie Jean such as denying her any sort of expedited compensation occurs as a result of the system not intervening at all). If Billie Jean was an adult, would she have been taken seriously? What if Billie Jean were a male? Would that change the situation. Indeed, this movie suggests that it would.<br><br>In a decade filled with themes of teen angst, this one offers one story of the possibility of teen (and female) empowerment in a way that Pump Up the Volume or other movies like that did. I always thought it was a pretty good 80s movie and one that, judging by the message boards, still caters to a loyal audience as many of those long-lasting 80s movies do. Plus, as far as important 80s movie characteristic go, it's got good actors (Helen Slater, Christian Slater, Peter Cyote, and Kieth Gordon), and a good soundtrack (featuring Pat Benetar's \"Invincible\" and the Divinyls).","user":"vertigo_14","rank":[48,53]},{"title":"Revenge of the 80's: Helen Slater superstar!","rating":7,"date":"3 March 2004","review":"The Legend of Billy Jean (1985) was one of your typical 80's movies. It's hopelessly dated but back in the day it was a real hoot to watch on T.V. The story is about two siblings that cross paths with some older punks. Billy Jean is the name of the main character(Helen Slater, looking good) and she tries to fight for what she believes is right \"Fair is fair!\" He brother is played by the infamous Christian Slater (sans Jack Nicholson accent). They some how come across a lecherous sleaze ball and get into all kinds of shenanigans. It has to be seen to be believed. You also get co-star appearances from Yeardly Smith (Lisa Simpson) Keith Gordon, Dean Stockwell and mondo footage from Jeanne D'Arc. You can't say you're a true fan of 80's flicks until you've seen this one. <br><br>Recommend for nostalgia purposes.<br><br>Factoid: Carolyn Williams (Texas Chainsaw Massacre II) makes a quick appearance as a woman who spots Billy Jean.","user":"Captain_Couth","rank":[25,28]}]