[{"title":"I get it now!","rating":8,"date":"23 December 2000","review":"I just finished watching this film (on TNT) for the countless time. What a fine seasonal offering. It's so much better than a lot of the pulp and smarmy c*** that passes for Christmas classics.<br><br>Bill Murray exclaims at the end of the movie, \"I get it now!\" Apparently, some folks watched this flick and didn't get it. The movie is essentially a star turn for Murray, who's in almost every frame - and that's fine with me because he can carry a film. Trivial quibbles over the movie's name and reference to the original work, the lack of faithfulness to the book and other complaints miss the point of the project. While staging a production of 'A Christmas Carol,' a TV executive experiences the very same circumstances as one of the characters in the novel. That alone makes it work. A few reviews question the overall harsh tone of the movie, or more specifically, Murray's role. Frankly, I would not have minded had it been even a little darker. There's a lot of water to carry in that bucket of trying to measure the callous and thoughtless manner in which some folks act on all but the most treasured of holidays. Murray's demeanour boils it down into one strong mean spirit and evaporates it with a truly positive and well-wishing finale.<br><br>Scrooged is, along with Groundhog Day, among his best work.","user":"Bwana-2","rank":[77,85]},{"title":"Bill Murray does an excellent job of creating a modern-day Ebeneezer Scrooge","rating":8,"date":"10 July 2018","review":"Scrooged is a fresh, dark and original take on the classic Christmas Carol story. The ghosts are humorous and horrifying and Bill Murray does an excellent job of creating a modern-day Ebeneezer Scrooge. The ending is quite cheesy, but, then again, isn't that what Christmas movies are all about?","user":"cricketbat","rank":[10,10]},{"title":"A Personal Favorite","rating":17,"date":"17 December 2001","review":"This is my favorite \"adaptation\" of A Christmas Carol.  It's also my favorite Christmas movie.  A lot of people say that Bill Murray's character of Frank Cross is unlikeable.  Would you prefer a warm and fuzzy Scrooge for the first half?  Then there are those who say that the end is sappy.  The ending is what I like the most.  And Murray's acting is much better than other Scrooges, who usually overact.  Murray manages to be over-the-top with his cruelty while still making his acting believable.  Cross is truly Scrooge-like, reveling in the death of an old woman caused by his commercial because it's free publicity.  Another common comment is that Carol Kane steals the scene as the Ghost of Christmas Present.  Not true.  The chemistry between Murray and Kane ensures that they share the screen perfectly.  This is a wonderful movie.  I can't understand why anyone would say otherwise.  Bobcat Goldthwait puts in a great performance as a disgruntled employee fired on Christmas Eve.  The best part is the end. This movie has what has to be the happiest ending in the history of movies. He understands the meaning of Christmas, gets a new lease on life, gets the girl, the little boy talks, and everybody sings a song.  Danny Elfman provides the score, doing a brilliant job as always.  A beautiful movie all around.  A+","user":"Moviestar-6","rank":[56,72]}]