[{"title":"Emiliano Zapata 1879-1919","rating":8,"date":"22 April 2008","review":"Although in fact Emiliano Zapata never became president of Mexico, for the most part this is a pretty good account of the illiterate peasant who became a romantic revolutionary. For this portrayal in his third film Marlon Brando got a second Academy Award nomination for Best Actor, but lost to Gary Cooper for High Noon.<br><br>And as a film concerning the turmoil in Mexico during the teen and twenty years of the last century Viva Zapata! is far better than MGM's Viva Villa that starred Wallace Beery. Then again Marlon Brando is a much better actor.<br><br>One critical thing that was left out of the story is how much land the Roman Catholic Church held in Mexico. It was not just the rich Estancias that kept the masses in Mexico in peonage, the Church had a really big share of the real estate there. If the story were written today the Church's involvement would be shown. My guess is in the years of the Cold War and the height of Joe McCarthy, no one in Hollywood wanted to make a film that criticized the church in any way. But even a few years earlier the overreaction against the church was done in the John Ford film, The Fugitive which takes place within 10 to 20 years after Zapata died.<br><br>Zapata as played by Brando may be illiterate, but he is possessed of a simple eloquence and a charisma that made him a revolutionary figure, in the same manner Che Guevara became forty years later. He tries hard to hold to the ideals of the revolution, but finds as most do that tearing down a government is relatively easy, building one from scratch is a task that has defeated many.<br><br>Anthony Quinn plays Emiliano's swaggering brother Eufemio who's not quite as idealistic as Brando. Quinn received first Academy Award for Best Supporting Actor for the part. Quinn fills the screen with his bluster when he's on, it provides a perfect counterpoint to Brando's more idealistic role.<br><br>The guy who never gets praise for his performance is Joseph Wiseman. Wiseman, a product of the Actor's Studio in New York like Marlon Brando. This is a man whose type I've come across in numerous endeavors in my life, a professional stirrer of resentments. He's not happy unless there's some kind of battle going on. A type mind you that is ultimately dangerous for any movement. He intrigues for the sake of intrigue, but never accomplishes anything. It's a very good job by Wiseman, not often talked about for some reason.<br><br>Besides Quinn's Oscar and Brando's nomination, Viva Zapata! got Oscar nominations for Best Art&amp;Set Direction for black and white film, Best music, and Best Screenplay. The last would have been a great honor for John Steinbeck, I'm not sure how many if any writers won a Pulitzer Prize, a Nobel Prize and an Oscar. That's three horse parlay that can't be beat.<br><br>For some reason Elia Kazan was overlooked for Best Director, possibly because he had won the year before for A Streetcar Named Desire.<br><br>Still Viva Zapata! is a work that stands up very well even with the historical inaccuracies.","user":"bkoganbing","rank":[28,32]},{"title":"A collaboration of giants","rating":10,"date":"11 December 2005","review":"When I read so many of the comments on this film featured here, I find it difficult to understand how so many viewers fail to appreciate the incredible nature of the collaboration that produced it. The very idea of a motion picture scripted by John Steinbeck, directed by Elia Kazan, scored by Alex North, starring Marlon Brando, co-starring Anthony Quinn........this is an almost unbelievable gathering of artistic giants.<br><br>Taste in movies varies and thus one can be certain that some will not respond positively even to this one. After over five decades of movie-going, I can look back and remember precious few pictures that rise to the high level of excellence to be found in \"Zapata\". With its spellbinding storytelling, superb cast in top form, its insightful examination of issues which are still crucially relevant today, I can not fathom why some would not praise it.<br><br>Like a long list of really fine titles that endlessly persist in remaining unavailable in DVD release, this film has me wondering once again why, in the vastness of the internet, one can not discover the reason why this major Brando star-vehicle continues to be withheld from circulation. Is such information so impossible to find that no one can unearth it?<br><br>You can tell from reading the viewer comments that not everyone will agree on this, but I would suggest that anyone who appreciates literate, superbly crafted classic motion pictures should make every effort to see this one. I wish I could invite you all to a great gala screening of it. I know you would be dazzled by its splendor.","user":"david-greene5","rank":[43,54]},{"title":"Poetic, powerful and moving...","rating":9,"date":"5 November 2003","review":"Elia Kazan will be remembered as the director of some of the most vivid film performances of the fifties... In 'Viva Zapata', Kazan's 'Method' style of acting is applied to John Steinbeck's screenplay that power inevitably corrupts, with Brando again charismatic as the doomed Mexican revolutionary...<br><br>Kazan, not only shows us the extremely unpleasant world of poverty where life is hard, short and brutish, but also the story of the agrarian rebel who was Pancho Villa's first revolutionary ally...<br><br>Kazan paints a convincing emotional portrait of a mythical figure, who is considered as the 'Wind that swept Mexico.' Kazan explores a facet of the Mexican history, describing the reasons for the revolution fought by Zapata, and works on basic emotions as passion, anger, fear, aggression, ignorance and wisdom...<br><br>Brando projects the dedication and the anguish of an inspiring rebel... He portrays the illiterate Mexican peasant revolutionary who for ten years led Guerilla uprisings against dictators and presidents... Brando plays the part with fervor and passion, even transforming his features with special makeup and fake mustache to look amazingly like the Guerilla leader... For his performance, he was nominated for his third consecutive Oscar, but Gary Cooper won for 'High Noon'.<br><br>Anthony Quinn gives an effective portrayal of Eufemio Zapata , the swaggering, lecherous, bullying brother, and wins his first Academy Award as Best Supporting Actor... Through his consummate acting skills, Quinn creates in Eufemio a strongly characterization which, despite its brevity, was not overshadowed by Brando's Zapata...<br><br>Jean Peters portrays the typical educated girl of the village who falls in love with the wild man of the hills and marries him... <br><br>The film begins near the close of the 34th year reign of President Porfirio Diaz (Fay Roope) where a delegation of Indians from the State of Morelos have come to the capital for an audience with the great dictator... There they make known their strong objections over the stealing of their lands by the wealthy, powerful estate barons... Diaz addresses them paternally and instructs them they must examine their boundaries before they bring legal action, something he knows they are incapable of doing... <br><br>Burning with a sense of injustice, the simple Emiliano Zapata directs the president's attention to this point, requesting his consent to cross the railing of wires...<br><br>President Diaz was disturbed by the persistent Zapata and on the sheet of paper listing his visitors, he unpleasantly circles the name of this one humble man who has really came for 'something.'<br><br>Some time later Emiliano and his brother lead the farmers in a general inspection through their expropriated fields and as they do so, a squad of Diaz militia attack them, shooting and cutting down men, women and children indiscriminately...<br><br>Zapata and some of his followers fight back, and retreat to a mountain hideout... There they are located by a sly political agitator, a newspaperman named Fernando Aguirre (Joseph Wiseman), who brings news of Francisco Madero (Harold Gordon), exiled in Texas...<br><br>Zapata sends his friend Pablo (Lou Gilbert) to interview Madero and find out if he is worth following...<br><br>One day, and in a church, Zapata risks his life to speak of truth, and of love... But the pretty brunette Josefa (Jean Peters) rejects him, even though she admits to being attracted to him, and tells him he must improve his social position before she might think out his proposal...<br><br>When Espejo (Florenz Ameo) refuses to consider him as a suitor to his daughter, Zapata angrily leaves his house... He is immediately arrested by policemen and led away with a rope around his neck... <br><br>As the mounted police walk him behind their horses through the countryside they are gradually joined by peasants, who silently march along... The group increases into a huge number of farmers... Zapata comes to a realization, that the peasants have chosen him as their leader and that he has no course but to accept... Destiny has singled him out...<br><br>'Viva Zapata!' received 5 Academy Award Nominations...It is a greatly entertaining film, excitingly directed by Kazan who made its action sequences so intense and who permitted his actors full scope in developing their characters...","user":"Nazi_Fighter_David","rank":[34,43]}]