[{"title":"Max Schreck IS \"Nosferatu\"","rating":10,"date":"18 March 2001","review":"In 1921, director F.W. Murnau set out to make a horror film based on Bram Stoker's novel, `Dracula,' but was denied the rights to the property by Stoker's estate.  Undeterred, however, Murnau merely changed the title to `Nosferatu,' the name of the title character to `Count Orlok,' then proceeded to make what has come to be considered nothing less than a classic of the silent film era.  An unsettling film (especially for the times in which it was made), it is a faithful adaptation of Stoker's story, and brings images to the screen, the likes of which at the time, had never before been seen.  And although by today's standards much of it may seem relatively tame, there is an innate sense of the sinister about it that is timeless.  For the same elements that so unnerved audiences in 1922 when it was released, are equally discomfiting now, most of which is courtesy of Max Schreck, who portrayed Count Orlok. \tIt was the first screen appearance for what is now the most famous vampire in history, and the German character actor Schreck brought an eerie presence to the role that has never been equaled.  Bela Lugosi may be considered the definitive Dracula-- his portrayal is certainly the most well known-- but even he could not match the sense of evil that Schreck brought to the character.  The scene in which Schreck's shadow is cast on the wall as he slowly negotiates a staircase, emphasizing his misshapen head and elongated fingers and nails, is an image that leaves an indelible impression on the memory, as does Schreck's overall appearance:  Lanky, though slightly stooped, with oversized, pointed ears and haunted, sunken eyes.  It was Schreck's greatest screen role, and had it not been for a lawsuit by Stoker's estate that prevented wide distribution of the film, it would no doubt have made him a star. \tThe supporting cast includes John gottowt, Alexander Granach, Wolfgang Heinz, Max Nemetz, Gustav von Wangenheim, Ruth Landshoff and Greta Schroder. An air of mystery surrounded the set during the filming of `Nosferatu' that became something of a myth, which began with the fact that Schreck, a method actor, was never seen by cast nor crew without his makeup and in character. And it was further perpetuated when it may have been implied by Murnau that Schreck was actually a vampire playing an actor playing a vampire, all of which goes a long way toward proving that `hype' is nothing new to the entertainment industry.  One of the three most highly regarded German directors of the times, Murnau, whose philosophy was that `nothing existed beyond the frame,' directed a number of films, but none achieved the lasting notoriety of `Nosferatu.'  For film buffs everywhere, as well as aficionados of silent pictures, this film is a must-see, and a perfect companion piece to the recently released (2000) `Shadow of the Vampire,' the film by E. Elias Merhige that chronicles the making of `Nosferatu.'  A comparatively short film-- the restored DVD version runs 81 minutes, the video, 63 minutes-- it will nevertheless provide an entertaining and memorable cinematic experience.  This is an example of not only the magic, but the magic at the very core of the movies.  I rate this one 10/10.","user":"jhclues","rank":[189,212]},{"title":"A Symphony of Horrors","rating":10,"date":"14 March 2002","review":"They don't make films like this faded, haunting masterpiece of silent cinema anymore.<br><br>When Dracula was first put on sale for movie rights; the one of the first men to grab it was F.W.Murnau one of the most of the famous German directors of his time. By the time word got back to them about using the rights of the name and storyline of Dracula (Owned by the rights of Florence's widow.) Murnau had alread started production on the film; so to get around it they cut out the name 'Dracula' and replaced it with Count Orlok, Jonathan Harker became Hutter and Ban Helsing became Professor Bulwer; Orlock stalks the gothic streets of Bremen instead of Vistorian London.<br><br>What is so different from Nosferatu and many of the others films of the time was that most of the film was shot on actually locations around Eastern Europe; the production hardly used any studio sets. What makes the most haunting feature tho is the sense of realism and the expressionism (most evident in the interiors od Orlok's Castle) that gives the film its hypnotic visual power.<br><br>If there is any film a film student would need to have in his/her collection, it's this film. Although it is a hard task to find any surving copies. The reason for this is when the film was released Florence Stoker (widow of the author of Dracula) noticed the comparsion; she pursued the case relentlessly and in July 1925 a German court ordered all prints of the film to be destroyed. Luckily for us several prints of the film survived; a few in which have still been lost over the last few 8 decades.<br><br>But thanks to the 2000 release of 'Shadow of a Vampire' a film  which looks behind the filming of Nosferatu and starring John Malkovich (F.W.Murnau) and Willem Dafoe (Count Orlok) the film was released for the first time on DVD in it's full original length of 94 minutes.<br><br>Sadly soon after the film hit America in 1929; at the age of 43; Murnau was killed in a car crash.<br><br>\"Men must die. Nosferatu does not die!\" proclaimed the original publcity for the film. We can only hope it's the truth for this film.","user":"FilmDog-1","rank":[143,163]},{"title":"One of my two favorites","rating":21,"date":"21 May 1999","review":"Quite possibly my own very favourite movie. No vampire film before or since has been either as disturbing or as artful. Less overtly \"expressionistic\" than some of the other German films of the day, but no less visually impressive. Look at the seascape where Ellen/Nina/Mina pines over her departed husband. Watch those marvelous shadows, which we see in Bremen more often than the vampire itself, used especially effectively in the closing sequence.<br><br>And look at Max Schreck himself! While Bram Stoker gave his Count affinity with wolves and bats, Murnau favours that rat, both in that they surround him and that he physically resembles a shaved, cadaverous rat. Spreading his pestilence, Max Schreck is truly the vilest, most loathsome villain in the history of film. The scene where he rises suddenly erect from his coffin aboard ship is one that horror directors everywhere should study very carefully.<br><br>Nosferatu is also noteworthy as the origin of the idea that vampires are killed by sunlight, previously present neither in literature nor folklore. In response to the poster who complained that the vampire seems to be walking around in light before his death, these scenes are set at night. In the original versions, there was a blue tint over these scenes to let you tell night from day; it's difficult to tell the difference without them.<br><br>My copy is marred with some hilarious inappropriate sound effects (such as a massive \"BOING\" when the gates of the castle open on their own accord) which I've learned not to hold against the film itself.<br><br>Thank God that Florence Stoker did not manage to completely wipe this film of the face of existence.","user":"Patsy-9","rank":[108,123]}]