[{"title":"Strange and fascinating genre-buster from Jean Rollin.","rating":17,"date":"17 February 2002","review":"From the title and the opening sequence of 'La Vampire Nue' it looks like you're in for a dreamlike erotic nudie vampire flick ala Jess Franco (which is not a bad thing mind you!). Very quickly though it metamorphoses into something more complex, and difficult to categorize. The mysterious and sensual title character played by Caroline Cartier actually has very little to do on screen, but is the key to the mysterious events involving scientists studying immortality, and a surreal suicide cult. A young man discovers his father is somehow involved in a secret society who favour animal masks and (apparent) murder. When he investigates he finds that not everything is as it seems, and that the enigmatic, mute beauty at the centre of it may hold the key to the future of mankind's evolution. A very strange, poetic and unique piece of 60s exploitation, quite unlike any other. I was fascinated by the whole thing. Highly recommended to fans of the offbeat and unusual.","user":"Infofreak","rank":[24,27]},{"title":"Lots of Flashy Colors!","rating":12,"date":"12 October 2011","review":"Bizarre vampire/sex fantasy about rich brat Martin, who stumbles upon secret bourgeois-like society, which conducts secret perverse ceremonies in a mansion rented by his father.<br><br>Let me say, this is a prime example of style over substance. While I am sure there is substance here (most of which does not make any sense), that is overshadowed by colorful costumes, strange alien vampires and just an array of unpredictable moments -- many connected in some way to nude women.<br><br>Best part of the movie? The chicks falling down the stairs. While one twin takes it pretty seriously, the other one is determined to reach the bottom step, even if she has to keep pushing herself. Sure, it does not look natural, but it got me chuckling a little.","user":"gavin6942","rank":[6,6]},{"title":"Definitely a Rollin flick","rating":6,"date":"16 December 2009","review":"Following a strange encounter with a young woman, Pierre (Olivier Martin) begins snooping around the location where he last saw her and quickly uncovers a mystery leading all the way to his own father. See, Pierre's dad has kidnapped this vampire girl and is using his company in order to try to find out the secret to her immortality. This is director Jean Rollin's second vampire film but the first one that I've witnessed. I'm not sure it is entirely successful, but it clearly establishes some Rollin motifs. I did enjoy the dream-like staging even if it has a slumber-like pace at only 81 minutes long. As always, Rollin has a keen eye for the ladies and everyone here is downright gorgeous. Especially of note are the twin servants, played by real life twins Marie-Pierre &amp; Catherine Castel. Rollin also has an equally good eye at catching some great images and the final half hour set in a picturesque château in the country features some really striking bits. Of course, you know he is going to work that beach in there too and the last few minutes feature that famous location (plus a dimensional jump and twist that reminded me a bit of PHANTASM).","user":"udar55","rank":[6,6]}]