[{"title":"Munster Go Home Retains the Charm","rating":16,"date":"16 January 2005","review":"After appearing in 57 of 70 television episodes as Marilyn Munster one would think Pat Priest would have been included in The Munster's FIRST feature length film. There was some lame excuse that she was too old, even though the film was released a year after the series' last episode. Debbie Watson gave a good performance in MGH, but I had a difficult time excepting her as part of the Munster clan.<br><br>This, however, did not detract from the film that Munster Charm that came to us for two wonderful seasons on The Munsters. I still loved the film in all its brilliant color. I've just purchased the First Season episodes on DVD and am very saddened and surprised to learn Munster Go Home, the DVD version, is currently out out of print. Munster Go Home is as enjoyable as the series and should be offered to all Munster fans of all ages to enjoy.","user":"NavinParker","rank":[18,20]},{"title":"Munsters on the Fast Track","rating":5,"date":"11 November 2006","review":"You pretty much get what one would expect from this first theatrical film using the Munster characters going to England to claim an ancestral home. All the actors return except for Pat Priest - here replaced by Debbie Watson. Herman Munster and Grandpa ham it up in all sorts of quite ridiculous scenes in a quite ridiculous story. Yet, throughout it all, the film does capture the essence and heart of the original show as well as the humour. Fred Gwynne shows us that he was the heart of the Munsters with his amusing turn as the awkward Herman Munster with strange family in tow - living like a somewhat normal monster in a world he saw as the weird thing filled with people he felt were weird. Al Lewis is equally amusing and the whole cast does a good job aiding the antics. British character actors Terry-Thomas - always a treat to see - and the indefatigable Hermionne Ginglod as his mother trying to off Herman Munster and keep their title and lands both give pleasant comic turns. John Carradine is aboard as a very slow-moving butler. Bernard Fox plays the head of a rival family whose one goal is to win a car race every year. Naturally, Herman must defend the House of Munster. Like the television show, many of the laughs are a bit forced, but there are some genuinely funny scenes - most of them between Gwynne and Lewis. Lewis turns into a wolf a couple times, and the race itself is the centerpiece of the film. The ending is perhaps the most forced, but overall I enjoyed the film - not because it was particularly good but rather because it allows one another chance to see Gwynne with the role he would forever be linked with in life. The film w as directed by Earl Bellamy who had directed at least one of the episodes from the series.","user":"BaronBl00d","rank":[7,8]},{"title":"A Green Monster in Swinging London","rating":5,"date":"30 October 2004","review":"This film appeared at the height of the Swinging London movement of the mid-Sixties, when even Batman made a televised visit to Britain. A cross section of British funnymen came aboard to welcome America's improbably sweet family of ghouls to the old country. (And never mind that the name \"Munster\" is Irish and not English). <br><br>Fred Gwynne never looked back after making this final appearance as Frankenstein's monster, so bitter was he at the lingering pain performing the role caused him. It's a shame, because he was never better than in this lightweight role of goofy old Herman.<br><br>As he was in \"Car 54\", Al Lewis is Gwynne's sidekick, gleefully gnawing on the scenery as an over-the-top sendup of Dracula. Frankenstein vs. Dracula sounds like one of those high-concept films only the hard core will watch, but these two made it work.<br><br>I saw this film in the theater during its first run and continue to enjoy it on its occasional TV appearances. Often these are during the run-up to Halloween, when \"Munster Go Home\" acts as an antidote to the depressing run of horror films.","user":"directoroffantasies","rank":[9,11]}]