[{"title":"Absolute Corker","rating":3,"date":"3 November 2001","review":"When I saw the cover of this movie on the $2 rack at Blockbuster video, I absolutely cacked myself laughing and had to buy it. After about two years of keeping it under a table leg to stop the wobble, I finally watched it. Now, it wasn't the best movie I've seen but it sure kept me entertained. Stereotypical, yes.. Lame, absolutely.. but it was so damn funny. The 80's style car chase, the way Jay Leno seemed to forget that he'd been shot in the leg, the cheesey ending... brilliant! It was fun, it was action packed and it brought a tear to my eye.My favourite part would have to have been Tony and the guy from Karate Kid sitting in the kitchen getting sloshed. If you come across this gem in the video store or if it's coming on tele, don't pass up the opportunity to watch it. As long as your expectations aren't too high, you'll love Collision Course.","user":"Lollie69","rank":[14,17]},{"title":"Best movie ever made!","rating":10,"date":"22 June 2005","review":"This movie will go down down in history as one of the greats, right along side of Citizen Kane, Casablanca, and On The Waterfront. Someone please convince Leno to do a sequel! Leno and Morita are a comedy duo, the likes of which haven't been seen since Abbot and Costello. The evil that emanates from Chris Sarandon, Tom Noonan, and Randall \"Tex\" Cobb will give you the chills. Dingman's character as the buffoonish oaf hearkens back to the days of Shakespeare's comedies. And the climax. My goodness, the climax. I won't ruin it for you, but it makes the explosion of the Death Star pale in comparison. If you can track down this hard-to-find gem, do yourself and your family a favor and buy it immediately. I'm still holding out hope for a special edition DVD one of these days.","user":"stanlee7","rank":[25,35]},{"title":"The Best Movie Of All Time!","rating":7,"date":"5 August 2005","review":"Well no, I tell a lie, this is in fact not the best movie of all time, but it is a really enjoyable movie that nobody I know has seen.<br><br>It's a buddy cop movie starring Jay Leno and Pat Morita(Mr Miyagi) with some fluff story about a missing car engine prototype or something, but that doesn't matter. the reason this movie is fun is because of the interaction between the two leads, who initially dislike and distrust each other but in a shocking twist of fate end up becoming friends. The whole culture difference thing is done quite well,in that it's fun to watch, it's completely ridiculous but in a cheesy and enjoyable kind of way. The soundtrack is cool,once again in a cheesy 80's kind of way, it suits the movie, I've been trying to find one of the songs for ages, but as I'm working from memory of what I think a few of the words were i can't seem to find it.<br><br>Another thing this movie has is the most fantastic pay off of any movie ever, but I won't give that one away, oh no! In conclusion I'd take this movie over 48 Hours\\most of Eddie Murphys output including Beverly Hills cop, and whatever buddy junk Jackie Chan or Martin Lawrence have to their names. If you're looking for a buddy cop movie and are getting fed up with \"straight white cop meets zany streetwise black cop\" give this a shot. You might be pleasantly surprised cos this turns the whole formula upside down with \"straight Japanese cop meets zany streetwise white cop\".<br><br>I'm giving this 7. to be honest I like it more than that. I'd rather watch this than a lot of stuff I'd give 8. But I guess I know deep down that it's some sort of insanity that makes me like this movie.","user":"dmar57","rank":[11,14]}]