[{"title":"This is a weird, wonderfully bizarre film....","rating":26,"date":"26 June 2001","review":"What a wonderful film. Bizarre, yes! But in that bizarre way that keeps you coming back to see it again and again.  \"Liquid Sky\" is a low budget, many times cheesy, take on science-fiction, including sci-fi's penchant for social commentary.  However, this film is so over-the -top, so visually primitive and so different and funny in its premise that it cannot help but endear itself to you. (Caveat: there are some brutal moments in this film, including several rape scenes; however,  these events more than fit into the story of the film and do not appear to be gratuitous at all.) The whole \"Punk/New Wave\" sensibility that pervades this film reminded me of the humor found in \"American Werewolf In London\" .... (I mean a Jewish werewolf, what a wonderfully brillant comic juxtaposition.) Same here in LS with Punk/New Wave types and aliens both looking for drugs of one kind or another -- how terrifically different that is from the usual Invasion of the Body Snatchers/X-Files-colonization schtick to which we have become all to accustomed.<br><br>Visually stunning in a primitive, low-budget, indie sort of way, with an intriguing storyline and wonderful actors that carry it off.....A definite must see for those who love the bizarre.  You will not be disappointed....SEE IT TODAY!!!","user":"cakewalkk","rank":[40,42]},{"title":"A rare glimpse of USA New Wave","rating":27,"date":"27 July 2004","review":"Liquid Sky!!<br><br>Wow, tough to say a simple few words about this movie. Liquid Sky is a rare film as it documents a time period in the USA when \"post-punk\" and \"New Wave\" were truly still underground. Liquid Sky is so easily compartmentalized into gay/lesbian cinema or a \"cult classic\" when it truly stands alone as a document of an era criminally under represented.<br><br>Roger Ebert who in my opinion really understands good cinema, gave this movie strong local press support in Chicago when it played at the Three Penny art Theatre in Chicago. The 3 Penny was across the street from the original Wax Trax record store on Lincoln Avenue which was another \"power spot' of this post-punk/early new wave underground in Chicago. Ebert gave this movie a thumbs up and I think 3.5 stars upon the initial release. Ebert understands \"dark\" cinema which I think few see.<br><br>There are few movies in all of cinema that leave you with a \"feeling\" that Liquid Sky does at the end. By taking you correctly, intelligently into a world (Underground Clubs, Drug Scenes) that do exist, that few see. Donnie Darko is to me \"in the ballpark\" of the way Liquid Sky makes you feel at film's end. <br><br>The musical score (using the then very rare and expensive) Synclavier sampling keyboard was way ahead of it's time by perhaps 20 years. That along with the strong performances, is what makes Liquid Sky not just \"weird' or \"freak cinema\" but something actually special.<br><br>If you were part of the New Wave or Post-Punk \"underground\" of 1981-1983 you will nod your head to what I am about to say: Liquid Sky is just about the ONLY movie that captures the \"feel\" of this period.<br><br>The rare Anne Carlisle! She-popped in with this magical tour-de-force performance and then basically disappeared from cinema. The only other easily obtainable performance of Carlisle is in the Miami Vice episode \"Yankee Dollar\" where she appears in the last 10 minutes of the episode as the wealthy heiress trying to save her husbands company via an illegal deal.<br><br>The DVD review! Wow!! The fact that some people really cared about this movie is seen in the DVD extras. The fact that just the movie made it to an official DVD is enough , but the extras where a huge shock. Actual beta video footage of test run thoughts of scenes. An initial opening 10 minute sequence that was edited to provide a different plot opening to the movie. TV spots, etc..<br><br>To use the word \"cult classic\" then every rare film like this should be treated to such extras on a DVD.<br><br>Not for \"kids\" , but I give Liquid sky a solid 10 out of 10 on the IMDb scale!<br><br>While some may see this movie as weird, the movie actually displays a real \"truth\" of what that scene was like 1981-1983 (minus the aliens of course). Watch Carlisle's monologue while putting on the make-up in the last 15 minutes of the film. You will not find a more \"honest\" speech about what happens when a girl moves from the country to depths of the inner city underground scene.","user":"tagomago7","rank":[77,84]},{"title":"Cult classic","rating":8,"date":"17 March 2004","review":"I could watch this film again and again for the fabulous retro costumes alone. It is a low-budget sci-fi about aliens in a miniature flying saucers that home in on a chemical released in the brain during orgasm which is akin to heroin. There's very little aliens-action, but lots of psychedelic photography, a cunning rhythm that sucks you into the world of Warhol-like druggies, freelove-devotees, artists, fashion designers, experimental musicians, OTT models, and bisexuals. Liquid Sky is a gem (and also contains perhaps the most realistic lesbian sex scene I've ever seen!) S*d the make-up unless is at least as wild as Ziggy Stardust, leave your gender attitude at the door, embrace existence as rocket-fuelled experience, and tune in to Liquid Sky.","user":"Chris_Docker","rank":[29,32]}]