[{"title":"Outpsyche.Outtrain.Outlast.","rating":10,"date":"4 July 2005","review":"Wow.Big men with big personalities. Humor, drama,passion, camaraderie. In my opinion, this is a great guy flick. Especially, if you're a gym fiend like me. I didn't have too much knowledge about Arnold's bodybuilding past,as I'm from the generation of his movie period, just like kids today are part of his political period. I grew up on Arnie, Stallone and Bruce Lee. Discovering this movie was one of the best things that happened.Thanks , IMDb :) To take a close look at the inside world of bodybuilding the way it should be, Pumping Iron delivers big time. With the Mr.Olympia contest as the center stage event, and what happens around it is the premise for this docu drama.<br><br>Lots of inspiring moments when the champs are working out-- Arnold's massive barrel chest, Lou's young turk on the rise, Columbo's strongest man in the world angle, the modelling, the charity (Arnold kissing a jail bird and saying \"Heyy, she might not have been kissed for a long time yooo knowww..\").. It also shows how these Kings bonded....sharing tips (even \"bad advices\"), lazing on the beach, Arnie showing \"little men\" how to pose,spotting each other....man, reminds me of when I'm with my gym buddies. Even if you're a girl or a layman who's not into working out,this movie is good entertainment. Lots of funny quips from Arnie--my favorite being \"Franco is good..but he's a child...at the day of the competition.. I am his father!\" and \" When I get the pump I feel like I am coming day and night, I'm in Heaven..\" <br><br>On a serious note, the anxieties, the passion, the fear and the mental armory these guys possess varies. On one side there's Lou (a big softy) and on the other end, there's good ol' Arnie; acting out the part of likable rogue to perfection.When he talks about immortality and mentions his admiration for dictators and Jesus..\"yooo know, people who will be remembered for thhhouuusands of yeaars..\" you know you've got a winner on your hands. Some of his quotes are outrageously funny but they also make you think. Maybe that's the true mindset of champions. <br><br>At the end of the day, the message is that everyone is friends. And that's the bottomline. Play hard, work hard, party hard. But stay firm friends. That's how it is and that's my belief as well.Male bonding will always be something women can never understand. I love women, and I know how much a part my physique plays in it ;) but when it comes to getting \"pumped\" or needing a good testosterone boost(without the homosexual overtones), I prefer good solid male company to truly make me feel alive. The competition, the fun, the bonding is something only we the male of the species can share. Great stuff.Inspiring, funny and immensely entertaining. A movie with muscle, if there was one. 10 on 10.","user":"ariitanywhere","rank":[56,66]},{"title":"Still Fascinating, Almost 30 Years Later","rating":10,"date":"2 November 2005","review":"This was an extremely well-done \"documentary\" about men's bodybuilding, and the 1975 Mr. Olympia contest in particular.<br><br>The film, of course, features the most famous bodybuilder of all time - Arnold Schwarzenegger. There are also profiles of his handful of competitors, most notably Lou Ferrigno, who gained notoriety by being the green monster in \"The Incredible Hulk\" TV series.<br><br>Anyway, this film really shows the hard work (but not the steroids, by the way), the dedication and the egos of the bodybuilders, particularly Schwarzenegger. Arnold is the defending champion in the field and also has the biggest ego and is pictured as a man obsessed with winning. (To this day, has he ever lost in anything? Like him or not, what this man has accomplished is amazing.) <br><br>Ferrigno's story is more about his dad than anything else, a man living out his dreams through his son. However, unlike other driven sports parents (i.e. Jimmy Piersall's father in \"Fear Strikes Out\"), he gives \"Big Louie\" nothing but encouragement.<br><br>However - please note, because I was fooled for years, too , until the DVD came out - that it turns out that much of the dad's role was made up just for the film, which is why I put \"documentary\" in quotes. In reality, he had little to do with his son's training, according to a feature on the DVD disc. There is a 25-year reunion with some of the people involved here, and it's very interesting, as they point out what was added for \"dramatic effect.\" (These filmmakers must have inspired Michael Moore). <br><br>Also featured in the film were several contestants in another competition, Mr. Universe, which was held at the same venue as the main attraction. In here, we see good guy (Mike Katz) battling bad guy (Ken Waller). Katz was particularly an intriguing study and provides a good example of what motivates many of these guys to build such incredible bodies.<br><br>A lot of what these contestants do - and Schwarzenegger was a master at this - was play mind games at these contests, trying to \"psych out\" their opponents. All of that is pictured.<br><br>The physical work, the mental games, the families of these guys, their social life, outlooks on life, and the behind-the-scenes look at a unique sport - all are fascinating. I found it such when I saw it over 25 years ago, and it's still an extremely entertaining film.","user":"ccthemovieman-1","rank":[48,56]},{"title":"Pump It Up!","rating":28,"date":"28 January 2004","review":"It's hard to imagine that, before he became a multi-million dollar movie star and the Governator of California, Arnold Schwarzenegger started his film career with one docu-drama, the aptly named \"Pumping Iron.\"<br><br>Basically a documentary about the world of bodybuilding circa 1975, \"Pumping Iron\" focuses on Arnold Schwarzenegger's last effort at attaining the Mr. Olympia for the sixth time in a row, before officially retiring from the \"best sport\" and heading off to Hollywood for a film career. (Five years before he had starred in the mighty \"Hercules in New York,\" which I have been quoted as calling \"the funniest bad film ever.\")<br><br>Not much to say about a film like \"Pumping Iron,\" though, so I resort to going over the movie's historical impact and the so-called \"controversial questions\" often raised after people watch the film for a first time.<br><br>First of all, this is the movie that started bodybuilding. It's hard to think of a time when bodybuilding wasn't strange and abnormal, but when \"Pumping Iron\" was made, bodybuilders were considered insecure freaks with big egos. Bodybuilding ads were printed underneath the comic strips of daily newspapers. People took them as a joke.<br><br>Arnold is often referred to as the father of modern bodybuilding (he literally started the entire craze you see today), and a lot of people who criticize his intellect and films and tabloid sexual assault claims forget that everyone is flawed, but not everyone has enough self discipline and motivation to move to the United States from Austria, become the king of bodybuilding (boasting the largest chest every measured--to this day), then moving into film and grossing billions of dollars at the box office in total, then becoming Governor of California.<br><br>That's pretty amazing.<br><br>I don't believe that the majority of the sexual assault claims filed against Schwarzenegger are true. (I'm sure some of them are, though.) Interesting how they all surfaced right around election time, huh? But regardless of whether he's a womanizer or not (which I know he is, to a certain extent), he's still a very admirable guy who's participated in fitness and after school programs for years, not to mention raising four kids without ever divorcing his wife. (I'm not saying that the key to a lasting marriage is adultery, though.) And he kicks butt on-screen like no other guy in the history of action film knock-offs. There will be your pale imitators like Stallone and Van-Damme, but there's only one Conan the Barbarian.<br><br>Yes, I admire Arnold Schwarzenegger, as do millions of people across the world. There's a reason that he started the bodybuilding craze of the past few decades, as well as grossing billions of dollars at the box office (many of his films some of the greatest pieces of action cinema ever made), appearing on thousands of magazine covers, and becoming Governor of California. First of all, he exceeds where most screen heroes fail: he's got bigger muscles (see Stallone), a more likable personality (see Van-Damme), and--even though many people criticize him for it--I think his acting is quite good. It's easy to smile watching one of his comedies and easy to have fun watching his macho man action films. \"Commando\" is one of the cheesiest films ever made, but would it work without Arnold?<br><br>\"Pumping Iron\" is not exactly a \"documentary,\" since a lot of it was staged just for the film, but as Arnie said before, most of it is true--the competitions, the training, etc. The tension between the bodybuilders, and some of the dialogue, however, is not true. It was all for cinema.<br><br>But this is the movie that made people flee to the gym during the 70s and 80s, and it continues to do so. I myself am a bodybuilder, with a gym built into my house, and this movie is a big inspiration for me--there's a lot of great inspirational material in it. And it doesn't matter if your sport is bodybuilding or not even a sport at all: the motivational message stays the same for whatever you do.<br><br>In a recent 25th Anniversary Interview (included on the newly-released DVD of the film), Schwarzenegger separates the fact from the fiction. His \"psyching out\" of Lou Ferrigno was just for the camera; so was the statement about losing his car and not returning for his father's funeral because he was training. Yes, he used steroids, as did everyone back then, since they were in an experimental stage and not illegal. And he handled the biggest question of all in two sentences: <br><br>Schwarzenegger: \"Yes, I smoked a joint. And yes, I inhaled.\"<br><br>Twenty-five years later, he now also claims that when he said the pump (blood flow to the muscles resulting from weight lifting) was better than \"coming in a woman,\" he was just saying this to get attention and to get people to lift weights more. \"It's not better than coming,\" he says now. \"Trust me.\"<br><br>4/5 stars.<br><br><ul><li>John Ulmer</li></ul>","user":"MovieAddict2016","rank":[46,56]}]