[{"title":"highly enjoyable","rating":8,"date":"17 June 2004","review":"a very, very silly film. not once will you feel horror or revulsion (unless you are the sensitive type or a nun) but you may smirk, and you may laugh and you may even find yourself cheering on dear old sister gertrude as she goes on her rampage of false teeth destruction, morphine addiction, random sex and abuse and an extreme misuse of stockings. somehow this all ties together in a film which is somewhat cohesive, quite impressively directed for the most part, beautifully scored, very well acted and just generally entertaining. certainly not for everybody though, you do have to have a slightly bent idea of entertainment or at least enjoy cinema on the edge, on the edge of what, im not quite sure. over all, an enjoyable psychodrama with a touch of taboo.","user":"dispet","rank":[19,22]},{"title":"Killer Nun Ain't Much Fun *warning: some minor spoilers*","rating":6,"date":"27 December 2003","review":"From Ken Russell's 'The Devils' to Jesus Franco's 'Love Letters Of A Portuguese Nun,' from Sergio Grieco's 'Sinful Nuns Of St. Valentine' to Gianfranco Mingozzi's classic 'Flavia The Heretic' and everything in between, I am a self-confessed nunsploitation freak. I wanted to embrace Killer Nun uncritically. I also like to check out any film featuring Joe Dallesandro, who is always interesting. Except, maybe, in this movie. But it would be unfair to ask Joe to save a failure like Killer Nun. The basic problem with this movie is the misleading title. With a title like Killer Nun, you are compelled to either deliver the goods, or condemned to disillusioning your audience. As a viewer, I haven't felt so disillusioned since I saw 'Blow Up' and not a single cast member exploded. I actually fell asleep the first time I tried to watch this film, right after Anita Ekberg stomped on the old lady's dentures. I did not pass out from tiredness but from the surprise agony of boredom this film inflicted upon my vulnerable brain. I trustingly placed my fragile psyche in the hands of cruel and insensitive filmmakers who betrayed me! By the time I fell asleep on the initial viewing attempt, I had long wearied of chanting \"Kill, Nun, Kill!\" every time a nun appeared on screen. Maybe if the film had been marketed under the title \"Horny Junkie Nun\" or \"Nun With Occasional Psychotic Episodes\" I wouldn't have felt so ripped off.<br><br>The second time I settled down to inflict Killer Nun upon myself I was prepared. I sat through it with steely determination, thankful for my preternaturally high pain threshold.<br><br>There's some soft sex and nudity, but only one scene between Sister Gertrude (Ekberg) and her younger lesbian nun lover contains any hint of eroticism or interest. Sister Gertrude humiliates her submissive girlfriend, Sister Mathilde (Paola Morra, an Italian Playboy Playmate who also had a small role in the nunsploitation flick 'Sex Life In A Convent'). Ekberg forces her to dress in silk stockings to satisfy her admitted fetish, and demands that she repeat the words, \"I am the worst kind of prostitute!\" Unfortunately this is a case of too little too late. This scene could have been deliciously lascivious... another opportunity to deliver the prurient goods utterly wasted.<br><br>The same can be said of the gore. Yeah, people die in this movie but the first outright killing occurs nearly halfway through the film. The gore, such as it is, is almost entirely implied, and will only irritate fans of graphic violence FX. Another killing carries genuine potential for thrills and terror, as the victim is sadistically tortured with pins. Somehow the filmmakers actually succeed in making scenes like this boring. Doesn't cut it with a film called Killer Nun, babe.<br><br>As for the other half of the reason I was looking forward with some pleasurable anticipation to watching this movie. Joe Dallesandro. His role is negligible. Aside from a lame soft sex scene with Morra, he's given nothing to do at all. Dallesandro is usually more than watchable in genre films. While he never gives a bad account of himself, in this instance his presence is wasted. A significant letdown for this fan.<br><br>I never imagined I would be disappointed in a nunsploitation entry. The biggest shock this film delivers is what a dud it turned out to be. I've had more laughs filming myself vomiting than I had watching this movie. If you want nunsploitation then consider Killer Nun as a last resort. Instead try one of the films mentioned in my opening remarks, or maybe you'd enjoy my personal favorite, Pedro Almodovar's 'Dark Habits.'","user":"Jenabel_Regina_del_Mundo","rank":[15,18]},{"title":"Killer movie!","rating":30,"date":"30 July 2001","review":"I'm really surprised at the lack of comments for this classic piece of Nunsploitation! This movie is really, really odd! Anita Ekberg plays a cancer obsessed Nun who works as a nurse. Old people start getting killed, and she starts flipping out. She stomps on an old lady's false teeth, shoots up morphine, picks up a guy and screws him, and gets sexually involved with a fellow disturbed nun. Is she the killer? Does she even know herself? Watch 'Killer Nun' to find out.<br><br>Warhol regular Joe Dallesandro appears as a doctor but isn't very memorable. Ekberg's lesbian lover is though! One of the hottest nuns you'll ever see!","user":"Infofreak","rank":[15,18]}]