[{"title":"Like nothing you have EVER seen before","rating":10,"date":"4 October 2007","review":"I'm not very good at plot synopsis, and I very rarely write reviews, but this film could quite possibly be a distant cousin to David Lynchs 'Eraserhead', in that it involves a marriage gone wrong, a (perhaps) mutant baby, infidelity, and so much more that is felt emotionally rather than explained and read into.<br><br>It contains the most OTT, eccentric, and brilliant performances I've ever seen, and you can't say that about many films, where the performances are unique and different. There's serious acting, hammy acting, B movie acting, serious/Oscar winning acting, comical acting, silent film acting, but never any acting like you have seen in this film. And I guess you could include David Lynch acting, as thats pretty unique too. And of course method acting.<br><br>Its like watching a theatrical play in cinematic form on acid. A lot of acid.<br><br>I showed this to my friend who has the darkest possible taste in films I've ever known, owns over a thousand dvds, and even he was blown away by the sheer chaos, resonant imagery, beautifully swift camera work and photography, and of course, the performances. Most notably Isabella Adjani who manages to be sexy and scary as hell at the same time. Her performance in this is monumental, especially the often noted 'underground menstruation' scene which could induce some viewers to a panic attack. I certainly nearly had one when I watched the film for the first time.<br><br>When a character has a breakdown in this film (both of the leads) its a REAL breakdown. And boy, do you ever feel it. Its realistic yet surreal. God knows how the director managed to coax these types of performances out of his actors. He must of drugged them or hypnotized them or something. He certainly didn't just yell 'action'.<br><br>The way the scenes are cut together is highly unusual and unconventional but it makes absolute perfect sense. I don't know how, it just does. I'm unfamiliar with the directors other work but if its even half as good as this I'll order everything I can get of his.<br><br>Recommended to any open minded individual who likes films that draw attention to themselves with an utter sense of uniqueness.","user":"Yoooooofffff","rank":[110,134]},{"title":"\"The only thing to fear is God\"","rating":28,"date":"28 October 2010","review":"This film doesn't do anything in halves, it doesn't abide by the mock humility of an understated/minimalist film that says \"I am important but I'm not gonna show it to you\". I generally love overstated/baroque movies as much as I like overactors (Kinski, Bette Davies, Nic Cage) but Possession goes beyond Gothic, it flaunts itself in violent anarchy even when it knows it's not being important. It's a movie in a constant state of violent flux, a chaotic maelstrom of emotion threatening to rip apart at the seams by force of its own negativity, an excess of emotion and abundance of expression. I don't know what Zulawski is trying to say through the film about his own divorce from wife and country and political system, like Eraserhead it's something so personal that it pierces through bottoms of the soul to come out at the other end and speak for things that touch all of us.<br><br>Sam Neill and Isabelle Adjani see their marriage come crashing down and the film is not merely the death and burial but the wake before and the mourning after. I don't like how Zulawski uses Isabelle Adjani to play different characters very calculated to be different sides of the same person, but then again I don't like movies that do that, it's like a very easy way to a quick symbolism (Ashes of Time, another film I saw recently, does that too). And I don't like who the monster turns out to be, for the same reason, and also because the monster, bloody and deformed, is a better parable of all the bile and hatred and oppressed furious anger felt the character who nurses it to life. The symbolism is too clear almost.<br><br>But the rest of the film you watch in stupefied silence. Possession is like a woman in the grip of hysterics running around an apartment tossing and breaking things and cutting herself up with a meat knife, arms flailing like an armature of a tentacled beast ready to tear itself out from a human body.<br><br>What Zulawski does here is perfectly illustrated in one scene: the couple have one of their terrible rows in the apartment, the woman storms out, music cue plays then stops, and we get the impression the scene has played out, we expect the cut. But then Zulawski has the camera track behind the man as he chases the woman down the stairs of their apartment and out in the street, pulling at each other and yelling in the middle of an empty intersection, then a truck carrying beatup cars comes rolling by, cars falling crashing down from it. Like the wail of a banshee, Possession is demented and frightful.<br><br>It's a movie that doesn't happen in the same place as other movies. Sometimes it gets hard for me for example to differentiate the look and feel of one noir from the other, one NYC crime flick from the other. Like Don't Look Now with its Venetian labyrinths, this has a sense of place and a malevolent presence in that place. It happens in that part of the city where other movies don't know how to go, the streets are different, the buildings and apartments look curiously different, and when an apartment catches on fire, there's a strange old woman down in the street corner yelling things about God (\"giving the light clear, getting it back dirty\") and cackling maniacally as though an end to the world is very close at hand.<br><br>Both Sam Neil and Isabelle Adjani give performances of a lifetime. Neil is going through the motions though, except for his 'going mad in a hotel room' scene in the beginning, his madness is external, pantomimed. Isabelle Adjani lives it though, feels and breathes it. She gives perhaps the most outstanding female performance I have ever seen. Her scene in the subway station, all spasmodic intensity and wordless cries, affected me physically like no other, at once monstrous and immensely sad.<br><br>This movie is a nervous breakdown and an agnostic lament against an absent indifferent God captured on celluloid. The tagline for the American release reads \"She made a monster her secret lover\", but this is not that type of film. This is like few films ever made, before or after, and is done with the ferocity of someone going mad in four walls, now perhaps clawing at the walls with blood and bile and staring at his designs as though there might be pattern and order there.","user":"chaos-rampant","rank":[102,127]},{"title":"What an experience!!!","rating":10,"date":"31 May 2003","review":"Acting, colour, camera movement and story thrown into hyperactivityWhat do you get? Well, the headache inducing, enthralling Possession. Beautiful, erotic and extremely disturbing, Andrjez Zulawski's film (admired by the Italian Master of the Macabre himself, Dario Argento) is an extreme assault upon the senses.<br><br>Mark (played excellently and deliberately over-the-top by Sam Neil) returns home from secret government work to his wife in Berlin, cue many shots of the Berlin wall representing the couple's marital breakdown. However, Mark's wife, Anna (a truly unforgettable, no holds barred and hypnotic performance from the lovely Isabelle Adjani) is behaving inexcusably strangely. Mark finds out that she is having an affair with Heinrick (another crazy performance from Heinz Bennet) and confronts him only to find that the lover has not seen Anna for some time. This is the part of the rollercoaster ride before your cart<br><br>plummets into some real thought-provoking, unsettling and scary surrealism.<br><br>Possession is definitely the film that requires many subsequent viewings. Excellent performances that frequently go way OTT, dreamily fluid camerawork and migraine inducing metaphorical horror, this is a true beast of the imagination. Love it or hate it, it is a true original masterpiece that is definitely not for all tastes. If films were placed in boxes and divided by flavours, like crisps, POSSESSION would sit in a box entirely by its self, awaiting only those who can take it. Go into it with an open mind like you've never gone into a film with one before. It can seriously mentally damage you if you try and figure it all out on that initial viewing, so beware; if there is truly anything to work out. The now infamous miscarriage in the subway scene is confusing, painful and sickening to watch and nothing like it can be found elsewhere. This is a hell of a film, if you're prepared for it!<br><br>`This for me exceeds anything thrown up by The Exorcist for sheer impact on the nervous system.' David Thompson - Sight and Sound","user":"Krug Stillo","rank":[112,141]}]