[{"title":"Better than Average Toho film","rating":8,"date":"4 April 2006","review":"I think what makes this movie special is not the \"giant insect\" aspect but the mysticism involved. Godzilla is a legend in the original at least but Mothra is actually a deity--and a hands-on deity at that. Inlikethe other creatures in this bestiary, Monthra is beloved of those who live with it and is protected by it, often by direct intercession.<br><br>Unlike the other monsters, Mothra can die, and has done so. But it continues to protect its people by reproducing the old fashioned way--it lays eggs. IT is also intelligent and intuitive, and its nature is NOT aggressive or violent. It's almost Buddhist in nature.<br><br>The only other time they tried to work this kind of mysticism into these movies was with King Cesar--a giant cocker spaniel with contacts. The beast was just too goofy to be taken seriously.<br><br>Mothra is a great addition to the canon.","user":"cpetr13","rank":[23,24]},{"title":"The first Mothra movie!","rating":10,"date":"14 June 2003","review":"This is the first Mothra movie, a story where a corrupted businessman kidnaps tiny twin priestesses on radiated Infant Island to exploit them for profit gain. This angers the island's guardian goddess named Mothra, who awakens and goes in search for the kidnapped twins, threatening to leave a wake of destruction along the way. <br><br>For this movie, there is a great screenplay by Shinichi Sekizawa, imaginable effects by Eiji Tsuburaya, good directing by Ishiro Honda and a beautiful music score (though not by Akira Ifukube, Yuji Koseki composed an equally superb music score). This movie has the usual elements in any \"kaiju\" movie: military, city destruction, tropical islands, scientists, reporters, natives and villains.<br><br>We get to see the very first appearance of Mothra's tiny twin priestesses, played here by the \"Peanuts,\" a popular Japanese singing-duo. Their serene and bewitching Mothra's Song is first sung here, and is an enchanting listening experience. A few more songs follow, and they're also sung beautifully. They take center stage in this story, singing as a plea for help from Mothra to rescue them from the greedy show-biz celebrity. Along the way, a reporter, photographer and a scientist team up in attempt to save the fairies to return them to their home before Mothra attacks! The male lead, played by Frankie Sakai, was hilarious and provided most of the comic relief in this action-packed monster flick.<br><br>The natives' rituals and chants to awaken Mothra are spellbinding and enchanting, some of the greatest piece of cinema work I've seen. <br><br>Overall, this film is a great introduction to Mothra, who would go on to appear in many other monster movies, most notably alongside Godzilla in his many sequels, produced by Toho. <br><br>Grade A","user":"OllieSuave-007","rank":[22,23]},{"title":"An anti-monster movie. Lots of fun.","rating":27,"date":"27 February 2001","review":"MOSURA (1961, released in the USA as MOTHRA) is like no other monster movie. It's colorful.  Most of it's settings are bathed in storybook like colors, has a pleasent, happy ending where the monster lives! <br><br>    A greedy showman/explorer Clark Nelson (Jerry Ito) finds twin fairies on an island off Japan.  He displays them on the Tokyo stage, where they sing what sounds like a lullaby.  It is actually a telepathic distress call to their god and protector, Mothra, a giant caterpillar.  Mothra comes to Tokyo, searching for the girls and Nelson, destroying most of the city in it's path.   The chase goes from Tokyo to Newkirk City (I guess this is suppose to be a little real life hamlet just south of Yonkers!) What I really love about MOTHRA is that it has many things most other monster movies don't.  The hero is a comical, older, tubby reporter, a sort of Japanese Lou Costello.  The monster is actually pretty.  In the Japanese version, there is some wonderful slapstick and odd humor.  THese elements make this film so unique.  Director Inoshiro Honda was best friends with more famous and more respected Japanese director Akira Kurosawa.  Kurosawa loved Honda's monster movies and according to rumor, yearned to make one himself.","user":"boris-26","rank":[22,23]}]