[{"title":"Grand Battle of Good Versus Evil","rating":19,"date":"19 December 1999","review":"One of Terrence Fisher's greatest directorial efforts certainly is this stylish, witty, thrilling adaptation of a Dennis Wheatley novel.  Richard Matheson did the screenwriting honors, ad like most of what he touches, it turns to gold.  This film has a wonderful score throughout, some superior set pieces and some pretty novel special effects for its day.  But behind all of this is the central, universal battle between the forces of good and evil, represented by the characters of Christopher Lee and Charles Gray. Both actors do an excellent job.  This may indeed be Christopher Lee's finest performance, which is all the more surprising since he not only plays a good man but also is in a role that Peter Cushing would have devoured. Lee, from the very onset of the film, plays a man well-versed in knowledge of the occult and whose presence literally steals scene after scene.  His counterpart, the malevolent Charles Gray, is just as good as Lee's antithesis.  Gray is an underrated actor whose presence also illuminates and transcends the screen.  The film boasts some great scenes including the much heralded Angel of Death scene, and there is a great scene between Gray and Lee's niece.   A tremendous film in many respects and one of Lee's best, Fisher's best and Hammer's best!","user":"BaronBl00d","rank":[45,50]},{"title":"But the age old law demands a life for a life, a soul for a soul.","rating":10,"date":"6 May 2011","review":"The Devil Rides Out (AKA: The Devil's Bride) is produced out of Hammer Film Productions. It's based on the 1934 novel of the same name written by Dennis Wheatley, with Richard Matheson adapting the screenplay. Directed by Terence Fisher, it stars Christopher Lee, Charles Gray, Nike Arrighi, Leon Greene, Patrick Mower, Sarah Lawson and Paul Eddington. Filmed in Technicolor with Arthur Grant the cinematographer and the music is scored by James Bernard.<br><br>1930's England and Duc de Ricleau (Lee) finds that his young friend Simon Aron has gotten himself involved with a Satanic cult led by the evil Mocata (Gray). As the Duc and his friends try to save Simon from the cult, Mocata and his followers summon the forces of evil to aid their cause.<br><br>It was meant to come out a bit earlier in the 60's, but Satanism, an always iffy subject, would have seen censorship strip Hammer's ideas for the film to the bone. So the studio waited a few more years and finally got the film out a couple of years shy of the 70's. It's a film that now, more than ever, is rightly viewed as not only one of the best film's to have come out of Hammer, but also as one of the best British horror movies ever released. There was much in the film's favour from the off, it had the studio's best director in the chair, the charismatic Christopher Lee in the lead and the talented Matheson (I Am Legend/The Shrinking Man/Hell House) writing the screenplay. The latter of which managing to streamline Wheatley's potent, but long, source material into a fast paced hour and a half movie. It's also, thanks to Wheatley, well researched, which when finding the story is set in more modern times, gives the film an authentic sheen as it rides on into the macabre.<br><br>On the surface the plot seems to be a standard good against evil battle, but it's not just a battle, this is a war on terror. Lee's determined, bastion of good, de Ricleau is not just fighting to save the soul of those he cares about, the film makes one feel that it's a battle he must win: for us all. Tho only blessed with the usual standard Hammer budget, the film has immense attention to detail, the power of black magic and the occult is painted vividly, with Fisher ensuring that nothing is hokey, this is serious stuff. The director, too, favouring atmospheric dread over short sharp shocks. What action there is is quality, sure the effects are hardly Oscar winning fare, but the impact is big. So too are the number of memorable scenes that puncture the story, the centrepiece of which is the night our \"good\" characters spend in floor drawn pentacle, fighting off the forces of darkness, some suggested trickery and terrifying manifestations testing their resolve, with the majestic Lee holding court with virtuous nobility.<br><br>The rest of the cast are uniformly excellent, with stand outs being Gray, excelling at silky villainy, even tho he's not on screen a great deal, and Eddington, who neatly plays it deadpan opposed to Lee's serious attempt to drive home the seriousness of what is going on. Noteworthy, too, that it's one of those rare occasions to see Lee playing the good guy. Grant (The Plague of the Zombies) makes wonderful use of the Technicolor, his lensing for the fire and brimstone finale is particularly memorable, and Bernard's score is eerie for the build up sequences and demonically boisterous for the critical moments: one of the best scores to accompany a Hammer film. It's not high cinematic art, and certainly not an overtly horrific film; in that you wouldn't recommend it to the boo-jump thrill seeker, but it's troublingly scary, adult and dripping with cold dread. A picture that closes in on you and challenges the myths and nightmares that lurk in the dark.<br><br>Up alongside The Wicker Man and Witchfinder General as one of the true greats of British horror. 9.5/10","user":"hitchcockthelegend","rank":[25,27]},{"title":"A very enjoyable and entertaining blend of action thriller and Satanic shocker.","rating":13,"date":"13 February 2003","review":"'The Devil Rides Out' is easily one of the most entertaining of Terence Fisher's Hammer movies. While best known for his Dracula and Frankenstein movies, this fascinating blend of adventure thriller and Satanic shocker is not to be overlooked. While technically a horror movie with strong supernatural elements, the movie's use of old fashioned thrills and Lee's dashing heroic character Duc de Richleau, gentleman and occult expert, give this one quite a unique flavour unlike most of the other Hammer classics. Lee is brilliant throughout, as is his nemesis the evil magician Mocata played by Charles Gray (Blofeld in 'Diamonds Are Forever'). The rest of the cast are also very effective. Leon Greene as Richleau's loyal friend Rex, Nike Arrighi as Tanith the mysterious girl rex becomes besotted with, and Patrick Mower as Simon, Richleau and Rex's young friend who foolishly dabbles with Satanism and soon finds himself under the control of Mocasta. The film is consistently interesting, with lots of excitement and some unpredictable plot twists. The Satanism is treated more seriously and realistically than many 1960s horror movies (and wait til you see \"The Goat Of Mendes\"!) , and this is a credit to Richard Matheson who adapted Dennis Wheatley's original novel. I am becoming increasingly aware of just how many movies I admire that Matheson had a hand in writing - many of Roger Corman's Poe series, 'The Legend Of Hell House' and 'The Last Man On Earth' to name a few. Matheson is one of the most talented and imaginative horror writers to ever work in Hollywood, and rarely gets the credit he deserves. 'The Devil Rides Out' is yet another fantastic movie from the Hammer studio, and highly recommended.","user":"Infofreak","rank":[47,56]}]