[{"title":"Beautiful photography, a real classic","rating":8,"date":"23 September 2000","review":"I've seen this movie some years ago, and I remember that it had the most beautiful photography. Antonioni chose to film real-life persons, instead of casting professional actors. Documentary-like, but still fictional, it tells the story not only of the people, but also of the River Po, in Italy.","user":"secondarymessenger","rank":[7,10]},{"title":"Documentary Fiction Style. A Small Neo Realism Classic by Antonioni","rating":7,"date":"26 July 2013","review":"Antonioni's documentary, his very first work made in 1943 but released only in 1947, \"Gente del Po\" (\"People of the Po Valley\") tells about the daily routine of poor fisherman and their families who live and work near the River Po. It's just that basically. The intriguing aspect of the film is that although using of real people in it instead of actors the director preferred to reconstruct events in a fictionalized way, inspired by the current Neo Realism but instead of making a feature film Antonioni explores the acting talents of the local residents of the place. What's real and what's not? Hard to know.<br><br>I didn't find it much interesting or so important even though this is the first creation of the future master of classics like \"Blow Up\" and \"L'Eclisse\" but I did enjoyed his use of cinematography, very agile and incredibly beautiful for a film made more than 60 years ago, quite powerful even today - the boat going down the river and then later reaching the shore is the most memorable moment just as much the mother taking care of her sick child. Antonioni's talent is fully evident here but just a small step. 7/10","user":"Rodrigo_Amaro","rank":[4,7]},{"title":"Down by the riverside","rating":4,"date":"11 February 2018","review":"\"Gente del Po\" or \"People of the Po Valley\" is an Italian black-and-white sound documentary released in 1947, so this one had its 70th anniversary last year and I think the main reason why this is still fairly known today is the name of writer and director Antonioni, one of Italy's greatest ever, and his effort here is from pretty early in his career as he was 30 when he recorded it and 35 when it was released, which means this was made still during the days of World War II. The title is fairly telling because the subject is summarized well in there. We find out about people living in Italy near the river Po and the struggles they may have as the consequence of that. Overall, nothing too extraordinary or outstanding, but it may be a decent watch for the grandchildren of those we see in here and also for people living in the same region today although it may be difficult to find out exactly where this was made. But these are the only ones who may want to see it. Even for Antonioni fans, these 11 minutes will probably not leave much of an expression. I give it a thumbs-down. Not recommended.","user":"Horst_In_Translation","rank":[1,1]}]