[{"title":"Lonely In The Serene Lagoon","rating":17,"date":"17 February 2008","review":"Unlike other sci-fi flicks from the 1950s, \"Creature From The Black Lagoon\" is not a film to laugh at. It's better made. Just by the title we know there's a monster lurking about. Yet, for the film's first 24 minutes we don't actually see it, only one of its claws. And that holding back of the monster's appearance fosters suspense and mystery. In addition, the film's B&amp;W cinematography is good, for its time, with lots of credible underwater shots. And while the dialogue does contain lots of exposition, the film at least tries to educate viewers.<br><br>There's nothing complex about the story. A scientific crew heads for the Amazon to do an archaeological dig, after a large fossil is found. The crew ends up at the Black Lagoon, a place of serenity, with its still waters, surrounded by palm trees and the sounds of monkeys and exotic birds. Through much of the film the peaceful setting together with soothing background music actually makes for a rather relaxing movie. Even when we see the monster, it seems lonely and hardly threatening as it glides gracefully through its watery home.<br><br>I suspect that the film's popularity when it was first released relates to the creature's distinctive appearance, with those moving gills and those bulging dark eyes. And of course, back in those days, the film was made for 3-D viewing, a novelty then that made the monster seem more real. Today, the film has an ever-so-slight environmental theme, given that at least one of the scientists prefers that the monster not be harmed, and given that humans obviously are encroaching into its habitat.<br><br>Because so much of the plot takes place underwater and therefore lacks dialogue, and given a runtime of only about 78 minutes, there really isn't that much to this movie. But what there is of it is interesting for its historical significance as a precursor to later sci-fi films, and for a monster that's not only photogenic but also alone and arguably lonely in a world that has passed it by, after eons of time.","user":"Lechuguilla","rank":[38,40]},{"title":"Why we like the Creature.","rating":4,"date":"4 February 2003","review":"Today, \"The Creature From the Black Lagoon\" is considered a classic. The film itself has become a cliche for the \"man-in-a-rubber-suit\" monster movie, and the \"gillman\" is now included in the pantheon of classic movie monsters -along with Dracula, Frankenstein, and the Wolfman.<br><br>I was a teenager when I first saw this Sci-Fi/Horror gem on television in 1965--the film was already ten years old by then--and I loved it. Surprisingly--even after a decade of watching technically sophisticated, state-of-the-art, unbelievably realistic prosthetic, animatronic, and computer-generated movie monsters--today's teenagers still love the old \"rubber\" prototype of all swamp monsters -\"The Creature From the Black Lagoon\". This is especially true of teenage boys. Why? Perhaps every adolescent male can relate to the film's star: the Creature is horny, inarticulate, moody, misunderstood, not pleasant to look at, and is unbelievably awkward with girls -the ultimate teenage \"geek\". We all remember this classic scene in the movie: the film's beautiful heroine (Julie Adams) decides to take a dip, unaware that the Creature is swimming below her. The image is archetypal : the powerful \"masculine\", and the overtly seductive \"feminine\", beautifully juxtaposed in a stylized sexual union. Then, from the murky bottom of his lagoon, the Creature leeringly watches Adams as she performs an erotic underwater ballet, and he knows that, for the moment, he can only look, not touch. (Is the \"scaly one\" shy and insecure? Or does he simply have a Catholic upbringing?) Indeed, much of the film's imagery lends itself to Freudian interpretation.<br><br>\nOK, so it's not exactly \"Beauty and the Beast\" -the Creature's passion is purely primal and elemental. But still, the fact that he restrains himself, satisfying his carnal curiosity with a simple caressing of Julie's ankles, and then retreats back to the gloomy bottom of his underwater sanctum to secretly watch her react in bewilderment, suggests he may be more human than he appears. But, alas, as any good Freudian will tell you, repression often leads to disfunction. And later in the film, in a brief, but beautifully filmed underwater scene, the Creature savagely drags the tantalizing \"Playboy centerfold\" down into the Freudian depths to his subterranean grotto -perhaps to hide her under his bed...where his mom can't find her. (I apologize for the metaphor. It's getting stale, I know.)<br><br>\"The Creature From the Black Lagoon\" was directed by Jack Arnold (\"The Incredible Shrinking Man\"), who (from 1952 to 1960) directed a series of fantasy/horror films for Universal Studios, including \"Revenge of the Creature\" -this film's sequel. Arnold would certainly object to us reading too much symbolism in his gillman, but the Creature may not have achieved such enduring status in monster-mythology if not for the fears and anxieties of the movie-going audience of the '50s. Arnold's dramatic use of the Creature succeeds, of course, by exploiting the human fear of the unseen threat lurking below -a very primal, deeply embedded in the human subconscious, and one that's been ruthlessly exploited by filmmakers in countless horror films. But Arnold's beast may also represent a more intellectualized fear. In the 1950s (and beyond), the threat of nuclear annihilation was very real, and like the creature in Shelly's \"Frankenstein\", Arnold's lagoon creature represents an elemental force of nature that, once discovered and awakened by science (even well-intentioned science), cannot be controlled -perhaps like the newly tapped, but untamed, power of the atom. Or (and this may sound like apostasy in one of John's pretentious, sophistical, over-intellectualized movie reviews, in which I've constantly and digressively wandered into the Freudian morass) perhaps the Creature is not a mataphor for teenage angst, forbidden knowledge, or cold-war anxiety. Perhaps the Creature is nothing more than a guy in a scary rubber suit chasing a pretty girl around a movie soundstage. But where's the fun in that?<br><br>\"The Creature From the Black Lagoon\" is still fun to watch. Actors Richard Carlson (the sophmoric, but noble-minded paleozoologist) and Richard Denning (the ambitious financier) play off each other well. And Julie Adams is simply gorgeous in her custom-made swimsuit. Also, the beautiful (albeit black &amp; white) underwater photography by James C. Haven is appropriately surreal: as the men begin their search and descend into the black depths of the lagoon, they intermittently twirl and hover amidst penetrating shafts of sunlight from above; and as the camera pans the peaceful bottom-landscape of the lagoon, the gillman suddenly springs from clouds of disturbed sediment, thrashing through curtains of shimmering air bubbles and drifting weeds, determined and unstoppable in his persuit of the human intruders. But one of the best things about the movie is the music. Some of the themes--written by Henry Mancini and Herman Stein--are quite beautiful; for example, as the expedition slowly makes its way up the dark Amazon, an ensemble of gentle woodwinds can be heard -a soft, subliminal prelude that lets us know we are entering another world, a primeval world. And who can forget the Creature's signature theme--the brassy, bombastic, three-note progression of DA DA DAAAAA!--whenever \"Creech\" appeared on the screen?<br><br>\nOf course, the best thing in the film is...the Creature. Jack Arnold suggested that the design of the gillman suit be based on the graceful form of the Motion Picture Academy's \"Oscar\" statuette. (Really!) The suit was designed and brilliantly crafted by make-up artist Bud Westmore, and there were two versions -one suit for filming on land, and another for filming underwater. On land, the gillman was played by Ben Chapman. Olympic swimmer Ricou Browning wore the gillman suit in the underwater scenes. The \"dry suit\" that Chapman wore was beautifully colored with iridescent greens and blues, and mottled with many other marine hues. The \"wet suit\" worn by Browning was a bright yellow -the marine hues chosen for the \"dry suit\" photographed too dark when filming underwater.<br><br>\nYeah, I really love this movie. I'm not sure why. Perhaps it's just one geek relating to another. You see, in the final reel, neither of us got the girl.","user":"gnosis7","rank":[108,121]},{"title":"Another Universal Studios Monster on the loose!","rating":10,"date":"30 December 2005","review":"\"Creature from the Black Lagoon\" is a movie I saw on a Saturday afternoon TV show called \"Monster Movies\". I loved it from the start. I now own the DVD collection and I find all the movies entertaining. The first of the series was, of course, \"Creature from the Black Lagoon\". Richard Carlson, Whit Bissell, Richard Denning, Nestor Paiva and Julia Adams are awesome in their roles. A fossil is discovered of a prehistoric \"gill-man\" by a Dr. Maia. He enlists his scientist friend(Carlson) and the research team he works for that is headed by Denning. They travel up a river that ends into an area known as \"The Black Lagoon\". Looking for more fossils, they discover the \"Gill-Man\" is alive! The Creature is captured and then escapes but is shot and severely wounded at the end. He sinks toward the bottom of the lagoon but don't worry; he made it back for two more sequels. The team of Jack Arnold(director), William Alland(producer) and Joseph Gershenson(music director, with help from young composer Henry Mancini) help make this film unique. The photography and locales are beautiful. The acting is superb and there is enough action and suspense to keep you at the edge of you seat. This is required viewing for 1950s sci-fi/horror movie fans.","user":"vtcavuoto","rank":[46,51]}]