[{"title":"\"I'm gonna count one, two, three. You can draw on two - I'll wait to three.\"","rating":7,"date":"6 July 2007","review":"For Sturges, the West was a man's world, and his cool, hard, detached style, emphasizing action, excitement and the rugged environment of the frontier, endorsed the point <br><br>Sturges believed there were three essentials to every Western: 1. Isolation  a man standing alone with no hope of help from outside (e.g. Spencer Tracy's predicament in \"Bad Day at Black Rock when the telegraph lines are cut). 2. A man, or group of men compulsively take law and justice, rightly or wrongly, into their own hands (e.g. \"The Magnificent Seven\"). 3. The issues are resolved by violence in the form of gunplay (e.g. \"Gunfight at the OK Corral,\" \"Hour of the Gun\"). He followed this up by saying: 'A Western is a controlled, disciplined, formal kind of entertainment. There's good and bad; clearly defined issues; there's chase; there's a gunfight.'<br><br>\"Hour of the Gun\" covers the period just after the famous gun battle The film is well done but there are some downfalls: It shows only one face of Wyatt his \"official\" law abiding side, with no women in his life And also no Johnny Ringothe main bad guy and rival of Doc Holliday<br><br>There are solid performances all around, beginning with James Garner who plays a hero with a badge, and is powerful in his intensity Wyatt's vengeance for the murder of his brother show the primal potency of violence<br><br>Robards plays John Hollidayan ordinary man dying of tuberculosis who becomes one of Wyatt's most loyal allies with an insatiable greed for drinking, gambling and fighting Robards is quite good in his character, and does deliver a couple of colorful lines to Earp The relationship and chemistry between the two men is unique It's difficult to outline, but it's like these two were old souls who would go through hell with/for each other and never need to wonder or to argue it<br><br>Ryan, as a Westerner, has played straight as well as crooked  his hunted killer in \"The Naked Spur\" and his ageing lawman (losing his vision at crucial moments) in \"The Proud Ones\" being equally memorable In more recent roles he has been basically sympathetic  as the horse-handler in \"The Professionals,\" as William Holden's weary, reluctant pursuer in \"The Wild Bunch,\" as the pacifist sheriff in \"Lawman\"  the exception being \"Hour of the Gun,\" in which once again he was the outlaw on the run, this time with a relentless Wyatt Earp in pursuit Ryan has perhaps achieved more as an actor in other genres, but the Western would have been the poorer without him","user":"Nazi_Fighter_David","rank":[50,55]},{"title":"One of the best tellings of the Earp-Clanton feud","rating":9,"date":"15 May 2005","review":"The story of the showdown between the brothers Earp and the Clanton gang is certainly as much a part of American mythology as the Puritans on the first Thanksgiving or Lincoln at Gettysburg. Hollywood certainly loves to tell the tale over and over again. In fact this is director John Sturges's second telling.<br><br>The Gunfight at the OK Corral done in 1956 by this director had as the climax the famous gunfight. Here in Hour of the Gun, Sturges starts his story with the gunfight and the results afterward.<br><br>Ike Clanton played by Robert Ryan in his usual grim fashion is not about to let Wyatt Earp triumph after killing some of his gang and his kin. He sets in motion a series of events that bring tragedy on the Earp family and a sinister turn in the character of Wyatt Earp.<br><br>The usual lackadaisical and quizzical James Garner is also pretty grim in this picture. He's throwing away the law he's sworn to uphold and the set of moral rules he lives by. And it's tearing away his character which is something Doc Holiday is deeply concerned with.<br><br>James Garner ranks right up there with all the fine actors like Henry Fonda, Burt Lancaster, Randolph Scott, Kevin Costner and Kurt Russell who have played Earp. James Garner never turned a bad performance in on the screen and he even got to play Wyatt Earp again in Sunset for Blake Edwards.<br><br>And Jason Robards, Jr. goes every step of the way with Garner as Doc Holiday. Holiday is the usual cynical alcoholic who's a jaded idealist and recognizes Earp as the real deal hero. His concern for Earp's character disintegration registers well in his performance.<br><br>Watch for a young Jon Voight, pre-Midnight Cowboy, as Curly Bill Brocius, a Clanton gang member.<br><br>This is a real western classic. And except for Hugh O'Brian's television series, the most accurate portrayal of the OK Corral events.","user":"bkoganbing","rank":[56,73]},{"title":"If you are going to kill like me, you might as well drink like me.","rating":7,"date":"1 August 2011","review":"Hour of the Gun is directed by John Sturges and adapted to screenplay by Edward Anhalt from Douglas D. Martin's novel Tombstone's Epitaph. It stars James Garner, Jason Robards and Robert Ryan. Music is by Jerry Goldsmith and cinematography is by Lucien Ballard. Story begins with the shootout at the O.K. Corral and tells of the aftermath involving the major players.<br><br>Although John Sturges' Gunfight at the O.K. Corall ten years previously proved to be popular, the director was never happy with the finished project, due in no small part to the fact that Hal B. Wallis controlled the script. Here Sturges takes control and crafts what in essence is a sequel to the 57 movie. Leaning more towards a character study with a dark edge, Hour of the Gun is refreshing in giving the Wyatt Earp/Doc Holliday characters a different story than the one we normally see on the screen; one that actually attempts historical accuracy where possible.<br><br>Viewing it now it's easy to see why the film was received coldly back on release. The Western movie was just about creaking along as a viable cinematic genre as it was, but with Sturges and Anhalt portraying one of America's folklore heroes in moral decline, it's unsurprising that it found itself out of sync with the times. However, time has been very kind to it, where over decades the re-evaluation of many a psychological Western has seen it viewed as one of the more bolder and cynical tinted oaters from the 60s.<br><br>With a fine script from Anhalt to work from, who also features as a player in the film as Holliday's whiskey smuggling carer, the cast work well. Ryan files in for villain duties as Ike Clanton and Garner as Earp and Robards as Holliday make for a suitably sombre pairing. There's also some quality in the support ranks where Albert Salmi, John Voight, Jorge Russeck and Karl Swenson leave good impressions. With Goldsmith tonally aware for the scoring and master photographer Ballard utilising the Panavision on offer for the Durango locations, it's an all round well put together production. <br><br>Some fat could have done with being trimmed off it to get it 10 minutes shorter; for the story starts to feel over long entering the last quarter. But Hour of the Gun is not only a better than your average 60s Western, it's also one of the better Wyatt Earp movies available to those interested in the subject. 7.5/10","user":"hitchcockthelegend","rank":[15,17]}]