[{"title":"Superb film with great performance by Essex","rating":8,"date":"14 June 2003","review":"ITV have just shown the Jim Maclaine(David Essex) films of which this is the first and Stardust is the second and as an avid supporter and fan of sixties and seventies British cinema i thought i had to check it out.<br><br>It doesn't disappoint with its gritty evocation of a fifties childhood with a lack of a father figure. Jim then turns to the Rock and Roll world when he buys a guitar from a pawn shop at the end. His rise and fall is taken up in Stardust with Adam Faith taking the Ringo Starr role as Mike.<br><br>Great, forgotten film with superior performances from Essex and Ringo Starr and a good cameo from Keith Moon and Billy Fury.","user":"smiths-4","rank":[19,20]},{"title":"Never Had It So Good","rating":5,"date":"10 July 2008","review":"This British film came out in 1973, the same year as the better-known American film \"American Graffiti\". There was evidently a fashion in the seventies for looking back at the late fifties and early sixties, even though only about 10-15 years separated the two eras. The qualifying period for nostalgia seems to have got longer in recent years: I cannot imagine a film made today looking back in the same way at 1998 or even 1993.<br><br>We first meet the main character, Jim MacLaine, as a grammar school boy in the late fifties. Jim's working-class background might today be called \"disadvantaged\", especially as he comes from a single-parent family, something rarer then than today. We learn how Jim's father walked out on the family when he was a child, but Jim's mother has worked hard to keep the family together, and hopes that her son, who is academically able if lazy, will go to university.<br><br>Jim, however, has other ideas. A life of study is not for him. On a whim, he drops out of school and runs away from home, not knowing what he wants to do with his life. He finds work on the Isle of Wight as a deckchair attendant, at an amusement arcade and a holiday camp. (The island is known for its holiday resorts, but in the early seventies it was best known for pop festivals, which gained it a reputation as the British Woodstock. This may explain why it was chosen as a setting for a film in which rock music plays an important part). Although Jim dreams of becoming a rock star he does not attempt to realise that dream until the final scene where we see him buying a guitar. (The story of his subsequent musical career is told in the sequel, \"Stardust\").<br><br>Jim's main preoccupation during his life on the Island is casual sex; his good looks make him attractive to women, and he has a number of one-night stands. He eventually returns home and gets married, without giving up his womanising ways; on the night before his wedding he cheats on his fiancée, Jeannette, with the girlfriend of his best friend, and best man, Terry. Terry, a university student who prefers trad jazz to rock, represents the steady, middle-class lifestyle which Jim has rejected.<br><br>I note that one reviewer refers to the film's \"wonderfully nostalgic timeline\" whereas another calls it \"defiantly anti-nostalgic\". Both descriptions are, in a way, correct. In one sense the film is anti-nostalgic. In 1973 there were certainly some people who looked back at the Macmillan years as the \"never had it so good\" era, but the makers of this film were not among them. The look of the film, although it is in colour rather than black-and-white, is deliberately based on the \"kitchen sink\" realist films of the late fifties and early sixties such as \"Woman in a Dressing Gown\" or \"Saturday Night and Sunday Morning\". The emphasis is on drabness and seediness with much of the action taking place in cramped, squalid, badly-furnished and ill-lit houses and lodgings. (Another British film from this period, Richard Fleischer's \"10 Rillington Place\" from two years earlier, achieves a similar look).<br><br>In another sense, however, the film does look back nostalgically at the fifties. Those like Terry who hoped that rock would prove no more than a passing fad and that jazz would make a comeback were to be disappointed. By the seventies rock and pop were the dominant element in popular music, especially among the young; jazz had become a minority interest. The film can be seen as a celebration of the early years of rock-and-roll, a time which saw the birth of a new, exuberant youth culture as young people started to assert tastes in music and fashion which were quite different to those of their elders. In that sense at least, the teenagers of the late fifties had \"never had it so good\". We seem to hear just about every well-known pop single from the period on the soundtrack; the title is, of course, taken from the Buddy Holly song. David Essex plays Jim, and several other musicians, including Ringo Starr, Billy Fury and Keith Moon, have supporting roles.<br><br>Ringo, like his fellow Beatles, never made a serious attempt at an acting career, but does enough here, as Jim's friend Mike, to suggest that he might have had a good chance of success had he done so. Rosemary Leach is also good as Jim's strong-minded mother. The film as a whole, however, never really works for me, for two reasons. The first is that the plot tends to become dull and repetitive, little more than a catalogue of Jim's sexual conquests. The second reason is the miscasting of the main role. Essex was one of Britain's top pop stars of the seventies, but had little previous acting experience, so seemed an odd choice for a film where he was not required to sing. Moreover, he seems to misunderstand his character, relying heavily on looks and charm and playing Jim as a likable Jack-the-lad, whereas in reality he is a complete bastard.<br><br>There are similarities between Jim and another heartless cinema Lothario, Michael Caine's Alfie, but at least the latter is never guilty of rape, unlike Jim who forces a schoolgirl to have sex after she has made it clear that she is unwilling. (Even the normally cynical Mike is shocked by this episode). Whereas Alfie finally comes to have doubts about his lifestyle (\"What's it all about?\"), Jim remains an unrepentant cad to the end, abandoning Jeannette and their young child to take up his new pop career. Caine, a much more accomplished actor, is able to make us understand Alfie, even if we do not exactly like him. Essex is never able to do the same for Jim. 5/10","user":"JamesHitchcock","rank":[10,10]},{"title":"start of a rocky road for Jim MacLaine","rating":6,"date":"31 July 2004","review":"David Essex got the lead role, through two films, in this story of a wanabee pop star who leaves his family and home life for a shot at the big time. Abandoned by his father as a child, Jim lets history repeat itself simply for his ambition - through 'That'll Be The Day', which establishes him as a musical talent with room to grow, through to the bleak 'Stardust' which focuses on the ups and downs of fame.<br><br>Ray Connolly's script for TBTD is ironic and clever, and gives scope to a large number of characters you remember - Rosemary Leach and Rosalind Ayres good as Jim's mother and girlfriend, Ringo Starr much better than expected as Mike who works on the fairground and takes the impressionable and cocky Jim under his wing. Mike would develop into Jim's manager in 'Stardust', where he was played by Adam Faith.<br><br>Billy Fury plays TBTD's biggest concession to a 'real pop star' as the unlikeable Stormy Tempest, while Keith Moon and Karl Howman, both in the 'Stardust' band appear briefly. Also involved in the film was the great Bonzo vocalist Viv Stanshall.<br><br>'That'll Be The Day' is often cited as the better film of the two Jim MacLaine feature, but I personally prefer the overblown, stoned, egotistical character we see in the sequel. David Essex is excellent throughout the two movies, though. The soundtrack album - a huge four-sider groaning with 50s period hits and pastiches - is still well worth a listen, although precious little of it appears in this film.","user":"didi-5","rank":[15,16]}]