[{"title":"Sergio Leone's first classic spaghetti western masterpiece and the best one of Clint Eastwood!","rating":10,"date":"15 February 2016","review":"A Fistful of Dollars (1964) in my opinion is the second best one in the spaghetti western series, that is Sergio Leone's first best masterpiece in \"Dollars Trilogy\", that started all. It is my personal favorite western movie of all time. I love this movie to death and I will always cherish it. <br><br>A lot of people are going for The Good, the Bad and the Ugly and Once Upon a Time in the West and of course Eastwood's Unforgiven as their best favorite western films. But no one talks about this one: A Fistful of Dollars, which in my opinion is a classic &amp; Sergio Leone's first masterpiece! This was the third Clint Eastwood's western film that I saw as a kid and I loved it every since. What can I say? Except I love this movie and it is my second favorite Clint Eastwood western movie. This one is in my top 5 Eastwood western films. I just love this movie to death and I love the story and the actors that it is in this film.<br><br>This movie is shorter for only an hour and 39 minutes long, which is not boring, it is fast paced and it is filled with classic moments. A Fistful of Dollars is a classic and I can always watch and enjoy it, without been bored. Clint Eastwood stars as the greatest Western character of all time, ever created - \"The Man With No Name\" in the greatest Western of all time. The story is an unofficial reworking of the Akira Kurosawa film Yojimbo from 1961. What I love about this film is Clint Eastwood's character who helps out a young family, who is torn apart from the Rojo's gang, he make sure that the kid goes in to his mom's arms, Eastwood was a heart in this movie. Also you have nice shootouts, Eastwood wears a boiler plate as a bullet proof vest, while Ramón Rojo (Gian Maria Volontè) fires his Winchester '92 rifle at \"The Man With No Name\" brilliant! Than \"The Man With No Name\" kills them all with his colt, excellent! Ramón fires the Mitrailleuse machine gun, killing dozen of Mexican Soldiers, awesome! Gian Maria Volontè as Ramón Rojo was a terrific villain and he did awesome job. <br><br>The plot start's faster and it is a stone cold classic that started all. Clint Eastwood is the coolest actor in the role playing the famous character of all time, that made him an icon. Every second on screen, he chews up the scenery and even today remains as bad ass as ever. Eastwood's character has been mimicked and copied numerous times over the years and yet he still stands up to modern scrutiny. Despite the character being so cool, there is still humor to be found, like the fact that he ALWAYS has that cigar in his mouth even when he's lying in bed. You also have the classic \"Mule\" scene which manages to be bad ass and funny at the same time. Sergio Leone directs everything to perfection and considering the film is from 1964, it's extremely well paced with plenty of action. The score was provided by Ennio Morricone, who for some reason is credited as Dan Savio. The music is another element that has been copied by practically every other Western since. It set the standard of what a Western could be and once you watch the film, the tune will go through your head for hours. <br><br>Not only that this movie is a classic but two movies ripped off the story from this film: Bruce Willis's Last Man Standing (1996) which completely ripped off the story from this film and Sukiyaki Western Django (2007).<br><br>This is the beginning of the Man With No Name series. The visuals are beautiful, the character of the Man With No Name menacing and mysterious, the score is brilliant and the action is a blast. The greatest \"spaghetti\" western ever. The one that launched a thousand copycat versions, even the wonderful score by Ennio Morricone. A Fistful of Dollars is a legendary, with bullets, as loud as the explosions and close ups extreme. The plot is simple (though not as much as the sequel, A Few Dollars More) but that is what enables Sergio to weave a masterpiece. Iconic score. <br><br>A Fistful of Dollars gets a perfect 10 by me and remains my all time best favorite Eastwood Western movie in the series that I absolutely love to death and I love Clint Eastwood's character. It's a genre that doesn't get enough love and it really should as it deals with all the familiar elements of action films, like this one is.","user":"ivo-cobra8","rank":[104,116]},{"title":"\"My mistake. Four coffins\"","rating":9,"date":"31 October 2005","review":"ALthough in many respects this film pales in comparison with Leone's later films, it is itself a brilliant cinematic achievement. In part, this is because its failings primarily appear to be due to constraints of budget (very small and highly uncertain) and time more than anything else. Even to the extent that the skills of Leone, Morricone, and others hadn't fully flowered yet, this film is incredible at how brilliantly it is handled for what is really a first-time go. Leone had worked on, and even directed, films before, but this is his first real foray in his own direction, and into a genre that he revolutionised and with which he became forever synonymous. Who can imagine westerns without at least thinking of Leone's films, while who can think of Leone without thinking of westerns (even though his last, and arguably greatest, film was a sort of gangster film)? Similarly, one should not criticize this film for being based on Yojimbo, for that film itself was based on an American story while A Fistful of Dollars really is very different in many key respects, not least of all Leone's visual style or his own sense of irony and symbolism derived from Italian precedents and Hollywood westerns.<br><br>We also see the nascent Leone visual style here, with the close-up style and contrast of close-ups and long shots appearing. This alone sets it apart from previous films, westerns and non-westerns alike, and still provides for great visual treats that one can appreciate today.<br><br>This film also ushered in Leone's obsession with details, hard faces, grungy people, etc., that also revolutionsed the genre.<br><br>This films also marks the first brilliant score of Ennio Morricone. It is here that he introduced the lonely whistling, guitar music, chorus, and unusual combinations and styles that developed into the music that has become in the U.S. synonymous with westerns and duels in the same way that Leone's visuals and themes have. <br><br>Despite its minor flaws, this is still a great film that is not only revolutionary but still great and fun to watch even today. Like Leone's other films, it is timeless. <br><br>One must also admit that it is amazing that in the U.S. an Italian film maker basing his films partly in Italian culture and an Italian composer could come to so define and be synonymous with this genre that Americans had considered so uniquely American, and highlight its underlying universality. That alone reveals the greatness of the films, of which this is the first.","user":"Wulfstan10","rank":[155,180]},{"title":"A western classic and the movie that launched the careers of Sergio Leone and Clint Eastwood.","rating":31,"date":"31 May 2003","review":"'A Fistful Of Dollars' is a wonderful movie which, despite having an enormous following of fans around the world, sometimes gets unfairly dismissed in my opinion. For two reasons - firstly because the second and third movie in Leone/Eastwood \"Man With No Name\" trilogy ('For A Few Dollars More' and 'The Good, The Bad and The Ugly') are so damn good it's easy to overlook this one. Despite being made on a much tighter budget and being less ambitious than the sequels to follow, it's still one of the greatest westerns ever made in my opinion. The second reason is the Yojimbo thing. Now movie buffs frequently slam 'A Fistful Of Dollars' as being a rip off of Kurosawa's 'Yojimbo', which I think is extremely misleading. I'm not disputing that Leone was familiar with Kurosawa (I have no idea one way or the other), but one name I rarely hear ANYONE mention is Dashiel Hammett. Hammett's hard boiled crime classic 'Red Harvest' was published THIRTY YEARS before 'Yojimbo' and features the same central premise of an anti-hero playing two rival groups off against each other. So if anyone deserves acknowledgement as uncredited inspiration for Leone (AND Kurosawa) it's Hammett. Anyway, this is an absolutely brilliant movie and it launched Clint Eastwood, a popular TV actor, into being a major movie star, and likewise put Sergio Leone on the map. I can't recommend 'A Fistful Of Dollars' highly enough, it's pure entertainment, and very, very cool!","user":"Infofreak","rank":[63,75]}]