[{"title":"Unjustly unknown","rating":8,"date":"21 November 2005","review":"Silent drama about gay painter Claude Zoret (Benjamin Christensen) and his model/lover Mikael (Walter Slezak). A beautiful countess (Nora Gregor) commissions Zoret to paint her. He does but Mikael starts to fall in love with her. He drifts farther apart from Zoret and their relationship begins to crumble...<br><br>Being a gay man and a film addict I was surprised I had never heard of this film! It just popped up unannounced on TCM and I'm glad I taped it. A 1924 film dealing with gay men was way ahead of its time. Their relationship is not made explicit--it's mostly communicated by looks, gestures, dialogue and (in one instance) hand holding. Still that was groundbreaking for that day. It does have the predictable tragic ending...but that was the way it would have to end. It was refreshing to see that their relationship was portrayed as no big deal and no one makes a fuss over it. Very well done.<br><br>The acting is just great. It's astonishing to see Slezak so young and handsome and THIN. Christensen was just great too. Gregor isn't that good--but she's not given much to work with. Also this was beautifully directed by Carl Theodor Dreyer. The version I saw also had a very good music score given to in by Kino International in 2004.<br><br>A very good, groundbreaking movie. It really deserves a wider audience. I give it an 8 because it IS a little slow at times.","user":"preppy-3","rank":[35,40]},{"title":"Art, Beauty, Drama","rating":9,"date":"6 November 2005","review":"This is a beautiful film, in its rich mise-en-scène and gorgeous cinematography. It resembles in polished photography, including how well it has remained over the years, the better-looking Hollywood films at the end of the silent era. The lighting is great, creating a very clear and crisp picture, with many subtle effects. And, the interior furnishings are lush.<br><br>\"Michael\" is a moving film, and I think that has more to do with the photography and settings than with the drama. The implicit homosexual relationship between the artist and his model, Michael, is curious, though. What I especially like about the narrative, however, is that it's about art--a very apt subject, which is heightened by the photography. Benjamin Christensen plays the aging artist, which is a significant casting decision, given that he was the great Danish filmmaker to precede Dreyer. Christensen had worked as an actor in his own films, so he's fully capable in this role. Additionally, cinematographer Karl Freund, who changed the role of the camera the same year in \"The Last Laugh\", has a small role as an art dealer.<br><br>Overall, Dreyer does better here with the actors than he previously had. He achieves a nice pacing, as well, except for a few mistimed editing cues, which are too quick. Even the subplot, for mood affect, works. It's a mature work--probably his first--resembling his later films in many ways.","user":"Cineanalyst","rank":[26,32]},{"title":"Have we changed so little?","rating":8,"date":"16 May 2004","review":"I invite any who see this to compare it to Novios búlgaros, Los (2003).<br><br>\nThe stories are remarkably similar. An older man is attracted to a younger and the younger (while primarily attracted to women) is willing to be the object of adoration provided that it pays well. <br><br>In this film the older painter is taken at every opportunity by his younger model (and ward). And somehow the younger man is not painted as being a complete villain.<br><br>Also of interest to me was a minor subplot, when the famous artist is attempting to paint a princess who has commissioned a portrait the artist struggles more than he has with any other painting (The earlier paintings that we see are all of men) In this one he simply cannot get the eyes right. His young model/ward (who first came to him as an aspiring painter) makes an attempt and gets it right at his first go. Perhaps what was symbolized here was that the eyes are the windows to the soul and the famous painter (who's only attracted to men) cannot see into the souls of women while his young ward (who has slept with the woman at this point) can do so easily.<br><br>\nThis film was remarkably well made for its day and while it does show some creaky signs of age, it is much more modern appearing than many of the films that came out of Hollywood much later. <br><br>The movie was fascinating even with no sound (which made a Swan Lake ballet sequence seem a bit weird) and the subtitles in the print I saw were in Danish (English translations were handed out before the show but did little good in a darkened theatre).<br><br>If you want to see fully one half of all gay themed films released in the 20's in one go, this may be your ticket. BTW... the other gay themed film made in the 20's Flesh and the Devil (1926) has much less gay oriented theme and is also available on VHS","user":"Havan_IronOak","rank":[34,44]}]