[{"title":"Intense and Cruel - Fulci in 'Mean Mode'","rating":8,"date":"8 July 2000","review":"A complete suprise to me - having seen Zombie and other Fulci films, with his stereotypical gore and inventive killings (usually at the hands of zombies of some type), Fulci moves completely away from any supernatural tone, to a downtrodden New York in modern-day America. A killer is on the loose, viciously murdering attractive young women. The difference that struck me with this particular film was immediate - the deaths are so much more realistic and cruel. The camera lingering over every explicit detail. Fulci seems to have set out to combine horror with thriller in this flick, and has done so on almost every level - the horror, however, mostly comes from the extremely realistic feel that this movie has and the downbeaten locations where everything occurs. The vicious murders seem all the more believable as a result. <br><br>I'd read many reviews for this film before finally watching it (in the UK, this film has an almost legendary cult-status; the BBFC actually had the film reels police-escorted out of the country when it was originally sent to them for certification in 1982), but don't necessarily agree with the way everyone mocks the killer's duck-like voice when talking to the police; if anything, it comes across as macabre and there is a reason for it, from a psychological perspective, revealed at the end. Oh yes - the final killing of the cop's girlfriend/prostitute - is every bit as nasty and prolonged as you've heard; the razor being dragged across her open eye and through her nipple, being slashed continually and slowly to ribbons, is just plain mean!<br><br>\nFor me this is by far Fulci's cruelest, most intense piece; Recommended only for Fulci fans and those who want something much more disturbing than any mainstream slasher pic - all others stay away; otherwise this one will leave you feeling depressed for hours afterwards","user":"chanelit","rank":[36,37]},{"title":"Sleazily Effective Thriller","rating":8,"date":"5 December 1999","review":"The late Italian director Lucio Fulci remains a controversial figure among horror film fans. Some view him merely as a hack exploitation director, who unsuccessfully tried to mimic the ideas and techniques of skilled horror directors such as Dario Argento and George Romero. Others view him as a directorial genius with his own distinctive style. Upon viewing my first Fulci film, THE NEW YORK RIPPER, I am inclined to believe that Fulci has not been given as much credit as he deserves.<br><br>THE NEW YORK RIPPER is a good example of an Italian \"giallo\" film, which blends the graphic gore sequences typically found in \"slasher\" films with the police investigations typically found in crime dramas. The film's plot is simple: a psychopath who talks like a duck is killing beautiful young women in New York City in vicious ways. Burned-out Lieutenant Fred Williams (Jack Hedley) is assigned to investigate the case, and soon gets taunting calls from the killer. At the same time, the one woman to survive the killer's attack, track star Fay Majors (Almanta Keller), finds that her life remains in peril.<br><br>THE NEW YORK RIPPER is unapologetically sleazy. The gore effects are very well done, and will make even the most hardened fans of gore wince at their brutality. There is also plenty of sex, which is quite explicit even by today's standards. In short, THE NEW YORK RIPPER is tasteless. But that doesn't mean it's bad. The film is well paced and there is hardly a dull moment. The murder mystery aspect of the film will keep you guessing until the film's climax. Fulci also  delivers stylish direction and the film has some nice atmospheric shots of New York City.<br><br>One of the main criticisms of THE NEW YORK RIPPER is that it is brutally misogynistic. On the surface, this appears to be true. The killer's victims are almost all sexually promiscuous young women, who are killed in a brutal, sexual manner. However, in my opinion, the film is not so much anti-woman as it is anti-humanity. Fulci's New York City, much like Martin Scorsese's in TAXI DRIVER, is a seemingly inescapable hell, filled with perverts, sex shows, prostitutes, and \"42nd Street gigolos.\" It should also be noted that the film's one strong and sympathetic character is a woman, Fay Majors.<br><br>Also, it is often said that THE NEW YORK RIPPER is Fulci's ripoff of the 1980 film MANIAC (also one of my favorites). This is simply not true: their only similarity is that they concern a psycho killer on the loose in New York City. MANIAC is a character study horror film, while THE NEW YORK RIPPER is a mystery thriller, much like Brian DePalma's DRESSED TO KILL(1980).<br><br>Lastly, I must say that the recently released, uncut, widescreen version of THE NEW YORK RIPPER is a major improvement over the old video version. While the dubbing remains shoddy in some parts, this new edition looks beautiful in its widescreen format. Additionally, the old edition chopped up some scenes which contained crucial clues about the killer's identity. With these scenes now intact, the killer's identity is not as totally out of left field as some critics have charged.<br><br>*** out of ****","user":"S.A.B.","rank":[16,16]},{"title":"My first Fulci film and I am highly impressed","rating":10,"date":"6 February 2000","review":"I had heard of Lucio Fulci for years through mail order catalogs, interviews in genre magazines, and newsgroup discussions. I just decided yesterday to shell out $15 to buy the Anchor Bay video version of \"New York Ripper\". I am a huge video collector and the clamshell box with the lurid cover art just called out to me. Well, I popped it into the VCR after not eating any dinner (to disallow any possible barfing!) and watched the video. Though the gore is plentiful and there are some downright sleazy scenes, I thought this was one of the best \"giallo\"-type crime films I've ever seen! While not as violent as I thought it would be, there are plenty of graphic murders to squirm at. The worst by far was the murder of the detective's prostitute \"girlfriend\", including savage razorblade attacks on her nipples and her eyes! Despite the other reviews that say there is a lot of sex, there is only one real sex scene, the rest is heavily implied. As for misogyny charges, I think the film isn't misogynistic, just the killer. And this is never explained, so I guess the film could be a tad anti-woman, but I didn't really see anything expressing this feeling that I wouldn't see in any other slasher film. The widescreen version is the best one to see, it displays Fulci's gorgeous cinematography in full and makes the film look a little more classy and sophisticated than it should. The performance of Almanta Keller as Fay, the heroine, is one of the best I've seen in Italian horror films. Her dream sequence is another disturbing visual sequence that might leave your dinner in your lap! What more can I say, I love this movie, it is sleazy, it is violent, it is controversial, but the atmosphere and style of Fulci's filmmaking more than makes up for it.","user":"Casey-52","rank":[14,14]}]