[{"title":"Cléo de 5 à 7's black and white Paris is an elegant backdrop to this moving, unique story of self-discovery.","rating":30,"date":"30 January 2010","review":"As the title reveals, Cléo de 5 à 7 takes place between 5pm and 7pm. In this time, we follow a beautiful young singer, Florence 'Cléo' Victoire, as she walks the busy streets of Paris all the while awaiting a dreaded test result from her doctor.<br><br>Director Agnes Varda, nicknamed \"Grandmother of the New Wave\", combines fluid camera movements with sporadic 'jump cuts' to casually glide us through the streets of Paris, allowing us to delve deep into the scenery. The mobile camera provides a realistic and intimate experience.<br><br>Florence 'Cléo' Victoire begins her journey embodying a cliché. She is consumed by materialism and almost hypnotized by her own beauty. She is selfish and ignorant to her surroundings. From 5 to 7, Cléo peers deep within herself and in result experiences a kind of enlightenment. She begins to open her eyes to the outside world, observing the hectic streets of Paris, visiting old friends, and in a twist of fate meets a fascinating young soldier preparing to leave for Algeria. The soldier is a beautifully written character. <br><br>With subtext involving serious topics such as classism and more specifically impoverishment of Algerians (1954-62), one would predict that the film's message was multifaceted, and perhaps intended to serve a cause.However, after watching the film, I've come to that conclusion that Cléo de 5 à 7 is meant to be a celebration of life. The film encourages us to appreciate our blessings without the use of any clichés and without being preachy.<br><br>Cléo de 5 à 7's black and white Paris is an elegant backdrop to this moving, unique story of self-discovery. If you are a French New Wave lover or just someone who adores Paris, I'd encourage you to watch this film. It is simply stunning.<br><br>-Joanna C.T. http://addictivefilm.blogspot.com/","user":"slowpoke_98","rank":[19,20]},{"title":"Why I love French Film","rating":24,"date":"24 June 2004","review":"This film is a perfect example of why I love French film. In a word, realism. In many words, the desire to capture life's most important, daring, fanciful, yet haphazard moments with the faith that by doing so you are illustrating a timeless notion. Cleo from 5 to 7 plucks a single string from a singer's life and by pulling at it, illustrates the fabric of the beautiful and unique, but predetermined world that it is woven into. What illustrates this best is the third scene of the movie when the heroine flits about a local shop browsing hats. The camera shows her shopping but also captures many reflections that expose the larger world around her. The window pane showcases soldiers marching by, foreshadowing the war in Algiers. The mirrors take snapshots of Cleo with different head-dresses all be-speaking a future she won't choose. In the background, her maid sits disapprovingly. Small details like these, that are often neglected in other movies, are the backbone of this work of art. Cleo from 5 to 7 is a movie about much more than two hours in the lead character's life. It is about the character's whole life as illustrated by two hours. Like Joyce's Uylsses, it finds parallels between the struggles of a day with the struggles of a life.","user":"scip111","rank":[44,54]},{"title":"Life and Movement in the shadow of Death","rating":8,"date":"22 June 2005","review":"\"Cleo from 5 to 7\" tells the story of a young French singer, who fears that she may be seriously ill. What could have been maudlin \"movie of the week\" soap opera, is transformed by Agnes Varda into a unique movie experience.<br><br>The film contrasts Cleo's fear of death with the teeming life of the Paris streets, where street entertainers swallow live frogs and puncture their biceps; and the more normal members of the crowd busy themselves with the usual affairs of business and the heart. A large amount of the film takes place outdoors, with Cleo and the people in her life always walking, running or driving. There is a wonderful scene of Cleo-Distraught over an ominous tarot reading by the fortune teller- descending a circular staircase, her shoe heels clicking out a counterpoint to Michel Legrand's pensive music.<br><br>Sometimes just watching the way someone moves is very revealing. Director Varda has a fluid camera style which enlivens every scene. As often happens in European art films the story unfolds in a slow undramatic fashion, but their is so much going on in the image and the text, that you don't mind. Essential viewing.","user":"Jediclampett","rank":[23,28]}]