[{"title":"A Journey of Discovery","rating":10,"date":"16 December 2001","review":"When it comes right down to it, what you `think' you want isn't necessarily what you `really' want, nor is it likely to be anything you need.  But finding the answer is up to the individual, a prospect that's explored in the satirical `Sullivan's Travels,' directed by Preston Sturges.  Movie director John L. Sullivan (Joel McCrea) has made a career of churning out one successful comedy after another, yet he remains unfulfilled.  He longs to do a `serious' film, one with meaning, a drama that will leave his mark on the industry and the world.  And he has a property that he thinks is perfect, a screenplay entitled `O Brother, Where Art Thou?'  The studio he works for, however, balks at the idea; Sullivan's comedies are not only good, they're a cash cow for the studio, so why fool with success?<br><br>\tSullivan is adamant, though, and determined to make his film he strikes a bargain with the studio and gets the green light.  But once he's given the go-ahead, he wants to do it right-- and he realizes that to make a truly meaningful film, he must first experience himself the hardships of life he will be examining in `O Brother.'  So with only a dime in his pockets, he sets out on the road to find out what `life' is really all about.  And before it's over, he will get all he's looking for and more, in an odyssey that will be unforgettable for Sullivan, and for the audience, as well. <br><br>\n\tFilled with pathos and poignancy, Sturges' film is an insightful sojourn across the territory of the human condition.  It'll make you laugh and it'll make you cry, as along with Sullivan you come face to face with some hard truths about reality.  And Sullivan's eventual epiphany regarding his personal wants and needs may be your own, as well, because this is a film with a definite message that is honest and undeniable.  A lesson in life delivered subtly and sensitively by Sturges, who makes it entertaining and thought provoking at the same time.  It's refreshing, in fact, t discover a film that delivers such an impact without having to resort to any kind of sensationalism, relying instead on the inherent humanity of the story, which Sturges conveys masterfully.  With exceptions, of course, it's a sensibility few of today's directors seem to possess.  Some notable exceptions would be Ang Lee with `The Ice Storm,' Kenneth Lonergan's `You Can Count On Me' and Tom DiCillo's `Box of Moonlight.'  All are films that, like `Sullivan,' are journeys of discovery, profound in sentiment without being overly sentimental.  There are more, to be sure, but they seem too few and far between.<br><br>\tOne of the elements that makes this film so engaging is its colorful cast of characters, and the actors it employs to bring it to life, beginning with it's star, McCrea, who hits his stride as Sullivan with facility.  He credibly reflects Sullivan's ideals and principles with a look, as well as an attitude, that makes it work quite naturally.  You can believe this is a man with, perhaps not a naive, but certainly a rather guarded perception of life in the real world.  Which is not to say he lacks insight or wisdom; it's merely one of the basic truths this film points out-- that people live within parameters of their own design, established through personal experience and frame of reference.  And that's the John Sullivan McCrea presents here, with a portrayal that is honest and incisive.<br><br>\tVeronica Lake was one of the hottest actresses around in 1942 when this film was made, and as the girl who becomes a part of Sullivan's journey, she lends considerable charm and a bit of mystique to the film.  It's a fairly straightforward role that benefits from her sparkle and personality; a notable performance that adds a touch of humor and some class to the proceedings, without being particularly exceptional.  But watching her, it's easy to understand the attention she received, especially after draping her long blond hair across her eye, peek-a-boo style-- which started a craze that swept the country, while creating an indelible image that ultimately defined her career.<br><br>\tThe supporting cast includes Robert Warwick (Mr. Lebrand), William Demarest (Mr. Jones), Franklin Pangborn (Mr. Casalsis), Porter Hall (Mr. Hadrian), Byron Foulger (Mr. Valdelle), Margaret Hayes (Secretary), Robert Greig (Sullivan's Butler) and Eric Blore (Sullivan's Valet).  Call it a lesson in life, or a lesson about human nature; however you see it, `Sullivan's Travels' is an experience you're going to remember.  Entertaining, enjoyable and enlightening, it's an uplifting appreciation of the way things are, and not necessarily the way you `think' they should be.  It's a film that celebrates the comfort to be found in finding your own niche and realizing the importance of whatever it is that you contribute to your world and those around you.  It leaves you with a sense of purpose and the understanding that the grass is not always greener on the other side.  And it makes your own grass look pretty good in the bargain.  It's the magic of the movies.  I rate this one 10/10.","user":"jhclues","rank":[68,82]},{"title":"Laughter, A Precious Commodity In This Cockeyed Caravan","rating":10,"date":"11 May 2007","review":"Sullivan's Travels is a twofer for me, it's my favorite Preston Sturges film and my favorite Joel McCrea one. It's an anti-message film, loaded with humor, with a most sublime message indeed.<br><br>Joel McCrea plays director John Sullivan who's tired of making silly comedies and musicals for his studio. He wants to make films of social significance with a message about the troubles in today's world.<br><br>Problem is that he doesn't know anything about poverty and unemployment, he's a rich kid who's been to boarding school. So off he sets, several times it turns out, to discover how the other half lives.<br><br>That last time he sets out is a bit unplanned and through a combination of circumstances he winds up on a prison chain gang in some southern state. He learns some really profound lessons from that experience.<br><br>But that's the serious side of Sullivan's Travels. Before that the film has some really gut splitting funny moments like McCrea learning about the speed of a whippet tank, being accused of stealing his own car. But my favorite is when he falls in the clutches of spinsters Elmira Sessions and Esther Howard. McCrea sets out to learn about poverty and deprivation and the two sisters see him as the answer to some poverty and deprivation they've been suffering for some time. Maybe the chain gang didn't look so bad.<br><br>Veronica Lake in her memoirs said that one of the films she enjoyed most was Sullivan's Travels where she plays an disillusioned Hollywood hopeful who befriends the tramp McCrea without knowing who he really is. The following year Lake would be paired with Alan Ladd who was closer to her height. She said McCrea was a kind and decent man and wonderful to work with. The disparity of their height was the source of some amusement and some problems for Preston Sturges. Lake was a tiny thing, it was why she was teamed with Alan Ladd, and McCrea was well over six feet tall. Check the shots of them together, very rarely will you see them standing side by side.<br><br>Sturges used a lot of his regular company of players. My two favorites in the supporting cast are Robert Grieg and Edward Blore who are McCrea's butler and valet. Both turn out to be wise men in their warnings to their boss about this folly he is undertaking.<br><br>It's been said that Sullivan's Travels is supposed to be the anti-Frank Capra film about messages. I'm not sure Capra saw it that way. If you look at the portion of the film when Sullivan falls into this unfamiliar universe of the chain gang, it's very similar to what George Bailey was experiencing in that parallel universe he was sent to in It's A Wonderful Life. I think Sturges and Capra would find a lot of common ground in the messages of It's A Wonderful Life and Sullivan's Travels.","user":"bkoganbing","rank":[42,50]},{"title":"Reckless, tightrope masterpiece.","rating":9,"date":"14 September 2000","review":"Sturges' most daringly double-edged film, laced with bitter ironies.  It is also arguably the most audacious film in Hollywood's (mainstream) history, audacious because it takes the kinds of risks that can so easily fall flat on their face, and right until the final image, as Sturges becomes increasingly ambitious and multi-layered, you wonder how long he can keep it up without getting ridiculous.  It never does, but the film is so full of contradictions, tensions, suppressions, clanging lurches in tone - 'Travels' is ostensibly a comedy, and one of Hollywood's best, but the last twenty minutes are truly painful to watch, harrowing and not at all funny.<br><br>The overriding source of tension, of course,  is the film itself, the plot, and the emotions that are supposed to be elicited.  It is very difficult, and frequently impossible to gauge the tone of any one scene.  Sometimes this is straightforward, as when information is deliberately withheld from the audience, it is asked to make a judgement, and then shown to be wrong, as in the scenes where the studio moguls claim a background of deprivation (which is historically plausible).  This kind of comedy is familiar enough. <br><br>\nBut what about the later montage of Sullivan and the Girl experiencing the 'reality' of poverty - are these scenes supposed to be genuine representation of poverty?  Are they part of a wider satire on pious films like 'Grapes of Wrath', which dubiously aestheticise poverty - there are a lot of Expressionistic flourishes in this sequence?  Are they a kind of abstract purgatory through which Sullivan finds spiritual understanding? <br><br>\nThere is a big difference between the representation of poverty in this sequence and the one where Sullivan is attacked and sent to prison.  But is one more 'authentic' than the other - the second one bravely rejects the view of 'noble' poverty, shows how it dehumanises people, turns them instinctual and brutal; but it also provides a neat moral, which suggests that if you do somebody wrong, you will be (horribly) punished for it.  This realism, therefore, is as contrived as the first.  Is this Sturges' point, that the good intentions of realism are always tainted by ideological assumptions, patronising good-will, or motives of elevation.  This sense of artifice, of a film comprised of varying self-reflexive modes rather than a plausible narrative, runs through 'Travels', with characters talking about the film they're in as a plot - in direst danger, Sullivan acknowledges the need for a helluva twist which duly arrives, filmed in silent slapstick with barely concealed Sturges contempt (and did his friends seem terribly put out by his death?).<br><br>This would seem to uphold 'Travels'' ostensible theme, its celebration of comedy as a sugar with which to sweeten the harshness of reality.  This is a very cynical view of comedy, and a highly manipulative, conservative one - distract an unhappy populace from the injustice of their lives.  The best comedies - from 'Sherlock Jr' and 'Modern Times' to 'Playtime' and 'The Discreet Charm of the Bourgeoisie' have always been about real life, encouraging their viewers to think harder about the society they live in, much more effectively than so-called naturalism.  <br><br>'Travels' is no exception.  It might be a celebration of comedy, but this is comedy a million miles from 'Ants in your Pants'.  What other 40s film still manages to show the brutality of poverty, of the prison system, of race relations, the fate of young women in sexually voracious Hollywood (the Girl's ease with her body in the swimming pool scene speaks volumes), however we choose to read them?  When Sullivan's determination at the end to continue making populist comedies is endorsed by the ringing laughter of the world's meek and suffering, the disjunction is grotesque.  This is a man, on an airplane, completely removed from reality, surrounded by wealthy toadies. Those happy laughs could so easily be contemptuous guffaws, because what Sullivan wants to do, and Sturges hasn't, is hide the inequalities of capitalism, the system on which Hollywood thrives, and the flaws in which they would be only too happy to cover up with inanity.  But to even suggest this is to fall into the 'Capra' trap mocked at the beginning.<br><br>This difficulty is what makes 'Travels' such a stunningly modern film - its shifts from sophisticated verbal wit to elaborate slapstick to blatant Carry On-like innuendo (the matronly sister dusting  the bedpost after seeing a sweating, shirtless Sullivan work) to tragedy to hallucination and dream to satire foreshadows Melville and the New Wave, while the privileged rich man who cannot escape Hollywood would transmute into the guests who can't leave the house, or can't get dinner in later Bunuel films; or the film that begins with an end.  The opening sequence takes off 'Citizen Kane'.  The deadpan genderplay is quietly gobsmacking, and Veronica Lake as a (gorgeous) tramp would be alluded to by Jeanne Moreau in 'Jules et JIm'.  But the joys are all Sturges', as he democratises comedy (see again that swimming pool sequence);  I love in particular those glorious supporting actors: my favourite being the immortal Eric Blore and Robert Greig as Sullivan's servants.","user":"the red duchess","rank":[81,105]}]