[{"title":"Superb understated and subtle cinematography, beaming and lovely main character, Ozu transforms what might be a moderately interesting peek into a family's life into a rich and delightful film","rating":10,"date":"22 September 2003","review":"I am writing this minutes after I finished watching this lovely 1951 film on video, \"Bakushu\" (\"Early Summer\").  It is my first introduction to the work of Yasujiro Ozu, who directed and co-wrote the film. Ozu (b.1903, d.1963), who directed over 50 films from the 1920s-1960s, is probably most famous for his film \"Tokyo Monogatari\" (\"Tokyo Story\") of 1953, which is cited by some film critics as one of the ten best films made.<br><br>\"Early Summer\" is the second of three films in which Setsuko Hara plays an unmarried young woman, aged 28 in \"Bakushu\", named Noriko (also in Ozu's 1949 \"Banshun\" or \"Late Spring\", and in \"Tokyo Story\"). Her always beaming and confident smile, mischievous but loving laughter, and unselfish and loving manner are a constant joy to experience - she's the kind of person anybody would love to have as a friend.  Noriko lives in post-WW II Tokyo as part of an extended family of her parents along her somewhat stern brother (a doctor) and his warm wife and their two spoiled young sons, aged approximately 3 and 6.  The family partially depends on her income as an office clerk of sorts.<br><br>The central theme is the family's concern that carefree Noriko is unmarried. A proposal comes in from a man twelve years her senior; the family feels this is a great opportunity that they hope she will respond positively to. How she takes all this in stride and works through the gentle pressure of getting married is the plot of the film, but the understated, low-key and low-angle camera shots make what might otherwise be an unexceptional story sweetly captivating and delightful.<br><br>I am reminded in this film of my favorite director, Satyajit Ray. Like Ray, at least in \"Bakushu\", Ozu very effectively uses minimal dialogue, little or no music, and subtlety to draw the viewer into the setting and paint a realistic picture of everyday life. <br><br>I felt instant connection with Setsuko Hara as vivacious and indomitable Noriko.  Her brother, Koichi (Chishu Ryu) was impeneterably unemotional, probably stereotypically so. Koichi's wife, Aya Tamura (Chikage Awashima) seemed a tamer version of Noriko, almost like an older sister from the same roots.  The parents Shukichi Mamiya (Ichiro Sugai) and his wife Shige (Chieko Higashiyama) were realistically portrayed as being content in fulfilling their familial responsibilities, and provided an even emotional keel.<br><br>If this is at all typical of Yasujiro Ozu's films, then I am anxious to seek out and start to enjoy his many other creations.  The film moves at life's pace, but Ozu transforms what might be a moderately interesting peek into one family's life into a rich and delightful tapestry.<br><br>   --Dilip Barman Sept. 21, 2003","user":"Dilip","rank":[35,39]},{"title":"Delightful, & A Triumph For Ozu's Style","rating":11,"date":"11 April 2005","review":"Ozu's \"Early Summer\" is a delightful movie to watch, pleasant and light in its story, yet thoughtful and sensitive in a good many respects. It is also a triumph for Ozu's simple-looking but carefully conceived style of film-making, and the material in the story parallels the style in a natural but satisfying manner.<br><br>So many of Ozu's movies portray the distinctive characteristics of the Japan of his day, and yet do so in a way that make the characters and their situations seem almost universal. By focusing so much of the running time on repeated daily routines, even the habits and customs unique to its own society become points of identification, since routines are routines, regardless of how they might differ from one time and place to another.<br><br>Here, the family relationships among the central characters are fleshed out carefully, so as to create many possibilities in the interactions between the various generations. There is significant screen time given to many different characters, and all of them are worth getting to know. Noriko (Setsuko Hara) is the main character, in that she ties together her family with the characters outside of it, and as the movie proceeds, it is her life that gradually becomes the main focus. Ozu's presentation of the preoccupation that the other characters have with Noriko's unmarried status is both believable and perceptive. Hara is very endearing in the role, and she does very well in portraying her relationships with and her reactions to the other characters.<br><br>Given that Ozu deliberately makes very sparing use of camera movement and similar techniques, in favor of simple but carefully composed settings that emphasize the characters themselves, there is a nice parallel in the way that the story proceeds and the main questions are resolved. The characters' heartfelt decisions are shown to be more worthwhile than meticulous arrangements. As tends to happen with his films, a pleasing pattern with a ring of truth to it emerges, almost unexpectedly. It's enjoyable to watch, and an admirable display of cinematic skill.","user":"Snow Leopard","rank":[18,19]},{"title":"And apart from \"Tokyo Story\".....","rating":18,"date":"18 February 2003","review":"There are few lovers of serious cinema who do not consider \"Tokyo \"Story\" a masterpiece. I, for one, would be prepared to place it among the \"top ten\" of all time. When I first saw it on British TV many years ago I was excited by the discovery of a form of cinema unlike any other. In the months that followed I began to experience frustration that no other of Ozu's fairly large output was available. At long last \"Ohayu\" turned up. I remember thinking it very inconsequential beside \"Tokyo Story\" but pleasing nonetheless, possibly Ozu not so much having an off-day as a day off. What I found remarkable however was its stylistic affinity to \"Tokyo\", the absence of camera movement, the prefacing of each dramatic sequence, generally taking place in a domestic interior shot from near-ground level, with two or three shots, often still-life exteriors with background music carried over into the next dialogue scene; in other words a director who is completely true to his own way of seeing things, as instantly recognisable from a single shot as are composers as diverse as Martinu, Rawsthorne and Roy Harris from one bar of their music. It is only recently that I have managed to catch up with five other Ozu films, each a gem in its own way but small in scale. \"Early Summer\" is a typical example. It deals with the same situation as \"Late Spring\", that of the pressures on a young woman by her family to get married. Ozu generally explores family relationships which, although hardly dysfunctional, abound in tensions. Here we have an elderly couple living with their doctor son and their unmarried daughter, the son's wife and their two small sons completing the household. An elderly uncle visits early on and neighbours and friends, particularly those of the unmarried daughter make up the rest of the cast played by a company of stock actors that appear in many of Ozu's films. Each generation responds to life in its own way. The elderly couple are disappointed particularly with the younger members of the family. They sit on park benches or in the privacy of their bedroom and sigh that, in spite of everything, things could be much worse and they should be happy with their lot. The middle generation get on with the business of living, often in a blinkered way so that we wonder whether they are aware of the tensions they so often generate. The children are completely selfish little monsters who cut up rough if they don't get their own way, as when they mistake a wrapped loaf of bread that their father brings home, for the model railway accessories they are hoping to receive. There is little in the way of plot other than that of the \"Will she? Won't she?\" variety. But for the enormous expectations raised by \"Tokyo Story\", I might well have passed \"Early Summer\" by. And yet there is a uniqueness and purity of style that somehow draws me back to these simple vignettes of Japanese domestic life again and again. Ozu has often been compared to Jane Austen, but would not a more appropriate analogy be the novels of Ivy Compton-Burnett. Both are the unique minimalists of their respective arts.","user":"jandesimpson","rank":[23,27]}]