[{"title":"48 takes?!! Jeez!!","rating":9,"date":"8 December 2004","review":"This was, in many ways, the zenith of the Astaire-Rogers 10-film saga. And it manages to reveal a perfectly cohesive story (as well as a marvelous musical score) without one frame of mistaken identity or a misunderstanding which takes an hour-and-a-half to resolve. (Spoiler-ish) Astaire is initially betrothed to society girl Furness, but goes out into the world to raise a wedding dowry and ends up meeting, dancing with, and falling in love with Rogers instead. (If it reads like it all happens too fast, by all means acquaint yourself with the rest of the A-R film series.) The plots ultimately didn't matter- only the duo's ravishing dance duets, which were their love scenes. Probably no more thrilling dances have ever been presented on film: the tap routine \"Pick Yourself Up\" which first introduces the couple to each other; the 'lovely Waltz in Swing Time' (a happy duet which sort of marks the Act 1 finale); and the dramatic \"Never Gonna Dance.\" This number is stunning for two reasons: it's a dance of a break-up, and it's the dance which may have been their most difficult to film. Because Astaire's mantra was uncut (or nearly uncut) dance numbers, his duets with Rogers were usually all done in one unbroken camera shot. In \"Never Gonna Dance,\" the action travels from one dance floor up two curved staircases to another, cutting only one time, to a final 2-shot showing Rogers gloriously spinning in and out of Astaire's arms several times before making a dramatic exit. The shoot, history says, lasted from mid-morning until about 4 a.m. THE NEXT DAY, as take after take of the dance was spoiled with one problem after another (cameras bumping into walls, lights crashing, Astaire's toupee flying off his head!). Eventually, Rogers' feet bled into her high heels, but neither she nor Astaire wanted to stop until they got it right- and they finally did on take number FORTY-EIGHT. Now that's entertainment.","user":"movibuf1962","rank":[76,82]},{"title":"A Fine Romance!","rating":10,"date":"8 October 2004","review":"If you only watch one Fred Astaire &amp; Ginger Rogers musical this should be the one. There has long been a debate over which film is their best: Swing Time or Top Hat. In my opinion, Swing Time definitely takes this honor, number two being Top Hat, followed by The Gay Divorcée. All of their films together are excellent, but Swing Time is set apart because it takes a much more realistic look at love and life. This film handles the love affair between Astaire and Rogers' characters in a way that none of the other films did. The romance is touching, sweet, charming - and believable! <br><br>The songs are amazing, including \"Pick Yourself Up\", \"The Waltz In Swing Time\", \"A Fine Romance\", \"Never Gonna Dance\", and \"The Way You Look Tonight\", which is the greatest love song ever written. The scene where Astaire sings this to Rogers is not to be missed. His reaction to her touch - in this scene, as well as in the \"Fine Romance\" scene - is priceless. Watch for another not-to-be-missed moment, also in the \"Fine Romance\" scene, as Rogers uses every feminine trick in the book to try to get Astaire to respond. <br><br>Although this goes without saying, the dancing in \"Swing Time\" is superb. I hardly know words that are sufficient to describe the beauty that is the bittersweet dance number \"Never Gonna Dance\". The emotion in this scene is phenomenal. It is absolutely exquisite. If Fred &amp; Ginger had, indeed, never danced - before or after - to any other number, this alone would have made them famous. It is the most beautiful dance ever recorded in motion picture history. Every time I re-watch this film, I'm always caught off guard by the sheer beauty of this one scene. For this reason alone, \"Swing Time\" is definitely a \"must see\" film.","user":"TBear6000","rank":[58,63]},{"title":"Happy-Go-Lucky","rating":10,"date":"4 October 2002","review":"SWING TIME (RKO Radio, 1936), directed by George Stevens, marks the sixth screen teaming of Fred Astaire and Ginger Rogers, and if not their masterpiece, their best collaboration together. Aside from the predictable storyline that succeeds in presenting itself as an original screenplay, its their most lavish and stylish production, with the most memorable songs ever scored for a motion picture, compliments of Jerome Kern. Yet it's richness in sets and costumes makes one forget that this very expensive looking film was done at the height of the Great Depression.<br><br>The story begins with John \"Lucky\" Garnett (Fred Astaire), a professional dancer finishing up with his stage performance, and about to leave the theater and marry Margaret Watson (Betty Furness), his childhood sweetheart. Because his friend, \"Pop\" Cardetti (Victor Moore) feels his marriage would be a mistake, he succeeds into getting Lucky (whose biggest weakness is gambling) into a game of cards with his colleagues while others \"arrange\" to take time and have a tailor fix his pants by having cuffs put on them, while in reality his pants don't need cuffs. By the time he arrives at his wedding, the guests and preacher have long gone. Lucky persuades Margaret and her angry father (Landers Stevens), who disapproves of dancers, that if he can make $25,000 for his professional dancing, he can return to Margaret and claim her as his bride. The old man readily agrees to this idea and all is forgiven. Lucky and Pop train ride to New York City where while walking down the streets, a misunderstanding occurs between them and a young lady (Ginger Rogers) involving a lucky quarter belonging to Pop, in which a policeman (Edgar Dearing) enters the scene and sends the lady on her way. Trying to square himself, Lucky follows the girl, Penelope Carroll, to the dance studio where she works. He pretends to enroll in a class and has Penny as his teacher. Her employer, Mr. Gordon (Eric Blore), fires Penny for insulting her pupil, whom she finds annoying whom she finds annoying and incapable of learning how to dance, but Lucky squares things by demonstrating how much Penny has taught him in one easy lesson. Amazed by the accomplishment Gordon arranges for Penny and Lucky to dance professionally at the Silver Scandal Night Club. Along the way, Lucky gambles his way to success, by winning a game of cards to obtain an orchestra leader, Ricardo Romero (Georges Metaxa), who loves Penny and jealous of her dancing partner. As for Pop, he finds middle-aged companionship with Mabel Anderson (Helen Broderick), Penny's co-worker, best friend and roommate. Problems arise when Margaret returns to the scene and Ricardo insists on wanting to marry Penny.<br><br>SWING TIME's perfection mainly relies on the comic timing supplied by both its stars and character supporters, as well as the production numbers that surpass anything Astaire and Rogers have have done thus far. The score by Jerome Kern and Dorothy Fields include: \"Pick Yourself Up\" (sung by Fred Astaire and Ginger Rogers); \"The Way You Look Tonight\" (sung by Fred Astaire, later reprized by Georges Metaxa); \"The Waltz in Swing Time\" (instrumental dance by Astaire and Rogers); \"A Fine Romance\" (sung by Ginger Rogers and Fred Astaire); \"Bojangles of Harlem\" (sung by chorus/ performed by Astaire); \"Never Gonna Dance\" (sung by Astaire/ danced by Astaire and Rogers, along with \"The Way You Look Tonight\" and FINALETTE: Astaire and Rogers singing \"A Fine Romance\" and \"The Way You Look Tonight.\" (Academy Award winner as Best Song of 1936). Of the musical highlights, \"Bojangles of Harlem,\" Astaire's solo dance and his only black-face number, is an immediate classic that can be seen over and over again without any loss of interest. Reportedly a tribute to Bill \"Bojangles\" Robinson, Astaire manages to what would be offensive in today's society as both watchable and entertaining. Unlike the traditional black-face clichés, Astaire avoids the use of whiteness around the lips and presents himself in a complete tanned facial makeup, dressed in derby and spotted jacket. The scene where he dances in front of three shadows of himself on the wall has to be seen to really be appreciated. There's no doubt this was the best eight musical minutes ever recorded on film. Thank goodness due to political correctness that this number was never known to have been deleted from television prints. After seeing \"Bojangles of Harlem,\" one would wonder how Astaire could ever top this? Well, he does, with \"Never Gonna Dance,\" in he and Rogers dance on the glittering dance floor and finish it by dancing separately up a flight of two staircases. Great stuff.<br><br>SWING TIME brings back Helen Broderick, of TOP HAT (1935) fame, for the second and final time supporting Astaire and Rogers, once more delivering wisecracks in her deadpan manner, and her first of several opposite Victor Moore. As with each passing movie, Ginger Rogers has groomed, into an attractive young lady. By this time, her vocalization has matured, no longer the high-pitch girlish singer she once was in FLYING DOWN TO RIO (1933). Eric Blore, a regular in five Astaire and Rogers musicals, has less to do here than in his other collaboration with them. This time he sports a mustache, isn't playing either a waiter or butler.<br><br>SWING TIME, available on video cassette and DVD, and formerly presented on American Movie Classics, is shown regularly on Turner Classic Movies. To watch SWING TIME for the 50th time is like watching it for the first. Highly recommended, particularly during the late hours or during a cold, snowy afternoon, considering how snow does cover a lot of ground during the second half of the story. (****)","user":"lugonian","rank":[39,44]}]