[{"title":"Very interesting early Bergman movie","rating":8,"date":"7 October 2005","review":"True, the movie has got a few flaws, mostly in the construction; the structure lacks necessity and the flashbacks appear a bit randomly, it seems. However, the essential Bergman is already present (it's 1949): a few absolutely superb close-ups on the main characters' faces, the way people suddenly appear on camera, from unexpected angles, etc. And Bergman is already displaying some of the themes he will use constantly : the train travel, war and ruins as a background for difficult relationships, plus of course the impossibility and at the same time the inevitability of the relationship between man and woman : it's doomed, but there's no other way... In fact, the French title is \"La fontaine d'Aréthuse\", which points to this very idea. Precisely, I'd like to discuss another point : the original title is \"Thirst\". And in fact, people in the movie drink a lot : wine, beer, milk, or fail to drink : in a dramatic moment, one character refuses to drink coffee, tea is prepared, but doesn't taste good. I believe people never drink water, but water (the sea) is the backdrop for the happiest moment of the movie and the most desperate (with the suggestion of a suicide). For Bergman, I believe, Man is essentially thirsty, is desperately thirsty for something to calm and comfort him. But the world is hostile, relationships can offer only brief moments of satisfaction on a backdrop of tension and pain. Other comments on this title ? Very interesting movie overall.","user":"gelasma","rank":[24,26]},{"title":"Interesting, but not the best","rating":6,"date":"7 January 2003","review":"Interesting film, but this is clearly not the very best of the great Bergman.  Several relationships are examined under the microscope (so far, so Bergman).  The film jumps around between the relationships in a slightly distracting way, but eventually you get to the bottom of who used to be with whom etc.<br><br>Gosh it's bleak out there, Bergman seems to share Strindberg's views on marriage and relationships at this time - the references to Strindberg stress that point.  There's adultery, bitter rows between partners, lesbianism (inexplicit) and suicide.  It ought to have me at the edge of my seat, but somehow doesn't quite do the business for me in the way that most Bergman films do.  Perhaps this one hasn't aged well.<br><br>Worth seeing for the dedicated Bergman fan - it's pretty short and has its moments.  If you are looking for an initial view of Bergman, look elsewhere.","user":"ian_harris","rank":[19,23]},{"title":"Bergman perfects his direction of photography and actors","rating":9,"date":"5 August 2007","review":"I thought I had seen every Bergman film ever made, so I was thrilled to stumble onto this one the week after he died. I had no trouble following the intertwining stories because I kept track of the characters' names and their relationships. So what confused many viewers seemed totally justified, especially compared to films in our post-Altmam era where more and more we see \"stories\" where seemingly unconnected people's lives crisscross and are junxtaposed (\"Magnolia,\" and \"Babel\" to name a few).<br><br>The filming is fantastic for the time and prefigures the use of close ups in \"Through a Glass Darkly.\" Very different from \"Port of Call\" just before and \"To Joy\" just afterwards. I found the film less bleak than \"Prison,\" its lyrical moments prefiguring \"Summer Interlude,\" one of my favorite early Bergmans.<br><br>The lesbianism was blatant enough for me, much more obvious than in \"Young Man With A Horn,\" made around the same time in the US. Curiously, this section of the film helped illuminate Bergman's use of the theme in \"The Silence,\" and this makes me want to view that film again. The fact that this is a film Bergman didn't write is intriguing, because he harmonizes his visual language to the rhythms of the screenwriter's oral one. The dialog was rather light for the seriousness of the situations. Perhaps Bergman himself would have been heavier-handed.<br><br>Lastly, there are the actresses, and here Bergman's direction of actors seems to solidify, as I find his previous films much more uneven on this score. Here the women, especially the young dancer, show real depth.<br><br>Keep in mind that this is not his first film, but still an early work, a seed that will grow into later masterpieces. Then you won't be disappointed, even after the mediocre last minutes of a work that definitely showed promise.","user":"wickest","rank":[11,13]}]