[{"title":"it's movies like this that got me through high school","rating":8,"date":"14 February 2003","review":"This movie is vastly imaginative. So imaginative in fact that it took 7 directors to make it! The sets costumes and monsters all work well together to paint a fabulous picture of a computer warrior overcoming adversity through 7 different evil worlds. One of which is an evil heavy metal concert featuring the band W.A.S.P.This movie is filled with marvelous special effects including dueling magical dragons, a stone giant, disgusting undead warriors and a score of fantastic weapons originating from the computer wristband worn by the hero. A very action packed epic by a team of excellent directors including the legendery Charles Band!","user":"goriddle","rank":[27,29]},{"title":"B-movie fans are missing out if they haven't unearthed this gem.","rating":9,"date":"30 January 2008","review":"I'm quite surprised to see so many people writing negative things about this film. I don't know what they were expecting from a film called The Dungeonmaster released by Empire (this isn't supposed to be Citizen Kane, people), but for those who enjoyed the minute in the 80's where Sword &amp; Sorcery films were being dropped into theaters every weekend (and disappearing the same weekend), this splendid little number provides a nice twist on the formula.<br><br>Watching it today, it does seem a bit clunky and dated, but the special effects remain quite impressive considering the technology and budget the filmmakers had to work with. There is a lot of imagination at play here, and it's delightful to watch each of the segments unfold. John Buechler's undead make-up in the \"Demons Of The Dead\" segment is particularly excellent, and his lord of that underworld is a great piece of puppetry. People who watch a film like this and criticize the execution of such a prop are obviously forgetting that even Yoda looked like what he a was, a rubber puppet, until George Lucas spent millions of dollars digitally enhancing his effects.<br><br>Though most of the segments fall squarely into the realm of Fantasy, the \"Slasher\" and \"Ice\" pieces are great nods to classic horror sub-genres. The brevity of each segment keeps the film moving along at a brisk pace, and no matter how engrossed you become in one piece of the film, you're assured that there's going to be something interesting around the corner as well.<br><br>Enough can not be said about the greatness of Richard Moll's performance as Mestema. Moll is a joy to watch, and he seems to take great delight in chewing up the scenery and delivering the surprisingly strong dialogue he is fed. His \"cat\" speech is a classic, and I can't imagine a better character or actor to deliver such a great piece of wickedness. Sparring against him, our Paul Bradford makes a fine hero, and the verbal interplay between the two of them is well written and executed.<br><br>One thing I haven't heard mentioned extensively is the music in the film, which is uniformly great. It's unlikely that a soundtrack ever circulated, but upon re-watching this, I found myself plotting my own transfer of the audio to CD. Of course, a strong number by W.A.S.P. (\"Tormentor\", which appears on their self-titled debut LP) helps in that regard. But, even without it, the score alone would make for excellent listening should anyone ever have the foresight to rescue this film and its supplements from obscurity.<br><br>It seems so petty to overtly criticize a film that never tries to be anything more than an enjoyable way to spend 80 minutes. To that end, The Dungeonmaster succeeds magnificently. The 80's was a time when films like this flourished, and comparatively, this is far more professionally made and creatively executed than the overwhelmingly poor caliber of direct-to-video fare we are subjected to these days.<br><br>DVDs are cheap to produce and release, and because of this, there are a lot of truly unwatchable films in circulation that deserve to languish in the scarce VHS-only netherworld The Dungeonmaster currently occupies. In fact, if I could pick one film to be plucked from the past and given a loving DVD remaster, it would probably be this one, and its digital absence is one of the only reasons I still have a VCR.<br><br>Anyone familiar and comfortable with this sort of material will have a hell of a lot of fun watching this film. After all, that's ultimately the point of The Dungeonmaster, so it shouldn't be graded or scrutinized with the same stringent detail we apply to \"serious\" or \"important\" cinema. Those looking for thought-provoking social discourse, breathtaking cinematography, or Oscar-caliber performances will hate this film, and that's okay, because they aren't the demographic for The Dungeonmaster.<br><br>However, for anyone who enjoys the giddy pleasure of a well-constructed B-movie, The Dungeonmaster is well worth seeking out. If that's you, then prepare for battle, Excalibrate. Mestema awaits you.","user":"happyendingrocks","rank":[45,51]},{"title":"Ragewar: Evil Wizard vs Technics Nerd","rating":7,"date":"10 January 2009","review":"Aahh... One from back in the days when Charles Band still made *cough* great *cough* movies... I saw this one countless times as a kid, and believe it or not, it was just too much fun re-watching it last week. I admit, it's not a very good movie. In fact, you can hardly call it a real movie. It's more like a collection of shorts, much like an anthology movie. But the main characters remain the same throughout all segments and there is an on-going story present.<br><br>If you like your 80's cheese fantastically melted, then you're going to have more than a mouthful with THE DUNGEONMASTER. Jeff Byron plays computer-geek Paul (with a computer called \"Cal\" installed in his... glasses, no less) with a beautiful girlfriend. Absolutely for no reason at all, he and the girl suddenly get zapped to another dimension where Mestema reigns. Mestema (Richard Moll with evil make-up, very appropriately acting the part), is some devil-demon-dude who is just bored out of his wits, and decides to have some fun by subjecting Paul to seven challenges. This is where the fun begins!<br><br>THE DUNGEONMASTER simply is an excuse to display as much 80's special effects wizardry and cram as much horror/sci-fi/fantasy you can in one movie. All segments are utterly pointless. The whole movie is, for that matter - I think the point is: If Paul loses one of the challenges, Mestema gets the girl. Or something. But what matters is: THE DUNGEONMASTER is just too much fun. Especially if you still carry the child within, as they say, and allow yourself to be amazed and entertained by this old school SFX extravaganza.<br><br>We've got a claymation giant made out of stone. Trolls. Zombies. A little devil puppet-dude. A werewolf. Blackie Lawless and his band W.A.S.P. performing. A serial killer. Post-Apocalyptic mutant-bikers. Animated dragons. And much, much more... I ask you: How can you not have fun with this film? Also, go take a look at the full crew involved in the making of this film. We are talking the pre-Full Moon dream team here: Charles Band, Richard Band, David Allen, John Carl Buecher, Patrick Manoogian, Ted Nicolaou,...<br><br>I admit, when people should give this a first time watch in this day and age, they'll probably call it a bad movie. But if you grew up on silly nonsense like this, there really is no substitute.<br><br>So yeah, I should call this a guilty pleasure, but I honestly love this flick. So don't hold my rating against me.","user":"Vomitron_G","rank":[27,30]}]