[{"title":"Burt Lancaster & Jean Peters as blue-eyed Apaches","rating":6,"date":"31 July 2003","review":"If you can suspend disbelief that Burt Lancaster and Jean Peters are Apaches, then this isn't a bad western.  If you can't, well then there's gonna be a lot of low ratings posted here.<br><br>In 1886, Geronimo and his braves surrender to the U.S. Calvary in New Mexico and are shipped off to Ft. Marion, Florida.  All except one, an Apache named Massai (Burt Lancaster) who begins a one man war against the whites.<br><br>Massai escapes from the train that is shipping the Apaches back east and makes his way back to New Mexico.  From there, he attacks wagons, soldiers, bridges etc., making life hard for the authorities.  He kidnaps Nalinle (Jean Peters) and takes her up to the hills with him while Indian scouts John McIntire and Charles Bronson hunt them down.<br><br>Massai finds an isolated spot in the high country and starts to plant a small corn field from seed he got from a Cherokee farmer (Morris Ankrum). He also gets Peters pregnant with child.<br><br>The ending scene in Massai's little cornfield is pure Hollywood.  The action scenes are tight as we see Lancaster jumping from rock to rock as he picks off at least 10 of the Indian scouts that have him surrounded.  But then as Massai is wounded and runs into McIntire in the cornfield, disbelief occurs and the conclusion seems tacked on in order to make a happy ending out of it.  You'll have to see it for yourself. <br><br>Still, it's entertaining enough as it is.  It's based on a true incident and Lancaster at least brings some dignity to his role as the noble warrior turned farmer who wants to be left in peace.  It could've turned out a lot worse.  <br><br>I give it a 6 out of 10 for his performance alone.","user":"westerner357","rank":[24,29]},{"title":"`I fight alone'","rating":7,"date":"19 May 2003","review":"Apache was the third feature Robert Aldrich directed. Before he worked as an assistant director to Jean Renoir, William Wellman, Lewis Milestone and even Charlie Chaplin and also made several episodes for TV films. He was invited to direct Apache by its co-producer and main star Burt Lancaster. <br><br>\n   The Apache's particularity is that it doesn't enter the classic Western scheme of almost obligatory showing of the Indians as bad guys, thou the most illustrious example of this probably belong to John Ford's 1964 Cheyenne Autumn with which the legendary director bid a farewell to the genre. Also Apache's distinctiveness resides in the treatment that is given to the central theme of the Western genre, which is revenge.<br><br>\n   Here the Indian rebellious warrior Massai, wonderfully played by Burt Lancaster is obsessively seeking revenge facing the enemy not only in a form of one person or a small group of people in accordance with traditional Western vengeance system, but in a form an entire society either Indian or White, a society that he considers his enemy and against which he courageously fights alone not looking for help from anyone till he meets an equally strong character Nalinle (Jean Peters), a woman who simply accepts him as he is ready to share all the difficulties of Massai's life and even to sacrifice her own life for the man she loves. From this point on as his affection for Nalinle increases, his desire to fight everything and everyone proportionally decreases resulting in his settling down looking for more peaceful existence, which is hardly possible due to the burden of his past deeds which weighs over him personified in a collective figure of the American authorities who unceasingly continue to hunt him down.<br><br>\n   A weak, but also in many ways remarkable Western featuring convincing performances from Burt Lancaster and Jean Peters in a tale of self-sacrificing love and courageous but ultimately pointless fight for imaginary cause. 7/10","user":"IlyaMauter","rank":[18,21]},{"title":"An exciting Western with colorful action and a surprising ending...","rating":8,"date":"4 August 1999","review":"It was only in his third film, \"Apache,\" that Aldrich's assured grasp of genre and liberal sensibilities came to the fore in a sympathetic but never maudlin portrait of an Indian alienated from both white America and his own kind...<br><br>Based upon the Novel \"Bronco Apache\" by Paul I. Wellman, the film relates the story of the last Apache warrior Massai following Geronimo's surrender...<br><br>Declined to live on Government reservations, a real-brave Massai became a legend for waging a one-man war against the encroaching U.S. Army in the 1880s... <br><br>Lancaster stars as the menacing, stormy, inflamed warrior whose spirit is as high as the white snowy peak of his mountain... Massai came back from far away weary from a journey that no warrior had ever made before... He seems like a dying wolf biting at its own wounds... For him there is no place in his life for love... Love is for men who can walk without looking behind... For men who can live summer and winter in the same place... Every man, every Indian is his enemy...<br><br>Jean Peters looked radiant as the blue-eyes Nalinle who really knows there had never been a chief like Massai... <br><br>John McIntire combed the whole country searching for Massai... For him it takes two to call off a war... Massai must be in those mountains somewhere...<br><br>For Bronson, \"Apache\" marked the first of his numerous excursions into Indian territory... <br><br>Aldrich tried to offer an inspiring message, and his film was exciting filled with colorful action scenes, and a surprising ending...","user":"Nazi_Fighter_David","rank":[24,31]}]