[{"title":"One of the best films of Hill & Spencer","rating":10,"date":"14 November 2004","review":"In the concept of Hill&amp;Spencer films, \"Y si no, nos enfadamos\" (Spanish title) is one of the funniest. Plot is designed specially for this actors, and they use all the tricks for they are best known. Unforgettable, the scene of the chorus (a.k.a. \"pom pom pom / la la la)and the last battle in the balloons room. One interesting detail about this film is that it was filmed in Spain (more exactly in Madrid) and you can see many spanish support artist like Luis Barbero (well known in last years due to his character \"Matías\" in \"Médico de Familia\") or humorist Emilio Laguna (chorus director.) So you must watch this film... o si no, nos enfadamos ;)","user":"lcapote","rank":[34,36]},{"title":"Superb!","rating":9,"date":"9 July 2000","review":"If you want to see a very funny and addictive action movie, you must watch this one... Here we have two rival wreck car racing pilots(Bud Spencer and Terence Hill), both very skilled, so skilled that after a tremendous race they finishes simultaneously... and together they wins a dune buggy, the prize for the winner. Naturally, each of them wants the buggy for himself, so the tough guys decides to bet the car in a \"beer and beans\" contest(!). But just when the \"contest\" starts, the bad ones, led by a megalomaniac rich man and his psychologist, destroy the dune buggy...... You can imagine the reaction of Spencer and Hill... <br><br>A remarkable scene: the one of the killer (\"Paganini\") in the auditorium.(A masterpiece!)","user":"emilian77","rank":[32,34]},{"title":"Missed it by THAT Much","rating":6,"date":"6 July 2000","review":"Way way back in 1978, this film ran on our cable about two weeks before we got our first VCR.  I've been looking for a copy ever since.<br><br>It may be the single best of the Hill/Spencer collaborations; wonderfully silly and harmlessly violent.  Hill/Spencer films have always reminded me of the better Warner Bros. cartoon shorts -- as if the Wolf and the Sheep Dog interrupted their long-running battle of wits and teamed up to save the peaceful sheepherders from the evil cattlemen.<br><br>If you like slapstick humour that falls somewhere between Hope &amp; Crosby, Laurel &amp; Hardy and the Three Stooges, but more physical than any of those, this is a film you should see.","user":"krasnegar","rank":[38,41]}]