[{"title":"Fantastic movie","rating":10,"date":"27 January 2007","review":"I'm with amyjo79 with this movie, as I saw it on TV years ago and videotaped it, then just bought the DVD when I finally found it had been released.<br><br>Yes, it has its corny parts and some bad language in it, but as was already said, Kenny Rogers' character chides the kids for swearing and they stop doing it for the most part. Yes it is predictable to a certain degree as well, but since the DVD arrived here, my three boys aged between 4 - 9yrs have not stopped watching it! They love the fast cars, the music and the plot in general, and I won't stop them watching it. My boys understand that they are not allowed to swear and that it's only a movie and not real.<br><br>I have always liked Kenny Rogers' music and always will, and if you like his music too, I'm sure you will like the move as well.","user":"hazardus_99","rank":[11,11]},{"title":"Great Movie!","rating":11,"date":"11 May 2004","review":"This is one of my favorite movies.  I can't believe how sensitive some people can be. Yes, \"Swifty\" has a foul mouth...but Kenny Rogers' character does reprimand him. There are some 'fight' scenes (which i would not describe as 'bloody')...turn the news on, you'll actually see body bags. And yes, Diane Lane does seduce a dirty old man...but she realizes the dangerous situation she put herself in...and i would add at 16/17 her character is much more mature as she has been raising her 5 younger brothers since the death of their parents.<br><br>This is a great movie. I watched it plenty of times as a child and if anything it has caused me to like the soundtrack (country songs performed by Kenny Rogers) not cursing up a storm, blood battling, whorish tendencies the previous reviewer would like you to think.<br><br>THIS IS A MOVIE...hence, Entertainment value.  You want to watch race footage, put on Nascar.<br><br>No matter how many times I've watched this movie, I have yet to tire of it.","user":"amyjo79","rank":[24,28]},{"title":"Suitable for kids","rating":9,"date":"6 February 2007","review":"I vaguely remember watching this movie as a child... at least younger than 10 and I remember loving this movie. Much is said about the sexual overtones blah blah blah, but I can tell you, as a child watching this movie, and the reasons I liked watching it, I remember the green van, the river, the winning, the forgiving.... but not once do I (remembering as a child, cause I haven't seen it since I was a child, although I want too) attribute child sexuality towards it.... Kenny Rogers helping the kids... .that's all I remember... so for all of you bible basher's who condemn films for sexual overtones... kids don't care... they see differently to what you do.... just ask them!!!","user":"sheepy0126","rank":[11,12]}]