[{"title":"I could break your bones!","rating":8,"date":"11 June 2006","review":"In the film Jack Palance tells a woman during an embrace, \"I could break your bones.\" And he means it romantically! That probably sums up the odd, entertaining, and off-beat nature of this movie. There is so much \"eye-action\" from Joan in this one that it's almost funny. Actually it is funny. Though Sudden Fear is not a comedy, it has moments that are truly hysterical in a \"did they really just say that?\" kind of way. Watch for the moments when Joan responds to overheard conversations, personal scheming, (or the voices in her head)with nothing but wide-eyed reaction shots. Joan is also a tremendously sympathetic character more so than in almost any other Crawford film I've ever seen (and I've seen almost all of them). I caught this film on TV one night and was utterly surprised at how entertaining it was. Not that I had low expectations but Sudden Fear wasn't a film I'd ever heard of. It was proof that there are lots of dark diamonds hidden out there. We all know about the \"top 100\" lists and the legendary films on them but there are gems worth watching that never got the attention they should have. I watched from beginning to end not knowing what to expect. Truly thrilling in places and just plain classic Crawford. Watch for the moment when Joan embraces her love interest Palance and asks, \"I was just wondering what I'd done to deserve you.\"","user":"wayjack","rank":[48,50]},{"title":"Whewwww!","rating":10,"date":"20 August 2008","review":"This is a real edge-of-your-seat nail-biter. David Miller did a terrific job of directing this one, and the cinematography is spectacular by Charles Lang. Some of the shots are as inspired as anything ever seen in Hollywood, such as one in Joan Crawford's library where upon hearing an inadvertent recording made on her dictaphone, she gradually shrinks back in horror against the far wall, until she becomes nearly a dot in the distance. That shot is a real triumph of cinematic inspiration. Much is accomplished with a clock and its pendulum, with the star-shaped pendulum at one point shown in shadow swinging across her chest as she gets more and more anxious. None of this is overdone, but is all subtle and effective. Joan Crawford has us all spellbound with her magnificent performance. She throws vanity to the winds, and is not afraid to show her character as someone in the round, complete with cowardice, foolishness, and even extreme stupidity, combined with cunning, intelligence, charm and inspiration. Rarely has a woman been shown so soaked in sweat with sheer terror, and she must have stepped straight out of the shower for each of those shots. When we aren't staring at her incredulous, we notice that Jack Palance is highly effective, and then we have the delectable treat of Gloria Grahame turning up. Which true cineaste does not adore Gloria Grahame? She herself probably never knew what all the fuss was about, regarding herself no doubt as an ordinary girl. But Gloria Grahame was far from ordinary. She had that indefinable something plus a lot of other somethings, which for reasons which are deeply mysterious and impossible to explain leave many people like myself in a state of entranced wonder. What was it about her? No matter how many times we watch her we will never know, all we can say is there will never be another one. This film is a real humdinger.","user":"robert-temple-1","rank":[63,70]},{"title":"Best Noir?--Last Third a Silent Film Making Great Use of Sound.","rating":10,"date":"5 November 2009","review":"Many other posts here comment usefully on the acting in this under-appreciated but amazing film--one of the very best films noir. Little has been written about it and it's the kind of film one used to learn about through word of mouth and coincidence though sites like this make that easier now. <br><br>But what really turns my crank about this film is its brilliant combination of cinematography and sound. In many ways this is a silent film and Crawford, coming of age during the silent era, reprises her silent self masterfully during the final third of the film. Silent films were never fully 'silent'--they were accompanied by music. In this film, the musical score complements the visual action but sound effects increasingly become front and center as the film progresses, completely overtaking dialog toward the end. The sound of the wind-up dog as it walks across the carpet, a walk shot so tightly that we see the weave of the rug the dog walks on and the thread in the rug that catches its paw just in time. The sound of the Dictaphone machine (a new technology at the time) and the way the recording of Irene Neves' (Gloria Grahame's) disembodied, mechanical voice repeats \"I know a place\" over and over (several minutes actually) are crucial to the suspense of this film. The final third of the film is virtually dialog-free--instead, through an inspired use of flash forwards we enter a truly cinematic space of the fantastic, the paranoid and, finally, the sublime. Joan walks alone into the morning light. The silent section of the film, the ticking clock and its Poe-like pendulum telegraph her moral ambiguity. See this film--it's a unique, an early 1950s reprise on the silent cinema and how to communicate to an audience through visuals and sound effects. It's widely available on DVD and the transfer is excellent.","user":"edgeplayer","rank":[24,25]}]