[{"title":"Rock halfway around the clock","rating":7,"date":"25 April 2007","review":"This (now) quaint film is a cornucopia of Brit jukebox talent of the mid 50s all in a cavalcade of song hits... some dimly recalled and most long forgotten. This film is an expanded version of the TV show of the same name... each country had a similar TV show: in Australia we had Saturday DATE and in the US there was BANDSTAND and SHINDIG. It is the sort of TV show that John Waters spoofed in his hilarious 1988 movie with Ricki Lake called HAIRSPRAY. This UK pic is about a sweet nervous operatic hopeful who gets on the 6.5 special a train full of pop talent who head off to the TV studio for a weekly show. It is a good idea and a believable frame to hang what seems like 100 songs and an equal number of singers and dancers who all get a gig in this 85 minute movie. It is non stop songs and performances and as a time capsule movie of 1957 it is now a real talent museum piece. Every known style and look is on screen and it is a good party tape to play at home... even if you are alone or are having 50s party night just for fun. It is so conservative, all cardigans and sensible clothes.. with the occasional Pommy rockabilly twist... followed by a big band / orchestra or dixieland showcase. The wild concert pic THE TAMI SHOW of the mid 60s from Los Angeles Auditorium is a great 1965 chaser. 6.5 SPECIAL is a great fun. The opening scene is our shy singing gal in the bathtub, chatting to her galpal with the bathroom door open... right thru she also sings up until she hops out all sudsy, dries and puts on her pyjamas!. After the train scenes, the film shifts to the studio where a roster of truly dynamite talent takes over: One of the songs is from a 15 year old Scottish boy called Jackie Dnnis wearing the biggest pair of truly terrifying plaid trousers. He sings like Frankie Lymon, belting out a number with lyrics like \"la de da oh boy cha-cha-charrrrrrr\"... where is he today? also in 6.5 SPECIAL are: John Dankworth and Cleo Laine, the King Bros, Jim Dale, Petulia Clark, and Lonnie Donnegan who is clearly a forerunner to The Beatles in style. One fab cocktail dance number is by Paddy Madison and Lee Stone is a super dance act very much in the style of Marge and Gower Champion. Also if you are a fan of acoustic guitar this great film is also a feast of that sound. Enjoy!","user":"ptb-8","rank":[12,12]},{"title":"I recall the artists but not the programme","rating":6,"date":"26 April 2016","review":"This is a really interesting time piece,since it reflects the changing tastes in music that took place during the 1950s.Early in the fifties,crooners such as Bing Crosby and Frank Sinatra still held sway.One of our British crooners,and one of my personal favourites of the time,Dickie Valentine,is shown in full voice here.Then there was a slight change evidenced by such as Lonnie Donnegan.I still have his 45 disc of \"My old mans a dustman.However the era of rock and roll was fast approaching with Rock Around The Clock and of course Elvis Presley.So the cosy world shown here was soon to be swept away.I also remember Pete Murray very well as he used to sit in the same area as me at The Arsenal.This film is for enthusiasts of the era primarily.","user":"malcolmgsw","rank":[6,6]},{"title":"Not So Special","rating":6,"date":"10 November 2018","review":"Saw this on Talking Pictures TV today. Basically the film was an attempt to cash-in on the popularity of what was the first pop music programme on British television. It has the flimsiest of plots i.e. a hopeful young singer is persuaded by her pal to try for an audition. By an amazing coincidence their train is full of popular music performers of the time who are happy to perform their latest song and give advice. To be honest most of the songs are rubbish. Pet Clarke's \"Baby Lover\" (yes really) stands out as particularly excruciating. Benny Hill did an exaggerated send up of it in his tv show, which was what it deserved! Also, the hopeful Diana Todd has a soprano singing style set around 1950 , so she's not even contemporary. Critics have commented that most of the rock and roll performers who appeared on the tv show were in fact jazz musicians, and the tradition is certainly continued here with the likes of Johnny Dankworth, Cleo Laine, Des Lane, The Ken-Tones and Don Lang. Dickie Valentine and Russ Hamilton give the film a bit more of an appeal to young folk, but the best performance comes from Lonnie Donegan with \"Grand Coolie Dam\" and \"Jack O'Diamonds.\" It was as the credits rolled that I realised I'd never actually liked The Six-Five Special. I'd confused it with its infinitely superior ITV rival Oh Boy!","user":"coolantic","rank":[5,5]}]