[{"title":"Consider the time frame","rating":7,"date":"23 September 2005","review":"This film is loosely based on the novel of the same name by Burdick and Lederer, but departs from the novel in some significant particulars that I won't get into here. I think it is important to view this film as a period piece. Released in 1963 before the assassination of JFK and the escalation of the war in Viet Nam, the story retains a certain degree of naiveté about the role of the United States in the world and the perceptions of the United States that existed in other countries. This film would have looked quite different had it been shot in 1968 or 1969, by which time the country had long since shed any illusions about the nation's role in the world. In some ways, this provides a kind of still photo of the United States just prior to the Kennedy assassination and the tumultuous sequence of events that unfolded afterward. For that reason, this is a fascinating period piece that survives Brando's chewing on the scenery and a screen play that departs in unfortunate ways from the outstanding novel.","user":"wrcong","rank":[34,37]},{"title":"Winning Hearts and Minds","rating":8,"date":"7 May 2008","review":"It's 1963 and the United States is getting drawn into the internal affairs of a Southeast Asian country named Sarkan. It's got a Communist north and a western leaning south. It has a king ruling with a prime minister with the habit of employing a lot of his relatives in positions of authority.<br><br>What makes it a bit different from Vietnam where we were getting drawn in bit by bit is that Sarkan also has a charismatic leader who retired DeGaulle like after Sarkan won its independence from Japanese occupation. He's the key to solving the country's problems for better or worse.<br><br>Because of a past relationship with Eiji Okada who plays the Sarkanese DeGaulle, Marlon Brando has been appointed ambassador to Sarkan. Back during World War II Brando and Okada worked well together doing damage to the Japanese occupiers.<br><br>Problem now is that the Sarkanese see the Americans as occupiers and the Communists are exploiting the situation to the fullest. A road called Freedom Road that the USA is constructing has become a flash-point of resentment.<br><br>It all ends as badly here as it did for America in Vietnam though I certainly won't go into details. Brando delineates a very good interpretation of a Cold Warrior diplomat. We and the Russians fought for global primacy with competing ideologies for over 40 years. Neither superpower was particularly cognizant of the wishes of the countries that blood was spilled over.<br><br>Eiji Okada was a major star in Japanese cinema and this was his only English language film. He's an impassioned Sarkanese patriot who's exploited by some evil forces and only realizes it too late.<br><br>Smartest guy in the room and in the film is Pat Hingle who is the boss constructing the road. His wife played by Jocelyn Brando runs a hospital for the natives and is beloved. He offers the only real solution to winning the hearts and minds of the Sarkanese. Build a hospital somewhere where you want your bloody road to run and the Sarkanese will fall all over themselves building a road themselves to it. Too bad no one listens.<br><br>Brando and Okada make a fine pair of former friends and now dueling adversaries. Hopefully one day we might get an administration who is more concerned with winning hearts and minds all over the world. We might even realize some cheap oil in the bargain.<br><br>The Ugly American is still a fine film with some lessons for today's diplomats and military men.","user":"bkoganbing","rank":[17,18]},{"title":"As Riveting As Ever.","rating":7,"date":"26 August 2013","review":"I remember first seeing \"The Ugly American\" upon its initial release in 1963, and I equally remember immediately linking it with what was happening in Viet Nam. I found it absorbing and timely then just as I do today. <br><br>As the American ambassador with a total white hat/black hat mentality, Marlon Brando in my opinion gives one of his best performances. There's the shouting and the strutting, but there are also some very, eerily quiet, contrasting moments when he simply lets the frustration of his character all hang out. <br><br>As his former best friend and now rebel leader of the fictional Sarkan to which Brando's Ambassador White has been posted, Ejii Okada is every bit Brando's equal. Their sharp exchanges are riveting, as is so much of the dialogue in this film, dialogue-heavy moments that I do not personally find boring because what they are discussing strikes me as being as important today as in 1963 when this film was first released.<br><br>I do recognize that some reviewers were terribly disappointed (maybe even offended) that the film was not a recapitulation of an apparently well written, highly complex novel which I haven't read yet but intend to if I can find a copy. However, no matter how great the book, shouldn't a film be judged as a film because it is not a book? For one thing, movies don't have the luxury of an endless running time, a constraint not put upon the number of pages needed to tell a print story. Also, is not the punctuation, grammar and syntax of image quite different than that of print? <br><br>Finally, as others have said, it is too bad (a) \"The Ugly American\" has been mostly forgotten (if it has ever been heard of) and (b) the powerful message that ends this picture is still as relevant today as it was in 1963. Indeed, if anything it is even more (very sadly) spot-on than it was then.","user":"GordJackson","rank":[9,9]}]