[{"title":"A pleasant surprise for those who have heard it sucks","rating":7,"date":"27 November 2002","review":"Terry Gilliam's fantasy satire (looks like a spoof, but it's a satire) is halfway between \"Holy Grail\" and \"Time Bandits\", and about half as good (which ain't bad).  The wit is sardonic, and the story pretty well reverses every rule of the fantasy genre -- a dimwitted \"champion\", out to secure the hand of his 300+ lb. \"princess\" by killing the evil Jabberwocky that is making life tough for the local peasantry (but very pleasant for the merchants).  <br><br>Great photography, decent production values.  The direction is very good, and although the script's wit is shining, there are not enough really funny jokes (mostly it's stuff you'd have to think about to laugh at).  I particularly like, though, how a lot of the good jokes come out of how the value of something is relative -- Palin carrying around a rotten potato discarded by \"Griselda\", which he prizes for sentiment, but which the townspeople want for food.  <br><br>Superior medieval satire shows Gilliam was on the right track towards his masterpieces.","user":"funkyfry","rank":[39,42]},{"title":"Not one of the great solo-directing debuts of all time, but as a self-consciously stupid (dark) fantasy-comedy, it's mostly inspired","rating":7,"date":"22 January 2005","review":"Terry Gilliam, in 1976, did something similar to a member of a rock band going off (while the 'band' not having yet broken up but on hiatus) and recording a solo album with his film adaptation of Lewis Carroll's poem Jabberwocky. However, like a solo effort, one expecting a full-on presentation of how the actual band plays together, might be disappointed. As it is with Jabberwocky, as Gilliam has said of it on the commentary on the DVD, \"(Jabberwocky) was a transitional film, from Holy Grail to the other projects.\" This comes with pros and cons for certain viewers, some with more cons than pros.<br><br>The story is expanded upon from the original, surreal battle hymn of sorts from Carroll. The naturally funny Michael Palin stars (in only one role, following the narrative structure instead of the episodes of Python) as a son of a barrel-maker, who has to live on his own, wandering around for food. Meanwhile, a monster of demented, horrible proportions terrifies and slays the citizens, and the King (running his minions in a shamble), gets a tournament to decide who will kill the beast and marry the Princess. These two stories go side by side until the inevitable climax, when the silliness builds up to something very, very bizarre, but fun.<br><br>The thing about Jabberwocky is that there are so many jokes going on, visual puns, basic physical gags, trademark 'British' innuendo and irony, and the awesome, brash, curious style of Terry Gilliam (director, co-writer, and bit-player). Sometimes the biggest laughs come from unexpected places, sometimes not. And, unfortunately, a good number of jokes either fall flat or are not exactly laugh-out-loud funny. But one thing that is pulled-off well is a sort of cartoon-like approach to the film as a whole; one could imagine this same material, more or less, being translated to the kind of animation that came in The Hobbit. For its low budget, Gilliam and his cinematographer (who also implied a similar visual look on Holy Grail) make this world seem extremely real, and go for being appropriately stylish with many of the moves. In fact, it's a very serious-looking film, and that it's a comedy is almost an after-thought.<br><br>Jabberwocky at times is a mess, some of the story gets un-even in parts, and if you have any real taste in films it holds a facet akin to Monty Python in that it doesn't hold any real value intellectually. But it is also a medieval-fantasy-comedy, and it's also a display of a director testing the waters on his own. However, on some sort of gut level one was really struck by how the film moves, how it goes through its gags to the next best one even when a dud comes by or when Dennis is completely aloof. Even the monster is an inspired feat. And like Gilliam's other films, one may find more comic worth on a repeat viewing. B+","user":"Quinoa1984","rank":[22,25]},{"title":"Comparisons to Holy Grail are inevitable, making Jabberwocky pale","rating":7,"date":"1 May 2005","review":"I've seen Jabberwocky a few times now over the years and I still can't say that I know where director/co-writer Terry Gilliam intended to go with the film. Without a doubt it's interesting. It has a good premise and varied interpretations can make the film intriguing as different kinds of satire. Unfortunately, it's not consistently entertaining or rewarding to watch, it has some technical, directing and editing problems, and it easily invites unfavorable comparisons to Monty Python. In the end, I had to give Jabberwocky a \"C\", or a 7 this time around, although I found myself continually wishing that I could give it a higher score.<br><br>Jabberwocky is really the story of Dennis Cooper (Michael Palin), a lovable dolt who is in love with Griselda Fishfinger (Annette Badland), the obese daughter of a local fisherman. It is set in the Middle Ages in England, probably around the 13th or 14th Century (partially based on a character identifying plaster as possibly being from the 12th Century). After Dennis' father dies, Dennis decides to head off to the \"grand city\" to find a job and make his fortune, so he can head back to his village in a state worthy to marry Griselda. However, things aren't going so swell in the city, either. Unknown to Dennis' village, there is a monster called the Jabberwock that has been terrorizing the countryside not far from the city. The city has been closed off and there's tight control over who gets in or out. People in and just outside of the city are starving; there is no work, and so on. Dennis finally sneaks into the city one morning and discovers the dire truth. The bulk of the film is a series of misadventures, focused on Dennis, as he tries to adjust to life within the city.<br><br>Because Jabberwocky's release date was only two years removed from Monty Python and the Holy Grail (1975), because it was directed by Python member Terry Gilliam, who also co-directed Holy Grail, and because it has a similar setting, some similar characters, some similar scenarios, and some almost identical costumes, it easily invites comparison to its better-known brother. That's Jabberwocky's first major hurdle for anyone who has seen Holy Grail, which is likely to be a large percentage of the audience who would seek out and/or bother watching this film. The problem is that Jabberwocky isn't anywhere near as funny as Holy Grail, and I don't think that Gilliam intended it to be.<br><br>For me, the most favorable reading of Jabberwocky has it as a fairly serious satire (so \"satire\" in the more academic sense) not of the Middle Ages, but of the popular 20th Century conceptions of what the Middle Ages (or the \"Dark Ages\") must have been like. This is further enforced by Gilliam and Terry Jones' remarks on the Holy Grail DVD commentary (and maybe better enforced on the Jabberwocky commentary, which I haven't had a chance to listen to yet) during the scene when King Arthur encounters the peasants who get into a political structure debate. There, they explicitly state that they tried to exaggerate the popular misconceptions of how such peasants would have been, and acknowledge that more academic research has shown those ideas to be false. In Jabberwocky, Gilliam has his entire population as filthy, stupid gits with deplorable personal hygiene who can barely figure out how to survive. They resort to eating rats, scams that involve hacking off their own limbs so they can beg as a cripple, and so on.<br><br>Monty Pythonesque humor of the less intellectual variety does enter occasionally, especially with the bits involving bodily functions or violating the \"sanctity\" of the body. That's not to say that Jabberwocky is not an intellectual film in any sense. But the intellect here comes with the interpretation above--in the skewering of our \"progress\"-oriented misconceptions about the past.<br><br>As promising as some of that might sound, and as promising as it might sound to make concrete Lewis Carroll's Jabberwocky poem from Alice's Adventures in Wonderland (1865), the film has a load of problems. Even though the focus is ostensibly on Dennis, he always feels like something of a bystander in the film, making any desired focus, and the viewer's attention, drift. Gilliam has problems making scenes flow smoothly. His pacing seems off. The sets and the cinematography are not very attractive. In fact, at least on the DVD release, much of the film looks extremely murky (oddly, I thought the color on the included trailer looked better). None of the auxiliary characters quite click, and it's often difficult to decipher what they're saying/talking about. Some scenes are almost repeated in the film, and other scenes, such as those involving the princess in her tower, or Gilliam's cameo as he's talking to castle guards, seem like rejected drafts of similar scenes in Holy Grail. In fact, all of this is in sharp contrast to the excellence of Holy Grail.<br><br>So despite all of the good points, including the opening, with its hilarious point-of-view of a Jabberwock attack, the fantastic extended final sequence, the more bloody scenes from the tournament, the sly jokes that work (such as accusing the innkeeper of cannibalism after Dennis disappears), and so on, I find my score gradually sinking throughout most of the film. Gilliam and Python fanatics will definitely want to check out Jabberwocky if they haven't seen it yet, but be prepared for a bit of a disappointment.","user":"BrandtSponseller","rank":[53,68]}]