[{"title":"\"The System \"--A film worth seeing !!","rating":9,"date":"28 December 2004","review":"When I saw \" The System \" for the first time I was about 14 years of age,and had never heard of Oliver Reed or David Hemmings.By today's standards it is hardly very shocking or thrilling;and yet in 1964 it was rather risqué,being about young men who were essentially trying to get young ladies into bed.It is filmed in black and white,and has a young and very handsome Oliver Reed seducing young ladies,but eventually falling in love.It also has a young David Hemmings,who later goes on to make some of the more memorable films of the 60's.It has many quality performances from British character actors, such as Juliette Foster and John Alderton.It also is directed by the very underrated Michael winner,and is worth viewing for its cinematographic interest,but also for its particular take on the 1960's.","user":"terryberrow","rank":[21,22]},{"title":"Neglected British classic","rating":7,"date":"31 August 2009","review":"Given director Michael Winner's critical reputation today, it's hard to remember that he, too, once enjoyed a moment in the sun. For a brief period at the start of the 1960s, the director received good reviews on both side of the Atlantic, most especially from the American critics impressed by his ability to adapt very contemporary subject matter and make it appeal to an international youth audience. In particular, The System, followed in turn by The Jokers (1966), and then I'll Never Forget What's'isname (1967), attracted attention. All three films starred Oliver Reed, cast after Winner had spotted the potential of the actor who had previously appeared in Hammer horror films.<br><br>Overshadowed by the slackness and crudity of some of his later, more ambitious projects, these early titles are overlooked. But for The System, at the time of its release, Newsweek praised Winner as the unheralded director of a \"consistently intelligent and often brilliant low-budget import.\" Seen today it can be identified as part of a group of films that have interesting anticipations of each other within British cinema. In the film Reed plays 'Tinker' a seaside photographer, the charismatic leader of a group of young men seeking sexual conquest at the seaside.<br><br>The System, unsubtly re-titled The Girl-Getters for the USA, was felt to be controversial in subject matter at the time, although by today's standards it is pretty mild. Reed had earlier appeared as a tearaway in another resort-set movie, Losey's cult item The Damned (1961); in the present film it is almost as if the young thug from the previous story has moved on a little to a newly precarious living, at least as far as he might be able to. The character Tinker is much more self-confessional in the present movie, and to that extent has attracted comparisons to Alfie (1966), which took the self-examination of a moral vacuum to a much greater level. The System co-stars some well-known names: John Alderton, Harry Andrews, and Derek Nimmo all appear.<br><br>Originally, Julie Christie was slated to appear too as Tinker's posh love interest Nicola, but unfortunately this deal fell through and the role was taken by Jane Merrow. There's also a young David Hemmings, playing a relative on his first trip to the sexually exploitative seaside. Two years later the actor was to star in another film in which photography is also at the centre of activity, Antonioni's Blow Up. In The System there is reference to 'the takers and the taken' extending the photographic metaphor, but unlike in the 1966 movie there is no doubt as to what we are seeing. And Tinker leaves his exposed negatives to the mercies of a commercial developer, away from private obsession.<br><br>The 'system' in question is the methodical way the group of friends play the 'grockles' (their name for holidaymakers). As they admit, they have to \"take what they can from the visitors (to) prepare for the cold winter.\" Filmed in Torquay and Brixham, Winner's film is rich on location and atmosphere, effects helped immeasurably by the widescreen work of cinematographer Nicolas Roeg. Reed proves his stature as a star in a film that is, ultimately, all about him. From the first sight of him in a seaside hat, camera in hand, lounging on a railway platform, he is rarely off screen. His magnetic appearance makes one overlook the inelegance displayed on the dance floor in one scene (the manic moves of which recall his short-lived appearance back in Beat Girl, 1959).<br><br>Tinker is someone who, at the start of the film at least, is confident in his own motives and position in life; one who has preyed and succeeded repeatedly over the brief four-month holiday season. As the story progresses, however, he will discover that his position is more circumscribed than he thought and that, judged by his own standards and motives; he can find situations painfully reversed. Tinker has relationships with three main women during the course of the film: the wife of the local seaside comedian (his 'winter bird'); with Lorna, a naïve single tourist (Julia Foster); and a visiting rich man's daughter Nicola.<br><br>One of the most interesting points of the film is how readily the case-hardened Tinker falls for Nicola. Is his sudden vulnerability a symptom of underlying self-deception, or has the promiscuous photographer merely overreached himself socially as well as emotionally? Humiliated during a game of tennis with Nicola's rich friends, away from the sexual shenanigans at the beach, Tinker is confronted with another system: the class war. When blowing bubbles back and forth during his curious 'seduction' of his Nicola in his room earlier, Tinker had nothing to lose; by contrast the strike of a tennis ball into his face proves painful on more than one level, as a reminder of his limitations.<br><br>In his memoir Winner Takes All the director says that The System \"changed my life\" - that is laid the foundations, after previous false starts, for a successful career as filmmaker. Star, Reed, too, was to go on and find fame and fortune - at least until his drink-related behaviour got the better of him and he became a parody of his earlier, dynamic self. Co-star Jane Merrow sadly failed to capitalise on her success here, and drifted into television and obscurity. The film itself, after its initial period of praise and notoriety, vanished into the never-land of rare screenings on TV and so its belated appearance on DVD, albeit without extras, is to be welcomed. Although now dated in some elements, it remains a reminder of the hidden strengths of British cinema of the 1960s and a related part of the 'social problem' cycle of the time.","user":"FilmFlaneur","rank":[16,17]},{"title":"One of Oliver Reed's early works to remind us of his lost but not forgotten talent (Died 2nd May 99)","rating":3,"date":"3 May 1999","review":"With the Girl-Getters or The System as it was shown to be when i lived in the UK is a tale of misspent youth on a Southern England coastal town. Like many of these towns the folk lay dormant for most of the year until the summer comes, and with it trade in the form of tourism. This was in a time before the package tour and the Costa-del-slosh that most of the young men have reverted to. This was a time when a virile young male spent his days prowling the promenade in search of his prey. The system was a cunning plan thought up by Tinker played brilliantly by the late Oliver Reed, was to a method of getting as much action of the female variety as possible. I will not ruin the surprise by revealing what the system exactly entails but needless to say it works with measured success. Until that is Tinker falls fowl of his own tricks and has his heart broken by a more fiestly young lady with a nice sports car and a wealthy father. The Soundtrack is particularly commendable as can be gleaned from the opening titles, and continues with a particulary mod beat. I particularly enjoyed the film as I am of the same age as Reed in the film and it is good to see that little has changed in our quest for summer fun except for perhaps the fashion of the time and hairstyles. Or has it.","user":"sinbad-7","rank":[19,21]}]