[{"title":"This movie has made my life worth living.","rating":20,"date":"20 December 1998","review":"This is the greatest straight-to-video movie ever made. The whole series is great! So bad that it's good...The corny script, the bad acting...Rick Sloane delivers all the crap in a talented way that I'm sure no one could reproduce.It all makes me so giddy...I'm even in the fan club. God, I love this movie.","user":"Rev.Phil","rank":[10,10]},{"title":"for better or worse (mostly worse) was a USA network Up-all-night staple","rating":19,"date":"19 July 2004","review":"Two borderline mentally retarded vice girls and an idiot man-child partner arrest whores in this inanely stupid \"comedy\" from the supremely untalented Rick Sloane. The fact that Linnea Quigley is in it makes it a tad less sucky, but not less sucky enough for the film to be watchable.For some reason I wonder what Christian Barr who plays Traci Lords.. um, I mean 'Cherry Pop' is up to nowadays though.<br><br>My Grade: D<br><br>Dvd Extras: Director's commentary; Interviews; Ginger Lynn Allen Filmography; and theatrical Trailer<br><br>Eye Candy: Ginger Lynn Allen as Holly, Linnea Quigley as Didi, and Karen Russell as Shawnee all show breasts","user":"movieman_kev","rank":[13,14]},{"title":"An enjoyably inane 80's comedy hoot","rating":8,"date":"14 August 2008","review":"Various cadets train at an academy in order to join the Hollywood vice squad. The feisty Didi (the ever-adorable Linnea Quigley in fine spirited form), the ditsy Shawnee (foxy brunette knockout Karen Russell), and lunk-headed Dwayne (amiable Ken Abraham) not only infiltrate a seedy porno operation, but also a notorious prostitution ring as well. While Rick Sloane's flat direction and witless no-brainer script are anything but subtle or sophisticated, this film nonetheless possesses a certain endearingly clunky cheesiness that's impossible to dislike. The broad send-up of hardcore film-making is crudely amusing; ditto the often repeated knee-to-the-groin gag. Moreover, the cast play their silly parts with gleeful aplomb: Quigley, Russell, and Abraham make for likable leads, Ginger Lynn Allen portrays the spoiled, stuck-up Holly Wells with deliciously bitchy flair to spare, plus are are nifty supporting turns by Jayne Hamil as strict instructor Miss Thelma Louise Devonshire, Stephen Steward as hunky porn stud Chucky Long, Jean Carol as over-the-top evil flesh peddler Queen Bee, Stephanie Bishop as demanding lady porno director Desiree, Christian Barr as forlorn former porn starlet Cherry Pop, Tamara Clatterbuck as snarly streetwalker Sparkle, Jo Steele as brassy hooker Sparkle, and Manny Serrano as scummy drug dealer Snake. Stephen Ashley Blake's plain cinematography is merely acceptable. However, both Alan Der Marderosian's bouncy, throbbing score and the cool rockin' soundtrack hit the bull's eye (the gnarly theme song in particular totally smokes). As a nice added bonus, both Linnea Quigley and Karen Russell bare their beautiful breasts. A real riot.","user":"Woodyanders","rank":[5,7]}]