[{"title":"A wonderful movie finally coming to video in America!!","rating":10,"date":"27 June 1999","review":"This story of Cinderella is the best version I have ever ever seen. Richard Chamberlain is wonderful and Gemma Craven is positively charming.<br><br>Filmed partly on location in Austria, the scenery is beautiful and the sets and costumes very authentic.  Part of what makes this movie so great is that the music helps tell the story.  The music is beautiful and the lyrics, although at times very comical, are very important in building the characters, and expressing their emotions.<br><br>Perhaps one of the most interesting points of this movie is the fact that they address the question of Cinderella not being of Royal blood.  It actually adds a nice twist to the story, but of course, Cinderella eventually gets her Prince.<br><br>This brilliant musical has been my ultimate favorite since I was about 12 years old.  And at long last, it is finally coming to VHS and DVD.","user":"PrincessIncognita","rank":[23,24]},{"title":"A Childhood Treasure rediscovered","rating":20,"date":"20 March 2002","review":"My parents taped this movie from TV for me when I was young, and it has always remained one of my favorites.  I've worn the tape out over the years, because even now that I'm a (supposed) grown up, I still get the urge to go back and watch again and again.<br><br>The film is beautiful, filmed on location in Europe (Austria, I think?) with a whimsical and richly romantic air.  What I love most about this movie is that it makes the effort to flesh out the characters into three dimensional figures and to set against an (at least plausible) historical backdrop, while still maintaining a tiny bit of tongue-in-cheek self-awareness--a live-action period piece that enjoys the fact that it's really a fairytale and a musical.  I've always thought that gave it just a hint of sophistication.  The movie also explores more of the complexities of the stories and the characters' motivations.  It carries us past the classic \"slipper\" moment and allows for a more complete ending, which I found more fulfilling.<br><br>As for the characters themselves, I loved Cinderella, neither the modernized girl-power of \"Ever After\" (which I loved, by the way) nor the blank goody-goody-ness of the Disney classic, but a very human and lovely blend of the two--with a gorgeous voice thrown in for good measure.  Prince Edward, played flawlessly by Richard Chamberlain, gives us a hero to root for, in addition to our traditional heroine.  You don't just wait for her to be found, you cheer for each of them to find the other.  The rest of the cast is filled in with real people that the viewer comes to care for and value in the story almost as much as the main pair.  You are not left with the typical stock characters that you see so often in fairy tales.  I especially loved the Fairy Godmother, the Prince's Companion, the Chamberlain, the senile King, the Dowager queen...okay, I really love them all.  Even the dog.  :)<br><br>I despaired of every finding a \"real\" copy on VHS until recently.  The VHS retained a few scenes that were edited from the TV version (I assume) for time, and I have to say I think that I liked the short version better.  I thought that the it flowed more smoothly, and I found that I did not miss the musical numbers they cut.  I was especially disappointed with \"Find a Mate\" (yes, they're serious) and the scene in the Fairy Godmother's house...very contrived and corny.  They really don't equal the rest of the film.  Although the Prince's prayer at the end is wonderful, and was cut from the TV version.<br><br>All in all, I just have to say that I love this movie, and always will.","user":"acaldwell","rank":[25,27]},{"title":"''You'll Forget Every Other Love Story You Ever Saw....''","rating":10,"date":"8 August 2005","review":"\"The Slipper And The Rose\" is a beautiful version of the classic Cinderella story. Made in England and released in 1976, it retells the familiar story with warmth, humor and wonderful songs by the Sherman brothers, who also did the music for countless Disney films, notably \"Mary Poppins\". Prince Edward (Richard Chamberlain), heir to the throne of Euphrania, is expected by his father the king (Michael Hordern in another wonderful performance) and his mother the queen (Lally Bowers) to choose a wife and settle down. To this end, they plan a court ball to which all the princesses they can locate will be invited. Meanwhile, young Cinderella (Gemma Craven) has just lost her beloved father. But things go from bad to worse for her, when her selfish stepmother (the great Margaret Lockwood, in her first film in over 20 years, and her last) and spoiled stepsisters (Rosalind Ayres and Sherrie Hewson) reduce her to the status of a servant in her own home. Thankfully, however, her fairy godmother (Annette Crosbie) is waiting in the wings to see that she goes to the ball and meet the prince. The rest is up to them... With an excellent cast and fine support from Kenneth More, as the Lord Chamberlain, Christopher Gable as the prince's friend John, and especially Dame Edith Evans as the dowager Queen, \"The Slipper and the Rose\" is magical film-making.A few twists in the story keep it fresh, while all the charm of the original is preserved. The lavish production, handsome location photography beautiful costumes and a witty, sophisticated script has appeal for all ages.And enough cannot be said for the Sherman's music, which is, in turn, delightful, hilarious and, when the occasion calls for it, heartbreaking. Craven's ballad ''Tell Him Anything-But Not That I Love Him''is a perfect example of the latter. This film just gets better as the years pass,and it's truly one of the best film versions of \"Cinderella\" ever made.","user":"phillindholm","rank":[35,39]}]