[{"title":"Rough around the edges but interesting giallo!","rating":6,"date":"18 March 2008","review":"Hi, Actually some of this film was made in Waterford, including the 'bridge in the fog' and river scenes. I was an eighteen year old working as an assistant in a chemist shop on the quays in Waterford when some of the crew came in and asked my boss Michael F. O'Connor to make up a concoction that would fizzle like acid when thrown on the victim. This he duly did, after some experimentation! They spent at least three days in Waterford. This was a very exciting event for me as I was a huge movie buff, and I still am of course! I have the DVD release and also the soundtrack composed by Stelvio Cipriani. Great memories. I would be glad to hear from you if you ever read this message. Niall.","user":"niallahearne","rank":[12,13]},{"title":"Want to get copy of this movie","rating":10,"date":"30 December 2006","review":"This is not a review as I have not seen the movie but I worked on it as 3rd Assistant Director and also had a part as a barman opposite star Luigi Pistilli - all of 30 seconds. Would love to have a copy for posterity! Your reviewer was pretty accurate as to the gore. I was there when granny's cat got its throat cut in the fridge. I can also tell you a tale or two about the cast and the making of the movie. The whole thing was shot in 2 weeks on location in Dublin. One of the dead bodies in the boot of the car was a friend of mine. The car used in the final scene where the villain crashes through the window belonged to a friend of mine. We had to get it resprayed after that. If anyone can tell me where I can get a copy I would be truly grateful Regards - John McCormack","user":"countjohnny","rank":[13,17]},{"title":"Watchable and pretty sadistic Italian giallo.","rating":7,"date":"29 November 2014","review":"So I decided to re-watch \"The Iguana and the Tongue of Fire\" by Riccardo Freda after many years of not seeing the movie.In the prologue beautiful woman has her face melted with acid and her throat slashed by unknown black gloved killer.Her body is found in the trunk of a car belonging to the Swiss ambassador.Former police Inspector John Norton(Luigi Pistill)tries to solve this grisly case of mutilation and murder.But the elusive killer soon will kill more victims.\"\"The Iguana and the Tongue of Fire\" is a watchable albeit quite unsatisfying giallo with several nasty and gory murder scenes and very sadistic finale.The acting is fairly good and there is a bit of nudity.Still it seems that Riccardo Freda himself was dissatisfied with the film and effectively disowned it.That's why he directed it under the pseudonym of Willy Pareto.7 fiery iguanas out of 10.","user":"HumanoidOfFlesh","rank":[4,4]}]