[{"title":"Walking Tall","rating":10,"date":"8 November 2006","review":"I first watched the Walking Tall movies when I was about 8 years old and I thought both Joe Don Baker and Bo Svenson did a great job, they must have anyway because since watching the movies, I have tried to learn as much about the real Sheriff Buford Pusser as I can. All 3 parts of the movie gave me chills and Buford Pusser was a true hero, I only wish he were alive today and that there were more people like him. I would love to thank him for getting rid of all the crime and being so brave. I am very sorry that his family had to go through such horror and pain. My heart goes out to them. So from a 30 year old fan of Sheriff Pusser and of the 3-part Walking Tall movies and the actors that portrayed him, please do not be negative about these movies and actors, they were only trying to let us know what a wonderful man the real Buford Pusser was and what a great family he had. And to all the young people who may have not heard much about Buford, I suggest you watch the Walking Tall movies and learn more about him.","user":"kimmh","rank":[15,19]},{"title":"Shocking: and A Great Story","rating":7,"date":"16 January 2006","review":"This was the first \"Walking Tall\" movie I saw, I think in a $2 movie theater along Hollywood Blvd. , so I didn't have any reference to the first installment done by Joe Don Baker. I remember being shocked at the corrupted system of McNairy County and the brutality of the \"redneck gangs\". I was also amazed at the fact that one man decided he's not going to let it slide, and went out to do something about it. Courageous ? I thought so - to a point where it sent shivers up my spine.<br><br>I think this movie is a great story about American courage to stand up and do something about a system that's only serving its own interest. I was pretty blown away about it, and think this is still one of the best movie of the hero/anti-hero genre, which one might laugh but includes recent movies like the \"The Punisher\", but even more so because it's a true story. The recent remake starring the \"Rock\" just doesn't do any justice to the real fire in the story of Buford Pusser.<br><br>A \"classic\" that I'm sure will resurface again in the future.","user":"ebiros2","rank":[11,14]},{"title":"Enjoyable yahoo fare.","rating":7,"date":"14 September 2013","review":"The exploits of real-life Tennessee sheriff Buford Pusser continue in this sequel to the hit film \"Walking Tall\". Bo Svenson now takes on the role; and while he may not be as good an actor as Joe Don Baker, he does alright at playing the take-charge, no-nonsense lawman, who finally gets out of the hospital after being ambushed near the end of the first film. He tries to go about his business while the bigshot criminals whom he pursued the first time around are now hellbent on getting back at him.<br><br>There are some good action sequences in this thing, such as one involving a runaway car and chase scenes on the river. Director Earl Bellamy does a decent job with the direction. One highlight is when Buford and his deputies, played by returnee Bruce Glover and Robert DoQui (who replaces Felton Perry as Obra) take apart the car of a racer (Richard Jaeckel) who doubles as a hired goon. The movie overall is fun if not as memorable as \"Walking Tall\" part one. At least one should be able to root for Buford and enjoy hating the bad guys.<br><br>Svenson is ably supported by a bunch of familiar faces. Glover and DoQui are very engaging as the deputies. Other holdovers from the first film include Noah Beery Jr. and Lurene Tuttle as Bufords' parents, real-life siblings Leif Garrett and Dawn Lyn as his children, Red West as the helpful Sheriff Tanner, and Logan Ramsey as cranky big time criminal John Witter. Co-starring are the always reliable Luke Askew, a typically creepy John Davis Chandler, and a lively Frank McRae. Supremely sexy Brooke Mills and Angel Tompkins provide plenty of eye candy.<br><br>All in all, this first \"Walking Tall\" sequel is solid entertainment, although it's sobering to hear the postscript at the end.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[3,3]}]