[{"title":"An excellent adaptation of a great novel.","rating":14,"date":"14 May 2004","review":"In a future where books have been outlawed, firemen are paid to burn books instead of put fires out. However, one fireman realizes that what he is doing is wrong and decides to go against the degenerate society he lives in.<br><br>I have read reviews of this movie calling it \"boring\" and \"outdated,\" and frankly I am amazed by how ignorant some people can be.  Calling \"Fahrenheit 451\" outdated simply because the set designs look old and because there are no flashy computer effects shows that you have completely missed the point. The people who made this were not trying to give you a spectacle, they were trying to give you a message - a message that is even more important today than it was when this movie came out.<br><br>\"Fahrenheit 451\" is a fine adaptation of Ray Bradbury's classic novel about censorship. The movie changes many of the book's events, but the spirit of the book is preserved. The cinematography is truly great and the score is quite powerful. The acting is also great. Oskar Werner is right on the money as Montag the fireman. Julie Christie is wonderful playing dual roles as yin and yang: Montag's zombie-like wife, Linda, and Montag's friend, the young and energetic Clarisse. Cyril Cusack is also memorable as the evil Fire Captain Beatty - he isn't a cartoon villain, but a very realistic and human character.<br><br>You may think that \"Fahrenheit 451\" delivers an irrelevant message. You may think that book burning is a thing of the past, a relic of Nazi Germany and Communist Russia. Look around you - book burning happens every day! How do you feel about people trying to ban \"The Adventures of Huckleberry Finn\" because the word \"nigger\" is used in it?  How about whole sections of \"Doctor Dolittle\" being rewritten so that they are politically correct? Did you know that school textbooks may not make any mention of Mount Rushmore because it is offensive to a certain Indian tribe? Meanwhile, we are watching our giant-screen TVs and listening to our Walkmans (two inventions that were predicted by Bradbury). We are constantly \"plugged in\" and never take any time to just sit and think. Look around you - Ray Bradbury's story is coming true. I advise you to watch this movie, and to read the book. (Read the book first. You will appreciate the film more.)<br><br>I hear that a remake is in the works. No doubt it will be filled with gaudy special effects and silly Hollywood cliches. I guess I should hold off judgment until I actually see it, but I doubt that it will contain any of the genius that can be found in this sadly underrated gem. It will be interesting to see what they do with the mechanical hound, though....","user":"panamajaq04","rank":[138,160]},{"title":"Imagine a world without books....","rating":8,"date":"12 May 2005","review":"Fahrenheit 451\" is a strange film, hard to describe. No one could have interpreted the classic Bradbury novel in the same bizarre, fascinating manner as Francois Truffaut. It's a book, and a film, about freedom, choices, individuality, and intellectual repression in a future where books are forbidden; where Firemen are men who start fires...fires in which they burn books.<br><br>It was also the first color film directed by Truffaut. Although he by all accounts was not happy about making a color film and found it a bit unsettling, color is used to great effect here; sparingly, except for the extreme shade of red that is seen throughout.<br><br>\"Fahrenheit 451\" is supposed to be the temperature at which book paper catches fire, as the protagonist Guy Montag (Oskar Werner) explains in a scene at the beginning. Guy is a Fireman who seems happy enough with his life until he is approached by a young woman named Clarisse (Julie Christie) on his way home from work one day. She starts up a conversation with him, and the two become friendly. She bewilders him but challenges him to think and feel....and read. And when he arrives home we see his wife (also played by Julie Christie, with long hair), sedated and watching the wallscreen (TV of sorts)...we see what his life is really like, although he had told Clarisse he was \"happy\"...he is not.<br><br>As his friendship with Clarisse grows, he starts to secretly take home, hoard, and read some of the books he finds in the course of his daily work, and as he reads, he becomes obsessed with the books. They become his mistress, and are what finally make him feel affection and warmth. And when he starts to feel and care, so do we.<br><br>The two single best scenes are a passionate one involving an old woman who refuses to leave her books, her \"children\" as she calls them; and the wonderful ending of the film. The countless, painful closeups of books as they are being burned are beautifully done, and difficult to watch.<br><br>Truffaut was a well-known disciple of Alfred Hitchcock's films, so when Hitchcock fired his long-time music collaborator Bernard Herrmann during the filming of \"Torn Curtain\", Truffaut was thrilled to acquire his talents for his own film. The score for \"F451\" is beautiful, and the film would not be nearly as effective without it.<br><br>Writer/producer/director Frank Darabont (\"The Green Mile\", \"The Shawshank Redemption\") is working on a new film of \"Fahrenheit 451\" this year. He says it won't be a remake of the original film.","user":"ClassicAndCampFilmReviews","rank":[72,83]},{"title":"Reading Is Bad For Children And Other Living Things","rating":8,"date":"2 January 2010","review":"Ray Bradbury's disturbing vision of a possible future comes vividly alive in this film adaption of Fahrenheit 451. Reading for pleasure is now banned although I imagine you must have a certain degree of literacy to read food can labels and directions to operate all kinds of machinery. But read for enjoyment or for education about the world beyond the small space of earth you frequent, that's a big no-no in this future America.<br><br>Oskar Werner stars in Fahrenheit 451, he plays a fireman who have a different function in this society. Buildings and such are now fireproof so fireman have become the enforcers of the ban against books. They seek and burn books in whatever quantities they find. A good job in a police state, but not a good one if you have an inquiring mind such as Werner has.<br><br>Julie Christie plays two roles, Werner's pleasure driven wife and a schoolteacher whose unorthodox for that society's teaching methods have brought her under scrutiny. She does a good job in both characterizations.<br><br>Bradbury's themes are grounded in reality. Looking at American history it was a crime in many slave holding states to educate a slave. Let them be happy in their ignorance and they might not get ideas about a better life and won't rebel. <br><br>But this is a society that's beyond that kind of formal slavery so the answer is the old Roman one of bread&amp;circuses. The circus in this case is television which has evolved into an interactive medium. The vast wasteland that Newton Minow characterized television as back in the day has gone beyond anything Minow was having visions about. Entertainment has really dumbed down and the circuses aren't too far from what used to entertain the Romans.<br><br>In the supporting cast you will remember Cyril Cusack as the fire brigade captain who functions as the spokesman for this new world and Bee Duffring as the book lady who martyrs herself for knowledge in an unforgettable scene.<br><br>The ending is not Bradbury's, but one written by director Francois Truffaut. It is very much however in the spirit of the novel and a tribute to mankind's unquenchable thirst for knowledge. Don't miss Fahrenheit 451 when broadcast.","user":"bkoganbing","rank":[16,17]}]