[{"title":"Half and half","rating":2,"date":"2 June 1999","review":"The first half of this film -- the part with Bartertown, Thunderdome, etc -- is brilliant, not just a repeat of THE ROAD WARRIOR but a totally new concept, thoroughly fleshed out. The second half, with the lost children, isn't as good -- and, more to the point, doesn't quite mesh with the first half, despite Miller's attempts to tie it all together at the end. Still, it's well above average in  a genre that has increasingly come to believe (wrongly) that special effects are more important than plot and character.","user":"Mike-754","rank":[52,58]},{"title":"Underrated","rating":20,"date":"20 April 1999","review":"When I first saw Mad Max Beyond Thunderdome, I felt disappointed.  It was a letdown from its amazing predecessor.  I knew its reputation as an unworthy sequel, but I still realized there was something good about it, something I had never heard from other people's points of view.<br><br>It wasn't until some time later when I watched the series a second time that I noticed what it was.<br><br>Those who think MMBT is not as exciting as The Road Warrior would be right. But those that think MMBT sucks because it is not as exciting as The Road Warrior would be missing the point.  What makes MMBT a worthy sequel is its way of establishing a greater scope of the setting the series takes place in.  The dredges of civilization were what set the stage for the series in the original Mad Max.  The barren world of desert wastelands and sparse outposts take the idea of a post-apocalyptic world one step further in The Road Warrior.  A squalid setting such as Bartertown and an oasis where the tribe of children lived in MMBT once again builds on the elaborate fantasy that makes the series as popular as it is.  The final, chilling realization of just what became of civilization in the closing moments of the movie are more than enough explanation as to why the the world the viewer sees in the trilogy is the way it is.<br><br>I was too young when I first saw MMBT to understand this.  It wouldn't be until I saw it again some time later, with more movie-viewing experience under my belt that I realized that what makes Mad Max Beyond Thunderdome tick is not action set pieces, but a far more subtle approach of atmospheric setting.","user":"Spaz-11","rank":[134,170]},{"title":"Not as Bad as You Remember","rating":7,"date":"17 July 2009","review":"This movie was much maligned when it came out in 1985, but that was due to the spectacular qualities of its predecessors, \"Mad Max\" and \"The Road Warrior.\" Taken out of comparison with the other two, this movie is still solid post-apocalyptic fun, but it's lighter and slightly less violent than \"Road Warrior\" (as is evidenced by the PG-13 rating.) The actors' performances are perfectly adequate for the action, and the chase scenes bear all the hallmarks of Miller's craftsmanship (which contemporary directors should seriously consider studying and revitalizing.) You just won't see any arrow-riddled bodies slamming into the pavement at 60 mph or watch manned motorcycles sucked under the wheels of a big-rig. This one is about the kids. Think Hook in the wasteland and that starts to approach it.<br><br>If you saw this movie in the theaters 25 years ago and walked out hating it, give it another chance. Just don't see \"RW\" right beforehand. No reason to hobble your experience with unrealistic expectations.","user":"bradley-trent","rank":[54,70]}]