[{"title":"\"But how can you thank someone who has taken you from crayons to perfume...\"","rating":8,"date":"31 January 2005","review":"This movie is about many things  teen angst, race relations, and poverty. But what it's *really* about is teased hair, heavy eyeliner and miniskirts. And the title song, of course. Who could ever forget the gushing sentimentality of Lulu warbling about crayons and perfume? It is a charmer of a movie with life breathed into it by a fresh cast of young Brits. Released at a time when the world was captivated by all things British, it was relatively daring at the time it was made. A low-budget film that raked it in at the box office, Poitier, as in *Lilies of the Field*, wisely accepted a low salary in exchange for a share of the profits. But the biggest profit of all is his portrayal of the East End school teacher, Mark Thackery, who quickly learns that his students need a different kind of education than that of a textbook. It has been, unfairly or not, relentlessly compared to *The Blackboard Jungle*, and it is a blood-relation to *Up the Down Staircase* and *Dangerous Minds*. But none of them have the sweetness of Judy Geeson, as Thackery's irrepressible student Pamela Dare. At the end of the movie, when Thackery and Dare dance together, racial, social and philosophical barriers are smashed, and hope springs eternal.","user":"style-2","rank":[59,66]},{"title":"An Underrated Poitier Vehicle","rating":9,"date":"17 October 1999","review":"Recorded on a budget of just $640,000, To Sir, With Love was drafted, as with Lilies of the Field, to give Sidney a share of the gross profits to account for his diminished fee. Writer-director Clavell also received the same arrangement, a writer who was chosen for his love of the source material. The rights to the source, an identically-named novel by E. R. Braithwaite, had passed from studio to studio, and been offered to numerous stars before finally getting the green light when in the hands of Columbia President Mike Frankovich.<br><br>Poitier noted in his autobiography the similarities in terms of racial issues between America and England. Filmed in London, the picture featured a number of minorities, many of whom, he observed, would be unable to find work outside of the confines of the movie. However, for his time spent with the cast, he was delighted with their company. Sidney played Mark Thackeray, one of his most famous characters, an engineer taking a teaching post as a stopgap between jobs. Eventually the relationship he develops with the students causes him to question his loyalty to the profession.<br><br>To Sir, With Love is often frowned upon nowadays due to its sentimentality. While not wholly condemned as a film, it is certainly regarded as the poor relation of Poitier's three 1967 works. This is an unfair assessment of a movie that commits the only crime of having its heart on its sleeve. And, though the late sixties would see an increase in the political situation, To Sir, With Love was the only one of the three Poitier vehicles that year that did not rely upon his colour for its subtext. Instead, a few bigoted remarks were inserted, largely from a fellow teacher (Geoffrey Bayldon as Mr. Weston) than the pupils. Compared to his other overshadowing works that year, direction paled, too, the camera-work at times almost static. However, the scope for Poitier as an actor was broader than in the other '67 roles, and certainly broader than in the 1996 TV sequel. Where there the plot would be propelled largely by one pupil, here multiple characters would be guided through numerous situations over an entire term period. Over the course of the lengthy film the viewer can feel as though they have experienced the timescale too. And who would argue that the sheer amount of silly moves Sidney and Judy Geeson perform in the final ball didn't directly influence Travolta and Uma Thurman in Pulp Fiction?","user":"The_Movie_Cat","rank":[62,71]},{"title":"Great, landmark teacher-student relationship film","rating":28,"date":"28 January 2001","review":"The school movie against which all other school movies are measured. Sidney Poitier was on a roll in 1966-67(A PATCH OF BLUE, GUESS WHO'S COMING TO DINNER, IN THE HEAT OF THE NIGHT)and TO SIR, WITH LOVE crowned that succession of great films. Poitier's Thackery is meticulous and elegant, something of a revelation to the unwashed juvenile deliquents and teen sluts who populate his class. Yet this unemployed engineer has his work cut out for him, as his motley crew will try just about anything(including burning tampons in the classroom stove!)to run him off. Instead of exploding like the kids wish, Thackery takes a different tack; treating them like adults and talking about things they have questions about. The ploy works, and along the way Thackery learns to deal with indifferent fellow teachers, racism, lovestruck female students, and a hard decision that will determine his future . . . A great inspirational movie, TO SIR, WITH LOVE also boasts British songstress Lulu in her first film role, as well as prominent soundtrack artist(The Mindbenders are the others). The process by which Thackery molds these wild, rebellious teens into mature and thoughtful adults--and the teens' resulting respect for Thackery, quite possibly the first respect they've ever felt for an adult--is touching. Definitely a classic film worth seeing.","user":"thomandybish","rank":[49,57]}]