[{"title":"It's More Than the Title...","rating":10,"date":"5 January 2006","review":"Films like 'The Deep' are few, sporadic, and are usually not accepted by many audience members, but are usually the films that end up meaning the most in the end. I found that this film had a charm that I could not put my finger on, upon viewing it for the first time. The book, written by well known Peter Benchley (of 'Jaws' fame) was released on the heels of 'Jaws' success, so the film was released a year later, in '77, and was easily brandished as being a 'money film' but I assure you it is much more.<br><br>Loosely taken from the book, the film captures the essence of the title. When David Sanders(well played by newcomer Nick Nolte) is on Holiday with his lover(the ALWAYS beautiful and aesthetic Jacqueline Bisset, of whom the film rests well on) Gail Berke, the two uncover items while diving: a small bottle of some sort, sufficient with morphine, and an unrecognizable piece of jewelry, worn by sea and time. Naive to Bermuda, the two continue their holiday, with many people after what is in the bottle, and just who wants it, who should get it, and what ELSE is down in the deep. Genuinely frightening, and appropriately paced, this film not only relies on the situation to keep interest, but psychological undertones to further tell the story.<br><br>One of the biggest things this film has going is the underwater photography, shot with beautiful landscapes of coral, fish, and dedication to what the actors explorations achieve. Filmed in Panavision widescreen, this film delivers the whole underwater experience, as each scene is carefully timed and arranged photographically. The fact that filming was done creatively without CGI is all the more fascinating, and you feel like you are actually there, underwater, experiencing. This is buttressed by John Barry's positively breathtaking score. Each note whispers a feeling under and above water, springing in the air, and whooshing through the water, like an animal. The theme is gorgeous and reflects not only the characters attitudes, but the theme of the sea and the deep itself. It is at times violent, and at other times soft and peaceful. The writing can be said something for as well, as the scenes are like a ballet, with carefully choreographed actions, and dialog through the special masks they wear, that a whole scene could take place under water, and does. Benchley adapted from his book, and the story works well.<br><br>The acting of the film could not be better. Nick Nolte is very believable as the rambunctious and adventurous David Sanders, and he is played with such prowess and eagerness, something that could be found in all of us, toward the ocean. We really learn to feel why David feels so much about the ocean, more so in the extended television version. Jacqueline Bisset is hauntingly gorgeous as Gail Berke, the conscience and voice of reason of the film. Gail is torn by morality midway through the film, something else we all can relate to. And as the danger caresses, so to does Gail toward what she believes in, and her love for David. Romber Treece is played out with spunk and passion by the late great Robert Shaw, fresh off the celluloid of Jaws, and makes the role his own. Treece, being an islander, knows the bad, and goods of the material they have found under sea, and acts more or less as a guide to keep the two out of danger, while achieving his own satisfaction to the sense of desire he has to the call of the sea. The supporting cast is really great as well. Louis Gosset is daring and intimidating as the main villain Henri Bondourant, one who kills at will, and who provides the three main characters with plenty of conflict, and Eli Wallach is sleazy and perfect as the only survivor of a wreck, that later became the site of the treasure and drugs. The main three do their best to help with the psychological undertones of the film, part of the real charm.<br><br>'The Deep' is more than just a deep sea adventure, but a psychological study of three human beings: One, an adventurous, intrepid young man, fascinated by what is dangerous and unknown to him; The other, his lover, a woman of strong passion, strength, and beauty on the inside and out, who is drawn to those she cannot access or comprehend; The third, a man who has been to hell and back, who still feels obliged to his place of comfort, the ocean. The chemistry between these characters, is what builds the undertone. Gail, is fascinated by Treece, because he has been through so much, and feels drawn to his reclusiveness and relevance. David is drawn to danger, and cannot be denied his goal, needs the pleasure of experience, and Treece, fascinated by both their innocent drives, can only help them thusly. The actually deep, a character itself, is the combination of their lively psyches coming together. When they are deep inside, they face danger in the form deadly animals, explosions rigged in the wreck, and most appropriately, themselves. They are forced to look inside themselves, further explored in the book and television version, and the resolution to the film is felicitous.<br><br>So when you look at it, 'The Deep' is a clever look into the deep of our minds, as well as our dreams, our fantasies, and our weaknesses as humans. If there is any way to uncover any of it, this film more or less shows the way, and all the more with the entertainment it delivers, gives us a true experience of what any 'Deep' is like.","user":"TruPretender","rank":[105,130]},{"title":"They don't make films like this any more","rating":9,"date":"19 October 2013","review":"I don't know why IMDb is carrying such a negative review of this classic film on the front page. But I'm happy to note a lot of very positive reviews thereafter. Not much more I can add, but this is one of the classics of the golden era of film-making, without the CGI, hyped-up violence, obsessive sexuality and general lack of any kind of emotional depth of current popular cinema. While being in that category (popular cinema), this film is still great entertainment, often going pretty \"deep\". And there are of course the bonuses of the legendary Robert Shaw, the unforgettable beauty of Jacqueline Bisset, a young Nick Nolte full of promise, a wonderful score by John Barry, and plenty of evocative scenery, both below and above sea level.","user":"weblynx-1","rank":[20,22]},{"title":"Simplistic, suspenseful, scenicly breathtaking, - pure escapism. A 'Shaw' good time!","rating":28,"date":"28 November 2004","review":"Peter Yates directed this beautiful escape from reality adventure in which our protagonists Nick Nolte and Jacqueline Bissete team up with the silver screen legend Robert Shaw to find a sunken treasure off the beaches of Bermuda. Unfortunately they encounter competition who would go at great lengths to get what they want - even if it means murder - unless our protagonists' intrepid assistant (Robert Shaw) uses his valuable knowledge to keep the tables turned and remain one step ahead.<br><br>This film is a delight from start to finish. From the opening sequences of clearing clouds and Bermuda coming into focus and the astonishing underwater photograpy to the action packed adventurous finally, you simply can not take your eyes off the screen. The music from the one and only John Barry (who bought you the unforgettable themes from James Bond and Born Free) is mesmerizing and suits the picture elegantly. The cinematography is beautiful and gives you a lust for the holiday destination. Most importantly, the plot (written by the man who bought you 'JAWS') is original and riveting and high in adventure - I truly recommend this to all adventure fans.<br><br>Cast selection was genius. At the time, Nick Nolte was a new face to the silver screen and brought an unforgettable performance as an obsessed husband clearly hypnotized by the idea of Gold. Jacqueline Bissete is, well, how can I put this? - I would have liked to have been there with her on her holiday (gosh is she beautiful or what?). It was Robert Shaw I believe, who brought the most to the film. He is witty, ignorant, a know-it-all and a man who isn't afraid of anything and this is what people come to see adventure films for. I can't imagine anybody else nailing the role like he has. Pure brilliance from a great British actor.<br><br>Now how does a film with an interesting, ORIGINAL plot, great cast (including a legend), calm and mesmerizing music, golden cinematography and a great 'quotable' screenplay come to such underrated status is beyond Bermuda's Triangle. The current rating that IMDb gives to this film will never do it justice. I only hope for those who haven't seen it to overlook the score it has been given and take some time to sit back and escape to the fantastic world of \"The Deep\" - an experience I will be taking for many years to come. For me, a classic adventure of pure escapism!","user":"Freddy_Levit","rank":[54,68]}]