[{"title":"Weird, uneven, bizarre, but never boring","rating":9,"date":"9 October 2003","review":"Gordon Hessler was not all that great a director.  He wasn't particularly good at setting up interesting shots or getting good performances out of his actors, but occasionally he managed by default to create a movie that was so completely off-the-wall and bizarre that those shortcomings could be forgotten.<br><br>SCREAM AND SCREAM AGAIN is a good example of that.  It is by no means a good movie; in fact, it's really pretty bad.  But you literally have no idea where it's headed, and by the time you get there, even though it's a tad underwhelming, it's still just oddball enough to keep you hooked.<br><br>Basically, it's the story of a serial killer who preys on bar-hopping women, and who, incidentally, seems to have superpowers of some sort.  Or, maybe it's the story of a military conspiracy of some sort?  Or is it the story of some kind of body parts black market?  Believe it or not, all these seemingly unrelated plotlines eventually come together, and it's a wacky ride all the way.<br><br>The biggest disappointment for me, is the scarce screen time of headliners Vincent Price, Christopher Lee and Peter Cushing.  They literally have less than twenty minutes of screen time combined, and only Lee and Price even appear together, in one very brief scene.  The main characters seem to be a disgruntled Scotland Yard detective, and a younger, less cynical police officer.<br><br>I recommend this movie to any fan of AIP or any of the three horror stars, but most people will not have the patience to sit through it.  Fans will enjoy it, if only for it's sheer weirdness.","user":"squeezebox","rank":[40,44]},{"title":"Great atmosphere, great plot, fair otherwise","rating":8,"date":"24 December 2001","review":"'Scream and Scream Again' is one of my favorites, even though it is ratherly poorly put together.  The director tried to make the movie mysterious -- and succeeded too well, making it nearly incomprehensible.  However, if you have patience, the final explanation at the end will tie enough of the film together to make rewarding sense.<br><br>   The main attraction for this movie is its subtle atmosphere of horror. The movie mainly consists of fragmented images that come to gether to paint a darker picture than just what the movie shows.   A good example of the texture and flavor of the film is the scene which, to my disappointment, was removed from the version I rented (I originally saw the film in a college Halloween movie festival).  A coroner while alone investigating the death of a lovely women begins to move forward as if to kiss the corpse but is interrupted by the inspector entering the room.  The surprised coroner quickly straightens up and tries to look very official and busy, but obviously is upset at having almost been caught being amorous to the corpse.  No further reference was made to the scene.<br><br>   This is an example of the extremely dark and upsetting images that lie just beneath the surface of the film.  It is unfortunate that the director's attempt to involve the audience by making them work hard to piece together fragments of action into something comprehensible was mostly unsuccessful. Still, I think the film is worth the patience.  My rating:  8 of 10.","user":"silversprdave","rank":[31,37]},{"title":"\"That bloody chicken wasn't killed, it died of old age.\"","rating":7,"date":"5 February 2005","review":"What a bizarre movie! Scream and Scream Again is all over the place. It's a combination horror/sci-fi/mystery/espionage/thriller with sort of a James Bond twist. And it's a lot of fun.<br><br>To be honest, at the beginning of the film, I was lost. There are about four different plot lines that don't seem to have anything to do with each other. (1) There is a runner who collapses. Every time we see him after the collapse, he's in a hospital losing his limbs one at a time. (2) There is a vampire killer on the prowl in London. He attacks young women and drains them of their blood. (3) There are scenes of some fascist regime in some unknown country. The leaders of the regime are being killed one at a time. Also, people are being tortured for no apparent reason. (4) There are discussions going on in the uppermost levels of the British government that appear to have nothing to do with anything else. But, by the end of the film, most everything fits together quite nicely as a story about creating a master race.<br><br>Scream and Scream Again 'stars' Vincent Price, Christopher Lee, and Peter Cushing. I say 'stars' because Christopher Lee and Peter Cushing are barely in the movie. In fact, Cushing has all of about 5 minutes of screen time. Alfred Marks as Supt.Bellaver is actually the star. He's a no nonsense policeman investigating the string of murders in London. In the end though, Price takes over and is wonderful. His mad doctor routine is terrific to watch.<br><br>There are some excellent moments in the film worth mentioning. The chase scene is one of the longest I've ever seen, ending with the killer losing a hand after being handcuffed to the front of a car. Another is the fight scene at the end between Vincent Price and leader of the fascists. There are also moments of tension as when the young doctor is snooping around Vincent Price's house.<br><br>This is a movie that you have to be patient with. Trust me, it all makes sense in the end.","user":"bensonmum2","rank":[27,32]}]