[{"title":"Richard Lester goes West","rating":8,"date":"8 October 2001","review":"As the first of the modern-day prequels this has something of a bad rep, but baggage aside it's a pretty entertaining yarn. This is the first and only time director Richard Lester ventured into the western genre and he manages to place his own stamp on the film. Much of it takes place during the winter, which provides for a different visual palette (similar to the look of Altman's \"McCabe and Mrs. Miller\"), and Lester adds his usual throwaway lines to keep things light.<br><br>Tom Berenger and William Katt do a good job as Butch and Sundance, and at times Katt's resemblance to Robert Redford is uncanny. Likewise when Berenger wears his hat just so. Joining them are Peter Weller as LeFors (who ends their first encounter by saying ominously, \"I'll see you again\"), Brian Dennehy as a rustler out for revenge, Vincent Schiavelli as a casino guard, Paul Price (late of Lester's \"The Ritz\") as a stingy butcher, and John Schuck and Christopher Lloyd as a couple of bumbling outlaws. Also, if you look sharp you can catch Richard Lester's cameo about 34 minutes in, doing a double take during one of the duo's getaways.<br><br>All in all, \"Butch and Sundance: The Early Days\" may not in the same league as the original, but it's a good enough film in its own right, and at least worth a rental.","user":"craigjclark","rank":[21,23]},{"title":"Not bad","rating":7,"date":"30 December 2005","review":"This prequel to the legendary Butch Cassidy and the Sundance Kid starring Paul Newman and Robert Redford is not nearly as good but that doesn't make it bad either. If you're going to compare these two, this one is only going to suffer. But if you look at it on it's own terms you'll find there's plenty to enjoy here.<br><br>Tom Berenger and William Katt step into these legendary roles as Butch and Sundance and they do remarkably well. Director Lester focuses mainly on the comedic aspects of their relationships and at times the film is quite hilarious in depicting their early years as thieves who work their way up to become train robbers. In the final third the movie goes into serious and dramatic territory which isn't all that interesting nor enjoyable, but it does enhance the characters and give them more of a plight. But it picks up for a grand finale where the pair rob their first train.<br><br>With good supporting actors like Brian Dennehy, Christopher Lloyd and Peter Weller on board, Butch and Sundance; The Early Days is a film that should easily entertain most western fans and even admirers of the legendary \"sequel\" if viewers are willing to accept it on it's own terms.","user":"ODDBear","rank":[16,17]},{"title":"\"You don't just go and rob a train, it takes practice.\"","rating":7,"date":"16 August 2007","review":"This film has taken a lot of heat for it's role as a prequel to the Paul Newman/Robert Redford classic, but I think if you give it a chance it stands on it's own legs fairly well. The uncanny part of the picture is the remarkable resemblance (most of the time) that Tom Berenger and William Katt have to the stars of the 1969 original. While some of the banter between the two might seem awkward at times, it has the feel of two future buddies getting to know and trust each other and therefore appears more realistic than forced. The nods to the original are apparent without being over done, and it's cool to see Jeff Corey reprise his role as Sheriff Ray Bledsoe, even if he looks older here. Future relationships with characters Harvey Logan and Joe Le Fors are also introduced, creating just enough interest for fans of \"Butch Cassidy and The Sundance Kid\" to keep tuned in to see what happens next. My viewing of the film last night was the first, having over the years shied away from it because of my fondness for the original, but you know what - it was entertaining and one could definitely do worse. I'd recommend a look, even if it's only effect is to make you appreciate the original even more.","user":"classicsoncall","rank":[10,11]}]