[{"title":"A Deranged (Yet Inept) Classic of Its Kind","rating":7,"date":"4 July 2012","review":"I'd wanted to see Nightmare for years, especially as a young Savini fan, but ensuing controversies and time prevented me from watching it until tonight. Sure, I'd come across it from time to time in a reference or review book but tracking down a copy in the US seemed to never work out for me. Cut to a sick-day in 2012, and internet movies, and finally, this grim little darling was mine for the watching.<br><br>Tonally, I found Nightmare similar to Pieces, what with it's childhood traumas and bloody ways of dealing with them, but Nightmare has a certain raw charm all of its own. It's not a very *good* movie, but it moves along at a decent pace and is just so bizarre in its execution. Our killer, George Tatum, is one of the more debonair axe-wielders of the slasher generation, but most of Baird Stafford's performance consists of squealing, foaming at the mouth, and giving Ken Doll-esque lingering looks at the camera whether he's killing or sleeping or walking about. George was being treated for his myriad mental issues under an experimental program and when he's deemed cured, he's simply let loose in NYC (delightfully grimy, pre-Giuliani NYC) to go to sex shows (bad idea!) and then head south to kill a very special family. Said family seemed over the top, what with constant prankster/brat CJ and constantly screaming and slapping mom Susan...until I realized I'd seen similar behavior at the local Wal-Mart on more than one occasion.<br><br>That odd behavior by the \"normal\" cast members is one of the more delightful things about Nightmare. Very few things happen in a way that they would happen in real life. People over-react to nothing, but are yet strangely unmoved by dead bodies. Children are taken to crime scenes and questioned in front of bloody corpses. There's rarely a clear sense of who any character is at any given time. The doctors never bothered to investigate whether George's traumatic dreams actually happened. Mom often just shrieks for no reason. There's an extended scene of a meeting with the real estate agent, and a C&amp;W bar performance, and lots of local radio DJ chatter. It all just lurches along until a rather ludicrous (but fun!) ending.<br><br>The gore (by all accounts courtesy of Ed French and NOT Savini) was nice and grim and well done for the most part (not counting a few obvious prosthetics) - rarely these days does soft tissue trauma seem so gooshy. The gore wasn't as wall-to-wall as I'd built up in my head but I suppose there was enough.<br><br>If you're in the mood to revisit the early 80s via slasher films, you'll probably have a good time with Nightmare as long as you can handle the inherent strangeness of it all. It really is like a bleak little time capsule of an era long-gone.<br><br>ff","user":"FilmFatale","rank":[14,14]},{"title":"Regarding George Tatum's medications","rating":15,"date":"15 January 2009","review":"The medications prescribed to George are obviously important to him, as witness the two times he fumbles for and drops them during moments of stress. They are presumed, in all of the reviews I have read, to have been meant to cure his psychosis. Perhaps another view might be offered, one which takes into account the year in which the shoot took place (1980). This was shortly after the revelation in the United States that the CIA had, during previous decades, \"tested\" lysergic acid diethylamide (more commonly known by its acronym, LSD, or its nickname, \"acid\") and other chemical compounds reputed or designed to induce hallucinogenic states on unsuspecting individuals including mental patients. The question to which I played the role of George was, \"Are his medications the cure for - or the cause of - his homicidal mania?\" This ambiguity was suggested by Romano before the shooting even started, while he and I discussed the character as presented in the screenplay, and caught my imagination so powerfully that I tried very hard to embody it in my portrayal.<br><br>In my opinion, the ambiguity was reinforced by the desperation with which the doctor's apparent superior pushed him to \"recover\" George. Nowhere in the dialogue is the suggestion made that the cigar-smoking creep who called the doctor on the carpet had any connection with the hospital, much less that he was a medical person.<br><br>Just something to think about, since it would appear that the film developed its cult following whether or not the ambiguous nature of the chemicals was apparent.","user":"baird-12","rank":[15,16]},{"title":"Very, very, very grim grind-house slasher flick","rating":8,"date":"6 November 2007","review":"OK i'm a little rusty right now when it comes to reviews as I haven't written one in years.<br><br>I won't bother explaining the plot, courtesy of the IMDb plot profile and other users you should be able to get a rough idea about it yourself.<br><br>So lets get down to the nitty gritty. Nightmare(s) (in a damaged brain) is kind of like the horror film you watch through the eyes of a child. Remember when you were a kid and horrors weren't so much entertaining as they were (mildly) traumatising? That would give you sleepless nights for quite some time? Well nightmare is one of those films that can have that effect on you AS AN ADULT.<br><br>Imagine the original 'texas chain saw massacre' but a lot more psychological and involving children, and A lot more gore, and you get the rough idea of what this film is all about.<br><br>Now I'm a big fan of horror, I can sit through (almost) anything but I've seen this film one and a half times (the uncut version) and have had it for quite some time. And thats NOT because the film is bad, its cause its so frigging' creepy. First time was a curiosity as I'd heard so much about it and was desperate to see why it had been banned, the second (half) time was because I hadn't seen it in a while and fancied giving it a second go. I couldn't do it! It really is one of those type of horrors thats hard to sit through, its tone is so sinister and you feel almost perverted and sick and evil for just watching it, even though there are no real animal killings or anything like cannibal holocaust/ferox and it's only a movie and nothing more.<br><br>Anyways, if you like genuine, creepy, under the skin horror then this one is for you. If, however, your not a fan of the whole 'grind-house' scene, don't like films with low production values and risible acting and prefer your horror to be modern, over produced and polished, then avoid this one.<br><br>In either case its very underrated as being 'one of the scariest horror films of all time'.","user":"Yoooooofffff","rank":[30,36]}]