[{"title":"Wonderful slice of Americana-Nothing more, nothing less!","rating":10,"date":"10 April 2003","review":"A wonderful look at an America we will never see again-tuneful, romantic and a Happy Ending! State Fair never claims to be the end all and be all, just a sweet look at the tradition of the State Fair put to music.  This movie (and the ensuing Broadway Musical) stand on their own next to Oklahoma, Carousel, South Pacific, King and I, Sound of Music, etc.<br><br>Jeanie Crain and Dana Andrews play their scenes so effortlessly, you forget its just a 3 day romance.  Dick Haymes and the eternal Vivian Blaine have a chemistry that works much better then the Pat Boone version.<br><br>I recommend this movie to anyone who wants a break from the tired old action/violence/cheesy comedies of today-it's as much an image of summer as cotton candy and candy apples!","user":"JTBWRITER","rank":[31,32]},{"title":"A lovely film","rating":10,"date":"21 June 2005","review":"I first saw this film in 1945, when I was completing 5 years in the Royal Navy. I was stationed in Kure , Japan, (5 miles from Hiroshima). We were the first British naval personnel to land in the area after the end of WW2, and services and accommodation were very primitive. When things started improving, we got our first film, \"State Fair\" with the gorgeous Jeanne Crain 'singing the Oscar winning song \"It might as well be spring\" The wonderful Rodgers and Hammerstein also provides opportunities for Dick Haymes and Vivian Blaine to exercise their tonsils.This happy film never flags; if its the mincemeat or Hampshire Boar competitions, the family have a ball.Look out for a wonderful cameo performance from Donald Meek as the aforementioned @mincemeat' judge. I have watched this film at least a dozen times, the last time last week on DVD and it never bores.","user":"albirmike","rank":[31,33]},{"title":"It's A Grand Film For Viewing","rating":9,"date":"26 April 2007","review":"I've no doubt that on the strength of the blockbuster hit that Richard Rodgers&amp;Oscar Hammerstein had with Oklahoma which was still running on Broadway as this film was being made, that Darryl F. Zanuck offered the team the chance to contribute the songs for a remake of State Fair. Oklahoma in fact was a rural setting and so was Iowa for this second telling of the adventures of the Frake family at the Iowa State Fair.<br><br>What today's audiences don't appreciate was that in 1946 the Iowa state centennial was being celebrated. Some bright individual at 20th Century Fox must have realized that and a nice musical technicolor remake of the Will Rogers classic State Fair would be a can't miss at the box office. Providing of course Mr. Zanuck could assemble the talent.<br><br>Though the 1933 cast boasted people like Louise Dresser, Lew Ayres, and Janet Gaynor in support of Will Rogers, the accent there was very much on Rogers as it was HIS picture. Here the accent is on the younger generation. Charles Winninger and Fay Bainter play the older Frakes taking their prize hog, Bainter's mince pie, and children Dick Haymes and Jeanne Crain to the Iowa State Fair. Haymes and Crain, together with Dana Andrews and Vivian Blaine as the respective romantic partners carry the film here.<br><br>Rodgers and Hammerstein had a lot on their plate back in the day. Besides Oklahoma, Hammerstein was involved in creating a musical version of Bizet's Carmen which became Carmen Jones as we all know. He and Rodgers had another musical open in 1945 that was Carousel and became another American classic. When 20th Century Fox signed them for State Fair, according to a recent biography of Dick Rodgers, they never went west. Rodgers did his music from his estate in Connecticut and Hammerstein wrote the lyrics from his Doylestown, Pennsylvania farm. I guess they met in New York and express mailed the songs to Zanuck in Hollywood.<br><br>They put together a real nice score, one song It Might As Well Be Spring won the Oscar for Best Original Song from a film. The rest of the score ain't too shabby either with Isn't It Kind of Fun and That's For Me also sung beautifully. My favorite however is It's a Grand Night for Singing, a song so absolutely infectious you will be singing it yourself for days after watching State Fair.<br><br>Andrews and Crain were dubbed by other singers, but Dick Haymes and Vivian Blaine were seasoned musical performers. Haymes recorded all four of the songs above in an album for Decca that sold very well. Haymes had a smooth, but strong baritone and if scandal hadn't blown his career up a few years later, who knows to what heights he might have risen.<br><br>Every version of State Fair has something to recommend it. There was even a pilot done in the middle Seventies for a television series based on the time honored Frake family saga. For me however this one cops the prize.","user":"bkoganbing","rank":[14,14]}]