[{"title":"A serviceable conclusion to the \"original trilogy\"","rating":4,"date":"2 July 2015","review":"No matter how many sequels, reboots, spinoffs, or rehashes The Texas Chainsaw gets, none will compare to the original. That's a given. But there are some installments in Leatherface's interesting journey throughout the decades that are solid enjoyable movies on their own, such as the 2003 remake and this one. Here I feel like the campiness of TCM2 met the thrills of the original TCM in a healthy middle ground. There are some ridiculous one-liners, but they're placed fittingly unlike the second movie where the comedy felt forced and sloppy. The acting in the movie is above average too, with your standard \"now famous but previously in a crappy horror sequel\" actor to boot. <br><br>The main reason this is better than its predecessor is because it actually has suspense; not a lot of it but it's there. The creepy moments somewhat resemble scenes from the original but none of it feels rehashed. There are characters you can root for, and Leatherface is actually (kind of) scary again. There's also a satisfying climax, fit with heavy metal and cheesy lines that belong in a Marlon Wayans movie. It's just a fun popcorn horror movie with some gore, a couple thrills, and a decent amount of laughs. All in all, a movie is meant to entertain, and for the most part, Texas Chainsaw Massacre III did exactly that. Worth a watch for hardcore slasher fans.","user":"lnvicta","rank":[38,44]},{"title":"\"The trap is sprung now!\"","rating":7,"date":"5 August 2013","review":"Review based on the unrated version.<br><br>A college-aged couple, delivery driving a car from California to Florida, are sidetracked by a police investigation of a body pit found at a construction site in the Texas countryside. (Camera flashes, illuminating the corpses (in the unedited version, anyway) are a good reference to the first film) The next day, the couple have a bizarre experience with a psycho hick apparently killing a cowboy at a small gas station. While trying to get away and find help, they're detoured onto a side road ... and that's when the real fun begins.<br><br>An over-sized truck begins stalking them, then throws a dead animal at them. In the excitement, they drive off the road and puncture a tire. While changing the tire, a hulk with a chainsaw attacks them. Narrowly escaping him, they only end up nearly in a head-on collision with a weekend warrior.<br><br>The three of them eventually team up; the couple are just trying to live through the night, but the weekend warrior wants to go after our new friend with the chainsaw.<br><br>This has dialogue far superior to the original, and isn't as silly and over-the-top as the underrated Texas Chainsaw Massacre 2. It's graphic, but it uses its gore and bloodshed almost as part of telling the story, as well as referencing the original Texas Chain Saw Massacre (through camera angles, props, and bits of dialogue) without going so far as to rip off that film. The music score was surprisingly effective, and did not distract from the movie itself.<br><br>David Schow did a great job with this screenplay, for the most part, but film falls into the \"undying killer\" mode in its repetitive final third, where seemingly every character (Tex, Alfredo, Leatherface, Benny) returns from the dead for one last encore performance.<br><br>Unfortunately, the theatrical version of the movie was seemingly edited with a chainsaw, and released in a horribly truncated version, missing several minutes of footage and rendering much of the plot incoherent. Thankfully the unedited/ unrated version has been released on DVD.","user":"Zbigniew_Krycsiwiki","rank":[11,12]},{"title":"\"Time for dinner! \"","rating":31,"date":"31 January 2002","review":"Leatherface had the greatest trailer of all time (Leatherface meets the Lady of the Lake, remember that?). Maybe that's why nearly everyone was let down by the film itself. Most people view Leatherface as an unwelcome addition to the legacy that is the Texas Chainsaw Massacre. No, it's not as good as the original or the sequel, but what do you expect when Tobe Hooper's not on board? However, if you do not compare it to its predecessors, it stands alone as a fun flick. It's at least watchable (unlike the Matthew McConaughey \"remake\"). The only thing I really don't like about it is the lack of continuity. The David Schow script is great, it just leaves out some needed information. In essence, this is the first in a long line of remakes. The director, Jeff Burr, does succeed in creating tension. My heart still pounds every time when they stop to fix that flat tire. Those far-off squeaking sounds are unnerving. The cast does well also. No one has the energy of Bill Moseley (Chop Top from TCM 2), but he's a tough act to follow. What they do have is horror favorite Ken Foree. Foree is always great. I don't care whether he's in Dawn of the Dead or The Phantom of the Mall, he's great. And you must give credit to Viggo Mortensen. He's come a long way from b horror to star in the Lord of the Rings. When it comes down to it, TCM 3 is worthy of a bit more praise.","user":"Backlash007","rank":[22,27]}]