[{"title":"A Misfire But An Interesting One","rating":27,"date":"27 December 2017","review":"Nightkill (1980) <br><br>** (out of 4)<br><br>Katherine Atwell (Jaclyn Smith) watches her lover kill her rather mean-spirited and cruel husband (Mike Connors) right in front of her. The lover promises her everything will be fine but the next day she finds his dead body. Before long people start wondering where the husband is and that's when Detective Donner (Robert Mitchum) starts to ask questions. Soon the wife begins to crack as she feels there's something more sinister going on.<br><br>Ted Post's NIGHTKILL is a rather interesting German picture that was meant to be a huge theatrical release but it ended up showing on television before eventually making it to video. This is without question one of the strangest films from this era because in all honesty it's pretty poorly made and there are countless flaws throughout. With that said, at the core there's a good movie somewhere in all of the mess and one can't help but think that a more polished script and some better direction could have made something special here.<br><br>When this film eventually got released it was passed off as a horror film but that's certainly not the case. It's basically a murder-mystery that looks and feels like a watered down made-for-television film. It's really too bad that Post didn't try to add more style or flair to the picture because it could have been so much better. The problem is that the film was shot rather ugly and there's just no style or energy to be found. Considering what Brian DePalma and others were doing with this type of film around this era it's easy to see why this thing just never took off.<br><br>Another problem is that the lead character, the wife, is just downright stupid. Her situation could have been avoided countless times yet her character just keeps making one dumb decision after another. For the most part Smith turns in a good performance but she certainly can't save the picture. Connors and James Franciscus are good as are Fritz Weaver and Sybil Danning. As far as Mitchum goes, he's certainly offered a good role here and he does a nice job with it. We've seen him play the Detective countless times throughout his career so he certainly knows how to play it.<br><br>NIGHTKILL has some good sequences throughout it including a car chase where the woman believes her dead husband is coming after her. The ending was also well done and it ends the film on a high note. Still, there are just way too many flat moments here to make it a complete success but the film is an interesting misfire.","user":"Michael_Elliott","rank":[11,11]},{"title":"Nightkill: Meh thriller","rating":4,"date":"23 October 2018","review":"Nightkill is a thriller starring the late great industry veteran Robert Mitchum, but it certainly isn't among his best work.<br><br>It tells the story of a woman who witnesses her new lover murder her abusive husband and the chain of events that follow. With her lover now missing and the police closing in what does she do next?<br><br>Lead by Jaclyn Smith this thriller never really gets going and the twist was more than expected. Though the finale is less predictible and quite enjoyable the rest of the movie is highly generic stuff.<br><br>It's certainly not terrible, but it's underwhelming stuff that you'll have seen plenty of times before. Even Mitchum seems bored.<br><br>The Good:<br><br>Robert Mitchum<br><br>The Bad:<br><br>Highly generic<br><br>Things I Learnt From This Movie:<br><br>White wine is for meatballs and cooking<br><br>In the 1980's no money was required to get yourself a plane seat reserved<br><br>Police officers use racial slurs casually","user":"Platypuschow","rank":[16,17]},{"title":"A lot better than the rating suggests.","rating":7,"date":"25 April 2004","review":"Katherine Atwell (Jaclyn Smith), the wife of a wealthy businessman, unwittingly finds herself embroiled in a sinister murder plot when her lover decides to murder her husband and steal his money so that the two may elope together. <br><br>Ted Post directs this Hitchcock-style horror/thriller about murder and deception and one has to say that he does a very good job in doing so. Post takes a screenplay based on a story by the relatively unknown John Case and turns it into an intricate and generally compelling ninety minute piece of criminally underrated cinema. Although Post obviously lacks the directorial flair of his inspirers Hitchcock and Argento (there are a couple of instances where light is used in a similar fashion to Argento as well as some Argento-style trickery), one cannot really fault his execution of the work and instead has to admire the way that he turned such a low-budget into a thrill fest of suspense and intrigue. The subtle blending of the foreboding orchestral soundtrack with the continuing tension Post is able to create through some rather adept use of lighting and slow-yet-adequate pacing is probably the main reason that this movie is able to succeed and become quite a shining of example of great, low-budget cinema.<br><br>\nJaclyn Smith, from the TV series Charlie's Angels', is exceptional in her role as a woman pushed to the brink of madness following a series of bizarre and inexplicable happenings  as if being an unplanned accessory to the murder of her husband wasn't enough! Smith's performance is all the more credible due to the whole array of emotions her character is forced to portray. Despite Smith's character being a wrong-doer, it becomes quite easy to sympathise with her plight and understand her actions. Robert Mitchum takes the main role of the supporting cast as Lt. Donner and just adds to the credible acting performances that help to make Nightkill' what it is. Unfortunately, the rest of the supporting cast were not exactly up to par except for a somewhat brief performance by the near-legendary B-movie actress Sybil Danning. <br><br>Nightkill' is a movie built on suspense, fortified by extraordinary acting performances (for a movie of this type) and cemented with a truly remarkable and haunting finale. Those who appreciate thrillers such as those by Hitchcock and Argento should find something enjoyable in this film as well. Certainly not for those who have had their attention spans stolen by MTV, but for those who appreciate subtle, slow and suspenseful thrillers. Yes, there are problems such as a rather unnecessary piece of character interaction towards the end, a brief decline in quality during the middle of the film and the obvious limitations of the budget. The final twist is also a little clichéd and does become a little obvious but not really enough to take away from one's enjoyment. Nightkill' is still a very accomplished film and one that psychological thriller fans should find quite enjoyable. My rating for Nightkill'  7/10.","user":"Snake-666","rank":[15,27]}]