[{"title":"Worthy noir entry","rating":6,"date":"25 April 2007","review":"Lee J. Cobb and John Dall give nice performances in this medium-slow paced noir thriller. It is also nice to see a 20 year-old and lovely Lisa Howard in a supporting role as Dall's new wife (famous for her news coverage of Kennedy and Castro in the early 1960s, and her subsequent suicide/overdose at the age of 35). <br><br>Contrary to popular opinion, I believe that Jane Wyatt did a fine job of playing the femme fatale. Her role is a bit different from the standard noir FF, and Wyatt is a bit strange as well. Wyatt's Lois Frazier is a rich, beautiful, seemingly naive and nervous woman suffering through an abominable marriage. Senior Police Lieutenant Cullen (Cobb) is having an affair with her.<br><br>Lois' husband has just left on a suspicious business trip, when Lois discovers he has purchased a gun. She believes that her husband plans on killing her. Eventually, he returns to their house and sneaks in through a door connected to his study. His wife shoots him twice at close range in the chest. Cullen, knowing that the husband had an airline ticket for that night (his planned alibi) dumps the body off at the airport. This is the basic premise. What follows is an edgy, tense and nicely photographed story, as Cullen's younger brother (Dall) - a smart fledgling detective - begins to unravel the plot.<br><br>The chase scene offers some really nice noir cinematography, and interesting sets. The soundtrack is also fairly good and the editing and directing are fine (though the edition I saw did have a few missing frames and other problems. The plot offers some interesting convolutions, but also mixes these with clichés.<br><br>All considered - a good film for noir fans.","user":"mstomaso","rank":[33,34]},{"title":"True Fast Noir: \"Yes, for one thing, a dame.\"","rating":8,"date":"2 July 2009","review":"The Man Who Cheated Himself (1950)<br><br>\"Yes, for one thing, a dame.\"<br><br>A fast, curious, edgy crime film that depends on a fabulous, simple twist, which you learn right at the start and keeps you on the edge of your seat the whole time. The clash of two cops who are brothers begins innocently, and turns and builds in a very believable way, as the details of a murder are revealed. By the end, with a fabulous scene below the Golden Gate Bridge, it's a chase scene of pure suspense.<br><br>Lee J. Cobb (more usually a brilliant secondary character) takes the lead as a cop who does his job with steady weariness, and yet when faced with a woman he loves too much, puts everything in danger. He's just perfect in his role, right to the last scene when you see him look down the hall with the same feeling he has at the beginning of the film. His kid brother played by the slightly quirky John Dall (\"Gun Crazy\") is all virtue, almost to the point of sweet sadness. And the two main women play believable supporting roles (especially Cobb's love-interest, who is selfish and panicky to just the right degree). <br><br>This Jack M. Warner production was released by Fox but by the looks of it, it can't be quite a full budget feature movie, and because of that it is relentless and edgy, with no time for polish or emotional depth. Cameraman Russell Harlan (\"Blackboard Jungle\" and much later \"To Kill a Mockingbird\") does a brilliant job with great angles and framing. It isn't elegant, but it's visually sharp. Throw in a talented but little known director, Felix Feist, and some top shelf editing (by David Weisbart, one of absolute best) and you have just the mix you need for a small film much larger than life.<br><br>This is a film noir in the usual sense of style, but also in substance--a lead male who is alienated and casting about for meaning in life, and a lead female who leads him astray.<br><br>But in the end, what's it about? Crime? No. Love? Yes. The only subject that matters.<br><br>Cobb: \"Do you think I'd throw that away on a sucker play like this?\"<br><br>Dall: \"Yes, for one thing, a dame.\"","user":"secondtake","rank":[30,32]},{"title":"Jack Junior Makes His Mark!","rating":8,"date":"18 August 2008","review":"Two of my favorite writers, Seton I. Miller and Philip MacDonald, worked up this somewhat familiar plot (husband tries to murder rich wife and make it look like a burglary but he gets killed instead) into a moderately suspenseful police thriller, which maintains interest with a few clever plot twists and a thrilling bit of action across downtown San Francisco roof-tops, before coming to a really grand climax at the marvelously spooky Fort Point, followed by a winningly ironic conclusion (which surprisingly got past the censors back in 1950).<br><br>Cobb astutely underplays the lead role of the seasoned, crime-weary detective. Jane Wyatt's heroine-in-distress commendably follows Cobb's lead, leaving all the histrionics to the second-string team of John Dall and Lisa Howard. Despite Dall's efforts, however, it's Alan Wells as murderous punk who easily walks away with the movie's acting honors.<br><br>Felix Feist has handled all the action with his customary competence, and other credits are equally serviceable.<br><br>When this film was originally released much was made of the remarkable fact that it was produced by Jack Warner, Jr, the son of Warner Bros mogul, Jack L. Warner. Jack Jr made three movies: The Admiral Was a Lady (executive producer), then this one, and finally Brushfire (1962) which he also wrote and directed. Oddly, none of these movies were distributed by Warner Bros, though Jack, Jr, worked for some time as an executive in the Warner TV division.","user":"JohnHowardReid","rank":[13,13]}]