[{"title":"Hard to Watch at Times, But a Very Good Film.","rating":3,"date":"3 July 2002","review":"The true story of Rocky Dennis (Eric Stoltz) is the subject of this heart-breaking film that pulls absolutely no punches. The youngster was born with a disease that caused his face to be terribly deformed, making it appear that he had a mask on. Cher is excellent as Stoltz's drug-addicted mother who is so good with him, but so poor with most everyone else. Sam Elliott also leaves a lasting impression as a biker who is much gentler than he appears. An amazing screenplay and the flawless direction of Peter Bogdanovich help to make \"Mask\" one of the best films of the 1980s. Terribly over-looked. 4.5 out of 5 stars.","user":"tfrizzell","rank":[71,73]},{"title":"A triumph in storytelling.","rating":9,"date":"19 February 2005","review":"Definitely one of the best films made in 1985; Peter Bogdanovich's \"Mask\" is an engrossing character study on the life of Rocky Dennis, and the somewhat tumultuous but always loving relationship he shared with his mom Rusty. Tragic, touching, inspirational  the movie succeeds in proving the importance of maintaining a positive attitude despite life's adversities. Bogdanovich masterfully draws stunning performances from all of the principle players. With several noteworthy scenes throughout the film where Cher shines, it's no surprise she won the best actress trophy at Cannes for her role as Rusty; effectively depicting a loving mother who is incredibly strong willed, yet also lost and vulnerable. No other actress would have made the portrayal so gut wrenchingly real  it's a shame she wasn't awarded the Oscar as well. Eric Stoltz, Sam Elliott, and Laura Dern are also magnificent. The incredible acting by everyone involved really makes this film such a rewarding and worthwhile experience, with the viewer being taken on an intimate journey through the lives of every day people facing extraordinary circumstances. If possible, see the original version with the Bob Seger soundtrack  the re-release DVD contains only the Springsteen soundtrack; which one would have expected a Director's Cut edition to have both choices. Having seen the original so many times, I opted to hunt down the now out-of-print original theatrical release by Image Entertainment for my collection. Not to be missed by anyone with an interest in true life stories. Highly recommended  a 9/10.","user":"Vancity_Film_Fanatic","rank":[50,51]},{"title":"Cher in a wonderful performance","rating":10,"date":"7 December 2000","review":"Eric Stoltz plays Rocky Dennis, a teen afflicted with a horribly disfiguring disease. He lives with his mom, Rusty (Cher), a sometime junkie who pals around with a gang of bikers.<br><br>Between coping with his mom's antics, dealing with the prejudice he encounters and the debilitating migraines he suffers from, Rocky still manages to win over his teachers and classmates, becoming an inspiration to them.<br><br>While the story initially seems to be about Rocky, it's also about Rusty. She wants everyone to see her as the tough biker chick who can handle anyone and anything that comes her way, including Rocky's disease and the strangers who stare. This is her mask. She's really scared to death for Rocky and turns to the alcohol and drugs to help her cope.<br><br>A great film based on a true story, Mask will convince you that sometimes the most unlikely people become heroes.","user":"dukestwinpack","rank":[40,42]}]