[{"title":"Something Oddly Moving","rating":8,"date":"19 August 1998","review":"An offbeat, oddly moving film in which Carroll Baker plays a young victim of rape. Although the crime goes unnamed in this 1961 movie, the pain and anguish suffered by Baker's character, Mary Ann, are candidly as well as sensitively handled. And while the film can only hint at Mary Ann's thoughts (unlike the book on which it was based), Baker gives a touching performance as the victim who tries to deny the crime by erasing all physical traces of it, and then seeking to lose herself in the jungle of New York City, only to find herself trapped in the apartment of a supposed Good Samaritan played by Ralph Meeker. The film's second half is weakened by the sketchiness of the characters' motivations, but the actors help to fill in the gaps. Legendary American composer Aaron Copland has added a grand (perhaps too grand) musical score; Eugen Schüfftan's crisp black &amp; white cinematography and the extensive use of New York City locations add to this drama. Directed by Jack Garfein (Baker's then-husband), who co-wrote the script with Alex Karmel, author of the 1958 novel \"Mary Ann.\"","user":"genekim","rank":[50,54]},{"title":"I can't get this film out of my mind.","rating":4,"date":"4 February 2003","review":"Believe it or not, my mother took me to the drive in to see this movie with her in the early 60's.  At the time the drive-in was the place to go to cool off during family arguments or in times of extreme boredom. I was only about 10 at the time, but now 40 years later I still remember this film, and researched IMDB to find it again.  I have not seen a recent copy, and understand that it is not available for purchase, but I think it would be a fine addition to classic black and white film history, so I hope it is re-released on video or DVD. Even as a young girl I was haunted by Carole Baker's character, not understanding exactly what had happened to her, but realizing that the love she developed with Ralph Meeker was somehow sad, but sweet and deeply emotional at the same time.  I remember how desolate the character of Ralph Meeker was, and his apartment reflected this barren soul. They were two people who hurt desperately, and could only relieve their pain by coming together and sharing their emotionally tortured souls.  I recommend you watch this movie if you get a chance.","user":"junekat","rank":[55,61]},{"title":"Wild emotions in quiet, beguiling art film","rating":6,"date":"18 January 2001","review":"Student traumatized by a rape is saved from suicide by a lonely mechanic, who feels she may be his last chance for happiness. Beguiling art film missed cult status by that much. Director Jack Garfien, who also co-wrote the screenplay with Alex Karmel from Karmel's novel \"Mary Ann\", and his wife, actress Carroll Baker, put everything on the line for this production, but it didn't connect with audiences at the time. It looks good today, however, and has an unusual, unnerving, voyeuristic quality. Baker and Ralph Meeker have intriguing chemistry, though the premise--that the mechanic keeps the girl like a wounded pet in his little hovel--is often creepy instead of romantic (although I'm not sure of the actual intention here). Incredible jazz score by Aaron Copland; striking black-and-white cinematography from Eugen Shuftan. A mixed bag, mostly effective. **1/2 from ****","user":"moonspinner55","rank":[48,53]}]