[{"title":"A Little Head, Any One?","rating":7,"date":"11 June 2007","review":"THE BRAIN THAT WOULDN'T DIE was considered so distasteful in 1959 that several cuts and the passage of three years was required before it was released in 1962. Today it is difficult to imagine how anyone could have taken the thing seriously even in 1959; the thing is both lurid and lewd, but it is also incredibly ludicrous in a profoundly bumptious sort of way.<br><br>The story, of course, concerns a doctor who is an eager experimenter in transplanting limbs--and when his girl friend is killed in a car crash he rushes her head to his secret lab. With the aid of a few telephone cords, a couple of clamps, and what looks very like a shallow baking pan, he brings her head back to life. But is she grateful? Not hardly. In fact, she seems mightily ticked off about the whole thing, particularly when it transpires that the doctor plans to attach her head to another body.<br><br>As it happens, the doctor is picky about this new body: he wants one built for speed, and he takes to cruising disconcerted women on city sidewalks, haunting strip joints, visiting body beautiful contests, and hunting down cheesecake models in search of endowments that will raise his eyebrow. But back at the lab, the head has developed a chemically-induced psychic link with another one of the doctor's experiments, this one so hideous that it is kept locked out of sight in a handy laboratory closet. Can they work together to get rid of the bitter and malicious lab assistance, wreck revenge upon the doctor, and save the woman whose body he hankers for? Could be! Leading man Jason Evers plays the roguish doctor as if he's been given a massive dose of Spanish fly; Virginia Leith, the unhappy head, screeches and cackles in spite of the fact that she has no lungs and maybe not even any vocal chords. Busty babes gyrate to incredibly tawdry music, actors make irrational character changes from line to line, the dialogue is even more nonsensical than the plot, and you'll need a calculator to add up the continuity goofs. On the whole THE BRAIN THAT WOULDN'T DIE comes off as even more unintentionally funny than an Ed Wood movie.<br><br>Director Joseph Green actually manages to keep the whole thing moving at pretty good clip, and looking at the film today it is easy to pick out scenes that influenced later directors, who no doubt saw the thing when they were young and impressionable and never quite got over it. The cuts made before the film went into release are forever lost, but the cuts made for television have been restored in the Alpha release, and while the film and sound quality aren't particularly great it's just as well to recall that they probably weren't all that good to begin with.<br><br>Now, this is one of those movies that you'll either find incredibly dull or wildly hilarious, depending on your point of view, so it is very hard to give a recommendation. But I'll say this: if your tastes run to the likes of Ed Wood or Russ Meyers, you need to snap this one up and now! Four stars for its cheesy-bizarreness alone! GFT, Amazon Reviewer","user":"gftbiloxi","rank":[47,49]},{"title":"Good, Old-fashioned Fun","rating":8,"date":"4 September 1999","review":"I had a heck of a good time viewing this picture, and was splendidly surprised at its more erudite features.  First off, the film is undeniably cheaply-made with its cardboard sets, limited settings, and creative scientific props.  The acting ranges from very poor(the two strippers), barely professional(Herb Evers as the leading man), gothic overstatement(Leslie Daniels as the assistant Kurt)to first-rate with Virginia Leith in the title role as the headless victim alive against her will for the benefit of science and her fiancee's lustful passions.  The scripting though is very good and the dialogue is fantastic for a movie of this ilk.  Issues abound about what role science and medicine have in our lives and what their boundaries should be.  This film is a thinking film in many ways.  However, don't be too fooled by its real intent.  It is a sleazy story about a man obsessed with his aptitude in medical science who wishes to fuse together his dead girlfriend's head with the perfect body, thereby creating the perfect woman for a man with the best of both body and soul. One other very bright aspect of the film is the sax music which resonates strongly every time the doctor scours town for female beauties.","user":"BaronBl00d","rank":[30,33]},{"title":"Works for sheer audacity, shameless conviction of its aims.","rating":6,"date":"12 July 2004","review":"For what this is (a rather over-heated horror sci-fi stew), it works for its sheer audacity and shameless full-bore conviction of its aims. Mad scientist movies end up resorting to long shots of people in white lab coats talking in sterile sets. But this one has a woman's head in the tray, fighting with the doctor, yelling at the monster in the closet, and engaging the assistant in metaphysical questions usually not heard in such low-budget potboilers.<br><br>Nice dynamic that it's his fiancé that he wants to save...but she has become so bitter since becoming a disembodied head in a tray of water. I remember watching this for the first time on TV in the early 70s and being amazed they used to make movies like this.<br><br>Better than average camera work, also, trying to get a sense of vertigo and movement throughout. This film with its hell-bent-for-leather pace is a fever-dream that works because it doesn't let go, or tip you to the fact that the makers thought it was ridiculous as it certainly is. <br><br>Be sure to get the restored version with the monster in the closet finally grabbing the doctor's arm and making a bloody mess at the end. A great cathartic bloody end to this near Shakespearean morality play about how man should not meddle in god's business.","user":"roger-212","rank":[48,58]}]