[{"title":"Magical","rating":10,"date":"10 December 2003","review":"I have read that James Stewart considered Elwood P. Dowd his most personally significant role.  In a career that spanned decades and included such great works at It's a Wonderful Life and Mr. Smith Goes to Washington, choosing Harvey's friend, Elwood, as his personal favorite says something about rather powerful about Mr. Stewart and Mr. Dowd.<br><br>James Stewart was a down to earth, decent man whose personal life was as honorable as the lives of George Bailey and Jefferson Smith -  but he admired Elwood P. Dowd, an alcoholic dreamer with an invisible giant white rabbit as his best friend.  Not what you would expect of a man who piloted B-17's and led giant raids over Germany in WWII.<br><br>Elwood's attraction for us is perhaps what attracted him so much to James Stewart.  Elwood is happy with himself and his life and even more importantly, he makes others happy with their lives.  That is the great magic of Elwood and Harvey:  they make others happy and they bring peace and a measure of contentment to almost everyone who know them.<br><br>I have seen another version of Harvey with Art Carney and it was quite good, but lacked the sense of magic that is a benediction in this version of Harvey.  In the Carney version, you can see Harvey - he is a giant white rabbit - and seeing Harvey takes much of the magic away.  When you watch Jimmy Stewart, you never really know if Harvey is real or not.  You know that Elwood thinks he is real and you know that Elwood's family thinks Elwood is crazy.  After watching for a while, you don't really care if Harvey is real.  Elwood is real and it is his belief in Harvey and what Harvey represents to him that endows him with such sweet and gentle charm. Harvey is his rejection of the harshness and materialism of the world.<br><br>Harvey is a charming, magical masterpiece of kindness and goodness that somehow never becomes maudlin.  Elwood and Harvey do not feel sorry for themselves and they most certainly do not expect you to feel sorry for them either.  If anything, Elwood feels sorry for the rest of the world and he does not understand how everyone can't see as clearly as he does.  For in his world,  we are all brothers who should love as generously and kindly as Mr. Stewart's Elwood P. Dowd.","user":"carflo","rank":[173,189]},{"title":"Considered a classic with good reason","rating":10,"date":"21 March 2005","review":"For about the first thirty minutes, I was thinking of some way to politely inform those who recommended this film that it wasn't my cup of tea, but the more I stayed, the more captivated I became. Based on a stage play that opened six years earlier, Harvey, the 1950 film directed by Henry Koster, is a delight. If this Jimmy Stewart classic doesn't make you feel good, you must be related to Mr. Henry F. Potter of Bedford Falls. Harvey is a 6' 3'' Pooka who has befriended a certain Mr. Elwood P. Dowd and this causes all sorts of complications for those around him. In case you didn't know, in Celtic mythology a Pooka is a fearsome spirit that usually takes the form of a sleek dark horse that roams the countryside at night, creating harm and mischief. Well, Harvey is not like that at all.<br><br>In fact, Harvey is a very gentle spirit who is always helping people out and can make everybody around him feel relaxed and in a good mood. Now Dowd needs all the help he can get. He likes to take a nip once in a while and is always talking to that danged rabbit to the chagrin of his sister Veta Louise (Josephine Hull) whose social life takes a nosedive when brother Elwood is around. Elwood's shenanigans also interfere with her plans to marry off her daughter Myrtle Mae (Victoria Home). When Veta decides that she has had enough and tries to commit Elwood to a psychiatric institution, the tables are turned and she ends up being committed in a hilarious case of mistaken identity. When Elwood leaves the hospital after being released, the medical staff in the hospital (a bit eccentric themselves) realize their mistake and all try to find him.<br><br>The madcap beginning soon turns into a gentle and moving drama. Jimmy Stewart is flawless as the decent man who never loses his temper and always has a smile on his face, giving everyone his card and inviting strangers home for dinner. The supporting cast is top notch as well including the unpleasant Dr. Chumley (Cecil Kellaway), the egotistical psychiatrist Dr. Sanderson (Charles Drake), his love struck assistant Miss Kelley (Peggy Dow) and the overwrought orderly (Jesse White, later known as the Maytag repairman).<br><br>Eventually some that ridiculed Elwood and his rabbit privately admit that they could see Harvey themselves and by the end we are gradually convinced that the so-called normal people may be stranger than Mr. Dowd. Harvey is considered a classic and with good reason. It works because of its good-natured humor and its gentle slap at those who automatically condemn ideas that are outside socially acceptable norms without thinking for themselves.","user":"howard.schumann","rank":[129,145]},{"title":"\"Oh, so pleasant.\"","rating":10,"date":"15 March 2004","review":"\"Years ago, my mother used to say to me, she'd say: 'In this world, Elwood,' she always used to call me Elwood. 'In this world, Elwood, you must be oh, so smart or oh, so pleasant.' Well, for years I was smart. I recommend pleasant. And you can quote me.\" - Elwood P. Dowd (James Stewart)<br><br>And, though you suspect James Stewart was never anything less than thoroughly pleasant, that quote from this completely bewitching movie, sums up perfectly the career of James Stewart and this movie in particular. It is one of those rare, rare movies that, when one has watched it, makes you want to try harder to be a nicer, better person. I recommend 'pleasant,' also. And I recommend this movie.","user":"mrslimm","rank":[90,103]}]