[{"title":"Splendid African Adventure","rating":6,"date":"26 January 2010","review":"Fox's UNTAMED (1955) is a splendid romantic adventure story set in 1850's Africa. Beautifully photographed in Cinemascope and DeLuxe colour by Leo Tover it was nicely written for the screen by Talbot Jennings, Frank Fenton and Michael Blankfort and was based on the novel by Helga Moray. Tyrone Power was the star and once again was directed by his favourite director and friend Henry King. Co-starring, in the pivotal female lead, was the lovely Susan Hayward. And rounding out the fine cast was Richard Egan (never better), Agnes Moorhead, Brad Dexter, John Justin and Hope Emerson. Although he was the star in two Cinemascope productions for Columbia Pictures - \"The Long Grey Long\" (1955) and \"The Eddie Duchin Story\" (1956) UNTAMED was just one of only three Cinemascope pictures Tyrone Power would appear in for 20th Century Fox, his home studio for more than 15 years. The others being \"King Of The Khyber Rifles\" (1953)and \"The Sun Also Rises\" (1957). The latter being the only one to be released on DVD. Quite unbelievably neither \"Khyber\" nor UNTAMED have ever been issued in any format whatsoever! WHY?<br><br>Time and place is immediately established by Susan Hayward's voice-over at the opening of UNTAMED as she informs us \"This is County Limerick Ireland - the year is 1847\". Hayward is Katie O'Neill the spirited daughter of rich land owner and horse breeder Squire O'Neill (Henry O'Neill). A Boer leader Paul Von Riebeck (Power) arrives from South Africa to buy some horses and after Katie causes him to be unseated from his horse during a Fox hunt (\"I came to Ireland to buy horses - not to be killed by one\") the two fall in love. But love isn't strong enough to hold Von Riebeck in Ireland and as a Dutch Free State commander must return to Africa to build up his country. Heartbroken, Katie later marries neighbour Sean Kildare (John Justin) and the following year when the potato famine ravages and decimates Ireland Katie and her family, along with the thousands of Irish, emigrate to Africa to start a new life. After the movie's excellent set piece of a Zulu attack on their settler's wagon train in which Katie's husband is killed she meets up again with Von Riebeck and after many eventualities, including a well staged Bullwhip fight between Paul and rival Kurt (Richard Egan), Katie and Paul finally come together for a happy ending.<br><br>Complimenting the picture throughout is the lavish music score by the great Franz Waxman.There is a rich full orchestral romantic main theme heard first under the titles and given different treatments as the story demands. Also there is a ravishing love theme for the tender scenes with Katie and Paul. Augmented by biting brass figures the Zulu attack on the settler's wagons is scored for an array of African percussion instruments and is rousingly and dramatically rhythmic. Waxman's evocative music perfectly captures the movie's complex moods of adventure, love, pathos, bitterness and jealousy. Alongside \"Prince Valiant\" (1954) UNTAMED is Waxman's finest adventure score!<br><br>UNTAMED is a somewhat forgotten minor epic and is possibly so because of its unavailability on either disc or tape which is something of a shame on the part of Fox Home Entertainment. But for those who are familiar with it it remains a memorable, enjoyable and colourful Cinemascope romance with two great stars in a picture that should be appreciated more and better known than it is.","user":"jpdoherty","rank":[16,17]},{"title":"Taming the Veldt","rating":6,"date":"23 December 2005","review":"With the end of the South African apartheid government and the events leading to that end of the past 50 years or so, Untamed was consigned to the 20th Century Fox vaults and has rarely been seen for a generation. Not that it was anything all that great to begin with.<br><br>Taken on its own terms and divorced from racial politics, Untamed is a sprawling Edna Ferber like saga of the founding of the Orange Free State and the journey of that group of Dutch settlers called Voortrekkers that made it happen. Tyrone Power is the leader of this group who has dreams of an empire. Dreams so big that Susan Hayward and their romance come in a definite second.<br><br>Power meets Hayward in Ireland where he's come to buy horses and the sparks fly at first sight. But he returns to South Africa and Susan marries good old reliable John Justin.<br><br>Later after the potato famine hits Ireland, the great Irish diaspora occurs and the Irish scatter throughout the globe. John and Susan go to South Africa and Sue not only meets Power again, but she also comes under the lustful eye of Richard Egan. Justin is killed, Sue wants Ty, Richard wants Sue, but Sue can't see him for beans.<br><br>I get the impression that there is a lot more to the original novel than what is shown here, but the story is poorly adapted. Using the comparison to Ferber, Richard Egan plays the Jett Rink part here. It's as though Jett Rink was crushing out on Scarlett O'Hara. Maybe they should have gotten Edna Ferber herself to adapt this work by another author, Helga Moray.<br><br>The action sequences are done well however. The Zulu attack on the laager is as well staged as in any John Ford western and the final battle between Power's commandos and Egan's outlaws is also exciting.<br><br>By the way the word laager is the South African term they gave for the circle of wagons that the voortrekkers made when camping for the night. We've seen many a western where they circled the wagons, but in South Africa they had a name for it. Voortrekker is the name of the Dutch pioneers who made the journey.<br><br>If you are a fan of the two leads as I am, make every effort to catch Untamed in the infrequent times it is shown.","user":"bkoganbing","rank":[15,17]},{"title":"Familiar ingredients with a new and unusual locale...","rating":4,"date":"24 June 2010","review":"Farmers throughout Europe, unsuccessful with their returns, journey to South Africa to take advantage of the free and fertile land, but must pass through hostile Zulu territory first. The wagon train sequence will be familiar to any western fan: it's the Settlers versus the Indians all over again, with the Zulu tribe on the attack and out for blood (we don't even know why they are so hungry for war). Susan Hayward plays a farmer's wife from Ireland who ends up widowed and caught between two men who desire her, Tyrone Power's leader of the Boer Fighter Commandos and Richard Egan's hot-blooded homesteader. Four screenwriters adapted Helga Moray's novel, but none were able to lift this one out its vat of musty clichés. The picture does look good in widescreen and vivid color, yet the characters are neither likable, sympathetic, nor interesting. ** from ****","user":"moonspinner55","rank":[6,6]}]