[{"title":"The Citizen Kane of 80s sex comedies.","rating":10,"date":"1 April 2007","review":"In a genre that gave us many enjoyable films, Private School may well be the best of the bunch. There is something truly irresistible about a film that sets out only to entertain its audience. There is no hidden agenda or deeper meaning or political motives here. The people who created this gem intended only to make us smile and show us some skin and make a little money in the process. Some days, isn't that all a guy really needs? It's about time this one came out on DVD! The film deals with the social interactions between girls from Cherryvale and the young men from the nearby Freemount Academy. Of course when I say \"social interaction\" I mean sex. Simply put, the guys are trying to either score with the ladies, or at least get a good Polaroid of them coming out of the shower. The film has a serious undercurrent in how it deals with the relationship between Christine Ramsey (Phoebe Cates) and Jim Green (Matthew Modine). They are trying to lose their virginity under the best possible circumstances, but there are of course complications and misunderstandings. Christine's next door neighbor, the lovely and talented Betsy Russell, is out to steal Jim for herself using methods that would certainly grab any young man's attention. The resulting action plays out in the most satisfactory of ways.<br><br>Private School scores on many fronts. The cast which contains many recognizable faces puts as much into their roles as they've done in any other films. The soundtrack featuring Phoebe Cates singing on two different tracks is much better than you would expect, as well. There is tons of random nudity so you will get your money worth in that department.<br><br>Curiously enough, there is no DVD commentary by any of the actors in this film. Wouldn't it be fun to hear what Matthew Modine would think today about this early role in his distinguished career? And Martin Mull may have been hiding behind a beard for his little three minute cameo, but the appearance was well-appreciated! He must have snuck this little bit part in between takes of Mr. Mom that year.<br><br>For those who may question the logic of the Hound giving all ten stars to this film: Heck, that scene with Betsy Russell topless on the horse was worth eight stars by itself!!! 10 of 10 stars.<br><br>The Hound.","user":"TOMASBBloodhound","rank":[32,37]},{"title":"Bearable and bare-able!","rating":7,"date":"15 December 2007","review":"This was one I enjoyed in High School (and College) to see some T&amp;A. Phoebe Cates plays Christine Ramsey, Matthew Modine plays Jim. He loves Chris, and Chris loves him. Enter Jordan Lee Jensen, played by Betsy Russell. She has the hots for Jim so she tries to break them up. In the meantime, you have plenty of T&amp;A as Bubba tries to score and ends up in the girls shower. Sure, the plot is thin, the humor is thin, but Betsy Russell is so HOT! Probably the best scene is Russell riding topless on a horse. Even clothed this woman begs the male eye to revel and take in every inch of her skin. It's not Fast Times at Ridgemont High (also starring Cates) or The Breakfast Club--but Private School for Girls got me through those years when I wanted to see a lot of T&amp;A. It is finally on DVD (much to the chagrin of Phoebe Cates), fully restored and in letterbox format to make the shower scene all the more pleasurable. It was about time, considering that lame movies like Night Patrol, Night of the Living Dead II and the Party Animal being put on DVD. In any case, I am truly sorry, Phoebe. However, the fans demanded it and Universal finally responded.","user":"scott-sw","rank":[9,9]},{"title":"An education is far from their minds.","rating":7,"date":"7 February 2009","review":"A very raunchy and crude high school romantic sex comedy starring two luscious hotties in the immensely sweet Phoebe Cates and the wickedly memorable Betsy Russell. After seeing it, how can you forget Russell's topless horse riding scene and the saucy seduction of Matthew Modine's character. Yes tongues would be hanging! Wait on guys also featuring is sexpot Sylvia Kristel (well known for the 'Emmanuelle' series) as, just wait the sex education teacher. Immature minds maybe, but you should know the target audience it's aiming for.<br><br>As for the cornball story, it's rather slight with characters coming and going doing their own things with running gags, cheesy set-ups, plenty of flowing nudity and episodic set-pieces. It's the same old high-jinx that remain amusing due to the cast committing themselves and Noel Black's direction being so spiritedly random. There are moments of awkwardness (with many daggy dialogues) and tackiness, but it was hard to keep a smile off my face. I really liked the classy Ray Walston (who a year earlier appeared in the classic teen comedy with Cates; 'Fast Times at Ridgemont High') short, but funny cameo. Matthew Modine was likable enough and Michael Zorek was humorous as a horn-dog. Kathleen Wilhoite (in her film debut) was a cheeky delight as Cates' room-mate/friend and Fran Ryan was terrific as the prudish headmistress. There's also fine additional support by Jonathan Prince, Julie Payne, Richard Stahl, Frank Aletter, Frances Bay and Karen Chase. Look out for a risible appearance by Martin Mull as drug store clerk.<br><br>Now the soundtrack is a complete blast. Catchy, hip and upbeat bubblegum sound that's always (well nearly) playing in the background with many old tunes revamped. It's like a record, with someone taking the needle off for a short break to only rip back in to it again. You got the 'Stray Cats', 'Sam the Sham and the Pharaohs' (probably of the favourite of the lot), 'Harry Nilsson', 'Rick Springfield', 'Bow-Wow-Wow' and 'Vanity 6' to name a few.<br><br>It's no classic, but a vibrantly charming 80s high school teen sex comedy outing that can't do no wrong.","user":"lost-in-limbo","rank":[12,13]}]