[{"title":"It used to be a lot more than Only Rock'n'Roll","rating":10,"date":"21 April 2008","review":"When you see this movie you really understand how sanitised, safe and corporate the music scene is today. <br><br>The Stones were possibly the biggest band in the world at the time, so by today's standards it seems unbelievable they'd put on a free concert where the venue was changed at the last minute, the set was still being constructed as the 300,000 very fried looking hippies turned up, and there was no security for their satanic majesties except for the San Francisco Hell's Angels who were paid in beer and brought along pool cues with lead weights at the end for added security - as well as the standard knives and baseball bats. And they weren't afraid to use them, even on the bands, especially Jefferson Airplane's Marty Balin. <br><br>Throw in some of the original Satanic rock band's finest sinister creations and you get the real deal, not some pantomime metal/goth horror facsimile. At the time many people really did believe that they could change the world and looked to bands like the Stones as leaders of the counterculture, and you really get the impression things like this mattered a hell of a lot more, but after Altamont, well... <br><br>Nevertheless, the version of Under My Thumb that Jagger delivers as he's watching the terrible action unfold in front of him is, for whatever reason, devastatingly understated and desperate, compared to all the OTT cavorting earlier in the set. But it's the genuine craziness of the 'fans' that makes this film seem like it was shot on another planet. Gimme Shelter is the most rock'n'roll film ever made, for all the right and wrong reasons.","user":"bazibazbaz","rank":[31,35]},{"title":"Get the DVD","rating":8,"date":"1 August 2006","review":"This sort of \"artistic documentary\" marks a milestone in our culture and it's really a must-see for people interested in history. The DVD version contains important additional features such as excerpts from a long KSAN call-in show the next day. Some of the callers were principals in this event and their commentary is valuable. In addition, there are some incredible still photo collections on the DVD that go even further to capture the climate at this event.<br><br>There is a lot of talk about \"Hells Angels\" this and that in the reviews here. The Hells Angels were not the primary problem - it was a terrible combination of sloppy organization, third parties who reneged on deals and contributed to the problem, and the concert-goers themselves. As some callers to the KSAN show commented, \"I was at Woodstock, and Altamont was completely different. Nobody came together. We had no spirit of community. The whole thing was hurried and stayed tense throughout.\" So imagine 300,000 people working hard to get their groove on quickly - since the concert was only confirmed a day or two prior - using whatever they could roll up in a paper, stir into their cheap wine, or drop on a sugar cube. Then their heroes come up onto the 20'x20'x3'-high stage and viola, you have a massive problem on your hands whether security was Superman, Sgt. Joe Friday and his partner Bill Gannon, Acme Security out of Walla Walla, or the Hells Angels. There was going to be violence. It certainly didn't help that the organizers told the HA to park their bikes right next to the stage. With the crowd as it was, that was guaranteed disaster for a few people.<br><br>What a way to end the '60s flower power era.","user":"dtburr","rank":[36,42]},{"title":"A Superb Rockumentary","rating":9,"date":"12 August 2007","review":"In November of 1969 I attended a Rolling Stone Concert at Boston Garden. The Stones were nearing the end of their fabulously successful 69 American tour and they were as good as I had ever heard or seen them. The sellout crowd was mesmerized and surged to the stages edge without violence and just rolled to the music. It was a brief period in rock history when such things were possible. The Peace and Love generation had settled into a groove with just tripping on the music and nothing more. Woodstock had been the prototype. A month after I saw them hypnotize Boston Garden the concert at Altamont put an end to the dream. <br><br>David and Albert Maysles recorded this nightmare in their brilliant documentary Gimme Shelter. The film opens with the Stones, flush with success planning a free concert for fans at Golden Gate Park. The venue is switched to a racetrack in Altamont and things slowly begin to deteriorate from there. The Stones naively hire Hell's Angels (\"The Dead said they were cool\") for security. When things become unruly the Angels respond harshly. As Jagger sings a man with a gun rushes the stage and is stabbed. The Maysles cameras are in the right place many times. The emphasis is not on Jagger as he and the band perform, instead it is the threatening and tripped out people near him on stage that fascinate. <br><br>The concert itself only takes up a small but gripping portion of the film which follows the Stones on a some of their tour and their reactions from watching the documentary's rough cut. Seldom do rock stars allow themselves to filmed in such compromising a position. The Maysles also capture the logistics side of the concert business with famed lawyer Melvin Belli and tour director Sam Cutler at task. <br><br>In less than half a year the Utopian dream of Woodstock lay in ruin at the Altamont Speedway. The Maysles provide much of the proof in Gimme Shelter.","user":"st-shot","rank":[18,20]}]