[{"title":"Sheer Excellence","rating":10,"date":"23 October 2005","review":"They don't come any better than Midnight Run. It has everything except a few Academy Awards and that's a mystery in itself. Dialogue, action, comic timing, stunts and all around fabulous acting ability from everyone involved. If you haven't seen this film yet, dig up a copy from somewhere, get a few beers and prepare to be captivated from beginning to end. To think that only 10,000 or so have voted for this film on IMDb and it's not even in the top 250 is a complete travesty. I know, there are other films just as worthy that are not in the top 250 but this is the one that get's me riled up. There are no weak moments or poor scenes in the whole film and the ending is pure joy. Someone please explain why this didn't clean up when it was released because I can't see anything else that came out in '88 that comes close to Midnight Run.","user":"fatclyde_uk","rank":[217,252]},{"title":"A Masterpiece","rating":10,"date":"10 March 2003","review":"One of the smartest, funniest, and exciting buddy pictures ever made. It has never received the wonderful attention it justly deserves. The performances by the two leads (De Niro and Grodin) are wonderful and they get outstanding support from Joe Pantolino, Dennis Farina, and Yaphet Kotto. But what separates this picture from all the other action / comedies ever made is that the screenplay is so sharp and original. Easily my all time favorite movie - you know how I know that? I must have seen \"Midnight Run\" at least thirty times and every time I see it, it gets better and better. A true film classic and is getting rereleased on DVD in June of 2003.","user":"DotelMotel","rank":[166,197]},{"title":"An engaging adventure with two likable stars...","rating":9,"date":"2 May 2004","review":"DeNiro is (Jack Walsh) a self-righteous ex-cop so unpopular with the Chicago police department, now wanting to make one final 'midnight run' that'll pay big so he can buy a nice coffee shop<br><br>He is hired by an hysterical bondsman to find and bring back a former Mob accountant called Jonathan \"The Duke\" Mardukas (Grodin) who has stolen $15 million from the Los Angeles mob, given the money to the 'unfortunates of the earth.' <br><br>DeNiro quickly captures the 'white-collar criminal' in New York, and is given five days to bring him to Los Angleles, to collect his $100,000 fee...<br><br>Unfortunately for DeNiro, the fugitive accountant is too neurotic to fly the distance... The embezzler's ex-boss wants him badly for knowing all his financial transactions, and agent Yaphet Kotto warns Walsh not to interfere with the FBI's plans to bring the 'Duke' into federal court And if this isn't enough, there is some third-rate bounty hunter (John Ashton) who is intrigued about DeNiro's special deal<br><br>In an extended cross-country chase, the two men's personalities and relationship develop <br><br>DeNiro shows how to catch talents of improvisation... His cheeky schoolboy look certainly supplies some of the film's lighter moments... He delivers some of the best punchlines, when he replies: 'Well if you don't cooperate, you're gonna suffer from fistophobia.' <br><br>Charles Grodin is perfect as the prisoner who gets some of Serrano's records on computer disks, figuring if things got too rough, he could always trade them for his life He continually gets on DeNiro's nerves, and with his soft and ironic tone of voice he advises Walsh that a restaurant is 'a very tricky investment.' He easily dips into Jack Walsh's life ('Don't you want to be loved?'), wandering about his broken marriage ('Did she hurt you, Jack?'), his habits ('Cigarettes are killers. Put the cigarette out.') and whatever he can think of... <br><br>The best parts of the film are, in fact, the interactions between the two stars The story holds up perfectly and entertains the viewer in every way Martin Brest does bring out the realistic, funny and moving sides of his likable characters Suspense is maintained to the very end","user":"Nazi_Fighter_David","rank":[102,123]}]