[{"title":"cracking stuff !","rating":7,"date":"9 March 2006","review":"They don't make em like this anymore, Walter Hill knows how to stage an \"in your face\" gun fight, and this movie has truckloads of that. I cant imagine women finding much in this film to entertain them, its a bloke thing through and through.<br><br>The film has an engaging story, heist movies are always great, but its conceit of moving the western into the modern era is what really stands this apart. Its got some of the all time great tough guys in it, Michael Ironside , Clancy Brown , William Forsythe etc, and they are obviously having a blast.<br><br>If you like the cinematic equivalent of a punch in the face, then this ones for you, its blokes doing what blokes do best, growling macho one liners at each other and trying to blow each other out of their socks. Cracking stuff !","user":"janus-20","rank":[27,29]},{"title":"Good modern western with great cast and good plot","rating":28,"date":"28 November 2001","review":"Jack Benteen is a hard-edged Texas ranger, Cash is his boyhood friend who now lives across the border and works as a major drug smuggler bringing crime into Texas.  The conflict between the two men is complicated further when a group of soldiers registered as killed in action arrive in the area and begin to involve themselves in the existing drug war.<br><br>This is a good Walter Hill film that has plenty of good old fashioned western style action.  The plot seems a little strange for most of the film because you're not quite sure where it's going.  At the start you assume that the main focus of the film will be the relationship between Power Booth's Cash and Nolte's Benteen, but after 15 minutes the focus shifts onto the arrival of the army unit and stays split between them and Nolte. Because you're not sure what the unit is doing in this situation it keeps your interest throughout.  However this means that Boothe is sidelined for most of the film which is a shame.<br><br>Both Boothe and Nolte are good, with Nolte doing his usual tough guy stuff. However the real pleasure comes from the depth of famous faces in the supporting cast.  Maria Conchita Alonso is in a thankless role as the girlfriend torn between Cash and Benteen, Rip Torn is the local sheriff while the army unit includes many now well-known faces of Michael Ironside, Clancy Brown, William Forsythe and a small role for the always recognisable Tom \"Tiny\" Lister Jr.<br><br>The action is good throughout despite being a little flat and without any great style.  The \"wild bunch\" style ending is exciting if a little unlikely and is typical of Walter Hill.<br><br>Overall a good modern day western with a strong cast, good plot and good action.  It's nothing out of the ordinary but it's still entertaining decades after it was made.","user":"bob the moo","rank":[20,22]},{"title":"An Underrated 1980s Action Classic. Walter Hill at his best.","rating":10,"date":"29 November 2012","review":"Extreme Prejudice is a great,underrated 80s Action classic from Walter Hill that combines great direction,action and cast and is one of Hill's most overlooked films. A great mixture of Action and Modern Western,this is one Hill's best films and a movie that deserves more attention from Action fans.<br><br>Set in Texas,Extreme Prejudice tells the story of a Texas Ranger named Jack Banteen(Nick Nolte)who has to deal with criminals bringing drugs across the border from Mexico. Unfortunately,the drug supplier is his old best friend Cash Bailey(Powers Booth)who is not only on the opposite side of the law but also share love for the same woman Sarita(Maria Conchita Alonso). While dealing with Cash Bailey,Jack also has to deal with a group of military men led by Major Paul Hackett(Michael Ironside)who do classified missions,but this time they're in Jack Banteen's territory and Banteen has to deal with Cash and the military men with...Extreme Prejudice.<br><br>I am shocked and surprised that Extreme Prejudice has been underrated and overlooked by Action fans and Walter Hill fans. 1987 was a great year for the Action movie genre with great Action classics like Lethal Weapon,Predator and Robocop also being released that year. While those three films became Box Office hits and became classics,Extreme Prejudice sadly flopped at the Box Office remains obscure but in my opinion Extreme Prejudice is one of the great Action films of the 1980s and deserves more love. and I think one of the reasons Extreme Prejudice works so well is because of the main character,Action and modern Western setting. While Walter Hill paints the main character with a bigger than life scope,the characters also have depth. The character Jack Banteen is pretty much old school Western cowboy in a modern setting,instead of dealing with just drunks and bar fights,Banteen has to deal with drug dealers,violence and his best friend. Jack has to do something about the violence and drugs in his territory and he can't have second thoughts about it. Jack wants to deal with his old friend Cash his own way whether it means doing it by the book or breaking the law. It's a simple yet complex story that Hill brings with excellence. I love the Action that Walter Hill has in this film because it's bloody,violent and horrific. The violence and Action in the film is more in the tradition of Sam Peckinpah where the violence is ugly and brutal not like the Action films of the 80s(which I love)where after a violent scene it's followed by a one-liner or pun with the ending of the film is definitely a homage to Peckinpah's Western classic The Wild Bunch and you feel like when a person gets killed in the film it isn't fun or lighthearted,it's gritty,dark and uncompromising and I guess it felt kind of out of place during the 80s because you will feel like no character in the film is safe from the violence in the air. Where slow motion in today's Action films are used to look cool,Extreme Prejudice uses slow motion to show the horrifying and dangerous effects of violence. That's one of the things that separates Hill's Action films from the Action films made today. Hill keeps the film moving at a great pace and keeps you glued to the film with great storytelling,memorable characters and excellent atmosphere. Hill has always said every film he has made is a Western and that is true statement with this film. Even though the film is set in the 80s,you can feel the tone of the old west through out the film with most of the characters wearing cowboy hats and getting into Western style shootouts. I feel when watching the film the movie has an almost timeless look to it where you feel like the film could've taken place in any decade or time period by the way people dress and talk. When characters step in the dirt and dust you can feel it coming off the screen and feeling like you're getting dirt on yourself. While none of the film's main characters don't have six-shooters,ride on horse, have stagecoaches or gold coins you smell the great Western genre in this film and it's one of the reasons that Extreme Prejudice is amazing. The ending of the film is great and is filled with intense Action and brutal violence that Walter Hill is an absolute master at doing and will definitely remind viewers of the Western films of the past. It's a an excellent conclusion to the film. <br><br>The whole cast does a great job with their roles. Nick Nolte gives one of his best performances as Texas Ranger Jack Banteen bringing a memorable depth and dimension to the role.Excellent performance. Powers Booth is a wonderful delight as Cash Bailey,Jack's old friend who's now a drug lord. Booth's scenes with Nolte are amazing. Michael Ironside is terrific as Major Paul Hackett,the man who leads his secret military group. Maria Conchita Alonso does a wonderful job as Sarita,Jack's girlfriend and a woman Jack and Cash both love. Rip Torn gives a fun performance as Hank,a local sheriff who is also a Father figure to Jack. Clancy Brown is great as Sgt.Larry McRose,Hackett's second in command. William Forsynthe is wonderful and humorous as Sgt.Buck Atwater. Matt Mulhern(SSgt.Declan Coker),Larry B. Scott(Sgt.Charlie Biddle)and Dan Tullis Jr.(Sgt.Luther Fry)give good performances as well.<br><br>Walter Hill does an exceptional job with the direction with the film,bringing a gritty,dirty tone to the film and also does a great job with the Action scenes,making bloody,fast and unforgettable. Wonderful Job,Walter.<br><br>Jerry Goldsmith's score is great and fits with the Action and Western tone of the film.<br><br>In final word,if you love Action films,Westerns and Walter Hill I suggest you see Extreme Prejudice,an action-packed film that has been underrated and overlooked for too long and deserves an audience. Highly Recommended. 10/10.","user":"jcbutthead86","rank":[16,18]}]