[{"title":"Elegant Comedy-Mystery","rating":25,"date":"25 May 2003","review":"This second to last film of Cary Grant was one he spoke  highly of in interviews.<br><br>It was my decided pleasure to be in attendance at his \"A Conversation With Cary Grant\" at the Front Row Theater in Cleveland shortly before his death.  During this unforgettable evening, Grant fielded questions from an audience of over five hundred for nearly two hours.<br><br>Grant seemed to possess a photographic memory, recalling incidents of his life and career down to the smallest detail.  \"Father Goose\" was revealed to be one of his favorite projects.<br><br>Looking at the film today, one can see the senior star enjoying his character and well polished script.  He was nicely paired with Leslie Caron, and the two struck an engaging chemistry for these capers.<br><br>Grant also had the good sense to say farewell to these leading man parts (being aware that he could never become a \"character\" actor) threw in the towel and moved on to better things, like Fabrege. <br><br>We're left with another delightful Grant performance in an illustrious and remarkably diversified career.","user":"harry-76","rank":[53,64]},{"title":"After 30 years Grant is still the best.","rating":7,"date":"20 March 2005","review":"I find it quite surprising seeing that Cary Grant is one of my favourite actors, that after nearly forty reviews on this site not one of them has been a Cary Grant film. How odd.<br><br>I now intend to remedy that fact by posting a few as I do believe he was one of the most versatile performers and gifted comedy actors ever to hit our screens.<br><br>My favourite Cary Grant comedy is 1937's The Awful Truth and it is an amazing tribute to his talent that in Father Goose made 27 years later, he seems to have aged very little and has not lost one iota of the spark or zest that graced his performances throughout the decades.<br><br>In his penultimate screen appearance, Grant for once plays a character far removed from his immaculately dressed man about town persona as he takes on the role of Walter Eckland a south sea drifter complete with dirty slacks, tennis shoes and beard. Life for Eckland is lived on his beloved boat, drinking scotch and sailing from island to island meeting and fraternising with as fewer people as possible.<br><br>However Eckland's idealistic lifestyle (and the hull of his boat) are severely destroyed with the arrival of Captain Trevor Howard of the Royal Navy. Bullied, brow-beaten, bribed with Scotch Whiskey and with a large gaping hole in his boat, he is forced onto a deserted pacific island to act as coast watcher for the Allies, reporting Japanese ship and aeroplane activities with the R/T codename of Mother Goose.<br><br>Eckland's immediate plans are to repair his boat and escape his captivity, and jumps at the chance to go and rescue a possible replacement from a nearby island. Using his boat's dinghy he braves rough seas and Japanese patrol vessels in order to obtain his freedom.<br><br>However, when he arrives at the island he finds the replacement dead and a prim and proper governess, played by Leslie Caron, in his stead. It is only after he agrees to take her off the island to safety that life goes from bad to worse as it appears she is not travelling alone, but with seven schoolgirls.<br><br>The interplay between Grant,Caron and the kids is hilarious, as the contrast of lifestyles between Walter and his reluctant family is immediately apparent and almost at once they become warring factions.<br><br>She wastes no time in confiscating and hiding his liquor, evicting him from his house, and commandeering his clothes, his tools, his food and just about everything else she can get her hands on.<br><br>Walter is more or less banished to his half submerged boat. A stranger in his own 'home'.<br><br>None the less after near discovery by the Japanese, Eckland acts heroically endearing him at last to the female inhabitants, until eventually the 'rude, drunken, foul mouthed, filthy beast' and 'Miss Goodie-two-shoes' actually become rather 'pally'.<br><br>The whole cast is excellent, most notably Trevor Howard, who really relishes this rare chance to take on a comedic role, but what makes this film sensational is the clever writing.<br><br>For example when the Navy is given the task of evacuating the newcomers, the answer is a parachute drop:- \"A parachute drop? I want them picked up Frank, not put down\". Or when Grant is teaching Caron how to fish:- \"Quiet, here she comes again\"..... \"How do you know it is a she?\" asks Caron..... \"Her mouth is open, now be quiet.\"<br><br>Very witty examples and this film is chock-a-block full of them. Check out the snake-bite scene. It is quite amazing.<br><br>I know this film has come under some heavy criticism over the years, but I fail to see why. It is Cary Grant in one of his finest and funniest films. I suppose the bad reviews this film received was one of the reasons he retired shortly afterwards. It was classic Grant and one of his personal favourite performances, but it failed to find a large or appreciative audience, and I suppose out of all his films the failure of this one saddened him the most.","user":"Scaramouche2004","rank":[28,34]},{"title":"Gallons of fun...","rating":7,"date":"28 November 2001","review":"This film is lots of fun and goes down smooth. Grant is classic as the grizzled boozer who plays look-out for the Allies and a gaggle of young lassies. It is one of the more well-executed romantic comedies (that's how I would classify it, anyway) and the tension of the final scenes is excellent considering the difficulty of weaving in such weighty material to an otherwise farcical film. Nobody does those twisted-lip facial expressions of exasperation better than Grant.<br><br>I will always remember a certain Sunday in lil ole Luverne, Alabama, having a great time with my family watching trusty TBS (the way it used to be). It's not the greatest movie ever, but it is a fine choice for a lazy afternoon or light evening fun. I give it a 7/10 and it might deserve higher marks. Break out the Orville Reddenbocker, and follow with an \"Operation Petticoat\" chaser.","user":"midnightrane","rank":[37,47]}]