[{"title":"Still Upsetting After Three Decades, But Now It's Uncut","rating":7,"date":"6 July 2001","review":"Without question, in its unedited form, SOLDIER BLUE is one of the most upsetting and violent films of all times, perhaps even THE most violent. This remains so, even though the film was released way back in 1970. And up until late 2006, you could only see an uncut version of this film via imports. Lionsgate Video, however, has rectified this.<br><br>Basically a fictional re-enactment of the infamous 1864 Sand Creek massacre in Colorado by the U.S. Cavalry on a Cheyenne Indian village and the events that lead up to it, but actually based on Theodore V. Olsen's novel \"Arrow In The Sun\", SOLDIER BLUE, directed by Ralph Nelson (of CHARLY and LILIES OF THE FIELD fame), stars Candice Bergen and Peter Strauss as, respectively, a Cheyenne-raised white woman and a disenfranchised U.S. Cavalry officer who have survived a savage attack by Cheyenne Indians on an Army payroll wagon train and are forced to be together to survive, even as they disagree starkly on who is right in the white man-versus-Indian conflict. Eventually, of course, they start to fall in love. This gives a story that otherwise might be interpreted as an arguably pretentious attempt to link the Cavalry's atrocities of the past to the modern Army's behavior in Vietnam a certain amount of emotional validity. But it also leaves the viewer heavily unprepared for the incredibly horrific massacre that climaxes the film.<br><br>Even today, this massacre, a sequence of unbelievably extreme violence that involves hacked body parts, rape, and infinite bloodshed, makes SOLDIER BLUE very difficult for viewers to watch. In fact, when the film was re-released in 1974, much of that bloodshed was chopped off so the film could somehow get a 'PG' rating; it is that version that American viewers have had to put up with on video until late 2006. Apart from the brutal nature of that final sequence, the film's depiction of the Army as a bunch of bloodthirsty savages does not make SOLDIER BLUE an easy film to agree with--and contrary to what a previous reviewer said, I don't think it even comes close to being a politically correct movie. It may not be a masterpiece, the way THE WILD BUNCH or SAVING PRIVATE RYAN were (and they too were incredibly ferocious in terms of violence). But it's good that SOLDIER BLUE has finally made it to DVD in its original uncut form so that people can now judge its validity in whole, regardless of its politics or, even more, its enormously graphic finale. It is a film that HAS to be seen today.","user":"virek213","rank":[67,82]},{"title":"An ending that shows no mercy to the viewer.","rating":20,"date":"20 August 2002","review":"I saw \"Soldier Blue\" quite recently on British Television. About 2 hours before it was aired, the BBC did a program on George Armstrong Custer, which dispelled the story of a 'Last Stand' using archaeological evidence: The Seventh cavalry made a cowardly dash for it when the Indians attacked. Unfortunately(or fortunately depending on your point of view) the cavalry troopers and Custer were swarmed by Indians as they attempted to escape. Complete disorder swelled through the ranks of troopers. The last stand was more of a chaotic melee than a heroic action. Moreover the Indians were better armed, using repeating rifles whereas the Cavalry were using single shot Springfield carbines. My boyhood notion of Little Big Horn was shattered within a matter of minutes. I lost so much respect for Errol Flynn!!! But nothing, absolutely nothing could prepare me for what was to come later on that night. My watching Soldier Blue coincided with the climax of the tragedy in Soham, England. Therefore I was already upset.<br><br>The haunting opening song is a portent of a terrible tragedy. I got the feeling that something truly horrific was going to happen. It's a song that I won't forget for a long time. The film's two protaganists(Candice Bergen and Peter Strauss, a US cavalry trooper), escape from Indians who have attacked an Army wagon train(carrying amongst other things The soldiers wages). The subsequent storyline lulled me into a false sense of security. Bergen and Strauss begin to fall in love whilst deliberating about the plight of the Indians (Bergen feels they have been mistreated. She knows this. She had lived with Cheyenne Indians for 2 years. Strauss feels differently. His naivety does show...Great acting!!Well done Peter!). Actually I got very bored with this, thinking that the movie was turning into one of those slushy 'opposites attract' stories. But the introduction of Donald Pleasance as the sadistic gunrunner changed that. Strauss and Bergen are abducted by him. This point in the movie is important. I feel the tone begins to change. Those haunting lyrics returned to my head as I watched Bergen and Strauss attempting to escape from their abductor(respite is given by the sight of Candices' wonderful rear end). Strauss, being a soldier is obliged to burn the gunrunners wagon. The gunrunner has a large number of guns which he is going to sell to the Cheyenne indians. Bergen tries to stop him, but fails. The two escape and hide out in a cave. Bergen then leaves Strauss, possibly feeling that their relationship can come to nothing as she's due to marry  another Soldier. She's found by cavalry scouts and brought back to their camp. Here she learns that the Cavalry troop are about to attack a Cheyenne village a few miles away. Coincidentally the village is the one she lived in for 2 years. She leaves the cavalry troop and heads straight for the village, hoping to warn them of the pending attack. This leads us to the  finale. I won't describe it as I think it is beyond me. I don't think I can describe the effect it had on me either. Before this I had some idea of how the American Indians had been treated by the Europeans. The documentary on the ill fated Custer and his troop had only hinted at this type of treatment, and of course increased my capacity for cynicism.<br><br>The finale of Soldier Blue confirmed what that haunting song had hinted at. It's like nothing I've ever seen before. I was shocked beyond belief, and as an avid movie fan I have seen some shocking movies. Even the finale in \"Don't Look now\" comes nowhere near this. The director should be credited. He rams his point home (although some people may feel a little exploited). Forget all that nonsense about this movie referring to the My Lai atrocities in Vietnam. It's a poignant testament to human innocence(The Indians) and a disturbing testament to a successful act of genocide. Namely the systematic destruction of the native Americans.<br><br>I recommend this movie. Although it's not for everyone. The plot line rambles a bit at times. The photography is beautiful. Although some might think it typically 1960's. The acting is top notch. But it's NOT for the squeamish or faint hearted. Keep well away from this movie regardless of the fact that you bore the brunt of the opening 20 minutes of Saving Private Ryan.","user":"drfaustus58","rank":[81,107]},{"title":"Gory, ultra violent western released in USA in highly edited form as a love story.","rating":10,"date":"18 November 1998","review":"As released in the UK, this movie pushed the limits of movie violence to the virtually unwatchable. People literally were sick in the theatres. I saw the movie several times in the theatres and on video. It lost none of its impact on repeated viewing. My research indicates that since the movie depicted the massacre of an Indian village, it was thought not politically correct for viewing in unedited form in the US. It does show the horror of war in a most graphic way. I have not seen anything since that is even remotely close. The highly edited US version shows the power and degree of censorship that existed in the US. To my knowledge, the movie is still not available in the US in unedited form.","user":"TM-2","rank":[35,45]}]