[{"title":"T.H. White would be proud","rating":7,"date":"1 January 2001","review":"The 90 minute cartoon is in fact the first chapter of T.H. White's novel The Once and Future King. Made for the kids, Disney does it again taking a classic story and adding fictional animal characters that can talk. Still, Disney remains loyal to the story by keeping many of the characters in the story including Kay, Sr. Pellinoire, and Sir Ector.<br><br>Worth watching twice with the family. An animated classic","user":"caspian1978","rank":[36,41]},{"title":"For every laugh, there should be a tear","rating":7,"date":"22 January 2006","review":"This movie is another proof of the high quality of the classic Disney films. Today feature films are quite funny too... but they based mostly on simple, crude jokes and spoofing of other topical movies (remember the bullet time-spoof in \"Shrek\"). There is no substance to think about in it. You can see them, laughing about them...and forgot them almost completely a few years later. Who will remember, i.e., \"Ice Age\" or \"Madagascar\" in 40, 50 or 60 years? The old Disney classics are different, there are timeless! \"The Sword in the Stone\" contains a lot of joyful gags too, but no gag stands above the characters, no joke was made only to fill a hole in the plot. The story, the plot, and the characters are primary. And Disney add not only joyful gags. As Walt himself once said: \"For every laugh, there should be a tear.\" Disney take children always quite seriously, and a lot of his early films contains a lesson for life, sometimes the lesson can be very sad and cruel, like in \"Bambi\", sometimes lesser sad, like in \"The Sword in the Stone\"... but can anybody forget the cute little girl squirrel, that was left by Wart, desperately crying and with a broken heart? And Merlin's closing words about love: \"Well, yes, in its own way... yes, I'd say it's the most powerful force on Earth\"!<br><br>This is one of the main ingredient of the famous Disney Magic: Joy and tragedy! Another is the art of hand drawn animation. The quality of the animation went downwards at Disney after WW-II too, slowly, but surely. But in 1963 cel-animation was still on a high level. Not so good as in the golden Era, when \"Fantasia\", \"Pinocchio\" or especially \"Bambi\" set the utmost high standards of perfectionism, but quite better than in \"Hercules\", \"The Lion King\" or \"The Rescuers down under\". 7 of 10 stars for \"The Sword in the Stone\"! It is not the best of all Disney films, but quite better and deeper than the most of the modern CGI movies!","user":"c-corleis","rank":[50,62]},{"title":"Probably the most underrated of all the Disneys","rating":9,"date":"26 February 2009","review":"The Sword and the Stone is a very relaxing movie to watch. In an animation, you want humour and emotion, and this movie had plenty of both. Most of the humour comes from Sir Ektor(voice of Sebastian Cabot) and Archimedes (voice of Junius Matthews), but Merlin (voice of Karl Swenson) had some truly delicious lines. I just love Archimedes, he is absolutely hilarious, and still manages to be likable, despite being very grumpy. The animation was lovely, and the scenes when Wart (voice of Ricky Sorenson)was an animal were truly entertaining. My personal favourite was the squirrel scene, but the duel of Merlin and Mim was the highlight of the film for me. The songs by the Sherman Brothers, while not particularly memorable, were very pleasant to listen to, as was the incidental music by the composer of the Jungle Book George Bruns. All in all, a truly enjoyable movie, that is definitely underrated. 9/10 from me. Bethany Cox","user":"TheLittleSongbird","rank":[17,19]}]