[{"title":"We Are Talking International Showtime","rating":6,"date":"29 May 2005","review":"I remember seeing this film as a lad on a family outing in Manhattan, topped off by my insistence that we have dinner at Jack Dempsey's Restaurant in Manhattan. Too bad the old champ wasn't there that day or it would have been a perfect Sunday.<br><br>Seeing it now on a formatted VHS the awesomeness of the spectacle during the scenes of the circus fires and the capsized ship in the harbor is really lost. It's quite an eyeful and should only be scene in theaters.<br><br>And the film would be revived, but we have a subdued John Wayne here and it's not for the better. <br><br>This was originally to be a Frank Capra film and Capra bowed out after creative differences with the Duke and some of the Duke's personal entourage. Read the Capra autobiography to find out exactly what they were, but they weren't fully fixed in the final product by director Henry Hathaway who later piloted the Duke to his Oscar in True Grit.<br><br>John Wayne was a guy who was usually very careful to give the public the Duke they expected. Even when he stretched his abilities it was done with a firm directorial hand. <br><br>We're asked to accept the Duke as a man who had an adulterous affair here. He also does not throw one punch in this entire film or fire a weapon in other than it being part of his Wild West Show. The people went to see John Wayne, but they didn't get their money's worth.<br><br>Pity because it would have been great to see John Wayne with Rita Hayworth in a great film. That couldn't have happened when they were younger because of Rita's contract with Columbia pictures and Wayne's personal boycotting of that studio because of his dislike for Harry Cohn. That story I won't go into.<br><br>Rita Hayworth who doesn't enter into the film until almost halfway through is fine as Wayne's lost love. She and Claudia Cardinale looked just fine in tights as trapeze artists. Lloyd Nolan as Wayne's sidekick is always good.<br><br>Richard Conte is Hayworth's brother-in-law and Cardinale's uncle. This fine actor is wasted here in a part that either was badly written or left on the cutting room floor.<br><br>John Smith was a Wayne protégé of sorts, Wayne gave him an early break in The High and the Mighty which he produced. Smith went on to star in the Laramie TV series and on completion of that he was cast opposite Cardinale, probably at Wayne's insistence. I remember always wondering what happened to him because he left show business shortly afterward. Then back in the Nineties I read he had died of cirrhosis of the liver. I guess you can fill in the blanks.<br><br>At the time Circus World came out, there was on television a prime time series called International Showtime. It was on Fridays at 8 pm. and it was set in a different city in Europe every week. Hosted by Don Ameche it featured the very best circus acts in the world. So did Circus World, but it certainly was no incentive for people to come out to see this when they could see the same thing at home. Also Paramount re-released Cecil B. DeMille's The Greatest Show on Earth to a brisk box office business at the same time Circus World came out.<br><br>So for all these reasons Circus World flopped and bankrupted producer Samuel Bronstein. Nevertheless if you're a circus fan you will enjoy seeing this. But it's not the Duke his fans have come to expect.","user":"bkoganbing","rank":[33,44]},{"title":"Slow moving and overlong film upon circus world with the great John Wayne","rating":5,"date":"29 January 2005","review":"The movie talks about a circus employer (a proprietor beset by problems called Matt Masters well played by John Wayne who was suffering from the early stages of lung cancer) who decides to take his show on a European tour along with his fostered daughter (a gorgeous Claudia Cardinale) and her lover (John Smith) . Meanwhile , the Circus owner searches for the mother of his adopted daughter , who disappeared years before , she is a trapeze artiste (a veteran Rita Hayworth) who bears a dark secret that originates the drama .<br><br>In the picture there is a love story , circus show , melodrama in which protagonists are caught in emotional conflicts , but it isn't fast movement and that's why it is a little boring and dreary . Furthermore , film runtime is overlong : two hours and some , 135 minutes approx. , and there happens a few events . ¨The greatest show of the earth¨ by Cecil B. Mille with Charlton Heston resulted to be much better and obtained several Oscars , while ¨Circus world¨ , a typical John Wayne film , was a real flop and failed in the box office and didn't achieve success at nowhere . In spite of the numerous and famous screenwriters : Ben Hetch's last film , Philip Jordan Nicholas Ray and James Edward Grant (who John Wayne insisted to be brought to rewrite it) , the plot is confusing and embarrassing . The picture finished to sink the Samuel Bronston's empire along with ¨The fall of the Roman Empire¨ because of both movies didn't make money . However, the circus spectacles are breathtaking : the racehorses , stagecoach pursuits with Indians riders, the clown shows , the trapeze artistes are spellbound . Support cast is frankly good , such as : Rita Hayworth , John Smith , Richard Conte , Jose Maria Caffarel , Milles Malleson and Lloyd Nolan replaced David Niven who was originally cast as Cap Carson . <br><br>The movie was regularly directed by Henry Hathaway , though Frank Capra began this project but he turned it down due to he wanted to use his own script . Hathaway was a skillful craftsman with a long career . Big John Wayne played for Hathaway various films as ¨The sons of Katie Elder (65), ¨Circus World (64) ¨ certainly not one of his memorable movies , ¨How the west was won (62) ¨, ¨ North to Alaska (60)¨ , but his greatest hit smash was ¨True grit (69)¨ in which Wayne won his only Academy Award . Although Hathaway was a highly successful and reliable director film-making within the Hollywood studio system , his work has received little consideration from reviewers . The motion picture will appeal to John Wayne and circus fans . Rating : Average. Score : 4,30/10","user":"ma-cortes","rank":[22,36]},{"title":"Not as magnificent as the title suggests, but a pretty entertaining movie","rating":6,"date":"12 May 2011","review":"Is The Magnificent Showman a good movie? Not really. Is it entertaining? In some ways, yes, but it also has a number of problems. As far as John Wayne go, The Magnificent Showman is not among the best like The Searchers, Fort Apache and The Quiet Man. But he has also done worse in his career as seen(in my opinion that is) with The Conqueror, Brannigan and The Green Berets. In fact, it probably belongs somewhere in the middle.<br><br>I did very much like how The Magnificent Showman looked. The cinematography, effects, costumes and sets/scenery are amazingly effective. There are also some scenes that hold up well and entertain, particularly worth of note are the climatic fire and the capsizing of the circus ship, both scenes are full of excitement and tension.<br><br>The Magnificent Showman was begun as Circus World, directed by Frank Capra. As much as I very much like Capra and his films, Henry Hathaway, who the film was later entrusted to, in my view was much more suitable for the job. And while there are some assets that don't work as well as they should, Hathaway does deserve credit for directing as solidly as he did.<br><br>Aside from the cinematography, effects and set pieces, the other outstanding asset is Dmitri Tiomkin's score, which is energetic, beautiful, haunting and rousing as it should be. And while I wasn't that impressed really with the acting, two performances do stand out- Rita Hayworth and Claudia Cardinale. Hayworth is captivating and Cardinale is a sheer delight. Together they are even better, here they seem to be having a contest at who's the best at upstaging the other, and it is a lot of fun to watch. Just for the record, I think Cardinale just about wins the contest.<br><br>These aside, I was divided personally on the performance of John Wayne. I do like Wayne a lot, but I wasn't sure about him here. What I did like was his charisma, Wayne was a very charismatic actor and that comes loud and clear here. However, for my liking his delivery of the lines seemed rather stiff and there were times where I couldn't help thinking he was too old for the role.<br><br>The film is too long, at 133 minutes it is very lengthy. This wouldn't have mattered so much if the pace and story were good, sadly neither were as solid as I would have liked. There are a fair number of exciting scenes that do elevate the story, but the more talky and slower moments are rather sluggish. The story had a great concept to work from, but the final result seemed rather over-stuffed and cobbled together, also some plot points could have been better developed. But my main gripe was the dialogue, some of which was really quite bad being very clichéd and silly.<br><br>All in all, entertaining enough but has a lot of flaws that stop it from being any more than that. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[10,15]}]