[{"title":"Life on La Mosquitia  Chronicles of the Fox Family","rating":10,"date":"17 October 2005","review":"Mosquito Coast is one of the best books I have ever read, and the movie does super well to do justice to that novel. It is also one of Harrison Ford's best character roles; the eccentricity and opinionated genius of Allie is done to perfection by him. Peter Weir's brilliant direction is to be expected considering his other masterpieces  Fearless, also based on an excellent book of the same name, is one of the best movies yet. His films (Truman Show, Green Card, and Witness come to mind) tend to chronicle troubles and eccentric characters to go out on a limb, literally.<br><br>The narration is carefully done, only enough voice-overs to explain the philosophical implications and underpinnings of the characters' thoughts and actions. There are, of course, some mysterious elements to how things happen, which can only be remedied by reading Theroux's book of the same name.<br><br>Taking a very Robinson Crusoe-esquire piece of fiction and putting it to film is not an easy process. In fact, this is the kind of novel that can be very easily messed up by the movies with strong action and adventure type Hollywood direction. Luckily, Weir has done an excellent job portraying the characters  not so much the plot  of those who will come to inhabit The Mosquito Coast. In short, not only is Mosquito Coast a film to watch, it should be required.<br><br>RATING: 10/10 \"We eat when we're not hungry, drink when we're not thirsty. We buy what we don't need and throw away everything that's useful. Why sell a man what he wants? Sell him what he doesn't need. Pretend he's got eight legs and two stomachs and money to burn. It's wrong. Wrong, wrong, wrong.\"","user":"golem3","rank":[50,60]},{"title":"A classic of the 1980's","rating":30,"date":"30 August 2000","review":"I can almost guarantee that anyone who has seen 'The Mosquito Coast', then looked at the subject line of this review, thinks I'm crazy. The truth is that this film is deeply flawed and undeniably weak in many regards, but it had a quality I cannot describe. This is the only film I have ever seen that, despite many shortcomings, manages to come out of the storm relatively unscathed, and become an unforgettable, almost haunting, movie.<br><br>The production values are immaculate. Peter Weir's direction is excellent, and is in top form here. He has crafted a thick shell that blocks the flaws from coming up to the surface, an indescribable feat that very few directors have accomplished. The musical score is good, not outstanding, but it's fitting, and surprisingly subtle. There is only about six minutes out of the entire film that has musical accompaniment, which makes for a very unique experience, and not necessarily a bad one. The tropical cinematography is dazzling, and the decision to shoot on location in Belize instead of on a studio back lot really paid off, contributing greatly to the film's success.<br><br>As good as the mentioned characteristics are, nothing is as good as the acting, especially that from the two leads: Harrison Ford and River Phoenix. Prior to this, Ford had made a name for himself with big budget action roles, with several failed attempts at drama (Hanover Street being the best example of that). It wasn't until 1985's 'Witness' (which Peter Weir also directed, that Ford was taken seriously as an all around actor. Personally I think Ford's performance here greatly overshadowed his work in 'Witness', and is a career best for him, even in the light of 'Regarding Henry' and 'Presumed Innocent', both made after his. He takes the character of Allie Fox, and moulds him into a selfish, driving maniac, blind to the wishes of others, only caring for himself. Phoenix, on the other hand, deserves even more acclaim, for several reasons. For one, this was only his third film, after 1985's 'Explorers', and 'Stand by Me', made right before this. Secondly, he was only 15 at the time of the shoot, and had little acting experience, yet he easily out acted most of his co-stars. Though his performance wasn't quite as refined as Ford's was, he still reached a level of near perfection and set the stage for a glorious, and ultimately tragic, career.<br><br>The story is one of utter genius, one of the few original ones popping up in an industry full of sequels, remakes and rip offs. Based on the 1981 bestseller by Paul Theroux, and co-starring Helen Mirren, 'The Mosquito Coast' deserves a place among the best films of the 80's.<br><br>But wait, I'm not done. Despite a great exterior, deep inside the movie is troubled. It's as if director Weir pushed all the movie's problems deep down under the surface, then piled layer after layer of... something, on top of it, hiding them from the clueless audience. My main problem with the movie is that it yearns to break away from it's literary roots, a problem that could've been easily avoided had the right script come along. Entire conversations are lifted from the text, and there isn't a single line that doesn't have an equal counterpart in the novel. For me this got extremely tedious as, hours before popping in the tape for a second viewing, I had finished the book, and the two are much too similar.<br><br>Another problem I have with it is that the scenes are much too short, with none of them running over about a minute and a half. An obvious result of this is that many subplots remain unresolved, and several concepts are hinted at, but go without further explanation, making for a confusing story. If the screenwriter had put a little more effort into making the film different than the book, with new scenes, we would have seen a much better end product.<br><br>A third, albeit a smaller one, is that the production team apparently spent too much time making sure that the movie would get a PG rating, though it would've been much better had it gotten an R, or even a PG-13 rating. That would've allowed Ford a little more breathing room to tweak his character, possibly allowing Allie to become less sympathetic, more of a madman.<br><br>I can't think of much more worth saying to put in this review, so I'll end it with this note: see the movie, even if you've read the book, but don't do the two back to back.","user":"millennia-2","rank":[61,76]},{"title":"The Iceman Cometh","rating":8,"date":"23 August 2010","review":"Frothing at the mouth with disgust for his homeland America, inventor Allie Fox (Harrison Ford), with family in tow, pulls up roots, and moves to Central America. Here, he proceeds to build a new life in the jungle, using his mechanical skills, his inventiveness, and in particular his patented machine, which produces ice, sans electricity. \"Ice is civilization\", he proclaims with unctuous authority. That will be the foundation for his utopian dream. But Allie is so headstrong, so convinced of his infallibility that his vision blinds him to reality. And the film's ending is poignant.<br><br>Delusion and self-deception breed nightmarish outcomes. And the cinema, through the years, has dramatized these themes quite well, in films like \"Aguirre: The Wrath Of God\", \"Fitzcaraldo\", and \"Deliverance\". In real life, delusion and self-deception were the basis for the events surrounding American preacher Jim Jones who, in the late 1970s, relocated his naive flock to the jungles of Guyana, whereupon he established Jonestown, envisioned as a religious utopia. The result was tragic.<br><br>Beyond the deep themes thus expressed in the script, \"The Mosquito Coast\" looks good visually. The tropical scenery is spectacular. Production design and cinematography are terrific. And the film's score, by Maurice Jarre, is wonderfully exotic and majestic.<br><br>My only complaint is the character of Allie Fox, who at some point badmouths just about everyone and everything. I could have wished for a quieter, less loquacious, madman. Then too, Harrison Ford plays Fox in a way that overrides subtext. In short, Fox not only is delusional and self-deceptive, he's also preachy, domineering, and totally lacking in compassion for others, someone whom we as viewers cannot root for or have any empathy with.<br><br>\"The Mosquito Coast\" reminds us that the grass is not always greener on the other side of the fence. Chasing that elusive pot of gold at the end of the rainbow is for dreamers. This is a good film to watch when you're facing a pile of problems. You could be like Allie's family, trying to forge some existence in the jungles and listening to the rants of an icy madman.","user":"Lechuguilla","rank":[25,29]}]