[{"title":"The Man","rating":10,"date":"23 February 2004","review":"\"Give me a child until he is seven, and I will give you the man,\" goes a Jesuit proverb, which the \"Up\" documentaries quote. Every seven years, Michael Apted interviews the same Britons to see how they have changed. \"28 Up\" is the fourth installment of the series--the interviewees are now each 28 years old. The children are now the men, or women. It's not necessary to have seen, or recall, the previous installments of the television series to watch this episode, because the filmmakers intercalate clips from previous episodes with the new scenes. Via film editors Kim Horton and Oral Norrie Ottey, \"28 Up\" stands well by itself. We're timely shown how the interviewees have changed.<br><br>The proverb seems oft to hold true, but there are some surprises. Suzi, for example, was \"very cynical\" about marriage as a 21-year-old chain-smoker, but at 28 years old is a cheerful wife. Tony, however, said he wanted to be a cabby if he didn't succeed as a jockey--now he is a cabby, and he seems happy.<br><br>Besides examining their individual lives, the series also examines the differences among socioeconomic classes in Britain. John, although he didn't participate in the show at 28 years old, made two interesting comments on class issues in previous episodes (viewed again here). He said it \"doesn't mean because you sweep the streets you're any less valuable than someone who's running a huge corporation. Not everyone can be at the top. As long as people are happy at what they're doing.\" John is from the upper classes and attended a private school. He went onto say, \"And this is what worries me about these new sort of invidious sort of class attitudes that certain subversive elements are introducing....\"<br><br>Class issues don't seem to bother most of the cast; most of them seem content with their role in society, as John advocated as the \"greatest good that could be.\" Yet, John is also a bit of a snob. Contrastingly, Bruce is a socialist from the upper classes, and he is now teaching math in a public school.<br><br>Women's role in family and society is another issue examined in the film. Jackie, Nick's wife, discussed how she and her husband might balance work with children. Jackie (a different one), Lynn and Sue are the program's three working-class women. They're all married now, and they characterized marriage as a partnership of equals. Jackie has decided not to have children, at least not yet.<br><br>Inevitably, some of the interviewees are more interesting than others are. For example, Symon (who had the misfortune of being the last interviewed) was a bit boring. At 21 years old, he was working in a freezer room; he said, \"I couldn't stay there for that long--my mind would go dead.\" He's still working there at 28 years old. It wasn't apparent to me that his mind had died, but perhaps the job has caused him to appear dull in this segment.<br><br>Finally, Neil, lanky, serious-minded and depressed, is to me (and many other viewers) the most interesting person of the gang. Neil is now a tramp traveling around Britain. The most memorable sequence of the film is of Neil nodding nervously as he sits by a waterfront, discussing his life and past, hesitating often as he thinks about how to better articulate his thoughts, or to reflect on his thoughts before he is posed another question.","user":"Cineanalyst","rank":[24,25]},{"title":"the voyage of life","rating":9,"date":"11 January 2011","review":"\"Give me the child until he is seven, and I will give you the man.\" So goes the old proverb, and the proof is in this fascinating documentary, the fourth chapter in an ambitious, ongoing epic of non-fiction filmmaking already two decades in the making at the time.<br><br>The project began in the middle 1960s as a modest examination of English class divisions in a group of seven-year old children from different social backgrounds, and has been updated every seven years to show their progress through adolescence to young adulthood. Each individual biography resists the pre-determined notions of (specifically English) status and privilege around which the entire cycle of films is based, becoming instead a record of the same, sometimes rocky path to maturity followed by everyone, regardless of upbringing. At age seven every child is carefree and impressionable; at fourteen most are sullen and inhibited, uncomfortable in puberty; at twenty-one they are, by degrees, poised to reach their potential: eager and naive or cynical and confused.<br><br>And by age 28 their niche in society has been secured, for better or (sadly) for worse. The candid self-analysis, and the range of insight and opinion, makes the film (individually, and as a series) an invaluable document of human growth and development, as well as an irresistible reminder of our own personal destiny.","user":"mjneu59","rank":[4,4]},{"title":"Us and Neil","rating":10,"date":"10 February 2010","review":"In 28 Up, it seems like the 'the Man' part of the 'Give me a Child' bit that is quoted in every Up movie is starting to take shape, for the men and women. Or, at least, most of them. We see the gradual progression of life start to take shape: careers, over the course of the people's 20's, have been sought out, and they've gotten married and/or had children. Some, in fact, who weren't married before have been changed for the better it would seem by being married (i.e. Jackie), and some aren't living in Britain anymore (one is a physicist living in America with his wife, another has lived in Australia for quite a long time).<br><br>The series in this 'episode' film centers around the real progress into adulthood, and how the interviewees now feel about how their lives, loves, careers have progressed. A given topic that comes up is how they think they've changed since being in the first film at seven, and the consensus, a strong one presented, is that a person is at least, potentially, there at the age, but needs to grow (like a seed). It's fascinating too to see how the children in groups have progressed about as expected, or with some relativity. For example the three boys, now adults, sitting in the same line (albeit one of them declined to be interviewed, ironic since he works for the BBC in 1985), one of whom a prissy, upper class citizen, and another not so much, based on hair-length perhaps.<br><br>In general 28 Up seems to view the subjects as they would be naturally by this point as adults, and some, like the bricklayer, revealed how they might turn out when let loose in the 'playground' at age seven, some building a house and some, well, not (another fascinating subject like this is the former jockey turned cab driver). And yet a good deal of these subjects, at least for the moment of 28, look set for their life, either with a current wife or kids or a steady income at something they've worked for... which brings us to Neil. He's the one who, at 28, has no current prospects, who was happy as a child but now is disillusioned to the fact that he doesn't have a career or much of a life, but in a way is fine with that (he applied to Oxford, but didn't get in). He's the stark, fascinating contrast that gives 28 Up a great sense of depth. The class system in Britain, or just in how it sets up these kids, is revealed in the highs, mediums and lows of living, and Neil is certainly a low, but not feeling bad about it (at the least, he says, he can eat now, unlike some years before).","user":"Quinoa1984","rank":[5,6]}]