[{"title":"Still great after all these years","rating":8,"date":"15 January 2004","review":"I first saw this film in the theater almost 30 years ago and have caught it a few times on TV since.  Finally, I was able to find a DVD copy on E-Bay (apparently it is not currently available on DVD through normal means) and I am glad I did so.  This movie has stood the test of time.  It is both fun to watch and has some depth to it - it is not just a piece of fluff.<br><br>   The casting is excellent - not a single actor is unfit for the part. Redford's looks and charisma, coupled with the fact that while he is still pretty young he does have a few visible age lines, make him perfect for the part of a debonair flyboy, ten years removed from World War I, who is stubbornly resisting the increasing regulation of flying as a profession. Bo Svensen is a great complement as the slightly older, more experienced, and more even-keeled Axel Olsson.  Geoffrey Lewis' Newt Potts, Pepper's old squadron commander, represents the future that Pepper is trying to avoid. Ed Herrmann is the embodiment of the \"seat of your pants\" spirit of the early aircraft producers.  Phil Bruns is a convincing \"carnival barker\" as Doc Dillhoeffer.  And the Swedish actor Bo Brundin puts in a great turn as Ernst Kessler, German fighter ace turned barnstormer, who has long since realized that the bravery and chivalry he found in the air (both among comrades and opponents) is rarely found on the ground.<br><br>   Kessler is based on Ernst Udet, the second-highest scoring German ace of WWI.  Udet barnstormed after the war, had a shortened version of \"Lola\" painted on his Fokker D-VII, and had a fight similar to the epic battle that is an important subplot in the movie.  Thus it is a nice touch that Udet is shown in the opening photo montage.  (It's also good that no sequel was made - I'd hate to see the Kessler character return to Germany, join Hitler's Luftwaffe and commit suicide.)<br><br>   This is also notable, on a personal level, as the first place I ever saw Susan Sarandon.  I've been a fan ever since.  Hell, she still looks great.<br><br>   The flying sequences are magnificent.  There's no CGI here, folks.  These are real aircraft - beautiful replicas of Curtiss Jennies, Standard E-4's, and of course the Sopwith Camel and Fokker Triplane (plus a few others) - doing real stunt flying.  The talented stunt pilots are credited under the umbrella of Tallmantz Aviation, which I'm guessing was formed by legendary stunt pilots Frank Tallman and Paul Mantz.  Tallman himself flew in this film (and died in a crash three years later; Mantz died making \"Flight of the Phoenix,\" another of my favorite flight movies, in 1965.)  And the climactic sequence, while it may seem unlikely to some, is actually based (perhaps loosely) on a similar incident that occurred during the filming of either \"Hells' Angels\" or \"Wings\" in the late 1920's.  The only possible anachronism that I can spot is Kessler's stunt plane, which looks a little too advanced for 1928.  But I could be wrong there.<br><br>   Beautiful aircraft, great flying sequences, fine acting, and even a real plot - what more could you want?","user":"splat99","rank":[31,32]},{"title":"The air and the ground","rating":9,"date":"8 May 2006","review":"First I must say that this beautiful movie handles the wide screen format extremely well, to watch it on TV comes near to an act of profanation. The lines, the colors , the surfaces, the sun that always seems to be low above the horizon ... The Great Waldo Pepper really is a work of cinematic art.<br><br>Secondly I would really like to know how the idea for this script developed. It looks like the aviation business is a metaphor for the movie industry. I would not be surprised had director and co-scriptwriter George Roy Hill put many personal feelings and experiences into it. Aviation stands for freedom. But even in the title scene the constant fear of being forcefully grounded becomes evident  the main character, aviator Waldo Pepper, talks an overawed boy into getting a canister of gas for him with the promise of a free tour above the landing strip. Cute, at first sight, but also curiously grim. It immediately started me wondering how the boy could manage to carry the full canister over the required long distance.<br><br>The wish to be free and be able to fly off sets ever more demanding conditions. People get bored with acrobatics, they want to see blood. The artists comply, because they are ambitious but also because they know that it is the only way that allows them to continue. Time moves on and it becomes evident that commercial air service will put an end to the adventurous phase of aviation. Hollywood seems to be the only way out. Acrobats are needed as stunt-men there. The grindhouse routine of the dream factory is not to their liking, but what else can they do? On a set Waldo Pepper meets a famous German flyer he idolizes. Much to his surprise this Erich von Stroheim character is deeply in debt. In the air, I see heroism, chivalry and a spirit of comraderie\", rasps the German, but on the ground ...\" He just limply shrugs. The final quixotic showdown between Pepper and the German is a natural and very good ending of this surprisingly deep\" and rather pessimistic movie that offers far more than nostalgia.","user":"manuel-pestalozzi","rank":[17,19]},{"title":"One of the Great movies of the seventies","rating":1,"date":"1 April 2007","review":"This movie is made by some of the same players that made Butch Cassidy and the Sundance Kid (Writer, Director and Actor). Unfortunately, it doesn't have nearly the acclaim. Perhaps because the ultimate tone of the movie is darker, the movie still captures that fun that permeates Butch Cassidy.<br><br>In terms of the aerial stunts and flying sequences, not only does the hold up to the modern movies like 'Flyboys', it is in fact, much better. Visually just as complete, you also know these are the real deal.<br><br>The script is brilliant. At the end of this film, one is forced to wonder why this level of movie so rarely is ever seen today.<br><br>You can read the other reviews for plot points, and details. Suffice to say that if you are a fan of movies with planes, actions, love, tragedy cool war history lover, or Hollywood of the early thirties, you'll eat this movie up.<br><br>Now lets get a DVD of this that is worthy!","user":"krazykat29","rank":[11,13]}]