[{"title":"The British Hercules","rating":7,"date":"12 June 2003","review":"Definitely one of the better Hercules films with British born bodybuilder Reg Park (the man who trained Arnold Schwarzenegger) a better Hercules than most. Another thing that puts this one above most of the rest is the presence of British villain Christopher Lee, who's about three inches taller than Reg Park.<br><br>In this one Hercules literally goes to Hell so that he can retrieve a magical rock thing that will save his girlfriend. From there he battles the usual assortment of monsters against a backdrop of atmospheric sets. This one's good for Halloween or any dark, misty night by the fireplace.","user":"DarthBill","rank":[8,8]},{"title":"One of Mario Bava's many masterpieces:","rating":9,"date":"11 July 2009","review":"When it comes to films of style over substance, I don't care what the indie-film fans say, it's NOT us damned yanks who favor style over substance more than anyone; it's the Italians. Face it, most of Italy's great films are great because of storytelling and cinematography, not the stories those techniques served to enhance. Their films were just as studio-controlled as any in America, and director Mario Bava's films were no exception. He often said that he cared nothing at all for his famous monster flicks like 'Black Sunday'(One of the most overrated films in the horror genre), dismissing the critical analysis of his film's thematic content, and said that his true interests in horror lied with the concept of someone alone in a room; facing the darkest aspects of themselves(He would've loved Clive Barker), and in a sense, he never got to make that kind of film, so in a way, his films really were purely style over substance.<br><br>So it is ironic that perhaps his most rich film, in terms of style AND substance, would be a Sword &amp; Sandle film about Hercules. As a result, the film is frequently dismissed as a lesser effort, and ignored by horror fans because it's not technically a horror film. Sad, as not only is this my favorite Bava film, but easily one of the finest fantasy films ever made.<br><br>The plot is quite convoluted, so pay attention: Hercules learns that his betrothed, Princess Deianara of Icalia has become stricken with an apparent mental illness where she is slowly dying, in order to save her, Hercules departs to Hades, first to win the Golden(it looks bronze)Apple that will see him through Hades, and then to find a power stone that will keep Deianara from dying, he departs with his horn dog best friend Theseus(!!??) and comedy relief warrior Telemachus(!!!?? Throw all notions of Mythology out the window), only to find that they may have carried away with them a far greater danger than the one they faced when Theseus seduces/is seduced by Hadean Princess Persephone and brings her home, only to find that the gods are not pleased by her absence. It would seem obvious to appease them by making Persephone leave, after all, Theseus goes through relationships like fundies through logic so it won't bother him, but wait a minute, this time he HAS found a perfect relationship, and he's not going to give her up without a fight, even against his best friend......<br><br>The film features all of Bava's themes; illusion of beauty, doomed romance, incest and the theme of the shattered family and friendship, and despite the juvenile inclinations of the genre, he handles them more maturely than anywhere else. But this isn't just some profound statement on the human condition, oh no, it still has more than it's fair share of mindless spectacle and fun; including two moments of sheer superhero badassery, such as when Hercules ties a boulder to a long whip in order to knock down the branch with the Golden Apple, then repeats the same trick in Hades with, get ready; TREE ROOTS OF THE VEINS OF ALL THE SOULS OF THE DAMNED STILL FILLED WITH BLOOD THAT SHRIEK WHEN THEY ARE CUT to cross a LAVA PIT. *WHEW*<br><br>It also has plenty of sword fights and an unconvincing but awesomely designed Rock monster too.<br><br>As impressive as the quest is, the film really hits it's stride after our heroes leave Hades, only to find Icalia ravaged by the vengeful gods, with the mentally unstable(and incestuous) King Lico becoming more and more warped, to the point he feels he needs to commit a sacrifice. What gives the film it's power, however, is Herc's conflict with Theseus, yet the conflict isn't clear cut. Theseus DOES love Persephone, and she loves him, and their romance is very convincingly played even if it blossoms ridiculously fast(within a minute of meeting each other), and although Hercules is willing to do whatever it takes to save his city, he also doesn't want to hurt his best friend, but Hercules also has a warrior's rage that can't be stopped when it gets started...the conflict between these two lifelong friends who have literally been to hell and back with each other is truly heartbreaking, and wonderfully symbolized by Theseus's fall thru the Lava pit wherein he meets Persephone; He has fallen, like Hades himself, can he be redeemed? Actor's Reg Park &amp; George Ardisson may be a bit stiff in terms of dialog delivery, but the sheer emotion they express is Oscar worthy.<br><br>Franco Giacobini is hilarious as Telemachus, in spite of a few flat jokes, he never becomes annoying or forced and is genuinely amusing. Ida Galli gives a moving performance as Persephone. Leonora Ruffo grates as Deianara, but thankfully has little dialog. Strangely, the most problematic actor is the actor you'd expect to be the best; Christopher Lee as Lico. Not only is the character given little to do despite being the main villain, but his voice is dubbed!!! A dubbed Christopher Lee is like dubbing Elvis with Urkel, or dubbing Barry White with Woody Allen, just ridiculous. For that glaring waste of Lee and the horrible dubbing, I detract half a star for each offense, thus losing one star, with Lee's voice and more screen time for him, this would have been a 10/10.<br><br>Oh well, in spite of that, this is as perfect as a fantasy film can get, superior even to 'Jason &amp; the Argonauts', where, face it; the stars were Harryhausen's monsters. It's visually stunning from start to finish; undeniably Bava's best looking film. Don't miss it.~","user":"TheFinalAlias","rank":[15,17]},{"title":"Fairy tale Images","rating":7,"date":"14 July 2003","review":"Not really an action movie as you might be led to believe by the title and given the fact that these epics were invariably promoted with chunky poster art of Hercules holding a boulder aloft ready to drop it on some unfortunate adversary. In fact, he does manage to fill the mandatory quota of rock throwing in this particular sword and sandal outing but at other times it's a bit slow moving. Not that it really matters because it still has a lot going for it.<br><br>Apart from anything else, it's a gorgeous looking film. The sets, costumes, special effects and camera work are a joy to behold and director Mario Bava's distinctive style is very much to the fore. Bava specialized in the creation of surreal and subtly sinister atmospherics and there's plenty of that.<br><br>Reg Park had a vibrant and attractive screen presence and turned in a convincing performance as the muscle bound super hero. His fellow players were also well cast and provided (dare I say it ?) \"strong\" support. And there are enough suspenseful moments along the way to keep the sandman at bay.<br><br>You could never say that \"Hercules in the Haunted World\" moves along at a cracking pace. It's more like a pleasant, slow boat ride through a kaleidoscope of fairy tale images.","user":"BruceCorneil","rank":[11,12]}]