[{"title":"Interesting and style-full feminist movie.","rating":8,"date":"2 March 2007","review":"\"La Souriante Madame Beudet\" is mostly interesting and a classic because of its unusual and daring theme, for its time. Back in the '20's women rights weren't exactly regarded as the most important or relevant things, to put it mildly. Women were often oppressed and restrained in their marriage, to mainly only household chores, as is shown in this movie about a woman who is trapped in a loveless marriage.<br><br>Of course there is not much to the story, it's just purely about its theme. The movie follows the life of the husband and wife over a couple of days, in which she gets humiliated and has to do humiliating chores for her husband. She starts thinking about taking revenge but the intelligent woman is soon stricken with remorse. The movie shows the position of the woman in everyday life and it of course does so by exaggerating things to make its point. Normally we only know French movies for its perfect and romantic love stories. This is a whole different piece of cake.<br><br>The movie is made in a style-full fashion, which makes the movie really interesting to watch, even for todays standards. The movie has some interesting camera positions, such as a couple of over-shoulder shots. But also the storytelling is interesting and style-full, such as in the sequences were the husband is faking emotions and in the background the mirror opens with a couple of hand-puppets playing the exact same scene, with the words 'all theater' appearing. It makes the imaginative Germaine Dulac directing also one of the highlights of the movie.<br><br>Alexandre Arquillière is brilliantly repulsive as the husband and Germaine Dermoz is great as the obviously more intelligent wife. There are a couple of more characters but the movie does a good job at concentrating mostly purely on the two main character were after all the movie and its plot is all about of course.<br><br>In todays perspective, the movie is both interesting and beautiful to watch.<br><br>8/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[18,20]},{"title":"Dulac's memorable classic!","rating":8,"date":"8 October 2006","review":"I studied Women and Film with author, Dr. Sandy Flitterman-Lewis at Rutgers University and this is one of the many films that we watched in the viewing. Germaine Dulac provided us a glimpse into the life of women in France during Pre-World War II era and Post World War I world. Paris was a city who loved the arts at the time and was thriving with literary salons and American expatriates as well. Germaine Dulac never captured as much attention but she should have been on league with her male counterparts like Jean Epstein and others. Sadly, the war and the depression may have ended her career like so many others. We can only imagine what might have been if Germaine Dulac had been given the same advantages that her male counterparts received during that time. But she was one of the lucky ones to get the experienced to direct such films like this that are controversial and eye opening as well. Language is not necessary since sound didn't come until the 1930s and Germaine's career went elsewhere.","user":"Sylviastel","rank":[8,14]},{"title":"Good example of French impressionistic style","rating":6,"date":"2 December 1999","review":"This film is only useful to those studying the French impressionistic style of film making or the issues surrounding women early this century. As a film it is throughly uninspiring. I saw it in film class and it demonstrated what I had been learning about but I would not recommend it to anyone who does not have an academic interest of some sort.<br><br>Its plot is simply recounts a few days in the life of a repressed French housewife. Its main focus is how Madame Beudet views her life and her histrionic husband. As you might have guessed the title is meant to be sarcastic.","user":"Josef Tura-2","rank":[16,36]}]