[{"title":"Southwest trash that burns out of control","rating":9,"date":"26 December 2000","review":"This is classic southwest film noir/romance novel brought to life.  Although the plot is the standard lets kill a cuckolded, rich husband (with sex!) and take off with the new handsome stranger, the heat of this film lies in its characterizations.  Don Johnson is almost perfect as the handsome stranger/used car salesman/bank robber/arsonist/white knight in shining (but obviously tarnished) armor.  Jennifer Connelly's understated desperation at her situation is almost exactly balanced by Virginia Madsen's almost over the top vixen/gold digger. Other characters add the perfect backdrop to the action (Charles Martin Smith's \"nose sniff\" scene is absolutely classic).  The twists and turns of the plot and revelations makes this movie constantly interesting.<br><br>It really doesn't get much better than this--Jennifer Connelly does a rare, for her, nude scene, as does Virginia Madsen, Don Johnson, and a bevy of strippers.","user":"rlcsljo","rank":[38,42]},{"title":"An Unknown Gem and One of the Most Amoral Stories of the Cinema History","rating":9,"date":"18 October 2010","review":"When the drifter Harry Madox (Don Johnson) reaches a small town in Texas, he gets a job as used car salesman with the dealer George Harshaw (Jerry Hardin) and settles down in a hotel room. During a fire, Harry observes that the local bank is left empty and open without any security. Sooner he plots a scheme to rob the bank, provoking a fire in his room to distract the employees. When Harry meets George's wife Dolly Harshaw (Virginia Madsen), the easy woman teases him and they have sex. Harry becomes the prime suspect of the bank heist and is arrested, but Dolly provided the necessary alibi to release him and blackmails him to have a love affair with her. However, Harry falls in love for Gloria Harper (Jennifer Connelly), who works as accountant in the dealership. He discovers that Gloria is blackmailed by the despicable Frank Sutton (William Sadler) and he decides to press Sutton. But in the end, Dolly gets what she wants. <br><br>\"Hot Spot\" is an unknown gem and one of the most amoral stories of the cinema history. With the exception of the sweet Gloria Harper and the cuckold George Harshow, the other three lead characters have no moral or ethical codes and Virginia Madsen performs one of the most despicable and Machiavellian femme fatale of the cinema. This masterpiece of Dennis Hopper is certainly the best work of Don Johnson and the soundtrack is stunning and among my favorites. I have just watched \"Hot Spot\" maybe for the sixth or seventh time and this film-noir has not aged. My vote is nine.<br><br>Title (Brazil): \"Hot Spot – Um Local Muito Quente\" (\"Hot Spot – A Very Hot Spot\")<br><br>Note: On 29 October 2011, I saw this film again.","user":"claudio_carvalho","rank":[32,35]},{"title":"A very good Don Johnson movie and performance. Really, it is!","rating":7,"date":"24 October 2001","review":"If you are like me, you might have turned on HBO late the other night, and thought.... \"Damn, a Don Johnson movie\". Luckily I gave this film a chance and found a real winner. Don's performance is not just good, but I think it is his best ever. Jennifer Connelly is just perfect in the role of the frail and beautiful girl next door. But Virginia Madsen steals the show. She is that woman you just love to hate, but just can't keep your hands off of. Just watch the flick to see what I mean.<br><br>As the credits rolled across the screen at the end, I realized that Dennis Hopper directed this \"Red Rocks West\" like film. No wonder I enjoyed it. I give it a solid 7 out of 10.","user":"korch-3","rank":[46,53]}]