[{"title":"Wish they could all be like this","rating":8,"date":"14 November 2005","review":"Another Sam Fuller nitty gritty, down-to-earth where the rubber meets the road movie. There is nothing extra in this movie. Every word every action is meaningful. I wish more directors today would study Sam Fuller. It seems that only Quentin Tarantino ever heard of Sam.<br><br>The premise of this film is a little unlikely- Korea early in the war and one infantry platoon is assigned to hold off three Chinese and North Korean Divisions while the rest of the U.S. Division regroups. While it is more likely that a larger US force would have had such an assignment the small number of men comprising a single platoon makes for some real character development. There are some great characters here. Fuller wrote some real life into them. I believe Fuller was a combat vet from WWII so he knows what he writes- the fear, the rage, the fear again. There are lots of nice little bits here- the frozen foot while holding up in a cave. No one is sure whose foot it is that is being revived as all their feet are frozen. I had to throw another log in the woodstove after that scene.<br><br>If you are interested in war movies without flag waving and corny dialog this movie is for you.","user":"jglapin","rank":[25,27]},{"title":"Excellent War Film","rating":8,"date":"12 May 2006","review":"The premise of this film is factually based on Task Force Faith in the Korean War:In late November 1950, the Chinese struck, along the Chongchon River, and overran several ROK divisions and landed an extremely heavy blow into the flank of the remaining UN forces. The resulting withdrawal of the United States Eighth Army was the longest retreat of an American unit in national history. In the east, at the Battle of Chosin Reservoir (November 26December 13) a 3,000 man unit from the US 7th Infantry Division, Task Force Faith, was virtually wiped out, with numerous hand to hand fighting. The Marines fared better; though surrounded and forced to retreat, they inflicted heavy casualties on the Chinese who committed 6 divisions while trying to destroy the Marines.<br><br>Of the Task Force Faith and the 2,500 troops trapped by the Chinese, about 1,500 eventually made it back to American lines, the majority of them wounded or badly frostbitten. Roughly 300 able-bodied survivors were formed into a provisional battalion which was attached to the Marines and fought with them in the breakout of the 1st Marine Division during the remainder of the Battle of Chosin Reservoir. Over 1,000 soldiers of Task Force Faith were killed or died in Chinese captivity.<br><br>This film is a very accurate, no frills look at the emotions that come with perceived lost causes during war.","user":"bradford-watson","rank":[33,37]},{"title":"A tight, straight-to-the-point war movie without fluff or melodrama","rating":28,"date":"28 August 2008","review":"Fixed Bayonets completes director Samuel Fuller's one-two of 1951 movies about the Korean War, the other being the equally (maybe even slightly better) gritty and gripping The Steel Helmet. For those unfamiliar with Fuller's style, let's just say it is as far removed as possible from what Hollywood passes for war movies the past 20 years. No sentimentality and schmaltz here, just a straight-forward and fine-tuned soldier movie, from the boys, for the boys.<br><br>Fuller, a war veteran himself, takes a no-frills, realistic approach. With a tight script that weaves themes of courage and confronting one's fears into superb suspense and action scenes that have stood the test of time admirably, Fixed Bayonets does exactly what it says on the cover. The miniature work is decent enough and the studio backlot that passes for the Korean mountains completes the illusion without distractions. It's still a low-budget b-movie but it's holding well at the seams. The acting is all-around solid with Gene Evans once again stealing the show as the gruffy, no-nonsense Sgt. Rock.<br><br>Having worked as a journalist for New York newspapers in his younger years, Fuller understands the importance of story above all. Sure, he's not exactly the epitome of subtle - the inner monologues for example should have been avoided altogether. But I'm willing to ignore that because his movies have a sense of urgency and conviction that is hard to find: he's a man with a story to tell, he grabs you by the shoulder and says \"this is how it happened, now watch this\". And \"this\" is not about the politics or dramatization of war but war itself, men killing other men in some snowy hills in the middle of nowhere.","user":"chaos-rampant","rank":[17,18]}]