[{"title":"Melodramatic treatment of the evils of capitalism and its effect upon the human psyche...","rating":8,"date":"1 February 2007","review":"This is a curiously interesting movie for three reasons: first, it has a chilling performance from Robert Ryan as Smith Ohlrig (what an odd name) whose persona in this narrative is apparently based on the very eccentric  and fabulously wealthy  recluse, Howard Hughes; second, it has James Mason  with still a very British accent  as poor doctor Larry Quinada, on the East Side of New York, tending to the poor of that area; and third, there is the radiant Barbara Bel Geddes as Leonora Eames, caught between the two men, trying to decide who to choose...<br><br>So, it's a rags to riches to rags story about Leonora who, after a brief -- rocket-like, you might say  courtship with Smith, decides to accept his marriage offer for a life of luxury  but after the honeymoon, she finds that, well, the honeymoon is over: she may as well be a wall-flower for all the interest that Smith shows towards her. Why is that? You see, Smith, being the mighty merchandising mogul he is, is a very acquisitive person and whatever he sees that he wants, he gets. Once he's got it, however, he tends to lose interest... Leonora thinks she loves him, but what she really loves is money and wealth.<br><br>Tiring of her eventually, Smith allows her to leave when her boredom reaches volcanic proportions: she's just too much trouble to be troubled with. So, searching for something useful to do, she takes a job as a receptionist in Doctor Quinada's office  and, of course, she and he eventually fall in love. All the while, of course, Smith has his agents watch Leonora 24/7, without her knowledge.<br><br>Eventually, the pot boils, the three confront each other at Smith's incredibly, disgustingly rich mansion where Smith succumbs to his own psychopathology (that's as much as I'll tell you --- when you see it, you'll know what I mean), leaving Leonora  sadder but wiser  free to take up the socially good life with the good doctor. As the world turns, all is well with the world, sort of...<br><br>The messages about the state of that world are strong, indeed almost totally lacking in any subtlety, with lines such as \"He was a human being...\", \"nobody's poor by choice...\", \"money alone isn't security\" and others, all of which starkly inform the viewer that the price of excessive wealth and social nihilism combined is so close to madness it's not worth chasing; far better, instead, to reject such excesses and concentrate on being a valuable member of society.<br><br>Mason and Bel Geddes are good support for Ryan who really carries this movie as the menacing, quasi-sociopath. But, I also enjoyed the very smooth performance of Curt Bois as Franzi, the sycophantic sidekick to Smith: Franzi's always too ready to please and calls everybody 'darling', even when he's treated like dirt by almost everybody  a slimy metaphor for the depths to which some go in order to survive in the world of untrammeled excess. But even Franzi has his limits, as you will find out.<br><br>Some great camera work and all in lovely black and white makes this movie a worthwhile addition to the film-noir genre. Watch particularly for the dark scenes in Smith's mansion and, later, the swiveling camera work when Doctors Quinada and Hoffman discuss Leonora's absence from their office. You just don't get shooting like that anymore...<br><br>Highly recommended for all you film-noir fans.","user":"RJBurke1942","rank":[40,42]},{"title":"A Brilliant Film from Ophuls' Time in Hollywood","rating":8,"date":"3 March 2008","review":"Barbara Bel Geddes is perfect as a starry-eyes young woman who wants to make something of herself. She goes to charm school. Who would ever dream that a young lady in such a cloistered setting would meet and be wooed by a fabulously wealthy eccentric!<br><br>\"Caught\" is cast in a unique manner. Maybe it was the director's lack of familiarity with American performers. More likely, these are the people who were most eager to work under him. Whatever the reason for his choosing Robert Ryan to play the millionaire, it was brilliant casting: Ryan was a superb actor. He was tall and intense. In his most famous noirs, he plays cops or military men. Yet the character he plays here is withdrawn, well-spoken, and even a bit effete. He's in analysis, to boot! It's an exceptionally good performance that today would win an actor all sorts of awards.<br><br>James Mason is also cast very much against type: He plays a doctor who treats poor people for little or no pay. (Light years, not just a bit more than a decade, away from his Humbert Humbert!) And Ryan has a manservant who plays piano and calls everyone, male or female, \"darling!\" He is played to perfection by Curt Bois.<br><br>\"Letter from an Unknown Woman\" is a lovely film and probably Ophuls' most famous American work. It'd dreamy, romantic, heartbreaking. \"Caught\" is very different -- I would place it squarely as film noir. However, it does not lack for his famous shots of people ascending staircases and doing other graceful things beautifully.<br><br>If only for Ryan's performance, \"Caught\" is a must. And there is far more to it than that one performance.","user":"Handlinghandel","rank":[28,29]},{"title":"Bel Geddes finest hour in Ophul's melodrama about paranoia of unshackled capitalism","rating":8,"date":"14 January 2002","review":"Of the many European emigres who helped shape American cinema, especially film noir, Max Ophuls brought one of the subtlest, most elusive sensibilities.  Caught reflects this elusiveness:  Part melodrama, part romance, part film noir, it's an unsettling film that burrows into complacent assumptions about freedom and success.<br><br>  Department-store model Barbara Bel Geddes buys the notion that snagging a rich husband is the key to happiness.  Once wed to disgustingly wealthy tycoon Smith Ohlrig (Robert Ryan), however, she finds herself a bird in a gilded cage whose owner is increasingly jealous, abusive and frightening. (The rumors are that Ohlrig was modelled on Howard Hughes, much as Charles Foster Kane was on William Randolph Hearst.) Finally she leaves him to work in the office of a poor pediatrician (James Mason), with whom she falls in love. But she and Ryan keep drifting back together, in a love-hate relationship that grows ever more doomed and desperate (there's a virtuoso scene in Mason's offices, at night, centering on her ominously empty desk)....<br><br>This is certainly Bel Geddes' most complex and fleshed-out screen performance, but the script suggests dimensions that she only hints at; though the part wouldn't work with a tigress like that other Barbara, Stanwyck, taking on Ryan in an equal grudge-match, an actress with a mite more edge might have shown how the caged wife came to draw courage and defiance precisely from her position as a powerful man's wife.  (Bel Geddes is just too wholesome and likeable to bring off this ambiguity.) And the heavy paw of the studio descends as Caught comes to a close:  The conclusion is too quick, loose ends flap in the breeze, and satisfaction remains incomplete. Ryan's dynamo performance -- he could really make the flesh crawl -- and Ophul's elegant direction compensate for a half-baked denouement imposed by a craven studio, lest anybody take personal or political offense.","user":"bmacv","rank":[50,55]}]