[{"title":"Good clean fun.","rating":22,"date":"22 July 1999","review":"I think there's one thing that a guy who reviewed this before me didn't realize -- this wasn't supposed to be a serious film. At least, I hope it wasn't supposed to be a serious film...<br><br>I'm sorry if I'm evil for saying this, but I *LOVED* this movie. There were so many bad things about it: the actors were horrid, a lot of things didn't make any sense (like how nitrous oxide did *NOTHING* to the main character), the music itself and the fact that none of the four cameras actually moved come to mind. And yes, I believe it was intentionally supposed to be humorous.  But still, it's a zombie movie, and you can't expect zombie movies to be serious masterpieces.<br><br>If you're one of those people who enjoys quoting bad films, seeing obviously fake blood and/or gore or you just have a 'different' sense of humour, pick up 'Blood Suckers from Outer Space' if you can find it -- you'll probably enjoy it.  But if you are a straight on serious zombie freak, pass it over -- you'll hate it.","user":"b. koski","rank":[10,12]},{"title":"Sorta funny","rating":25,"date":"25 July 2018","review":"Yeah it's full of plot holes and bad acting but I still enjoyed this movie. I love that they acknowledge that the plot doesn't make any sense. See it if you can.","user":"TheMeanGreenMidget","rank":[4,4]},{"title":"An absolute classic!","rating":27,"date":"27 July 2007","review":"I rented this movie on VHS back in the winter of 2002. Judging by its cover I didn't really expect much from it. However, being a fan of obscure horror movies I felt that I just had to rent it. <br><br>After watching it the first time through I got hooked. The extremely low budget feel of Bloodsuckers combined with the terrible acting and equally bad (but funny) dialogue made this one of my favorite movies of all time. The movie is cheesy but not lame. Even the parts that aren't meant to be humorous will make you laugh. I used to watch it all the time and quote lines from the different characters.<br><br>I'm still waiting for this movie to be released on DVD.","user":"InDaValley","rank":[4,5]}]