[{"title":"* * Out Of Five","rating":4,"date":"29 March 2006","review":"This time the nerds led by Robert Carradine and Anthonny Edwards go to Florida where there they meet a new breed of jocks who they face off against and basically destroy in the end, the problem with this entry is that the nerds this time are too cool to really be considered nerds and they even get a girlfriend sympathetic to their cause, this undermines all the humor, not to mention that away from the college dorm setting, there really isn't much the nerds can do that they didn't in the original. As a sequel this is all disappointing stuff, but aside from James Hong who gives an inspired performance as well as maybe a few vaguely amusing moments, Revenge Of The Nerds II is a big disappointment.","user":"bronsonskull72","rank":[7,10]},{"title":"not nearly as good as the first one,but still not bad","rating":6,"date":"6 July 1999","review":"I love the first revenge of the nerds. The second one is not nearly as good as the first one, but still pretty good. The nerds are still funny in this movie. Booger is once again the funniest of them all. The second one is also entertaining at times. They could've make this movie better if they would've kept the nerds at Adam's college, but the second one is still watchable, and funny. I give revenge of the nerds II: nerds in paradise **1/2 out of ****","user":"jaws!","rank":[7,10]},{"title":"My brief review of the film","rating":28,"date":"28 May 2005","review":"A terribly silly but awfully amusing little sequel, it may be a touch predictable, and it is missing Thomas Newman's excellent theme song, but having the same likable characters on hand helps it to be equally as fun as the first film. Some of the jokes are really hilarious, and arguably I would say that it is funnier than the first film. I would not definitely call it better, but it is certainly at least on the same level, with an interesting charm radiating from the nerdy characters. And there is another song to take the place of Tom Newman's ditty: an amusing little number called \"No on Fifteen\". The film seems to get a lot of negative feedback, but I cannot agree - it may not be a great film, like the first, but it is by all means amusing, like the first.","user":"sol-","rank":[8,12]}]