[{"title":"''Out For Kicks And In For Trouble!''","rating":8,"date":"2 August 2005","review":"Contrary to one reviewer's information, \"Born Losers\" was a smash at the box office the FIRST time it was released in '67. And it's easy to see why. It's the most entertaining of the \"biker movie\" genre, because it has a story and vivid characters. Elizabeth James is Vicky Barrington, a vacationing college student who comes up against a nasty motorcycle gang in a California mountain town. Naturally, the gang, headed by a weathered Jeremy Slate, take off after Vicky (who is on a motorcycle wearing white boots and a matching bikini) and two of them eventually catch and rape her. She's not the only victim. Three incredibly foolish local girls visit the gang's \"clubhouse\" and meet a similar fate. But they don't have a champion like Tom Laughlin (in his first appearance as Billy Jack) who manages to get Vicky out of danger (at least for a while) and subsequently falls in love with her. \"Born Losers\" has a great score by \"Wild Angels\" composer (and future Lieutenant Governor of California) Mike Curb, good acting by a large cast, and a fine cameo appearance by Jane Russell as the trashy mother of one of the victimized girls. Add some beautiful locations and some slick motorcycle stunts, and you have a \"Born Winner!\" Incidentally, beautiful Ms. James turned up as a police dispatcher in the seventies cult classic, \"Dirty Mary Crazy Larry\". She also wrote the screenplay for \"Born Losers\" (under the pen name 'E. James Lloyd').","user":"phillindholm","rank":[36,43]},{"title":"Iconoclastic And Colorful","rating":7,"date":"7 September 2007","review":"Given its low budget, this is not a bad movie. A motorcycle gang, led by the scruffy Jeremy Slate, terrorizes a small California town, and in the process rapes several college girls. There's lots of tough talk, motorcycle noise, and violence, as you would expect for a biker film.<br><br>Of course, to balance out all the villainous mayhem, you gotta have a hero on the scene. And for the era in which the film was made, there was no better hero than the charismatic loner, half-breed Billy Jack, played with serene gusto by Tom Laughlin. He's a one-man show of moral and physical strength, as he outwits and outfights the biker roughnecks. The film makes the point that bad parenting and ineptness in traditional law enforcement foster an environment conducive to delinquency.<br><br>Interestingly, although this is the first Billy Jack film, Laughlin played a similar role ten years earlier, in a movie called \"The Delinquents\" (1957). His character was Scotty, a good guy teenager who gets mixed up with a bunch of high school hoodlums. Whereas in \"The Delinquents\" all the villains are kids who drive around in jalopies, in \"The Born Losers\", the kids have grown into adults who ride motorcycles.<br><br>In \"The Born Losers\" the characters tend to be stereotypes. In a time period that immediately preceded the women's lib movement, the film's female characters are very, very subservient. The film's plot does depend on contrivances to some extent. Dialogue lacks subtext. Production design is ... colorful. And the costumes reek of late 60's garish \"hip\" (love those pink walls and pink clothes), all perfectly in sync with the Age of Aquarius. Tom Laughlin's direction is excellent. Color cinematography is very good. The outdoor scenery is wonderful, as is the music in the opening title sequence.<br><br>I've seen a number of biker films. \"The Born Losers\" is one of the best. It was highly successful at the box office, and led to later Billy Jack films. It has a cinematic style that is almost iconoclastic; not insignificantly, it preceded \"Easy Rider\" by a couple of years. Such was the impact of \"The Born Losers\".","user":"Lechuguilla","rank":[17,21]},{"title":"Sixties artifact with the debut of Billy Jack!","rating":9,"date":"9 April 2001","review":"While most people are familiar with Tom Laughlin's half Native American/half Anglo cult figure Billy Jack through THE LEGEND OF BILLY JACK, many don't know that the character originally appeared in this flick, an off-kilter biker flick about a group of psycho cyclists who terrorize a small California town over Spring Break and zero in on a young college co-ed whom they raped and don't want to testify against them. No, the film isn't as good(or political)as the two sequels, but it does say something about the isolation of the individual in a society that won't stand up and protect that individual from harm. There's a profound sense of solitude in the cinematography of beaches and seaside highways and the sparse, often inarticulate dialog. And, looking closely at the motorcycle gang, you can see some none-too-subtle homosexual overtones. Of course, all the quick cuts and zoom shots earmark the film as a product of late sixties moviemaking. Still, if you want to catch a glimpse of Billy Jack's debut or like to study sixties film styles, take a look at this one","user":"thomandybish","rank":[19,24]}]