[{"title":"Altman's mischievous take on a cinema archetype","rating":20,"date":"20 August 2004","review":"The very embodiment of '70s Hollywood genre revisionism, Robert Altman's film of The Long Goodbye stands as one of his most accessible, wittily misanthropic films, and probably the finest performance of Elliot Gould's career to date.<br><br>A warning for Raymond Chandler purists: you probably won't like this film. Altman and screenwriter Leigh Brackett had quite a task in adapting Chandler's second-last novel to the screen, for in it the 'knight errant' Phillip Marlowe comes over more like a prudish sap. Altman and Brackett have streamlined the narrative, removed peripheral characters, and  crucially  transformed Marlowe into a murkier, more comically ambiguous protagonist.<br><br>In Altman's and Gould's hands, Marlowe is laconically relaxed, murmuring, alternately amused and annoyed at the world. Like Chandler's hero, he is an outsider, a spectator, everywhere he goes. Unlike the literary Marlowe, Gould's character seems washed up on the shores of an unfamiliar land, his nobility as crumpled and stale as his suit.<br><br>Along for the ride are the archetypal Chandler villains and victims: self-hating celebrities, young wives trapped in loveless marriages, crooked doctors, low-rent psychopathic gangsters, bored cops, flunkies lost out of time. Typically, the milieux Marlowe moves in range from the affluence of the Malibu Colony to the cells of the County Jail. Altman, however, wishes to make a film in and about 1973; the film is shot through with the psychic reverberations of the end of hippiedom and the remoteness of the 'Me Generation'.<br><br>Another Altman touch is his openly expressed contempt for Hollywood and its conventions. As if to acknowledge the artificiality of a private detective story in the midst of 1970s Los Angeles, the film is suffused with jokey references to cinema. Bookended with 'Hooray for Hollywood', the film shows gatekeepers impersonating movie stars, characters changing their names for added class, hoods enacting movie clichés simply because that's where they learnt to behave. Even Marlowe himself refers to the artifice when talking to the cops: 'Is this where I'm supposed to say 'What's all this about?' and he says 'Shut up, I ask the questions' ?'<br><br>As for the supporting cast, Sterling Hayden shines out as the beleaguered novelist Roger Wade. There is more than a touch of Hemingway in Hayden's bluff, blustering, vulnerable old hack. Baseball champ and sportscaster Jim Bouton is casually mysterious as Marlowe's friend Terry Lennox, Laugh-In alumnus Henry Gibson is suitably greasy as Dr Verringer, actor/director Mark Rydell (best known for 'On Golden Pond') is convincingly chilling as gangster Marty Augustine, and Nina van Pallandt lends a dignified, defiant pathos to her role as Eileen Wade.<br><br>Special note must be made of Vilmos Zsigmond's tremendous photography, employing his early 'flashing' style of exposure to lend Los Angeles a suitably sultry, bleached-out aura. Also deserving attention is John Williams' ingeniously minimalist score. Comprised solely of pseudo-source music, the score is a myriad of variations on a single song, appearing here as supermarket muzak, there as a party singalong, elsewhere as a late night radio tune.<br><br>The film's controversial ending is utterly antithetical to Chandler's vision. The message from Altman, however, is loud and clear: Chandler's world no longer exists  if indeed it ever did.","user":"Auteur_Theory_Stooge","rank":[128,154]},{"title":"Quirky, Atmospheric, Unique Altman Spin to Chandler!","rating":9,"date":"23 April 2007","review":"I admit, when I first viewed \"The Long Goodbye\", in 1973, I didn't like the film; the signature Altman touches (rambling storyline, cartoonish characters, dialog that fades in and out) seemed ill-suited to a hard-boiled detective movie, and Elliott Gould as Philip Marlowe? No WAY! Bogie had been perfect, Dick Powell, nearly as good, but \"M.A.S.H.'s\" 'Trapper John'? Too ethnic, too 'hip', too 'Altman'! Well, seeing it again, nearly 34 years later, I now realize I was totally wrong! The film is brilliant, a carefully-crafted color Noir, with Gould truly remarkable as a man of morals in a period (the 1970s) lacking morality. Perhaps it isn't Raymond Chandler, but I don't think he'd have minded Altman's 'spin', at all! In the first sequence of the film, Marlowe's cat wakes him to be fed; out of cat food, the detective drives to an all-night grocery, only to discover the cat's favorite brand is out of stock, so he attempts to fool the cat, emptying another brand into an empty can of 'her' food. The cat isn't fooled by the deception, however, and runs away, for good...<br><br>A simple scene, one I thought was simply Altman quirkiness, in '73...but, in fact, it neatly foreshadows the major theme of the film: betrayal by a friend, and the price. As events unfold, Marlowe would uncover treachery, a multitude of lies, and self-serving, amoral characters attempting to 'fool' him...with his resolution decisive, abrupt, and totally unexpected! The casting is first-rate. Elliott Gould, Altman's only choice as Marlowe, actually works extremely well, BECAUSE he is against 'type'. Mumbling, bemused, a cigarette eternally between his lips, he gives the detective a blue-collar integrity that plays beautifully off the snobbish Malibu 'suspects'. And what an array of characters they are! From a grandiosely 'over-the-top' alcoholic writer (Sterling Hayden, in a role intended for Dan Blocker, who passed away, before filming began), to his sophisticated, long-suffering wife (Nina Van Pallandt), to a thuggish Jewish gangster attempting to be genteel (Mark Rydell), to a smug health guru (Henry Gibson), to Marlowe's cocky childhood buddy (Jim Bouton)...everyone has an agenda, and the detective must plow through all the deception, to uncover the truth.<br><br>There are a couple of notable cameos; Arnold Schwarzenegger, in only his second film, displays his massive physique, as a silent, mustached henchman; and David Carradine plays a philosophical cell mate, after Marlowe 'cracks wise' to the cops.<br><br>The film was a failure when released; Altman blamed poor marketing, with the studio promoting it as a 'traditional' detective flick, and audiences (including me) expecting a Bogart-like Marlowe. Time has, however, allowed the movie to succeed on it's own merits, and it is, today, considered a classic.<br><br>So please give the film a second look...You may discover a new favorite, in an old film!","user":"cariart","rank":[80,96]},{"title":"No mixed feelings about this one....worked for me","rating":10,"date":"19 October 2006","review":"It's true. You can't have mixed feelings about The Long Good-bye; you'll either love it or hate it. I started the movie with what I pretended was an open mind, but a secret hope that I'd be fully justified in hating it. In my defense, The Maltese Falcon is my favorite movie and Bogie is my favorite actor. Noir is my favorite film genre and I love Howard Hawk's The Big Sleep wihich had Bogart as the definitive Marlowe.<br><br>Altman's take on Chandler's other book with private eye Marlowe, The Long Good-bye, updates the action to the 1970's. He introduces a very 70's theme song and finds as different an actor as he can from Bogart for the role of Marlowe. From the opening frame, Elliot Gould plays Marlowe like a push-over. He's a man who constantly mutters to himself, suffers nervous tics, can't even fool his cat, is afraid of dog's and seems to be the only man not attracted to his sexy hippie neighbors despite their friendliness towards him and obvious promiscuousness.<br><br>However, Gould really creates a unique persona with the way he walks, talks, wise-cracks and operates. He becomes a believable person - which is why the uncharacteristic ending is so impacting. The photography, especially the night scenes, are beautifully filmed. The theme music plays everywhere - a Mexican funeral, a doorbell, a car radio etc and with different singers. There are other layers of flesh added to the telling that really work - like the compound security guards impressions of James Stewart, Barbara Stanwyck, Cary Grant and best of all Walter Brennan aka Stumpy from Rio Bravo.<br><br>This movie worked great for me and the plot, intricate though it was, was understandable. I will not compare this Marlowe to Bogart's, but do find it admirable that Altman just stuck to the goal of making a good movie without trying to ape or make obvious references to the noir genre.","user":"faraaj-1","rank":[56,71]}]