[{"title":"Modern directors should take note of the style.","rating":8,"date":"21 February 2005","review":"What a change of pace this movie is as compared with its genre today. I'm no old fogey but would that modern directors become smart enough take several pages from its book.<br><br>The Bullit character is a precursor of Dirty Harry but a bit more cerebral. Stylistically, the director sets the stage beautifully for McQueen's Bullit. The movie has a European feel (director Peter Yates is a Brit) and achieves its dark mood through quiet understatement. The musical score for instance. Today, music is overly used, overly loud and manipulative. (i.e. in case you are not moved by this scene, here are a division of amplified violins to remind you to weep). In 'Bullit' the music is sparingly used and doesn't intrude at all. It complements the directorial style without setting the agenda.<br><br>The feeling of reserved naturalism is achieved through editing and dialogue. There really aren't very many lines in the movie and when characters do speak they are very succinct. Notice the last 15-20 minutes of the movie, most of which takes place at the airport. Hardly a line in it. There is none of the chattiness so prevalent today (especially post \"Pulp Fiction\") which is so tedious (unless the script is tip-top, which is rare).<br><br>Editing is, perhaps, its greatest strong point. The many long edits deserve equal credit with the dialogue in setting the low-key mood. The cinema verite dialogue of the airport scenes (and, say, the scene where McQueen and Don Gordon search the trunk) combined with the long cuts add greatly to understated feel while adding realism.<br><br>And the performances are top notch. The spare script helps McQueen shine since the taciturn moodiness fits his persona to a tee. There are very fine performances from all of the supporting cast, from Don Gordon to Bisset to Fell to Duvall to Oakland. This is a great movie for watching faces. Note the expressions of the hit men during the chase scene (just another example of this movie letting the little touches speak volumes).<br><br>The chase scene certainly deserves its billing as one of the best in movie history. Recently, 'The Transporter' was lauded for its opening chase sequence. The one in 'Bullit' is a marvel compared. In 'The Transporter' sequence I'm not sure there is a cut that lasts more than three seconds. In 'Bullit' it is again the editing which sets it apart here. The long edits give you the feel of acceleration and deceleration, of tire smoke and gears, of wind and the roller coaster San Francisco streets. You are given the time to place yourself in the frame. In short, 'Bullit' uses real craftsmanship. Films like 'The Transporter' use hundreds of quick edits to mimic the danger and immediacy of 'Bullit' but it comes across as hot air, confusion instead of clarity. The two scenes are perfect set pieces of easy (and hollow) Mtv-style flash versus real directorial substance.","user":"jd372","rank":[209,235]},{"title":"Frank Bullitt Is Slick","rating":13,"date":"13 July 2014","review":"Steve McQueen is Frank Bullitt! Frank Bullitt is slick! 'Bullitt' is thrilling! The stylish mystery thriller that created a basis for all future police procedurals to follow! With fantastic direction from Peter Yates and immaculate attention to detail on the stunning cinematography, 'Bullitt' is an attention-demanding and action-packed adventure supported by a jazz-fuelled score. When reviewing this crime flick, who could overlook the unforgettable Mustang v Charger chase through the streets of San Francisco which is arguably the greatest and most influential car chase ever filmed. 'Bullitt' is a dark and suspenseful masterpiece from Peter Yates.","user":"CalRhys","rank":[57,65]},{"title":"Maximum Cool","rating":1,"date":"1 November 2001","review":"Steve McQueen's career peaked in 1968 with \"Bullitt\" and \"The Thomas Crown Affair,\" both ideal vehicles for his cool persona.  Although superior to its recent remake, \"Crown\" has not aged gracefully, while \"Bullitt\" has held up fairly well.<br><br>Cool though he may be, Frank Bullitt is a totally committed detective, perhaps even more so than Gene Hackman's Popeye Doyle or Clint Eastwood's Dirty Harry Callahan.  Bullitt is a complete professional who never takes his eye off the objective, no matter how much interference he encounters from his superiors or from Robert Vaughan's scheming politician, Walter Chalmers.  And Bullitt, unlike Doyle or Callahan, operates without the histrionics.  No one-liners, no yelling and screaming tantrums from this officer.  You may not like him very much, but you have to respect his dedication to duty and you'll quickly share his absolute contempt for Chalmers.<br><br>\"Bullitt\" is best remembered for its spectacular car chase in which McQueen reportedly did most of his own driving.  But this is not primarily an action film.  Aside from the chase and the final shootout at SFO, there's not a lot of violence.  Most of the attention is on Bullitt's maneuvering to unravel the mystery and to keep Chalmers off his back.   <br><br>Recommended if you like McQueen or policiers in general.  The pace may be a little slow for people under 30 who are used to a more slam-bang, less cerebral approach to this sort of thing, but \"Bullitt\" is still worth your time.  Just don't expect \"Lethal Weapon.\"","user":"gvb0907","rank":[66,78]}]