[{"title":"One of my favorite movies of all time","rating":10,"date":"15 December 2013","review":"When I first saw \"Catch-22\" I couldn't believe it was made in 1970; the structure of this film is so modern it could have been made yesterday. Frame for frame a masterpiece of storytelling unfolds before your eyes; a satire, a comedy, a tragedy: superb and unforgettable. The surreal humor captures the craziness of war in a way - I think - no other movie does.<br><br>The film was released at around the same time as the somewhat similarly themed \"M*A*S*H\", and while Altman's movie was a hit, \"Catch-22\" bombed at the box office. In retrospect I would say that both films have aged very well, but Catch-22 offers a much more cinematic experience and has a narrative that is as modern as anything that's being released today. One of my favorite movies of all time.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[83,95]},{"title":"The Best Film Adaptation of the Book Possible","rating":8,"date":"19 January 2003","review":"The book Catch-22 is my favourite novel, and is extremely deep and intricate. It has great moments of comedy which slip quickly into tremendous moments of horror. That novel as it is could never feasibly be addapted into a live action anything.<br><br>However, upon viewing the film, I was quite impressed and happy with it. I'm not an unrealistic person, so I understand that they had to cut out scenes and characters and subplots to condense it for the film. Overall, of course, it lost some of its greatest moments which are in the ironic humor of the narrative style of the book. But it was not a bad film at all. In fact, I thought it was one of the best adaptations I have seen. I think almost everything you see on screen happens in the book.   <br><br>Apart from that, it was extremely well casted. The characters were just as I have envisioned them in my head while reading the novel (except that Major Major shrank about a foot... but that's not matter, because Bob Newhart was great anyway). The cinematography was beautiful, the acting was awesome (Alan Arkin was perfect), and the flashbacks to Snowden were done stylishly and surrealistically. <br><br>Basically, it's a good movie. But it's an even better movie if you've read the book, and you know exactly what is going on in some of the characters' heads and what is going on outside of the scenes we see in the film. Overall, I think this is the best anyone could have done with this adaptation, and I applaud the filmmakers for that.","user":"solojones","rank":[21,23]},{"title":"Bravo...Loved it","rating":8,"date":"2 April 2011","review":"I am in love with this book, so when I saw that there was a movie I flipped out and ordered it right away... and it was fantastic. I love the actors and I love how Nichols directed it. However, I was disappointed of the changes they made, where's Dunbar? He was like my 2nd favorite character. He was Yo-yo's best friend.... Also, they said it was Hungry Joe who was cut in half by McWatt, but it was really Kid Sampson, I could see how they didn't want to have too many characters to keep up with (in the book I felt like that was true) but still, Hungry Joe was...amazing, he was hilarious. Also, I'm not sure if I liked how Nately died, opposed to the books version. I suppose it made more since to kill him off when Milo's deal (the bombing thing), but it was when he died in combat mission that really broke Yossarian. I think Jon Voight did an fantastic job of Milo, he was really how I pictured Milo, I was really excited about that. The poignant walk through Rome that Yossarian takes, was so, perfect as well. But all in all, this was an excellent portrayal of the book, I totally imagined this movie (the settings, what Yossarian looked like, everything pretty much) as I was reading the book.","user":"longlivetheweekn","rank":[23,27]}]