[{"title":"Impressive, Bordering on Spectacular","rating":6,"date":"6 July 2001","review":"I noticed that many of the comments on this film were negative.  Those people need to loosen up and get \"just the facts.\"  Maybe I see more of the humor because I am a law enforcement officer, but this film is a scream.  It takes everything that the original series did, and does it with tongue firmly planted in cheek.  Dan Ackroyd's deadpan Jack Webb impersonation is a riot, as are the remarks he makes to Hanks' Pep Streebeck.  A typical example would be after Joe ignores Sylvia Wiss' advances, and Pep calls him on it.  Joe looks him dead in the eye and says, \"Streebeck, there are two things that separate us from the animals.  One, we use cutlery.  Two, we can control our sexual urges.  I don't know about you, but don't drag ME into your private HELL!\"  That line is so Jack Webb-DRAGNET that I'm surprised it never showed up in the 1960's version.  Like the Austin Powers films, DRAGNET spoofs a cultural icon in such a way as to evoke the original. Ignore the silly plot, and just enjoy the ride.**PS**I have actually used the line I quoted above in the line of duty!","user":"deapod","rank":[55,62]},{"title":"Absolutely hilarious!","rating":8,"date":"29 June 1999","review":"Tom Hanks reminds us of just how good a comic actor he is, and Dan Ackroyd just \"becomes\" his character!  I found the movie to be part dead-on parody, part slapstick, part cop movie (with a twist).  Christopher Plummer and Dabney Coleman have a ball with their supporting roles, and Alexandra Paul adds just a dash of sex appeal.  I was smiling from start to finish, and could watch it over and over.","user":"HangEmHi","rank":[27,35]},{"title":"A comic gem!","rating":28,"date":"28 October 2007","review":"I managed to catch Dragnet on one boring late night on HBO and how glad I am to have done that! Without going into the small details, this is a must see.<br><br>The chemistry between Dan Aykroyd and Tom Hanks is just awesome. Both Dan and Tom manages to play their respective characters with sheer conviction. The plot is simple and the dialog hilarious: just the sort you need for straight unadulterated fun.<br><br>Best of all, the move has some of the most brilliant comic moments from 1980's.<br><br>I'm not giving anything away, you'll need to watch to find out ;-)","user":"tanzimhusain","rank":[5,5]}]