[{"title":"Beneath The Surface","rating":7,"date":"4 March 2008","review":"Three hoodlums plot to rob a bank in a small town. But the town has secrets of its own: The bank president is a Peeping Tom. The librarian is a petty thief. The son of the strip-mine owner is an alcoholic; his wife is openly carrying on an affair with the local golf pro. The son of the strip-mine foreman is ashamed of him because he didn't fight in Word War II. The strip-mine nurse is the object of several men's sexual fantasies.<br><br>With a great tough guy turn by Lee Marvin as one of the bank robbers, alternately sniffing an inhaler and stomping on kids' fingers, and Ernest Borgnine as an Amish farmer (!) who isn't completely pacifistic. (Inspiration for WITNESS?) The strip-mining is a wonderful metaphor for the secrets that lurk just underneath the surface of a seemingly placid small town. Would be good on a double bill with BAD DAY AT BLACK ROCK.","user":"rabrenner","rank":[23,30]},{"title":"An excellent little picture, smart and menacing...","rating":20,"date":"20 September 2001","review":"This is a gem, an excellent little picture, smart and menacing. If you're a fan of '50's pictures, particularly crime melodramas then this is a must-see. The plot is simple. A small town is visited by three hoods (Stephen McNally,Lee Marvin,J.Carroll Naish) intent on holding up the bank. The film revolves around their plans and folowing the lives of the townsfolk, who, oblivious to the villains in their midst, go about their mundane, everyday problematic lives until the saturday the two worlds collide. Richard Fleischer made an excellent job of this potboiler,which manages to sustain the tension managed in more celebrated films(High Noon) as the villains arrange their plot to rob the town. There's a stellar cast on display, McNally, Marvin, Ernest Borgnine, Sylvia Sidney and even the normally lifeless performances given by the film's principal, Victor Mature, doesn't happen in this case. It's shot in terrific colour and has a genuine air of small town claustrophobia and menace. Check it out.","user":"Chevington","rank":[33,49]},{"title":"Great Cinematography","rating":8,"date":"28 July 2008","review":"The wide-screen format was at most only two years old when this film was made. Yet, Charles G. Clarke's shot composition in the new wide-screen format is beautiful. This alone makes the film worth watching.<br><br>This is a good example of a color film noir; perhaps not as good as Niagara (1953) or Leave her to Heaven (1945), which were made by the same studio by the way (20th Century Fox), but still a good example from the noir cycle in color.<br><br>One way to understand film noir is that it is simply violent melodrama. Look at The Postman Always Rings Twice (1946) for example. Violent Saturday (1955) is steeped in melodrama, but there is also some extraordinary violence. And the violence here--in typical noir fashion--is the resolution--however bleak--to some of the melodramatic conflict.<br><br>The film has a profound cynicism grinding beneath the surface of the beautiful color photography. And this cynicism remains at the end of the film.<br><br>If you haven't seen this film and you are interested in film noir or film of this period, then I would highly recommend the Violent Saturday.","user":"thartnet","rank":[20,28]}]