[{"title":"The Ultimate Anti-Romance.","rating":10,"date":"18 October 2009","review":"I would say that Paris, Texas is not for everyone, but, truly, that can be said about every movie. But I will say this: fans of methodically paced, beautifully shot, existentially rooted, and purely experiential cinema will not be disappointed. <br><br>Paris, Texas is virtually my favorite movie, and a movie that, whether you like it or not, will leave some impact on you. It is a journey, an experience, an odyssey. <br><br>Yes, it is long. Yes, it is slow. Defined plot points? Please.<br><br>But what this movie does do is place into the mind of it's lead character. Travis Henderson, an older man, gruff and worn out with age, wanders out of the Texas desert after missing from his family for four years. He is mute, and apparently unaware of who he is. His brother Walt finds him, and tries to rehabilitate him back into sanity. The film then covers Travis's journey to reconnect with a past which he has long since forgotten. He reunites with his son, his sister in-law, and eventually, in a scene which I tear up just thinking about, his wife.<br><br>But that is all I will divulge about his wife. That is a scene which you really have to see to believe. <br><br>While this film really doesn't rely on plot, it does have structure and tone. And what carries us through this mystical story is the unbelievably beautiful photography. We see the world as it should be seen: a starkly beautiful, but uncompromising, place. The use of color and motifs really makes this film a marvel to look at. <br><br>And then we get to performances. Everyone's great, so I will focus on our two truly main characters. Harry Dean Stanton plays Travis, a gentle, kind man, that, despite having personal demons, is a great fatherly figure (fine, maybe he isn't the best father...but there's no denying he left an impact on his son's life). And seeing Stanton bring this character to life in the most subtle and somber way possible is amazing. And then we have Natassja Kinski, who plays Jane, his wife. She doesn't show up until the third act, and 95% percent of her performance takes place in one room. But Kinski's portrayal of emotion...and her quiet, yet powerful demeanor...and the way she talks...god, it's unbelievable. Stanton and Kinski have some of the best chemistry ever, which is even more impressive considering they're never in the same room (see the movie...you'll understand). In the end, these two carry the movie on their backs, and do an amazing job doing it.<br><br>You may not cry, but you will think about crying. You will think about all the sad moments in your life. And it will all be washed out of you by movie's end. Believe me, I know this from personal experience. This movie is almost therapeutic in the way. Because the story is healing our own souls at the same time as it is healing Travis's. <br><br>So. What's more to say about Paris, Texas? It's a beautiful movie, one that relies on photography and performances to tell it's story, and a movie that portrays emotions on a master class level. And what do I mean by 'Anti-Romance'? It's not worth explaining here. See the movie, you'll understand.","user":"Glengarry-Glen-Wright","rank":[141,160]},{"title":"A tale of redemption","rating":26,"date":"26 February 2005","review":"Paris Texas is a slow, moody, and delicate study about a man who once ran away from everything and now is coming to terms with himself and learning to forgive himself, by finally facing he people he turned his back on. The Wim Wenders directed movie still today rests in a fairly under recognized status, which doesn't stretch the term \"cult classic\" when applied to it. Paris, Texas is about redemption, the road, family, and the bleakness of the American Southwest. It contains one of the most memorable and unusual openings ever. We hear Ry Cooder's lonely single note twangy guitar on the soundtrack with cinematographer Robby Müller (Barfly, To Live and Die in L.A. , Dead Man) capturing the majestic vistas, rock formations, and the open desert in his camera. Actor Harry Dean Stanton walks out of the dry and desolate landscape, wearing a wornout black sports jacket and dusty red baseball cap. It's a beautifully staged opening sequence. A perfect start to a perfect movie. This man is lost and in need of being found. It's his brother played by actor Dean Stockwell (\"Quantum Leap\", Blue Velvet) who gets word of Stanton's whereabouts and goes after him, which begins the journey of redemption. Nastassja Kinski plays Stanton's young x-wife and the true love of his life. Kinski, the daughter of legendary German actor Klaus Kinski, doesn't make her entrance into the film until the later reels, but her lingering presence is felt throughout. It's almost the same type of thing that Coppola did by not having Brando appear in Apocalypse Now until the conclusion. The scenes that Kinski does have in the end with Stanton are some of the best moments ever captured on film. They're highly emotional and will cause even the most hard-hearted to shed a tear. Both Stanton and Kinski are very subtle and understated in their acting. It's true to their characters. Eight year old Hunter Carson plays Stanton's biological son, who was raised by his uncle (Stockwell). Carson certainly deserves mention in any conversation about great child performances on film. Paris, Texas is a masterpiece. There's no way around it. It's a movie that slowly reveals itself putting the audience right in the shoes of Stanton, who also is trying to remember his past and face it. The story was penned by playwright and actor Sam Shepard, though he doesn't appear in the film. Shepard, a very good playwright, has outdone himself with Paris, Texas surpassing his perhaps more well known, True West. Paris, Texas is a film that must not only be seen, but experienced. Sure the pacing is extremely slow, but as an audience member, use that to your advantage to suck in the picturesque orange southwest desert against the deep blue skys, and the poignant acting, and haunting soundtrack. There's no reason not to treat yourself to this uniquely American masterpiece meditation. It would make a great nightcap for a triple feature with two other simular themed American films, The Searchers and Taxi Driver.","user":"ztruk2001","rank":[111,131]},{"title":"Life-altering. The greatest film of all time.","rating":10,"date":"11 September 2002","review":"I first saw this film almost fifteen years ago and thought about almost nothing else for at least a month.  I have never seen a film before or since that presents the extremes of love, pain, and loss with such immediacy and ruthless candor.  Watching this film with openness, identifying with the characters, made me wince and writhe in sympathetic agony.  I didn't cry; rather, I was reminded of all the times I have wept in my life, and why.<br><br>Perhaps each person person has a film -- usually a masterpiece -- which affects him or her so strongly that it is beyond description.  This is mine.","user":"pschwiesow","rank":[257,323]}]