[{"title":"Bette's masterpiece","rating":10,"date":"20 August 2006","review":"In THE ROSE, Bette Midler plays a character based on the life of Janis Joplin. This one of those rare movies where everything works perfectly. Although she is amazingly talented, I sometimes wonder if Bette herself ever looks back on this movie and wonders how she managed such an amazing portrayal, in the same way that an Olympic skater reviews the footage of a 10.0 performance and is stunned that every blade stroke really is picture perfect.<br><br>While the storyline is memorable, and the acting superb, music outshines everything else. This is a movie from 1979, a time when rock and roll was still considered a lifestyle, and big rock bands were treated with absolute god-like adoration. Music mattered. It was a vital part of peoples' lives, and in THE ROSE it reaches the heights of excellence that normally exist only in memories that have improved with age. In this case, the music sounds as vibrant, exciting, and fresh today as when the movie debuted.<br><br>Bette belts out these songs with soul and fiery passion. The only other contemporary singer I can imagine doing a similarly credible job is Melissa Etheridge.<br><br>Sissy Spacek won the Best Actress Oscar for Coal Miner's Daughter (1980), but in retrospect I'm sure a lot of people regret not having awarded it to Bette Midler. This was not only an amazing, high caliber performance, but one that the passage of time has not diminished. This is a stunning movie. My dream is to rent a movie theatre for an evening, invite 30 friends, and relive this great experience.<br><br>Movie theatres used to be bigger, and were aptly called \"movie palaces\". THE ROSE deserves to be seen in such a grand venue. In the rich pantheon of movie history, THE ROSE is true royalty.<br><br>Note added October 9, 2007: It has been over a year, and I have no indication if anyone has ever read this review. If you read it, even if you give it a thumbs down, please answer whether the review was useful to you or not. I just am so curious if anyone will EVER read it. Right now, I'm listening to the soundtrack. This movie is timeless.","user":"pachl","rank":[237,250]},{"title":"\"Stay With Me, Baby\"","rating":9,"date":"6 February 2006","review":"I saw this film in college for $1 in 1980 and never really appreciated it until now.<br><br>It is amazing to note that this is the same Bette Midler who did all those Disney/Touchtone movies (Down and Out in Beverly Hills, etc.)! This is not a happy film. It has no happy ending. Most of the film is dark, adding to the dreariness of the story.<br><br>But you just watch Bette watching Houston Dyer leave her because he couldn't put up with her life. Watch him as he pauses before he gets into the tractor trailer that he's just hitched a ride with, watch him as he looks back at her, almost reflecting, thinking, for just a moment, reconsidering his choice, and then makes the decision to live with the choice and get on the truck, going God only knows where, leaving her.<br><br>Camera goes back to Bette, on the ground, wailing in agony, despair, and sadness.<br><br>You just watch Bette singing \"Stay With Me, Baby\" at the end of the film at the concert when she goes back to her hometown. How many takes before they got it right? Once? 37? She's on her knees, she's cradling the microphone, her eyes are blackened with the makeup that has mingled with the tears. Watch David Keith applaud from offstage as he's watching her give the performance of her life and KNOW that that applause was ad-libbed, that he was completely knocked out by her performance.<br><br>And then come back and tell me that this film was crap. I've seen Norma Rae and always believed that Sally Field deserved her Oscar but I no longer think that. Bette was robbed, plain and simple.","user":"niara","rank":[30,31]},{"title":"...had you been on the set...","rating":10,"date":"5 May 2006","review":"I am the only surviving female-impersonator who played in \"The Rose\". I was the only one who had a talking-scene with Midler and Forest. I was approached to be Bette's impersonator in a drag-club, because I was/am a live performer. Midler's manager, Aaron Russo - who had come to check me out - called-out that I was doing Bette's \"jokes\" during a live performance in the world-famous \"The Queen Mary\", a night club in Studio City, CA - now sadly closed after 42 years. However, I do not do impersonations of other performers. What the manager didn't know is that most of her material came from drag-queens. I also had appeared in The 82 Club in New York City - a mafia-run establishment, and wonderful to work for, also closed - and was hired originally by Rydell as a consultant for the physical attributes in a long-closed speakeasy in downtown Los Angeles......it was larger, but perfect. After a conversation with Mark Rydell and a singing audition for an unseen Ms. Midler, I was told \"bring an outfit - we've written a role for you\". I was hesitant to accept - there was no contract for a speaking-role, I was paid only scale. I attended the first day of shooting on location, but did not go for the second day - they came to get me, I suppose because they liked what they saw in the \"dailies\" - There was a third day of shooting, all of which were totally miserable for me - I had no aspirations to be a \"movie-star\" - I was an established drag-act with a large following and loved my work. My drag-appearance was outrageous, as you'll know if you saw the film \"The Rose\" - I planned it that way, because that's the act I was doing at the time the film was shot. The role I did in the film actually was an impersonation of someone's identity I cannot divulge - I'm sure many New Yorkers picked-up on it immediately. All of the hair-dressers on location were shocked with my hairpiece - they could not have combed it. On the final day of shooting, it became very quiet after the \"wrap\". Ms. Midler very quietly called me over to speak with her before the entire company, thanking me for being so quiet during the shooting, not constantly calling \"make-up\", \"hair\" as the other impersonators did. I was highly complimented.<br><br>I've seen the film only once in a theater, and became so engrossed with the story, I completely forgot I was in it. Like 90% of the audience, when I saw myself I gasped. I heard people call-out my name, as I sunk deeper into my seat. It was only then I became extremely gratified to have been in the film. Ms. Midler and I never stuck to the script, because it did not bring-out that her character had once been down-and-out when she lived above \"The 777 Club\", and I supplied her with drugs. There is enough unused film from that shoot to make another film. What a waste of money ! It was and is my opinion the entire scene could have been left-out, it was so poorly, ruthlessly edited.<br><br>I worked for many years in \"The Queen Mary\" after the film was released. I never made a big deal that I was in the film. People asked if I were in \"The Rose\" during my performances - and do still today wherever I happen to be - and I tell them I was, but it was only another job - as it was just that. I'm much better known for performances at \"The Queen Mary\" than having appeared in \"The Rose\". I've turned-down opportunities to appear in other films, because I have no real interest, unless the money is good. Scale.....peanuts. Making movies is not fun !! All that standing-around, shooting the same scene 50 times-a-day.<br><br>If you are familiar with \"The Queen Mary\", you'll know my name. Otherwise, you'll have to look at this sensational film to discover my identity. I call myself \"The Oldest Drag-Queen in Captivity\", because I'm 82-going-on 30.<br><br>As other posters have stated, \"The Rose\" IS NOT A BIOP OF JANIS JOPLIN. If it's true the story was just a film for Ms. Midler to perform in to show her talent, it is a fabulous testament to that fact. Is she an actress? Indeed! She could not have done the body of work she accomplished without being one. Viva Midler ! The appearance of the film is exactly as it was intended to be - criticize all you want, this is a major film - and will become a classic.","user":"fimimix","rank":[25,26]}]