[{"title":"I liked this film very much.","rating":13,"date":"13 June 2004","review":"As I watched this film I kept imagining kids in the year 1965 watching this at Saturday afternoon matinees and thinking this was the coolest thing they had ever seen in their lives. What more could you ask for: a handsome and likable hero in Tab Hunter, a stunningly beautiful leading lady, the delightful David Tomlinson as comic relief, the masterfully sinister Vincent Price as the villain, an undersea world filled with mysterious and treacherous caverns, monstrous mer-men, and a nearby volcano threatening destruction at any moment. That's a pretty good Saturday afternoon if you ask me. And if you can approach this film in that way, allowing for the time and place in which it was made to inform your judgment, I think you'll find this a very enjoyable picture. For the most part it looks great (especially when one considers how tightly AIP held their purse strings in those days) if a bit dated by today's standards, but that too can be part of the fun.","user":"BMatth6167","rank":[33,38]},{"title":"Not as bad as reputed","rating":7,"date":"9 February 2005","review":"When you consider that this movie is directed by the great Jacques Tourneur, stars the legendary Vincent Price and is based on a poem by the master of the macabre, Edgar Allen Poe; it's a huge disappointment. Considering the quality of the talent involved, this film really should have been a lot better. However, despite the fact that it's a long way from brilliant, the film isn't bad either and fans of any combination of the three major players will no doubt find something to like about it. The film begins in familiar Poe and Price territory, with the great actor reading the beginning of the poem on which the film is based against a backdrop of the ocean hitting the sandy shores. The story follows two men that follow a group of fish-men down a back passage of an old in house in search of the girl that the monsters have kidnapped. The men follow them to a lost city that has been engulfed by the sea, and discover a world of intrigue as they learn about the society of never ageing smugglers that they have stumbled upon.<br><br>It's the story telling aspect of the story that makes the film struggle. It's very uneven, and huge chunks are spent on rather boring elements such as an extremely overlong underwater chase sequence. However, when the film is good, it's very good. Vincent Price delivers a great performance as the ruler of the underwater kingdom. Price is an absolutely great actor who has to prove nothing to nobody and one reason for that is because no matter how bad the film is, Vincent Price always gives you a reason to watch. The effects are a little silly, especially when you get to see the half-fish, half-men up close, but things like that add to the charm of classic B-movies, and so it's easy to let it go. The story itself is very good, and despite the fact that it's only a poem, Poe manages to inject all the malevolence that has made him immortal in the eyes of everyone that knows anything about literature. The film also includes a tribute to the great author by way of a section which includes a first edition of his works. This film certainly isn't brilliant, but it's not bad either. I certainly recommend it to fans of Price, Poe or Tourneur.","user":"The_Void","rank":[30,35]},{"title":"Surprisingly dull and workmanlike","rating":24,"date":"24 May 2003","review":"When a body is washed ashore on the coast by a small English village it sparks an investigation in the mind of Ben Harris.  He visits the home where the deceased had been a lawyer and finds clues that indicate that the beautiful Jill Tregillis may be in danger.  Seeing off a mysterious figure who he caught in the act of stealing a portrait of Jill leaves him in no doubt and he stays the night.  In the night Jill is kidnapped and Ben and Harold pursue.  Finding a tunnel system going under the sea they investigate but find a hidden world controlled by one man who has found the secret of eternal life but is desperate to prevent his world being destroyed by a volcano.<br><br>I taped this film by mistake when I wanted to watch `City Beneath the Sea' which was on a day after this.  Realising my mistake I watched it anyway as I noticed it had Vincent Price and was based on a work by Edgar Allen Poe. The film starts with a bit of a gothic feel to it but quickly it becomes surprisingly straightforward.  The mysterious `fishmen' are quickly replaced as the focus by The Captain and his crew, personally I felt that to make a different species of man and then sideline them was pointless  where they did they come from for goodness sake!?<br><br>The Captain and his age-old crew are interesting but nothing can be fully explained as to how they really managed to set up down there as well as they did and it quickly becomes just a bunch of men living in caves as opposed to a city beneath the sea!  There is no real feeling of mystery here and the end result is that it falls a little flat for the most part. The attempts at escape late on in the film lose excitement due to being quite slow and filmed in clunky diving suits, happily the return of the fishmen add some fluidity to events.  The underwater filming is quite good considering, although the regular close-ups of the actors' eyes in the helmets would only convince a child that they were really in the water!<br><br>Price is always a good villain but here he lacks threat  even when he executes people, he seems to be in full control but without that masterful stroke of eccentricity that many of his better performances have had. Hunter is quite a dull lead and even seems out of his depth (sorry) when acting alongside the support cast, let alone Price!  Hart is pretty and Tomlinson adds value with some comic touches (especially at the start of the film).  An actor as well known as John Le Mesurier shouldn't be wasted but really is  he still has to give his usual pottering character but is still badly cast and underused.  The fishmen are suggested as the monsters of the piece by the first 10 minutes but are revealed to be toothless, given little screen time and handled as easily as a hooked salmon.<br><br>Overall the quality of the film can be summed by the fact that the drama is all relying on the audience accepting a very active underwater volcano of the English coast.  However once you get past this the delivery is quite flat and lacking in excitement to the extent that, by the time things come to a head, you'll not really be that bothered what happens.","user":"bob the moo","rank":[28,35]}]