[{"title":"The last hurah?","rating":8,"date":"27 February 2002","review":"The Richard Pryor presented to us in Richard Pryor Here and Now, is a man changed by all life has threw at him. He has learned from the mistakes and heartaches in his life, has experienced both sides of success and failure. His nose is clean from drugs and alcohol, and he seems to have ridden the storm to get were he is at this point, and looks happy for it. He is also as deadly-funny as he has ever been, yet has matured. Here and Now is a good concert film. Pryor isn't at his peak, he probably hit that with Richard Pryor Live at the Sunset Strip. Yet despite this we get a chance to see a drugs free, happy go lucky and mellow Pryor for the first time. The routine is as similar as before. Pryor goes through his usual battalion of jokes set pieces and stories, showing the mocking side to himself first glimpsed in Live at the Sunset strip, while letting the usual anger, that comes with comedy to seep out. The stories are as funny, for instance his telling of meeting President Ronald Reagan in 1983 : \"I went to the White House, well i was invited anyway because i made this movie Superman III, and everyone was in line to meet him, and when he came to me, he looked at me liked i'd just walked in off the street and totally blanked me. I didn't even want to go in the first place, i felt like a turd on his shoe or something\". And his recollections of meeting ex partners in drugs whilst sober for the first time \"They come up to me and apparently i spent weeks, months doing drugs with them, i dont  know them from s***. They say to me 'Hey Rich remember when you were out of it on drugs and you put you hand up that elephants ass on 42nd street and got carried along with it to the Ed Sullivan theatre'\". Pure genius.<br><br>Sadly, Here and Now does contain one or two slow moving segments, unusual for the normally fast paced Pryor, and the is a heart breaking moment when he recreates his actions as a drug addict. The one main critisism is the constant heckling, for no reason that Pryor recieves, perhaps shading his performance. Do these people honestly think that they are going to say anything funnier than Pryor can? All in all though, Here and Now is well satisfying concert movie, and i would recomend it to anyone seriously hunting belly laughs.","user":"The Fifth Doctor","rank":[8,8]},{"title":"Funny and surreal","rating":31,"date":"31 August 2004","review":"\"Here and now\" is easily funnier than \"Live on Sunset Strip\", when it wants to. But also quite surreal. What makes it surreal is mainly the audience. In the middle of the show a middle-aged geezer hands Richard a crab in the water glass. Far out. Also, the heckling is quadrupled in this show. It was probably Mardi Gras time. But Man Pryor still made me choke from laughter, and the improv with the aforementioned crab was quick thinking too. Towards the end, it's Pryor's turn to crank up the surreal with his junkie-bit, which is also quite moving, if too much of a downer for a supposedly comedy show.<br><br>This show is something else.","user":"guidance","rank":[5,5]},{"title":"The one and only Richard Pryor","rating":21,"date":"21 April 2003","review":"RICHARD PRYOR : HERE AND NOW (1983) &amp; RICHARD PRYOR: LIVE ON THE SUNSET  STRIP (1982)  both ***1/2 Pryor, one of  America's greatest stand-up comedians, expertly conveys the inner pain and personal demons of his tumultuous life with heartbreakingly funny takes on his drug abuse, sexual relationships,  racism, spirituality abroad in Africa, getting drunk, recalling early gigs with Mob run clubs and the occasional improvs (his bit with a hermit crab shows just how quick on his feet his mind is) showcase the true brilliance of an original artist in his element and total at ease and command for the language of 'vulgur' humor that seamlessly blends into the vernacularity of his topics of discussion (say unlike his protégé Eddie Murphy and only recently touched upon with better results by Chris Rock). Lucky to be alive after his near-fatal freebasing burning Pryor even makes dying sound funny. A genius in every sense of the word.","user":"george.schmidt","rank":[4,4]}]