[{"title":"Bogie as a missionary in China","rating":6,"date":"8 December 2007","review":"Humphrey Bogart experiences \"The Left Hand of God\" in this 1955 film also starring Gene Tierney, Lee J. Cobb, Agnes Moorhead and Lee J. Cobb. Bogart is Father O'Shea, who arrives at a mission in China to take over religious duties. The casting of Bogart should tell you something right away. While there, he wins the hearts of the people and that of a beautiful nurse (Tierney) who is a widow and, being a strong Catholic, finds her emotions unsettling. Father O has a relationship with a Chinese warlord, and now the village seems in danger. Can he save it? There's not a tremendous amount of action in this film, but the wonderful cast keeps us interested. Always a surprising actor, Bogart has a way with touching moments, such as receiving a blessing from the oldest man in the village. In 1955, Gene Tierney was still a young and beautiful woman, but for some reason, around 1950, she adopted a short, matronly haircut that I for one never found flattering. She's lovely in this as a lonely widow. Moorhead and Marshall give strong performances as the doctor and his wife. Lee J. Cobb is good, but seen today, his Chinese makeup is distracting.<br><br>Mildly interesting.","user":"blanche-2","rank":[17,19]},{"title":"left hand of god","rating":9,"date":"4 June 2006","review":"I thought this movie was characteristic of the movies made after the 2nd world war, where goodness overcomes evil, Hitler versus the Allies. The simple faith portrayed by the Chinese villagers and the belief in the Christian church where they and the audience knew that god would triumph in the end was charming and a little naive. Humphrey Bogart played a masterly performance using his considerable acting skills to portray the phony priest who is overtaken by the situation he finds himself in and redeems himself by selflessly offering his freedom to save the villages and mission. A strong cast of experienced actors along with the Chinese cast worked extremely well in this movie. If you are a catholic it is everything we want from our church. Simple honest faith, alongside men of conviction who believe without a doubt that Christ would and could intervene if he were asked. This film is a testament to Bogart's enormous charisma and plain speaking charm.","user":"paddymaxwell","rank":[17,20]},{"title":"\"I'm fresh out of faith, hope and charity, Reverend.\"","rating":7,"date":"30 July 2006","review":"This may be the only movie you'll ever see where the 'Our Father' and 'Hail Mary' are recited in their entirety. Humphrey Bogart is the reluctant priest Father O'Shea, whose masquerade at first is tentatively welcomed by a small Chinese village, but who through a series of unforeseen events, winds up becoming their savior. The tip off comes in an opening scene, this priest carries a gun. We're left dangling for a while as the story unfolds, and it's not until well past the half way point that O'Shea's identity is revealed to be that of an American flier who crashed in a remote Chinese province some three years earlier. When the real Father O'Shea dies from a bullet administered by Yang henchman Pao Ching, James Carmody sees a way out of his forced service to Yang by donning the vestments of a priest.<br><br>The romantic tension between O'Shea and missionary Anne Scott (Gene Tierney) is broached but never fully played out. O'Shea is familiarly comfortable in her presence, she's entirely ill at ease to find her feelings being tested. The quandary is dealt with in such a way as to make a resolution virtually impossible, and the finale leaves it that way even when she learns of his true identity.<br><br>It took a long time for film makers to accept Oriental actors in leading roles. Lee J. Cobb of course is entirely miscast as warlord Mieh Yang, but no more so than Boris Karloff, Peter Lorre or a host of non Asian actors to portray Chinese detectives of an earlier era. Victor Sen Yung proved adequate and believable in a support role as John Wong, the church sexton who challenges Father O'Shea to do the right thing when the situation calls for it. It seemed appropriate that he begin the legend of the Shen-fu after the fate of seven villages is secured via a game of chance.<br><br>I found it interesting that Sen Yung and Benson Fong appeared in this film after both saw work in the 1940's as the Number #2 and #3 sons of Charlie Chan. Curiously, they never appeared as brothers together in any story during the series. Admittedly, Fong's role in this one was almost a throw away, as distraught husband Chun Tien whose wife died giving birth to a dead son. For his part, Sen Yung would continue his later career in the employ of the Cartwright's on The Ponderosa.<br><br>For sentimentalists, the film's payoff near the end might bring a trickle to your eye. The young Chinese villagers offer their best rendition of 'My Old Kentucky Home' as Bogey's character is allowed to keep his secret by the Bishop's emissaries who replace him. That, along with those incredibly lucky rolls of the dice, might lead you to believe in Hail Mary endings.","user":"classicsoncall","rank":[4,4]}]