[{"title":"powerful film about life on the docks","rating":7,"date":"27 February 2005","review":"'Waterfront' is a short, but beautifully written and acted, British drama. It boasts an early performance from the young Richard Burton, before Hollywood flourishes and ego started to affect his film choices; and a multi-faceted turn from Robert Newton as the drunken father who returns to the family he abandoned some years before.<br><br>Without a complicated plot, this film concentrates instead on the characters - the mother who has grown strong for her children's sake (the excellent Kathleen Harrison); the daughters Nora (Avis Scott) and Connie (Susan Shaw), and other peripheral characters - Olive Sloane as Mrs Gibson, alongside Kenneth Griffith and Robin Netscher.<br><br>Directed by Michael Anderson from John Brophy's novel, this gem showcases the Liverpool docks in the days when life was hard for those who lived there and made their living from the water. It looks at the journey from girl to woman of the eldest child, and the muddled dynamics of family relationships and loyalties.","user":"didi-5","rank":[29,32]},{"title":"Great acting, interesting story","rating":8,"date":"21 July 2017","review":"Every year, like most families I suppose, we watch Alistair Sim's A Christmas Carol in December. Part of me always thinks that the people in that movie aren't really actors, so you can imagine my surprise when I saw Mrs. Dilber make an appearance in another movie! Kathleen Harrison is her actress name, and not only is she the matriarch in Waterfront Women, but she has 113 credits to her name on IMDb. And she lived to the ripe old age of 103! Anyway, in Waterfront Women, Kathleen lives in seaside Liverpool. At the start of the movie, her seafaring husband leaves her, and shortly afterwards she gives birth to her third child. As the film continues, she works hard to provide singlehandedly for her family, all the while pining away for her husband and hoping he'll return to her.<br><br>Kathleen's two daughters grow up very differently. Avis Scott, the elder daughter, follows in her mother's footsteps. She's a hard worker, and against her better judgement, falls in love with a sailor, a very young and handsome Richard Burton. The younger daughter, Susan Shaw, flirts with bad boys and gets into trouble. All three Waterfront Women give very good performances, and the plot moves quickly, with lots of twists to keep you guessing. This is a great one to watch with your girlfriends on a rainy Saturday!","user":"HotToastyRag","rank":[11,12]},{"title":"Huyton Realism","rating":6,"date":"6 September 2016","review":"I accept - though it's difficult to do so - that even as late as 1950 a film could be both set and shot in Liverpool with every character born and bred in the city yet not one is capable of a scouse accent and neither audiences nor critics would find anything odd in this, but watching it some 66 years on it's virtually impossible not to be so aware of this that it impairs enjoyment of the film. The big attraction of course was Bobby Newton in yet another pre-Treasure Island entry following which he wasn't allowed to say good morning without rolling his eyes. Although top-billed the story is carried by Avis Scott who is more than up to the task and has been unfairly neglected and this is arguably the only film in which Kathleen Harrison starts out young enough to be pregnant and give birth just off-screen. It's a gritty story and all the better for it and certainly well worth a look.","user":"writers_reign","rank":[10,11]}]