[{"title":"New York City, Harold & The Babe In Their Prime","rating":9,"date":"2 May 2006","review":"For a number of people, this is their Harold Lloyd film, especially if they are from New York City. I can understand that, as it's a funny movie and has great shots of what it looked like in NYC in 1927. (The film was released in 1928). It also is famous for having a 5-minute guest appearance by Babe Ruth.<br><br>My vote still goes to \"The Freshman,\" as Lloyd's best but that's all subjective. This is a solid entry and if nothing, else it's a great showcase to see what The Big Apple looked like 80 years ago.<br><br>This gets off to good start, too, unlike a number of silent comedies. Harold's ice- cream parlor antics, as a soda jerk, are a lot of fun to watch. I loved the way he signaled his co-workers on how his beloved home team, the Yankees, were doing inning-by-inning. After Harold loses that job, he winds up driving a cab and then, at the end trying to help his girlfriend's father. The elderly man drives the last horse-trolley in the city and is being threatened by someone who wants to buy him out, and Harold comes to the rescue with a dramatic race to beat the clock in the final hectic 15 minutes of the film.<br><br>While he was driving the cab, he gets the famous Ruth as one of his customers and he's so excited he almost cracks up the cab and Ruth goes crazy in the back seat. It's a funny scene.<br><br>Also tied in with the film is a nice, long scene with Lloyd and his girl (Ann Christy) having a wild day at Coney Island. That, too, was fun and interesting to see. In all, a fun movie and a chance to see Lloyd finish up his great silent career, before films changed to \"talkies.\"","user":"ccthemovieman-1","rank":[26,26]},{"title":"Very Entertaining, & Also An Enjoyable Time Capsule From 1920s New York","rating":12,"date":"12 December 2005","review":"Besides providing plenty of entertainment from Harold Lloyd and the rest of the cast, this silent comedy classic is also quite enjoyable as a time capsule from 1920s New York, with wonderful footage of Coney Island and other sights, plus the amusing appearance by Babe Ruth. Even more so than most movies of its era, it gives you a very good feel for its time and place.<br><br>The plot has Lloyd, as perpetual job-seeker and job-loser \"Speedy\", trying to save the city's last horse-drawn streetcar, which is driven by the father of his girlfriend. The David-vs.-Goliath conflict gives Lloyd a lot to work with, and it is used to good effect both for gags and for character development. There are a number of good sequences, including a hilarious and detailed street donnybrook between the transport company's hired goons and Lloyd's ragtag neighborhood stalwarts.<br><br>The lengthy digressions from the main story also work very well. The taxicab sequence with Ruth is probably the best-remembered, and there is also a delightful sequence at Coney Island's Luna Park. Ann Christy and Lloyd work together well, and they make an especially pleasant and sympathetic couple in this sequence.<br><br>\"Speedy\" is a good showcase for Lloyd, since it combines action sequences that advance the story with other sequences that simply entertain and give you a feel for the characters. Overall, it has quite a lot to recommend it.","user":"Snow Leopard","rank":[18,18]},{"title":"Essential for Lloyd fans; New York in the 20s the icing on top","rating":10,"date":"18 February 2000","review":"A delightful Harold Lloyd piece in which, in a nice change of pace, his character is a self-assured, confident young man living in New York during the roaring twenties, who loves baseball as much as he loves his girlfriend. Trouble is afoot however, when business tycoons try to buyout his father-in-law's lone horse and buggy track for their development. Things turn unlawful when goons are hired to try and thwart the buggy's run, which must be made at least once every 24 hours, or Pop can lose his license.<br><br>\nEverything plays out in the traditional Lloyd way, with wonderful gags and set pieces, but the biggest treat of all is the roughly twenty minute escape Lloyd takes with his girl to Coney Island. Wonderfully shot, it is truly a pleasure to see Coney Island in it's hey day. As well, Babe Ruth does a nice turn playing himself.<br><br>A must see.","user":"jagfx","rank":[21,22]}]