[{"title":"Huston's \"Moulin Rouge\" was nominated for seven Oscars and walked away with two trophies...","rating":9,"date":"6 April 2008","review":"This romanticized treatment of the life of artist Henri Toulouse-Lautrec is literally one of the most colorful films ever made<br><br>All the hues and colors in the palette go whizzing by in the Parisian streets, country homes, and cabarets of the late 19th century Can-Can girls in reds and blues, against a misty brown-gold backdrop, flourish their silks and feathers in the face and soul of dwarfed painter who could recreate their essence on canvas, yet never possess them physically <br><br>It is the tragedy of Lautrec's (Jose Ferrer) life which bounces around the rainbow framework The cruel prostitute (Colette Marchand) to whom he gave his love and the young woman (Suzanne Flon) who befriended the artist motivate the narrative, from the crippling-fall in the home of his father to the death-fall in the dirty-looking saloon <br><br>Brilliant work by Ferrer, fine support by Marchand and Flon, and the gaiety of Zsa Zsa Gabor cap the film","user":"Nazi_Fighter_David","rank":[38,42]},{"title":"Beautiful, engrossing drama","rating":8,"date":"24 August 2000","review":"Anyone who does not think that John Huston has a broad range as a film-maker needs to watch this and \"The Dead.\" While he spent much of his career making gritty adventure-dramas like \"The Maltese Falcon,\" \"The Treasure of the Sierra Madre,\" and \"The Man who Would be King,\" he also took the time to create well-crafted pieces like \"Moulin Rouge.\"<br><br>Jose Ferrer has an astounding, almost unbelievable, performance as Henri de Toulouse-Lautrec, a painter from late-1800's Paris who was crippled in his childhood by a horse that ran over his legs. He now spends his days in the raunchy restaurant/dance hall populated by artists, dancers, drunks, and vagrants, sketching away at posters and portraits. Ferrer brings out Henri completely, depicting him as a man who tried to run from his problems using his art and his alcohol.<br><br>The film itself has a tenancy to be a little too flashy and gaudy at moments, but Huston manages to keep most of it grounded in the dramatics of the characters. Collete Marchand is also very noteworthy for her performance as a prostitute that befriends Henri. Marcel Vertes' production and costume design won well-deserved Oscars.<br><br>A genuinely moving film, a work of art in its own right.","user":"Oblomov_81","rank":[24,26]},{"title":"PROFOUNDLY MOVING and BRILLIANT; Ferrer was never better!","rating":8,"date":"4 June 2001","review":"With the appearance of the 2001 movie entitled \"Moulin Rouge\" (see review) I went back to the Jose Ferrer version to add a review of it. Note that both films are entirely different in style and purpose; to equate them is to compare apples to pineapples. <br><br>This version, so well directed by John Huston, is not a wild frenetic musical but a very touching and moving character study of the great artist Henri Toulose-Lautrec, whose legs were badly mishappen and shortened by an accident early in his life leaving him basically a midget. His frustration at his appearance, and unattractiveness to women, forever scarred his short life that was curtailed by drink and other excess. Jose Ferrer was superb as this tortured yet brilliant soul; Ferrer also played expertly Henri's powerful father descended from French nobility. <br><br>\"Moulin Rouge\" began with a long scene in the club itself filled with dancing, exciting music, beautiful women, good friends,and lots of drink. The sets and costumes and were colorful and beautiful. After about half an hour we follow Henri home - and we see him, alone, so short and vulnerable, walking all alone through the dark streets of Paris. The contrast was most effective. Such was the REALITY of Henri's life. The remainder of the film focused on his unsatisfactory relationship with a prostitute he befriends, along with flashbacks to his privileged wealthy childhood.<br><br>Perhaps the most emotional scene was at the end. With Henri dying in his bed his father there tells him that he is the first living artist to be honored by having his work displayed at the Louvre. As he appealed for forgiveness for his previously harsh treatment, saying \"I didn't understand\", all Henri's old friends from the Moulin Rouge, as spirits (or hallucinations), visited him.<br><br>Like with the fine movie about Van Gogh, \"Lust for Life\", this even better movie is not necessarily always true to historical fact, but it is a cinematic classic.<br><br>HIGHLY RECOMMENDED!","user":"Kirasjeri","rank":[53,67]}]