[{"title":"Arsenal or Oldchester United? It's a tough choice...","rating":4,"date":"19 October 2017","review":"I'm surprised that nobody has reviewed this yet, as its presence on the list of \"75 most sought-after films\" suggests that it was eagerly awaited, and is now available on DVD in the UK. Sadly, the only existing print of the film seems to have lost several minutes, so dialogue is often hard to follow during the early scenes. As if that wasn't distracting enough, it hasn't aged particularly well, and the simplistic story-line (returning Canadian has to choose between small-town sweetheart/ non-league football, and London \"hostess\"/ the glamour of a career with Arsenal), and predictable plot developments are a reminder of how unsophisticated 50s British films could be, but there is still plenty to enjoy. Kent Walton as an actor without a wrestling ring in sight, Denis Compton proving that, for all his sporting prowess, his all-rounder status didn't stretch to movie-acting, and a career-stalling performance from Margaret Harrison as the romantic lead, who made her debut in this film and then took 2 smaller roles before calling it a day. The football sequences are quite skilfully composed, with a lot more excitement on the pitch than there is in the stands. Commentator Raymond Glendenning tries desperately to convey the impression that he's watching a real match as Oldchester United take on the mighty \"Bearhampton\". Who'll come out on top? Well, with their star striker (sorry, make that \"centre forward\") kidnapped at half time, it's going to be hard work for the underdogs...","user":"Richard-908","rank":[3,3]},{"title":"glad I saw it but hardly a classic.","rating":6,"date":"14 September 2019","review":"The Who have an old song called Pictures Of Lily about a young guy who becomes obsessed with a long dead actress.<br><br>In the same way I have been tracking down old British films featuring Susan Shaw.<br><br>This film is now avilable on blu ray.<br><br>So I bought it and watched it.<br><br>I am glad I saw it but it is a historical curiosity with images of old style football grounds and fashions.<br><br>It is really not a rediscovered classic.","user":"ib011f9545i","rank":[2,2]}]