[{"title":"Fourth time lucky","rating":8,"date":"30 July 1999","review":"The fourth instalment in the successful Hong Kong movie series Aces Go Places. After a disappointing third outing, where writer and co-star Karl Maka's writing seemed laboured, the familiar cast (Hui, Maka, Chang) make for a hilarious return to form. As before, the Cantonese version features more puns than the dubbed English one.<br><br>There's a lot of fun, combining the usual action elements with humour - just sit back and enjoy the ride, and switch off the brain.<br><br>The movie has been credited with increasing the emigration of nervous Hong Kong citizens (fearing the communist takeover) to New Zealand. You Only Die Twice, as this fourth instalment was called in some countries, was filmed largely in New Zealand, featuring that country's beautiful scenery.<br><br>There is little logic and plenty of slapstick silliness, which fans of the series will enjoy. The hockey game features some big-name character actors in the audience, familiar to Hong Kong moviegoers. There is an enjoyable car chase in New Zealand - although how a car can leave Auckland Harbour Bridge and arrive in Wellington (which can be nine hours' drive to the south in reality) in a few seconds is not explained.<br><br>One should stress to less familiar readers that You Only Die Twice is not of the Jackie Chan ilk. Although action-packed, the movie is primarily a comedy. The original Aces Go Places was based around a Dick Emery film.<br><br>Ronald Lacey makes an unlikely choice as villain, most likely for the sake of parody above all else. His bald henchman makes a interesting rival to Maka's own bald character, as well as his son, who perhaps is the best actor of the lot!","user":"Jack_Yan","rank":[6,6]},{"title":"The best Mad Mission so far.","rating":6,"date":"6 September 2007","review":"Regular Mad Mission stars Karl Maka, Sam Hui and Sylvia Chang are joined by Sally Yeh in You Only Die Twice, the fourth film in the popular (in Hong Kong, at least) series.<br><br>Once again, the movie is scripted by Karl Maka and is a mixture of silly comedy and crazy stunts, but director Ringo Lam (who would later give us the fantastic full Contact and impressive Burning Paradise) reins in the sillier aspects of the mayhem somewhat. This means that fans of the series thus far might be a bit disappointed by this offering, but I personally welcomed the change in style, having found the first three films unfunny and far too random for my liking.<br><br>Mad Mission 4 might never be considered a classic of 80s Hong Kong action/comedy, but by adding more excitement, introducing tougher fight scenes and gun battles (complete with squibs and bone crunching falls), and taking care over the cinematography, Lam makes this one just about worth watching.<br><br>This time around, the bad guy is played by none other than Ronald Lacey, the slimy Nazi with the scarred hand from Raiders of the Lost Ark. Looking identical to his character in the Spielberg classic, Ron hams it up as a villainous scumbag out to steal a prism that has the power to imbue a person with super-powers. When the crystal falls into the hands of bumbling cop Albert (Karl Maka), the leather trench-coat wearing baddie kidnaps the poor guy's wife and son.<br><br>Once again, Albert teams up with his happy-go-lucky jewel thief pal King Kong (Hui), and, with the assistance of a professor's daughter (Yeh), they attempt to pull off a daring rescue mission.<br><br>Highlights of the film include a tense scene in which Albert's son ends up dangling over the edge of a tower block, a helicopter in high-speed pursuit of Sam Hui in a speedboat, a fun locker-room fight scene, and a stunt-filled car chase.","user":"BA_Harrison","rank":[4,7]},{"title":"Different From Its Previous Entries, But Just As Fun!!","rating":8,"date":"10 January 2020","review":"In what is probably the oddest opening to a Mad Mission - and with a series that opens with some pretty insane things, I know this will sound strange - we find King Kong in New Zealand, lying on the bed of scientist Roy Chaio and being shot in the face via a very special prism diamond. Enter Sally Yeh who takes a fancy to King Kong (Hui), and some bad guys who take a fancy to the prism. A quick getaway and some gunfire lead to an insane boat and helicopter chase, James Bond style, through the stunning kiwi landscape!<br><br>We quickly jump to Hong Kong where we find Baldy (Maka) in the middle of an ice hockey game - the HK Police Force vs Interpol, with Wong Fei Hung legend Kwan Tak Hing cameo-ing as his coach. Suddenly, King Kong (who has sent the prism to his friend) appears and helps his friend win the game, obviously in the most ridiculous and hilarious way possible which gets them kicked out.<br><br>Back in the changing room, Sally shows up, closely followed by the same bad guys and we are treated to a pretty fun fight - with Sam Hui showing a big improvement on his kung fu skills - courtesy of action-director Joe Chu who has worked on many HK classics. After another escape, we finally get to see the wonderful Sylvia Chang back on screen, along with their slightly older child (the same actor as before) who still suffers some on-screen abuse as he is forced off a roof in a harsh kidnapping attempt...<br><br>Once the kidnap is complete, the gang head back to New Zealand for a rescue mission resulting in some fun comedy moments, car chases, action scenes and great stunt work!<br><br>The late, great director Ringo Lam - famed for his dark, gritty crime thrillers and action films - was most definitely an interesting choice to follow up Tsui Hark's light-hearted and very ambitious romp in the previous instalment.\nGone are the fast cut, whacky slapstick comedy routines that made the first lot so crazy. Also gone are the dated, rough-around-the-edges shots, offering up a very smart looking production that shows a rise in budget and a director that wanted to make an impression.<br><br>Lam had only made a few films previous to this one, most of which were comedy or rom-com's. It's evident that what he delivered via Aces Go Places 4, in terms of action, let loose a desire to continue in that vein straight after with his famed 'On Fire' trilogy following over the next 12-18 months...<br><br>For me, this chapter of the series would have suited best as a stand-a-lone film, even as a sequel of sorts to Wong Jing's fantastic Magic Crystal (also 1986) or even better than that - a prequel to Sam Hui and Cinema City's very own (and very brilliant) Legend Of Wisely (aka The Legend Of The Golden Pearl from the following year)!<br><br>Don't get me wrong, there is a lot to like in this little gem. From the crazy action scenes and stunts, including a mad fire stunt from Karl Maka after he gets turned into a zombie-like super Baldy, to the more refined comedy scenes and its matured characters - I do think it's definitely the best of the bunch in regards to showing both Karl Maka and Sam Hui doing a lot of their own (and best) action.<br><br>I do really like this sequel, but as a 'Mad Mission' it just falls short of what made the others so much fun, unfortunately, by trying to hard and losing the insanity of its predecessors. It is however, a very well made action comedy that entertains a lot and is certainly one of Ringo Lam's more 'family friendly' films to watch...<br><br>Overall: Well worth the watch, but void of the madness that made us fall in love with the series in the first place!","user":"Movie-Misfit","rank":[1,1]}]