[{"title":"A veteran's impression of \"The Deer Hunter\"","rating":10,"date":"22 August 2012","review":"I will not repeat much of the comments in the previous positive reviews, but will stick mostly to how the movie affected me. First off, I am an Army veteran of the Vietnam War. Thus there is much in this picture that deeply moves me. I still can not listen to the theme music piece played by John Williams, \"Cavatina\", without choking up and weeping.<br><br>I identify much with the characters in this movie. I grew up in a very small town and come from a working class ( Norwegian, Scots-Irish, English) background. Two weeks out of high school and at the age of 17 I enlisted in the Army. Like the men in this movie I came from a tradition of serving one's country in the military. Both my brother, two cousins and my future brother-in-law also served in the Vietnam War.<br><br>I identify with Michael, played by Robert DeNiro in his sense of honor in going back to 'Nam and trying to bring back his buddy Nick. Additionally I admire Mike when he visits Steven in the VA hospital and brings him back home. Honor is, as mentioned in the movie \"Rob Roy\", a gift a man gives to himself. Michael (and the movie) doesn't waste time on whether the war in Vietnam is right or wrong. Michael just does what he thinks is right with respect to his buddies. Ask any one who has served in the military and they will tell you that you're sense of commitment to your comrades almost takes precedence over your commitment to your country.<br><br>I do not see this movie as either pro or anti-Vietnam War. To me the movie portrays how war affects three individuals. It is a movie about character, honor, loyalty------what you are when everything around you is falling apart. I will continue to see this movie many times as I hope that the values depicted in it will still be reflected (albeit weakly) in me.<br><br>In closing, I can not help to remember that the politically anti-Vietnam War movie \"Coming home\" starring Jane Fonda and Jon Voight was also up for the same Oscars. When Jane Fonda was asked what movie would win the Academy award that year, she sneeringly replied that she hoped it wasn't \"The Deer Hunter\". In the years since Jon Voght has transitioned from being a Liberal to a Conservative. Parenthetically, Jane Fonda has never apologized for her pro-Viet Cong actions. At the age of 66, I am still proud that I served my country and volunteered for the US Army and the Vietnam War.","user":"ldadvantageinc","rank":[111,132]},{"title":"It was 1978 and everyone in the audience was about to wet their pants","rating":10,"date":"6 April 2006","review":"No, this is not the best film about the Vietnam War; it's hardly about Vietnam at all. The vets who don't like it have it wrong, as do the Vietnamese who found it racist. It could be any war, with any combatants. But because the (primary) victims here are recognizable American archetypes, Americans will feel this in their gut more than any other war film I know of. This is one of the very few post-war Hollywood films that shows a sincere reverence for the lives of small town Americans.<br><br>After seeing it in a very high quality theater on its initial release, I walked out thinking it was easily one of the best movies I had ever seen - and that I never wanted to see it again. But I looked at it today on cable and found that not much had changed about it, or me. I don't want to see it again...but I want you to see it.<br><br>Even now, the Russian Roulette scene (in context, people: watch all that comes before it first) is the single most intense sequence I've seen; it makes the end of \"Reservoir Dogs\" seem like a cartoon. Best Walken performance, period. Meryl Streep glows, DeNiro has seldom been more affecting. A unique classic...it is not surprising that Cimino didn't have another movie in him after something this wrenching.","user":"yawn-2","rank":[324,422]},{"title":"A War Like All Wars A Film Like No Other","rating":10,"date":"31 January 2010","review":"\"The Deer Hunter\" is 32 years old. How extraordinary to sit through it now. Walking over the politics that divided , somehow, all of its admirers then. \"Great film but...\" How silly to think of it now. Michael (a sensational young Robert De Niro) is as extreme a character as Rocco was in \"Rocco And His Brothers\" His goodness, the one that was always there but that he discovers under the most horrendous circumstances, underlined by Stanley Mayers's \"Cavatina\" permeates the entire film. I remember thinking, when I saw the film for the first time, that I couldn't or wouldn't spend ten minutes with Michael and his friends, the ones we meet at the beginning of the film but by the end I thought of them as brothers and I loved them. I actually loved them. That in itself is a sort of film miracle. John Savage will break your heart, it certainly broke mine and Christopher Walken is absolutely riveting. How strange to tho think that Michael Cimino, still a young man, is nowhere to be seen. Is still a punishment for \"Heaven's Gate\" and \"Indecent Exposure\" or there is something else we don't know about. The Cimino behind \"The Deer Hunter\" is a true master.","user":"abelardo64","rank":[86,107]}]