[{"title":"The Hoff does a spaghetti poltergeist","rating":7,"date":"8 October 2010","review":"This film starts as it means to go on: a bunch of pilgrim types, armed with pitchforks, chase a pregnant woman through a modern house (with light-switches) until she jumps out of window. We are truly in the realm of Italian madness.<br><br>David Hasselhoff plays Gary, boyfriend of the mumbling Leslie, who won't let him into her pants. Won't even give him tops and fingers. Gary and Leslie are currently squatting in an abandoned hotel researching either a witch or witch lights or the gates to hell or something to do with a German book. It's kind of hard to tell, as Leslie explains most of this and to be frank she can't act or even speak very well. I think she was the one doing the research and Gary was the one trying to get into bed with her, but nevertheless they are in trouble for two reasons. One: there's the world's most tired looking woman hiding in the attic somewhere, being creepy and Two: the new owners of the hotel are heading there for a visit with their children (pregnant Linda Blair and proper kid Tommy), an estate agent, and a nympho lawyer.<br><br>The old woman has already been appearing to this family for some reason and about five minutes after the family land on the island she wastes the guy who took them over in the boat. So it looks like they're stranded.<br><br>What follows is your usual late eighties Italian set-up (like Ghosthouse, House of Lost Souls, House of Clocks etc) where a bunch of victims try not to be killed by supernatural forces. As I said it's kind of difficult to get a handle on what's truly going on, but it seems that the old woman (who may or may not be a ghost or a witch) wants to open the gates of hell by killing folks who have sinned in certain ways. She does this mainly by sucking them through into another dimension and wasting them graphically.<br><br>Where House of Lost Souls was content to decapitate children with washing machines, Witchcraft opts for daft visual effects and surreal, nasty deaths. One victim gets her lips sewn shut, jammed down a chimney, and set on fire. Another gets impaled on a swordfish, and in the best scene, Bob Champagne's jugular explodes in David Hasselhoff's face. It takes a while to get to the good stuff in this film, but the gore has an nice nasty edge to it.<br><br>Gore aside, the Italian daftness quotient is as high as ever. We don't have dubbing, but we do have Hasselhoff telling a fully clothed woman to get dressed, a whole lot of bizarre visual trickery (like the witch-lights), and the world's most terrified looking child actor.<br><br>A lot has been made about how bad this kid is, but to be honest with you he just looks like he's scared of everyone in the film and would rather be anywhere else at all. I'd be scared too if I had to act with a woman who looked like she's been drinking three bottles of vodka a day for at least a decade.<br><br>And another thing: never turn your back on Linda Blair. As usual, she goes all possessed near the end of the film in a scene that is pure comedy (unintended of course). To cement it's place as one of the most enjoyable films an industry in decline released as the decade drew to a close, we have our twist ending which is so abrupt and stupid you just have to applaud.<br><br>Witchcraft has the lot: gore, madness, incoherence, and even a couple of scenes that are genuinely creepy (the Satan rape bit). As it seems to be unfairly trampled on by all and sundry, it turns up cheap on Amazon. For the two or three people actually interested in what Italian films were like after the golden age had passed, I'd buy Ghosthouse. Then this one.","user":"Bezenby","rank":[16,18]},{"title":"an Italian horror flick.... with the Hasselhoff..... not too bad","rating":6,"date":"5 July 2015","review":"At least there are some big names in this campy horror film to keep us occupied. Double billed on a new blue ray with \"Ghost House\", Witchery has David Hasselhoff (post Knight Rider, but before Baywatch) and Linda Blair (waaaaaaay after Exorcist). Another Italian horror film, filmed in Massachusetts, this one is directed by Fabrizio Laurenti. Like the Lenzi horror films, this one is so campy, so bad, that its kind of fun to watch. And who IS that Lady in Black? She and her magic gemstone pop up now and then, adding to the mystery. A real estate agent tries to sell a house on a private island, but Gary (Hasselhoff) and his assistant entered the house (without permission) to take photos. Jane (L. Blair) has her own secrets, as you will see. More cheesy special effects, and of course, the usual blood and gore. I'm surprised that Linda Blair still wanted to do films like this, since she was so well known for The Exorcist. It's pretty creepy. And as of today, only 3 out of 10 stars on IMDb.<br><br>The \"story\" starts out pretty solid, unlike most oldie horror films. The acting and directing are a bit lame, but everyone does a pretty good job with the lines they are given. For a lot of of the cast, this is the only film they ever made. About two thirds of the way through, the plot gets weird and goes down these left turns. Lots of screaming, organ music, and smoke. Similar plot to Ten Little Indians, where the guests get knocked off, one by one. Interesting, if just for the historical value.","user":"ksf-2","rank":[5,5]},{"title":"Excellent setting","rating":6,"date":"1 April 2006","review":"I recently picked this up on VHS under the title \"Ghosthouse 2\", although it has nothing at all to do with the original Ghosthouse film. I was expecting it to be terrible, after reading IMDb reviews, but it actually turned out to be OK. The setting of the film is what gets the most marks from me - I love seeing the shots of the house and island from the sea. It's THE perfect setting for a horror film. I do think it was a little wasted on this particular film though. Never mind.<br><br>The film itself isn't too bad, it just drags a bit in some places and I didn't like the witchcraft theme. I found the scenes where people are transported via that \"Doctor Who\" style vortex extremely cringe-making. It looked like something from a cheap 80's sci-fi film! Other than that I thought the death of the old woman was excellent - she gets her lips sewn together and is hung upside down above a lit fireplace. She can't scream for help and the others have no idea she's there. Now there's an original death for you! The parts where the helicopter flies around the house are also excellent - the people inside can't signal for help because the house has trapped them inside. <br><br>I would recommend horror fans to give this a watch, it's silly and boring at times but the good bits make up for that.","user":"Tikkin","rank":[14,18]}]