[{"title":"The Best Of The Beach","rating":18,"date":"18 December 2000","review":"All of the seven, count 'em, seven beach movies are really silly and poorly acted.  However, they are great fun to watch.  This is the best of the lot, featuring a pre-\"Big Valley\" and \"Dynasty\" Linda Evans as pop princess Sugar Cane.  Paul Lynde is a scream here, with his trademark slow burn.  Watch him as he insults Eric Von Zipper, who's too stupid to realize it.  Don Rickles is also good during a scene where he takes the mike and rips into the kids. There is so much zaniness going on here, much more than the movies that came before or after it in this series.","user":"hillari","rank":[17,19]},{"title":"Best of the Beach","rating":11,"date":"11 January 2000","review":"William Asher's Beach Blanket Bingo is probably the best, and certainly the most entertaining, of the AIP beach party movies.  For once, the script is actually funny, not just stupid, and the presence of Buster Keaton, Timothy Carey and, of course, Harvey Lembeck as Von Zipper, adds a lot to the camp value and a very young Linda Evans adds her own exotic beauty.<br><br>Annette looks great, Frankie even seems to have a tan and the late, great, John Ashley adds to the fun.<br><br>This isn't Shakespeare, but the script is clever, and this probably has the best songs in the series, with the great Les Baxter actually having a hand in the songs and their arrangements in addition to his usual scoring duties.<br><br>By all means catch this one if you like the series, and if you aren't familiar with it, I would recommend starting here.  You won't be bored!","user":"carolsco","rank":[13,15]},{"title":"BEACH BLANKET BINGO (William Asher, 1965) ***","rating":7,"date":"23 July 2008","review":"The fifth entry in the \"Beach Party\" series is universally acknowledged as the best of the lot. Having watched three such films in quick succession, I have to agree: it's not that those concerned made a concentrated effort at creating something more accomplished than before, but just that all the various elements (while others were dropped or altered) seemed to be more evenly balanced here to produce a generally more satisfying result. Incidentally, not only is the script wittier than usual  but even the songs are kinda pleasant this time around <br><br>Plotwise, we still get Frankie (Avalon) and Annette (Funicello) bickering  but, rather than because one of them is being 'preyed' upon by an interloper, both of them are in this case (and, coming via members of a skydiving troupe who're supposed to instruct the \"Beach\" gang in just that type of sport, creates a few welcome sparks of high-flying tension). As always, the manager of the exciting but potentially dangerous 'entertainment' is played by Don Rickles  whose character name, or moniker, has gone from Jack Fanny in MUSCLE BEACH PARTY to \"Big Drag\" in BIKINI BEACH (both 1964) to \"Big Drop\" in this one! Annette's fling, then, is John Ashley (usually seen as a surfer!) while Frankie's is spunky Deborah Walley (whom I recently watched in the Elvis Presley vehicle SPINOUT [1966])  since Ashley and Walley were married to one another at the time, I guess this is why they made the former a rival to Frankie instead of a pal for this particular entry! <br><br>Another important change in the nonsensically-titled BEACH BLANKET BINGO (by the way, exuberant dancing blonde Candy Johnson  easily the most resistible element in the two earlier films from the series that I watched, is nowhere to be seen in this one!) concerns the character played by Jody McCrea: while his nickname has unaccountably gone from \"Deadhead\" to \"Bonehead\", he's now given two separate romances (which means that his former grating comic relief persona has been considerably diluted). The first involves singing starlet Linda Evans (miles removed from her signature role in the 1980s TV series DYNASTY!), ostensibly engaged in a skydiving stunt to promote her current record but actually doubled by Walley, and the other with real mermaid Marta Kristen, who's really the one that saved McCrea from drowning but the feat is once again attributed to the naïve but spoilt Evans by her conniving and sardonic manager Paul Lynde! While we do get an appearance from another screen giant here  comic genius Buster Keaton, then going through a much-deserved renaissance  this is rightly credited at the very start instead of relegated to the end credits, since it's a relatively bigger role than either of Peter Lorre's or Boris Karloff's cameos (one in each of the previous \"Beach Party\" films I'd checked out). Even so, his character could have been better integrated into the plot  since, playing Rickles' girl-chasing assistant, he's not given anything particularly inspired to do: it's fitting, for instance, that Keaton be involved in the speeded-up chase towards the end (by now a typical component of the series intended to mimic the style of Silent comedies)but the same can't be said of his cavorting with a trio of anonymous-looking girls during the final credit roll! <br><br>Two welcome presences (actually both returns from previous entries in the series, though allowed greater stature than before) are those of Harvey Lembeck as Eric von Zipper  self-pitying leader of the motorcycle gang \"The Rat Pack\"(!), who idolizes Evans to the point of kidnapping her  and Timothy Carey as the nasty \"South Dakota Slim\" (though, regrettably, without his werewolf companion from BIKINI BEACH: it's strange how this actor brings such intensity to his portrayals that he seems to be permanently on acid or somethingand this goes for mainstream fare as well, such as CRIME-WAVE [1954], which I watched just a few days prior to this one). By the way, both these actors are involved in the film's two biggest belly-laughs: engaged in a billiards game at a pool-hall  already featured in BIKINI BEACH, its walls are adorned by portraits of notorious dictators!  and, with Lembeck taking forever to make his next move, Carey acidly quips that he's shaved twice since von Zipper's last shot!; the latter, then, enters a trendy nightclub by smashing through the front door on his motorcycle (as is Lembeck's fashion)  only to land, in this particular case, head first in an aquarium! Besides, the element of surrealism which surprisingly entered the series with BIKINI BEACH is also present here in the form of the fanciful mermaid subplot as well as von Zipper's ghastly yet amusing fate during the climax at a sawmill (which, again, evokes the cliff-hanging serials from the Silent era).","user":"Bunuel1976","rank":[14,17]}]