[{"title":"For Jennifer Jason Leigh die-hards only","rating":26,"date":"26 September 2000","review":"I bought this DVD not expecting a whole lot given its price tag of $6.99, and it was neither better nor worse than I expected.  Only bought it because Jennifer Jason Leigh, who stars, is one of my favorite actresses.  BTW, you might be confused looking at the DVD's front cover (which IMDb reproduces), because it shows a picture of co-star Ann Jillian with a caption of \"Jennifer Jason Leigh\".  Dunno if the schlock DVD producers didn't know the difference or if they just thought the photo of Jillian all dolled up like a prostitute would be more eye-grabbing.<br><br>The film itself is about as good as you'd expect a U.S. TV \"movie of the week\" from 1983 to be.  Interestingly, there's some nudity (the breasts of Jennifer Jason Leigh and a couple of other actresses make an appearance), so I wonder if it was produced for a pay-TV channel.<br><br>I was surprised to find out after watching the film that it's based on a true story (I don't think they mention this in the credits anywhere). You'd never think this given the unrealistic nature of many of the events in the film.<br><br>Other than the stilted dialogue, lack of imagination, bog-standard camera setups, and whatnot, an annoying factor is the cross-racial casting. True, the average American can't tell at a glance from where in Asia someone comes from, but Asians can tell, and Asiaphiles can tell.  Much worse than the non-Japanese-looking actors, however, is the absolutely horrible pronunciation of Japanese dialogue.  Oddly, none of the Japanese dialogue is subtitled, which wouldn't have been too terrible for me, as I speak Japanese, but the language is so butchered by the non-Japanese-natives that I couldn't comprehend much of it.  In one scene an American actress seems to use nonsense syllables when she's supposed to be speaking Japanese (perhaps she couldn't remember her line or they didn't get it translated for her in time or something).<br><br>To sum up, fans of Jennifer Jason Leigh (or T2 score-writer Brad Fiedel) may want to watch this out of curiosity, but others need not bother. Personally, I had to watch Leigh's wonderful performance in \"The Hudsucker Proxy\" afterwards to wash the bad taste out of my mouth.","user":"Dan_Harkless","rank":[17,22]},{"title":"Hawaii Five-O Was Better","rating":3,"date":"29 March 2007","review":"Oriental bad guys entice a sweet, naive young American girl named Carol (Jennifer Jason Leigh) to Tokyo, ostensibly to further her singing career. But the bad guys run a prostitution ring out of a Tokyo club called the White Orchid. And Carol's real job is that of a prostitute. Carol resists, and her boyfriend leaves the U.S. to rescue her. Based on a real life event, this made-for-TV film is sub-par.<br><br>For one thing, Leigh is miscast. She's too young and too innocent looking. Another problem is that beyond the basic premise, there just isn't that much to the story. Pacing is slow. Characters spend a lot of time walking around on the streets. Ancillary singers sing and perform in the club. All of which add up to ... filler.<br><br>The film has a cheap, made-for-TV look and feel. Music is nondescript. Acting is stilted. The film's ending is predictable and visually unimaginative. \"Girls Of The White Orchid\" is rather like an inferior imitation of an extended episode of Hawaii Five-O. I kept waiting for Steve McGarrett to show up to tell his partner: \"book'em, Danno\".","user":"Lechuguilla","rank":[10,15]},{"title":"A Good Story of Trafficking of Human Beings","rating":7,"date":"13 November 2009","review":"In Los Angeles, the naive and lonely burger waitress and aspirant singer Carol Heath (Jennifer Jason Leigh) finds an advertisement in the newspaper with a job opportunity in Tokyo. She has a meeting with the agents, the American Cavanaugh (Philip Charles MacKenzie) and the Japanese Shiro (Richard Narita); she signs the contract in English and Japanese and travels to Japan to work at the White Orchid night-club. She shares a hotel room with a dancer and sooner she discovers the scheme of prostitution in the club that belongs to Yakuza. Alone, without money and her passport, she is protected by Shiro, but pressed by the managers Madame Mori (Carolyn Seymour) and her husband Mori (Mako) to be receptive to client's proposals. Meanwhile her former boyfriend returns to LA and seeks her out.<br><br>\"Girls of the White Orchid\" is a good story of trafficking of human beings, showing the recruitment, transfer and reception of white slaves. Unfortunately, the plot becomes unrealistic in the moment that Carol refuses to prostitute, and has an awful commercial conclusion with the rescue of her boyfriend. There are better recent movies about this theme but considering that this is a TV movie of 1983, I believe it is one of the first to deal with this subject. The reviews in IMDb and the IMDb User Rating are very unfair with this film. My vote is seven.<br><br>Title (Brazil): \"Escravas Brancas\" (\"White Slaves\")","user":"claudio_carvalho","rank":[8,14]}]