[{"title":"Science Fiction for Science Fiction Fans","rating":7,"date":"7 November 2002","review":"Millennium is one the few movies about time travel that stays true to the original source material. This far-out John Varley narrative is brought to the screen as faithfully as can be imagined. If you've ever wondered what really happens during so-called \"natural\" disasters, this is the script for you. The film is pure science fiction -- fun to watch, but impossible to understand unless close attention is paid. Stay awake and you'll be astonished by this story. Kristofferson and Ladd are surprisingly well paired, and the time-traveling Ladd is 100% believable in this mind-bending scenario. The sole jarring note is the voice-over coda at the end of the film -- an un-credited Churchill quote that sounds comical and out-of-place. This is one of the most under-appreciated movies of the '80s.","user":"bneyman","rank":[33,36]},{"title":"A mixed bag","rating":6,"date":"11 August 2007","review":"Millennium is mixed bag. The script is reasonably good - not too exciting, but thoughtful and well constructed. But there are some problems that drag the movie down.<br><br>The romance/relationship at the heart of the story is not bad, and has been unfairly panned. It's actually one of the strengths of the story. Kristofferson does a good job of playing a rather dull character without a lot going for him... a working stiff without much of a life, who wakes up a bit when he meets Cheryl Ladd's character. <br><br>Ladd underplays her part nicely, with a nice understanding of the nuances and double meanings of some of her dialogue. The directing is fine, low key, and the editing is good (apart from the ending, which I doubt was the editor's choice). The script sparkles most when it deals with Ladd's character, her difficulties in communicating across a profound cultural barrier, her inadvertently humorous faux pas when interacting with a world very different from her own. The \"cigarette scene\" in the restaurant is a classic.<br><br>There are some problems, mainly around the ending, some of the acting on the part of the minor characters, and the character of Sherman. I won't reveal the ending, but I will say it was disappointing, and probably responsible for the cool reception the film received. The robot Sherman is poorly designed and conceptualized, and drags down the rest of the story. It's not a question of budget, in Sherman's case, but of someone without a good intuitive feeling for science fiction concepts, making decisions about that character. He's not campy, to my mind, he's an embarrassment.<br><br>Some people posting here have complained about the dialogue. I think they may be missing the profound reason for Ladd's character's odd choices of words, and what the words reveal about her. Others have complained about the scenes that are shown twice, telling the same story from different points of view. I can understand that people looking for a more action packed movie could have been bored by these scenes, but they do reveal key information; they're not just reruns of the first, they're revelations. They're an effective device for showing the parallel but very different points of view of the key characters.<br><br>In sum, Millennium is a reasonably good but not great movie. It's frustrating because a genuinely good movie could be made from the existing footage if the robot was redone (redesigned digitally after the fact and given a better voice and better dialogue), and if the final voice-over was omitted. But I still like watching it and appreciate the elements that are successful in the movie.","user":"Nilsosmar","rank":[26,30]},{"title":"Good \"B\" Film","rating":8,"date":"18 August 2004","review":"This film is not as bad as the comments here indicate. Good premise and a few comedic touches enhance this time travel tale starring Cheryl Ladd (who, in my opinion is an very underrated actress) and Kris Kristofferson. I have to admit that although the (not so) special effects could have been better and the last line at the end should have been left out, it's still a memorable film that will entertain most time travel fans. Exterior scenes were filmed in Toronto although the setting is supposed to be Minneapolis.<br><br>I wasn't expecting much so maybe that's why I enjoyed it.<br><br>\"Take a chance, Louise\"<br><br>7/10","user":"Criti-Size","rank":[45,56]}]