[{"title":"Christie Cromwell - Bull in a china shop","rating":10,"date":"25 April 2010","review":"Residing somewhere in a parallel dimension called \"Scream for Help\" where everybody is a scumbag reigns Christie Cromwell. Played with such over-the-top antics and foul-mouthed bombast by Rachael Kelly, this single performance makes this movie one of the sleaziest and most entertaining eighties bad movies I have ever seen. Young Christie thinks that Paul Fox, who has recently married Chrisite's mother Karen, is a conniving philanderer who is only after their money and wants the both of them dead. She's right of course but the problem is getting anyone to believe her since she's such an abrasive little bitch that nobody wishes to come near her let alone listen to her petty conspiracy theories. One morning she follows Paul on her bike until he motors away from her. Not one to be deterred easily Chrisite waits the next day until Paul drives by the spot she lost him at and continues to follow him. This goes on for about a week until she finds Paul's car outside a house. Christie looks into the window to see Paul engaged in a little back door sex with a mysterious woman which she promptly takes a picture of. This escalates the war between Paul and Christie with the dopey Karen caught in the middle trying to make nice with both of them. From here on you might need a shower as the seediness pours through every scene as Christie and Paul try to out scum each other. Along for the ride are Christie's acquaintances, I can't see her having any friends, the extremely large busted Janey (you'll know what I mean) and her boyfriend Josh. When Janey is run down by Paul Christie grieves like any good friend would do by losing her virginity to her boyfriend. This leads to one of the funniest lines when Josh comes over to see her only to be shot down when Christie says that she was looking for anyone to pop her cherry \"even the garbage man\". Wow! A final showdown ensues as Karen and Christie become hostages in their mansion as Paul, his partner/double crosser Brenda and her husband Lacey battle wits with the vicious teen. This movie is like a Wile E. Coyote and Road Runner cartoon if Road Runner was banging Wile E.'s mom. That's the best way I can describe this. Every time Christie thinks she's got Paul dead to rights he manages to get away unscathed. Plenty of nudity, profanity, and eighties cheesiness to keep even the most jaded of viewers with a smile on their face. \"Scream for Help\" is the very definition of why a really good \"bad movie\" trumps the pretentious crap that poses for theatrical fare today. Simply a must see for any fan of B-grade cinema.","user":"Zeegrade","rank":[19,21]},{"title":"Fantastic trash","rating":8,"date":"5 December 2005","review":"This is fantastic trash from one of the most accomplished trash directors, Michael Winner . It is \"The Girl Who Cried Wolf\" and that wolf is her stepdaddy (David Brooks). Like most of Winner's work, it is loud, as subtle as a sledgehammer, full of nasty expletives and downright mean-spirited. If that's not a hard enough sell for you, it's also filled with sleazy sex and there's a sexual assault.<br><br>Say what you want about the man, but Winner does deliver. He attacks his genre work with enthusiasm and a healthy dollop of offensiveness. He's not afraid to alienate more sensitive viewers and he never goes for suggestion when a lurid close-up will do.<br><br>The idea of showing everything from the perspective of a young girl is a good one and it's novel to watch little Rachael Kelly, as Christie Cromwell, riding around on her bike as she pokes her nose into her stepdaddy's sordid affairs.<br><br>The film's final half hour is a rocket ride of sleaze, violence and brutality and testament to Winner's blazing talent for garish overstatement.<br><br>You'll be a better human being if you miss this, but a lesser trash monger.","user":"fertilecelluloid","rank":[26,31]},{"title":"\"I just wanted to lose my cherry to anybody..even the garbage man!\"","rating":10,"date":"14 December 2003","review":"This film is a trash epic. Non stop laughs and a plot that pre dates the awesome STEPFATHER! Dont believe the wowsers, check this one out!! Disbelievers should check out the scene where Christy is trying to get rid of her boyfriend whilst her capters hide in the background. brilliant stuff! Where is she now?","user":"PeteStud","rank":[21,25]}]