[{"title":"Wonderful movie!","rating":8,"date":"26 February 2004","review":"The first part of this movie, showing Eddie Murphy's life as an African prince, is one of the funniest things I have ever seen. I loved it. The wedding ceremony alone was so funny, I almost fell out of my chair from laughing so hard. I thought this could be one of the funniest movies of all time. <br><br>At about the halfway point, though, it stops being a laugh-a-minute riot, and kind of settles down into more of a quiet romance movie. The scene at the basketball game (with the man who worships Murphy) is the last really hilarious thing that happens. After that, it never again reaches the energy of the beginning. <br><br>This is not really a bad thing, though: it is still enjoyable from start to finish, even during the quiet parts. It has good actors, and it is fun to watch, and that makes it a great movie. I highly recommend it; it is one of my favorite comedies. I give it 8 out of 10 stars. See it if you haven't.","user":"Chromium_5","rank":[122,133]},{"title":"Another Great Comedy Starring Eddie Murphy","rating":14,"date":"14 December 2002","review":"After several years of starring in rowdy action comedies and con man capers, Eddie Murphy gets a chance to deliver a more restrained performance with this film and he manages to do so very well. Murphy portrays Akeem, an African prince who is being pressured into a forced marriage by his parents (James Earl Jones, Madge Sinclair). The woman that they have chosen for him only sees him for his royalty and therefore does not really love him. Akeem sees this right away and brings his loyal servant, Semi (Arsenio Hall) along with him on a discreet mission to America where Akeem hopes to find a beautiful woman who will love him and accept him for who he really is and not just see him for his royalty. Posing as \"common folk\", Akeem and Semi get jobs at a McDonald's style restaurant and Akeem soon falls for the daughter (Shari Headley) of the restaurant's owner (John Amos). The film features many hilarious scenes and characters especially a group of boxing obsessed senior citizens who spend their days arguing with a barber shop owner. Murphy and Hall demonstrate their levels of versatility by managing to go under heavy makeup and portray several different costarring roles. Yet another example of why Murphy is one of the funniest actors in recent Hollywood history.","user":"soranno","rank":[54,61]},{"title":"Royal Laughs","rating":28,"date":"28 February 2003","review":"COMING TO AMERICA (1988) *** Eddie Murphy, Arsenio Hall, James Earl Jones, Madge Sinclair, Shari Headley, John Amos, Eriq La Salle, Louie Anderson. Murphy does a fine job as an African prince unhappy about his upcoming nuptials to a woman he has never met so he sets off to New York to find his true love (and queen) with some sweet moments as well as comic (thanks largely to his and Hall's neat hat trick of playing several different characters thanks to the miracle of Rick Baker's make up).  Look sharply for Vondie Curtis Hall (of tv's \"Chicago Hope\") as an overly welcoming fellow native stateside; Cuba Gooding Jr. in a blink-and-you'll miss cameo (getting a haircut) and the clever inserting of Don Ameche and Ralph Bellamy as the Randolph Brothers from Murphy's and director John Landis' previous joint effort \"Trading Places\".  Best bit: Murphy becoming a real New Yorker and greeting a screaming abusive neighbor with \"Yes! Yes! ... and F**K YOU TOO!!!\"","user":"george.schmidt","rank":[45,53]}]