[{"title":"FEAR IN THE NIGHT (Jimmy Sangster, 1972) **1/2","rating":6,"date":"19 May 2007","review":"Sangster's third and final film as director forsakes the Gothic trappings of the first two for the psycho-thrillers which Hammer occasionally dabbled in (inspired by LES DIABOLIQUES [1954] and kick-started by the Sangster-penned TASTE OF FEAR [1961]).<br><br>As such, it's a pretty solid entry in the genre: well-made (the last half-hour being especially tense), stylish (making subtle use of elliptical editing, careful not to go overboard as was the case with STRAIGHT ON TILL MORNING [1972]) and sporting a compact but most able cast - Judy Geeson (her inherent vulnerability is suited to this type of frightened lady role), Joan Collins (going through a horror/thriller phase at the time and who's, of course, alluringly bitchy), Ralph Bates (it took me some time to accept him in a modern setting since he's so comfortably placed in the Gothic world of his other stuff for Hammer, but there's no denying that he does quite well by his role here!) and Peter Cushing (superlative as always, he has a field day with an ambiguous characterization); incidentally, Cushing and Collins must be one of the most incongruous husband-and-wife pairings in film history!<br><br>As one can gather from the above, I liked the film quite a bit and, in fact, pondered for a while the notion of awarding it a *** rating but was, ultimately, deterred from doing so by a couple of flaws: the 'ingenious' plot is, actually, fairly predictable (but, if anything, it's even more fun to be able to anticipate the many twists involved!); however, this also means that one has to labor through a first half that is both slow and repetitive!! I do feel that it's underrated in the Hammer canon: Leonard Maltin dismisses it, for instance, but Leslie Halliwell - not usually one to bother much with the company's latter-day output - is surprisingly complimentary in his review.<br><br>While FEAR IN THE NIGHT more or less adheres to Hammer's formula for this type of film - an innocent girl having a brush with murder and madness in remote surroundings - it also draws parallels to the contemporary giallos, especially with its device of a black-gloved stalker. Incidentally, of Hammer's 10 modern suspensers, I've only got two more to catch up with - MANIAC (1963) and CRESCENDO (1970).<br><br>The Audio Commentary here proves disappointing - not because it isn't informative but, rather, due to the fact that we get an awful lot of repetition of Sangster's anecdotes from his tracks for THE HORROR OF FRANKENSTEIN (1970) and LUST FOR A VAMPIRE (1971); to be fair to him, the fault lies more with moderator Marcus Hearn - who should have come up with a fresher set of questions, as it were. Then again, I'd have expected more insight into the actual construction of the script (a psycho thriller being, fundamentally, more intricate than a Gothic horror) - but it's safe to assume that, after all these years, Sangster recalls precious little about this aspect...although he does mention that he had pitched the script to the company as early as 1963, and that it was originally intended to be set on a boat! The discussion also touches upon Hammer's other suspensers: apart from citing TASTE OF FEAR and THE NANNY (1965) as his favorite films, Sangster mentions that Orson Welles turned up unannounced one day on the set of MANIAC; in connection with the film under review - which, incidentally, brought Sangster's fortuitous association with Hammer to a close - he acknowledges the fact that Peter Cushing was basically serving the same function (i.e. a red herring) that Christopher Lee did in TASTE OF FEAR.","user":"Bunuel1976","rank":[16,17]},{"title":"Intriguing and Mysterious Thriller by Hammer","rating":7,"date":"9 December 2018","review":"In London, the twenty-two year-old Peggy Heller (Judy Geeson) meets and marries the school teacher Robert Heller (Ralph Bates) after recovering from a nervous breakdown. Robert works in the countryside in a private school owned by the headmaster Michael Carmichael (Peter Cushing), who is married with Molly Carmichael (Joan Collins). On the eve of moving to the country with her husband, Peggy spends the night at the board house of Mrs. Beamish (Gillian Lind) and is attacked by a man with mechanical arm in her room. Mrs. Beamish calls the doctor but they do not believe in Peggy. On the next morning, she heads with Robert to the country and moves to the cottage in the school. But soon Peggy is attacked by the same man but Robert does not believe in her. Then she meets The Headmaster and realizes that he has a mechanical arm. What will happen next?<br><br>\"Fear in the Night\" is an intriguing and mysterious thriller by Hammer with Judy Geeson in the lead role. The storyline is good but could have more characters to increase the mystery of the identity of the attacker. But it is worthwhile watching this thriller. My vote is seven.<br><br>Title (Brazil): \"Um Grito Dentro da Noite\" (\"A Scream in the Night\")","user":"claudio_carvalho","rank":[9,9]},{"title":"Late, but top quality Hammer suspense thriller!","rating":8,"date":"22 January 2007","review":"This Hammer film has remained in the wilderness for years, but thanks to Optimum Releasing, it now has its long awaited DVD release. The back of the box proclaims this film to be the last of Hammer Horror's suspense films, and one of the best - and both of those statements are true! Many of the suspense films that Hammer produced are among the best that the studio had to offer - Taste of Fear and Paranoiac being among the finest of them. This film isn't your usual Hammer film or your usual Hammer suspense film and plays out a lot like a Hammer version of Italy's popular Giallo sub-genre. Hammer Horror would go on to make a lot of films that took influence from the more lurid Eurohorror imports in the seventies, and while this shift in focus didn't always serve them well - it certainly does here! The plot focuses on a boy's school. Peggy Heller is recovering from a nervous breakdown, and she goes to stay at the school with her teacher husband Robert. Upon arrival, she discovers that the school is run by headmaster Michael Carmichael, and she soon becomes the victim of murderous attacks by a one-armed man. However, nobody believes her...<br><br>It has to be said that the plot runs rather slowly for the first hour, with the hapless victim being attacked a couple of times and facing disbelief from both her husband and the wife of the headmaster. It's always interesting, however, and this slow burning first half soon gives way to a more furious final third, where revelations about the school and its headmaster become the forefront of the story and give way to a delicious double twist. The film features performances from three big stars of British horror - the sinister Ralph Bates is perfect as the husband, while the beautiful and deadly Joan Collins provides an extra dimension and things are topped off in style courtesy of a great performance from Hammer's main man Peter Cushing. Judy Geeson holds her own in the lead role also, and the film certainly doesn't come a cropper on the acting front. It has to be said that the final twist is somewhat predictable considering the film's genre, but it's carried off well and the way that the tale concludes is both clever and exciting. Overall, Fear in the Night might not have gained the same amount of praise as Hammer's more popular offerings - but it's a damn good film and I'm glad I saw it!","user":"The_Void","rank":[23,27]}]