[{"title":"One of the worst adaptations EVER","rating":1,"date":"16 August 2011","review":"I'm watching \"S&amp;F\" on Turner tonight (8/16/11), &amp; I don't recognize anything from the classic novel. I had seen the ending a long time ago, with Yul (Jason) &amp; Quentin(!!!??) (Joanne) sauntering down a southern road, musing optimistically--&amp; I thought the same then. I vaguely recall reading something that Martin Ritt wanted to help out Faulkner ($$) by adapting his early masterpiece, &amp; I guess this was the result: absolute garbage. Even with zilch familiarity with the novel, the film \"adaptation\" is just a baffling mishmash; with __any__ familiarity with the novel, the film is an abomination. Thanks to Turner &amp; anybody else who would snooze their audience to sleep, I guess we can say with a sigh of such adaptations, like Dilsey, \"they endured.\"","user":"Bob-562","rank":[15,18]},{"title":"Southern classic","rating":10,"date":"27 August 2001","review":"My all-time favorite Southern movie! Highly underrated! I saw this film one summer afternoon as a teenager and spent the next several years searching for it in the local TV guide to no avail--nor was it available on video (still isn't!). Despite the PBS host who referred to it as \"more sound than fury,\" I was knocked for a loop by the whole atmosphere created in this movie, which is very loosely based on the William Faulkner novel and the Compson characters in general. A couple years ago the True Stories movie channel (?) played it and I grabbed it on tape! My only complaint is that it is a Cinemascope feature and should be played in letterbox format to display the fine '50s-style clear-as-crystal cinematography to its maximum advantage. This is a movie that clocks you over the head with the soundtrack immediately, and the music defines the settings and characters throughout. Bear in mind that this is NOT a slavish interpretation of the mind-ripping book (not even close) nor could it be given its original release date! However, some of the characters are well-represented and even a few lines spoken word-for-word, and the production does an excellent job of capturing the heated Southern intensity of the original story. Joanne Woodward plays young Quentin Compson and the movie revolves around her teenage compulsion to connect with her mother (tall Margaret Leighton wonderfully cast as the wornout, dragged-down Caddy returning home after seventeen years' absence) and escape her cold, sarcastic, pitiless uncle, the \"keeper,\" to a life she imagines will be flavored with love and freedom. Yul Brynner, cast as Jason Compson (not the book version--that guy was nearly insane), is perfect in the role of Quentin's enemy uncle. He captures the character's seething anger, always on the verge of rising to the surface and exploding. At the same time he is a person with a powerful sense of responsibility, and it is truly enjoyable to watch him struggle to keep his highly dysfunctional family in some semblance of order. A few familiar faces from the book include Dilsey (Ethel Waters in a superior performance), strong, softhearted and stressed by the Compson downfall, and little Luster, always put to taking care of huge half-witted Benjy (Jack Warden, who works to capture a very intense and disturbed personality behind a blank expression). Quentin's other uncle, Howard, keeps his father's drinking tradition alive as well as the eternal unhealthy fascination of the Compson boys for sister Caddy; Jason's Cajun mother just stays in bed most of the day, longsuffering and tiresome to all. I love the way this movie features vignettes of the individual lives these people lead, and the way they intersect without ever fully connecting. Anger, passion, frailty, loyalty--all against this wonderful backdrop of decrepit mansions and closeminded small-town malice. I refuse to complain about the way it strays from the novel because as a movie it stands on its own, a separate work, and tremendously enjoyable. Recommended!","user":"sam66","rank":[41,56]},{"title":"Faulkner meets Tennessee Williams","rating":4,"date":"13 May 2012","review":"This is \"based on\" William Faulkner's classic novel, The Sound and The Fury. If you were wondering how they managed to get the nifty incomprehensible narrative onto the big screen...they didn't, instead opting for all the clichés of the Steamy South.<br><br>Of the two Quentins in the novel, the filmmakers decided to do away with male Quentin and instead focus on Caddy's illegitimate daughter. This did not upset me as much as it does some fans of the novel- all Quentin really does is lust after his sister. The scene in which the incestuous desire is most apparent is transposed to the big scene, except it's girl Quentin (Joanne Woodward) being forced to say her sleazy travelling circus artist's name by her \"uncle\" Jason (Yul Brynner).<br><br>In this film, the novel is re-done as Quentin's coming-of-age. Jason is now adopted rather than being her blood uncle so the writers can have their cake and eat it. Quentin is Jason's only hope to save his adopted family's good name: his adopted sister Caddy (Margaret Leighton)is an ageing nympho; one brother is an alcoholic; and the other one, Benjy, is a mentally-retarded mute. The parents were no good either.<br><br>It's almost a parody of Southern Literature: nymphos, lushes, incest, lust, and it's quite entertaining on this level. However, the casting choices were poor. Joanne Woodward has a lovely Southern accent but she was pushing thirty when she played seventeen-year-old Quentin, making her look more like an idiotic woman rather than a schoolgirl (although this family are a bunch of misfits). Yul Brynner does not exactly come to mind when you think of a Southern brute but he is suitably brutish and sensual. Jason in the book was hardly sensual but the film-makers need their romance.<br><br>Margaret Leighton isn't that bad as Caddy. It's not clear why her brothers would be so infatuated with her but she fills the role of decadent mother quite well.<br><br>Whoever is playing the travelling circus man is risible, as is the person who wrote the dialogue. We get a bunch of clichés, pseudo-meaningful lines and illogical flirtation. It all looks like somebody filmed a dud Tennessee Williams play.<br><br>If you're looking to punish a student too lazy to read the novel, please show them this film. Unless you desperately need your fix of steamy Southern melodrama, I would return to Tennessee Williams. Poor William Faulkner must have got a bit of a shock when he saw this.","user":"miss_lady_ice-853-608700","rank":[21,27]}]