[{"title":"One of the truly great adult films of the century","rating":10,"date":"16 November 2000","review":"I first saw this at 17 in 1971 and was of course struck by the frankness in the portrayal of the relationship between Murray Head and Peter Finch. People in the suburban audience where I saw it SCREAMED when the two men first kissed. (Someone screamed at a director's screening of the film, much to Schlesinger's consternation. It turned out to be Finch's wife.) One of the reviewers complained about Head's acting, but he is playing a very shallow character whose youth and beauty attract Glenda Jackson and Finch. The film holds up really well today with its complex characters and lack of stereotypes and simple judgments about people. There is also enormous charm and humor in the film, especially in the supporting players. The imagery in the film stays with me--the dog killed by a car, the Mummy's milk in the fridge, the inner workings of telephone switching, driving through the rain in London, men and women making love, precocious children smoking dope, and so much more. It feels like life. It also made me a lifelong fan of Finch, who went on to win a posthumous Oscar for \"Network,\" and Jackson, a two-time Oscar winner, who represents Hampstead in Parliament now. Probably my favorite film of all time.","user":"andyhumm","rank":[82,93]},{"title":"One of John Schlesinger's Finest Achievements","rating":10,"date":"20 August 2012","review":"Difficult to believe that this brilliant little film is 41 years old because it still feels fresh and vibrant the way his other films remain (Midnight Cowboy, Billy Liar, Darling, etc). It is as mature an examination of love in all its aspects as any film that has been placed on the screen since. The acting by an impeccable cast and the cinematography are first rate, but it is Schlesinger's sure hand that carved this story into our memories.<br><br>Divorced workingwoman Alex (Glenda Jackson) and well-to-do Jewish family doctor Daniel Hirsh (Peter Finch) share not only the same answering service but also the sexual favors of the young handsome artist Bob Elkin (Murray Head) who bed-hops between them as the mood takes him. Both Alex and Dr Hirsh are aware of the other's existence but prefer to live with the situation rather than risk losing Elkin completely. But a wet winter weekend in London can be difficult. Exceptional cameo roles are filled by Peggy Ashcroft as the doctor's mother and by Richard Loncraine as Bob's partner and Jon Finch who manages to epitomize the London street hustler.<br><br>There have been several films that have attempted to take on the matter of ménage a trois tales but none has approached the subject of the complexities of romantic relationships with the style and aplomb achieved here. It is a masterwork. <br><br>Grady Harp","user":"gradyharp","rank":[20,21]},{"title":"A Bloody Masterpiece","rating":10,"date":"11 March 2004","review":"After reading about John Schlesinger's death I felt the need to revisit some of his considerable opus. I couldn't decide where to start, Billy Liar, Darling, Far From The Madding Crowd or Sunday Bloody Sunday. If a film could really penetrate the brain of a character, Sunday Bloody Sunday, showed it to me. I saw into Peter Finch's soul to such degree I was kind of embarrassed and compelled at the same time. Murray Head, personifies what Finch's character longs for and is kind of horrified by. Glenda Jackson and Peter Finch play the imperfect angles of this painfully human triangle. The charming shallowness of Murray Head's character made me understand the complexity of knowing and accepting all of our darkest contradictions. John Schlesinger was a great artist.","user":"marcosaguado","rank":[97,115]}]