[{"title":"Lavish costumer from best-selling historical romance...","rating":8,"date":"8 April 2001","review":"Kathleen Windsor's racy best-seller lost some of its punch in transition to the screen--mainly because censorship restrictions forced a complete whitewash of Amber St. Clair's exploits in bed-hopping. What is left is mild compared to today's graphic depiction of sex--but since the story unfolds against an interesting historical background in London during the reign of Charles II, it is worth viewing. Linda Darnell was not the first choice for Amber--Peggy Cummins began the role but after filming several scenes was dismissed as being too immature. Linda makes a voluptuous, willful Amber. Cornel Wilde is excellent as Bruce Carlton, her true love--although an unrequited one by the film's end. George Sanders does a terrific job as Charles II, spouting some of the film's wittiest dialogue and clever in his cat-and-mouse game with Amber. Richard Haydn as the Earl of Radcliffe gives perhaps the most interesting performance in the entire film, particularly during the fire sequences. The London fire is staged with authority, as are the scenes involving the Black Plague. David Raksin's musical background is a sumptuous, richly textured score (now available on CD from Marco Polo records). A film full of rich details under Otto Preminger's direction--but not as strong because of censorship restrictions and the inability to tell the story the way Windsor wrote it. The ending is entirely too abrupt in the video print with the original lengthier ending missing for some reason. Fans of Linda Darnell and Cornel Wilde will especially like this one.","user":"Doylenf","rank":[22,23]},{"title":"Restoration Revelry","rating":8,"date":"15 June 2007","review":"If Forever Amber were being made today the results would have been quite different. Without The Code and the Catholic Legion of Decency inspecting all the product that came from Hollywood, Amber St. Clair's sexual escapades during Restoration Great Britain would have been a far better film. Still it's not bad as it is.<br><br>Another reviewer compared it to Gone With the Wind. You can look at that in two ways, the interaction between Linda Darnell and Cornel Wilde and compare it to Vivien Leigh and Clark Gable. Lots of similarities there. But also the book itself was a blockbuster best seller in the Forties as Gone With the Wind was in the previous decade and brought in a built-in audience.<br><br>Kathleen Winsor when she wrote the novel was married to her first husband a football player who was a history student. For his honor's thesis he was writing about the Stuart Restoration. From his research material, Winsor became fascinated with the period and created her novel.<br><br>20th Century Fox and Otto Preminger got the rights and did a fine job in recreating the United Kingdom of the 1660s. Linda Darnell got one of her best roles in her career as Amber, a high spirited and vivacious girl like Scarlett O'Hara, who finds true love, but sacrifices it for ambition.<br><br>In class conscious times as those were there were few venues for people to rise, even less if you were a woman. Darnell rises from Newgate Prison to the court of Charles II where she becomes one of Charles's numerous mistresses. Along the way she uses many men, like highwayman John Russell, army captain Glenn Langan, nobleman Richard Haydn and even her own true love nobleman Cornel Wilde with whom she has a son out of wedlock.<br><br>Presiding over it all is a world weary and cynical George Sanders who plays Charles II. Sanders would play The Merry Monarch in another and vastly inferior film called The King's Thief. He does capture the jaded cynicism of Charles II so very well, it's one of his top five career parts. <br><br>If the title role in the film were about the male lead Bruce Carlton, I'm sure Darryl Zanuck would have cast Tyrone Power in the part as he appeared in several films opposite Linda Darnell. Instead Cornel Wilde steps in and he's a most dashing Restoration nobleman and seeker of fortune in the New World.<br><br>The most spellbinding performance and so against type is that of Richard Haydn as the elderly rake, Lord Radcliff. He's a widower who's looking for a 17th century trophy wife and finds one in Linda who at the point in time he first meets her is an actress. He's a coldblooded person of mystery and menace and really registers it well on the screen. He marries Linda and she inherits his title when he dies.<br><br>Haydn is killed in a thrilling scene involving the great fire of London which occurred in 1666. It's the highlight of the film and I can't say any more about how and why he's killed, but trust me it was one deserved end.<br><br>Though Forever Amber is a good film, it could have been far better, but for censorship problems. Still it provides Darnell, Sanders, and Haydn with some of their best career parts and is worth seeing.","user":"bkoganbing","rank":[40,44]},{"title":"A tarty romp through Merry Olde England","rating":9,"date":"29 May 2013","review":"Somewhat saucy romp has a ravishingly beautiful and amber haired Linda Darnell in the lead full of piquant carnality, lavish costumes and settings and a scene stealing George Sanders as Charles II. What it doesn't have is a lively pace and that to some extent is its undoing. Preminger was the wrong director for a piece of entertainment like this that required a florid touch, Michael Curtiz would have been much more at home at the helm.<br><br>The novel this is based on was a notorious but tremendously successful sensation of its day. That book while certainly not \"A Great American Novel\" is a highly enjoyable piece of pulp fiction full of sex, murder and double crosses in fancy clothes with a complex, very entertaining heroine at its center who has a good heart but is not overly burdened with morals. Unfortunately since they tried to film it in the forties when the Production Code was in full force the more salacious plot points had to be excised. What made it to the screen has its moments but shows the heavy hand of censors most evident in the abrupt ending but scattered throughout the movie. Still a fun romp with Linda giving a spirited performance and for those who haven't read the book a somewhat racy tone.<br><br>A troubled production from the beginning what with censorship problems, a recast leading lady, Linda Darnell stepped in after production had started when Peggy Cummings didn't work out and Lana Turner couldn't be borrowed from MGM and a martinet in the director's chair. <br><br>There are still a few amusing stories connected to the backstage upheaval that went on. Linda Darnell had worked with Preminger before on Fallen Angel and it had been rough going but she truly came to loathe him during production of Amber. Later while filming A Letter to Three Wives Joseph Mankiewicz needed her to throw a look of disgust at a picture unseen by the audience, to achieve that look he slipped a picture of Preminger into the frame without her knowledge, he got his look. <br><br>A small sampling of Preminger's directorial style: after acting out a scene for Linda and Cornel Wilde he screamed at them as they tried to do as he had instructed \"Don't do it like I did it! Do it like I meant it!\"<br><br>One peripheral story: when Ava Gardner was briefly married to Artie Shaw he flew into a rage and berated her when he caught her reading Forever Amber saying it was trash and she should be focusing her attention on things that would enrich her mind, he was that kind of husband. They divorced shortly after and within the year he had married Kathleen Winsor...the author of Forever Amber!","user":"jjnxn-1","rank":[19,21]}]