[{"title":"How You Going to Keep Them Down on the Ant Farm...After They Have Seen This Film!","rating":3,"date":"3 January 2002","review":"Mr. BIG(Bert I. Gordon) does it again!  He creates a truly bad science fiction film with amazingly poor special effects and some of the schlockiest character acting performances and dialogue around.  Supposedly based on a story by H. G. Well's, The Empire of the Ants is about how a group of people go to one of those shin-digs put on by real estate folks hoping you will buy some of their resort property after drinking some of their third-rate drinks and eating some of their crummy snacks.  Joan Collins is running the show, hoping to sell all the people who came by boat to her real estate project a lot.  Seems she is not a wholly reputable businesswoman, yet she has no knowledge of the fact that giant ants that grew from a leaking can of nuclear waste have taken over the resort and begin feeding on her guests, first in pairs.  In one of the more ridiculous scenes in the film, giant ants run on the dock, jump on the boat, attack one of the crew, and then cause the skipper, hardily played by Robert Lansing, to set fire to the ship and leave the survivors no recourse but to trek back by foot.  The journey back causes lots of death and destruction.  The most ridiculous scene in the film has an aged couple hiding in a cabin and then coming out to see these giant ants all over the hut and on the ground standing.  I almost fell over laughing at the awful special effects!  Finally, the remaining few reach a town that secretly has been taken over by giant ants that spray a mist over people and make them do their bidding.  The second half of the film breaks any possibility that you take the film seriously.  The first half, although filled with many a ridiculous moment, at least has some suspense and gives the actors a little screen time to show that some of them actually know how to act.  The second half is a hodge podge of poor script-writing, bad character acting, and some more real cheesy special effects.  The film is another testament to Mr. BIG's ability to create some of the campiest, bad sci-fi around.  Despite all this negativity, the film is a load of unintended laughs!","user":"BaronBl00d","rank":[23,31]},{"title":"Worth a look...but nothing to take seriously.","rating":7,"date":"7 March 2003","review":"This is my favorite giant insect movie.  I don't know what it is about this one, but every time I see it on AMC or where ever I have to watch.  The effects are bad and the plot isn't the best in the world, but not every movie has to be great to be fun to watch.  Usually, in movies of this type the monsters (in this case giant ants) are rarely seen cause they look so bad.  In this one, though, they don't care what they look like and they are more than happy to show us this cheesy ants...sometimes the old regular ants projected on the background, while at others really bad puppets.  The plot has these people looking at vacation plots...you know timeshare stuff. While touring the facility, some members disappear and then the ants attack. They have to get away from them and go down a river on a boat to do so. This is my favorite part of the movie, going down the river.  Lots of the cast are taken out here.  Unfortunately, it ends rather weak as they all get to this town that has some sort of connection to the ants, but what?  I would have preferred this one to stay with the river and wood scenes rather than the town part of the plot, but overall this movie is good fun.","user":"Aaron1375","rank":[15,19]},{"title":"It's not THAT bad...","rating":5,"date":"28 September 2009","review":"In my opinion the rating on IMDb for this movie is a little harsh. Okay, it's not a masterpiece and the effects are a little hokey. The acting isn't superb, but it isn't garbage either.<br><br>But you have to look at this film with an open mind. Don't take it too seriously. I think it's a nice adaptation of H.G Well's story.<br><br>There's good character development and story; and the ants could have been so much worse. Of course they look fake, but it isn't terrible to look at.<br><br>Ant-vision, cheesy ominous music prior to attacks and a strange ending don't improve the quality of the movie though.<br><br>All in all, if you like insect-attack movies with a few strange twists and character story, go check this one out.<br><br>5 out of 10 ants; ehh stars.","user":"tom_koopa","rank":[5,5]}]