[{"title":"Pretty good","rating":23,"date":"23 October 2004","review":"I actually didn't even know about this film, let alone not knowing its ties to the Universal Studios' Invisible Man series. I was pleasantly surprised by this movie. Sure, it's not Claude Rains' \"The Invisible Man\" film, or even Vincent Price's \"The Invisible Man Returns.\" It's not really even a horror film. But this movie had a pretty decent story.<br><br>It was about a man who is the grandson of the original Invisible Man They referred to the original as \"Frank Griffen\" in this story, but the original was actually named \"Jack Griffen,\" and his brother was named Frank in \"The Invisible Man Returns.\" Why they were inconsistent, I'm not sure. Anyhow, the grandson gets offered a fortune to sell his grandfather's secret formula to the Nazis, but refuses and goes undercover as a spy for the United States using the formula to spy on the Nazis to find out their plan of attack on the U.S. Very good plot.<br><br>With some good special effects and some great, the technical aspects of this film were at least just as good as the previous films. We even got some good warfare explosions. And the story was definitely enjoyable. So despite inconsistencies with previous Invisible Man films, this film is definitely worth a look.","user":"dgeer80","rank":[10,10]},{"title":"The Wrong Agent Was Invisible","rating":9,"date":"26 January 2003","review":"Frank Raymond (Jon Hall), grandson of the original Invisible Man, still has the old family formula but won't allow anyone to use it, even though World War II is looming on the horizon.  After an unfriendly visit by Axis agents (Sir Cedric Hardwicke and Peter Lorre) and the attack on Pearl Harbor Raymond comes to his senses. He offers the Allies the use of the formula but insists that no one uses it but him.  After all, the drug is dangerous but it's never really explained why.  Allied Command somehow agrees to go along with this dumb idea.  Apparently, it never occurred to them that something might happen to Raymond.  If so, what would then become of the drug?<br><br>Raymond becomes a phantom commando with a heavy boot for Nazi rears.  He parachutes into Germany (an amusing scene).  He's supposed to meet with a couple of people and steal vital information.  Instead, Raymond spends time wooing the beautiful German double agent he's assigned to work with (Ilona Massey) and playing puerile pranks on an overweight Nazi with an undersized brain.  Ultimately, Raymond saves the day by thwarting a far-fetched plot to attack New York.<br><br>Despite its faults, this was probably just the ticket for uplifting the morale of American audiences in dark, early days of the war.  Sir Cedric Hardwicke and Peter Lorre steal the movie as a Gestapo official and Japanese spymaster, respectively.  Their performances are much better than this lighthearted film deserves.  I laughed most over Raymond's confrontation with and escape from Hardwicke and his mindless minions at Gestapo headquarters.  Still, it bothered me that Ms Massey's character wasn't selected to become to become the Invisible Agent.  She was well placed, well trained as a spy, and highly motivated.  She knew all the right people, who had access to the right information, and demonstrated cool under fire. Most important of all, she was a lot smarter than Raymond.  If she was invisible, I'm sure the war in Europe would have ended much sooner!","user":"CommandoCody","rank":[13,15]},{"title":"Invisible Agent (1942) **1/2","rating":6,"date":"8 July 2005","review":"Of the \"Invisible Man\" series made by Universal, I was only familiar with the first two (both of which I'll rewatch again presently) - the James Whale original being one of my all-time favorites.<br><br>Ever since it was released as part of the \"Legacy\" set, I had mostly read negative opinions about this film - and even Leonard Maltin gives it a pretty low rating. However, I was very surprised by how much I enjoyed it! True, the leads are rather bland (why on earth is Ilona Massey credited before Jon Hall?!) but, then, INVISIBLE AGENT has a formidable trio of villains - Peter Lorre, Sir Cedric Hardwicke and J. Edward Bromberg - going for it (who even make Curt Siodmak's script sound better than it is). Besides, I must say that I'm a sucker for both WWII and espionage movies, so that's a big plus as well...which, I guess, means that it isn't really a horror film and that The Invisible Man is the hero! Oh well, you can't have everything!<br><br>John P. Fulton's still-impressive special effects (exposed a bit here by the extra clarity of the DVD transfer) deliver the goods and, all in all, the film made me keen to get to the remaining titles in the series.","user":"Bunuel1976","rank":[20,25]}]