[{"title":"Revolution in Latin America: Salvador (1986) vs Under Fire (1983)","rating":9,"date":"8 November 2005","review":"A version of this comparison has already been posted over at \"Salvador\" http://www.imdb.com/title/tt0091886/ <br><br>Salvador is Olvier Stone's best work and James Woods' finest performance. Perhaps my only regret about this movie has to do with it not going nearly far enough in depicting the brutality of the US client regime in El Salvador. But this observation does not count, as it doesn't have anything to do with the film as presented. A critique of Salvador would do much better to note that there are very few films about the political situation in Central America, period. Persons who are interested in the subject matter might do well to compare this Stone effort with the much earlier Under Fire (1983), a film which boasts superlative performances by Nick Nolte and Gene Hackman. Under Fire is perhaps one of the most under appreciated films, not just of the 1980s, but of all time. Both Under Fire and Salvador are head and shoulders above Ken Loach's limited tale of a Nicaraguan refugee's individual trauma - Carla's Song (made much later in 1996). Both earlier films were made at the time Central America was a major obsession of the Reagan Administration (which went so far as to suggest AK-47 toting Sandinistas were about to invade the Texas border). On account of this background alone, the respective cast and crews of both films deserve the sort of praise we should usually reserve for true artists rather than Hollywood's employees.<br><br>Both Salvador and the much earlier Under Fire are very close in their subject matter: portraying disinterested journalists who only after becoming aware of the gravity of the situation in which they find themselves turn unsympathetic towards clients of the American Empire. The sort of journalists which have been entirely purged from the corporate-owned \"mainstream\" or \"embedded\" press in the United States (and the EU too).<br><br>Both films do an outstanding job of noting the protagonists' rivals in the form of spin doctors for the regime whether from the US State Department or the corporate media. Characters like Salvador's ANS reporter Pauline Axelrod (played by Valerie Wildman) force us to recall the perverted scribblings of James Lemoyne (New York Times), the godfather of Embedded American Journalism; his students honored in that tribute to the corporate press, Welcome to Sarajevo (1997). Call that film for what it is: the anti-Salvador.<br><br>Under Fire goes much deeper than Stone's film in questioning the ethics of journalism and the sort of circumstances which compel individuals to look at the bigger picture. The depiction of the conflict between Hackman and Nolte, on both personal and professional levels, makes it a very rewarding film. Salvador's portrait of a troubled has-been photojournalist who undergoes a sort of radical shock therapy in a war zone is different, but certainly no less interesting.<br><br>I have to give the decisive edge to Under Fire for drawing much more attention to the nature and breadth of the foreign support upon which the corrupt Central American dictatorships relied. Salvador has a US helicopter turn up in the middle of a battle, an ambassador portrayed as indifferent, and that's about it. Under Fire, in contrast, has excellent performances by a young Ed Harris and Jean-Louis Tritignant as pro-regime killers, roles which draw attention to the nature and morality of those embattled dictatorships.<br><br>Salvador counters with a much more interesting profile of some of the members of the so-called \"government\" and its military. In Under Fire, we just see Anastasio Somoza depicted as an insignificant car salesman type in the background who also happens to be the latest heir to the dynasty which ruled over Nicaragua for much of the 20th century. This was a wee bit dissatisfying.<br><br>The major differences between the films are technical and stylistic. Some may prefer Stone's use of tight editing and rather fanciful action sequences. I personally preferred Under Fire's determined efforts to bring out as much stark realism as possible on screen especially in the battle scenes, which are among the most authentic attempts to portray urban and guerrilla warfare in the history of cinema. No, it's not as pretty as Tom Cruise dropping bombs to the accompaniment of Kenny Loggins, and any film which reveals as much deserves special praise. One wonders if \"Under Fire\" or \"Salvador\" could be made in Hollywood today.<br><br>A 9/10 for Salvador and a 9/10 for Under Fire, and again hats off to all associated with films which one can hardly imagine being made in this Orwellian or \"embedded\" age.","user":"raktratt","rank":[38,44]},{"title":"One of the best American films of the 80s","rating":19,"date":"19 February 2000","review":"Good films about politics are rare.  Films which successfully combine politics and a love story are even rarer.  \"Under Fire\" manages this triumphantly.<br><br>Nick Nolte, Gene Hackman and Joanna Cassidy give superlative performances as the trio of journalists caught up in the passion and excitement of the 1979 Sandinista revolution in Nicaragua.  That wonderful photographer John Alcott catches some magical images and Jerry Goldsmith composes a score so good you will want to seek out the album.<br><br>This is a film full of moments that will live in your memory, not least the shocking, tragic consequence of Nolte's willingness to assist the rebels. It brings home the chaos and confusion of war but also its moments of elation : \"I'd do it again\", says Nolte at the triumphant conclusion. Before that, the spy Jazy, played by Jean-Louis Trintignant, an urbane, cultured but completely amoral killer, tells us that we will only know the truth of what happened in Nicaragua once 20 years have passed.<br><br>Well, those 20 years are now behind us.  The right side won.  And this film, with its eloquent photography and soaring soundtrack, may turn even the most apolitical person into a Sandinista.","user":"heedarmy","rank":[28,32]},{"title":"Outstanding writing and acting in a credible milieu.","rating":9,"date":"2 April 2001","review":"\"Under Fire\" is a well-written, well-acted piece, showing photo-journalists operating in the milieu of insurrections in Chad, then Nicaragua. Watching Gene Hackman, Nick Nolte and Ed Harris perform together was a treat. And the writers gave them terrific lines. \"This is a great war: good guys, bad guys, and lots of cheap shrimp.\" I especially liked when Hackman's character asked if Nolte's character had slept with Hackman's woman when their relationship hits the skids, and Nolte answers directly, \"Hell no, Alex. We're friends.\" And you just know Nolte's character meant it, man to man. Great moment. Also appealing was the way third-world conflicts were portrayed as global brushfires; put out one here, while another flares up over there. Using the real civil war in Somoza's Nicaragua gives the film unexpected credibility. And probably in keeping with reality, Ed Harris has several memorable scenes as a pure mercenary, a globe-trotting soldier-for-hire, who shows up where the gun-battle action is. His last line is something like \"See you in Laos\". The beat goes on. -ejpede","user":"ejpede","rank":[21,24]}]