[{"title":"A well presented oriental adventure...","rating":7,"date":"23 July 2005","review":"After her adoring audience had grown up, they discovered that Maria Africa Vidal de Santo Silas (born 1920, died 1951) hadn't done her own singing (she was dubbed), nor her own dancing; her ability as an actress was also put into question, but her spell was not tarnished...<br><br>Maria Montez was still the madly glamorous South American 'Queen of Technicolor'. What her roles (all of them variations of Scheherazade) required were ingredients she had a surplus of: statuesque bearing, regal demeanor, fiery beauty and, best of all, an unassailable confidence in herself When one weighed all the things she couldn't do against the thing she did so well, the balance came out in her favor<br><br>Her film, \"Arabian Nights,\" is a well presented oriental adventure which has nothing to do with its source material but entertained multitudes in search of relief from total war and was followed by several vaguely similar slices of hokum with the same stars...","user":"Nazi_Fighter_David","rank":[27,31]},{"title":"Superlative Technicolor effort","rating":8,"date":"13 July 2007","review":"Arabian Nights is one of the best early Technicolor efforts out of Hollywood and it really shows. It is great fun with a little something for everyone. The DVD is an excellent transfer and the color is beautiful on my new plasma HD TV. For the kids, its a simple action film with good good caliphs and bad caliphs. For the men, there's the gorgeous Maria Montez (OK, so the boys will enjoy her too.) For the ladies, the costuming will simply amaze you. This film can be watched by everyone except small children (a couple of killings - non graphic and 1 torture scene - also non graphic). Highly recommend for families with children 8 and over yrs old. Us older folks will enjoy it too. You can watch this many times. It won't get old.","user":"Bill-ray","rank":[13,14]},{"title":"Spectacular spectacle","rating":15,"date":"15 November 2000","review":"I remember seeing this film when it appeared in 1942, during WWII, a time of tension and uncertainity.  It was great escape. The villains were villainous, the heroes heroic.  The drama was dramatic and the storyline warm and fuzzy. Seeing it on video has allowed me to revisit that past time when as a child the world was uncertain and it was possible to escape into a costume-splendoured fantasy where the hero gets the girl, saves the kingdom and justice is served.  There's nothing ever wrong with that.","user":"artzau","rank":[29,36]}]