[{"title":"A fascinating 1960s document that anybody interested in the Warhol Factory scene should watch.","rating":30,"date":"30 July 2003","review":"The thing I really love about the D.V.D. revolution of the last few years is that some of the strangest and most obscure movies are now readily available. No longer do you have to spend hours searching through the racks in out of the way video stores or resort to fourth generation bootleg copies. 'Ciao Manhattan' is a case in point. I'd been curious about this movie ever since reading Jean Stein's brilliant Edie Sedgwick bio 'Edie' back in the 1980s, and now here it is! The 30th Anniversary edition, with excellent picture commentary and deleted footage. The only people who seem more excited about seeing it again than me are the directors (John Palmer and David Weisman) themselves going by the chatty and informative commentary track they have made with 'Ciao Manhattan' co-star Wesley Hayes. For those who don't know Edie was \"The Face of 1965\", a beautiful socialite turned model and Warhol \"superstar\". At one point in the 1960s quite possible the coolest girl in the world. Very shortly thereafter she was almost forgotten, and died aged 28 after a drug overdose. 'Ciao Manhattan' is made up of black and white footage shot in 1967 originally intended for a never finished movie that almost accidentally starred Edie, and later colour footage filmed in an attempt to salvage the project. In the final version Edie plays a character called Susan, a former model and underground film star who has retreated to her mother's home for \"treatment\". She's a mess - has permanent brain damage and a drinking problem. Hayes plays Butch a young Texan drifter who picks Susan up while she is hitchhiking half naked down the highway. He returns her home and Susan's mother (Isabel Jewell) hires him to babysit her troubled daughter. The movie cuts between \"now\" and then, colour and black and white, documentary footage and paranoid sci fi fantasy. It's quite a trip! Anybody interested in Andy Warhol or The Velvet Underground will want to see this very strange, but watchable mess. Neither Warhol or The Velvets actually appear mind you, but Warhol scenesters like Paul America, Baby Jane Holzer, Brigid Berlin (Brigid Polk) and Viva do, as do Beat legend Allen Ginsberg (as himself, mostly naked) and 'Barbarella' director Roger Vadim (clothed, as Susan's doctor). If you watch the outtakes you also get to see Robert and Nena Thurman. Yes, Uma's folks. 'Ciao Manhattan' may not thrill everyone but for me it's essential viewing for anyone interested in 1960s pop culture, especially Warhol's Factory, which subsequently influenced almost every underground pop movement thereafter from punk on down.","user":"Infofreak","rank":[41,45]},{"title":"Sad, so very, very sad","rating":2,"date":"20 June 2005","review":"As Edie's biography here on IMDb says, she was in and out of institutions. It is clear that this woman-child was taken advantage of very callously by Andy Warhol and others, at first for her money, and later for her celebrity.<br><br>Ciao! Manhattan shocked and angered me when I first saw it in 1972, because I had known Edie. For several months in 1962, when she was in a very tony, low-security psychiatric institution in Westchester, I knew her as a sweet-natured, somewhat reticent, and very artistic 19-year-old. When I first met her I thought she was a 12-year-old child, as I was, for she was so thin and under-developed looking for her age. Seeing the way she is abused in Ciao! Manhattan just leaves me feeling very sad for her. She deserved better than this exploitation film.<br><br>As for the \"Summer of Love\" reference made by an earlier reviewer on IMDb, referring to the fact that this film was actually made partly in 1967, I do not think Ciao, Manhattan represents any of the genuine feelings of free expression and loving attitudes that were touted at the time. There is far too much cynicism inherent in this film to connect it in any way to the hippie happiness one could experience in pleasanter circles than that inhabited/created by the ghastly, selfish, mean-spirited, and self-involved Warhol. He used and threw away such gentle souls as Edie. I weep for the lost and under-appreciated life she led while under the influence of Warhol. In kinder company, she might have survived and been happier.<br><br>Ciao, Edie! You deserved better.","user":"emefay","rank":[67,81]},{"title":"Worth buying if you get the Anniversary DVD","rating":6,"date":"23 February 2005","review":"This film is interesting only to anyone familiar with the saga of Edie Sedgwick. And it seems a bit ghoulish/voyeuristic to admit watching it for that reason. Although it's often claimed to be a biography of Edie, the film really is just a painful look at a person in the final stages of mental illness-drug addiction. She died soon after filming completed, which is no surprise.<br><br>The plot of Ciao is pretty garbled by the storyline involving the character Mr. Vedecchio. The director's commentary explains that Vedecchio was only added to the movie because during shooting the rest of the cast disappeared and there was nothing else to do but beef-up this role. In fact, the whole movie is a cut-and-paste of pre-meltdown Edie (black and white footage) and post-meltdown Edie (color), with Vedecchio and Paul America tossed into the mix. The color section also introduces Butch, the drifter from Texas, who does provide some much-needed comedy.<br><br>Although Ciao, Manhattan might not be particularly entertaining on its own, the DVD extras in the Anniversary package are wonderful, and to me made the disc worth purchasing. The directors' (and Butch/Wesley's!) commentary provides the story of how this movie \"directed itself\", and informs much about Edie and her state of mind during the last days of her life. There is quite a bit of extra footage from the Warhol-NYC days, and some terrific stills of Edie. A nice booklet is also included.","user":"ksie_15241","rank":[16,18]}]