[{"title":"Dumb, but great fun","rating":8,"date":"5 November 2001","review":"OK! Lets get one thing straight right now. If you're looking for a serious movie about cops v robbers a la Robert de Niro, Al Pacino or something similar this is not the place to come.<br><br>If on the other hand you want an action packed, leave your brain in the lobby, tongue in cheek zombie flick, with a side order of buddy-cops take on dastardly criminals thrown in then you aren't going to get much better than this.<br><br>Cops Mortis (Treat Williams) and Bigelow (Joe Piscopo) are on the trail of nutty old Vincent Price (unfortunately not given much screen time) bringing dead criminals back to life so they can carry out jewellery store robberies. Of course being dead already makes it a tad difficult for the police to kill them.<br><br>Mortis comes a cropper fairly early on, but worry not as he is soon resurrected with the regeneration machine found at the dodgy research company that they think might be connected with the crimes.<br><br>The only problem is Mortis now has only twelve hours to solve the case before he decomposes, so things move on at a fair old pace after this as the lads do battle with various zombies, and a Chinese butchers shop full of meat that comes back to life!<br><br>Great fun for fans of 'Braindead' or 'The Evil Dead' style horrors, and anyone else who wants a film that they don't have to take to seriously. Also stands up well to repeated viewing.<br><br>8/10 I say, but judging by some of the other IMBD reviews others wouldn't (boring gits!)","user":"chrissoda100","rank":[20,23]},{"title":"Better than you would think.","rating":10,"date":"7 August 2004","review":"I saw this movie back in 1988 when it came out, and recently we bought the DVD on a whim. Neither Chandra or I remembered much about it, but we both enjoyed it more than we expected.  The FX hold up well, even 16 years later, and it's just an enjoyable film.  <br><br>There are some gross bits (which makes it better!), but there were some good scenes deleted - make sure you check the DVD for the extra scenes,  The \"death day dream\" really ties in some of the disjointed bits in the movie.<br><br>True, some of the film is very dated 80's, but it still makes me grin.  Take a chance and you might enjoy it too.","user":"pwargo","rank":[23,27]},{"title":"Fast-paced, Fun Horror-Action Film","rating":6,"date":"25 December 2005","review":"Perhaps the only time zombies, cops, and a generous dose of humour have been infused together on film. Dead Heat is a fun, drive-in type feature with Treat William and Joe Piscapo starring as two cops in the style of something seen in Lethal Weapon. These cops have not done everything by the book and are in the middle of a crime wave where a different pair of armed thugs have been robbing jewelry stores and banks in broad daylight with no fear of being shot down(or having the weakness of being killed with any ease at all). Well, through some investigation, our two protagonists discover that a machine exists that can bring back the dead for twelve hours - and one of the cops gets his and is placed on the machine. Now, we have zombie cop against zombie criminals and one silly, fun, action-packed film on hand. Director Mark Goldblatt never tries to make this film anything more than what it is supposed to be. The actors don't try either, which is good when you have a script that only has so much elasticity. Williams is good in his role, and Piscapo definitely has limited range, but I really thought he did a much better job than his lack of acting gigs since would suggest. One major plus is the core of veteran screen actors with Darren Mcgavin, venerable Keye Luke, and the elder statesman of horror Vincent Price in attendance. Price has a small role but is still able to keep your attention. This was one of his last films. The same for Luke who I always felt was very underrated. Lindsay Frost is aboard as major eye candy. The special effects are interesting to say the least. The make-up used on the criminal zombies has a fake feel like big puppets at some points and at others is pretty good. The scene in a Chinese restaurant is a hoot - a very ridiculous hoot. Dead Heat again is nothing grand or thought-provoking or even scary, but it is a very fun film and should illicit a few laughs.","user":"BaronBl00d","rank":[16,19]}]