[{"title":"The next closest thing to flying in space","rating":10,"date":"28 February 2006","review":"To date, NASA has made five IMAX films that have been shot from the Space Shuttle or the Space Station. \"The Dream is Alive\" was the first, and is probably still the best. It must be seen on the IMAX screen to fully appreciate it, but still looks and sounds good on DVD if seen on a big television with a good sound system. The launch sequences would be excellent opportunities for audiophiles to display their subwoofers to admiring guests.<br><br>Considering that all of the film shot in space was shot by the shuttle crews rather than by professional cameramen, the results are outstanding. This is probably the closest you can get to the sensation of being in space, short of actually going there yourself. There are also excellent ground sequences of the shuttles being assembled, launched, and recovered, along with the training required for astronaut candidates  all well chosen to look dramatic in the IMAX format.<br><br>The three shuttle missions featured in this film all took place during 1984, and the film was released in the summer of 1985. At the time it was released, NASA was launching shuttle missions at a rate never seen before or since. The film displayed the optimism of the time, where the safety of the flights was not in question, and the goal of everyone flying in space someday seemed to be within reach. NASA had a teacher-in-space program and a journalist-in-space program (as well as an unofficial politician-in-space program, where a congressman and a senator conned their way into space flights), and an ambitious program of fifteen launches was scheduled for 1986. Everything looked rosy, and the film reflects this.<br><br>Then, on the first (and only) shuttle launch of 1986, Challenger exploded, killing the crew of seven (including two of this film's cast). The previous optimism vanished, never to fully return, in the light of revelations about unresolved safety issues, unrealistic expectations, etc. The film is thus an artifact of this vanished era, and it's rather sad to see this atmosphere of optimism in the light of what was to follow. Nonetheless, the sequences in the movie are still very effective, and the subsequent IMAX space films have only managed to equal (but not exceed) what is seen here. If you're a space enthusiast, you owe it to yourself to see this at least once in an IMAX theater.","user":"Canvoodoo","rank":[9,11]},{"title":"\"I think I hear someone kicking the outside of the orbitor!\"","rating":15,"date":"15 February 2003","review":"Depending on your perspective, \"The Dream Is Alive\" can be looked at as either a commercial for America's space program in 1985, or just a nice documentary at a time when space exploration was still a new fascination for most people. It came a year before the Challenger launch disaster, and 18 years before the recent Columbia re-entry disaster. One cannot watch this IMAX film without thinking of the spaceships which have been destroyed, and the astronauts who have died. Still, it is a very nice 36 minutes which in capsule shows how and why we choose to explore outside our Earth's atmosphere.<br><br>The film opens with pastoral early morning scenes in central Florida, birds, alligators, ambient sounds in the rear surround speakers, then \"BOOM\" as the de-orbiting shuttle breaks the sound barrier in its approach to Cape Canaveral. We witness a perfect landing. Through its 36 minutes we see how astonauts are trained, witness a launch, the release of a very large experimental laboratory, the capture and repair of a malfunctioning communications satellite. As the astronaut approaches it and says \"It looks like it's in pretty good shape,\"  someone in the control center in Houston quips back \"It doesn't work,\" followed by some laughter.  That exchange is just one example of the relaxed manner everyone was in when all was working as planned. <br><br>The IMAX presentation includes some remarkable film taken of various parts of the Earth from orbit. And, of course, the first American woman to take a space walk (see subject quote). What a sight to see two heads in space suits appear visible through the orbitor's front windows. The DVD is as one would expect very sharp and the surround sound is used intelligently. Overall a great snapshot of the space shuttle program.","user":"TxMike","rank":[6,9]},{"title":"A classic IMAX Experience","rating":30,"date":"30 May 2002","review":"I saw this movie at an IMAX film festival a couple of years ago. The shots of the earth from space are amazing, and the best part is, these aren't Hollywood Special Effects. It's all real. Even 15 years after it was made, it's still one of IMAX's best films.","user":"Opie-7","rank":[3,5]}]