[{"title":"Duel of Giants!","rating":10,"date":"25 July 2004","review":"Let's see: what we got here is one of the best romantic-comedy/thriller scripts ever made, one of the best Hollywood directors from 50's and 60's, the more elegant and classy actress ever (Audrey Hepburn), the more elegant and classy actor ever (Cary Grant), two of the best \"tough guys\" from the big screen (G. Kennedy and James Coburn), one of the best comedy actors ever (Walter Matthau), and the city of Paris. Nothing could possibly go wrong, don't you think? <br><br>Audrey Hepburn is Reggie Lambert, an American girl married to a swiss guy called Charles Lambert (at least that's what she thinks)... She's spending her holidays in some ski resort with her best girlfriend Sylvie and the son of hers. Reggie has decided to divorce her husband, so she gets back to Paris. Once there she found out that her husband's been killed. From this moment on she gets involved in the funniest spy plot ever.<br><br>Watching Charade you'll have an smile on your face from the beginning till the very end. And you'll burst out laughing in many moments of the movie. Stanley Donen gets out of every sequence very skillfully and, as he did before in Seven Brides or Singin' In The Rain, he probes he's an outstanding filmmaker. There're two names that come into my mind every time I watch this movie: Alfred Hitchcock and Blake Edwards. In Charade, Stanley Donen merged suspense and romantic-comedy in the best possible way. Actor's selection is just perfect, the chemical between Hepburn and Grant is simply unbeatable. One more perfect couple to add to Hollywood's Couple's Hall Of Fame: side by side with Katharine Hepburn-Spencer Tracy, Katharine Hepburn-Cary Grant (him once again!), Lauren Bacall-Humphrey Bogart... It's not easy to find two actors so compatible. What to say about George Kennedy or James Coburn? Best known for their roles in action movies, they do their best as CIA agents. And least but not less, we got Walter Matthau, one of the best comedy actors ever (I should've put Walter Matthau-Jack Lemon in my Couple's Hall Of Fame!) doing the best he can (that is a lot!) as (in principle) an American Embassy employee. <br><br>So if you liked North By Northwest or Breakfast At Tiffany's, if you think that there's never been a more classy actress than Audrey Hepburn, if you do believe that Cary Grant's been one of the more talented actors ever (and one of the funniest ones)... please, don't miss Charade. You'll spend one of the times of your life. <br><br>Aur Voir, Mon Amis!<br><br>My Rate: 10/10 or even higher.","user":"rainking_es","rank":[160,194]},{"title":"a perfect piece of classy and classic entertainment","rating":10,"date":"30 December 1999","review":"I'll be brief. This romantic comedy thriller hybrid is an absolute treat. Starring the classiest of actors in both Cary Grant and Audrey Hepburn and directed with continental style and flare by the incomparable Stanley Donen, this film is not to be missed. The photography (especially noticable in the new DVD version), Henry Macini's score, the taught and crisp script, the perfect supporting cast all add up to make a perfect piece of entertainment. I agree with many of the other IMDB writers- it is criminal that this film is not respected more. It is a blueprint of what makes a movie fun. A perfect 10 out of 10.","user":"jmcody","rank":[120,146]},{"title":"The Best Hitchcock Movie Hitchcock Never Made!","rating":10,"date":"13 July 1999","review":"CHARADE is the best Hitchcock movie Hitchcock never made! With romance, sophisticated comedy, and stylish suspense (including a smattering of graphic-for-its-era violence) balanced out deftly, CHARADE is the movie that made me a fan of both Peter Stone and Stanley Donen (yes, I actually saw this before I ever saw one of Donen's musicals!). Every other line is sparklingly quotable, and Cary Grant and Audrey Hepburn are among my favorite screen couples; pity this was their only big screen teaming (I liked the wry way they kidded the age difference between them, too). James Coburn, George Kennedy, and Walter Matthau (all Oscar winners now!) are in top form in these early screen appearances of theirs. Both Hepburn and Paris look their sophisticated best, and the theme is my favorite by Henry Mancini next to the PINK PANTHER theme. Do try to get ahold of the marvelous Criterion Collection DVD of CHARADE; it's well worth seeking out, with nifty extras including an utterly delightful commentary track by Stanley Donen and the late Peter Stone. By the way, CHARADE is also piggybacked onto the DVD of Jonathan Demme's well-meaning but disappointing remake, THE TRUTH ABOUT CHARLIE. On a related note, Donen's second Hitchcock spoof/homage, ARABESQUE, was released as part of a Gregory Peck boxed DVD set. I'm glad ARABESQUE is available on DVD, but I wish they'd recorded a commentary track by Donen and Sophia Loren while they're both still alive and reasonably well. But I digress...watch CHARADE today! :-)","user":"dtb","rank":[100,125]}]