[{"title":"Giant drooling stop-motion scorpions!","rating":11,"date":"11 June 2004","review":"Another stop motion classic from the atomic age. Giant scorpions awakened by volcanoes menace Mexico. You think a swarm of giant scorpions is bad, wait until you see the biggest and baddest of the bunch...The Black Scorpion!!<br><br>Willis O'Brien (the effects genius from King Kong) gets more than alittle help from Pete Peterson animating these arachnid monstrosities in all their stop-motion glory.<br><br>The effects were very well done, but unfortunately the transparent matte shots of the Black Scorpion entering Mexico City are terrible. Almost to the point where it ruins the movie. As is the constant (once or twice would be enough) close up of the scorpions face (which is a drooling animated prop). It would have been wonderful to see the Black Scorpion trashing buildings and attacking people in the city rather than a poor matte shot of the scorpion running through the streets.<br><br>Still overall a very enjoyable flick. The acting was actually pretty good compared to most of the genre films from the time. <br><br>The best scene from this film (hands down) was the descent into the underground lair of the scorpions, which also features not only a giant freaky worm, but a huge freaky looking trapdoor spider as well! The spider and worm prop were from the famous deleted \"bottom of the ravine\" scene from King Kong. So this is as close as you're going to get to reliving that infamous lost scene. Other great sequences include two scorpions battling the giant worm in a fight to the death, the scorpions swarming over and attacking a train at night, the Black Scorpion slaughtering the smaller scorpions, and the climatic fight between the Black Scorpion and the Mexican military in a soccer stadium.<br><br>I miss these kind of movies!","user":"giantdevilfish","rank":[41,42]},{"title":"Those Scorpions Gave Me Nightmares","rating":7,"date":"26 April 2006","review":"One of the better Fifties science fiction entries is The Black Scorpion or scorpions to be precise. These creatures got released during a volcanic eruption and started wreaking havoc in the area around Mexico City.<br><br>Of all the monsters created by the special effects guys including the great Ray Harryhausen, the ugliest, meanest, nastiest creatures ever brought to the screen were these scorpions. They are ugly as sin, emit an obnoxious drool when on the prowl and make a noise guaranteed to scare any kid or kid at heart out of his comfortable movie seat. And they are one of the few creatures which are not either from outer space or caused by radioactivity.<br><br>When the scorpions start doing their thing, scientists Richard Denning and Carlos Rivas are in the area as is ranch owner Mara Corday. In between trying to figure out how to combat the scorpions, a little romance gets going between Denning and Corday. And there's a cute little kid around played by Mario Navarro who gets in all kinds of trouble tagging along with the scientists. <br><br>But you can mute the romance and get into the action. I guarantee you will like the scene inside the volcano where Denning, Rivas, and little Mario have to deal not only with the scorpions, but with giant earthworms and spiders. And the final battle in the Mexico City soccer stadium between the scorpion and the scientists and Mexican army is a tingler.","user":"bkoganbing","rank":[33,35]},{"title":"Should have been called the scorpions that ate Mexico.","rating":7,"date":"29 June 2004","review":"Black Scorpion, is another semi classic, 50s giant monster movie. It should have been called the scorpions that ate Mexico. If you enjoy other movies from the 50s that feature giant insects or other huge monsters wreaking havoc on mankind, you will also like Black Scorpion.  You do have to keep in mind that this was made in 1957. Don't be looking for the thrills you can get from the special effects in today's horror movies. The movie has to be viewed within the context of the time it was released. For it's time, the special effects were great. This was truly a scary movie for it's time and continues to be exciting today. I found this to be a very entertaining movie and recommend it to anyone who enjoys the giant monsters of the 50s and early 60s. Enjoy.","user":"ChuckStraub","rank":[32,36]}]