[{"title":"My All-Time Favorite Movie!","rating":10,"date":"25 July 2002","review":"I just keep watching this movie over and over again. Why? It's hard to say exactly. Sure, the acting is great and the story is terrific, but what makes \"Tampopo\" so special is harder to define. I like to think of it as optimism; the belief that people in this world still do nice things for other people. Or maybe that romance can strike when you least expect it. Sure, this is a movie about food, you've heard all about that, but more importantly it's a movie about people. People working together, eating together, striving together, and accomplishing together.<br><br>The script is flawless. Every scene blends into the next, and takes you someplace new. The narrative sidetracks away from the main story from time to time, leading to the most conceptual and entertining scenes. Tampopo is an adventure on a very small and personal scale. It's a charming movie, unlike any other I've seen, well worth a look.","user":"underpussy","rank":[83,92]},{"title":"Made me want to get a bowl of noodles immediately.","rating":10,"date":"10 July 2003","review":"I watched this movie for the first time last night and I have to say, it was awesome. This is one of those rare movies that are made with so much emotion, you can't help but be affected by what's going on before your eyes. I found the movie to be funny, touching, shocking, sensual, weird, thoughtful, cute, etc. The love of food is apparent throughout the entire movie. It kind of reminded me of Like Water for Chocolate, the way food was revered in the story. The movie is done in an interesting way. Mainly, it's about a woman named Tampopo who is left in charge of her husband's noodle shop after he dies. Having problems with maintaining a general quality to the place, especially with the cooking, she receives assistance from a rugged cowboy-type. Along with several other characters, they help to turn the place into something special. Occasionally, the story veers away from this plot to follow other characters in food-related scenes. For instance, there's a vignette about a group of girls being taught how to eat noodle soup properly by an etiquette teacher at a restaurant. They notice another patron in the restaurant, sucking at his noodles loudly but clearly enjoying them. The girls then do the same thing, prompting the teacher to follow suit, all of them sucking away at their noodles with the most exaggerated sound effects I have ever heard. This results in a scene so hilarious that I had to stop it and rewind it after it was done. Soon after, the story goes back to Tampopo and the other characters in her universe. There's other characters that are returned to periodically, like this white-suited gangster and his moll. Their scenes are erotically charged and quite striking. It was funny but at the same time it just grabbed me attention wise. There's a moment where they pass a raw egg yolk back and forth through each others mouths without rupturing it. It's done slowly and erotically, the two lovers obviously enjoying this really weird thing we're seeing. I have to say I've never really seen anything like that in a movie. All in all, I was pretty much entranced from the moment the movie began. I really didn't think I was going to enjoy it this much! It's really funny and it shows a side to Japanese cuisine and how serious it is taken there that I had never known before viewing this. I recommend this movie from top to bottom and I think it has deservedly earned a spot in my all-time faves list! If you are interested in Japanese culture and you appreciate food in the least, you owe it to yourself to track a copy of this down and watch it, especially if you like a good bowl of ramen! <br><br>RATING: ***** out of *****.","user":"Mr Parker","rank":[51,56]},{"title":"A classic of world cinema","rating":10,"date":"15 November 2006","review":"This remains one of the better comedies of all time due to star performances, a superb script, and many, many surprises. Above all, the pacing is some of the best seen in any comedy.<br><br>Tampopo has all the qualities of good story telling: a hero, a disciple, a quest. <br><br>And when your hero is a trucker, the disciple a woman in need of help, and the quest to cook the best noodles then you know you're in for fun. <br><br>In between all this are vignettes on how food and life mingle. It is more than simple laughs there are moments of poignancy, and genuine flights of imagination.<br><br>Many directors could do well to watch the ease with which the camera is handled here: the plot flows beautifully and the switches to the small vignettes are handled with suitable aplomb.<br><br>All in all a three course meal.","user":"intelearts","rank":[22,24]}]