[{"title":"Tracy at his zenith","rating":10,"date":"2 July 2004","review":"We have been blessed with many, many wonderful films over the decades, and we have also been blessed with seeing many, many fine actors and actresses. Here you have a film, with a host of stars; brilliantly portraying characters from a true story, with acting that is sublime. The dialogue is sharp, witty, and each performance is gripping. Small town America, religious bigotry are all handled in a sympathetic manner by the use of powerful acting. I gave this film a 10 purely because it is one of those rare gems that stay in the mind forever. It is truly memorable, and one can watch it time and time again to marvel at the superb portrayals. There is a saying that they don't make 'em like they use to. No sir, they certainly don't!","user":"stanford-4","rank":[122,144]},{"title":"The right to think................very much on trial.","rating":10,"date":"14 February 2006","review":"Like Elmer Gantry I first saw Inherit the Wind in the theater in Brooklyn when I was 13 years old. Both of those films dealt with issues arising from the Roaring Twenties out of religion. At the time I thought both were great dramatic pieces dealing with issues of the past. I thought how much we'd grown up as a country from 1925 to 1960.<br><br>If you had told me that 46 years later we'd be fighting these same battles and that preachers had as much political power as they do I and many others would have said you were nuts. Yet here we are today in an age when Pat Robertson is taken as a serious political figure. <br><br>Inherit the Wind is a dramatization of the famous Scopes Monkey Trial of 1925 when a biology teacher was arrested and challenged a law passed by the Tennessee State legislature making it a crime to teach anything other than the account of creation as set down in the Book of Genesis. Dick York is the biology teacher here, renamed Bertram Cates for the play and the film version of that play.<br><br>In fact all the names of the dramatis personae of the Scopes Trial have been changed to allow some creativity by the authors Jerome Lawrence and Robert Lee. Spencer Tracy and Fredric March play fictionalizations of Clarence Darrow and William Jennings Bryan named Henry Drummond and Matthew Harrison Brady respectively.<br><br>Of course that is what Inherit the Wind is primarily known for, a duel of double Academy Award winners. In fact Spencer Tracy received another Academy Award nomination for this film, but lost to Burt Lancaster for Elmer Gantry. That's ironic to me because I thought March captured the essence of William Jennings Bryan better. Bryan is a man whose time has passed him by. But he's still a hero to the folks of small town rural America in the south and middle west. One thing to remember is that while Bryan was a great orator and advocate, he had not practiced law in over 30 years when he stepped into the courtroom for the trial. If he had been a better lawyer, he might not have fallen into the one big trap Tracy set for him and the trial and the attending publicity might have been better for his side.<br><br>As good as Tracy is, the year before in Compulsion I think that Orson Welles captured the real Clarence Darrow in his character of Jonathan Wilk. No one in Hollywood could do long take speeches quite like Spencer Tracy though. I'm sure that's why Director Stanley Kramer hired him and they developed quite the screen partnership with Tracy doing four of his last five screen roles for Kramer. <br><br>Stanley Kramer made some impeccable casting choices filling out the minor roles of the various townspeople of Hillsboro, Tennessee. There are two that I would single out. Claude Akins who usually played tough guys in various action films was astounding as the town preacher, the Reverend Jeremiah Brown. Sad to say there are still many like him out there. Akins's offbeat casting worked wonders, it turned out to be the high point of his screen career. <br><br>On the opposite end of the spectrum was Noah Beery, Jr. who is a farmer and who's son was drowned some time before the events of the film. Beery is the town non-conformist, he refused to allow his son to be baptized and Akins has said the adolescent is in hell because of it.<br><br>In a key scene when Tracy draws the ire of Judge Harry Morgan who sentences him to jail for contempt of court, Beery offers to put up his farm for collateral for Tracy's bail. Tracy's about to quit the case, but that simple gesture gives him hope, in the ultimate decency and clearheadedness of ordinary people. It's my favorite scene in Inherit the Wind.<br><br>Stanley Kramer lived long enough to see this film become so relevant for today's times. I wonder what he must have thought.","user":"bkoganbing","rank":[139,169]},{"title":"Clear the decks giants are about to clash","rating":10,"date":"2 July 2004","review":"This movie is made by the performances. The material is very good, but at time its a bit melodramatic and obvious, which is the way the play is. Were it not for the collision of Spencer Tracy and Frederick March this would be just an excellent Hollywood film instead of the classic that it is.<br><br>I would be tempted to say that all you need is a basic knowledge of the plot and the ability to jump straight to the court room scenes, but that would be unfair. Watch the movie once  and then after that you can simply watch the fireworks.<br><br>What can I say about the battle between Tracy and March? Nothing. Words fail me. This is one of the great battles on screen in any film. It should be seen by anyone who wants to see how \"easy\" acting should appear. All the more important is the fact that this is a battle of ideas that still matter today as much as then. If only all of the world's problem could be debated this perfectly we'd live in a happier place.<br><br>See this movie.","user":"dbborroughs","rank":[55,64]}]