[{"title":"Interesting oddity","rating":5,"date":"5 April 2007","review":"This is an interesting and fun little horror movie from the early 80's that probably had a brief run in the drive-ins I would imagine. I won't break down by ridiculous \"categories\" such as \"suspense\" or \"gore\" which I personally find quite hilarious, but in sum, if you like grind-house films of the era, you might enjoy this. It seesaws between very dumb and quite entertaining with a few genuine scares (such as the opening sequence) and a little splash of suspense. It has that cheap, raw 70's feel that try as they might, horror movie makers just can't correctly emulate, and scenes of such utter nonsense that would never slip by editors these days; which is a good thing. Performances are pretty good. For instance, the updated Omen suffered severely by the less than convincing devil-child performance. However, the kids here are totally fine. This is a kooky little movie and I enjoyed every minute of it.","user":"mwold","rank":[17,18]},{"title":"Kids Slay The Darndest Things","rating":7,"date":"28 July 2005","review":"An absolute classic of 80's scare flix. This one isn't like any other as it pits pint-size, wild-eyed, psychotic youngsters with an urge to kill against all the grown-ups in town. Bud from JUST ONE OF THE GUYS (80's gold again) plays one of the killer-kids and he's paired up with one of the little girls Jake Blues tries to purchase in the BLUES BROTHERS. There is a third blond boy, but he keeps disappearing from the movie for whatever reason. The violence is hilarious at times and also surprisingly gruesome in spots. The demonic gang of smiling kids, though somehow possessed by extra-planetary means, bear little resemblance to the droid-ish Children of the Damned, who never thought to use pistols, crossbows and shovels to kill those pesky adults. Julie Brown (not Downtown Julie Brown-the other one) shows her rack, like three times, as she dances around in her bedroom. This movie is a rarity that I cannot believe I missed growing up in the 80's. This would have been my absolute favorite movie as a kid if I had seen it. Where is the sequel the ending begs for? This movie is just incredible. Seek it out at all costs.","user":"choppyno","rank":[22,24]},{"title":"Kids do the darndest things!","rating":7,"date":"21 October 2004","review":"I can't believe I rarely ever see this title mentioned by all you eighties horror freaks and I definitely won't be joining all my fellow reviewers here in saying that 'Bloody Birthday' is awful viewing. On the contrary, I enjoyed it very much and I was pleasantly surprised by the ingeniousness and surprise twists it offers. Don't just refer to this film as being 'another 80's slasher' because the victims here are rather unlikely and so are the killers. We're introduced to three cherubic-looking youngsters who were all born during a solar eclipse. At the moment they were delivered, planet Saturn was blocked by both the sun and the moon and, due to this, the kids are emotionless and seemly without conscience. This really starts to show around their tenth birthday as they go on a merciless killing spree.<br><br>Granted, this stuff is incredibility far-fetched and even slightly offensive but, seriously, who cares? Unlike many other horror films from this period, it at least attempts to bring something original and imaginative. For once, the kids' acting is good and the entire film has a creepy atmosphere and grizzly music. The murders sequences are grim and tense, and it's always eerie to see them getting committed by angel-faced kids. I don't know who hired the 3 kids but they did a good job. Especially the girl and the kid with glasses are highly memorable. The bleak images of the heartless trio remind you of classic highlights, such as 'Village of the Damned', 'The Bad Seed' and 'Children of the Damned'. This film is nowhere near as memorable as these milestones but great fun and not one horror lover will regret watching this. <br><br>Bloody Birthday was written and directed by Ed Hunt. Not particularly the greatest genius in cinema, but a pleasantly deranged fella who also brought us immensely entertaining cheesefests like 'The Brain' and 'Starship Invasions'. If all this isn't enough to convince you yet, Bloody Birthday has a lot of nudity. And not just any nudity, but a topless dance-act by MTV-VJ Julie Brown. Oh, and keep your eyes open for a completely redundant cameo by Joe Penny, later the star of TV-series 'Jake and the Fatman'. Check it out!!","user":"Coventry","rank":[31,36]}]