[{"title":"\"Up, Down, Flying Around, Looping The Loop And Defying The Ground\"","rating":7,"date":"10 October 2007","review":"I'm one of the biggest fans of old newsreels and I don't think there are too many of us who haven't seen some of that ancient footage with all those odd contraptions showing man's attempt to fly in the early 20th century. I guess it was only a matter of time before someone got the bright idea to do a comedy from those attempts.<br><br>Some of them weren't all that funny, people did in fact get killed, a lot of them in trying to master the air. But by 1910 there were all kinds of airplanes and even some early helicopters and a lot are shown in Those Magnificent Men. <br><br>The plot centers about an international race from London to Paris sponsored by one of the English press lords played in true John Bull style by Robert Morley. He's got a spirited suffragette daughter in Sarah Miles and a most proper member of the King's Coldstream Guards in James Fox courting her.<br><br>But along comes another flier, an American cowboy, Stuart Whitman who becomes Fox's air and romantic rival. But the film's got more than that. It's got Italian hopeful Alberto Sordi who can impregnate his wife with a dirty look. It's got Frenchman Jean Pierre-Cassel who keeps running into Irina Demick every place he goes. It's even got another English contestant in Terry-Thomas who's busy trying to sabotage everyone else.<br><br>However my favorite is the German entry, Gert Frobe. Poor Frobe has to pinch hit for the original German flier who partied too hardy. But as he tries to prove as long as you follow the instruction book, the German Army can accomplish anything. Seeing him try to fly his airplane while reading the instruction book is my favorite memory of Those Magnificent Men.<br><br>That and that incredibly catchy title song. I defy anyone to watch this film and not come away humming that tune for weeks. It will embed itself in your subconscious forever.<br><br>Those Magnificent Men is good entertainment and a gentle tribute to those early air pioneers.","user":"bkoganbing","rank":[36,38]},{"title":"What I like to call just a \"Fun Movie\".","rating":29,"date":"29 August 2004","review":"I think everyone has a few old movies stashed away in their brains that for some reason or another are a part of their lives. Our personal soundtrack if you will. This film is one of mine. I know I saw it at a drive-in when it came out but can't recall which one. My older brother still recalls this one fondly also. It was gut busting funny at the time but hasn't aged that well due to the general public's far more sophisticated mindset these days. But it's still funny. Anyone who is a fan of flying or the history of traditional European nationalistic rivalry will still howl at this clever and at times very sharp satire. We see some of the attitudes that would help fuel the violent world wars that would erupt soon after 1910. The vintage aircraft, some authentic, some not, are sure to excite aircraft fans. The footage of the genuine planes actually flying across the English countryside is genuinely MAGNIFICENT. Many running gags through the length of the movie. My favorite is the obvious one...the redhead. I caught this on our PBS station just last night and as always I was hooked again and had to watch till two in the morning. There's something about most English movies from the 60's that is just magical. Even the bad ones like \"Casino Royale\" are still fascinating to watch. Great international casts, clever scripts, funny situations, sight gags...whole packages. Fun Movies, plain and simple. \"Those Magnificent Men...\" isn't a great film or even a great comedy. But it's still a genuine Fun Movie and well worth at least a rental fee. Now that I've seen it again for the zillonth time my brother and I will be talking about it and laughing out butts off the next time I see him. For us it's one of those kind of movies.","user":"k_rkeplar","rank":[31,33]},{"title":"Slapstick on an airy level","rating":9,"date":"26 August 2002","review":"Few films there are ineed that I would be willing to pay a lot to have on DVD, but this certainly is!<br><br>In my book it rates with Tati's best, and he's tops! <br><br>The idea of making a film about aircraft was not new, I guess, but to do it such manner is still unique! Who would make a film<br><br>about an air-race between London and Paris, and do it as a comedy, with almost perfect dialogue, details and acting, but the British?<br><br>A number of vintage aircraft (circa 1909) were repaired/constructed<br><br>and flown for the flight sequencies, from the minuscle Demoiselle (the replica too small to have a male pilot!) via big, boxkite-like Cody's, inspired by Farmans to the Antoinette, which was 100% original!<br><br>As in any slapstick film there are villains (Terry Thomas, and Eric Sykes), pompous Germans, elegant Italians, flirting Frenchmen and the honest guy, of course!<br><br>Liking both British humour and aircraft, plus the good acting, the clever and exciting cinematography, and the excellent directing from Mr Annikin I can't but smile!<br><br>9/10, easily!","user":"tord-1","rank":[47,53]}]