[{"title":"Fit's Fine","rating":7,"date":"1 December 2007","review":"Keep Fit was produced at a time when Britain had a health problem. Unlike the obesity scares of today poor diet through poverty even malnutrition and rickets were commonplace amongst the working class. The government ran various campaigns throughout the '30's to promote good health and of course applauded the many Fitness Leagues in existence  for a lot of people all a bit futile if a loaf of bread was too expensive to buy. When conscription into the armed forces was re-introduced in peacetime 5 months before World War 2 it was partly with an eye to fattening as well as fitting up cannon fodder, as the government had been advised to by their mandarins as early as 1936.<br><br>Here we have weedy George wanting to impress the seemingly unattainable Kay Walsh and win her from the attention of the stout Guy Middleton. Two rival newspapers run a publicity campaign based on keeping fit, it's a perfect opportunity to prove who's the fitter: the gormless wimp or the powerful gymnast (or the alluring girlfriend for that matter)! A nice studio-bound atmosphere pervades for the most part, and we're back in the company of some familiar Formby faces and familiar plot. Songs were: Biceps, Muscle And Brawn (in the locker room, a favourite of mine), I Don't Like (by the Thames at Hurley with Walsh), Keep Fit (training in the boxing ring with Hal Gordon). Seven years later and Edmund Breon was well ensconced in Hollywood  I wonder if he ever thought of these days with Formby when he was playing next to Edward G. Robinson or Basil Rathbone? Middleton's moustache never looked more bristlier than in here. Favourite bits: giving Breon a close shave; the party for the department store employees, where the shifty Middleton shows his true colours; the nonsensical boxing match showing the power of love.<br><br>It's neither his puniest film nor his best by a long way, but still a pleasant ride over familiar ground.","user":"Spondonman","rank":[9,9]},{"title":"Getting into his stride","rating":5,"date":"2 September 2005","review":"George Formbys film career was starting to get into its stride with this film.The well worn formula for his Ealing films was now established.Gormless George wins the girls hand,beats the posh rival and sings a few songs.This film was written and directed by Anthony Kimmins who was a contract director with Ealing and who directed both George and Gracie Fields film careers during their respective times at the studio.The theme of the film is based on the fitness campaign promoted by the government in the 1930s.There were large displays put on.i believe there was one at Wembley Stadium at which the King and Queen were present.It was more Womens Institute style and not nearly as militarised as the equivalent Nazi fitness movement,which of course was rather more sinister.In conclusion if you like Formby you will like this film.If you do not then forget it.","user":"malcolmgsw","rank":[4,4]},{"title":"KEEP FIT (Anthony Kimmins, 1937) ***","rating":7,"date":"18 January 2014","review":"Just like British film critic Leslie Halliwell's sometimes odd choice of rosettes on his \"Filmgoers' Companion\" – singling titles from someone's filmography which he deemed to represent them at their best but which were often not their best or best-known work – the choice of films included among his favourites in the two apposite books he penned were likewise (and appropriately so) more personal. Therefore, instead of including the best-regarded George Formby vehicle LET GEORGE DO IT! (1940; to which he awarded ** in his \"Film Guide\"), we have instead this earlier one to which he only rated a * – although, to be fair, the star is italicized therein (meaning in top form), ditto the film itself in his filmography (meaning a significant one) in the \"Companion\"!<br><br>British comic Formby – the buck-toothed simpleton who strummed a ukelele – was very popular during WWII and is still fondly-remembered even by local people who lived during those times (in fact, I acquired a whole bunch of his films through one of them); for the rest of us, he is now decidedly a matter of taste. Having said that, I quite enjoyed this one and even laughed out loud at timesand the same applies to the couple of others I have watched beforehand. Following in the footsteps of Charlie Chaplin, Laurel &amp; Hardy and Harold Lloyd and anticipating Danny Kaye, Abbott &amp; Costello and Marin &amp; Lewis, Formby here dons boxing gloves as he is ironically chosen to illustrate the titular campaign initiated by a local newspaper to boost sales over its rival; the fact that the narrative also sees our hero try his hand at athletics and rowing, it would seem that two Buster Keaton vehicles BATTLING BUTLER (1926) and COLLEGE (1927) were the virtual template for this onedown to Formby being dubbed \"The Battling Barber\" after accidentally knocking down his virile macho colleague. Par for the course, the latter (curiously played by the flabby and relatively unattractive Guy Middleton) also happens to be Formby's rival for the attentions of their firm's manicurist (Kay Walsh).<br><br>There would be little point in narrating comedy sequences when these should be seen to be properly enjoyed; suffice it to say that there is the standard array of misunderstandings, impersonations (provided by Formby's equally gormless stage-struck chum George Benson) and crooks expected in such a scenario and milieu. I would rather address the subject of Formby's ditties which, while invariably catchy and popular (they were even sold as singles!), provide some unwarranted embarrassment nowadays when we are supposed to believe that they make the initially snobbish Kay Walsh sway and jive to their rhythm!","user":"Bunuel1976","rank":[1,1]}]