[{"title":"Not to be missed!","rating":16,"date":"16 August 2002","review":"One of my favorites by Fritz Lang, \"While the City Sleeps\" is also one of the neglected masterworks of 1950s American cinema, a decade as you may know full of insight and social criticism (e.g. \"Ace in the Hole\", \"Bigger Than Life\", \"Phenix City Story\", etc.)  It was Lang's penultimate American film and one of his personal favorites. <br><br>The film, a dazzling allegory on media manipulation and modernity may not work on single viewing and perhaps that's why it's so underrated, despite a superb cast: Dana Andrews, George Sanders, Ida Lupino, Vincent Price, Mae Marsh, Rhonda Fleming and John Drew Barrymore(the son of the great John Barrymore). <br><br>In discussing the picture, Lang often compared it to his German masterpiece, \"M\"(1931) and the comparison is not inapt. In \"M\", Peter Lorre's Hans Beckert terrorizes the whole city and creates a paranoia among its citizens. In \"While the City Sleeps\", Manners's crimes mainly function as a gimmick for the press to sell papers while the normal life in the city seems to continue. Rather than simply conveying the necessary information in \"M\", the media here in \"While the City Sleeps\" (consisting of an interplay between television and newspaper) is much more ironic and cynical: they use Manners and his victims to terrify the public to sell more papers, something that is equally true today as it was back in 1956.   <br><br>Not to be missed.","user":"Kalaman","rank":[52,67]},{"title":"Lang's cynical critique of American values","rating":7,"date":"1 October 2007","review":"Between 1936 and 1956, during his tenure in America, the German director Fritz Lang made some of the most psychologically astute movies ever to come out of the studio system, often working with the flimsiest of material; pulpish fiction indeed. Most of these films were thrillers, though perhaps only in the most nebulous sense of the term, dealing instead with the psychosis of the killer or, as here, with the iniquitous motives of those on the periphery of the case. 'Plot', in the strictest sense of the term, never really interested Lang, 'the story' as such being secondary to the observational detail and the characterizations. In \"While the City Sleeps\" the serial killer whom we expect to be at the centre is side-lined to such an extent that catching him is never the focus of attention. He's the 'McGuffin', if you like, for an entirely different movie, one in which the thriller element is dispatched in favour of a study of greed and the relationships, not always savory, between men and women.<br><br>The film is set in the world of newspapers and news agencies, so you expect an aura of venality from the outset. Vincent Price is the vain, self-centered scion of a recently deceased magnate who has taken over his father's business and wants someone else to do all the work. So he creates a new executive position then sets three of his top men against each other vying for the job. The one who 'catches' or names the serial killer terrorizing women in New York, gets it.<br><br>Like many of Lang's films, \"While the City Sleeps\" had the tawdry feel of a B-movie. There is a kind of rough urgency to it that a more main-streamed movie might have lacked. (You could say Lang's genius was for making silk purses out of sow's ears). He didn't work with 'stars' but character players. About the biggest name in the movie and the 'star' of the picture is Dana Andrews, (superb, he was a very under-rated actor), as the Pulitzer Prize winning journalist who, like many of Lang's characters, is less noble than he first appears. As for the rest, despite there being two Oscar winners in the cast, (George Sanders, one of his poorer performances, and Thomas Mitchell, excellent), they were mainly the stable diet of the B-movie, though that said there is a terrific performance from the under-rated Sally Forrest as Andrews' girl who he is not above using as bait to catch the killer and a typically flamboyant one from Ida Lupino.<br><br>After this, Lang was to make only one more film in America before returning to his native Germany, the equally cynical \"Beyond a Reasonable Doubt\". Indeed it's Lang's cynicism and his critique of American values and mores that set him apart, that put him, like those other European émigrés, Otto Preminger and Douglas Sirk at a critical remove from his American counterparts. In this respect, perhaps, the only American who can be compared to him is Samuel Fuller.","user":"MOscarbradley","rank":[32,40]},{"title":"sometimes interesting, sometimes kind of dumb","rating":5,"date":"8 July 2005","review":"While the City Sleeps has an interesting premise. A newspaper is taken over by a rather dissolute millionaire who sets three executives scrambling for a big promotion. They all have different angles to get the job, but the main focus is on the attempt to show off their skills by getting the best news on a wanted serial killer.<br><br>This is a promising setup for a hard-edged examination of the cynicism of the newspaper industry, but it lacks that hard, cynical edge. The movie doesn't seem to be all that appalled by the actions of its executives nor does one get a real sense of hard men doing anything to get ahead. In other words, this is no Sweet Smell of Success.<br><br>The movie also has some pretty dumb plot elements, most notably reporter Andrews absurd plan to catch the killer. Admittedly this is pretty typical of movies of the kind, but that doesn't make it any less stupid. The dialogue is artificial and often a little ridiculous.<br><br>On the plus side, the movie has an entertaining adult sensibility. Even though the Hayes code means little is said explicitly, there is a remarkable amount of implied sex in this movie, and the sleaziness of most of its characters is the most interesting aspect of the film. But overall, this is just sort of watchable.","user":"cherold","rank":[61,86]}]