[{"title":"Give Bruno Mattei props, this movie rules!!","rating":10,"date":"3 February 2002","review":"I am a huge gore-fan. And my favorite director is Lucio Fulci. I have seen gore from Fulci to Argento to Raimi to Itenbach to Schnaas to Romero to Lenzi to etc... But for some reason alot of people hate movies with the name \"Bruno Mattei\" on it. Hell of the Living Dead has been put down and made fun of by so many. Why? I saw \"Night of the Zombies\" years ago on VHS and was hooked. The movie, written by Claudio Fragasso [Zombie 3, Rats, Beyond Darkness, AfterDeath, etc..] is a complete rip off of Dawn of the Dead, with Goblin Music [taken from Dawn of the Dead &amp; Luigi Cozzi's Toxic Spawn], a swat team, etc. So its a rip off, Who cares. The movie is awesome. Where else are you going to see a swat member dress up in drag, only to be eaten by zombies. The characters are hilarious! My favorite member is the swat member with long brown hair [\"Guess I'm not on the menu after all!\"]. The dubbing is so bad it rules! The acting is hilarious and fun. The story is basically the same \"Government project gone wrong\" story. FX are cheesy, yet fun to watch. This title is pure cheese, but great cheese!Thank god Anchor Bay decided to pick up some Bruno Mattei flicks and re-release them on DVD. This and Bruno Mattei's \"Rats: Nights of Terror\" are now out, and they are definate \"Must Have\" titles. If you want a serious zombie flick, look elsewhere. But Hell of the Living Dead rules! Now, if Anchor Bay can pick up the Lucio Fulci/Bruno Mattei \"Zombie 3\" rights and put it on DVD!!","user":"crimsonmaskvideo","rank":[25,28]},{"title":"A trashy horror gore classic","rating":9,"date":"6 September 2006","review":"I'm getting rather sick of seeing uncomplimentary reviews of this truly classic gorefest. Yes it does contain poor acting, yes it is a cheap rip off of some of the genres other classic titles, yes it does contain stock footage, yes it is low budget, yes it does contain moments of pointlessness and yes it is pure cheese! I'm unsure what some of the unhappy viewers were expecting when they got this film as it is obviously primarily a zombie film that is fast paced with absolutely loads of blood guts and gore practically all the way through the film. If you want an in depth meaningful life affirming film then look elsewhere. If however you want a highly entertaining fast paced ultra bloody zombie gore film that doesn't let up its relentless assault on the senses until the final reel then wait no longer.","user":"paul-ramsell","rank":[42,50]},{"title":"Not sure if this movie should receive one out of ten or ten for sheer entertainment","rating":10,"date":"21 December 2004","review":"Woah! I didn't realise this movie had so many different titles, i guess the producers have made very sure to cover their tracks with this one. I know that, i, for one would not like people to know i was involved in the making and distribution of this umm...comedy?<br><br>I know, i know, maybe i shouldn't be so harsh, it is a zombie movie after all....NO ! NO this is without equal, THE MOST STUPID MOVIE EVER MADE. I remember being a young petulant youth, obsessed with all things zombie, back in the days of the \"video nasty\" and being lucky enough to come across what was titled Zombi Creeping Flesh. I laughed at so many scenes in this movie, i thought i may implode! You know that kinda laughter? The one that stops you breathing, the one that hurts? Yea, thats the one...Oh, OK, maybe not, but hell this will remain in my heart forever more. Still not sure if this was ever actually a serious attempt at a horror story, or a campy fun filled tongue in cheek gore fest, like Redneck Zombies, Which by the way, is actually an awesome movie, deliberately poking fun at itself as well as being extremely gory. Dawn of the Dead, circa 1978 this ain't... I know dubbing can never recreate the original impact of the scripted Italian dialogue, but this movie has lines of absurd proportions falling out of every pore. I mean like, LAUGH OUT LOUD lines of complete inanity! Some of the situations the characters get themselves into makes you wonder if the writers found out the cast beforehand and must have been harbouring some kind of grudge to have put the actors through this. There is a complete disregard for any kind of continuity or story, for that matter... I also think that there is probably more stock footage of SLOW MOTION ANIMALS SEEN THROUGH BINOCULARS than there is actual shot footage by the crew. A Fantastic scene involving the acceptance of the local villagers for the SWAT team ranks high in the many gems within. Slow motion desert dwelling animals in the very depths of the rain forest is an indication that Mattei had long since given up. The gore is aplenty, as long as you see the fully uncut version with a blatant DOTD embassy storming ( substituting tenement blocks for government offices ). There is a lot of gore, mainly ranging from the above average to the downright silly. Soundtrack is Goblin, so therefore fantastic by default. Though several pieces lifted from DOTD...not necessarily a bad thing. Watch this movie with the view that it is going to be BAD, VERY BAD, and i think you will enjoy it. It is THE best of the the worst, in the wide range of poor 70s/80s zombie movies just because of the sheer downright laziness involved. There are plenty more stinkers out there, but this just pips them all.","user":"KrankorVsPrinceOfSpace","rank":[23,26]}]