[{"title":"Ignore the propaganda and appreciate the people","rating":8,"date":"29 November 2006","review":"Vertov eulogizes Lenin with an idealized view of Soviet progress. There are, indeed, three songs, or three musical movements. The first presents a woman's view of Lenin's legacy, beginning with the movement away from various forms of repression, the joy of women working, the new equality in field and factory. The second records the Soviet mourning for their leader. The third showcases progress, with the refrain if only Lenin could see his country now. With the exception of three or four spoken passages, this is built like a silent film to which a programmatic soundtrack has been added. There are actual songs, with titles furnishing the words, and sections of great music by Russian classical composers, and some music probably written for the film. The continuity comes through the songs and through several thematic sequences of imagesthere is no plot. The images are fascinating, showing the best side of Soviet culture, the variety of ethnicities, the joy of having enough to eat, the sense of sharing in a wonderful experiment, the determination to succeed, the unselfishness of many individuals, the idealism of the collective. There are thousands of shots of people, agriculture, industry, public works, parades, happy people, hardworking people, landscapes, and every sort of window into a vanished world. Of course it's propaganda. Of course there are essential elements of Soviet history omitted. Of course the very first sequences present the unveiling of Muslim women as a great stride toward liberty. Let the political scientists and historians investigate the significance of what is left out and what is presented in this partial view of life in the 1930s. But remember it was only sixteen years after the October revolution, and the progress the movie highlights did occur. Still, we don't have to accept the propagandistic aspect of the film. Neither do we have to reject the film out of hand because we think Communism is stupid, nor does it benefit anybody to heap ridicule upon it. Three Songs is a (partly) great movie because it shows irreplaceable real images of real people and of vanished technology and vanished historical places. Some of the photography is amazing, and the editing, timed rhythmically to match the music, is unusually good. Even the way the propagandistic themes are built is worth examiningwe're all pretty much safe from its baleful influence these days.","user":"netwallah","rank":[17,23]},{"title":"Good Imagery & Photography, Otherwise Rather Disappointing","rating":11,"date":"11 October 2004","review":"Despite the good imagery and photography, this Dziga Vertov feature, though often interesting, is in general rather a disappointment.<br><br>There are many fine features from the Soviet cinema of the 1920s and 1930s, in which the skill of film-makers like Eisenstein, Dovzhenko, Vertov himself, and others far outweighs any small doses of politically-mandated content. It is unfortunate that some very elegant films of that era are often described as propaganda pieces, when they actually have far too much depth for that label to be appropriate. All this is simply to say how unfortunate it is to have to point out that, indeed, \"Three Songs of Lenin\" might have been much, much better without the heavy-handed propaganda statements with which it is laced.<br><br>There's no reason in itself why a film praising Lenin could not still work as cinema, and indeed at least two of the three \"songs\" contain some worthwhile ideas. But the title cards and some of the dialogue simply go way too far in trying to build up Lenin's legacy, and it is not long before it gets to be too much. The lavish praises that the movie heaps upon him would be ridiculous even if they were being applied to Washington, Churchill, de Gaulle or any other world leader. No one leader deserves anything approaching that much credit for his country's successes, and no human leader or ruler deserves such unstinting and unqualified praise.<br><br>Vertov was a skilled and creative film-maker, as he proved in pictures such as \"Man With a Movie Camera\". And even here, there is plenty of good photography and other material to work with. A more restrained approach would have resulted in a much better film. It's still of interest to those interested in the era, and it does have some definite strengths; it's just not nearly as good as you could have hoped for it to be.","user":"Snow Leopard","rank":[13,18]},{"title":"The last movie Vertov was allowed to make","rating":10,"date":"11 December 2018","review":"Lenin has lived, is living, will live: a film poster summarizing it very well. The atheist society of Stalin needed its own mythology, just as throughout the whole history any other society had to build its own mythology (a fiction is always essential in the struggle for survival; if Darwin hadn't told it from the very beginning, it was said anyway by lots of Darwinians). Ultimately any mythology supposes the existence of an eternal god. Of course, in the Soviet mythology the eternal god was Lenin. As he had died in 1924, the problem of his immortality had to be solved.\nIn this movie the god Lenin lives forever in the Soviet society: in the whole society, and in any particle of it. Any Soviet citizen, and any Soviet accomplishment, carries the personality of Lenin. With this movie Vertov gives up his atheism, to become a pantheist: he deifies the Soviet society because it embodies the eternity of Lenin, and he deifies Lenin because his eternity is embodied in the Soviet society. Is it pantheism or rather panentheism? I'd leave for you to decide. Anyway it is the demonstration of a perfect totalitarian system: one cannot have free will as everyone embodies Lenin, thus carrying the will of Lenin.\nWell, for the regime officials this movie had two impardonable flaws. Firstly it was an Avangardist movie, it means some kind of bourgeois leisure. In 1934 the Soviet norm was already the Socialist Realism. And more than that it was the second flaw. The Soviet mythology was actually built upon two gods: one dead (Lenin) and one alive and in full control of the power (Stalin). And the dead god should have had only one role: to justify the almighty alive god. This movie said too much about the dead god, and almost nothing about the alive god. No wonder that Vertov would not be let to make another movie any more. He would not understand why, as he was too honest, too sincere, to understand the ways of life.\nApart from that, this is a superb movie, just because it is so consistently Avangardist (I would even say so Productionist - the whole Soviet construction living through one hero, Lenin), and so sincere.","user":"p_radulescu","rank":[3,4]}]