[{"title":"A bizarre yet brilliant tragedy","rating":10,"date":"5 December 1999","review":"Osamu Tezuka's vision of Cleopatra might be one of the most under-rated movies in the history of Japanese animation. Maybe it's because the movie is very old or maybe because it was promoted as a sex-cartoon outside of Japan. But people are missing a really wonderful gem here.<br><br>In one scene there is nothing-is-holy slapstick, nonsense and experimental FX and the next one is dead serious again. But it might be this very bizarre mixture of humor and drama that make this movie so emotional and unforgettable.<br><br>On the technical side the movie is very well done. The animation are fluid and even though they can't compare with later productions they are very good for their time. The musical score doesn't have a wide variety of styles but it always suits the scene and the wonderful main theme certainly ensures that tears will be shed at the end.<br><br>I can't highly enough recommend this movie even if it might not be everybody's cup of tea.","user":"Dennis Hirschmann","rank":[27,32]},{"title":"History rewritten","rating":5,"date":"17 August 2016","review":"Or redrawn would be more accurate. Don't be fooled if this is an erotic tale (Germany even cut some things out of it, though strangely enough it was more story related than anything else), because while it does contain nudity, there is no explicit intercourse here. Actually it does deal with it in a very original and mostly funny way.<br><br>Funny of course only, if you buy into the humor and all the craziness surrounding the movie. The animation may seem a bit dated (obviously), so while some may argue it was pretty good for the time it was made, some others will argue that doesn't help or make it better. You have to decide to which crowd you belong. Overall this won't be everybody's cup of tea for more than a couple of reasons. Watch the trailer, if it speaks to you (not literally ;o) ), than maybe give it a try","user":"kosmasp","rank":[5,9]},{"title":"A truly gem of feature animation","rating":9,"date":"30 January 2010","review":"Certainly has some superfluous things in this fabulous feature Japanese animation. The futuristic framework inside the narrative about Cleopatra goes on for example. The same could be said about the characters of the secondary plot, Lybia and her lover. Alas, in fact one is mainly support for the other – if those characters doesn't exist at all, there isn't need to secondary plot. Nothing this, nor the quality just reasonable of the animation properly, nothing much different of trivial TV product, take off the bright of this beautiful film. Probably influenced by the libertarian atmosphere of the time were produced, it use in the proper manner its idiosyncrasies, provoking a stunning effect, promoted mostly by its occasional appearance. The mainly example of this is the festival in tribute to Caesar, all made by references of art history. Or its intense, but usually not vulgar, sexuality. Like in the moment almost abstract that Caesar makes love with Cleopatra and we just see two mainly lines waving in an empty frame. Its eroticism, could even be accused of misogynistic, mainly in the humorous grotesque figure of Lupa, the pet Leopard of Cleopatra, but the women are far to be only victims. At some point they just manipulate the fool men through the only value they usually consider in them: sex. Once more that is far to be the rule. Marcus Antonius is completely obsessed by Cleopatra and treats her in the more dignified way. Through all the film we receive creativity in the right doses in terms of narrative too. Although our heroes came from space, just in a unique moment, a modern object is put in foreground – the revolver that saves the life of the brave gladiator against a human-monster ten times more strong than him. In some moments what is stunning is the own situation, like the bold scene when Cleopatra finds Caesar with his own naked mother in the bed. One of the best effects that this bizarre (in a good sense) movie provokes is that it doesn't make any use of the common clichés of the time, like psychedelic images, to emulate its libertarian creativity. It is even more powerful and bizarre in its trivial animation style. Unfurtenately, its creative approach to sex was intentionally or not misunderstood when its abroad release, gaining the stupid title of \"Cleopatra, Queen of Sex\"","user":"nickmovie-1","rank":[7,15]}]