[{"title":"Misrepresented As \"X\" Rated, Really Satire Of Film Making","rating":15,"date":"15 March 2002","review":"Although touted as an \"X\" rated British sex comedy from the early 1970's this film is really a satire of adult film making. Obviously, given the subject matter, there is nudity but it is tame by contemporary standards. The presence of many mainstream British comedy actors correctly implies that this is largely a comedy.<br><br>A trio of would be film makers try to launch a production. Would be director Dennis Morrison (Michael Armstrong, who also wrote the film), would be producer Clive Potter (Terence Edmond) and would be screenwriter Harris Tweedle (Christoper Timothy) team up with low rent producer Benny U. Murdoch (Roy Kinnear). Murdoch hopes to make the movie, based on the naughty poem Eskimo Nell, with his favorite star Gladys Armitage (Diane Langton), she of the really big breasts, but first must raise the money. He has three interested parties who are each willing to put up a third of the money. Big Dick (Gordon Tanner) is a loud American producer who wants a \"hard core\" version, featuring a laundry list of perversions, and starring his \"friend\" Billie Harris (Beth Porter). Financier Ambrose Cream (Richard Caldicot) wants a kung fu musical version starring his \"friend\" Millicent Bindle (Prudence Drage). Similarly financier Vernon Peabody (Jeremy Hawke) wants a gay western version starring his \"friend\" Johnny (Raynor Burton). Its up to the trio, principally writer Tweedle, to come up with the three scripts required to raise the money. Unfortunately Benny U. Murdoch is not to be trusted with money. The trio, already on the hook to deliver three films, have to get money for a fourth version from Lady Longhorn (Rosalind Knight). She, the leader of a moral reform group, wants to produce a morally uplifting family film starring her children Hermione (Katy Manning) and Jeremy (Christopher Biggins). We then proceed to make four completely different versions on one budget! Lady Longhorn, proud of her version, arranges a Royal Performance. Obviously, with four distinctly different versions, one can foresee the misunderstandings arising from getting the correct print to the premiere.<br><br>Roy Kinnear is somewhat \"over the top\" in the best sense of the phrase. Michael Armstrong comes off best in his scenes showing the actual filming of the versions. In the early scenes Christopher Timothy presented as a virgin (in the sexual sense) \"bird\" lover (in the penquin sense) but there is no payoff. Gordon Tanner is constantly aggravated by his mindless \"friend\" Beth Porter. Rosalind Knight is fine, albeit in a typecast role, but her son Christopher Biggins is memorable. The balance of the performers are generally adequate.<br><br>The enjoyment of this film is likely to depend, in part, on your film knowledge. Anyone who has responded to the advertisements of the film's \"X\" rating will be disappointed by the tame topless displays. On the other hand anyone who is up on the \"urban legends\" of movie business will recognize many elements. The seedy producer (Benny U. Murdoch is a B.U.M.) trying to raise money from multiple backers (i.e. Mel Brook's The Producers). The writing of multiple versions of the scripts to turn one story into four films. The numerous \"friends\" of the potential backers. The performances (i.e. Beth Porter stealing her character from Jean Hagen in Singin' In The Rain) and take offs on actual characters (Gordon Tanner is a great Darryl Zanuck/Jack Warner, \"Will you shut up and let me yell in peace!\"). They even satirize the conventions of the \"caper\" movie in trying to get the right version of Eskimo Nell for the Royal Performance.<br><br>I probably rated the movie higher than the average man on the street because I recognized and appreciated elements such as these. I believe that the film is an acceptable \"time waster\" for any viewer but will be more fully appreciated by film buffs.","user":"sep1051","rank":[19,23]},{"title":"Intriguing Self-Spoof","rating":7,"date":"16 October 1998","review":"The British sex comedies of the 1970s are notorious for failing to be either funny or erotic.  For the latter one might blame the censors, but the former is simply a result of innuendo being no longer funny once you pass the nudge-nudge stage.  Anyway, this one isn't sexy either, but it does work quite well as a comedy.<br><br>In fact, Eskimo Nell is a strange kind of self-spoof, not only spoofing the sex film genre as such but even its own making - the kind of self-reference Douglas Hofstadter would appreciate.  Viewers may be inclined to think that the \"self-spoof\" is faked, but there are persistent rumours that many of the scenes which seem outrageous and surreal (e.g. the script discussion) were very closely based on fact.","user":"SMK-4","rank":[8,11]},{"title":"A British sex comedy that is actually FUNNY","rating":23,"date":"23 November 2008","review":"This is a very rare creature indeed--a British sex comedy that is actually funny! This movie, probably inspired by Mel Brook's original version of \"The Producers\" is about three young men--an aspiring director (played by \"Mark of the Devil\" director Michael Armstrong), his virginal penguin-obsessed screenwriter, and the screenwriter's lothario flat-mate--who are all trying to break into the British film industry. They meet a sleazy producer (Roy Kinnear) who wants to make a film version of the famous bawdy poem \"Eskimo Nell\". To raise the money though he gets them to sell three very different versions of the movie to three different backers: a foul-mouthed American (\"Big Dick\")who wants to make a hardcore porn movie, another guy who wants to make a \"kung-fu musical\" to showcase the two \"talents\" of his girlfriend, and an arty dilettante who wants to make a gay Western (\"with a lot of bottom smacking\") featuring his transvestite boyfriend. <br><br>It gets worse when the producer runs off with the money, and the director has to find a fourth backer (simply to avoid the lawsuits), and goes to his society girlfriend's mother (no doubt modeled on puritanical British busybody Mary Whitehead)who runs a \"decency\" society and wants to make a clean family film! Needless to say, the whole thing goes horribly, horribly awry. Reels from the different versions get mixed up, a guy's willie gets caught in a clapboard, and one character delivers the immortal line: \"What's my motivation for having an erection?\" The movie is quite funny both in its conception and in its execution. It doesn't slather on the naked dolly birds quite as much as a lot of other British sex comedies of the era perhaps, but an almost unrecognizable Mary Millington does show for a 10-second \"Benny Hill\"-style speeded-up striptease.<br><br>As far as the sex goes, this probably won't inspire all the hairy-palmed Michaelangelos out there to turn their ceilings into a scummy Sistine Chapel, but it is definitely FUNNY and pretty entertaining, which is a lot more than can be said of the vast majority of these films.","user":"lazarillo","rank":[7,10]}]