[{"title":"One of Roger Moore's Best Bond movies he ever did my all time favorite","rating":10,"date":"11 November 2017","review":"What can I say about this film that was said already? I love this film to death! It is definitely the best Roger Moore's James Bond 007 film since The Spy Who Loved Me! It is my second favorite Roger Moore film I love it to death since I was a kid. For Your Eyes Only (1981) is better then the lackluster The Man With The Golden Gun, Octopussy and A View To A Kill in my honest opinion it is better then Moonraker. This is the first Bond of the 80's and it is honestly one of the best Bond films in my opinion this is just my opinion. <br><br>This movie is simply action with real stunts more darker then the last one, more serious. Roger Moore did one of his best performance as James Bond 007. Really good actors and really good actresses. It is my childhood. A classic James Bond adventure there is. All right, maybe it was not that simple. Surprisingly this works very well, with the action sequences being more realistic (what with a car chase, ski chase and a small scale assault on the villain's residence instead), but brilliant too. For Roger Moore the film offers his best performance as James Bond. <br><br>The climbing on (The Monastery of the Holy Trinity in Meteora) St Cyril's monastery in the northern mountains of Greece is a great realistic sequence. Bond (Roger Moore) climbs the cliff in the mountains to reach the hoist controlling the basket. Those were real stunts it was really dangerous for Moore and his stuntman doing those stunts. In 1993 we got Cliffhanger with Sylvester Stallone climbing the mountains even those stunts were dangerous. This stunts that Roger Moore performed were really dangerous. <br><br>Bond in the beginning climbs on the helicopter another dangerous stunt that was performed from Roger Moore and his stuntman. James Bond on skies on the cross-country skiing and he is perused by motorcycle assassins great stunts performed from stuntman's. Great car chase A Citroën 2CV was used in which Bond and Melina are fleeing and are kicked by this car really bad-ass scene. Great fights on the ship, great fights with car on the beach in which Bond shoot's a guy's car. Great under water scenes in which Bond and Melina are under attack by a diver in a JIM suit. Great effects for the mini-subs under water. Bond and Melina are tied up with the line on Kristatos' yacht been as bait for sharks. <br><br>Great actors like are: Roger Moore, Carole Bouquet, Julian Glover, Topol ,Lynn-Holly Johnson, Michael Gothard, Jill Bennett, John Wyman and Walter Gotell. <br><br>Melina Havelock (Carole Bouquet) is a perfect Bond heroine determined to avenge her parents at all costs. Melina Havelock is a combination of Tilly Masterson from 'Goldfinger' and Domino from 'Thunderball.' Melina comes upon a much bigger plot, involving 007 and a Russian-British race to regain the A.T.A.C. She was really great Bond girl I enjoy the girl so much and the actress she was awesome better then Britt Ekland. Carole Bouquet did a great performance and she did a great job playing Melina Havelock she was so realistic in screen just my opinion. This movie had the absolute most beautiful Bond girl .<br><br>Bibi Dahl (Lynn-Holly Johnson) really touched my heart who would do anything for Bond! She is the American figure-skating prodigy who meets 007 in Cortina D'Ampezzo. Lynn-Holly Johnson did a great job been a victim of her uncle Kristatos (Julian Glover).<br><br>Agent 007 is assigned to hunt for a lost British encryption device and prevent it from falling into enemy hands. Bond investigate the murder of Timothy Havelock, who was working to salvage the wreckage of a spy boat carrying a vital command system called A.T.A.C. Bond's investigation leads him to believe that the Russians are also trying to recover the system, and may be using Aris Kristatos (Julian Glover) to carry out their dirty work. Aiding Bond is the beautiful sharpshooter Melina Havelock (Carole Bouquet) and an old acquaintance of Kristatos's named Milos Columbo (Topol).<br><br>I really miss movies like this one today I really do, I miss them so much. They don't make movies like this one today they don't. The plot was about the hunt for a lost British encryption device called A.T.A.C. that was also used later in Under Siege 2: Dark Territory (1995).<br><br>I really did enjoy soundtrack For Your Eyes Only by Sheena Easton and the music theme by Bill Conti. <br><br>The movie is really fast paced, I really wasn't bored with it, it is highly entertaining. You see also the cemetery in which we see Bond on his wife's grave Tracy Di Vicenzo from On Her Majesty's Secret Service we see Blofeld and Bond finally kill's him on the end of the opening scene. <br><br>For Your Eyes Only is a 1981 British spy film and the twelfth in the James Bond series to be produced by Eon Productions, and the fifth to star Roger Moore as the fictional MI6 agent James Bond. <br><br>10/10 This in my opinion really my favorite Roger Moore James Bond 007 films I love it to death I think is my second favorite film The Spy Who Loved Me is my number 1 favorite film but this one will be the second one. This was the first movie John Glen directed and really did a good job on this film. I highly recommend for every Bond Fan.","user":"ivo-cobra8","rank":[101,113]},{"title":"Moore's finest Bond.","rating":22,"date":"22 September 2001","review":"'For Your Eyes Only' starts the tenure of John Glen at the helm of the Bond series. He had worked previously on many of the Bond movies but during the eighties he directed all 5 Bond movies, and with the exception of 'A View To A Kill', they are up there with the best of the whole series. Certainly 'For Your Eyes Only' and the follow up, 'Octopussy' are the best of the Moore years, and I don't think it would be overstating it to say that Glen may have single handedly saved the franchise.<br><br>By the end of the 1970s Bond had turned from Ian Fleming's masterspy  into an entirely comic book creation, culminating in the preposterous shenanigans of 'Moonraker' in 1979. At the start of a new decade a new style is clearly apparent, with a back to basics story that actually involves some spying, and a genuine threat to world peace. It's pushing it to say that the story is believable, but it is realistically told and is certainly a more adult affair than the previous efforts.<br><br>The film starts with the final nail in the coffin for Blofeld. After years of legal wrangling over who had the rights to the character the filmmakers decided to show that they didn't need him anyway and unceremoniously dumped him once and for all. We are also immediately put in the mood for a far more serious Bond when he visits his late wife's grave, an unusual moment, not least because the movies rarely referenced previous actors in the role. Here we are reminded that Moore wasn't playing Bond at the time of his marriage. That serious tone pervades throughout the movie, with less wisecracking than usual, and a subdued villain, at odds with the expected megalomaniac we are used to. But the film is all the better for it. There are some fantastic action set-pieces including a chase in a Citroen 2CV, and a ski chase that tops even that of 'On Her Majesty's Secret Service', along with a tense finale that is literally a cliffhanger. Bond is actually forced to use his wits, and much of the action and escapes are less contrived than one would expect. It's also good to see (after 'The Spy Who Loved Me' and 'Moonraker') that the filmmakers have tried to get back to Fleming's Bond, with many ideas lifted from the original stories. The scene with Bond and Melina dragged behind the speedboat, for example, is taken directly from the novel of 'Live And Let Die', and many characters appear in Fleming's short story of the same name.<br><br>Add to the mix a fine cast, notably Carole Bouquet as another strong character in the list of 'Bond women', and you have a satisfying and thrilling entry in the series.","user":"sibisi73","rank":[64,80]},{"title":"Favorite Bond film","rating":10,"date":"8 September 2017","review":"FYEO is by far my favorite Bond film. From the beautiful theme song, to the gorgeous scenery, the wonderful musical score, and the fabulous story line, this movie is absolute perfection. I can watch it over and over and never get tired of it. I just absolutely love this film ! The cast is phenomenal. Carole Bouquet is wonderful as Melina Havelock. Topol is marvelous as Milos, Julian Glover is wickedly good as Kristatos, and Cassandra Harris (Pierce Brosnan's late wife), is charming as Countess Lisl. All of the actors in the film are top notch, and the beautiful scenery of Italy and Greece, is just breathtaking. Roger is of course, fabulous as usual in his role as 007. Handsome, charming, and witty. He is and always will be, my favorite Bond. FYEO is just spectacular. It is the Bond film that I watch the most often. It is one of my favorite movies of all time.","user":"momma-28991","rank":[10,11]}]