[{"title":"Words just can't fully describe this film","rating":10,"date":"26 October 2002","review":"Yang Chuan is the man who directed this film, SEEDING OF A GHOST (1983) for the legendary Hong Kong Shaw Brothers, who produced many martial art classics and many \"explicit horrors\" which are so rare not many know anything about them. SEEDING is among the most insane films I've seen and this hyper rare film surpassed most likely every expections I had, and those were very high. I knew Hong Kong film makers can create things which simply cannot be found from elsewhere, and in the horror genre, they are as unique as in action and fantasy, too.<br><br>SEEDING tells the story of a cab driver (Philip Ko), whose wife has a lover whom with she spends a lot of time. One night the wife, Irene, is attacked in the street and raped and killed by some hooligans. The taxi driver husband finds her and sadly becomes number one suspect for the murder. At the very beginning and during the credits of the film, the taxi driver met a strange fellow who said he knows about and practises black magic and other \"voodoo related stuff.\" He said to the cab driver that things may not go very well for him from now on because they have met.. Now, after the murder of his wife, the taxi driver remembers this guy and tracks him down. He finds the ominous looking man, and wants to revenge the murder of his wife. The black magic warlock agrees and he creates a horrific curse on all those who were involved in the murder. What follows is a series of over-the-top gory and insane mayhem filled with black magic, devils, tentacle monsters, worms and other things one would expect finding from Hell itself.<br><br>This film is the final nail to the coffin of the fact that the Hong Kong film makers really know how to create dark horror films, which this kind of films are called among the cult cinema specialists. Other similar \"dark horrors\" are (I haven't managed to track these down yet) RAPE AFTER, BLACK MAGIC and BLACK MAGIC 2 aka REVENGE OF THE ZOMBIES. Many of these are produced by the Shaw Brothers and directed by man named Ho Men-Hua, and as far as I know, only RAPE AFTER isn't by Shaw and Ho, unlike many source books seem to say. I've heard this from one very reliable Asian cinema specialist who I believe of course in these difficult questions about these more-than-rare Asian films and oddities.<br><br>SEEDING OF A GHOST is dark with the capital D. There is smoke and shadows everywhere and only the beginning of the film has some genuine day light which seems peaceful and safe. But once the curse starts to affect, there's no hope for light or safety no more to the characters than the viewer! The effects are perhaps the most important elements here as they are so imaginative and detailed to the maximum effect. The monsters and creatures from the other side are as effective as in John Carpenter's The Thing (1982) for example, and the budget for SEEDING wasn't too big I think, so they are all created by great imagination and talent to spend the limited budget.<br><br>The gore filled and monster inhabited mayhem on screen is incredible. There is a \"devil fetus\" who explodes through the hapless mother who starts to feel pain in her belly. What comes from her stomach is equally horrific as in David Cronenberg's masterpiece The Fly (1986), and it's very close to the tentacle monster in Carpenter's The Thing, too. Especially SEEDING's finale, during which this devil fetus is born, too, is an amazing barrage of bloody and nightmarish terror which cannot be controlled by the hapless people trapped inside that fateful apartment. The devil fetus once it gets born kills its victims with nasty tentacles which impale and rip anybody hapless enough to get in touch with them. There's also some very graphic nightmare scenes before the ending, too, and one of these is also illustrated in Tom Weisser's Asian Trash Cinema Book next to SEEDING review. I mean the scene in which one of the rapists suddenly starts to vomit worms while eating his food. Also the scene in which the guy gets his spine cursed through his back in explicit detail is again something never before seen in any other horror effort. These Hong Kong directors can create something which necessarily doesn't require plenty of money, but are as (and often, more) effective and nerve shocking as those made with plenty of money but not so plenty of talent.<br><br>The dialogue and screenplay isn't too great at all, and the dialogue especially is inept. People say what they think and they say things which should not be said in any noteworthy film. Everybody always screams something like \"What are you doing!\" when character's stomach explodes or gets his spine ripped off by an invisible force. This kind of brainless dialogue is very usual with some Hong Kong films, and I hated to find it that much in SEEDING, too. But I came to conclusion that the film is perfect in its \"dark DARK horror level\" so I don't give this the lower rating it deserved because of these errors. If reviewed as a piece of cinema, this would definitely not get the 10 stars rating, but when reviewed as a piece of Hong Kong terror cinema and Asian cult cinema, then this gets easily the ten rating, because it is something I hadn't seen before and something I think isn't easily surpassed anymore. I hope I can track RAPE AFTER and others of its kind down soon and see can they surpass the insanity and impact of SEEDING OF A GHOST in any way. Have a good night's sleep!","user":"Bogey Man","rank":[12,13]},{"title":"fun splattery times from the Shaw Bros","rating":8,"date":"19 February 2010","review":"I have been a bold boy over the last few months and been neglecting the sleazier side of my viewing needs. It's swings and roundabouts for me in terms of what I watch, some months I will watch nothing but exploitation and 70's porn, then for the next 6 months it will be a straight up horror binge. There just isn't enough hours in the day to watch all the crap I wanna watch, but sometimes I just need a good gore and rape fix. Hey, it beats having to go down to the local park with a tyre iron to look for a victim...<br><br>A good buddy of mine gave me a stack of Shaw Brothers flicks a few months ago. And after watching Seeding of a Ghost, I'm kicking myself for not jumping into these before. I can say with my hand on my sick little heart, that this is probably the most fun I have had watching a film in a long time.<br><br>Philip Ko Fei is a taxi driver who happens to save a black magic sorcerer from an angry mob one dark night. The taxi driver's wife is a blackjack dealing cutie bored with her married life. She starts receiving the attention of a rich business man at the table and eventually starts having an affair with him. Soon this affair turns a tad foul, and she finds herself out on a lonely street late one night. Unlucky for her, she gets terrorized by two scumbags and they try raping her in an old building, but she takes a dive off the roof and meets a splatty end on the pavement.<br><br>The taxi driver swears revenge on those who messed with her, so what does he do? He tracks down the black magic guy from the opening scene, and gets him in on the act. The sorcerer digs up her rotted corpse and summons her ghost. They then start playing pranks of the ghostly and murderous kind on her enemies, and it leads to a finale that has to be seen to be believed! Seeding is a definite slow burner. It does take about 50 minutes before things start going truly crazy, but even up to this point, the film is highly entertaining. You get plenty of nudity for one thing. There are slow motion topless jogging scenes, crash zooms and close ups of hairy groins, close ups of even hairier arm pits, and plenty of punch ups and random acts of violence and insanity to keep you going. We even get a cool sex scene between the corpse and a spirit! Fun times, my friends.<br><br>The climax is where this one really takes off though. Taste gets chucked out the window with the exploding pregnant women and tentacled monsters. There is enough offensive sh!t here to keep most laughing. I have The Boxers Omen and Bewitched up next to watch, and I can't wait. Check this one out with a few brews, a blast and a boner is guaranteed.","user":"Condom-full-of-Hatred","rank":[4,4]},{"title":"Classic Sex and Gore Fest","rating":8,"date":"23 August 2004","review":"First off this film is pure exploitation. This is sex and violence and really gross, even by todays standards. Its not the best film ever made, but if you want gore and worms and gross things with your beautiful naked women this is for you. This film belongs in the exploitation hall of fame.<br><br>A very bare bones explanation of the plot has a beautiful woman having an affair because she is bored with her husband of a couple of months. She wants to run off with her lover, who is also married, but he won't go. Getting out of her car on a lonely stretch of road she finds a phone and calls her husband who's cab driver. While she is waiting she is raped and killed by two guys. The husband uses the services of a black magician he once saved to get revenge on the killers and the lover. Its gross fun from that point on.<br><br>The sex is early on as we see the very beautiful wife naked in the shower and having sex with her lover. Proving that this is exploitation at its finest we have a slow motion topless jog along the beach.<br><br>This film has a reputation for being gross out royalty and its nice to report that this certainly is the case. This is a film that will have you going \"yuck\" quite often. Done before CGI this film is helped by knowing that what you see is what you get, people really are spiting up insects and such.<br><br>The problem for me was that it seems oddly paced. Don't get me wrong the plot moves, but at times it seems a bit talky, which is odd since what you see is what you need to see and hear.<br><br>See this film.<br><br>I rated it as a 7 out of 10, but thats for most people who want to see a gross out horror film from overseas. For hardcore exploitation film fans or those who love gross effects this is a classic and should be 10 out of 10.","user":"dbborroughs","rank":[4,4]}]