[{"title":"Worth a quick look, but soon forgotten","rating":5,"date":"10 January 2003","review":"Roger Moore is in uncharacteristic surroundings here, in a very adult thriller. He plays a Chicago psychiatrist who tops the polic's suspect list when a number of people start getting bumped off in the city. You see, all those that are dead are patients at his clinic. As suspicion mounts, Moore does the only thing he can and takes the investigation into his own hands, hoping to clear his name by catching the real killer(s) himself.<br><br>Also involved in the film are Rod Steiger and Elliot Gould, both giving enjoyable performances as cops investigating the crimes. The story takes its inspiration from a Sidney Sheldon bestseller, and unfolds fairly intriguingly with various red herrings and killings tossed into the mix at regular intervals. However, the film isn't perfect by a long stretch of the imagination. For a start, the peculiar assassination at the end is supposed to be a twist of some sort, but it makes little sense. Also, the solution to the murders isn't that great (in fact, it's been six years since I saw the film and I can't remember exactly how it all gets resolved). Nonetheless, the film is probably worth a look, especially if you've never seen Moore in one of his more unstereotypical roles.","user":"barnabyrudge","rank":[13,13]},{"title":"A view to an acting career?","rating":8,"date":"10 November 2003","review":"Moore knew he was living on borrowed time so far as Bond was concerned. Way too old, too slow moving and paunchy to be carrying a Walther PPK for much longer. His Bond contract allowed him to make two other films during this period - post OCTOPUSSY and pre A VIEW TO A KILL (that was to be his last JB outing)<br><br>Wisely perhaps, he chose this role as mild-mannered but wholly professional Chicago psychiatrist Dr Judd Stevens, whose life hits a major rut after one of his patients is stabbed to death - wearing HIS coat. Having no idea what is going on for pretty much the entire movie Moore conveys Judd's plight rather well I thought. As unlike anything Moore has ever done, he must deal with finding himself simply in the wrong place for seemingly no reason.<br><br>Several things to like about this flick - IF you care to look. Art Carney's turn as burnt-out but still cluey PI Morgens is a real gem of a performance. When Moore admits he doesn't believe in guns, Carney counters, \"Yeah, well I don't believe in Santa Claus, but each Christmas he still comes round.\" The brief scenes in his ramshackle office are really worth looking at closely.<br><br>Cop Steiger is a tad over the top as is his wont - give him any opportunity to rave - he's in actor's heaven. Ron Paradi as mob boss Cortini puts across one of the nastiest and inherently evil men you would ever wish to not meet and Anne Archer is well....Anne Archer.<br><br>Totally unexpected last 20 seconds really lifts the film I thought.","user":"uds3","rank":[13,17]},{"title":"An excellent cast in a passable film.","rating":6,"date":"21 December 2014","review":"Bryan Forbes (\"The Stepford Wives\" '75) directed this adaptation of a Sidney Sheldon novel in addition to writing it for the screen. Sir Roger Moore tackles a change of pace role, playing Dr. Judd Stevens, a Chicago psychiatrist. One of his patients is murdered for no apparent reason, and his secretary is horribly tortured before being killed. Lt. McGreary (Rod Steiger) is a volatile police detective, bearing a grudge against Stevens, who's very quick to consider the doctor a prime suspect. The story then unfolds as one would expect it to, as Dr. Stevens must evade attempts on his life while trying to prove his innocence and keep McGreary out of his hair.<br><br>\"The Naked Face\" really isn't deserving of some of the talent here. Made on the cheap by the Cannon Group (basically because some of their other product during this time had under performed at the box office), it adequately entertains without being remarkable in any way. Viewers may feel underwhelmed by the twists that the story provides, and the climactic reveal and confrontation fail to be that satisfying. Editing, photography, and pacing are all reasonably well done, although that music score by Michael J. Lewis is awfully melodramatic. The last second shock ending is quite annoying.<br><br>Moore is okay, no more, as our somewhat reserved main character, while Steiger is given yet another opportunity to rip the scenery to shreds. Elliott Gould is actually good as McGreary's partner Angeli. Lovely Anne Archer is appealing as always in her small role as one of the patients. David Hedison lends solid support as Stevens's good friend (and brother-in-law) Dr. Peter Hadley. The main attraction, however, is Art Carney in a likable turn as a sly private detective. The film gets just a little bit better when he turns up.<br><br>Fans of these actors and this genre may enjoy this one. At least it delivers one memorable sequence involving one of the attempts to kill off Stevens.<br><br>Six out of 10.","user":"Hey_Sweden","rank":[4,4]}]