[{"title":"Not bad, but...","rating":7,"date":"16 October 2006","review":"I remember watching this movie in the 80s, and thinking it was a good film. There was, however, one major problem that I had with the film - the fact that the main protagonist seems to be a dummy when it comes to anything other than science. Forgetting about the fact that Paul, one of the main characters, essentially exposed a bunch of people to high- grade plutonium (no mention about any medical crisis for all the people around Paul after the happy ending), the kicker comes when he's finally confronted in a hotel in New York by John Lithgow and a bevy of military men who would like nothing more than to lock him away for a long time. Paul's nonchalance comes out in the exchange, \"They can't do anything to me.\" \"Why not?\" \"Because I'm underage.\" <br><br>HUH? You're smart enough to build a freaking nuclear bomb by yourself, including smart enough to know where to get some explosive material needed to blow the bomb up. You're also smart enough to have fooled a high-security system with a bunch of frisbees and a helpful girlfriend in order to get the plutonium (and smart enough to temporarily cover your tracks by inserting shampoo into the jar so it's not immediately noticed as missing). But what in the world makes you think that they'll let you go because \"I'm underage?\" <br><br>I suppose the script writer needed to show a little naiveté - after all, if Paul knew the full gravity of what he was doing, he might not have done something as reckless as he did. Instead, he might just have gone ahead with an expose without needing to win first prize at a science contest.","user":"Sledgeh101","rank":[20,24]},{"title":"Those darn warmongering govies....","rating":20,"date":"20 September 2003","review":"So let me get this straight. This teenager wants to expose this secret government laboratory... by building an atomic bomb with material he steals from the facility and taking it to a science fair. And he wants to expose this facility because... they didn't tell anyone they were a secret plutonium facility and thereby make themselves a target for espionage and theft?<br><br>So, as I said, his solution to the \"warmongering\" military authorities building atomic bombs is to build one himself. (And they're warmongering because they want to build atomic bombs because hostile countries with a doctrine of overthrowing countries to spread their political beliefs would do the same to the US if they could because they also have atomic bombs, right?) Then when the government officials learn that this kid has stolen weapons grade material and has built a bomb with it, they have to gall to take over his mom's house while she cries \"What gives you the right?!\"<br><br>Then, and get this, then, when he learns the government has found out he has stolen weapons grade material and built a bomb with it, and he threatens to set it off for no other logical reason anyone can think of other than not wanting to get thrown in jail for something HE did, everyone acts surprised when the government acts ready to kill him to stop him and everyone thinks that's just a terrible thing. No, wait, they want to kill him not just to stop him, but also to keep the facility a secret.... after a whole bunch of people already know what's going on.<br><br>And when the bomb almost goes off because this genius kid was too stupid to know what he was doing, he gets to walk away as a local hero because he built a bomb with weapons grade material that he stole from the facility and almost wiped out his friends, family, everyone in the town and surrounding areas including the mean government officials who were ready to kill him because he threatened to set off an atomic bomb with material he stole from the facility.<br><br>Riiiiigggghhhhhhtttt.........","user":"Mentat327","rank":[62,88]},{"title":"Wow, this one is amazingly bad","rating":1,"date":"16 January 2007","review":"We are asked to respect a high school kid(Paul Stephens who builds a nuclear bomb, and admire how he lightheartedly carts said device in a science fair, endangering the lives of literally tens of thousands people. If this \"comedy\" had been a wacky, Marx Brothers/Airport type farce, that wouldn't have bothered me in the slightest. But is \"comedy\" (which doesn't contain a single laugh)insists that we admire the arrogant little creep. I kept wishing that Jack Bauer would come in and shove a knife in Paul's kneecap.<br><br>Marshal Brickman never directed a feature film after this, and I can't wonder why.","user":"bvallely","rank":[37,52]}]