[{"title":"Bulldog's Babes","rating":10,"date":"13 December 2005","review":"Three years after 'Deadlier Than The Male', Richard Johnson was back as Hugh 'Bulldog' Drummond, this time investigating mysterious sabotage incidents involving the S.S.T.-1, Britain's newest supersonic airliner. The 'Matt Helm' and 'Derek Flint' sequels disappointed, but nobody who enjoyed 'Deadlier' can fail to appreciate this. The same ingredients ( beautiful girls, gadgets, nice location filming, fast-moving action ) are here, but with a dash more humour. Its all so over the top its practically orbiting Saturn. Charles Blackwell's score catches the right mood of '60's kitsch, the opening theme song is a knockout! Tightly edited, the film moves so fast you don't have time to dwell on its absurdities. Daliah Lavi and Beba Loncar head a long line of luscious babes, including a young Joanna Lumley, and the delectable Adrienne Posta! Nigel Green isn't around to reprise baddie Carl Petersen, alas, but James Villiers is not too bad. Robert Morley is delightful as the eccentric cookery teacher 'Miss Mary'!","user":"ShadeGrenade","rank":[32,38]},{"title":"Better than most modern movies. Very under rated","rating":29,"date":"29 September 2003","review":"This movie should not be mistaken as a budget imitation of a James Bond film, as it possesses it's own distinctive characteristics.  Yet, for it's time (1969) it is just as adventurous and entertaining with  Richard Johnson performing the role of  (Bulldog) Hugh Drummond, similar to your James Bond Secret agent, but with a touch of humour and to some extent, a bit of sarcasm.  Like Bond, Drummond is well skilled, serious and intelligent and is out to investigate what is behind a series of murders disguised as accidents, that are carried out by what appears to be beautiful young women (hence it's title Some Girls Do).  Robert Morley performs the part of Miss Mary and is later found dead after having given classes to potential chef students in perfecting the art of cracking eggs open into a bowl.<br><br>\nDrummond is also targeted when flying a glider and is meant to crash down when his parachute has been tampered with by the beautiful robotic women who watch from below, but manages to skillfully and successfully release open the parachute, landing down safely as if nothing had happened..  A fine performance by Sydney Rome as the typical James Bond type girl, but Drummond is not at all fooled by her pampering and charming behaviour, as he is very intelligent in sensing her motives..  She does play the bimbo but is very cunning, as most Bond style girls are.<br><br>In a nutshell I did enjoy this movie and am not surprised that any criticisms are really more to do with it's comparisons to modern released movies.  However, I am very surprised that the character of Bulldog Drummond was not pursued in later years like with remakes of  `A Thomas Crown Affair', `The Avengers', `The Saint' etc.  I believe that the character of `Bulldog' Drummond could have been further modernized and made into a big hit in the late 1970's upto the 1990's with newer adventures, as it had all the charm and character of serving  action/adventure style movies, but on a larger scale.  I would have kept one foot in the 1960's and another one in the 1990's keeping that style in an evergreen sense.","user":"joeagnes","rank":[29,35]},{"title":"Easy On The Eyes Entertainment","rating":27,"date":"27 March 2009","review":"If you are tired of all the Politically Correct \"no fun\" offerings that Hollywood dishes out these days and yearn for some good clean fun from a bygone era when \"Womyn\" were just happy to be \"Chicks\" and men were having fun like no tomorrow (their grins say it all, lucky bastards!;-), and would like to indulge in an escapist fantasy with some naughtiness to it on a guys' night in, then you may find this film quite enjoyable. Besides which guy doesn't like watching \"hot chicks\" in short minis being seduced with kisses that turn their heads, even if they are robot \"chicks\"? This is obviously from the era when Jim Kirk was doing the same to exotically dressed \"Hot Chicks\" on TV in the original Star Trek series, and this film doesn't do such a bad job with the same naughtiness factor to it.<br><br>And if you like this one then try its predecessor film. The \"Chicks\" in these two films put todays' sour looking super-models and centerfolds to shame. The Movie industry just doesn't have the same level of beauty in their female actors anymore as they try to relate too much to a female audience to the great disappointment of the male audience.<br><br>If like me you fall asleep during chick flicks and would love to watch a movie made just for guys then enjoy this one.","user":"darkasnight1234","rank":[23,28]}]