[{"title":"In the best tradition of Le Carre","rating":18,"date":"18 October 2003","review":"Whereas Ian Fleming and Robert Ludlum tended toward the super-hero approach to international espionage, John Le Carre preferred it's more-realistic side: the tawdry shadow-world of betrayal, futility, and the brutal exploitation of human weakness. It looks like screenwriters Daniel W. Rintels and Gerald Wilson and director Michael Winner took a page from the Le Carre playbook when crafting this 1973 thriller.<br><br>Scorpio ranks with The Spy Who Came In From The Cold and The Looking Glass War as one of the best espionage flicks ever made. Burt Lancaster displays subtle depth as a veteran CIA agent who might be turning to the other side. Alain Delon excels as the young French assassin tasked with the liquidation of his old friend and mentor. Paul Scofield, John Colicos, and a young James Sikking all turn in fine supporting performances.<br><br>Scorpio is a lesser-known yet very satisfying classic from the Anti-Hero/Anti-Establishment era of the 1970's.","user":"JVSanders","rank":[33,40]},{"title":"A TRULY TOP-NOTCH THRILLER","rating":9,"date":"3 May 2002","review":"Back in the 1970s when Capitalism and Communism were fighting the cold war with undercover activities, a film such as this was able to play on our fears of the \"good\" guys as well as the \"bad\" guys. So, along with Burt Lancaster's aging C.I.A. agent, Cross, we can't know whom to trust. We like Burt, but we also like Alain Delon (Scorpio) the free agent assigned to assassinate him. We loathe John Colicos as the C.I.A. chief, yet he's supposedly working for our side. We like Paul Scofield's Zharkov, yet he's a commie. (Indeed, Scofield who is a master of cold characters has never been so charming.) The film offers great action scenes as well as unmitigated suspense. There is a superlative cast, and a lot of surprises. (Burt ain't named Cross for nothin'.) If you are a fan of thrillers, or even you aren't, this one's a must see!","user":"beptep","rank":[45,57]},{"title":"Scorpio stings in this excellent thriller","rating":8,"date":"4 January 2011","review":"I had seen this years ago and thankfully it was shown again on thisTV out of Indianapolis.<br><br>Although this film is a great spy thriller, it is much more about friendship. Deep friendship. Between enemies and old friends. Not the fleeting digital facebook friendship where facebook folks are friended are defriended with the ease of changing lipstick. But deep, 'no questions asked' friendship of life threatening assistance. Do you have any friends like that? I think not. This is more a human story of old loyalties not nameless rule book bureaucrats. <br><br>There is a very poignant scene in the music hall where Max and Cross are listening to Brahms talking about the favor that Cross needs. Earlier in a cafe, Cross tells Max he needs a favor, and Max says he will do it no matter what and has the weekend free. Max is a music instructor. In the music hall, Cross says the favor may be painful, he needs a message delivered to his wife and it will probably kick back to Max. Max doesn't care, because after WWII, Cross was the one who liberated Max from the camps, where \"he couldn't listen to Brahms without crying\". Now, after being liberated he can. He dies helping Cross. Who has friends like that?<br><br>Cross friendships go deep, from the hood in DC to a Soviet spy. In fact, those friendships transcend race and politics.<br><br>Scorpio predates Casino Royale in a great foot chase through a construction sight and it also has the intrigue of 3 Days of the Condor. It also predates the Bourne Identity series in that Cross is one step ahead of the CIA most of the time.<br><br>GREAT LINE: <br><br>SCORPIO: \"I think you better try McLeods chair for fit, it is going to be empty soon\". Said to 2nd highest CIA guy after learning that an agent of McLeod killed Cross's wife.<br><br>I liked Cross's coterie of old friends that he relies on for his escape through Europe and in the US. A great entertaining thriller and with Burt Lancaster, Alan Deloin and Max Schofield you will have a delightful time.","user":"djderka","rank":[17,20]}]