[{"title":"They don't make these anymore.","rating":6,"date":"6 March 2001","review":"A feel-good 1980s teen lust comedy, with the right music, cute girls and the usual gang of idiots trying to get laid. It is very tasteless but enjoyable; I can't understand why they don't make these anymore. I've watched it a dozen times, yet it still gives me the same feeling of innocent fun. For friends of politically incorrect sex comedies, Hot Moves is highly recommended.","user":"cobrasoldier","rank":[10,12]},{"title":"Surprisingly entertaining","rating":10,"date":"7 November 2003","review":"Forged within the sea of endless '80s teen sex comedies, Hot Moves somehow manages to be much greater than the sum of it parts.<br><br>This movie saw almost no time in the theaters, showing up only in a few New York locations in December '85, hoping to lure in cold easterners yearning to do some California dreaming.<br><br>Hot Moves certainly has its share of faults.  The acting ranges from mediocre to horrible, a lot of the dialog is poorly written, and the movie is peppered with long, \"second-unit\" scenes on Venice Beach which don't feature any of the cast, and have absolutely nothing to do with the rest of the movie.  These parts were obviously \"filler\", as the running time for the entire movie is 85 minutes.  Without these boring sequences, the movie would be well under 80, which wouldn't qualify it as \"feature length\".<br><br>However, despite its aforementioned problems. \"Hot Moves\" manages to be charming, entertaining, and at times, very funny.  Despite the movie's obvious low budget, it still features a completely original 12-song-deep soundtrack, and a lot of the music also has its own campy charm.<br><br>Hot Moves is perhaps best known for its \"nude beach\" scene, where the viewer is treated to the full frontal nudity of dozens of beautiful women, inexplicably running across the sand.  Such a display would surely earn an NC-17 rating nowadays, but somehow this movie kept its \"R\" rating back in 1985.<br><br>While I can't complain about the nude women, \"Hot Moves\" actually stands out in my mind for its frivolous fun and surprisingly creative plot.  I have a strong feeling that the writers of \"American Pie\" must have seen Hot Moves, since the plots are incredibly similar.  While American Pie was more \"advanced\" than Hot Moves, it could be argued that the raw material for Hot Moves was actually better.  Oddly enough, when the E! channel toured Seann \"Stifler\" William Scott's house, he proudly displayed Hot Moves as one of his favorite movie of all times.<br><br>Look for Virgil Frye (Soleil Moon Frye's dad) playing a sex shop owner, in an odd cameo.<br><br>Rent Hot Moves.  It's 85 minutes of fun.","user":"severe_td","rank":[12,16]},{"title":"Looks like the original American Pie","rating":7,"date":"11 July 2000","review":"This film seems to be the 80s version of American Pie: Four loser virgins who want to get laid make a pact to help each other and go about finding girls to screw. If you look at it closely, the characters are even similar and there's the one guy with the girlfriend who thinks that sex is the only thing important to him.<br><br>Anyway, the girls look great and there are heaps of funny scenes worth catching, especially at the end. So if you haven't seen it, check it out.","user":"JoshB-2","rank":[9,12]}]