[{"title":"Flawed but interesting loose adaptation of Simenon novel--strong James Mason performance","rating":5,"date":"14 January 2006","review":"Of the 150 or so Georges Simenon novels I've read, STRANGERS IN THE HOUSE (at least the English translation by Sainsbury) would rank in the lower third. It's an excellent character study--as is virtually any Simenon work--and the concept is interesting, but it lacks suspense and ends with a whimper, not a bang. The film also is an interesting character study of a man (here Anglicized and played by James Mason) who was once a brilliant attorney, but after his wife left him, he became jaded and turned to drink, raising his daughter (here played by Geraldine Chaplin) on his own, but remaining very distant from her to the point that she has a separate life as a late-teenager that is completely unknown to him, even though it's happening within his own (large) home. One member of the gang she hangs out with is killed in the home, her boyfriend is charged with the crime, and Mason comes out of semi-retirement to defend him, cleaning up his life in the process and getting a new sense of spirit and motivation. The general plot of Simenon's book has been retained, but most of the specifics have been changed and a number of new elements introduced. Mason is quite impressive both as a cynical alcoholic and as a man reclaiming his spirit and his youthful idealism. Geraldine Chaplin looks quite young here, and does fine as the marginalized daughter who eventually begins to trust and even somewhat respect her father again. Bobby Darin is cast as some kind of thug sailor who is older and more experienced than the gang of teens but becomes a member of their group (and who is very different from \"Big Louie\", the equivalent character in the novel). When I first saw this film about ten years ago, Darin's performance reminded me somewhat of Robert DeNiro in TAXI DRIVER, although this second time I've watched the film I see less similarity. Still, Darin's character is brooding, thuggish, and repeats \"Ain't it so\" or \"Aint' that so\" throughout the movie (the song of the same name by Eric Burdon and the Animals is played a few times throughout the film). Mr. Darin probably viewed this as a good opportunity to re-build his acting career as a character actor (he later played the gigolo in Richard Brooks' THE HAPPY ENDING, see my review of that), and he certainly creates a memorable character here, as much as we might like to forget this annoying character!!! The weaknesses in the film are many--some sections move too slowly, others move too fast and lack tension. The ending, for instance, is quite abrupt and not adequately build up to. Some members of the daughter's gang are played by actors who do not convince--Paul Bertoya as Chaplin's boyfriend, a Greek Briton who faces discrimination, is awkward and hurts whatever scenes he is in. Worst of all, there's a phony \"swinging sixties\" and hippie undercurrent here that's a total misfire. Many films made then that attempted to be hip did succeed--BLOW UP, for instance (and there's a brief homage to BLOW UP in one scene here--I'll let you find it yourself)--but these twenty-three year old teenagers are laughably UNhip. At least when the thirty-five year old Bowery Boys were playing teenagers, they did it for laughs and the actors were in on the joke too. Here, it's just grating and ridiculous. The teenagers depicted in films such as RIOT ON SUNSET STRIP or MARY JANE are far more realistic than the ones here, and neither of those films is a masterpiece (although Mary Jane is quite underrated). And the identity of the killer is telegraphed so far in advance, and his character is played so broadly, that only someone sleeping through the film would NOT know who did it! On the whole, I can't really recommend this film, except for James Mason's performance. If you are at home recovering from the flu and will watch ANYTHING that's on, this is probably better than an OPRAH or MAURY show, but don't go out of your way to see it. And why Anchor Bay Video released this in its ROCK AND ROLL CINEMA series is beyond me! Trust me, except for bits of the Burdon/Animals song played here and there in the movie, there is no rock and roll content whatsoever.","user":"django-1","rank":[17,21]},{"title":"Disappointing, but still worth seeing!","rating":7,"date":"28 October 2013","review":"Originally based on a Georges Simenon novel, Strangers in the House, the script was re-written to accommodate Bobby Darin in a role that was initially offered to George C. Scott. The plot now centers on a gang of New Age cut-ups. One of them is murdered. Who by? Who cares? It's difficult to get involved with this psychedelic generation of grown-up kids who have more money than sense. Not that their elders are much better in any respect! Anyway, the motives for the killing are obscure, but even allowing for any residue of interest in this aspect of the plot, the movie seems far too long, far too drawn out. Nevertheless, James Mason delivers a standout performance as the former eminent lawyer who has become a recluse, but is drawn back into court. Geraldine Chaplin is oddly appealing as Angela, the lawyer's daughter, while Paul Bertoya makes a sympathetic victim. In the support cast, James Hayter steals the show as Harley Hawkins. Bobby Darin, however, unwisely plays his whole role in an impersonation of Burt Lancaster! And one last thing I didn't like – the music by Patrick John Scott which is mixed into the sound track at too loud a level to suit my taste.","user":"JohnHowardReid","rank":[5,6]},{"title":"Dated, but interesting murder yarn.","rating":3,"date":"3 May 2004","review":"On the heels of \"Blow Up\", this \"happening\", \"mod\" type of mystery/social examination stars Mason as a drunken, dethroned barrister who has never recovered from the loss of his neglected wife.  His teenage daughter Chaplin carries on behind his back with assorted other lost-soul rich kids and has an attractive, but poor, immigrant boyfriend (Bertoya.)  One day Chaplin's clique happens upon the off-kilter and perverse Darin and before long the teens are gravitating towards him and exploring avenues better left untraveled.  This is best demonstrated when Darin turns up dead in Mason's attic!  When Bertoya is fingered for the murder, Mason must put down the bottle and defend him, not only to free an innocent defendant, but to purge himself and win back the affection of Chaplin.  If the plot sounds straightforward, it may be, but the film is presented in a choppy, flashback-filled style with pretentious camera-angles and framing and groovy music (and, of course, the peerless fashions and hairstyles of the day!)  It also has what have to be among the speediest opening credits in film history!  Mason gives a very strong performance and is allowed some really amusing moments as he blithely criticizes the world around him and gives no credence to the societal structure which he had previously been a part of. His scenes in the courtroom, in which he plays with paper clips instead of cross-examining witnesses, are a gas.  Chaplin does a decent job as well and holds her own against the far more experienced Mason.  This \"teen\" performance is a little jarring following her work in the monumental \"Dr Zhivago\", but she fits it okay.  Darin, smothered in pancake make-up and indulging himself in all sorts of \"far out\" dialogue and behavior, dates pretty badly.  Bertoya (a sort of Latin John Derek) comes across well, but never really went anywhere after this.  Veteran actress Jenkins is way over the top as his worried mother.  Ogilvy, as a cultivated and snotty rich kid, does a good job and enjoyed a lengthy career.  There are a host of other seasoned British actors on hand to lend a little class and interest to the proceedings.  Even though the abrupt editing and shifting time elements were cutting edge (and more in line with what today's audience is used to), these gimmicks actually create distance between the audience and the story rather than uniting the two.  Perhaps it is the execution of these elements, rather than the approach itself, which fails to create a fully cohesive piece. Still, for Mason's work and for a glimpse into swinging London and the comparison with the old guard pillars of society, this film does provide some interest.  (There is also a serious case of panty lines on the guy in the \"I Hate You All\" T-shirt at the beginning.  Next time, just go commando!)","user":"Poseidon-3","rank":[6,8]}]