[{"title":"Only two movies in and I'm drawn in completely","rating":9,"date":"8 July 2005","review":"I've read about this series elsewhere and was always curious to see it. Thanks to an internet movie rental chain I've now seen 7 Up and 7 + 7, and the rest of the series is queued up and ready to ship. I can't wait.<br><br>Viewers who are not used to the various English accents will likely be struggling to understand what some of the kids are saying in the first movie, 7 Up, but it's a short film, and deserves repeated viewing. My vague memories of previous reviews of this series suggest that this may be the most lighthearted of the series. While it is fascinating for many reasons, it is also vastly enjoyable just for the experience of the 7 year-olds' high spirits and humor.<br><br>It's jarring when you get your first look at 7 + 7, which revisits most of the kids 7 years later. Their individuality, only hinted at in the first movie, is obvious in these now-14 year-olds. As a parent I feel that familiar combination of the sadness at the loss of the child and anticipation of the future adult. Here we run through this in a matter of minutes.<br><br>As it stands now, the series goes as far as 42 Up, somehow turning these frolicking little kids into my peers in the space of a few hours. (I've always been a sucker for special effects.) This series is unlike anything that came before it, and while a quick scan of titles suggests that it's been imitated since, I'm waiting to see what happens to this particular group.","user":"metalgoth","rank":[15,18]},{"title":"Good start to long-running series...","rating":8,"date":"29 October 2007","review":"\"Seven Up!\" is the forty minute documentary from 1964 that stands as a prologue for the most forward thinking documentary series of all-time. The film brings together a group of surprisingly articulate seven-year-olds from a variety of backgrounds in England. Through a number of questions posed to each of the children, the audience gets the opportunity to get to know the world through these children's eyes, and often presumably through the parent's eyes and therefore only quoted through these children. Personalities more than perspectives ring through the strongest in this first film, and the glimpse at the education system circa 1964 is intriguing. Unfortunately, as \"characters\" that will ultimately be seen for another forty years to come, the thick accents of some of them make for a rough start. All in all this is important cinema regardless.","user":"postmanwhoalwaysringstwice","rank":[11,14]},{"title":"Mesmerising","rating":13,"date":"13 March 2006","review":"49 up was screened here i two episodes. Recent meetings with the participants were interwoven with flashbacks from the earlier interviews at ages 7, 14, 21, 28, 35 and 42. So beautifully put together. No sensationalism. No hopping about. Each interview subject was able to unfurl their lives in a steady pace that kept me enthralled throughout.<br><br>It's a breathtaking idea that grew out of an interest in finding out what happened to the original group after another 7 years when the children had become 14. The producers have kept in touch and most of the subjects have been more or less willing to be interviewed in the subsequent years.<br><br>This series of interviews, especially seen in the light of the fact that I am nearly as old as the people involved in this project, gave me so much. Seeing people live their lives, suffering set-backs, dealing with life's many stumbling blocks, gaining unexpected insights into themselves and their loved ones makes for a very gripping and fulfilling experience.<br><br>Absolutely marvelous. A gem.","user":"CGA_Soupdragon","rank":[10,13]}]