[{"title":"Amusing Nichols film with Hilarious Nicholson!","rating":6,"date":"10 November 2004","review":"Mike Nichols' last good film that I'm sure bombed at the time. Stockard Channing almost steals the show as the young heiress, Warren Beatty is perfectly cast, and Nicholson is hilarious without doing much (great hair). There were a lot of good films in the 70's and this should have been included on most lists.<br><br>A 7 out of 10. Best performance = Jack Nicholson. There are scenes that fall flat, but the ones that work make it worthwhile. Great costumes and art-set direction as well. It's hard to imagine these two actors (Beatty &amp; Nicholson) playing the characters they did in REDS six years later after playing these buffoons. Give it a shot.","user":"shepardjessica-1","rank":[23,28]},{"title":"I'm sorry gridoon didn't get the plot. I thought it was hilarious.","rating":9,"date":"28 March 2005","review":"Stockhard Channing must be one of the most underrated comediennes about. This is an hilarious film. gridoon, who found it disappointing, seems to base his critique on the quality of the cast; Nicholson; Beatty &amp; Channing. His expectations were probably pitched too high - and, sure, Five Easy Pieces is amazing, and Bonnie &amp; Clyde is a classic. But The Fortune can stand on its own. It is very funny. The pace is hectic and the storyline has resonances of \"It Happened One Night\". The difference being that in the \"The Fortune\", the heroine is kidnapped - a botched attempt by two incompetents (Nicholson &amp; Beatty). The so-called Swedish Syndrome seems to have rooted here, in that the captive falls for her captors &amp; doesn't want to be saved. <br><br>This film is well worth putting into DVD format - all Regions, please.","user":"stanistreet","rank":[17,25]},{"title":"Good moments,Funny Nicholson,Otherwise Poor Effort","rating":5,"date":"26 June 2001","review":"Ramshackle farce with a few funny moments, mainly thanks to Nicholson's largely inspired comedic work, but little else. Mike Nichols is adept at coasting along on clever scripts,but he's clearly unable to salvage wayward material like this. In particular, the running gag which comprises the last half hour or so of the film wears incredibly thin. Beatty and Channing seem to be trying,to little avail, while Nicholson walks away with the film. He's particularly adroit in the first 20 minutes,before the film gets lost in it's own series of ambling vignettes. Still can't hold a candle to the old W.C. Fields or Laurel &amp; Hardy films. Watch one of those instead.","user":"noble2max","rank":[15,23]}]