[{"title":"The story of Sammo Hung growing up in the Chinese Opera.","rating":10,"date":"21 June 2003","review":"This is NOT a Sammo Hung action movie. See it anyways. This is the story of a Chinese opera troop and their harsh master (played by Sammo). The troop in question is the one that produced such greats as Jackie Chan, Sammo Hung, and Yuen Biao. There is very little action in this movie, it is a drama. Sammo plays a VERY hard teacher, but he conveys a level of love for his pupils that makes his harsh treatment of them seem very difficult on him. This is Sammo's best drama. It is a coming of age tale, a biography, and a very moving film.","user":"the_cheese_23","rank":[18,20]},{"title":"Very well done. Some truth, some fiction. Excellent Sammo Hung.","rating":9,"date":"13 January 2013","review":"Sammo Hung delivers an excellent dramatic performance as Master Yu. This movie is well done and at times very sad. It borrows a lot from Jackie Chan's autobiography on his years at the China Drama (Opera) Academy with Sammo and Yuen Biao. <br><br>This film follows the lives of the Opera Academy students and Master Yu who led them during the 1960's. It focuses more on their performance life than the harsh realities of life at the school. It also focuses more on the Master himself than his students, as if it's more about his side of the experience.<br><br>Jackie Chan has said that the depiction of Master Yu was sympathetic and that life at the school was a lot harder than the way it was depicted in this film. His book certainly tells of a lot of harsh treatment and punishments they all received on a regular basis, including learning how to do their acrobatics out of fear of getting whipped by the master's, or Big Brother's cane. But this film is clearly not about that, and seems to be intended as \"fact-based\" tale rather than an exposé, so there's a mix of reality and fiction. The funny thing is that all of their real names are used - sort of. Early in the film a new student arrives, Chan Kong-sang - Jackie Chan's real name. Sammo is also referred to as Sammo and Yuen Biao as Biao. Sammo didn't actually take that name until he had left the school and was working in film. And even though the kids teased Jackie and called him \"Big Nose\" he did have a name, Yuen Lo, that Master Yu called him and he was known as. The nickname is kind of used to the extreme in this movie as opposed to his proper name. So it strikes me as quite mixed up - it's sort of a fictionalized story borrowing on some of the realities, using their actual names but not entirely accurately. Weird. <br><br>Some factual tidbits include the performance where the pants got in the way, the bus incident (though Jackie says they all had to sneak off and jump off the bus while it was moving!), and Jackie's mother bringing hot water to the school to bathe him.<br><br>The ending is quite touching, and again fictionalized as it doesn't match Jackie's description. He says that the students gradually left on their own, Sammo first, then him, then Yuen Biao when the school closed. <br><br>I'm pointing all of these differences out in order to clarify to anyone who might be curious where the lines of fiction and reality lie, not to criticize the film. In fact the film itself is well done and compelling. And as mentioned, a very strong performance from Sammo. Many beautiful shots and some fun performances by the opera students as well. <br><br>Also to note, Jackie Chan is listed as one of the actors on IMDb, but he does not actually appear in the film.","user":"mariecx","rank":[9,10]},{"title":"The metaphorical turtle was a stroke of genius!","rating":10,"date":"15 January 2019","review":"This is a hidden GEM! Don't know why this movie isn't much more talked about internationally.<br><br>The movie gives us a glimpse of the life in a traditional Beijing Opera training school, that Jackie Chan in some interviews always have talked about he grew up in. This particular school and teacher have produced Hongkongs most well acclaimed action superstars and movie directors that have shaped the industry for over a decade.<br><br>It's a wonderful time piece and takes us into the 1960ties nostalgic Hongkong which was beautifully put on film. The atmosphere of that time was captured splendidly. You cant get more authentic chinese Hongkong culture than this!<br><br>The child actors are endearing and you can feel the brotherhood amongst them and the hardships they had to endure for fame and fortune, aswell as the growing pains of being kids.<br><br>Sammo Hung himself as the master teacher did a good job of portraying the sometimes harsh teacher but with his heart in the right place.<br><br>That same teacher that learnt to let go of the turtle which represented his students, that lead to the birth of Hongkong most well known action superstars!","user":"wesseldj-48581","rank":[4,4]}]