[{"title":"A Touch of Surreality","rating":7,"date":"10 November 2007","review":"Somehow one is reminded of Brian de Palmas film \"Obsession\" when watching this rarely seen German-American production from the early eighties. Ulli Lommel, once member of Rainer Werner Fassbinders highly intellectual actors group, turned to directing when he still under Fassbinders influence, but after his mentors untimely death he finally turned to more commercial topics. \"Olivia\"  or \"A Taste of Sin\", as it is apparently also known  at first sight looks like pure (S)Exploitation, but there's more to it. As Lommel says in the short interview that accompanies the films' German DVD release, the idea of the story came to his mind when he, while on a trip with his then-wife Suzanna Love (playing the main part), found out that the London Bridge was rebuild in Arizona. He used this as the outline for a sort of identity-switch trouble-personality killer-love story  combining two places with two personalities, both of which essentially having been one from the very beginning. True, the way the story unfolds is far from cinematic brilliance, but nonetheless it is quite entertaining; and in no one way is this modern fairytale the brutal splatter film that others would probably want it to be. There are some harsh effects, and a few violent scenes are included in the aforementioned DVD as bonus (yet only the material that was originally cut out is seen, which makes some of this bonus shorter than even a second!). But sex, murder and blood, while still important for the outline, are not the main attractions. Lommel intensely tries to give his film a psychological touch. Because of his limited skills in storytelling, he does not succeed. But still: Olivias rite of passage makes for entertaining viewing, especially is you like that particular touch of weirdness, absurdity and \"otherness\" that so many great underground pictures from the 70s carry.","user":"Thorsten_B","rank":[17,19]},{"title":"Not a slasher classic","rating":6,"date":"23 May 2018","review":"I like Ulli Lommel's film The Bogey Man so much that I have 3 different copies of it; I even have 2 of it's poor sequel. I also collect many of the 88 Films releases, so when this came out I just had to buy it. \nThe British blu ray comes with an enticing cover (film is entitled Prozzie) and is part of 88's Slasher Classics Collection. This, however, is NOT a slasher movie, much more a psychological thriller with a bit of sex and horror thrown in. I prefer the first half of the film, which is set in London. It's pretty dark and has a few Lommel touches reminiscent of The Bogey Man. But when the action moves to Arizona the plot becomes pretty silly &amp; unbelievable. This film grew on me after a second viewing, so I'm glad I hung on to my Blu Ray copy as I had contemplated selling it.","user":"Stevieboy666","rank":[7,7]},{"title":"Incredibly good","rating":8,"date":"8 January 2008","review":"You all can read the plot summary from IMDb, so I won't write about it.<br><br>I got my hands on the DVD of \"Olivia\" yesterday. DVD cover didn't look great, more like erotic b-film, but WOW! The film runs only 1 h 20 minutes but many things happens during the film, and you won't be bored. There is something for everybody; romance, thrill, erotic and murders. Does that sound awesome combination? Maybe not, but in this film it is.<br><br>It looks like a big Hollywood studio film from the end of 1970's, but it was actually made with budget of $500,000. I have to admit that there are few moments when you can see that it was made with small budget, but it doesn't bother watching.<br><br>A must see for people who likes to see erotic thriller, but also for the IMDb users here who says that Lommel hasn't done any good film.<br><br>This is incredible.","user":"nko_123","rank":[21,26]}]