[{"title":"Because we can't be serious all the time.","rating":6,"date":"20 April 2012","review":"House Party was an unexpected low budget hit upon release in 1990, something about the bright colours and an 'urban movie' without a single drive by tapped directly into the consciousness of a teen market wanting desperately to embrace hip-hop culture without getting a gold tooth.<br><br>Kid 'n' Play host their own mega (to them) party. The be-all and end-all of House Parties. Where they can let their personal freak flags fly. Where a good time will most certainly be had by all.<br><br>And they basically do.<br><br>In a lurid blur of motion and colour these attractive teens set about enjoying themselves in the most PG 13 ways imaginable.<br><br>For a 15 year old this was like opening a window to another world: the outlandish gravity defying haircuts that I envied but would never dare attempt. The stoopid (in a good way) rhymes and dumb (in a hopelessly dated now) phrases spouted by these fly guys and home girls were new and dangerously addictive, if terribly out of place in the small town I grew up.<br><br>Shennanigans were plentiful, but amounted to little more than messin' playfully with the man in blue, freaking the establishment and clearly exposing the gaping generation gap by juxtaposing these carefully manicured teens against the pompous and staid older types.<br><br>Characters are broad and never less than frenetic and loud, dialogue makes little sense but sure sounds fresh and exciting.<br><br>And boy are these kids budding model citizens.<br><br>Overindulgence of alcohol is frowned upon, but with a supportive message of limitation rather than abhorrence. Violence is for punks and drugs aren't even mentioned. Sex is OK but only when 'safe' and amenable to both parties, no 'c'mon baby, you know you want it' here.<br><br>And there is an anti-prison sex rap. Finally someone stands up against it! <br><br>Final Rating – 6.5 / 10. House Party spawned several sequels, none of which I even vaguely recall. But this 90 minutes is always likable and elicits warm memories of my teens (not that I acted like this, but I watched a lot of movies where characters did).","user":"oneguyrambling","rank":[4,4]},{"title":"Crank up the bass on this house party! (spoilers)","rating":7,"date":"30 January 2005","review":"Oddly serving as the thesis film for director Reginald Hudlin while a student at Harvard, 'House Party' is one of my favorite teen comedies. Although, clearly most of the cast (especially Martin Lawrence and the members of Full Force) who were clearly somewhere in their late 20s, if not early 30s. However, this is one all-black teen comedy which did things with just the right amount of spunk, and the characters were not so obnoxious and not so stereotypical that you couldn't enjoy their (mis)adventures.<br><br>Old school rappers, Kid and Play, are two high school friends. Play is hosting a house party when his folks go out of town and his number one mate, Kid, plans on making an appearance. But, after getting into a scuffle with one of the bullies (aka, the biggest muscles from Full Force), he gets suspended. Like Les Anderson hoping his parents won't find out that he flunked his driver exam in 'License to Drive,' Kid prays that his father won't find out about his getting in trouble at school because he desperately wants to go that party.<br><br>But, more importantly, there is a great mix of subplots interacting which make this movie quite entertaining, especially the idiotic white cops that seem to appear at the most inconvenient moments (and not appear at the convenient ones) to harass the neighborhood and Kid's father (stand-up comedian, Robin Harris) making his way to the house party to bring his son home. And get a load of those clothes and dancing! <br><br>For fans of old school rap and hip-hop: the nostalgia trip alone should be reason enough to watch it. And, though several House Party sequels would follow, the first two are really the only ones worth watching.","user":"vertigo_14","rank":[5,6]},{"title":"An all time classic","rating":26,"date":"26 August 2004","review":"The kid'n'play dance was the thing back in the late 80s early 90s. The new jack swing was at its peak and this movie sums it up. It became a break-through for then young actors Martin Lawrence and Tisha Campbell. This reminds me of the time when I was a teenager who wanted to sneak out to go to a party and later got caught. I was in the 10th grade when this movie was released and I had a lot of fun during that time with not too much fighting at parties. The bullies played by the R&amp;B group Full Force made the movie more funny with its slapstick humor and the memorable Robin Harris with his witty punchlines. It's sad to see him leave this earth at an early age,and comedian Bernie Mac reminds me of him. I remember he died the weekend of this movie and this was a shock. He could have been one of the funniest comedians in the 90s but his life was put to a halt and made way for several comedians who are now today's superstars (namely from Def Comedy Jam). House Party also remind me of how fun hip-hop was,and back then hip-hop was political,educational,radical,and uplifting. This movie can go down in history as how African-Americans can enjoy themselves with no use of drugs and unprotected sex.","user":"IrockGswift","rank":[10,15]}]