[{"title":"Every bit as good as you remembered...","rating":8,"date":"5 August 2002","review":"For any boy growing up when I did, back in the late 1970s, it was well understood that \"Guns of Navarone\" was the sine qua non of adventure films, a movie you called friends about when you saw it listed in next week's TV Guide. It's hard to believe so much time has gone by, both since my boyhood and since the film was made, but \"Navarone\" still holds up very well, a character-driven film alive with nuance and subtlety. It moves at an assured clip, not rushed or forced, making the viewer follow its story through every agonizing twist and turn.<br><br>What makes the film especially good is the crisp dialogue, lines that point up the moral and philosophical argument at the heart of the film and which resonate today as much as then:<br><br>Mallory: The only way to win a war is to be just as nasty as the enemy. The one thing that worries me is we're liable to wake up one morning, and find we're even nastier than they are.<br><br>Franklin: I can't say that worries me!<br><br>Mallory: Well, you're lucky.<br><br>Good performances abound, but the best by far is David Niven's Cpl. Miller, a complex character whose smooth front and witty banter conceals much of the conflict of the film. It's he who tangles most often with Gregory Peck's Mallory, and has at least three scenes in the film that are top-rate. We may like Miller because he keeps things humming and provides welcome comic relief, but he's no less the center of the film than Peck or Anthony Quinn, the two well-cast leads whose relationship is enriched, at least from our remove, by the unique vow Stavros has made to Mallory about the unsettled business between them.<br><br>The plot is a thing of beauty, moving with all the synchronicity and clever precision of a diabolical cuckoo clock. The special effects have suffered more than a bit from the march of time (though one should remember that was the only part of the film that won an Oscar in 1962). Some process shots are cringe-inducing now. But the pace is still gripping and the payoff spectacular. Here's the film that was the template to every popcorn actioner that came after, its imprint recognizable on everything from the James Bond movies to \"Star Wars\" to Indiana Jones. That's impressive, but more so is that \"Guns\" remains as entertaining as any one of them, and more thrilling than most.","user":"Bill Slocum","rank":[109,124]},{"title":"\"We Have Three Choices\" In Classic WWII Drama","rating":8,"date":"27 November 2002","review":"\"The way I see it we have three choices - take him with us, leave him here, or kill him.\"<br><br>This simplistically summarizes the moral dilemmas at the heart of Alistar MacLean's classic novel and the superb Carl Forman film from which followed. The Guns Of Navarone at first looks like a basic mission - in 1943 a key channel in the Aegean Sea is commanded by two gigantic German siege batteries on the island of Navarone; these guns prevent the reinforcement of a British island garrison nearby, and if the garrison falls, it will persuade Turkey to join the Axis powers, an outcome Berlin is counting on as the war in Russia has turned against it with the defeat at Stalingrad. <br><br>\nThe guns cannot be bombed by air, despite heroic efforts by the RAF, and so is brought in a key Allied operative who has been working in occupied Crete since its fall to the Germans in 1941.  Captain Keith Mallory not only can speak the languages of the area with superb fluence, he is \"Keith Mallory, the Human Fly,\" the best mountaineer in the world.  He feels he cannot climb the 400 foot precipice atop which the German batteries sit, but he likes nothing better than \"a well-organized setup\" upon seeing that he has no choice.  <br><br>With the help of his closest combat comrade Stavro (Anthony Quinn), Mallory is assigned with Major Roy Franklin to ferry British commandos - one of the a wise-cracking explosives expert, Corporal John Anthony Miller (David Niven)- on the perilous journey to the back door of Navarone.  But the infiltration is fraught with danger, and when Franklin is badly injured, the real crest of the story unfolds, the moral dilemmas of the team as they must complete the mission while deciding how to handle an injury they cannot treat.  <br><br>And as if that were not enough, one of the Greek resistance operatives helping the team turns out to be a traitor after Miller finds his explosive equipment has been tampered with.  It leads to yet another of the several arguments that ensue through the film between Miller, the soldier who does not want the responsibilities involved, and Mallory, who is determined to finish the job.  While one of the arguments doesn't make much sense - Miller is horrified when Mallory admits lying to Roy Franklin so that upon eventual capture Franklin will give away inaccurate information; this is by far the most humane solution to the intolerable dilemma the team has faced - overall the clash between Mallory and Miller adds enormously to the film's tension, thanks in no small part to the excellent performances of Gregory Peck and David Niven.<br><br>The sets and props of the film are superb, and overcome the comparative cheesiness of some of the special effects.","user":"stp43","rank":[14,14]},{"title":"Outstanding war drama","rating":8,"date":"2 April 2003","review":"Being a big Gregory Peck fan, I was expecting great things from The Guns of Navarone, and in one of those rare instances, I was not disappointed. Mr. Peck, David Niven, Anthony Quinn et al. are in top form, each of them bringing their respective characters to life and the story likewise. The action scenes are impressive even by today's standards but in my opinion they are only a secondary pleasure. The main pleasure is watching the divergent and forceful personalities cooperate, conflict, confound and finally triumph. Suspense is maintained throughout. I also liked the way complex moral issues were addressed. Another bonus is the portrayal of the Germans. Here they are not all depicted as impersonal inhuman cruel monsters. The full mosaic of human personalities is shown on their side too. But don't get me wrong, they are still a formidable enemy who keep the outcome in doubt. Strongly recommended, 8/10.","user":"perfectbond","rank":[60,71]}]