[{"title":"\"Well she used to be a good milker, but now.. she's an udder failure\"","rating":7,"date":"1 October 2009","review":"Fun and Fancy Free is for me one of Disney's lesser efforts, but is still very charming, simple and enjoyable. I did think the live action sequences were dated though, and the film is quite short. Out of all the characters, the only character I didn't care for that much was the puppet. Apart from the hilarious \"well she used to be a good milker, but now... she is an udder failure\" he didn't really make an impact on me. Maybe it was because the ventriloquism was rather substandard.<br><br>However, I really enjoyed this on the whole. The introduction with Jiminy Cricket- voiced by the one and only Cliff Edwards- in the library was very effective, as was a vast majority of the script. The animation is stunning, and by far the best aspect of the movie, and I hope I am not the only person who found the songs beautiful and memorable, my favourite being \"My what a happy day\".<br><br>There are two mini-classics here, Bongo and Mickey and the Beanstalk. Both are wonderful gems, but I will admit I do prefer the latter. Bongo tells the rather simple story of the adorable Bongo and his endeavour into a world he has never known before, after being the star attraction of a circus. It is very sweet and well meaning, and the narration isn't so bad either. Mickey and the Beanstalk is a favourite of mine. Wonderful voice acting, terrific animation especially for the beanstalk and nice music made this memorable for me.<br><br>Other things that impressed were one Jiminy Cricket of course, well how can he not impress, he is a classic character in the history of animation? Two, I thought Edgar Bergen was very entertaining in this film asides from the ventriloquism, and also child actress Luana Patten was impressive.<br><br>All in all, one of Disney's lesser efforts, but has undeniable charm due to the animated segments and Cricket himself. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[14,15]},{"title":"tiny treasure","rating":7,"date":"25 January 1999","review":"This is a good combination of two animated stories/shorts: Bongo and Micky and the Beanstalk.  while watching a mixture of stories and a mixture of animation and live action was a little awkward, Jiminy Cricket held it together.  This film's latest release on video gives everyone the opportunity to see this tiny treasure for the first time.  While, it doesn't rank up with the Best of Disney's animation, it is still worth seeing, if nothing else for Walt Disney's last film as the voice of Mickey.","user":"ryangilmer007","rank":[12,14]},{"title":"This movie made me \"Fun and Fancy Free!\"","rating":10,"date":"30 July 2006","review":"The duo of Disney and RKO continue the magic onto 1947 with this flick, \"Fun and Fancy Free.\" In it are a couple of wonderful and terrific stories: \"Bongo,\" and \"Mickey and the Beanstalk.\" Again, this movie has everything that you would expect in a Disney classic. Also, look out for more great Disney friends, like Jiminy Cricket!!!!!<br><br>One interesting fact: did you know that Walt Disney, the man who created Mickey, was the voice of Mickey Mouse? In \"Mickey and the Beanstalk,\" Walt Disney himself voiced as Mickey Mouse, and that would end up being his last cartoon to do so.<br><br>So, this shows that movies like this just aren't made anymore. (sniff) But still, watch this movie with your children, enjoy it, and have a whole lot of fun with \"Fun and Fancy Free!!!!!\" 10 out of 10 stars.","user":"sethn172","rank":[16,20]}]