[{"title":"A Little Gem","rating":8,"date":"29 November 2005","review":"This film is a little gem. A very good quirky understated drama. The story is well-developed, reasonably believable, and directed quite nicely. The story is set in a New York neighborhood in the time period of early 60s - both aspects are portrayed well in the film - realistic and believable but not so hammed up as to come across as phony. The acting is superb. Tarturro is great - plays the part of a local psycho bully very well - quite edgy and frightening but not over-the-top. Both Jodie Foster and Tim Robbins also do really well in this movie and is probably the best of that time period (the 80s) for either actor. Would recommend the movie for anyone looking for a good drama or for a movie with some social commentary that does not overwhelm the story.","user":"johnphilo1","rank":[11,11]},{"title":"Terrific Tim Robbins performance almost saves it...","rating":6,"date":"21 May 2001","review":"Offbeat--to say the least--comedy-drama from director Tony Bill and writer/co-producer John Patrick Shanley combines unforced, unshowy nostalgia with dark (and rather wobbly) comedic undertones. In a troubled Bronx neighborhood in the 1960s, Jodie Foster is a young woman hounded by just-released convict John Turturro, while Tim Robbins is a former classmate reevaluating his priorities based on turbulent world events. Foster has little to work with in a weakly-written role (she's not going to meet this nutcase in the park at night!), but Robbins' quiet sincerity is lovely, and his handsome face and expressive manner keeps the film grounded in reality. Overall, it's much too flighty, with a melodramatic final 30 minutes which doesn't do anything good for anybody--least of all the viewer. However, there is some dryly eccentric humor in Shanley's screenplay, and when director Bill's touch is light the film generally works. **1/2 from ****","user":"moonspinner55","rank":[19,23]},{"title":"Excellent drama","rating":10,"date":"30 July 2002","review":"Set in 1964 Bronx, the film starts off great with the Beatles \"In My Life\" and just keeps getting better.<br><br>A psycho Heinz (John Turturro) is released from prison and goes after the woman Linda (Jodie Foster) who put him there.  Harry (Tim Robbins) and James (Todd Graff) try to protect her.  Then there's the man that \"sells\" his girlfriend and her friend to two guys.  And there's people being shot with arrows...<br><br>This got some noteriety in it's 1988 release because its writer, John Patrick Shanley, had just won the Oscar for \"Moonstruck\".  But this film disappeared without a trace after that.  That's a shame because it's a fantastic movie.<br><br>The script is sharp and believable with three-dimensional characters and ALL the performances are great.  Direction by Tony Bill is perfect...he gets a real feel for the era and captures it on screen.  It's also interesting to see Tim Robbins before he hit it big.  Engrossing from beginning to end...a must see!<br><br>There's so many great lines in this movie!  But a particular standout is \"Someone murdered our teacher, so we have the day off.  Want to go for a ride?\"","user":"preppy-3","rank":[20,25]}]