[{"title":"Do not go gently...","rating":11,"date":"11 July 2003","review":"'Into the Night' stands as one of my favourite films of the '80's. In fact it stands as one of my most favourite films ever. Why? To be quite honest, I'm not sure why. It wasn't the best concept or script, the performances are okay -(with the exception of Goldblum who is outstanding)- and even John Landis' direction was at times on cruise control.<br><br>But what it did in 1985, was to reflect so much of what was going on. The ruthless drive for efficiency that makes Okin's aerospace company so demanding, the 'me' approach to relationships that results in Ed's wife's adulterous behaviour, the worship of fortune that dominates Diana's life and drives her so relentlessly - until Ed brings her something a little more worthwhile.<br><br>It had the right look, the right feel and the right cast to make you smile and go along with the goodtimes and the in-jokes between peers of the movie establishment. Here was a collection of successful players in Hollywood showing just how slick movie-making could be.<br><br>The screenings must have had the feel of a home movie with most of the cast sitting in the theatre enjoying their various cameos. Bowie, Cronenberg, Kasden and of course Landis himself, all doing it for their own.<br><br>I loved it when I first saw it and I'll be buying the DVD in Sept '03 when it finally appears. Is 'Into the Night' a great film? Probably not, but it makes me feel great everytime I take that ride to LAX in the little white Fiat...You had to be there.","user":"Kim2309","rank":[39,46]},{"title":"LOTS of fun, LOTS of directors in the cast, plus...","rating":10,"date":"23 July 1999","review":"This movie is a lighthearted romp!  It is filled with laughs, some brilliant physical humor (who knew John Landis was a comic-action actor?), sudden surprises and a phenomenal cast.<br><br>And, as a little teaser to make you rent the theatrical version, Michelle Pfeiffer's only known nude scene!  TSK, TSK, where she hid those gems!<br><br>Jeff Goldblum gives a deadpan performance that is perfect.  It fits this movie, it fits his style, and at times it is just hilarious.  Probably his best role ever.<br><br>The amazingly diverse cast includes Dan Aykroyd, David Bowie, Jim Henson, Paul Bartel, Carl Perkins, Bruce McGill (as Elvis!), Irene Papas, Vera Miles, Richard Farnsworth, Kathryn Harrold, Jake Steinfeld (Body By Jake) and even Clu Gulager!  WOW!<br><br>But there's added richness for the film buff.  Landis cast no fewer than 15 Hollywood directors in this film, plus himself! You can spot Lawrence Kasdan, Jonathan Demme, Paul Mazurski, Amy Heckerling, David Cronenberg, Roger Vadim, Jonathan Lynn, Jack Arnold, Don Siegel, Andrew Marton, Richard Franklin, Colin Higgins, Jonathan Kaufer and Carl Gottlieb.<br><br>Director Daniel Petrie even plays the director of a film-within-the-film, with the assistant director of this film, David Sosna, playing the assistant director of that film.  There are cinematographers, writers and make-up artists, too, including Rick Baker, the first make-up artist ever to win an Oscar for his craft.<br><br>Too few people know about this sleeper.  It's fast paced, funny and beautifully filmed.  Rent it.  You'll love it.","user":"SquirePM","rank":[72,90]},{"title":"One of my all time favorites!","rating":10,"date":"9 April 2004","review":"Somehow everything clicked in this film for me, and I just love it.  I've mainly seen it quite a few times on TV, but also have rented it and prefer the uncensored version. (After all, Michelle Pfeiffer nude scenes are pretty rare!)  I've read that this was a vehicle for numerous friends of the producers to appear in quick \"cameos\" (a la Hitchcock, not playing themselves and mostly just background), and I'm still trying to find where Steven Spielberg appears.  But overall, it is just the perfect blend of mystery, adventure, comedy &amp; tragedy, and satisfying ending, and all are right on. OK, it's no major classic, just some lightweight fun, but after almost 20 years (I'm writing this in 2004) I recall few other films that for me match this one for \"Oh, that was a cool flick; I think I'll watch it again.\"  If you missed this I highly recommend it, without reservation.","user":"rcl-wa","rank":[56,72]}]