[{"title":"A good, well-paced classic whodunnit","rating":7,"date":"19 August 1999","review":"This movie was the first and best of Peter Ustinov's performances as Hercule Poirot.  Though physically not very accurate to Agatha Christie's description of the little Belgian detective, for this one movie everything worked and the discrepancy was not a problem.  The film is well-paced, with all the plot turns and clues coming with perfect timing, not too fast to be confusing, but not too slow to strain the rather flimsy fabric of the story. The whole cast is very good, especially Bette Davis as a malevolent old spider of a woman, gleefully tormenting her long-suffering companion, Maggie Smith. The scene where she smiles indulgently at a group of Egyptian children waving at her on the river bank, only to sink into mortified disgust as they turn around and moon her, is a highlight of the movie.  The climax of the film is quite surprising, and unlike many mysteries, does not cheat the viewer by withholding vital information until the last moment.  We feel the pleasure of being honestly fooled throughout, and the conclusion is thoroughly satisfying.","user":"Rosabel","rank":[53,57]},{"title":"A Top Notch Bunch Of Pros","rating":7,"date":"14 September 2007","review":"Jack Cardiff was the director of photography, Anthony Powell, the costume designer, Nino Rota composed the score, Anthony Shaffer signed the screenplay and the list goes on and on and I haven't even mention the cast yet. Agatha Christie's novels have a structure that is a sort of cardinal rule. Murders, a set of suspects, all of them with a motive for the killing and then the unmasking of the killer or killers. Anthony Shaffer, the author of \"Sleuth\" milks it for all its worth. Snippets of wit trying not to obstruct the implausible plot. Tough gig. Dressed in a fantastic Nino Rota score, Jack Cardiff does his marvelous thing and Anthony Powell envelopes the stars in costumes that are not only stunning but character revealing in the most entertaining way. Peter Ustinov's Poirot is great fun and the cast moves through the carefully plotted story with disarming precision. Mia Farrow is the only one who plays it for real. Her jealousy is so believable that in a way we're guided by her pain and dismiss the obvious. Bette Davis does a Bette Davis impersonation for our benefit, I guess, and she gets away with it. Maggie Smith, Davis's long suffering lady in waiting, is always fun to watch and I imagine she had a lot of fun herself pushing around Bette Davis. My favorite? Angela Lansbury's Salome Ottobourne. Her alcoholic pulp fiction writer is a complex, compassionate, realistic caricature. David Niven,Jack Warden, Jon Finch, Olivia Houssey, Lois Chiles, Jane Birkin etc complete the who's who of this whodunit. I haven't mention the director: John Guillermin, from \"The Towering Inferno\" fame.","user":"littlemartinarocena","rank":[35,37]},{"title":"A Great Adaption!","rating":8,"date":"23 May 2005","review":"I watched this film when it was broadcast on channel four last Christmas and I was so blown away by it that I had to buy the movie on DVD. Coming from a true fan of murder mystery TV shows with my all-time favourite series being Midsomer Murders, I can tell you this has to be one of the best detective dramas ever to be adapted from one of Agatha Christie's novels. Peter Ustinov gives a wonderful performance as Christie's world famous Belgian detective Hercule Poirot, who along with his sidekick has to solve three violent shootings on a luxury cruise ship sailing off the coast of Egypt. The story is full of red herrings, great and really well acted characters and lots of fantastic humour. It is also very gripping with a crime that is forever tricky to work out and a truly unpredictable killer gives the film a perfect ending. I would suggest to all fans of classic British Murder Myestries to see this 1970's Agatha Christie tale but you will have to be prepared to be blown away by it. I overall give Death on the Nile 8/10 stars.<br><br>ONE OF THE BEST DETECTIVE STORIES EVER WRITTEN!","user":"r-downey1","rank":[28,30]}]