[{"title":"When You're DEAD, It's ALL OVER; but When You're LOVED, It's FOREVER !","rating":8,"date":"25 September 2008","review":"The imaginative but well-conceived idea of dishing up a romance upon lovers communicating spiritually owing to one of them is dead, was first filmed by Steven Spielberg 8 months before the Ghost's silver screen release. Spielberg's movie Always(1989) had classy use of visuals fulfilling the needs of viewers with mystery-based expectations. Yet, Always lacked the sense of essential romance concept, despite having the same plot and even the same storyline in Ghost. Originally the idea has been created by Chandler Sprague and David Boehm.<br><br>However, Ghost accomplished of what \"Always\" tried and failed to accomplish. Thanks to the great acting trio of Patrick Swayze + Demi Moore + Whoopi Goldberg, for together they registered indelible moments into Ghost. It is scraped in our memory how in time Molly and Sam happen to keep their thoughts off each others' feelings, and that taught us: \"Love begins with emotions, ends with thoughts\". On this account they never called off their faith on believing that they will keep an enduring love affair. These indelible scenes in Ghost are conceptually cut where the editing was so impressive that instead of trying to make the story more plausible, it empowered the devotion of lovers onto their relation. The scene which Sam's ghost drew upon Oda Mae's body to break the longing with Molly by kissing her is an imperishable cinematic instant. <br><br>I was in love with someone, and it was February,2005; we were both watching the Ghost on TV, both talking on the phone. Then that scene came upon(Sam's ghost kissing Molly in Oda Mae's body), I felt lost deep in my heart seeking the girl I'm talking on the phone. I heard she was crying and sobbing, and keep saying to me: \"I will never forget the first time you kissed me and I don't need to be alive to recall this\" Ghost is one timeless romantic masterpiece that had its moments. For me the kissing scene was the best kiss in movies of all time. MTV had honoured this kiss as well, several years after the release of the movie, as the best kiss in '90s. Superimposing that, the scenes where Oda Mae Brown convinces Molly that Sam's ghost is around her and then Molly reasons with police that Oda Mae knows what nobody is able to know but Sam and herself only, are the scenes that deliver the magic beyond eyes and beyond ears.<br><br>To watch Ghost is in the to do list of what to do when you're on a date.","user":"CihanVercan","rank":[76,89]},{"title":"Ghost...........Classic!","rating":22,"date":"22 March 2006","review":"After so many years, every time when I see this movie again, it always makes my eyes water! This is basically a simple story. However, the script writer by Bruce Joel Rubin and the director by Jerry Zucker are intelligent. They made the simple story a touching, interesting one. I think most people cried at the end of the movie. This reminded me another commercial successful movie \"Titanic\" in the year 1997. The music (composed by Maurice Jarre) was so moving. Patrick Swayze and Demi Moore played well, not to mention Whoopi Goldberg. Her performance was amazing!(she also had excellent acting in Spielberg's early masterpiece \"The Color Purple\") The visual effects by ILM was extraordinary in that time. By and large, this touching movie is not only a huge commercial success, but also a classic!","user":"cwei-1","rank":[49,57]},{"title":"Agreeable and fascinating love story","rating":7,"date":"28 September 2004","review":"The motion picture concerns upon the starring's killing (Patrick Swayze) who returns from beyond to save his lover (Demi Moore) harassed by a devious killer . He's helped by a likable psychic (Woopy Goldberg) .<br><br>In the film there are a wonderful love story , humor , tearjerker , suspense , action and a little bit of horror.<br><br>Runtime film is appropriate , isn't slow-moving but adjusted and the movie is very entertaining.<br><br>Woopy Goldberg's interpretation is fantastic and humorous , she was Oscar winner to the category for supporting cast , a very well deserved prize .<br><br>The lover couple , Demi Moore and Patrick Swayze , are riveting but overblown sweets.<br><br>Maurice Jarre musical score is fascinating but principal song is copied from Alex North's theme.<br><br>Direction by Jerry Zucker is first class , better than his previous films like ¨Airplane¨ , ¨Top secret¨ or ¨Ruthless people¨.<br><br>The movie will appeal to fantasy buffs and love stories fans.<br><br>Rating: 6,5/10 . Good and well worth watching.","user":"ma-cortes","rank":[17,18]}]