[{"title":"Scenes of Amiro, The Runner, by Amir Naderi","rating":9,"date":"21 July 2007","review":"Without family or a home to shelter him, nine year old Amiro (played by Majid Niroomand) is an iconic character against the changing landscape of the Southern Iran, which has become new ground for military and foreign interest. <br><br>Through Amiro's eyes , Naderi depicts scenes of the poverty in the junk yards as the poor fight over trash, the abuse of women being led like animals behind their husbands, or the demoralization of a man who steals from Amiro by not paying for a glass of ice water. The old Iran is crumbling, while Amiro, the child hero, rejects all of it as he \"runs\" metaphorically to survive. <br><br>Naderi photographs Amiro like Tom Sawyer on his journey down The Mississippi, a child joining the changing society of the Persian Gulf. Amiro intuitively knows the oil ships, the planes and the trains are the new Iran and he shouts emphatically \"take me along!\". <br><br>Naderi seemly stacks scenes of the boy feeding himself, washing his own clothes, and building a business as a shoeshine boy for the foreigners and navel officers. He gives the boy very little but his own guts, self-reliance and determination, which help him find a way to fit in among the foreigners. He wants to be included, he wants to go where the planes go, the boats go, the trains go. He cries into the waves his own language. He wants to prove that he is worthy of this new world. <br><br>The final scene is a slow motion tribute to Amiro's determination and survival. He races in a competition against the other boys for the block of ice near the oil fields. The telephoto lens captures Amiro's joy against the violent flames of the fires burning off the gases of the oil wells. Through this lens, Amiro survives and shares his joy of winning the race with the other boys like him. <br><br>The Runner is a symbolic and hopeful look at what Iran has become, a place where orphans like Amiro are able to make their own way to prove their worthiness, loyalty, intelligence, and strength.","user":"clevelandrachel","rank":[14,14]},{"title":"Excellent.","rating":10,"date":"17 March 1999","review":"The Runner was perhaps the first of the post-revolution Iranian films to attract worldwide attention, ... and very deservedly so. It set the tone for many of the films which followed: realism, child's eye perspective of the world, innocence, gentleness, set in poor neighbourhoods, exposing great disparities in wealth, resting much of the film on the shoulders of one young actor, using children's lives as analogies for (or explicit expositions of) the problems of the adult world.<br><br>Majid Niroumand (Amiro) carries the film and is mesmerizing to watch. Amir Naderi was a famous director in pre-revolution Iran and was best known, if I'm not mistaken, for Tangseer (Tangsir). I've heard that this was the first in, what has been referred to as, \"the Amiro trilogy\". I would be very interested in finding out about the other two films.<br><br>This film still remains as my personal favourite.","user":"a_bahar","rank":[9,10]},{"title":"The intensity and humanism of Truffaut's \"400 Blows\", but Iranian","rating":9,"date":"9 January 2006","review":"What if Francois Truffaut had made \"400 Blows\" in Iran? Well, he'd probably have ended up with something like Amir Naderi's masterpiece, \"Runner\". I love movies about children forced to face the world of adults such as \"Muddy River\" \"Spirit of the Beehive\", \"My Life As A Dog\", \"Pixote\" and \"Forbidden Games\". Please add \"Runner\" to this list because it is extraordinary. A young boy, who has lost his parents, survives by shining shoes and carrying giant ice blocks through the scorching sun to men working on the waterfront. It is painful to see the boy, quite literally, running for his life as the ice he's cradling threatens to melt before he can reach his destination. The boy is totally believable and his situation is dire. He still finds time to squeeze a drop of enjoyment from his difficult life, though, and there is a stunning sequence where the boy and his friends race to the horizon where flaming oil fires incinerate the sky. Every shot is compelling, every frame an emotion-laden snapshot of rich reality. What a marvelous adventure this film is, an adventure that is also magnificent film-making with not an ounce of fat.","user":"fertilecelluloid","rank":[4,4]}]