[{"title":"As important move about the American spirit as there is","rating":10,"date":"14 April 2002","review":"This movie was obviously made as a labor of love, by someone whose ideals are deeply American. Director Sayles masterfully documents the nuances of the ageless conflict between those that would control others for profit and those that would not let themselves be controlled and thereby captures the essence of a battle that still rages between the American ideals of freedom and free enterprise.<br><br>Historically, the film documents a victory (some say massacre) by the miners over the power brokers and thugs of the early 20th century coal mining industry. Taken in the overall context of the history of Appalachian coal mining, however, what it truly documents is one battle in a war that was eventually lost when the government once again came down on the side of commerce as opposed to human dignity at the battle of Blair Mountain.<br><br>Fortunately for us, Mr. Sayles seems all too keenly aware of the tremendously important under-currents of this historical event. Rather than merely documenting the conflict and violence of this historic event, he artfully imbues the story with human elements of betrayal, regret, loss, resolve, and ultimately, sacrifice in the name of what is right and just. He reminds us that righteousness often comes with a price and that the real war is never won or lost but rages on forever, claiming the salvation and damnation of souls in it's wake.<br><br>This film is a masterpiece and deserves its due. It represents everything good about film-making and should hold a special place in the hearts of all free Americans aspiring to the ideals expressed in our constitution.","user":"TheBlueWolf","rank":[67,69]},{"title":"An American Masterpiece","rating":10,"date":"24 June 2002","review":"John Sayles is a national treasure! Ferociously independent --most of his films are made with privately organized funds-- and working with what has become a repertory company --most of his actors return to work with him for less than they would get elsewhere-- he has never made an uninteresting film. Even when his films may vary in overall quality, from merely good to great, they are each interesting and arresting.<br><br>My mother was an organizer in the southwest coal counties of West Virginia, arriving there in 1926 (having left college), near the end of the coal wars. Her only comment on the film, when I screened it for her before she died in 1988,was that the working conditions and the living conditions of the miners and their families were far worse than depicted in the film. She always spoke at union meetings surrounded by a body guard of 10-20 armed miners. A number of her young colleagues were assassinated (there's no other appropriate word for how they died). <br><br>The murder of Sid Hatfield, the town sheriff of Matewan, in the year following the year portrayed in the film, in broad daylight on the McDowell County courthouse steps precipitated the largest insurrection in the U.S. since the Civil War. More than 10,000 armed miners from the six coal counties, descended on the court house looking for the private detectives and law \"enforcement\" officers who were the assassins. They took over the court house and the town, and threatened open insurrection. Thew film is a great film. Unfortunately, like most of John Sayles's films, it did not play to a large audience.","user":"rrenon","rank":[53,55]},{"title":"An overlooked masterpiece","rating":10,"date":"4 March 1999","review":"Looking back to 1987 I have to wonder why this masterpiece was not nominated for Best Picture.  But then again, this is the same institution that voted for films such as Braveheart and Forrest Gump. Is the Academy afraid of John Sayles?<br><br>See Matewan for its wonderful portrayal of the events that occurred in West Virginia in the 1920's. See this film for its phenomenal cast.  See it for its beautiful cinematography.  There is an ethereal glow that envelopes the characters and buildings of Matewan.<br><br>There is also an underlying allegorical depiction of Christ and his followers.  Chris Cooper is a saint.  He reminds me of Gary Cooper a little bit.  He has such an unusual handsome face.  He is the protagonist joined by James  Earl Jones, Mary Mcdonnell, and Will Oldman.  Perhaps the most fascinating character is that of the Sheriff portrayed by Strathairn.  He is the angel on the black horse who carries with him the wrath of God.  Just watch him stand up against the bad guys.<br><br>The main antagonistic characters are pure evil.  They terrorize the inhabitants of Matewan with juvenile antics.<br><br>Please see this film and be prepared to have it imbedded in your mind for the rest of your life.  This is what great film making is about","user":"vic-45","rank":[49,53]}]