[{"title":"Superb psychological thriller with a brilliant Connery performance.","rating":10,"date":"10 February 1999","review":"This is a superb psychological thriller with a brilliant lead performance from Sean Connery.<br><br>Connery plays a police detective nearing burn-out, the fuse for which is provided by a child molester on the loose.  When a suspect (Ian Bannen) is arrested, the detective takes it upon himself to interrogate the man -- and ends up beating him to death.  From there, the film examines what drove the detective to do it, through individual scenes with his wife (Vivien Merchant) and the internal affairs officer investigating the beating (Trevor Howard).  The final third of the film takes us step by step through the interrogation, as Bannen turns the psychological tables on Connery, making the detective see exactly the sort of animal that he has become as a result of twenty years of dealing unrelentingly with violence and death.<br><br>John Hopkins' screenplay plays very much like a stage play (it was adapted from Hopkins' play \"This Story of Yours\"), but in this case it works to the film's advantage as Connery's life is compartmentalized (by virtue of the scene structure) in a way that makes his personal life seem completely walled-off from his job, and his job completely walled off from the interrogation.  As a result, his character's inability to deal with anything but his job (and consequently, even that) gives us marvelous clues as to why he does what he does.  Sidney Lumet's direction -- his third venture with Connery (previously the two worked on two of Connery's best films: \"The Hill\" (1965) and \"The Anderson Tapes\" (1971)) -- utilizes the stagy conventions well to advance the story and to enhance the performances.<br><br>As for the performances, these are uniformly excellent.  Connery has never been better, playing a character who is anything but invulnerable, instead being a bundle of nerves and frustrations which explode into violence at crucial moments.  Bannen is every bit his match as a complex, manipulative character who is at the same time sympathetic (as Connery's victim) and repulsive (for the sadistic delight he takes in pushing Connery's buttons). Indeed, one of the strengths of the story is that it is never revealed whether Bannen did in fact molest the children in question -- by doing so, the film makes us understand that this is not the issue.  Instead, the film is more about internal demons -- how we all have them, and how we can either control or be controlled by them.<br><br>Howard is solid in what is perhaps the least interesting role in the film, but Merchant is phenomenal as Connery's plain wife, who has withstood his emotional abuse and neglect for years, sometimes in silence, sometimes not, but always with dignity.  In perhaps one of the most poignant moments in the film, Connery, half-drunk, looks up at her, and asks in wonderment, \"Weren't you ever pretty?\"  Merchant's lines following that are less important for their text, than for her reading of them -- wounded, but still confronting her husband like a prize fighter who's determined not be knocked out by a cheap shot in the fifteenth round.<br><br>Perhaps the greatest tragedy of this film is that it is practically unknown in the United States, and that it did not air in enough American theaters to qualify for the Oscars.  Otherwise, it would quite likely have resulted in Oscar nominations for Connery (in an otherwise weak year for the Best Actor category, the only comparable performance nominated was Al Pacino's in \"Serpico\"), Bannen, and Merchant, not to mention Hopkins and possibly Lumet. All the same, definitely a film worth seeing if you're tired of watching detective films where Bruce Willis or Mel Gibson blow away half of Los Angeles.<br><br>Rating: ****","user":"tully-2","rank":[63,67]},{"title":"Connery's Best Performance","rating":19,"date":"19 October 2004","review":"The Offence is Sean Connery's best performance in a major motion picture, the problem though is that the film bombed and was rarely seen in the cinema, probably due to the material content of this very dark and dramatically compelling story.<br><br>Connery plays Sargeant Johnson, a twenty year veteran hard boiled detective who is investigating the disappearance of a schoolgirl, snatched by a serial child molester that the local police have been trying to capture for some time.<br><br>The schoolgirl is later found by Johnson in the woods, while out on a search patrol with uniformed officers, there's nothing brutal or gory about him finding her but she is caked in mud and her shirt is torn, suggesting rape, which is brutally harrowing in itself.<br><br>The way Johnson tracks the victim in the woods depicts his knack for (thinking)? the way the mysterious molester would, partly hinting that policeman and criminal have the same instincts.<br><br>The best scenes in the film are the interrogation between Johnson and Kenneth Baxter, brilliantly played by the late Ian Bannen.<br><br>Baxter is brought in as a suspect, having been found wandering around the town at the dead of night in a daze, covered in mud with scratches on his face, the film cleverly has Johnson start off the interrogation tough and cunning, cutting between other police characters duties in other parts of the station, then going back to the interrogation where Johnson brutally beats Baxter to death in a rage.<br><br>After a brilliant enquiry scene between Connery's character and Trevor Howard's superintendent Cartwright, we go back to the Interrogation between Johnson and Baxter, and realise that we were seeing only snippets of that conversation halfway through the film, we discover to our shock that Johnson's mentality and state of mind are as fragile and twisted as Baxter's, a result of twenty years of murders, rapes, robberies, suicides, vehicle road accidents and cases likes this, turning it in his mind again and again until it becomes a blur, and finds HE is just as capable of murder and inhuman behaviour as the suspect he is interrogating.<br><br>Grim and compelling, this is one of the darkest and disturbing films your ever likely to see, and anyone who says that Sean Connery can't act, then they should see this film immediately.<br><br>An underrated classic.","user":"CalDexter","rank":[36,39]},{"title":"Grim but rewarding character study with a great Connery performance.","rating":8,"date":"8 November 2001","review":"Arguably the best of Sidney Lumet's British films, this one benefits from a brilliant script by John Hopkins and a tour-de-force performance by Sean Connery as a cop who's been pushed too far. The interrogation scenes between him and an excellent Ian Bannen, as the prime suspect in a child molestation case, are riveting. Hopkins' dialogue is uncannily subtle in its gradual illumination of the psychological states of its two antagonists. Vivien Merchant is exceptional as Connery's emotionally-drained spouse. Gerry Fisher's cold, muted photography perfectly captures the sterility and bleakness of post-modern England. This is not a fun film, but its truths about the fragility of the human psyche are eloquently conveyed.","user":"jckruize","rank":[29,31]}]