[{"title":"Realistic enough to be truly frightening","rating":8,"date":"26 August 2001","review":"Unlike many horror movies where you need to check your credulity at the door, what you see in this film is actually believable. The idea of military scientists finding a catalyst which induces rage in the human mind, then mating it with a virus as a delivery device, is a very scary idea! Imagine you could catch homicidal mania as easily as you could catch the flu.<br><br>The acting in this movie is good if somewhat uneven. Joanie (played wonderfully by Kathleen Quinlan) is a very intense character. Sam Waterston is good as her lover and the local sheriff.<br><br>The film is not slick, but has some intense moments that many \"slicker\" films can only dream of achieving. Overall a very suspenseful film.","user":"dgpowell-3","rank":[33,37]},{"title":"not bad for its time","rating":8,"date":"14 April 2006","review":"This wasn't a bad film for its time. The cast is especially good. Sam Waterston and Jeffery Demunn play very well off each other and Kathleen Quinlen is a criminally underused actress, so it is always nice to see her.<br><br>The plot line has echoes of George Romero's earlier paen to paranoia and bio warfare spills 'The Crazies'. This film also pre-figures Resident Evil and 28 Days Later but played on a much smaller scale. Watching a film shot in the mid 1980's now serves as a reminder of just how bombastic and over-the-top most current films have become.<br><br>A modest effort but entertaining nonetheless.","user":"raegan_butcher","rank":[26,29]},{"title":"An excellent, exciting and underrated 80's medical science sci-fi/horror sleeper","rating":8,"date":"20 June 2006","review":"In remote rural Utah a crisis situation transpires when a lethal experimental germ warfare virus gets loose in government Lab P-4 and causes the folks who become infected to degenerate into dangerous murderous raving lunatics led by Dr. Nielsen (robustly essayed by Richard Dysart). Gutsy, but frightened security chief Joanie (a fine and engaging performance by Kathleen Quinlan) is trapped inside with the deadly deranged crazies. It's up to Joanie's take-charge sheriff husband Cal Morse (superbly played by Sam Waterson) and bitter, boozy discredited doctor Dan Fairchild (the always great Jeffrey DeMunn) to rescue Joanie before it's too late.<br><br>Director Hal Barwood expertly crafts and maintains an intense, nerve-jangling tone throughout, keeps the pace hurtling along at a steady, speedy clip, and delivers an ample amount of shocks while relating the chillingly plausible story. Furthermore, the barbed, incisive and provocative script by Barwood and Matthew Robbins offers a pointed and trenchant critique of government arrogance and incompetence alike (the government creates the problem and proves to be totally all-thumbs when it comes to properly rectifying it). Both Craig Safan's pulse-pounding score and Dean Cundey's polished cinematography are likewise up to par. The uniformly terrific acting from a bang-up cast warrants kudos as well, with especially praiseworthy work from Yaphet Kotto as ineffectual fed Major Connolly and G.W. Bailey as the bumbling nice guy lab employee who serves as the inadvertent catalyst for all the trouble. The fact that the main protagonists are a bunch of smart and capable adults rather than your usual array of dumb immature kids qualifies as another substantial plus; it's a nice and refreshing departure from the standard teen-oriented horror fare prevalent in the 80's. An intelligent, absorbing and above all quite suspenseful little sleeper that's well worth checking out.","user":"Woodyanders","rank":[21,25]}]