[{"title":"Love those Amish...","rating":7,"date":"8 June 2005","review":"Everyone may know William Friedkin for \"The French Connection\" and \"The Exorcist\", but this gem from before his heyday will always come to my mind. During the movie's first few minutes, you're not exactly sure where it's going, but then we meet Rachel Schpitendavel (Britt Ekland), an Amish woman who has just arrived in 1920's New York City. Not quite sure where to go in this bustling metropolis, she goes to Billy Minsky's Burlesque House. Of course, she doesn't know that burlesque involves some stuff that is perpetually anathema to the Amish lifestyle. But performer Raymond Paine (Jason Robards Jr) sees some real potential in her. Meanwhile, there are two forces at work against Rachel's potential success: her father has arrived in town to take her back to the farm, and the police are seeking to shut down the burlesque house.<br><br>Overall, \"The Night They Raided Minsky's\" is one of those nostalgia pieces that always has something coming. Interestingly, it was also a debut and farewell: Elliott Gould made his film debut playing Billy Minsky, and Bert \"Cowardly Lion\" Lahr plays a role too (he actually died while they were filming). Maybe this movie's not a masterpiece, but it's truly got something for everyone. Cool.","user":"lee_eisenberg","rank":[27,27]},{"title":"Lost Classic","rating":3,"date":"3 July 2004","review":"And I mean that most sincerely, this is one of the great films of the 1960s, charting the last days of the burlesque music-hall theatricals in America. The plot of the film is something of a mish-mash, mixing up Britt Ekland as an Amish runaway who finds herself onstage, with Denholm Elliot as a moralistic do-gooder trying to close down Minsky's theatre, but in truth, as with a large number of films of the period (see also The Pink Panther films), the plot is merely a convenience, a washing line upon which to hang a large number of characters, theatrical set-pieces and little illustrations of life in and around the theatrical world. A host of fine actors grace the screen, with Elliot Gould making an early appearance as Minsky jr, Harry Andrews as Ekland's glowering father, Joseph Wiseman as Minsky sr and most affectingly, Bert Lahr in his final screen performance. Even Ekland is OK, and it takes a lot to say that. But at the centre of it all are Jason Robards and Norman Wisdom as the theatre's chief comedy double-act. An odd pairing that works amazingly well, with Robards an effectively sleezy straight man (his seduction of Ekland is both funny and stomach churning). But if Robards is good, Wisdsom is fantastic, his comedic skills honed in England finally being given full rein (I enjoy a lot of his British films, but few of them really allow him full use of his abilities), and the song and dance routine and when he defines burlesque to Ekland rank as his finest on-screen moments. it's a bitter shame that the failure of this film and personal circumstances forced him to leave Hollywood, because with the right material he could have gone so much further. Truth is, if you have no sympathy for this sort of material, this will not change your mind. But for an utterly unique film, packed with beautiful little minutiae of theatrical life and a great mix of dark humour and bawdy comedy, this is really something to be cherished.","user":"doctor-49","rank":[35,36]},{"title":"A delightful and memorable nostalgic comedy","rating":10,"date":"2 February 2001","review":"This film succeeds in both areas, comedy and nostalgia.  It captures the period it portrays in wonderful fashion, with a very enthusiastic cast.  I consider it one of the best cast movies I've ever seen, from the lead actors to the bit roles.  Many classic burlesque routines are included, some of them done on the burlesque stage and some worked into the movie's dialogue. If you're in the mood for a comedy with a bit of feeling for another period in abundance, you can't do much better than this!","user":"gary-109","rank":[21,22]}]