[{"title":"Contradicts the spirit of the original","rating":4,"date":"27 September 2006","review":"The original Cocoon was touching, sweet, optimistic, and heartfelt. Most of the wonderful ensemble cast reunited for this sequel, but sadly, something went awry.<br><br>You learn nothing about what they've seen during five years spent with the aliens . Further, it seems like everything the characters accomplished the first time around was repealed in this story. Their desire to join the aliens in the first place was predicated on a variety of factors, but each of those reasons is dissected and trashed this time out. Suddenly, there is conflict and suffering during a brief one-week visit. Characters get sick, everyone argues, nobody seems happy. As if that isn't bad enough, a tragic suicide attempt is played almost like a joke. Since when is suicide funny? Steve Guttenberg's character was integral to the first movie, but now he's just written as a clownish buffoon. The grandson's teen angst is annoying.<br><br>There are a few notable moments, however. One scene between Jessica Tandy and Hume Cronyn is deeply touching. The plight of a captured alien being studied is properly sympathetic. But scenes like these are intermingled with a menagerie of subplots which dart around between serious and comedic.<br><br>This sequel wanders too far afield from the spirit of its predecessor. The result is gloomy and disappointing. See the original, instead.","user":"MartianOctocretr5","rank":[32,43]},{"title":"Never as good, but something here","rating":4,"date":"13 September 2007","review":"Completely lacking in originality, and even more in unpredictability, \"The Return\" gives one the feeling of 'déjà vu', as director Petrie sticks with the identical formula in order to guarantee success. This unfortunately also guarantees that we will get no inspiration from this sequel.<br><br>Yet in this light it is well filmed, with each character returning to fill us with the same emotions as the first \"Cocoon\" film. Stars Don Ameche, Wilford Brimley, Hume Cronyn, Jessica Tandy and Steve Gutenberg all return among others. James Horner's music is also back to enhance the mood. Never as good as the first, but never mind.<br><br>Sunday, May 24, 1992 - Video","user":"gcd70","rank":[13,17]},{"title":"A shadow of the original","rating":5,"date":"13 February 2003","review":"This is a sequel, and it's better than most sequels. However, most sequels don't hold up against the original film and this one's no exception. The same cast is back and the acting is certain up to par in this film, but the impact of the story isn't there. I believe this film would have done fairly well had it not been a sequel, but the magic was gone, sorta like the magic from the pool in the first film. The cast does a good acting job and they try, they really do, but this film just doesn't cut the mustard (from whence came THAT expression?) as compared to the first film. I'm sorry, because I truly liked the first film. This is overall a very good film and nicely acted, written and executed. However, as I said, the magic from the first film is just missing because we knew pretty much what to expect. It's sad that few sequels are as good as the original.","user":"grahamsj3","rank":[19,27]}]