[{"title":"The bare facts? Or a crude simplification?","rating":10,"date":"27 August 1999","review":"I saw Elephant when it was first broadcast on BBC TV in 1989.  There was a certain amount of hoo-ha about it, as the BBC had already put it back for a few months - films about the North of Ireland were, and are, touchy subjects.  Watching it is riveting.  The complete absence of story, dialogue and explanation serves to bring home the fact that, after all the talk and propaganda and fine words about freeing Ireland from the British oppressors or defending Ulster from the filthy Taigs, killing is killing - people are dying, frequently and horribly, and can there ever be a \"reason\" for it? I grew up in sheltered south Dublin and witnessed the Troubles at second-hand, filtered through the language of journalism; Elephant brought home to me, in the most visceral way, the relentless insanity of the situation.  The film should be compulsory viewing in UK and Irish schools.<br><br>The major criticism of Elephant is that it's too simple - that the lack of context and explanation aren't enough.  But the serial nature of it, muder after murder after murder, have an unforgettable power.  It's not meant to be an attempt at the overall picture; it's a cry of horror against an appalling situation.  I saw it once, ten years ago, and have never forgotten it.<br><br>It was directed by the late Alan Clarke, undoubtedly the best director of TV Britain has ever seen (maybe the best British director since Michael Powell).  He had already given early breaks to Tim Roth (in Made in Britain) and Gary Oldman (in The Firm - not the Tom Cruise vehicle, but a brutal TV movie about soccer hooliganism).  The title comes from the writer Bernard MacLaverty, who said that the Troubles were like having an elephant in your living room.  That's what it was like to watch this film.","user":"Lexo-2","rank":[35,37]},{"title":"Extraordinary","rating":10,"date":"11 May 2005","review":"I notice nobody actually from Northern Ireland seems to have commented on this... I grew up in Belfast through some of the worst of the troubles (and have been personally affected by the actions of both loyalist and republican terrorists) and I have to say that for me this film is pretty much it in a nutshell. The desensitising effect mentioned by some of the other comments is precisely what happens in real life; the fact that stuff blows up occasionally and every so often someone gets shot dead eventually starts to just become part of the scenery. I've lost count of the number of times I saw people walking through Belfast stop in their tracks for a second or two as a bomb was detonated nearby then just continue on their way. You learn to live with it, and that's the real horror, which I think is something Clarke portrays here with an extraordinary degree of empathy. Possibly some of it's because so many of the places in the film were so familiar to me but it really hit home in a way that no other film explicitly about Northern Ireland has ever done for me.","user":"Frightening_Uncle_Joe","rank":[30,32]},{"title":"Disturbing","rating":5,"date":"4 February 2005","review":"This film was made for British television in 1988, the last film by it's controversial creator Alan Clarke. There's no story here at all. Set in Northern Ireland, the film depicts a series of seemingly random killings.<br><br>It is shot entirely on location with completely unknown actors. The film is quite disturbingly realistic. There is almost no dialogue in the film and absolutely no attempt to give the film any kind of context. <br><br>The film is certainly well-made and impressive but the initial sense of shock fades before the film is over and the repeated images soon become dull, which might be the film's most disturbing aspect. In a way the use of gliding camera movements following characters either to their own deaths or to kill someone else, as well as the film's frequent use of holding on the image of the victims for some time after the killings take place can work against the involvement you might feel for this film. <br><br>It is certainly worth watching, however. The casualness of the brutality and the haunting images linger for a long time after the end credits roll","user":"RobertF87","rank":[19,23]}]