[{"title":"brilliant direction","rating":4,"date":"4 April 2004","review":"This remarkable movie reminded me of early Eisenstein for the fluid, dynamic<br><br>movement of crowds--in the streets, in the movement of soldiers and bandits across the hilly terrain, and in the scene of the Portella della Ginestre massacre. The back-and-forth narrative structure must have influenced Costa-Gavras in the making of \"Z.\" And Rosi's ability to get riveting performances from non-professionals (some of whom could not read scripts) is astonishing. The story line gets confusing, but I think that's because the situation was confusing--multiple betrayals and layers of<br><br>corruption and complicity--rather than a flaw in the script or editing. Visually exciting, too--the use of distancing overhead shots, the quiet menace of gunmen walking up a deserted, sun-baked street... memorable stuff.","user":"paulet","rank":[38,45]},{"title":"Quite Stunning","rating":30,"date":"30 April 2004","review":"Francesco Rosi's elliptical film about the notorious Sicilian gangster is quite stunning. This is not, however, a typical gangster film. This film is more about the lives of the people affected by Giuliano than about the gangster himself and this is given extra resonance by the casting of the real villagers in almost all cases. The fact that we never see Giuliano's face makes the director's intentions quite clear.<br><br>Giuliano began his professional criminal career when he was caught stealing at a young age and chased out of his village into the surrounding hills where he formed a gang and made a living from robberies and standover tactics. He became feared and respected by the locals and was eventually recruited by regional officials to help in the fight for independence from Italy. The first half of the film explores these events and manages to convey an extremely strong feeling for the time and place. The second half of the film deals with the trial of the surviving members of Giuliano's gang after his death and in doing so illuminates much of what has come before.<br><br>\nIt is remarkable how well the film holds together considering the amount of different styles and techniques that were combined in its creation. There are elements of docudrama, courtroom drama, Italian neorealism, crime story and political tract. It is also surprising how well it holds up over forty years later.","user":"n_m_mcnamara","rank":[26,30]},{"title":"Not so much a review as notes that might help the prospective viewer","rating":22,"date":"22 January 2018","review":"In order to really evaluate this film, I would have to be a knowledgeable Italian leftist. I'm not. I knew who Giuliano was, but the structure of the film still kind of threw me for a while. But I think I can say a couple things which might help the next person who is thinking of seeing it.<br><br>First: it helps a lot if you know something about Giuliano and about the political situation in Italy and in Sicily at the end of World War II before seeing the movie. Francesco Rosi made this movie a few short years after Giuliano's killing and the subsequent trials. His audience had heard a lot about Giuliano and didn't have to be given the whole backstory about him and about the last 15 years of Italian politics. The viewer today, however, particularly outside Italy, could use some of it. Check out the Wikipedia article at least.<br><br>Second: if you expect a movie about a charismatic bandit setting traps for the law, you'll be surprised, because the movie really doesn't focus on his career as a leader of a bandit gang / separatist guerrilla force at all. It starts with Giuliano's body lying in a courtyard, and officials telling reporters a story about how he died. During the first half of the film we jump back some to some incidents, and then about halfway through we leave all that behind and go forward into the investigations and trials of accused members of his band after Giuliano's death.<br><br>Furthermore, Rosi rather veils his views about Giuliano. We learn that secessionist politicians saw him as sort of a desperate hope, that the people of his town mostly liked him and that the big cheeses mostly hated him, but Rosi keeps his distance. The key incident from the point of view of the succeeding criminal trials is the massacre at Portella della Ginestra of peaceful persons attending a May Day rally. We see Giuliano's band moving out to \"shoot at some Communists\"; later, as the crowd listens to talk about getting land and education for their children, there are a couple volleys of bullets, and then a third one, from the arid distance, which cuts down a score of completely innocent people. The camera does not minimize this crime, but Rosi is vague about whether he thinks Giuliano intended this result, or that it was unintended by him or even a frame-up by other parties.<br><br>Third: while Rosi keeps Giuliano at a distance, he makes it very clear what he thinks of the Italian state. We see that their promises of amnesty to the separatists were worthless. We see carabinieri raiding a village and carting men away pretty much indiscriminately. We see that their stories about how they heroically shot Giuliano in a fire fight are lies. We see that legal procedure silences competing stories and takes the place of a true investigation of Giuliano's life and death. We hear stories of a secret alliance between the state and the Mafia. Giuliano is dead, his forces are in jail or dead or disbanded, but all these horrible people and sinister forces in and around the state apparatus are alive and the real focus of Rosi's agitation.<br><br>All this makes perfect sense to me if I try (of course with no hope of getting it exactly right) to put myself in the position of a leftist agitator (anyone who thinks I intend to belittle Rosi by thinking of the film in this way doesn't grasp how I view leftist agitation) in 1961, trying to deal with the tales and memories of Giuliano and sorting out the lessons I do and don't want people to remember. On the one hand, Giuliano took on the Italian state and was seen as a Robin Hood character. On the other hand, he was quite anti-communist even if you give him the benefit of all the doubt there is regarding Portella della Ginestra; he hung out with monarchists and wanted to get Sicily annexed by the Truman administration! <br><br>So if you are Rosi, you are not at all interested in trying to revive Giulianism or revere Giuliano. You are interested in starting with the fact that your audience maybe has fond feelings about him and understands where he came from, but in moving on from there into a present-day critique of the police, the military, and the Mafia. And for me this answers a lot of questions about why this film is organized the way it is. Rosi wants people to remember, for example, the heroic black-clad village women, trying to take on the carabinieri in a hand-to-hand fight to get their men released. There are more people in that fight than in Giuliano's whole band at its highest point.<br><br>Those are some notes that will perhaps (who knows) be useful for a non-Italian viewer trying to get into this film. As for a full review of the film, I don't claim to be competent to do it. I'm glad I got around to seeing it, though.","user":"petrelet","rank":[9,9]}]