[{"title":"BIG FAN","rating":9,"date":"30 August 2004","review":"I've been a big fan of this movie for years, ever since I was about 12. And I've watched as time and time again people have complained about this movie, and I just didn't get it. Now I'm grown up and I see the flaws, but I still don't care. I love Oliver Reed and Karen Black and don't think it could have been acted better. Watching her grow more an more attached to the house is very interesting. The best part I thought was when she surprises her son who drops a crystal bowl that smashes on the floor, and she kneels there, holding the fragments in her hands, sobbing hysterically, almost like a child had died. The boy, Lee Montgomery, I've never had a problem with. The kid from the Shining, now HE was annoying. hehe. And above all, I LOVE how the movie ends. Although it's predictable, it was VERY welcome. Movies with sad, creepy endings that leave you with a shiver always work for me.","user":"amylil","rank":[71,77]},{"title":"Great 70's horror.","rating":10,"date":"15 July 2005","review":"My 10 out of 10 vote for this movie really stems from the first time I'd seen it. I was an 8 year old at the drive-in with my parents. The assumption was I would watch the first movie of this double bill and fall asleep before the scary movie started. I cannot remember the first movie but I can tell you I will never forget this one. I played like I was sleeping in the back seat but watched the whole movie without my parents knowing. I had nightmares for months to come. Images of the creepy Chauffeur driver and the foggy lighting and lens effects really stuck with me. And the last scene was terrifying. I'm much older now but when revisiting this horror classic I'm reminded of that night in the backseat of my parents car...I still get chills. I also had the same experiences with \"Seizure\" \"From Beyond the Grave\" and \"The Sentinel\".","user":"tony5150","rank":[75,83]},{"title":"Creepy and mesmerizing!","rating":9,"date":"15 July 2001","review":"This is one of the few horror films that I can still sit back and enjoy.  It scared me pretty badly as a kid.  I still feel all the haunting vibes and chills as an adult.<br><br>It may not be action packed (although the scene with Reed trying to kill his soon in the pool was terrifying--and ultra-realistic), but it certainly gets under your skin.  This film is about mood, and it is both beautifully entrancing and ominously mesmerizing.  I actually found the acting quite good.  Reed was wonderful.  I loved the two weird siblings, Roz and Brother (Burgess Meredith, wonderful actor).  Their adoration of the house sends chills up my spine.<br><br>The true stars of the movie are the music (Bob Cobert's amazing Music Box Theme) and the house (Dunsmuir House &amp; Gardens, in Oakland, California). For true horror buffs out there, this movie inspired the creators of PHANTASM to drive up to Oakland and use this same mansion as the infamous Morningside Mortuary.  Which is probably, when the opening moments of PHANTASM rolled in 1979, I already had such fear upon seeing the mansion again on screen!  <br><br>I have to wonder if other elements of BURNT OFFERINGS inspired PHANTASM as well.  Note the creepy old lady upstairs at the end.  Reminds one of PHANTASM's eerie fortuneteller.  How about B.O.'s terrifying hearse chauffeur?  He's kind of like a forerunner of the Tall Man!<br><br>BURNT OFFERINGS is well worth the viewing.  Don't expect any real jolts or screams.  But turn off the lights and let it really sink in.  It's well worth a viewing.  There are many moments (such as the house renewing itself during the rainstorm) that are bizarre and horribly fascinating.  I haven't seen this good a haunted house movie in years.<br><br>And definitely visit Dunsmuir in real life.  This place is spectacular. You'll fall in love with it, just like Karen Black! I certainly did.  I spent awhile helping out as tour guide and volunteer at the estate while attending college in the Bay Area.","user":"martian-8","rank":[55,61]}]