[{"title":"One of the best. Underrated and unappreciated.","rating":10,"date":"22 October 2005","review":"I lived in Santa Fe, NM for 20 years which is only about 20 miles from Truchas, NM where TMBW was filmed. This movie was right on the money in its portrayal of Northern New Mexico, both in its culture and in its politics. The movie itself is one of the most sublime films I've ever seen in the true sense of the word. It has grandeur of thought, emotion and spirit. It has been bashed in this comment area by those raised on Star Wars, Predator, and the Matrix. To enjoy a movie like TMBW, you have to have a sense of awe, wonder and joy...and a good sense of humor. If you don't, you may get bored. If you do, then you'll find two hours well spent. I obviously love this movie. The music alone will transport you to a pleasant part of your mind, and the absolutely gorgeous New Mexico scenery will make you want to go there to see if it's really real. Try it, you'll like it.","user":"ncmike1","rank":[42,48]},{"title":"A thoroughly delightful movie with Oscar winning music!","rating":30,"date":"30 September 2004","review":"I watch this movie on VHS every few months just to renew the good feeling it gives me and expect that I'll wear the tape out eventually. <br><br>The score won an Oscar for Dave Grusin, yet there is no soundtrack available, which is a real shame. Angel Romero did some great guitar work on this film, and the Milagro Suite is a wonderful piece of music. <br><br>The story is funny and poignant, and the movie deserves to be better known than it is, as Robert Redford's direction has produced a film story that is much better than the book. There should be a DVD release of this film.<br><br>Highly recommended.","user":"hwedhlor","rank":[26,29]},{"title":"Great movie!","rating":1,"date":"1 June 2004","review":"Milagro Bean Field War is a truly great film, one of the must see list. Terrific casting and well filmed. It may have been neglected by viewers and critics because it is about a class of people and time and place we often do not take seriously, but it is a sincere and genuine story, well told. The use of the ghost and the pig as foils are delightful, and it is remarkable what a good movie can be like without gratuitous violence, nudity or foul language. However, it should not be assumed that is intended to say this is a bland movie, far from it. It is tasty and spiced well with action, language, and phrasing, not to mention filming. And it is funny, good fun all around. Enjoy!","user":"cgp2002","rank":[26,29]}]