[{"title":"The First Truly Modern Film - Perhaps The Last?","rating":18,"date":"18 March 2003","review":"It is hard for film buffs today to see silent cinema as a modern art. What strikes us nowadays is the immense debt that DW Griffith owes to Victorian fiction, that FW Murnau owes to Romantic painting, that Fritz Lang (and this is true even in Metropolis) owes to ancient German myth. How strange and wonderful then, to see a silent film that owes no debt to anything or anybody, that sums up the notion of 'modernity' in a way no work of art had done before - and precious few have done ever since. Eighty years on from its catastrophic release, Marcel L'Herbier's 1924 masterpiece L'Inhumaine remains the first, perhaps the only, totally modern film.<br><br>Most famous, of course, are the sets. A Cubist and Art Deco fantasy world designed by the artist Fernand Leger. Whether it's the salon of seductive chanteuse Claire Lescot (Georgette Leblanc) - a dining table afloat on an indoor pool, servants hidden by perpetually smiling masks -or the laboratory of visionary inventor Einar Norsen (Jacque Catelain) -vast and potentially lethal electronic gadgets, assistants in black leather fetish gear - we have entered a world where the past might never have existed, where the future can only be a continuation of now.<br><br>Just as striking, though, is L'Inhumaine's 'emotional modernism'. While so much silent film acting makes us laugh at its melodramatic excess, Claire and her circle of admirers underplay their emotions as coolly as the high-fashion zombies in Last Year at Marienbad by Alain Resnais. (A fervent admirer of L'Herbier, Resnais has acknowledged the influence of L'Inhumaine on his own work, though he insists that \"its ambition is more impressive than its achievement.\") Leblanc and Catelain make a gorgeously impassive pair of lovers. Hieratic icons for an age whose one true god is the Image.<br><br>David Melville","user":"dwingrove","rank":[28,32]},{"title":"L'Inhumaine summed up the whole avant-garde society drama with it's merry-go-round of subliminal passions and its neo-Cubist sets!","rating":10,"date":"17 June 2008","review":"With Marcel L'Herbier's L'Inhumaine, whose sets were designed by Robert Mallet-Stevens, Alberto Cavalcanti, Fernand Leger, and Claude Autant-Lara, architecture became a supreme screen of sets. Concerned with modern ornament, L'Inhumaine would synthesize the design aesthetic of the 1925 Exposition Internationale des Arts Decoratifs et Industriels Modernes, for all who worked on this film (including Paul Poiret, who did the fashions) came to define avant-garde design at the Exposition in the following year. The architect Mallet-Stevens, who designed the pavilion of tourism at the Exposition, was the theoretician of the film set. In his writing on decor, he conceived the set of a film as a work of draftsmanship and a working drawing. He was particularly concerned with rendering hap-tic volumetric(s) and depth and emphasized aesthetic techniques of relief in the design of filmic decor.<br><br>L'Inhumaine, a film that turned the architect Adolf Loos into an enthusiastic film critic, opens with an industrial vista of Paris as displayed from the \"moderne\" villa of Mallet-Stevens. This house is inhabited by \"the inhuman one\"  a woman. Georgette Leblanc, who conceived the idea for the film, plays Claire Lescot. She is a soprano who presides over an international salon of men, hosting dinner parties served by masked waiters in an inner patio that resembles a refashioned impluvium. This particular set was designed by Cavalcanti, who, in his own Rien que les beures, would constantly return to the theme of food, conceiving the urban rhythm as its own metabolic matter.<br><br>Claire's salon is frequented by two suitors who battle of her affection. The engineer, Einat, ends up winning he love by showing her the workings of his very modern \"cabinet of curiosity.\" Claire delights in the marvels of this laboratory (deigned by Leger), in which she can futuristic-ally watch her audiences on a screen just as they are able to hear her sing. As the inter-titles suggest, \"she voyages in space without moving,\" reaching visions of artists in their studios, partaking of the bustling life on the street, and following people driving cars and riding trains. In this way, she lives \"through the joy and the pain of human beings.\" No wonder her other suitor becomes jealous and poisons her.<br><br>But Einar's laboratory contains residual traces of its genealogy: it can perform alchemy. What is more, it is outfitted with an extra chamber, equipped with a mechanism for reviving the dead. This lab of transformation becomes activated in a sequence that resonates with Fritz Lang's Metropolis. With superimposition's and rapid montage, the laboratory offers what the inter-titles call \"a symphony of labor,\" which brings our voyage-use back to life and to the liveliness of her urban salon.<br><br>The film was made by L'Herbier's own production company, who deliberately chose an awkward science fiction plot in which L'Inhumaine serves as the pretext for some virtuoso displays of cinematographic virtuosity, and as the narrative justification for some remarkable decors. The sets are a microcosm of the whole film: they are in very different styles, and going from one to the next produces an almost physical shock. The film was very poorly received, both by critics and by the public, and one can see why. It is arguably the first great example in the narrative cinema of the so-called post modernist aesthetic. For the coherence of a stable fictional world with suitably \"round\" characters who undergo various experiences, L'Inhumaine substitutes a fundamentally incoherent world of pastiche, parody, and quotation. Its flat characters provide no stability; they are but puppets in the hands of an unpredictable, perhaps even mad storyteller. The film uses many devices from the stylistic repertoire of cinematic impressionism, but rather than amplifying and explicating the narrative, they serve instead to call it into question.","user":"Ziggy5446","rank":[17,21]},{"title":"Literally historic","rating":8,"date":"8 February 2008","review":"Goerge Antheil, in his autobiography \"Bad Boy of Music,\" claims that the concert riot scene is actual footage of his own October 4, 1923 concert at the Théâtre Champs Elysées. This event helped seal his reputation as one of the leading modernists of the day. If this is true, then actual artistic history was made because of a reaction at least partially staged for the making of this movie. Among the luminaries present -- and possibly visible -- are Eric Satie (looking like a \"beneficent elderly goat\") and Darius Milhaud. A few days later, Antheil announced that he was looking for a motion-picture accompaniment to his Ballet Mécanique, a call answered by Fernand Leger.","user":"Igor1882","rank":[8,9]}]