[{"title":"Is your blood that colour?","rating":15,"date":"15 June 2004","review":"People knock this film. Yes it has many flaws but some slack should be cut. It was 1971, Hollywood was in a desperate time of recession and change. 'Easy Rider' had blown a hole in the side of the school of thought that the studios had subscribed to. Suddenly, story material that would never have been tackled by the major studios prior to this time was emerging.<br><br>'The Omega Man' was of course an adaptation of Matheson's novel and is a second film version of it. But the technical challenges were vast. Find a time of day when L.A.'s deserted? Do me a favor! It's a miracle they got anything decent on film. Yes there are distant cars in the back of that zoom out at the top of the film but these guys didn't have computers did they?<br><br>Anyway, Heston looks amusingly dated in the role of Neville wearing his safari jacket and skintight tracksuit while he prowls the 'deserted' streets. The thing about Chuck is he just LOOKS like a film star. Just driving a car he grabs your attention. The supporting cast here are less engaging. An afro and 'Hey man' too many perhaps. The writers seemed desperate to tap into 70s pop culture. A sure-fire way to date your film.<br><br>The camera crew on this film must have gone straight onto 'Quincy' after they'd finished this. It's bizarre. There are dolly moves for no reason whatsoever (when Heston first enters his apartment and later before he discovers the sardine tin), zooms that hit the end stop so hard they almost bounce back and roving pans where you actually feel for the operator while he tries to find where the hell Chuck's car's gone. But this is one of the things that makes 70s cinema so great. The raw elements of film-making are on display. <br><br>Ron Grainer's score is genius in places and god awful in others. It goes from the brilliant main title theme to the woeful chase music when Heston pursues the leading lady. There's also the typically almost pink-tinted blood. Why couldn't they get blood right back then?<br><br>'The Omega Man' is an engaging, thought-provoking but very dated piece of cinema. The last image of Heston is immortal even if the film's hair-dos are not. Watch it, enjoy it and cut it some slack.","user":"waugh24","rank":[165,189]},{"title":"Flawed Wonderland","rating":8,"date":"1 January 2005","review":"A film that can't help but aim too high, \"The Omega Man\" suffers from the very thing that makes it great. Set in a post-apocalyptic future (for the audience of 1971) the film attempts to show a world populated by a single solitary man. Well, a man and a cult of malcontented zombie/mutant/vampire beings. Robert Neville (Heston) is the lone survivor of a germ war that turned the population of the world into freaks. Based on the amazingly brilliant book \"I Am Legend\" by Richard Matheson, the film shares most of the qualities of the book, yet excludes the portions that make \"Legend\" fantastic.<br><br>The idea of being the last man is intriguing. I used to fantasize about being Neville as a child (probably not the healthiest thing for a kid). Neville has paradise, but with the highest price possible. He can have anything he wants, but no one to share it with. And come night time, he must hide in his fortress away from the angry mob of mutants.<br><br>The apocalyptic world that makes the first half so captivating is destroyed by the second half's plot device. I won't go into details for those who haven't seen it. However, I will say the film starts to slide downhill from the mid-way point. But the lesser parts can be enjoyed as early 70's camp.<br><br>Even with its faults, \"The Omega Man\" is a great Sci-fi movie. It also gives Heston a chance to play his quintessential role of a man at the end of civilization. The film's weaknesses don't ruin the experience entirely. It is a film that myself and my friends talk about to this day despite the fact that most of my friends only saw it once or twice (when forced by me).<br><br>Related note: I Am Legend was also made into the film \"The Last Man on Earth\" starring Vincent Price. \"Omega Man\" is discussed in the first scene of indie-film classic \"Slacker.\"","user":"BryanLCook","rank":[120,142]},{"title":"Now playing: \"The Night Creatures\"","rating":31,"date":"31 May 2004","review":"One of these days soon we will see another remake of Richard Matheson's seminal Horror novella. If we do, I hope the marquee will read: \"I Am Legend.\" This should be done for no other reason than to make it easier for Sci-Fi nerds to argue and champion their personal favorite. But I have this feeling the producers will take the easy way out.<br><br>Boris Sagal, the veteran television director, who died under the most grisly of circumstances--he walked into a helicopter blade--helms a brilliant adaptation of the book. Sure, they changed the vampires into psychotic albinos. And they also injected a heavy dose of the Seventies counter-culture. But the essential themes resist the tampering by the new screenwriters and remain solid story chestnuts. No one handles a weapon with such verve as Mr. Heston. He fires at random and generally hits something. Always a good approach in this type of movie. I enjoy his conversations with Caesar's bust in his \"Honky paradise\". The sculptures and paintings on the walls are actual reproductions of the immortals they represent. Also, check out the art work on the back of \"Dutch's\" jacket. It packs a wallop. Ron Grainer's score is legendary and has a elegiac feel punctuated by strange sounds from obscure instruments. The action scenes rival the best. Catch Heston's despair and loneliness when he jogs by a large office building along side a reflecting pool. Every scene is chock full of memorable lines and quirky bits of business. The bodies of the dead pop up randomly with a wild note on the soundtrack. There is a brief nude scene that for once fits into the plot. A standing ovation is in order for anyone left alive.","user":"lemon993","rank":[63,77]}]