[{"title":"great sexploitation film of the 70s","rating":24,"date":"24 March 2004","review":"If you like early 70's sexploitation films,woman in prison,cat fight,or are a fan of Pam Grier then this movie is worth a watch                <br><br>good action,plenty of nude women,and cat fights,                       <br><br>although this movie is very bad acted and cheesey,                     <br><br>Its not boring and not sooooo dumb that you cant watch it.   The action is smooth and not hard to follow with a major gun fight climax. overall 7 out of 10 ..","user":"bosscain","rank":[24,28]},{"title":"Mindless, cartoonlike fun and frolic!","rating":13,"date":"13 May 1999","review":"Wow, this one just about defies description!  Although the filmmakers seem to take the project a bit too seriously, our stars (Pam Grier and Margaret Markov) seem to be enjoying themselves.  There's sadistic female guards, showers, a prison break, shootouts between revolutionaries and police. This film really typifies the genre.<br><br>Despite some of the dire happenings (blood flows like water) the film has a light-hearted feel.  It's pure entertainment material, and doesn't pretend to be anything else.  The heroines, Grier and Markov, really are the shining lights of this piece.  One wonders how they could roll in the mud and catfight their way cross-country without mussing their uniforms.  Talented women, they are.  A funny note, at least in my opinion, is that Grier's character wears black underpants, and Markov's white.<br><br>See it, enjoy it, have a good giggle.","user":"JohnnyOldSoul","rank":[14,16]},{"title":"Dig It!","rating":12,"date":"12 June 1999","review":"Dig it! You've got your black mama. You've got your white mama. You've got your lesbian prison guards. You've got your female prison shower scene. (That lasts about 5 minutes). You've got your tough Filipino gangsters. You've got your corrupt police man. You've got a Che Guevara like revolutionary leader. Put this together and what do you get? Pure cinematic goodness. This isn't a great movie. But hell, its a lot of fun. Pam Grier is great as usual as one of the mama's.(I'll let you guess which one.) Plenty of violence and nudity to spare. Don't go looking for this in the family section of your video store. Oh yeah, the story was written by Jonathan Demme. (Seriously!)","user":"Fanon","rank":[22,29]}]