[{"title":"North by Northwest and then some","rating":9,"date":"18 April 2018","review":"Hitchcock at his sharpest. Art and commerce in a delicious salad with all the right ingredients. A brisk screenplay by Ernest Lehman a Cary Grant that is just pure delight, Eva Marie Saint fresh out of her Oscar from \"On the Waterfront\" is an icy blonde with a brain. James Mason, the ultimate foreign sinister not to mention Jessie Royce Landis and Hitchcock brings Bernard Herrmann to wrap it all up in one of the most infectious scores imaginable. A real treat.","user":"artoffilmorg","rank":[52,58]},{"title":"What an Action Thriller Should Be.","rating":10,"date":"11 April 2005","review":"VERTIGO did nothing to advance Hitchcock's career in 1957 when he released it, and it's actually not a shame: the following year he decided to go completely against the slow-moving erotic thriller genre and do something shamelessly commercial, escapist and single-handedly create the spy movie. Ian Fleming, author of the James Bond novels, states he based his character on the physical characteristics and the suave personality of Cary Grant, as an added note. This could well amount to be the first James Bond film -- a dangerous villain complete with a sidekick, an alluring woman with a dubious nature and an enigmatic \"boss,\" a dashing hero, lush locales setting the scene for powerful chases and escalating danger.<br><br>NORTH BY NORTHWEST has one crucial difference to any James Bond film, though: Alfred Hitchcock. While the Bond films have been seen as quintessential action fluff (although fluff of the better kind until the franchise ran out of gas in the 80s), Hitchcock, always the master of subtext as well as suspense, creates memorable scenes that balance sexual tension, sexual innuendo, comedy, and mounting suspense seamlessly. There is never the feeling of being bored as there is too much going on, especially with the sizzling chemistry of Eva Marie Saint and Cary Grant, by now a Hitchcock veteran. When they're on screen, dialog crackles and so much more is said with so little gesture -- she closes the lid on her Ice Goddess role, but gives it a nice, cheeky, knowing wink. He of course evolves from the sort of man who while looking and being slightly clumsy and under his mother's thumb -- once it becomes clear he's been marked and is a target for a sinister plot that only later becomes clear -- becomes more assertive in taking matters into his own hands. A quintessential Hitchcock Everyman, Grant has his stamp all over his role. No one can imagine anyone else running away from that crop duster in one of the movies many standout sequences, or saying the reassuring last words to Eva Marie Saint as they cuddle together in the train. When one thinks of NORTH BY NORTHWEST, one thinks Cary Grant.<br><br>Easily one of Hitchcock's best films, made while he was at the peak of his career in the bracket formed with THE MAN WHO KNEW TOO MUCH and MARNIE. Great supporting performances are all over the map, from Jesse Royce Landis as Grant's mother, James Mason as Phillip Vandamm, Martin Landau as Vandamm's protégée who might be a little more than that, and Leo G Carroll as The Professor. Doreen Lang appears early in the movie as Grant's secretary; she would of course be remembered as the woman who shrieks at Tippi Hedren in THE BIRDS and gets slapped by her as the camera holds itself tight on her face.","user":"nycritic","rank":[163,202]},{"title":"A perfect film for a rainy, cold October day","rating":3,"date":"3 March 2003","review":"I saw this film for the first time when I was a freshman in college as part of an english class I took entitled \"writing and the movies\".  Little did I realize that I would be seeing a film that would stay with me to this day and in essence become one of my all time favorites.  Then, a few years ago, I caught it on the big screen at the Fine Arts theater in downtown Chicago. I remember that it was a rainy, cold October day.  Perfect weather for a Hitchcock film I thought to myself.<br><br>For me, half of the fun of North by Northwest is its incredible story.  This film has something for everyone within it: a little comedy, a little romance, great snappy dialogue and more action than any Bruce Willis Die Hard film combined.  Hitchcock was a master at this and in North by Northwest he lets his genius shine through totally.  It seems to me that whenever I watch it, everyone who made this film from Cary Grant on down had nothing but sheer fun making it.  Perhaps my two favorite scenes are the infamous \"crop-duster\" sequence and the last twenty minutes or so at Mount Rushmore.  <br><br>I must give special mention to Ernest Lehman who yet again managed to write a screenplay that totally knocks your socks off.  How he came up with the idea, I've not a clue, but what an idea it is.  The screenplay itself was nominated for an Academy Award that year, but lost to Pillow Talk.  North by Northwest was also nominated for Best Set Decoration and Best Film Editing, but lost to Ben-Hur in both categories.<br><br>All in all, what a film. If you haven't seein it, do so ASAP. North by Northwest just reinforces my belief that Alfred Hitchcock was one of the greatest directors of all time. Period.<br><br>My rating: 4 stars","user":"JSanicki","rank":[177,232]}]