[{"title":"Delicious!","rating":5,"date":"5 August 2003","review":"As a HUGE fan of John Waters films, I have nothing but praise for this film. So fun, so campy, so enjoyable ( and you know...there IS a real plot inside the film. It's not just music and hair! ) The characters are at once silly and loveable, esp. Divine as Edna Turnblatt. And who can't love Ricki Lake as the voluptous teen sensation, Tracy Turnblatt!?! It's such a great movie. The one liners alone make me howl, as well as the great 60's look they were able to COAT the film with ( like hairspray? ) The clothes, the furniture, the makeup, EVERYTHING. Stellar pseudo B-movie casting ( Debbie Harry, Sonny Bono ). It's a favorite!!!","user":"jilabel","rank":[39,44]},{"title":"Free Tracy Turnblad","rating":9,"date":"24 November 2008","review":"Hairspray both this version and the new 2007 one are a pair of great satirical films about teenage mores in the early Sixties of the Civil Rights Era. Sometimes our heroes and heroines for civil rights and human decency can be found where you least expect.<br><br>Such a person is Tracy Turnblad played by later television host Rikki Lake who's a full figured gal in every sense of the word. Her biggest desire growing up in Baltimore of the Early Sixties is to get on the local teen hop show hosted by Corny Collins. The regulars who dance there have a celebrity status, but something a fat girl dare not hope to dream.<br><br>Tracy doesn't hope, she lives the dream and actually gets picked to dance and be a regular to the distress of plastic teen princess Colleen Fitzpatrick. But it's a cause for celebration for Tracy's parents played by Divine and Jerry Stiller and her best friend Leslie Ann Powers.<br><br>All this is against the background of the civil rights era and Baltimore had its problems also. The Corny Collins show is segregated with a prescribed Negro Day once a month. That seems as bogus to Tracy as baseball being segregated not too long ago and she joins the fight to integrate the show. She's even convinced her teen dream new boyfriend Michael St. Gerard to join in as well.<br><br>A subplot is Powers finding love herself in the person of Clayton Prince who is black and that's upsetting to a lot of people, not the least is Powers's mother. It would be within that same decade that the Supreme Court did away with miscegenation laws, so these kids are running some real risks.<br><br>Hairspray is a very funny film with a very serious message about live and live. In fact that's the main problem with the world today right now, certain people feeling they've got the right through religion or secular philosophy or plain out and out wealth who just feel they've the right to dictate the lives the rest of us are supposed to lead in conforming to how they see the world. <br><br>In the remake of Hairspray, Queen Latifah who plays Ruth Brown's role of Motormouth Mabel says to the characters playing the Powers and Prince roles that as a racially mixed couple that those young people should be prepared for a whole lot of stupid in the world to deal with. One cast member of this version of Hairspray had occasion to deal with a whole lot of stupid back in 1994.<br><br>In the cast he's listed as Keith Douglas, lead singer of the Lafayettes DooWop group, but he was Keith Douglas Pruitt, a talented musician, actor, and composer. He and his partner were attacked by a trio of suburban rednecks who were dismayed at seeing two members of the same sex holding hands on Waverly Place. Keith sustained a fractured skull and a hearing loss for a while looked to permanently impair his career in music.<br><br>It was in my working days with New York State Crime Victims Board that I met Keith Pruitt. I did the claims for both he and his partner, giving them what my agency could provide for both of them. He did go back to work eventually to the applause of his friends and admirers of his work. <br><br>Keith Pruitt died only a week ago at the age of 47. He left a legacy in art, but he also left a legacy in life as a genuine hero. One who certainly never started out to be one, but things are thrust upon us in life sometimes. He stood up to the homophobic bigots and bashers with dignity and pride. I'm really proud I knew him and was part of his story in a small way.<br><br>And so this review of Hairspray is dedicated to Keith Pruitt, someone we can all emulate in life.","user":"bkoganbing","rank":[21,23]},{"title":"See This Movie!","rating":10,"date":"31 January 2000","review":"I saw it when it first came out, I've seen it several times since, and my last viewing was just a few weeks ago.  It never seems flat or old.<br><br>It takes a look at an issue that doesn't necessarily seem to be a goldmine of laughs (racial difficulties in the early '60s) and turns it into just that without robbing it of any dignity or sense of importance.  John Waters seems to have pulled out all the stops to insure this outcome, and it really paid off.<br><br>The \"pleasingly plump\" pre-talk show Ricki Lake turns in a great performance in a role that's an inspiration to \"chunky\" girls everywhere.<br><br>\nAs always, Waters picks cameo and supporting actors that are dead-on perfect.  His own turn as a psychologist is an absolute scream!  Brimming with hysterical lines and set-ups, this is a comedy you need to see, if you haven't already.","user":"lisado","rank":[34,41]}]