[{"title":"A respectless characteristic of Franz Josef Strauss","rating":8,"date":"22 August 2001","review":"In 1980, the German politician Franz Josef Strauss ran for Chancellor against Helmut Schmidt. He was arch-conservative and considered as un-electable by many people, though he was tremendously popular in his native Bavaria.<br><br>This movie showed Franz Josef Strauss in a very respectless way - by quoting him and showing old speeches. Some cinemas refused to show the movie.<br><br>In the end, Strauss lost the elections.","user":"Turan","rank":[5,14]},{"title":"Unbelievably slow and boring like German humour if it exists!","rating":1,"date":"1 January 2020","review":"Admittedly I had to turn it off after 25 minutes. I wanted to give it a go as it was highly rated here however this rating appears to be left by a rouge Nazi! Simply put save an hour of so of your life but quickly reading points of interest about the man and he works or attempted works and move on! Happy New Year!<br><br>Franz Josef Strauss, premier of the state of Bavaria, former head of three federal ministries and by far the most colorful and controversial political figure in West Germany, was born 6 September 1915 became a Oberleutnant in the Third Reich, then a right wing politician which saw him as Defense minister wanting to arm his troops with individual nuclear warhead and he tried a take over Germany by waging a campaign to take control as Chancellor (his closest attempt was in 1980) from Chancellor Helmut Kohl until Strauss died hunting in woods on 3 October 1988.<br><br>Few Germans ever viewed Strauss with moderation. Whenever he appeared in public he seemed to set off sparks that ignited rabid condemnation and hatred among his critics and adulation and loyalty among supporters.<br><br>Critics condemned him as a fascist, a menace to Germany and Europe whose policies would lead to domestic and international turmoil. One critic said of him, \"He stands rather to the right of Genghis Khan.\" But supporters saw him as a realist, struggling against what they viewed as the muddle-headed, shortsighted views of his political opponents.<br><br>Of medium height with a bull neck and booming voice, Strauss in his prime was powerfully built and weighed more than 200 pounds, a muscular dynamo who in his youth was a champion cyclist. His appearance and manner were the delight of political cartoonists, who invariably portrayed him as a knobby-kneed Bavarian bumpkin in lederhosen and Tyrolean hat.<br><br>Yet he was a scholar of the classics and an outstanding university student whose academic brilliance continued to impress many after he graduated with honors as a doctor of law. His speeches were peppered with Latin expressions and an earthy sense of humor that at times he would turn upon himself.<br><br>He was a staunch anti-Communist who, during the 1956 Hungarian uprising, rattled Europe with the comment that the combined might of the Western Allies \"could wipe the Soviet empire off the map.\"<br><br>A Roman Catholic in overwhelmingly Catholic Bavaria, Strauss on occasion tangled with the church. Emerging from one confrontation with the hierarchy, Strauss declared, \"I was ruder to the bishops than I have ever been to anybody in my life.\"<br><br>Serving in cabinets headed by conservative chancellors, Strauss quickly mastered the intricacies that other ministers usually left to department professionals. But despite his brilliance and widespread popularity in Bavaria, he never managed to get either of the two federal posts he most desired: chancellor or foreign minister.<br><br>During a long career that began when he emerged from a prisoner of war camp at the end of World War II, Strauss was buffeted by controversy and scandal that frequently wound up in court battles.<br><br>Strauss was born in Munich on Sept. 16, 1915, when Bavaria was still an independent kingdom. His father, Josef, was a butcher. One of his suppliers was a poultry farmer named Heinrich Himmler, the future leader of the SS, Adolf Hitler's elite force that, among other functions, ran the concentration camps.<br><br>The elder Strauss was no Nazi. A staunch Catholic, Strauss' father was active in the Bavarian People's Party, a small conservative party that sought to sustain independence for Bavaria.<br><br>The son later recalled what he said was his first political experience--a thrashing he received as a boy from his father for passing out Nazi literature on the streets. Young Strauss said he was unaware of the contents.<br><br>Strauss entered the army at the outbreak of World War II in 1939. He fought in Poland, France and the Soviet Union and was once nearly court-martialed for calling his uniform a kluefterl (a childish masquerade). Suffering from severe frostbite, he survived the Battle of Stalingrad by leading his platoon out of a trap and then fighting a rear-guard action for 50 miles.<br><br>When he emerged from a prisoner of war camp at war's end, U.S. occupation authorities named him as deputy county director in Bavaria. He also served in the Bavarian state Interior Ministry.<br><br>He helped found the Christian Democratic Union and the Bavarian Christian Social Union and in 1949 was elected to West Germany's first Parliament.<br><br>His debating brilliance and bull-in-the-china-shop tactics soon brought him to the attention of Konrad Adenauer, West Germany's first chancellor. In 1953, Adenauer appointed him minister without portfolio. At 38, he was the youngest member of the Cabinet.<br><br>For Tactical Nuclear Arms<br><br>In 1956 he was named to what would become his most controversial post--minister of defense. He advocated such then-radical policies as the formation of a 300,000-man professional army that would be equipped with tactical nuclear weapons. These weapons would be supplied by the United States since postwar agreements prohibited West Germany from manufacturing nuclear arms. \"A nuclear bomb is as valuable as a brigade and much cheaper,\" he said then.<br><br>West Germany at the time had only about 55,000 men under arms, none of them combat-ready, and rearmament was still a highly controversial issue. Today West Germany has non-nuclear armed forces of just under 500,000, made up mostly of conscripts.<br><br>The biggest single controversy of Strauss' tumultuous career was the \"Spiegel Affair.\" That erupted in 1962 when police, apparently on Strauss' order, raided the Hamburg headquarters of the liberal news weekly Der Spiegel, which had long been a bitter critic of the defense minister. The raid led to the arrest of its publisher and three senior editors and the confiscation of the magazine's documents.<br><br>The magazine had published a report, purportedly based on secret government documents, that revealed serious shortcomings in Strauss' brainchild--the West German armed forces.<br><br>The raid shocked the nation, triggering fears of the return of the tactics of the Nazi Gestapo.<br><br>In the uproar that followed, Strauss was accused of lying to a parliamentary committee. Although he was later cleared of any wrongdoing, Strauss was forced to resign and he retreated to Bavaria.<br><br>Defied His Counterparts<br><br>In 1966, when the two conservative parties joined with the Social Democratic Party to form the \"Grand Coalition,\" Strauss returned to Bonn as minister of finance, a post in which he often defied his European counterparts on economic policy.<br><br>The coalition collapsed in 1969, and Strauss again returned to Bavaria. In 1979, in what was probably the easiest election held in West Germany, Strauss was elected state premier. In 1980, he made an unsuccessful run for the chancellorship in elections won by popular Chancellor Helmut Schmidt's Social Democrats.<br><br>His last bid for federal power also ended in failure. When the Christian Democrats and Christian Socialists regained the chancellor's office in 1983, Strauss sought to take over the posts of vice chancellor and foreign minister from Genscher.<br><br>But the new chancellor, Kohl, refused to agree to the switch, and Strauss remained in Bavaria as state premier.","user":"aliensexgod","rank":[0,1]}]