[{"title":"Best Polish mafia film I've seen","rating":7,"date":"13 October 2007","review":"I give this a 7 stars because it was made the same year as Godfather I, so it didn't benefit from all the film-industry wisdom that followed that production. Rather, this is a character study of one mafioso, which is a separate issue from the operatic, all-systems-GO no-holds-barred approach Coppola was able to employ in The Godfather. it's a smaller film, and should be compared to, say, Mobsters (1991), which deals with the same period and some of the same characters as V.P. Charles Bronson's Valachi is adequate. He's a workaday, uneducated, down- home mob guy, and Bronson plays him as if he were Polish, with a job that he goes to every day, where everyone talks Italian. Because it is through his eyes that we see his world, some of the other characters become more vivid, e.g., Joseph Wiseman as Salvatore Maranzano. When I compare the casting of the incomparable Joseph Wiseman in this role as opposed to, say, Michael Gambon in the same role in Mobsters, or Anthony Quinn as an equally old-school rival in the same film, I wonder: None of these actors are Italian -American or even simply Italian; why do some of them work, and the others don't? Granted that Wiseman, Quinn and Gambon are all consummate professionals and true craftsmen as actors, if anyone mentions Salvatore Maranzano and the Castellammarese gang war of 1929, the face that will come to my mind is that of Joseph Wiseman. He and Charles Bronson make this film worth seeing.","user":"birck","rank":[12,13]},{"title":"It probably didn't help that this came out the same year as \"The Godfather\".","rating":9,"date":"19 April 2011","review":"I truly think if this film had come out earlier it would today be thought of as a better film. After all, it's FAR better than its current rating of 6.8. That's because 1972 was the same year that \"The Godfather\" debuted and the utter greatness of \"The Godfather\" probably overwhelmed \"The Valachi Papers\"---as both touch on very similar subject matter. The main difference is that \"The Godfather\" was based fictionalized characters and had a true elegance about the film. \"The Valachi Papers\" in contrast was a much more straight forward story based on real mob figures--and it's a dandy film.<br><br>The film begins in the early 1960s. Mobster Joseph Valachi is in prison and multiple attempts are made on his life. It seems that someone in the organization has talked--and the mob of bosses, Genovese (Lino Ventura) believes it was Valachi. And, not surprisingly, a contract has been placed on Valachi's head. This has the unintended consequence of forcing Valachi to to authorities. Almost all the rest of the film consists Valachi giving his story to the government agent. What follows is a very long story about Valachi's earliest days in the mob (about 1930) up to the arrest that brought him to prison--and a bit beyond.<br><br>The story is helped a lot by the films's length--a little over two hours. You'd need at least this much to tell such a long and complicated story. It also helps that Charles Bronson is given some excellent support. Among the many wonderful actors, one really surprised me--Lino Ventura. I've seen him in many French films (mostly Pierre Melville productions) and have LOVED his acting--he plays a great mobster--cold and tough. I never realized that he spoke English so well--everything I've seen him in up until now has been in French. Here, he very credibly plays an Italian-American! The script also was quite good. While not quite as human and interesting as \"The Godfather\", it sure was good...very, very good.<br><br>There's almost nothing negative I could say about the film other than very minor things. Bronson was too old for this role. When the film began he was supposed to be 27--but looked about twice that. Also, a few times anachronistic elements somehow made their way in--such as cars that were from the wrong time period. But, as I said, this is all very minor.Aside from this, a top quality production that deserves more recognition. Gritty, exciting and fascinating as well.<br><br>By the way, although IMDb lists the movie as being rated PG, the version I saw was way too bloody and filled with nudity to have been rated PG. The lesbian scene along would have merited a rating of R. Perhaps this was a director's cut or perhaps it was not rated PG or perhaps there were just multiple versions.","user":"MartinHafer","rank":[12,14]},{"title":"Read it in the papers.","rating":7,"date":"25 April 2010","review":"The following year Charles Bronson would team up with director Michael Winner as a cop on the trail of the mafia, but the year before in \"The Valachi Papers\" he would find himself smack in the middle of it all as former mobster Joe Valachi serving 15 years in prison with a target on his head of twenty thousand dollars by mafia capo Vito Genovese. When he learns of it with there being no way of getting out of it when receives the kiss of death. Joe decides to spill his guts on the inner workings (extortion, vengeance and murder) of LaCosa Nostra for some sort of protection for him and his family. This would be the third European film of the trot between Charles Bronson and director Terence Young with the gritty crime flick \"Cold Sweat (1970)\" and buddy western \"Red Sun (1971)\" being the two before it. Coming out the same year as the similar in vein, but masterful classic \"The Godfather\". \"The Valachi Papers\" probably came and went with little notice. While not as stylish, it managed to have scope in its tough, trim and grippingly told narration splitting between past recounting and present situations. The plot was adapted off Peter Maas' novel of the same name that covers this true account of the mafia underworld and organised crime. A steadfast Bronson perfectly nailed down the lead with excellently respectable support by the likes of Lino Ventura, Joseph Wiseman, Walter Chiari, Gerald S. O'Loughlin, Angelo Infanti and Amedeo Nazzari. Director Young does a steadily routine job, but it's well done for such a minimal and straight looking production. For a running time of just over two hours, never does it feel it or seem to drag. The workmanlike execution gives the air a brutal (one raw act of violence would have any male squirming) and hardboiled touch, crafting well etched period (through the 1930s) location details and a having profound power in its escalating dramatics. A violent, tough-talking gangster feature with fine cast associated.","user":"lost-in-limbo","rank":[5,5]}]