[{"title":"What An Absolutely 'Wunderbar' Way to 'Brush Up Your Shakespeare'!","rating":9,"date":"15 October 2002","review":"KISS ME KATE is quite easily one of the two most famous musical 'adaptations' of Shakespeare for the stage and screen (the other being WEST SIDE STORY). Focusing on a theatre company putting up a musical version of 'The Taming of The Shrew', the film traces the main relationship between director/leading man Fred Graham (Howard Keel) and his ex-wife/leading lady Lilli Vanessi (Kathryn Grayson) as they respectively portray the Shakespearean roles of Petruchio and Katherine (the Shrew to be tamed, of course!). Throw in a deliciously naughty second lead actress Lois Lane (Ann Miller) and her gambling-addict beau Bill Calhoun (Tommy Rall), as well as a couple of gangsters (played brilliantly by Keenan Wynn and James Whitmore) mistakenly chasing after Fred 'sweetie' for Bill's latest debt, and opening night proves to be quite a big event, both onstage and off. Can the feuding Fred and Lilli, still in love with each other despite Fred's ego and Lilli's fiance, get their act together before the curtain goes down on the play?<br><br>\nI have to say that I thoroughly enjoyed this film... yes, even having already seen the London stage version of the musical earlier this year. There are, of course, personal reasons that bias me towards the film and to perhaps set out watching it with every intention of liking it (which surely helps!). First of all, I have no qualms in admitting I'm probably the biggest Ann Miller fan there is, and there's no doubting also that KISS ME KATE is possibly the best showcase of her talents and beauty there is. Secondly, I've been listening to the film soundtrack on constant repeat for months now, influenced by an interest kindled by the musical and discovering Miller. It helps that I can sing along to most of the songs and know the lyrics--no struggling to figure out what Grayson is singing in her operatic voice, and no attempting to acclimatise to new tunes. I already know the Cole Porter music, from lyrics to tune to score, and love it. So yes, perhaps I *was* predisposed to loving this film--how could I *not*, particularly with Miller dancing and singing my favourite songs in the film?<br><br>Still, I firmly believe that there's a lot more to recommend KISS ME KATE than the ravings of a fangirl. Cole Porter really outdoes himself here with a toe-tappingly catchy score: even songs like 'I've Come To Wive It Wealthily In Padua' and 'We Open In Venice' have the same sparkling lyrics, the same ability to catch the ear as the better-known 'Wunderbar' and 'From This Moment On'. Then there's the jazz-influenced 'Too Darn Hot' and the sweet ballad 'Why Can't You Behave?'. I honestly believe that Porter's score for KISS ME KATE is better than the one he wrote for HIGH SOCIETY, because he makes fine use of reprisals and bridges. Take for example Rall singing a short reprisal of Miller's 'Why Can't You Behave?' back to her before she replies with a wonderful segue into 'Always True To You In My Fashion'--the reprisal marks the couple and the relationship and works wonderfully well.<br><br>Of course, it helps also that the cast for KISS ME KATE is really most impressive. Keel, with his big big voice and untrained natural talent, fills the screen (and his tights!) with his masculine presence. He struts, swaggers, and yet shows his vulnerable side believably enough to make us *like* his character, ego or no ego. Grayson, so much weaker against Gene Kelly and Frank Sinatra in ANCHORS AWEIGH a decade earlier, really comes into her own here--she's excellent as Lilli, swooning at the right moments, strident during the rest, and actually bites out 'I Hate Men' with conviction... you certainly wouldn't imagine it possible of the actress who gave us the rather simpering Aunt Susie in the aforementioned Kelly/Sinatra film! I'm also partial to Tommy Rall, whose soaring athletic ability just crackles off the screen. It's such a thrill to see Miller get matched with someone who can dance circles around most everyone else alongside her. They make the cutest couple in their two numbers together, with the energetic, exuberant dance to 'Why Can't You Behave?' definitely making one of my favourite film dance routines of all time.<br><br>This film is, of course, Miller's shining moment--a shame, considering she's still only second lead and yet really steals the film with her dancing and singing. I can understand why other reviewers don't like that the song 'Too Darn Hot' became a solo for her, but what works on the stage, quite frankly, won't have made it in the film. (Even in the musical I thought the song a rather inauspicious and irrelevant start to the second act.) Miller's 'Too Darn Hot' fandance tap is precisely what the title suggests, and the charm she always radiates in all her small roles sizzles through her sexy fringed costume and black lace fan as she dances all over the furniture. One of my favourite songs is also the *unbelievably* catchy 'Tom, Dick &amp; Harry', and the version in the film is great fun.<br><br>The directing by George Sidney is solid, making the best of the choreography. Any apparently odd choices would have to be explained by the fact that the film was originally filmed in 3-D--imagine Miller's gloves and necklace flying into your lap, or the objects on the tavern table crashing off the screen when Grayson sweeps them off (while despising men, of course!). I really wish I could have the chance to see this film the way it was meant to be seen, in 3-D. Unfortunately, there's no way to get that effect on VHS and probably not DVD either.<br><br>Even so, KISS ME KATE is bright, splashy, flashy and colourful. It's breathtakingly happy eye-candy and drags only at a few moments when non-Shakespearean dialogue gets in the way. Considering the cleverness of its concept (it's a film about the staging of a musical version of the Shakespearean play), the film has little to no artistic pretension--in this way, it's a quintessential MGM musical... set, geared, intended to *entertain*. And entertain it does. With the vocal talents of Keel and Grayson, the incredible tapping of Miller and the soaring of Rall, all accompanied by an irresistible Porter score, let's hope this one makes it to DVD; it's definitely a keeper!","user":"gaityr","rank":[47,50]},{"title":"If you are a dance fan","rating":10,"date":"1 July 2004","review":"This is my favorite musical, not for the dancing alone, but it is the best. The dancers, not just Ann Miller and Rall, but Bob Fosse, Bobby Van, and Carol Haney!!  What more could any dance fan want?  There is always something new to see, no matter how many times you have watched it.  The lyrics are magnificent, tricky and intriguing.  When Howard Keel, dressed in those gorgeous tights, sings about all the women he has known, he's a knockout.  Grayson is not my favorite actress, but she can sing, and she and Keel make a wonderful pair.  I will admit that the music is great, but folks, catch the dancing!! The final dance number with the six dancers is superb, but how can you watch all six at once?  You have to watch it several times, particularly the pair of Carol Haney and Bob Fosse.","user":"jshaffer-1","rank":[40,43]},{"title":"Kiss Me, Kate Is Still Great!","rating":2,"date":"2 March 2004","review":"Kiss Me, Kate was first released at the time that the movie screens were exploading into large formats to get people away from their T.V. sets and back into the theaters, and 3-D films came out of hiding and the only musical film to be shot in the 3-D format was Kiss Me, Kate, and stereophonic sound, to me, was better in those days than it is today, but the film gave everyone in it the chance to do their finest work, but it's a shame that they will not release a 3-D Version of this film on Home Video. The distributors would make a fortune!<br><br>Everyone knows the plot of Kiss Me, Kate, so there's no sense in going into that.  Kathryn Grayson, Hollywood's finest singer of all time replaced Patricia Morrison who played Lilli on Broadway, and Howard Keel replaced Alfred Drake who played Fred Graham on Broadway, and Ann Miller replaced Lisa Kirk who played Lois on Broadway, and it's not too well known but Lisa Kirk dubbed Everything's Coming Up Roses for Rosalind Russell in the movie version of Gypsy!<br><br>Tommy Rall who replaced Harold Lang in the Broadway version, to me, was never given a fair chance in Hollywood.  An excellent singer and versatile dancer, but still he shines in his work in Kiss Me, Kate and for his work in Seven Brides for Seven Brothers as the brother Frank who got upset when he was called by his real name.<br><br>This movie is a good example as to why Broadway stars are not necessarily good for repeating their Broadway roles on the screen.  The cast in this movie is excellent in their acting, singing and dancing and I can not picture the Broadway cast repeating their roles in the movie version.  To me, it just wouldn't work!<br><br>Casting Ann Miller in the role of Lois Lane was a good break for Ann Miller since she was always given roles in past movies that showed her off as a gal who had an overly-obnoxious appetite for the opposite sex.  This film gave her a chance to display her full range of talent which had in the past been overlooked, but what can a person say about her number Too Darn Hot that burned up the screen and made Lilli [Kathryn Grayson] furious with her co-star Fred-er-rick Gray-ham [Howard Keel] to the point that she called him a louse of stage in front of the cast in the play!  She couldn't call him what Patricia Morrison called Alfred Drake in the Broadway play because in those days the Hayes Office wouldn't allow Kathryn Grayson to call Howard Keel a ba****d!<br><br>Keenyn Wynn and James Whitmore played the comical gangsters that were to collect a marker from Howard Keel which was really signed by Tommy Rall and when they do their number Brush Up Your Shakespeare, it's hilarious.  Not because Wynn can't sing and dance, he can, but because James Whitmore gave it all he could, but faked the number beautifully, and Whitmore had the good sense never to perform in a musical ever again, but together they were excellent in their comedic performance as the gangsters in the film.<br><br>So, you guys who distribute this movie - give us guys and gals a break and release this in the original wide-screen 3-D version with stereophonic sound and let everyone see why:<br><br>KISS ME KATE - IS \"STILL\" GREAT!","user":"darkinvader45210","rank":[38,44]}]