[{"title":"Feels like something that Edgar Rice Burroughs would have written!","rating":8,"date":"19 November 2000","review":"I have a genuine fondness for TARZAN GOES TO India. If you remove the Air India 707 from the opening credits and the early sixties automobiles, it feels like something that Edgar Rice Burroughs would have written, possibly after the Second World War, if declining health hadn't caught with him.<br><br>Jock Mahoney gives the legendary ape-man something that the other previous actors had not provided to this part -- a sense of maturity and gravity. Yes, Mahoney is almost too rangy, particularly when compared to his immediate predecessor, the hefty Gordon Scott. But Mahoney makes every scene seem real; with his Midwestern accent sounding neutral, almost international, in tone in keeping with Tarzan's unique origins. The additional kick is knowing that Mahoney does all of his stunts, including an eye-popping dive from an moving airplane into a lake. But his greatest stunt is being able to work with an inexperienced child actor and a four-ton elephant and not get loss in the shuffle. That's charisma!<br><br>Yes, the storyline is somewhat juvenile, but there was a definite market in the early Sixties for movies pitched to a pre-teenage audience. Witness such films as CAPTAIN SINBAD, FLIPPER, ZEBRA IN THE KITCHEN, and Disney's output of movies during this time. Robert Harding Andrews does a credible job with the script while John Guillermin provides fast-paced direction although this film lacks the flourishes of his 1959 Tarzan outing, TARZAN'S GREATEST ADVENTURE.<br><br>Overall, TARZAN GOES TO India is a pleasant diversion well worth checking out.","user":"marcd30319","rank":[21,22]},{"title":"Fun Tarzan outing with interesting change of locale.","rating":7,"date":"16 November 1998","review":"This is quite an enjoyable film with as an added bonus, 300(!!) elephants and spectacular Indian scenery. I don't think I've ever seen India look so beautiful in any movie. Jock Mahoney makes an articulate and athletic(if a bit lean) Tarzan. His easy-going performance is quite fun to watch, as is his interplay with the Maharaja's daughter. There seems to be a nice chemistry between these two. It is really too bad that their relationship isn't allowed to progress further but this being a G-rated film, the line has to be drawn somewhere. As this film is aimed at the very young, a lot of emphasis is put on Jai the elephant boy. This turns out to be the film's greatest weakness. The character is irritating and obnoxious. Not surprisingly, Mahoney looks a little uncomfortable in his scenes with the young boy and some of their moments together are downright corny. It's a good thing that the film's fast paced action sequences and beautiful scenery make up for these weaknesses(the final charge of the elephants is very exciting).Also of note, Leo Gordon is quite effective as the villain Bryce. On the whole, this is a good way to pass a rainy Sunday afternoon. You'll have to close your eyes and ears every time Jai appears, but the rest will go down easily enough, especially for the younger set. By the way, don't miss Tarzan's arrival into India. It's an eye opener!!","user":"Alberto-7","rank":[20,21]},{"title":"The International Jungle Man","rating":6,"date":"15 October 2011","review":"For the first time since Johnny Weissmuller took that plane with Jane to New York to rescue Boy in Tarzan's New York Adventure, the famed jungle man leaves the African continent. Tarzan Goes To India, but in this case the title does not say it all.<br><br>Tarzan who is now played by Jock Mahoney is summoned to India at the request of a local maharajah. A needed dam is being built to provide hydroelectric power for his area. But the maharajah is also a conservationist. The dam will flood a certain valley that has been an animal preserve and a rather large herd of elephants will drown. <br><br>Mahoney's mission is to save the animals and his biggest problem is a nasty and mean rogue elephant who is leading the herd. Assisting him is Jai the elephant boy, a Twentieth Century version of Sabu and his pet pachyderm. Tarzan's also got some human opposition in dam engineers Mark Dana and Leo Gordon, the latter with whom Tarzan has some history with.<br><br>Just the mention of Leo Gordon and you know who the real villain is. On his last job in Africa which brought him into contact with Tarzan he did a little ivory poaching on the side. <br><br>Jock Mahoney replaced Gordon Scott as Tarzan and at 43 he brings a more mature Tarzan to the picture. But Mahoney who was a college jock and a stuntman before becoming an actor and he's one fit and athletic Tarzan in the first of two films he did as Edgar Rice Burroughs's legendary primeval hero.<br><br>What I like about this film is not only is it shot in India, but brings Tarzan fully into the present era. This film could never have been done on the MGM back lot, let alone RKO's back lot later on. <br><br>It's a nice story and while Jock Mahoney replaced my favorite Tarzan Gordon Scott he certainly does credit to the part and to the film. Tarzan Goes To India holds up very well after almost 50 years. It's quite a bit more than just G rated family entertainment, the film is a nice statement about the other creatures with whom man shares domain of planet earth with.","user":"bkoganbing","rank":[8,8]}]