[{"title":"They'll have to think up a lot of new adjectives...","rating":10,"date":"28 January 2004","review":"There's little new I can probably add here, judging by the amount of comments, but here goes. King Kong is still one of the greatest fantasy films. It has inspired generations of filmmakers, writers, and other artists, all of whom have been awed and thrilled by the level of craftsmanship involved in its creation. The film haunted my nightmares as a child; there was something absolutely frightening about Kong's glaring eyes looming in the windows of the wrecked elevated train. Thanks to television and repeated showings every Thanksgiving for years (thanks WOR) I became smitten with this film. Nearly 30 years later- post the 1976 remake, Star Wars, Jurassic Park, Lord of the Rings, etc, I still sit down every few months to watch Kong. EVERY time, I see something new. The detail they put into this film is phenomenal, considering it was released long before television or VCRs could give viewers a chance to watch it enough to notice the more subtle details. Volumes have been written about this movie's production, but one effect still has me puzzled. When Kong is in his cave, just before he sets Ann Darrow (Fay Wray) in a small opening in the rocks, the head of the elasmosaurus can be seen surfacing and submerging in the pool behind him. If it was done in stop motion, it's the smoothest work in the film; even the pool's water actually appears to ripple around the head.<br><br>Willis O'Brien is the man primarily credited with bringing King Kong to the screen, but in truth, Kong was the brainchild of Merian Cooper, a truly larger-than-life film producer, on whom the character of Carl Denham was modeled. Cooper had been a fighter pilot in World War I, a POW after he was shot down behind enemy lines, and- with his partner Ernest Schoedsack- had traveled to the wilds of Asia and Africa to film documentaries. Cooper imagined King Kong as the logical extension of his true life exploits; exaggerated but a recognizable caricature of his experiences. Originally he had wanted a real gorilla to portray Kong, and even wanted to have it fight a Komodo dragon! (Call the Humane Society!) We can all be grateful he encountered Willis O'Brien (who was working on his own dinosaur film- Creation) and decided to produce Kong and the monsters of Skull Island using stop-motion. I doubt anyone in 1933 could have tolerated the spectacle of a live gorilla in real combat with a Komodo dragon. I suspect the film would have either been banned outright or been little more than a grisly footnote in motion picture history. The idea was Cooper's, but the majesty and spectacle of the film belong to O'Brien. The miniature jungle settings created by O'Brien's crew with multiple glass paintings created an otherworldly quality to Skull Island that could not be duplicated by shooting on location- as Cooper had originally envisioned.<br><br>To be sure, the film is very much a product of a simpler time. However, if the acting in Kong is compared to its early 1930's contemporaries in the horror/fantasy genre, it holds up quite well. Cooper and Schoedsack understood the necessity of establishing the characters before Kong's entrance, but kept dialog to a minimum. The story is told visually, with camera-work furthering plot points that may have seemed didactic otherwise. The film is carried by not only its visual imagery, but by one of the first feature length music scores. This was an innovation that put King Kong ahead its sound contemporaries, which relied quite heavily on the spoken word and direction alone. There is a ten minute sequence in the center of the film- after the death of the tyrannosaurus until the escape of Ann and Jack Driscoll (Bruce Cabot) from Kong's lair- that is told entirely with visuals, music, and sound effects. It is in large part due to the score that much of Kong's emotional impact is conveyed, particularly in its finale atop the Empire State Building. Steiner was able to suggest Kong's emotional state, assisting O'Brien in providing empathy to a creature who in reality was only an 18 inch high puppet.<br><br>It is a mistake to compare Kong technically or artistically with films from later decades. Consider the cultural context in which King Kong was produced. America was in the darkest days of the Depression. World War II was seven years away, and nobody outside of a few physicists knew what 'atomic bomb' meant. Kong truly was the 'Eighth Wonder of the World' just as the Empire State Building was at the time considered the greatest technological marvel. As Cooper envisioned it, Kong was an adventure escapist film, offering Depression-Era audiences something that at the time would be considered the 'ultimate in adventure.' Whether or not Peter Jackson's proposed remake of Kong can maintain these qualities of showmanship and adventure is a matter of wait and see: to today's audiences Kong no longer represents something 'all powerful' or able to 'lick the world' as Carl Denham described him back in 1933. Even setting the remake in 1933 will have its difficulties, since the film will then be a period piece rather than a contemporary story, as both the original film and the 1976 remake were, and audience involvement may be more limited.<br><br>Like Star Wars, King Kong was a made for the movies myth, not based directly on any previous source other than Cooper and O'Brien's imagination. It spawned one of the first monster movie sequels, one remake, (so far) and countless imitations, parodies, and merchandise. Among fantasy films, only the Wizard of Oz can rival King Kong for the sheer longevity of popularity, but while Oz provided escapist entertainment, it did so in a lighter fashion. Kong provided escapism but of a more disturbing and haunting kind.<br><br>Here's to ya, Obie, and Coop!<br><br>Oh no, it wasn't the airplanes. It was Beauty killed the Beast.","user":"ramaken33","rank":[180,199]},{"title":"Some aspects of KING KONG people forget.","rating":3,"date":"3 December 2001","review":"First, the 1933 version of KING KONG, is for me, the greatest fantasy film ever made.  Sure, there are fantasy films with far better special effects (THE MATRIX, JURASSIC PARK) better acting (the acting here is of the period!) but KING KONG is a film of tremendous excitement.  The suspense, pacing, sensuality, violence all adds up to a blood pumping experience.  We all read about the film's history, being made, released, censored, restored, and how it's been picked to itsy-bits by every arm-chair film \"expert\".<br><br>What very few film-makers have focused on is the film-making itself in KING KONG.  It has superb build-up.  We are wondering what is on the island as we approach it.  Then we wonder what is behind the wall on the island. Then we wonder what gigantic beast is sharing that frightening jungle with the rescuers, trying to save Fay Wray.  The film is faultlessly edited.  Many scenes begin or end with people running for their lives.  Unneeded scenes just don't exsist (we go from Kong knocked out on Skull Island to his Broadway debut.  We don't need to see what happens inbetween!) then there's Max Steiner's perfect music score.  Before KONG, most music scores were borrowed snippets of classical or popular themes, but Steiner's score follows the action to an inch!  Also, he does a great number of abstract musical strokes (I.e the clash of drums when Kong beats the giant snake to it's death.  The lovely string piece that jumps to pulsating chase music in a milli-second.)  When I hear of a friend say they never saw this film, it's like hearing a child say they never had ice cream.  Long Live Kong!","user":"boris-26","rank":[180,201]},{"title":"\"It was Beauty that killed the Beast\"","rating":10,"date":"10 November 2003","review":"Pretty much sums up the movie, doesn't it? Who hasn't heard of King Kong? This movie is a major part of my childhood, it's one of the first horror films that I ever saw and I couldn't get enough of that giant ape. My mom always laughed at me because this is the first movie that made me cry, I rooted for King Kong all the way, all he wanted was that hot little blonde and to fight dinosaurs. Not too much to ask for. But why is King Kong so great? Why is it still very memorable? Besides the story that was incredibly interesting, the effects are absolutely amazing for it's time. When I was a kid, I seriously thought that they found a giant ape to star in the movie, give me a little credit, you believe anything at 4 years old. But this was the first movie to have tiny figures brought to life on film that were made to look like they were 80 feet tall. King Kong is character of it's own and this film is absolutely wonderful. <br><br>Carl Denham, a film director who is famous for shooting animal pictures in remote and exotic locations, is unable to hire an actress to star in his newest project and so wanders the streets searching for a suitable girl. He chances upon unemployed Ann Darrow, as she is caught trying to steal an apple. Denham pays off the grocer then buys Ann a meal and offers her the lead role in his latest installment. Although Ann is apprehensive, she has nothing to lose and eagerly agrees. They set sail aboard the Venture, an old tramp steamer that travels for weeks in the direction of Indonesia, where Denham claims they will be shooting. Despite his ongoing declarations that women have no place on board ships, the ship's first mate Jack Driscoll is obviously becoming attracted to Ann. Denham then describes something monstrous connected to the island he's sailing too, a legendary entity known to the islanders as \"Kong\". Finally arriving at the island's shore, they see a native village perched on a peninsula, cut off from the bulk of the island by an enormous wall. A landing party, including the filmmaker and his leading lady, goes ashore and encounters the natives, who are about to hand over a girl to Kong as a ritual sacrifice. Although Denham, Englehorn, Jack and Ann are hiding behind foliage, the native chief spots them and approaches the troop. Captain Englehorn is able to understand the native speech, and at Denham's urging makes friendly overtures to the chief. When he gets a clear look at Ann, the chief begins speaking with great energy. Englehorn translates this as \"look at the golden woman!\" The chief proposes to swap six native women for Ann, an offer Denham delicately declines as he and his party edge away from the scene, assuring the chief that they will return tomorrow to get better acquainted. Back on the Venture, Jack and Ann openly express their love for each another. When Jack is called away to the captain's quarters, a stealthy contingent of natives captures Ann, takes her back to the wall and presents her to Kong in an elaborate ceremony. Kong emerges from the jungle and is revealed to be a giant gorilla. The Venture crew returns to the village and takes control of the wall; half of the crew then go after Kong.<br><br>King Kong was a first of a kind horror movie, it had a story, terrific actors, amazing effects and a wonderful script. Faye Ray was the first actress I really looked up too as a kid, she was absolutely beautiful and such a great screamer, she made me want to lay in a monkey's paw for a while yes, I also needed to get out more as a child. But hey, you have to admit, if you ever wake up late for work, I'd rather take a giant ape then the bus or car to be caught in rush hour. Anyways, is this movie worth the look? Absolutely, it's a true classic that I guarantee you'll love. It's a great movie and still stands the test of time of making us believe that there are giant apes in third world countries.<br><br>10/10","user":"Smells_Like_Cheese","rank":[53,58]}]