[{"title":"Culp directs self, Cosby in brutally effective early-70s noir update","rating":8,"date":"20 April 2002","review":"Action and suspense films from the early 1970s have a distinctive period flavor to them. The surprisingly effective Hickey and Boggs  co-star Robert Culp's sole directorial effort  embodies that disillusioned and dissolute era of movie making. The rough and choppy editing, the oddly cropped shots keep the viewer on edge; so do the less than pristine cinematography and the cacophonous sound track, with dialogue overlaid on a constant, dull background roar of ambient noise. Often this proved to be a recipe for pretentious but empty disasters and cynical exploitation films; here, it all works to keep the level of unease  of menace  uncomfortably high.<br><br>Bill Cosby and Robert Culp play the title characters, a couple of down-on-their-luck Los Angeles private investigators. (Many moviegoers of the era apparently expected a big-screen reprise of their successful pairing in the television spoof of the 1960s, I Spy; how wrong they were.) They are engaged to find a missing woman by one of those creepily effete characters who, since Peter Lorre's Joel Cairo in The Maltese Falcon, exist only to set up private eyes in the movies. And as they go about their sleuthing, they uncover a trail of brutally murdered corpses, a situation which does not endear them to the police. They come to learn that the woman they're tracking holds the take from a robbery of the Federal Reserve Bank in Pittsburgh some years before; they've been hired as finger men by one of a number of murky but vicious groups seeking to retrieve the cash.<br><br>The movie forgoes crisp, clockwork plotting for a generalized miasma of corruption, duplicity and malaise. There are allusions to the turbulent politics of the times in the involvement of black militants and Chicano radicals; there are whiffs, too, of the specter of newly hatched sexualities that threaten the status quo. At the scene of one murder, they find crushed amyl nitrite poppers and gay porn, while the jaded oldster who engages them suns himself on a towel sited suspiciously close to a set of swings where young children are cavorting; for that matter Culp, in his cups and a masochistic, self-pitying mood, watches his ex-wife flaunt herself in a strip club to be ogled by drunken strangers. <br><br>The malaise, of course, becomes murderous in Walter Hill's very violent screenplay, touching Cosby's character (his estranged wife ends up tortured to death). Still, the two dead-end dicks soldier on, more though one another's goading than from any code or commitment  they're both on the verge of giving up and sliding down into the vortex of lust, avarice and revenge that has become their world (and by extension, THE world). Describing Hickey and Boggs makes it sound like the ultimate downer; it is, but it's an uncommonly compelling piece of film making, and one that has pretty much fallen through the cracks of movie history.","user":"bmacv","rank":[32,34]},{"title":"WOW","rating":30,"date":"30 July 2004","review":"A real treat. Cosby is straight as an arrow. Reminds me of Lee Marvin, here. Culp uses very simple but arresting technique in this directorial debut. His style may look limited but it is hard to imagine a film edited and paced in such a style today except maybe Soderberg's THE LIMEY. This is a key film in the PI genre. It should be seen. Very intelligent, very enjoyable and marvelously put together. It has the pitfalls of the era, the 'heavies' are like lumbering monsters and there is probably one chilli dog too many. But these are quibbles. It's a pity Cosby wasn't in more movies like this. And a damn shame that Culp never picked up the camera again. 8/10","user":"cabrelli9","rank":[21,23]},{"title":"Rather flawed, but still very good","rating":8,"date":"19 April 2002","review":"Hickey &amp; Boggs is not entirely successful - in fact, it has some major flaws - but it creates a powerful mood, and that's what makes it worthwhile. I will remember it, for a long time perhaps. In similar cases, the flaws will gradually fade from my mind and the film will seem better in my memory. Unfortunately, I'm pretty sure that the next time I watch the film (I had to get it on tape) the flaws will again be too big to ignore.<br><br>\nThe biggest fault is the film's editing. It's awful. I can't remember any other film where the quality of editing was such a big issue, but this is definitely one of them. Take, for instance, the shoot-out at the football stadium. The setup, where they cut to the various people involved in the proceedings, is very confusing and almost silly. You can't, for instance, tell where people are in relation to each other. When the action starts to go down, it should be quite exciting. Unfortunately, again, the editing never makes it clear where the characters are in relation to each other. It's even difficult at times to tell who's shooting at whom. Near the end of the sequence, we see one character run past another who has been guarding him with his machine gun. I had thought that the second man had been shooting at both him and Hickey. I could then finally tell what had been going on, but that doesn't help generate the past suspense and logic that that scene needed. The editing is also very quick, especially in the film's first half. It makes the story difficult to follow. Luckily, the editing gets better as the film progresses, but it's never perfect. Surely the editor deserves a lot of the blame - he clearly didn't have much of an idea what he was doing - but Robert Culp is partly culpable (ha-ha) as well. The editor is not the only culprit (there I go again) in that aforementioned stadium shoot-out. Part of the confusion is due to sloppy direction. Most of his direction is quite good, however. Some of it is downright excellent. This was his one and only film. Imagine how much better he could have gotten.<br><br>The script is also quite sloppy. Again, a lot of the confusion is due to the editing. Many scenes happen too quickly. But, on the script's side of the scale, I was never 100% sure who the different groups were. By the end, I was mostly sure, but there was still a bit of confusion. I would compare Hickey &amp; Boggs greatly with Chinatown, which was made two years later. But unlike Chinatown, which also has a very intricate mystery story, Hickey &amp; Boggs is never able to make sense out of the whole story. We shouldn't still be trying to figure out what has happened or who certain characters were when the end credits begin to roll. I also think that the film has a few too many P.I. movie cliches. Even Hickey's family situation, which is where the film gets most of its emotional power, is rather formulaic. Hickey is the type of guy who's too into his job, and his wife's angry at him all the time; Hickey still loves his wife and child, but he's not the greatest father (they actually develop his poor fatherly skills quite well). I would also have wanted more backstory to Boggs, although I kind of like the way the screenplay only hints at his life. They also needed to invest a little more emotional pull in the characters of Mary Jane and her husband. They tried, but didn't quite succeed. Just think of how powerful their last scene would be if we knew them a little better.<br><br>Now for the acting. The supporting cast is generally adequate, with one exception (a good one): James Woods. It was his second feature film, and he's already showing how great an actor he would become. His character is created rather sloppily, but he's still good in the role. Of course, Culp and Cosby are the main focus of the film. Culp, despite the fact that he directed, is actually more of the supporting actor. He's quite good, although, like I said, I wish that he had a more in-depth part. Cosby, on the other hand, is exquisite. I would doubt that he's ever had a better role in his life. His dramatic prowess is amazing, and he has several masterful scenes where his job is to remain rather emotionless, thereby multiplying the emotional effectiveness. It works wonders, and he should probably have been recognized for the performance.<br><br>As for other aspects of the film, the cinematography, by Wilmer Butler, is quite beautiful. He does a great job of bringing out the inherent darkness of sunny L.A. He also does a lot of magic hour stuff, and it is quite beautiful. I especially like the final shot. The musical score should be mentioned as well. Ted Ashford's score is very evocative, and it doesn't fall into the cheesier, Shaft-type funk, which I was expecting. George Edward's theme song is also very good. Also, the sound effects are great. That's odd to point out, but you'll definitely be influenced by some of them. Sometimes, sirens, like tornado sirens, arise out of nowhere and no one on screen aknowledges them. At other times, you'll hear this spooky, unembodied laughter. It's very disturbing. Overall, I give Hickey &amp; Boggs an 8/10. It should have been better, it could have been an equal to Chinatown. It is still a very worthwhile film that ought to be more available and more famous.","user":"zetes","rank":[13,14]}]