[{"title":"Thrilling and unforgettable -- a beautiful film","rating":9,"date":"16 September 2006","review":"We take home video and DVDs for granted now, but for film buffs who grew up prior to the video era it wasn't easy to track down silent movies. They were seldom aired on TV, and when they were shown, unfortunately, they were sometimes treated as laughable relics with \"funny\" interpolations. Thankfully, vendors such as Blackhawk offered good prints of many vintage titles in 8mm and 16mm, and museums in some cities would schedule occasional screenings. Consequently, as a kid I was able to catch memorable performances by Lon Chaney, Valentino, William S. Hart, and most of the great comedians. Mary Pickford, however, remained elusive. Aside from a few early Biograph dramas most of her movies were locked away in vaults, and shown infrequently. Awareness of her phenomenal fame lingered, but the movies that inspired that fame were difficult to see. I had only a vague sense of Mary's screen persona, and imagined she must have been an earlier incarnation of Shirley Temple, a goody two-shoes with blonde ringlets whose vehicles were mostly tear-jerkers. Eventually, of course, the situation changed, restoration efforts commenced, and Mary's films began to emerge from hibernation. In the 1980s Sparrows became one of the first Pickford classics to become available on good quality VHS, and once I saw it I understood Mary's appeal. Viewing it again recently on the big screen, at a Pickford festival at the Museum of the Moving Image in Queens NY, only confirmed my first impression that this is one of the most beautifully produced silent dramas ever made. It isn't flawless, and it isn't for all tastes, but it's powerful, moving and unforgettable, and the leading lady gives one of her definitive performances.<br><br>Sparrows is essentially a thriller, at times almost a horror story. Our setting is a bleak \"baby farm\" in a swampy bayou that looks like a landscape by Hieronymus Bosch. Mary plays an adolescent known as Mama Molly who acts as a protective maternal figure to a gang of scruffy, starving kids. These are children who have been sent away by families too poor to care for them, well-intentioned folk who naively believe their children will be raised properly. The farm is run by the most evil family you'll find in the movies: old Mr. Grimes, his wife, and her son, played by character actors Gustav von Seyffertitz, Charlotte Mineau, and Spec O'Donnell. Both Mineau and O'Donnell had backgrounds in comedy, but their performances here are deadly earnest and without a trace of humor. Good as they are, however, they're topped by Von Seyffertitz in what he must have recognized as the role of a lifetime. Grimes is a Dickensian monster: a greedy, spindly, limping man with dead eyes and no conscience. His prison-like farm is surrounded by quicksand and alligator infested swampland. The children in his keeping are treated as his property, and he'd sell any one of them down the river for a few coins. At the screening I attended a child in the audience responded to Grimes' evil-doing by loudly announcing: \"He's baaaaaaaaaaaaaaaad!\" It got a big laugh, but the kid only said aloud what we were all thinking.<br><br>Mama Molly occupies the story's moral center, but she's no goody two-shoes. She's been toughened by adversity, and she's fiercely protective of the youngsters in her charge. When Grimes' horrible step-son bullies them she is quick to stand up to him. And when Grimes threatens to punish the children by withholding their dinner, all because of a minor infraction on Molly's part, she volunteers to go without food for two days rather than see the children suffer. She is also the primary caregiver for a sickly baby who, despite her best efforts, dies one night in the loft of the old barn. In a scene some viewers may find a bit sticky, an image of Jesus appears at the moment of the baby's death and carries him away to the after-life. Sentimental? Sure, but it's performed with absolute conviction, and the close-up of Mary that concludes this scene is deeply affecting. (At the recent museum screening I attended we were shown several rejected takes of an earlier version of this scene in which the baby's spirit is carried away to the heavens by a phosphorescent angel. The out-takes were fascinating, but I feel the scene works better as it stands.)<br><br>Much of the credit for this film rightfully belongs to the scenic designer, Harry Oliver, and to the crack team of cinematographers, Charles Rosher, Hal Mohr, and Karl Struss. All of these artists have numerous impressive credits to their names, but their collaboration in this case produced something extraordinary, a movie that is exceptionally beautiful in design as well as beautifully photographed and edited. It's said that the production was influenced by the work of such German auteurs as Murnau and Lang, and indeed Sparrows has a distinctly \"Germanic\" atmosphere, but with greater emphasis on audience empathy; that is, the filmmakers really want you to feel for these kids. Our emotions peak during the climactic escape, when Molly leads the children through the swamp to freedom. Pursued by Grimes' dogs they dash across rocks, narrowly missing the quicksand, then climb trees and crawl over branches hovering just above alligators that swarm and snap. It's an amazingly suspenseful sequence.<br><br>Unfortunately, this is not the film's finale. The escape is followed by a gratuitous action sequence involving kidnappers attempting to flee the police by boat, and when this concludes we still have a couple more scenes meant to tie up the plot's loose strands. If the last twenty minutes or so had been reduced to a brisk seven or eight, the movie would have been just about perfect. Nothing can top the escape through the swamp, and it's too bad they made the attempt. Even so, in my opinion Sparrows stands as one of the most memorable works of the silent cinema, and Mary Pickford's crowning achievement.","user":"wmorrow59","rank":[28,31]},{"title":"Marvelous Mary In Her Final Little Girl Role","rating":10,"date":"17 December 2000","review":"A spunky orphan girl, enslaved on a horrible baby farm, looks after the younger children as tenderly as Christ cares for His little SPARROWS.<br><br>Mary Pickford, America's Sweetheart and the most popular movie star in Hollywood's history, had made a career out of playing little girls in general &amp; orphans in particular. Her legions of international fans thrilled at her adventures in harsh orphanages, dealing with stony-hearted adults. Time relentlessly marched on, however, and it became obvious that Little Mary could not carry on the adolescent act forever.<br><br>Thus, in 1926 at the age of 34, Pickford appeared in her final orphan picture and she made sure it was a doozy. Never before had one of her characters been subjected to such hideous conditions, surrounded by quicksand, starved &amp; overworked, living at the mercy of a self-avowed baby killer - a reptilian old reprobate who doesn't hesitate to `chuck children into the swamp' whenever he feels like it. Mary's audiences ate it up like sweet molasses on hot cornbread.<br><br>Several sequences are memorable. The selling of a little boy to a hog-buying farmer sets up a remarkably poignant shot: as the little fellow is driven out of the gates of the baby farm he feebly waves farewell towards the barn, where Mary &amp; the other children remain hidden; poking through cracks &amp; crevices in the wooden structure several hands sadly wave back. Later, the coming of The Good Shepherd for the dead baby cradled in Mary's arms would have been maudlin in less reverent hands; here it succeeds because it is presented with true emotion. Finally, the escape &amp; chase across the swamp, with desperate Mary leading eight tiny children through the perils of mud &amp; crocodiles, is still as exciting &amp; suspenseful now as it was at the film's inception.<br><br>Gustav von Seyffertitz makes a marvelously hissable villain; abetted by his vile wife &amp; unspeakable son, old Grimes is evil to his very core. His final fate is both just &amp; emphatically well-deserved.<br><br>SPARROWS boasts very high production values, and although burdened with a couple of climaxes too many, Mary's lively performance should effortlessly win over the toughest of critics.","user":"Ron Oliver","rank":[19,21]},{"title":"A Nice Gift From the Past for Lemony Snickett Fans","rating":10,"date":"28 June 2006","review":"United Artists in the mid-1920's stood outside the motion picture industry's block booking system. It owned no theaters and did not have enough films to offer them in blocks. This meant each of the UA producers (Griffith, Fairbanks, Chaplin, and Pickford) had to finance each film individually; not an easy thing with the rising costs of producing long features. While Griffith was digging himself into a big hole (which would ultimately cost him his production company) making epic films and trying to top his early successes, Pickford prudently operated on a smaller scale. The irony being that she produced the type of folksy stuff that Griffith had once done so well and so profitably. <br><br>\"Sparrows\" was her last appearance as a teenager; her choice because even in her thirties she would have been physically believable in these roles for a couple more years. Most often described as \"Dickensian\" because of its gloomy feel and slightly off-kilter production design, \"Sparrows\" is the original \"Series of Unfortunate Events\". It is regarded as the least dated of her pictures (maybe of all silents), fitting because it does not seem at all dated. Even the humor seems contemporary with little Molly misquoting bible verses with stuff like: \"Let not thy right cheek know what thy left cheek is getting\". <br><br>\"Sparrows\" is also more perennially appealing than any silent film. In fact you have to go all the way until 1933's \"It Happened One Night\" to actually supplant it. But it is a serious subject as baby farms are a historical fact and wealthy parents had reasons to fear kidnapping. The kidnapping in \"Sparrows\" has an eerie similarity to that of the Lindbergh baby, which would not take place until seven years \"after\" the film. <br><br>The \"look\" of the film reflects the German expressionist style and should delight Lemony Snicket fans and anyone who gets off on creepy-strange beauty. Set designer Harry Oliver \"aged the tree stumps with blowtorches, and the entire picture has that netherworld quality of a slightly stylized environment that could only be created in a movie studio\". Watch for the early scene where the baby farm operator crushes the little doll and drops it into the quicksand where it slowly disappears.<br><br>You also see a lot of Pickford's technique in Hal Roach's \"Little Rascals\". Check out the sequence when Little Splutters is leaving and his imprisoned friends are waving goodbye from inside the barn, by passing their hands through the slats. In fact Spec O'Donnell, who plays nasty stepson Ambrose, would later be a Roach regular. He is responsible for the film's first big laugh when he beans Molly with a turnip while she is trying to get the baby to stop crying. It is totally unexpected and even the baby finds it funny. <br><br>Also of note is the dream sequence where Jesus comes to take the baby to heaven. Modern special effects could not improve on what they got using a simple matte exposure process. A similar technique worked so well with the swamp scenes that a legend grew up that Pickford and the children were actually at risk from the live alligators used in the scenes. Probably no silent managed a more genuinely suspenseful sequence than when they are crossing a rotting tree limb which is slowly cracking and dipping toward the water full of hungry alligators. <br><br>Gustav von Seyffertitz does great as the evil Mr. Grimes (an early Snidley Whiplash) and is one of the best bad guys to come out of the silent era.<br><br>Then again, what do I know? I'm only a child.","user":"aimless-46","rank":[13,14]}]