[{"title":"Like GI Joe?? Gotta see this movie!!!","rating":9,"date":"19 June 1999","review":"If you loved the 1980s TV show you will love this movie.  G.I. Joe the movie is not mearly as good as the TV show, but rather is much much better. This movie comprises of the same guys we love (or love to hate), such as Duke, Sgt. Slaughter, Cobra Commander, Serpentor etc etc.  However, it is the new characters that really bring life and intrigue into this movie (ie. jinx, lt. falcon, nemesis enforcer, golobulus etc etc).<br><br>My favorite scene of this movie was the opening scene where pythona infiltrates the inpenetrable terradrome.  I also loved the slaughterhouse training, and the many changes that occur within Cobra Commander.  Then again, as a child I watched this movie all the time so I may be just a tad bit biased.","user":"MI$ gUy","rank":[4,4]},{"title":"Great movie","rating":7,"date":"30 May 2001","review":"I saw this film last night for the first time in ten years and I must say I still knew most of the dialogue! I saw it about a 1000 times when I was 10 years old. This film didn't loose the 'magic' when I reviewed it last night (other shows and films from my youth like Airwolf, A-Team and the Thunderbirds did loose their 'magic').<br><br>G.I. Joe The Movie is still a great, entertaining and fun cartoon. It's all about the origin of Cobra (G.I. Joe's nemisis). An ancient tribe of mutants (the ancestors of Cobra) want to take over the world and it's up the the Joe's to avoid this.<br><br>Despite its many flaws (some plotholes, continuity-goofs, etc.), it's still a great time watching it. This is certainly a film that defined my youth.<br><br>A 9 out of 10.","user":"SanderStrijbos","rank":[6,7]},{"title":"Would be very hard to top","rating":8,"date":"17 October 2001","review":"Yo Joe!<br><br>I'm proud to say that I love this movie.  I own it on DVD, and have watched it several times.  It just keeps getting better.<br><br>What makes this one of the great cartoons from the 80's was it's realistic nature.  The idea was obviously post- cold war type conflict put to paper, spawned a few characters, and was animated.  And, unlike a lot of crap made today and back then, it worked out very well.  And the reason was great writing.  The writers of the show/movie had to juggle a story around several dozen characters, tie it all together, make it work, and not overwhelm the audience with it.<br><br>Success!<br><br>Other cartoons couldn't do that as well as GI Joe, or even transformers, without coming off as sugary or presented in a way that talked down to its viewers.  And Gi Joe was always fresh with its story, and even kept elements of past episodes together in an ongoing story.<br><br>Now as far as this movie installment is concerned, watching it, you kind of get the idea that this was supposed to be a \"next generation\" type of story, especially dealing with new Joes on the force, and a new threat more powerful than Cobra.  Doing away with Cobra Commander wasn't a plot point I liked, because he was always a great character, but it had a valid reasoning linked into the movie, so I let it go.  I almost feel that the drama could have been heightened if Duke had died ( which was originally written into the script), but he is a great character, and we can't have a death on a kids' TV show like that.<br><br>The Cobra-La element is the one thing that I think was overplayed.  I like the idea of a dormant society from thousands of years back trying to reclaim the Earth, and the characters were cool, but the organic creatures that made up the base were a little too much, like a giant cockroach for a bridge, a big....whatever for an air transport.  These things stole some of the reality of the cartoon for me, but are still entertaining nonetheless.<br><br>If you're a fan, DEFINITELY watch this film!","user":"Skeletors_Hood","rank":[3,3]}]