[{"title":"Audrey Rose: An Underrated Supernatural Thriller","rating":10,"date":"11 December 2010","review":"Robert Wise may have directed \"West Side Story\" and \"The Sound of Music.\" But he has done a fair share of horror films and thrillers, including \"The Curse of the Cat People,\" \"The Day The Earth Stood Still,\" but most notably, \"The Haunting.\" However, hardly anybody seems to remember a 1977 film called \"Audrey Rose.\" It is another film from the famed director that, in my eyes, is very memorable and atmospheric.<br><br>Janice and Bill Templeton are leading a very happy marriage with their daughter, Ivy. The last thing they want is a strange man by the name of Elliot Hoover stalking them. Worst of all, he sets his eye on Ivy. Soon enough, they are able to talk to Hoover. He explains that his wife and daughter, Audrey Rose, died in a horrible car accident, and that his daughter may have crossed over into Ivy. Of course, Janice and Bill dismiss Hoover as a lunatic. But that's when Ivy begins to exhibit strange behavior. Could Hoover be correct? Is Ivy really the reincarnation of Audrey Rose? <br><br>Now, when \"Audrey Rose\" first came out in 1977, it was subject to mixed reviews, mostly because it was seen as a horror film, and I can understand why. It was released a few years after \"The Exorcist,\" when horror films were becoming more modern and faith was being challenged. But I don't see \"Audrey Rose\" as a horror film. Instead, I perceive it as a supernatural thriller with a touch of family drama. And it's a very good one.<br><br>Based on the novel by Frank De Felitta, creator of \"The Entity\" and director of \"Dark Night of the Scarecrow,\" \"Audrey Rose\" is a nifty thriller for three reasons.<br><br>First, Robert Wise gives superb direction. He registers the exact amount of passion that he had for \"The Haunting\" and he has chosen an effective story that challenges the beliefs of the viewer. Do we choose to believe Hoover in that his daughter has come back in the form of Ivy? Or is Ivy simply an ill child in need of psychiatric help? It is a great story.<br><br>Second, the acting is quite good. Anthony Hopkins and John Beck give very nice performances as Hoover and Bill. The wide-eyed newcomer Susan Swift is especially believable in the scenes in which Ivy shows off the nightmarish behavior of Hoover's dead daughter. But I, and many other people who have seen the movie, feel that the greatest performance belongs to Marsha Mason, star of \"The Goodbye Girl,\" as Janice. Once Audrey Rose takes over Ivy, Janice's fear of losing her daughter shows and Mason's acting intensifies as the movie goes on.<br><br>Third, the film has a tremendous atmosphere. The scenes of rain pattering on the windows as Ivy screams for her daddy are incredibly creepy, and so are the scenes at Ivy's school and inside the banal hospital.<br><br>There are plenty of movies about possession and bad seeds, but a reincarnation thriller is very uncommon. \"Audrey Rose\" may be a little long, but it is a super-effective supernatural thriller that is very creepy. It will leave you with questions, and raise ideas about reincarnation. Robert Wise has given us a thriller to remember.","user":"eytand94","rank":[19,25]},{"title":"Please Stop the Screaming","rating":3,"date":"25 May 2005","review":"I first saw this movie years ago when I was much younger. At the time, I thought it was great and very haunting. But now that I've seen it again as an adult, I can't believe I ever thought it was a good movie. The story itself is excellent, but the way it is presented is just plain awful.<br><br>The worst thing about this movie is the constant hysterical screaming Ivy does. It goes on and on in so many scenes, it just gets to the point where you hope and pray she either dies or someone kills her just to stop the screaming. It just destroys the entire later half of the movie.<br><br>The rest of the script is just horrible. It's just not done well. And the ending leaves you with a bad taste in your mouth.<br><br>The basic story of a girl who was killed in a fire at a young age and then reincarnated into Ivy is a very good story. But as I said, it's not played out right here. The script and the acting just ruins it. Really the only reason to see this film is to watch a pre-Hannibal Lecter Anthony Hopkins in one of his early roles. Other than that, I can't really see a reason to recommend this movie.","user":"Carrigon","rank":[24,37]},{"title":"Very avant garde for the time","rating":6,"date":"31 August 2004","review":"I've recently seen this movie again after at least 15 years. The first time it scared me a lot, probably for the weird look in Ivy's eyes and the screaming scenes... <br><br>Keep in mind that reincarnation was not a very common subject at the time, and I took it just as many other people, as a poor Exorcist copy. Now, knowing a lot more on the subject, I think it was not too bad given the time it was filmed. The hipnotic regression scene is well done, even though the ending probably can't happen in real life after a regression to a past life.<br><br>\nIt was great also watching a young Anthony Hopkins in such role. As always, he convinces you of what he is feeling, and the movie, not being excellent, keeps you interested. <br><br>I gave it a 6, considering the good original screenplay (for 1977), and the performances of Anthony Hopkins and Marsha Mason. I must say she seems a little \"too dramatic\", but that was her style.<br><br>If you like Anthony Hopkins and you want to watch a good old thriller, you must see \"Magic\" too.","user":"cyberxime","rank":[23,36]}]