[{"title":"'Money' well spent.....","rating":3,"date":"3 March 2005","review":"This is the rarest of the rare: a one-joke comedy where the one-joke is able to sustain the whole film. It all begins when Hanks and Long buy a big, grand, dream house in the New York countryside. It is, of course, too good to be true, after the sob-story old lady has sold it to them it begins to crumble into disaster. But because there are so many angles for the filmmakers to come from---collapse of stairs, wild animals lurking, bad wiring---it manages to hold itself together for around ninety minutes. A big credit goes to Hanks, who's facial expressions are priceless at times. Such as when he accidentally hammers his thumb. Too stunned to curse, he does what we all do, as he begins to beat the hell out of the object he was hammering. Even his charm in the earlier scenes, like dealing with a bratty kid-star, are funny. Long is good as his sort of straight-(wo)man, but Godunov steals all his scenes as her self-absorbed ex husband. Bosco is great as the grandfather of the entire construction crew, and even the sub-sub-characters are engaging as everyone always has a goofy line to chime in with, i.e. the infamous \"Two weeks\". But the coup de gras of the entire thing is a slapstick set-piece that brings down the house, literally. All I'll say is that involves Hanks going on a proverbial roller-coaster ride in and around the house for a good two minutes. The choreography and timing, starting with Hanks and going all the way down the extras, is amazing. Even if you aren't into the film, at least stay until that moment. There's an extra-marital subplot, that usually in a comedy, never fits. But because we like Hanks and Long so much, we get into it. And it leads to one of Hanks' funnier line readings ever. To the longtime fans of the movie: \"YOU WH*RE!\"","user":"mcfly-31","rank":[20,23]},{"title":"Mr. Hanks builds his dream (make that \"nightmare\") house","rating":8,"date":"12 August 2006","review":"I know, the critics ripped at \"The Money Pit\" when it got released. They apparently didn't realize that it wasn't pretending to be a masterpiece; it was a big excuse to be funny, and they succeed. Some of the gags her seem to forecast the equally funny \"Mousehunt\". Personally, I think that Tom Hanks needs to act in some more comedies, and Shelley Long needs to get more roles in movies. My favorite scene? Well, I get the giggles whenever I think of the whole chain reaction. Just the kinds of things about which anyone should worry when moving into a new house (although my family didn't have such experiences when we moved into our house).<br><br>All in all, it shows that Richard Benjamin is as great a director as he is an actor. My generation ought to give him the recognition that my parents' generation gave him. Also starring Alexander Godunov (one of the Amish guys in \"Witness\"), Maureen Stapleton, Joe Mantegna and Josh Mostel.","user":"lee_eisenberg","rank":[40,50]},{"title":"i love this movie","rating":10,"date":"31 March 2004","review":"i have seen this movie so many times and it is still hilarious. regardless of what others have said i think this movie is great.  the plot is not that well written but who cares this movie wants to make u laugh and it succeeds admirably.  I think that this movie is great and is one of my favorite all time movies.  It is absolutely hilarious.  Many think that Tom Hanks is a dramatic actor, but his roots are in comedy.  This movie proves that, he is absolutely perfect and hillarious.  Shelley Long although not great, is the best she has ever been in a movie.  Her timing and emotions are well fit for this movie.  You will laugh and be touched, please vote afterwards and make this rating go up.","user":"montana19boy","rank":[67,95]}]