[{"title":"A matter of style","rating":10,"date":"10 March 2003","review":"As many other Walter Hill films, The Driver portraits a stripped universe inhabited by archetypes. These are nameless, speechless and can trace their roots to the principles of Epic.<br><br>It can happen in any city, during the late 70s or nowadays but as a film noir in its essence, exclusively at night.<br><br>The performances are great and the car chases register no equal in film history. The pace of the delivery of lines is almost as suspensful as the story itself.<br><br>The minimalism of Hill's execution resembles the cinema of Jean Pierre Melville and the film's universe picks up there where Hawks, Walsh and Siegel left.<br><br>It's an exercise in style, a triumph of a clever mind, a loveable barren film that adresses, from particular detail, general, eternal issues.","user":"TheFerryman","rank":[84,96]},{"title":"A Fine Study In Cool","rating":16,"date":"16 August 2004","review":"I looked long and hard for this film and finally found it online... About a year ago I found the novelization at a local used bookshop and was enthralled. Then I shook loose a repressed memory of a scene from the Driver -well more like an image. That of Ryan O'Neal behind the wheel -shades in place, a study in cool. <br><br>Well I was obsessed and had to find the film. Once I did, it was like some sort of archaeological find. I popped it in the vcr (old school all the way) and sat back ready to be taken into a dangerous world of ruthless and amoral characters who live by some sort of twisted samurai code and law of thieves. <br><br>In a nutshell, this film delivered in spades. If you can find a copy of it, buy it or rent it. The car chases are extraordinary. The performances and cinematography are gloriously minimal and committed to the aesthetic of 'cool'. <br><br>It's a shame that junk like \"The Transporter\" and \"Gone In Sixty Seconds\" have come to embody the modern day equivalent of the existential bad guy and wheelman. Those films aren't fit to shine the chrome of this one. <br><br>One of Walter Hill's Best. <br><br>Thumbs Up.","user":"WDD","rank":[73,84]},{"title":"No Names Please!","rating":9,"date":"4 November 2005","review":"There is no baloney in this surprisingly good movie (it's not well-known). It also sports a real oddity: no one's name is mentioned in the entire film! Try to think of any other film you've ever seen where this is the case. <br><br>Why 'The Driver\" is not better known is a mystery since the director (Walter Hill) and main actors (Ryan O'Neal and Bruce Dern) are well-known entities.<br><br>Maybe because Ryan, who people think of more as the likable male in the immensely popular \"Love Story,\" \"Paper Moon\" and \"Barry Lyndon\" plays against type, playing an ultra-serious criminal. Make no mistake: he does it well. He is a man of few words in this movie and he handles that in a fascinating manner. Dern is always interesting. Isabelle Adjani, more famous as a French actress, is nice to ogle and she, too, doesn't say much in this film. <br><br>The rest of the characters in this \"neo noir\" are a bunch of nasties, giving that edgy feel.<br><br>If you like film noir and particularly if you like car-chase scenes, well, this movie is must-have, because there are several intense chase scenes in here and they are long. They're also well-photographed, fun to watch and certainly keep your attention.","user":"ccthemovieman-1","rank":[72,83]}]