[{"title":"Timeles Magic","rating":10,"date":"10 October 2007","review":"Can you imagine? Me, a film lover since the age of six, hadn't seen \"Singing In The Rain\" until last night. I had read and heard so much about it over the years that I knew I was going to be disappointed. As a musical I've never seen anything so perfectly \"in tune\" I can see how many directors have been influenced by the soul of this gorgeous movie. I've seen even Federico Fellini here. The tap routine with Gene Kelly and Donald O'Connor is so energizing that I wanted to see it again and again. The fantasy number with Gene Kelly and Cyd Charisse is breathtaking, breathtaking! How extraordinary to see Debiee Reynolds going through the contagious (Good morning!Good morning!) I had seen her a few nights before as Grace's mother in \"Will and Grace\" She hasn't lost her zest. I'm sure I'll be seeing this movie many times and I intend to show it to very young people from the post MTV generation and I'm betting with myself that they're going to love it. Greatness is timeless.","user":"primodanielelori","rank":[68,76]},{"title":"A fabulous musical romance about film technology","rating":10,"date":"1 May 2005","review":"Don Lockwood (Gene Kelly) and Lina Lamont (Jean Hagen) are a famed Hollywood duo, making films at the tail end of the silent era. The studio has been issuing PR suggesting that they're a romantic item. In reality, they can barely stand one another. One night, while on the town with his best friend Cosmo Brown (Donald O' Connor), Lockwood has to run to escape fans who want a piece of him badly enough that they'll literally rip his clothes to shreds. He hops over a number of moving vehicles and ends up in the passenger seat of Kathy Selden's (Debbie Reynolds) car. Lockwood seems immediately taken with her, but she gives him the cold shoulder. She says she's an actress with a love of theater, and she looks down on film acting. Later, Lockwood discovers that she was inflating the truth a bit, as he sees Selden performing as a cute song &amp; dance girl at an industry party he's attending. She runs out of the party and Lockwood chases after her, but he's too late. While he tries to track her down, he, Lamont and their studio have to deal with the changing nature of film in 1927--made much more difficult by the fact that Lamont may look glamorous, but she talks more like Fran Drescher in \"The Nanny\" (1993).<br><br>Aside from the more serious aspects of the plot, Singing in the Rain is a great success as a romance and a musical. It also has an astoundingly rich Technicolor look, and it is charmingly humorous. Kelly and Reynolds click on screen, even if offscreen Kelly, who also co-directed and co-choreographed, was famously difficult to work with--he drove Reynolds so hard (she was a much more inexperienced dancer) that her feet literally started bleeding at one point. The songs are great, they're worked into the story well--which is perhaps surprising given that most of them weren't written specifically for this film--and the choreography is impeccable, frequently jaw dropping and always aesthetically wondrous and sublime. If for nothing else, the film is worth a look for its often-athletic dance numbers, which can resemble Jackie Chan's showy martial arts stunts as much as dancing. It's also imperative viewing for cultural literacy in the realm of film.<br><br>But the more serious aspects of the plot are fascinating as well. In a significant way, Singing in the Rain is about film technology. Film technology is the hinge of the plot, after all. The climax and dénouement are decided by the advent of synchronized sound in the film industry. We see studio head R.F. Simpson (Millard Mitchell) demonstrating sound films at the party where Lockwood sees Selden for the second time, providing two big turning points at once. There are sequences of actors heading off to diction coaches, as happened in reality once sound entered the scene, and also in reality as in the film some actor's careers were jeopardized by having to suddenly master a new skill.<br><br>But Singing in the Rain is about technology on another level, too. Kelly and co-director Stanley Donen go to great lengths to ensure that the film is an exemplar of state-of-the-art film technology in 1952. For example, the beautiful Technicolor cinematography is emphasized by the fabulously colorful costumes and production design--they're showing off cutting edge color. The sound is as good as it could be in 1952, and the fact that this is a musical helps show that off. The sets and effects are complex and an attempt is made to show them off as well.<br><br>Donen and Kelly often play up the artificiality of the sets and effects to emphasize artistry and technology. This is clearly shown in the \"Make 'Em Laugh\" sequence (and surrounding events) and the extended \"Broadway Rhythm Ballet\" sequence with Cyd Charisse. Showing off this artistry and technology also occurs very subtly, as with the rain in the \"Singing in the Rain\" sequence. Even today, rain machines are frequently employed in a way that it appears to be raining on film, but in reality, it's just enough coverage to produce the illusion. In the \"Singing in the Rain\" sequence, they make sure that you can see the whole area is getting flooded, and they use Gene Kelly's umbrella, as torrents of water bounce off of it, to emphasize that no matter where he goes, \"rain\" is pouring down on him.<br><br>While there are many musicals I like as much as Singing in The Rain, this is one of the better-loved examples of that genre, and for good reason. Any musical lover has surely seen this already, and if not, they should run out now and pick it up on DVD. If you're relatively unfamiliar with classic Hollywood musicals, this is one of the best places to start.","user":"BrandtSponseller","rank":[105,130]},{"title":"A Classic","rating":9,"date":"22 January 2018","review":"Last year I was very lucky to catch this on the big screen. This film is meant to be seen on the big screen! It was also the first time I saw it at the theaters and I was very impressed with the visuals.<br><br>In this film movies are switching over from being silent to being \"talkies\". However the film is a spoof of the turmoil that afflicted the movie industry in the late 1920s when movies when the change over went from silent to sound. When two silent movie stars', Don Lockwood and Lina Lamont, latest movie is made into a musical a chorus girl is brought in to dub Lina's speaking and singing. Don is on top of the world until Lina finds out.<br><br>This is such a great film that if you ever get the chance to see this at the movies then DO IT.<br><br>Gene Kelly and Debbie Reynolds made an awesome team.","user":"Sober-Friend","rank":[16,17]}]