[{"title":"Classic Kung Fu Fun!","rating":7,"date":"10 March 2005","review":"This movie is one of the many \"Kung Fu\" action films made in Asia in the late '70s - early '80s, full of cheap sound effects, dubbed dialog and lightning fast martial arts action. But unlike most films of this genre it also has a decent plot and lots of great comedy. When workers of a dye factory are forced out of their jobs by Manchu bullies, they hire a con-artist (Gordon Liu) to try to scare them off. When his attempt fails miserably, he cons his way into a Shaolin temple to learn to fight for real. But instead of making him a Kung-Fu student, the Master instead orders him to build a scaffolding to cover the roofs of all 36 chambers. Well, it turns out that while he's performing these menial tasks (stacking and tying bamboo poles) that he's learning the skills to be a Kung-Fu expert! It's sort of like in Karate Kid when Mr. Miagi teaches Daniel the basics of karate by having him do routine household chores- \"Wax on, wax off\" et cetera. There's lots of great comedy from beginning to end, and plenty of action at the end when Gordon Liu once again faces his Manchu tormentors. \"This time it's not just tricks- it's the real thing!\" Liu declares, proudly thumping his chest. If you like classic Kung Fu films you don't want to miss this one!","user":"WhitmanPriceHaddad","rank":[10,11]},{"title":"Return as someone new","rating":6,"date":"9 April 2010","review":"I love kung-fu and bought this movie under the name 36th chamber, I thought it was THE 36TH CHAMBER OF SHAOLIN. I paid $1 for it and the quality was horrible, so I decided to go and buy the DRAGON DYNASTY release of THE 36TH CHAMBERS OF SHAOLIN. I was going to toss the older version when I happened to notice it was Johnny Wang on the cover, so I put it in the player and sure enough it was RETURN TO THE THE 36TH CHAMBERS. Now I've gotta get a better version of this film, because the DVD I have is a VHS transfer dollar DVD and it's horrible.<br><br>Anyway so Gordon Liu is back, but this time around he is playing a new character. I really loved him as San Te on the first one, it was a serious and dark Kung Fu gem. This one he plays Jen Cheh and its one of those comedy/kung-fu mixtures. I must admit I was extremely disappointed that it wasn't a real sequel to the first. I wish it had been under another name completely and still used the 36th chambers, its not like anyone could replace Gordon for the part, it just needed a different title. I hate when sequels get off from the first movie and do something like this.... NOT TO SAY THIS IS A BAD MOVIE AT ALL...<br><br>Far from bad, this is a great film, unfortunately I have a horrible full screen version so I couldn't appreciate all Master Liu's direction had to offer, I know it was good for what I could tell and even in full screen it captured a lot of the beauty of the fights, especially in early scenes where Jen was pretending to be a monk.<br><br>Gordon put on a lot of weight in the few years in between these movies and looked less like a kung-fu champ and more like a regular guy, which was good for his characters humble beginnings but not so good for where his character would've ended up with all that work and pseudo training.<br><br>The movie has a small town's biggest economical leader (a dye shop) taken over by ruthless bosses in order to get a better assembly. They cut the pay and refuse to let workers leave, so when a beggar posing as a monk comes to town they use him to fool the bosses and scare them with his fake fighting style. Ultimately the bosses find out this monk is a liar and they beat him up. He then goes to Shaolin Temple, and unlike San Te in the first film, Cha Jen Cheh doesn't get in to train with the others, he is instead told to work and build scaffolding and repair all the roofs of all the chambers.<br><br>He sets off working, and even sleeping on the roof and spends all of his time watching the other pupils train. He mocks and imitates their moves and becomes an almost acrobatic master on his scaffolding. Once he finishes the job over a year later he asks to join now that hes done the work and the monk still refuses. He goes back home to sadly tell everyone he didn't get to train and they wonder what he's been doing for over a year while he was away. He soon realizes that he is a master of kung fu simply by watching and the imitation practices he had been doing and he takes on the evil boss played by Johnny Wang in one of the best fights ever filmed.<br><br>You can never go wrong with the Shaw Bros. I've said it a million times.. here brothers Gordon and Chi-Liang once again made a damn good movie...<br><br>It a great film and if you love martial arts you will wanna check it out, its not a true sequel, but stands alone perfectly. My flaws was that it was super slow building up to the action, it had way too much of a comedy aspect and I gave it 6 out of 10 stars.","user":"pkzeewiz","rank":[4,4]},{"title":"Eeeeuurgh, great Kung Fuuuuuuu!!!","rating":4,"date":"4 September 2004","review":"This film is absolutely awesome. I saw it with my brother when we were kids, and we found it hilarious. <br><br>I'm not sure if it's supposed to be funny, but by god we were hurting by the end! Like the bit where he showing the bad guys what he's learned at the Shaolin temple, and he's working his way up from showing them a mere 50% of his new powers, to \"the full 90%\".... What happened to 100%?<br><br>And the bit where, in order to show his pals what he's learned, he beats them all up! He whacks his best mate in the stomach, and his mate (who has teeth that are literally about two inches long sticking out of his mouth), bends over and exclaims; \"eeeeuuuuurgh, GREAT KUNG FUUUUUU\". It's a classic movie moment! <br><br>If you have chance to see this film, do it. It's brilliant!","user":"peterworrall","rank":[11,16]}]