[{"title":"A snap-shot of the moment between youth and reality.","rating":10,"date":"5 March 2004","review":"This is one of my favorite movies, but for personal - not cinematic - reasons.<br><br>During high school I lived without parents, and frequently my house resembled the house in the pic. It was filled with teens and early twenty-somethings who were trying to either get the hang of standing alone as adults or ignoring the fact that they'd passed childhood up altogether.<br><br>Most people may not realize that the movie gives a fairly accurate description of that (sur)reality. It may seem shallow or pretentious, and it may lack in \"deep\" plot twists and turns. The thing is, at that age, and in that type of life you live without worrying about the next day because it's just too big a concern to deal with. Most will never live, or think/feel this way.<br><br>On the cinematic side: the movie is not for someone sitting down to \"view a good book.\" It's more a chance to turn off higher functions and experience another side of the world (not just Australia, but the time period and lifestyle). It's also important to note that this is not a Hollywood \"teen\" or \"young adult\" comedy - it's a drama with a lot of nonsense included, because that's what life is like.<br><br>It really is a shame that the movie isn't more widely available. I still own it from the original release, and only one of the rental stores (family owned) in my area has a copy. I'm sure it would more than meet the price to release to DVD. (I'm certain that a double disk including the original soundtrack would actually sell quite well!)<br><br>If you find it, watch it.","user":"catgrin","rank":[20,20]},{"title":"Punk rawk! Raw and real.","rating":10,"date":"26 November 1998","review":"This is for when you're feeling like you need some company, but you don't feel like venturing past your doorstep. It's a good example of \"slice of life\" cinema, taking us through the dirty, drug-addled day-to-day life of a punk commune in 1978 Melbourne. The late Michael Hutchence was the best choice to play Sam; though the film is a true story, it seems as if the role were written for Hutchence. Several of the parts were cast with non-actors, people that director Richard Lowenstein found in public, and that only adds to the gritty realism of the film. It's almost enough to make me wish I had been there. The strong performances by Nique Needles (as Tim, a friend and bandmate of Sam's) and Saskia Post (as Sam's girlfriend) are icing on the cake. As a bonus, you won't find a much better soundtrack - Iggy Pop, The Boys Next Door (later the Birthday Party), Brian Eno, Gang of Four, Dogs In Space (Hutchence and other actors/musicians from the film) and Melbourne locals of the day.","user":"il_matto","rank":[19,19]},{"title":"Interesting document of a forgotten era.","rating":4,"date":"4 July 2001","review":"I had fond memories of this movie for years, but on a recent re-viewing I was put off by the obnoxiousness of many of the characters here. They all seem shallow and self-obsessed, but that is probably an accurate portrayal of this period in Melbourne music history, and my reaction most likely has a lot to do with getting older, and being less sympathetic to the follies of youth.<br><br>'Dogs In Space' documents a fairly obscure but important period of Australian music history - the \"little bands\" scene, when punk turned weirder, artier, and generally more electronic. No other music scene in the world was EXACTLY the same, but the New York 'No Wave' era is the closest equivalent. Out of this melee came cult heroes The Birthday Party, but also many other acts that were hardly recorded, if recorded at all. This movie attempts to redress that. Director Richard Lowenstein lived in the house that inspired this story and hung out with the real band that is fictionalized here.<br><br>While not perfect, this movie has a lot of energy, some great music on the soundtrack (Iggy, Boys Next Door, Eno, Gang Of Four, Marching Girls), and there's enough of interest going on to make it highly recommended to anyone curious about late 70s/early 80s music. The late Michael Hutchence (INXS) may have rough acting chops, but he exudes enough charisma to make you wonder what might have been movie-wise for him.<br><br>By the way, keep an eye open for an early appearance of Noah Taylor now seen in more mainstream Hollywood fare like Tomb Raider!","user":"Infofreak","rank":[14,14]}]