[{"title":"Martin and Lewis become movie stars","rating":23,"date":"23 June 2004","review":"A decade earlier, Abbott and Costello became movie stars with a pair of World War II military films, \"Buck Privates\" and \"In the Navy.\" Here Martin and Lewis march in their bootsteps during the Korean War. The plotted and scripted comedy framework for this film may not be anything special, but the Martin and Lewis set pieces remain great. With hindsight, you can see the grounds for the pair's breakup this early in their career. Martin is charming when he's allowed to sing or do a solo bit, but his character is an unsympathetic bully to Lewis' hapless fumbler -- Bud Abbott at his most brutal to poor Costello. <br><br>The glimpses of bits of their stage and radio act, however, are funny -- their byplay before a band; their imitation of Bing Crosby (Martin, of course) and Barry Fitzgerald (Lewis)in \"Going My Way\"; Lewis in blonde drag (with a hairy chest showing over the v-neck of his dress) singing a husky-voiced torch song to Mike Kellin, and Martin's underplayed double-take and mumbled, \"No, couldn't be,\" as he passes by them. <br><br>One special highlight is Polly Bergen in an early brief part as Martin's girlfriend. (The movie's credits read \"introducing Polly Bergen,\" but IMDb lists two previous roles for her, one just a voice part.) This is Bergen before she had an absolutely perfect face with an absolutely perfect nose, but still, as Martin sings \"You and Your Beautiful Eyes\" to her, she is given a lengthy, star-making closeup in which she smiles and becomes luminous, and her future career is assured.","user":"gimhoff","rank":[20,21]},{"title":"Martin & Lewis Take on Uncle Sam","rating":10,"date":"7 May 2004","review":"1st Off, Great Movie. I was in the Army, and I can tell you the orderly room sequences were very realistic, much more like the Army I was in than lets say From Here to Eternity. The First Sgt, the Company Commander, The Supply Sgt, The Platoon Sgt and the Privates were just too hilarious &amp; realistic to believe. Along with the great Musical &amp; Comedy skits by Dean &amp; Jerry I rate this movie much higher than some of their later ones, ie, \"The Caddy\" &amp; \"Thats My Boy\".<br><br>But all in all I recommend the viewer to watch this movie in its entirety and if the viewer happens to have served in the military before, I guarantee this will ring the remember bell of the funny &amp; not so funny times of their military service. Along with films like \"Stripes\" this one is a keeper. Check it out.","user":"RobboWaggs","rank":[28,34]},{"title":"\"The Navy Gets The Gravy, But The Army Gets The Beans.\"","rating":7,"date":"2 August 2006","review":"For their new comedy team of Martin and Lewis Paramount acquired the rights to a short run play on Broadway entitled At War With The Army and adapted it for Dean and Jerry. Although they don't have all that much together time on screen, Dean and Jerry do have their moments individually and together.<br><br>At War With the Army was their first starring feature and while the vehicle seems stage bound in its first half, the second half more than makes up for it. Especially with Jerry Lewis on the obstacle course being 'helped' by Sergeant Mike Kellin.<br><br>Kellin, who was in the original Broadway cast, really competes with Lewis for the laughs in this film. His characterization as a brain dead drill sergeant is really good.<br><br>Dino gets to sing Tona Wanda Hoy in this film and while it sold a few platters he never got a real big hit out of a Martin and Lewis film until That's Amore in The Caddy.<br><br>At War With the Army bears some resemblance to the Abbott and Costello films Little Giant and The Time of Their Lives where Bud and Lou play separate roles and aren't really a team. Dean and Jerry do that here, but there's enough team work so their fans wouldn't be disappointed.<br><br>The film was directed by Hal Walker who did a few of their early films and who had good training as he did a Road picture or two with Paramount. They also did a takeoff of Going My Way with Jerry nailing Barry Fitzgerald down. Then again everyone said Dino sang like Bing anyway.","user":"bkoganbing","rank":[21,25]}]