[{"title":"No small thing.","rating":11,"date":"11 April 2004","review":"This movie changed my life. It changed it in the sense that after seeing it I developed a life-long passion for Italian films after first seeing it in 1955 when it appeared at a local movie theatre in a revival five years or so after its original appearance. I was only 13 at the time and somewhat of a precocious chooser of what films to go see. I have seen THE BICYCLE THIEF (\"Bicycle Thieves\" in England and plural as well in its original Italian title) hundreds of times since and never tire of it. The fact that the film has almost never been out of circulation since its making and is constantly shown in revivals, festivals and film classes attests to its endurance. Martin Scorsese does a glorious appreciation of it in his documentary on the Italian cinema, IL MIO VIAGGIO IN ITALIA. <br><br>What makes it so enduring? What is so damn great about the movie? It is not its trenchant portrayal of post-war Italian poverty and misery. Lots of films did that even better. It is not in any sense of real drama, which is very schematic. Nor even the unforgettably truthful acting, that iconic face of pint-sized Enzo Staiola. We get truthful acting and iconic faces all over the place. It is, I believe, its sense of compassion, its sense of poetry. Those are rarer qualities. The movie is compassionate poetry. I don't know if writer Cesare Zavattini or director Vittorio De Sica would have appreciated that phrase. I feel they might have. I feel it is exactly the truth they were after. To be sure, the film is a story of father and little-boy in search of what is lost, a necessity yes, but also a lost dream. The endangered hope for a better life to come challenges this paternal/filial relationship. In that sense, this is a film-poem, God help me, about Everyfather and Everylittleboy. <br><br>The most chilling moment in the poem occurs when little Bruno sees his father steal, and a tearful horror glazes his face as a god seems to collapse. The most redemptive moment comes shortly thereafter when the boy slips his hand into his father's. That forgiveness is not cheap or facile. It is unassailable and all-comforting. It is a forgiving embrace of Virgilian dignity. For a magnificent instant the father, Antonio, has become the son; Bruno, the son, has become the father. At the end, when they walk off into the Roman crowd, they are as one. <br><br>I have written many thoughts about this film over the years, including an extended exegesis for a local newspaper. I have programmed it in film series, shown it to film classes, Italian classes. I know the movie. Friends, the movie is not about stolen bicycles, indifferent police, bicycle chop-shop gargoyles, mouth-foaming lowlife, desperate actions by the desperate, or mere journalistic human interest that is gone with tomorrow's edition. Its worth resides in its lyric portrayal of the eternal curative power of love. No small thing.<br><br>Two addenda: the song being rehearsed at the workers' club Antonio visits to see his friend is called \"Ciccio Formaggio.\" The song being sung and played by the restaurant musicians when Antonio and his son eat together is \"Tummuriata nera,\" about the mulatto offspring of an Italian woman and a black soldier. The lyrics for both songs, in Neapolitan dialect, can be found by Googling the titles. Recordings by Roberto Murolo of both songs are available.","user":"ItalianGerry","rank":[191,209]},{"title":"Quiet Desperation---Italian Style.","rating":2,"date":"2 May 2003","review":"In post-World War II Italy poverty is a dire reality for a large portion of the population. Work is scarce and the opportunities for employment are few and far between. \"Ladri Di Biciclette\" (translated \"The Bicycle Thief\") is quietly one of the finest films ever produced. It follows one economically distraught man (Lamberto Maggiorani) who is heading down a desperate path fast. Things look up when he gets a job putting posters on walls in town, but he must sell what few meager possessions he and his family have to buy a bicycle to uphold his end of the business bargain. Naturally tragedy strikes immediately as the title character shows up the very first day Maggiorani is on the job. The police are little help, believing the bicycle is not as important as it really is. Thus Maggiorani and young son Enzo Staiola take it upon themselves to look all over town to try and find the bicycle and bring the thief to justice. \"The Bicycle Thief\" was originally released in 1948 and won an Honorary Academy Award for Best Foreign Language film the following year (the movie was not released in the U.S. until 1949). It is still a production that strikes deep even today. The lengths and desperate measures that some go through is very evident here. Director Vittorio De Sica crafts a film that is much deeper than it appears on the surface. It examines the human condition and questions society, family, law enforcement, alliances and mental anguish perfectly. \"The Bicycle Thief\" is an excellent production that has aged well and allows the viewer to think about many subjects that go beyond ordinary cinematic depths. 5 stars out of 5.","user":"tfrizzell","rank":[131,147]},{"title":"Heartfelt Drama of Post WWII Poverty a Must-See...","rating":8,"date":"16 April 1999","review":"The Italian neo-realist film movement began around the end of WWII with Roberto Rossellini's OPEN CITY in 1946.  It is defined and encapsulated by this striking film directed by Vittorio De Sica.  THE BICYCLE THIEF is the best of a group of films that depicted the hardship and despair that Europeans, specifically Italians, went through after the death and destruction of the war.  The economy was horrible, and the towns and cities were half-destroyed and decaying.  Rome is the location for THE BICYCLE THIEF and De Sica shoots the city in grainy black and white with non-professional actors to get a simple, yet unbearingly emotional point across.  A simple thing such as a bike can be someone's entire world at that time and losing it means doing something irrational or perhaps necessary.<br><br>The lead in the film is played by Lamberto Maggiorani who seems to be a very good actor.  He is not an actor, however, and maybe this is why the film hits its mark so well and comes across so realistically.  Maggiorani is of this difficult world and his brooding face is a clear indication of this. His job is to plaster film posters up on the walls of buildings all over Rome.  He even hangs a picture that symbolizes the absolute opposite of the misery surrounding him.  Rita Hayworth from GILDA is on the walls all over the city, a sign of joy to some, a representation of their own lowly status to others.<br><br>When the bicycle is actually stolen, the \"title\" character is sought after by Maggiorani and his young son (Enzo Staiola), a little kid with so much acting ability, you swear this must be a documentary.  A grueling search throughout Rome has the essential parts of the movie, because we see up close the actual people and places the neo-realist film movement came to represent.  It is a small, sad world they live in and the bike has to be found so that they can live.  The father is put to the ultimate test in front of his son.  Will he do the honorable thing or will he do what his mind and heart know is only possible? These are the tense moments of the film's climax.<br><br>There is a lot of THE BICYCLE THIEF in Benigni's LIFE IS BEAUTIFUL and some obvious comparisons have been drawn because of the father-son relationship. They are worthy of comparison and have equal artistic prowess.  What is different about THIEF is the level of intensity maintained throughout.  I felt the key element was the music by Alessandro Cicognini, a simple horn that plays so tragically that it is a main character in the picture.  What De Sica does here, as well as other neo-realist directors (Rossellini, Fellini), is create for American audiences a powerful counterpoint to what we are used to.  An honest, non-corporate portrait of the struggle for life and self-respect.  THE BICYCLE THIEF is one of the finest films ever made.<br><br>RATING: 10 of 10","user":"Don-102","rank":[125,147]}]