[{"title":"Surprisingly entertaining.","rating":7,"date":"22 April 2005","review":"Better known for his jungle cannibal opus \"Make Them Die Slowly\", Lenzi has here a much more accomplished and entertaining gut muncher.<br><br>On an unassuming day, a nuclear scientist is supposed to arrive with important research. His plane breaks flight patterns and lands unannounced. When authorities go to investigate, they find all the people on board are infected with strange kind of radiation poisoning and have turned into violent, cannibalistic zombies. The zombies then begin attacking any and every one in sight; hacking, shooting and eating all they can. Escaping the city is the only hope.<br><br>Coming out in 1980, this was pretty late in the cannibal/zombie movie cycle. Fortunately, Lenzi changes up the formula just enough to keep things from being stale. The zombies are are fast, intelligent and have no problem utilizing tools and weapons. Lenzi also ad hears to just enough genre clichés to keep fans happy. There is blood and gore aplenty, random flashes of nudity and some wonderfully cheesy dialogue.<br><br>On the technical side, the film is right on par with other films in the same category. Acting ranges from to OK to plain bad, lighting and sound get the job done but never excel, and the writing works well enough to move from point A to point B. One nice element is the pacing, which is refreshingly brisk and free of clutter.<br><br>Over all, this is one of the better made and more amusing of the cannibal/zombie films from days gone by. Genre fans should check it out.<br><br>7/10","user":"Ky-D","rank":[29,34]},{"title":"Well constructed horror trash","rating":26,"date":"26 May 2011","review":"On an airfield a plane's door opens and bloodthirsty zombies burst out and begin to overrun the city. TV news reporter Dean Miller must find his wife and escape the city's crazed killers.<br><br>Nightmare City (Incubo Sulla Cittá Contaminata)is a crude mix of the Crazies, Let Sleeping Corpse Lie to name a few. It also has a slight ambiance of Shivers and Rabid.<br><br>As you'd expect it's suffers from the failings of most Italian gore pictures of the time, bad dialogue etc. Nightmare City is certainly a product of its time. Nevertheless, while the makeup is terrible, the leads are more than effective. Umberto Lenzi's camera work, direction and starkness of the city setting are appealing. It's fast paced - packed with comic –like violence of stabbings, biting, hacking and shootings as the zombie maniacs cause blood soaked havoc in the city and surrounding areas.<br><br>The ending twist is quiet refreshing and although a cliché you don't see the device used these days. While not a zombie film in the truest sense, they move fast, can weld machetes and fire guns it's a competent splatter film that is far better constructed and executed than Bruno Mattei's Zombie Creeping Flesh (1980) made the same year.<br><br>Overall, it's one of the better trash horrors out there.","user":"amesmonde","rank":[11,12]},{"title":"The best of the best!! spectacularly entertaining and surprisingly original.","rating":7,"date":"20 May 2009","review":"disclaimer: obviously, if you don't have a pre-existing love for zero-budget Italian horror, this won't be your cup of tea.<br><br>But if you do! My, what a treat! I overlooked this film for years because I confused it with \"City of the Living Dead.\" I otherwise exhausted the genre's offerings. When I realized I hadn't seen this one, I was very excited, but I didn't expect much. I was in for a pleasant surprise.<br><br>Ugh, I'm no good at paragraph format.<br><br>The Pros: 1. The title, \"City of the Walking Dead,\" is appropriate. This really is a city-wide infestation. This is not a board-up-the-windows movie. The scale is epic. So often, low budget zombie films restrict themselves to a few characters on a farm or something to save money. This one doesn't. I can't imagine how he was able to use some of the locations. (Actually, I suppose the title isn't quite appropriate, because the antagonists are neither walking nor dead. They run, and they're sort of still alive.)<br><br>2. Breasts are present.<br><br>3. I usually don't like zombies that deviate from Romero's mold, but Lenzi takes a risk and scores. These creatures combine the hypnotic element of Romero's zombies with the overwhelming danger of running zombies. According to an interview on the DVD, Lenzi did not want to just do another Romero rip-off, and insisted on coming up with his own sort of creature. He did it well.<br><br>4. For the first 2/3 of the film, the characters are sufficiently believable for the viewer to care about them. For example, a reporter finds himself in the middle of the zombie outbreak, and desperately tries to get a hold of his wife, a doctor, who can't be reached because she's in surgery. This is a realistic, human element absent from most films in the genre.<br><br>Cons: <br><br>1. 2/3 of the way through, it kind of falls apart. The characters who haven't died reveal themselves to be one dimensional after all.<br><br>2. The special effects are really inconsistent. Sometimes killings are mimed bloodlessly. In other scenes, heads explode.<br><br>3. The soldiers are pathetic.<br><br>In short, highly recommended.","user":"amazing_sincodek","rank":[19,23]}]