[{"title":"\"If we should ever pass on the street, please don't recognize me.\"","rating":8,"date":"6 January 2009","review":"Lora Meredith, an attractive widow with theatrical aspirations, has lost her 6-year-old daughter, Susie, in the crowded beaches of Coney Island... She finally finds her in the care of Annie Johnson, a black woman, and her very light-skinned daughter, Sarah Jane, who had been playing with Susie Before long Annie goes to work as a maid for Lora and the two women become fast friends <br><br>Encouraged by an agent (Robert Alda), Lora gets a good role in a play by David Edwards In the years that follow, she becomes a successful Broadway actress and appears in one Edwards enormous hit But fame means work and work means neglecting Susie, now sixteen, who must bear the loneliness of a teenager whose mother is too busy being a star <br><br>A handsome photographer, Steve Archer (John Gavin), is the resolute, admiring love of Lora's life but he too must wait and suffer for her affection Meanwhile, Annie has big problems with her daughter Sarah Jane rejects her race, and refuses to accept she is black She disclaims her mother to camouflage her ancestry and eventually takes a decision with extremely drastic effect<br><br>\"Imitation of Life\" was an ideal tearjerker/soap opera for the major talents of Juanita Moore and Susan Kohner... Moore shined as the self-sacrificing mother so loving, honest and sincere Cleverly enough, Kohner projected unafraid sensualityBoth stars won Academy Award nominations as Best Supporting Actress","user":"Nazi_Fighter_David","rank":[33,40]},{"title":"You Can Feel the Soap Coming Right Out of the TV.","rating":8,"date":"17 March 2005","review":"Douglas Sirk did not do subtle romances; he embellished his stories with interesting yet vaguely exploitative elements more suited to the soap opera genre and then amped the melodrama to eleven.<br><br>IMITATION OF LIFE, basically a romantic potboiler by Fannie Hurst that would not be out of place in an Oprah's Book of the Month, is here given the grand Technicolor treatment and stars Lana Turner -- not particularly known for warmth or romantic heroines. This for the most part, is her movie and even as a struggling actress (hard to believe given her icy beauty) she is dressed impeccably and seems quite well-to-do despite her character being a waitress. That she improbably forms an alliance with Juanita Moore and her daughter Sarah Jane in tow (who cries at the drop of a hat and later has what seems to be a moment when she quietly cracks as she says \"White, like me\") is only to set the stage for the \"racial confusion\" that develops later on (and drives the majority of events) and would color the film with \"controversial elements\". <br><br>That Turner's success as an actress seems as forced as her romance with daughter's love interest doesn't detract the soapy elements of IMITATION, but Susan Kohner, playing Sarah Jane all grown up, steals the show and is the only one who rises above the drivel that surrounds her, carrying a lot of the film's weight in its second half. In playing her racial trauma and need for survival at least her story fits the times; light skinned blacks admit that they did have to \"pass for white\" in order to move on up, and with Kohner being half white, half Mexican only hammers the point home even more and exposes a lot of hypocrisy that at the time a light-skinned African-American actress would and could not be cast for this part.<br><br>The best scene comes when Kohner's beau, on discovering she is actually black, all but rapes her in a dark alley. It's the only sequence that doesn't reek of soap, and although Kohner's storyline eventually becomes muddled with her melodramatic interaction with Moore and her later appearance at her mother's funeral, it's really the most poignant part of this film and manages to reveal its soul. This was the cornerstone of Douglas Sirk movies: tell a good, tissue-friendly yarn that in its second half and conclusion would punch the audience with a strong moral and in this he succeeded, with followers in Herbert Ross' STEEEL MAGNOLIAS and James L. Brooks TERMS OF ENDEARMENT.<br><br>Douglas Sirk, after this film, would basically retire and leave behind a collection of overblown melodramas that have quite a following.","user":"nycritic","rank":[129,187]},{"title":"A Real Tear Jerker","rating":26,"date":"26 December 2003","review":"I have seen this movie a countless number of times and know the dialogue by heart. Each time I watch it, I say, \"I'm not going to cry this time\". Sometimes I almost make it, but then Mahalia Jackson starts to sing and I lose it. My children don't understand why Sarah Jane wanted to pass for white. I tried to explain to them that in that day and age, it was sometimes necessary. The beautiful Susan Kohner steals the film. It's a shame that she only made a handful of movies. To me the most heart-wrenching scene is where Annie visits Sarah Jane in her hotel room. She says' \"I want to hold you my arms one more time. Just like you were my baby.\" I puddle up just writing about it.<br><br>In Lana Turner's biography, she writes about the making of this movie. It was made shortly after her daughter stabbed Lana's gangster boyfriend to death. She said that when you see her crying in the funeral scene, those tears were real. When Mahalia started to sing \"Troubles of the World\", all of her troubles started to come back to her and she got up and ran out of the church. They had to run after her and bring her back to complete the scene.","user":"smrhyne","rank":[115,166]}]