[{"title":"Trippy & Ambiguous Sci Fi","rating":9,"date":"2 July 2006","review":"I have seen this film numerous times, starting when I was ten yrs old and it has always had a peculiar fascination for me. It moves a bit slower than most modern viewers are used to but it is pretty compelling stuff.The ant photography is amazing. When I was a small boy and I heard about this I was expecting something along the lines of THEM! and anyone who has seen this knows it is about as far from that as you can imagine. But even as a youngster wanting something more un-subtle and action-oriented, I was not turned off by PHASE IV's slow art-film qualities.It is a shame Saul Bass never directed again because this was a valiant effort to do something a little different. I say bravo! Seen in widescreen for the first time after years of TV viewings and the panned &amp; scanned VHS the new DVD of Phase IV is a revelation. The compositions and use of color are masterful.","user":"raegan_butcher","rank":[77,80]},{"title":"Truly Unique, a classic","rating":8,"date":"23 June 2005","review":"This is one of the strangest, suspenseful movies I've ever seen. It must have been at lest 15 years since I last saw it, and I'm still looking around for it to appear on DVD, so that must mean something! What this movie lacks in action, it makes up for in suspense, and suspense you get! I'm baffled by the fact that this movie appears to be so little-known. The beauty of these kinds of movies, is that they are not so much plot-driven as well 'atmosphere-driven' (by lack of a better word), so you can watch several times without getting bored. The Thing is another movie with the same quality. Basically: highly recommended!","user":"cynical-2","rank":[64,69]},{"title":"Phase IV: Incredible piece of cinema","rating":8,"date":"16 March 2019","review":"Though there are plenty of movies with ants as the antagonist I'll have to be honest with the exception of Them (1954) I've never really been able to take them seriously as a viable threat. I mean seriously, ants?<br><br>Phase IV managed to change my mind on that and made ants a legitimately terrifying credible enemy.<br><br>It tells the story of a pair of scientists who set up a lab in the middle of the desert where ants seem to have taken over. Right beside a failed desert development they underestimate the intelligence of their diminutive foes.<br><br>The first thing that struck me was how good it all looked, the movie is years ahead of its time in both cinematography and practical effects. The ant sequences are truly remarkable and not rushed as you tend to expect them to be for the mid 70's. They take their time, intricately crafting the ants world, telling their silent story and solidifying their credibility as threats to mankind.<br><br>I went in expecting some hammy mess, what I got was an elusive diamond in the rough and I'm very very impressed.<br><br>Well acted, visually stunning and paced perfectly Phase IV is a great sci-fi piece that didn't deserve to go under the radar the way it did.<br><br>Fantastic stuff.<br><br>The Good:<br><br>Well ahead of its time<br><br>Looks great<br><br>Ant footage is very impressive<br><br>Strong cast<br><br>The Bad:<br><br>The nagging concern of possible animal cruelty<br><br>Silly ant noises","user":"Platypuschow","rank":[16,16]}]