[{"title":"Not your average spaghetti western","rating":9,"date":"25 February 2007","review":"This movie is a lot of fun, and deserves more credit than it gets. It is quite unique among westerns, or even spaghetti westerns. It's so odd, in fact, that it really defies categorization.<br><br>Though it is without question a gloriously over-the-top spaghetti western, it actually relates more closely to \"Army of Darkness.\" In fact, I wouldn't be surprised at all if Sam Raimi was influenced by this film before he directed that great third installment in the \"Evil Dead\" series. In this film, Tony Anthony plays his usual role of \"the stranger\" (kind of a \"man-with-no-name' type of character). We learn right away that there is something supernatural going on here as the movie opens with the stranger being dragged by his horse into a ghost town. On the way there, they pass a strange silver orb, then when they get there, the horse has a heart attack and dies as the town bell tolls unexplainedly. Anthony walks into a building where he meets a witch who has the same silver orb at the table where she sits. He finds out he's been summoned to escort a Spanish princess back to Spain and help her regain her throne from \"barbarian\" invaders who appear to be from another time. This all happens in the first five minutes! I don't want to give away too much of the story, so I'll just say that the stranger's tasks are to deal with the barbarians, rescue the princess, find a treasure that is guarded by ghosts, and collect money that was promised to him by the witch. The movie is quite comical and full of slapstick, and just like Ash in \"Army of Darkness,\" the stranger unloads a huge can of whoop-ass on an army of foes. I would love to see the plot of this movie \"borrowed\" for a sequel to the Evil Dead series. Ash could once again be sent back in time, but this time to the old west where he would be the stranger. Change the treasure to the Necronomicon, have it guarded by Deadites, and bam you've got Evil Dead 5! They wouldn't even have to change much of the dialog as most of the stranger's lines would be perfect for Bruce Campbell as Ash.<br><br>Tony Anthony is great, as usual, in this one. He's like the Rodney Dangerfield of spaghetti westerns in that he doesn't get the respect he deserves. Eastwood's \"man-with-no-name\" may be the king of \"cool,\" but Tony Anthony's \"stranger\" is more of a character, and just as tough. The other actors and actresses in the film do an excellent job also. I especially liked the character of \"Sambra,\" a crazy Hunchback who thinks he's the reincarnation of Richard III.<br><br>This movie isn't for everyone. If you go into it thinking it is just a wacky late-era spaghetti western, and try to fit it into that mold, you will think it is trying too hard, and will probably find it to be just slightly amusing and nothing more. But if you can understand and appreciate the film for what it really is, and especially if you've enjoyed \"Army of Darkness,\" you should definitely enjoy this one.","user":"spider89119","rank":[17,17]},{"title":"1976: A Spaghetti Oddity","rating":5,"date":"4 April 2005","review":"Now this one really is an oddity! The Spaghetti Western did throw up a few odd films (think Django Kill and its homosexual bandits, Blindman with its 50 wives and nudity, the circus troupes of Sabata, and Providence with its Chaplin-esq antics). But, my, if you thought they were weird, wait until you get a load of \"Get Mean\".<br><br>Tony Anthony returns as the Stranger, but rather than being a parody/rehash (depends on how you view it) of A Fistful of Dollars, this film involves our hero on a quest to Spain to escort a princess for money, amidst the battling Vikings and Moors. Proof if any that the Spaghetti boom was on its last legs, desperately seeking new ways to be innovative.<br><br>Anthony is very ham-fisted throughout, but I guess that is part of his charm in this genre. The rest of the cast are, in truth, fairly forgettable.<br><br>However strange this film may be (and believe me, it is strange), it remains watchable. Not as a western, but as an oddball art-flick.","user":"marc-366","rank":[11,12]},{"title":"something different","rating":7,"date":"6 October 2002","review":"Watching this \"western\" is certainly a unique experience. The plot revolves around the return of a Spanish princess from America to her native country Spain. To help her she enlists the aid of a reluctant hero (Tony Anthony).<br><br>It takes them only a minit of music and a dotted line on a map to reach their destination. Where they are just in time to witness a battle between the moors en the vikings. The vikings being the bad guys kidnap the princess immediately afterwards. The rest of the story involves a villainess hunchback who compares himself to Richard III, a treasure guarded by magic, an inbred member of the royal family and an aggressive vikingking.<br><br>With a combination of all these elements one can only laugh. Tony Anthony fails as a Clint Eastwood impersonator but that makes the movie only funnier. And it is a funny movie although the fun is mostly unintentional. Also one must admire a movie that tries so hard to be special.","user":"rust-7","rank":[7,8]}]