[{"title":"Underrated and enjoyable film","rating":24,"date":"24 January 2000","review":"Sure, the movie shows some skin, but that's not all there is to it, so don't let the prospect of that keep you from watching this movie. There's much more to it than that. Sitting down to watch this film, you're immediately drawn in by one of the most ambitious parts of the film - the history of the Chicken Ranch, decade by decade, depicted with singing, dancing and huge productions that last only a moment, all set to the tune of \"Twenty Fans\" and narrated by Jim Nabors.<br><br>Some people would probably be surprised to find that this movie was nominated for Best Motion Picture - Comedy/Musical in the 1983 Golden Globe awards. Dolly Parton was also nominated for a Golden Globe award in the Best Actress - Comedy/Musical category, while Charles Durning, in his role of the Texas governor, was nominated (quite rightly) for an Academy Award for Best Actor In A Supporting Role.<br><br>The best thing about the film is the character of Miss Mona, played by Dolly Parton. I read that Barbara Mandrell or Crystal Gayle were also up for the part, but I can't imagine anyone else playing Miss Mona. You can't help liking Miss Mona - she's not like any prostitute or madam the 1982 movie-going public had ever seen. She's a ray of sunshine, totally forthright, honest, optimistic, generous, open-hearted and sweet. She even contributes heavily to local charities and causes, and one of her lines is \"Well, I always just thought if you see somebody without a smile, give 'em yours!\" As usual in her films, Parton, who is a singer/songwriter, not a trained actress, holds her own and more. Her entrance, singing \"Lil' Ole Bitty Pissant Country Place\" as she slowly walks down the stairs in that red dress, is something else. Throughout the movie, Miss Mona's fiery temper and tender heart provide some of the most authentic moments.<br><br>\nReynolds plays the character his audience loves best - the smart ass. And he plays it very well. This movie shows him in the character of a sheriff, which must have been amusing to moviegoers accustomed to seeing him outrunning sheriffs and state police in his \"Smokey &amp; The Bandit\" movies. Ed Earl is a typical Reynolds character - getting most of the funniest lines, cussing up a storm, getting philosophical in his semi-ignorant way and defending Miss Mona to the best of his hot-tempered ability.<br><br>\nDom DeLuise plays the part of Melvin P. Thorpe to perfection, right down to the corset and the stuffed pants. He is a delight. Perfect comic timing. \"Watchdog Report/Texas Has a Whorehouse in It\" is a production number that is completely right for him.<br><br>Jim Nabors is, well, Jim Nabors. I still laugh thinking about the opening line of the movie, delivered in his \"GOL-LEE\" tone: \"It was the nicest little whorehouse you ever saw!\" Nabors plays Deputy Fred, who also narrates the movie.<br><br>Also of note is Charles Durning as the governor of Texas, who is perfect as he schmoozes and avoids the facts. It is no surprise to me that this actor, who has now made over 100 movies, was nominated for a Best Supporting Actor Oscar for this role.  My favorite part of his brief airtime is the business with his cowboy hat (four or five times he puts his hat on sideways and then whirls to the side so that it falls correctly onto his head). His singing and dancing in \"The Sidestep\" pulls out no stops - you can't stop watching him. I couldn't help wondering how Steve Martin would have played this role, but Durning makes it his own.<br><br>The movie is, of course, a musical, and it was a musical before it was made into a movie - so we get lots of musical numbers, including one with the Aggie football team. If you like musicals, you will like this, because the songs were clearly written not to be hits, not to be videos, but to be part of a musical. Mona's Girls and the Aggies are not actors - they're extremely talented dancers, some of whom can sing.<br><br>The Aggies, who are supposed to be the Texas A &amp; M football team, push their scenes to the limit. It does stretch dramatic license a bit when the football players have most of their clothes off and are dancing around the locker room - their physiques are clearly not football material - but no matter. Yee-haw!<br><br>Mona's girls have been chosen to represent many different physical types of women, and besides their obvious dancing talent, each gets a small solo (one or two lines) in one of the movie's final songs, \"Hard Candy Christmas\" (a song which sounds as if it was written by Parton but wasn't). This is, to me, the best song in the movie, and it's a shame that a different version was used on the soundtrack (in the movie, each girl sings a line or two, with Parton singing the choruses, but on the soundtrack version, Parton sings it all). Nothing against Parton, but I enjoyed hearing/seeing all the different reactions as expressed by their distinct voices as the girls faced their uncertain futures.<br><br>Parton also contributed two of her own original songs to the movie. \"I Will Always Love You,\" which she originally wrote and released in 1974, became this film's love song and went to number one for a second time (of course, it went to number one again when covered by Whitney Houston in 1992. The other song that Dolly contributed is \"Sneakin' Around\" (a \"9 to 5\"-like duet between Parton and Reynolds). According to some information on the WWW, she also contributed other songs which were not used, including a song which she later re-wrote for \"Rhinestone.\"<br><br>Looking back on this film from 18 years in the future, I'm sure that many people have a low opinion of it, but I think it's a classic. Supposedly based on a true story, this film invites you in and never lets you go, keeping you hooked with sharply written dialogue and fast-paced action. Once you start watching it, it's impossible to stop - some of the comedy is very subtle, and each performer seems perfectly cast and enthusiastically performs her or his role.<br><br>There aren't as many serious moments, but they are well-acted. Ed Earl and Miss Mona have a long-term relationship, spiced with something more perhaps? Miss Mona's face after her fight with Ed Earl conveys such weary hurt that you can't help wanting her to get a break. There's much more to this movie than Mona's girls. It's about friendship, tradition, honesty, promises and tolerance as well. Managing to express valid points and make a 1982 audience sympathize with prostitutes, it also manages to poke fun at society.","user":"CucFan","rank":[52,58]},{"title":"Hello, Dolly!!!","rating":9,"date":"14 December 2011","review":"5.3? <br><br>The problem, I suspect, with this movie is that the wrong people are watching it, and the right aren't.<br><br>Let's see, who does this movie offend? Christian fundamentalists, politicians and Texans. I don't know how many of the former are watching it and then rating it (perhaps they just rate first, watch later), but it looks like some Texans don't have a sense of humor.<br><br>And then there are Burt Reynolds fans who might be shocked to find this is not a typical Burt Reynolds movie, and hate it. But folks who aren't Burt Reynolds fans will probably enjoy it. Reynolds' excellent acting is natural, understated, and properly nuanced to the scenes. I think Reynolds and Parton are very well cast together and have real chemistry.<br><br>As to Dolly Parton, who knows? All I know is you don't have to be a Dolly Parton country music fan to love this movie. My estimation of Ms. Parton went up enormously after first seeing this movie. She is one smart lady and a fine actress.<br><br>So, to add it up, if you are not from Texas, not a Bible-thumper, not a politician, not a Burt Reynolds fan and not a Dolly Parton fan, you should definitely watch The Best Little Whorehouse in Texas.<br><br>Oh, and folks expecting porn are going to be disappointed, though there is the briefest of cameos by none other than Kay Parker, dressed. Don't blink. Too bad she didn't get a speaking part. This lady can actually act! I saw her reciting Shakespeare, for some reason I can't recall, in one of her movies, and she was real good.<br><br>Watch this movie because it is laugh out loud funny. You need to watch closely at the details because the scenes are beautifully crafted. Watch the one of Dom DeLuise getting dressed in front of Reynolds before going on air. It is hilarious, especially the sock. But the most memorable scene is of \"Governor\" Charles Durning doing his \"Sidestep\" number. It is a masterpiece.<br><br>It is easy to forget this is a musical, perhaps because the storyline is so strong it could survive as a movie without music. But a musical it is, in the tradition of Seven Brides for Seven Brothers and Oklahoma! with its masculine cowboy acrobatics dancing, though with an 80s twist, given the locker room dance number.<br><br>Thats what makes this movie great: It takes the concept of the musical comedy and brings it out of the Fifties and into the Eighties in a way that is still relevant and pretty outrageous today because of its swipe at hypocrisy. Did I say swipe? Perhaps dagger thrust or kick in the face to hypocrisy would be more accurate. In this regard, The Best Little Whorehouse is hardly subtle.<br><br>So perhaps I should add to the list of people who will not like this movie, hypocrites. For them, there is \"Hello, Dolly!\"","user":"dimplet","rank":[22,23]},{"title":"Sadly forgotten","rating":9,"date":"8 April 2002","review":"Big, splashy, fun musical about a whorehouse (the Chicken Ranch) in Texas run by Miss Mona (Dolly Parton). She's in love with the sheriff (Burt Reynolds) and the town has no problem with the house. Then a sleazy TV showman (Dom DeLuise) exposes the ranch and all hell breaks lose.<br><br>This was a modest hit in 1982. It's easy to see why--it's full of energy and enthusiasm, has great songs and some fantastic all out production numbers. Reynolds is just OK but Parton is an absolute joy--she gives one of her best performances and even sings \"I Will Always Love You\" (I prefer Whitney's version). Also there is equal amounts of male and female nudity and has a healthy attitude about sex (this was made before AIDS was well-known about). And Charles Durning stops the show with his \"sidestepping\" number...he was nominated for Best Supporting Actor for this. <br><br>Only complaint is the ending. It's way too serious and realistic--I wish they had opted for a fairy tale like ending. Also Lois Nettleton's subplot is seriously underdeveloped--I assume it was shot but cut out for the running time.<br><br>See it and enjoy!","user":"preppy-3","rank":[33,39]}]