[{"title":"Extremely Underrated","rating":9,"date":"2 June 2014","review":"I cannot understand how is it possible for people who call themselves Star Trek fans, not to like this film. Even more I can't understand how is it possible for the previous movie to have better ratings. <br><br>The voyage home could have been any other light movie for people who don't like to think what they've just seen... Not for Star Trek fans. The final frontier movie was about all the stuff that made TOS so special. I know it's not Free Willy but if it was I would rate it with a 7 not a 9. As I did with Star Trek IV which was just an enjoyable movie.<br><br>Star Trek was always about the story. A story that would give you a glimpse to a possible future and make you think about philosophical matters such as life, friendship, god, racism and others. <br><br>If this is why you watch Star Trek I believe you will enjoy this film.","user":"dipanagi-683-2128","rank":[56,75]},{"title":"This one is growing on me.","rating":6,"date":"28 April 2019","review":"\"Star Trek V: The Final Frontier\" Is a mixed bag. There is a lot of humor in it. ( I suspect that's because of the success of Part 4. ) There is some action but it's not that exciting. The special effects aren't that hot at times. The weakest part is the storyline. Just when the plot needs to pick up speed, it runs out of gas. That said, it hard to not enjoy any movie with the original Star Trek cast. It's because of them that I am enjoying \"Star Trek V\" more these days than I used to. It's not the greatest movie but it's still better than \"Star Trek: The Motion Picture\". Dishonorable mention: They didn't give the always enjoyable David Warner anything to do.","user":"pmtelefon","rank":[10,12]},{"title":"Shatner Versus God. Shatner Wins...","rating":1,"date":"2 December 2008","review":"Welcome to the Plan 9 From Outer Space of Star Trek movies. Come on, trekkers, admit it. This movie is so bad, so staggeringly inept in every department, it's become something of a classic.<br><br>The Shat gives the worst performance ever committed to celluloid. \"BOONES! Hi, Bones\" Brilliant! This isn't just Ham - it's several large pig farms in Kentucky! <br><br>The \"Special\" Effects. Should be done under the trade descriptions act for using such a term. The Enterprise is a moving piece of cardboard in this film. Really! Even the Star Trek TV show had better.<br><br>Bones, Spock and The Shat sing! Yeah, Spock sings Row Row Row Your Boat. After struggling over the meaning of the words!!!! \"Capt. Life is Not A Dream\" Poor Leonard Nimoy, he must really want to strangle Shatner for this. Could The Shat not have given us his rendition of Mr. Tambourine Man, or harmonised with Nimoy on Ballad of Bilbo Baggins? Sorely disappointed.<br><br>A Sean Connery look-a-like plays Spock's half-brother. Only cos they couldn't get Sean Connery! Uhura does a fan dance! That would have been sexy in 1966. In 1989 it's like watching your drunk granny embarrass herself at a Christmas Party. Much amusement from watching Spock neck-pinch a horse...<br><br>Cat Woman/Tina Turner Jumps on Shatner's back! Shat twirls her around a few times like a WWF Wrestler, and chucks her off. Yayy The Shat! He shows his respect for alien life forms by leaving her face down in a pool of water. Nice one! Seems Connery 2.0 was a bit of a Vulcan rebel. Which explains why Spock hasn't previously mentioned him in 79 t.v episodes and 4 movies. McCoy apparently mercy-killed his Dad, BUT AFTERWARDS THEY FOUND A CURE. Tell me this isn't hysterically funny.<br><br>The 11 deck Enterprise suddenly grows another 400 decks for an escape sequence in an elevator shaft. The Enterprise breaches the galactic barrier, which has mysteriously moved from the edge to the centre of the galaxy (see Where No Man Has Gone Before). Still, that's only about 50,000 light years... Shatner meets God! Or what purports to be God, but I assume is really some kind of alien being. God looks a bit like Charlton Heston in The 10 Commandments. Sean Connery MK II calls on God to share his pain, and promptly dies. Or something. God punishes the Shat for questioning his identity. So Spock kills God with a photon torpedo. I'd love to know what Jehovah's Witnesses made of this scene.<br><br>The Shat, having killed God, promptly goes back to his sing-song with Spock and Bones. Altogether now, Row Row Row Your Boat.....","user":"Prichards12345","rank":[59,91]}]