[{"title":"The Movie That Made Me Appreciate Mozart","rating":9,"date":"26 November 2006","review":"Before I saw this movie, I respected Mozart's genius, but his music wasn't my cup of tea. Beethoven was more to my taste, I tended more toward heavier classics. But this movie moved me to tears, especially at the end when they did Mozart's REQUIEM while he was working on what was to be his last piece of music. Now, I'm a Mozart fiend. This was a great movie. True, there are some historical inaccuracies. Anyone who has studied music history knows that Sallieri did not help Mozart with his Requiem. It was a student of his named Sussmayer. But it does make this story ironic, that the man who was so dedicated to the ruination of Mozart ended up helping him in the end. (I question the historical accuracy of that as well.) I recently bought the director's cut to this movie. Until I saw the director's cut, Sallieri seemed like a more sympathetic character, someone who just couldn't buy a break. Who can't identify with that? But after seeing the director's cut and seeing what I think is an important scene between Sallieri and Mozart's wife, he seemed more like a jerk. You also understand why Frau Mozart was so rude to Sallieri at the end of the movie, whereas before, you see the next to the last scene and you think, \"Whoa! Where did this come from?\" This was a great movie, for entertainment value only. If you want historical accuracy, watch a documentary or read a biography from the library or something. Because of this movie, I am now a rabid Mozart fan. If the movie can make Mozart converts, then it can't be bad at all.","user":"possumopossum","rank":[100,108]},{"title":"True Gem for Movie and Music Fans","rating":10,"date":"30 January 2007","review":"I'd like to point out a few facts before I review the movie. First of all, Mozart died at home surrounded by his family, pupil and a priest. Secondly, the plot of Amadeus is not exactly original. Rimsky-Korsakov wrote a short opera called \"Mozart and Salieri\" with the bare bones of the story and the identical characterization of the two composers, and he used Pushkin's drama for the libretto. So, the rumor that Salieri killed Mozart has been around for almost a couple of centuries though we all know there isn't an iota of veracity in it.<br><br>That being said, Peter Shaffer's movie adaptation of his own play is still an astounding achievement. Have you ever seen a movie based on your favorite book and come out of the movie theater rather disappointed though the film version faithfully followed the storyline of the book? Amadeus is definitely not one of those movies. Shaffer clearly understands the difference between stage and film; the story is more elaborate in the movie, and some of the lengthy lines are replaced with more subtle images and close-ups.<br><br>I'm often surprised to find that people don't get that Amadeus is the story of the fictionalized character, Antonio Salieri, not the real one, who adored Mozart's music but hated everything else about him. In other words, the movie viewers are seeing Mozart through Salieri's eyes. Needless to say, his view is rather slanted. If you have read Shaffer's original play, you probably remember he describes Mozart's laugh 'grating.' In the film, this annoying laugh becomes more symbolic. Though Salieri speaks in front of a Catholic priest, he is actually having a one-sided discourse with God. At one point, he declares, \"One day, I will laugh at you. Before I leave this earth, I will laugh at you.\" But as he is wheeled out of his room by an aide at the asylum, what we hear is that screeching laugh of Mozart--or is it? It becomes obvious as we watch that this movie is called Amadeus because that's what Salieri wished to be--God's beloved.<br><br>The movie might give some viewers who don't know much about Mozart a wrong impression that he was a cad, and it gives incorrect information on some of his music (e.g.; the count in The Marriage of Figaro sings \"Contessa perdono\" AFTER he learns that the woman dressed in the maid's clothes is his own wife. There's no mistaken identity here. Read the title of the song--Countess, forgive me!), but these are minor offenses. Though I am a die-hard Mozart fan, I can laugh at tongue-in-cheek references to Amadeus in other movies. My favorite? In Guarding Tess, a secret service agent tells his partner, \"He (Mozart)'s a jerk. One day, a guy shows up with a mask, and he drops dead.\" <br><br>What's not to like about Amadeus? The tale Peter Shaffer tells is gripping, the actors are first- rate, and, of course, there's music. The selection of Mozart's music in the movie is excellent; you can truly enjoy the beauty of his music no matter how much or how little you know about it. In case you are wondering, a little tune Mozart plays on his back and hands crossed as a penalty at a party is Viva Bacchus from The Abduction from the Seraglio, a duet for Pedrillo and Osmin. Pedrillo, while singing this song, is trying to get Osmin, the harem guard, drunk to help his master rescue his true love. No wonder Schikaneder calls it 'our song.' And the improvised version of Salieri's welcome march is actually a famous song, Non piu andrai farfallone amoroso, from The Marriage of Figaro.<br><br>As I said, I'm a huge Mozart fan, so my rating may be somewhat biased, but what the heck, I gladly give ten stars to Amadeus. I watched it close to a hundred times over the years, and it still gives me a great pleasure every time I see (and hear) it.","user":"miknnik","rank":[63,68]},{"title":"A rare masterpiece","rating":26,"date":"26 June 1999","review":"SPOILER: Amadeus is an extremely well written story, covering the last ten years of Mozart's massively prolific yet unusual life.  I have read much that it paints a rather inaccurate picture of the genius's life, and yet I am not dissuaded from ranking this film as one of the greatest made.  The historical problem should be addressed first, because it draws the most criticism.  I would advise anyone to shut out the self-righteous whining of those people who fancy themselves as Mozart experts, when they really have little solid evidence for their assertions.  History is only seen by us in fragments, be they documents or eye witness accounts.  These fragments certainly do not amount to a full picture of events, and so Milos Forman and Peter Schaeffer are perfectly entitled to form their own story of genius.<br><br>This issue aside, the picture is one of fantastic colour and scale, crammed with lavish costumes and wonderful architecture.  This keeps the eyes occupied, but the ears get the biggest reward.  The film uses a large amount of Mozart's music, and does so in a way which is carefully considered. For example, when the insane and enfeebled Antonio Salieri (F. Murray Abraham) reminisces on the sheer beauty of Mozart's compositions, we hear music to match his words, \"And there... an oboe, high and unwavering... until a clarinet takes over, and forms a phrase of such longing...\"  The effect is deeply moving.  Examples of this collaboration of music and picture are many; when Mozart (Tom Hulce) swaggers through the streets of Vienna taking swigs from a bottle of wine, we hear a jolly piano concerto; and he is hurled into a mass grave to the sorrowful Lacrimosa of his requiem mass. The music should move any viewer, however much they confess to hating anything classical.  If you haven't seen this film, watch, or rather listen, for the scene where Salieri inspects samples of Mozart's music.  The originality in switching the music as he turns the pages is profound. The acting is superb, particularly from Abraham.  Hulce's cackle provides comic relief, and his wonderfully child-like mannerisms are testament not only to his acting skills, but to Forman's exceptional direction and vision. On the other hand, we are shown two moments of antithesis, namely when he is composing at his billiards table (his face taking on a look of such mature concentration), and when he is dictating his Confutatis to Salieri. Yes, we do get to see Mozart compose, and talk about tonic, dominant, second measures, etc.  I would have preferred to have seen more of his thought processes though, because Forman's glimpse of how Mozart applied his genius is extremely exciting to watch, but short lived. Characterisations are brilliantly engineered.  Salieri is scheming and yet outwardly indifferent to Mozart.  We can see that he loves the music of his superior, and yet is torn apart by his own inadequacy.  Inadequacy is a fitting word for Salieri's skill as portrayed by Forman, who wanted to give the greatest contrast possible in terms of the virtuosity of the two men, without making Salieri look like a complete cretin.  He is, after all, known as maestro Salieri.  Constanze Mozart (Elizabeth Berridge) is on first appearances a giggling girl, and yet through the course of the film we are shown that she is very shrewd, and is ruthless when dealing with finance. Roy Dotrice's Leopold Mozart has a masterful air, and maintains an oppressive paternal hold over his son even after his death, the analogy being the use of an enveloping cloak.  The cloak is used as part of Leopold's street wear, but is also part of the costume of the statue in the first showing of Don Giovanni, where Salieri is certain that the imposing figure of the giant statue represents the recently deceased Leopold.  In short, Forman presents us with a marvelous psychological essay on weakness and power, both superficial and real.  This is obviously no average biographical motion picture, but a film conceived with an intelligence nearing that of it's subject. We are shown Mozart's virtuosity several times, which again provides wonderful excitement.  He not only plays variations of his music thought up on the spot (at the party scene) but plays them in the styles of other composers, upside down.  He infuriates Salieri by arranging a welcoming march actually written for Mozart (and taken to be wonderful by the Italian up to this point), showing off his outstanding skills whilst looking around at the assembled courtiers and cackling with glee.  Those who have watched this scene with me have either laughed or smiled in sheer wonderment at a majestic combination of music, acting and direction. This film is a gem, combining sometimes ridiculous comedy with deep tragedy.  On the negative side, it would benefit opera buffs more than concert goers, because opera is the dominant musical genre of the movie. (Specially designed opera productions have been woven into the film; greatly extending it's length but adding that extra colour and vibrancy).  The film becomes heavy and slow moving as it nears its astonishingly refreshing conclusion at the lunatic asylum, noticeable largely due to the contrast with a lighter beginning.  This may test the patience of some viewers, but once the credits roll, I guarantee that the majority of those who have watched Amadeus will be struck by the passing of such a wonderfully colourful and rewarding masterpiece, and will not want to move from their seats until the tranquil piano concerto fades away.  The film deserves all its eight Oscars, and I give it 9 out of 10.","user":"Alec-11","rank":[275,332]}]