[{"title":"It's 10 o'clock. Do you know why your children are cackling insanely?","rating":1,"date":"15 March 2007","review":"\"Reefer Madness\" (originally \"Tell Your Children\") was created to teach parents that it's never too early to scare the holy crap out of your kids. Through this film we learn that the soul-destroying effects of Marihuana (Mike Nelson explains in the commentary that this film was made before the invention of the letter J) far surpass those of cocaine or heroin. We see firsthand that even teens who can quote Shakespeare like nobody's business cannot escape its evils.<br><br>Here are some of the symptoms of casual Marihuana use:<br><br><ul><li>laughing maniacally while running people down in the street</li></ul><br><br><ul><li>playing the piano too fast</li></ul><br><br><ul><li>having sexual relations with people you don't really like that much</li></ul><br><br><ul><li>accidentally shooting people you do like pretty well</li></ul><br><br><ul><li>having no recollection of being framed for murder</li></ul><br><br>If your child has experienced any of these symptoms, he or she is a Marihuana addict. The solution is simple: force them to watch \"Reefer Madness\" because if we don't heed its warning, \"Reefer Madness 2\" will be coming to a theater near you or you... OR YOU!","user":"JoshSpurling","rank":[76,97]},{"title":"The Gone with the Wind of 30's Exploitation Films","rating":10,"date":"28 August 1999","review":"Because of 70's NORML propaganda falsely claiming that the FBI sponsored Reefer Madness, most viewers believe that this Exploitation classic was meant to be taken seriously.  Not so!  Thelma White (Mae) has noted in interviews that the producers and director Louis Gasnier asked the cast to \"hoke it up.\"  The famous \"Faster, Faster\" scene is, in fact, a direct parody of a similar scene in the classic musical 42nd Street (a scene in which Dave O'Brien--Ralph in Reefer Madness--played a chorus boy). <br><br>\nSo why make a cautionary tale, but do so tongue-in-cheek?  Simple.  To get around the Hays Code and show more skin than the Code allowed...but also to capitalize on the public's fear of drugs.  Either way, the producers made a ton of money on the Exploitation circuit--more than covering their costs for this relatively expensive sub-Poverty Row production. <br><br>\nMade over the course of 3 weeks (most Exploitation films were shot in a few days), using an experienced director and a couple of talented actors who went on to have respectable careers in Hollywood, Reefer Madness is quite simply the finest Exploitation film to come out of the 30's. <br><br>\nThe film's funny, is it?  Well, the folks who made it thought so too.  And they laughed all the way to the bank.","user":"collinsm","rank":[58,78]},{"title":"1930's potheads become hopelessly and incurably insane?","rating":10,"date":"10 March 1999","review":"This movie is funny. Not just regular funny but inexplicably funny. I wish public schools all over the country would show this movie in classes. This cult classic gives what is supposed to be a serious warning of the dangers of marijuana. Instead the over exaggeration of the side effects of weed become un-intentionally and absurdly funny. I smoked grass in my day but I sure haven't killed anyone yet. This movie is legendary. Anyone who has ever smoked should view this. Just if only to see how this whole silly \"war on drugs\" thing got started. Is pot ever to be legalized? Probably not so long as there are people who take this movie seriously. As for the rest of us laugh yourself into hopeless and incurible insanity for 67 minutes.","user":"PIST-OFF","rank":[33,46]}]