[{"title":"Headless entertainment.","rating":4,"date":"4 April 2008","review":"The constant bad swipes this low-rent South American horror film receives might be justified, but I didn't think it was entirely terrible. Mostly wooden, and more often vapid you could say, with the occult idea being push aside for lame (and oddly placed) soapy domestic quibbles of the two police detectives (likeably played by Wayne Crawford and Kay Lenz) who are chasing a killer that unusually decapitates its victims, and might be something supernatural of African origins. Cool! No not cool. This offbeat angle is left high and dry, and just frustrates with its sloppy pace and bland script. Quite a drag! Well up until the frenetic climax. Having the two leads being fully developed is fine, but still it leaves us with too many questions about our ugly looking demon. The underwritten premise is randomly disjointed and terribly unclear and inconsistent in its motives. Never does it become much fun, as its light on suspense, action and gratuitous splatter. Nor does it have any sort of camp value. It needed to go out on a limb to achieve excitement, because it sadly underplays itself and goes about things seriously. The convincing location choices however, seemed to invoke an effective atmospheric tenor, and Hans Kuhle's free-flowing camera-work is well done. Julian Laxton's howling music score has a thumping, menacing tone that won't let up. The rubber demon looks tacky and bulky, but decent for such a budget. Watchable fluff, but not one to lose your head over.","user":"lost-in-limbo","rank":[7,10]},{"title":"Good horror film with an excellent demon!","rating":10,"date":"4 September 2003","review":"Headhunter is is good horror movie that stars Kay Lenz and Wayne Crawford! The killings are gruesome! It has good music and the Headhunter demon is very neat! it wasn't suppose to be funny but I thought the scene with the preacher was funny and it seemed like his voice was dubbed! I was funny when he said \"I'm never coming back to this (curses) river again!I feel this movie needs more attention that it has received! I don't want to spoil it for you in case you haven't seen the movie and if you haven't rent it because its a good horror movie!","user":"Movie Nuttball","rank":[8,12]},{"title":"Made somewhat watchable by its sense of humor (5 out of 10)","rating":5,"date":"19 February 2007","review":"Plots revolves around an evil voodoo spirit terrorizing a neighborhood in Miami which is mostly populated by Nigerian refugees, chopping off and stealing their heads. Police detectives Crawford and Lenz are given the unenviable task of investigating the murders, and soon find out for themselves that they are in WAY over their own heads.<br><br>Sometimes creepy, sometimes boring, but its sense of humor perks things up throughout and helps hold your interest. Unfortunately when you do finally get to see the killer is a big let down, and it most resembles what you'd expect a living-dead pro-wrestler with a machete to look like, except made out of foam-rubber. Crawford and Lenz do an excellent job in their roles and help hold things together despite this films serious weaknesses, with Crawford delivering some pretty good one-liners.<br><br>5 out of 10, not for everyone but a passable time killer.","user":"andybob-3","rank":[4,5]}]