[{"title":"Something a little different from the boys","rating":9,"date":"5 July 2004","review":"From the moment this movie begins we know we're in for something a tad unusual. In the early talkie days the folks at the Hal Roach Studio experimented with a new format for delivering opening credits: instead of simply filming title cards in traditional fashion, they built a spiffy Art Deco stage set, complete with proscenium arch, and hired a pair of young girls called the Crane Twins to march out onto the stage to deliver the film's credits verbally. The girls, who are dressed as bellboys, speak in unison at first, then alternate, then bow in tandem as they conclude. The effect is quite odd and (inadvertently?) funny, and kicks off Another Fine Mess on a curious note. The twins introduced several concurrently produced comedies featuring Charley Chase, Our Gang and the 'Boy Friends,' but this marks their only appearance in a Laurel &amp; Hardy movie. I find the girls rather endearing myself, but in any case Roach's experiment with spoken credits didn't last long.<br><br>Enter Laurel &amp; Hardy chased by a cop, and we're back on familiar terrain. And yet things aren't quite so familiar after all, for it soon becomes apparent that this film has a different feel from the average L&amp;H comedy. There's an actual plot, comparatively little slapstick, and an unusual amount of verbal humor. It's no surprise to learn that Another Fine Mess was based on a stage sketch, because once the boys seek refuge in the house where most of the action takes place, it does indeed feel like a stage act is underway, as they engage in an extended routine involving disguise and mistaken identity, with some farcical elements included for good measure. Ordinarily Laurel &amp; Hardy didn't place much emphasis on dialog humor as such, but here they do, and happily the material is pretty funny. (Interestingly, the sketch that served as this film's source material was written by Stan Laurel's father, who was a theatrical manager and playwright, though it was said that the old gent did not approve of this adaptation.) In any other L&amp;H short the guys would've spent five or ten minutes trying and failing to enter the house, but this time they've got a rendezvous with The Plot and not so much time for physical shtick.<br><br>As it happens, the guys have taken refuge in the home of Colonel Buckshot, who has supposedly departed for Africa. His servants, who were entrusted to rent the place out, have also left for a weekend vacation. Complications ensue with the arrival of a honeymooning couple, Lord and Lady Plumtree, who are interested in renting the place. Even bigger complications are set in motion by Ollie's decision to open the door to the couple in order to get rid of them, which forces Stan to impersonate the butler, which in turn forces Ollie to impersonate Colonel Buckshot, which in turn forces Stan to impersonate Agnes the maid. That's what I love about this movie, that decisive moment that starts the ball rolling. All the guys had to do was ignore the doorbell and wait for the couple to leave, but then they wouldn't be Laurel &amp; Hardy, and we wouldn't have this fine mess to enjoy.<br><br>It's amusing to watch Ollie brazenly attempt to assume the role of the wealthy Colonel Buckshot, behaving the way Ollie believes such people behave, and he's well matched by Stan's quick-change impersonations of Hives the butler and Agnes the maid. I especially enjoy the scene between Agnes and Lady Plumtree. We have to assume that Thelma Todd's barely suppressed laughter throughout the scene is genuine; I mean, playing opposite Stan in drag, listening to him ramble on and giggle nervously, who wouldn't crack up? While it's true that the musical score and sound effects used in Another Fine Mess are somewhat more emphatic than the typical Roach comedy of the period, as an earlier reviewer pointed out, I feel this gives the film an agreeably wacky, \"cartoon-y\" feel suitable to the situation. I love the moment when the real Colonel (Jimmy Finlayson, underplaying as usual) returns home and tries to grasp what has happened. His furious response prompts the silliest wrap-up ever contrived for a L&amp;H short. It's a laugh-out-loud ending -- it was for me, anyway -- and it ensures this movie's status as a treat for comedy connoisseurs.","user":"wmorrow59","rank":[29,31]},{"title":"Another Mess is Fine!!!","rating":10,"date":"8 November 2007","review":"Laurel and Hardy are simply hilarious! They incorporate slapstick and basic comedy to a pleasant pinnacle of perfect acting performances!! The talent of slapstick, which relies on a lot of physical humor,is misconstrued by the movie audience as just being silly! Hence, it is not given it's just deference. The movie \"Another Fine Mess\" pokes flagrant holes in the day to day petulant actions of the well to do!! Laurel and Hardy's chicanery and wild antics are once again, totally unintentional in this film, that is what makes them so funny!! The early days of movie making almost seem incomplete without Laurel and Hardy!! I found their movies and skits to have a totally innocuous reliability to them!! Such theatrics of whimsical mannerisms reflect the innocent days of yesteryear!! In evaluating these Laurel and Hardy movies, there is such a dark side to so many people who star in them!! Such disconcerting callousness is put in a flippant perspective, and should be taken with a jaundice eye!! I could watch Laurel and Hardy reruns over and over again, they definitely fall into the category of timeless entertainment!! \"Another Fine Mess\" is one of Laurel and Hardy's better efforts, and I recommend to anyone who is just in a mood to be amused, that they watch this movie.... THUMBS UP!!!!","user":"dataconflossmoor","rank":[7,8]},{"title":"Stan as Agness the maid is just the best","rating":6,"date":"6 July 2005","review":"Seeing Stan Laurel as Agnes the maid in this film is absolutely fantastic. I especially love his girlie chat with Mrs Plumtree on the sofa. This particular scene of the film illustrates Stan's adaptability to talkie films, and to situation comedy, where there is less of the usual slapstick.<br><br>I guess the use of more dialogue over slapstick in Another Fine Mess is due to the fact that it was thought that such comedy genre would be less funny, and therefore irrelevant to talkie films. Seeing Stan and Ollie with more dialogue to perform takes allot of getting used to. However, I think the duo pulled it off in this film Very good viewing!","user":"alexandra-25","rank":[7,8]}]