[{"title":"Probably one of the most quotable movies of the 80's","rating":1,"date":"1 December 2002","review":"Among my husband and his buddies, this movie is like Shakespeare -- they quote from it often and well, so often and well, in fact, that the quotes are just part of their vocabulary and the source is forgotten.  It does have more than its share of witty quips, even for me, a lowly female ;).<br><br>I really do like this movie.  It makes me miss the 80's, when it was still considered acceptable to be a patriotic American, and movies that glorified America and the military could be made without the felt need to apologize left and right.  And of course Clint Eastwood is clever and attractive as always, as the hardcore Marine lifer who's trying to discover his tender side in time to reunite with his ex when he retires.","user":"Rachel-20","rank":[77,106]},{"title":"Vintage Clint!","rating":8,"date":"4 August 2003","review":"Clint Eastwood is at his best in the role of \"Gunny Highway.\" This is mostly a really excellent flick about patriotic values, military camaraderie and old grizzled military veterans. Gunny Highway comes across as the exact fellow you would want covering your ass in any tough situation you could possibly imagine. And Eastwood plays him perfectly with steely resolve, devotion, humor and a healthy touch of irreverence. Its great to see the transformation of Highway's squad, as well as the final moment of judgment for the totally hateful, obnoxious and bureaucratic Maj. Powers. (Oh, if only such b*****ds would get their deserved comeuppance in real life in such a manner, what a beautiful world it would be!)<br><br>The only real fault is the attempt to compare a minor police action in Grenada with Vietnam and Korea, \"I guess we're not 0, 1 and 1 anymore.\" I mean, give me a break, Korea and Vietnam went on for years and killed millions! Grenada involved a couple of hundred casualties over a couple of days. Please! But I suppose in 1986 the American people were desperate for some kind of heroes. Its just that that kind of jingoism would have been much more appropriate after Desert Storm than Grenada. That being said, its still a very good movie with a fundamental message about values, loyalty and comradeship that we could easily have more of these days, besides, Clint is just great!","user":"djecatepec","rank":[45,62]},{"title":"Clint's funniest","rating":13,"date":"13 March 2003","review":"I had forgotten how funny this film really is. Shown on British TV last night, I found myself laughing like a loon all the way through it. Being a big fan of Eastwood, it's been quite a while since re-viewing this mini classic. And although it does take a drastic turn at the end, with a slightly misjudged comment on war, this is by far his funniest movie.<br><br>I also found that his character is his most interesting. A hard, no-nonsense gunnery sergeant who looks for advice in women's magazine is a dream characterization. And the one-liners are perfectly attacked.<br><br>I did find Mario Van Peebles character a little annoying, but then I suppose that was the whole point, and it's always good to see Marsha Mason, who I think is totally underrated as a screen actress.<br><br>But this is Eastwood's movie, through and through and a real delight. See it, but don't take the ending too seriously.","user":"wrenster","rank":[19,24]}]