[{"title":"Marvelously putrid.","rating":10,"date":"16 August 2004","review":"What more can be said of Raimi's legendary cult-classic that hasn't already been beaten to death like a puss-oozing zombie that crosses paths with Ash? Possibly nothing, but I'll try. <br><br>Before Spiderman and before the countless spin-offs of this movie were made or even conceived, Raimi and friends decided to make a low budget zombie flick mainly for fun, and surprisingly it has become a masterpiece of shock and horror. Possibly a perfect example of how to make an entertaining film on a shoe-string budget, The Evil Dead delivers what it promises, the ultimate in grueling horror. Even with it's mild budget and sometimes shaky acting, TED shocks and spooks the audience through chilling atmosphere and some of the most violent effects ever put on film. Those who are squeamish need not apply. As a matter of fact, just run for your girly life.<br><br>There are several reasons this film succeeds. First, Raimi's camera work is truly masterful. By using fast camera work and aggressive shots, Raimi has created an eerie world that is sometimes hard to look at but too entertaining to turn away from. His style from behind the camera is absolutely unmistakable. This is perfectly exemplified in the beginning of the film, where the camera alone creates enough atmosphere to leave you biting your nails in suspense of what's to come. You feel at any moment someone is going to get their neck chomped on by some zombie hiding just out of view. One of the most impressive openings I can think of, perfection in pacing and atmosphere. It gets even better once the action starts. Some shots hold for a seeming eternity, and part of you wishes for it to stop for it's unrestrained gore and violence...but the other part of you is getting a sick kick out of it. One of the most impressive shots is where the darkness from the trees begins to chase people, knocking any tree or obstacle down that happens to be in it's way. Truly magnificent technique, however they did it. <br><br>TED also succeeds because it's self-aware of the fact that it's a simple zombie movie and never takes itself too seriously, and doesn't expect the audience to do so either. It's meant to be campy, cheesy, revolting and chilling at the same time. There are moments in the film where it seems to be making fun of itself and the genre in general. For this fact alone, one cannot hold certain things against it such as sometimes questionable acting from the supporting cast and sometimes the downright implausibility of certain situations. If you can accept this and you're not put off by mannequin ultra-violence, then you should find yourself on the supporter's side of the fence. I think some don't like it because it can be ridiculous and cheesy in parts, although it was meant to be. Even with the fact that it's sometimes cheesy, there are some downright chilling moments in this film that most horror films nowadays cannot begin to muster. Case in point, the zombie screaming from the cellar door. The zombie growls and howls themselves are enough to send shivers up one's spine. And let's not forget the unforgettable tree love scene, ridiculous and hilarious simultaneously.<br><br>Last but certainly not least: Bruce Campbell as Ash, the badass of all zombie films. Campbell is Ash, period, and always will be.<br><br>In my opinion, this is by far the best of the trilogy, and although there could have been more of the chainsaw, this is the definitive zombie film and probably always will be. I feel it succeeds over it's sequels due to it's increased violence and lack of humor in comparison. It's blood, gore, camera work, and shock factor are still formidable even today and are what make this such a cult classic. If you've ever liked any horror film, this is an absolute must-see.<br><br>Love or hate it, there it is.","user":"Manthorpe","rank":[179,229]},{"title":"The ultimate in terror","rating":10,"date":"10 July 1999","review":"It's the early 80's, what do you expect?  This is a scary scary film.  And I think I know why films now a days can't hold a candle to films like Halloween and Evil Dead.  And that is because a photo copy is never as good as the original.  That is the bottom line.  Directors don't care about a lot of the material that they are filming today, especially when it comes to horror films and that is because they don't write their own stories.  They do someone elses work.  But not Evil Dead.  This was Raimi's baby from the outset.  When films like the two mentioned were filmed they were filmed by two directors that were complete unknowns.  They had no pressure to make a great film and they did it on an incredibly low budget.  Halloween was made for $150,000 and Evil Dead for $50 000.  So what that meant is that the directors could stick to their visions but they had to find innovative ways to do so.  Their budgets didn't allow a heap of special effects so they had to rely on what they knew.  And that was, how to create atmosphere using the camera.  And Evil Dead is one of the best at doing that.  There is one scene in this film that I will never forget and that is one of the early scenes where the cast arrives at the cabin.  Here we see a long shot of the cabin and it has very eerie music playing.  This shows the cabin as being menacing.  It lets you know that there is evil in that cabin.  And that we are in for a hell of a ride.<br><br>Sam Raimi made a masterpiece here that I believe stands the test of time. You can put this film up against any of today's so called horror films and I guarantee you this scares you more.  Raimi cares about his movie and he does everything to make you feel the terror that the cabin people feel.  We are scared and disgusted at what happens when one of the women goes outside alone at night and meets a tree that does unspeakable things.  And when the book is first introduced.... that is horror movie history there.  What a brilliant concept.  A book that is evil.  I have often wondered about such books.  We hear about them all the time in movies about ancient Egypt and ancient times.  But here we have a book that has weird incantations from another world and another language, and you just know that as soon as some idiot utters the words that they are not supposed to say, well they won't be around much longer.<br><br>The Evil Dead is a miracle.  It was made on a rock bottom budget yet it is scarier than any Hollywood movie that is made for 20 million could ever hope to be.  If you want to truly experience a frightening experience, rent this film, it knows what it wants to say.  And it knows how to make you afraid. So be afraid.  Be very afraid.  You may never look at the forest the same again.","user":"baumer","rank":[228,299]},{"title":"You don't need a big budget to make an accomplished film","rating":11,"date":"11 May 2007","review":"Sam Raimi's feature length debut \"The Evil Dead\" is truly one of the greatest horror films of all time and the start of a magnificently entertaining trilogy of hilarity and some real scares. Made on a budget of only $375,000, the film is surprisingly accomplished on a technical level. The effects, although they do look fake by today's standards, hold up a lot better than you might have expected, and the stop motion sequence at the end, which looks a lot faker than anything else in the movie, was accomplished for its time and budget.<br><br>\"The Evil Dead\" is about a group of young adults who travel to a cabin in the woods and discover a 'book of the dead'. No prizes for guessing what happens next as each character is possessed (except for Ash) and disposed of via an intriguing variety of methods. Considering its budget, unknown director (at the time), and typical slasher plot \"The Evil Dead\" would almost certainly seem headed towards forgotten B-movie status, and yet it has stood the test of time and remains one of the most widely acclaimed horror films of all time. Why? It's simple. Although \"The Evil Dead\" is nowhere near as funny as its sequels, it's still a humorous self-satire while also being terrifying despite its age. This odd combination (only perfected in this film's sequels and \"Creepshow\") works because Raimi crafts a tense and moody environment, puts his characters in there, and then ruthlessly disposes of them, sometimes doing so several times for the same character. What's worse is that there's nowhere to go. Raimi creates a claustrophobic feeling in anyone watching, he wants you to think about being in a situation where you're trapped with nothing but death and destruction surrounding you. For most people, he probably succeeds. As far as acting goes, none of it is really very good but Bruce Campbell is instantly likable as Ash, who just has to be one of the most memorable horror film characters of all time.<br><br>Gory, desolate, hopeless, and still funny, \"The Evil Dead\" is a horror masterpiece that isn't quite the strongest entry in the series, but is shockingly accomplished and entertaining despite its low budget and inexperienced cast and crew. This is a film everyone must see, along with its sequels. <br><br>9/10","user":"ametaphysicalshark","rank":[66,82]}]