[{"title":"Instant classic horror slasher flick","rating":8,"date":"19 February 2018","review":"The Burning (1981) is an instant classic slasher horror flick, puts most of horror movies today to shame. This movie come out the same year as did Friday the 13th Part 2 my favorite horror film. They are so many horror films in 1981 I haven't hear, see or they are forgotten. This movie however surprised me. \"It ripped off Friday the 13th\" no it didn't! This movie was different, it was a revenge film but it was different than Friday the 13th. It is an original story not a copycat of other slasher films. Honestly I think this movie is much way better horror movie than Friday the 13th Part 2. This movie has a different story, it is not that bad and it is a good slasher movie and it just become my favorite horror film.<br><br>The story follows campers from summer camp goes with canoe trip to Devil's Creek once there they become targets, from a former summer camp caretaker, horribly burned from a prank gone wrong, with a pair of hedge clippers to take revenge on the campers. Once there they are trapped while assailant is stalking them and kills them one by one. <br><br>I enjoy this film it is not a bad slasher horror film it is instant classic and really puts most of horror films to shame. It has a lot of nudity with girls been naked and sexy. This days I don't see any naked girls in any slasher horror films today. They don't make horror movies like this one in the woods today. Back in the 80's was more work than today. Tom Savini from Dawn of the Dead makes special effect for more gory blood and they work. Just like he did special effects for Friday the 13th, Friday the 13th: The Final Chapter and Dawn of the Dead he makes effects for this movie and the gory kills really works. There is a lot of scares and twists in here that keeps getting you interested and intense. It doesn't allowed you to\nstop watching it. Friday the 13th part 2, My Bloody Valentine, The Burning, The Howling and American Werewolf in London are really in my top five favorite films from 1981 in horror genre. Why can't we get movies like this?<br><br>Directed and original story by Tony Maylam who directed the film really good. I miss movies like this today and I think it is a really good movie.\nBrian Matthews, Brian Backer, Carrick Glenn and Carolyn Houlihan were believable at acting and they were really good. 8/10 this movie is an instant classic in the horror genre from the 80's for me.","user":"ivo-cobra8","rank":[86,91]},{"title":"Better than you might expect...","rating":9,"date":"23 November 1998","review":"Made in 1981, this film clearly jumped on the teenage slasher bandwagon and is very similar to a Friday the 13th movie. As far as the genre goes, 'The Burning' is way above average. Sure, it has the obligatory teenagers on summer camp and a deranged stalker out for 'revenge' but there are some genuinely tension-building moments and quite a few decent scares. The effects are above average (though quite heavily cut in the British version) thanks to gore-king, Tom Savini and Rick Wakeman's electronic music score is far more effective than Harry Manfredini's psycho-like strings in Friday the 13th. The acting is nothing special, but then again, it never is in these films.<br><br>If you're in the mood for a decent, scary stalk'n'slash movie, you could do far, FAR worse than this.","user":"BStalker","rank":[57,68]},{"title":"A slasher classic","rating":7,"date":"2 November 2007","review":"The Burning has the great fortune of being a product of the early 80's slasher fest that greeted audiences in the hundreds. Some genre highlights were produced from ca. 1980-1984, a time when these films took themselves semi-seriously and were moderately successful at creating creepy atmosphere, displaying gratuitous nudity and inventing some spectacular death sequences. The late seventies laid the groundwork for what was to become a stable formula for these movies and for a minimum budget and isolated surroundings the films could provide some solid shocks and gore that pleased audiences.<br><br>The Burning is nearly identical in plot and storyline to Friday the 13th. Here the bad guy is a burn victim as a result of a prank gone awry and years later he takes vengeance on unsuspecting campers in gruesome fashion. While the movie is pretty slow and the gore fest doesn't really start until an hour in it's never boring. Here's where the film is different from Friday the 13th and many others: The teens aren't merely disposable pricks who you can't wait see get their grisly demise. They're actually a pretty likable bunch, well played by some future stars (Jason Alexander, particularly likable here, and Fisher Stevens among them) and when some get slashed you kinda feel bad for them.<br><br>Now for what really counts. Two things; gore and mood. The Tom Savini gore effects do not disappoint. Keep in mind that this is 1981 and digital effects have improved horror gore somewhat but this is pretty impressive stuff. The raft scene is a particular standout. As for mood, you can't beat these early 80's alone-in-the-woods scenarios and they're all well played out here. Although there are a lot of false scares here, they're buildups are great and the creepy surroundings go a long way. If films like Psycho made people afraid to take a shower and Jaws made people afraid of the water then films like The Burning and Friday the 13th must have made a few parents hesitant at sending their kids to summer camps.<br><br>Fans of slasher films will not want to miss The Burning. Although Friday the 13th is more suspenseful and The Burning feels a bit too stretched, it nevertheless has plenty of good moments and top notch kill scenes. What's not to like?","user":"ODDBear","rank":[35,41]}]