[{"title":"Vincent Price vs. The Horla","rating":7,"date":"27 December 2003","review":"Vincent Price, as Simon Cordier, is possessed by an evil spirit and is forced to kill. Can he overcome the beast that haunts him inside?<br><br>Dug this out of my collection and gave it another view. I really like this one and feel it has been underrated by many. The only major problem I have with it is the story would have been better served had the existence of the Horla been left more to question. Still I really enjoyed this, especially Vincent Price in the lead. It's got that old-time 1960s AIP Horror feel to it even though it wasn't made there.","user":"Space_Mafune","rank":[18,19]},{"title":"surprisingly good Price vehicle","rating":7,"date":"18 January 2006","review":"During the 1960s, Vincent Price became super famous as a horror actor--starring in countless low budget horror flicks. Many of them were very cheap and rather forgettable but he also did a few dandies that were quite watchable. In that latter category I would place this film. It's very enjoyable and despite the plot being awfully far-fetched, it is carried off well. Price plays a nice judge who visits a madman about to be executed. At this meeting, the evil spirit controlling the maniac jumps into Price's body and as a result, he goes from a saintly life of a life of evil and depravity. The acting and writing are good, but I must admit this sort of fare isn't going to be for everyone--deep intellectual stuff this isn't! But, if you like a good scare, give the film a viewing.","user":"MartinHafer","rank":[23,27]},{"title":"Pretty good if unknown Price movie","rating":7,"date":"19 June 2006","review":"Vincent Price plays Simon Cordier a kind man who is a judge. He is possessed by a Horla (never shown--you only hear its voice) who thrives on evil. It sets Price out to commit evil deeds even though he fights against it. Then he meets sweet Odette (Nancy Kovack) and things go out of control....<br><br>Well-made, colorful (some BEAUTIFUL set design here), low-key horror film. The plot is interesting and the acting is good (especially Price and Kovack). There's next to no violence in this one (the one murder scene is badly faked)...it mostly concentrates on Price fighting against the Horla. There's a few very interesting discussions between Price and the demon about good, evil and morality. It all leads up to a great climax. If you're looking for a blood and guts movie this isn't it but it is an intelligent thoughtful horror film. Recommended.","user":"preppy-3","rank":[16,18]}]