[{"title":"Great climbing sequences make this hidden gem worth watching!","rating":7,"date":"30 April 2006","review":"Clint Eastwood stars as a former government assassin turned art teacher who is blackmailed into coming out of his retirement to pull off a difficult last job. A former colleague has been murdered. Eastwood will climb the Eiger face and kill the assassin along the way. The only problem is he isn't sure which of the three other climbers is his target.<br><br>'The Eiger Sanction' is very much a product of the 1970's, and comes from a difficult grey area of Eastwood's career. He was transitioning between Westerns and Dirty Harry and films like 'The Eiger Sanction' got lost in the mix. On the surface the film is a spy thriller, or a gorgeously shot mountain climbing/survival film. I think it doesn't get enough credit for being very tongue in cheek. It gently pokes fun at both Eastwood and 70's action movies -- Clint giving a female student a playful pat on the rump, the foxy brown flight attendant/girlfriend, and of course \"damn that Brando\" when Clint's Native American trainer pushes him too hard. Throw in the promiscuity and the way homosexuality is dealt with (rival gay hit-man with the little dog) and the film runs pretty nicely as a satire.<br><br>'The Eiger Sanction' is really about the third act though where the climbing takes place. Brilliantly photographed, I didn't find much not to enjoy about this film. Quite possibly the best climbing film that I've ever seen and it is certainly superior to things like 'Cliff Hanger' or 'Vertical Limit' -- which owe a great deal to 'The Eiger Sanction.' Clint Eastwood has acted in better movies and he's directed better movies. That said, this one is an unpolished gem and worth taking a look at if the opportunity arises.","user":"A_Roode","rank":[55,64]},{"title":"The Eiger Sanction","rating":7,"date":"25 September 2009","review":"I was anxious to see if Clint Eastwood's The Eiger Sanction was as bad as I had always read, whether it was one long bore which worked well as a sedative. I was surprised at how entertained I was despite the fact that it was all means to an end. The spy story itself wasn't exactly mindblowing or extraordinary, but the exhilarating mountain climbing finale (..and the training portion as Eastwood's agent prepares for the big climb up the Eiger), to me, was well worth sitting through the weaker aspects of the film.<br><br>The movie is really a tale of three halves. The opening sets up why Eastwood's art professor, whose past life was that of a hired assassin, will be scaling a massive mountain he has failed to climb twice previous, the middle shows his Dr. Jonathan Hemlock training under old pal Ben Bowman(George Kennedy, a delight and wonderful support to the film, I thought)getting ready for his date with destiny, and the final thirty minutes moving up, and down, the Eiger, with three other professional climbers.<br><br>I think the viewer can look at the film in two ways. As a spy movie, it just doesn't cut the mustard(..although, I must admit that I found the twist amusing, regarding the revelation of the identity behind who might've been responsible for the death of Hemlock's former associate, an act of betrayal to our country, helping hand over germ warfare microfilm \"to the other side\")for Eastwood is realistic holding a magnum as a San Fran detective or a pistol as a gunslinger staring down opposition, but he's not James Bond..the deliberate, leisure pace defies the rapid pace that the James Bond movies are known for. I think that's why the story plays second fiddle to the action sequences which are far more exciting and awe-inspiring. The camera-work / cinematography is first-rate, exceptional in particular once Eastwood is climbing up mountains, whether in breathtaking Arizona or Switzerland locations.<br><br>I think if you look at it as an adventure, one will probably consider it one of the greatest mountain climbing movies of all time, the precursor to Renny Harlin's Cliffhanger and Martin Campbell's Vertical Limit. Eastwood's insistence on doing his own stunts enhances the climbing sequences, adding a realism that is to be admired.<br><br>The cast is rather fascinating. Eastwood doesn't really stretch his acting muscles, but Kennedy is quite engaging as his buddy, while Jack Cassidy steals the film as the flamboyant homosexual Benedit Arnold traitor who Hemlock plans to kill when the time is right. Gregory Walcott is Eastwood's foil, as agent Pope, often embarrassed and humiliated by Hemlock, when he assaults him. Thayer David has a strange role as Hemlock's sickly Albino governmental charge, Dragon, blackmailing him into finding the traitorous rogue responsible for the murder of a former field colleague. Vonetta McGee is Jemima Brown, a \"patriotic whore\" who works for Dragon, falling in love with Hemlock in an interesting interracial love affair. I think it's all about what you enter the film expecting from it. If you looking for phenomenal mountain climbing sequences, this delivers the goods, but I suggest searching elsewhere for a strong spy story..if you want both, try For Your Eyes Only.<br><br>The incredible difficulty for shooting the scenes up the Eiger at the end shows and you can tell Eastwood took great strides getting the most out of the setting. As the four climbers make their way up, I enjoyed how the young lead climber pokes and jabs at Hemlock for his failure to successfully scale the Eiger because this ridicule will come back to haunt him when a decision to continue despite evidence of potential disaster leads to devastating consequences.","user":"Scarecrow-88","rank":[19,21]},{"title":"Clint's Totem Pole","rating":8,"date":"17 June 2017","review":"This is almost like a Bond movie: beautiful women, crazy and somehow scarred villain, great fight scenes, INCREDIBLE climbing scenes, stylish costumes and luxurious locations. You want to see Eastwood as a bespectacled professor who is actually a spy. Why he needs to climb some mountain now escapes me, but I watch spy movies for all of the above reasons. When he climbs that Totem Pole FOR REAL, I'm almost about to faint FOR REAL. I love the scenery and how well the costumes match the scenery. Thanks to this movie, I learned about Brenda Venus. So, I would say the casting is great, too. I love all the sexist/racist slurs that actually poke fun at sexism/racism. No one would dare do that today. Or climb the Totem Pole FOR REAL.","user":"HarlequeenStudio","rank":[9,9]}]