[{"title":"A Good Period Piece","rating":14,"date":"14 November 2007","review":"I agree with one of the persons who commented on this movie that this is a good period piece. This movie is true in showing the speech, habits, attitudes, clothing, and just life in general, in the backwoods of the Kentucky/Indiana area of the 1820's. I should know. My family moved across the Ohio River into Indiana from Kentucky, near where this movie was filmed, during this same time period of the 1820's, and I have family correspondence showing the life of this areas people of the 1820's.<br><br>I love this movie, but then, I might be prejudice. It was made in 1954 just before my 12 birthday, and my family and I were in it. My brother and I played school kids, my dad was a farmer, and my mother was one of the ladies on the river boat. I loved being on the set in the Lincoln Village in Rockport, Indiana and watching Burt striding around in his period costume. He always acted as if he knew exactly what he was doing. Everybody give Walter lots of room while he got lessons from Lash LaRue, an expert bullwhipper from old Hollywood westerns, on how to use the bullwhip. He learned some but, it was Lash who did the big scenes. Miss Lynn was kind and sweet to all of us kids when we did the schoolroom scenes. John Caradine was always golly and cheerful and seemed to love everybody, and what he was doing.<br><br>I could go on, and on. I have tons of behind the scene pictures my dad took, a lovely picture of my lovely mother in a beautiful period costume on the boat, and a copy of \"Gabriel's Horn,\" the book from which the movie was taken, as well as a copy of the movie.<br><br>As an adult 53 years later, I look at this movie and see a decent, true, period movie, with lessons to be learned, that anyone of the 1950's would have enjoyed. Some of the parts could have been cast better, but, do not judge it by today's standards. Lancaster, et al, worked hard and stayed true to the times they were portraying, and credit is due.","user":"mvickio14","rank":[36,42]},{"title":"For Burt Fans, Isn't everyone?","rating":9,"date":"24 April 2001","review":"Lancaster's only directing role.  A decent western with a twist or two, especially at the ending showdown, which features 10 dramatic seconds of feat that only Lancaster could make suspenseful.<br><br>How does a man defeat an armed enemy while standing opposite a 40 yard wide stream, and with no gun?  The daring Lancaster meets this challenge with a surprising, brash dash.  Check it out.","user":"alydar21","rank":[23,28]},{"title":"Burt Lancaster's Eastern Frontier flick","rating":7,"date":"9 December 2014","review":"Released in 1955, \"The Kentuckian\" is one of only a couple films directed by Burt Lancaster.<br><br>THE STORY takes place during the presidency of James Monroe circa 1820. Lancaster plays Eli Wakefield, a Kentuckian who desires more room to breath in Texas. Still in Kentucky, they blow their \"Texas money\" on freeing a beautiful indentured servant, Hannah (Dianne Foster). They don't get past the next frontier town where Eli takes up with his brother in the tobacco business and Hannah gets a job as a bar matron. Eli's dreams of Texas are sidetracked when he meets up with a schoolmarm (Diana Lynn) who encourages him to settle down and make a family with her. The problem is that Eli's son prefers Hannah and doesn't want to give up their Texas dream. Meanwhile feuders are hot on Eli's trail, not to mention malevolent local businessman with a whip (Walter Matthau).<br><br>Some highlights include: <br><br><ul><li>Lush Eastern locations. The film was shot in Levi Jackson State Park, Kentucky (near London), as well as Owensboro, Kentucky, which is on the Ohio River, and Rockport, which is just across the river in Indiana. The river depicted in the film is supposed to be the Tennessee River (I think), but it was shot on the Ohio. In any event, although \"The Kentuckian\" is classified as a Western, it's actually an Eastern.</li></ul><br><br><ul><li>The film offers a good glimpse of what the Eastern USA was like back when it was still a frontier -- the cabin-styled houses, sleeping in the woods, etc. No internet, cable, video games, DVDs or microwaves. People actually sat down with other people and communed.</li></ul><br><br><ul><li>The story is realistic, albeit with some lame dialogue. Regardless,you don't have to worry about any goofiness or unbelievable bits that plague some 50's Westerns, except for the too-wooden-they're-funny feudalists.</li></ul><br><br><ul><li>Back then a huge riverboat coming to town was an exciting attraction. Americans today, by contrast, get all excited over the shenanigans of some celebrity.</li></ul><br><br><ul><li>Dianne Foster (Hannah) is a beautiful redhead. One wonders how a woman like this would stay single very long on the frontier.</li></ul><br><br><ul><li>The whip fight with Matthau is great. Lancaster is almost whipped to shreds (!).</li></ul><br><br><ul><li>Loyalty is a sub-theme here. Eli's son is loyal to Hannah and never warms up to the schoolmarm, although there's it's clear that there's nothing wrong with the latter. And Hannah is loyal to the man who delivered her from bondage (Eli), despite his infatuation with the marm.</li></ul><br><br><ul><li>I liked the bit on Eli being a laughing stock because of a worthless freshwater pearl, but he gets the last laugh with a letter from the President (or is it?) and additional help.</li></ul><br><br><ul><li>Lastly, Lancaster is a likable protagonist with his charismatic joy-of-living persona; he's humble and respectful, the antithesis of Eastwood's amoral and lifeless 'man with no name' a decade later.</li></ul><br><br>The film runs an hour and 44 minutes.<br><br>BOTTOM LINE: \"The Kentuckian\" is breath of fresh air and I enjoyed it from beginning to end for all the above reasons; it's sort of like \"The Last of the Mohicans\" (1992) of its era, albeit no where as good. It's innocuous and easy-going, but sometimes surprisingly brutal (the dog fight and whip fight). If you can acclimate to the style of filmmaking of the mid-50s it's worth checking out.<br><br>GRADE: B","user":"Wuchakk","rank":[10,11]}]