[{"title":"Dialog Highlights This Marx Bros. Gem","rating":9,"date":"5 April 2006","review":"Well, here we are with another wild and hilarious Marx Brothers farce, this time with Groucho taking over a small country and winding up in war with a neighboring one.<br><br>There really isn't much of a story but with the Marx Brothers that doesn't matter. Many times their movies were vehicles for their vaudeville acts of funny lines, slapstick gags and musical talent.<br><br>Two differences in this film than most others from the boys: 1 - Zeppo has a number of lines. Usually, he's the almost-forgotten brother in this foursome, either with little to say or not even in the film. 2 - Harpo doesn't play the harp, but he gets in on his share of the gags, which are always dominated by Groucho and Chico (my personal favorite).<br><br>Fantastic dialog makes this version one of the best of them all. There are just tons of funny (and, yes, very dated) lines in this movie and having Duck Soup out on DVD making the sound clearer helps, too. Lots of laughs.","user":"ccthemovieman-1","rank":[49,54]},{"title":"I Wouldn't Join Any Country that Would Have Me.","rating":10,"date":"28 November 2004","review":"I'm shocked, shocked at all the negative comments covering this comedy classic. The puns, the insults, are all now comedy classics. The Lemonade Stand &amp; the Mirror Scenes also memorable. I hadn't seen the movie in around 15 years but bought the DVD so my 15 year old son could experience the Marxes. He loved it too.<br><br>What I noticed for the first time was the satire of society, manners, government, the military, the bureaucracy (including Roberts Rules of Order). I can't recall any other comedy I've seen that satirizes on such a grand scale.<br><br>For Marx Brothers fans this is a must see. It's the boys with no love story or musical interludes in the way.<br><br>One word for those who disagree- \"Upstart\". :-)","user":"jcohen1","rank":[112,134]},{"title":"The Marx Brothers At Their Very Best","rating":1,"date":"1 June 2001","review":"There are a lot of reasons why so many different reviewers suggest that \"Duck Soup\" is a genuine candidate for the funniest movie ever made.  It has the Marx brothers at their very best, with rapid-fire laughs combining with a satirical \"plot\" that is very funny in itself, without getting in the way of the individual comedy sequences that are the real highlight of the film. Their timing and material are as good here as they ever have been.<br><br>The Marx brothers are still beloved today because when at their best, they treated their audience to a lot of riotous slapstick that cannot be watched without laughing, while at the same time rewarding their viewers for paying attention with a steady stream of puns, deadpan one-liners, brief sight gags, and other subtler humor.  The more you watch, the more you notice.<br><br>\"Duck Soup\" has a lot of their very best material, and everyone has their own favorite scenes, whether it is the mirror sequence, or Chico and Harpo giving their report to Louis Calhern, or the street vendor scenes, or ... . The variety of comic settings and comic material is amazing, and when you add in the entertaining musical sequences (which again are particularly good in this one), it is a feast that never stops.<br><br>Any Marx brothers fan has seen this one several times, and does not need to be reminded what great fun it is.  If you have never watched one of their films, give this one a try.","user":"Snow Leopard","rank":[44,51]}]