[{"title":"Not enough naked...Plenty of dead.","rating":29,"date":"29 April 2003","review":"Reportedly, Norman Mailer's best-selling novel was distilled and sanitized for the screen (what book isn't?!)  Many people blame this for the rather weak resultant film.  The film IS fairly weak, but the adaptation can hardly be the sole cause.  \"From Here to Eternity\" and \"Peyton Place\" are just two movies adapted from adult novels that were made around this time and were referred to as \"unfilmable\", yet the end results were magnificent.  This film concerns hard as nails, embittered Ray as an amoral Sergeant who's currently in charge of a motley troop of men in the South Pacific islands during WWII.  Massey co-stars as a stern General who thinks of men as little more than beads on an abacus as he tries to figure out the strategies and percentages of war.  His assistant Robertson clashes with him on various points and, after one particular battle, finds himself on a deadly mission alongside Ray and his band of not-so-merry men.  Ray gives an okay performance in the film, but lacks the sort of leading man magnetism that could have put this over better.  Robertson is thoughtful in his part, but doesn't really shine.  Massey has a strong part with many nice moments. Several well-known TV and movie actors can be found in the troop including the always reliable Jaeckel, Best (who would later make a fool of himself weekly on \"Dukes of Hazzard\"), Campbell (famous for a guest role on the original \"Star Trek\" series), the ubiquitous Jones (who has an embarrassing role as a lovesick soldier) and Rat Pack comedian Bishop (who actually gives a nicely balanced performance.)  There are some horrible flashbacks featuring various women.  Ray's details his ludicrously presented relationship with trashy Nichols who laughs loudly and inappropriately at the end of it.  Robertson has a dream involving a pallette of society girls he apparently had dabbled with, sometimes two at a time.  Real life stripper St. Cyr makes a none too impressive appearance in the beginning of the film, inspiring Jones tremendously.  The worst fault the film has is it's pedestrian nature.  There is very little excitement generated throughout, even when arresting events are occurring.  The film suffers from tiresome shots of the soldiers marching, climbing, walking, skulking.....  A lot of the momentum gets lost along the way.  This is countered somewhat by several bouts of unfunny physical comedy, heated arguments among the men and moments of drunken loudness.  There is just a general unfocused quality in the film, possibly caused by shifts in the direction of the plot from the novel. What's worse is that in two hours of film, most of the men don't take their shirts off at all and when a few do it's in long shots.  Maybe that's what was missing!  The music does little to enhance the film.  Bernard Herrman (who did such miraculous things to Hitchcock films) flounders here with unmemorable work.  It's not the worst war film ever made, but truly falls short of being a great one.","user":"Poseidon-3","rank":[48,58]},{"title":"A poor Hollywood remake of a classic novel.","rating":6,"date":"1 September 1999","review":"I saw this movie on a local PBS station about the same time I was writing a Term Paper on the novel.  I have already read the novel several times, but I still thought that the movie perspective might be helpful.  Needless to say I was wrong.  The movie turns a book about the futility of the individual's role in war into a boiler plate feel good war movie w/ a happy ending. One of the most important parts of the novel, where Hearn is betrayed despite his best efforts to be a \"good\" leader, is scrapped.  Hearn not only survives, but the movie goes on the kill the ass hole, Sgt Croft.  In the book we see a group of individuals who all want to singlehandedly make a difference and who all end up failing because modern war has grown beyond the control of the individual.  In the movie we see a division of good guys and bad guys where where good guys win and the bad guys get what's coming. Finally I would like to point out that this movie is a waste of time or unpleasant to watch.  If its going to be on TV by all means watch it, but if you've read the book brace yourself to be VERY disappointed.","user":"Evilmike","rank":[45,59]},{"title":"Unbelievably Bad Film of Great Mailer Novel","rating":2,"date":"28 March 2005","review":"I saw this movie after reading the book and my jaw was on the floor after about the first five minutes. They made a tough, subversive book into the most lame, formulaic, boring action movie ever! Every fuggin guy in the fuggin squad gets changed from an all right guy to some kind of fuggin robot.<br><br>HEARN -- in the book he's tough as hell, a Harvard football star and intellectual cynic with high society education who's used to fighting back and challenging authority. In this movie he's like Andy Hardy half the time, going \"gee, General Cummings, let me just shake your hand!\"<br><br>CROFT -- in the book he's ice, a stone killer like Tom Berenger in PLATOON (really just a hippie flavored remake of Mailer's book.) In the movie he actually gets weepy in front of the men of recon crying over his wife Janey! The real Croft would have shot himself first.<br><br>GALLAGHER -- in the book he's an ugly, stupid, cowardly anti-Semite who hates Jews and behaves like an Archie Bunker prototype. In the movie he's just a clean-cut guy with a pregnant wife.<br><br>BROWN, Wilson, MARTINEZ, ROTH -- in the book they all have rich pasts, complex characters, and they make believable soldiers and human beings. In the movie you can hardly tell one from another.<br><br>I cannot believe Hollywood did this to Mailer. I cannot believe Mailer let them do it! James Jones wasn't half the writer Mailer was, but FROM HERE TO ETERNITY looks like Shakespeare compared to this. Maybe the lesser books always make the best movies!","user":"Dan1863Sickles","rank":[59,82]}]