[{"title":"\"Hell no, kid. I didn't do that for you. I did that for rock and roll.\"","rating":21,"date":"21 June 2004","review":"This movie is much better than people seem to think. It's not just fun family entertainment, it really shows Elvis trying to come to terms with what went right and wrong with his life. It goes from a spooky, spiritual opening, where Elvis acknowledges his own mortality in song (\"So hush little baby, don't you cry/You know your daddy's bound to die\")to a rousing \"If I Can Dream\" finale. The idea is that Elvis gets everything right here that he got so tragically wrong in real time. He is the perfect father, husband, and artist, and he stands up for what we believe in, instead of just wasting himself. Touching and inspiring film. <br><br>What keeps the movie from going soft is the fact that the young rock and roller played by Charlie Schlatter (whatever happened to him?) is initially quite contemptuous of Elvis and his Las Vegas style lounge act. The kid chews Elvis out in a very memorable scene that really represents the feelings of millions of young 70's teens about the way Elvis went soft. The fact that Elvis listens and learns is extremely inspiring, but again, the film stays honest. At the end he tells the family, \"I've found something here, and I'm afraid if I leave it will slip away again.\"<br><br>Sadly, it did.","user":"Dan1863Sickles","rank":[11,11]},{"title":"TRULY WONDERFUL ESCAPISM !!!","rating":10,"date":"22 June 2001","review":"'Heartbreak Hotel' is one one the all-time greatest entertainment treasures. With a solid, brilliant cast led by the incredibly talented  Mr. David Keith as Elvis Presley,  this movie could brighten even the dullest mood with its simple charm, humour and wonderful music. Some of the more short-sighted have complained about, among other irrelevancies, the lack of facial likeness between Mr. Keith and 'The King' as if that was an error of some kind rather than recognizing the fact that Mr. Keith was obviously chosen for the role because he is an amazing 'Elvis' vocal and visual impersonator with the necessary talent in order to capture the essence of Elvis without having to rely on physical likeness which can only testify to the limitless capabilities of this great actor, so much so that there are moments when Elvis almost appears  transfigure through David Keith, who incidently is also a native of the State of Tennessee.<br><br>No-one ever intended this movie to be taken seriously, but only enjoyed for its sheer entertainment value. The majority of the singing is actually performed by David Keith himself, which no Elvis impersonator could top !!  I have read reviews of this movie which cast doubt on this fact, but if you watch the end titles you will see his vocal performing credits. I also know that he used his own voice because HE told me in person during several chats I had with him whilst he was here in Hope, BC with James Spader filming the upcoming movie 'The Stick-Up'. Charlie Schlater is also an immensely talented actor with the same kind of natural charisma and talent of Michael J. Fox. As I said previously,  all the cast are magnificent and obviously adored making this movie as their pleasure and happiness shines through. Remember, this is not an Elvis biography, but merely a fantasy tale which in its own way honours the memory of the real Elvis. A heartfelt tribute to 'The King'. David Keith can also be seen in 'An Officer and a Gentleman'; 'U-571'; 'Men of Honor'; 'Brubaker'; 'The Rose'; 'The Lords of Discipline'; 'Major League 2'; and 'Texas'  among many others.","user":"bgraham-1","rank":[15,17]},{"title":"A must for all Elvis Fans","rating":8,"date":"30 August 2005","review":"A Rock and Roll Fantasy with an underrated cast, this movie is a lot of fun. David Keith gives a believable performance portraying Elvis as human rather than as the icon we all choose to remember. That's the most gratifying thing about this movie; Elvis ceases to be ELVIS in all that the name/legend implies and is instead Elvis, a character who happens to be a superstar in the reality of this movie. Charlie Schlatter gives us a realistic teen who can't relate to his mother's musical preference and who benefits from the influence of Elvis--the Man, not the image. It's also nice to think that, by the end, Elvis benefits from the influence of Charlie's character! (Keeping in mind that I mean Elvis the character in this movie and not The Real Elvis!) Definitely worth seeing!","user":"ecri324","rank":[7,7]}]