[{"title":"A Capote Edwards Cup Cake","rating":7,"date":"25 July 2018","review":"Even now 57 years after its original release, Breakfast At Tiffany's remains a charming love story between two hustlers of sorts. Audrey Hepburn is not the Holy Golightly that Truman Capote intended, she couldn't be but she was Audrey Hepburn in all of her 1961 glory. Amazing how it still works that Audrey Hepbun touch. George Peppard is gorgeous but impenetrable. Mickey Rooney, unforgivable. Henry Mancini, opportune but. strangely enough the character that fascinated me the most in my latest viewing is Patricia Neal. I would love to see a full movie about that woman. She exudes sensuality and smartness. Blake Edwards concocts a lighter fare from Capote's book and as it happens, it's still very much alive and surprisingly relevant.","user":"fanaticusanonymous","rank":[53,56]},{"title":"\"...no matter where you run, you just end up running into yourself...\"","rating":8,"date":"11 April 2017","review":"BREAKFAST AT TIFFANY's is an exciting and entertaining romantic comedy about a charismatic girl from high society and an unrealized writer. Film is loosely based on Truman Capote's novella of the same name.<br><br>A young and elegantly dressed lady walks around and looking in a shop windows in an early morning. After looking into the shop's windows, she strolls home. Outside her apartment, she fends off her date from the disastrous night before. Later, she meets, a pleasant and somewhat confused writer, the new tenant in her building. They develop a special relationship. She wants to marry a rich man. However, her new friend slowly falls in love with her. Both must give up of some important goals in their lives for the sake of love...<br><br>This is an unconvincing and provocative story with a touch of an inappropriate comedy, romance and melodrama. However, this distorted reality has a certain depth. The story of a nobody's-but everyone's girl is, given her past, a naive and painful at the same time. A quiet and insecure writer with an obvious problem of writer's block and hands of a beautiful and rich older lady around his neck enters in her life. It is a quite confusing situation in life.<br><br>Costume design is exquisite, the song \"Moon River\" is haunting as a reflection of fears, turmoil and friendship. <br><br>Audrey Hepburn as Holly Golightly / Lula Mae Barnes is an irresistible, irritating, bumbling and gentle woman with two names. She constantly flees away from itself. Holly is \"the real fake\" and \"a wild thing\" at the same time. Lula Mae is a person from whom Holly escapes. Ms. Hepburn is a beautiful and gentle actress, exceptional comedienne, who is an ideal choice for this role. George Peppard as Paul Varjak is often set aside as an observer. He was not the right choice for this role. George just can not follow a \"twisting\" step of the unreliable Holly. Mr. Edwards has tried to equalize their characters. They are unhappy, unfulfilled and they differ from some moral standards. Their relationship is based on an unconditional friendship. There is no a chemistry or love sparks. He has, in an elusive and unreliable girl, found an inspiration in his life. She has found a man who will, regardless of her excesses and lies, always be beside her and lend her a hand when she falls.<br><br>Their support are Patricia Neal (Mrs. Emily Eustace \"2E\" Failenson) as a cool rich woman with a beautiful smile and a magnetic gaze. Martin Balsam as O.J. Berman is very funny as a Hollywood agent. Mickey Rooney as I.Y. Yunioshi is an inappropriate and hackneyed cliché.<br><br>This is an odd collection of turbulent and false feelings, which is a comic and melodramatic at the same time, and even occasionally pleasant to watch.","user":"elvircorhodzic","rank":[37,39]},{"title":"More than just a romantic-comedy, \"Breakfast\" is a real love story","rating":21,"date":"21 July 2004","review":"The main reason I like \"Breakfast at Tiffany's\" so much is because I think it is one of those rare romantic comedies that actually transcends the genre and becomes a genuine love story. I have a theory that most love stories that get made aren't really about love. They're either about romance or lust. I don't think that many people in Hollywood (or society in general today) even know what real deep, meaningful love really is. \"Breakfast at Tiffany's,\" on the other hand, is one of the most beautiful real love stories ever told.<br><br>*SPOILERS* <br><br>\"Tiffany's\" is basically about a woman who is incapable of loving. She considers herself a \"free spirit\" a \"wild thing,\" an independent, adventurous woman who lives for the moment. She is also a bit of a social outcast because her \"profession\" is essentially that of a call girl. Whether or not she actually sleeps with all of these men (or just some of them) who pay her is unclear, but she definitely uses them. She is not a woman of high moral character and despite her constant \"up\" attitude and optimistic outlook, she is really quite lonely. It's all a reflection of how she really feels about herself I think. It's almost as if she needs to keep trying new things and distracting herself from the truth, because if she were to actually take a moment to stop and look at herself, she would be confronted with how unimpressive and ordinary she really is. She would also have to face the fact that she is not really that stylish. She is an actor playing a part. \"Holly Golightly\" isn't even her real name. As I said, she is incapable of loving others because she doesn't really even love herself. She feels she is unlovable. Her self-perception is really quite low and that's why she concocts these huge, elaborate fantasies about being elegant, classy and witty. When I first saw the film, I was so impressed by the charm and beauty of Audrey Hepburn that I instantly fell in love with her. The more I watch the movie, the more I realize how utterly sad and pathetic (yet still likable) her character really is. As Marty Balsam says in the film: \"She's a phony, but she's a real phony.\" <br><br>Paul Varjak, the character played by George Peppard (pre A-TEAM days of course) is in a similar situation. He is also playing a role and has a lousy self-image. He wants to write but has had such a hard time at it that he has resigned himself to taking money from a married, rich woman, who considers him to be her \"good time\" on the side, for his living. Paul and Holly start out as simple neighbors, later become friends and eventually fall in love which ends up scaring the pepper out of Holly. She's okay flirting with someone but as soon as she crosses that line over into falling for someone, she becomes afraid and runs away. She sees love as a \"cage,\" something that stifles people and sucks the life out of them. She needs help. She needs someone to love her and she needs to be able to love them back. This man is the perfect one for her because he needs her just as much as she needs him. They can help each other. They can lift each other up. By themselves they are nothing but together they are complete. They are two miserable people who can find happiness in one another. <br><br>I like movies about redemption. Stories about otherwise lowly people who are raised to the heights of happiness through love (without it seeming forced or sentimental) are exceptionally rare but when they do show up they tend to appeal to me (that's the reason why I like the story to \"Sabrina\" so much too). I will never EVER forget that last scene in \"Breakfast at Tiffany's\" where Holly is finally confronted with the painful truth that despite all her attempts to deny herself, to hide from her own \"ordinariness,\" nothing about her has really changed. As Paul says \"No matter where you go, you just keep running into yourself.\" She admits that she is lonely and unhappy. She goes back for the cat that she set free moments earlier upon realizing that she was coming dangerously close to \"owning\" him. In going back for the cat she is really going back for herself. She sees herself as the cat and, in fact, there is frequent imagery throughout the film that connects them (Holly wearing the cat mask that she steals from the shop, \"Nine Lives\" being the name of the book that Paul wrote, etc.). She didn't want to give him a name because she didn't want him to belong to her, she would consider that \"caging\" the animal. So she called him simply \"cat,\" but over time \"Cat\" ended up becoming his actual name. In reclaiming the cat she is sort of reclaiming her own life. For a few moments it looks like \"Cat\" may be gone forever, but when she hears the soft \"meow\" and pulls him out of a cardboard box, she is elated. She is the happiest woman on earth. Like the cat, she was lost but now is found. She embraces the cat and kisses her love, Paul, as they stand in the rain. The music swells (Gotta love that \"Moon River\" song) and the screen fades to black. It is, in my opinion, one of the greatest endings of any movie ever.","user":"Damian_","rank":[85,100]}]