[{"title":"Enduring Warner Gangster Melodrama.","rating":8,"date":"5 June 2012","review":"One of the finest of the great gangster melodramas KEY LARGO is still a firm favourite with fans and cultists alike. Produced by Jerry Wald in 1948 for Warner Bros. it was based on the stage play by Maxwell Anderson and was beautifully written for the screen by Richard Brooks and John Huston. Stunningly photographed in low key black &amp; white by Karl Freund it was expertly directed with his customary flair by Huston. The cast assembled couldn't be better with Humphrey Bogart delivering one of his very best subdued performances and arguably being almost eclipsed by a riveting Ed. G. Robinson. The rest of the small cast is fleshed out with Lauren Bacall, Lionel Barrymore, Claire Trevor and Thomas Gomez. And complimenting the on screen proceedings is the splendid music by the tireless Max Steiner who provided one of his best forties scores. <br><br>It is 1946, the war in Europe is over and a returning GI (Humphrey Bogart) arrives at The Largo Hotel in Key Largo. Asked who he is Bogart coolly replies \"McCloud, Frank by John out of Helen\". He is here to meet with the hotel owner John Temple (Lionel Barrymore) to talk about the death of his son George Temple and how he lost his life in combat in Italy saving his unit. But McCloud notices that also staying in the hotel are a undesirable crowd of sinister looking characters. It's not long before he learns that they are a gang of mobsters led by an abrasive deported racketeer - the infamous Johnny Rocco (Robinson). When McCloud reveals who Rocco is and lists his many illegal and crooked enterprises the aging wheelchair bound John Temple gloweringly chides him \"You Filth\" which elicits little more than a snigger from Rocco. Then the gang declare themselves and display their violent ways (they murder the deputy sheriff) and make known their intention to force McCloud to sail them to Cuba. However after Rocco's moll (Claire Trevor) slips McCloud a gun he takes them on in a surprise move out at sea which makes for an intense and exciting sequence. The picture ends with McCloud's dispatch of the baddies and turning the boat around he heads back to Key Largo and The Largo Hotel where a new life awaits him.<br><br>With some remarkable ensemble playing performances are top notch. Bogart gives one of his best portrayals in a likable reserved manner. Here proving yet again that he remains one of the most enduring icons of the silver screen. But there's little doubt KEY LARGO is Robinson's picture! His snarling and totally mean spirited Rocco is the best thing he has ever done. Good too are those in support especially Lionel Barrymore as the irascible aging hotelier, Lauren Bacall as Nora his daughter in-law and Claire Trevor giving a great turn as Rocco's moll in her Acadamy Award winning best supporting actress performance.<br><br>And holding the whole thing together is Max Steiner's great score. His main theme is a lovely gentle anthem-like cue which points up the sadness of George Temple's death in the war and the loneliness now felt without him by his father and widow Nora. Also heard are some great action cues and an appropriate swirling piece for the Hurricane sequence. 1948 was a bumper year for the busy composer. In twelve months the man scored an unprecedented eleven films which included such amazing classics as \"Treasure Of The Sierra Madre\", \"Johnny Belinda\", \"Silver River\" the exceptional \"The Adventures Of Don Juan\" and of course KEY LARGO.<br><br>KEY LARGO remains a memorable and enduring classic from Hollywood's Golden Age. In the tradition of the great noirs it exudes an engaging dramatic thrust throughout and an all encompassing intensity rarely felt in movies today. John Huston demonstrated yet again his prowess as one of film's outstanding directors and with his inspired casting in KEY LARGO the movie will forever maintain its appeal as long as there are movies and a place to screen them..<br><br>Footnote: It is interesting to note that the boat used in the final sequence was Bogart's own boat \"The Santana\".","user":"jpdoherty","rank":[38,42]},{"title":"Superb cast and taut drama","rating":8,"date":"5 April 2004","review":"While chiefly remembered as a Bogart/Bacall vehicle, this story of expatriate gangsters commandeering a sleepy tropical hotel is, in actuality, a tightly directed ensemble piece with acting chops to burn.<br><br>There's Edward G. Robinson as Johnny Rocco--the brash, boisterous, sleazy gangster whose frailties (cowardice and a yearning for better times) gradually unfold before us.  There's Lionel Barrymore as James Temple, the delightfully feisty and crusty hotel owner overcome with revulsion at Rocco's presence.  There's Thomas Gomez, Harry Lewis, Dan Seymour and William Haade as Curly, Toots, Angel and Ralphie--Rocco's colorful but hard-edged thugs who are presences unto themselves.  There's Claire Trevor as Gaye, Rocco's declining, alcoholic moll who symbolizes more than anything how far Rocco has fallen.<br><br>That's an awful lot.  Too much scenery-chewing from Bogart or Bacall would push it over the top--and director/screenwriter/demigod John Huston knows it.  He coaxes remarkably restrained and subtle performances out of his star couple.  The romantic tension between them is suggested but never shoved in the audience's face.  Bogart's wandering war vet Frank McCloud keeps his lips tight and plays his cards close to the chest--a streetwise outsider through and through.  Bacall's Nora Temple lets her anger and distaste pour out through her smoldering eyes more often than her mouth.<br><br>Ultimately, the subtlety is so well-hidden between the gigantic performances of Robinson and Barrymore that you might miss just how sophisticated Frank's story is.  Disillusioned and drifting since the war, he stops in to visit the wife (Nora) and father (James) of a fallen comrade whose bravery he admired.  Implicit in his visit is an unspoken apology that it is he, and not their loved one, who is returning home.  The fallen soldier is a constant unseen presence in the film--his bravery and honor mocking what Frank sees as his own cowardice and inability to stand up to Rocco (Bogart's fast-talking explanation of why he didn't shoot Rocco when he had the chance is classic and rare--a protagonist lying to his friends and his audience--\"One Rocco more or less isn't worth dying for!\").  Frank's eventual decision to take on Rocco and his hoods is a victory against the fear that plagues and shames him.<br><br>In a larger sense, this is a true period movie about a generation of men returning home from the greatest conflict the world has ever known.  Most of our national memories of World War II are proud and triumphant, but, as with any war, it left countless people scarred physically and mentally.  Though Frank is a decorated soldier, he feels somehow that what he did wasn't enough (because he lived and his friend did not?), and he returns back to a country in which he has no place with no real pride or satisfaction.  The confrontation with Rocco affords him a chance (perhaps only possible in Hollywood or on the stage, where the story of \"Key Largo\" was first performed) to make things right with his world.<br><br>While it has not aged as well as the better-known films of Bogart's and Huston's careers, \"Key Largo\" is a film that, for a little investment of attention and thought, will pay big dividends to anyone that really and truly loves movies.","user":"byght","rank":[91,111]},{"title":"under-appreciated classic","rating":10,"date":"19 January 2002","review":"Key Largo is an absolutely brilliant film. Cast and screenplay are both superb. Bogart and Bacall have an intense personal chemistry that sparks on screen, and the supporting cast of Barrymore and E. G. Robinson give their best performances ever. Robinson, in particular, as the slimy gangster johnny rocco is great - his portrayal of the 'banality of evil' is the best I've ever seen.<br><br>The screenplay is magnificent. Not just the dialog, but also the balance of characters is perfect. For each good character there is a bad one of equal weight, forming a perfectly complementary totality, a yin/yang balance that teeters between triumph and disaster according to the finest shades of personal choice. It's an examination of freedom, of corruption, of courage and betrayal - a perfect encapsulation of the world, focused upon a hotel on a tiny island in the middle of a hurricane.<br><br>This movie deserves more recognition than it gets. The action is understated but intense, densely-packed with meaning and significance, at both the individual and cultural level. Watch this movie with new eyes!","user":"geroldf","rank":[21,23]}]