[{"title":"Japanese Poems","rating":10,"date":"6 January 2006","review":"A man returns to his abandoned wife seeking forgiveness and pays for his cruelty. A snow demon and a young man make a pact. A blind priest is summoned by the ghosts of dead warriors to recite the heroic battle that cost them their lives. A samurai is taunted by ghosts in his cup of tea...<br><br>Kobayashi's output has been small compared to his contemporaries' (Kurosawa, Ozu...) yet each of his films is an assault on the senses and a visual gem. After unleashing some of Japan's cinematic legends in two of the greatest samurai films ever made (Samurai Rebellion with Toshiro Mifune and the sublime Harakiri with Tatsuya Nakadai), the master moved on to the supernatural with this collection of ghost stories. Filming for the first time in color, Kobayashi wields it like few others before or since, blending spellbinding compositions together and giving us a film of a visual beauty that rivals the best of Kurosawa, Kubrick or Tarkovsky. The eerie feeling of dread is matched only by the film's sheer beauty and power, like watching a moving painting or experiencing a trance.<br><br>Kwaidan is not entertaining: it is captivating, bewitching, unique even by it's author's standards. For movie-goers, this is a unique experience. For amateurs of art, it is a feast.<br><br>Unmissable!","user":"OttoVonB","rank":[26,26]},{"title":"a marvelous horror film","rating":10,"date":"30 August 2005","review":"This is one of my favorite horror films, and I daresay one of my favorite films in general as well. Anyone who doubts that a horror film can be great art as well ought to give this one a try.<br><br>I will have to revisit this comment after viewing the film again, as it has been a while, but there were a few comments I thought people might find useful regarding the stories the film adapted.<br><br>Two of the stories can be found in Lafcadio Hearn's book Kwaidan: Stories and Studies of Strange Things. These are \"Hoichi the Earless\" (\"The Story of Mimi-nashi-Hôïchi\") and \"The Woman in the Snow\" (\"Yuki-Onna\"). The other two can be found in other books of Hearn's; I'm grateful to Kenji Inadomi for pointing out that \"Black Hair\" can be found as \"The Reconciliation\" in Shadowings, and \"In a Cup of Tea\" is to be found in Kotto: Being Japanese Curios, with Sundry Cobwebs.<br><br>Many of Hearn's stories can be found online, including all of the above except \"In a Cup of Tea.\" Attractive early hardcovers of Hearn's books are pretty plentiful, though, and not terribly expensive either.<br><br>As some others have noticed, there's an uncredited adaptation of \"The Woman in the Snow\" as the \"Lover's Vow\" segment of Tales from the Darkside: The Movie (1990). It's not bad, but Kaidan (1964) is the one that got it right.","user":"FieCrier","rank":[23,23]},{"title":"Classical Japanese tragedy, Expressionist visual style","rating":12,"date":"12 December 2000","review":"There's a good bit of discussion of this film as \"horror\"; may I suggest that it's horrific in the sense of the ancient Greek tragedies. There's no attempt to coerce your Hollywood-abused adrenals into delivering just one more squirt by means of some in-your-face special effect. In fact, for each of these slowly developed stories, once you've understood the premise, the story will unfold pretty much as you've guessed it must, inexorably, relentlessly. The ghosts aren't there to \"spook\" us, they're to show us our common human spiritual and emotional failings. The horror of a ghost wife, for instance, isn't that her chains drag noisily across the the hardwood parquet floor, but that we've created her by our insensitivity, our misplaced values, or our betrayals.<br><br>The visual style is stupendous! The action takes place in a disappeared, iconic world of classical medieval Japan, perfect, and admitting no trace of the reality of modern times. Overlaid is a European Expressionist color sensibility, with emotionally charged color displacements of sky and skin, as if Hokusai and Ernst Ludwig Kirchner had been working cooperatively on the sets and lighting.<br><br>This is a wonderful movie. Please ignore attempts to fit it into some box, some genre. Rather look at it as a mature work of art, which happens to choose old Japanese ghost stories as its starting point.","user":"Paul Weiss","rank":[88,96]}]