[{"title":"A competent musical heart warmer!","rating":8,"date":"5 January 2002","review":"It is said that Miller could never remember precisely the moment he decided to emphasize his new reed section sound... But it was during this disheartening interim, that he realized the unique sound, produced by the clarinet holding the melodic line while the tenor sax plays the same note, and supported harmonically by three other saxophones - just might be the individual and easily recognizable style that would set his band apart from all the rest...<br><br>Photographed in color, Anthony Mann's 'The Glenn Miller Story' is purely a time trip to those years, when Glenn Miller's band ruled the record charts and anchored the airwaves... The film, beautifully captured Miller's spirit and follows his life story with reasonable fidelity... It is one of the most charming and touching musical biography... <br><br>Appearing in glasses and winning grin, Stewart kisses Allyson, holding her face lightly with his fingers, the same way he detains his trombone slide... Stewart applied his natural musical expertise, playing on the trombone... Miller's style was there. The original sound was there. The real music was there. The mix was there...<br><br>The film traces Miller's romance and marriage to his college sweetheart, Helen Burger, and his progress from a free-lance trombonist and arranger to band leader...<br><br>The pop music styles of '20s sweet and jazz bands were getting ready for the Big Band or Swing era of the '30s... About this time, Miller began writing charts that would one day to be his band's stock in fame, the clarinet \"lead\" sound over the saxophones... Miller's imagination, strong will, and determination kept his aspirations alive.. His music, a careful mixture of swing, jazz, and improvisation, flowed like spring with matchless string of hit records ( \"Moonlight Serenade,\" \"String of Pearls,\" \"Pennsylvania 6-5000\", \"Little Brown Jug,\" \"In the Mood,\" &amp; \"Chattanooga Choo Choo,\" among others... <br><br>The constant impact of radio broadcasts, and the drawing power at dance pavilions built and sustained the momentum of Miller's popularity...<br><br>June Allyson, who regularly played the little, lip-quivering waiting wife, again she is the petite and husky-voiced woman who, once married, is supportive and inspirational.. She finances Glenn what he needs to start his own band... Her scenes with Stewart have such a natural, easy-going on the screen, that we get completely drawn into their lives... Also featuring in the film are such legendary figures as Frances Langford, Gene Krupa, and Louis Armstrong...<br><br>With its unique jazz sound, 'The Glenn Miller Story' is a competent musical heart warmer with a well-cast star and successful reproduction of the Miller sound...","user":"Nazi_Fighter_David","rank":[54,58]},{"title":"The Music of Glenn Miller and James Stewart, What an Awesome Combination!","rating":8,"date":"27 May 2010","review":"The unemployed trombone player Glenn Miller (James Stewart) is always broken, chasing his sound to form his band and hocking his instrument in the pawn house to survive. When his friend Chummy MacGregor (Henry Morgan) is hired to play in the band of Ben Pollack, the band-leader listens to one Glenn's composition and invites him to join his band. While traveling to New York, Glenn visits his former girlfriend Helen Berger (June Allyson), in Boulder, Colorado, and asks her to wait for him. Two years later he quits the band and proposes Helen that moves to New York to marry him. After the success of \"Moonlight Serenade\", Glenn Miller's band becomes worldwide known and Glenn and Helen and their two children have a very comfortable life. Duting the World War II, Glenn enlists in the army and travels to Europe to increase the moral of the allied troops. In the Christmas of 1944, he travels from London to Paris for a concert to be broadcast; however his plane is never found in the tragic flight.<br><br>Glenn Miller was the great idol of my father and I recall that in my childhood, he loved the albums (long-plays) of this American musician and usually commented his tragic end. I do not know how many times I listened to hits like \"Moonlight Serenade\", \"String of Pearls\", \"Pennsylvania 6-5000\", \"Little Brown Jug\", \"In the Mood\", \"Chattanooga Choo Choo\" and other Glenn Miller's musics when I was a kid. This is the first time that I watch \"The Glenn Miller Story\" and the awesome combination of the music of Glenn Miller and James Stewart. Further, the lovely June Allyson shows a wonderful chemistry with James Stewart and together with the stunning Louis Armstrong, Frances Langford, Ben Pollack, Gene Krupa, Barney Bigard, James Young, Marty Napoleon, Arvell Shaw, Cozy Cole, Babe Russin and others personalities, they make a great tribute to a magnificent American musician and composer. My vote is eight.<br><br>Title (Brazil): \"Música e Lágrimas\" (\"Music and Tears\")","user":"claudio_carvalho","rank":[18,19]},{"title":"excellent biopic","rating":22,"date":"22 March 2004","review":"James Stewart in one of his best roles of the 1950s playing the late bandleader in the embellished story of his life; June Allyson plays his wife  one of her best roles and I believe one of her personal favourites.<br><br>Watching the real Miller in Orchestra Wives' and then watching this, Stewart is really a revelation in this role.  All the hits of the band are represented  Moonlight Serenade, In The Mood, Tuxedo Junction, Chattanooga Choo-Choo, Pennsylvania 65000.  Some artistic licence has been taken but the whole is funny, celebratory, and at the end fairly touching.  One of the best Hollywood biopics, right in the middle of a glut of them (Love Me or Leave Me, With a Song In My Heart, The Eddy Duchin Story, Night and Day, Words and Music, Three Little Words ).","user":"didi-5","rank":[28,31]}]