[{"title":"Why Marilyn is Unforgettable","rating":8,"date":"8 January 2001","review":"The movie itself is mildly OK. However, this movie shows why MM has been so unforgettable to the American public almost 40 years after her death.<br><br>Check out two scenes. First, the justifiably famous rendition of \"That Old Black Magic\" number. Whether acting or if it's the real Marilyn Monroe, she conveys loneliness in front of a packed saloon; the feeling of recognition and appreciation when the Don Murray (Bo)character berates the patrons to show respect to her while she sings; and the out-and-out sexiness of her when she is lit up in red flames. Wow!!<br><br>The second scene is near the end when, standing out in the cold, Bo offers her his coat. The look on her face when she realizes that someone, maybe for the first time, is there to look after her and take care of her is absolutely moving. Again we can see the real Marilyn in the character. She so desperately looked for love and acceptance all through her life.<br><br>This is not a great movie. It is a great showcase for one of the most  <br><br>remarkable personalities in movie history.","user":"klaatu-10","rank":[28,36]},{"title":"A comedy-drama very well done!","rating":8,"date":"6 January 2001","review":"Alternately puzzled, lost, desperate, lonely, confused and unexpectedly radiant with happiness, Marilyn Monroe, with a mixture of humor and pain scores her greatest triumph in Joshua Logan's \"Bus Stop\" creating a complete and deeply touching character...<br><br>Singing 'That Old Black Magic' to a noisy crowd of cowpokes who couldn't care less about her efforts to entertain them, Cherie is pleased to discover a fan in Bo, a young and innocent cowboy who has come to make his fortune at the Rodeo and finds himself an Angel to take back to his Montana ranch...The kiss she gives him in appreciation, determines him then and there to be his beloved wife...<br><br>Logan gives Don Murray his first and best-remembered screen role, as the gauche simple-thinking cowboy who romances the glamorous 'chantoose'... Marilyn succeeds in making him say \"please\" which is the point of the whole thing... Murray was Oscar-nominated for his performance...<br><br>There are other fine performances in the movie: Arthur O'Connell, delightful as the cowboy's pal who big-brothers him with loving patience; Eileen Heckart amusing as the old time friend; Betty Field, strong enough as the bus stop owner; Robert Bray, firm as the driver of the bus and Hope Lange, so auspicious in her screen debut whom Cherie reveals details of her past...<br><br>With a modern Western background and rodeo atmosphere, and with panoramic long shot and overwhelming close-ups in color and CinemaScope, \"Bus Stop\" is a comedy-drama very well done, and a modest entertainment in familiar American vein...<br><br>The film had one of Monroe's most touching songs: 'That Old Black Magic' was as funny as it was heartbreaking","user":"Nazi_Fighter_David","rank":[58,80]},{"title":"In Praise of Don Murray","rating":10,"date":"5 June 2005","review":"While I'm in agreement with the consensus view on Bus Stop that it is one of the better films with Marilyn Monroe, and I like Monroe as much as the next classic film fan, or as much as the next guy with overactive hormones, I've noticed a relative downplaying of Don Murray's work in the film--often critics outright dismiss him, characterizing Bus Stop as a film that works \"despite Murray's character and performance\". I couldn't disagree with that more strongly. Not to detract from Monroe, but what really pushed Bus Stop over the top for me in terms of quality--in addition to the fine, allegorical story--was the hilariously over-the-top performance of Murray and the sheer absurdity of his character.<br><br>But maybe my different view on this, and why I love the film so much, is because I'm a huge fan of absurdism. Bus Stop is the tale of Beauregard \"Bo\" Decker (Murray) and Virgil Blessing (Arthur O'Connell). They're headed from their ranch in Montana to Phoenix, Arizona to participate in a rodeo. Bo is quite skilled at ridin' and rustlin', so Virgil is taking him \"off of the farm\" for one of the only times in his life to give the rodeo a shot, and more importantly, to get him a bit more worldly experience, especially with women. Bo's experience with the fairer sex had been pretty much limited to pictures in magazines. Virgil seems to just want Bo to lose a bit of his innocence, but Bo has in his mind that he's going to find \"an angel\" and take possession of her. Because he's only been on a ranch, that's the only way he knows how to relate to anything. He figures once he finds an angel he'll just rope her up like a calf and take her home. As we see from the beginning of the film, Bo has a tendency to be brash and yell at everyone, like he's hollerin' instructions across the range at his partner before they lose control of their cattle.<br><br>Enter Monroe as showgirl \"Cherie\". She's a hillbilly (heck, we learn that she even almost married her cousin) from Arkansas whose made it as far as Arizona, where she's playing a dive girlie club in Phoenix, trying to earn enough money and gumption to one day make it to L.A. Once Bo sees her, he decides she's his angel. Needless to say, that doesn't go over so well.<br><br>The bulk of the film consists of Bo trying to ride everything in the world like a bucking bronco while others, including Cherie, try to figure out what's wrong with him. For me, this material was gut-bustingly funny. I had to hit pause on the DVD player a number of times because I was laughing so hard.<br><br>This is not to say that Monroe doesn't turn in a great, nuanced performance--she does, despite the reported difficulties filming her. According to scriptwriter George Axelrod, she would repeatedly break out in tears, become extremely frustrated, forget her lines, yell profanities, and director Joshua Logan couldn't call \"cut\" during her scenes or she'd take it as a personal affront, so Logan would let 900 feet of film just run out while he talked to her, coaxing a performance out of her. And it's not to say that Monroe and Murray do not have chemistry together--they do; if they hadn't, the film wouldn't have worked.<br><br>But without Murray's bizarre but funny character, which he plays to a tee, I'm not sure I would have thought Bus Stop was a 10. In fact, there was one section where I felt that score might be in jeopardy--during the latter part of the relatively quiet climax set in Grace's Diner/Bus Stop, when Murray tones down a bit. The film is still good at that point--still definitely a 9, but I found myself slightly missing the hyperactive comedy of the earlier scenes.<br><br>The story for Bus Stop was originally a one-act play by William Inge called People in the Wind. Inge later adapted People in the Wind for a larger scale production on Broadway, now retitled Bus Stop. It opened at the Music Box Theater in New York City on March 2, 1955 and ran for 478 performances. It was quickly adapted for film by Axelrod, who changed the play quite a bit, including dropping major characters.<br><br>The cinematography in the film is lush, and evidences that we're still in the early days of the anamorphic widescreen process known as Cinemascope. Logan makes use of some broad landscapes and wide shots of the rodeo, crowd and such, but the best uses of widescreen in the film are subtler. Probably the best shot arrives in that \"quiet\" section mentioned above, when Cherie has her head on Grace's bar, her torso stretched horizontally. Bo ends up putting his head on top of hers, aligning his body similarly, and together they fill the screen, naturally conforming to the aspect ratio. Logan's direction is great throughout, both for camera work and his actor's performances.<br><br>As for Monroe, perhaps reflecting (barely) offscreen problems at the time, she easily paints a complex, almost tortured soul. Her performance underscores one of the main subtexts of the film--loneliness accompanied by a kind of melancholy hope. Every character who has more than a couple lines is experiencing this in some way--even Bo, who is covering it up with his boisterousness. Logan and Axelrod also emphasize ironies--one beautiful instance is when Bo announces Cherie as his angel while she's singing \"That Old Black Magic\" in a very suggestive costume. And there are nice, unrealized (by the characters) parallels in their quests--in their loneliness and hope, they're really all looking for their own angels, often not recognizing when they're right in front of them.","user":"BrandtSponseller","rank":[48,68]}]