[{"title":"One of the most real western movies ever!","rating":9,"date":"4 February 2006","review":"I only downrated this movie from 10 out of 10 for the predictable script. I was amused by the comment that Richard Farnsworth seemed out of breath. I am not even Farnsworth's age at filming yet, live in the sticks and I am similarly out of breath when doing heavy work. I have had to quit roping at age 60 due to back pain from previous ski racing injuries and occasional horse falls. In any case this is a very accurate description of cattle ranching anywhere. I have visited places in our Big Smoky Valley where real cattle ranches lived, raised kids and worked in mud, snow, very little for conveniences and without the power grid. We will go to a real cattle roundup near McDermitt, NV next fall of 4000 cattle. This is done by a pioneer family with four brothers, and offspring and is a prized invitation. <br><br>Watching home movies from real ranchers might convince some city people who don't notice things like such rudimentary sparse conditions. One example of a goof in the movie was Fonda putting on a watch which would have been an extreme extravagance in 1945. Had this movie had writing as realistic as the filming, it would have been much better. Robards was just to vicious to be real. This was 1945, not 1875, and he couldn't have gotten away with all the murders. The automobiles used, Fonda's 1928 or 29 Model A pickup, and Robard's 41 convertible, the Sheriff's 37 Dodge, and the Banker's 42 Plymouth were all very typical. In 1945, people didn't have the kind of money that they do now, and drove a lot older cars and there were no new cars between 1943 and 1946, and very few 1942 models due to the war.<br><br>The simple conversations are typical of cowboys and rural people who work hard and don't play boom boxes and don't say much. They are not driven like city people and work much more quietly. The courting buildup between Caan and Fonda had to do with each adapting to the other gradually and trust forming. It wasn't that Caan was laid back as much as he distrusted Fonda's impetuous reactions at first. The writers really got dialog and realistic conditions right. <br><br>I am from a rural background, went to college, drafted into the Army, then finished college and lived and worked in bigger and bigger places and did travel to a lot of places including Europe and Asia. I finally got tired of it, knowing I could create my own job in a small place. This is why a lot of people live in simple places and why so many retire in simple places. They don't care that there are no cable systems, malls, stores, or hospitals. That last long ride to a hospital hopefully will finish you off in the time it takes to get there. Simple places with low housing prices, and a simpler more outdoor life allow retirement poor couples to survive with a decent lifestyle which is far divorced from city/suburban pressured lifestyles. When people wonder why anyone would choose such a life, particularly after \"seeing the world\" some of it is the above. Handshake business, people who care about each other but still fight and argue, and leaving your doors unlocked is real rural culture, particularly in the west, but you always distrust government and you keep your guns ready.<br><br>I highly recommend this movie, I would have given it 8.5 out of 10, but the software is whole numbers, so it is rounded upward.","user":"alanco","rank":[47,55]},{"title":"Bad Movie Title, Excellent Movie","rating":9,"date":"30 April 2003","review":"The title is kind of dumb for this movie that is very good.  Dumb title, because it's not about a horseman coming -- it's about 3 cattle ranchers in Montana (though at least some filming was done in Northern Arizona). Jason Robards is the heavy, as the rancher who owns the most and wants to regain control of the other 2 ranches, which his family once owned.  One of the other ranches is owned by Jane Fonda, who gained control of it when her father, a cousin of Jason Robards, died, and whose only help running it is an old cowhand played by the late Richard Farnsworth (for which he received an Academy Award nomination).  The other cattle spread is owned by James Caan, recently released from the Army near the end of WWII.  Inside Fonda burns a deeply rooted and awful hatred of Robards, for which we gradually learn the reasons.  She and Caan form what is at first an alliance of need and indebtedness, which as you might correctly assume develops into something deeper (and nicer, I might add).  Throw into this mix a rich oilman played by George Grizzard, who wants to get oil out of the land wherever he finds it, regardless of whose land it is, and who exerts some mighty strong leverage against Robards.  What makes this movie good is an interesting plot, made more interesting by the actors -- Fonda and Caan in particular play their roles as authentic western ranch types, as people of relatively few words, with easy-going outward appearances, but strong emotions underlying those facades and hard-edged attitudes attained through a rugged life of hard work.  This was one of 3 movies in 1978 for Jane Fonda, one of which being \"Coming Home\" for which she won an Academy Award. A comparison of her acting in that movie vs. this one, is that this role required more nuance and subtlety, to hold her character's emotions in (which of course she in turn must convey to us, the audience), as she had to completely become a stoic western rancher and horsewoman...which also required greater physical (including facial) control and physical agility. Regardless of which of these 2 major starring roles one might prefer her in that year, it seems obvious that she was at the top of her form.  Also to be admired in this film are the cattle herding, roping, and round-up sequences, and one major sequence of chasing and gaining control of stampeding cattle -- the scenes look real, and were obviously done by some professional cowboys.  There's also the big, open feel of the country provided by the beautiful cinematography of Gordon Willis, whose movies include \"The Godfather\" films and Woody Allen's fabulous 1979 black-and-white masterpiece \"Manhattan\".  So, plenty of good reasons to watch this one.","user":"jmh2350","rank":[40,47]},{"title":"Who said they don't make real villains any more?","rating":8,"date":"1 January 1999","review":"Jason Robards plays such a slimeball character in this that you know the ending from about the fourth minute.  Nevertheless, it's a good story, with lots of hidden secrets to reveal. Caan plays a believable laid-back love interest for tough, gutsy Jane Fonda. The best thing is the photography, however-- in particular the dance scene, in which the camera follows Fonda and Caan as they move through a crowded outdoor dance floor without every losing either focus or the stars. Breathtaking.  Some great mountains somewhere in Wyoming come close to stealing the show.","user":"wcb","rank":[21,28]}]