[{"title":"Spiders!","rating":10,"date":"20 October 2017","review":"Arachnophobia deserves a much higher rating and a lot more attention and fame than it got. Jeff Daniels is fantastic in it and John Goodman steals the show as an exterminator who is in way over his head. Julian Sands is also great.<br><br>It's about super deadly killer spiders who kill a researcher in South America then hitch a ride in his casket back to the United States where they begin a killing spree.<br><br>This movie is very funny and also has a lot of great scares in it. If spiders make you feel icky and or shiver then this is the movie for you. The use of real non-CGI spiders and good practical effects make the spiders much more menacing.","user":"theashtonfive","rank":[21,24]},{"title":"A lazy afternoon movie with poisonous spiders","rating":26,"date":"26 June 2018","review":"I like Arachnophobia for different reasons than usual- I love its setting. Small town western coastal town, bathed in sunlight suddenly gets invaded by poisonous spiders from South America. This is a good enough film and Jeff Daniels is more than adequate as the lead everyday guy. Frank Marshall has an affinity with nature- He also directed Congo and Eight Below and this film suits his sensibility. I doubt if anyone except extreme arachnophobiacs would be scared. Go watch it for a good ride.","user":"abigailperkins-96187","rank":[7,7]},{"title":"Freakish thriller","rating":8,"date":"10 November 2000","review":"\"Arachnophobia\" is a very entertaining horror movie produced by Steven Spielberg. It's takes the fear of spiders to the next level. The film opens with an expedition in South America where a very deadly tarantula puts the bite on an American photographer, killing him in the process. Just before the body gets transferred back to the U.S., the spider sneaks into the coffin. Once in the states, the tarantula quickly mates with a domestic house spider and that creates the ultimate nightmare. Before you know it, a new strain of spiders have been born, that these little creepy crawlers are just as lethal! Jeff Daniels is excellent as the new doctor in town who hates spiders. He begins to realize something strange is happening. A couple of deaths occur, and the doc feels that these unexpected demises might be spider related. And man it's a scary ride to the finish. \"Arachnophobia\" literally gave me the creeps. And it's also funny. Many of the film's comedy is provided by John Goodman as the town exterminator. He's literally a hoot. The thing about this movie that surprised me is that I was pulled into the story right from the beginning and it kept my attention all the way to the end. \"Arachnophobia\" was directed by Frank Marshall, Spielberg's long time collaborater, in his directorial debut. Marshall did a very good job his first time out helming a film which looked like a promising career move at first. He made his second film, \"Alive\" a few years later (I've not seen this one yet). Then he made \"Congo\", which was one of the worst movies of 1995, and hasn't directed another movie since (at least not to my knowledge). But \"Arachnophobia\" was an above average debut for Marshall. He's got good potential as a director. This isn't a brilliant movie, but a good one. And it's lots of fun. One word of warning: if you have a fear of spiders, don't watch this. You'll probably hate it. Don't say I didn't warn you.<br><br>*** (out of four)","user":"jhaggardjr","rank":[36,47]}]