[{"title":"This film is a hoot!","rating":14,"date":"14 October 2003","review":"I'm not a big fan of comedies, but Cantínflas is absolutely wonderful and this is one of his best films.  I laughed out loud all through the film, and loved it so much I bought the dvd.   Most of the humor is verbal, like in the best of the Marx brothers films, so I'm not sure how it comes across with subtitles to a non-Spanish speaking public. I suspect some of the puns and witty responses don't hold up well to translation. If you know Spanish, you will marvel at Mario Moreno's verbal skills.  If you don't know Spanish, you can still enjoy his silly behavior, his funny facial expressions, and the general exasperation of other characters who try to follow his logic.  The pace is fast, the gags are constant, and you will really understand why Mexican audiences flocked to see Cantínflas films for so many years when you see this movie.   He's a cultural icon, and you can't really understand Mexican films without knowing something about this man. He makes fun of authorities, he turns the system on its head and comes out on top against all odds.    It's worth watching to see how he does it.","user":"cyn_duncan","rank":[12,12]},{"title":"Cantinflas couldn't be more happy for going to jail, after killing a mad dog.","rating":23,"date":"23 September 2003","review":"There is no doubt that this is one of  his best movies,. Done in his pre Delgado years, this one was directed by well known Juan Bustillo Oros, who also worked on what turned out to be a great  intelligent script. There should be a warning before the movie starts, because this movie might be hazardous to your health, you may end up with stomach cramps and even watery eyes (or pants) for laughing too hard.  I just acquired a great DVD copy (finally), restored from a 35mm. master. And for the benefit of non Spanish speaking people, it has English subtitles, and it's a great translation done by Televisa (perhaps with a couple of unimportant flaws, considering this is Cantinflas). So, thank you Televisa for caring, I can't wait for more restored DVDs of those Mexican gems from the 40's and early 50's.","user":"hawparks2","rank":[11,11]},{"title":"The movie that launched Cantinflas.","rating":10,"date":"17 January 2003","review":"I still think of this, one of his first movies, as his best. Here Cantinflas' explodes with comic genius. He fully develops the under-educated but always noble, kind-hearted delinquent he is that speaks his mind, only to the confusion of even the most highly educated. The courtroom ending scene also establishes the formula for a bunch of \"mistaken identity\" plot movies that follow.<br><br>The \"Bobby\" scene at the beginning makes you howl with laughter. The portrayal of the absurdities and paranoia of the upper class let every working-class bloke bellow out loud as well.","user":"dlahey","rank":[9,9]}]