[{"title":"Pollack Does Hitchcock","rating":8,"date":"29 April 2004","review":"Three Days of the Condor is a classic spy thriller with a bit of a twist, it takes place inside the U.S.A. There are no flashy locales, no super-hero types, and no ultra-menacing bad guys who spew cheesy dialogue; instead, we have a common man (Robert Redford) battling for his life in an uncommon situation.  This is similar to Alfred Hitchcock's North By Northwest in its theme and intensity and Sydney Pollack pulls it off to perfection.<br><br>Robert Redford stars as Joseph Turner a \"reader\" for the CIA who finds himself on the run after everyone in his office is assassinated.  Pollack wisely allows us to share in Turner's horror and confusion upon finding his dead co-workers.  We witness his scramble for protection and his shaky call to the CIA Headquarters, as he demands to be brought in. The wheels start turning and it seems that all will be resolved, safely and quickly, but things don't go as planned.  After a shoot out in an alley, Turner is seen as a possible rogue agent sending him into greater peril.  Now everyone is out to get him.  Only through quick, imaginative thinking and survival instincts can Turner stay ahead of those who are out to kill him. <br><br>\nIn a moment of desperate improvisation, Turner kidnaps Faye Dunaway to elude his pursuers.  This turn allows us to have someone else view Redford's character for us and provide a different intensity, a sexual intensity, to the film. Again, this is somewhat reminiscent of Cary Grant meeting Eva Marie Saint on the train in North by Northwest.  But this story has more of an edge to it and Dunaway's character has greater depth and purpose than we imagine possible.  She acquiesces to her captor's demands as she tries to understand him and learns quickly to appreciate him and the situation he's in.  <br><br>Through Dunaway's help, Redford is allowed to meet up with the man (Cliff Robertson) who he believes is pulling the strings inside the CIA.  The story turns more cerebral as we learn why Turner's office was hit and who was behind it.  Furthermore, we understand how truly alone Redford's character really is.  The audience is kept guessing through to the very end as to whether or not Redford's character will survive.<br><br>This is one movie that provides action and excitement coupled with a strong plot and solid characters.  Max Von Sydow is excellent as a Joubert, a sophisticated, calculating, even-keeled assassin who is only doing what he is paid to do.  Redford shines as a man whose entire world is thrown into violent disarray forcing him to fight for his survival.  His ability to project his thoughts and concerns through his actions and facial expressions holds the audience to him.  <br><br>While this movie does not have the overwhelming paranoid feel to it that a movie like The Parallax View had, it is stylish, convincing, and an intriguing movie.  Sydney Pollack doesn't fill the scenes with deep shadows and hard camera angles, as some would do.  Instead, most of this story takes place in broad daylight, which actually increases the tension.  There's no easy place to hide, no dark doorways to duck into, no characters stepping out of the fog when we least expect it.  Like Hitchcock, Pollack knows that exposing his hero to the light of day is to abandon him to his pursuers. The audience is pulled in right along with the Redford's character and we can't let go until we know we're safe.","user":"dane11","rank":[142,151]},{"title":"One of Redford's Best, a 70s Suspense Classic!","rating":9,"date":"9 February 2004","review":"A cold, rainy day in New York City...a small, cramped office building where a friendly, diverse group of CIA administrative types do research...one employee, a young 'reader' (Robert Redford), is assigned to pick up sandwiches, and takes a short cut through back alleys to a local deli...a van pulls up in front of the building, a group of disguised, armed assassins disembark, enter...and brutally kill every person in the building, leaving just before the 'reader' returns, to face the carnage...<br><br>With this visually gripping sequence, the stage is set for one of the best suspense films of the 1970s, Sydney Pollack's classic THREE DAYS OF THE CONDOR. In a novel twist of the Hitchcock 'Man Who Knew Too Much' theme, Redford's 'Joseph Turner' (code name 'Condor'), whose employment consists of reading novels and publications for any reference to the CIA, develops an 'imaginary' scenario of an agency 'inside' the agency, working independently, which his boss forwards to Washington for review. Unfortunately, the scenario is true, and Turner and his co-workers must be eliminated, to keep the secret intact. By sheer luck, Turner survives the 'hit', and the bookish 'admin type' must now run for his life, utilizing survival skills he didn't know he possessed, while trying to discover the reason for his 'death sentence'...<br><br>The tension never lets up in this grim, exciting tale, as Turner discovers he can trust no one, and barely survives assassination attempts, again and again. Forced to kidnap a young woman (Faye Dunaway, more vulnerable than usual) to aid him, it takes a death attempt to convince her to believe him, but Turner refuses to allow her to continue to risk her life protecting him, so, ultimately, it becomes a 'David and Goliath' struggle between Turner and the 'outlaw' CIA and it's hired assassins. <br><br>Featuring Max von Sydow as a sophisticated 'hit man', John Houseman as a mysterious CIA senior official, and Cliff Robertson as an agent with an agenda, THREE DAYS OF THE CONDOR influenced a generation of similar-themed thrillers, including Mel Gibson's CONSPIRACY THEORY, and Will Smith's ENEMY OF THE STATE.<br><br>The Robert Redford film is the best of the crop, by far!","user":"cariart","rank":[101,110]},{"title":"Timeless","rating":8,"date":"16 January 2007","review":"I first saw this film back in 1976. The next time was in 2002. Both viewings had me captivated from start to finish even though, second time around, there were parts which I remembered from the first time. Robert Redford (\"Condor\") works for the CIA as a reader/researcher. His job, along with others, is look for new ideas or plots published in books or journals around the world in all languages. He turns up a well authored scheme in a journal printed in a variety of strange languages and reports to his superiors. Unfortunately, someone doesn't agree with his report and his colleagues turn up dead when he returns from lunch one day. Whoever is behind these killings hasn't finished yet as \"Condor\" was on the hit-list. The hide and seek game begins with \"Condor\" trying to stay one step ahead of his assassins. He resorts to kidnapping a beautiful woman (Faye Dunaway) who, possibly through the Stockholm Syndrome, eventually becomes his ally. The film has an unpredictable ending for all involved. There are many stories about the cloak and dagger world of the intelligence communities but few have a storyline which is believable. This is one of those few and it is as relevant today as it was back in '75. If you like films which depict the sinister and dark side of the CIA and provide plenty of suspense with the obligatory victimized female, this is the film for you. I guess the modern day version of this film is Borne Identity. What Robert Redford pulled off over 30 years ago, Matt Damon is doing today.","user":"wwebster100","rank":[28,30]}]