[{"title":"Help me Father, Hold me Father","rating":7,"date":"7 September 2008","review":"Jean Pierre Melville made many great films in his career - Bob La Flambeur, Le Cercle Rouge, L'armee des Ombres, Le Samourai... etc. Melville was widely revered for putting the french back into film noir. His love of American crime drama was the dramatic basis for his films, while the work of the great European auteurs, such as Bresson, formed the artistic direction. His 1961 Leon Morin, Pretre, is then something of an exception. If films like Le Cercle Rouge or Le Doulous were a combination of American and European style, Leon Morin is all European.<br><br>Set in a town occupied at first by Italians, then Germans during WWII, Barny (Emanuelle Riva) is a widowed mother and communist. One day she walks into a church looking to belittle a priest. She chooses Father Leon Morin (Belmondo), because his name sounds less bourgeois. She goes into the confessional and begins her attack. The response by the young priest however takes her by surprise. He has wise and rational responses to her every claim. The two begin conversing regularly, the priest giving her books to read about religion and faith. The young priests rationality appeals to Barny, and she eventually undergoes a conversion, not because she wants to, but because she feels she has no other choice.<br><br>While the two converse in dogmatic banter, that is not only enlightening but interesting and entertaining, life in an occupied town goes on. Barny works at the local school in the office. Her daughter of a now dead Jew is cared for by farmers outside of town, where German soldiers train in the field. The young girl is befriended by a German who cares for her and gives her gifts. A co-worker collaborates with the Germans, but yet remains a friend to Barny. Another coworker Barny claims to be in love with, although it becomes apparent that she is in love with Father Morin, even before a friend points out that he is handsome and she claims that this was the first time she's noticed. The film plays out conversationally, with the plot revolving around ideas and emotion rather than events. It's a smart and thoughtful film, not so much concerned about where its going, just how its getting there. While the film is obviously one of faith, it is not one of traditional dogma. The young priest is so forgiving, so empathetic, that he asserts that of course one does not need to be Catholic to be saved, so long as they live by the laws of the wider church - kindness, generosity, humanity. He exists for the sake of others. During the occupation he houses anyone who needs a place to sleep, without asking questions, even names.<br><br>Characteristic of Melville, he uses interesting editing techniques and cinematography. Consider the first encounter between Barny and Morin: at times the camera looks straight on, making it appear as if they're speaking face to face, then cuts to side angle shots which show the caging of the confessional to obscure the faces. The point? I'm not totally sure, but nevertheless the effect is intriguing.<br><br>Equally compelling as Melville's direction is the performance of Belmondo. Known for his crime roles, most iconically in Godard's Breathless, he gives here a totally different kind of performance. For my money, its also one of his best. He's a bit of an unexpected choice, but he's the right choice, and he inhabits this role like its an old pair of pants.<br><br>Leon Morin, Pretre, is a surprising film. Surprising in its creation by Melville, in its acting by Belmondo, in its portrayal of life in an occupied town, and in its sheer intelligence and humility. It's also a wonderful and heartfelt film.","user":"MacAindrais","rank":[33,34]},{"title":"Barny, the war, and a certain priest","rating":9,"date":"17 March 2010","review":"My thoughts about this film don't seem to follow any precise structural pattern. I will just note the things that struck me and leave it at that. This movie affected me as no other story set in an occupied country ever has. It has a dreamlike pace and texture.<br><br>Barny sees young Italian soldiers appearing in her town, their hats have plumes--are they with a circus?... She forms a passionate friendship with Sabine, her boss: there will be a scene in which Sabine's breasts are pressed against Barny's neck and shoulders... later we find that Sabine's brother has been deported to a concentration camp... Barny and two other women have their children (who are half-Jewish) baptised. They figure that the church will legitimize their kids in the eyes of the enemy... Barny and Léon start to debate the meaning of faith. Léon makes it clear to her that he is not available, but her yearnings know no bounds. Reading Papini as a substitute for sex... Barny is involved with the Resistance, will hide Jews if required to, but her emotional life must take precedence over these activities.<br><br>There is much more, but I will just say that Riva and Belmondo are superb. After seeing her in Hiroshima, mon amour--in which she played well, but not memorably so--I was startled with her accomplished acting here. Belmondo is tough and moving; Léon is no Don Camillo.","user":"bob998","rank":[13,13]},{"title":"Not at all what I'd expect from a Jean-Paul Belmondo film, that's for sure!","rating":9,"date":"1 December 2012","review":"The film is about the relationship between an atheist woman and a local priest. It seems she's come to the church not out of a desire to convert but to join in order to protect herself from the Nazi occupiers, as communist atheists would not be safe. Yet, oddly, during the classes she has with the priest, the woman slowly begins enjoying her meetings and actually gets quite a bit out of them. What happens next, see for yourself.<br><br>\"Léon Morin, Priest\" is a very well made but very unusual film that took me by surprise. The biggest surprise was the casting of Jean-Paul Belmondo as the title character. In so many other films, Belmondo is cast as rogue--cocky, self-absorbed and charming. This isn't a criticism, but it is odd that the same guy from \"Breathless\" now plays a very humble and decent priest! As I said, this is NOT what I expected. The notion of an uplifting religious drama and Jean-Paul Belmondo going together is a bit of a shock to me! The other big surprise is how slow the film is and how unexciting it was considering most of it took place during the Nazi occupation of France--yet, the film was still very interesting and compelling! This is no action film but one that is very deliberate and satisfying if you give it a chance. In fact, it's exceptionally well written and acted and I enjoyed it considerably. And, you certainly don't need to be a Catholic to enjoy this one.","user":"MartinHafer","rank":[10,11]}]