[{"title":"Definite Cult Item","rating":7,"date":"30 January 2001","review":"Not quite sure what to make of this one, but definitely interesting. One is never certain if its strangeness is due to inexperience on the part of the film-makers, or if it truly is an unambiguous artistic choice. The director and star, Robert Montgomery, was very much a creature of 1930's pre-war Hollywood and the film seems to be an unconscious attempt to transplant pre-war film-making sensibilities into the decidedly post-war genre of Film-Noir, with all of its fatalism, disillusionment and complications. It's as if Montgomery is an alien from the 30's exploring a strange, post-war Noir world; rejoicing and experimenting in this permissive new environment, but ever aware that he is not a native. (Though it's highly unlikely this idea ever occurred to him in such a concrete way, as this genre was not identified as such until French critics of the 1960's uncovered a new pattern in American films dealing with crime.)<br><br>There's much here that I, quite frankly, didn't understand. You never really get a handle on any of the characters or what their true motivations are; they're all tantalizingly enigmatic, opaque, but that is admittedly much of the joy of the picture. Everyone seems to be suffering from some kind of guilt that they just don't seem quite able to articulate, much less expiate, so they keep muddling along hoping that they'll stumble across an answer or justification for their sins. The villain of the piece, Fred Clark, is odd. He doesn't just want to trick Montgomery out of the money he's blackmailing him for, he wants to shame him for not being smart and demanding more. Montgomery is mighty odd as well, with some kind of a stubborn, indecipherable personal code of honor; sort of a dumbed down Sam Spade. He's trying to carve out some little island of corruption just for himself, stiff-arming both sides of the law in the process. Most peculiar is the little peasant girl played by Wanda Hendrix. She is instantly devoted to Montgomery, lovingly helps him out of a couple jams but at the end after they say goodbye, she makes some little speech to her friends in Spanish (w.o. subtitles) that gives the impression she was never as innocent as she let on. But what did she gain? And Art Smith (a good crafty little character actor who keeps turning up and making an impression in a lot of films I've been seeing like \"Brute Force\", \"The Next Voice You Hear\" and \"In A Lonely Place\") is an FBI agent who is more like Montgomery's guardian angel. He is almost God-like in how he can pinpoint the exact motivation behind Montgomery's every move and thought.<br><br>All these actors are fine, but Thomas Gomez steals every scene he's in as the deceptively heroic operator of the merry-go-round. He is involved in the film's most brutal and poignant scene, as he is beat up by a couple of Clark's thugs (as the children watch captively on the spinning carousel) for refusing to reveal his friend Montgomery's whereabouts. And I love his great line when Montgomery stumbles back for help after getting stabbed in a fight. He shrugs wearily and says \"when you're young everyone sticks knife in you.\" <br><br>I couldn't for the life of me figure out why the movie would be called \"Ride the Pink Horse\", but I like the other reviewer's theory that it has to do with the arbitrary nature of life itself. A definite cult item.","user":"abooboo-2","rank":[45,52]},{"title":"One you can't stop watching","rating":10,"date":"5 February 2005","review":"I saw this film when I was a young boy when it first came out in 1947 but didn't truly appreciate it till I saw it on TCM the other night again. I agree with all your commentators as to its enigmatic mystery and its possible shortfalls attributable to Montgomery vis a vis Bogart. I found the dialogue and the monologues gripping. In later looking this movie up here I discovered why: the script was by Ben Hecht (of Front Page fame). No wonder it was so great. As many of your commentators point out (and very perceptively too) the individual performances of Gomez, Hendrix, Clark, etc. were all splendid, not to forget Montgomery himself. But TCM must have edited the film or else I fell asleep watching it: I definitely did not see Gomez being beaten up by anyone while being watched by uncomprehending children. That part was definitely not in the version that I watched, sad to say. One of the strongest parts of the film was the disillusionment and cynicism expressed by the Montgomery character against patriotism, and WWII and its profiteers in typical film-noir fashion. Also strikingly evocative and disturbing was the final scene in which the innocent-appearing and passive Hendrix character finally opens up to her friends and re-enacts the events of the film in a vivacious and cynical way to show her friends how sophisticated she is after all. What a dash of cold water in the face of those who expected a romantic ending between two such repressed characters who made a specialty out of never showing their emotions. A great, great movie.","user":"SHAWFAN","rank":[27,33]},{"title":"A truly great film","rating":10,"date":"17 May 2003","review":"An incredible film.  There is so much going on and so much symbolism, the viewer cannot afford to miss a single moment.  The great difficulty with attempting to make sense of most post WWII film noirs is that it is nearly impossible to relate to either the time in general or the turmoil the protagonist is going through after between one and three years in the somewhat surreal situation of extended combat.  Attempting to `assimilate' to society can be extremely difficult.  Many 'Nam vets can relate.  At the time the film was made, just about everyone could relate because if they were not attempting to `assimilate' they knew someone who was.<br><br>\nThe title comes from a scene where Lucky (Montgomery) wants to give Pilar (Hendrix) a free ride on Pancho's (Gomez) merry-go-round.  Pilar asks Lucky which horse to ride and he replies, `Try the pink one'.  What the merry-go-round is a metaphor of each viewer can decide.  However, Pancho may give us a clue when during this exchange he states he gives no free rides.<br><br>Lucky is the typical movie G. I., brusque, rude and tougher than nails with apparently no real direction in life as evidenced by his cheap, rumpled suit and extremely free spending.  Most assume he is out to revenge the killing of his war buddy, Shorty, by a gangster (Clark).  Lucky is considered stupid because he could blackmail the gangster for much more than he is asking and essentially set himself up for life.  However, Lucky recently left an environment where there was no guarantee of life beyond the moment.  Is his motive actually revenge or could he be looking for something else?  He recently survived a situation where his friends died on a regular basis and there was little or no opportunity for revenge.  Can he even relate to revenge?  You decide.  At the end of the movie Lucky works out in his own mind a means of satisfying his motives.  Enough said.<br><br>\nPancho is the wise sage who periodically illuminates a situation with his light, off handed comments.  The scheming, femme fatale (King) has a minor role, which is refreshing.  However, the character who literally steals the show is Pilar a young, inexperienced, poor Indian girl who seems to mature into adulthood during the course of a few days.  She attaches herself to Lucky at the beginning of the movie.  The symbolism associated with her frequently appearing from behind buildings, out of alleys and hearing things no one else does is very strong and adds a true sense of mystery to the character.  Retz ( blacklisted Art Smith), a government agent, and Pilar are often found protecting Lucky from himself.  Pilar later explains to Retz that she befriended Lucky because she saw death in his face.  Pilar assumes the `death' she saw is in the future but it could very well be that Lucky, after extended combat, is living a type of death at that moment.  One of the movie's most compelling scenes is at the end when Lucky, knowing full well what he owes Pilar, has great difficulty determining how to say good-bye. Retz knows Lucky is struggling.  Pilar, having greatly matured, understands either Lucky's predicament or `the facts of life' and handles the situation with the maturity of one well beyond her years.  The beatings Pancho and Pilar take rather than betray Lucky also have strong symbolism, the weak defying the strong and eventually prevailing.  Keep in mind this is 1947.<br><br>This is an extremely powerful movie that leaves so many questions unanswered, one cannot help but wonder long after the movie is over about what lead up to this small piece of Lucky's life, what was actually occurring during the movie and Lucky and Pilar's future.","user":"Cutter-2","rank":[27,36]}]