[{"title":"Cool, Creepy, Gross Sci-Fi Sleaze","rating":5,"date":"5 July 2004","review":"GALAXY OF TERROR is by no means a great movie. But it's a good bit of nasty fun, with generous helpings of sleaze and outrageousness to keep even jaded viewers hooked.<br><br>First of all, let's get the whole \"rip-off of ALIEN\" thing out of the way right off the bat. Other than the first few scenes, in which the crew of a space vessel is ordered to land on and investigate a desolate planet from which strange signals are originating, this movie has virtually no similarity to Ridley Scott's film at all. Let's not forget that most low budget extraterrestrial monster movies in the wake of ALIEN were compared to their more expensive predecessor (or that ALIEN itself was shamelessly derivative of a half-dozen sci-fi flicks from the 50's and 60's).<br><br>The crew land, and soon come to realize that their own worst fears are manifesting themselves physically and attacking them. The control freak pilot finds herself confronted by an unstoppable alien force. The spiritual warrior's mystical crystal weapon turns against him. The gung-ho, by-the-books leader's childhood fear of monsters comes back to haunt him. And, in the movie's gross-out highlight, a female crew member's revulsion of worms results in her being stripped naked, coated in slime and raped by a giant maggot!!!<br><br>There's no shortage of carnage and wackiness, and it all leads up to a surprisingly metaphysical conclusion. Many of this movie's critics have found the ending to be a ridiculous cop-out, but I found it ambitious and thoughtful. Perhaps snobby film buffs can't accept that a low budget sleazefest like this can ultimately rise above its own baseness and deliver a profoundly mysterious ending.<br><br>GALAXY OF TERROR is one of the more imaginative and bizarre of Roger Corman's late 70's/early 80's productions. It features some art direction and 2nd unit work by James Cameron, and has the gritty surreal look of a Lucio Fulci zombie flick. And how can you pass up a movie in which Erin Moran (Joanie from HAPPY DAYS) gets her head squashed by an alien squid? I recommend this movie highly to schlock fans of all ages.","user":"squeezebox","rank":[70,78]},{"title":"Decent flick from New World","rating":6,"date":"25 August 2007","review":"I can't believe that people keep comparing this film to Alien. First of all, the original Alien had a budget of 11 million dollars. Galaxy of Terror was made for around 5 million. Second, Alien was \"inspired\" by many horror/scifi films that went before it. If it wasn't a crime for Alien why then is it a crime that this film used a currently popular genre title as inspiration? Third, Galaxy of Terror has more in common, at least story wise, with Forbidden Planet than Alien.<br><br>This has the look of a much more expensive production and it takes full advantage of it's exploitation roots. It has a fun cast, some minor gore (much less than you would expect in a film like this), and some gratuitous nudity especially during a rather nasty scene.<br><br>It's a fun diversion for fans of these types of films and can be recommended for many reasons. You get to see Robert Englund before he donned the glove, Ray Walston after he was everybody's Favorite Martian and Erin Moran after her years as Joanie. You also get to see some early effects work by James Cameron.<br><br>Sure, it gets a little confusing in spots and there's some continuity problems and more than it's share plot holes, but it's still a terrific movie to look at, great set designs and some of the monster effects are decent (and some are bad). It's all that I expect from Roger Corman with more than enough to keep me interested.<br><br>Make sure to catch the uncut print if you can!!!","user":"kaijueguy","rank":[23,25]},{"title":"Another Weird Late Night Cable TV Memory From My Youth","rating":7,"date":"28 October 2000","review":"I can still remember watching this film in the wee hours of the morning at about 13 yrs old; I wanted decadent, late night cable programming, and this one delivered.  Twenty years later, I still remember it for one scene: a giant maggot raping a woman. It was a completely gross, bizarre, yucky, surreal moment in cinema, but unlike anything I had ever seen. I still can't get over how weird it is and how something like that made it into a film. The rest of the film contains a few other bizarre scenes but beyond this, the film is really just a waste of time.  However, the production design (James Cameron) for this film was actually pretty original and well done for the time/budget (the planet the crew is trapped on has a kind of strangely dim lighting and claustrophobic feeling).","user":"ebert_jr","rank":[28,33]}]