[{"title":"Throw back old school horror film that; depending on your taste, is good and very hard to find.","rating":6,"date":"6 May 2002","review":"Like others who have commented on this movie, I saw One Dark Night at the movie theater when I was a youngster. For a reason I can't seem to put my finger on, this film captured me and has stayed with me through the years. From time to time I love to \"go back in time\" and view this film over and over again. Right of the bat, I will say that some people may not care for this movie due to it's old school feel and cinematography; but for me it's a movie that I've always cherished and will always hold a special place in my heart.<br><br>This movie has a certain bizarre and eerie feel to it that will give you the creeps, and as a matter of fact One Dark Nights oddity and unorthodox flavor is one of the reasons I'm so taken in by it. I'm certainly old school, and I feel like current horror movies have lost the feel and authenticity that some older films seem to have. One Dark Night certainly brings that \"certain\" flavor.<br><br>One Dark Night is the type of movie that would be perfect to watch on a rainy late evening or on Halloween night. I guess you could say it's a cinematic example of what Halloween is all about. It's has lots of spooky elements you look for in horror films: The atmospheric dark Mausoleum, Telekinesis, Gothic funeral procession, sad and thought provoking letters left by children of the dead, spooky graveyard and coroner scenes, a very odd and eerie scene of crime where 6 dead girls are found with a chilling open eyed gaze. It's just good old school horror, they just don't make them like this any more. I also have to give kudos to the background music or the score that's used throughout the film, it's helps the viewers experience. Much more so than I think people realize, the score is a compelling and powerful component that richly adds to the movies effectiveness and brings forth mood which is essential to any good horror film.<br><br>The casting in this film also came off(sort of in a unexpected way) very well. Adam West, who played Batman in the original series in the 60's adds to this films folklore. Meg Tilly plays her part very well and has a \"look\" about herself that seems tailored for a horror movie. The 3 prankish teen girls who were in the High School Sorority clique called \"The Sisters \"were perfectly casted; including one Sister who always gnawed and chewed on a toothbrush, even up to the point of her demise.....gimmicky indeed. It's finer elements like these that seem to endure me to the film.<br><br>Scenes at the end where Raymar tortures members of \"The Sisters\" in the Mausoleum with corpses could be viewed as silly but still some how manages to come over as okay and tolerable. The movie One Dark Night is currently out of print and could be considered rare. Although some may not agree, I consider the film to be a classic example of the genre. If you are a horror buff like myself, I would recommend this movie, you just may find it to be a keeper, and like it for its odd,creepy terror.","user":"macnjnc","rank":[27,29]},{"title":"Great Flick","rating":10,"date":"12 February 2002","review":"by the way it looks at the other comments made, it seems that a lot of people did not get the point to the flick. It is not centered around zombies, as a matter of fact they are not zombies at all, they are a device regenerated by the wizard to scare the girls to death, his main focus is on Meg Tilly, who he wants to help him finish the job that he died while doing in the first place, and what you get is a great flick with an awesome ending, it is hard to find on video, but every once in a while it shows up on HBO or Cinamax, check it out, I gave it a 10 and highly recommend it.","user":"milescorn","rank":[26,30]},{"title":"One Dark Night is one fun 80's flick","rating":10,"date":"9 October 2002","review":"I actually first watched One Dark Night in the theater &amp; wrote a review of the film for my high school newspaper.  I loved it then &amp; I still love it. The storyline revolves around two people.  First of all one woman learns that her father has telekenisis after his death.  She then has feelings herself about the strange powers of her father even in his death.  The mauseleum he's buried in plays host to the other main person, a high school girl doing anything to get in with a group of girls that just want to torment her &amp; dare her to stay in the mauseleum all night to join their group.  They go back in the night to scare her &amp; find scares for themselves. The cast is led by Meg Tilly with supporting roles by Adam West and one of my personal favorites Elizabeth Daily aka E.G. Daily.  Check this one out if you love 80's movies &amp; cheesy horror movies, you won't be disatisfied.","user":"MichaelWeihn","rank":[23,27]}]