[{"title":"An enjoyable, yet hard to find movie.","rating":8,"date":"18 June 1999","review":"Electric Dreams is a quirky '80's film that has remained one of my favorites from that decade.  The story of a boy, a girl, and a computer trying to find the meaning of love could have easily been a ridiculously campy movie, but instead is played out with a lighthearted sincerity.  Lenny Von Dolen's portrayal of architect Miles Harding is done well, conveying the feelings of insecurity and wonder of falling in love for the first time, and Virginia Madsen's performance as would-be girlfriend Madeline equally shines.  The movie is shot more like a music video (Director Steve Barron also worked on Michael Jackson's \"Billie Jean\" video), and while there have been plenty of films that have used similar \"MTV-style\" techniques in the '90's, this was an unpioneered format at the time, and it seems to work the best here. The set design is great, the scene pacing doesn't drag on, and the sentiment is in the right place so that viewers can laugh at the humorous parts and relate during the romantic scenes.  The music soundtrack is also top-notch, with music from Culture Club, Jeff Lynne, Heaven 17 and Giorgio Moroder. The computer technology and the commercials set this movie firmly in the early '80's, which may make it seem a little dated, but the overall story still holds up well and is fun.  Electric Dreams is an enjoyable romantic fantasy that a lot of people may have missed when it was first released (even more so since the film seems to be out of print), but for those wanting to see something a little different, this may be what you've been looking for.","user":"GuyCC","rank":[57,60]},{"title":"A movie to make you miss the 80's","rating":10,"date":"28 August 2000","review":"This movie takes us back to 1984, a time when computers were still mysterious machines which inspired notions of science fiction in the minds of average persons.<br><br>I was only 12 years old when I first saw this movie on HBO back in 1984(5?). This movie really captured my imagination.  Computers fascinated me and \"Electric Dreams\" bolstered that fascination with a fluid plot, dazzling special effects, and a captivating soundtrack.  The music, in particular is so good, I could still sing/hum the tunes for years after first seeing the movie.  My favorite has to be the \"Duel\" song between a cello and the computer.  Wild, wacky, wonderful stuff!","user":"paparotcy","rank":[49,52]},{"title":"Guaranteed to leave you smiling and feeling pure joy!","rating":10,"date":"19 May 2001","review":"I remember back in the l970s I saw a TV film with Bill Bixby in which he had a computer that fell in love with his girlfriend and composed poems for Bixby to give to her. I thought that's what Electric Dreams was based on, but haven't heard anyone admit that's the way it came about. But anyway.....<br><br>Electric Dreams is one of those films that even with some slightly dated technology in it (circa 1984, and even for this film some of the technology is stuff most people don't have in their homes yet!) the story and its effectiveness are timeless. It has a very strong European influence to it that I appreciated--director Steve Barron has a true flair for combining nice visuals and story without each element bogging the other down.<br><br>Miles (Lenny Von Dohlen) buys a computer to help in his quest to design the perfect earthquake-proof brick. He spills a drink on the keyboard, giving it life in the form of the voice Edgar (Bud Cort). In the meantime, cellist Madeline (Virginial Madsen) moves in upstairs and guess who starts to like Madeline a LOT?....<br><br>Several elements make this a winner: The fact that the lead actors Lenny Von Dohlen and Virginia Madsen were cast (relatively unknown actors then) instead of flavor-of-the-month ones. Bud Cort was a brilliant choice for the voice of Edgar in the computer. The music was obviously lesser known to mainstream U.S. audiences but well loved in Europe. Culture Club was a bit established, but artists like Heaven 17, Jeff Lynne (of ELO), Philip Oakey (of Human League), P.P. Arnold, and Helen Terry gave the film a great atmosphere with original songs that still hold up quite well today (yes, the soundtrack is available as an import on CD). I'm proud to say I have the 12\" remixes of the songs \"Together In Electric Dreams,\" \"Now You're Mine,\" and \"Video\" as well as the soundtrack.<br><br>You don't have to exclusively like romance stories to enjoy this film. It has a little of everything for everyone, and invites repeated viewings. It's charming, will make you laugh, and I dare you to not get a little teary-eyed when the phrase \"I LOVE YOU ...ME\" appears on the computer screen to the beautiful music piece \"Madeline's Theme\" from Giorgio Moroder.<br><br>Two scenes in particular will have you feeling exhilarated--when Madeline and Edgar do a musical duet of a familiar classical piece, and the ending where the song \"Together In Electric Dreams\" is bringing everyone in the city of San Francisco to their feet dancing. It will give you a rather overwhelming feeling of joy, and a completely satisfying ending. Just make sure to view all the way through the credits, there's a little surprise after them!<br><br>At the time this review was written, Electric Dreams is only on out-of-print VHS in the United States, but is available on a European region 2 DVD. MGM had been reissuing tons of films on DVD with no frills (except mislabled releases like Swamp Thing--not PG but actually the European cut, and Texas Chainsaw Massacre 2--not actually R but the unrated cut) and I plead with them that when this one is ever issued in the DVD format, that we are given some extras like an audio commentary and behind the scenes features. There must be some very wonderful stories to tell about this charming film and the loyal following it has. <br><br>As the tagline on the original cover read, it's \"The most unusual triangle in the history of love.\" If only more people could be brought together like this and fall in love, the world would be a brighter place!<br><br>\"Open up your eyes and you will see, love is love is everything to me...\"","user":"hippiedj","rank":[43,47]}]