[{"title":"Breathtakingly beautiful","rating":8,"date":"18 April 2005","review":"When we think about aliens in the movies, I guess everybody immediately thinks about the series of \"Alien\" - movies, but there are some other fine examples and \"The Abyss\" may well be the best alternative I can come up with. Even though this was made by James Cameron, the same director who gave us \"Aliens\", both movies are very hard to compare.<br><br>When an American nuclear submarine is attacked during the cold war and crashes, the navy is convinced that it was the work of the Russians. They want to salvage the wreckage as soon as possible, because a storm is coming, but they aren't able to send a diving crew of their own that quickly. That's why they contact a group of workers of a nearby underwater oil rig, who reluctantly accept the job. They are joined by some navy SEALS who will help them to locate and investigate the cause of the crash. But they do not only find the crashed sub, they also find out that there is more down there in the deep than what they had ever expected to see.<br><br>What I liked so much about this movie was that this time the aliens didn't feel threatening at all. It was something completely different from what we were used to see and it worked perfectly. This was a beautiful, well-crafted movie with some very fine acting and with some excellent special effects. Even though this movie was created in 1989, the computer animations were still marvelous and breathtaking. In fact, this entire movie is breathtaking. It is very touching and powerful at the same time and I'm sure that many people will have a lot of difficulties not to show any emotions while watching it. I give this movie an 8/10. It sure doesn't deserve any less.","user":"philip_vanderveken","rank":[123,150]},{"title":"Patience is Required","rating":2,"date":"2 November 2001","review":"James Cameron is mostly known for his blockbuster hits like The Terminator(1984), Aliens(1986), Terminator 2:Judgement Day(1991), True Lies(1994), and Titanic(1997).  Those films contained fast paced action as well as tense moments of human emotions.  One film by Cameron that doesn't seem to get the same kudos as the films mentioned above is the beautifully crafted, The Abyss(1989).  A more character driven and humanistic film than any of the blockbuster features of James Cameron.  Seeing it in the Special Edition version is the best way because situations and people become filled with more depth.  Low Key epic picture that is driven by the excellent acting of its cast.  Certain scenes like the reviving and \"Bud\"'s commuication with aliens moments make the film into an interesting constructed vision of human nature.  In some ways The Abyss(1989) follows some ideas that echos The Day the Earth Stood Still(1950).  Especially true in the film's message about the dangers of nuclear weapons.  Michael Biehn perfects his sterotype persona in The Abyss(1989) as the battle and take charged obsessed Lt. Coffey.  Maybe the finest directed feature film James Cameron has put forth.  The Abyss(1989) is way better than the overrated and less than average Titanic(1997).  Minor weakness is that the film at times drags towards the end.  Ed Harris produces a performance of human depth and quality as Virgil Brigman.  Mary Elizabeth Mastrantonio as Lindsey Brigman is the perfect counterpart to Ed Harris's Virgil Brigman(which is why the two characters make a good couple).  The Abyss(1989) is a very good Scifi film from the 1980s that is a pleasure both emotionally and visually to experience.","user":"eibon09","rank":[77,99]},{"title":"Masterpiece","rating":10,"date":"13 October 2003","review":"Though I prefer The Terminator and Aliens, this film is James Camerons most artistic film. The visual imagery of this film is stunning, with no half measures taken, it is such a pleasure to watch. The aliens look as beautiful as an alien can do and the underwater scenery is so picturesque that I just wish I could be there.<br><br>The special effects are stunning. As with a lot of Cameron's hits, this was an innovator in special effects. If it wasn't for this film, films such as The Matrix and Lord of the Rings would not be here or at least would not have been able to express themselves in a visual sense.<br><br>Cameron is the ultimate director. Although he is a pain to work with, he gets his image across and proves why he is such a hit machine. No one compares to him when it comes to picking a cast. Even though most of this cast were, and still are, unknown, the performances in this are fantastic. I know I always praise him but Michael Biehn as Coffey is one of the best acting performances I have ever seen and the fact that Biehn was not even Oscar nominated is a travesty! He is great to watch as the maniac who is irate and just plain horrible. Ed Harris is on par with his good performances in The Rock and Apollo 13. You just want to be his mate in this movie despite the fact he is another pain (see Rock out takes) which is why him and Cameron have not spoken a word since this film. Mary Elizabeth Mastrantonio was a bit of a fad. She didn't last very long being in good films but she is good as the hard nosed estranged wife who near the end, becomes wonderfully vulnerable and loving.<br><br>Cameron is a great writer and The Abyss, along with The Terminator and Strange Days, shows off his talent to a great extent. As with all of Cameron's Sci-Fi screenplays, behind the technology lies a distinctively human element. This enables The Abyss, despite the extra terrestrial goings on, to approach the audience on their level and suck viewers in to the film. The character of Coffey is a great obstacle character because he is losing his mind and is getting engulfed by paranoia to the point where he can not trust anyone. The way Cameron uses Coffey to build up suspense is very effective and the culmination of this is one of the most frantic underwater chases there will ever be. Spectacular is the only word that comes to mind. The ending of this film has been heavily criticised but this is unfair as it carries a decent message regarding humanity and fits the mood of the film. It may have been slightly rushed but the best bits of the film are all under water anyway.<br><br>Anyone who likes their special effects, a great story and terrific acting need look no further than The Abyss. The contrast of the breathtaking beauty of the ocean between the claustrophobia of a vessel should be enough to captivate most audiences. A fantastic visionary piece.","user":"Lt_Coffey_182","rank":[119,158]}]