[{"title":"Unusual topics make this dated crime drama worth checking out.","rating":3,"date":"3 January 2005","review":"Made at a time when the cinema was exploring new freedoms in language, violence and sex, this is a somewhat tough character study which is tame now, but had to be pretty gritty then. Sinatra is the title cop, a man who bucks the system at times, but has an innate core of fairness. When a wealthy homosexual is found slain and mutilated, Sinatra and his partner Freeman set out to find the culprit. Meanwhile, Sinatra reflects on his troubled marriage to sophisticated, but oversexed Remick. He arrests thuggish Musante for the crime and wins a promotion for his trouble, but, soon after, a young woman (Bisset) comes forth with a case that may be tied into the original one. Sinatra gives an assured and believable performance, though it is jarring at first to hear him bandying about terms like \"penis\" and \"queer\", etc... Remick is attractive and effortlessly sophisticated as his wife who can't seem to keep her knickers on. The supporting cast is made up of great pros who offer a lot. Meeker is a jaded, slimy fellow detective. Klugman does well as a family man cop who helps Sinatra crack cases. Duvall is menacing as a hard-nosed and prejudicial policeman. Musante is so over-the-top it is unbelievable! His interrogation scene is a lesson in extremes (and helped sideline his US career for a while.) Bisset is lovely, as usual, but was shoehorned in (costumes and all!) at the eleventh hour for Sinatra's estranged wife Mia Farrow and the part doesn't fit her as well. She's meant to be a slightly boyish type and that's a tad easier to do on Farrow than it was on Bisset. Bochner is a little too cartoon-campy as a vaguely sinister psychiatrist. Though today's audience will likely find many things to pick apart with the story, it is nonetheless a fascinating glimpse into what Hollywood's depiction of gays was at the time. One unintentionally funny scene involves a dockside parking lot in which scores of gay men crowd into the back of cargo trucks and snuggle - fully clothed! There's also a groovy trip into a velvety gay bar. The film's chief flaws are its overuse of LENGTHY flashbacks and a hugely distracting habit of having Sinatra and Remick deliver lines directly into the camera, a big no-no except in comedies or quirky dramas. The flashbacks are necessary in order to flush out the romantic story, but they tend to be disjointed and overlong. The issue of speaking to the camera could have been easily solved by just having the actors act opposite each other. This was an experiment that just doesn't work. But the film has a fair share of interesting dialogue, situations and visual appeal. One amusing line has a forensic specialist telling Sinatra that the victim was a homosexual. Sinatra looks around the overdone apartment and says, \"Looks like he was a leader!\" Moss Mabry got quite a workout coming up with outfits for Remick, less so for Bisset.","user":"Poseidon-3","rank":[32,36]},{"title":"old fashioned cop movie with decency","rating":4,"date":"4 June 2004","review":"An old fashioned, sometimes silly, but altogether decent and moral little film. The isolated accusation of homophobia present elsewhere in the list of reviews is not accurate. This assumption might be made from watching only the first few minutes of the film, when certain suspicions arise, but as the film develops those suspicions turn out to be quite ungrounded and in fact the Sinatra character openly defends gay characters from a homophobic cop, and so on. <br><br>Throughout this movie the hero has actual moral integrity and refuses to abandon it, most of the time, and if he does it is not glorified. This in itself makes it worth watching just the once, given the general state of other films in the genre.","user":"Tinos","rank":[16,17]},{"title":"Big Town Corruption","rating":8,"date":"16 May 2008","review":"In this film done one year before the Stonewall Riots we get a picture of corruption and homophobia in the NYPD. The Detective should be required viewing for those who want to know about the days before Stonewall when as a people we were subject to routine abuse and violence.<br><br>A nude man is found murdered in his apartment which usually spells one thing, a homicide with gay overtones. Such an occurrence allows the police to be more brutal than usual all in the pursuit of a killer.<br><br>Back in those days it's hard for people today to believe how bars that catered to gay people were the subject of random police raids, usually because the cops didn't get their payoffs. In those days just being in one of those places could constitute an arrest for disorderly conduct and if you touched a member of the same sex and not necessarily in a sexual way that could land you in jail for some time, unless you had the money to pay your way out.<br><br>A man's been killed and suspicion falls on a street punk played by Tony Musante. Frank Sinatra plays a cop who has a specialty in extracting confessions and he does it the hard way, without the rubber hose. Miranda was new at the time, so they can't beat it out of Musante as per normal. Musante confesses he gets convicted and he gets the still operative electric chair.<br><br>But right after Musante is killed, prominent citizen William Windom jumps to his death from the roof at Aqueduct racetrack. Sinatra is again the detective and connections are established with the two deaths. Sinatra's investigations are opening a lot of doors powerful folks just don't want opened. In this he has the support of Windom's widow Jacqueline Bisset.<br><br>Sinatra's dealing with some personal problems at the same time. His marriage is breaking up because it turns out his wife, Lee Remick is a nymphomaniac. Still it's the story of the two gay related deaths that dominate the film.<br><br>The Detective boasts one of Frank Sinatra's best latter film performances. Sinatra eschews the hipster mannerisms and delivers a straightforward performance as an honest Serpico like cop in the midst of big town corruption. <br><br>In the supporting cast I liked Ralph Meeker as a sleazy cop on the take who's quite willing to stop Sinatra any way he can. Also Jack Klugman as Frank's honest sidekick and Renee Taylor as his wife.<br><br>Forty years after The Detective came out who would have thought in 1968 that we would have something called the Gay Officers Action League among the police fraternal societies in New York and many other metropolitan police forces. Their organized presence in police departments have gone a long way in bringing a sensitivity and awareness for the GLBT community.<br><br>And this review is dedicated to two out police officers now retired from the job that I knew and worked with in New York City when I was at Crime Victims Board. To Detectives Vanessa Ferro and Mark Caruso who are the finest of the finest in New York and to all the other out gay law enforcement officials.","user":"bkoganbing","rank":[47,56]}]