[{"title":"The best Nightmare on Elm Street film ever made! Dream Warriors is awesome!","rating":10,"date":"1 November 2015","review":"A Nightmare on Elm Street 3: Dream Warriors (1987) is definitely the best sequel horror slasher film in the series franchise! It is one of my personal favorite horror movies. A Nightmare on Elm Street 3 is my second favorite best film in the franchise that I just love this film to death! I love A Nightmare on Elm Street (1984), this one A Nightmare on Elm Street 3: Dream Warriors (1987) and New Nightmare (1994) to death! This one is the first best favorite film of mine and I just love everything they did in this film. My awesome favorite heroine Nancy Thompson (Heather Langenkamp) is back and better than ever! She is a bad ass! I love everything about this film everything and I love it to death!:P <br><br>\"Welcome to Prime time, Bitch!\"<br><br>This was a MAJOR improvement over the disaster part 2, The Gore FX were excellent and the story was well written. It's too bad Nancy was killed off it would have been nice to see her in future sequels. I love this horror slasher film to death it is very imaginative, entertaining, a good set of characters, some fun catchphrases/dialogue, a great Dokken song aka Dream Warriors...a lot of awesome stuff is in this one. Why I love this film? Nancy Thompson (Heather Langenkamp) returns which you already know I love the main heroine so much in the series franchise. John Saxon also returns as Det. Donald Thompson. Wes Craven is back as writer in this film, the movie is a little longer than the first and the second film. This is Patricia Arquette's first movie. In my opinion it is her first best movie alongside with Stigmata (1999) in other films she made were just awful or some sucked! Anyway I love Patricia Arquette here: She's beautiful, vibrant and has so much emotion in her lovely eyes. A really essential female lead for a film this big. This is how you correctly make a sequel. This one really felt like \"Part 2\" to me because of the continuation from the 1st movie. The hospital setting fit the theme perfectly and this one contains one of my favorite death scenes in the whole series. Also, 80's band Dokken recorded a few songs for the movie which is another reason why this is a must-see for Nightmare fans.<br><br>Chuck Russell is one of my favorite directors he directed The Mask (1994) with Jim Carrey that I love, Eraser with Arnold Schwarzenegger and The Blob (1988) a year later which I also love so much. I think he made great choose of casting the actors alongside with Wes Craven the idea and imaginative of the film flick were just really awesome, how they scramble in to making a movie! Robert England is pure gold in this film, seriously I just love his imaginative and portrayal of Freddy Krueger in this film! The man is the main legend as the villain in the series!, It has a cool premise and I really enjoy The characters. To me this is the 1st best horror sequel ever made after A Nightmare on Elm Street which is the second favorite one in the franchise. I Love this film so much.<br><br>I only have one major problem with the film and that is Nancy dies on the end of the film here. Even tough she dies, the death scene was awesome because it was honorable death! She stopped Freddy for hurting anyone else and Kristen Parker. The death scene was honorable to me because Kristen ( Patricia Arquette) was crying over her death and just love how Kristen showed how of a heart she has and that she is a good wonderful person and a human been. Wes Craven did not wanted to kill Nancy off. He did not like the idea that they killed her off! Jason Saxon as Donald Thompson is also killed by the end of the film which that shouldn't be in here also! The idea for local psychiatric hospital for teens in this film was just very brilliant and very imaginative praise to Wes Craven. <br><br>A Nightmare on Elm Street 3: Dream Warriors, Freddy Krueger (Robert Englund) who invades the minds of a new group of teens -- and the nightmares begin again. Local teenagers start dying and only Nancy Thompson (Heather Langenkamp) knows the truth. Now a doctor at the local psychiatric hospital, she is the lone survivor of one of Freddy's previous killing sprees. Now, it's a fight against her co-workers' disbelief and a race against time to stop Freddy before he kills again. <br><br>That's your basic plot. It does involve travel and invading in to the minds of a teen's dreams. 10/10 Grade: Bad Ass Seal Of Approval","user":"ivo-cobra8","rank":[92,101]},{"title":"One of the better 'ELM STREET' films in the series!","rating":19,"date":"19 June 2005","review":"I've been a fan of Chuck Russell's films ever since his 1994 classic THE MASK. Each one of his movies have a strong amount of slickness and energy, especially A NIGHTMARE ON ELM STREET 3: DREAM WARRIORS. It's one of the better 'ELM STREET' films in the series and was one of the cinematic highlights of 1987. Like THE LOST BOYS, which was also released in 1987, it has style, imagination, a good premise, and gore. It does have a few faults though. Some of the special effects are dated and look quite cheesy and the flick seems to rely more on blood than genuine scares at times. Also, while by no means terrible, Heather Langenkamp's performance is not quite up to par with her performance in the first 'ELM STREET' and NEW NIGHTMARE. Occasionally it feels like she's phoning it in. These faults don't hurt the movie too much. It's still a enjoyable horror picture that holds up relatively well today. It may not be as good as the first A NIGHTMARE ON ELM STREET, but it's much better than most third installments are. I give it 7/10.","user":"jellyneckr","rank":[35,38]},{"title":"Easily the best of the sequels","rating":6,"date":"1 August 2003","review":"Dream Warriors is without a doubt the best Elm Street sequel. The first 2 dealt with just one main character against Freddy and everyone else thinking they're crazy. But of course, after a while people start realizing they're all dreaming about Freddy. And If he can use their dreams against them, they can also use their dreams against him. Brilliant!<br><br>This is where the deaths became more elaborate and Freddy started to spout out catchy one-liners. A lot of people resent this film for starting the whole 'joker Freddy' trend, but this has just the right amount of Freddy wit to still have him be scary and threatening, which really he is.<br><br>This is the most exciting, thrilling, imaginative Freddy movie of the bunch. You have to see it to believe it.<br><br>My Rating: 6.5/10","user":"Derek237","rank":[50,65]}]