[{"title":"a feel-bad epic from a subversive misanthrope","rating":5,"date":"5 May 2004","review":"William Friedkin is a mysterious, often mystifying film-maker. Although he rose to prominence at the same time as the rest of the so-called 'movie brat' generation of directors (Coppola, Spielberg, Scorsese, DePalma, et al.), he stands apart, even from a group as essentially disparate as this one. For one thing, his films lack the intertextual references and cinematic stylisation common to most of the other members. If he has an over-riding aesthetic, it would be the ugliness of the majority of human existence. He's not interested in prettifying his images or indulging in style-for-style's sake; which is not to say that his film's don't exhibit inventive and effective technique, just that this technique is always at the service of the story he's telling, and is often blunt and brutally effective in it's employment. All of this no doubt arises from his start in documentary film-making. Friedkin is particularly good at depicting the menace of urban environments, and the locales of a lot of his films are frightening, tangibly real places. Witness the sequences involving Karras' aged mother in 'The Exorcist', which for me are the most disturbing scenes in an often terrifying film. As we observe the elderly lady living alone in her shabby apartment in a crime-ridden neighbourhood, we realise that this is the existence that many millions of people are forced to endure, and it's oppressiveness adds immeasurably to the psychological impact of the film as a whole. We share Karras' fear and traumatising guilt that she died alone in such circumstances, and the special effects trickery of the climax is lent a genuine resonance. <br><br>Because of the stark, seemingly 'artless' force and apparent misanthropy of much of his work, a number of otherwise perceptive commentators dislike Friedkin intensely. Pauline Kael was extremely cool about 'The French Connection' and absolutely hated 'The Exorcist'. David Thompson described him as \"essentially incompetent\", bludgeoning the audience with blatant and obvious effects. In fact, Friedkin's best work is highly sophisticated in it's use of sound and music, and employs often visceral imagery to telling and subversive effect. However, some of his films ARE genuinely bloody awful, or at least depressingly mediocre. The very inconsistency of his work lies at the centre of the mystery that is his career. He seems to me to be a fiercely intelligent man whose art is driven by his life rather than the culture of film, and whose reportedly quixotic, often self-destructive personality in no small measure accounts for the expansive peaks and troughs of his cinematic achievements. <br><br>Friedkin has reassuring or comforting his audience way down the list of his priorities. In the case of 'Cruising', he neglected to add them at all. Because of this, 'Cruising' is a very difficult film to watch. Most film-makers, were they making a film set in such an alien and frightening environment, would go overboard on providing us with at least one protagonist we could identify with. But Friedkin takes the very opposite route and presents us entirely with characters who are abhorrent, sleazy or totally ambiguous. Indeed, ambiguity is the film's raison d'etre - we are never sure of anything, and this becomes both the pictures great strength and source of much audience frustration. It seems that unlike, say, Spielberg, who continually seeks the approbation of his audience, Friedkin actively resents his (or rather, their preconceptions and certainties), leading him to consistently challenge and upset them. This can be exciting to those who value such seditious manouveres, but dispiriting and destabilising for those that don't.<br><br>The major problem with evaluating 'Cruising' is that the film as it currently exists is seriously incomplete (apparently having been shorn of some 40 minutes of footage by the censors!). I suspect that a 'directors cut' should it ever emerge, although no doubt clarifying certain issues, would overall fail to dispel the central ambiguity that is so infuriating and troubling to the majority of the audience, and that lies at the heart of Friedkins vision. \"What interests me is the very thin line between good and evil\", the director once said when asked to provide a thematic overview of his work - and this is the core of 'Cruising'.<br><br>I would urge you to watch the film. It is a uniquely dark, brave piece somewhat compromised by well documented production difficulties and the censors scissors. It has a sinister, compelling momentum and wonderfully ugly, grainy textures that seep into your pores leaving you uncomfortable and unsettled. Sometimes a feel-bad movie can be as bracing as a winter morning. 'Cruising' is such an experience, and a fascinating, provocative one at that.","user":"LewisJForce","rank":[135,170]},{"title":"a question of taste","rating":9,"date":"14 February 2005","review":"This is a FRIEDKIN movie. Consequently, it is soulless, dark and physical. There are no heroes, the range goes from unclear/mixed up/tortured souls/loonies to the dephts of hell. It is also highly interpretative, you can not expect a logical script and a \"I did it\" smile or a \"walk towards the sun\" type of ending. So, it's a question of taste if you like his movies or not. I DO. I very much doubt that Pacino or Sorvino regret making this film. It is riveting. For one, characters are not even gray, they are a mystery. Sorvino's character, for instance is so blank, that you even wonder if he cares about anything, including Burns' fate. Pacino's character is pretty ambitious, but other than that he is completely controversial. Although he shows some kind of goodness (towards his neighbor, for instance), the ending even kinda questions that (was it because he had sexual intentions with the guy or that he just wanted to do some good?). Also, he sometimes feels overwhelmed by the undercover job (\"I don't know if I can do this\") but then he starts to adapt. One of the possible ideas of this movie is: you dance with the devil and then you start to like it. In any case, it leaves conclusions to the viewer. The atmosphere and especially the music are truly amazing and original. 9/10","user":"dixxjamm","rank":[99,123]},{"title":"Controversial Document of Its Time","rating":13,"date":"13 July 1999","review":"Viewed today, \"Cruising\" still elicits intense responses from both Gay and straight viewers alike.  Mainstream Gays lament, as many protestors of the film at the time of its release, that it shows a homophobic image of Gay life, depecting them as sex-obsessed.  Straights are put off by the frank look at the Gay sex \"cruising\" culture.<br><br>Interesting, however, some of the people involved in the Leather/SM subculture at the time this film was made have praised it for its accuracy of this particular lifestyle -- a pre-AIDS lifestyle concentrated on quick sex that was (and still is) pursued by a segment of the Gay community.<br><br>The film does not pretend to depict Gays as a whole.  It is just a drama about a police investigation that uses the scene as a background and catalyst for an exploration into how one cop is affected by his work.<br><br>Not the greatest film ever made, but certainly a good springboard for discussion about the Gay community's politics, when one fully examines the controversy surrounding the film and the continued debate over public sex and body image in the community.<br><br>The strengths of \"Cruising\" are its use of locales and documentary-style cinematography, as well as the interesting performance from Paccino.  In the end, it is hampered as a drama by problems with the narrative structure of the piece that seems to fizzle out in the last act, leading to an intriguing, but inconclusive, finish.","user":"rand-4","rank":[86,109]}]