[{"title":"simply perfect","rating":10,"date":"19 June 2004","review":"This very hard-to-find mix of animation, music and comedy is a real treat for those who can appreciate it. I recorded it from TV some years ago, and it's still one of the most valuable articles in my archive. Very clever use of in-between b/w passages, great classical music and animations of totally different styles, concepts and attitudes, but each so well-blended with the music and the whole picture that you hardly get distracted.<br><br>\nI don't agree with the comparisons to Fantasia, this is something different. It deals with things (and uses imagery) that a Disney product would never dare, let alone in the days Fantasia was made. <br><br>If you have the slightest admiration for art, and can stand movies without the standard hollywood cliches, grab this one (though that won't be easy) and you'll not be sorry. 10 / 10","user":"suicidea","rank":[27,28]},{"title":"An Overlooked Classical Masterpiece of Sight and Sound","rating":10,"date":"9 June 2003","review":"Many many years ago, I saw this film and I was absolutely transfixed. This film cannot helped BUT be compared to Fantasia due to the fact that they mention this themselves. But what sets this film apart is its absolutely brilliant interpretations, in animated form, of these wonderful classical pieces that don't get as much attention as the ones Fantasia made popular amongst the general public. And there is one classical piece, above all, that was so brilliantly interpreted that it STILL stands out as one of the most moving pieces ever to be put on screen and that is the \"Valse Triste\" segment set to the music of Sibelius. Don't get me wrong, Disney's \"clean\" animation of Fantasia is a wonderful film, but none of its segment moved me as much as Valse Triste. And I think it's free form, scrubby, its understated color use and none heavy handed animation fits BRILLIANTLY here. You don't feel you are watching an animation, you feel as you are watching a painter, with each stroke, visualize the musical note of this wonderful classical piece. You get to see the abandon cat go from fantasy, reality, fantasy, that you wish you could adopt the poor cartoon kitty. If you are a teacher of music, especially classical, get this film and show it to your students, if they are not moved, then nothing will move them. This is the type of stuff that stays with you for YEARS and I guarantee you will be the better for it.","user":"cafesmitty","rank":[21,22]},{"title":"The Italian \"Fantasia\"","rating":10,"date":"3 December 1998","review":"\"Allegro non troppo\" is the Italian answer to Disney's Fantasia. The movie is a parody of the well-known American counterpart, featuring a lousy orchestra (filmed in black and white), a slave animator (the Italian comedian Maurizio Nichetti) and an angry director. The live action part is filled with humor in the tradition of silent-movie comedy, relying mostly on visual gags and on the exceptional mimic of Nichetti. It is in stark contrast with Disney's pedantic and boring intermissions. But it's the animation that makes this movie a masterpiece. Every piece is animated with a different style, showing the best work of Italian animators.<br><br>Guido Manuli interprets Debussy's Prelude to an Afternoon of a Faun, presenting us the sad story of an ageing satyr that desperately tries to attract some nymphs. The tragi-comic character is a perfect match for the music's mood.<br><br>Ravel's Bolero is used for a piece on the origin of life on earth. In this stunning and imaginative sequence, life is born from a Coke bottle! Strange creatures crawl, swim, fly and metamorphose in dinosaurs, finally succumbing to the meanest creature of them all: man. The story of evolution from lowest forms to complex ones is seen as a violent tale of survival, as obsessive as Ravel music. The visuals are superb, with expressionistic colors and weird creature design reminiscent of Bosch.<br><br>Another powerful metaphor is the Slavonic dance by Dvorak, a satire of the sheep mentality of modern masses. The cartoony style is appropriate for the fast paced and goofy music.<br><br>One of the best pieces is probably the incredibly sad Valtzer Triste, about a kitty remembering his better days. This is technically the most impressive piece, with a mix of techniques used at the best to tell this tale through the cat's wide and moving eyes. Again, the music is powerfully brought to life, with such a precise timing and great emotional impact that you won't be able to hear this Vatzer without recalling the image of the poor animal.<br><br>On a brighter note is the Concerto in C Minor by Vivaldi, starring a cute bee that has to survive two lovers rolling over her lawn. There is a subtle message here, when we see the supposedly romantic love play of the couple transformed in a deadly menace... is love not so innocent after all?<br><br>Finally, Stravinsky's Firebird is the soundtrack for another satirical piece about an ideal world where Adam and Eve resist the snake temptation, and the snake himself has to suffer all the consequences of the original sin.<br><br>Allegro non troppo is to Fantasia what Van Gogh is to Wyland. Ten times more imaginative and mature, it manages to be technically as impressive as Disney's masterpiece. There is more \"fantasia\" in each of the single pieces of this movie than in all Fantasia. Bozzetto shows how imagination can achieve results that no amount of money can buy. This is animation at its best.<br><br>If you liked Fantasia, you'll love this movie.","user":"pkos","rank":[16,17]}]