[{"title":"Escape From the Planet of the Apes (1971) ***1/2","rating":9,"date":"16 February 2005","review":"In a brilliant solution for continuing the storyline after the ending of BENEATH THE PLANET OF THE APES, three intelligent chimpanzees from Earth's future take off in Charlton Heston's salvaged spacecraft just prior to Earth's destruction; they wind up hurled backward in time to 1973 California and - in an interesting twist on the original theme - now find themselves the strange visitors in a strange world ruled by bombastic human beings.<br><br>Lovable simians Zira and Cornelius (expertly played by Kim Hunter and Roddy McDowall) lose their friend Dr. Milo (Sal Mineo!) early on in a tragic accident, and find themselves in a strange situation when mankind first welcomes them as celebrities and garnishes them with gifts, but ultimately begins to fear when it is learned that Zira is pregnant with an ape offspring that could grow to overtake humanity.<br><br>We really grow to sympathize with the plight of the chimpanzee couple, and we fear along with them and the safety of their child when they become hunted fugitives later in the story. Eric Braeden is very good as the quintessential villain out to kill the ape family at any cost.<br><br>Some people enjoy picking on the APES sequels as they continued, but I've always felt this series consistently remained very intelligent and had something powerful to say about race relations and prejudice. People want to know how apes could ever manage to send Taylor's ship into orbit; I say that if you can suspend disbelief long enough to accept the notion of intelligent apes, then it shouldn't be that far a reach to accept that Dr. Milo was the genius of his time who just could pull it off; the Thomas Edision of his type, if you will.<br><br>The timeline in the five apes films is often admittedly contradictory, but there are ways that fans of the Apes movies have been able to make them work. For example, in this film Cornelius seems to talk about Ape History and Evolution in a way that actually doesn't follow suit during the next two installments. That's because the very arrival of Zira and Cornelius onto present-day Earth of 1973, and the subsequent birth of their baby, will accelerate the procedure from how Cornelius remembered it, as we'll see in the next two chapters. The circumstances for the future will be sped up and changed, and the apes will evolve at a much quicker rate.<br><br>Some of the other dubious complaints are aimed at the \"lesser budgets,\" or supposed \"TV Movie Look\" of the sequels from this point on -- but this story in ESCAPE does not require mind-numbing special effects or hordes of CGI-rendered ape figures swarming Los Angeles to make it effective. It's got a lot of heart and good writing with characters we care about, and that's all it needs.\n***1/2 out of ****","user":"JoeKarlosi","rank":[38,42]},{"title":"A Film in its Own Right, Not Just a Sequel","rating":6,"date":"29 April 2005","review":"After \"Planet of the Apes\" was completed, its star, Charlton Heston, argued strongly that there should not be a sequel. The original film was complete in itself, and any sequel would only dilute its impact and tarnish its reputation. In the event, a sequel was made and Heston was reluctantly persuaded to appear in it. He suggested, however, that it should end with the destruction of the Earth, a denouement that, he hoped, would put paid to any attempt to extend the series beyond two films.<br><br>In one respect Heston was to be proved right. \"Planet of the Apes\" is a classic, one of the best science-fiction movies ever made and one that combines an exciting plot with philosophical depth. It is frequently said that sequels are generally inferior to the original films, but seldom is this is as true as in the case of \"Beneath the Planet of the Apes\", a hopeless mess of a film. Neither its lack of artistic merit, however, nor its explosive ending dissuaded the filmmakers from making a third \"Apes\" film. An ingenious device was found to avoid the problems posed by planetary destruction; it is explained that shortly before the Earth was destroyed three of the apes found the wreckage of Taylor's spacecraft, repaired it and used it to travel back in time to 1970s America.<br><br>Although one of the apes is killed in an unfortunate incident shortly after arrival, the American public take to the two survivors, Cornelius and his wife Zira (both of whom played important parts in the first two films). The two intelligent, talking chimpanzees become media celebrities, and the early scenes are much lighter in tone than the two earlier films, at times even comic, as the two apes become after-dinner speakers and discover the joys of alcohol. The tone, however, gradually darkens. Figures in the government become alarmed by talk of a future in which men are dominated by apes, and Dr Hasslein, the President's sinister Germanic adviser, (based on Henry Kissinger?) is convinced that Zira and Cornelius represent a threat to the human race, especially after it is discovered that Zira is pregnant.<br><br>My disappointment with \"Beneath....\" had hitherto dissuaded me from watching any more of the later episodes in the \"Apes\" canon, so I was pleasantly surprised by \"Escape.......\". Although it lacks the depth and brilliance of \"Planet of the Apes\", it is considerably better than its immediate predecessor. The reason for its relative success lies with the fine contributions of its two stars, Roddy McDowell and Kim Hunter. Their characters played important supporting roles on the original film; here they take centre stage. The original had Heston's character Taylor at its centre, a human in danger from the apes. In \"Escape......\" the roles are reversed, with two lovable, and deeply human, apes in danger from humans. There is, however, a difference between the two films. The danger to Taylor came largely from ignorance; the apes, particularly Dr Zaius, saw him as a brute beast, like the other humans of their planet, and refused to listen to the evidence that suggested that he was, in fact, an intelligent being like themselves. Cornelius and Zira are in danger because of both their human and their non-human characteristics. Hasslein knows that they are intelligent beings who seem human and yet are not, and hates and fears them for precisely that reason. Just as they pitied and befriended Taylor, so they are in their turn befriended by two human scientists who try and save them from Hasslein.<br><br>There are a couple of inconsistencies between this and the earlier films, where the apes' society is shown as being technologically less advanced than ours, on a par with sixteenth or seventeenth century Europe. It is not explained how individuals from such a society could have succeeded in repairing and operating a spacecraft. Another inconsistency is that Cornelius and Zira know how the apes came to seize control of the Earth from humans and even state that this story is told in the Sacred Scrolls, the holy books of the apes' religion. In \"Planet of the Apes\" we are to understand that the Scrolls explicitly deny that humans ever had the powers of speech and reason, which is why Zaius is so reluctant to admit that Taylor can speak. These inconsistencies, however, are not really plot-holes as such and are unlikely to worry those who come to \"Escape.......\" without having seen its predecessors. \"Escape.......\" can be seen as a film in its own right rather than as a mere sequel, a film which starts out as a comedy and then turns into a serious thriller as the apes try to escape from their human enemies. Although it is less philosophical than the first film, it can perhaps be seen as an allegory of racism as Hasslein's paranoia leads him to treat as enemies those who bear no ill-will to him and his kind and whose only crime is to be different from him. It is significant that his name is derived from the German for \"hate\". 6/10","user":"JamesHitchcock","rank":[47,53]},{"title":"Good sequel with a heart (yet people still don't get it)","rating":5,"date":"5 October 2000","review":"MORD39 RATING:   ***  out of ****<br><br>This third APES film ingeniously manages to keep the franchise alive and produces what is arguably the second best film of the five originals.<br><br>After the ultimate ending in BENEATH, who could have believed a new story was possible? Here the tables are turned from the original film with a remarkable twist: now three of our chimpanzee characters take off in Charlton Heston's spaceship and wind up going BACK in time, to \"present Day\" Earth (1973 A.D.) Once it is learned that Zira (Kim Hunter in her best performance in the series) is pregnant with the child that could possibly turn our future into the PLANET OF THE APES, she and her husband Cornelius (Roddy McDowall) go from becoming honored celebrities to dangerous threats to humanity!<br><br>It's a brilliant idea, and now it is possible to start the series anew (chronologically, this movie comes first) and see whether or not Taylor's nightmare from the first film can be prevented or will rear its ugly head for mankind. <br><br>A little defending is in order here. Many people get hung up on the story's notion that the chimpanzees can actually manage to fix Taylor's ship from the first film and actually launch it. Well, I say that if you can suspend disbelief long enough to accept the idea of a society of talking apes, why can't you accept that one of them (Dr. Milo) is a super-intelligent ape, sort of the \"Albert Einstein\" or \"Thomas Edison\" of his time? Besides, when folks get stuck on a point like that it becomes impossible for them to have a good time with a film. As Cornelius said in the movie: \"Dr. Milo was a genius well in advance of his time.\" He was able to fly the ship. Case Closed.<br><br>Next case: the \"TV Movie\" look of the film. SO WHAT? People have become so accustomed to garbage like 1999's THE MUMMY that unless all films are over-swamped with spectacular sets and numbing effects, they can't enjoy them. Well, ESCAPE needs none of these to tell its simple story. It's got something that sci-fi stories today have lost...\"heart\".","user":"mord39","rank":[50,60]}]