[{"title":"Yo Mr. Rumsfield!!!","rating":29,"date":"29 May 2001","review":"Okay, I know Tom Hanks has done some greater than great work.  Forest Gump, Saving Private Ryan, and The Green Mile are truly American classics.  For some reason (maybe I AM a weirdo) this is my favorite movie of his.  It has a simple plot, a light tone, shades of horror, and some GREAT one-liners that have stayed in my memory since I was nine years old. This is one of those movies that never gets old.  I especially like Corey Feldman as Ricky Butler.  He played the best burn-out I have ever seen and he truly is an underrated actor.  Rick Duccoman is great as the obnoxious neighbor, Art and his laid back manner continues to bring a smile to my face.  Bruce Dern is flat-out awesome as the war-crazed vet who has all the right gizmos for the job, but always fails miserably.  Almost every line out of his mouth is memorable and his response when he steps in a pile of dog crap is a classic quote.<br><br>Obviously this is a satire on Suburban life and nosey neighbors, but I could care less about all that.  This is a classic that ranks (in my mind) with the likes of \"The Goonies\" and \"Smokey and the Bandit\".<br><br>If, for some reason, you missed this one, PLEASE see it.  You have no clue what you're missing.","user":"billybrown41","rank":[129,145]},{"title":"One of the most underrated films of the 80's","rating":7,"date":"30 September 2004","review":"Commonly tossed aside as a predictable, poorly plotted film with few laughs, \"The 'Burbs\" has more to offer than most critics are willing to admit.<br><br>This film is not so much about the plot(which is admittedly thin and which the critics are too concerned with) as it is about the characters who become entangled within it. Included in this terrific cast are Tom Hanks, who plays the skeptical neighbor of the new family on the block (a bunch of oddballs who never leave the house); Rick Ducommun, who plays the gluttonous friend of Hanks, who is convinced that the new neighbors are brain sucking murderers; Bruce Dern, the ex-soldier who hasn't quite left his miilitary roots behind him; and last, but not least, Corey Feldman, who plays the dopey teenage neighbor who basically watches the events of the movie unfold from the comfort of his front porch.  These characters are so well-acted and so downright wacky that you just have to believe there is a neighborhood somewhere with people like this.  The chemistry between everyone of the characters is simply impressive, and much of the humor of the film can be found in the often ludicrous way the director portrays their interactions.<br><br>I urge anyone who has seen this film before to watch it again, this time paying little attention to the story and focusing on the superbly acted characters.","user":"mjukr","rank":[125,148]},{"title":"Ducommun Delivers In One Of My All-Time Favorites","rating":10,"date":"6 March 2006","review":"Sometimes a bizarre comedy just hits the right notes with me and, despite none of my friends liking it, I love it. This is a premier example of such: one of my favorites in that category. The fact others don't share that opinion doesn't bother me, but I am glad to see reviewers on this site who appreciated this black, very underrated gem.<br><br>I always get a big kick out of this film, no matter how many times I see it.I credit a little-known actor for making this so entertaining to me: Rick Ducommun. I think he steals the show from well-known stars Tom Hanks, Bruce Dern, Carrie Fisher and Corey Feldman. <br><br>Actually, I think this film is panned a lot because they didn't expect Hanks to be in something this goofy. Too bad, but I bet he had a lot fun making it, along with the rest of the cast.<br><br>Ducommun and Dern are the hilarious wackos who try to help straight-laced Hanks find out about the really-strange neighbors he has next door. Are these people some demented killers or just the figment of these nosy neighbors' imagination? Fisher is Hanks' always-complaining wife and Feldman is the teen across the street who watches all the lunacy from his porch, getting his getting nightly entertainment from these crazy adults.<br><br>Director Joe Dante, of \"Gremlins\" fame, does a good job entertaining us in here, too, and providing some fun camera-work. Dante also used music to great advantage, mostly for humor.<br><br>This is one of those \"not for all tastes\" films, so chances are you won't like it and think it's stupid. For a number of reasons, I love it.","user":"ccthemovieman-1","rank":[91,111]}]