[{"title":"One of the best canine-cop movies I've seen!!","rating":9,"date":"18 June 2006","review":"James Belushi) is a \"loose cannon\" cop. He has to do everything his own way on his own time and doesn't know the meaning of the word, \"team-work\" But after he screws up his last bust by buying a car from a car dealer and five minutes later proceeds to crash it into a building where the bad guys are dealing dope, he is assigned a new partner, a dog! To be exact. A rouge German Shepard that wants to be treated more like a person than a dog.<br><br>Belushi is very convincing and hilarious in his role as a cop, and the dog, surprisingly (I never thought I'd write this), was a great actor and did a terrific job. Hat's off to his handler!<br><br>There are predictable and very typical cop vs. bad guy moments, but overall I thought the movie was an extremely funny cop-doggy comedy, with a very predictable but humorous ending to it.<br><br>When compared to other cop-dog movies like \"Turner and Hooch,\" it's a credit to Belushi's comedic timing that this film wound up on the top 250!","user":"michaelzstuff","rank":[26,31]},{"title":"I Love It","rating":9,"date":"24 January 2004","review":"As a young child, K-9 was one of my favourite films, and although my tastes have matured with time, this is still a very funny film, with one of the most underrated actors ever, James Belushi.  Playing the superb Bill Murray deadpan style, but usually as a cop, rather than Murray's humorous loser roles, Belushi is a likeable dodgy cop.  The end scene in the hospital is the best man and dog conversation ever, although Jerry Lee jumping in the poodle's car runs it pretty close.<br><br>My rating : 9 out of 10","user":"TheHig","rank":[22,28]},{"title":"Fun movie","rating":8,"date":"18 May 2003","review":"James Belushi and the dog named \"Jerry Lee\" make an excellent pair in this fun cop romp. The duo make a natural pair and Belushi puts in an excellent performance without getting behind the lovable \"Jerry Lee,\" who gets animated very aptly by excellent editting and direction.<br><br> Fun movie, see it.","user":"LivingDog","rank":[15,20]}]