[{"title":"Gother Than Thou","rating":26,"date":"26 March 2004","review":"\"The Hunger\" opens with the by now familiar Goth anthem \"Bela Lugosi's Dead\" by Bauhaus.  Not a bad way to open a vampire film, though nowadays it would seem almost a parody.  \"Undead undead undead\" indeed.  Enter Cathy and Bowie into a slick, sleek, neon nightclub, filled to the rafters with post-punks &amp; pre-Goths playing dead.  Too bad they weren't as ready for the real thing as they thought they were.  You see, Cathy and Bowie are vampires.<br><br>This is a visually stunning film, making up for in effects what it sometimes lacks in coherence.  It seems that lovely, immortal Cathy, called Miriam, is a vampire queen who has been around since the Sphinx was built, apparently.  Bowie is her consort, a once mortal man whose two hundred-odd year lifespan is suddenly winding down at a frighteningly rapid rate.  Desperate to find a cure, he seeks out scientist Susan Sarandon, who at first disbelieves Bowie's claims, but is soon convinced when the young and handsomely androgynous man suddenly ages over the course of a few hours time into a decrepit ruin. Miriam, who has had countless lovers over the centuries, gives Bowie the heave-ho and turns her attention to lovely young Sarandon.   But Sarandon, though initially easy to seduce (in an erotic lesbian scene) proves to have a will stronger than Miriam's, and Miriam's habit of keeping her collection of ex-lovers cadavers close at hand, proves to be a mistake.<br><br>This is a strange film, almost as cold and dispassionate as one might well imagine a vampire to be.  It seems to hold the viewer at arms length, not allowing them to experience the emotions of the characters...but the characters, for the most part, are severely lacking in emotion anyway, so the stark emptiness of the film becomes a brilliant mirror.  Some vampire enthusiasts might find this boring and confusing, but it's a good effort and not a total loss.<br><br>The three main characters are worth watching simply for their amazing beauty and grace.  Tony Scott (brother of Ridley) has made a nice, if somewhat bizarre and chilling, work of art here and, like most works of art, it's up for interpretation.","user":"Gafke","rank":[86,98]},{"title":"Critics hate it and I love it...go figure.","rating":7,"date":"16 December 2000","review":"For all the critics have to say, I must admit that this is one of my cult favorites. I keenly remember anticipating its release and seeing it at the 8th St. Playhouse theatre (where the weekly Rocky Horror movie/show ran for years in NYC). The mood and cinematography attest to its aspirations and for me are quite successful. In particular, the choice of soundtrack music is quite adept and urbane although only those very familiar with classical music will appreciate the tie-ins: Deneuve's playing of Ravel's \"Gibet\" from \"Gaspard de la Nuit\" for piano after John passes and after Sarandon's character makes her first kill...her husband. This piece is Ravel's programmatic interpretation of a French poem which describes a person wearily walking under the intense scorching sun and seeing something in the distance, approaches, only to find a corpse strung up, rotting in the midday sun. Beautiful usage of Schubert's Piano Trio as well as haunting movements of a Schubert piano sonata. Then there is the obvious thematic tie-in with \"Lakmé\" by Délibes. (Lesbian love) And you've got to love the use of the band BAUHAUS in the opening sequence-with the lead singer singing \"Bela Lugosi's Dead\" in the suspended cage. Deneuve is absolutely ravishing and used to great effect and lovingly photographed. David Bowie does an exceptional turn as her lover. What I admire most is the movie's ability to paint a feeling and mood of their existence outside time, eternally present yet eternally on the fringe, startlingly beautiful yet shrouded, veiled, amorphous and ultimately predatorial. Finally, the thought that Deneuve's past lovers never die but are trapped eternally in a constantly decaying shell is absolutely frightening. Did I mention that Deneuve is sublimely beautiful?!","user":"JP2A2M","rank":[69,80]},{"title":"Stylish Vampire Movie- Love Is Eternal While It Lasts","rating":9,"date":"25 March 2007","review":"In New York City, the lovers Miriam Blaylock (Catherine Deneuve) and John (David Bowie) are vampires that survive through time under the Egyptian symbol of Ankh. When John starts an accelerated aging process, he seeks the specialist Dr. Sarah Roberts (Susan Sarandon). However, he does not survive, and Miriam selects Sarah to be her next lover.<br><br>\"The Hunger\" is one of the best vampire movies ever made. I recall when I saw this movie for the first time, in an art cinema in Rio de Janeiro, and later at least three times on VHS. Now on DVD, this stylish film improves with the fantastic melancholic and artistic atmosphere, with a magnificent music score and wonderful cinematography. This movie is totally underrated in IMDb since it is one of the most beautiful vampire movies ever made, actually a masterpiece of the genre. Catherine Deneuve, David Bowie and Susan Sarandon have overwhelming performances in this unforgettable movie. The remarkable scene of the lesbian love of Miriam and Sarah is among the most erotic in the cinema history, never being vulgar. My vote is nine.<br><br>Title (Brazil): \"Fome de Viver\" (\"Hunger for Living\")","user":"claudio_carvalho","rank":[68,82]}]