[{"title":"The Searcher's in the 60's.","rating":8,"date":"30 November 2005","review":"This is a brilliant film that is much more than it should be because of one genius director - Walter Hill.<br><br>He understands and sets the tone and world of this pic perfectly - it has straight-forward, old-western style dialouge, clear good and bad characters and rip-roaring action that reminds you of the old classic westerns that Walter Hill admittedly loves, in particular the Searcher's.<br><br>I won't say much about the plot expect for a badboy returns home rescue the girl he once loved after she is kidnapped by a leather-clad motorcycle gang. It's pretty simple but what you have to watch out for here is Walter Hill's visual and editorial style which was probably the best around in the eighties.<br><br>There isn't any Oscar-worthy performances here but there was never meant to be none - Michael Pare does well with his limited John Wayne modelled role, Rick Moranis shows that he can play much more than the \"nerdy-neurotic\" character that made him world famous in the early nineties, William Defoe plays a better villain in this than he did in Spiderman and Diane Lane shows that she was once, the hottest woman in Hollywood (she still ain't too bad today!).<br><br>This film deserves more credit, votes, attention and DVD extra's than it presently has - definitely one of the best film's of the eighties.","user":"monster-monster","rank":[47,52]},{"title":"Extraordinary kinetic work","rating":8,"date":"23 December 2005","review":"Walter Hill, whose fine directorial achievements include \"Hard Times\", \"The Warriors\", \"Southern Comfort\", \"Crossroads\", \"Johnny Handsome\" and \"Extreme Prejudice\", scored another creative bullseye with this self-proclaimed \"rock and roll fable\". Though it is simplistic in the extreme, it is an extraordinarily kinetic work with great music, stunning cinematography, cutting edge editing (from Hill regular Freeman Davies) and fantastic production design.<br><br>From a purely visual perspective, it was way ahead of its time, and like most things that were ahead of their time, it flopped badly (at the box office). So much of the film is worthy of praise -- the opening credit sequence employs a bravura graphic technique that has been much imitated; the kidnapping of Ellen Aim (Diane Lane) is a stunningly staged sequence, as is Lane's mimed rendition of Jim Steinman's fabulous \"Tonight Is What It Means To Be Young\". The climactic fight sequence between Michael Pare and Willem Dafoe (in one of his first screen roles) is magical, as are all the film's scenes of physical combat.<br><br>Hill makes mean, lean, muscular movies and populates them with both fresh faces and screen vets. Michael Pare, who had a limited career, is just fine as the mythical Tom Cody, the film's reluctant hero (is there any other?). Dafoe shines as Raven Shaddock, the lead of the kidnappers, and the MIA Amy Madigan is just terrific as the tough-talking McCoy, Pare's feisty sidekick.<br><br>Andrew Laszlo, who worked with Hill on \"Southern Comfort\" and even shot Tobe Hooper's \"The Funhouse\", does a knockout job with the cinematography and, working with ace production designer John Vallone (another Hill reg) creates a magnificent retro universe on the Universal backlot.<br><br>Not to be missed!","user":"fertilecelluloid","rank":[75,86]},{"title":"Comic book action story with style","rating":10,"date":"15 January 2005","review":"I seems that not everyone understands the greatness with this movie? -The actors do a really good work-Moranis is one, and Pare is good, but he has much less to play with as a carachter. -style is everything here: the lines are like they where stolen from old westerns or movies from the 50s. To really enjoy this movie: do not expect the ordinary action...see it as a \"musical\" set in a theatre and admire the artificial \"artsiness\" of this studio-style film! ...the bad guys are really bad...but funny, -and the good guy is really brave... -This is not suppose to be your ordinary action movie! -This is art...and poetry!<br><br>Best Regards<br><br>/MadvikinS","user":"madvikins","rank":[71,82]}]