[{"title":"A Parting Gift from Ray Harryhausen","rating":10,"date":"10 October 2001","review":"I ignored this film when it first came out in 1981. There were just too many cool films to see that year. Friends who saw it told me it was a laughable hoot. Despite it's august cast and attempt to cash in on the mythic quest themes of Star Wars, it rapidly sunk from sight. In 1995, looking for a film appropriate for my 7 year old daughter, I pulled this film out of the 'family' section of my local library. The critics are right. The F/X are clunky, even by 1981 standards.Harry Hamlin is wooden. Judy Bowker is forgettable, and Laurence Olivier hams it up shamelessly...and yet...IT ALL WORKS! The sets and lighting perfectly capture our deepest feellings of mythic Greece. There isn't a drop of contemporary forays into irony &amp; cynicism. It is unalloyed GOOD vs EVIL lovingly given to us by the effects wizard Harryhausen. His monsters have a childlike beauty that makes them 'scary' without trying to gross you out. It's the myth, the quest, and finally the theme that love does conquer all. No need for smart-alecky, eye-winking protaganists. Just a good old fashioned story told straight and true. My now 14yr. old daughter, wife and I just saw it again last night. See it with the child in your life, or the child in you.<br><br>Thank you Mr. Harryhausen, for this and all your wonderful films.","user":"badact","rank":[100,116]},{"title":"CGI is for cowards!","rating":29,"date":"29 July 2003","review":"This movie has been a favorite of mine since i was a kid--i was very into Greek mythology during grade school, so i loved this film, even though i've seen it about two dozen times (it continues to be a Sunday-afternoon staple on TV). There are a number of mythological inaccuracies in this film (the Kraken wasn't a mythological monster; Perseus didn't have Pegasus, but actually borrowed Hermes' winged sandals, etc.), but it's still a good kids' introduction to ancient mythology. While the actors playing the \"mortals\" are definitely inferior to those playing the Gods, i suppose it works in the sense of their being the Olympians' puppets and, well, a little limpness in the thespian department is somewhat de rigeur (as is the wise/comic sidekick of Burgess Meredith and the 'little and cute' factor of the mechanical owl) for the kind of classic matinee swashbuckler that \"Clash of the Titans\" is.<br><br>But all these complaints that the Harryhausen effects are crap and it would be so much better done with CGI... well, that's pure craziness. Sure, the monsters don't look convincing, but they look a hell of a lot more convincing then they would as cheap computer animation--can you honestly imagine the Medusa sequence being done any better with some cartoon computer program? (Why? So it could look like the crap in \"Phantom Menace\"?) I've always felt that Harryhausen's stop-motion technique and the resultant odd way in which the monsters moved added to the sense of their mythic status, their unreality, the sense that these are creatures from another world, another plane. (The recent Asian fantasy/action film \"Onmyoji\" paid tribute to the master by having a CGI demon army move in Harryhausen stop-motion style and damn me if they didn't look scarier, more unearthly for it.) In my opinion, CGI looks even less \"real,\" more like a painted-on cartoon. There's a depth and detail to creatures that have actually been created in the three-dimensional real world that those who have only existed on a computer screen don't have. Also, no matter how good an actor is, there's a difference between someone who's in the same room with the monster he's fighting, or who at least knows what it looks like, and someone who's just trying to \"act scared\" in the general direction where something will be inserted later. (Imagine the \"Alien\" movies made with a hyped-up animated creature: you know that even motionless and plastic squeezed between light stands, that giant H.R. Geiger monster gave everyone on set the creeps.) Maybe people like CGI because they feel safer with obviously fake monsters, things that never even existed as a three-foot high model next to the ham sandwich in someone's shop.","user":"scorpio-x","rank":[92,115]},{"title":"One of Ray Harryhausen's popular films","rating":10,"date":"8 January 2008","review":"Clash of The Titans is one of my favorite films from special-effects wizard Ray Harryhausen, and it is also one of his last films in the 1980s. This film is also one of the last films to star Laurence Olivier; I have three of his Shakespeare films. And lastly I do study World Mythology as a hobby not just Greek but other countries too. There are five things I have found in the storyline, that differs from the original myths :<br><br>1. In the original story, Acrisius wasn't jealous of Danae. An oracle warned Acrisius that Danae's son would someday kill him, so Acrisius shut Danae in a bronze room, away from all male company. However, Zeus conceived a passion for Danae, and came to her through the roof, in the form of a shower of gold that poured down into her lap; as a result she had a son, Perseus. When Acrisius discovered Perseus, he locked both mother and son in a chest, and set it adrift on the sea. The chest came ashore at Seriphus. After his great adventure of slaying Medusa, Perseus and Danae returned to Argos in search of his grandfather, but Acrisius had gone to Larissa. When Perseus arrived there, funeral games were being held and Perseus, being a great athlete, joined in. However, during the discus throwing an accident occurred. By chance the discus Perseus had thrown hit Acrisius and killed him; the prophecy had come true.<br><br>2. In Mythology, Thetis wasn't a sea goddess, but one of the Nereids (sea nymphs) and also mother to the hero Achilles (not Calibos he is an original), whom she tried unsuccessfully to make immortal. She dipped the child in the river Styx holding him by the heel. All the parts that the river touched became invulnerable, but the heel remained dry. Achilles was later killed in the Trojan war.<br><br>3. In Mythology, Pegasus the winged horse,was fathered by Poseidon with Medusa. When her head was cut of by the Greek hero Perseus, the horse sprang forth from her pregnant body. His galloping created the well Hippocrene on the Helicon (a mountain in Boeotia).<br><br>4.The Kraken was not the name of a titan in Greek mythology, but a sea monster from Scandinavian mythology. And...<br><br>5. In Mythology, Medusa was not a priestess; but she was a beautiful maiden. She desecrated Athena's temple (not Aphrodite's) by lying there with Poseidon. Outraged, Athena turned Medusa's hair into living snakes. <br><br>I love the film's Princess Andromeda. This might seem strange to you guys, but I put her on a list I have made of my favorite movie princesses animated or live action. Overall, this film is an awesome fantasy to enjoy with all the adventure, humor and romance.","user":"ja_kitty_71","rank":[19,21]}]