[{"title":"The ultimate 'men on a mission' movie","rating":9,"date":"3 September 2004","review":"Once a year, usually around Christmas time but always in winter, this movie is played somewhere on British TV.  Like 'The Great Escape' this movie has become a staple of TV station classic war movies wheeled out once a year to keep the punters happy, and it always delivers.<br><br>How can it fail?  It has spectacular scenery, great actors, lots of schoolboy WWII style action and even busty wenches in maid uniforms.  This film is ingrained in the psyche, you cannot see a mountaintop castle without thinking of Schloss Adler and the cable-car scenes.  If I'm trudging through the snow in the woods then I hear myself humming the theme from 'Where Eagles Dare'.  If I or anyone from my generation picks up a radio, it's only a matter of time before someone starts sending \"Broadsword calling Danny Boy\" in an imitation of Richard Burton's plummy tones.  It's a given.<br><br>I know it's not the most realistic movie ever made, but Richard Burton, Michael Horden, Clint Eastwood and the gang carry it off with great aplomb and we believe every line.  The pacing is excellent, leaving similar offerings such as 'Guns of Navarone' feeling like funeral marches.  And talk about atmosphere!  This movie reeks atmosphere, from the settings in the beautiful mountains to the scenes inside the old caste hallways to the exterior shots of people rapelling down the sides of the viciously cold walls.  It's a must see, 8 out of 10 compared to all films, and 10 out of 10 for 'men on a mission' movies.","user":"axeman-9","rank":[128,153]},{"title":"Most Exciting, Atmospheric, Ingenious--McLean Served Well This Time","rating":8,"date":"14 June 2005","review":"\"Where Eagles Dare\" was produced by folks who decided that Alistair Macleam deserved to be produced on film by someone who followed the author's exciting ideas. The result is a major improvement of the Us-er qualities of the character played by Clint Eastwood, the potent casting of Richard Burton, who is very very good (for once) in an adventure-level lead as the infinitely-resourceful leader of a WWII team of destructive agents, and an intelligent if action-level work of cinematic artistry. Others have written very well on this film; what I want to add to their basic core of arguments is some notes about the acting and ideas. From the group's boss, Michael Hordern to the ladies, Mary Ure and zoftik Ingrid Pitt, to enigmatic Robert Beatty, everyone involved is more than adequate in his/her part to very good. The three enemies, Ferdy Mayne, Derrin Nesbitt and Anton Diffring excel in whatever scenes they are given; and Peter Barkworth, Donald Houston, Patrick Wymark, et al as traitors have never been seen to greater advantage. Director Brian Hutton faced the all-but-impossible task of bringing a vaguely-implausible raid staged in snow country on an isolated castle to life. With stirring music, lovely art direction and edge-of-impossible special effects involving explosives, running machine-gun duels in a bus, falling telephone poles, a battle on a cable car, wrecking at an airport and a parachute drop betrayed from the start, he manages to bring the entire tale off very nicely by my standards. The other chief asset of the film lies in its unusually intelligent dialogue, plot turns and constant surprise. I counted at least seven major surprises, every one of which as in a good Hitchcockian thriller leads to a memorable scene; these are therefore not just script gimmicks, but rather they qualify as ingenious use of the adventure genre to keep the audience on the edge of their seats. This film perhaps is what James Bond films always should have been, but only in the case of \"Doctor No\" and \"Goldfinger\" ever were. One could wish that \"The Secret Ways\", \"Ice Station Zebra\" and several others of McLean's thrillers had been treated with as much respect, and near genius, as this memorable piece of screen excitement was (for once) afforded.","user":"silverscreen888","rank":[37,43]},{"title":"Terrific Stuff!","rating":10,"date":"22 April 2003","review":"Epic war pic where Richard Burton and Clint Eastwood manage to unmask most of the German spy network in England, slip Jerry the wrong plans for the second front, kill the leading members of the Abwehr in Southern Bavaria, and destroy half of the local Wehrmacht- all in a little over two hours. Terrific score by Ron Goodwin, great action sequences and a commanding performance by Burton give this the \"must see\" imprimateur.  Meanwhile it's obvious why the Nazis lost the war- since they rate one worse than Imperial Stormtroopers in the \"can't hit the broadside of a barn\" shooting stakes. Our plucky Allied troops more or less shoot themselves out of anywhere and anything....<br><br>However the radio call-sign \"Broadsword calling Danny Boy\" is now part of British folklore; the cable-car sequence is unmatched in spectacle; and the whole film makes you cheer up and feel better about the world.  For once the Brits are portrayed as cooly proficient rather than public school chumps. What with the Yanks playing second fiddle, it's almost like the good old days ....","user":"John_Mclaren","rank":[102,127]}]