[{"title":"Possibly the greatest anti-war statement","rating":10,"date":"4 November 2007","review":"When people think of anti-war films titles such as Platoon, All Quiet on the Western Front and Schindler's List almost immediately come to mind; such films have defined the genre in American culture. However very few directors have provided the perspective from the axis point of view, and fewer still were able to do so in a way that humanizes all countries, not just the protagonist's. Masaki Kobayashi, who is most well known for his samurai pictures such as Seppuku and Samurai Rebellion is able to form such a film, without even a hint of pretentiousness.<br><br>The series of films spans nearly ten hours, following a pacifist named Kaji (Tatsuya Nakadai), as he struggles to keep his principles during war times. First as an overseer of a P.O.W. camp, then as a soldier. Due to the length of the film, the level of character development and acting quality, we end up feeling his frustration, pain and triumphs, as each occasion leaves room for both a triumph of the human spirit and subjugation of it. Kaji despises both warfare and violence of all kinds, yet tries to rationalize it for the good of those around him. We become so attached to him and his struggle, that we begin to feel similarly, and as a result we are left with one of the most moving chronicles of the loss that war becomes. I won't spoil anything, but any viewer will be floored by the end, it left me utterly breathless.<br><br>So overall I recommend it quite highly, its one of the few great anti-war statements that has aged VERY well in the modern day, and possibly Kobayashi's greatest work. Never slow, yet at the same time never glorifying the action, it is a film that I eagerly await to see re-released.<br><br>10/10.","user":"Trouter2000","rank":[53,58]},{"title":"Stands shoulder-to-shoulder with Eisenstein and Fellini","rating":10,"date":"7 January 2007","review":"I disagree with the other reviewer here; I think you can see these three movies individually, although you must see them in the correct order. To see all three in one sitting strikes me as something that might almost be impossible, not just physically, but emotionally.<br><br>It is beyond me how these films escaped my attention all these years--I'd only become aware of them recently. Clearly, this trilogy is one of the great film achievements of all time, right up there with Eisenstein and Fellini. Never mind that the message of the films is overwhelming emotionally--the sheer technical achievement of making them is almost beyond my comprehension. The cinematography is first rate all the way through--the acting is the best you'll ever see. You are not watching a movie, you're sharing the experiences of people in impossible situations.<br><br>Don't read reviews, don't even read the DVD box (as I did on the first one) because you may encounter spoilers. This is one experience you do NOT want to have spoiled. Just be aware this is very serious fare, it is a drama in every sense of the word. There are moments of incredible tenderness, but there is absolutely nothing to laugh at--there is NO comic relief of any kind. it is deadly serious all the way through.<br><br>I wasn't particularly eager to watch Human Condition because, knowing the plot summary, it sounded like too much of a downer. Yes, the subject is depressing, but great art is uplifting. This is great art.","user":"ekeby","rank":[20,22]},{"title":"Love is the Condition for Being Human","rating":10,"date":"9 April 2010","review":"Ningen no jôken is a masterpiece film but is also painful to watch most of the time. Nonetheless, it is a tour de force to be lauded for its direction, cinematography and acting at every turn. Most of those commenting in previous discussions mention the virulent anti-war sentiment of the film which is abundantly evident. It was interesting that much of the film is autobiographical, inspired by Kobayashi's war experiences. He too refused to be an officer when he qualified, and stayed a private throughout the war. An interesting point came up when I was watching the fourth DVD in the Criterion edition of The HumanCondition which is a series of three insightful interviews. During his comments the director Masahiro Shinoda mentioned that he thought at the time, the romantic love Kaji had for his wife, Michiko, was overly sentimental and unrealistic. He thought that it was due to the fact that Kobayashi and his peers were born of another age whose romanticism was the norm and unsullied by his generation's sobering war experience. He said that he had also consulted the internet to see the opinions of the film among contemporary young people in Japan today, and found that they too, thought the love unrealistic. He felt the love should have been more erotic and less idealized. The remarks of another commentator solidified my opinion of this issue about Kaji's love. That writer stated that the title really means more like \"condition for being human.\" This confirmed my opinion that Kobayashi's point of the film is that what makes one human, in the best sense of the word, is love. Otherwise we devolve into some type of cruel bestiality found in the phrase 'man's inhumanity to man.' This inhumanity is evident throughout the film, whether in the sadism of the other Japanese soldiers, the cruelty of the guards to the Chinese prisoners, or in the malice of the of the Russian overseers. However, the Kaji character is set apart: he sticks to his ideals, he is humble, he displays selflessness as seen when he gives his food to another or when leading the men and puts them ahead of himself. He is a type of everyman whose being is elevated above merely satisfying physical needs and responding to base instincts. He remains an ennobled human not a saint above the fray, but his love gives him the will to live, to continue on and to even do good when surrounded by evil. Love is the condition for being human.","user":"jouler500-art","rank":[23,26]}]