[{"title":"Another anti-masterpiece from Doris Wishman","rating":3,"date":"1 March 2008","review":"This latter day entry in the \"roughie\" sub-genre is one of the final films from the prolific exploitation queen Doris Wishman, sometimes described as the female counterpart to Ed Wood.<br><br>Three sexy women, raised separately as orphans, are summoned to a funeral, where they learn that they are in fact sisters and that the dead woman was their mother. The latter had been a secret agent  the notorious Double Agent 73 (a reference to Wishman's earlier \"Chesty Morgan\" flicks)  who had been murdered in the line of duty. (The actress shown playing her in flashback bears very little resemblance to that formidably proportioned actress-stripper, especially at the bust level -- but of course, who could?). She had used her feminine wiles (if you know what I mean) to seduce and betray enemy agents, but was rather careless in executing this modus operandi  the unwanted daughters being one of the job hazards. The executor of the will tells the girls that they can inherit a cool million each as long as they can track down their mother's killer within one calendar year. Plenty of absurd violence and nudity ensues.<br><br>Fans of her earlier work may be surprised at the relatively large budget Wishman must have had at her disposal for this one. It's in living colour, we actually see people's mouths move while they talk (though out-of-sync in most cases), and one of the sequences may actually have been filmed in Las Vegas (mixed with plenty of stock footage, of course). The women are better looking than usual  two have voluptuous 50s- style exotic dancer proportions, but lithe \"Sandy\" wouldn't be out of place in a Playboy movie today (except for her obviously natural bust). Of course, the men are generally horrid  probably investors getting in on the \"action\".<br><br>But don't be deterred  the film shows all the earmarks (and other body parts) that we've come to cherish -- canned lounge music cues, crass set decoration (now in hideous day-glo colour!), closeups of feet, aimless scenes of cars driving and pedestrians walking, and most of all, a complete lack of logic in how the characters act. The women's threads are dropped at random, and they alternate between abruptly seducing some lucky(?) male passer-by and being sexually assaulted by others. The prop master uses a couple of covered card tables laid end-to-end for the coffin and a cardboard box for the back of a picture frame; another photo has a bra hastily drawn over the breasts of the protagonist with a black magic marker. When the girls are skinny dipping, one of them does a handstand in the water (all the better to reveal her assets), and judging by the wobbly pose and quick cutaway, the lifeguard probably had to drag her off the bottom of the pool a split second after the shot.<br><br>No matter how obvious it may seem to you who the culprit is, you'll never guess the denouement; it comes totally out of left field. A must for fans of bad movies everywhere.","user":"goblinhairedguy","rank":[8,9]},{"title":"The harder they try, the more fun it becomes","rating":8,"date":"2 October 2010","review":"This film is so bad and so (unintentionally) funny at the same time it defies all normal description. The film itself is not badly paced, but horribly acted, I mean terrible like you have never seen. Lots of murder, lots of mayhem, lots of seduction- all completely self serving and implausible. The lead actress who has most of the film time is a chubby minx who has NO acting skills- and thats why I love it. None of the 3 slutty, money hungry gold-diggers, have any self respect or respect for anyone or anything else except their own selfish needs (hence the title). They tease then abandon, they are all lazy liars with VERY nice looking bra-less fashions, There is not a bra to be found in the entire movie. It is on this obvious intent I have to base my review, this is truly a breast-obsessed film and on that objective it delivers. The story, yes there is thinly veiled one, is eclipsed by sustained breasts time. Thats all you need to know. Don't think, do not try to qualify, invite a date over, pop some popcorn and have fun!","user":"plex","rank":[4,4]},{"title":"Deadly Sisters","rating":11,"date":"11 July 2015","review":"The Immoral Three (1975) <br><br>** (out of 4) <br><br>Decent mixture of sexploitation, crime and mystery has three women being brought to a will reading where they learn that they're actually sisters. They also learn that their mother was murdered while she also lived her life as a secret agent. In order for each of the three women to inherit their millions dollars, they must search for who the real killer is.<br><br>THE IMMORAL THREE certainly isn't going to win any major awards but for the most part it's a mildly entertaining movie if you simply want to watch a lot of women get naked and be featured in simulated sex scenes. Director Doris Wishman has become a huge cult favorite over the years and it's easy to see why she stands out since she was, after all, a female working in a business that mainly had guys behind the camera. There's no question that she didn't feature any great talent but it's still interesting to go through her filmmography.<br><br>This film here isn't well-made by the typical sense but at the same time it's a lot better than a lot of the movies in the genre. The strongest part of the movie is the fact that it clocks in at 74 minutes, which is great because the film doesn't just drag on. As far as the story goes, it's pretty simple as each sister goes to investigate a possible murder suspect and of course a murder happens or some sort of sexual act. The three female leads all take their clothes off and there's no doubt that they're quite attractive and this here is what's going to keep most people interested.<br><br>THE IMMORAL THREE certainly isn't going to be for everyone but fans of Wishman should be slightly entertained.","user":"Michael_Elliott","rank":[2,2]}]