[{"title":"Very Underrated","rating":3,"date":"3 June 2000","review":"Many perceive Tequila sunrise to be a routine, formulaic cop thriller with some nice sets, pretty actors, some guns, some sex....etc. Cynics go on to say that Gibson has never acted worse, that the plot twists are predictable and the love triangle is overly cheesy. I, on the other hand, feel that the film profits greatly from expert cinematography, fluent storytelling and convincing(albeit rather undemanding)acting. Pitting Gibson (the now-retired drug dealer lured back for one last deal) and Russell (the reluctant sheriff assigned to bust him) as best of friends on opposite sides of the law was a strong premise, made even more compelling by the fact that the drug dealer (Gibson) is the sympathetic character and the cop (Russell) is the sly, manipulative sort. There is an apparent sense of irony and it goes a long way to making an otherwise average story, interesting and very watchable. Pfeiffer is the glamorous love interest whose character does a lot to intensify the rivalry between the two men. Much of the drama and strength however comes from the late J.T Walsh as Russell's superior, hell bent on bringing Gibson down and his Mexican drug counter-part who nobody has ever seen. A special sense of irony presents itself at the denouement for Walsh unknowlingly becomes a pawn in the drug ring that has now become the talk of the town thanks to his vendetta.<br><br>The also late Raul Julia never disappoints as the charismatic yet enigmatic Mexican law enforcer. Julia and Walsh complement the film beautifully as side characters with dubious intentions. They are multi-faceted and like all the other people in this film are torn between what they should do and what they want to do, and in fact what they end up doing. Nothing is black and white in Tequila Sunrise; it's a very grey area. With every development we learn more about the people and how they are so far from being what we originally perceived. Hats off to to Robert Towne for his writing. Tequila Sunrise may lack the inventiveness, vision, and dynamism of Chinatown (Robert Towne wrote both scripts), but it should, by no means be discarded as a mediocre cop thriller.It is a very slick piece of cinema with fine acting, glamorous sets, and great dialogue. Furthermore, unlike some of it's predecessors it's a film that can be seen repeatedly without losing it's cutting edge. Under appreciated and underrated, Tequila Sunrise is an excellent film","user":"Khaled Yafi-01","rank":[71,84]},{"title":"A sexy and complex story about love, honesty, and overall friendship","rating":8,"date":"15 August 2005","review":"All in all, I really like this movie. The chemistry is definitely there, and the cinematography is excellent (I love the scene where Mac and Nick are talking while sitting on the swings, in pure silhouette).<br><br>Occasionally the dialog does seem stilted, like when Nick's character is telling Joanne how much he wants to see her that night. And you really wonder how Nick has his job, with all of the compromises he makes for relationships (as with Mac and Joanne).<br><br>But, Mel Gibson's eyes when he tells Michelle Pfeiffer about his interest in her... swoon! And there's a literally steamy love scene involved that is one of my all-time favorites.<br><br>All in all, the whole movie is a very interesting commentary on friendship and the ties that bind. 1) Friendship is the only choice you have in life (you can't choose your family...) vs 2) at some point friendship's obligations can go beyond the real life of the friendship itself.<br><br>Raul Julia has a great speech about that in this movie. Seeing this made me miss him all over again!","user":"cchandler73","rank":[23,26]},{"title":"vastly underrated noir","rating":9,"date":"1 June 1999","review":"Robert Towne, best known as the writer of Chinatown, directed this backstabbing corkscrew of a film from his own script after several notable directors didn't meet interpretation.  A dark brooding piece, that is as meditative and murky as it is tightly written for suspense and twists, Tequila Sunrise focuses on the expectations that conventional mores place upon our freedom to interct and even love whomever our heart bids us.<br><br>Gibson plays a drug dealer with, if not a conscience, at least a code of some sort of ethics.  He is raising a son and wants to retire from illegal activities so that he may be a good role model.<br><br>Russel plays a narcotics cop bucking for a promotion.  In order to get his promotion he needs to bust the area's most notorious dealer... guess who. Problem: he and Gibson and childhood mates.<br><br>Pfeiffer is a woman caught between them, each one wanting her for different reasons.  Raul Julia and J.T. Walsh complete the central players in a fine ensemble on people with agendas that may be worth sacrificing the alliances they have made along the way.<br><br>As the various subplots tie themselves into impossible-to-unravel knots, every character will be forced to question what it is he or she holds sacred.  Tough and even regretted decisions are made.  Friendships are made and dissolved, hearts are broken, revenges plotted...<br><br>Gibson is at his best here, Pfeiffer brings great depth to what could easily have been little more than a trophy role.  Walsh and Julia are so poker-faced that an audience member who succeeds in reading all the angles should account himself no more than a lucky guesser as they leave you very few clues to work with.<br><br>Ironically, despite the desires of Gibson and Towne, the ending had to be altered to please test audiences.  Later critics would harp severely on the final shot, the reviews keeping away significant audience.  While the ending may be unsatisfying to the typically cynical noir fan, it does not change the fact that  this a far-above-average genre flick with an excellent cast and a superb script.<br><br>Worth a watch, worth several.","user":"kpd1","rank":[37,44]}]