[{"title":"\" You've done well to Keep your hair, when so many's after it \"","rating":8,"date":"21 August 2007","review":"There are many films which personify the era of the Mountain Man. This is perhaps one of the best. The reason why it is at the top of the list, is due in part to director Sydney Pollack's selection of natural wonders, majestic scenery and simplistic storyline. The movie tells the story of Jeremiah Johnson (Robert Redford) a veteran of the Mexican American war who decides to journey into the High Alpine Rockies to become a Mountain Man. Based very loosely on the novel by Vardis Fisher, the hero seeks the life of a trapper which offers Solace, wild adventure, aboriginal encounters and a chance for legendary exploits. During the first years of his experience, Johnson is befriended and threatened by both Native Americans and crazed mountain veterans who teach him and endanger him as well. Among the best is 'Bear Claw, Chris Lapp' (Will Geer), 'Paints His Shirt Red' (Joaquin Martinez) and Del Gue (Stefan Gierasch). (Delle Bolton) plays Swan and Josh Albee) is Caleb who become part of an instant family. The film is quite picturesque in its beautiful seasonal settings and entertaining to anyone seeking a chapter in the bygone era of a vanished breed. ****","user":"thinker1691","rank":[35,42]},{"title":"Broken humans learning to be whole again","rating":22,"date":"22 April 2009","review":"Sydney Pollack's return to the western four years after THE SCALPHUNTERS was to be a completely different experience. Following the trials and tribulations of a deserter of the Mexican War who disappears in the Rocky Mountains of Colorado to become a mountain man, JEREMIAH JOHNSON eschews the conventions of the western as a genre in such a way as was only made possible for American cinema in the tumultuous era of early 70's with such visceral movies of frontier survival as MAN IN THE WILDERNESS and A MAN CALLED HORSE paving the way. <br><br>As Jeremiah Johnson (Robert Redford) wanders the mountains like a fugitive stricken by disaster, a solitary figure against awe-inspiring backdrops of massive rock formations, steep ravines and expansive mesas, you can tangibly feel the film, like the hero, transcending the specific time and place and breaching out vision to become an all-encompassing spiritual journey where the individual characters - fur trappers, bear hunters or Indians - are merely the unwitting parners in a dance of death.<br><br>Some viewers may be put off by the lack of straight-forward plot, the episodic, repetitive nature of the movie or the long stretches of silence, but it's from those exact things the movie takes its power. JJ comes unto its own in those small moments of quietude, in Johnson's silent encounters with indians, in the barren, unforgiving wastes of the craggy mountains that reflect so well the psychology of characters wandering in their shadow, in the subtle, heartwarming interactions Johnson has with the Indian woman he's taken for a wife and the mute boy he's taken for a son. There's hardly a word uttered between this peculiar family the entire movie but the ways they learn to overcome the barriers that separate them is a touching sight to behold.<br><br>There is some dated montage, a corny soundtrack; how much of this will affect your enjoyment will boil down to your affinity with how cinema was in the 70's. Still, what is left is this beautiful parable of broken humans learning to be whole again. Equal parts visceral, savage and heartwarming.","user":"chaos-rampant","rank":[38,48]},{"title":"What a movie should be","rating":10,"date":"21 November 2000","review":"Jeremiah Johnson is a starkly simple story well told. It is the journey of a man who seeks to re-make himself.  Johnson becomes disillusioned, like Thoreau and even Ulysses S. Grant, by the Mexican War and deserts to become a mountain man.  There he finds the Rockies starkly beautiful and completely without mercy for him or anyone else.  Will Geer plays the older trapper who teaches the 'Pilgrim,' a very solid performance by Redford, how to survive. The film's treatments of Whites and Native Americans is profoundly even handed, and Milious's fingerprints are noteworthy in the robust and calculated course of the narrative.","user":"msinabottle","rank":[67,92]}]