[{"title":"A timeless classic!","rating":25,"date":"25 December 2004","review":"Alexander Korda's \"The Four Feathers\" (1939) is perhaps one of the greatest triumphs of British film-making -- a crowning achievement in Imperialistic propaganda and a nostalgic testimony to the societal traditions which once inhibited us as individuals. Simply put, \"The Four Feathers\" is a cinematic masterpiece in the vein of \"The Drum\" (1938), \"Kim\" (1950), \"The Jungle Book\" (1942) and \"Gunga Din\" (1939). It also represents a rare instance in which a film is far superior to the original novel.<br><br>The original novel upon which the film is loosely based was penned by A.E.W. Mason and has an actual excuse for being somewhat flimsy: Following the bloody outbreak of World War I, Mason wrote the story as a mere identity cover while doing espionage work for the British government. He was able to scout northern Africa under this guise of an accomplished author gleaning material for the plot of the novel.<br><br>The plot of \"Four Feathers\" is simple yet engrossing: A young man, Harry Faversham (the dashing John Clements), is brought up by his distant father (Allan Jeayes) in a lonely household steeped in Imperial tradition which values courage and honor above happiness or life itself. His natural human instinct of self-preservation is accentuated into possible cowardice by the horrifying war stories told around the dinner table by old veterans. As he matures, Faversham falls deeply in love with Ethne Burroughs (the radiantly beautiful June Dupréz) and decides that he would rather spend his life in his own way than be trapped in the futile repetitiveness that is a soldier family. On the eve of his unit sailing for Africa, he resigns his commission and is branded a coward -- one of the worst labels in Victorian England -- by both his friends and his betrothed. To reclaim his honor and prove both to himself and others that he is not a coward, Faversham sails to darkest Africa.<br><br>In Africa, our dauntless hero is embroiled in unfolding military history as General/Lord Horatio Kitchner ventures into the blistering Sudan with 20,000 British personnel against the varied 50,000 warriors of the Khalifa (John Laurie). The film terrifically climaxes in the breathtaking Battle of Omdurman, a historical engagement which a young Winston S. Churchill witnessed and, in one of his most famous literary pieces, fittingly described as a \"victory snatched from the jaws of peril!\"<br><br>When I was very young, my parents would show me this particular film as an example of a forgotten way of life: of lavish ballrooms where uniformed officers and young ladies in ornate Victorian gowns danced the night away on the eve of war amidst whispered pledges of love and marriage. The film taught me that a true gentleman never insults another in public; a leader must be able to command his own self before he can command others; to honor your word even if it may kill you in the process and to be unafraid of whatever befalls you as long as you are true to yourself.<br><br>Film Rating: ***** (five) out of ***** (five) stars. A mesmerizing period piece.","user":"flask","rank":[64,66]},{"title":"Absolutely superb!","rating":28,"date":"28 January 2004","review":"In my 71 years I still hold \"The Four Feathers\" as my all time favorite movie. The acting is  outstanding and the photography is beautifully done. You'll never see anything like this again if you live to be 200. It's too bad that this was released in 1939 when so many block busters were released by Hollywood.","user":"zorro-41","rank":[66,70]},{"title":"Rousing Adventure Epic","rating":10,"date":"26 January 2000","review":"A young English army officer resigns his commission just as war in Africa breaks out. His 3 best friends, officers all, and his fiancée each give him a white feather - the sign of the coward. Shunned &amp; ostracized, he undertakes a mission to clear his honour &amp; prove his courage.<br><br>This is a wonderful British adventure film, equally on a par with anything Hollywood was to produce in that golden year of 1939. Shot in color, with spare-no-expense filming in the Sudan, THE FOUR FEATHERS is a paean to the glory days of Victoria's Empire &amp; the men who fought to build it.<br><br>Sir John Clements is excellent as the young hero. Although virtually unknown to American audiences his entire career, Sir John was a very fine actor with a warmly distinctive voice which he uses here to advantage. Sir Ralph Richardson appears, terrific as always, as one of the friends; so does John Laurie, very good as the troublesome Khalifa. Sir C. Aubrey Smith, magnificent as a curmudgeonly old general, provides the final hurdle Sir John must jump to regain his reputation.","user":"Ron Oliver","rank":[48,51]}]