[{"title":"Car chases. Must I say more?","rating":6,"date":"2 July 2006","review":"The original title is \"Poliziotto Sprint\" which I think is \"Policeman's Run\" in English but given the title \"Highway Racer\". This unknown flick is a cool little gem for car chase fanatics. Many interesting stunts and action scenes including some very wild shots.<br><br>A man who wants to become the ultimate driver of his police force fails horribly until he's given driving lessons by his chief. He then goes out to stop the chief's ex-rival bank robber. A little like National Velvet set with Ferrari's and Citroens.<br><br>The characters and acting is mediocre but the chases and action sequences are superb. One scene is guaranteed to shock some viewers near the end but I won't dwell on.<br><br>Never ending car chases and stunts are packed in this rare film. Find it while you can.","user":"mhoylecombs","rank":[7,7]},{"title":"Buzzbomb","rating":7,"date":"27 September 2018","review":"In 1977, the partnership of Maurizio Merli and his moustache was temporarily dissolved as each of them pursued their own careers. Due to making some bad decisions, Maurizio's moustache ended up taking the role of the pubic region of a busy German porn star, whereas Maurizio himself made this film - where a racing car obsessed cop finds himself up against a bunch of bank robbers...who are also racing car obsessed. <br><br>He's a young cop who loves a good car chase, but his boss thinks he's too hot-headed and not experienced enough. Plus his car is crap. His boss is also a legendary driver amongst the force, and knows fine well that the spate of bank robberies taking place in Rome are down to an old, racing car driving enemy of his. He warns Maurizio that this bad guy will outsmart him, and tells him not to be drawn in to a race with the guy, adding that Maurizio better be careful with that anxious partner of his who only has two days before transferring to a safer job. Guess what happens to him?<br><br>One dead partner later, it's up to Maurizio and his boss to make Maurizio the hot-shot driver he was born to be, so we get a lengthy sequence of training and such like which could have been covered in less time with a montage, but this is the seventies and not the eighties I guess. Plus, Mr No Moustache also has to go undercover, but did I need to tell you that? His cover is blown in the most stupid way possible, too. <br><br>A film called Highway Racer just better be filled with car chases and stunts, and it is! They even have a car chase on the Spanish Steps of all places. Not sure how they got away with that one. There's also a scene where it pretty much looks like a stuntman was hit by a car on purpose. Hope they paid that guy well. Or at least the family he left behind.<br><br>A film like this is to be watched for fun, and I had fun. Maurizio loves racing so much even his room is filled with toy cars. Awesome. After some very thorough trips to the dry cleaners, Maurizio and his moustache were reunited for Inspector Grrrr: Mancop and it's seven thousand sequels.","user":"Bezenby","rank":[4,4]},{"title":"HIGHWAY RACER (Stelvio Massi, 1977) **","rating":5,"date":"14 November 2008","review":"This is a low-grade poliziottesco, the second I've watched from former cinematographer Massi  and a much inferior product to the character-driven EMERGENCY SQUAD (1974). In fact, as the title itself suggests, the film is virtually a non-stop succession of car chases  filled with spectacular (but often unbelievable) stuntwork staged by the ubiquitous Remy Julienne. Its other major flaw is the miscasting of lead Maurizio Merli as a speed-crazy rookie cop(!), a role better suited to Giuliano Gemma (who had actually played a racing-car driver in Luciano Ercoli's THE MAGNIFICENT DARE DEVIL [1973]) or even Luc Merenda. Amusingly, to give us the impression that the hero is brash and inexperienced, Merli simply had his trademark moustache shaved off!; while his essential woodenness was usually offset by a genuinely authoritative/tough presence and street-smart attitude, here, he comes across as not merely glib but dumb as well! For the record, according to the \"Stracult\" guide, HIGHWAY RACER is a favorite of both Massi and Merli  go figure! <br><br>The majority of the plot, if so it can be called, revolves around the obsessive manhunt by Merli's ageing superior (a legendary iconoclast himself in the old days!) for a notorious criminal/ace driver emanating from Nice. After some initial aggravation between Merli and the Chief (the hero even causes the death of his perennially scared-shitless partner when their inadequately-empowered police car overturns during a chase), the old man is quick to realize that if he's to fight \"Il Nizzardo\" tooth and nail, Merli's the one to do it  cue the young cop's intensive training to maneuver the revved-up engine on the road and other even more treacherous terrain. Merli's also given an obligatory romance, supplied by lovely \"Euro-Cult\" starlet Lilli Carati  but her part is so underwritten as to be almost an afterthought! Incidentally, the hero's eventually made to infiltrate the villain's gang  but he's unwittingly exposed by the girl herself prior to their next hit. By now, Merli's so intent on testing his acquired skills with those of the criminal that he even lets the latter go when cornered instead of arresting himonly for the two to meet up for a duel-to-the-death with their cars in a canyon! <br><br>A couple other things: the main riff from Heavy Rock band Iron Butterfly's signature tune \"In-A-Gadda-Da-Vida\" is ever so subtly (but recognizably) incorporated into Stelvio Cipriani's score towards the end of the film!; also, when I discovered that among the U.S. titles attached to this one is CONVOY BUSTERS, I mistakenly thought it had been released as a \"Special Edition\" by No Shame. However, when I went to check for reviews of that particular DVD, I realized that the original title of the film in question was UN POLIZIOTTO SCOMODO, made in 1978albeit re-uniting the same lead and director! Confused? (Actually, it's much the same thing that went on with two separate gialli called at one time or another PARANOIA, both of which were directed by Umberto Lenzi and starred Carroll Baker.)","user":"Bunuel1976","rank":[5,7]}]