[{"title":"Ha ha, and then a slap","rating":13,"date":"13 December 2003","review":"One of Ozu's most delightful comedies involves the minor household upheaval caused by a freewheeling Japanese debutante's visit to her henpecked professor uncle and his fussy wife. This film is blessed with a surfeit of small, droll gestures that amply demonstrate both the whimsicality and the sharpness of Ozu's observations of human behavior: the clucking communion of housewives, clever games played by singing schoolboys and the subtle, playful banter of relatives who know each others' foibles all too well. The schoolgirl character is of particular interest as a prototypical \"liberated woman\" who gets her uncle to take her to a geisha house and isn't afraid of letting her leg show under her skirt (here I wonder how much of this was influenced by the '30s Hollywood screwball comedies Ozu loved, or if it was truly indicative of emerging behavioral trends among Japanese women). Things come to a head though as the girl and her uncle conspire for a night away from her aunt, only to be confronted for their deception, leading to an unsettling moment when the aunt gets slapped. I'm not entirely satisfied with how Ozu's characters later shrug off this instance of domestic abuse as just another quirky behavior that can be turned on its ear. Nonetheless the film stands as a provocative exploration of male-female relationships amidst the shifting mores of modern society.","user":"alsolikelife","rank":[10,13]},{"title":"Sons of the Desert","rating":7,"date":"11 July 2015","review":"Ozu was a great director, but there is always a tendency to look at his stuff and declare it is unique, as if he sprang out of the earth on the movie set. For decades the Japanese film industry insisted he was a uniquely Japanese talent and we were limited to seeing the works from the 1950s, like TOKYO STORY. Finally about 20 years ago, silent films he directed started showing up in the US -- I saw about a dozen in Lincoln Center at the time. Others have trickled in since, revealing him as a director interested in what was going on elsewhere, with a habit of putting Hollywood posters on his sets' walls -- in this one, there's a verbal reference to Fredric March -- and a habit of lifting stories and ideas from Leo MacCarey; some one I saw at a screening of this movie today told me that MacCarey's MAKE WAY FOR TOMORROW was the source for TOKYO STORY. My reaction: maybe.<br><br>That is why I was on the lookout and why I realized that the source for this one was probably Laurel &amp; Hardy's SONS OF THE DESERT, with the uncle in the place of Mr. Laurel, the niece who talks him into a night on the town when his wife thinks he is playing a healthy game of golf in the rain, as Mr. Hardy. She also later urges him into standing up to Mrs. Bossypants.<br><br>Ozu does not offer us a straight comedy. This closest he comes to mimicking his sources is when the Uncle is supposed to be dressing down the niece. Ozu's work, typically, remains more sympathetic and warm than the straight comedy work on William Seiter's feature. Nonetheless, his admiration for his American contemporaries stands out.","user":"boblipton","rank":[6,7]},{"title":"Screwball comedy -- from Ozu","rating":9,"date":"22 May 2003","review":"Yasujiro Ozu's 1937 \"Nani wa shokujo wa wasureta\" (What Did the Lady Forget) is probably his closest approach to screwball comedy. Set in (probably) the most affluent milieu of any of Ozu's film, this involves a bossy wife (Sumiko Kurushima, Japan's first female star in one of her last roles) and her doctor-professor husband and niece, who rebel against (or at least try to wriggle around) her authority. This film was the last time Ozu's pre-war ensemble would appear together (except for the one-time post-war reunion of most of them in \"Tenament Gentleman\") and the acting overall is first-rate. This film probably does less to explore the fundamentals of the human condition of any Ozu film -- but it is thoroughly enjoyable nonetheless. (Note:  Ozu re-used some of the elements of this plot in his post-war \"Flavor of Green Tea over Rice\").","user":"kerpan","rank":[7,9]}]