[{"title":"THE PROUD TWINS: Fu Sheng shines in comic role adapted from Ku Lung","rating":17,"date":"17 December 2011","review":"THE PROUD TWINS (1979) is, like so many Shaw Bros. films directed by Chor Yuen, a fairly convoluted swordplay adventure based on a novel by Ku Lung, author of many martial arts fantasy adventures set in Old China. It's a little better than most because it has a broader sense of humor and provides kung fu star Alexander Fu Sheng with one of his best comic roles. He's genuinely funny here and his antics provide the glue that holds it all together. He also gets to use his kung fu skills on a regular basis.<br><br>The plot has Fu Sheng as Xiao Yu Erh, separated from his twin as a baby, after his parents are murdered, and taken by a family friend to \"Villains Valley,\" where he's raised to be a \"villain\" by a host of outlaws, each of whom has a special skill. (The scenes of the put-upon toddler undergoing strict training tactics straddle the borderline between adorable and abusive.) When he's old enough (and grows up to be Fu Sheng), he devises clever means to trap each of his \"uncles\" and escape the valley to head off into the outside world. A chance encounter with a beautiful girl dressed as a man leads to a treasure hunt and eventually a confrontation with the Princess of Yi Hua Palace, the one who'd murdered Xiao's parents in the first place. Eventually, a reunion with his twin occurs, although I was kept guessing about the twin's identity until near the end.<br><br>There are a lot of characters in play, including some interesting women, although most of the actresses were unfamiliar to me. Candy Wen Hsueh-erh plays the young woman he meets during his journey and she's quite an attractive and engaging presence. (I've also seen her in THE BRAVE ARCHER AND HIS MATE, SWORDSMAN AND ENCHANTRESS and THE SWORD STAINED WITH ROYAL BLOOD, all of which I've reviewed on this site.) There's a female fighter called the Green Fairy, who intervenes regularly in the action, and the brutal Princess of Yi Hua Palace. Several Shaw Bros. regulars are on hand, including Tang Ching, Ku Kwan Chung, Yang Chih Ching, Ching Miao, Jamie Luk, and Chan Shen, although it's not the most star-studded of casts.<br><br>What's most interesting about the film, though, is Fu Sheng's character and the way he seeks to learn the difference between good and evil as he makes his way through a maze of corrupt characters. Despite his upbringing in Villains Valley, he has an innate sense of right and wrong and is pretty aggressive in acting on it. When he finally does meet his twin, who is set up to oppose him, he has an intuitive sense that this is not his enemy. At the same time, he has a great sense of mischief and often uses clever means to turn the tables on those seeking to stop or punish him.<br><br>It's not the best of the Chor Yuen-directed Ku Lung adaptations (those would be THE MAGIC BLADE and KILLER CLANS, also reviewed on this site), but it's certainly better than average, thanks chiefly to Fu Sheng's central performance. At 106 min., this is longer than normal for a Shaw Bros. kung fu film. The same story was adapted for an earlier film, THE JADE FACED ASSASSIN (1970), directed by Yen Chun, in which the lead role was played by an actress, Lily Ho, giving the most delightful performance of her career. I enjoyed that one a great deal, maybe slightly more than this one, and I've reviewed it on this site as well.","user":"BrianDanaCamp","rank":[5,5]},{"title":"Typical Chor Yuen film, although Fu Sheng adds a lightness of touch","rating":6,"date":"3 June 2017","review":"THE PROUD TWINS is another Chor Yuen 'epic' set in the martial world of rifts and allegiances, treachery, and hidden identities. As such this film has a familiar look for anyone who's seen any of Yuen's other movies, such as HEAVEN SWORD &amp; DRAGON SABRE. Thankfully, a lot of this movie's entertainment value comes from the casting of Alexander Fu Sheng in the lead role; he brings a lightness of touch, a talent for slapstick humour, to the role which makes him a better and more entertaining fit than someone like Derek Yee.<br><br>The film gets off to a good start with some very funny scenes involving Fu Sheng's character being trained by a cruel band of villains. The bits in which he turns the tables on them in an elaborate fashion is great fun and the movie's distinctive highlight for me. The rest then goes down a traditional route although there's always plenty of action to see some of the heavier bits through. The film isn't as star-studded as some although the likes of Chen Shen, Wen Hsueh Erh, and Ai Fei do appear.","user":"Leofwine_draca","rank":[0,0]},{"title":"Funny fu...","rating":10,"date":"6 March 2013","review":"THE PROUD TWINS, while ostensibly the story of a pair of twins (who look NOTHING alike), focuses primarily on one of the two siblings, Xiao (Fu Sheng). We witness his \"upbringing\" by a band of villains living in Villain's Valley. Among the role models are a transvestite and a cannibal, Li, who is capable of regenerating limbs when they've been cut off (apparently because of his ingesting of others). There are some funny scenes of Xiao as a young child being beaten for no real reason (a dummy is used, for instance, when the kid gets dropped from a great height- a gag that, when it's done right, as it is here- with quick cutting- can be hilarious.) When Xiao matures, he proceeds to turn the tables on his tormentors and escapes. He meets Miss Tieh (eye candy Candy Wen Hsue-er), who claims to have a treasure map that suddenly everybody in the Martial Arts World wants. Xiao swallows the map, which prompts one of the villains to offer to open him up and get it. Then it turns out there are a LOT of copies of the map floating around. Xiao then finds himself at the pleasure palace of Miss Yi, whose male \"mistresses\" need replenishing- and Xiao seems like a likely addition. He manages to extricate himself from that situation, only to run into still more trouble. THE PROUD TWINS is one of the funniest and liveliest kung fu comedies I've ever seen, and my appreciation for Chu Yuan continues to grow.","user":"poe426","rank":[1,2]}]