[{"title":"Production Designer Harper Goff","rating":8,"date":"8 September 1999","review":"Below is a transcript of a hand written letter from Harper Goff in 1974 of which I have a copy which I think might be of interest.  This is an unusual comment entry, but I hope you will find this letter a fasinating rare glimpse into the process of creation, and will give a better appreciation of the artistry of the design of the Disney 'Nautilus'.  Harper Goff was responsible for the 'look' of the submarine in the Disney Production, along with much of the film's set designs.  Enjoy!<br><br>Harper Goff writes....<br><br>I was assigned the task of getting together a 'true-life' adventure film using some exceptional underwater footage shot in a laboratory aquarium, by Dr. McGinnity of Cal-Tech's Marine Biology lab in Carona Del Mar.  Walt (Disney) thought inasmuch as \"20,000 L.U.T.S.\" was in public domain we might do worse than use the title for a current True-Life adventure short subject. Walt went to England and I stayed in Burbank and made a story-board of a live action version of the classic using McGinnity's footage as a sort of ballet episode where Nemo shows Aronax the wonders of the deep.  Walt liked the story-board well enough to have me give an 'A.R.I.' (Audience Reaction Inquiry) to a group of exhibitors who were in town.  They were enthusiastic and the rest is history.<br><br>In motion pictures, the text of a classic like this subject is sacrosanct like the Bible!  The 'word' of Jules Verne is not to be made light of, so the duty of the production designer like myself is to take the sometimes arbitary discriptions of the Nautilus as recorded by 'J.V.' and \"make it work\".<br><br>a. Jules Verne while foreseeing brilliantly the atomic submarine of today, did not at that time invent the periscope, the torpedo tube, or sonar.  He did not prophesy closed curcut television.  According to Verne, if Nemo wanted to see what was going on the surface, he simply poked the glass ports of the conning tower out of the depths and took a direct look.  He risked his vessel, himself, and his crew by ramming the enemy at frightening speed. If he wanted to study the marvels of life under the surface, he reclined in his elegent bay window lounge, and passed the hours studying the marine life outside the amazing pressure proof window of his luxurious salon.  These items dictated much of the direction of my production designs.<br><br>b. Nemo is quoted by Verne as telling Aronax that \"I need no coal for my bunkers.  I have instead harnessed the very building blocks of the material universe to heat my boilers and drive this craft\".  No one can doubt Verne meant Atomic Power.<br><br>c. It is not sound economics to study and design obviously unnesscessary parts of the Nautilus if it will not appear on screen.  The crews quarters were thus unaccounted for.  In Verne's original text Nemo from time to time leaves the chart room and steps directly into other diversified areas of the submarine.  Directors do not like to slow down the action and clutter up a dramatic moment by showing actors leave a room, lift a hatch, enter another room.<br><br>d. At the time Captain Nemo constructed Nautilus on Mysterious Island, the iron riveted ship was the last word in marine construction.  I have always thought rivet patterns were beautiful.  I wanted no slick shelled moonship to transport Nemo thru the emerald deep and so fought and somehow got my way.  On Mysterious Island Nemo had the white hot heat of a volcano to help him build his dreamship, but I am sure that flat iron plates profusely riveted would have been his way.  His stock pile of material was always the countless sunken ships uniquely available to him alone.  Even the Greek amphora and the works of art that graced his great salon was salvaged from wrecks.<br><br>e.  The free diving suits - (self-contained) were developed by myself with the assistance of Fred Zender, and exceptionally able underwater man.  The helmets were souped-up Japanese pearl diving helmets.  We masked the scuba gear, let water into the the helmet, put a breathing tube in our mouth, the clamps on our nose and one night in 1952 Freddie and I walked slowly from the shallow end to the deep end of the Santa Monica pool.  Lead around our middle and 16 lbs. shoes...it worked!  Many had predicted failure.  This formed the basis of the suits that appeared in the film.  We spent 9 hrs. a day, 7 days a week for 8 weeks at Lyford Key in the Bahamas, underwater! Never lost a man, Fred was in charge of safety.<br><br>f. 20,000 Leagues was the second cinemascope picture to go into production. Fox had the worldrights to the anamorphic lenses developed by a French inventor named Cretien.  This lense \"squeezes\" the horizontal dimensions of a scene into half the normal area on a cinema frame.  If projected thru an anamorphic projection lense it \"unsqueezes\" this image and the resulting image is widescreen.  Fox had only one lense to lease and this meant that Disney could not shoot miniture set ups while the main action sequences were before the cameras.  I hit upon the idea of having the prop miniature shop build a \"squeezed\" Nautilus miniature.  The model was built half as wide and half as long, but just as high.  Even the rivets were \"squeezed\".  This one miniature was shot with a normal lense.  If care was taken to insure the Nautilus remained on an even keel, the resulting footage was more than adequate.  When \"unsqueezed\" by anamorphic projection, the image of the Nautilus was stretched to normal proportions.  Of course the bubbles looked strange, but no one seemed to mind.  The success of this experiment made it possible for the special effects department to make its necessary footage of many of the underwater miniatures simultaniously with principal photography of the actors.<br><br>g.  My idea has always been that the shark and the aligator were the most terrifying monsters living in the water.  I there for combined the scary eyes of the aligator that can watch you even when it is nearly submerged....with the dangerous pointed nose and menacing dorsal fin - its sleek streamlining and its distinctive tail.  The discusting rough skin of the aligator is well simulated by the rivets.  As Verne insists that the Nautilus drove its way clean threw it's victim, I designed a protective sawtooth spline that started forward at the bulb of the ram and slid around all outjutting structures of the hull.  These included the conning tower, the diving planes, and the great helical propellor at the stern.<br><br>Sincerely,<br><br>Harper Goff<br><br>\nArtist and Production Designer Harper Goff's film credits include 'Willy Wonka and the Chocolate Factory, 'Fantastic Voyage', 'The Vikings', 'The Great Locomotive Chase', and Disney's '20,000 Leagues Under the Sea'.  Mr Goff died March 3, 1993 at his home in Palm Springs at the age of 81.<br><br>Corfman","user":"Corfman","rank":[50,56]},{"title":"under the ocean...","rating":28,"date":"28 September 2003","review":"Very simply, Richard Fleischer made a gorgeous adaptation of Jules Verne's famous novel. This is an excellent adventure movie told with quite a lot of humor. Fleischer introduced humor in a few sequences and especially in dialogs. But the movie also includes a sadistic side. This sadistic side is epitomized by the captain Nemo himself. You can describe him as a despotic man who's got a grudge against the earth that made him suffer. Moreover, he regards himself as a sort of governor of the ocean. In this way, Jules Verne's novel introduces a reflection about man and the extension of his power thanks to the machine (the Nautilus).<br><br>Of course, the movie is supported by a dazzling performance. James Mason is an unforgettable captain Nemo. As for Kirk Douglas, well he said once: \"I've made a career of playing sons of bitches\". It's probably true if you study his character of Ned Land. But in parallel, Douglas makes his character funny and likeable. Then, Paul Lukas and especially Peter Lorre are outstanding.<br><br>No matter that the movie was launched in 1954, the special effects aren't antiquated. Thanks to them, the movie could keep a certain charm and nowadays, it lets itself watch with pleasure.","user":"dbdumonteil","rank":[50,60]},{"title":"Cuz He Swears By His Tattoo","rating":9,"date":"10 February 2007","review":"There's something out there roaming the Pacific Ocean destroying a whole lot of shipping and killing a lot of people. The more maritime the nation, the more losses it's suffering. Jules Verne's story has the United States of America taking the first crack at finding what's going on in the Pacific.<br><br>On a ship commanded by Ted DeCorsia are two Frenchmen, renowned scientist Paul Lukas and his assistant Peter Lorre. Also along is Kirk Douglas who is crack whaling harpooner. <br><br>Of course they meet up with the beast and it's no living thing, but a submarine. This was all new back then, although prototype submarines were used in the Civil War they had limited effectiveness. In fact this particular kind of submarine was something unheard of until the middle of the last century. It's captain is a misanthropic fellow named Nemo, played by James Mason. He's taking it out on the nation's of the world for some personal losses sustained. <br><br>His brilliance as a scientist, his refinement also attracts Paul Lukas. But Kirk Douglas just wants to escape because for all of Douglas's carefree philistinism, he sees Nemo as a murderer and a menace. The conflict between both is what drives the story.<br><br>20,000 Leagues Under the Sea won Oscars for both Special Effects and Art direction. It is probably Walt Disney's most successful live action film ever done, even beating out Mary Poppins dare I say. Even in this day of computer generated effects, 20,000 Leagues Under the Sea still holds its own with more modern films.<br><br>Kirk Douglas enjoyed the part of Ned Land the harpooner and it's a favorite of his today. He might have made a few more films for Walt Disney but for an incident that took place after the film. <br><br>Disney was also at the same time creating his first theme park, Disneyland in Anahem, California. When it was opening he invited Kirk and his family to spend the day there on him and he even agreed to furnish a camera crew to follow the Douglas family around as they enjoyed the park attractions. <br><br>So Kirk took his wife and his sons and they had a grand old time and got some free home movies as a souvenir. But Walt Disney kept the negative and the films showed up on his Walt Disney Presents television show. Of course Kirk never got paid for this appearance and neither did any of the rest of his family including young Michael Douglas. <br><br>Even though this left a sour taste in Kirk Douglas's mouth as he related in his memoirs, The Ragman's Son, he liked his work in this film very much and the part certainly has the same kind of exuberance we expect from a Kirk Douglas movie. Kirk even gets to sing in the film, a nice little sea chantey called A Whale of a Tale. He even made a record of it and I'm sure if you can find it, the item might be worth a few dollars as a collectible.<br><br>Right around the time 20,000 Leagues Under the Sea was released the United States Navy launched it's first atomic submarine. In tribute to that most popular of French authors with American audiences, the Navy named the ship the Nautilus. A great tribute to a great writer of fabulous tales of imagination. And Walt Disney couldn't have gotten better publicity had he paid for it.<br><br>Don't believe me, I swear by my tattoo.","user":"bkoganbing","rank":[40,48]}]