[{"title":"A Classic","rating":10,"date":"5 June 2004","review":"\"Glory\" is a modern film classic that highlights a little-known chapter of the Civil War.<br><br>I recently purchased the DVD, and was just as moved (if not more so) as the first time I saw it.<br><br>Broderick, Freeman, and Washington, along with a stellar cast play it faultlessly. I still remember the brouhaha over the casting of Matthew Broderick as Shaw, and I see that even now some IMDb posters single him out for fault in \"Glory.\" Sorry, but I disagree. One should remember that the real Col. Shaw was a young man in his mid-20s - hardly a grizzled old veteran - despite his high rank. Broderick actually does bear a resemblance to Shaw, and shouldn't be criticized for his boyish looks. I felt every nuance of the burden he carried, and thought Broderick did a wonderful job.<br><br>Denzel Washington's powerful acting may never again have a showcase like it did in \"Glory.\" His beauty, rage, and pride scream in every frame. His Oscar for this break-out role was highly deserved. Trip's character is really the distillation of what this film is all about: the black man's heart-rending battle for worth, recognition, and dignity. As far as I'm concerned no one BUT Washington could have played Trip. Thank God for Denzel!<br><br>Morgan Freeman is the film's human core. His quiet compassion and leadership keeps the soldiers focused. His one angry confrontation with Trip proves he has the goods to back up a field promotion to Sergeant Major.<br><br>Freeman (an appropriate reminder of where surnames come from) is the father figure the regiment desperately needs in a time of death and crisis. The men look to him for his calming wisdom and reasonable, fair demeanor.<br><br>Films like \"Saving Private Ryan\" raised the technical bar for battle scenes.<br><br>The fighting scenes in \"Glory\" are, unfortunately, it's weakest element. The staging and choreography are mediocre at best. And other than a scene where the 54th Massachusetts is given a hero's flanking onto the battlefield beaches of South Carolina, these shots don't emotionally engage the viewer. Still, in the end, \"Glory\" isn't about big, noisy battles. It's about the transcendence of the human spirit in the face of bigotry, bad treatment, and almost certain death. It's about a watershed moment in our bloody history that elevated us all and must never be forgotten.<br><br>\"Glory\" is, indeed, glorious.","user":"WindWoman3","rank":[194,220]},{"title":"Memorable and moving - truly glorious","rating":10,"date":"22 April 1999","review":"Easily the best Civil War movie ever produced, and among the front rank of all war movies. Filled with memorable and moving scenes - the look of sheer defiance on Trip's (Denzel Washington) face as his already scarred back is whipped, the men of the 54th telling their stories around the campfire on the eve of battle, Shaw (Matthew Broderick) turning loose his horse on the beach before Ft. Wagner. History is brought to life more vividly in this film than in any big-budget all-star cast epic I can recall. Most often , those films only succeed in collapsing under their own weight and leaving audiences more turned off about history. Glory brings the issues of the time - slavery, freedom and sacrifice - down to human scale. We can understand why the men of the 54th were willing to take up arms, and how tragic it was that they had to sacrifice their lives in order to be considered men.","user":"4ize","rank":[128,146]},{"title":"This is the definition of a truly great war movie.","rating":10,"date":"9 March 2007","review":"To be quite honest, I had low expectations for \"Glory.\" It was just another boring day at school sitting in my history class drawing random drawings in my notebook. Suddenly my teacher says we're going to watch a movie. I wake up from my dreamy state and I decide I'll give it a chance. He loads the VCR tape into the machine and I fix my eyes upon the screen.<br><br>I will put \"Glory\" into a few words--this is what every war movie strives to be and beyond. Glory tells the story of a Civil War colonel (Matthew Broderick) who leads the war's first all-black volunteer regimen into battles and discovers along the way he has to confront the moral question of racial prejudice within, and outside of, his regimen.<br><br>So as I'm sitting in history class watching \"Glory,\" I immediately begin to perk up. From the explosive first scene, I was fully awake. My luck skyrocketed when I discovered two of my all-time favorite actors in the film, Morgan Freeman and Denzel Washington. The movie progressed and I found myself becoming yet more and more drawn into the film--not just watching it, but actually EXPERIENCING every ounce of war, prejudice, and moral questions that face the characters in the movie.<br><br>What's even more, is that you find yourself becoming attached to ALL of the characters--every single black soldier--in some strange way, so strange, that when these men fall in battle you feel a jolt of power inside of you that is converted to emotional sadness in your mind.<br><br>The final scenes in Glory are mesmerizing. No, more than that--utterly spectacular. The final battle scene at Fort Wagner is so amazingly shot you will think you're actually there fighting along with the black regimen. You're not in your seat watching the film--you feel like you're there! The final battle scene is so spectacular, it will easily remain one of the most memorable battle scenes I've ever witnessed in all of film. After watching Glory, you will find yourself truly moved in all ways possible. You will almost feel like a new person.<br><br>All of this paired with a beautiful score by James Horner, Glory is simply one of the best war movies of all-time. Anyone who misses this film is missing out one of the most powerful, moving, and memorable experiences a movie can bring you.<br><br>I'm so glad I found myself in history this year.","user":"SteakSalad_101","rank":[81,91]}]