[{"title":"Very flawed, still interesting","rating":7,"date":"8 September 1999","review":"Chaplin's last picture is a film with many faults, yet it's not as bad as often claimed. I've seen it many times myself. Here is my opinion of it:<br><br>One of the most important flaws is the miscasting of Brando. He seems ill at ease. Thus Loren has to carry the film virtually alone. The whole structure of 'Countess' is not well balanced. There's too much simple visual comedy for a romantic comedy, and vice versa. The plot is thin (It's supposed to be simplistic). Also, the score is at times muddled as previously introduced dramatic themes come and go without any reason (see and hear Hedren's first appearance.) The film is also a bit overlong.<br><br>The good things: There are points when the music is up to Chaplin's usually high standards (Cargill's comedy scene, storm theme). Cameo appearances are nice. Direction is more focused and production values are certainly superior to A King in N.Y. Yes, I believe, that what is often described as Chaplin's 'flat' direction due to a lack of skill is an artistic style by choice. Simpleness is not the same as unskilfulness. For instance, during the dance scenes, the camera movement following actors is subtle and economically made. You'll notice it if you watch them in fast-forward.<br><br>And if one may feel disappointed at the film on the whole, there's at least a very beautiful, poignant and simple ending that is in my opinion the best of any Chaplin film I've seen. Its every element is in place.<br><br>Therefore it's a rather mixed bag of a movie, most suitable for Chaplin fans and very interesting as a curio, at least.","user":"ouija-3","rank":[47,54]},{"title":"not as bad as critics made out","rating":7,"date":"28 July 2006","review":"an interesting curio as Chaplin's last film. Loren is ravishingly beautiful and carries the whole film well on her shoulders. Brando badly miscast, he shows some great timing in the madcap farce rushing around scenes, but try to imagine how Rex Harrison could have done this type of slamming doors and hiding farce as the uptight diplomat exasperated with his stowaway - think My Fair Lady. Brando's mumbling performance just does not gel. Apparently he had disagreements with Chaplin and maybe was sulking.<br><br>Very nice cameos from Margaret Rutherford (British films of the 50s Miss Marple) and Angelar Scoular (batty girl like in her performance in On Her Majesty's Secret Service), also great comedy performance from Patrick Cargill (British TV comedy and a memorable No 2 in the Prisoner) as the butler. Excellent acting going on here.<br><br>It is dull to start with, static camera like silent films, stagy, and obvious studio sets, but by the time the sea sickness scene came along I was laughing and drawn in. The post marriage bedroom scene is funny.<br><br>There is a scene at the bar with Sydney Chaplin (Charlie's son) where he tries to distract Michael Medwin, where Sydney looks amazingly like Charlie in attitude and timing - but this is probably due to diligent direction by his father.<br><br>A really nice theme music from Charlie again. Yes, it is old fashioned, a filmed play, was absolutely released in the wrong decade, with the wrong leading man, but does show some of the Chaplin traits and even perhaps genius, certainly his humanist philosophy in the treatment of homeless or stateless persons.<br><br>A real shame it was so savaged by critics at the time and disappointed him in his old age. He deserved better for his lifetime contribution to the art of film.","user":"fcasnette","rank":[27,31]},{"title":"This could have been a much better movie--as it is, it's still an interesting film","rating":6,"date":"27 November 2006","review":"This film has a pretty poor reputation and in some ways it is deserved, but I also wonder if maybe the reason critics were so hard on the film was because they expected too much from director, Charlie Chaplin. It was the last film he directed and in this sense, it is a disappointment that he made such an ordinary film. But, if they had thought that the director was Homer Noodleman or Myron Lipschitz, would they have been so hostile towards THE COUNTESS FROM HONG KONG? <br><br>The biggest problem about the film is probably the choice of stars for the film. While Marlon Brando was brilliant in some films, he also often acted well outside his range--this film is a great example. He just isn't a funny actor no matter how much he tries in the film. The part appears to have been written for someone like Cary Grant or David Niven--but not Brando. And Sophia Loren, while not as badly miscast, also really isn't in her element. Also, Chaplin himself only appears for a few seconds, and I am sure many were disappointed at only seeing this ever so brief cameo.<br><br>Now as for the plot, I read one review that said this film was made in the wrong decade, and I agree wholeheartedly. The movie looks much like a romantic-comedy from the late 1930s. This isn't really a criticism--more that this film would have played better and been embraced more in this decade instead of the more jaded and \"hip\" 1960s. I'm sure than many potential viewers were turned off by it being a movie \"for their parents\".<br><br>Unfortunately, the film apart from these minor criticisms wasn't really a bad film. While not the perfect culmination to his career like it would have been if LIMELIGHT had been his final film, Chaplin had nothing to be ashamed of other than miscasting.","user":"MartinHafer","rank":[23,28]}]