[{"title":"An intense suspense War drama from the beginning to the end","rating":9,"date":"30 March 2008","review":"The big star of Frankenheimer's film is the train itself... And the plot is based on the characteristic of railroadsengines and cars all over the tracks, cabs and steamall shown on enough detail to keep the viewer in great suspense The aerial strike shots are also wonderfully taken <br><br>The film begins in Paris, August 2, 1944 <br><br>It's 1511th day of German occupation The liberation of Paris seems very close <br><br>Nazi Colonel Von Waldheim (Paul Scofield) decides suddenly to remove by train to Germany the best of Impressionist masterpieces His objective is clear: \"Money is a weapon. The contents are as negotiable as gold and more valuable.\" <br><br>Mademoiselle Villard (Suzanne Flon) informs the Resistance of the shipmentThe Resistance reaction is to stop the train without damaging the national heritage \"They are part of France.\" But stopping the train is not a simple task You can get killed especially if you are French and the train is German <br><br>Labiche (Burt Lancaster), the Chief Inspector of the French Railway System, is not impressed However, he never communicates his political, ideological, or nationalistic convictions, \"For certain things, we take the risk,\" he said; \"but I won't waste lives on paintings.\" <br><br>When an aged engineer, Papa Boule (Michel Simon), is accused of sabotage in spite of saving the train through the Allied's bombs at the risk of his own life, Labiche is forced into combat <br><br>It begins with a long sequence where an armament train and the art train are both trying to leave the yard in the morning As they are being moved back and forth across the tracks, the viewer knows that British planes will hit the yard in that moment at exactly 10:00 o'clock <br><br>New complications are introduced, but the central conflict always returns to an obsessive art lover against a man with no appreciation for art Labiche's only concerns is to slow down the Nazis keeping himself and his compatriots alive <br><br>Now, two forces control the film The first is Frankenheimer's cleverness to choreograph the real trains Frankenheimer and his cinematographers capture the heat of the engines, the noise and sound of the cars in motion, the fault in the oil line, the crushing strength implicated when the machines come into collision and the derailment The second force is Lancaster, the \"headache\" of the fanatical obsessed Colonel whose desire is to see the priceless paintings in Nazi Germany...","user":"Nazi_Fighter_David","rank":[67,75]},{"title":"Masterful Action Drama from Frankenheimer","rating":9,"date":"30 June 2007","review":"For me, the concept of an 'action' film is the most curious, as many examples of the genre seem very static to me - even today where it seems that anything can be shown on screen. A fight, car crash, explosion, etc is rehearsed, staged, simultaneously photographed and edited in a certain way that brings out and sometimes enhances the action. But, as the event is meticulously planned, rigorously controlled and sometimes, or always re-shot, spontaneity cannot be part of the action, or plays a small part. The action may be impressive, but it still seems unreal, too chaotic, or even more importantly, the sense that the action is not integrated into the story and maybe even more importantly, the attitude and motivation of the characters. Most action films are far from being this sophisticated.<br><br>Almost everything that Burt Lancaster does, or experiences in John Frankenheimer's, THE TRAIN seems real, necessary and interesting. He did all his own stunts in the film, learned to cast driving axle-bearings, which we see in the film in a continuous take. Frankenheimer was one of the true masters of the audacious, complicated, continuous scene and this film has many astounding set-pieces. The film is also one of the last great films shot in deep focus black and white (mostly with a 25mm lens) and it is the bold, striking compositions of the intense and vigorous action that elevates the film to an even higher level. Frankenheimer never took the bland, straightforward choices of blocking and positioning the camera in his films - certainly not in the first half of his career and THE TRAIN is a veritable textbook in imaginative visual directing.<br><br>There is great sense of danger in the film, much like the feeling that THE WAGES OF FEAR produces - and indeed in one scene, we see an actual train-crash that smashed nine cameras, and was only captured by one camera which yielded one of the most startling shots in all of Cinema! The whole film has sense of almost reckless daring, but was carefully controlled throughout. The scene where Albert Rémy uncouples the engine from the cars is insane! I can't think of another film where a key actor does something so dangerous on their own, with a stunt double.<br><br>But all of these scenes and shots serve the story, which is in itself fascinating. It asks the question: What is more important - irreplaceable works of art or the lives of common human beings? Col. von Waldheim is an unorthodox Nazi, who has a deep admiration for 'decadent' paintings and is willing to save them possess or save them at any cost , regardless of his orders. Paul Labiche knows trains inside out, but a painting means as much to him as \"a string of pearls to an ape,\" but his morals are infinitely more compassionate than von Waldheim, which he makes clear without speech at the end - where, in fact, twenty minutes go by without Lancaster uttering a single word, which was unheard of them of a superstar male actor, but it totally appropriate. It is one of the great performances in all of war/action Cinema, I feel. And his antagonist is the legendary Paul Scofield in his first screen appearance in six years, who is, as always, magnificent. Everyone did a first-rate job on this film, yet only the screenwriters were nominated for the 1966 Oscars (the film was not released until May 1965 in the USA) which is yet another example of Academy madness.<br><br>Everything about THE TRAIN is unconventional. It was made at a time when other studios and directors would have gone for colour and CinemaScope, Frankenheimer went for deep-focus, black and white 1.66:1, went for authenticity, verisimilitude - no back-projection or models. Arthur Penn actually began the film, but I have never been able to ascertain how much material he shot, or why he was fired, but it would have been a very different movie; Frankenheimer's vigorous, but elegant style is so perfectly right for this film.<br><br>One thing that makes some films extra special is those that have many scenes where a process is at work and is shown in detail, seem more powerful. One cannot shown process in any other medium of art. Heist scenes, as in THE ASPHALT JUNGLE, RIFIFI, LE CERCLE ROUGE, etc are prime examples, the escape preparations in Robert Bresson's, A MAN ESCAPED and Jacques Becker's, LE TROU are also enthralling and 'make' each movie what it is. The working out of a life-or-death puzzle, as in BLOW-UP, THE CONVERSATION and De Palma's, BLOW OUT also illustrate the power of the medium. What makes these scenes - 'process of action' - interesting and occasionally powerful, is that they make us look at human interaction with matter is a different, even deeper way. Slow motion cinematography remains one of man's greatest inventions. Before it, we had no idea how fast moving objects worked or behaved. There was over 50 years of gunfire in Cinema, until we saw what a bullet leaving the barrel of a gun looked like, in THE OMEN (1976). It spins, for one thing. That must have surprised many people.<br><br>On the whole and after seeing it for the first time in about six years, I firmly feel that THE TRAIN is one of the greatest action films ever made, not only for its audacious crashes, bold style and unobtrusive score by Maurice Jarre, but also for it simply being a fascinating and unusual story this is brilliantly acted.","user":"Gordon-M","rank":[25,27]},{"title":"An unusual war movie but still good","rating":8,"date":"16 August 2018","review":"The movie is about a episode that happened in 1944. When France was still occupied by the Nazis, they decided to steal paintings from the Paris museums. This film is about a shipment that the French has to save before he ends to Germans, but they also don't want to be destroyed in the process.<br><br>Burt Lancaster stars as a French train engineer that has to transport the shipment. At first is not a easy task, but he succeeds in the end. Meanwhile he becomes friend with a hotel owner played by French actress Jeanne Moreau (that passed away last year). And the other members of the cast are fine. Paul Scofield as a German general is great (and Scofield also starred in other great movies after this), and it was a treat seeing French comedian Michel Simon in a war movie (just like Bourvil in THE LONGEST DAY).<br><br>This movie had great direction by John Frankenheimer, great performances by all the actors, and also great photography in Black and White. Although a bit dragged in some places, it was still great to watch! And as a fan of the history from 1850 until these days, I liked the movie for his accuracy and his action scenes.","user":"bellino-angelo2014","rank":[11,11]}]