[{"title":"A voice from the other side of the ocean","rating":21,"date":"21 June 2007","review":"Scrolling through the comments, I was impressed with the number of people from the USA, who said that this movie really scared them, when they first saw it. In fact it is not surprising. Well, I am Russian, yet it scared me too.<br><br>But first, a little preface. I was in the second grade (appr. 1982), when I first heard about the nuclear war. We had a number of lectures on it - of course the information was adapted so that 8-9 year old kids could understand it. We were impressed, but childhood has a wonderful gift that lets you quickly forget what was bad. So during the only false alarm that was held in our school the whole lot of students and tutors were brought out into the schoolyard, and we all stood in lines and through snowballs at each other imitating air bombing, and there was a feeling of excitement everywhere. The fact is, that many of us treated the threat as something so-far-away-that-it's-not-worth-worrying-about.<br><br>The movie was shown on out TV once only (with all the necessary precautions like \"don't let nervous people see it\"). Well, to say that I was terrified is to say nothing. For what it did, was that it made the threat so ordinary - and so real. Though for me it happened on the other side of the planet, you could easily imagine that the same thing would happen in my own country - and no fools - it would be absolutely THE SAME.<br><br>For some period thereafter I became slightly phobic (\"Ma, what's that roar over our house, it's too low for a plane heading to the nearest airport\"). But now I regard it as a good experience, because it made me think. I got a clear understanding that this COULD happen. I guess there was quite a big number of people in our country with the same understanding, and together with the threatened people from other countries they prevented the whole thing from happening right then. Hope the plain old common sense will help prevent the nuclear apocalypse in future.<br><br>P.S. Recently I saw the movie one more time, and it stirred the same emotions, as it did in my childhood. A great movie, that's all I can say...","user":"olgaginger","rank":[63,65]},{"title":"A lesson with images","rating":9,"date":"9 February 2005","review":"I was a naval aviator deployed aboard the USS Ranger (CV-61) when I first saw this film. The show had aired back in the States some time before the film reels (this was before video tape decks were commonplace) were flown out to our Battle Group, so we knew that the telecast had had a big impact on the American public before we had the chance to view it.<br><br>That didn't matter. The film had as great, and possibly even more of, an impact on those of us out on the \"tip of the spear\" as it did on those back home. The military characters seen in the film were not actors -- they were contemporaries of ours, some even familiar faces -- so we felt a true connection to the story. The tension between the US and the Soviet Union was real and nobody knew better than we how nasty things could get in a short period of time. Even as we watched the film over the ship's closed circuit television system, Soviet military units were intent on locating and targeting our Battle Group. Our job, our daily routine, was part of the story, which emphasised the point that we were responsible for keeping the peace and to not allow events to escalate as we all feared could happen.<br><br>The reaction I remember most from this film was worry for family back home. -SPOILER- The one airman who left the silo area to reach his family before the missiles arrived displayed a sentiment that we all felt. No one aboard our ship would shirk his duty, but we all understood the sentiment that once duty is done, family is foremost in mind.<br><br>The argument could be made that the film was rife with error, but I maintain that it ultimately succeeded in what it was designed to do...make people seriously consider the consequences of nuclear war. That point was not lost on those of us aboard the Ranger at the time. While I watched the film again just recently (21 years after the first viewing), the lesson was still not lost. We may or may not be vulnerable to such a massive strike as what was feared back in the 1980s, but nuclear terror is still a very real possibility. It is as imperative now, as it was then, that we ensure that this type of calamity is never visited upon anyone, especially those about whom we love and care.<br><br>Yes, better special effects would make from some jaw-dropping images, but would that improve upon the film's message? In my opinion, no.","user":"sparks401","rank":[163,178]},{"title":"My Nuclear War film is better than your Nuclear War film.","rating":27,"date":"27 December 2002","review":"I only stopped by to comment on this film after discussing Threads on another board and seeing how much of a beating it The Day After was getting. Having seen this during its premiere and Threads almost a year later I will say this. No matter how poorly the effects or the acting, or how graphic and extravagant the visuals were all these films serve one purpose. To educate us on the value we have as creatures that not only have control over our individual destinies but the destiny of our world and the lesser species. To show us what the cost would be, no matter how graphic and obscene. The Day After, Threads, Testament, The War Game, Failsafe, Wargames, and all the other media programming that has shown us the horror of nuclear war. Each has its strengths and flaws, its highs and lows, but the message inherrently remains the same. <br><br>So why is there any discussion of the differences? To debate the flaws and merits of one horror in many variations is pointless, for they are all important, all special and all as relavant today as they were when they were first created. Perhaps we have learned nothing?","user":"HyperPup","rank":[22,22]}]