[{"title":"Tomorrow the World","rating":8,"date":"30 April 2002","review":"This is the kind of cat and mouse thriller that we will never make again. It is a movie that went through a process.  Someone had an idea, wrote the story, set the atmosphere, and produced a white knuckled mystery.  Boy, do I miss film noir.<br><br>Barbara Stanwyck plays an intelligent professional woman who sees a woman murdered in the apartment across from her.  She calls the police who come to the conclusion she was dreaming.  Gary Merrill plays the weary, but sympathetic, detective who investigates.  They question the suspect - George Sanders - but he eventually convinces them that she is unbalanced.  She becomes more and more desperate for someone to believe her all the while she is being set up.  She and Gary Merrill begin to fall in love.  He wants to believe her, but George has spun an insidious web.  Eventually she finds herself under suspicion and is sent to the cuckoo's nest for observation. There is bizarre  confrontation between Barbara and George where he actually admits the murder and proclaims himself the savior of the 4th Reich!  You'll have to take it from there.<br><br>Barbara Stanwyck was a little past her prime, but she still put out the passion and energy that made her famous.  George Sanders really looked tired, but displayed that old world charm that makes little old ladies melt. Gary Merrill is such a likable guy, you tend to forget that he can't act. <br><br>\nThere was not one car chase, not one explosion, and no one fired a pistol, never mind a Mach 10.  Boy I miss these movies.","user":"howdymax","rank":[41,49]},{"title":"Stanwyck does it again !","rating":25,"date":"25 November 2001","review":"I have been a fan of Stanwycks since I was a child (now 55 yrs)..saw and thought I knew most of her films from mid 30's- on to the TV years. Somehow, Witness To Murder escaped me, until I saw it listed  to be shown on TCM (thank you Ted), this weekend 11/23, I believe... I set my vcr, and was not disappointed, what an outstanding film noir this is.. yet no one ever mentions or discusses this one !!!Stanwyck is just as good as she was in Sorry Wrong Number, maybe more controlled... Plot is similar to Hitcocks Rear Window, but it has many more twists and turns. Supporting cast is great, including 2 All About Eve alumni.. George Sanders, playing a sadistic Nazi (yes) murderer his best work since Eve, and Gary Merrill, portraying a police detective...You  can see future star and Oscar nominee, Juanita Moore, (Imitation of Life '58) in an assylum scene, very effective, and Jesse White, as Merrills partner giving some comic relief... Wow, couldnt stop watching... Great to see this ignored film from mid 1950's.  Is it on tape ?? Aside #1: Gary Merrill was married to Bette Davis at the time... She and Stanwyck did not get along...I would have loved to be a fly on the wall when Gary came home from work... during the filming of Witness.<br><br>Aside# 2:  Stanwyck was the most prolific  actress in Hollywood history!! She just kept turning them out.  I remember my parents taking us to our local theatre, Regent, in Newark, NJ.. and every other week so it seemed was a Stanwyck movie... We had just seen her in Titanic, and soon she would be in Executive Suite.... what a pro, what a career, what an actress... she was such a family favorite that my older sister was named after her, Barbara......","user":"olddiscs","rank":[33,39]},{"title":"A great look at being a career woman in the '50s","rating":7,"date":"13 January 2007","review":"\"Witness to Murder\" is a small but interesting film starring Barbara Stanwyck, George Sanders, and Gary Merrill. By 1954, Stanwyck was 47 and no longer considered leading lady material. However, because she was such a great star and actress, she could still get good roles in big films, \"Titanic\" and \"Executive Suite\" being two that leap to mind. She could also, like Loretta Young, get stuck in B movies like this one and \"Jeopardy.\" \"Witness to Murder\" isn't so much a B movie as it is closer to what one was seeing on television by 1954. And it's not a B cast.<br><br>Stanwyck plays a career woman, Cheryl, of a certain age who sees a woman murdered in the apartment across from hers. The apartment belongs to an author, Albert Richter, who emigrated to America after the war. Cheryl reports the murder but no one believes her. Richter is too smooth and always one step ahead of her with the police. Cheryl is considered an hysterical single woman who has delusions because she isn't married and probably going through menopause, though this isn't out and out stated. Completely outrageous and no doubt what actually went on at the time. These assumptions were just taken for granted in the '50s. There was something really wrong with a woman who never married. Read LOSER. A woman's goal in life was marriage; the career was just a stopgap until the ring was on the finger. What must it have been like for an intelligent woman to have that mantle put on her. In this film, the police detective (Gary Merrill) is interested enough in her to at least follow the case.<br><br>All of the acting is very good, with Stanwyck really shining as someone determined to get the truth out, even if she has to do a little detective work herself. Sanders is very effective as the villainous Richter, and he's pretty scary at the end of the film. The last 15 minutes or so are exciting and will have you on the edge of your seat.<br><br>This is actually a fairly derivative film bolstered by its stars. And you can't beat the opportunity to see the attitudes toward women played out in a realistic manner. Alas, there are still touches of it today.","user":"blanche-2","rank":[20,23]}]