[{"title":"The start of something...","rating":6,"date":"30 July 1999","review":"Aces Go Places isnot that the credits will ever tell youa remake of the Dick Emery film Get Charlie Tully. The storyline is identical, but the characters are distinctly Chinese.<br><br>King Kong (Sam Hui) is a Simon Templar-like thief, known for pulling off a major jewel heist in Hong Kong. The Royal Hong Kong Police are stumped and decide to enlist overseas help from a shortlist which includes Inspector Clouseaubut realizing that actor Peter Sellers is now dead (an interesting use of in-jokes mixing reality with the film world), they turn to their next choice, American-based Albert Au (Karl Maka), the 'Bald Detective' (the literal translation of the series Kojak in Cantonese). Sylvia Chang plays a police superintendent who Au falls for.<br><br>Apart from some changes to the story, and action sequences which arguably inspired Jackie Chan, Sammo Hung and other film stars, it is Get Charlie Tully from there. Without revealing too much, the clues are identical; even certain gags.<br><br>It doesn't mean to say this is a poor version of Get Charlie Tully. It has been cleverly changed to Chinese tastes, and the movie is still funny 18 years on. Arguably, the Hong Kong writers have created something even funnier than the Emery movie through a careful use of puns and metaphors. The pace and timing remain an odd, if hilarious, mixture of British and Chinese.<br><br>It was, after all, successful enough for four more sequels through the 1980s, although after this outing, the Emery connection ended and Maka and company went for more - for want of a better term - originality.","user":"Jack_Yan","rank":[17,18]},{"title":"Hong Kong Cut VS. Euro Cut","rating":7,"date":"7 September 2001","review":"In every Euro or American version of a Hong Kong movie I see, scenes in the Euro-version have been cut out and replaced by scenes that are supposed to be more pleasing to western audiences. This mentality I don't get but it's usually so. But alas with one of the greatest comedies in history it wasn't meant to be. I first saw the Hong Kong version on DVD, (really crisp sound!!!), and here is the story in a nut-shell. Famous jewel thief \"King Kong\" steals $30,000,000 in diamonds from the mob, but leaves a white glove at the scean of the crime, causing the mob to believe it to be the work of the famous jewel thief \"White Glove\". After tracking him down in Veins, Italy he claims that he is innocent. Not really buying his story but giving him the benefit of doubt the mob gives him a chance go to Hong Kong and get back the diamonds or forfeit his life. Mean while the \"Best Partners\" consisting of King Kong and Gigolo Joe have hidden the diamonds. Well actually Gigalo Joe hid them but before he could divulge the location to King Kong he is killed by Mad Max, the local gang leader, with a gang right out of the movie \"The Warriors\" you know the Polo gang. His crime, sleeping with Mad Maxes sister. Before he dies Joe is able to tell King Kong that he put the clues to where the diamonds are on the asses of two different women, in the form of tattoos. Mean while at the Royal Hong Kong police headquarters, the Hong Kong police find out that White Gloves is in town and they enlist  the aid of the famous New York detective Albert Au, AKA:Kodiejack, AKA:Baldy to aid them in their search. Assigned to help Baldy is the super tough cop Superintendent Nancy Ho who mistakenly arrested Baldy earlier, and who is just as Sadistic as she is beautiful (watch for the meat grinder scean). The police catch King Kong and in exchange for turning over the diamonds and helping the cops catch White Gloves he will be set free. \"Man the law in Hong Kong is really lenient.\" White Gloves and Mad Max make several attempts to kill our new \"Best Partners\" consisting of Nancy Ho, King Kong and Baldy, but each one is foiled. A search continues for the two women on who's butts rest King Kong's chance for freedom and White Gloves chance for life and probably Nancy Ho's chance for promotion. To add to the trouble one of the women is Mad Maxes sister. In the final scean White Gloves vs. King Kong with a squad of sports cars, I will not give away anything els toward the end, but what follows is a brief description of what to look for: 1. Great escape by wire, motorcycle, and glider. 2. Great slapstick al the way through the show. 3. Great acting by the main cast Sam Hui, Karl Maka and Silvia Chang, as well as great acting all around. 4. Great comedy as our hero's' try to convincethe women to show their stuff, so that they can examine the clues. 5. The Aces go places music video sung by Sam Hui himself \"does he ever do concerts anymore?\" 6. great gagits used by King Kong, a bit like James Bond 7. A climatic battle of street cars and toy cars and a great chase scean at the end. 8. Nancy \"Hot-toung\" Ho and her sister, both beautiful.<br><br>Euro version: Many sceans are cut out, much of the dialog is totally different which I can usually accept but here it's really bad.<br><br>Sceans cut out: 1. Part of the interrogation of King Kong at the police station. 2. Part of the scean with King Kong and Gigolo Joe in the restaurant. 3. The entire music video 4. Part of the scean with King Kong and Baldy in the hospital. Other comments about the euro-cut: 1. King Kong is now only known as Sam \"Bad\" 2. Gigolo Joe is now only charley \"Bad\" 3. Nancy Ho is now Hot-Toung \"good\" It's not a sexual reference and it's cool.<br><br>The Euro version is a piece of c**p, and it isn't available in wide screen!!!! No actor does their own voice over, and I know Karl Maka know english perfect. Watch the Euro cut only if you cannot stand subtitles.<br><br>The Hong Kong cut is top notch!!! A perfect ten, the greatest Action Comedy there is. You will not be disappointed.es","user":"Highice007","rank":[12,15]},{"title":"One of my favorite Comedies","rating":11,"date":"11 July 2001","review":"Famous Jewel Thief King Kong (Sam Hui) steals $30,000,000.00 in diamonds from the mob, who have mistaken him for another famous jewel thief \"White Gloves\".  Now White Gloves must go to Hong Kong to find the diamonds and clear his name or the mob will kill him. Hearing that White Gloves is in town the Hong Kong Police hire a chinese american detective Albert \"Baldy\" Au (Karl Maka) (A spoof on Kojak) to find and capture White Gloves. Police Supervisor Nancy Ho(Sylvia Chang) is partnered with Baldy to catch White Gloves. Soon the two learn that King Kong is the one responsible for the heist and in exchange for the police dropping charges against him, he agrees to turn over the diamonds and help Baldy arrest White Gloves for crimes commited in the USA. This is a James Bond-ish style film with a lot of action and a lot of slapstick. The \"Aces Go Places\" music video is well placed in the middle of the film sung by Sam Hui himself. The movie spawned 5 sequels Aces Go Places 2, AGP 3: Our Man From Bond Street, ACE 4, ACE 5: The Terncotta Hit, and Aces Go Places 97, although ACE 97 is a sequel in name only, sort of what Halloween 3 is to that series.<br><br>One of the best comedies in history **********","user":"Highice007","rank":[4,5]}]