[{"title":"A Space Movie That Boldly Went Where Others Haven't--Unfortunately!","rating":10,"date":"4 February 2004","review":"Pulp science fiction created an aura of awe and excitement that is rarely equaled in these current days of sci-fi movie \"actioners\". Gone are the opportunities to see alien species and their homelands depicted in \"wonderous Technicolor\". Instead, we are routinely preached to by screenwriters determined to warn us, ad nauseum, of man's follies and the impending disasters always depicted as a forgone result. Yes, now we get chiseled heroes, and heroines, too, who are usually engaged in single-handedly shooting up the screen with loud twentieth century-derived weapons. Where is the fun in these stereotypical, shoot-em-up extravaganzas?<br><br>\"This Island Earth\"(\"TIE\") with (for its time, remember)jaw-dropping visuals, big, truly alien world realizations and theme of inter-solar system war, hasn't been matched since its debut almost fifty years ago! For a plot that catapults you half way around the universe with one beautifully realized set after another and an epic-sized stage on which to play out its themes, perhaps only \"Forbidden Planet\" ever matched up.<br><br>The sounds, the visuals and the story line of \"TIE\" weren't intended to chastise you as a stupid earthling, but instead, have long served to take the willing on an adventure ride that all too few space movies have chosen to create. Until Hollywood chooses to really explore the universe you ought to have your own copy of \"This Island Earth\", in order to frequently remind yourself of what we should all be seeing much more often: space movies that enthrall!","user":"pbsbkb","rank":[116,126]},{"title":"Loved it at age 11; still find it great at 56.","rating":19,"date":"19 May 1999","review":"When it came out, I thought this was the most fantastic movie I'd ever seen. It was easy to identify with the lead character and to share his fascination with the technology that the aliens used to capture his attention and recruit his talents.  I particularly remember being entranced by the special effects;  the use of vivid color was outstanding among sci-fi offerings of the time.  45 years later, it's still my favorite of the era. I enjoy watching the movie on video and recalling the thrill of seeing it on the big screen for the first time.","user":"Hank Lay","rank":[62,66]},{"title":"This is a great treat from a wonderful era of Sci-Fi.","rating":12,"date":"12 March 2003","review":"This is a great treat from a wonderful era of Sci-Fi. Those who complain of the hardware aspects have no romance - an Earth scientist receives an unsolicited manual and roomful of parts to build a futuristic two-way TV, but the parts are a marvel and the pages of the manual aren't paper, but some manner of flexible metal. After constructing the \"Interociter\", our hero receives a broadcast from Exeter, a fellow scientist with a suspiciously prominent forehead, inviting him to join his research team of the world's greatest experts in their fields. What follows is a comic book come-to-life, and in vivid, 3-part Technicolor! This film is beautiful to look at, and apparently many of today's best Sci-Fi filmmakers did. Rex Reason is fine as our hero, Jeff Morrow is one of the most memorable aliens of the era, and Faith Domergue is a fine actress and is mysteriously one of the most unsung beauties ever. And as to the hardware, the special effects, etc - there is actually nothing to complain about at all...the spaceship, the planet Metaluna, aliens, etc, are not merely passable for the 50's, they are compelling by today's standards. If you have just a bit of imagination, this is one of the best Sci-Fi classics of it's time, and still makes many contemporary efforts pale in comparison.","user":"MickeyHSr","rank":[77,83]}]