[{"title":"A movie that works without being able to explain why","rating":10,"date":"27 May 2004","review":"Years ago while living in another state, I was bored and went to the local \"mom and pop\" video store to find something to pass the time. The proprietor asked me what type of movie I preferred. I responded that I like movies that are good stories about people, relationships, friendships, etc.<br><br>He recommended \"Bagdad Cafe\".<br><br>A few years later, the video store was driven out of business by the larger chains. It is too bad really, because I doubt that I would ever have stumbled upon this little gem of a movie at one of the huge mega video marts that are popping up all over the planet like unwanted zits, but I digress.<br><br>I owe that person a huge \"Thank you!\" for introducing me to what has become one of my all time favorite movies. <br><br>I was strangely pulled into the movie right from the beginning. For me, it was like a great book that you just can't put down, and that you want to read over, and over again to see if you missed anything, or merely to recapture the warm feeling you got the first time through.<br><br>What is also unusual is that after more than 10 years have passed, I recently was able to talk my 25-year-old son into watching it with me. His comment about midway through was, \"I am strangely drawn to this movie.\" At the end, he said it was \"Great!\" and asked me if it had won any awards. I found this perspective amazing coming from someone who regularly feeds on a diet of movies such as \"Lord of the Rings\", \"Matrix\", and \"Kill Bill.\" Go figure.<br><br> From my limited observation of those who appreciate this movie (like me), I have come to the conclusion that this is a movie that works without being able to explain why. When asked to describe in one word what this movie is about, the best response I can come up with is \"friendship.\" However, that is such a lame description, because there is so much more to the movie than just that. <br><br>Yet, on the surface, one could get the mistaken impression that there is not really much going on \"Bagdad Cafe\". There are no car chases, love scenes, murders, suicides, explosions, deaths, births, weddings, or funerals. The movie just, \"is.\" <br><br>It is a slice of mid-life for two women, Jasmine &amp; Brenda, when their paths cross. These two are women who are trying to cope with their respective lots in life, which from external appearances seem to be quite diverse. However, at the heart they are really the same. Both are in ruts, looking for change, for something better in the middle of nowhere, when they find each other. Once the rock-hard exterior melts away and they reach a common ground, their blossoming friendship transforms both.<br><br>The character of Jasmine is the glue that brings the story together. In \"Bagdad Cafe\", she gives new meaning to the old saying, \"making lemonade out of lemons\" and in the process, she also brings magic and new energy into the life of Brenda and her family. The subtlety of the revelation of Jasmine's real character is one of the best examples of a human metamorphosis ever captured on the screen.<br><br>If you are looking for a movie with special effects of epic proportions, or new adventures in creative violence, this movie might not be for you. However, if you are looking for a story about humanity, love and friendship done with a \"light\" touch, then pop the popcorn and put on \"Bagdad Cafe\" and enjoy.<br><br>Oh, and to the owner of the little video store who recommended this movie to me, where ever you are, thank you for bringing the magic of \"Bagdad Cafe\" into my life.","user":"gusdawg78-1","rank":[145,151]},{"title":"Amazing!","rating":9,"date":"25 December 2002","review":"I watched this because C.C.H. Pounder is one of my favorites. 1 minute in I thought...'why am I watching this?' Three minutes in I was so hooked I watched it twice. One of my favorite Jack Palance performances. Pounder is unbelievably good, and Marianne Sagebrecht is a marvel. The haunting score alone is worth the movie. Do yourself a big favor and ignore the FEW negative comments here and watch this movie. Try to forget big efx, car chase, alien films for a couple of hours and you won't be disappointed.","user":"lottatitles","rank":[59,60]},{"title":"Magic in the desert and music by Bach","rating":10,"date":"3 January 2006","review":"\"Out of Rosenheim\" is a film about how the kind Jasmin touches the lives of other people that at first disdain her. In fact, Jasmin is an angel that happens to come to the help of the poor people at the seedy motel and cafe because she perceives beauty where there is ugliness, hope where there was despair and turns everyone around to appreciate her for what she contributes to enhance their lives.<br><br>Percy Adlon, who is an original filmmaker, scored a big success with this simple film that, judging by some negative responses to this forum, can either make the viewer love it for its subtle charm, or just be perplexed because there is no action. Yet, Mr. Adlon, writing with his wife, Eleonor and Christopher Doherty, created a film that will stay in the viewer's mind for some time to come. <br><br>As the film opens, we watch Jasmin and her husband taking a break in their journey through the desert. As they quarrel, Jasmin decides to leave him and gets her suitcase out of the trunk to walk along the solitary highway to find a place where to rest. Before that, we have seen a strange sort of mirage in the desert horizon where two surreal lights are seen through some mist. Those lights seem to guide Jasmin as to what route to take in order to continue her journey, or maybe she is just an angel with a mission, as the film continues.<br><br>As Jasmin arrives at the seedy cafe that is next to the motel, she encounters a hostile Brenda, a black woman who is struggling to make the cafe and motel work with little success. Jasmin is given a room, but being suspicious, Brenda calls the local sheriff to investigate what is she doing at her place, but since there is nothing wrong, Brenda can't do anything.<br><br>Jasmin upon discovering the cleaning tools in her room gets an inspiration to continue to straighten the rest of the place. She goes and cleans Brenda's office, which is in a state of chaos. When Brenda gets back, she is horrified watching the confusion she left behind has been turned into a neater place where to conduct business. She can't concede the fact to Jasmin, who she still considers an unwelcome guest that has overstayed and has committed the ultimate sin of making Brenda aware of the messy state of her place and her life.<br><br>When Jasmin discovers in her husband's suitcase a kit about learning magic, she begins to practice the different tricks that she shows the others in the cafe. Rudi Cox, the strange man living in a trailer in the property, is a painter; he decides he wants to paint Jasmin and little by little he discovers the beauty of his subject who seems to radiate it from inside her soul.<br><br>The film owes a great deal of gratitude to Marianne Sagebrecht, one of the most accomplished actresses from Germany who is an asset to anything where she is cast. Ms. Sagebrecht steals the film because of the luminosity she projects; she seems to cast an aura that others see and are instantly won over by her kindness and her generosity.<br><br>CCH Pounder, makes a good contribution to the film. Her Brenda is at the beginning harsh, curt and just plain nasty because the way life has treated her. Jack Palance doesn't have much of a role to play, but his chemistry with Ms. Sagebrecht makes a sweet distraction for the movie.<br><br>\"Out of Rosenheim\" is a film in which nothing seems to happen, yet it is packed with a powerful message that comes across as one watches it. Percy Adlon and his star, Marianne Sagebrecht, made a timeless film that will survive the passage of time.","user":"jotix100","rank":[63,65]}]