[{"title":"Before Lord of the Rings, there was...","rating":10,"date":"6 January 2007","review":"Upon completing his epic crime film \"Dr Mabuse\", Fritz Lang embarked on a quest to bring Germanic legend Das Niebelungenlied to the screen. So colossal was the undertaking that it required two films, of which \"Siegfried\" is the first.<br><br>Young heroic Siegfried kills a dragon and bathes in its blood, gaining immortality (save for a fatal weak spot). His quests make him into a powerful figure and allow him to court the beautiful princess Kriemhield. But her weakling brother only approves the lovers' union if Siegfried agrees to help him deceive the beautiful Valkyrie Brunhield into falling in love with him. When she eventually discovers this treachery, the humiliated amazon vows sets forth a cycle of revenge that will create tragedy on an epic scale.<br><br>There's no way to avoid comparisons: \"Die Niebelungen\" is the Lord of the Rings of its day, and easily one of the most staggering epics in the history of movies. The scale, extras and the pioneering dragon-slaying scene all make for enduring cinema. Fritz Lang's alluring visuals push it even further: his awesome depiction of the rigid codes of honor that are the undoing of his characters imbues the film with a mood and atmosphere whose influences are incalculable. \"Die Niebelungen\" can also be read as one chooses, tribute to German heroism or to the trappings and tragedy of \"honor\". Hitler for one was so impressed with the film that he used an alternate edit of the film as propaganda, playing to Wagner's Niebelungen opera (which Lang actually loathed!). To be fair, though the original score can not hope to reach the mythical heights of Wagner's opera, it is still a considerable achievement.<br><br>Though he would revisit the crime genre with the slick \"Spies\" and practically invent modern science-fiction with \"Metropolis\", none of Lang's silent films would reach this level of excellence. \"Siegfried\" of course can only fairly be judged when seen right before the second half of the saga: \"Kriemhield's Revenge\", in which formality makes way for chaos and petty jealousy and revenge turn to violence on a biblical scale.<br><br>Anyone with even a passing interest in the silent era or film as a whole should avidly seek this out. Kino on Video have a very decent double DVD edition. I wholeheartedly recommend it.<br><br>Edit (October 2010): As I add these words, Eureka have released a stellar BluRay of this saga which is just mind-blowing (reviewed by dvdbeaver, for the curious). If you've never seen this film yet, lucky you. Go straight to HD!","user":"OttoVonB","rank":[30,31]},{"title":"Excellent cinematic adaptation; Excellent cinema","rating":8,"date":"24 September 2001","review":"I'll say this up front: this film can move very slowly at points. Also, I saw it in a theater with live piano accompaniment, and it's likely to be much less impressive on a smaller screen. I doubt the video print is very good, since I am familiar with other tapes that that company has distributed. Despite its slow points, when Lang and crew create the numerous set pieces, watch out: you're in for some of the greatest scenes of filmdom. I'd also like to point out that, as someone who is quite familiar with the original poem, I'll tell you that source material often moves a lot slower than this film does. As a technical marvel, I don't think some of the stuff here was surpassed until very recently, except maybe in King Kong. It's even more amazing to behold than Metropolis, Lang's next and much more famous film. All of the effects might seem dated now, but anyone who appreciates early cinema will easily fall in love. <br><br>The film opens with Siegfried's infamous battle against the dragon. A bit of trivia: this scene is not in The Nibelungenlied. It is briefly mentioned in the first lay by Hagen as having happened a while ago. However, this is the one scene from this movie which is widely remembered, and for good reason. The dragon is amazingly created, nearly on the level of the dinosaurs from The Lost World and King Kong. Unlike them, though, it is a puppet and not stop motion. As far as puppetry goes, it surpasses most of the muppets of Return of the Jedi by leaps and bounds. Unfortunately, as lifelike as they made it, the dragon is not at all that fierce. It almost looks like a friendly dog (it even wags its tail as Siegfried valiantly rushes at it, sword aloft). When it is supposed to be roaring at Siegfried, the audience was giggling; it looked more like it was yelping. As a result, the depiction of Siegfried begins to come off as satirical (probably not intended, but it makes things more interesting). There is a major strain of Niebelungenlied scholarship which sees Siegfried not as the hero, but as the aggressor.<br><br>The second major set piece involves the battle with Alberich, the Nibelung, an episode that occurs a bit later in the poem, from whom he wins the cloak of invisibility, a horde of treasure, and Balmung, his famous sword. The mythological characters in this episode are awesome to behold in their costuming (and simply in the casting, which is perfect throughout; the creatues in the film's first scene, in which Siegfried is forging his sword, are great, too), especially the dwarves who balance the pot full of treasure on their backs. <br><br>The best scene in the film occurs in the next chapter, the dream of Kriemhild, which is animation done in sand. Other great scenes in the film include the crossing of the lake of fire, the battle between Brunhild and Gunther (with an invisible Siegfried helping him), the wooing of Brunhild, the quarrel between the queens, and the hunt. As far as I remember, only the war with Denmark is left out, which happens in the poem before they go to Iceland for Brunhild. It's not missed.<br><br>Special attention must be given to the miraculous casting. Paul Richter plays Siegfried as the hero to beat all heroes. With his blonde, flowing hair, he marches across the world blindly performing great deeds and talking to birds (the look on Richter's face when he starts to hear birds talk is priceless). He's too naive to see the trouble he causes as he dishes out treasure to the poor (a wonderful touch; Lang doesn't even draw attention to how this angers the Burgundians in their dialogue, but only in their expressions). As many scholars have proposed, Siegfried's actions all suggest that Worms is in iminent danger of being usurped by him. Margarethe Schoen may not have been the best choice for Kriemhild. The actress is so manly that I assumed that an actor was playing her. She is supposed to be the most beautiful woman in the world. The actress does emote quite well, however. Now, Hannah Ralph, who plays Brunhild, exudes a manliness that her part requires. She's supposed to be a warrior maiden. Ralph does a great job conveying Brunhild's cunning, bitterness, and cruelty. Theodor Loos, who plays King Gunther, is absolutely perfect. I couldn't have imagined him better. His face exhibits both his moral predicament and his supreme inadequacy that the poem spells out so clearly. Hans Adalbert Schlettow plays Hagen. His costume may be a bit overwrought (a huge, gnarly beard, a furry eye patch, and an enormous helmet with eagle wings reaching a foot and a half upwards), but the actor's perfect for the role, although he might be too old. His age makes me wonder how he's going to fight like a demon in Kriemhild's Wrath, the second part of the film, which I'll see tomorrow. I'm very eager to see how Lang and Thea von Harbou, his wife ans screenwriter, will make the remaining half of the epic interesting on film. It's nothing but battles. Volker and Gunther's brothers are also well cast, although they'll probably be more important in the second half, that is, if the poem is followed as closely as it is here. 8/10.","user":"zetes","rank":[36,40]},{"title":"Superb fantasy","rating":11,"date":"11 May 2000","review":"I saw this on the big screen with live organ accompaniment (from the original film score) last night and I'm glad I did.  Most people don't know Fritz Lang for anything before *Metropolis*, but this is a film which, to my mind, matches the best of what he has done.  It's incredible to see what they were able to do with the wild set design.  The score was suitably intense at moments.  And the story was a pretty touching one about the fall of Siegfried.<br><br>The scenes I was amazed by in particular are: the dragon-slaying sequence (which, at first, elicited laughs because of the obvious artificiality of the creature but then got sounds of pity as he lay slain with blood shooting from his torso); Kriemhild's dream sequence, which has to be the earliest example of animation I've seen (the animation and accompanying music are pretty dark and disturbed--they gave me the creeps); and the approach to Brunhilde (with an incredible sea of fire).  What I've come away with is even more of an appreciation for what filmmakers were capable of in the silent period.  It seems clear after a film like *Siegfried* that silent film was not an infant technology waiting for sound but was an artform of its own.<br><br>All in all, I'd say this is a must-see.  It's clearly not just preparation for the \"great\" films of Lang to come (like *Metropolis* and *M*), but is on par with any of the best of his stuff.  This and *Dr. Mabuse, the Gambler*, both Lang films which are rarely screened, should be caught if at all possible.","user":"mohaas","rank":[18,21]}]