[{"title":"Pretty good story","rating":7,"date":"7 September 2004","review":"The \"pocket battleship\" (in armor and armament, somewhere between a battleship and a heavy cruiser) Graf Spee is abroad in the Atlantic, sinking British merchant shipping. She is tracked down by three British and New Zealand cruisers and after a fierce battle takes refuge in the harbor of Montevideo, Uruguay. In accordance with the Hague Convention, the Graf Spee's Captain Langsdorff is given barely enough time to make his ship seaworthy, without improving her fighting efficiency, before having to leave port. We aren't told exactly what her fighting efficiency is like but we learn she's taken more than fifty hits on the superstructure alone from the British 8-inch guns, and those are big guns. <br><br>There are shenanigans going on at the embassies in Montevideo, in which the French and British try to force the Graf Spee to leave as soon as possible, while the Germans argue for more time. All of this is reported by an opportunistic American from a well-positioned outdoor cafe where the proprietor demands he keep ordering scotch if he's going to sit there and take up the customers' space. Langsdorff is cleverly led by the British to assume that the three cruisers waiting for him outside the harbor have been joined by several other capital ships including an aircraft carrier. The rumor has been deliberately spread by British staff (over an unscrambled phone line in a hilarious scene) and everyone believes it, including Langsdorff. The German captain takes his ship out of the harbor at the appointed time but scuttles her after ordering the crew off. The British have won the Battle of the River Plate, partly through courage and partly through intelligent use of misinformation.<br><br>Actually, considering that it's a \"war movie\" it's pretty good natured. The British crack jokes in the midst of battle. When a shell hits nearby and burns up some possessions, one sailor approaches another bearing a pair of charred boots on a tray and asks, \"You ordered the toast?\" When sailors die, they do so almost nonchalantly, with time for a brave few words like, \"See to the others.\" <br><br>As far as that goes, the film gives you a fairly decent picture of what sea duty can be like: operating the rudder from the steering aft position, for instance. (What a job!) The movie demonstrates the advantage of using real ships instead of models. The problem with model work has to do with texture. The splashes of exploding shells, for instance, send up drops of water as big as basketballs. But here there is some drop-dead gorgeous photography of ships making smoke and heeling around. Not even modern computer graphics could manage so effectively. <br><br>The Germans are treated humanely too, this being 1956 and not 1946. The Germans have a number of British prisoners aboard the Graf Spee and they celebrate Christmas together, with the captors presenting the captives with Christmas decorations. When a German officer announces to the prisoners that they will soon be released in Montevideo, he cheers along with the British. <br><br>Among the funniest scenes are those involving the blowhard American reporter. \"The whole world is watching and waiting with suspense for the Battle of the Ages,\" or something like that. \"Lays it on a bit thick, doesn't he?\" asks one British listener. After a few days of this boreal oratory the reporter's voice is going and he begins to swill liquor, surrounded by a dozen glasses of scotch. \"Excuse me while I get a drink,\" he hoarsely tells his listeners. <br><br>Withall, though, there is a tragic figure here, and that is the wounded Captain Langsdorff who has fought the good fight and is now forced to sail his ship into what he believes is certain disaster. Finch does a good job with the role, as does the script. There isn't a moment when he loses his dignity. And his courtliness seems inbred. The Brits say of him, \"He's a gentleman,\" and, \"He's a good seaman.\" A cheaper movie would have given Finch an unnecessary speech: \"A captain belongs to his ship, just as the ship belongs to the captain. This is breaking my heart. I feel as if someone had just taken my Marzipan away.\" It's a genuinely sad moment when we see the coffins of the German sailors killed in battle. And although the movie ends with the victorious and quite beautiful white British cruisers sailing off into the sunset, the fact is that Langsdorff shot and killed himself shortly after these events.","user":"rmax304823","rank":[54,59]},{"title":"Rousing well made movie, using some of the original ships.","rating":8,"date":"30 September 1999","review":"Fine, entertaining movie of the famous sea battle between 3 smaller British warships versus the great German Pocket Battleship \"Graf Spee\". Tremendous sea scenes , aided by the fact that most of the original ships which fought the actual battle are used in the movie. Well acted all-round with Peter Finch doing a fine job as Captain Langsdorf.","user":"DB-55","rank":[30,32]},{"title":"A masterful depiction of the first major naval battle of the Second World War.","rating":7,"date":"7 June 2004","review":"I often wonder why this film was re-named The Battle of the River Plate when the actual action took place 150 miles to the east in the South Atlantic. Nevertheless it is a great production brought all the closer to reality by the use of two of the original Allied cruisers which were still in commission at the time of filming. The big problem was the choice of a warship to fill the role of the pocket battleship Graf Spee which had already been scuttled and that of her two sister ships which were also destroyed before the end of the war. The choice of the heavy cruiser  USS Salem while not perfect was probably the best the producers could come up with despite it's extra tier of forward and rear main guns and the familiar U.S. Navy number 139 on it's bough. The storyline of the film is held together through the eyes of Captain Dove played by Bernard Lee who is taken aboard the Graf Spee after his merchant ship Africa Shell becomes one of her victims. Loosely held as a prisoner Dove is given an insight into the Graf Spee's tactics as a surface raider and that she is in fact masquerading as an American warship with false gun turrets and a bough number, solving the producers dilemma of explaining the different physical characteristics of each warship. The actual battle while well done does show a few inconsistencies in that the near miss salvos are more like large splashes and at times the Graf Spee looks motionless while being bombarded by allied shells. This is more than made up by the fine acting of the combatants, with Anthony Quale giving a best of British tradition role as task force leader Commodore Henry Harwood along with John Gregson as Captain Bell of HMS Exeter and Jack Gwillim as Captain Parry of the New Zealand cruiser Achilles. Peter Finch is perfect in the role of the chivalrous and compassionate German commander of the Graf Spee Hans Langsdorff who in real life displayed these rare qualities and was immensely respected by those on both sides of the conflict. When the Graf Spee puts into Montevideo harbour in neutral Uruguay to effect repairs a great diplomatic battle ensues over her sanctuary and the story switches to a tense minute by minute dockside radio coverage by American reporter Mike Fowler played in true journalistic style by Lionel Murton. Meanwhile two of the three British Cruisers supported by a newly arrived warship Cumberland maintain a vigil out to sea while their embassy engages in it's own brand of propaganda to deceive the Germans into believing they are up against a vastly superior British naval force. Langsdorff falls for the ruse and after seeing his men to safety scuttles his mighty warship precisely at sunset a few miles out of Montevideo in the mouth of the River Plate. With the expectations that another and greater naval action was forthcoming this fateful decision gives the end of the film somewhat of an anti-climax but it was the factual truth and a necessary conclusion to maintain it's credibility. To add a final footnote, there is presently underway a large salvage operation to raise as much of the Graf Spee as possible and eventually put it on display in a museum in Montevideo.","user":"grafspee","rank":[47,52]}]