[{"title":"Wisdom from space out of the mouths of babes","rating":8,"date":"28 February 2009","review":"***SPOILERS*** Despite its very low ratings from the movie critics the movie \"The Space Children\" is one of the most thought-provoking motion pictures to come out of Hollywood in the 1950's in its addressing the dangers of nuclear proliferation and the cause for nuclear disarmament. \"The Space Children\" ranks right up there with \"The Day the Earth Stood Still\", which was released seven years earlier in 1951, in making that very important point crystal clear to the movie going public.<br><br>With their dad David Brewster, Dave Williams, working as an electrical technician at the Eagle Point Project young Bud &amp; Ken, Michael Rey &amp; Johnny Crawford, are somehow contacted through mental telepathy by this \"Brain\" from outer space. The two boys are told by the \"Brain\" to go to this secluded cave on the beach for farther instructions.<br><br>At the cave both Bud and his kid brother Ken find a number of like-wise kids there who's fathers, like Bud and Ken's, are involved in the Eagle Point Project. The Eagle Point Project is being fined tuned to send a missile into space that will, after going into orbit around the earth, be able to launch a nuclear weapon anywhere on the planet in case a war breaks out between the US and the Soviet Block including Red China.<br><br>The children are instructed to convince their parents working on the project to stop the launch of that missile called \"The Thunderer\". The children are told telepathically that if the missile is launched there'll be dire consequences not only for the country, the US, who launches it but the entire earth as well!<br><br>The movie has the children, mostly preteen-agers,try to convince their parents to get the missile launch stopped with only Bud and Ken's dad David Brewster finally seeing the light. That's only after David was paralyzed by the \"Brain\", that looks like a pipping hot blob of lava, from outer space when he tried, with a bolder, to smash it. Getting his feelings, by his son Bud touching his arm, back David desperately tries to get the missile launch called off but is declared, by those in charge of the launch, either delusional of suffering from burnout. It's then that David is ordered by the head of Project Eagle Point Lt-Col Manly, Richard Shannon, to be sent to a local military hospital for much needed rest, from the stress of his heavy workload, as well as be put under mental observation.<br><br>With the Thunderer scheduled to be launched within the hour the children now on their own, with the \"\"Brain\" directing them, enter totally unnoticed, as if their invisible, by the military sentries the super secure missile site and somehow disarm the Thunderer making it totally useless! It's during that same time that Dr. Wahrman, Raymond Bailey, one of the top engineers at Eagle Point also realizes that what Bud and his fellow adolescents are saying is the God honest truth! Seeing with his own eyes the kids involved in a number of strange and unexplained incidents leading up to the missile launch Dr. Wahrman came to the conclusion that their being guided from something from outer space with powers beyond his imagination!<br><br>The film has a bittersweet ending with Bud and his brother Ken as well as the rest of the children proving, by the \"Brain\" revealing itself to those in charge of Project Eagle Point, that their right about the dangers of testing Thunderer and the dangers of nuclear testing for strictly military purposes. What leaves the audience and the \"Space Children\" a bit concerned is will they-the adults running the world-now learn from what they've seen and stop nuclear testing. Or will that timely lesson have to implemented on them, with deadly force if necessary, by their space neighbors who are now monitoring them here on earth as well as in the far off and distant universe!","user":"sol1218","rank":[8,8]},{"title":"Not Arnold's best, but still a classic","rating":9,"date":"9 April 1999","review":"While not Arnold's best film, IMHO (I find it a bit preachy and badly hampered by the rubbery silliness of the Big Alien Brain), this is still a memorable film.  Though set in a beachfront area it happens mostly at night, using Arnold's typically haunting black-and-white compositions to set an appropriate tone of strangeness and isolation. The children, alienated from their preoccupied and overworked parents, are almost adopted by the space creature, which takes them under its protection (a drunken and abusive father is disposed of soon after the brain's arrival) even as it enlists them in its pacifist mission.  At first fairly typical kids, they quickly develop an air of gravity and wisdom that remains after the alien departs, suggesting a lasting, even evolutionary effect. The film's title is perfect: the kids do become Space Children, more in tune with alien than human thought.","user":"angelynx","rank":[19,22]},{"title":"The rating for The Space Children is as puzzling to me as any I've run across","rating":7,"date":"19 April 2007","review":"I've seen a lot of weird things on IMDb, but the rating for The Space Children is as puzzling to me as any I've run across. 2.1?!?! I couldn't disagree any more. 2.1 is getting close to Manos territory. The Space Children may not be the best movie I've ever seen, but it doesn't deserve a 2.1. Why the low rating? I blame MST3K. I enjoy the show, but as I've argued any number of times, some of the movies that they lampooned didn't deserve it. Take a look at the reviews on IMDb. You can split them into two wildly divergent groups - those users who appear to only know The Space Children because of MST3K and those who have seen it on its own. The comments from the MST3K crowd always seem to mention Uncle Fester (Jackie Coogan) in a bathing suit as if it's one of the most important moments in the film. In contrast, many of the comments from non-MST3K viewers reminisce about seeing The Space Children during their childhood. Maybe it's not just an MST3K thing but an overall generational thing as well. Whatever, I tend to side with those who enjoy the movie for what it is.<br><br>And what is it? The Space Children is a nice little cautionary 50s sci-fi film that speaks to the dangers of nuclear proliferation. Jack Arnold, one of the best genre directors of the 50s, does his usual workmanlike job with the movie. It's not flashy, but it certainly looks good. The Space Children obviously was made on a limited budget. As a result, the special effects are also limited and Arnold focuses more on the people. A lot of what happens is implied. But that's not necessarily a weakness. Too often, low-budget sci-fi films from this period look ridiculous because of the desire for elaborate special effects (i.e. monster and aliens) that outstripped the funding it would require. The acting, while not outstanding, is solid. Even the kids, who can be annoying at times in this kind of movie, come off looking pretty good. The cast will be familiar to many who grew up watching television in the 60s. Overall I've got no big complaints with The Space Children. Not a bad way to spend just over an hour.","user":"bensonmum2","rank":[22,26]}]