[{"title":"Where did this movie go?!?","rating":7,"date":"10 June 2006","review":"I've seen this film exactly twice on TV late at night. If it isn't in print anywhere (it doesn't appear to be currently) it should be. Joan is at her campy, over-the-top best in this bizarre story of a woman, her love interest, and a couple truly strange neighbors (one of whom would later become \"Lovey\" on Gilligan's Island). The dialog alone is enough to make it worth seeing. Jeff Chandler is at his studly best too. So much of Joan's work is out on DVD and hopefully this film will be too some day. If you're a Crawford fan and you've never seen Female on the Beach (get a load of that title!) you'll be thrilled by this seemingly \"lost\" movie. You can't beat a film with a line like, \"I wouldn't have you if you were hung with diamonds upside down!\"","user":"wayjack","rank":[19,19]},{"title":"Crawford plays Crawford in self-referential cautionary tale","rating":8,"date":"7 August 2002","review":"Few case studies of Hollywood stardom rival Joan Crawford's in their curiosity.  A certified star from the time of last silent movies and the first talkies, she fell from favor more than once only to be restored in ever newer incarnations, largely through the boundless reservoirs of her will.  <br><br>And if there is an era that defines the Crawford that we remember most vividly, it's the decade-plus, from her Oscar-winning turn as Mildred Pierce in 1945 through her last `really top' movie, The Story of Esther Costello in 1957.  In her valiant assault, as she moved into middle age, against time's winged chariot, she had vehicles built around her that helped define the canons of camp but retain a fascination that transcends camp.  This dozen or so includes: Humoresque, Flamingo Road, her second Possessed, The Damned Don't Cry, Harriet Craig, This Woman Is Dangerous, Sudden Fear, Torch Song, Queen Bee and Autumn Leaves. Though we may howl at some of them (or at parts of them, for they range from rather good to quite dreadful), we're always aware  at times discomfitingly so  of the human drama that underlies and links them all: the Joan Crawford story.<br><br>In Female on the Beach, she plays a recent widow taking up residence in the coastal California home her wealthy husband owned.  Her arrival proves ill-starred, for a broken railing on its deck marks the spot where its previous tenant  another woman battling age and isolation  plunged to her death.  Did she jump or fall  or was she pushed? It unfolds that she had fallen prey to a youngish beach bum (Jeff Chandler) operated by a pair of older con-artists (Cecil Kellaway and Natalie Schafer); Crawford is targeted as their next mark.<br><br>Obsessively guarding her privacy, however, she proves to be a tough nut to crack.  Her too familiar realtor (Jan Sterling) is swiftly shown the door when she makes the mistake of taking Crawford for granted.  And Chandler, turning up unbidden in Crawford's kitchen one morning, encounters that same rough hide; asked how she likes her coffee, she icily replies `Alone.'<br><br>But tanned muscles and prematurely grey temples do not count for nothing in affluent oceanside communities, so Chandler slowly wins over the armored Crawford.  But the course of true love never did run smooth, as the Bard of Avon warns us.  Crawford just happens to find the dead woman's indiscreet diary (it's hidden away behind a loose brick in the fireplace!), a sad yarn of being cheated in card games and bilked for loans by the larcenous old couple while being strung along by Chandler.<br><br>No fool she, Crawford hands the gigolo his walking papers.  But then she sinks into a sump of liquor and self-loathing, staggering around waiting the phone to ring like a torch-carrier out of a Dorothy Parker story.   Finally, of course, Chandler does call and, better yet, wants to marry her!  But fate has a few final cards to deal, including an uninstalled fuel pump Crawford had bought for Chandler's boat....<br><br>That staple of genre cinema, the woman-in-jeopardy thriller, generally features dithery, hysterical young things as straw victims.  Crawford in jeopardy, by contrast, turns all the conventions upside down.  The coquettish bulldozer she has constructed of herself at this menopausal juncture in her life, with her face as fiercely painted as a Kabuki mask, seems designed to repel   to crush  any threats.  (Of course, like most such postures of domination and intimidation, It's a construct of fear  her fears of falling short as a serious actress, as a mother, as a woman; fears of aging and no longer being able to lure her directors and costars between the sheets; fears of not mastering her own unachievable goals.)  The facade of control and self-sufficiency proves all the more arresting when it comes under siege from the cumbersome twists and turns of these situations held over from nineteenth-century melodrama.<br><br>Hence, Female on the Beach and its ilk.  An indomitable woman of a certain age flies solo into the perils of mid-life, only to triumph against all odds.  That was the life Crawford was living at mid-century, the life reflected in these films, by turns appalling and transfixing.  Not since the Brothers Grimm has such a string of cautionary tales been issued.","user":"bmacv","rank":[46,50]},{"title":"See This Movie!","rating":10,"date":"23 April 2002","review":"This is a terrific soaper in the grand style! Joan Crawford is SUPERB as Lynn Markham,arm-candy widow of a wealthy man,whose house has been the scene of another wealthy woman's death.She falls for the dead woman's gigolo/prime murder suspect and he for her....but is he a killer? This is a GREAT movie,featuring a stellar Crawford performance as well as a terrific turn by Jeff Chandler as the boy-toy who may be a dangerous game indeed!","user":"satanslut","rank":[17,18]}]