[{"title":"this not quite short film another of Jean Vigo's precious works, but it goes without saying...","rating":8,"date":"10 March 2007","review":"...that in Jean Vigo's all-too short-lived career as a filmmaker he didn't make one unsuccessful movie, despite his difficulties. But seeing Zero For Conduct, which was no doubt a big influence (if only in the details of some scenes) for Truffaut's 400 Blows, I do feel a little sorry for it in a way. Watching it, I kept thinking 'is this Vigo's director's cut, or did they make him cut stuff out'? Because within the 41 minute time frame- which comes in over one minute of being a short film- things happen, but they almost happen too fast. Holes are sort of left in the plot, and only occasionally do they becomes a little bothersome (I wanted to see what happened, for example, when the kid told the short principal \"go to hell\" as it cuts right from that to the kids gearing up for their uprising for the next day). If this were the length of L'Atalante, it might even be just as great as that. It's flaws, if any, are probably also due to budget. It also doesn't help that the print was so scratched, and the subtitles so spotty, that some of the time I wasn't sure what's going on or if a cutaway was right.<br><br>This all aside, however, Zero For Conduct is a wonderful little song to the spirit of youth, and what it is to be at that age and see authority, practically any authority, as a form of fascism. In fact Vigo makes a point of making the title, Zero For Conduct, part of the repetitive punishment for the students that disobey just in the slightest. It a given until after a while it loses its meaning. We're given a small band of joyful miscreants, Caussat, Colin, Bruel, Tabbard, as they plot to stage a rebellion on the day of the alumni event at the private boys school they attend. Even though one of the professors is actually on the same level of rebellious spirit as them- and at one point does a handstand like one of the other kids and draws a cartoon to prove it- most of the teachers, and the principal with the Napoleon-complex played by the funny Delphin, kill their spirits completely. Vigo's world is almost too much fun though for their rebellion to be too violent or with too many tragedies and so forth, and the anarchy is that kind of childish chaos where it almost comes close to a pillow fight (in maybe my favorite sequence of the film, where the boys do a sort of test-run for their rebellion, laying to waste their sleeping quarters, caught in delirious, masterful slow-motion and sweet music by Maurice Jaubert).<br><br>If you can find it, and you're already a fan of L'Atalante, you should be in for a very pleasant, early-sound era surprise from Vigo and his great DP Boris Kaufman, with much of it featuring the perfectly goofy experiments with the form that were done in A Propos De Nice, but here with something more of a story. With the quality spotty and all- one of the films most in need of a restoration in fact- Vigo's style never seems too compromised at least, and the sense of pure, cinematic exuberance with what makes life grand and not so grand is up for grabs in a real short shot. We get the little notes of humor, however slight (like the boy doing a little trick with his fingers on the train), and the moments of the dark side (a moment when the principal, with a student at his desk, does some kind of creepy demon pose), and it ends with a cool French school song too. Like Bunuel's Simon of the Desert, I'm not sure if Vigo's film got a bum rap or if he had planned to make it even bigger and with more depth into who these kids are and what the school is like. But like that film as well, what remains contains splendors that can only come from unique minds in film-making. A-","user":"Quinoa1984","rank":[28,32]},{"title":"a basic for cinema lovers","rating":10,"date":"2 October 2006","review":"Vigo's first fiction film is one of my favorites classics of all. From the presentation of the characters you can realize that the movie is something special; the kids are just great: they are intelligent, funny and over all, rebel , but with no loss of their candid side. The adults receive a grotesque layer of paint to put the olive to the acid-social humor cocktail. The technical department may be a little under the possibilities of its time, but still Vigo's crew make it by the smart use of simple resources like the dramatical application of animated items or simple edition tricks. The rest must be seen, not told so get the DVD, forget those fancy details like surround sound (or clear sound) colors or complicated effects and relax for 45 minutes of a simple but rich classic.","user":"diegoarditi","rank":[24,29]},{"title":"The master before Truffaut","rating":10,"date":"9 April 2007","review":"Jean Vigo led a famously short life, he lived only until his thirties, and made four films, each of which were great, two of which were perfect. The first was l'Atalante, the second was 'Zero for Conduct', which was based on his experiences growing up an orphan living in several boarding schools, constantly battling lifelong ailments which would eventually go on to kill him. The poignancy of a life like his comes from the fact that some people spend their whole careers trying to make just one film that comes close to what he did effortlessly in his twenties, and no doubt had he lived longer he would have gained the recognition and popularity awarded to filmmakers like Truffaut and Godard, two directors who perhaps owe their careers to Vigo, particularly Truffaut, who's 400 Blows took much inspiration and material from this film. It is clear the artistic impact Vigo had, he was a master who experimented with sound and music loops well before it became fashion to do so, as well as camera speeds such as during the wonderful pillow fight sequence which is slowed down so we can see a hurricane of feathers gently floating around the frame. I will never forget this image. Zero for Conduct was particularly short, not long enough to be considered a feature, but not short enough to be considered a short film, but in my opinion too short. I would have gladly watched another hour of this beautiful and strange film...","user":"Camoo","rank":[17,20]}]