[{"title":"Les 24 Heures","rating":15,"date":"15 December 2002","review":"Fans of motor racing will appreciate this semi-documentary film based on the legendary 24-hour French road race. The film is set during a period in motor sports just prior to its almost total usurpation by corporate culture, in this case 1970, when there was still a tolerable balance between sponsorship and the particular form of nobility that pervaded racing. As a film, LeMans is remarkable for a sense of restraint that is so unwavering that even the incomparable Steve McQueen seems almost normal inside its cool envelope. No movie on the subject has ever equaled its transparency and authenticity. Motor sports have become so sophisticated and big-time that if you cut the average driver with a knife he might bleed only contact cleaner, or Mello Yello. Modern drivers are still courageous and skilled, but something essential has been lost to the hype and the inevitability of high technology. In LeMans, you can almost smell the 100 octane Supershell and the hot Castrol. People look at one another, not at computer displays. They converse directly over the rasp of tightly-wound 12-cylinder engines, not through headsets and mikes. It's a human thing. Overwrought genre siblings like Days of Thunder are ludicrous and crass compared to LeMans' pure, almost ascetic spirit. Tom Cruise's Cole Trickle could not buy a pit pass into its world.<br><br>LeMans is, essentially, about racing. But as a film in the American narrative style, it must have at least some back story and, in this case, that story is romantic. As a safeguard against terminal mushiness, the back story is duplexed into a pair of similar boy/girl situations, thereby keeping each from acquiring excessive density while satisfying the needs of the form. In one, a European driver and his tres charmant, preternaturally understanding wife, work through to a conclusion that it is time for him to walk away while he is still able. The other focuses on the hesitating and mutual attraction between McQueen's American racing star and the widow of an Italian driver who died in the previous year's LeMans race. The night-time accident that claimed her husband also involved McQueen's character; a no-fault event. It was just racing. The lady, who still misses her late husband but is ready to move on, desperately needs someone to talk to, someone who fully understands the nature of her loss and who might possibly, to some discernible degree, justify it. Steve McQueen thrived on characters who required no external validation, from women or men, but who were never arrogant about it. He was the real deal. Few of us have the courage or motivation to be as authentic, or to weather the storms that can result from being so, though I think we should still try. McQueen's racing driver carries this same authenticity and he sutures the widow's aching heart with it during a meal break (LeMans cars were driven around the clock by two-driver teams) while sitting across the table from the lady. She is resisting a strong desire to run and protect herself from her own feelings. But McQueen's character is so self-effacing and contained, yet so completely and unthreateningly there, that she cannot pull away from him. Only part of the dialog is audible. The rest of the scene is viewed from outside the dining area as the camera pulls back through its window. It's a brief scene but excellently acted, adding itself into the film's humanity, a quality that is never lost against the backdrop of hurtling cars and screaming engines.<br><br>The racing sequences are beautifully staged. The final seconds before the race starts, drivers in the cars, fidgeting with shifters, one by one switching ignitions on as the countdown closes against a stethoscopic heartbeat sound, puts you right in the cockpits. At-speed scenes were driven by actual racing luminaries of the time, including McQueen himself, and they go as fast camera mounts will allow. A couple of spectacular crashes take place, both filmed in an interwoven stop-action style that lets you watch every rivet pop as the cars unpeel like grapes. Near the end, entirely plausible circumstance pits McQueen and his main rival, a great German driver in a gripping last-lap duel. (the German driver, played by Sigfried Rauch, also played the wily Wehrmacht Sergeant in Sam Fuller's The Big Red One.) These two characters meet briefly during mutual down-time early in the race and establish the obvious respect and fraternal affection they hold for one another. The camaraderie established here underpins the entire film from that point and also transforms their last-lap duel into pure contest. And the cars. open-class LeMans machines of this period still sourced much of the sinuous design style of the preceding decade and they are gorgeous to the appreciative eye, especially McQueen's ride, the Gulf Porsche 917, possibly the most charismatic car ever raced. Interestingly, one of the cars used in the film (a Lola as I recall) was recently discovered languishing in a German barn, sans motor and transmission. Both had been loaned by Porsche for the production.<br><br>Fire up LeMans on a system with decent audio capabilities, EQ a bit toward the bass to compensate for accurate but slightly raspy 70's recording technology, and crank it up. You may not feel the burn, but you'll definitely hear it. Only the somewhat too Rat-Pack score detracts from this super little film and that only slightly. Otherwise it's as time-proof as one of those molded spoons you get in Chinese restaurants. Any true fan of the sport, certainly as it was in the film's time-set, should collect it. If you appreciate the compact, character-driven, semi-documentary style, try Downhill Racer. Released the year before LeMans, it's about skiing. Robert Redford's Kiss-My-Ass ski god isn't remotely noble but is entirely believable, as are Gene Hackman and Dabney Coleman as his coaches. It was one of the late John Simon's favorite films, and for good reason.","user":"rrichr","rank":[83,86]},{"title":"The Ultimate Racing Flick","rating":10,"date":"10 November 2001","review":"The reason why most racing movies fail, is because the Hollywood people try to tie in some cheesy plot to the highly professional sports of auto racing. In real life car racing, there is no dramatic love story, no struggle between good and evil, no rebel against the authority. In real life, racing is all about speed, physical strength, and concentration, anything else is just distraction.<br><br> Rather than put in a third rate plot to make a crappy story out of it like Driven or any other racing flick has done(including the Grand Prix), Steve McQueen's Le Mans has chosen to walk the different path, to bring the true spirit of car racing on the big screen. Who cares if there is no plot, no conversation, or no love story. If you are looking for those things, you are watching the wrong movie. The sound of the 917 blast down the Mulsanne at full throttle is well worth the time to watch this movie.<br><br> Sadly, this is probably the last of the true racing movies. The world today is impossible to make a movie out of real racing car(every single race car in Le Mans is real. The Porsche 917, the Ferrari 512S, The Lola T70). Driven uses mock CART car based on Indy Light, plus a whole lot of crappy CGI car, Grand Prix uses the F2 car that looks like the F1 at the time. A movie like Le Mans probably will never be made again.","user":"racingmaniac","rank":[93,100]},{"title":"Delaney - the unheroic hero (and all the better for it)","rating":24,"date":"24 October 1998","review":"It's always the dispassionate films executed in documentary style that show us what mankind is truly capable of and consequently make us passionate. Kubrick did as much regarding space travel in 2001: A Space Odyssey, as did Wise in his portrayal of scientific method in The Andromeda Strain.  When Delaney (McQueen) undramatically explains his motivation for returning to the most demanding of the GT endurance races with the plainly delivered words \"When you're racing - it's life.  Anything that comes before or after is just waiting\" we realise that any emotional content delivered on top of the actions of such men would be superfluous, or would even detract from their achievements.<br><br>To the unfamiliar viewer, raised on the formulaic and dependable sports action drama, the tension is in all the wrong places.  The start of the race - effectively a 15 minute build up to the 4 o'clock commencement climaxing in Delaney's racing heartbeat and the roar of 50 or so competition engines - has us more wound up than the sequence portraying the final lap (but only just).  Similarly, the scene in which Delaney's team manager (Ronald Leigh-Hunt) orders him back on the circuit after a near-fatal accident is without the (surely obligatory nowadays?) show of defiant reluctance - Delaney is hardly the identikit Hollywood hero whom we could expect to confront authority armed to the teeth with the usual cocky dialogue.  Quite the opposite.  Delaney - the lop-sided figure quite unable even to cope with a confrontation with a fellow racing-driver's widow without feeling awkward - realises that, rather narrowly, he is able only to drive faster than most other professional drivers and that he has no self-affirming existence outside of the demands and constraints of the team.<br><br>For all those who believe that the heroes of this world are those who rebelliously reject such impositions on the 'free-spirited' individual - whether they be the social class-based constraints of Titanic or the intellectual ones of Dead Poets Society - the film will no doubt descend into lap upon lap of fast Ferraris and Porsches (as it did for the Time Out film reviewer).  Those of us who know that mankind's most towering achievements (winning an event such as the 24 hours of Le Mans being no exception) have been constructed by relatively stunted men and women will sympathise with the character of Michael Delaney.  Delaney is no hero, but is all the more heroic for it.","user":"Caius&Gonville","rank":[56,62]}]