[{"title":"Superb!!","rating":10,"date":"7 February 2003","review":"I watched this little gem of a film on UK television last night and enjoyed it immensely.I can only agree with what everyone else said and thoroughly recommend seeing this if You get a chance,I know I'll have to buy the DVD or Video of this film if I can find it. What a tragedy that the girl who played Savannah died at such a young age.","user":"leelee2001","rank":[17,20]},{"title":"A wonderful film!","rating":22,"date":"22 November 2001","review":"I just bought Savannah Smiles on DVD and got to watch it again for the first time in years.  It was still as wonderful as when I was six years old, if not better.  This is one of those movies that was made in the 1980s, but doesn't fall in the \"80s movies\" genre.  It seems that not a lot of people have heard of it or seen it.  I can't help but wonder why because this is a great movie!  Perhaps if it would have had a big name star, it would have fared better over the years.  I actually thought it was Drew Barrymore who played Savannah until not too long ago.  Despite few big name stars, everybody does an outstanding job in their roles.  Like a previous reviewer, I too wonder why Mark Miller didn't make many more films, he is a terrific actor!  Although none of the music made the top ten, the film has a great soundtrack.  The film will make you laugh, get angry, and cry.  I shed a tear at the end and I am usually not one to get emotional over movies.  Look high and low to find it, because when you do, you will not regret seeing it.<br><br>John 3:16 &lt;&gt;&lt;","user":"magellan333","rank":[13,15]},{"title":"An excellent movie","rating":10,"date":"22 October 2005","review":"This is a movie that will definitely make you smile.<br><br>All three of the main characters are terrific in this film.<br><br>This is a movie you can definitely watch with the kids, which is a rare these days.<br><br>The parents in the film are a little stereotyped in their coldness and their \"seeing the error of their ways\", but is intended to connect Savanah to Alphie, who wrote the film. The movie is very predictable, however like a Disney movie, although you aren't surprised by anything in it, it doesn't take away from the enjoyment.<br><br>I don't think I have ever sat through it any of the 10-12 times I watched it and not shed a few happy tears.","user":"HughJunit","rank":[12,14]}]