[{"title":"A Director's Dream Come True","rating":10,"date":"3 August 2006","review":"How lucky can you be to get a script like this and a cast like this all in the same movie? I've been shocked at some of the negative comments by other viewers. I was quite young when the movie came out, and didn't realize for years that Peter O'Toole wasn't the fifty year old he was playing, and Hepburn was exactly Eleanor's age at the time, so I fail to see the age mismatched some have mentioned. I'm fifty myself now, and I still find O'Toole perfectly plausible as a fifty year old in this movie. (Although, DAMN, he looked GOOD! What a gorgeous man!)<br><br>As for the 'anachronistic dialog,' it was extremely intentional and would have been totally wrong without it. To our ears, the possibly more elegant speech of the period would have sounded unnatural; only by using modern language could these people sound to us as they would have sounded to each other - normal.<br><br>The acting is brilliant - it would have been very hard to find any other actor who could share a screen with Hepburn without fading away to nothing, or an actress who could have done the same with O'Toole - only two of such power could stand up to one another. And this was absolutely right for these characters - as best we know, Henry and Eleanor were both that kind of person - brilliant, witty, strong-willed powerhouses. Then the supporting cast: Hopkins, Castle, Terry, and Dalton. Granted, they weren't known at the time, so Harvey, the director, may not have realized right off the bat that he had the cast of a lifetime, but he surely must have realized it fast.<br><br>Then there's the script. Like most of Oscar Wilde's plays, you could pick it up, open it to any page, and find at least half a dozen quotable lines. No, people aren't normally that witty in real life, but a) these were VERY bright people as historical fact, and b) it's a play/movie! People don't speak in real life as they do in Oscar Wilde either, but it's enjoyable as hell to watch. Get over it!<br><br>Some things I love about the movie are that it's made clear that no matter what Henry tells Alys, Eleanor, or himself for that matter, his real love and true equal is always Eleanor, just as he is hers. Also that, despite the at least a dozen apparent power shifts in the course of the movie, at the end, ABSOLUTELY NOTHING has changed. And you can tell that with this bunch, nothing ever will change unless it's due to factors out of their control, like death.<br><br>A matter of slight historical correction to other user comments: Alys was legally betrothed to Richard; that's why she'd been raised by Eleanor. <br><br>A historical correction to the script is that John, while thoroughly detestable personally, was not at all stupid, sniveling, or whining; his actual character was actually far closer to that of Geoffrey's in the script. Very little is actually known about the historical Geoffrey except that he was actually, if anything, more of a warrior than Richard, and of course, he died quite young, leaving behind two children, the son being the legal heir to Richard, and who died at the age of twelve or so, ostensibly of disease, possibly in reality of John. This wasn't considered that bad a thing, btw, as no one wanted a child as king, and John was the only one of the whole bunch who'd spent most of his life in England itself. The English nobles had seriously resented both Henry's (in his later years especially, as he tried to carve an inheritance for John out of Europe in general, France in particular) and Richard's neglect (Richard had barely set foot in England in his entire life, and was utterly indifferent to it except as a source of revenue). Also, of course, there's no historical evidence for an affair between Henry and Alys EXCEPT that I've read at least one source suggesting that Richard used this as an excuse to not go through with the marriage itself. And there's CERTAINLY no historical suggestion that Richard and Philip had an affair, although it seems highly likely that Richard was gay insofar as he was sexual at all. Bastards of royalty were a dime a dozen in those days, but NONE are attributed to Richard, nor a whiff or rumor of any affairs he ever had. Both Henry and John, on the other hand, would chase anything wearing a dress, and this was considered perfectly normal and even admirable in a \"bad boy\" sort of way. However, John took it too far, resorting to rape and starvation of wives of political enemies, and this was one of numerous driving forces for the imposition of Magna Carta on him by his rebelling nobles. Ironically, by contemporary standards, at a national level John was a far better king than Richard (Henry at his best was better, but was too often not at his best, being too bent on conquest to bother to rule effectively what he already had). However, John was nonetheless personally a rather nasty man (to put it mildly), once again proving that the best men don't necessarily make the best rulers. His personal character and actions, more than his policies, drove his own nobles into nearly successful rebellion, resulting in Magna Carta, one of the great steps in English history.<br><br>Sorry for boring you silly with the history commentary - it's a period I've always found particularly interesting. You can wake up now; I'm finished.<br><br>Anyway, great movie in every sense - script, acting, score, cinematography, editing; it just doesn't get better than this.","user":"AvhHines","rank":[174,189]},{"title":"Magnificent cinematic medieval chess game, with every intricate move superbly thought out.","rating":10,"date":"1 March 2001","review":"\"The Lion in Winter\" is a crowning achievement in cinematic story-telling. Adapted by Oscar-winning James Goldman from his witty, triumphant 1966 Broadway play that originally starred Robert Preston and Tony-winner Rosemary Harris, the story evolves around aging King Henry II mulling over a successor to the Plantagenet throne among his male progeny, while bringing his estranged, hateful clan together for the Christmas holidays.<br><br>Sparks really do fly in this wickedly elaborate chess game as the  family player pieces weave thick webs of deceit and hatch insidious plots against each another, forming unholy, protean alliances that put those \"Survivor\" contestants to shame.  The pure joy comes from seeing all of them try to outmaneuver each other with every new and different playing piece put on or taken off the board, hatching alternative schemes as fast as one can say \"Long live the King!\"<br><br>Robust, boisterous Peter O'Toole is a raging marvel as the battered but not yet beaten monarch, agonizing over the untrusting, Machiavellian-like brood he's sired, yet relishing the absolute power he holds and dangles over them. The glorious O'Toole is alternately barbarous and bombastic in one of the best roles of his career, and his loss of the Academy Award over, of all people, John Wayne, remains a travesty of justice.<br><br>The king's \"brood\" includes eldest son and heir-apparent, Richard (known as The Lion-hearted) whose fierce courage and burly warrior stance masquerades a forbidden tenderness detrimental to his standing as a king.  Anthony Hopkins, in an auspicious screen debut, embodies these tortuous complexities within Richard perfectly, especially in his scenes as \"mummy's favorite.\" The youngest and pruniest of the three princes is John, a rumpled, drooling, inane man-child impossibly spoiled as the King's favorite, played to pathetic amusement by a terrific Nigel Terry.  Neglected middle son, Geoffrey, excellently portrayed with jaded, sliver-eyed cunning by John Castle, is a human blueprint of treachery and deceit.  Resentful at being overlooked as even a possible contender, he's willing to sell his parents and brothers down the river for exact change.<br><br>Also invited to Christmas court is King Phillip II of France, on a revenge mission himself, who locks horns with Henry over lost lands and becomes a willing participant in these under-handed games.  Timothy (\"007\") Dalton drips with smug, venal charm as the slender, softer, inexperienced king who can only battle Henry with words and wit, not weight.  The only unblemished pawn here is Alais, the King's adoring young mistress, who is maliciously thrown to the lions by all as lady-in-waiting bait for the dueling princes. Demure, fragile Jane Merrow is the perfect choice for this innocent songbird with nothing and everything to lose<br><br>I have saved the best performance for last.  As the King most duplicitous irritant, the inimitable Katharine Hepburn portrays Henry's duly banished Queen Eleanor of Aquitaine with all the unparalleled skill and inspired passion imaginable.  Handed on a silver platter the lion's share of the best lines, Hepburn more than delivers the goods here, stealing the ripe proceedings from her talented co-stars.  To watch her consummate Eleanor is to see the art of acting in its most passionate form.  She is a revelation of perks and prods, of vibrant colors and shadings.  She inhabits the passion, the power, the breeding, the deceitfulness, the desperate longing owed this character.  Imprisonment (for inciting rebellions against her husband), has not dampened the fighting spirit nor dulled the sharp, calculating mind of this Queen.  As in chess, this player is the game's most venturesome and versatile piece, and Hepburn more than lives up to its reputation, a worthy opponent with the best odds to check-mate her King. I have been known to say that the four-time Oscar winner was awarded for all the wrong movies -- excepting this one.  She is unforgettable.<br><br>Topped with a glorious, inspiring, sometimes furious score (Oscar-winner John Barry), \"The Lion in Winter\" makes up for its stark, one-note surroundings with its bold, rich characters and ingenuous plotting.  It is a hallmark of Gothic temperament and tone. As the old adage goes, \"it's not who wins, it's how you play the game.\"  'Tis so true.  So let the games begin!","user":"gbrumburgh","rank":[140,155]},{"title":"What Family Doesn't Have its Ups and Downs?","rating":10,"date":"17 March 2005","review":"This, by all means, should have been the film to do a clean sweep at the Oscars come 1969, but as fate would have it, only three wins, Best Actress, Writing from Another Medium, and Music. The storytelling is so simple yet so powerful and the acting is of such a high order that it seems timeless despite being a Historical Drama set in the 12th century.<br><br>Set on the course of one night, King Henry II (Peter O'Toole) has a family reunion to see who of his three sons will be his successor to the throne, although he has his eyes set on John (Nigel Terry), but his imprisoned wife, Queen Eleanor of Acquitaine (played to perfection by Katharine Hepburn) has other plans which involve her own favorite, Richard (Anthony Hopkins in his film debut). Matters get complicated when neglected son Geoffrey (John Castle) pretends to be on John's side to serve his own interests and when Eleanor encounters Henry's mistress Alais (Jane Merrow) and will not cede the Acquitaine to Henry. Into the mix is a revelation from newly appointed King Philip of France (Timothy Dalton) in which he states that Richard had raped him (when in fact they had had an affair). Floating above the overlapping intrigues is Henry, not quite able to decide just what will the course of action to take, and when he learns that his sons have been conspiring to overthrow him (thanks to Eleanor), he almost gets painted into a corner and makes an impossible decision.<br><br>This is a fascinating story, written so eloquently and performed so powerfully on-screen that one forgets this was originally a stage play with Robert Preston and Rosemary Harris in the leads. No sumptuous decorations; this, while being a family of noble extraction, they live devoid of the commodities that one would imagine coming from them. Of course, chemistry just overflows whenever Hepburn and O'Toole are together on-screen; it makes one think of the best matches in cinema history and is a shame they never worked together again as she was fond of him. If anything, they alone are the movie and never for a moment does one get bored even though the only \"action\" sequence is a scene where O'Toole drags Merrow to force her to marry Hopkins while Hepburn quietly monitors them. A beautiful film, timeless in its theme of family and inheritances, with shrewd performances, the best movie for 1968.","user":"nycritic","rank":[75,84]}]