[{"title":"Underrated and under-appreciated.","rating":10,"date":"18 July 2006","review":"I can't understand why TopGun is so hyped yet nobody has even heard about this movie? Sure its not as glamorous or stylish but it is far more realistic. Perhaps some people just don't consider the old A-6 Intruder bomber as glamorous as an F-14 Tomcat fighter? Unlike Topgun, this movie is faithful to facts and the footage is much much better. The combat scenes are brilliant and the way they show the intensity of anti-aircraft artillery and machine gun fire from the ground really illustrates the difficulties of air warfare. Also unlike Topgun, where the MiGs were fake aircraft and really American F-5s, the MiGs in this movie were real MiGs. So were the SA-2 Divinia SAMs that were fired by the thousands. The combat and dogfight scenes were far more realistic than topgun even if they looked a bit less flashy.<br><br>This movie is a real gem and a must see for anybody interested in aviation or war related movies. If you are clueless about aviation and just want a no brain entertainer, stick to topgun.","user":"starringdash","rank":[55,66]},{"title":"A great movie","rating":9,"date":"14 August 1999","review":"Perhaps I should say \"A really great movie *if you like planes*\".  This is not repeat not a chick flick.<br><br>Flight of the Intruder is based on the book with the same name by Stephen Coonts.  (As usual, the book is much better than the movie; it's well worth the read)<br><br>Flying an A-6 Intruder may not be quite as glamorous as the \"Fighter pukes\", but Jake Grafton (the principal character) wouldn't swap it.<br><br>But when on a pointless \"toothpick mission\" (Blowing up a bunch of trees) Jake's bombardier is shot and fatally wounded by small arms fire, Jake becomes disillusioned, and angry at the political restrictions on the war.<br><br>With the aid of his new bombardier, \"Tiger\" Cole, Jake decides to bomb an unauthorised target to vent his frustration at being forced to fight the war with one hand tied behind their backs.<br><br>There is quite a bit of original footage in this movie, which is really great to see..  a lot of more modern movies just plaguarise footage from earlier movies, which really detracts from them when you're going \"Hey! That shot was from Flight of the Intruder!\"<br><br>I give Flight of the Intruder a 10/10.  It's well made and very enjoyable.","user":"Ghosty-2","rank":[20,24]},{"title":"Good Flick","rating":26,"date":"26 July 2004","review":"Why would anyone watch this type of flick if they didn't want to see a war movie? I read the other review online and was dumbfounded. Rarely in war are their racy love scenes, that's why it's a ware movie! If anything, the fact that some scantily clad bimbo's weren't running all over the deck of an aircraft carrier in the middle of a war zone lent to the authenticity of the film. I mean really, what do you want Demi Moore in her \"A Few Good Men\" dress uniform? Please!!! (BTW... I liked that movie too.) This movie delivers exactly what an action adventure war buff wants to see. A lot of adrenalin laced action, big guns with big explosion, and the possibility of the main characters dying in the end. It was a good story and a good movie. Willam DeFoe was awesome. But a harlequin novel it's not. So if you're looking for a love story, check out \"An Officer and a Gentleman\", cause this is not for you.","user":"mmetzger32","rank":[24,30]}]