[{"title":"A perfect example of a movie being so bad it's good","rating":5,"date":"16 July 2008","review":"This is one of those movies that is very difficult to give a star rating because its high entertainment value is due to the fact that it's almost completely terrible.<br><br>A remake of the 1955 Humphry Bogart-Fredric March potboiler, DESPERATE HOURS is an unrelentingly bizarre piece of exploitation trash. There's virtually nothing \"good\" about it. The screenplay ranges from scattershot to just plain off-the-wall weird, the performances are some of the most over-the-top ever committed to film and the direction is borderline psychotic. Director Michael Cimino and producer Dino De Laurentiis once again prove that they are more capable than anyone else in the film industry of taking a potentially good idea and drowning it in excessiveness.<br><br>Mickey Rourke and Anthony Hopkins are both excellent actors. They are also actors who go from mannered to berserk very quickly. Both chew the scenery as if their lives depend on it. Mimi Rodgers is wooden even during emotionally intense scenes, Shawnee Smith is distraught before the home invaders show up and Lindsay Crouse is both wooden and over-the-top at the same time.<br><br>Kelly Lynch is the only actor who turns in even an appropriate performance, evoking a sense of hopelessness and panic from the start that makes you feel for her character, even if she has dug her own grave. This doesn't help a bewildering early scene in which her blouse spontaneously pops open to reveal her bare breasts make any more sense, however.<br><br>There are a lot of interesting plot and characterization ideas floating around the proceedings but none of them are ever fully developed. It reminds me of Cimino's HEAVEN'S GATE and De Laurentiis's DUNE, two similarly flawed but occasionally brilliant disasters which have grown better with age. Maybe with time, viewers will begin to see the tight, complex thriller struggling to break through the mess that is DESPERATE HOURS.<br><br>But all this analysis begs the question, would the movie have been more entertaining had it been put together more coherently? The answer is: probably not.","user":"squeezebox","rank":[27,30]},{"title":"Strangely Hypnotic","rating":8,"date":"9 July 2002","review":"A peculiar piece of entertainment, Michael Cimino's Desperate Hours feels rather odd for a number of reasons.  Not the least of which is the off kilter performance of Lindsay Crouse as the FBI agent from another galaxy. Was that lady weird or what?  I couldn't understand 50% of what she said throughout this very watchable mess of a movie.  Not surprisingly, Cimino's pacing is somehow frustrating and gripping at the same time. This aspect of his films seem to linger in my memory for awhile.  Fans of Kelly Lynch should realize that she's topless for much of her screen time.  Finally, I found the score to be very unique in flavor.  Most movies of this type have a dark, menacing soundtrack.  The music here is often lush,ethereal sentimental even.  Not much tension sustained, but this alternates nicely with the over the top performances of Rourke, Rogers and Hopkins.  All in all I think this an enjoyable flick for those looking for something slightly different in their suspense movie.","user":"cleather","rank":[27,34]},{"title":"Cimino: high on style. low on logic. form=content. go figure.","rating":29,"date":"29 July 2002","review":"I think on a certain level this film works quite well. First, throw out everything you know about the 1955 version. Next, abandon paying too much attention to how the plot progresses (gee, Kelly Lynch's character seems to disappear for extended periods of time, and it's amazing that the FBI ever found following her to be worth it. And she is supposed to be one of the smarter characters, but then again, you took what Lindsay Crouse's character said about her too seriously.) The film has a most curious tone, and just when you think it's going to turn into an art film, we get a shoot-em-up or some other plot contrivance to bring it back to earth. The soundtrack is a moody pastiche of 50's style orchestrations (no rock music!) and recalls moody post-noir thrillers of the late 50's-early 60's.<br><br>And what a fascinating line-up of players, performances, and characters. Kelly Lynch's acting directions must have been \"look snappy, especially topless, act like you just ingested a gram of cocaine, and all will go well.\" <br><br>One of these first years Cimino will put together all the pieces and come up with a really good, coherent film. For a really good obtuse film, reference Walter Hill's \"The Driver\" with Ryan O'Neal. <br><br>Oh, and if you ever thought you could mess with Lindsay Crouse, this film should dispel that notion. She's much badder than Mickey Rourke - and that's the biggest surprise of the whole picture! And with a lot less screen time, too. And by golly I guess Mickey Rourke's character is just an obsessive lover of the enigmatic Lynch. That explains a lot. <br><br>Coolest line in the film: FBI agent says to Crouse (after she got shot in the leg) : \"Where are you hit?\" Answer: \"In the ego.\"","user":"dmkuehn","rank":[15,18]}]