[{"title":"Big Jake and Dirty Harry: Same Writers!","rating":20,"date":"20 August 2003","review":"Some comments here have mentioned how much the Western \"Big Jake\" reminds them of \"Dirty Harry.\"   Actually, both films were written by the same screenwriters -- Harry and Rita Fink -- though additional writers were brought in on \"Dirty Harry.\"   Both films were developed and shot around the same time.  \"Big Jake\" came out in summer 1971, and \"Dirty Harry\" came out at Christmas 1971.   John Wayne said he was offered \"Dirty Harry\" before Eastwood took it (but Dirty Harry was also supposedly offered to Paul Newman, Frank Sinatra, Bill Cosby and Walter Matthau before Eastwood, too!)<br><br>The twice-repeated \"do you feel lucky?\" speech in \"Dirty Harry\" and the twice-repeated \"your fault, my fault, nobody's fault\" speech in \"Big Jake\" prove to me that the same writers worked on both scripts.<br><br>Also, Richard Boone must be singled out.  This powerful, amusing actor always made a great villain.  Wayne had tried to get him as the villain for several films before \"Big Jake\" (he'd done a cameo in \"The Alamo\"). Boone finally said \"yes\" to \"Big Jake\" and the verbal showdowns between Big John and Big Boone in \"Big Jake\" are a wonder to behold.<br><br>BTW, Boone turned down a lot of movie parts during the 70's (like the Robert Shaw part in \"The Sting\") but came to help out his old friend Wayne twice in that decade:  \"Big Jake\" and \"The Shootist\" (1976.)","user":"ecarle","rank":[53,62]},{"title":"\"No matter what else happens, no matter who gets killed I'm gonna blow your head off.\"","rating":7,"date":"19 July 2007","review":"There has been no tougher or more formidable Western heavy than Richard Boone He has occasionally depicted hard-bitten nobility, as his portrayal of General Sam Houston in \"The Alamo\" or the ageing cavalry officer in \"A Thunder of Drums\"but more often his grim, craggy features have led him to villainy <br><br>He was Randolph Scott's intelligent, embittered adversary, smooth as a rattlesnake and twice as treacherous, in the Tall T; he wrapped non-conforming farmers in barbed wire in Man Without a Star; as mean, sadistic Major Salinas, he persecuted Rory Calhoun in Way of a Gaucho; and he gave Paul Newman a rough ride in Hombre. In \"Big Jake,\" he wasas alwaysa powerful presence and one of the screen's most efficient scene-stealer <br><br>George Sherman's \"Big Jake\" was the Duke fifth and final film played opposite the lovely redheaded Maureen O'Hara who plays, here, his wife Martha McCandles <br><br>The movie opens in 1909 where nine men crossing the Rio Bravo into Texas Their leadera sadistic gunrunnerJohn Fain (Richard Boone) is ready for his bloody McCandles' raid where ten people were slaughtered and Big Jakes's grandson, the 8-year-old Little Jacob (Ethan Wayne) is kidnapped, and a ransom note is left demanding one million dollars in $20 Bills for Jacob's safe return <br><br>Marthaquite sure that this job requires an extremely harsh and special kind of man to attend it called back her husband, absent for many years, to pay the ransom, and take back home the little boy alive <br><br>Jacob McCandles (Wayne)who has never seen his grandsonresponds to his wife's call and organizes a hunting party to track down the dangerous and violent men <br><br>With his two sons, his faithful Indian scout (Bruce Cabot), his loyal dog, and with a large red strongbox packed to the back of a good mule, McCandles initiates his very daring hunt <br><br>There are some hard feelings among Wayne's resentful boys, and as the film progresses, Wayne's blue eyes were gentle and revealing a wonderful caring father but also his eyes turn to blue steel as he took that decision to get alive his grandson The heart of the film is Wayne interacting with his wife and what he has in store for his sons next...<br><br>Patrick Wayne plays Wayne's older son who is short on ears and long on mouth Christopher Mitchum rides a 'crazy bicycle,' carries a Bergman 1911, and a rifle with one fancy new telescope...<br><br>With great action scenes, great photography and with a terrific Elmer Bernstein musical score, \"Big Jake\" is one of Wayne best Westerns","user":"Nazi_Fighter_David","rank":[44,51]},{"title":"Violently Good","rating":7,"date":"19 August 2007","review":"From the outset 'Big Jake' will always be a firm favourite of mine, it's the first John Wayne movie I can recall watching, and this is the movie that has made him my all-time favourite movie star and actor.<br><br>The movie follows Dukes pursuit of seven kidnappers whom killed a large number of people at his former ranch (now run by his estranged wife) and kidnapped his grandson.<br><br>Up until this point in John Wayne's career he had by in large refrained from using excessive violence in his movies. However it could be argued and with some basis that movies such as 'True Grit', 'The Green Berets' and 'The Alamo' to name but three were physically violent in their own right. Regardless of this however 'Big Jake' was to be a dramatic departure for John Wayne due to the fact that on numerous occasions it give an honest depiction of physical violence. The opening shootout at the Candles ranch is a prime example of this, the sequence is extremely well executed by the director and stunt co-coordinators and there are many examples gunshot wounds which add to the realism of the movie.<br><br>The screenplay is rather slick with ample action included to satisfy audience expectations. The movie does contain many memorable scenes such as the opening and closing shootouts, Dukes casual killing of a would be assassin and some touching and at times volatile scenes involving Jake and his ex wife played eloquently by the great Maureen O'Hara.<br><br>An interesting segment at the start involves a voice-over retelling the transformation of the west from the early 1800's to its relatively civilised state in 1909 (when the film is set). The voice-over also introduces the audience to nine bandits whom act as the heavies in the movie, its fascinating to hear a brief introduction of each bandit and what skill they bring to the group e.g. Fain is the leader, O'Brien the gunfighter and John Goodfellow is proficient with a machete etc etc.<br><br>Duke in this movie is accompanied is his pursuit if the kidnappers by a trusted dog (who is very violent) an Indian friend played very well by Bruce Cabot, and his two on screen sons James (Patrick Wayne who is Dukes own son) and Michael (Chris Mitchum). The main protagonist in the movie is John Fain played superbly by Richard Boone and some of the scenes between him and John Wayne are very memorable containing both tension and style. John Wayne's youngest son John Ethan Wayne makes his debut in this movie playing the kidnapped grandson of Jake and acquits himself very impressively to the field of acting.<br><br>Despite my fondness for this movie it is not however without its weaknesses, for one the acting by both Patrick Wayne and Chris Mitchum is horrendous and neither one manages to endear the audience to their respective characters. Some sloppy direction also resulted in the disappearance of one of the Fain gang early in the movie, despite being given an introduction at the start of the movie; young Billy simply disappears without any explanation right at the beginning of the raid on the McCandles ranch. Several campfire scenes that are set at night appear much too bright; the director should have masked the lens on the camera more in order to ensure the scenes effectiveness. Finally several stunts involving Mitchum and a motorcycle come across as tired, overblown and generally dull although the director rightly erased the motorcycle from the movie quite early on much to the relief of the audience.<br><br>Critics were less than impressed with the movie stating that it was 'overly violent', these were the same critics who praised the Wild Bunch months earlier for being innovative and honest in its depiction of violence. Despite what he critics stated and some of the minor criticisms I have pointed out about this movie it remains a firm favourite and was a big box office hit when first released.","user":"knight_hawk2002","rank":[13,15]}]