[{"title":"Touching, intimate love story full of atmosphere and offbeat charm","rating":17,"date":"17 January 2004","review":"Robert Mitchum and Shirley MacLaine are well-cast in this engaging love story set in NYC and shot in gritty, atmospheric black and white.  Mitchum's wonderfully-modulated performance as a middle-aged lawyer on the rebound, and MacLaine's as the effervescent young dancer he becomes involved with, mesh very appealingly.  The Broadway-caliber dialogue is more sophisticated, and the emotional level more intimate, than the films the two were typically making at the time.  If \"The Grass is Greener\", a Mitchum (and Cary Grant and Deborah Kerr!) film from the same period and also an adaptation of a stage play, is a tepid example of how *not* to bring a play to the screen, \"Two for the Seesaw\" is a vibrant example of how to use film to endow a play with an intimacy that would be impossible to achieve onstage.  Major kudos to Mitchum, MacLaine, and the director, Robert Wise.","user":"Rogue-18","rank":[48,50]},{"title":"remarkable time capsule","rating":10,"date":"19 May 2007","review":"The post-beatnik / pre-hippie party scene is truly spectacular as a snapshot of a time/place rarely caught on film. While most of America was still living a black &amp; white Eisenhower existence, this film shows the cutting edge NYC scene that had already moved beyond bebop and Kerouac and was just about to stumble full tilt into the Warhol Factory. The party scene probably seemed about as weird to middle America as the alien bar scene in Star Wars, fifteen years later. But one kid in every high school across the country changed their plans to attend 'State' and filled out last minute applications to NYU; they knew that they would grow old waiting for that world to reach their hometown.<br><br>A little known treat for anyone into the early days of \"alt\".","user":"dedmedved","rank":[31,32]},{"title":"Surprisingly Great.","rating":10,"date":"6 October 2005","review":"I call this film surprisingly great not because I was shocked that Mitchum or MacLane delivered fine performances, it's surprisingly good because of everything else this film has... in addition to M&amp;M's delicious performances. I had no idea what to expect before watching this, just the way I like it. Because then I get the 5-10 minute rule to takeover -- either I'm hooked or I'm not.<br><br>Well it started right away. This thing was shot in B&amp;W anamorphic, and shot beautifully. The opening shots drew me in for their wide angles and good framing and nice dramatic lighting(ie what normal people call a good mood setter)... noirish in some respects. And then it sucked me right in.<br><br>Maybe because it started on the stage and the scenes were so long but the dialogue was so well crafted that you just had to pay attention.<br><br>Maybe the fantastic real life portrayals by M&amp;M - not straying nor betraying.<br><br>But I found myself constantly wanting to talk some sense into Jerry and Gittel -- ah thats what cinema is -- the desire to find out how it ends. And what an ending it is... I'll leave it at that.<br><br>I give it a 10 because it maybe is among the very best of this category - the \"realistic character dialogue romance featuring two very odd strangers (think Stewart and Novak in Vertigo)\". Shot well, acted well... kept me glued to the end. I give it 10 and not 9 because well, without spoiling it -- they didn't go where they could have gone. And I think that most audiences won't understand that final point once they see it. Thats a shame. But those who understand will agree - brilliance all around.<br><br>10 from me. And thats saying a HELLUVA lot.","user":"FlickersRULE","rank":[41,44]}]