[{"title":"Burt Goes In For Vice","rating":7,"date":"6 December 2007","review":"Sharky's Machine finds Burt Reynolds as a narcotics cop who after a failed buy and bust that wasn't his fault, but that got a few people killed in it, he finds himself demoted to the vice squad in Atlanta.<br><br>The prestige is hardly as good as the narcotics beat, but it does have its fringe benefits. One night after a roundup of working girls where one of their books falls into their hands, the guys ask for surveillance on Rachel Ward's place. She's an expensive item, servicing both notorious mobster Vittorio Gassman and law and order gubernatorial candidate Earl Holliman.<br><br>Their surveillance however records a murder and the rest of the film is Sharky and his new colleagues from vice trying to solve this prestige case.<br><br>Though it's a Burt Reynolds film and those usually have some humor to them, the comedy is kept in check as the film turns as deadly serious as Dirty Harry. It was reported in fact that Clint Eastwood was offered this film.<br><br>Look for some good performances by fellow vice cops Bernie Casey and Brian Keith and by Henry Silva the coked up brother of Gassman who does the dirty work of the organization and loves his job.<br><br>It's not a bad film, a mixture of Dirty Harry and Laura. Why Laura? You'll have to see Sharky's Machine for that answer.","user":"bkoganbing","rank":[18,19]},{"title":"Arguably Burt's best.","rating":7,"date":"21 June 2001","review":"I haven't seen every single movie that Burt Reynolds has ever made, but this one (which I've just finished watching, for the third time) may very well be his best! It suffers only from some slow stretches; Burt perhaps tried to make it more \"arty\" than it should have been. On the other hand, he managed to avoid many of the usual cliches in the presentation of the \"tough cop\" role he plays (notice, for example, the scene in which he attempts to kiss Rachel Ward for the first time, or the fear he expresses just before the final showdown with the indestructible Henry Silva). In fact, Silva and those two ninja assassins are three of the most memorable villains of cop thrillers of the 80s. The film also has some offbeat touches, a surprising amount of humor, a brutal and gripping fistfight and many well-directed shots.    (***)","user":"gridoon","rank":[29,33]},{"title":"Ah, you'll die all right!","rating":6,"date":"11 December 2007","review":"I like Burt Reynolds (Boogie Nights) playing a cop, and he didn't do too bad as a director here either.<br><br>He had a great supporting cast of cops and criminals: Vittorio Gassman makes a great crime boss; Henry Silva (Ghost Dog: The Way of the Samurai) makes a great psychopath; Brian Keith (\"Family Affair\"), Charles Durning (The Best Little Whorehouse in Texas), Bernie Casey, and Richard Libertini (A Grandpa for Christmas) all make great partners; and, there is, of course, Rachel Ward (\"The Thorn Birds\"), who got a Golden Globe nomination out of her performance.<br><br>Lots of action, superb performances, and a great story.","user":"lastliberal","rank":[15,16]}]