[{"title":"Simple and Touching Story","rating":9,"date":"7 July 2005","review":"Milos Forman's \"Loves of a Blonde\" which he made in Czechoslovakia in 1965 way before \"Cuckoo Nest\" and \"Amadeus\" tells a very simple bitter-sweet tale about a teenaged girl who works in a shoe factory in a small town. With sixteen girls to one man - her chances to find a man of her dreams were not very high. One evening, she meets an attractive and young piano player who tells her about Prague and compares her to a guitar that could've been painted by Picasso. After they spend the night together, he leaves and she travels to Prague to find him. The film has been one of my favorites for many years and my opinion did not change after I saw it again a week ago - funny, sad, tender, and realistic film about searching for love, broken promises, shattered hearts, and universality of hope.","user":"Galina_movie_fan","rank":[41,47]},{"title":"In a class by itself","rating":10,"date":"19 January 2005","review":"I don't think I've ever seen a movie that so faithfully captured the sense of place. I spent many months in the mid-60's in Czechoslovakia and Eastern Europe, and when I recently saw this film, it brought tears of nostalgia to my eyes. The scene in the parents' house, when the family was faced with the arrival of the unexpected stranger, is documentary in its portrayal of how a household would look in those times, complete to the smallest details of housekeeping and behavior. It is light-hearted without being slapstick, and it is poignant without being corny. Every character is right on the mark. On my very very short list of the greatest movies ever. In short, it is perfect. See this film, and take the whole family.","user":"jtur88","rank":[35,42]},{"title":"Gentle, Winning Czech New Wave Romance","rating":8,"date":"17 May 2005","review":"\"Loves of A Blonde\" is a catchy, racy title for what is actually a gentle,low-key and affectionate look at a love affair in communist Czechoslovakia in the mid-60's. The film concerns a young (yes, blonde)girl who seems to be the prettiest one working in what looks like an extremely bleak factory setting in northern Czechoslovakia. The female workers in this shoe factory seem to far outnumber the males of the town. A band travels through town to play at a weekend dance, and the titled blonde (maybe its just me, but I think she resembles Reese Witherspoon a lot at various times)takes up with the piano player. Complications ensue.<br><br>There are a number of sweetly comic moments in the film, and it has a great deal of affection for its various characters. Its not all laughs, though, as there is a melancholy undertow to all that goes on. The portrait of Czech society seems decidedly bleak...ugly towns, dreary jobs, precious little fun. The ending is rather ambiguous, but I felt it to be definitely more downbeat than upbeat. You smile, but I felt sad afterward - a feeling rather common after a youthful love affair, I suppose.","user":"FANatic-10","rank":[25,30]}]