[{"title":"80s suspense film about a gigolo.","rating":7,"date":"6 November 2010","review":"Giorgio Moroder's signature synths followed by Deborah Harry's instantly recognisable new wave classic, Call Me, opens up American Gigolo as we see a pretty suave 80s Richard Gere in a black Cadilliac driving along the beachside. Gere has all the trappings of a wealthy 80s lifestyle so usually romanticised in a Bruckheimer production but the film establishes in its first few scenes that Gere is pretty much a buck for hire with little sway over his Aryan madam. This form of bait and switch appears throughout the movie, with Gere appearing in control and pretty cool at first and then as a total whore. The dichotomy between these two personas plays a big part of the film's plot as Julian K., Gere, becomes entangled in a murder investigation of a trick who is the wife to a wealthy S&amp;M aficionado and learns that he should question the many friendships he's procured during his career as a loverboy. Lauren Hutton plays a random woman that Gere meets and develops into the film's love interest after one of the most minimalist sex scenes in an 80s film. The set production, music, acting and story is all very connotative of the eighties. Apartments are gray or salmon coloured with minimalist artwork and expensive vases and silver blocky stereo systems - it's clear with some scenes, including one where Gere hangs upside down to do some crunches, that the set design heavily influenced the mise-en-scene of Mary Harron's adaptation of American Psycho. Moroder's various compositions of Blondie's Call Me highlight the continuing descent of Julian k. as the chorus becomes more melancholic and ominous - it's all very suspenseful from an eighties perspective. Some may find the final scenes slightly ridiculous and most likely unrealistic, but one should remember that American Gigolo was produced by Jerry Bruckheimer and even on the tail end of New Hollywood, the film does show caution in its dark themes as not to alienate mainstream audiences. I definitely felt the material was pretty subdued for a film written and directed by Taxi Driver's Paul Schrader. However, it doesn't matter as the film is effective as a time capsule of the seedier side of the eighties.","user":"TheSteelHelmetReturns","rank":[16,16]},{"title":"A Stylish Morality Play","rating":7,"date":"12 May 1999","review":"Richard Gere is perfectly cast in the role of decadent but vulnerable male gigolo cum prostitute who is framed for a murder he didn't commit. His emotional entanglement with a married woman (Lauren Hutton) is believable, but the film is above all a dissection of the emptiness of the kind of stylish materialism which was to become such a hallmark of cosmopolitan lifestyle in the 80's. Like many such morality tales, though, the superficial attractiveness of the 'style' as a way of life is liable to lead some to embrace rather than reject it as a way of bringing excitement into their lives. In any event, a stylish piece of cinema.","user":"Paul-250","rank":[65,73]},{"title":"Stylish & Surprisingly Touching","rating":8,"date":"14 January 2014","review":"This incredibly stylish movie that did so much for both Richard Gere and Giorgio Armani initially seems to celebrate materialism and equate it with success and fulfilment. Gere's character dresses in designer clothes, drives a Mercedes and spends his time mixing with conspicuously wealthy people in Los Angeles. He's seen in expensive restaurants, exclusive country clubs and posh hotels but gradually it becomes evident that there's an emotional emptiness in his life which becomes even more pronounced when he's accused of murder and has to face the prospect of losing everything. Unexpectedly, what follows is a story that illustrates how genuine love (that leads to redemption) can develop in even the most unpromising of circumstances.<br><br>Julian Kaye (Richard Gere) is a male escort who's handsome, charming and very good at his job. He speaks five or six languages, lives in a luxurious apartment and is very accomplished at attending to the needs of the affluent older women who pay him very well for his services. Most of his introductions are provided by Anne (Nina van Pallandt) who taught him everything he needed to know to be successful in his business but despite all that she's done for him, he's disrespectful to her and treats her unfairly in their financial dealings.<br><br>In the course of his work, Julian introduces himself to a politician's wife called Michelle Stratton (Lauren Hutton) at a hotel bar but her reactions lead him to believe that he'd made a misjudgement and that she had no interest in becoming one of his clients. Later, however, she contacts him and they get to know each other better. Julian's problems begin after he's directed to a client in Palm Springs by a down-market pimp called Leon (Bill Duke) because a short time later, she's found dead and Julian becomes the prime suspect.<br><br>Police Detective Sunday (Hector Elizondo) is assigned to the case and firmly believes that Julian is the killer. Suddenly, Julian finds himself in a position where he's unable to provide an alibi because the nature of his work means that discretion is vital but also his rich clients start deserting him at a rapid speed. Although it's obvious to him that he's been framed, Julian doesn't know who's set him up and so his efforts to prove his innocence become increasingly desperate as he can see no way out of his predicament.<br><br>The plot in \"American Gigolo\" is almost of secondary importance to the relationship that develops between Julian and Michelle and the surprising way in which their affair enriches both their lives. Julian's journey from being a conceited, selfish and superficial person is remarkable and is seen to take place very gradually as the loneliness that both he and Michelle had previously experienced is replaced by something far more meaningful and substantial. Richard Gere and Lauren Hutton are marvellous in their roles as they evolve so subtly from the awkwardness of their first meeting and find so much more in each other that they could ever have imagined was possible. Nina van Pallandt, Bill Duke and Hector Elizondo are also superb in their supporting roles.<br><br>\"American Gigolo\" is a work of greater depth than it might appear to be on first viewing and is strongly enhanced by its wonderful visual style and the music of Blondie and Smokey Robinson &amp; The Miracles.","user":"seymourblack-1","rank":[13,13]}]