[{"title":"William Manchester notwithstanding","rating":13,"date":"13 March 2005","review":"I remember seeing this film as a child and wondering if combat looked as antiseptic as it does in Sands of Iwo Jima, then the Japanese soldiers dropped into a foxhole of Marines and started bayoneting them. The scene still frightens me, regardless of how many times I've seen Saving Private Ryan or Band of Brothers.<br><br>The great William Manchester wrote about being a Marine in the Pacific in his memoir Goodbye, Darkness. He talked about how phony the movie was, how John Wayne-ish and Hollywoodized it portrayed the sort of in-your-face combat he experienced. He and a friend were thrown out of a theater for laughing so hard at the histrionics and the clichés.<br><br>Yet, the average viewer would be hard-pressed not to feel for John Wayne's broken, alcoholic Marine non-com, and the squad he commands. The best moment of the film isn't the tragic, inevitable ending, but Wayne's discovery that his love interest is just as damaged and as hurt as he is.<br><br>With that in mind--and William Manchester notwithstanding--this is more than just a war movie, and that's why it's so good.","user":"inspectors71","rank":[26,29]},{"title":"Classic war film with a magnificent John Wayne as tough sergeant fighting Japanese","rating":7,"date":"22 November 2007","review":"This is a flag-waging and patriotic tribute to US marines .Very decent war scenes along with documentary footage that convey us the assault troops establish on the Pacific islands, but like the navy, the US army fought its way from island to island in the Pacific. Striker(Wayne) and his squad(Forrest Tucker, John Agar,James Brown,Richard Jaeckel,James Brown,Richard Webb, among others) are responsible for the capture of the Pacific islands. And, of course, the picture brings to life one of the most famous images of the Second World war- Joe Rosenthal's photograph of US marines raising the flag at Iwo Jima, on the morning of February 23, 1945 and with special appearance of the three living survivors of the historic flag raising of Mount Suribachi. John Wayne is top-notch as valiant but deranged sergeant Striker training rebellious recruits and soldiers in this believable war film . Wayne won his only Oscar nomination, before his obtaining in ¨True grit¨. Supporting cast is frankly magnificent. The motion picture is well directed by Allan Dawn.<br><br>The film is based correctly on Iwo Jima battle in a hard-fought US operation, one of the most difficult campaigns of the Pacific theater . US capture of Japanese-held island in the Bonin group , about 1450 km south of Tokyo after intense fighting Feb-March 1945. Fortified by the Japanese, it held two airfields, with a third under construction, and was a valuable strategic target for US forces as it would provide a base for land-based bombers to raid the mainland of Japan. It was assaulted by US Marines 19 Feb 1945 after a prolonged air and naval bombardment. The 22000 Japanese troops put up a fanatical resistance but the island was finally secured 16 March. US casualties came to 6891 killed and 18700 wounded, while only 212 of the Japanese garrison survived.The film is dedicated to the United States Marine Corps whose exploits and valor have left a lasting impression on the world and in the hearts of their countrymen . Appreciation is gratefully acknowledged for their assistance and participation which made this picture possible.","user":"ma-cortes","rank":[27,33]},{"title":"The first film I remember","rating":10,"date":"19 February 2006","review":"I first saw this film at the age of 5 and it has been my favourite ever since. This led to my following of the greatest actor of all time JOHN WAYNE. The film follows Sgt John M Stryker, taking a platoon of mostly raw recruits and training them to be mean, tough, and ready for anything Marines, by any way possible, loathed by the squad but by the end of the picture admired by them as they realise what and why he is the way he is.<br><br>The film mixes battle scenes with actual footage from the landings and allows for character development instead of just a bunch of guy's grouped together. Wayne deserved his Oscar nomination for his role but you cant leave out the supporting cast. John Agar in possibly his best role and Forrest Tucker as his old adversary also Cassell/Brown and Webb proving equally up to the rolls and a young Richard Jaeckel all playing there parts with zest.<br><br>When you look at the events it was based on, the Island hopping of hard bitter fighting the slaughter of both sides on Iwo Jima its self 4,000+ U.S. casualties and 21,000 Japanise you can see why this film is compulsory viewing for all new Marine recruits.<br><br>I also believe that this film would have been a masterpiece had it been made without the restrictions of the time compared with the films of today like \"Saving Private Ryan\".<br><br>Whatever your own thoughts are on the film when you next watch it just remember those who fought there and REMAIN there................","user":"sadsack-dw","rank":[35,44]}]