[{"title":"Is there a word for 'fear of finding skulls in unusual places'?","rating":8,"date":"20 January 2000","review":"I *love* this movie. It terrified me deliciously on late-night TV when I was 12 or so, and when I discovered it on video in recent years I found it just as enjoyable as I remembered. [I admit that I no longer have to whip back the sheets to reassure myself that there's no skull in the bed, but as a kid I enjoyed several highly dramatic bedtimes because of \"The Screaming Skull\"...]<br><br>And the ghost in the greenhouse (plus funky theme music) still strikes me as a standout spook clip. Over the top? Maybe - but if a horror movie can't be over the top, what can?","user":"GoryDetails","rank":[22,23]},{"title":"Remember when people used to like movies?","rating":8,"date":"14 June 2002","review":"Some of these reviews are far more inept than the film the \"insightful\" film lovers are critiquing. Comments about a lack of gore and such are pretty telling as to the age and tastes of those who hate this flick so passionately.<br><br>The Screaming Skull is a creepy, atmospheric tale that relies on mood rather than effects to generate chills. It won't scare the pants off anyone, but it is suitably creepy for late night viewing. It's also wonderfully fun, in the typical 50s b-movie vein. A soap opera plot infused with horror elements. Classic AIP! One of my all-time favorite \"bad\" movies.","user":"salv0303","rank":[43,50]},{"title":"I STILL love this film!","rating":7,"date":"20 February 2005","review":"Where I don't expect todays audience,esp kids to find this scary or entertaining(they require more blood &amp; gore &amp; now nudity),this is still a great 50's horror flick that relies more on the psychological rather than on the explicit. I still remember having dreams of seeing that skull on my bedroom wall! Now I have just as more fun watching this again as I do \"The House On Haunted Hill\". The atmosphere &amp; music is still very effective. And the acting is very good. Its wonderful to see william Hudson play another scheming husband only to finally get his comeuppance. The director of the film(forgot his name already) does the difficult job of both acting &amp; directing. I'm never forget when I first saw the images of the grave site &amp; that skull rolling across the lawn! For those who haven't seen it give it a chance! And watch some other 50's/early 60's horror flicks like \"House On Haunted Hill\" &amp; \"Horror Hotel\" as a mini introduction of what you're in for!","user":"windycitylady60614","rank":[16,17]}]