[{"title":"Matthau and Lemmon work effortlessly together","rating":8,"date":"29 November 2003","review":"One of these days I am going to watch a bad Billy Wilder movie...so far I have not even come close. Each year we observe the passing of great talents (this year, 2003 has seen an extrordinary number of death), I begin to realize we will never again see the likes of Lemmon and Matthau who passed away in 2000 and 1999 respectively. These two are great actors in comedic or serious roles. Matthau's sleazy lawyer is played just right, not too over the top and Lemmon plays the victim in this movie who is basically going along for the ride. As the movie progresses Lemmon gets further disenchanted with the pending cash settlement for his fake injuries and in his own inimitable way blows the whistle on his brother-in-law, Whiplash Willie (Matthau.) I found Wilder's use of Cliff Ormond and Noam Pitlik as the bumbling private eye surveillance team to be reminiscent of Jackie Gleason and Art Carney on the Honeymooners, or even a latter day type of slapstick in the style of Abbot and Costello. Also, the supporting role of Boom Boom the Cleveland Browns running back who accidentally injures Lemmon on the sideline at a game was played with depth. All in all another wonderful treat this movie is to watch.","user":"sapblatt","rank":[21,24]},{"title":"The First Successful Comedy Teaming For Movies Since Martin and Lewis: A Possible Suggestion on Origins","rating":7,"date":"16 June 2005","review":"When THE FORTUNE COOKIE came out in 1965 it proved a remarkably successful comedy. Of course it was directed by Billy Wilder, still at or near the height of his film career with a string of great successes from THE MAJOR AND THE MINOR, THE LOST WEEKEND, and SUNSET BOULDVARD through SOME LIKE IT HOT and THE APARTMENT. Of course there had been less successful films for Wilder, most notably THE EMPEROR WALTZ and THE BIG CARNIVAL, but most of his films were widely respected by critics and the public. And when he made it in 1965 it was to star Jack Lemmon, who had demonstrated his comic qualities in three other Wilder films: SOME LIKE IT HOT, THE APARTMENT, and IRMA LA DOUCE. So the public was quite interested in this film, which was to tear into the American habit of suing for injuries, and into shyster lawyers. In fact, the screenplay was originally supposed to be MEET WHIPLASH WILLY, the final name of the film when shown in England.<br><br>What surprised many people was the casting of Walter Matthau as \"Whiplash Willie\" Gingrich, the shyster brother-in-law to Lemmon's Harry Hinkle. Matthau was a widely respected actor, with great stage experience, but his performances in movies had been mostly as villains. From the whip happy tavern keeper in THE KENTUCKIAN, to the Machiavellian government adviser in FAIL SAFE Matthau usually played unlikeable sorts. There were some exceptions. In A FACE IN THE CROWD he is one of the television people who assist Lonesome Rhodes (Andy Griffith) on his way up, but who are appalled at the monster they create. When, at the end of the film, Griffith is starting to think of how to overcome the huge gaffe he created over the airwaves that have sent his career into the dumpster, it is Matthau (a terrific figure of decency here) who tells Griffith that he won't be coming back, but will be lucky to be remembered in a few years as a has-been. But A FACE IN THE CROWD was a rarity for Matthau. If he played comedy it was as a villain, most chillingly in CHARADES as Mr. Bartholemew. In his scenes as an embassy official he had some good comic bits, like when he offers a cigarette to Audrey Hepburn, and she takes two puffs and puts it out - Matthau is put out by this waste of one of his pricey cigarettes!<br><br>It is Matthau's appearance in THE FORTUNE COOKIE that changed his public persona and his career. He went to town as Whiplash Willy, threatening to sue the United Fruit Company for failing to put a printed warning on their bananas after Howard McNear fell and broke his pelvis tripping on one. His careful manipulation of brother-in-law Lemmon/Hinkle, his calculating in how to force a major law firm to surrender unconditionally in his demands, his snide comments about great lawyers of the past (Lincoln, Darrow), all build up a to a great introductory performance. It really showed the Matthau that the public would grow to know - a cynical type who could make others (especially the more decent Lemmon) do what he wanted them to. He would also be quick to get into deeply pseudo-intellectual speeches, voicing his opinions and points of views. It was the Matthau who would entertain movie audiences for the next three decades. As a sign of his success in finding his persona, Matthau won the Best Supporting Oscar for THE FORTUNE COOKIE.<br><br>Lemmon recommended Matthau to Wilder, who was pushing either Frank Sinatra or Jackie Gleason. It is quite hard to imagine either the Chairman of the Board or the Great One as effective as Matthau. But I have long wondered if Wilder and Lemmon had had someone else in mind, someone who was no longer available. The Hinkle - Gingrich relationship was a close one due to their family relationship, and Wilder certainly had discussed the issue of the casting with Lemmon. Up to 1961, Lemmon had appeared, most often, with one actor in the movies - in comedies. He appeared in BELL, BOOK, and CANDLE, IT STARTED WITH JANE, and OPERATION MAD BALL with his close friend Ernie Kovacs. Lemmon had been so close to Kovacs that he appeared (in the disguise of a monkey suit) as one of the Nairobi Trio. There are some lines in THE FORTUNE COOKIE that sound ready made for Kovacs - for example, when he writes a figure down as a settlement figure, and when the other lawyers make their counter-offers Matthau repeats it each time, looks at the paper, and says, very quietly, \"That isn't it!\" One can easily see Kovacs saying the same thing the same way.<br><br>If, as I suspect, THE FORTUNE COOKIE was an idea of Wilder's and Diamond's for a few years, it is just possible that Lemmon suggested Kovacs for the role of Gingrich. But after Kovacs died in a car accident in 1962, Lemmon had to find another actor of similar type. And then he noticed Matthau, who in 1965 was well received for his performance in THE ODD COUPLE on Broadway. Kovacs' bad luck may very well have been Matthau's good luck.<br><br>Today we think of the Lemmon-Matthau partnership as really based on their films with Wilder. They did four films with Wilder, but after THE FORTUNE COOKIE it was their joint appearance in the film version of THE ODD COUPLE directed by Gene Saks that made the partnership viable. Otherwise it might have seemed a flash in the pan. THE ODD COUPLE was to prove that the chemistry between the actors did not solely defend on the artistry of Wilder.","user":"theowinthrop","rank":[31,37]},{"title":"Fun to watch for the first time","rating":8,"date":"5 December 2003","review":"Finally caught it on TCM yesterday, and was able to watch it \"fresh,\" compared to \"The Odd Couple\" or \"The Front Page,\" which one might already know all about.<br><br>A fine study in contrasts at work here; Matthau, as the shyster lawyer has something resembling a family life, while Lemmon, ostensibly the nice guy, is shown to be very lonely, still stuck in the apartment his wife left him in (and aren't those exteriors filmed in Cleveland? I don't think those buildings on his street were seen in any other Hollywood backlot, and they looked a touch more shabby than ordinary). So we have \"Boom Boom\" as the real moral center of the movie. He's racked with guilt over having injured Hinkle (Lemmon), so much so that he sees to Hinkle's recovery, even carrying him around like a wounded puppy, letting his game suffer, and he's the one who's most hurt by the scam.<br><br>\nThe movie also shows a hopeful light on race relations in the mid-60's: Ron Rich gets to play a character with some feelings and some ambition beyond the NFL, and it's he and Lemmon's characters who become buddies at the end.","user":"Mark_McD","rank":[31,37]}]