[{"title":"\"Bad Man from Red Butte\" Provides an Okay Time","rating":6,"date":"11 January 2020","review":"It will help to enjoy and appreciate \"Bad Man from Red Butte\" if one is already a fan of B-westerns, for the many coincidental chance meetings and not-fully explained relationships can only be accepted if one comes from a place of patient tolerance. The story is fun and is one which allows Johnny Mack Brown to play two parts, one bad (more or less) and one good. There are films of the genre which are anachronistically set in contemporary times, but this one is not clear on that score, not sure whether intentional or not... almost everything points to 1880 or so, but there are scenes here where the town's womenfolk are out and about wobbling along the town's dirt main street and on raised wooden sidewalks in high heels and other fine garb of 1940. Like I say, one must be tolerant. This is a minor movie to be sure, but the many interesting faces and characters make it a fun parade nonetheless. Prolific bad man Roy Barcroft appears in one of his relatively early western villain roles, showing off a fairly slender self! One somewhat unusual element is that JMB has two what could be called sidekicks, one played fairly straight (in the talent of Bob Baker), who really doesn't do much, and the other being a more comedy reliever type (Fuzzy Knight). The film is structurally well-put together, however, and if one just lets it flow without thinking too much it will probably be an enjoyable ride.","user":"glennstenb","rank":[1,1]},{"title":"A deep dark secret","rating":6,"date":"16 November 2016","review":"In Bad Man From Red Butte Johnny Mack Brown plays the dual role of surveyor and gunfighter. The surveyor carries the knowledge that he has a twin brother who is a notorious gunman as a deep dark secret. It only comes out after surveyor Brown is accused of killing rancher Lafe McKee. Of course the killing was ordered by the real villain of the story Norman Willis.<br><br>Surveyor Brown arrives with his sidekicks, Bob Baker who is a singing lawyer and has plans to hang up a shingle and practice law. But he's soon involved in the politics of the town. Good thing he's a cowboy singer, he brings his own entertainment to rallies. There's also Fuzzy Knight who is his own entertainment and he's looking to sell hair tonic with a kick to it.<br><br>The action keeps nicely moving in this Johnny Mack Brown western. Fans of the B western should be pleased.","user":"bkoganbing","rank":[1,1]},{"title":"Disappointing Series Western!","rating":4,"date":"19 October 2003","review":"\"Bad Man From Red Butte\" (there's another one of those \"B\" western titles) is a disappointing entry in the long running Universal Johnny Mack Brown series turned out in the early forties. This one is one of the so-called \"trio westerns\" made to compete with the popular \"Three Mesquiteers\" series from Republic.<br><br>The script pulls this one down in spite of the excellent cast and superior production values. Even Brown playing a dual role fails to save it. Most o f it just doesn't make much sense.<br><br>The story starts out with grizzled gunman Gils Brady (omigod its Johnny) shooting it out with town boss Benson (Norman Willis) and his henchmen led by Roy Barcroft and Earle Hodgins. The reasons for this difference of opinion are never explained. Brady is wounded and takes refuge in that ever present line shack.<br><br>Into the picture ride our heroes Buck Halliday (Brown again), Gabe Hornsby (Bob Baker) and Spud Jenkins (Fuzzy Knight). Gabe is going to open a law practice, Spud is selling his \"magic\" hair restorer and Buck is to survey for a new stage coach line. He also gets confused with the fugitive Brady. Some town folk think he's Brady, while others are seemingly oblivious to the similarity. School marm Tibby Mason (Anne Gwynne) arrives in town and apparently becomes Buck's love interest (in a \"B\" series western?). We know this because they announce their engagement at the end of the story. Baker, Knight and Texas Jim Lewis and the Lone Star Cowboys each get to warble a forgettable song.<br><br>Anyway, downtrodden rancher Dan Todhunter (Lafe McKee) along with his young grandson Skip (Bill Cody Jr.) are about to lose their ranch to Benson. Buck arranges a loan with the bank to bail them out. When Benson learns of this, he sends his henchies out to murder him. You see, the stage line Buck is surveying will run through, you guessed it, Todhunter's ranch.<br><br>Along the way, Buck just happens to come upon the cabin where Brady is hiding. Well, it turns out that we have another case of good twin, bad twin a concept which is never really developed (i.e. no showdown or fight to the finish). We never really find out why the two went their separate ways. Oh well. And, in the midst of all of this, Buck manages to call a snap election to elect Gabe as the new Justice of the Peace. Johnny and the boys finally bring Benson and his cronies to justice as we knew they would.<br><br>Brown was a better actor than many of his contemporaries. This is evident in the scene between the two brothers. Starting out as an \"A\" list player at MGM in the 20s, Brown settled into a long and prosperous career as a series western star that lated well into the 1950s. Baker had just wound up his own series at Universal but adds little to this film. Knight also enjoyed a long career as comedy relief alternating between \"A\" and \"B\" westerns.","user":"bsmith5552","rank":[2,6]}]