[{"title":"If you view it as a comedy it actually works...","rating":7,"date":"1 December 2005","review":"The premise of the story is common enough; average family wants out of the rat race; wants to find the simple life....so they move from Sherman Oaks,California to Lake Tomahawk; kids in tow.<br><br>The lake is beautiful, they have leased an old house....but wait; there may be something in the lake; people are being murdered, and no one knows how (never mind why). Gerald McRaney is excellent, a familiar face for Lifetime viewers; Valerie Harper is also good; since this film was made in '88 maybe the writer should produce a sequel!.<br><br>You will also enjoy Barry Corbin as the town eccentric, and Darryl Anderson as a Bruce Dern-lookalike/crazed military man.<br><br>While the story plot is a bit over the top; if you are a movie buff you will be reminded of similar scenarios from \"\"Psycho\"\"; \"\"Deliverance\"\"; as well as other horror stories of that genre. Several camera shots and sequences will give you a sense of deja vu.<br><br>Sit back and enjoy; if you don't take it too seriously it is very entertaining; and better than, for example the more recent movie:<br><br>\"\"I Know What You Did Last Summer\"\"; it seems they made better movies in the good old 80's!.","user":"MarieGabrielle","rank":[12,12]},{"title":"Good old fashioned hokum!!!","rating":10,"date":"23 October 2001","review":"This Is one of those classic American made for TV movies that are just made for watching on a rainy afternoon. Although the script is highly implausible it never takes itself too seriously and neither do the cast which leads to a great tongue in cheek murder mystery / horror film best enjoyed with a bid bag of popcorn or box of chocolates. A big bonus of this film is the fantastic location filming and despite the strange goings on and even stranger residents round Lake Tommahawk I for one would not mind living there!<br><br>All in all a great film to watch over and over again.","user":"yankee1924","rank":[9,9]},{"title":"Creepy","rating":5,"date":"30 October 2002","review":"This movie for the most part is just like your normal TV movie. Not incredible acting and for being in the horror genre it would have flopped at the box office, but hey, that's why it's on TV. When I first started watching this movie I never had the intention of finishing it. I left the room a couple times to go do something else but found myself always coming back, wondering, who was it? What was going on? The only complaint I have is that there weren't enough characters to suspect. The creepy factor was great though. I was creeped out the whole time and I was a little fascinated too. I wouldn't fight to see it again but I don't regret sitting there for the amount of time it took to watch it.","user":"elena1999","rank":[8,9]}]