[{"title":"Monroe fans will want to see this","rating":27,"date":"27 May 2001","review":"What's interesting about this movie is that it's so disturbing. Considered a minor film in Monroe's canon, it's uncomfortable to watch now that we're so saturated with information about her unhappy life. She plays a woman who's had a nervous breakdown because she tried to escape a miserable family life by falling for a young fighter pilot. They had sex in a hotel before marriage, then he went away and got killed in the war and she tried to slash her wrists. So her folks put her away in a funny farm, and now she's come out to live in the city with her uncle, who reminds her of her unsympathetic, impatient parents. That's dark territory for Monroe, and you can't help wondering what she thought of the role. In any case, it's rather uncanny to watch her breaking down. She abuses the girl she is babysitting by tying her up, and at one point she says tellingly about the crying girl \"They stop if you ignore them.\" We are left to conclude that this is how she herself has been treated. In a later speech to the girl, she identifies herself and her goals with the girl and her goals. \"We can all get what we want and live happily ever after, understand?\" But she does not play a psychopath, as her role is so often described. In the opinion of Widmark, whose character matures and deepens through his encounter with her, she's just a mixed-up girl who \"would never have hurt that kid.\" Although Widmark has a soberly happy ending, Monroe does not.","user":"michael.e.barrett","rank":[60,61]},{"title":"The Babysitter and the Flyer","rating":7,"date":"5 December 2001","review":"This is an odd film, if only for its credits. It was written by Daniel Taradash, a first-rate screenwriter who the next year would write the screenplay for From Here To Eternity. The director, Englishman Roy Ward Baker, had a varied and eclectic career, mostly in his native country, where he directed, among other films, A Night To Remember and Quatermass and the Pit. Screen sexpot Marilyn Monroe plays a psychotic babysitter who encounters a tough-minded and cynical airline pilot and causes him to change his outlook. Miss Monroe was not known for doing drama, which she plays here, in black and white no less, and is excellent. But that this was one of her first starring roles she seems a peculiar choice to play the troubled young woman. Richard Widmark, often a bad guy, is here only partly bad, and is proficient but rather dull and, for him, colorless. Dramatic actress Anne Bancroft plays a singer, and Widmark's girl, a role one might have expected Marilyn to play. And so it goes. <br><br>The movie is compelling, if never really entertaining, and seems at times as confused as Monroe's babysitter as to what sort of film it wants to be. It is a bit of a psychological drama, a bit of a thriller. filmed like a noir, studio-bound, which makes it also unrealistic, it is in many respects a mess, but a watchable one. The central set of the hotel in which nearly all the action takes place, is impressive, as are the various characters who either live, visit or work there, who at times seem like inhabitants of an enormous cave or reef, and as such denizens of the place rather than employees or guests. There is a nice sense of how dull night life can be in the heart of a supposedly exciting city (New York). There are no especially good or bad people in the film; just those who understand Monroe's plight, and empathize with her, and those that don't. Young Marilyn more than rises to the dramatic occasion, however, and gives a fine performance, far more worthy than the script, and more animated than her co-stars, and in the end steals the film and our hearts.","user":"telegonus","rank":[56,62]},{"title":"Don't tell mom the babysitter is NUTS","rating":7,"date":"29 July 2005","review":"Marilyn Monroe and Richard Widmark star in this early Monroe star vehicle. This is one film you'd never see being made today, due to the new child-care sensibilities. Jim Backus and Lorene Tuttle leave their child with a complete stranger while they go out for an evening. The stranger is Monroe, complete with wrist scars, who is the niece of the elevator man in the hotel where the couple is staying. Mid-evening, she picks up with Widmark, who is more upset about his lounge singer girlfriend (Anne Bancroft) breaking up with him than he thought he would be - he and Monroe flirt from their respective rooms. Widmark goes to the room, expecting a night of fun. Instead he and the hapless child get a night of terror, with Monroe believing Widmark is her dead pilot boyfriend and nearly killing not only the little girl but her uncle as well. Turns out, Marilyn's been institutionalized and her uncle (Elisha Cooke, Jr.) thought she was \"nearly well.\" Monroe is very good in this - very beautiful, of course, as well as vulnerable and believable. The wild look in her eyes when she scolds the little girl is downright scary. One thing that has always bothered me about Monroe doing drama is her very excellent diction which always sounds studied and unnatural. It's a distraction in this film as well. However, she's so watchable in everything - the camera just adored her - I have to believe that as she lived and aged, she would have had more chances at drama.<br><br>Widmark is excellent as the apparent cynic who proves to have more to him than his girlfriend thought - in fact, his character was much better with the child than Monroe's; Bancroft's role is small and belies her future dramatic appearances; and there is a cameo by \"Honeybee Gillis,\" Joan Blondell's sister Gloria, as a photographer.","user":"blanche-2","rank":[23,24]}]