[{"title":"Average action comedy with an exceptional pair : Washington and Hoskins","rating":5,"date":"8 June 2006","review":"The tale concerns about Mooney , a bigoted police officer (Bob Hoskins) from Los Angeles who has problems with his captain(Roger E. Mosley). Mooney pursues a debonair ,elegant though mobster black lawyer(Denzel Washington) named Stone whose slogan is live fully while you may reckon not the cost . When Stone is dating his ex-fiancée (Chloe Webb) is seen by Mooney . Soon afterwards Stone is shot and deceased , meanwhile Mooney suddenly suffers a stroke . When he wakes , the Stone's heart has been transplanted and his ghost is now his constant companion , hoping the cop will help to avenge his killing .<br><br>The picture is a fantastic action/comedy in which there are suspense , humor, an enjoyable romance, bemusing fantasy and results to be quite entertaining . However , the screenplay is sometimes ridiculous, drags in some places and full of unlikely situations . The protagonist duo is good , as nice acting by Bob Hoskins in a comic role such as in ¨ Roger Rabbit (Robert Zemeckis)¨ , nevertheless he usually plays dramatic characters (¨ Neal Jordan's Monalisa¨) , Denzel Washington is fine but his specialty turns out to be the strong and tough roles . The production film is in charge of ¨New Line Cinema (Robert Shaye)¨ ,nowadays an important producing company with enormous success . The motion picture is regularly directed by James D. Parriott. The flick will appeal to Denzel Washington fans and fantastic comedy lovers. Rating : Acceptable, passable and amusing.","user":"ma-cortes","rank":[17,20]},{"title":"Disheartening","rating":5,"date":"20 August 2018","review":"This movie was a bit mercurial--it started of terrible, then it seemed as if it was going to be a decent movie, then it changed for the worse.<br><br>Racist officer Jack Moony (Bob Hoskins) suffers a heart attack and receives a heart transplant from African-American lawyer Napoleon Stone (Denzel Washington). In came the extremely racist and crude jokes from his coworkers. This heart transplant came with more than bad jokes it came with the ghost of Napoleon Stone.<br><br>Initially, Denzel was hamming it up as Napoleon and it was uncomfortable to watch Denzel behave in such a manner. Then, the movie seemed to take a turn for the best: the dialogue got better, the plot made sense and all was right. Then, just as suddenly the movie became a chore to watch. The plot had holes and characters were behaving badly. The movie fizzled out even if it was a happy ending.","user":"view_and_review","rank":[4,4]},{"title":"\"The pump action comedy\" - ?????","rating":3,"date":"19 September 2012","review":"\"Pump action comedy\" says the front of the video case. Yes, I get it, \"pump action\" as in shotguns (which the video case shows on the back cover) and heart beats - however anyone thinking it is going to be a comedy...i.e that they might laugh much, is going to be very disappointed. Oh hold on, perhaps it's a black comedy, so we are not supposed to laugh?....hmmm....the back of the video case says \"hilarious story\"<br><br>Frankly, I wonder if this film really needed to be made. ;and if it had been decided that it was integral to the plot that the two male leads of the racial and physical types depicted, then the producers might have been better off with people more used to making comedies, like Eddie Murphy and Danny De Vito.<br><br>The only scene that was at all well done was near the start when Jack Mooney's superior officer was chewing out for using the N-word. I've seen a similar scene in another film with Nick Nolte I think and it was done better there. <br><br>The plot had several glaring continuity errors, some of which are already on this site. But here are some more: all of which occur in the same 5 minute segment. When Jack Mooney nearly rejects Denzil Washinton's heart, Denzil is on the bed and suggests that they could play video games together. But surely not, as he would not be able to handle the controls, as earlier on in the film, Denzil revealed that he was unable to shut a door, as he could only touch Jack Mooney. Then when Jack Mooney discharges himself from hospital, he gets into a police car. Where on earth did the keys for that suddenly materialise from? And when the receptionist at the hospital makes a phone call, ALL the heart monitors she is supposed to be watching are either switched off or are flat lining. Early on in the film Jack Mooney is swigging from a bottle, which he has apparently just bought hence the bag it is in, but one swig later the bottle is 3/4 empty. The 5 kilogram cat seemingly has what appears to be a lethal dose of whisk bourbon as well, but apparently without any ill effect.<br><br>The plot, even once we accept the premise of a ghost coming back, is frankly unbelievable. Early on in the film we learn that Napoleon Stone, Denzil Washington's lawyer character has been killed just in case his hooker clients him told him anything - yet the hookers themselves are kept alive, seemingly with attempts only being made to kill them many months later, towards the end of the film. <br><br>As for the final scene, the gunfight has to be one of the most unbelievable ever seen. It is somewhat unbelievable that the bad guys didn't seem to have a look out watching for his arrival and gun him down from the front windows as he walked towards the building. <br><br>However Jack manages to enter the building without any opposition. He then decides that the ideal strategy is to use the \"wizard's Eye\" strategy send the ghost on ahead to scout the place out. A good idea surely. The ghost does this and reports a bad guy with a big gun waiting in the next room. So without further ado, avoids him and heads up the stairs....without getting the ghost to check the upstairs areas first. No matter, as none of the bad guys seem to be waiting for that possibility. By contrast, later on when a bad guy is coming cautiously up the stairs, Jack blows him away in an instant.<br><br>Later on in the same gunfight, Jack is trying to escape with his girl, who is severely drugged and thus unable to walk unassisted. This causes problems as Jack Mooney is barely able to stand himself. The ghost is unable to help her, but it does not seem to occur to either him or Jack, that the solution is for Jack to lean on the ghost and thus for the ghost to take the weight in that way. This solution had already been used when Jack discharged himself from the hospital and was leaning on the ghost.<br><br>Anyway despite Jack Mooney still suffering from his heart condition, being severely wounded in the chest during the early stages of the gunfight, and barely able to stand he is revealed as a supreme gunfighter and marksman. It seems that even the tear gas canister that he threw himself and then ran straight into the area of effect of, didn't have any adverse affect his stamina, eyesight or lightening quick reflexes as he killed all 5 of the baddies with just 5 shots including shots as he dived to the floor, span round to kill the guy behind him and fired one handed.<br><br>Denzil Washington was right to fire his agent after this turkey.","user":"kestrelgrey","rank":[6,7]}]