[{"title":"Beautiful Story","rating":10,"date":"3 March 2006","review":"I caught this at the local art museum, what a treasure it is! I became interested because the director is Claude Berri, and his \"Jean de Florette/Manon des Sources\" story is one of my favourites of all time. Although this movie is in black and white, it's a superior quality and beautiful to watch. The story, of a little Jewish boy hiding out in the country with an anti-semitic old man in occupied France, could easily have gone down the path of sadness and tears, but instead it is a joyous movie full of laughter and love. I must say Michel Simon is a delightful actor, and makes even a narrow-minded, ignorant, brainwashed old man like Pépé a kind, fun grandpa that any child would love to have. I believe this movie is based on Claude Berri's actual experience, but I did have to wonder at the end if Pépé was ever told the truth about the child's heritage and if so, did it matter? Anyway, this is a fantastic heartwarming movie that you shouldn't miss if you ever get the chance to see it.","user":"mllelarisa","rank":[28,32]},{"title":"Warm drama","rating":9,"date":"7 December 1999","review":"I remember seeing this movie when I as a teenager (say, about 1970) and I was then very moved by this warm and tender drama. Nearly 30 years later, I just saw it on TV and I didn't change my mind : this is a very good movie, in the way French can say a lot of things in this kind of day-to-day film. The chemistry between young Cohen and veteran Simon is beautiful. It's also filled with references to the way people in France lived the Second world war, like Simon hating Jews and didn't know that is young friend Berry is a Jew. I love Michel Simon. He had been such a great actor from the second half of the 1920's to his death, in the middle 1970's. He was always good in his films, so natural that we don't think he's acting. Le vieil homme et l'enfant is a very intelligent movie for young director Berri, who will be famous as a director and producer in the next years.","user":"MarioB","rank":[23,27]},{"title":"Hilarious yet incredibly moving","rating":9,"date":"12 May 2006","review":"I just saw this at the Toronto Jewish Film Festival and I was completely astounded! I was expecting it to be good as several people had expressed their love for it but I was not expecting to feel about it the way that I did. A story about a young boy who gets sent away by his family, for his own protection, is shown through the eyes of an imaginative, smart, little boy. I found it amazing to see a film about this time, as experienced by a child - fascinating. Although the story is very difficult, sad and almost unimaginable, Claude Berri manages to make this film powerful and yet very funny at the same time. I would recommend this movie to everyone. It is a French film however for those of you who need them, there are subtitles. So what are you waiting for... go see it!","user":"miss_meliss1981","rank":[16,20]}]