[{"title":"Some credibility problems, but still a compelling film.","rating":7,"date":"22 August 2002","review":"It's a gripping thriller, and Richard Burton is utterly convincing in the kind of role he was born to play (a rigid priest/teacher, but with traces of humanity underneath). But the constant flow of twists results in constant shifts in the characterizations, until the whole thing becomes too far-fetched for its own good. Nonetheless, it certainly didn't deserve its gross mistreatment by the American distributors, who released it ten years after it was made.    (**1/2)","user":"gridoon","rank":[19,22]},{"title":"A Forgotten Gem","rating":9,"date":"25 October 2015","review":"I got this film in the 50-pack Drive-in Collection. I had forgotten all about this movie.. I popped it in and about 1/3 of the way into the film I remembered seeing this one a few years ago. WOW what a pleasant blast from the past. So glad they included this forgotten gem in the collection! <br><br>Yes this film is good - it's my kind of a mystery-thriller. Although the film is not a horror film, it does get creepy - very creepy. Fans of classic horror movies should enjoy this film along with fans of mystery thrillers. Just an excellent film! <br><br>The film does start slow... but it is worth it in the end. There is a reason for this seemingly slow start - it will make sense in the end.<br><br>Great late night flick. One that you will not want to miss anything so have your drink and food ready! <br><br>9.5/10","user":"Rainey-Dawn","rank":[7,8]},{"title":"Not perfect, but still compelling","rating":2,"date":"2 January 2014","review":"By this time in Richard Burton's career, his level of acting wildly varied from film to film. Fortunately, in \"Absolution\" he gives a good performance. He is very believable as a humorless figure who sometimes acts very cruelly in the so-called belief that it is doing his students good. But he is not the only good thing about the movie. The script has a story that doesn't contain any slow spots, and slowly raises the tension as things progress. There is also a twist near the very end that will surprise some viewers, though I must admit I had a little idea that not only were things not quite what they seemed, but also that a character who appeared sporadically up to that point would have to have some play in the end since otherwise he didn't seem to have any purpose in the movie. But despite this glaring clue, the movie is well worth a look.","user":"Wizard-8","rank":[7,9]}]