[{"title":"Very uneven comic revival of Charlie Chan","rating":5,"date":"5 October 2016","review":"This attempt to update Charlie Chan to the 1980s and give him a comic bent is highly uneven: there is a load of misplaced, unfunny slapstick in it, and some big names in the cast are terribly wasted. I am a fan of Peter Ustinov (who made this in between my two favorite Poirots) and he is delightful here, but he almost seems like a supporting actor in his own movie; too much of the screen time goes to the ineffectual Richard Hatch as his \"number one grandson\" (Brian Keith is also very annoying as a loudmouthed police chief). The film is more successful when it sticks closer to the spirit of the original Chan films: I am referring to the b&amp;w flashback sequence and the \"clue of the fork in the tea cup\", as well as the climactic gathering of the suspects for the unmasking of the \"Bizarre Killer\", who is, indeed, rather well-camouflaged. But as a comedy, it has very few laughs; for a funnier take on a Charlie Chan-type of detective, see \"Murder By Death\". ** out of 4.","user":"gridoon2020","rank":[6,6]},{"title":"Character Actors Redeem Otherwise Uninspired Parody","rating":4,"date":"10 June 2007","review":"During the 1930s Charlie Chan films were extremely popular with Asian American audiences; by the 1980s a later generation derided them for their use of Caucasian actors Warner Oland and Sidney Tolar in the title role. CHARLIE CHAN AND THE CURSE OF THE DRAGON QUEEN attempts to play to both sides of the coin, acting as both homage and parody of the original films. Not surprisingly, when released in 1981 it pleased neither.<br><br>Set in San Francisco, DRAGON QUEEN finds Chan called out of retirement in Hawaii to uncover a serial killer whose trademark is \"bizarre deaths;\" he is assisted by his grandson, a bumbling Lee Chan Jr. who proves as much hindrance as help. Like most films that do not fulfill their promise, the problem begins with the script: it never really references the Chan films in any significant way, nor does it ever develop the fangs required of an effective parody. Nor are the two leads well suited to their roles: both Peter Ustinov and Angie Dickinson are wildly out of place as Chan and the Dragon Queen, utterly unfunny in every imaginable way.<br><br>The saving grace of the film is in the supporting players. Perhaps the single most successful performer is Lee Grant in the role of Jimmy Jr.'s maternal and very Jewish grandmother. Grant aside, the always memorable Roddy McDowell and the brilliant Rachel Roberts jolt their every scene to life; Brian Keith plays against type as a hysterical and wildly profane police officer; and Richard Hatch is surprisingly good as Chan's bumbling grandson. Michelle Pfeiffer, in one of her earliest roles, is thrown in for good measure--and while the script gives her little to do beyond look pretty and giggle she does both extremely well.<br><br>Even so, this is not enough to save the film, which slowly but surely dissolves into a morass of very obvious slapstick humor; when all is said and done, the end result is rather like THE GOOD EARTH MEETS THE PINK PANTHER. It has moments, but it is more awkward than amusing. Four stars for the efforts of Lee Grant, Roddy McDowell, Rachel Roberts and company, but--and in the words of the original screen Chan--most viewers should say \"Thank you so much!\" and pass along another way.<br><br>GFT, Amazon Reviewer","user":"gftbiloxi","rank":[15,20]},{"title":"May not age well","rating":8,"date":"16 August 2018","review":"Ok. One of my all time favorite movies. Silly, pointless, aged stereotypes but just silliness from start to finish. Don't go in expecting a cinema masterpiece, just enjoy!","user":"jaredinphilly","rank":[6,7]}]