[{"title":"A first class ticket of horror !!!","rating":8,"date":"22 December 2003","review":"Pardon my enthusiasm but Horror Express really is a must see for all fans of classic horror. It simply is one of the best horror movies made in the seventies and I can't think of many aspects about it that are negative. First of all it stars Christopher Lee and Peter Cushing. There.that should already be enough as a recommendation. These gentlemen are one THE greatest duo in horror ever and they didn't do their finest work just for Hammer Studio's exclusively. And the fun doesn't stop with these two icons.Horror Express also stars Telly `Kojak' Savalas in a delightful role.  It's actually a shame that his screentime is rather limited because he manages to impress as much as Lee and Cushing. He clearly enjoyed playing Captain Kazan and he makes the most of his performance.<br><br>But Horror Express has a lot more to offer than just good acting. It's a powerful and fascinating story that delivers a good old fashioned amount of scares and atmosphere. The entire story takes place on a old train which is the ideal setting for a film like this. The old and noisy carriages create a unique atmosphere of claustrophobia and the `nowhere to run'-element is used to the max. The plotline itself surprisingly good and it keeps you alert during the entire movie. This is also thanks to the several other, interesting topics that are included in the movie like anthropology, religion and the evolution-theory. Sure, the entire screenplay is illogical and the plot contains as many holes as a small Swiss cheese but - seriously - who cares. I prefer this kind of silly inspiration and creativity a million times over the horror crap they make nowadays !! Horror Express is - simply put - a must see ! I'd even say it's essential viewing if you're looking for the highlights in the genre.  It's original, creepy ( even pretty bloody and violent ), it contains enough humor to moderate things and most of all.it's very entertaining. Climb on board and find yourself a seat.Horror Express is one movie you won't regret watching !!","user":"Coventry","rank":[80,89]},{"title":"Great Yarn","rating":10,"date":"14 August 2000","review":"Judged on its own terms--as a 70s ghoul movie--this film should be rated a 10 out of 10! The plot is well-structured and tightly directed, and contains lots of great elements: 1906 setting, fancy trans-Siberian train ride, a ghoul, a mad monk, alien theorizing a-la-X-files, zombie soldiers stalking, Peter Cushing sawing the top of somebody's head off, a beautiful spy, eyeballs in a dish, a beautiful Polish Countess, and, believe it or not, it's all very cohesive! That's an admirable achievement<br><br>And the acting is great. The Monk is a scene-stealer. Christopher Lee gets to play a testy, priggish Edwardian scientist, and he does it very well. Cushing's character plays off Lee's stodginess as a laid-back deal-maker(yes, he actually smiles and cracks jokes)These two performances prove that Lee and Cushing were both gifted and versatile actors. Telly Savalas arrives for the final act, and proceeds to strut around and chew up the scenery on a level that would make Rod Steiger or Al Pacino jealous. This movie is one of the best of its type. Yes, in the first two minutes you can see signs of a limited budget, and yes, the microscope scene is ludicrous, but in a way, on the level of imagination and poetic license, it's pure genius.<br><br>Corrections: a certain \"Dik\" offered this information while commenting:<br><br>1. \"An Italian film\".(It's a Spanish/UK production) 2. \"Lee plays an American Scientist\"(the first thing you hear in the movie is Lee saying he is part of the ROYAL Archeological Society, and there's also a lengthy exchange about his character's Englishness: \"Queen Victoria, crumpets, Shakespeare\"...etc.(The commentator actually goes on about how Lee's portrayal of an American reflects how foreigners view Americans. Well...there's a little problem with that idea, isn't there?)","user":"withnail-4","rank":[70,80]},{"title":"A fantastic 70s horror movie","rating":10,"date":"6 December 2013","review":"This is simply a very good movie. There is really nothing about it to dislike. Christopher Lee and Peter Cushing are the biggest names and they work well together on the screen. Telly Savalas shows up towards the ending, and makes a great performance.<br><br>The movie is very impressively made. It is a work of art. Other than horror qualities, the acting is great and the setting works perfectly. This is one of those movies who works good on every level. The acting, the pacing and the sets are all perfect. The special effects in this one are still very fascinating and scary.<br><br>This is one of my absolute favorite movies and I highly recommend it to everybody.","user":"Movie-watcher-2000","rank":[13,13]}]