[{"title":"Underrated Godzilla film","rating":8,"date":"4 May 2004","review":"I always thought \"Monster Zero\" (along with the one after, \"Godzilla vs. The Sea Monster\") was a bit underrated in the Godzilla film list. King Ghidrah makes his second appearance, and it is a lot more fun and interesting than his first (\"Ghidrah The Three Headed Monster\" from 1964).<br><br>This definitely isn't the fastest moving Godzilla film, but there are a lot of cool things to look at as the plot goes along slow at times. And the alien invasion/takeover plot is pretty decent if not overly original. The aliens look pretty cool and their hardware is 60's sci-fi retro, you gotta love it.<br><br>Nick Adams is pretty decent enough and gives the film a certain flair. It's a shame he had to leave us so soon, as it would have been a blast to have him return in a future Godzilla film.<br><br>The special effects are totally mid-60's Godzilla, with all the obvious miniatures being stomped on by the guys in the monster suits. There's one great shot where a doll of an astronaut gets lowered onto Planet X via an open elevator outside the spaceship, and as the doll is lowered to the ground in one lengthy camera shot, you can't help but laugh a little realizing that there was no attempt whatsoever to make that shot look real, or to hide the fact it's so fake with quick silly editing. But that's part of the charm of the early Godzilla films. <br><br>I always thought it was odd when, on Planet X underground, as the leader shows the astronauts the screen showing Ghidrah wildly attacking on the surface, that Ghidrah is in essence attacking nothing but rocks and dirt because that's all there is on the planet's surface. And also how Ghidrah flies past that huge painting of a planet in the distance a few times.<br><br>Godzilla and Rodan eventually save the Earth and that's what it's all about in a 1965 Godzilla film. Godzilla by this time was definitely all hero protecting his home planet. It's such a shame that unless a movie looks like a silly music video, so many kids won't watch it. Hopefully a lot of parents are introducing their kids to these old Godzilla films via DVD and video, because they sure aren't on TV much anymore.","user":"stevenfallonnyc","rank":[21,21]},{"title":"We need from you Monster Zero 1 and Monster Zero 2, Godzilla and Rodan.","rating":8,"date":"24 May 2015","review":"It's one of those Godzilla movies where you fully understand why some fans of the \"Zilla\" series positively dislike it. The big atomic lizard is only a bit part player here, and when push comes to shove the monster mayhem is in short supply, which considering we also have Ghidorah and Rodan in the mix is for sure a bit of a waste. Yet this is one of the better sequels from Toho's original wave, it quite literally has all the ingredients that made \"Zilla\" and the off-shoots so iconic.<br><br>We are in live action cartoon territory, a sci-fi story of bonkers proportions yet engrossing all the same. The joyous model work synonymous with the series remains intact, the cardboard sets being obliterated are still fun to watch, and the divisive sight of \"Zilla\" doing the \"shay\" dance is in here whether you like it or not. More fun, though, is watching \"Zilla\" boxing the three headed Ghidorah, now that is comedy gold, if only the moody lizard had gone southpaw a bit earlier then saving the world could have been achieved quicker.<br><br>Great fun, could have been better from a monster point of view? Yes, definitely, but this be a nutty fruitcake production from Toho and amen to that. 8/10","user":"hitchcockthelegend","rank":[11,11]},{"title":"A Blast From My Childhood","rating":16,"date":"16 December 2002","review":"This film was the first Godzilla film that I really remember seeing from beginning to end.  I was so taken by it that I forgot to go to the bathroom (I was only five at the time).  This film helped to cultivate my love for the kaiju eiga genre.  Even though many people have put this film down as being one of the weakest in the Godzilla series, it will always hold a special place in my heart.","user":"Sargebri","rank":[15,16]}]