[{"title":"Once timely, now timeless","rating":10,"date":"23 September 2005","review":"One of the great films of the 60s, \"In the Heat of the Night\" hasn't aged a bit in the four decades since its release and now deserves to be ranked with the great films of all time. Beautifully atmospheric, Haskell Wexler's brilliant cinematography and Norman Jewison's first rate direction make you feel the humidity of the small Mississippi town in which a black detective teams with the redneck sheriff to solve the murder of an important industrialist.<br><br>As sheriff Bill Gillespie, Rod Steiger is superb in his Oscar winning role, and this film provides Sidney Poitier with some of his greatest screen moments, including his famous admonition to Steiger that became the title of the less impressive 1970 spin off: \"They call me MISTER Tibbs!\" <br><br>This is one of the few politically correct films to make its point without resorting to heavy-handed, sanctimonious preaching. Stirling Silliphant's Oscar winning screenplay never hits a false note, and the change that occurs in the relationship between the leading characters is subtle, and, therefore, believable. The two stars are ably supported by an outstanding cast of both veterans (Lee Grant, Warren Oates, Beah Richards) and newcomers (Scott Wilson, Quentin Dean, and the delightfully creepy Anthony James). The score by Quincy Jones, featuring Ray Charles' rendition of the title song, captures the proper mood throughout. <br><br>In a year when the odds-makers were predicting an Oscar victory for \"Bonnie and Clyde\" or \"The Graduate,\" \"In the Heat of the Night\" surprised the prognosticators by taking the Best Picture prize and four other Oscars. Considering its theme of racial tolerance, it seemed an appropriate choice at an Oscar ceremony that was postponed following the assassination of Martin Luther King, Jr. The film's theme made it timely, but its artistry makes it timeless. <br><br>The Academy made the right choice.<br><br>Brian W. Fairbanks","user":"bwaynef","rank":[151,167]},{"title":"\"They call me Mister Tibbs!\"","rating":10,"date":"7 September 2004","review":"Whether he likes it or not, Sidney Poitier will always be remembered first and foremost as the first black actor to continuously star alongside and above his white counterparts. Just look at the opening credits to \"In the Heat of the Night\" and you will see that not only does he get an above the title starring credit with method maniac Rod Steiger, but his name also appears first. Something that could have easily been switched around and overlooked considering the importance of each character. But for this socially aware thriller born of the turbulent sixties, it had to be, most definitely, a conscious choice.<br><br>For Poitier, this film, along with \"Guess Who's Coming To Dinner?\", marks the last of his civil rights driven roles in which his character's race is an all important plot element. From \"Edge of the City\" to \"The Defiant Ones\", Poitier excelled in bringing intelligent and commanding three dimensional characters to life. A feat he had to succeed at if his films were to gain the trust of a predominantly white audience and push for racial equality. Call him the Jackie Robinson of Hollywood.<br><br>When we first see Poitier as Virgil Tibbs, he is stepping off the train in the small Mississippi town of Sparta. Although we can only see him from the waist down, we do get a quick glimpse of his hand and from that we are aware of his race. An important fact for the audience to dwell on later when Rod Steiger as sheriff Gillespie, standing over a dead body on Main Street, and calls for his deputy to round up any strangers for questioning. From that moment on, director Norman Jewison establishes the racial tension that will only grow more and more intense as the film goes on.<br><br>Sometimes, the film is far from subtle in exploring the issue of racism. Endicott's plantation, complete with tall white pillars and a black jockey lawn ornament to guard them, is a perfect example. What starts off as a surprisingly civil conversation between Tibbs and Endicott quickly turns heated and unpredictable. From that moment on, the experience will serve to cloud Tibbs' judgment and bring his own flaws to the surface, making him almost as complex a character as Gillespie. <br><br>And it is the complexity of Gillespie that got Steiger the Best Actor Oscar over Poitier in 1968. This man has heart, but not made of gold, and his motivations are far from pure. He is simply a man who believes in doing his job, and doing it as just as possible - even if it means arresting a friend for murder. Take for an example the scene in which Tibbs is surrounded by a gang of blood thirsty locals. When Gillespie arrives to save the day, he simply gives them a warning and tells them to go home. It is only when they insult him personally that he becomes angry and takes a swing. His action is just - his motivation almost vain.<br><br>In the end, after the murder is solved and racial injustice is swept back under the rug, Tibbs and Gillespie say their farewells and continue on with their very different lives. Each one better off for knowing the other.<br><br>Rating [on a 5 star system] : 5 stars","user":"CJGlowacki","rank":[104,118]},{"title":"A great whodunit with a unique setting.","rating":9,"date":"3 September 2011","review":"Whodunits are a dime a dozen in my view.What makes In the Heat of the Night so unique in the murder mystery genre is it's setting:The racially tense deep south.This is what I enjoy about the film.You have two major plot lines to keep you engrossed:The investigation into the murder itself,and the racial tensions between Sidney Poitier's Virgil Tibbs character and virtually every other character in the film.The film is loaded with great acting,particularly from Poitier,who,not surprisingly,considers this his best work and is his favorite amongst all the projects he has done.Not only is this recommended viewing,it is recommended for a spot on your home video shelf.","user":"SmileysWorld","rank":[15,15]}]