[{"title":"Comedians like Us","rating":7,"date":"2 March 2005","review":"Chevy Chase and Dan Aykroyd were at the height of their professional careers with the 80's \"masterpiece\" Spies Like Us. The cast alone makes this movie a triumph the 80's comedy. Although the same cast today would find itself on the video shelf and not the movie theaters, for the mid 80's this was a GIANT of a Hollywood cast. Second to only Doctor Strangelove, what other comedy is funnier when dealing with American / Russian relations during the cold war? Chevy and Aykroyd have terrific chemistry together that has been molded to perfection from their success on Saturday Night Live. The physical comedy in the first half of the movie is as funny as any Marx Brother film of its time. The comical situations that occur in the second half are as funny as any Blake Edwards production. Together, the movie is as funny as it gets for the 1980's.","user":"caspian1978","rank":[47,57]},{"title":"Straight Up Silly","rating":9,"date":"25 February 2006","review":"I bought the DVD of this movie for six dollars. Best deal on a movie I've ever seen. Having been raised in the 90's I missed out on many of those fantastic 80's films. Dan and Chevy really make the movie work. Very few actors could have taken a movie with as little plot as Spies Like Us and turned into a funny soup bowl full of laughs. One more thing, perhaps the funniest scene in any movie happens early on. Where Chevy Chase is cheating on the test...Priceless. If you like over-the-top government action, with hilarious scenes and horrible attempts to hit on beautiful women. You'll love this movie.<br><br>If not...Then you need to take a moment to look at your life, relax, and just enjoy something every once in a while.","user":"flatworlder","rank":[41,53]},{"title":"Vintage Chevy Chase","rating":8,"date":"27 July 2005","review":"For Chevy Chase fans, this film displays one of his vintage performances---right up there with a couple of his \"Vacation\" films and \"Fletch.\" He and Dan Aykroyd form a great comedic duo with great chemistry that will leave you wanting for more.<br><br>The setting changes rapidly from DC, to Pakistan, to the former Soviet Union. Chase and Aykroyd are identified as expendable Department of State personnel, and therefore trained as covert agent decoys and tasked with an ultra top-secret mission deep inside Soviet territory. The newly appointed agent/spies don't realize they're decoys, but rather, think they're real agents on a real mission. Good stuff.<br><br>Together, their bumbling antics throughout agent training and their top-secret mission are good for steady laughs from beginning to end, as they find themselves playing the \"accidental hero\" role charged with saving the world.<br><br>Very scenic locations, some decent special effects (for the mid-80's), and some serious plot-twists amidst the silly humor enables \"Spies Like Us\" to hold the viewer's attention in-between comedic situations.","user":"PatriotsReign","rank":[25,31]}]