[{"title":"I had a 'walk-on' speaking part in this film.","rating":30,"date":"30 May 2002","review":"This is not actually a review of 'It Lives Again', just a quick comment, in case anyone is interested. I had a tiny speaking part in this film. I was part of a crowd of extras in the police/sheriff's roadblock scene (right after the tunnel shot), when the director decided to create a dialogue between the Sheriff's Department and the city police about whose jurisdiction it was.<br><br>He picked two of us who were wearing sergeant stripes on our uniforms (we were off-duty cops at the time) and we made up the scene on the spot. My two lines made it into the movie: \"This is the Sheriff's jurisdiction and we're stopping the truck\"...then, I turned to the other deputies and said, \"OK, stop the truck.\" ...that's it. 35 years later, my family and friends still get a huge laugh out of this.<br><br>M. Pettit Tucson, AZ 2002","user":"pettit","rank":[12,20]},{"title":"Taking Baby Steps","rating":6,"date":"27 March 2005","review":"John P. Ryan returns as Frank Davis, the father of the monster baby from It's Alive, this time to warn parents of infants about to be born of a conspiracy of the government to have killing squads ready at the time of birth. It seems that his baby was just the tip of the iceberg - a whole group of these mutant babies is being born all over the country. Though certainly not as effective as the original, I found It Lives Again to be quite an engaging, well-done sequel. Larry Cohen again returns as both writer and director, and he brings back some of the same folks from the original - James Dixon in particular returns as the lieutenant. john Marley does an able job playing a policeman with special reason to seeing these babies die. The other actors give decent performances with Andrew Duggan standing out as a doctor bent on giving these babies a chance. I guess what I really liked about the film was the sense that even though these mutants are destructive, killing machines, they still have a glimmer, a spark if you will, of some kind of inherent humanity. Cohen tries to keep his viewers at least somewhat sympathetic to their plight. As with the first film, don't look for mind-boggling special effects here. We get the same camera blur treatment when we see things through the eyes of the babies. We also never get a real good look at the infants in this one either. Some scenes that I thought were particularly well-shot include the hospital awaiting the arrival of the Scott's and much of the by-play with Marley and Ryan. Bernard Herrmann's music is back as well. Rather enjoyable sequel!","user":"BaronBl00d","rank":[5,7]},{"title":"* out of 4.","rating":3,"date":"3 June 2002","review":"Weak follow-up to the original cult classic It's Alive is virtually a remake of the first film, but with three babies this time around instead of one. Dull, boring, talky horror flick with a disappointing score and just about all the action and scares confined to the end, but by then it is too late. Rick Baker actually did the poor effects for this inept sequel.<br><br>Rated R; Violence &amp; Profanity.","user":"brandonsites1981","rank":[5,7]}]