[{"title":"Offensive - no. Fantastic film-making - yes!","rating":9,"date":"14 April 2005","review":"Has there ever been a more misunderstood film than Martin Scorcese's The Last Temptation Of Christ? Released amid great controversy and accused of being an offensive and unholy film, the truth of the matter is that it is a deeply reverent work which has the courage to ask challenging questions about the pressures and doubts Jesus must have experienced as the appointed Messiah. It also shows the violence of the times in graphic detail. If viewers consider it blasphemous to explore on film the immense burden of duty that Jesus bore through his life, then they are narrow-minded and ignorant. If people feel that to show the brutality and harshness of life in Roman times is tasteless and inappropriate, then they are guilty of glorifying difficult but factual truths. There is NOTHING offensive about this film. There is, however, much that is challenging.<br><br>Jesus (Willem Dafoe), an honest carpenter, saves Mary Magdalene (Barbara Hershey) from a stoning. Already dimly aware that he is destined to lead an extraordinary life, he soon finds himself being drawn into the role of a religious figurehead. But Jesus finds it hard to accept that he is a Messiah, and as his reputation and following grows he constantly questions if he is a strong enough man to handle the burden of being God's son. After isolating himself in the desert, where he experiences several hallucinations in which he is confronted by visual manifestations of good and evil, Jesus finally concludes that he IS the true son of God and whole-heartedly sets about imparting his love and wisdom to all who'll listen. Later betrayed to the disgruntled Romans by his friend Judas Iscariot (Harvey Keitel), Jesus is crucified. While on the cross, he imagines what his life would have turned out like if he had shied away from his duty as the Messiah and lived life like a mere mortal.<br><br>It is this final section of the film that has provoked the most vociferous outrage. The sequence shows Jesus as he slowly dies on the cross, dreaming of an alternative life in which he sins and copulates and hates like all normal people. Many people have criticised the film on the grounds that these scenes are blasphemous. Such claims are nonsense - the film is not saying that Jesus was a sinner, nor that he gave in to temptation of the flesh, nor still that he was a man filled with hate. The film is merely saying that, in such great pain and so close to death while still just a young man, he might - just maybe - have wondered if it was all worth it. At the end of the film, we see Jesus accept his role knowing that his death is the ultimate act of unselfish love, so the film actually is totally in agreement with what all Christians believe. If the film had come to the conclusion that Jesus's whole life was a waste, his death too, then maybe the detractors would've had cause to complain. But how can they possibly be offended by the film as it stands? For goodness sake, it's a film about absolute faith!!! In truth, The Last Temptation Of Christ is an excellent movie. Compellingly acted, beautifully shot on Moroccan locations, and full of telling ideas, it is a work of real depth and power. The accents are sometimes distracting and some of the dialogue occasionally betrays ill-suited modernisms, but apart from these minor drawbacks it is one of the most important and thought-provoking films ever made.","user":"barnabyrudge","rank":[122,156]},{"title":"The Most Loving Portrayal of Jesus I Could Imagine","rating":10,"date":"22 July 2005","review":"Condemned by Fundamentalists upon release, delayed by outcries from hypocrites and liars, and boycotted in any city where it played \"The Last Temptation of Christ\" is one of the most controversial movies ever made. Instead of showing Christ as a fearless and perfect person, \"The Last Temptation\" depicts Him as a person who fought his destiny and wished to be just another mortal human being. Religious groups who couldn't (and still can't) accept the fact that Jesus was human were shocked by such ideas and refused to see the film or read the landmark novel on which it was based. They'll never know that they attacked one of the most honest and loving depictions of Christ.<br><br>The Christ we see in the film is not based on the teachings of the Gospels, or any scripture for that matter. Instead we get a portrait of Christ the man, not Christ the Savior. We get to see his faults, his fears and anxieties. Then, we get to see him overcome those and find the strength to fulfill his destiny. The Last Temptation of Christ is not afraid to say that Jesus was weak before he became the Savior, and that makes the film all the more satisfying. This is a tale of redemption, courage, and love like no other.<br><br>There is no reason to miss this film. Not everyone will like it, but at the very least it will let you see another perspective of the story. And even if you can't accept the story, you won't be able to deny the greatness of Scorsese's direction. From the epic crowd scenes, to the intimate one-on-one conversations, to the stunning final shot (which was actually caused by an overexposed section of film, but is beautiful nonetheless), you will be awed by Scorsese's work here.<br><br>Also stunning is the work of the two leads. Willem Dafoe inhabits the role of Christ perfectly, bringing perfectly controlled emotion to each and every scene. Harvey Keitel as Judas has been the subject of debate because of his NYC accent. That was on purpose (Scorsese used accents to denote the descent of characters. American accent = Israelite; British accent = Roman), but it doesn't even matter. Keitel is brilliant no matter what his accent is.<br><br>Honest, human, loving, and unafraid, \"The Last Temptation of Christ\" is one of the great cinematic achievements of all time. Martin Scorsese crafted with this film his most personal masterpiece, and perhaps his greatest masterpiece ever.","user":"CSM126-1","rank":[111,145]},{"title":"A beautiful, moving film.","rating":10,"date":"16 March 2005","review":"This is a beautiful film. It is one of the most powerful and ultimately one of the greatest films ever made, without a doubt. The performances, especially by Willem Dafoe as Jesus, are amazing; the sets and costumes are realistic and never feel forced, glossy, or stylized (and were based on extensive archaeological and philological research); Peter Gabriel's score is absolutely unbelievable...I cannot possibly praise this film enough, as well as Mr. Scorcese's courage in making such a bold and beautiful work of art in the face of considerable opposition.<br><br>It is really best to avoid religious and theological arguments about this film - it is simply a portrait of Christ coming to terms with who he is and what he must do. If it occasionally portrays Jesus in a manner that is somewhat at odds with that of scripture, try to keep in mind that it is merely another take on a story that has no absolute and authoritative telling. That Jesus has difficulty coming to terms with the role he must play is something that scripture does not rule out.<br><br>Consider it this way: this is the sort of film that has the power to convince the irreligious or non-Christians out there (of which I am one) of the importance, beauty, depth, and truth of Jesus' vision of a world filled with love and compassion. Give this movie a chance. You will not be disappointed.","user":"flahertyd","rank":[125,181]}]