[{"title":"The Genius of Buster Keaton","rating":9,"date":"17 April 2001","review":"Probably Buster Keaton's best film, and oddly enough, it's not even a straightforward comedy  it's actually an action film, with clever doses of romance and comedy tossed in for good measure.  `The General', which is set during the Civil War, is about a train engineer named Johnny Gray (Buster Keaton, of course) who tries to enlist in the Confederate Army . . . and is turned down because the army feels he'd be much more valuable for the war effort as an engineer instead of a soldier.  However, through a series of misunderstandings, both Johnny's family and his girl think he's a coward, and they refuse to speak to him until he becomes a soldier.  Months pass, and Johnny, sad and alone, is piloting his train  the General  when it is stolen from him by the North.  Johnny's efforts to recover the General  and to win back his girl's love  become an unbelievably funny and action-packed series of events, as Johnny tries to go from being a sad-sack buffoon to being a hero.<br><br>If you haven't watched many silent films, they demand a greater amount of attention than `normal' film  there are no audio cues; and volumes can be spoken with a simple facial expression.  Buster Keaton is amazingly expressive, as he's fully capable of going from wildly happy to downtrodden and sad in the blink of an eye.  While funny, Keaton is much more than just a clownish figure  he manages to evoke a lot of sympathy as well, and he genuinely becomes what can only be described as an action hero as well.  His timing, whether for a joke or for a tender moment, is absolutely impeccable.<br><br>What's also great about `The General' is the sheer amount of stunts and physical humor  a movie like this couldn't be made today.  No amount of insurance would cover it.  Keaton does all his own stunts, and manages to perform a number of feats that are simultaneously hilarious and dangerous  he chases down `The General' with a bike, he sits on a moving cattlecatcher, knocking away railroad ties with a tie of his own.  All these stunts are fantastic, but it's scary to think that any one of these probably could've killed Keaton if something even went slightly wrong.  <br><br>\n`The General' is a lot more than slapstick.  Personally, I think it's one of the first films to push the envelope of movies  it goes for action, romance, and humor, and it pulls all of those elements together into a terrific movie. If you've never seen Buster Keaton  or, for that matter, a silent film  go find this one and watch it.  It's a classic. A+","user":"MadReviewer","rank":[121,130]},{"title":"Understated Perfection","rating":10,"date":"21 June 2006","review":"Buster Keaton once said that if he hadn't been a comedian, he might have been a civil engineer. He was not only a mechanical whiz but a spatial genius who devised stunts and gags with the grace of pure physics. It's no wonder he adored trains, the most elegant of machines, and brought them into his movies whenever he could. When one of Keaton's former gag-writers loaned him a book recounting the theft of a locomotive from Georgia by Union raiders during the Civil War, he was immediately fired with enthusiasm to bring this \"page of history\" to life. His first certainty was that the production had to be \"so authentic it hurts.\" He even insisted on using historically accurate narrow-gauge railroad tracks, which he found, along with appropriate landscapes, near the sleepy town of Cottage Grove, Oregon.<br><br>Most importantly, the area had stretches of parallel tracks, which allowed scenes of Buster on his trainagilely scrambling over the cars, balancing on the roof to scan the horizon, chopping wood for the engine while armies pass unnoticed behind himto be filmed from another train running alongside. Buster, his train, and the camera are all in motion; the wind whips through Buster's hair while smoky pine-covered hills rise and fall around him. These scenes are not only the highlight of the movie but a peak in the history of *moving* pictures, and they put to shame all later back-projection and process shots, models and computer-generated effects. The quality of Keaton's film-making is simplypun intendedunparalleled. Every shot in The General is clean, fresh and efficiently composed; the action is captured honestly and legibly at all times. The film never tries to be beautiful; its beauty is functional, just like the grave, masculine beauty of the locomotives and railroad bridges and Civil War uniforms.<br><br>The General's narrative structure is as strong and uncluttered as its look. Like a train, it stays on track, never meandering for the sake of a laugh or a stunt. All of the gags rise organically from the coherent and straightforward storyline. Adapting the historical incident, Keaton made himself the engineer of the stolen train (Johnnie Gray), rather than one of the raiders. As he saw immediately, The General is one long chase, or rather two chases, structured like the flight of a boomerang. First Johnnie on a borrowed train, the Texas, chases his own stolen train, the General. He manages to steal it back and races it towards his own lines, pursued by the raiders in the Texas, who try to prevent him from carrying their battle plans to his own high command.<br><br>The General is not Keaton's funniest film, but here he was going for quality over quantity in laughs. A number of the gags, like the box-car that keeps appearing and disappearing as it switches tracks, have a long build-up for a relatively modest payoff. But the laughter is mingled with a gasp of awe, and the best moments never get stale on repeated viewings. The cannon attached to the back of Buster's train goes off just as the train starts around a curve, so the ball flies straight and hits the raiders' train coming out of the curve. Riding on the cowcatcher, Buster hurls one railroad tie at another lying across the tracks, striking it precisely so that it flips out of the way. A forlorn Buster sits on the crossbar of his train's wheels, so lost in thought he doesn't notice when the train starts to move, carrying him up and down in gentle arcs: stillness in motion.<br><br>I agree with author Jim Kline who describes The General as Keaton's most personal film, the one that best captures his unique vision, spirit and personality. In many of his films, Buster starts off as an inept or effete character and develops into a hero. But his competent, ingenious and athletic character in The General, who is also modest, tireless, and underestimated, comes much closer to his real nature. There is a shot in The General of Buster's eye isolated on screen, framed by a hole in a white table-cloth, that has always reminded me of Dziga Vertov's kinoglaz, the \"camera-eye.\" Keaton melds with his camera; there's no distinction between his qualities as a performer and the qualities of his movies. They have the same silence, the same strictness, the same strange blend of gravity and humor.<br><br>The General might be the most serious comedy every made, but it's not a tragicomedy. That, as in Chaplin's blending of pathos and low humor, was something people took to immediately. But no one knew what to make of The General. Original reviews accused the film of being dull, pretentious, unoriginal, and unfunny. Even today, people who have heard it acclaimed as one of the greatest movies of all time are sometimes puzzled or disappointed by it on first viewing. The General is challenging because it doesn't flaunt its virtues; like Keaton's concise and economical performance, it holds a great deal in reserve. Take the movie's most famous shot, of a train crashing through a burning bridge, for which Keaton built a real bridge and destroyed a real train. The shot lasts a few seconds in the finished film: he doesn't dwell on it or hype it. Who else in Hollywood would sink money in a spectacular effect and then downplay it? Keaton never forces a response from the audience, never manipulates, never overplays. He doesn't show off his acrobatic skills or his enormous repertoire of comic talents, nor does he play for sympathy. Anything so subtle will always leave some people cold. But for those who can see the expressiveness of Buster's so-called \"stone face,\" who get his peculiar dry humor, who appreciate the rigorous purity and taste he displayed, these virtues are all the more stunning because they are understated. Buster Keaton always has more than he's showing; you can see it in his eyes.","user":"imogensara_smith","rank":[96,106]},{"title":"Loco and Motive","rating":14,"date":"14 May 2008","review":"No one will top Keaton for physical risk, and risk is what deep film experiences are all about. This might be classed as a comedy, but for me it touches deeply enough. Its about a man who needs to prove himself by taking risks and being true. And its by a man who takes even greater risks and is more true. True to the spirit of the social compact, here displayed as the chummy south.<br><br>He's always done stunts that amaze. Many of his other films have things in them that if the timing were only a little off, he'd be seriously injured, or die. But this takes the cake. Its almost as if he started with the idea that he'd have three locos to play with and had a year to think up stunts. <br><br>And the stunts are so physical! And so dangerous. And so, so very effective. <br><br>His trademark is the deadpan face placed as a sort of innocent cluelessness. Its particularly funny when you see the physical movements and you know that 1) they take incredible preparation and timing to pull off and 2) the fellow you see that looks so puzzled by the reality you see is the guy that devised and directed those stunts.<br><br>Ted's Evaluation -- 3 of 3: Worth watching.","user":"tedg","rank":[36,42]}]