[{"title":"What a cute movie!","rating":2,"date":"2 April 2002","review":"I never saw this until just today--I was afraid it would turn out to be a dumb film like \"Beatlemania!\" was--but it turned out to be one of the innocently charming films I've ever seen.<br><br>I am a big Beatles admirer, but I wasn't around for this particular time period (I grew up with them during the 70s instead). But this film was sure a fun treat to watch! Delightful slapstick, lots of times completely unbelieveable, but who cares? The fun is in watching these very likeable characters (except that annoying nerd who was goofy and funny but not likeakle, and the Beatle-hater who tries to axe the show... LITERALLY) go through their exciting and silly adventure in their attempts to get tickets.<br><br>I was really laughing HARD while watching this one, and highly recommend it!<br><br>Out of all the characters, the one whom I fell in love with the most was the one young girl who wanted more than anything else in the world to see her beloved Paul McCartney. Long dark hair, just *slightly* chubby, having cute puppy dog eyes and wearing a sweet little pink bow in her hair, I felt so sorry for her. She wanted SO much to see Paul, and it was both funny and terribly heartbreaking at the same time to watch her rush into a phone booth to call the radio station with the correct answer for a Beatles trivia contest and be so anxious with her handful of dimes that she practically *THROWS* them at the phone.<br><br>My favorite lines declaring the Beatles one of life's happiest pleasures come at a scene when the bride-to-be is driving with her future husband (who gives the impression with his short onscreen time that he'd be a real CREEP to her!). Check this scene out and listen to her lines, they're priceless to Beatle fans everywhere.<br><br>I'm afraid I'm not a good judge concerning whether or not non-Beatle admirers will react so favourably to this one... but if they dig slapstick and watching people go berzerk over such ridiculous things as the everyday napkins celebrities use, they just might. I mean hey, I love the Beatles, but I would NEVER go for the nonsense that goes on here! So for both Beatle fans and non-fans, I think it's safe for me to say that this movie works as both a fun piece of nostalgia and a satirical look of human nature gone wild and how crazy some will go when it comes to beloved icons.<br><br>\nOh, and I'm sure Paul finds it VERY flattering as well! Hee hee...","user":"San Franciscan","rank":[26,27]},{"title":"It's Better Than You Might Think","rating":10,"date":"4 August 1999","review":"I thought that this was one of the most interesting comedies ever!  It's hysterically funny from one point to another about these three young girls who are HUGE fans of the Beatles and would do anything just to see them on Ed Sullivan.  What a great idea for a movie.  It's amazing!  It's one of the greatest films I ever saw, and that anyone can enjoy!","user":"IrisNo11","rank":[24,25]},{"title":"Just simple fun","rating":8,"date":"5 June 2000","review":"I never heard of that movie in 1978! I saw it a few years ago and I was asking myself why I never heard of that film in 1978!  This is not a great comedy movie : just plain fun and entertainment, in a very creative and honest way. Even if there's some cliche (the old-fashioned rocker of the 1950's, the beatnik girl, the cars) I think it captures very well the Beatlemania in a teenage 1964 point of view. Young actresses are very good and comedy situation are pleasants. I also love the idea of hearing only the voices of the Beatles, and showing only their feet, as if they were adultes in a children comic strip.  I have this on tape - thanks to PBS! - and I watch it once a year, just for smiling.","user":"MarioB","rank":[16,17]}]