[{"title":"Not the film I was expecting - but superbly made","rating":8,"date":"1 February 2006","review":"I'd been trying to track this movie down for a while so I had high expectations of it, and on some counts it disappointed and on others it actually excelled. I was expecting a propaganda film with a plummy BBC voice-over intoning: 'Here we see the lads of Heavy Unit one, sector c 14, enjoying a pint of bitter and a sing song before their shift.' Instead, I was presented with a proper film with characters and a plot and everything! This struck me as particularly extraordinary having seen the first film on the DVD which was a motley collection of clips of Britain at work for the War Effort, inter-spliced with a lunchtime concert (blitz spirit etc.) featuring Myra Hess wearing what looked like a lab-coat playing piano rather animatedly. <br><br>To make a film with such high production values in wartime, with everything seriously rationed is quite extraordinary. Okay, it portrays the firemen as heroes, but it presents them in a light that is far from uplifting. They are men who work tirelessly and they take great risks, and then they go and do it all over again the next night  none of this wandering off into the sunset with a girl on your arm. By 1943, when the film was made, the blitz was pretty much over, but the horror and uncertainty of the V1s and V2s was yet to come and although the tide seemed to have turned, there was no end in sight at this point. Jennings' stroke of genius was to create a film that identified with its audience and was honest with them, while actually having the humour to keep morale up.<br><br>The use of actual firemen for the characters has its pros and cons  some of them are decent actors, others are very poor, but I should imagine that in 1943 people in possession of an equity card were rather few and far between. There is obviously some stock footage used in the long shots of the burning warehouses, giving a broader picture of what the crew of one pump were up against, which is no bad thing. The stock footage is actually pretty important as it gives a reality that would otherwise be lacking (see also Malta Story).<br><br>All in all this is a triumph of realistic, humanist film-making from the darkest days of our darkest hours.","user":"MrGeorgeKaplan","rank":[19,20]},{"title":"Another Masterpiece from Humphrey Jennings","rating":19,"date":"19 May 2004","review":"This film is a remarkable document. Jennings extracts actor-quality performances - plus that bit extra from using actual firemen and firewomen - from the cast. Add a good story, quality editing and Jennings' eye for a scene or situation and you have a real masterpiece.<br><br>Most of the East End of London has now been more successfully bombed by Hitler's successors - the planners and developers - but, miracle of miracles, the fire station at Wellclose Square is still there, back as a school again. Go there!<br><br>With respect to other reviews, stock footage IS used - but it doesn't detract. As for the reviewer from New York. I wonder if he can see this film in a more charitable light since 9-11?","user":"john-harry-adams","rank":[15,16]},{"title":"A realistic drama documentary about the blitz.","rating":3,"date":"3 February 2002","review":"As in 'The Silent Village' Jennings is here experimenting with improvised dialogue (there was no proper shooting script) and an amateur cast (who were all serving London firemen). However, the result has been expanded into what is virtually a full-length drama.<br><br>Again, there are haunting images. But the whole thing is played in such a low-key fashion that everything looks natural. (One of the fireman who took part said that it was an accurate representation - apart from the omission of the universal swearing!)<br><br>The most famous scene is the group preparing for the nights work. Each enters to a verse of the old counting song 'One Man Went To Mow', which is being accompanied on the piano. How many will be left by morning?<br><br> The film was released in two versions - hence the two titles. It was very well received, but eclipsed by the release of another (more conventional) film about the fire service called 'The Bells Go Down', starring the popular comedian Tommy Trinder. (This is not to disparage this feature film, which was also realistic in its approach.)","user":"shrbw","rank":[13,14]}]