[{"title":"how much is dream and how much is reality, Bergman asks in this infidelity drama","rating":8,"date":"21 February 2008","review":"Ingmar Bergman making a film with characters in a daze as to what to make of their indiscretions in their affairs with men, what a surprise! Maybe there's too much sarcasm in that sentence, and perhaps for the period Bergman was working in (pre Seventh Seal) it's a little too close to a target to make. Bergman was the best at it, so it's not a knock: Dreams is another in one of his probing examinations, however in a manner that almost suggests he wasn't putting as much time and effort into the script as usual (in an interview he said he didn't consider it very highly in his oeuvre, and had some bad memories of his time with Harriet Andersson with their personal relationship, coincidentally her character has a rough break-up early in the picture). But saying that Bergman wasn't putting *as much* time and effort is suffice to say that he still makes it very intriguing, very entertaining (in that suffocating-dramatic Bergman sense where you can feel all humanity sucking out of the room and back in again with every beat in some scenes), and with a take on the sexes that allows for some probing hard to see in other movies.<br><br>We're given two women who work in the fashion photography profession, one a model (Andersson) and the other a producer/director type (Eva Dahlbeck). At the start we get right into a claustrophobic sense of unease for these girls set right by the tone of a man in the room- a fat man tapping his fingers while waiting for a shot to set up, and then once again on another one. Tension spills out in the dressing room, the engagement off between Andersson and her fiancée. Meanwhile, Dahlbeck calls her lover who can't come to the phone for long. After this Bergman starts to play a sort of trick on the viewer: what happens to these women with their respective men, is it dream or reality? Andersson's situation is that she's looking at dresses through the outside windows, and an old man (Gunnar Bjornstrand, with a nice old-man beard that isn't too shabby) offers to buy her the dress, jewelry, whatever she wants. To display the generational gap she asks for chocolate with whipped cream and- as something I thought I'd never see in a Bergman film- a rollicking trip to the amusement park to ride rollercoasters and shift through a haunted house.<br><br>This all seems to be leading to a note that suddenly becomes all the more clear, and I wondered \"what gives?\" if this was Bergman presenting dreams. Perhaps he means in the more fragmentary sense of \"well, these women have dreams of some men, but... these aren't them\". This leads to Dahlbeck's scenes which are a good, sharp contrast to Andersson's. With the latter there's some blocks where the two don't talk (she puts on a record that spins some cool jazz as the two dance a little and have a silent-movie repore with champagne), and for the former it's what some fans of the late Swedish filmmaker love more than anything: characters in personal agony over not realizing a personal connection, through lots and lots of dialog. What's impressive here isn't so much the performances per-say, which are a little cold, but how much restraint Bergman has with the camera as this situation with Dahlbeck's cold professional (she fires Andersson at one point for being late with the old man) turns into a fool-hearty tug-of-war of emotions between an equally cold wife of Dahlbeck's lover. If there is any one juicy section in Dreams, and not counting specific scenes like when Dahlbeck has her head out the window of the train (which is very beautifully executed), it's this one.<br><br>Somehow Bergman pulls out a semi-happy ending, if not without a bit of a coda as to what may happen with these still emotionally entangled souls. If only the structure somehow was worked out a little better (I'm not sure how I could criticize it more than that- even a flaw from a genius is still a genius move, if that make sense) it would be a great film. As it stands there's a lot of greatness in the film, only to feel very slightly like an excellent minor work. Still, stay tuned for little winks to the audience, like a rare Hitchcock type cameo (strange considering Bergman's opinion of the director), or a mention of the last time Bjornstrand's lonely rich old man saw a movie- 1918- which is Bergman's year of birth. 8.5/10","user":"Quinoa1984","rank":[15,15]},{"title":"\"Our sadness weighs down the film...\"","rating":8,"date":"14 April 2008","review":"Ingmar Bergman's early film Dreams (1955), beautiful but sadly underrated and little known, presents the stories about two dissimilar women and their loves, and touches on all the timeless and tough realities of torment, longing, loneliness, and aging in a simple and sublime way. Everyone who ever was madly and desperately in love and for some reasons could not be with the object of their longing should appreciate this film. Speaking of making Dreams, Ingmar Bergman comments, \"By this time Harriet (Andersson) and I had terminated our relationship, and we were both feeling quite sad. Our sadness weighs down the film\". Bergman regulars Harriet Andersson and Eva Dahlbeck (both will play in the same year's Smiles of a Summer Night, a very successful and sparkling Bergman's comedy) portray two women, the owner of a model agency, Doris (Dahlbeck) and her top model, Susanne (Andersson). A major figure in Ingmar Bergman's films of the 1950s, Eva Dahlbeck was stunning - an elegant, poised, sophisticated classical blonde beauty with high intelligence and the talents in acting and writing.<br><br>Harriet Andersson was discovered at the age of 20 by Ingmar Bergman who made especially for her screen debut the film \"Summer with Monica\". Extraordinary and versatile as an actress, her roles ranged from the naive young girls with erotic charisma to the young woman losing her grip with reality in Through a glass darkly (1962) to the fearless breakthrough performance as a dying woman in Cries and Whispers. In Dreams, she is absolutely charming. Camera loved her - sexy, sweet, and innocent, she lit the screen in her every scene.","user":"Galina_movie_fan","rank":[20,21]},{"title":"Overlooked Bergman Film","rating":20,"date":"20 November 1999","review":"A delightful film about the love of two women-the owner of a model agency and her top model. On a photographic outing to another city, both have strange day affairs with married men. The film, as relentless as it is tender, is a deeply probing study into the psyche of desire. Bergman's success is derived from exquisite scenes of austere romanticism and painful irony. Rarely has sexual obsession been so accurately observed. Dreams is yet another masterpiece by Bergman, yet sadly underrated and unknown. For anyone who appreciates great storytelling, and masterful filmmaking should do themselves a favor and watch \"Dreams\". Note: Look for Bergman's cameo as the man with the poodle at the hotel.","user":"iF....","rank":[12,13]}]