[{"title":"Painful to watch--and I like that in a comedy!","rating":8,"date":"10 June 2007","review":"This style of movie from Steve Martin is surely not everyone's taste, as the overall rating on IMDb isn't particularly high and this movie has been pretty much forgotten by most people. However, I have always liked this film and have seen it several times--even though my wife thinks the humor is, at times, very painful to watch. I actually like that kind of humor on occasion and when horrible things keep happening to nice guys Steve Martin and Charles Grodin, I laugh while others might feel sorry for the schmoes. What I particularly like are the very surreal moments buried within a somewhat conventional film about Martin's lonely bachelor life. My two favorite skits were his dining alone at a restaurant (a classic) and when he's up on the roof screaming about how meaningless his life is...only to then see EXACTLY the same thing going on rooftop after rooftop across the city. In addition, while painful, there is also a wonderful likability and charm about the film and the performances of the leads. A nice and funny film but not necessarily for all tastes.","user":"MartinHafer","rank":[15,19]},{"title":"For \"Anyone Who Had a Heart\"","rating":9,"date":"1 July 2005","review":"I'd call this a small masterpiece.<br><br>I usually watch just ten minutes of a movie, find it boring, then discard it. Or, I fast forward through great big sections of a film and get satisfaction from the leftover bits and pieces. With this one I never once reached for the fast forward button. It is charming, touching, lovely, hilarious and satisfying. One cares deeply for the characters played by Martin and Grodin and wants happiness to come their way.<br><br>The sadness never overwhelms because the lighthearted scenes make for a perfect balance.<br><br>You could go through a whole row at Blockbuster and not find a gem like this one. If you have even just a touch of a tender heart, by all means rent this one.","user":"sopher43","rank":[21,28]},{"title":"A movie for anyone who has ever felt lonely - at least you're better off than these guys!","rating":7,"date":"17 May 1999","review":"A movie about being lonely, doesn't grab you as the obvious subject to make a comedy about does it? But this movie does wonderfully.<br><br>Great performances from Martin and Grodin especially (in what in my opinion his is best ever role) as he guides Martin's character through what it is to be a lonely guy, from cocktail parties with cardboard cut-outs of film stars, to standing in as an opening act when their friends are going to be late for dates.<br><br>This he learns so well he turns it into a best selling book and eventually finds true love. A wonderful movie that will comfort anyone who is feeling a bit down as it shows that things could be so much worse.","user":"Bing-18","rank":[17,23]}]