[{"title":"Dana Andrews: Noir's haunted conscience","rating":9,"date":"13 July 2006","review":"We're a long way from LAURA. Once again Otto Preminger directs, Dana Andrews stars as a police detective named Mark, and Gene Tierney is the beautiful woman who haunts him, but nothing else about WHERE THE SIDEWALK ENDS resembles everyone's favorite sophisticated murder mystery. Instead of deliciously quotable dialogue we get gritty, harrowing realism. While the earlier film took place in the ritzy upper echelons of New York society, here we're in the low-rent district of dark streets, hoodlums, cheap restaurants and crummy flats. Tierney, gorgeous as ever, now works as a department-store mannequin and lives in Washington Heights (the neighborhood of the \"doll\" who once got a fox fur out of LAURA's Mark McPherson). This time Andrews is Mark Dixon, an older, sadder, more troubled version of the cool cop in a trench coat. <br><br>WHERE THE SIDEWALK ENDS belongs to a sub-genre of noir, movies about police brutality focusing on cops who can't control their violent impulses. Like Kirk Douglas's character in DETECTIVE STORY, Dixon owes his seething contempt for crooks to his father's criminal past. Where Douglas is self-righteous and blind to his own faults, Andrews is burdened by repressed guilt and self-loathing. He accidentally kills a suspect and covers up his actions with an attempt to throw suspicion on a slimy gangster (Gary Merrill) whom he has been vainly pursuing for years. Instead, a kindly cab driver is suspected because he's the father of the dead man's estranged and mistreated wife Morgan (Gene Tierney). Dixon, falling in love with the wife of the man he killed, tries desperately to save her father without giving himself away. <br><br>Among noir protagonists, Dana Andrews had this distinction: he was incapable of appearing unintelligent. Even when playing an average Joe, as he usually did, he always comes across as unusually sensitive and perceptive; more than that, his air of being too thoughtful for his own comfort gives him that haunted--and haunting--quality that was his essence as an actor. He played ordinary guys, cops and soldiers, but always with a tragic undercurrent of seeing and knowing too much. His conscientious heroes are marked by exhaustion, guilt, the inability ever to \"lighten up.\" No other actor could have expressed so well the bottled-up anger, the slow-burning pain, the agonized intelligence of Mark Dixon. He also has a muted tenderness, a muffled warmth and even wry humor that make him heartbreaking. This comes out when he takes Morgan to a restaurant where he's a regular, and for the first time we see this cold, brutal man trading mock insults with the waitress, whose sarcasm can't hide her affection and concern for him. When Dixon asks his partner for money to get a lawyer for Morgan's father, he supplies it even though they recently argued and Dixon threw a punch at him. There are no words about loyalty or knowing he's a good guy deep down, but we see it all in the man's anguished silence and his wife's resignation as she hands over some jewelry to pawn. Dixon's goodness comes across through other people's reactions to him as much as through Andrews's deeply moving performance. <br><br>Though Dana Andrews was a minor star, he may be the quintessential forties man. He goes through some movies hardly ever taking off his overcoat; with that boxy, mid-century silhouette, further fortified by the fedora, the glass of bourbon, the cigarette he doesn't take out of his mouth when he talks, he looks imprisoned in the masculine ideal of toughness and impassivity. While many noirs romanticize the two-fisted tough guy, WHERE THE SIDEWALK ENDS offers an unflinching portrait of the reality behind the façade, a gripping and melancholy exploration of the roots and consequences of violence.<br><br>Andrews was sadly underrated in his own time (he was the only one of the three protagonists in THE BEST YEARS OF OUR LIVES not nominated for an Academy Award, though his low-key performance is far more compelling than Frederic March's hammy, Oscar-winning drunk). Fortunately, Andrews appeared in some films that ensured his immortality, and now at last this little-known film, which contains his best performance, can be seen as part of the marvelous Fox Film Noir set. This series, including a number of never before released titles (such as NIGHTMARE ALLEY and THIEVES' HIGHWAY), suggests that Twentieth-Century-Fox may have had the finest record of all the major studios when it came to film noir.","user":"imogensara_smith","rank":[71,82]},{"title":"Amazingly well made","rating":9,"date":"10 February 2006","review":"At first glance, it would seem natural to compare Where the Sidewalk Ends with Laura. Both have noirish qualities, both were directed by Otto Preminger, and both star Dana Andrews and Gene Tierney. But that's where most of the comparisons end. Laura dealt with posh, sophisticated people with means who just happen to find themselves mixed-up in a murder. Where the Sidewalk Ends is set in a completely different strata. These are people with barely two nickels to rub together who are more accustomed to seeing the underbelly of society than going to fancy dress parties. Where the Sidewalk ends is a gritty film filled with desperate people who solve their problems with their fists or some other weapon. Small-time hoods are a dime-a-dozen and cops routinely beat confessions out of the crooks. Getting caught-up in a murder investigation seems as natural as breathing.<br><br>While I haven't seen his entire body of work, based on what I have seen, Dana Andrews gives one of his best performances as the beat-down cop, Det. Sgt. Mark Dixon. He's the kind of cop who is used to roughing up the local hoods if it gets him information or a confession. One night, he goes too far and accidentally kills a man. He does his best to cover it up. But things get complicated when he falls for the dead man's wife, Morgan Taylor (Tierney), whose father becomes suspect number one in the murder case. As Morgan's father means the world to her, Dixon's got to do what he can to clear the old man without implicating himself.<br><br>Technically, Where the Sidewalk Ends is outstanding. Besides the terrific performance from Andrews, the movie features the always delightful Tierney. She has a quality that can make even the bleakest of moments seem brighter. The rest of the cast is just as solid with Tom Tully as the wrongly accused father being a real standout. Beyond the acting, the direction, sets, lighting, and cinematography are all top-notch. Overall, it's an amazingly well made film.<br><br>If I have one complaint (and admittedly it's a very, very minor quibble) it's that Tierney is almost too perfect for the role and her surroundings. It's a little difficult to believe that a woman like that could find herself mixed-up with some of these unsavory characters. It's not really her fault, it's just the way Tierney comes across. She seems a little too beautiful, polished, and delicate for the part. But, her gentle, kind, trusting nature add a sense of needed realism to her portrayal.","user":"bensonmum2","rank":[34,38]},{"title":"One of the best detective films of the Fifties!","rating":8,"date":"6 September 2001","review":"Perhaps the most gripping and intelligent of crooked cop movies is Otto Preminger's 'Where the Sidewalks Ends,' from a really excellent script by Ben Hecht based on the novel 'Night Cry' by Frank Rosenberg...<br><br>Dana Andrews is the honest, tough New York policeman, always in trouble with his superiors because he likes his own strong-arm methods as much as he detests crooks... When he hit someone, his knuckles hurt... And the man he wants to hit is a smooth villain (Gary Merrill) who points up the title. 'Why are you always trying to push me in the gutter?' he asks Andrews. 'I have as much right on the sidewalk as you.'<br><br>Dana Andrew's obsession and neurosis are implanted in his hidden, painful discovery that he is the son of a thief... His deep hatred of criminals led him to use their own illegal methods to destroy them, and the pursuit of justice became spoiled in private vendetta...<br><br>By a twist of irony unique to the film itself, Dana Andrews and Gene Tierney of 'Laura' are united once more, and Andrews now seems to be playing the same detective a few years later, but no longer the romantic, beaten down by his job, by the cheap crooks... This time, he goes too far, and accidentally kills a suspect... The killing is accidental, the victim worthless, yet it is a crime that he knows can break him or send him to jail...<br><br>Using his knowledge of police procedure, he covers up his part in the crime, plants false clues, and tries to implicate a gang leader, but cannot avoid investigating the case himself... The double tension of following the larger case through to its conclusion without implicating himself in the murder, is beautifully maintained and the final solution is both logical, satisfying, and in no way a compromise...<br><br>The film is one of the best detective films of the 50's, with curious moral values, also one of Preminger's best... <br><br>Preminger uses a powerful storytelling technique, projecting pretentious camera angles and peculiar touches of the bizarre in order to externalize his suspense in realism...","user":"Nazi_Fighter_David","rank":[45,52]}]