[{"title":"Insights and Reflections","rating":10,"date":"17 August 2005","review":"Here, the Up series began in earnest. \"Seven Up!\" and \"7 plus Seven\" were shorter, and the interviewees, naturally, didn't have much of interest to say. Listening to what silly things cute children have to say doesn't make for a very serious or interesting documentary. The interviews at 14 weren't of much initial value, either, especially with the shyness of two of the participants. Yet, I did enjoy listening to and contrasting the political ideals of young socialist Bruce and conservative John, as well as contrasting their manners. The first two segments do gain importance and value, though, with this and the following installments, as parts of them are intercalated with the new interviews. It's not even necessary to see previous Ups, as a result; each of the latter documentaries stands well on its own.<br><br>At twenty-one, the subjects are now young adults and are naturally more insightful, reflective and, importantly, more articulate. Here, as well, Neil had taken shape as the most compelling figure in the series; he is now melancholic, nervous and poor. And, in this episode, he is bitter when discussing his parents and upbringing. With the other participants, I saw confidence and contentment, especially compared to when they were teenagers, even if they were uncertain of their futures--or chain smoking.<br><br>What Michael Apted and the filmmakers did with the film that I especially liked was that they brought the gang together to watch the previous two films and caught their reactions to the films and asked them their thoughts on the series. Generally, it seems, they don't see the importance or purpose of the series; perhaps, they even see it as somewhat of an intrusion. I suppose I wouldn't see the purpose or significance of the first two films, either, without having seen \"21\" and the subsequent films that aggrandize upon their beginnings; it's the subsequent films that give the previous ones significance. As far removed or alienated as one seems at twenty-one from his seven-year-old self, the Jesuit proverb still holds truth, as Apted discovers.<br><br>Early in the film, Neil says that by bringing the group together, the filmmakers might be defeating their original purpose of examining class, or socioeconomic, barriers. And, that focus does seem to be forgotten at times in this addition, although, I suspect, for different reasons. Not only has the series taken on more significance than its initial intent, but also, the interviewees are now more concerned with themselves; even on their pasts, there is more reflection and insight. They're looking inward, planning and thinking about their futures and thus looking forward.","user":"Cineanalyst","rank":[13,13]},{"title":"A wonderful film in a great series.","rating":9,"date":"14 May 2005","review":"What a wonderful series of films! The 'Up' movies are certainly the most interesting documentaries I have seen. Fourteen people from Britain being interviewed every 7 years of their lives on topics as far ranging as education, marriage, politics, and class. I'm not sure what rewards these individuals find in participating in the documentaries, however I find them very generous in sharing themselves so openly with the world.<br><br>21 is perhaps the least interesting of the series. That is not much of a slight considering how exemplary the whole series is. Myself, I voted a 9 for this instalment. 21 suffers from the uncertainty and guardedness that many of the participants seem to be feeling at this age. Many are just finishing their schooling. They are unsure of what they should do next. They lack the distance from their education to make a clear judgements about it. Most have not yet entered a long term relationship or had children. Perhaps the director could have used this state of transition better and improved his film slightly. However, these complaints are small.<br><br>21 is significant in that all the individuals are still participating in the film. Seven years later, in '28 Up\" the first two people will drop out. As well, at the age of 21, the interviewees are more articulate, thoughtful, and independent then at previous ages.<br><br>The theme of the documentary continues to be an investigation into 'class mobility'. Personally, I enjoy watching these people, who are much older then myself, grow up. All change, and yet very few stray very far from who they were at the age of 7. The shy 7 year old girl is a quiet 21 year old. The outgoing and direct 7 year old boy is the same at 21.<br><br>While all the characters in these films are so very interesting (mostly because of how real they all are), three stand out for me: John - a self-assured upper-class individual who has is very sure of his beliefs despite how harsh they sometimes come across as being. It is a shame he did not participate in several of the following documentaries. He seems to suggest he feels the films do not portray him fairly. This is a fair complaint considering the interviews only occur every 7 years leaving a lot of living off screen. It would be very interesting to see how he changes as he experiences life.<br><br>Tony - who is so direct. Tony sets a goal and goes off to achieve it. Of the people being interviewed he often seems to be the most happy because, well, he just chooses to be happy and satisfied with what he has.<br><br>Neil - perhaps Neil is the most interesting character. At 7 he seemed so bright and happy. Yet at 21 he is a squatter. Nick's journey, particularly in the next 2 films, is the most interesting. He is the character who stays with you the longest and most clearly.<br><br>Overall, 21 is another wonderful film in a great series. It can not be recommended enough!","user":"Skeeter700","rank":[8,8]},{"title":"At 21, coping with the responsibilities of young adulthood.","rating":17,"date":"17 February 2006","review":"Michael Apted must be congratulated for having (or perhaps stumbling upon) the vision for this study. Begin with 14 seven year olds in England, film them in a few interesting situations, and follow those same kids as they grow up. Every seven years. Because all of our lives transpire at roughly the same rates, we cannot actually observe children growing up. But this filmed approach is the next best thing.<br><br>Each film gets longer, and this the third one is the longest yet. The production values are better and it no longer resembles a home movie so much. Now we get to see the same children at 7, 14, and 21. What a difference the 7 years made. From imagining what college they might go to and now seeing them in their final years of college, studying advanced subjects, grappling with what their professions will be. Or, in the case of some of the girls, already married with children. Still, we can identify characteristics that have stayed with each as they grew up.<br><br>We also see clearly for the first time how much the \"process\" has influenced the \"product.\" In science the \"uncertainty principle\" tells us that the more closely you try to measure something the more your measurement technique changes what you are measuring. It is the same here. The participants are acutely aware of the process, and of their responses at 7 and 14, and they discuss them. To some degree who they are at 21 is a product of having been in the \"UP\" series.<br><br>This and all the others through '42-UP' in 1998 are on the 5-disk DVD set just out. (\"49 UP\" has been made but is not yet available on DVD.) However, simply seeing the most recent film (42-UP or 49-UP) is pretty good, because each film contains snippets of each of the former ones, allowing us to see how each child developed in 7-year increments.<br><br>Just a marvelous study of growing up.","user":"TxMike","rank":[10,13]}]