[{"title":"Classic anti-hero","rating":17,"date":"17 December 2003","review":"Snake Plissken is the classic anti-hero, ala Clint Eastwood's Man-with-no-name.  Plissken is an ex-soldier turned criminal, recruited/blackmailed into rescuing a hostage president from the prison of New York City.  Plissken is a walking ball of anger and a survival machine. He fought for his country but had everything taken from him, so he started taking back.  Now, he has to rescue a man he doesn't care about, if only to survive long enough to take his revenge on Hauk and the government.<br><br>John Carpenter's film is a masterpiece of dark humor, suspense, and great characters.  The film channels the anger and distrust of the post-Vietnam/Watergate era, as well as the then-current Iranian Hostage crisis.  Plissken represents, in a fashion, the Vietnam vets who did their job, even if they didn't agree with or understand their war, but came back to nothing.  The film's novelization explores these themes better than the movie, but it is hinted at in Hauk's briefing.  It also depicts a fascist police state, one that some would say is not too far from reality.<br><br>Kurt Russell is excellent in what was a breakout performance for him.  Up to this point, Russell had been stuck in low budget comedies, following the end of his Disney days.  This performance, coupled with another collaboration with Carpenter, Elvis, led to bigger and better roles.  Russell channels Clint Eastwood to give Snake a menacing, if laconic quality.  Much like a real serpent, Snake watches and strikes when he is ready; with speed and impact. Russell is able to say a lot with little dialogue, through his body language and facial expressions.<br><br>The supporting cast is wonderful.  Adrienne Barbeau is the beautiful, but deadly Maggie.  She is partnered with the intelligent, but slimy Brain. Their's is a symbiotic relationship; each provides something the other needs.  Harry Dean Stanton, a great character actor, presents a Brain that is smart, but ruthless, and more than a bit cowardly. Isaac Hayes is The Duke, ruler of the prison.  Hayes is a bit uneven, as he wasn't an experienced actor (he had at least one movie before this) but he is a charismatic performer and ultra-cool.  Donald Pleasance is the consummate politician, a big man in his controlled environment, but lost in a world outside his; one he had a hand in creating. Ernest Borgnine is tremendous as Cabby, the answer man and link between Snake and the rest of the cast, as well as to the past of New York.  Finally, Lee Van Cleef brings some of that Angel Eyes magic as Hauk, the prison Warden.  Hauk is an ex-soldier and identifies with Snake.  The difference is, Snake rebelled against the system that betrayed him; Hauk joined it.  This was Van Cleef's last good role, before he was saddled with mediocrity in his tv series, the Master, and became the butt of jokes on MST3K.<br><br>The film moves at a brisk pace and the dark lighting carries the sense of mystery, isolation, and destruction.  Carpenter is able to convincingly hide the fact that he shot this film in St. Louis and LA, and make you believe it is New York.  Although there are gaps in logic and missing information, the pace doesn't let you dwell on it.  There is a constant feeling of the race against time.  If there is any complaint, it's that the budget sometimes holds back some of the action, but characterization makes up for it. Also, the dark lighting is sometimes too dark, and details are obscured.<br><br>The new special edition dvd brings a treat to long-time fans:  the deleted opening bank robbery and capture of Snake Plissken.  Since I had read the novelization before seeing the film, I had long wondered what this sequence had looked like.  Although it does explain why Plissken is on his way to the prison when Hauk intercepts him, it doesn't really work in context with the rest of the film.  The sequence worked well in the book because of Snake's inner monologue and memories of his mission in Leningrad and the loss of his parents to government action.  We understand Snake's hatred of the government and his nihilistic nature.  In the sequence, as shot, we don't really get a sense of who Plissken is; just that he has apparently committed a crime and is on the run.  We don't really get a feel for his relationship with his partner, which affects the emotional impact at the end of the sequence.  Ultimately, the film works better without this footage.<br><br>A note on the commentary track:  Ox Baker was not seven feet tall.  He is probably closer to the 6'6\" to 6'7\" range, although he was over 300 pounds. His bulk makes him appear larger than he really is, especially in a wrestling ring.<br><br>One used to wonder what this film would have looked like with a bigger budget.  Carpenter sort of answered that with the sequel, Escape from LA. It was essentially the same film, with better effects and a West Coast sensibility; but, it doesn't hold a candle to the original.  The lower budget caused the cast and crew to be more creative and they succeeded far better here.  It would be good to see Snake again, but in a new environment, with a different plot.  Russell's age could be an asset, as Carpenter could examine an older Snake, who must rely more on cunning than physical skills.","user":"grendelkhan","rank":[119,147]},{"title":"A classic film John Carpenter's the best Action Sci-Fi flick","rating":10,"date":"15 October 2015","review":"Escape from New York is a 1981 American dystopian action film co-written, co-scored, and directed by John Carpenter.A classic film. <br><br>Escape From New York (1981) Is also one of my personal favorite classic Action Sci-Fi John Carpenter movies. It was also the first movie I ever saw from John Carpenter as a child and It I still the best movie in my opinion. I love this movie to death I own it on Blu-ray tough it doesn't have great video quality like it should have I still love it to death. Kurt Russell is Snake Plissken period! Also Lee Van Cleef Is also in it from a Few Dollars More and The Good, The Bad and The Ugly I just love those Western movies to death. Adrienne Barbeau from The Fog is also in it and she is the beautiful, but deadly Maggie.<br><br>The plot is set more in the future American by the late 90's. In 1997, when the US President crashes into Manhattan, now a giant maximum security prison, a convicted bank robber is sent in for a rescue. In a world ravaged by crime, the entire island of Manhattan has been converted into a prison which houses the world's most brutal inmates. And when the President of the United States crash lands inside, only one man can bring him back: Snake Plissken, a notorious outlaw and former Special Forces war hero who, in exchange for a full pardon, descends into the decayed city and wages a blistering war against the captors. But time is short: in 24 hours, an explosive charge planted inside Snake's body will end the mission -- and his life -- unless he succeeds.<br><br>You've got Kurt Russell, wearing a freaking eye patch and toting a massive assault rifle, squatting in the middle of a fire. You know, just taking it easy, popping a squat while the city burns around him. Non-plussed. Chillaxed. In the background, Lady Liberty's decapitated head lies in the middle of the street, her copper-green eyes staring vacantly up into a crowded, off-kilter skyline. What the hell happened, I wondered. I'd have to wait for Cloverfield to find out, because, as it turns out, that nifty piece of poster art-while summing up the film's nothing is sacred attitude and permanently establishing Kurt Russell as an icon of badass - has no relation to the film's plot. When I finally managed to see the movie, I kept waiting for Lady Liberty's head to get blown off, but it never happened. I was a little disappointed. And in a way, that's still how I feel about Escape From New York. The premise is a near-perfect action movie set-up, and the world that John Carpenter creates has so much potential for edge-of- your-seat storytelling, but the end result doesn't fully deliver on its promise. But that's not to say that it doesn't have its moments of undiluted awesomeness. Long proclaimed as an action film cult classic, there's surprisingly little action in Escape From New York, at least, not of the Michael Bay, in your face, two explosions per minute variety, the kind to which today's Rockstar-infused audiences are acclimated. Watching the film now, nearly thirty years after it hit theaters in 1981, EFNY seems curiously slow-paced. Snake limps through the city, occasionally bopping a guy in the face, occasionally busting a cap.<br><br>The film is John Carpenter best work I have seen, there are some other films I don't like, Escape From New York (1981) is one of the best cult classic films from John carpenter and Kurt Russell. Kurt Russell's iconic character of all time Snake Plissken is his best roles of all time on the screen, I have ever seen. I also love the sequel to death the same as I love this film. Snake Plissken is an ex-soldier turned criminal, recruited/blackmailed into rescuing a hostage president from the prison of New York City. Lee Van Cleef as Bob Hauk New York Police Commissioner did a great job portraying one of the most memorable characters. I wish he would return in the sequel but he couldn't because 8.later the actor died. Rest in peace Lee.<br><br>I love main theme music from John Carpenter and Alan Howarth and I enjoy some action scenes performed from Kurt Russell in the film.<br><br>I love this film to death and It is my favorite action science fiction flick of all time I love it. 10/10","user":"ivo-cobra8","rank":[45,55]},{"title":"A Snake, a Brain, a Cabbie, a Duke and the President Of The USA,","rating":9,"date":"16 October 2008","review":"It's 1997 and Manhattan Island is a walled off prison, during the flight of Air Force One, the president's plane is taken over by a terrorist and the president ejects out in the safety pod. Sadly for him he lands right in the middle of Manhattan Island, when an armed unit lands inside the walls they are told that the president has been taken hostage and they must get out of their prison ASAP. At a loss what to do, the authorities decide to send one man in alone, ex war hero turned criminal, Snake Plissken, not only does he have to contend with surviving the incredibly hostile prison, he also has a time bomb implanted in his body that, should he not get the president out safely within 24 hours, will explode and mean no more Snake Plissken!.<br><br>Made in 1981 and set in 1997, it's safe to say John Carpenter is not the best predictor of the future around. However his vision of a future where America has thrown all it's criminals on one island, where they create their own society out of harms way, has to rank as an incredibly adroit piece of work. This place is grim and deadly, the flotsam and jetsam of society thrust together in this bleak and desolate place of class separation. What Carpenter has achieved with his usual minimal budget allowance is a smouldering sci-fi classic that may be as daft as they come, but it pulses with cool and cheekily slaps you round the face with its cheeky satirical edginess. I must give kudos at this point to the great production design from Joe Alves, who along with Carpenter has crafted this brilliantly dirty netherworld of crime.<br><br>Our anti-hero of the piece, Snake Plissken, is superbly played by Kurt Russell, the original choice interestingly was Tommy Lee Jones, but Russell fuels Plissken's mantra to make him one of the eighties coolest grumpy bastards!, and his work here is first class in terms of the films apocalyptic structure. Surroundning Russell is a wealth of quality performers each adding their personal bits to this tick-tock stew, Lee Van Cleef, Ernest Borgnine, Donald Pleasance, Harry Dean Stanton, Adrienne Barbeau and Isaac Hayes all earn their money and flesh out the story to the end.<br><br>Calling Escape From New York an action picture would be setting first time viewers up for a real let down, what action there is is minimal but highly effective, the machismo flourishes acting more as a point of reference to the pictures time bomb urgency. I like to think of the film as more a sci-fi adventure yarn laced with darkly comic humour, with of course machismo thrown in as a side salad to accentuate the bleakness of it all, wonderful. 9/10","user":"hitchcockthelegend","rank":[41,51]}]