[{"title":"Enjoyable early Imamura comedy","rating":7,"date":"30 December 2013","review":"Stolen Desire was (I believe) Imamura's second movie, and it already contains may elements of his later, more mature works. While many fans of his may feel that it pales in comparison to his better known movies, it is still very good and is probably as good as any other Japanese movie that came out in 1958.<br><br>The story is about a third rate theatrical troupe that is barely scraping by. Included in the troupe is a young college graduate who feels frustrated by the troupe's lack of interest in his ideas for improving their performances. And then there are those pesky romantic entanglements...The biggest Imamura touch in the film is the very earthy characters, both among the troupe and among the townspeople in the town where most of the movie takes place. While none of them reach of the perverse heights of the characters in Imamura's later movies, there are still thieves and peeping toms, con artists and the like. There is little social commentary, but lots of comedy -- sometimes broad (there are lots of shots of bored actors picking their noses) and sometimes gentle. It's interesting to compare this to Ozu's Floating Weeds which came out a year later. It's not in the same league as that masterpiece, but it's still very enjoyable and definitely worth seeing.","user":"pscamp01","rank":[7,8]},{"title":"a rumbustious comedy that pluckily tackles the conflicts between modernization and tradition head on","rating":7,"date":"26 December 2019","review":"\"The troupe is lead by Taminosuke (Takizawa), a veteran thespian, married to Osen (Sugai) and has two adult daughters Chidori (Minamida, whose demure complexion stunningly betrays the tangible feeling of desire and yearning) and Chigusa (Kita, more open-minded than what we might expect her to be), but our main protagonist is Shinichi Kunida (Nagato, perpetually haunted by ennui or angst, often fly off the handle at the drop of a hat), a university graduate who assumes the role as the troupe's artistic director freshly out of the ivory tower, carrying a torch for the married Chidori, he is simultaneously coveted by the nubile Chigusa, who isn't mincing words about her affection.\"<br><br>read my full review on my blog: cinema omnivore","user":"lasttimeisaw","rank":[0,0]}]