[{"title":"A strange world to enter","rating":20,"date":"20 September 2002","review":"I've seen five of Cassavetes' films, and for all of them, there is a long adjustment time. His filmmaking is so unique that it's initially off-putting. But if you stay with his films, you will soon find yourself engrossed. I wonder if that is one of the reasons most of his movies were so long--to allow for the audience to adjust. In this film, he introduces us to two extremely damaged individuals and we don't realize until the second hour that they are brother and sister. You get a real feel for the \"home movie\" method writer/director/star Cassavetes employed and the house in this movie looks exactly like the house from A Woman Under the Influence, so was this actually their house??? It is just as messy and oddly decorated, as if it had not been picked up in nearly ten years. This movie doesn't seem to have much of a plot, although it plays like an interpretation of Shakespeare's The Tempest. I wonder if this was Cassevetes' intent as he appeared in a modern version of The Tempest (directed by Paul Mazursky) two years before this movie came out. This film could have been a real endurance test as some scenes go on forever. But anyone interested in seeing what has been called Cassevetes' most personal film, and a late career example of his style, should see this. It plays like a swan song to him as he died a few years after he made this. He seemed to have a fondness for serving alcohol to little kids, as this is the third movie I've seen of his where this happens. I haven't mentioned Gena Rowlands--she's just as good here as she was in Faces or Woman Under the Influence. She plays her sick character so well that you really believe that she could bring home all of those barnyard animals. I would not recommend this to anyone looking for entertainment but if you want to see something you surely will not forget anytime soon, then watch this.","user":"drosse67","rank":[17,17]},{"title":"Masterpiece","rating":10,"date":"12 April 2006","review":"After \"Faces\", the Cassavetes' experiment that created a revolution of form (cinema verite used for fictional narrative when this was absolutely 'unacceptable' in Hollywood), \"Love Streams\" gets my vote for his very best work, and one of his two or three true masterpieces. Both John and Gena give the performances of their lives, using their history with each other to create a natural intimacy as brother and sister that is second to none. John also knew he was dying and gave everything left of himself for the camera, and as filmmaker. The project was developed from a play and performed many times in front of audiences with Jon Voight in the lead: another experiment that delivered a unique depth to the material; and after seeing both the play and the movie, I'd say John taking over for Jon was an inspired decision by both of them. When the movie came out, it only played about a week (to comply with a contract with Cannon) before being shelved, not even put out on the art theater or revival circuit. I actually worked at Cannon, where rumor had it that Golem was punishing John for not cutting even a minute out of the long movie. Imagine cutting a masterpiece for just a few more screenings! \"Love Streams\" should eventually find its way to the recognition that it is one of American cinema's greatest achievements.","user":"ewillhark","rank":[34,39]},{"title":"Forlorn Los Angeles","rating":9,"date":"31 March 2005","review":"This is not a movie for \"film buffs\"; nor is it an \"art- house\" movie. Rather, \"Love Streams\" is for those who may be moved by seeing human emotion depicted, on-screen, in the most direct, natural way imaginable.The performances by the two leads are dead- on. Cassavetes, as the drunken writer/ playboy {who hints at his mediocrity with the vapid questions he asks of the female subjects of his presumably forthcoming book}, and Rowlands as his love starved, too-sensitive-for-this-world sister,make you care for them as if they were your own family. And the sense of place- weirdly atmospheric, forlorn Los Angeles, is effective. Another praiseworthy brother-sister movie to consider would perhaps be \"You Can Count on Me\".","user":"Newyorkp9","rank":[20,22]}]