[{"title":"Sometimes the audience knows better than the critics!","rating":11,"date":"11 November 1999","review":"Over the years, I've read a number of professional critics' reviews of this film; almost all were mildly to severely negative.  And here's the interesting thing: I don't disagree with most of the individual carps. Yes, the movie is a piece of fluff. Yes,the usually dependable Danny Kaye is a bit weak in his performance. Yes, the plot mechanism for inserting many of the production numbers is lame.  Heck, even the continuity is poor...I myself have discovered three noticeable continuity fluffs. But here's the thing.  The movie works, anyway!!! Bing and Danny nevertheless make a likeable \"Mutt and Jeff\" duo. The supporting cast all holds their own, from a radiant (and surprisingly voluptuous) Rosemary Clooney, to the astoundingly agile Vera Ellen, to Dean Jagger's Patton-like General Waverly...they all hit their marks very well. The plot-line is unbelievable.  Who cares?  This is a feel-good Christmas Movie, for cryin' out loud!  The production numbers are sheer fun, the plot doesn't get in the way of all the beauty and great music, the actors are obviously having a good time, and we're all allowed to window-peep on the shenanigans.  This is the PERFECT movie to put on after Macy's Parade, while all those who don't like football are helping prep for the big Turkey Day meal.  You sneak a bit of dressing or cranberry sauce, and watch a production number.  The plot is so user-friendly, missing five minutes here and there doesn't hurt. Treat yourself.  Discover why millions of views have made this movie a holiday favorite, despite the critics' opinions!","user":"djkent","rank":[126,140]},{"title":"Magic !","rating":10,"date":"14 January 1999","review":"I have watched this movie countless times over the years and it remains my all-time favorite.. Even now I cannot watch the last scene -  when General Waverley enters the dining room and sees his old troop - without becoming teary-eyed.  It is a great shame that Hollywood no longer makes movies of this quality .","user":"Sisi","rank":[20,20]},{"title":"\".........just like the ones we used to know.\"","rating":9,"date":"11 August 2005","review":"By 1954 the song White Christmas had become such a timeless classic that it was inevitable that a film would be made around it. And of course the star would be none other than Bing Crosby. But who to star with him.<br><br>Originally this was to be the third Irving Berlin outing for Bing and Fred Astaire. Then Donald O'Connor was to co-star, but finally Danny Kaye teamed with Der Bingle. Proved to be a felicitous combination.<br><br>By then Rosemary Clooney had worked in a few films well and more importantly, she had clicked with Crosby on the radio. Bing had teamed with several girl singers over the years, like Connee Boswell, Frances Langford, Mary Martin, Trudy Erwin, Carole Richards, Peggy Lee and a trio of sisters named Andrews. But he always said Rosemary Clooney was it for him and besides Mary Martin, the only other one who did became a leading lady for him.<br><br>It's not remembered because of the success of her solo career, but Rosemary Clooney started as a duo with her sister Betty who retired early to raise a family. So with Vera-Ellen as her sister in the movie, that was an aspect of the plot Rosemary could handle with ease.<br><br>The plot such as it is involves Bing and Danny as a song and dance duo who've expanded into the production end of show business. Through a little bit of a con game worked by Vera Ellen, the two meet a singing sister act like the Clooney sisters were. The sisters turn out to be headed to Vermont to work at a resort and the smitten guys go along with them.<br><br>Problem is there ain't any snow there. It's an unheard of 68 degrees Fahrenheit in early December. And the place is owned by Crosby and Kaye's former commander from World War II, played by Dean Jagger. He's about to lose his shirt and his pride. So our intrepid quartet go to work.<br><br>Irving Berlin's score for White Christmas is about half new songs and the other half from previous scores. That's how it was when you got Irving to work for you. Listen carefully even to the background music. You will not hear one note of a non-Berlin song. <br><br>One of those songs was a personal favorite of mine, Count Your Blessings Instead of Sheep. I recall in grade school in Brooklyn it was a song that the teachers had us sing in the school assemblies. Little did I know that it was introduced by the guy who proved to be my favorite entertainer. It's a patented philosophical Bing Crosby song that he did best and it serves as a ballad to woo and win Rosie. Bing sings it and then Rosie joins him in the reprise.<br><br>Danny Kaye has two good numbers. The first The Best Things Happen While Your Dancing is clearly originally for Fred Astaire, though Kaye and Vera Ellen make a lovely couple on the dance floor. The Choreography number I think was also done for Astaire, but here dancer John Brascia does the complicated dance routine while Kaye sings. I'm sure Astaire would have handled both jobs had the film been made with him.<br><br>All the stars do the Minstrel Show/Mandy number, but Vera Ellen really shines in it. She was a great dancer, really sparkled in every film she did.<br><br>Besides Sisters, Rosemary Clooney has a grand torch ballad that sold a few platters for her in Love, You Didn't Do Right By Me. She had a wonderful singing voice and the most impeccable diction of any female singer ever. You don't miss one throbbing word on any of her ballads.<br><br>White Christmas was Paramount's first film done in their wide screen process called VistaVision. And of course it was proper that their number one star for over 20 years be in this film. Of course jokes about Bing's derrière and the wide screen got into the repertoire of a certain comedian named Hope.<br><br>Just like the song that inspired it, White Christmas has proved to be a timeless holiday classic and will remain so.","user":"bkoganbing","rank":[83,91]}]