[{"title":"Karloff's most memorable","rating":10,"date":"26 November 2003","review":"Even though in 1931 this movie was already a remake, this is an age-old classic. Done in 1931, fully black and white, this amazingly creepy tale still bears the marks of a genuine masterpiece. Having withstood the tests of time, I find this brilliantly directed portrayal just as darkly enchanting as I did 30 years ago. It is hard to believe that it has been over 70 years since this wonderful production was first released, but that not withstanding, it is a hauntingly beautiful, disturbingly tragic work of pure genius which is still just as compelling today as it was when it was made.<br><br>In my opinion, this is also Karloff's best work. In this desensitized society, I feel honored and humbled to be able to view a movie of this caliber. When it was released, it was the scariest thing to be put on film. Today, there are gore effects, CGI, and a plethora of other mediums with which to shock and amaze us. <br><br>Soon, the makeup artists of old will be wholly lost to the industry. If for no other reason, we should cherish these classics. Witness the industry when true artisans plied their crafts.<br><br>The casting of Karloff in this part was the epitome of ideal casting. There was no other actor at that time, who could have contributed to this role, the darkling charm which Karloff demonstrated through this character. Of all the remakes done of this classic, I still favor the original work. The only remake which contains even the smallest degree of the magic of this original was the 1974 Mel Brooks parody, \"Young Frankenstein.\"<br><br>I love this movie, and even by today's standards, it still rates a 9.1/10 from...<br><br>the Fiend :.","user":"Elswet","rank":[13,13]},{"title":"The first Universal monster classic movie I ever saw...","rating":23,"date":"23 March 2000","review":"To clear the air on certain misconceptions that may arise from what I say here, I've read the book. I've liked the book. I realize that the movie truly has nothing in common with it aside from the fact that an artificial man is brought to life in both. But none of the above took away from my enjoyment of James Whale's rightly considered classic film. The tacked on introduction scene and the obligatory happy ending are indeed laughable when one thinks of what is horrific in this day and age, but I was hooked from the surreal credit sequence on. To me, the real ending of this film will always be at the burning windmill, an ending of an all-too-believable tragedy.<br><br>Colin Clive is a little bit overblown as Herr Frankenstein, but he does a capable enough job with the title role (something that is usually tacked onto the monster instead). Edward Van Sloan, a favorite of mine from the Universal stock company, does quite well himself as Frankenstein's old teacher, Dr. Waldmann. As for Karloff...*exhale in admiration* what can I say? I first knew him as the narrator and voice of the Grinch in Dr Seus' \"How the Grinch Stole Christmas\" (I didn't find this out until years later, but find out I did). \"Frankenstein\" marked the first time that I'd ever seen him on the screen for real. From the stiff walk to the eternally mournful face, he made the misunderstood monster his for the ages (it is also telling that, in spite of this, Karloff went on to a long, illustrious, if underappreciated, career). <br><br>Two other facts that stick in my mind about this movie: the creation sequence and the naming of two of it's characters. The heavy-industrial machinery used to create the monster was inspired by the silent Fritz Lang classic, \"Metropolis\" (indeed, many films, from the original \"The Mummy\" and \"Bride of Frankenstein\" to \"Dark City\" and \"The Matrix\" owe a debt to this excellent science fantasy), specifically the grafting of Maria's image onto the android. This machinery, I am told, would later go on to a return engagement in Mel Brooks' \"Young Frankenstein\". Fact #2: anyone who has read the novel will know that the first name of Frankenstein is Victor and his best friend's Henry. Apparently the play (or perhaps the screenplay writers; I've no way of knowing) switched these two around to where we know have HENRY Frankenstein and VICTOR his best friend.<br><br>The only thing that has \"sucked\" about \"Frankenstein\" is its imitators vainly trying to make lightning strike twice (pun intended). But don't bet the house on any ever coming close. A hundred years from now, this brilliant alternate work will still stand as truly classic as the book that helped to inspire it.","user":"keihan","rank":[45,51]},{"title":"Whale's First Masterpiece","rating":10,"date":"31 January 2005","review":"After having been kicked out of school for his controversial work, Dr. Henry Frankenstein (Colin Clive) has been experimenting with the scientific forces behind the creation and perpetuation of life in his private laboratory. With the aid of his assistant, Fritz (Dwight Frye), Frankenstein finally tries his coup de grace--piecing together human parts to create a \"new\" life. When his experiments do not go exactly as planned, Frankenstein and his fellow villagers are endangered. <br><br>Like a few other classics, director James Whale's 1931 masterpiece, Frankenstein, is one of those films that deserves to have every frame analyzed. Unlike most, Frankenstein is one of those classics that actually has had almost every frame analyzed. Countless theses and dissertations have been written about the film and its subtexts, so I can't imagine that I'd add anything novel along those lines in the space provided here. Instead, I'll take a brief look at some of the more straightforward aspects of Frankenstein that, in my view, contribute to its masterpiece status. <br><br>The opening of the film has a very hefty dose of atmosphere, which continues more or less throughout its length. Although it was obviously filmed in a studio--the sky is a painted backdrop complete with wrinkles, this fact actually adds to the atmosphere of the film, even lending a slight surrealism. There is no score to speak of aside from the music playing during the titles, but the sounds that occur are just as effective, such as the ringing bell during the opening. There are also a lot of subtle visuals, and some merely subtly effective, such as the grim reaper at end of a long panning shot in the beginning of the film. <br><br>The seriousness and realism of the grave-digging scene, complete with Henry Frankenstein throwing dirt at the grim reaper, is beautiful foreshadowing. As in the rest of the film, there is nothing jokey about this situation. Watch how effectively the actors convey a sense of toiling and franticness, how they convey the \"weight\" of the coffin. This is a curious fact about the film overall. Although the material is relatively melodramatic, and occasionally extremely so (especially in the case of Henry Frankenstein), the performances always come across as serious and realistic rather than campy (with the possible exception of a single snarling \"growl\" from the monster when he encounters Elizabeth, Frankenstein's bride-to-be). Contrast this to how Tod Browning's Dracula plays in the present day. In that film, Lugosi--although I love his performance--does come across as occasionally campy, especially in the close-ups of his \"hypnotically staring\" eyes. Even the one character that is meant to give some light comic relief, that of Frankenstein's father, Baron Frankenstein (Frederick Kerr), is comic only in that the character is a bit sarcastic, with a dry sense of humor. As such, Kerr portrays the Baron seriously, also.<br><br>The production and set design, as in the sequel, Bride of Frankenstein (1935), adds volumes to the atmosphere and beauty of the film. The interior of the \"watchtower\", where Frankenstein's private laboratory is located, is reminiscent of German expressionist films such as The Cabinet of Dr. Caligari (1920), and they both contrast and cohere wonderfully with the more symmetrical, right-angled lab equipment constructed by Kenneth Strickfaden.<br><br>Because there is no score, the actors have no help in amping up the emotions in their performances. Despite this, rarely has either Boris Karloff's monster or Colin Clive's mad doctor been matched. Whale helps with some ingenious shots and sequences, such as the \"progressive close-ups\" when we first see the monster. He also gives us a number of \"stage-like\" devices that work remarkably well, such as the pans through cutaways in the set that in the film's world do not really exist. Interestingly, Whale has still had the cutaways decorated as if they are extant in the film's world. Although they may seem dated now, Whale's technique of fading to black between scenes also amplifies the sense of \"literary chapters\" in the story, and gives an effective, ambiguous sense of time passage between the scenes.<br><br>Whale also achieves some wonderful, more understated scenes of horror in the film, often set up by contrasts. For example the severe contrast of the villager walking into the wedding party with his daughter, and the surreal bucolic adventure of the villagers working their way through the countryside to find the monster. <br><br>Many younger viewers might have a difficult time watching Frankenstein if they are not used to black &amp; white, slower paced, understated films with a different approach to acting. These classics are an acquired taste for younger generations, but of course it's a taste worth acquiring.","user":"BrandtSponseller","rank":[80,96]}]