[{"title":"The complete European-release version is extraordinary","rating":27,"date":"27 January 2001","review":"The European-release version of \"The Sicilian\" is 31 minutes longer than the US version.  Supposedly, the director was ordered to deliver a version under 2 hours, so he recut the film to render it incoherent with the expectation that Fox would have to release the complete film.  Only, they went ahead and released the deliberately botched shorter cut.  This may be apocryphal, but it would help explain the critical drubbing it got in this country.  I was lucky enough to see the complete film in Paris and was mesmerized.  Gore Vidal was denied credit for the screenplay,  but the film has a literacy, intellectual depth and acidity that is pure Vidal; the character played by Terrance Stamp is essentially Vidal's stand-in.  The only comparable film might be \"The Godfather,\" but with an even stronger historic/political context.  It is certainly the highpoint of Michael Cimino's career to date, and I'm one of those odd ducks that fervently admires \"Heaven's Gate\".  If you can see this in Europe, or if it comes out over there on DVD and you have a region-appropriate DVD player, grab the opportunity to see it.","user":"mjsprech","rank":[40,44]},{"title":"Not such a bad movie","rating":25,"date":"25 October 2004","review":"This is a very well made movie, especially as it concerns scenery and camera angles. However, the tempo of the movie is a little slow and after the initial fifteen minutes or so its seems to emphasize a lot on character development rather then unraveling a plot quickly to keep you interested. This movie gave me the impression that it was intended for a more subdued audience. Eventually it picks up here and there with some violent retribution from those that have betrayed Giuliano. <br><br>I can't emphasis enough about the scenery since that seemed to compensate for the poor dialogue a lot of the time. John Turturro was great in this movie as well as Chris Lambert. The character of Don Masino carried this movie as your classic stolid and shrewed mafia boss and Giuliano, whom Masino admires, poses a threat to his power.","user":"richusa555","rank":[20,28]},{"title":"Salvatore Giuliano, Folk Hero or Mobster?","rating":6,"date":"7 November 2011","review":"For entertainment value, Cimino's 'The Sicilian' does not deliver in the Hollywood sense. That's good in my opinion.<br><br>It viewed some where between documentary and romantic fairy tale. Maybe to many, the latter choice would be more appropriate. I'd place Sicilian, Salvatore Giuliano or Lambert's portrayal smack in the middle. That's because even after doing much research I'm still not sure who the real character was. Probably, no one really knows for sure.<br><br>The plot moves along fine except for the opening flashback from Turturro's cell. Cimino should have axed the scene first cut. The inclusion of the American governess did not help the story line either. In fact, she, the actress gave an unconvincing and unflattering portrayal of Americans (the rich ones) living abroad. At times she swore like a trooper. Most of the film she sounded and looked like a hooker in communist garb, designer that is. I was so glad when she fell off the reel.<br><br>The rest of supporting cast was complementary. Giuliano's accomplices were good enough and just bad enough to add intrigue. Even the crotchety old professor was a good fit as interlocutor between Giuliano, his loyal band of unhappy bandits, the fickle mob and the stripe changing church.<br><br>The film's one weakness is the behind the scene's love affair between the Mafia Don and Giuliano. I found it confusing. Do competing mobsters profess such unrequited love? Perhaps they do in Sicily.<br><br>If you're looking for something in the genre of the non-stop murderous mobster films, then give this one a miss. However, if you are fascinated with Sicily and their mysterious culture, 'The Sicilian' will give you some good glimpses of the stunning mountain terrain, cosmopolitan Palermo and its people both big and small, good and bad.","user":"nzallblacks_12","rank":[8,10]}]