[{"title":"Still funny after all these years","rating":10,"date":"30 January 2006","review":"Some Laurel &amp; Hardy buffs prefer their domestic comedies, the ones where Stan &amp; Ollie have wives and usually try to deceive them in some way-- with scant success, of course --but for hardcore fans there's nothing like watching the boys take on a construction project. Give them a basic task such as building a house, fixing a boat, or putting a radio antenna on the roof, a task requiring a certain amount of physical dexterity and skill, and you're in for twenty minutes of pure slapstick performed by experts. Busy Bodies is a two-reel masterpiece of this comic style, happily unencumbered with any unnecessary plot complications, largely because there's no plot. There's hardly any dialog, either. Stan Laurel doesn't speak at all until the halfway point, and utters only a few carefully chosen words even then. This film seems to have been an attempt to translate the team's silent comedy style into a talkie format, enhanced with cleverly chosen sound effects and the delightful background music of Le Roy Shield. I've always loved the opening gag, as the boys drive to work enjoying a familiar Shield melody (\"Smile When the Raindrops Fall\") in their car. When the song ends they pull over, then Stan gets out and opens the hood, revealing a phonograph with a record that's reached the end of a side. Stan pulls out another record from their collection, carefully wipes it off with his hand, puts it on and drops the needle. The jaunty tune resumes, and they drive on. Long before the days of tape decks or i-Pods, the boys found a way to supply their own cheery soundtrack music!<br><br>Once the guys arrive at the sawmill where they work, however, the mood changes. They must deal with co-workers, and, worse, with their assigned tasks. Viewers expecting an actual story to develop (or hoping a young romantic couple will step in and sing a few songs) will wait in vain, for the rest of the movie consists entirely of Stan &amp; Ollie's increasing messy, heroic, yet ultimately futile attempt to put in a day's work. Stan is apparently supposed to plane some lumber while Ollie adjusts a window frame, but nothing constructive is accomplished. Distractions abound. Props at hand include saws, hammers, nails, two-by-fours, blue-prints for Boulder Dam, and Ollie's severed necktie. A conflict develops with a co-worker (the invaluable Charlie Hall), and then further conflict erupts between Stan &amp; Ollie themselves. A paintbrush is forcibly glued to Ollie's chin, and must be removed. Finally Ollie loses his temper and yanks the entire sink out of the wall. It slams into him and flings him backward. Consequently he is sucked into the building's disposal chute, hurled through its maze-like passageways, and violently ejected from the building in a kind of frenzied re-birthing experience, also receiving a brisk spanking along the way. But the movie's not quite over yet: after all this the boys lose their jobs, and must depart. The memorable closing gag employs a lethal-looking band-saw to impressive effect.<br><br>The climax of Busy Bodies was excerpted for one of the Laurel &amp; Hardy compilation films that came out in the 1960s, thus when I was a kid I was lucky enough to see the finale of this film on a big screen in a theater, where it was enjoyed by a loudly appreciative audience. I'll never forget the laughs that greeted Ollie's wild ride through the disposal chute. In the '70s I acquired a Blackhawk print of the film and still run it now and then, and it still makes me laugh. Laurel &amp; Hardy never received the same degree of respect from critics and film scholars that some of their peers were granted, but for my money they were as great as any of the comedians of their era. And considering the competition, that's saying something.","user":"wmorrow59","rank":[21,22]},{"title":"OSHA was invented because of this two-reeler","rating":9,"date":"7 August 2003","review":"Have you ever wondered why the government formed OSHA to help promote and protect worker safety on the job?  This short demonstrates why OSHA was needed.  No.  It had nothing to do with unions or workers organizing.  It all had to do with Busy Bodies as Laurel and Hardy turn the carpentry shop upside down, backwards and inside out.<br><br>Safety violation 1.  No smoking in the work place.<br><br>Safety violation 2.  Improper use of glue and adhesives.<br><br>Safety violation 3.  Tools used for purposes other than what they were made for.<br><br>Safety Violation 4.  Opening and closing windows improperly.<br><br>Safety violation 5.  Just being Laurel and Hardy.<br><br>Did I mention that Laurel and Hardy were innovative and on the cutting edge of technology.  They were the first to put a disc player in their car.  The only problem is:  Where's the motor?  Their on board phonograph is durable though.<br><br>Busy Bodies is a laugh fest and along with Help Mates and The Music Box is one of the best L&amp;H shorts.  For any L&amp;H  fan or for any fan of comedy, this is a must see.","user":"quickdog","rank":[10,11]},{"title":"20 minutes of slapstick perfection!","rating":9,"date":"15 December 2002","review":"This is probably the only movie that makes me cry of laughing each time I see it and I have seen it hundreds of times! Laurel &amp; Hardy are really getting it on in this one.The way that Hardy gets \"tortured\" is unbelievable but never over the top.Just watch the scene when Laurel slams the door against Hardy after which Hardy slams the door back and gets a huge bucket on his head and then again the door,hilarious! Of course there is also the usual \"in the camera looking\" by Hardy(the scene with the sigar!).Busy Bodies is for me their best short feature and equals their long masterpiece Way Out West (10/10). Laurel &amp; Hardy are truely the Kings of slapstick comedy,if you haven't seen this one you haven't lived! 10/10","user":"erwan_ticheler","rank":[9,10]}]