[{"title":"Timeless Judy","rating":9,"date":"25 March 2006","review":"She bursts into the screen. Every tiny little nuance in her extraordinarily telling eyes are absolutely true and we surrender to her persona without even thinking about it. She was miraculous. \"I'm stupid and I like it\" she tells William Holden with devastating sincerity. She exudes such honesty that it's impossible to be indifferent to her. Ruth Gordon and Garson Kannin concocted a realistic fairy tale that Judy Holliday inhabits (rather than inhibits)with overwhelming naturalness. It is a sensational creation and George Cukor, as usual, puts the camera at her service to magnificent results. Look at the card game, no cut aways from her face for which, I was enormously grateful. If you haven't seen it, rent it now. You'll have an unforgettable time.","user":"marcosaguado","rank":[73,83]},{"title":"A good story and incredible performances make this a film not to be missed...","rating":10,"date":"16 September 2000","review":"One of my favourite films of all time, this Broderick Crawford, Judy Holliday, William Holden vehicle was magnificently written by Garson Kanin and superbly directed by George Cukor.  <br><br>Cukor did something that is seldom done with any film: He decided to rehearse `Born Yesterday' as if it were a play (which it was on Broadway and of which Judy Holliday performed the role of Billie Dawn 1,200 times) and had a complete theater built on one of the studio's soundstages and filled it with an audience so he could perfectly time the laughs and the pauses so the movie-going public wouldn't miss a thing.<br><br>This bit of directing genius is part of what is responsible for the remarkable film that is `Born Yesterday.'<br><br>The other part of the equation is the casting of Broderick Crawford as the slimy, junk dealer turned multi-millionaire, Harry Brock.<br><br>Rita Hayworth was originally slated to star as Billie Dawn but when she married Ally Khan and put her screen career on hold the producers ran through an entire list of potential candidates  It was only with great reluctance that they finally decided to use Judy Holliday in the role she created on Broadway  not believing she was a big enough `name' to pull in audiences. <br><br>Lucky break for them:  She went on to win the first Oscar ever awarded to an actress for a comedic role.  <br><br>Her every movement, glance and word is a study in brilliance of the not-so-dumb blonde, Billie Dawn.  <br><br>Unfortunately Judy Holliday's career was cut short when she died of breast cancer just a few weeks short of her 44th birthday  who knows what kind of work she could have accomplished had she only lived.<br><br>`Born Yesterday' went on to receive five Academy Award nominations, including Best Picture, but the only award went to Judy Holliday for Best Actress; she also won the Golden Globe in the same category that year.<br><br>This is a finely crafted tale of greed, corruption and the ultimate price that must be paid by those that believe they can manipulate the law and the government by for and of the people.<br><br>It is a brilliant movie and should not be missed.","user":"TuckMN","rank":[59,68]},{"title":"Ms. Dawn Goes To Washington","rating":9,"date":"25 December 2004","review":"A brilliant Judy Holliday performance is the main attraction in this witty, brisk adaptation of Garson Kanin's Broadway success. As a gangster's moll who gradually awakens to her civic responsibility, Holliday expands her dumb-broad persona from her previous film with Cukor, Adam's Rib, into a character who's sweet, memorable and surprisingly tough.<br><br>Born Yesterday is a suitable companion piece to Frank Capra's Mr. Smith Goes To Washington, a much more self-consciously \"important\" film that imparts similar messages about political corruption and the responsibility of individuals to require ethical governance. The message is arguably more powerfully imparted here - filtered through the perspective of the selfish, spoiled and barely-literate Ms. Dawn - than in the film focused on Jimmy Stewart's eloquent (and intimidatingly ethical) Mr. Smith, an \"everyman\" who is vastly morally superior to most audience members.<br><br>William Holden is relaxed and charming as the Henry Higgins-ish newspaper man tasked with opening Billie's eyes and Broderick Crawford is suitably broad and menacingly raspy as her corrupt, vulgar boyfriend. However, the movie is all Holliday's from the opening scenes, which play on the audience's lack of familiarity with the actress by presenting her as a refined, statuesque beauty in an extended sequence until, at last, she squawks out her first lines in nearly impenetrable, helium-voiced Brooklynese to hilarious effect.<br><br>A richly deserved Best Actress Oscar for the newcomer Holliday, despite formidable competition from grande dames Bette Davis (All About Eve) and Gloria Swanson (Sunset Boulevard).","user":"Griffin-Mill","rank":[30,33]}]