[{"title":"Magnificent movie with unparalleled acting","rating":9,"date":"13 November 2000","review":"I happened to read the short novel by Kennaway before seeing its movie-version \"Tunes of Glory\". The novel is good, but, quite uncommonly, the film is much better, which is mainly due to the stunning excellence of acting. For instance, reading the book I wasn't quite convinced by the final mental collapse of Jock Sinclair: with his beyond-any-possible-praise performance, Alec Guinness made me wholly understand the deep inner sufferings of the outwardly friendly, tough, rash Scottish officer.<br><br>The story is very simple, few things happens. The film is almost entirely located in the barracks of a Highlanders regiment. Here we find a (somewhat conventional) clash between the lower-class major Jock Sinclair and the upper-class colonel Barrow (John Mills), who suddenly replaces Jock in the command of the regiment. Jock has started as a simple piper, and has gained his grades on the battle-field during World War II. We gather that he is a natural born soldier-hero, with the typical virtues but also with the defects of natural born heroes, for instance a certain lack of intelligence and sensitiveness. For Jock the war was just a stimulating, if tough, adventure, where he had the opportunity to test his courage and honor. Barrow comes from the Military Academy, and has much more education, manners, and, perhaps, intelligence than Jock. And, by sure, he wholly and bravely accomplished his duties during the war, but we see that, differently from the light-hearted Jock, the horrors of the war have left deep traces in his mind, which increased his natural excitability to a breaking-point. He deeply feels the grief of being looked at as an intruder by the tight community of the other officers.<br><br>In the movie we find many subtleties on military life. The attachment to the Highlanders tradition is symbolized by the officers' use of calling each other by first name and of drinking whisky: in this sense, important is the scene when a false friend refuses Jock's offer of a glass of whisky, and takes gin, instead. We realize that this impoliteness is not a trifle as it may seem. <br><br>John Mills is superb in his design of Barrow, and he's only surpassed by Guinness. But the whole cast is fantastic. How good is the \"average\" British actor is always amazing for me. <br><br>Alec Guinness for me is the greatest actor of all times. He doesn't act: he IS Jock Sinclair, as he was the myriad of other characters he BECAME during his glorious career. He is so good that, after all, I think that he was underrated, despite his fame. Rest in peace, great Sir Alec, and thank you for all. <br><br>A final remark. I read somewhere that many British critics and directors, not least Alfred Hitchcock, have considered \"Tunes of Glory\" the best movie ever made. Indeed, even an Italian as myself can feel that this magnificent film touches some profound chords of the British soul.","user":"pzanardo","rank":[79,82]},{"title":"Alec Guinness In A Magnificent, Powerful Performance","rating":10,"date":"27 July 2001","review":"A clash of wills and personalities between two men, one a psychologically scarred idealist, the other driven by ego and his own needs to the point of cruelty, is examined in the peacetime military drama, `Tunes of Glory,' directed by Ronald Neame and starring Alec Guinness and John Mills.  Major Jock Sinclair (Guinness) is the acting Colonel of a Scottish regiment, but as the story begins he has been notified that he has been passed over for promotion and his replacement, Lieutenant Colonel Basil Barrow (Mills) is en route to take command.  Sinclair is a soldier's soldier, a man's man loved and respected (with some qualifications) by his men.  He has clawed his way up through the ranks, was once a piper (he would've been happy as a Pipe Major, in fact, but Hitler-- as he says at one point-- `Changed all that'), and feels strongly that he should have been made Colonel of the regiment. Barrow, on the other hand, is an aristocrat and a third generation officer of this particular regiment.  He suffers, however, from his experience in a prisoner-of-war camp, and has never fully recovered, the impact of which is succinctly expressed when he tells his Captain that he never really came back.  From the beginning, it's an almost impossible situation, and from the moment Barrows arrives the atmosphere is thick with tension as he and Sinclair square off in a contest from which it is readily evident that neither will emerge unscathed in one way or another .<br><br>\tWorking from a tight, intelligent screenplay by James Kennaway (adapted from his own novel), Neame delivers a taut, insightful character driven drama that explores the diversity of human nature, and illustrates the good and evil contained within us all and the traits which ultimately determine which will be the prevalent manifestation of the individual personality. Through the device of placing the protagonist and the antagonist-- each the antithesis of the other-- in a no-win situation, the film examines motivations, actions and reactions that can lead the story in any number of directions, none of which are positive, but all of which are logical and which finally leads to a conclusion that is extremely powerful, incisive and totally believable.  <br><br>\tAs Jock Sinclair, you see Alec Guinness in a role quite unlike anything else he's ever done; it was, in fact, his own personal favorite of all of his cinematic creations.  Sinclair is a man who is course and rough-hewn, an egoist who, when the personal need arises, will wantonly subject those around him to psychological cruelty in order to elevate himself and his position and to assuage his own ego.  At mess, for example, he derides a young officer for not smoking his cigarette like a man; he orders every `man' to drink whiskey, implying that to do otherwise constitutes an assessment of an individual's masculinity.  Boisterous bravura and ribald behavior are his tools of navigation through life, coupled with an attitude of doing things his way or the wrong way.  And Guinness plays it to the hilts.  Beginning with his whole perspective and attitude, he IS Sinclair, while physically he embodies and expresses exactly who this man is and what he stands for.  At times, his eyes fairly bulge with an enthusiasm that suggests a lasciviousness underlying the cruelty; when he walks he strides purposefully, and carries himself in such a way that when he enters a room he veritably fills it and makes his presence felt so that the very air seems oppressed by him.  It's a performance that, even in a strong year of Oscar contenders (Trevor Howard, Lancaster, Lemmon, Olivier and Tracy were all up for Best Actor-- Lancaster won) he deserved to be among them.  In this film Guinness is quite simply unforgettable in one of his most powerful roles.<br><br>\tJohn Mills, as well, delivers a superb, introspective performance as Barrow, capturing the way in which this man must live so inwardly to survive, and conveying how difficult it is for him to continue on while attempting to live up to his heritage and the expectations of a position to which he is clearly unfit in his current mental state.  In Barrow we see reflected the prevailing attitude of the times that `might makes right,' and that anything less is akin to unacceptable negligence, that same military mind-set that put Jake Holman at odds with the world in `The Sand Pebbles,' and led to the unfortunate incident depicted so eloquently in `A Few Good Men.'  It's an excellent, understated, sensitive performance by Mills, who plays brilliantly off of Guinness's brutishness.<br><br>\tThe film also boasts a number of excellent supporting performances, especially Dennis Price, as Major Charlie Scott, whose stoic assessment of himself as well as the situation at hand serves as the film's conscience; Gordon Jackson as the sympathetic Captain Jimmy Cairns; and Duncan Macrae in a memorable turn as Pipe Major Duncan MacLean.<br><br>\tAlso included in this outstanding supporting cast are Kay Walsh (Mary), John Fraser (Ian), Susannah York (In her film debut as Morag Sinclair), Percy Herbert (Riddick), Allan Cuthbertson (Eric) and Angus Lennie (Orderly).  A powerful film that so successfully demonstrates the devastating effects of dysfunctional human relationships and conveys the need to look beyond ourselves, `Tunes of Glory' presents a story to which everyone will be able to relate because the theme is applicable to any setting involving human interactions.  A thoroughly involving film featuring a number of memorable performances (especially by Guinness) that will give you reason to take pause and reflect, and hopefully add some perspective to a world too often mired in unnecessary turmoil.  I rate this one 10/10.","user":"jhclues","rank":[65,71]},{"title":"What fine reviews","rating":8,"date":"8 January 2009","review":"As a very late reviewer I see that very much of what I would have said has already been said so I endorse rather than repeat it. What is surprising is that these lengthy perceptive and very admiring reviews have come not from the film's country of origin but from the USA where it seems to have struck a particular chord. Reviewers have noted Guinness's perhaps finest ever performance as well as, very unusually the fine ensemble playing where script, casting and direction must all have been of similar quality.<br><br>I would take issue with the reviewer who said that the Mills character would never have been given command. Clearly he had been highly educated, had a long and distinguished career in a headquarters job following a traumatic time as a POW of the Japanese. He would have at least earned some kind of moral right at the end of his career and in peacetime to be given the job that he believed he really wanted and might have thought to have been among friends. He would most likely have been highly respected owed favours and been able to pull strings. Had Jock Sinclair (Guinness) - unashamedly uneducated, rough and proud to have been educated in Barlinnie jail, Glasgow and deeply popular with his men not been the officer he replaced, most likely Colonel Barrow would have made a success of it. The whole entirely believable tragedy came about through the grotesque mischance that with these so different characters, one had to wrest command - and respect of the men - from the other. Colonel Barrow's fragility was only exposed when he tried to impose his English \"civilising\" ways on the one person whose whole being rejected them. Bad enough if it had been simply about class, here it was a battle for the Scottish soul. These deeper levels of conflict deriving from earlier historical intra-Scottish battles was suggested by one reviewer. The film tells a story which perhaps could have been set in almost any country with a strong military tradition - France. Germany, Japan etc rather like its near name-sake \"Paths of Glory\" by Stanley Kubrick set in WW1 France. Here though the central conflict presumably had very deep roots in Scottish ethnic and tribal history of clan wars, of Highlanders vs Lowlanders even of those supposed English-loving \"traitors\" who \"sold\" Scotland to \"a parcel of rogues\" (The English) in 1707. It may well be that for Sinclair, the entirely Anglicised Colonel Barrow (gin-drinking, aloof, distant and without a hint of a Scottish accent) represented exactly that kind of treacherous pseudo-Scot.<br><br>One reviewer describes it as \"pure John Ford\" leaving it unclear if he is suggesting that it was similar or derivative. With art in general, its lower and by definition least original forms ape others. This film does not ape any other - as already said the intensity of the conflict derives not just from class but from old old historical grievances between two intimately close nations. In \"Old\" Europe grievances and rivalries ran long and deep. <br><br>Just a rather sad footnote. One reviewer mentioned similarities to earlier John Ford/John Wayne movies. The entire John Wayne archive is to be seen on a continuously circulating basis on two of Britain's five national television channels State broadcaster the BBC and so-called public service broadcaster Channel 4. Yet in contrast Tunes of Glory has rarely been shown. It reappeared 2 years ago but in a poor quality print on a remote satellite channel which plays mainly public domain material. Many of Britain's fine vigorous quality films of the 1960s have never been shown at all on British television until a few months ago when again a very minor satellite channel started showing them: Otley, The Hireling, The Reckoning and others. I did not see them originally and it was revelation seeing the bold acting and directing talent which existed then and how sad is the current decline into the Lock Stock etc formulaic gangster stuff. Very curious indeed that great British films are not shown on the supposed British public service channels and it is left to small satellite channels Movies4Men and Simply Movies to show them. Very curious indeed. Public service broadcasting not in the service of the public.","user":"trimmerb1234","rank":[17,17]}]