[{"title":"A Visually Striking, Thought-Provoking Feature","rating":28,"date":"28 February 2005","review":"The striking visuals would in themselves be sufficient reason to watch \"Häxan\", but in addition it is a thought-provoking feature that combines dark humor, some occasional chilling moments, and perceptive commentary on human nature. It's an unusual package and an unusual feature, and there aren't many films quite like it.<br><br>Simply on the surface, the series of unusual visuals and believable recreations of bygone eras would make for interesting viewing. Benjamin Christensen added a strong dose of the macabre to practically every scene, even in some of the smaller details that are only noticeable upon repeat viewings. Some of it is fascinating, some of it unsettling, all of it interesting.<br><br>But there is much more to \"Häxan\" than a mere collection of grotesque images and vignettes. Towards the end, in particular, the commentary becomes quite pointed. It is quite easy for anyone - film-maker, writer, commentator - to criticize and condemn the beliefs and practices of the Middle Ages or of any other long past era. But it is far more of a challenge to, as Christensen has done here, point out the sometimes devastating parallels to one's own era. It is always such a comforting fiction to believe that we are so much more enlightened than past generations have been, and yet it is rarely if ever true.<br><br>Christensen aptly illustrates the point that the inability to deal with the odd, the eccentric, and the unusual in our fellow beings is a perennial failing of humanity. Each generation simply devises its own means of stigmatizing and punishing those who cannot conform. (Nor is our own generation markedly better than was Christensen's.) This feature can certainly be viewed (either in the original silent version, or in the 1960s version with some spoken narration) for entertainment value alone. But it is even more pertinent in its observations on human nature. It's an often unsettling movie, with some images that might be bit too uncomfortable for some viewers. But for all that, it's an unusual and worthwhile viewing experience.","user":"Snow Leopard","rank":[42,43]},{"title":"I have just finished watching the new Criterion dvd of Haxan...","rating":10,"date":"20 October 2001","review":"And I couldn't be more pleased! I have never seen this film, but thought I would try it out, as I have always had a fascination with the grotesque, mysticism, and the occult. Haxan delivers in spades.<br><br>This 1922 Danish silent film about black magic, witches, satanism, and the persecution of said subjects during the middle-ages, which attempts to make a connection between the ancient phenomena and the modern study of hysteria (modern in 1922), has been wonderfully presented by The Criterion Collection in their new dvd. This new Criterion dvd has the original 104 min. version with a newly recorded 5.0 soundtrack orchestrated from archival documentation, and the 76 min. version released in 1967, which has narration by legendary counter-culture icon William S. Burroughs.<br><br>Watching the original version, I found it full of great imagery and fine silent acting. Emotions and actions are superbly conveyed by the actors, and the sets, costumes, lighting, and effects are all wonderfully done. I especially like the interrogation chamber and the Sabbath scenes, which display lots of good props and much deviltry with rather convincing special effects and make-up. The movie is structured in seven chapters, the first giving a historical account of witchcraft's origins in literature and illustrations. We then are presented with drama plays, having to do with the practice of witches, and the persecution, trying, and torturing of said witches. We are also presented with several instances of the devil manifesting and making demands on his minions. In the end, Christensen attempts to make a correlation between the acts, mannerisms, and various disfigurements anciently attributed to witches and their craft, and the modern affects of hysteria. This is apparently the most criticized part of the film, as mentioned in the commentary, and while it certainly is not as strong as the period dramas, I think it does a good job of raising valid questions, and does work with the film quite well.<br><br>As for the quality of the transfer... with the exception of element specs throughout, and just a few scenes marred by scrapes, the print is very clean and clear. I thought it looked great. True, the print could have been cleaned up a bit more as far as the specs go, but not every film Criterion does will get the star treatment given Akira Kuroswa's \"Seven Samurai\". So long as contrast is good, and edges are well defined, I'm usually a happy camper, and this transfer delivers.<br><br>The new score was arranged by film music specialist Gillian Anderson who attempted to recreate the music presented at the film's Danish premiere as best as possible by referencing the list of musical cues printed in the theater's weekly program notes. It includes works from Franz Schubert, Richard Wagner, Max Bruch, W.A. Mozart, Tchaikovsky, Christoph Gluck, and Ludwig Van Beethovan, as well as others. Anderson  conducted the Czech Film Orchestra in June 2001. The score does an incredible job of accompanying the film, sounds wonderful, and is is presented in 5.0 Dolby Digital.<br><br>There is a knock-out commentary here. Narrated by Danish silent film scholar Caspar Tybjerg, the commentary centers on the director Benjamin Christensen's life in film, the Danish silent film industry, origin of the documentary film genre, technical aspects of Haxan, the cast of Haxan, historical aspects of the study of hysteria in psychology circles, the origins of the devil as a character in media, and of course, the phenomena of witchcraft and witch hunting. References are made to Nosferatu, Cabinet of Dr. Caligari, the German Expressionist movement, The Passion of Joan of Arc, The Seventh Seal, Sigmund Freud... the list goes on and on. While there is an incredible amount of information presented here, with bibliographic references even, Tybjerg does an excellent job of tying it all together and presenting the relevance of the material to the film. This was a very engaging look at Christensen, his film, and the sociological atmosphere both during the middle-ages, and during the time of Haxan's production.<br><br>As for the 1967 version narrated by William S. Burroughs, \"Witchcraft Through The Ages\"... I must say that I have not sat through the whole thing. In fact, I just watched the first two segments before finally succumbing to sleep (I have, gladly, spent a LOT of time with this dvd, but have to sleep sometime). My first impression is, while Burroughs is always so interestingly droning yet intense in the same breath, the jazz score was just plain ridiculous, in the presentation of Haxan anyway. The producer composed a jazz score for the film, which by itself, is some very hip music indeed, but it was just terribly out of place in the film. I'm sure the production was aiming to enhance drug trips rather than present the film itself. With Burroughs involvement, I don't think I'm too far of base in this. I'll have to give it another go when I've had some sleep, so I can watch the whole thing, but I doubt I'll be changing my mind. The jazz score is just too out of place, and as Christensen has often said, dialogue would ruin Haxan, as well as several silent films. After witnessing this 1967 version, I must agree with the director.<br><br>For avid students of special effects, I would make an evening of it with Haxan, as well as Jean Cocteau's \"Beauty and the Beast\", and \"Der Golum\", found on Elite's \"Masterworks of the German Horror Cinema\" dvd set. Much mysticism, magic and enchantment abound in these films, and state-of-the-art at-the-time special effects to boot.<br><br>I am extremely happy with this dvd, and highly recommend it to anyone who is into the study of classic film or anyone who is interested in the occult, whether solely for entertainment or as a study of sociological phenomena.","user":"mutleyhyde","rank":[55,61]},{"title":"One of the weirdest and most bizarre of all time","rating":10,"date":"5 August 1999","review":"More commonly known as \"Witchcraft Through the Ages\", this is definitely one of the most bizarre, visually arresting movies of all time, even nearly 80 years later.  It starts out as a rather dry documentary, detailing medieval superstitions and folklore while showing ancient woodcarvings of witches and demons in various forms.  Then we move on into the dramatic portion of the film.  In one scene we see witches concocting potions using the body parts of corpses from the gallows.  One witch walks in carrying a bundle of sticks, and undoes the bundle revealing a decomposed human hand hidden inside.  Fans of \"The Blair Witch Project\" should take notice, especially considering that the Danish title of this film is \"Haxan\", also the name of the movie company that created \"Blair Witch\".<br><br>Director Benjamin Christensen appears as a leering, tongue-wagging Satan, with very realistic makeup.  The witches are shown with the Devil and his minions performing various acts of sacrilege and perversion that must have been extremely shocking at the time the movie originally appeared, and would be offensive to many people still.  The film was banned for many years because of the depiction of these acts (not to mention the occasional nudity), as well as sacrileges performed by nuns and monks.  There are some stop-motion animation sequences (pre-Harryhousen, no less) that are very good, especially for the time.  This is a difficult movie to describe.  It really is something that you'd have to see for yourself.<br><br>The version I am reviewing is actually the re-issue from 1966, with a dubbed-over narration by beat novelist/junkie William Burroughs, and a modern, jazzy score featuring Jean-Luc Ponty.  I enjoyed Burroughs' narration quite a bit, but oftimes the music is annoyingly inappropriate. Sometimes it works very well, but most of the time I was wishing for a standard orchestral, or vitaphone, score.  A Klezmer score, even, would have been very effective.  There are a few different versions available, some with subtitles and an orchestral score.  Maybe one of these days they'll come out with a version featuring the Burroughs narration along with a more appropriate orchestral score.  That would be perfect.  As it is, this an impressive, compulsively watchable film that still goes further than most dare to go, even in these much more permissive times.","user":"MrETrain","rank":[36,40]}]