[{"title":"This B Monster Film is well worth watching!","rating":16,"date":"16 May 2004","review":"In all fairness this movie should be judged for what it is .... a 1950's B Monster movie flick. I give it high marks in this area. It may not have the shock and scare value as it predecessor \"The Creature of the Black Lagoon\" but I find it to be a good representative of it's genre. A lot of this film was shot at Marineland in Florida at a time before there ever was a Sea World. As a kid I was amazed at some of the scenes in the film such as \"The Creature\" over turning a car as he was escaping the Aqua Park, and jumping out of a huge aquatic tank to attack the audience. Recently I talked with Ricou Browning (who played \"The Creature\") and determined that Universal Studios used wires to turn over the car that was supposedly thrown by the Creature. Wires were once again used to pull the Creature out of the large tank at Marineland as the Creature attacked actor, John Bromfeld. Seconds later he was attacking the Marineland crowd. As a young theater goer I found this fascinating. This film has been taking a lot of heat from some of your web site critics. I think it is well worth watching to see how the old Hollywood crowd use to scare us at the Drive-In. If nothing else it serves as a pleasant stroll down \"memory lane\".","user":"wgie","rank":[26,29]},{"title":"Monsters and Women","rating":7,"date":"7 July 2001","review":"No doubt designed to make a fast buck in the 50s, you still get the Gill Man, one of the coolest of all monster designs ever, and a woman to throw cars for and swim thousands of miles for in beautiful Lori Nelson.<br><br>Even in a production without much life, the Gill Man still seems<br><br>powerful and mysterious, and his biological drive to mate with Ms. Nelson is interesting considering the long lineage of sympathetic monsters in love with knock-out blondes and brunettes. Sadly, the idea of the monster, the tragic beast longing for what is impossible to him (Wolf Man, King Kong, the Mummy) is a distant memory in filmdom. There was the recent DARK MAN, and Nicholson's WOLF, but these are obvious throw-backs to a time when monsters were more than scurrying guerrillas attacking from the shadows or machine-like mass murderers who cannot be killed. I won't count fluffy-haired vampires, whose allure as suave parasites is not \"monstrous\". A monster, in classic terms, in love with a beautiful woman, is denied her by the facts of their existence. Either because of grotesqueness or species-differences,<br><br>the monster endures pain, capture, and often death in his attempt to carry a Lori Nelson in his arms through a moonlit swamp.<br><br>\nIn REVENGE the Gill Man is probed, prodded, and stared at by tourists, definitely the worst fate, though this allows the Creature to establish a magnetic attraction to Lori Nelson. You get a great escape, more Lori Nelson in bathing suits, a big bohunk who has an unhealthy fetish with wrestling the Gill Man hand-to-hand, and lots more Lori Nelson in a bathing suit. What you don't do is watch this movie for any reason but to see the Gill Man thrash in the water and smack<br><br>bohunks...and if you're a fan of the Creature and classic monsters, you'll understand the tragic consequences when you're a walking fish-man who's half-man enough to love a human woman, and whose tears probably would never show, in the depths of the deepest lagoons.","user":"robotman-1","rank":[21,24]},{"title":"The Gill Man Has Esaped!","rating":7,"date":"7 February 2006","review":"**SPOILERS** Fairly good sequel of \"Creature From the Black Lagoon\" has the Rita II traveling back to the Amazon Basin to capture the Gill Man who survived in the earlier film from his would-be-captors or executioners.<br><br>Getting the Gill Man trapped in the Black Lagoon the boat's crew headed by aquatic scientist Joe Hayes, John Bromfield, blast the Gill Man out of the water with high explosives.<br><br>Knocked out and helpless the Gill man is shipped back to the USA to Ocean Harbor Aquarium in Silver Springs Florida to be exhibited to the eager and curious public and examined by scores of scientists and ichthyologists. To see just what he's all about and if he's the missing link between man, before he evolved into a primate, and fish.<br><br>Put in this huge water tank and held down by a steel chain tied to his leg the Gill Man is a major curiosity piece for the thousands of tourists who visit the aquarium. <br><br>Much like in the first Gill Man film the underwater photography is breathtaking with the Gill Man trapped, swimming around in circles, and having nowhere to go. As well as when he's free in the open ocean and in the Amazon River swimming and diving like he were an Olympic Gold Medal winner. <br><br>Examined by Prof. Clete Ferguson, John Agar, and ichthyologist Helen Dobson, Lori Nelson,the Gill Man develops a crush on Helen and that drives him almost bonkers as he's just out of reach of grabbing Helen when she and Clete are studying him underwater. It doesn't take long for the Gill Man to break his chain and escape from the tank. After tearing up the aquarium, and killing a couple of people, he jumps into the Atlantic Ocean and swims away. <br><br>The Gill Man for some reason doesn't travel south to the Amazon River where he comes from but north to the St. Augustine/Jacksonville area in Florida to follow Helen who's there with Prof. Ferguson and her dog Chris.<br><br>Obviously madly in love with Helen but too shy to ask her out on a date the Gill Man spends the last half of the movie stalking her all the way up Florida's Atlantic Coast. He finally gets enough nerve to approach Helen and burst into the local Lobster House, during a Saturday night bandstand party, knocking the place, with it's tables chairs and people, over and putting a couple of drunk party goers into the hospital. Grabbing a terrified Helen the Gill Man disappeared with her into he night.<br><br>The ending was what you would have expected with the Gill Man stymied in his attempt to swim back home, to the Black Lagoon, with Helen and shot up by Prof. Furguson and an army of police and local townspeople but still making a successful getaway.<br><br>Even though the villain in the movie the Gill Man evoked far more sympathy in \"The Revenge of the Creature\" then he did in \"the Creature from the Black Lagoon\". Since he had more screen time and showed genuine sensitivity and feeling for Helen. He was also minding his own business in the safety of the Black Lagoon, when he was kid or creature-napped by a bunch of strangers, the crew of the Rita II. Who's only reasons for doing it was to glorify and enrich themselves at his, the Gill Mans, expense and freedom.","user":"sol1218","rank":[16,19]}]