[{"title":"Be Afraid... Be Very Afraid...","rating":18,"date":"18 August 2000","review":"Oh, I can understand why \"Conan the Destroyer\" is the way it is.  The original, classic \"Conan the Barbarian\" was a hit, but the Hollywood bigwigs decided they could get x-amount more money if they made a more family-friendly sequel, thereby opening the franchise to the lucrative kid's market (never mind that, for as long as there have been \"restrictive\" movie ratings, kids have known how to get to see the movies they want).  Take out the sex, tone down the violence, crank up the humor, and... out comes this movie.<br><br>It's like \"Destroyer\" is stuck in a state of half-development.  The basic storyline would be okay, but the script gives Conan a coterie of unneccessary sidekicks (as if Conan were not a strong enough character to carry a movie by himself).  Grace Jones is interesting to look at but gets tiresome VERY fast; the cowardly sidekick gets more irritating by the second; Mako wears this expression like he's only in this one for the money. Olivia d'Abo is just plain miscast: it's like she's a marker that should read \"Insert More Interesting Character in Second Draft.\"  Arnold Schwarzenegger does a competent job as Conan, but we don't see the raw power and brute force of the first movie.  There is a thin line between competence and complacency, between an actor and a star; it took Roger Moore six years to get to that point in the James Bond series, while Schwarzenegger reaches the same point with Conan in two.<br><br>I think part of the problem is whether or not the Conan concept is flexible enough to become family fare, and my answer is \"no.\"  Fans of Robert E. Howard's Conan work know his Cimmerian is a very rough-edged hero, a cunning, hard-drinking, hard-fighting man, and the first Conan movie captured that essence.  To change him into the simple-minded do-gooder of \"Conan the Destroyer\" is to destroy what Conan is all about, and the movie suffers for it.<br><br>Is \"Conan the Destroyer\" worth watching?  Yes.  For someone who knows absolutely nothing about Conan, I suppose it can be a harmless sword-and-sorcery popcorn flick.  For Conan fans, it's kind of like \"Legend of the Lone Ranger\" for Lone Ranger fans: an irresistible example of just how badly Hollywood can treat your favorite character.<br><br>I just hope that if there is ever another Conan movie (not likely, thanks to \"Destroyer\"), the producers will concentrate on following the style of \"Conan the Barbarian\" and just ignore this one.","user":"Shield-3","rank":[96,107]},{"title":"Conan","rating":6,"date":"4 March 2020","review":"Pretty dull sequel with a boring Predictable story, The action was ok I suppose but nothing great, There was too many supporting cast when it should be Conan and Conan only, They made the tone lighter and put more humour in it and it didn't work 90% of the time but I did laugh when the Camel from the first came back to get revenge on Conan and ended up getting knocked out again, Nothing memorable and only watch it if you're a fan of the first.","user":"MR_Heraclius","rank":[37,41]},{"title":"Conan Sequel: Lots of Muscles, but Lacks 'Muscle'!","rating":8,"date":"8 September 2003","review":"After the worldwide success of CONAN THE BARBARIAN, it was inevitable that a sequel would be made (director John Milius envisioned the saga as a trilogy, with an aged Conan ruling his own kingdom in the final chapter). But Universal, seeing star Arnold Schwarzenegger as appealing more to younger audiences, did not like the R-rated combination of gore, sex, and machismo philosophy of the first film, so Milius was unceremoniously dumped, and more family-friendly action director Richard Fleischer was brought in to helm CONAN THE DESTROYER. <br><br>Working with a script by comic book scribes Roy Thomas and Gerry Conway, much of what made the first film so unique was tossed aside. While Milius had Arnold lose weight and study Oriental swordsmanship, in an effort to tone down the bodybuilder look, and make him more flexible and believable as an arena-trained warrior, Fleischer ordered the actor to bulk up as much as possible, hoping to recreate the impossibly-muscled giant painted by Frank Frazetta on the covers of the paperback CONAN novels. Instead of being a taciturn loner, Conan would joke and 'care' about people, with an idiot sidekick (Tracey Walter) to provide comic relief. Bloodletting would be mainly off-camera, sex would consist solely of flashes of cleavage, and any monsters faced would be toned-down so children wouldn't be traumatized. While all this succeeded in garnering a PG rating, the end result was less Robert Howard's barbarian, more the generic B-movie hero seen in the dozens of imitations CONAN THE BARBARIAN had inspired.<br><br>The plot is simple; Cruel but beautiful Queen Taramis (SUPERMAN I and II villainess Sarah Douglas) promises to revive Conan's dead love, Valeria, if he'll lead virgin Princess Jehnna (Olivia d'Abo) and her bodyguard (basketball legend Wilt Chamberlain), on a quest to steal a giant diamond, and use it to recover a horn that will bring god Dagoth to life. Joined by his sidekick, Malak, a wizard (Mako), and a female warrior (Grace Jones), the group faces the usual array of monsters, wizards, and enemy soldiers, and defeats them all, succeeding in the quest...but Conan discovers, nearly too late, that the bodyguard has been ordered to murder him, after the horn is retrieved, and that Jehnna is to be sacrificed as part of the process of reviving Dagoth...<br><br>While the fight between Conan and Toth-Amon (Pat Roach), in a hall of mirrors, is well-staged and exciting, much of the rest of the film seems flat, with one scene, of Conan blind drunk at a campfire, ridiculously out of character and silly. <br><br>CONAN THE DESTROYER didn't achieve anywhere near the success of the original, but Schwarzenegger had no reason to worry; his next film would be a low-budget SF thriller called THE TERMINATOR, and he was about to become a superstar!<br><br>A footnote to CONAN...in early 2003, Schwarzenegger and John Milius tentatively agreed to bring CONAN THE KING, the final chapter of the saga, to the screen...With the original director's vision, and the improvements in FX that CGI has provided, we may yet see the ULTIMATE Conan film reach the screen, if Arnold's political career doesn't take precedence!","user":"cariart","rank":[64,75]}]