[{"title":"The one and only authentic film version.","rating":29,"date":"29 July 1999","review":"This version of Wuthering Heights, starring Timothy Dalton and Anna Calder-Marshall, is the only one I truly feel has realized Bronte's work, no transformed it! into screen.  The music, although I haven't heard it since 1970, when the film was released, haunts me today.  It's melancholy flute solo underscores a savage, brilliant performance by Timothy Dalton, and I cannot understand why this version is not available on video.  Bravo! Timothy Dalton.  You are Heathcliff, and this is one of my all-time favorite films.  Certainly the one I most miss being able to view.","user":"Gayle-7","rank":[28,34]},{"title":"Samuel Arkoff's Best","rating":19,"date":"19 September 2001","review":"The 1970 version of Wuthering Heights is the best version of the novel on film.  Restrained, realistic, it did not go \"over the top\" emotionally like the 1939 one.  Timithy Dalton' s portrayal of Heathcliff is very passionate but is more of a real person instead of just a romantic idel.  Samuel J. Arkoff died yesterday.  He made a lot of low budget exploitation pictures in the fifties and sixties.<br><br>They were fun and not demeaning like the films of today.  In 1970 he made this very serious film and was never really given the publicity or the credit  he deserved.","user":"philwissbeck","rank":[13,15]},{"title":"American International Pictures Best Movie","rating":10,"date":"11 March 2005","review":"I remember reading the review of this version of \"Wuthering Heights\" in VARIETY in 1970. The reviewer said, \"While suffering only in comparison to the 1939 classic ...\". Well, I recently saw the 1939 version and this version is in every way superior. From the haunting, soulful score to the sensitive acting, to the realistic countryside, this \"Wuthering Heights\" is more passionate, more brooding, more obsessive. Anna Calder-Marshall did not possess the stunning beauty of Merle Oberon, but she hits all the right notes essaying the social-climbing Kathy. Those only familiar with Timothy Dalton's sour work as James Bond will be astonished at his sensitive, magnetic Heathcliff. The dowdy Flora Robson has been replaced by the buxom, nurturing Judy Cornwell. Cornwell's \"milkmaid dresses\" almost overflow, and she is so nurturing one almost expects her to \"pop one out\" and feed Heathcliff or Cathy at some critical moment. Nonetheless, Cornwell's expressive face and body language at times nearly steals the movie, but, by no means throws it off balance.<br><br>Other fine performances include Ian Ogilvy as Edgar, Harry Andrews and father and Hillary Dwyer as Isabella.<br><br>Even the photography, editing, and, most important, directing by Robert Fuest is superior to the 1939 version. It's especially amazing, given AIP's product at the time, that this masterpiece could be made. I don't like costumers particularly, but I watch this \"Wuthering Heights\" about once every two years. It's worth my time because it's THAT good.<br><br>I give Wuthering Heights (1970) a \"10\".","user":"Bob-45","rank":[19,24]}]