[{"title":"Surprisingly good","rating":9,"date":"11 November 2001","review":"One's expectations for an early-60s B movie from American International Pictures are never very high. But this movie was a surprisingly well thought out &amp; thought-provoking story.<br><br>Just as a family has left LA for a vacation in the woods, the US suffers a massive nuclear attack on all its major cities from, uh, an unnamed enemy. (Wink wink...) But you won't find any marauding mutants here. In fact this film isn't about nuclear war per se. It really wants to explore the nature of civilized society. The father, well portrayed by Ray Milland, is grimly determined to protect his family at all costs for as long as it takes for order &amp; civil authority to be restored, which he's sure will be a long time coming.<br><br>The father is a good man, but a little paranoid &amp; controlling. This probably wouldn't be noticeable in normal times, but now they're in a panicked rush to escape the LA metro area &amp; gather enough supplies to last for months in the wilderness - ahead of all the other people who are starting to clog up the freeways &amp; empty out the grocery stores along the escape route. The contradiction between following the rules &amp; protecting your loved ones in desperate times is very effectively illustrated as he makes some reckless decisions along the way.<br><br>Normally for a low budget 60's film like this, I wouldn't even bother thinking about how it could've been improved. But since it's so good at presenting a major moral dilemma in a realistic way, think of these nits as a sign of respect: Milland's character could use a little more introspection, but of course so could a lot of early 60's dads! (Not that Milland's performance was wooden - it was great. But his character had a very constricted personality.) His wife could use a little more assertiveness. She actually realizes this, and explains that she's still in shock over the attack - but after Sept. 11 a lot of us understand that after a good catharsis we can deal with a lot of trauma that initially would immobilize us. After having a good cry, she could've acted as a better conscience for some of the father's more paranoid acts. Also the daughter's character needed some fleshing out.<br><br>But of course this is an early 60's film, and clearly made on a low budget. And given its time &amp; budget it is an amazing gem of a film. Definitely one to seek out!","user":"JennyP","rank":[60,69]},{"title":"\"Two and two doesn't make four anymore\"","rating":9,"date":"7 January 2009","review":"I can't say I had the greatest expectations for this low-budget post-apocalyptic thriller, directed by none other than Ray Milland. Though his career was undoubtedly in something of a downturn by the early 1960s, the Oscar-winning actor briefly found new life in the realm of B-movies, starring in Roger Corman's 'X: The Man with X-ray Eyes (1963).' The previous year, however, Milland indulged in his occasional interest in directing {in total, he has five features to his name, as well as numerous television episodes} with 'Panic in Year Zero! (1962).' Against all odds, this under-appreciated gem is among the best of its kind, somehow even managing to outclass Stanley Kramer's star-studded 'On the Beach (1959)' of three years earlier. Ever since I read Arthur Conan Doyle's \"The Poison Belt\" in 2007, I've wanted to make my own post-apocalyptic film, and, fascinatingly, this is exactly the sort of production I'd envisioned; sparse in action and characters, but utilising the family's isolation to bring home the terror of their predicament.<br><br>The theme of nuclear apocalypse was most common in the early 1960s, when relations between the United States and the Soviet Union were at their most hostile. Some films, such as Kubrick's 'Dr. Strangelove (1964)' and Lumet's 'Fail-Safe (1964),' chronicled the events leading up to such an incident, whereas Kramer's 'On the Beach (1959)' took place in the following months. What these big-budget offerings have in common is that they focus primarily on the big-players in the Cold War, particularly the government and military officials. 'Panic in Year Year!' deals, out of budgetary necessity more than anything else, with ordinary people in an unfathomable situation, and is all the better for it. When Harry Baldwin (Milland) takes his family on a fishing trip, the sudden flash of light emanating from Los Angeles is initially mistaken for lightning, followed by the mundane remark that \"I hope it doesn't rain.\" The Baldwins are a regular American family who don't deserve to have their lives and lifestyles exploited like cheap pawns in a game of chess.<br><br>It's interesting that the charming rogues of the 1940s, such as Ray Milland and George Sanders, turned into convincing family-orientated men during their autumn years of acting. Milland is excellent in the main role, a dedicated father and husband who, in his determination to persevere, finds himself abandoning the very civilised morals for which he is fighting. Despite creating a strong sense of the chaos and lawlessness that accompanies a national catastrophe, the film's message is still an overwhelingly positive one: that the bonds of family and friendship are a crucial necessity in difficult times. There are, of course, a few unlikely plot turns  by coincidence, the two groups of people who seek refuge in the Baldwins' hideaway are the very two with whom the family had had previously altercations  and the occasional moment that can only be described as B-movie silliness {my favourite is the announcement that the sole outcome of an urgent United Nations meeting was to give this year a dramatic-sounding name}. Even so, 'Panic in Year Zero!' is a gripping and unforgettable addition to the science-fiction genre.","user":"ackstasis","rank":[25,27]},{"title":"Growing up in L.A. in the '60s, this movie really meant something!","rating":11,"date":"11 May 2002","review":"Sure it didn't have a huge budget or major-league stars, but it's a bleak and realistic little drama that has an authentic tone and a sense of desperation that feels utterly genuine.  There's undoubtedly a \"you-had-to-be-there\" reaction that I had to it, being from Los Angeles and knowing the mountain area and easily being able to imagine seeing that mushroom cloud in my own mind.  I was eight when this originally came out -- not sure if I saw it in the theater but it's possible -- and that creepy Conalrad radio tone is still in my head after all these years.<br><br>\nNobody -- except maybe Charlton Heston -- can look quite so anguished and masculine and bearing-the-weight-of-the-world-on-his-shoulders-in-the-face-of-civilization 's-downfall as Ray Milland does in this movie.<br><br>It looks like we dodged the nuclear war bullet back in the 1960s, but I'm sure that anybody living today can still identify with the terrifying prospect of a devastating nuclear war and what could happen if you were one of the lucky/unlucky survivors.  This may not be \"The Day After\" but it's a plucky low-budget version of the same theme and worth seeing alongside other 60s nuclear nightmare movies.","user":"lisa-1865","rank":[53,61]}]