[{"title":"How can you not love Betsy Russell?","rating":7,"date":"21 August 2013","review":"And how can you not love that cheesy, peppy, oh-so-80s pop theme song? This irresistible female-empowerment exploitation comedy stars the adorable, sexy as hell Ms. Russell as Tomasina \"Tommy\" Boyd, a young lady who'd much rather tinker with cars and play sports than do so-called \"girly\" things. She worships studly race car driver Randy Starr (Gerard Christopher), whom she is able to meet through Ernie Leeds, Jr. (Eric Douglas), a filthy rich auto racing entrepreneur. When the confident Randy isn't able to take her seriously, she sets out to prove that anything he can do, she can do just as well, if not better.<br><br>\"Tomboy\" creates some pretty good vibes for a pleasant 91 minutes. There's enough laughs and titillation to make it quite watchable. A big part of the appeal is Russell, one of the iconic 80s hotties who'd also made her mark in movies like \"Private School\", \"Avenging Angel\", and \"Cheerleader Camp\", and who's recently made a comeback in some of the \"Saw\" sequels. The movie itself is silly and clumsy at times, but ultimately upbeat entertainment. Voyeurs will be pleased with the amount of breast shots on display, and can take delight in a goofy, erotic commercial performed by Tommy's friend Seville (Kristi Somers, \"Hell Comes to Frogtown\"). The soundtrack provides tons of cheesy goodness.<br><br>The direction by Herb Freed, who'd previously done the horror pictures \"Haunts\", \"Beyond Evil\", and \"Graduation Day\", may not be inspired but it gets the job done, as do the performances by an engaging cast. Veteran Richard Erdman is likable as Chester, Tommy's boss and pal; Douglas, son of Kirk and brother to Michael, is effectively smarmy as the rich jerk. Fans of 80s movies will note the appearances by such people as Cynthia Thompson (the female lead in \"Cavegirl\", Dennis Hayden (one of the terrorists in \"Die Hard\"), and trash flick favourite Michelle Bauer, in an uncredited bit.<br><br>This kind of thing may not be Shakespeare, but it sure hits the spot for people just looking to have a good time.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[11,11]},{"title":"An enjoyably dopey piece of 80's Crown International teen comedy trash","rating":8,"date":"21 June 2006","review":"Lovely, perky, curly-haired and highly appealing brunette 80's flash-in-the-pan B-movie starlet Betsy (\"Out of Control,\" \"Cheerleader Camp\") Russell gives a winningly spunky performance as Tomasina \"Tommy\" Boyd, a scrappy, willful, fiercely self-reliant spitfire hoyden automobile mechanic with a humongous crush on cocky race car driving dreamboat hunk Randy Starr (handsome, dashing Gerald Christopher). Egged on by her flighty, opportunistic aspiring actress gal pal Seville Ritz (leggy, luscious blonde looker Kristi Somers), Tommy meets Randy at a jerky rich kid's (Kirk Douglas' obnoxious youngest son Eric in an unbearably grating thespic turn) posh night party and, of course, the two fall a** over teakettle for each other. The only problem is that male chauvinist Randy won't take Tommy seriously because she's a chick, so naturally the take no guff Tommy dares Randy to a high stakes souped-up auto race to win over his respect.<br><br>Passably directed by seasoned trash exploitation feature hack Herb Freed (who also graced us with the grim, unsettling, arrestingly off-kilter psychological horror sleeper \"Haunts\" and the atrocious teen body count slasher tripe \"Graduation Day\") and scripted in strictly off-the-peg adolescent comedy-drama formula fashion by Ben Zelig, this typically tacky and immaterial Crown International Pictures drive-in fluff covers all the necessary junky bases to qualify as a pleasingly silly serving of pure nonsense: a sizable number of nice-looking busty babes take their shirts off at regular 15 minute intervals (besides Russell and Somers, we also have \"Cavegirl\" 's eminently adorable Cynthia Ann Thompson as a frequently bare-breasted bimbo and cheesy horror scream queen Michelle Bauer in a ridiculous uncredited bit part as a topless tootsie in a flashy white Corvette), a heavy-handed \"you go girl!\" stand-up-for-yourself feminist subtext, a generous smattering of witless lowbrow humor (Ritz's audition for a TV commercial is a racy hoot!), the best cornball motorcycle courtship scene since \"Viva Kneivel!,\" cheap gay jokes, stupidly vulgar dialogue (\"Good night, little *beep*!\"), a horrible soundtrack full of generic, mechanically bouncy Top 40 hit tune soundalike songs (the incredibly awful theme number boasts the following immortal couplet: \"She's a road runner/She's a tail gunner!\"), an unforgettably hideous folks in tight, clingy leotards thrusting their pelvises to and fro to crappy disco music get down and boogie aerobic workout sequence ala \"Flashdance,\" and an utterly predictable grand finale all-or-nothing climactic car race. What's not to like about this charmingly shoddy 80's schlock artifact?","user":"Woodyanders","rank":[11,13]},{"title":"Great Movie!","rating":10,"date":"6 December 2006","review":"Ignore the feminist comment about a sexist plot and non-acting cast members. This movie was one of the best the 80's had to offer as far as wacky teen comedies and at age 15 I thought the excessive skin was right on. I don't think the acting was supposed to be good. It's just like all the other teen movies we love so much by the likes of John Hughes and Savage Steve Holland to name a couple. Yeah I knew it was cheesy but the cheese factor is was what made it so great! Really funny stuff. When I watch these movies I always see someone that is currently acting on a popular drama or in some of today's biggest hit movies and it's a blast to see them as pimply little teenagers. If you are between the ages of 30 and 40 and haven't yet seen this one, I suggest you check it out.","user":"stickNhead","rank":[18,25]}]