[{"title":"Signoret, smoking","rating":10,"date":"22 April 2006","review":"Loneliness and longing in this extraordinary, ageless masterpiece. The film is dominated by the phenomenal Simone Signoret and I got dizzy looking at her beautifully complicated face. Laurence Harvey's petulance works wonders here and Jack Clayton, the director, orchestrates a soap opera for the thinking man. Everythings rings true even the most unbelievable details. The older woman syndrome is so masterfully captured here that, at times, you want to look away because the truth in Signoret's eyes is piercing as she sexily smokes her cigarette blowing the smoke right at us. I'm just rambling I know, my intention is to wet your appetite. Another extra bonus is the superb performance by Hermione Baddely, renamed by Noel Coward as Miss Gooddely. A total must!","user":"totalwonder","rank":[85,94]},{"title":"Simone Signoret Is Magnificent","rating":10,"date":"20 May 2009","review":"This film hasn't lost any of its bitter bite since it debuted in 1959. Laurence Harvey plays an ambitious young man who leaves a squalid industrial town somewhere in England for a good job in a nicer city. He immediately makes friends in the office and joins an amateur theater group when he learns that a pretty rich girl (Heather Sears) is a member. He also meets an older French woman (Simone Signoret) who is also a member.<br><br>He starts an affair with the older woman while he blatantly pursues the rich girl, much to the dismay of her parents. Her father is a coarse but self-made man; the mother is a snooty society woman. The girl has a sort of boyfriend who constantly uses his wealthy upbringing and schooling to put Harvey \"in his place.\" Even in post-World War II England, the \"class system\" is very evident. Harvey's attempts at being upwardly mobile are constantly shot down.<br><br>The girl is sent to France in an attempt to get her away from Harvey, and he falls into a torrid affair with Signoret. But he cannot get the girl (and her money) out of his head. Months go by before he runs into the girl and renews his pursuit. Of course she gets pregnant and the family relents, rushing her into marriage, an act that has bitter and surprising consequences for all involved.<br><br>Signoret won the best-actress Oscar (and just about every acting award that year) for her work here and she is magnificent. She is worldly and sad yet is not about to accept her fate. Harvey (Oscar nominated) gives his best performance as the blatant social climber. His \"angry young man\" is at once despicable and sympathetic. Sears scores as the naïve young woman who tries to balance her life and her parents' wishes.<br><br>Hermione Baddeley (also Oscar nominated) has a great scene toward the end of the film. She plays Signoret's friend, the one who enables their affair by lending them her apartment. Donald Wolfit is excellent as the girl's father. Ambrosine Phillpotts is good as the mother. Donald Houston, Raymond Huntley, Wilfrid Lawson, Beatrice Varley, and April Olrich are all good in smaller roles.","user":"drednm","rank":[61,68]},{"title":"A landmark film","rating":9,"date":"11 February 2008","review":"I recently viewed this film from 1959 and was totally riveted to it. It is a timeless love story set in post-war Britain with the incomparable Simone Signoret and Laurence Harvey at the centre of the storm. The background highlights the struggle between class and ambition in 1950's Britain. Laurence Harvey plays Joe Lampton, the \"angry young man\" who is motivated to make something of himself in a world that he is not comfortable with. Harvey portrays a new kid on the block who has taken a job at city hall, where he works with other young men like himself. He and his buddies remind us of randy high school students discovering the world and women all at once.<br><br>While Joe shows all the aptitudes necessary for advancement, he is a man of principle who inherits the hostility of the working class that flares up when provoked by snide remarks about where he came from. He has trouble playing the game but no trouble attracting the attention of the ladies. At first attracted to the daughter of a local tycoon, he knows that he is an outsider and seeks the advice and friendship of an older woman - the genuine and magnetic Signoret, who plays the lovelorn wife of a local businessman and philanderer. Over time, he falls deeply in love with the older woman and the time they spend alone provides some of the most compelling scenes you are likely to find in the cinema of the 1950's. After successfully wooing her, he runs headlong into the realities of life, leading to a gut-wrenching climax, which you won't forget.","user":"barryrd","rank":[14,14]}]