[{"title":"A pleasant surprise","rating":6,"date":"11 May 2003","review":"Wow! I expected something along the lines of GODZILLA'S REVENGE, what I got instead was a pretty exciting giant monster film. Sure Minya does make for a few cutesy moments but I didn't feel these were overdone as badly as they could have been. Plus I thought the ending embrace was quite moving..of course it does work to take some of the hard edge off of Godzilla so some may hate it for that. I'd recommend this one mostly to older kids who love science fiction adventure stories and who won't be frightened by all the cool-looking giant insect critters. Too bad Minya and Godzilla look so thoroughly silly and goofy in comparison.","user":"Space_Mafune","rank":[14,15]},{"title":"neat, neat","rating":20,"date":"20 May 2004","review":"Son of Godzilla is one of those weird movies which inspire strange feelings.  The story is unique, no Godzilla doing his typical destruction. The story centers on the very human relationship between Godzilla and his son, Minya.  This movie really touched me on this level.  Some scenes really stick in my mind.  The great scene with Godzilla teaching Minya how to shoot radioactive fire comes to mind.  There is a real bond that comes out.  When Minya is confronted with a monster, i.e. a bully, Godzilla makes Minya fight his own battle but is always there to back up his son. <br><br>  Godzilla protects Minya and teaches him lessons; and in one of the climactic scenes, the son fights for his father's life; this is poignant. The scene at the end of the film in which father and son embrace to huddle from the cold is touching. If you divorce this from the typical Godzilla movie, what you are left with is a movie about a very close bond between father and son.  I think I'm probably the only one who appreciates this movie on this deep a level. <br><br>  One question: What Hollywood movie has a positive view of a father and son relationship?--- This movie made me very emotional, go figure.   In short, if you want to see a typical camp Godzilla, look elsewhere.  If you want to see something with emotional content; see this movie<br><br>8++++++/10","user":"rumpole16","rank":[7,7]},{"title":"Meet Godzilla, Jr.","rating":8,"date":"4 April 2011","review":"Despite being enjoyable films, the last two Godzilla installments had not matched the success of Ghidorah, The Three-Headed Monster (1964) and had fallen below expectations at the box office. In an effort to boost audience attendance, Toho Studios made the decision to soften the king of the monsters and give him a cute baby son. The first Godzilla film to be geared directly towards children, Son of Godzilla (1967) is harmless fun and sweet - the cinematic equivalent of a gum drop. Alas, the film proved to be the most poorly attended Godzilla film yet. Either Toho's kiddie approach had backfired or the film just couldn't compete with the rising popularity of television.<br><br>Son of Godzilla (1967) shouldn't be the first Godzilla movie you see, or even the second or third. With the Godzilla suit from Invasion of the Astro Monster (1965) torn and frayed, a new one was constructed. Unfortunately, it is one of the most poorly designed suits in the series - bulky legs, large doll-like eyes, and a toad's head. However, it is arguably better than the one audiences would behold six years later in Godzilla vs. Megalon. If you have small children and want to introduce them to kaiju films, I recommend Son of Godzilla.","user":"joshdownham","rank":[6,6]}]