[{"title":"Incredibly dumb, but I love it","rating":6,"date":"17 March 2003","review":"This is one of the dumbest movies ever made - but I still get a kick out of watching it over and over again. First - John Carradine is vaporized in an atomic lab explosion and yet an invisible invader (which somehow has to drag its feet in the sand as it walks) can still take over the body. Second - if someone got on the P.A. at a hockey game today and said the world is about the end, some of the guys in the cheap seats would go up there and beat him up instead of running away. Third - how many times can they use the same scene of the zombies stumbling down the hill outside the army bunker? This movie is so stupid, it's frightening, but for some reason I love it.","user":"KillerCadugen","rank":[39,45]},{"title":"Invisible enemy threatens the world","rating":7,"date":"26 January 2005","review":"I have seen Invivisble Invaders a couple of times now and found it rather enjoyable, despite reading some bad reviews about it.<br><br>Invivisble aliens plan to take over the world by taking over dead bodies, that make the humans zombies. A small group of scientists go to hide in a cave to find a way to defeat these aliens and they eventually succeed by making a device that makes high pitched sounds, which is the aliens' weakness. After killing several of these in this way, their flying saucer appears and is destroyed and the world is saved.<br><br>The special effects are not too bad for a low budget movie and the music score is rather eerie.<br><br>The movie stars sci fi regulars John Agar (Tarantula, The Brain From Planet Arous), Robert Hutton (The Colossus Of New York, The Slime People), horror star John Carradine (The House Of Frankenstein, The Black Sleep) and Jean Byron as the love interest.<br><br>This movie is worth seeking out, especially for fans of 1950's science fiction like myself.<br><br>Rating: 3 stars out of 5.","user":"chris_gaskin123","rank":[30,34]},{"title":"Grandfather of Night of the living dead","rating":8,"date":"15 July 2005","review":"Shuffling reincarnated zombies.. reanimated by Invisible invaders? If you call your self a zombie fan then you HAVE TO SEE THIS...<br><br>STRANGE.. BUT Interesting... on a double bill with \"fiend without a face\".. it freaked out movie goers by the thousands.. <br><br>i find it a very interesting movie,,, flawed.. but without a doubt... very very much worth a viewing...<br><br>\"THE DEAD WILL KILL THE LIVING\" so sayeth John Carradine!!<br><br>Adam Tanner.. you have had your warning..<br><br>the zombies walk just like the zombies in NOTLD, the make-up is very much the same as NOTLD and the eeriness is also obviously borrowed 10 years later as a basis for NOTLD... I cant believe John Russo or George Romero have never admitted to this fact. In much the same way that ALIEN was based on IT! The terror from Beyond Space!!","user":"furlough1","rank":[31,37]}]