[{"title":"A movie that makes you smile and cry, simultaneously","rating":9,"date":"24 May 2009","review":"Well, it took me 21 years to watch this movie.Literally, the first time when I saw this movie was when it was released and I was back then a kid of 9 years who barely could understand the delicacy of human characters portrayed in the movie.And finally when I watched the movie again, I was 30 and boy oh boy,I was blown over.What a performance by Dustin Hoffman!!!Is it his best so far?Well, may not be, coz he is such a fine actor and he has so many good movies in his kitty.But truly it was one of his most memorable ones.And Tom Cruise, oh man, this bloke can act.I have always been so much skeptic about his acting skills.But I am happy that I have been proved wrong.He can act, thats for sure and this movie is a documentary proof of it.The best thing about this movie is of course the chemistry between them, a spoilt brat and an autistic person.The director handles such an issue with such panache that you are compelled to emote with the protagonists.Valeria Golino did an excellent job in her small role.She really sparkled in the elevator scene.The rest of the cast did a fine job, too.Overall, it is a memorable movie backed by power house performances.Don't ever take the risk of missing it.","user":"nagsaptarshi","rank":[71,77]},{"title":"Best acting performance I have ever seen","rating":9,"date":"28 December 2001","review":"Dustin Hoffman's performance as Raymond Babbitt is,bar none,the best acting performance I have ever seen.I have never seen an actor get so deeply immersed in a character than Hoffman does in this film.He is excellent here,and he deserved nothing less than the Oscar he won for it.As for Tom Cruise,his performance as Raymond's childish and hotheaded brother is also worthy of note.To watch his character slowly shed his ignorance throughout the course of the film was indeed a delight.If you have not seen it,don't deprive yourself any longer.Buy it.It's a keeper.","user":"SmileysWorld","rank":[243,281]},{"title":"My favorite","rating":10,"date":"28 January 1999","review":"I have seen this movie probably 7 or 8 times in the past three years, wrote a paper about it for my college film class last semester, and basically regard it as my favorite movie of all time.  Where to begin with the praise for this movie?  Let's start with the acting.  Dustin Hoffman is my favorite actor, and has been for a while.  I'd watch him in any role.  I was amazed at the way he was able to pull off this role.  I've never seen a more deserved Oscar win.  The vacant stare, the monotone voice, the screaming, it was unbelievable.  Each time I watch it I am floored by his talent.  Tom Cruise is also good, the villain of the story who undergoes such a subtle change that it's almost not visible until nearly the end.  He is, however, perfectly suited for the flashy, egotistical character of Charlie, and I think he did a great job.  The directing was unobtrusive and beautiful, for the most part just letting the action unfold, which is exactly the way it should have been done.  It's a feel-good movie that does that and more, and I think nothing I've seen in the movies is as touching as the scene in the motel where Charlie discovers who \"Rain Man\" really is.  I give this movie a 9.5 out of 10.  Absolutely wonderful.","user":"Jules16","rank":[173,202]}]