[{"title":"Somewhat Unintentionally Funny, But Still Enjoyable Sequel,","rating":10,"date":"9 February 2006","review":"'Airport 1975' is an enjoyable follow-up to the vintage original, which see's a small aircraft collide with a 747,and leaves two pilots dead and one blinded,the amusing and often spoofed plot, has the gorgeous Karen Black, pilot the stricken craft via radio contact, Charlton Heston, plays Blacks love interest,Who comes to her aid.<br><br>There is a fine cast of character actors involved in this guilty pleasure look out for Jerry Stiller,( father of Ben Stiller) Linda Blair,who was probably cast in desperate attempt to shake off her Exorcist image, her performance is sickly sweet you would swear she would start spinning her head! Comedy Legend,Sid Caesar, provides some laughs as a loud mouth bit part actor, Myrna Loy,is the alcoholic,whom Caesar tries to woo, popular singer Helen Reddy, is cast as a nun, who provides the films many unintentional moments which arguably inspired 'Airplane!s many laughs,<br><br>Despite the film's slating's over the years, 'Airport 1975' is an enjoyable romp from the time-capsule that is the 70's,","user":"greene515","rank":[24,26]},{"title":"Cult classic film with none other than my favorite, Linda Blair!","rating":12,"date":"12 May 2003","review":"Dedicated filmgoers collect so many varied pleasures as the years go by. Who can forget the first time they saw Welles' Citizen Kane? Ozu's Tokyo Story? Antonioni's The Eclipse? What gems of insight and emotion have been mined from the works of Jean Renoir, of Max Ophuls and Fritz Lang, of Hitchcock and Mizoguchi? Yet, if I had to choose between saving all of their films or preserving Airport 75, I must admit that I would hesitate.<br><br>When it comes to a film as rich as Airport 75, where does one begin? Perhaps a drum roll of the cast that adorns this archetypal 1970's disaster epic is as good a way as any to get started: we have Charlton Heston and Karen Black as the leads, and, in a display of has-beens and never-was's that would make any Hollywood Squares devotee salivate, there's Susan Clark, Sid Caesar, Jerry Stiller, Norman Fell, Martha Scott, Beverly Garland, Sharon Gless, Efrem Zimbalist Jr. and Erik Estrada all on board.<br><br>And that's just for starters! Myrna Loy plays an elderly tippler, Helen Reddy is a singing nun, Linda Blair is a cheerful girl in need of a kidney transplant, and, in the pièce de résistance, Gloria Swanson is.Gloria Swanson. If you loved Airplane!, which lampooned Airport 75 in particular, you should go straight back to the horse's mouth and rent this seminal entry in bad cinema.<br><br>In a lengthy opening tracking shot that invites comparison with Orson Welles' similar feat in Touch of Evil, we follow cross-eyed stewardess Black into an airport as the names of the guilty keep coming and coming via the credits, a veritable orgy of cut-rate players. When the names finally stop, Heston quickly propositions our heroine. `I can do wonders in thirty minutes,' he promises, but Black's having none of it. `Maybe I'm tired of one-night stands,' she whines, as we imagine, quite against our will, the alarming image of the two of them in the sack. After she leaves him, the credits begin again and inform us that Edith Head designed the clothing (only senility can possibly excuse the neckerchiefs she gave to the stewardesses.)<br><br>When asked the secret of her ageless appearance by adulatory reporters, Swanson explains, `I won't take poisoned food, I don't like it.' Nuns Martha Scott and Helen Reddy observe her impromptu press conference intently. `It's one of those Hollywood persons,' says Scott with disdain. `You mean an actress?' asks Reddy. `Or worse,' Scott replies, rolling her eyes to heaven. Black tries to shield a new blond stewardess from the lustful advances of Erik Estrada, but this novice can take care of herself. `I'm emancipated, liberated and highly skilled in Kung Fu,' she boasts. `Whatever happened to womanhood?' wonders a pilot in response.<br><br>As the cast from Hell shuttle over to their flight, Swanson just won't shut up. When Norman Fell doubts if the plane will fly, Gloria says, `In 1917 I was flying in something wilder than this. You know who the pilot was? Cecil B. DeMille!' Just about everybody in Airport 75 proves to be as ready for their close-up as Swanson, especially little Linda Blair; when she is wheeled onto the plane, bad film-going delight turns into purple junk food ecstasy. She smiles satanically at everyone and says, `It's so exciting! The people are so interesting!' to her mother Nancy Olsen, who once played the ingenue in Sunset Boulevard, making this her second film with Swanson in which she doesn't share a scene with the silent diva.<br><br>`Jokes' drop like potato pancake batter into deep-frying fat. `I'll take you into the lion's den,' says Black to her blond Kung Fu-fighting co-stewardess. `Who's afraid of the lion's den, I'm Jewish!' quips blondie. Later, she calls the horny Estrada a `disgrace to your race,' and truer words were never spoken. Two old ladies cluck over a book called Epicurean Sexual Delights, and another woman anxiously hides her dog. People keep saying, `You've gotta see Gloria Swanson-she looks terrific!' Yet the camp high point, of course, is the now legendary scene where Sister Helen sings a jaw-dropping song to ailing Blair about how `you best friend is yourself.' You want so much for Blair to projectile vomit pea soup all over the plucky nun, but, alas, she just keeps smiling. The plane is filled with all kinds of weird goings-on and bizarre talk, but, as far as appalling remarks go, Fell takes the cake. `I once had a girlfriend who was half French and half Chinese,' he says. `I came home one night and she ate my laundry!'<br><br>Airport 75 exhibits a deliciously crummy television aesthetic. When the plane is hit, most of the pilots (including, thankfully, Estrada) are sucked out into space. As Black, The Cross Eyed Stewardess Who Has To Fly The Plane!, takes over the controls, the fact that she is traveling at airplane speed and is sitting right next to a massive hole in the cockpit is represented visually by her cast-iron hairdo blowing gently in the breeze! The way that Heston talks her through her ordeal is purely sexist, with all kinds of, `Baby, calm down honey,' stuff. It's as if all the controls were phallic-there's constant hilarious innuendo about nose dives and `keeping it up.'<br><br>As for Black, who really carries the whole movie, this is an immortal performance. With her dueling lazy eyes, she is able to keep watch over all the buttons and switches at once; she flares her nostrils, bugs her freaky orbs, and even sticks out her tongue when trying to get a pilot into the plane. When Heston, in an atrocious yellow turtleneck, manages to get aboard, Black tells the passengers that they'll have to shut down one engine. I adore the voice of one of the extras who pipes in, `We're gonna die!' in a dry, matter-of-fact voice.<br><br>They do land the plane without a hitch, and the ending, appropriately, belongs to Swanson. When she slides down the emergency landing shute, La Swanson's body double flashes us a glimpse of white panties (definitely the funniest image in the movie.) When her assistant murmurs that it's a good morning, Gloria says rather touchingly, `Every morning is beautiful, you're just too young to know.' This demonstrates that Airport 75 is, finally, a contemplative film about life and its finish-or at least the finish of many show biz careers.<br><br>Though Airport 75 is the height of the Airport oeuvre, Airport 77 is worth checking out for Lee Grant's astoundingly bad performance as an alcoholic (on television there is also an extra hour of flashbacks to the passenger's lives!) And Airport 79: The Concorde has pilot / airline manager extraordinaire George Kennedy wrapping it all up with the line, `They don't call it the cockpit for nothing sweetheart!' as stewardess Sylvia Kristal recoils in horror. Kennedy appears in all four Airport movies as the same character, Petroni. Why anyone let this guy near an airport after a while is up for debate-it's like continuing to invite Jessica Fletcher to your parties: you know someone's going to get killed.","user":"lbworshiper","rank":[47,54]},{"title":"Breathtaking shots of a Jumbo Jet, just yards above the peaks of the Rocky Mountains...","rating":7,"date":"2 October 2000","review":"Stricken with a massive heart attack on his private light aircraft, Dana Andrews collides into the nose of an unsuspecting 747 jumbo jet, alternated, for bad weather, to land in Salt Lake City... <br><br>Impact puts a gaping hole in the cockpit of the heavy jet... The co-pilot (Roy Thinnes) is sucked from his seat and goes flying into the wild blue space, the navigator (Erik Estrada) is killed by a falling instrument panel, the pilot (Efrem Zimbalist Jr.) is blinded, unable to speak clearly and with continuity, and he cannot fly the aircraft...<br><br>Nancy (Karen Black), the flight attendant, scared but cool, has to maneuver the jumbo to safety...<br><br>On the ground everyone has been alerted... Joe Patroni (George Kennedy) and Alan Murdock (Charlton Heston), decide to meet the jetliner, with 120 passengers, for a daring midair rescue...<br><br>Among the passengers: a famous movie star Gloria Swanson; a lovely teen-ager awaiting kidney transplant (Linda Blair); the wife and son of the airport operations chief (Susan Clark and Brian Morrison); two nuns (Martha Scott and Helen Reddy); plus a needlepoint woman; an hostile man; a dowager with dog; a Rock star and two Rock singers...<br><br>\"Airport 1975\" marks the 4th happy co-starring of Heston with Martha Scott... They were together on Broadway, and she played his mother in both \"The Ten Commandments,\" and \"Ben-Hur.\"<br><br>For all the lovers of disaster films, this old-fashioned \"Grand Hotel\" of a movie does offer excitement, suspense and breathtaking shots of a Jet death-defying flight, just yards above the peaks of the Rocky Mountains...","user":"Nazi_Fighter_David","rank":[38,44]}]