[{"title":"Watch it twice in a row to take it all in!","rating":1,"date":"1 October 2003","review":"This was our first Conrad Veidt experience.  The Man Who Laughs is a spellbinding piece of visual art.  Veidt's acting is sensational.  I knew the plot of the story and wondered how he would portray feelings of sadness and regret with a permanent smile carved on his face.  After viewing the tape, we were amazed how the emotions exuded from the TV screen.  This is our second Mary Philbin experience and both of us prefer her acting in this movie to her role in The Phantom of the Opera.<br><br>We have viewed silents on the TV screen as well as the big screen.  We discovered that there is more of the \"larger than life\" emotions projected and felt by the audience through the larger screenings that is somewhat missed on the 27\" TV screen.  Not so with this performance.  My wife and I were both moved to watch it from the beginning...one more time.","user":"rmartyna","rank":[43,44]},{"title":"Pure Classic","rating":10,"date":"10 August 2001","review":"A young boy is terribly disfigured by roving gypsies by the order of King James II of England as a punishment to one of his disobeying nobles.  The gypsies carve a permanent smile in the young boy's face and then leave him for dead as they leave for their homeland.  The young boy wanders aimlessly for shelter amidst the cold coastline filled with snow, ruins, and swinging bodies from the hangman's noose in the background.  Here he finds an infant..alive..clutched in the frozen hands of a woman whose husband was hanged.  This was the beginning of The Man Who Laughs...and it was so powerfully filmed that a race of emotions filled me as I watched awe-struck, yet horrified.  Paul Leni directed this great film based on the novel by Victor Hugo.  Conrad Veidt plays the grown Gwynplaine who travels around the English countryside with his adopted parent Ursus the Philosopher and the young Dea, the girl whose life he saved as a baby.  Dea has turned into a blooming young woman, yet blind from her birth. Dea is played very nicely by Mary Philbin, who played in The Phantom of the Opera(1925) in the female lead. The way Leni has the characters interact is very effective.  We can feel the tension in Veidt's character as he submits to the growing pains of love.  We feel his sorrow as he cries through smiles.  The rest of the film involves a royal plot by the queen and her henchman/jester(by the way, Brandon Hurst does a phenomenal job as this cruel heartless jester) to reinstate some royal property to Gwynplaine so he can be married to a duchess that the queen does not like.  The story is pretty good and one can see where it is going early on, but the way Leni creates suspense and pathos overpowers any negative defects.  The acting all around is very strong. This is a powerful film on many levels.  It is an emotional rollercoaster ride through love, hate, despair, joy, and much more.  I laughed; I cried. The best part though was that the film has a marvelous message about perceptions.  Here we have this character Gwynplaine that smiles outwardly and makes people laugh, but he is full of despair.  He cries on the inside. People should not always be taken at face value.   By the way, Bob Kane, the creator of Batman, credits this film and the character of Gywnplaine for his creation of the Joker.  I can see how.  Watch this and the silent version of The Bat in the same evening and you will see what stirred a young Bob Kane's imagination.","user":"BaronBl00d","rank":[46,48]},{"title":"Veidt and Leni and Victor Hugo","rating":24,"date":"24 July 2000","review":"A lord refuses to kiss the hand of King James II, so is doubly punished: he perishes in the \"Iron Lady\" [onscreen in a memorably handled sequence] while his son is sent to a surgeon who [offscreen] carves a grin on his face \"so he can forever laugh at his father\". Sheltered by a kindly playwright [\"like Shakespeare, only much better!\"], the boy grows up to join his troupe of itinerant players as the star attraction: \"The Man Who Laughs\". His fortunes lead him to a blind girl, an ambitious duchess, and Queen Anne, who reinstates him to the nobility, but with further complications.<br><br>Conrad Veidt, in a career stretching from CALIGARI to CASABLANCA, always found the emotional authenticity in bizarre roles. Here, in the familiar 19th century figure of the suffering clown, his performance is transfixing: whether tremulous as the girl's hand explores his face, or mortified by the laughter of the House of Lords, Veidt's face makes the role more than a simple martyr: he is man struggling with unjust destiny [\"A king made me a clown, a queen made me a lord, but first God made me a man!\"].<br><br>Big-hearted and unashamedly dramatic, this is clearly the work of Victor Hugo, rags to riches in scope, offering consolation in love. The spirit of the French Revolution is very much in the air in this world of cruel privilege and class antagonism, full of secret doors, dungeons, and volatile mobs. While not as richly populated as Les Miserables and Hunchback, this adaptation still has spectacular set-pieces and elaborate settings.<br><br>Considerably less revolutionary is the conventional portrayal of women: virgin and vamp are the only alternatives. The former is the blind girl played by Mary Philbin [who had earlier unmasked Lon Chaney's Phantom]. With blond ringlets arranged to make her face heart-shaped, she edges close to simpering yet rises to genuinely moving moments. The vamp is Olga Baclanova [who became the blonde tormentor in Tod Browning's FREAKS], here writhing around in a black negligee and looking startlingly like Madonna.<br><br>Today, the films of Paul Leni are hard to track down, but worth the effort. Starting as an art director, Leni developed his visual command in Berlin; this Germanic style stands out in some beautifully designed compositions, such as a dynamic night sequence: a ship, full of gypsies being deported, heaves through a furious snowstorm. Yet Leni always works at the heart of the human values in the story, sustaining intense moments for all his actors. While some scenes are staged in darkness to rival a film noir, Leni also floods Veidt and Philbin with light, often focusing on one nuance per shot, an old-fashioned but effective strategy.<br><br>Filmed on the cusp of the sound revolution, this semi-silent has added sound effects and rather vague non-stop music but no spoken dialogue.","user":"rfkeser","rank":[32,33]}]