[{"title":"Brilliantly Distasteful Cult Gem","rating":10,"date":"27 December 2009","review":"\"Flesh For Frankenstein\" of 1973 is a wonderfully grotesque, bloody, bizarre, creepy, hilarious, artistic and absolutely brilliant slice of European Exploitation Horror that may not be missed by any lover of cult-cinema. The first of two takes on classic Horror tales directed by Paul Morrissey, starring Udo Kier and Joe Dallessandro and (co-)produced by iconic artist Andy Warhol (the other being \"Blood For Dracula), \"Flesh For Frankenstein\" (which is sometimes referred to as \"Andy Warhol's Frankenstein\") is an Italian/French/American co-production that simply has to be seen to be believed.<br><br>A blend of rich Gothic atmosphere, grotesque artsy imagery, unvarnished sleaze and excessive gore and wonderfully black humor, \"Flesh For Frankenstein\" is both a tribute to- and satire of earlier Horror greats. At the time of its release, the film was highly controversial for its depiction of sex and gore and even received an X-Rating in the US: No wonder, as this unspeakably morbid little gem features all kinds of demented scenes including explicit perversions, such as necrophilia, all containing a very VERY morbid sense of humor.<br><br>Udo Kier shines as a very demented Baron Frankenstein (with a thick German accent), who lives with his sister/wife (!) Katrin (Monique Van Vooren), their two children, as well as his equally demented assistant in a castle in Serbia. Frankenstein plans to create female and a male Zombie from body parts; the natural children of his creations are then to become a perfect race of people. In the meanwhile, the super-potent stable-hand Nicholas (Joe Dallesandro) has sex with every female that crosses his way...<br><br>Udo Kier fits perfectly in the role of the Baron - extremely demented, perverted and weird, Frankenstein constantly yells at his assistant for being a pervert. This Baron is dedicated to science and obsessed with results as are other Frankenstein versions in cinema (such as those played by Colin Clive or Peter Cushing), but, unlike these predecessors, he is also demented in every other imaginable way. Udo Kier is definitely one of Germany's greatest actors and doubtlessly THE remaining expert for sinister and eccentric characters since Klaus Kinski passed away. He is truly great here. Monique van Vooren is also very good as the Baron's equally malicious sister/wife - van Vooren looks very young for her age (she was 48 when the film was made), but also really weird, since she has no eyebrows. Italian Horror enthusiasts will notice that the Frankenstein couple's daughter is played by Nicoletta Elmi, who was in many other cult-classics such as Dario Argento's \"Profondo Rosso\" (1975), Mario Bava's \"Bay of Blood\" (1971) and \"Baron Blood\" (1972), as well as Aldo Lado's Giallo \"Who Saw Her Die?\" (1972).<br><br>\"Flesh For Frankenstein\" is a film that is very gory and outrageously morbid for its day. When I first saw it, some scenes even reminded me of Joe D'Amato's 1979 shocker \"Buio Omega\" (though this film isn't quite AS demented and sick as D'Amato's film). IMDb and some other sources credit Italian Horror deity Antonio Margheriti, who happens to be an idol of mine, as co-director of this film; however, it appears that Margheriti was merely credited to draw Italian viewers into cinemas, and had little to nothing to do with the actual production of the film. Either way, this is a must-see. \"Flesh For Frankenstein\" is a wonderfully bizarre, atmospheric, gory, demented, morbid, incredibly (and VERY darkly) funny film, that MUST be seen by all cult-cinema fans, and, personally, I cannot understand how anyone could not love it. My rating: 10/10","user":"Witchfinder-General-666","rank":[21,24]},{"title":"A little something to make Mary Shelley skyrocket out of her grave.","rating":6,"date":"21 May 2003","review":"Baron von Frankenstein (an out-of-control Udo Kier, a guy with amazing eyes) has created a beautiful female monster out of stitched together body parts and now yearns to make a male version as her companion. Meanwhile, his dissatisfied wife Katherine (Monique Van Vooren) has the ever-so-studly Joe Dallesandro (whose New York accent is way out of place) to fulfill her sexual needs. The baron mistakes Dallesandro's virginal (possibly gay) friend as him, cuts his head off and eventually puts together a male creature, in an effort to mate his two subjects. <br><br>This outrageous horror parody has incest, necrophilia, bloody stitches, gutglobs spilling out of stomachs, impalements, severed body parts, rape, lots of nudity and sex, campy performances and bad taste dialogue. The ending is hectic, nasty and totally hilarious as all the characters end up dead in a big cartoonish pile of bloody bodies (Carlo Rambaldi did the FX).<br><br>It was filmed back-to-back with ANDY WARHOL'S DRACULA by the same director, producers and some of the same actors (both were \"supervised\" by Antonio Margheriti) and was originally released in an X-rated 3-D version with all kinds of gross stuff thrust right at the viewer (wish I could have seen it that way!).<br><br>Score: 6 out of 10","user":"capkronos","rank":[24,28]},{"title":"Good Clean Fun!","rating":6,"date":"28 July 2008","review":"This was the first of 2 films made in quick succession by Paul Morrissey in Italy in 1973. Blood for Dracula was the other. <br><br>Flesh for Frankenstein was obviously made with it's tongue firmly in it's cheek. It's a step beyond anything Hammer attempted in this genre, especially regarding gore and dodgy accents! <br><br>Udo Kier and Arno Juerging are possibly the best comic duo to hit the screens since Abbot &amp; Costello as the Baron and faithful sidekick Otto! Whether fooling around in the lab or scouting for suitable organs they never fail to raise a smile. Kier gets all the best lines, letting us know his views on gall bladders and his plans for the new race he is ..ehm.. putting together. <br><br>Monique Van Vooren is more sinister as the Baroness, who initially appears relatively normal, in comparison to her \"husband\" at least. However her eccentricities become apparent as the film goes on. <br><br>Joe Dallesandro is on screen a lot but his character doesn't contribute much to the plot. Presumably his name was used to garner publicity for the film in the US. <br><br>The Frankenstein kids take after their parents and are crucial to the twist at the end of the film. The young actors playing the kids do a good job. <br><br>The actors playing the Baron's works in progress don't have much to do, even when their characters are brought to life. <br><br>Certainly the film will not be to everybody's taste. There is plenty of gore and some dodgy sex scene sound effects. The scene showing the Baron's \"interest\" in the female creation and her innards pushes the boundaries a bit but it is too over the top to be anything more than comical. So sit back and enjoy this piece of 70's schlock horror.","user":"paudie","rank":[14,17]}]