[{"title":"A Real good one for Thrillers","rating":8,"date":"9 September 2006","review":"Sam Bowden (Gregory Peck) is a happily married lawyer with a teenage daughter, a quiet life and little worries to care for until released convict Max Cady (Robert Mitchum) moves near by seeking for revenge against him. Cady blames Bowden for his 8 years imprisonment because the lawyer failed to get him an innocent verdict in Court for a serious crime he was accused of (and he had committed). The man starts by stalking Bowden and his family while he waits for the appropriate moment to make his move. In the meantime, Cady does not hide his intentions and Bowden knows perfectly well they are in big trouble.<br><br>The film is tense all along and interest doesn't fall at any moment. There is a correct direction by J. Lee Thompson, a slightly more than average director who probably did here one of his best jobs (the other one \"The Guns of Navarone\" (1962) a very entertaining World War II adventure). Black and white shooting was a good idea and helps to create some sort of sordid and dark atmosphere when required as well as the musical score.<br><br>Casting is very good too. Gregory Peck is correct in one of his many common good guy roles. Polly Bergen is believable as the frightened wife and there is also good acting by Martin Balsam (as Bowden's chief of police friend) and Telly Savalas (as a private detective hired to help the family). But the major credit in this issue goes without doubt to Robert Michum's performance as the dangerous avenger. He looks calm and quiet -with few exceptions- all the way to the final climax sequences but you know perfectly the man is real mean and deadly. This surely was one of Mitchum's best appearances in his long film carrier.<br><br>The 1991 Cape Fear version with Robert de Niro -although a watchable movie- is not as good and thrilling as this one where evil doesn't appear clearly till the end but menace is always there.<br><br>A very good thriller indeed!","user":"ragosaal","rank":[39,42]},{"title":"An Original - If It Ain't Broken, Don't Fix It","rating":9,"date":"8 December 2004","review":"When I first saw J. Lee Thompson's film I was on the edge of my seat. It is a scary thriller without showing buckets of blood, graphic violence, monster make-up, or even using the word \"rape\".<br><br>A bitter, amoral, psychopathic ex-con, Max Cady (the incomparable Robert Mitchum), recently released from an eight-year prison term, is out for revenge against the man who testified against him at his trial, lawyer Sam Bowden (the late, great, Gregory Peck). He infiltrates into Sam's life, stalking his lovely wife, Peggy (Polly Bergen, no shrinking violet), and his pretty, innocent teenage daughter, Nancy (the appropriately sweet Lori Martin). Sam does everything legally possible (for the time, before anti-stalking laws came into place) to protect his family, but he finds he is powerless under the law, and Cady is very intelligent in his planning. It all ends in a showdown on the river Cape Fear.<br><br>Let me just say that this movie has an advantage over the 1991 remake. Cady doesn't have to be covered in tattoos or act like Freddy Krueger to be terrifying. The word \"rape\" doesn't have to be mentioned nor does the offense have to be shown to us graphically (since the censors of the time forbade it) for the viewer to understand and comprehend what is going on. The performances are all right on, and even when Barrie Chase's Diane Taylor is assaulted, we don't have to be told that she was raped, because it's implied and it's written all over her bruised, traumatized face. Her portrayal of this victimized and frightened young woman is impeccable - why didn't she have a longer career?<br><br>Gregory Peck is compelling, and the scenes where Nancy is pursued by Cady outside her school and she escapes inside, only to fear that he has also followed her in (and she is mistaken) is absolutely nail-biting, as is the final showdown. Cady's devious plan to accost Peggy on the boat in order to \"trade\" her for Nancy is gut-wrenching and extremely watchable. We now have a names for guys like that - rapist, stalker, pedophile, murderer - but the first three were either not used or hadn't been made a term yet. A classic, don't accept any substitutions. As I usually give so much away in my comments, I'll leave the plot details at that. Bernard Hermann's score for the film is perfect, and ranks right along with his score for Alfred Hitchcock's \"PSYCHO\" - a masterpiece. And so is the movie. Don't watch it alone or in a dark room! 10/10.","user":"Noirdame79","rank":[36,39]},{"title":"Good drama made great by an excellent Mitchum","rating":5,"date":"5 December 2002","review":"Sam Bowden is a lawyer who, eight years ago, acted as a witness against Max Cady to put him behind bars.  Released from prison, Cady has studied the law and is set on terrorising the Bowdens without actually overstepping his legal rights.  As Cady toes the line with increasingly worrying results, Browden begins to cross the line to deal with him and protect his family.<br><br>Having seen the remake first I wanted to go back and see it done originally. My first impression was that the remake had done some elements better than this.  For example Nolte's lawyer is a lot less clean-cut than Pecks'.  Also the sexual threat to the daughter is a lot more played out in the remake. Getting past this I saw how this was actually a better film in many ways. As a drama it moves along at a good pace  not jumping from one thrill to the next but not dragging either.<br><br>The film can only hint at the deeds of Cady because of the censors but it is clear even to the blind that Cady is a monster.  This ups the tension as everything is slowly build to and we don't get a bloody or sexually shocking scene as a pay-off, no, here the tension is build on top of other tension. The direction is good, giving a dark feel to the look of the film as well as hinting constantly.  Even if some of the thrills are signposted it still works well.<br><br>However, without Mitchum's performance this would be a very different film. With the help of De Niro's sneer or menacing tattoos, he is still a better Cady.  He is on top form  where De Niro wore his threat large, Mitchum hints at it under a veneer of casual disinterest, making the threat seem bigger when he acts.  Peck is good even if his character is too clean-cut when he should have been pushed further over the line for my tastes.  Bergen doesn't have much to do, but her final scene with Mitchum is powerful and she really lets rip.  Martin is perfectly cast  she looks like a child but also is `developed' enough to be a sexual role for Mitchum to prey on.  It is easy to watch her as Mitchum closes in on her, almost licking his lips, but that's the power of the film.<br><br>Overall this manages to be powerful and thrilling despite the censors and is a really good drama.  However it is totally carried by a monstrous yet subtle performance by Mitchum.  De Niro was good in the role but once you've seen this you'll realise that menace can be acted subtly and not just by sneering and getting tonnes of tattoos.","user":"bob the moo","rank":[36,39]}]