[{"title":"underrated, generally.","rating":15,"date":"15 February 2003","review":"I saw this picture on Betamax in '81 or '82 and it really got under my skin. Frankenheimer's monster movie is partly responsible for me getting into the business (along with Jaws, Alien, Raiders, Blade Runner, not that I'm really inviting such comparisons). I actually had occasion to have a smoke and chat briefly with Robert Foxworth about the making of the picture when I was grip on a made-for-TV suspense pic in Atlanta. He was approachable, friendly and enjoyed talking about that show. He said that they had lost a stunt driver, and narrowly escaped losing a cast member or two when their first construction truck/picture car (the 4wd monster truck our ensemble try to escape in) took a dive off a cliff. They had to scramble to find another one and finish the picture. RF also said that Frankenheimer was an accomplished chef and had occasionally treated the DP and Cast to gourmet meals.<br><br>Prophecy is now on DVD, presented the way it was originally shot. I think I bought my copy for less than $15. All of the criticisms of this film are true, and it does not belong in the first Frankenheimer potential box set with \"The Train,\" \"Manchurian Candidate,\" and \"Seven Days in May.\" But with this marginal script and genre, bound together with a tired, preachy and inaccurate environmental message, Frankenheimer managed to put together a monster picture that has surprisingly stout legs. Remember, Paramount released this monster muppet against \"Alien,\" arguably the best film of its kind ever made. The monster grizzly is enraged, frightening and unpredictable. It is key to the film's suspense. If the Emmerich/Devlin team gave 'Zilla the same qualities, suddenly that film is worth watching for more than the effects. Prophecy had virtually no effects by today's standards. They had to make up for this with shooting and editing; a.k.a. conventional, hand-crafted filmmaking. I may indeed be prejudiced, but I still like this movie with all of its problems.","user":"dannyboyservicesLLC","rank":[49,57]},{"title":"Prophecy the movie is more complex than is being given credithere.","rating":7,"date":"21 January 2001","review":"Reviewers of the film are quick to undercut its actual effectiveness as a film without realizing that many parts of the film succeed, including the tension of the characters against the beast, the horror of the beasts' attacks, the helplessness of man within nature, etc. Reviewers would be accurate to attack the cheesy effects, hokey dialogue at times and overall loss on energy in the film toward the climax, but there's much more going on here.<br><br>Prophecy is, at best, a) a departure for John Frankenheimer, b) a 70's horror movie with a social conscience and, c) not withstanding amateurish special effects, predictable dialogue and long-view shots of Talia Shire looking petrified beyond speech, an actually entertaining, somewhat surprisingly satisfying film.  The novel created an intelligent, often compelling case for early environmentalism and the frightening consequences of doing nothing in light of the dangerous contamination of the Earth. Prophecy as a film suffers from a deplorable special effects deficiancy (case in point: at one point in the film, the monster is clearly \"walking\" on the dock with the courtesy of a mechanical dolly and hydraulic levers...uggh) as said before, but looking beyond this, the film's plotline does build tension, though it loses steam in the end, concluding with a rather lamely tacked-on \"surprise\" ending that is more befitting of the TV networks in the 70's.   Frankenheimer captures a \"land-locked\" Jaws-like eating machine on film with a vengeance, and the subsequent carnage is, while unfortunate, in light of the circumstances that created the beast, understandable.  The focal point of the movie, the beast itself, operates as a deranged ecological locomotive ( actually sounding like one onfilm at times ) hell-bent on taxing mankind for its misfortune.<br><br>Remarkably ( and most likely accidentally) the film achieved a perfect \"of the moment\" time slice capture of the late 70's era, replete with the worries, political movements, ambiguities and uncertainties of the time all woven within the backstory of the Indian's struggle against the papermill, global overpopulation, bigotry and commercialization at the expense of nature.<br><br>Beautiful scenery ( courtesy of British Columbia, circa 1978/1979), believable performances, particularly from Richard Dysart and Armand Assanti, combined with circumstances and sequences never actually realized on film before combine to make a pretty meaty B movie. Case in point, the opening sequence with the dogs and the cliff, the tunnels of the Indian village and their subsequent use later in the film. I saw this film when I was 11, and the memory of the camping family and their fate in the film has YET to leave me. Don't think I've ever camped again without recalling that scene...<br><br>I recommend the film without taking it as seriously as it seems to take itself, though the message of environmentalism is one worth listening to. The plot device of methyl mercury poisoning in Minimata, Japan is based on true life actual events, and is considerably more frightening than the sum of this movie, but is worth researching sometime.<br><br><ul><li>Monstergarp</li></ul>","user":"monstergarp","rank":[40,49]},{"title":"Underrated thriller","rating":9,"date":"2 September 2002","review":"It did have its share of cheesy moments, but Prophecy is one of the best rampaging-mutant movies I've seen - and I've seen quite a few. Some users have complained that the terror shots are too few and far between, but this is an ancient and now-lost film-making technique called 'building suspense'. Personally, I think it enhanced the shock value of the monster (which, by the way, still manages to give me the occasional nightmare, even as I approach 30). The scene where Foxworth, speaking into a tape recorder as he puzzles out the environmental disaster, gradually realizes the nature and extent of what he's facing, is a true cinematic gem. If this were a 'serious' movie, it would have been worth of at least a nomination, and the chainsaw/axe duel is intense. However, horror movies rarely win awards.<br><br>I do laugh during the sleeping bag scene, though. Can't help myself. And the viewer can clearly see that the monster morphs from fifteen feet tall to eight feet tall when it goes from close-ups to action shots. The creature itself is terrifying, in my opinion. Anyone who can't suspend their disbelief enough to overlook a few flaws in the special effects techniques probably shouldn't be watching monster movies, anyway.<br><br>This is one of the prizes of my video collection, if I ever find it on DVD, I won't hesitate to add it to THAT collection, as well.","user":"knsevy","rank":[19,23]}]