[{"title":"The kids at 14, what a difficult age.","rating":17,"date":"17 February 2006","review":"Michael Apted must be congratulated for having (or perhaps stumbling upon) the vision for this study. Begin with 14 seven year olds in England, film them in a few interesting situations, and follow those same kids as they grow up. Every seven years. Because all of our lives transpire at roughly the same rates, we cannot actually observe children growing up. But this filmed approach is the next best thing.<br><br>This second film is a bit longer, and now has color in it, but still plays much like a home movie. Now we get to see, side by side, the same children at 7 and at 14. A very difficult age, 14 is. The shy ones are more shy, and the more assertive ones are starting to feel like they understand the world around them. We begin to see the very rough edges of children on the verge of young adulthood.<br><br>This and all the others through '42-UP' in 1998 are on the 5-disk DVD set just out. (\"49 UP\" has been made but is not yet available on DVD.) However, simply seeing the most recent film (42-UP or 49-UP) is pretty good, because each film contains snippets of each of the former ones, allowing us to see how each child developed in 7-year increments.<br><br>Just a marvelous study of growing up.","user":"TxMike","rank":[13,15]},{"title":"We Discover","rating":10,"date":"10 November 2006","review":"The way I think of films is that every film is first about other films and incidentally about life. In referencing or extending our film experience 혰 and at the same time providing tools for folding that experience into life 혰 movies give us tools FOR life. Or for dreaming, which is much the same.<br><br>Here we have the second chapter of a movie made so far over fifty years. It deliberately references the story 혰 a well developed one 혰 of British class society which exists as much in art as in life, perhaps more. That's because the notion of class is enfranchised by the resources and fealty of those not privileged, and they buy into it because it gives them a story worth being a part of. This is a story about that story.<br><br>So just in its notion, this series will be important. I am only at the second chapter at this writing and boy am I hooked. It seems that they couldn't have picked more exemplary types if they had tried. The painfully shy farm boy. The three young upper class schoolboys, trying on old costumes. The three low class girls headed toward shopclerking and daft motherhood. The aspiring jockey. The rich, empty girl on her Scottish estate, sitting on the grass while her dog mauls a rabbit. Its all too perfect. And though the seven year stretch between chapters seems a bit long at this point in their lives, 14 is a great age to see the clumsiness with which these kids adopt their roles.<br><br>I understand that some of the 14 souls chose to not continue being gawked at in future episodes. I am sure I would opt out, because each of us are so mundanely transparent when viewed this way.<br><br>What an experience. The first chapter was dull. This already is engrossing.<br><br>Ted's Evaluation -- 3 of 3: Worth watching.","user":"tedg","rank":[14,17]},{"title":"among other things, a masterpiece of juxtaposition","rating":10,"date":"29 January 2010","review":"This is not at all to put down the first entry in the \"Up\" Series by Michael Apted, Seven Up, but if you were to first go to this film- 7 Plus Seven- you actually would not be missing that much in the story lines of the children profiled. This is because Apted does something very smart in how he structures the material in this segment of the series, when all the children interviewed before when seven are now fourteen. He makes sure that the audience, who may need to be reminded who everyone is (at the time this was made, remember, things weren't re-aired frequently on TV, so many may have forgotten by seven years past), by simply just taking footage from the first segment of the Up Series and putting one interview following the previous one. It's not being lazy and relying on past clips, but a very precise form of counterpoint.<br><br>We see this as Apted unfolds the interviews with subjects like Bruce, Jackie, Suzanne, Nick, Charles, Lynn, all of them are here, and we see how specifically they've grown in physical appearance and voice, yes, but also in attitude and outlook. Apted asks similar questions from before, like \"What do you want to be when you grow up?\" Things like that, or 'what, if anything, do you watch on TV', and then it transitions into deeper, heavier questions that the kids, as when they were seven (far more articulate than many parents would ever give credit for) can at least try to tackle. Love, politics, religion, race, the state of Britain, hippies, nothing is really too far off limits to ask these kids, and we get a full spectrum of something very elemental: who are these people, if only in profile? <br><br>Apted is asking specific questions and getting honest answers- sometimes awkward, like when asked about girlfriends and boyfriends, but then again they are fourteen after all, that dastardly age to be- and its all framed about what was said in the past and what's said in the present. Another asset is the style; before it was black and white, looking like a very long newsreel story for movie theaters, and now it's in color, albeit faded over time, and the difference is striking (not to mention the intensity of the camera in some instances, as in 1963 Apted wanted to capture the rambunctious side of seven years olds). <br><br>While I'm not sure if 7 Plus Seven ranks as one of the best documentaries ever, and frankly I still hold out hope for any of the others in the series to top it, it does pose some of the best use of juxtaposition in a documentary I've ever come across. It's about growth, perspective, and innocence fading and changing, with more yet to come.","user":"Quinoa1984","rank":[3,3]}]