[{"title":"Love's lost time","rating":10,"date":"30 December 2005","review":"It brought Audrey Hepburn back to the screen after an absence of eight years. It brought Sean Connery and Richard Harris back together again after their teaming in \"The Molly Maguires\" and it even brought back Connery and Robert Shaw fourteen years after they fought to the death in \"From Russia With Love\". Unfortunately at the time of its release it did not bring back audiences to the theaters. For a movie going public acclimatized to the likes of \"Jaws\" and \"Rocky\", a film concerned with aging and loss, corruption and mortality was not likely to find very wide acceptance. Today it is generally regarded as a classic and one of the best adult love stories ever filmed. What do heroes do when it's time to call it a day? This is the problem confronting Robin Hood, a legend in his own time, on his return to Sherwood Forest after twenty-five years of fighting in the Holy Land. Should he, as old soldiers are said to do, quietly fade away, or go out in a blaze of glory? Unfortunately Robin is, as his great adversary, The Sheriff of Nottingham wisely observes, \"A little in love with death.\" So it is unlikely he will slowly fade away. And Death hangs over the film like an unseen presence. This central theme is given visual emphasis in one of the opening shots. We see three apples set in an open window. Perfect at first, then suddenly an abrupt jump cut showing them rot. This motif of aging and corruption is repeated for the closing of the film as well. We hear Will Scarlett sing about, \"Following Jolly Robin to the grave.\" The mortally wounded Richard Lionheart confides to one of his lieutenants his dislike of the cold and dark; when Little John expresses his desire to go see his father again, he is ruefully informed by Friar Tuck that, \"He died years ago, John...\" The wistful reaction on Little John's face eloquently expresses regret too profound for words. Visually and verbally death is a constant presence. Indeed, the original script was titled, \"The Death of Robin Hood.\" With a title like that it was not going to be a rehash of Errol Flynn and Olivia de Havilland. And perhaps that also added to the films lackluster performance at the box-office. Audiences brought up on \"The Adventures of Robin Hood\" simply could not accept seeing these two beautiful star-crossed lovers ravaged by time, even if they were portrayed by the likes of Sean Connery and Audrey Hepburn.<br><br>However like the Flynn film, \"Robin and Marian\" boasts a superb cast. Sean Connery gives one of his great performances. His Robin refuses to acknowledge the approaching infirmities of old age, and like a great ex-athlete attempts to make a comeback in a world that has long since left him behind. Nicol Williamson, woefully under-used in most films has one of his best roles as Little John, the terrible gentle giant who follows Robin with the unquestioning simplicity of a child. He and Connery have the essential chemistry necessary and make an incredibly good team. Robert Shaw brings intelligence, sensitivity and danger to the Sheriff of Nottingham, a man who will ultimately be undone because of those very virtues. Richard Harris does a magnificent turn as King Richard the Lion-hearted. Even though burnt out by years of chasing after glory, he still retains the after-glow of greatness. Ian Holm as his brother Prince John is a wonderful contrast, anxious and insecure, scheming and pleasure loving. His scene with the ambitious, equally scheming Sir Ranulf, the marvelously supercilious Kenneth Haigh, highlights another of the film's themes; the passing of the chivalric age. This is signaled by the death of King Richard, continues with the death of The Sheriff, and is completed by the deaths of Robin and Marian. Prince John and Sir Ranulf symbolize the ascendancy of the modern, hollow man, ambition without vision, loyal only to power and expediency. Prince John, is King as CEO interested only in profit, Sir Ranulf, like the armor he sports, a soulless, mechanical bird of prey. Denholm Elliot as Will Scarlett and Ronnie Barker as Friar Tuck complete Robin's band. Elliott was an actor who could express more with a simple look than most actors can with pages of dialog, and Barker has some nice ironic moments as the Friar. Finally \"Robin and Marian\" brought Audrey Hepburn back to the screen, as radiant and lovely as ever. Seeing her first in her nun's garb recalls her appearance in, \"The Nun's Story\" sixteen years earlier. Some people have an ageless beauty and Audrey Hepburn had that quality. She and Connery may be the best tragic lovers since Humphrey Bogart told Ingrid Bergman to get on that plane in \"Casablanca\". Their scenes together are magic. When Marian asks Robin why he followed Richard during all the years of terrible carnage, Connery sums up his life with a simplicity that is breathtaking; \"He was my King...\" <br><br>The film is wonderfully elegiac and the melancholic sense of time irretrievably lost is heartrending. James Goldman's screenplay is quite simply his best, surpassing his own adaptation of his play, \"The Lion in Winter\". Unlike that film Goldman refuses to indulge in pithy witticisms at the expense of period flavor. John Barry's bittersweet score and Richard Lester's austere direction never descend into sentimentality and underscore the tragedy of the two lovers reunited after spending half a lifetime apart. David Watkins's gritty cinematography beautifully captures the squalor of life in the medieval age. \"Robin and Marian\" is a bittersweet adult love story for discriminating viewers of all ages.","user":"GulyJimson","rank":[110,132]},{"title":"Bittersweet romantic tale, autumn in Sherwood Forest","rating":8,"date":"19 April 2006","review":"This is a lovely tale chronicling the autumn days of Robin Hood's life and his rekindled romance with his lost love, Marian. The only reason I didn't rate it higher is that I was hoping for more scenes with Robin &amp; Marian together, as opposed to the men's exploits. The movie relates Robin's story from an unusual perspective, not as the legendary dashing young archer &amp; outlaw, but as an aging hero with some physical infirmities, making him all the more appealing. But Robin Hood still has some fight left in him...<br><br>The much older Robin has returned from the Crusades to Sherwood Forest, accompanied by his faithful friend and constant companion, Little John. His old love, Marian, is by this time a nun, in fact the Mother Superior of an Abbey. Politically, King Richard the Lionheart and his brother, Prince John, are basically greedy idiots and definitely no asset to the peasants. Robin's old nemesis, the Sheriff of Nottingham, is as menacing as ever, and Robin must again summon a band of loyal followers (including his old cohorts, Will Scarlett and Friar Tuck) to protect the innocent from the Sheriff's tyranny.<br><br>The two stars are perfect in this mature love story, with its dramatic ending that I won't give away here. Sean Connery makes a sympathetic and compelling but weary hero, as Robin comes to grips with his aging, his physical limitations, and his mortality. Audrey Hepburn with her ageless beauty is radiant, dignified, and graceful as Marian. The pair are absolutely beautiful together on screen.<br><br>Actually, the most engrossing relationship in this film might just be between the two old adversaries, Robin and the Sheriff of Nottingham, who form a sort of bond and develop mutual respect. Robert Shaw is absolutely perfect in his role as the Sheriff, who seems almost sympathetic &amp; honourable here, not quite his usual completely villainous self. Their struggle culminates in a dramatic sword duel. Another relationship well developed is the one between Robin and his faithful friend, the gentle giant, Little John, who is portrayed by Nicol Williamson. Richard Harris plays the malevolent King Richard, though I am uncertain as to the historical accuracy of the depiction.<br><br>This movie has beautiful cinematography and musical scoring. Though Robin is no longer the daring young adventurer of old, this story is much more compelling than some other adaptations, notably the vastly inferior Robin Hood, Prince of Thieves, starring Kevin Costner. Perhaps less exciting derring do than other tales, this film (to its credit) tends to humanize the mythical medieval hero. It is a touching, bittersweet, and melancholy tale of autumn in Sherwood Forest...for Robin's band of Merry Men, his lady, his foe, and especially the legendary hero himself.","user":"roghache","rank":[29,32]},{"title":"A good, inspiring movie, about the true nature of heroism","rating":24,"date":"24 October 1998","review":"Most people are unaware of this movie's existence, despite an all-star cast. It is one of my favorite movies of all time.<br><br>Robin Hood is an old man now, trying to tie together some of the pieces of his ideals. The familiar characters are also still around.<br><br>The most interesting thing about the movie is the insights it offers into the nature of heroism. Robin and the merry men were heroes because of what they believed in and their courage, not because they could shoot the straightest and run the fastest.<br><br>The gang can't jump fences or climb walls any more, or do much of anything that requires physical exertion. Their efforts are sometimes comical. But they are still great men because of what is inside of them.<br><br>Audrey Hepburn is wonderful as the aging Marian, and look for the visual poetry of the three apples which are pictured in the opening as ripe and in the ending as withered, as are Rob and Johnny and Marian. There are many such metaphorical presentations which are not often seen in movies. I like to see a little of that visual poetry, even if it is a bit clumsy.<br><br>Not a great film ... not a Grand Illusion or anything, but just a nice execution of a simple, touching concept.","user":"Scoopy","rank":[28,31]}]