[{"title":"A film that makes me confront my deepest fears.","rating":10,"date":"22 July 2005","review":"\"Santa Sangre\" is one of Jodorowsky's most accessible films. Although not as strange as \"El Topo\" and \"the Holy Mountain\", it is still very bizarre ..... A colorful, horrifying and hallucinatory masterpiece. Many have compared it to \"Psycho\", \"Freaks\" and \"Fellini\". In my opinion, you can't compare it to anything because it's in its own category. Produced by Claudio Argento, brother of Dario Argento; the film does have a similar color style to \"Suspiria\". \"Santa Sangre\" is the story of Fenix, a man in a mental institution at the films beginning. A flashback shows Fenix as a child, growing up in the circus. His mother, Concha is a trapeze artist and religious fanatic who worships an armless god. His father Olgo is a knife thrower, who is constantly having flirtatious encounters with the ugly, cruel tattooed women. Fenix's closest friends are a mute mime, a dwarf and of course clowns. After a circus performance, Fenix's mother catches Olgo having an affair with the tattooed lady. In a fit of jealous rage, she dumps acid on their genital regions. Then Olgo cuts off Concha's arms like the goddess, and then cuts his own throat. Poor Fenix witnesses the death of his father, and the Tattooed women drives away with his mute friend Alma. Years later Fenix is reunited with his armless mother, she's out for revenge. In order for her to throw knives, he has to stand behind her and put his arms through her sleeves. It's as if she controls his arms with her mind. \"Santa Sangre\" is very bloody, disturbing and surreal, but at the same time beautiful and dreamlike. It contains bizarre images such as an elephant funeral, chickens falling from the sky, and mentally handicapped kids tricked into snorting cocaine. (the last being a metaphor for societies corruption of the innocent) Because the film is psychologically disturbing, it makes me confront my deepest subconscious fears; loss of arms, genitals or sanity. I have watched the film more than several times, and it is one of my favorite movies. Every time I watch it, I cringe as I'm challenged by both its beauty and disturbing intensity. So it's not really a horror film, but a surreal masterpiece with horrifying images. It will haunt you long after it's over.","user":"NateManD","rank":[83,95]},{"title":"This One Stays With You","rating":22,"date":"22 July 2002","review":"I remember seeing this movie in 1990 in a tiny cinema in London, on a date. As we walked from the theater and got on the tube, neither of us said a word for 20 minutes.  Finally, she said, \"you have a strange taste in films.\"<br><br>\nBack then, I was heavily into Luis Bunuel.  This was one of the few post-Bunuel movies that embodied the essential creepiness and odd humor of the Surrealists (the other one that comes to mind is \"Videodrome\"). There's the obvious Freudian stuff, the obvious shock stuff, but leaving all that aside, there are indelible moments of cinematic poetry.  The elephant; the son's arms; the final shot.  It feels, more than 10 years later, like a repressed dream/nightmare.<br><br>I don't consider this a \"horror\" movie, in the sense that there are no slasher, monster, alien, demon, zombie, cannibal, haunted house, supernatural, dread disease, or giallo elements.  I don't remember this movie being particularly scary or gory; just creepy.  Maybe it's in a similar genre to \"Eyes Without a Face,\" but only in the sense that both movies deal with mutilation and revenge.  (Then again, I remember seeing \"Un Chien Andalou\" and \"In the Realm of the Senses\" in the horror section of a video store -- a sign of either ignorance or insight, I could never figure out.)  This one truly belongs in the Foreign Films section, but not just for being non-Hollywood.","user":"daiskeyoshida","rank":[66,75]},{"title":"Unforgettable, but not for everyone","rating":9,"date":"1 October 2003","review":"There's so much you can say about this work. Vivid characters, colours, and situations that practically leap off the screen into the theatre next to you. A wonderfully quirky, repeatedly startling story. Graceful low-key cinematography that turns slums and sideshows into an eerily beautiful netherworld, countless images that look like you could freeze them and hang them as inspirational totems for cults we have to hope don't exist. Jodorowsky paints with a heavy, vibrant brush, but it's the perfect tone for this primal-yet-humanizing tale.<br><br>But I should post a warning. As far as I'm concerned, my first viewing of this film was one of the more worthwhile two hours or so I've ever spent in a theatre, and I think based on my experience that this sadly neglected wonder deserves every bit of word-of-mouth promotion it can get. But I'm betting it's not to everyone's taste.<br><br>So this is my advice: if you found Storaro's green and red/jungle foliage and human remains canvasses in Apocalypse Now unsettlingly beautiful the first time you saw them, and wondered momentarily whether still prints were available for hanging before realizing what you were actually suggesting to yourself, here's a film for you. If you found Delicatessan's celebration of the paradoxical beauty hiding in human ugliness and stupidity a bit too sanitized for your taste, Santa Sangre's rather murkier depths await. You will love this work.<br><br>If, on the other hand, you have no taste for painters who work best in human blood as opposed to oils, and/or don't appreciate a bloody carnality mixed in with your religious metaphor, you will quite probably hate it with a passion that exceeds my affection. And I don't really blame you or judge you for walking out early. It takes all kinds.<br><br>Either way, fondly or with revulsion, you will remember it vividly, ten years later. I can say this confidently, as that's how long it was from the first time I saw this film to the day I wrote this review. Don't say I didn't warn you.","user":"ajmilne","rank":[61,70]}]