[{"title":"Worth Watching for the appearance of Harry Lauter","rating":6,"date":"6 February 2017","review":"Everything that has been written about this movie here is essentially correct and largely inarguable. Having said that I enjoyed this horror for the appearance of Harry Lauter in the role of the evil Dr Stewart Victor. Harry Lauter may be one of the greatest actors that no one has ever heard of in cinema history. He appeared in more than 156 movies and countless TV shows. He never once flirted with a main billing except for a co-starring role in 'Tales of the Texas Rangers' in 1955-58. He appeared in movies with James Cagney, Gene Autrey, Lee Van Cleef, James Arness and on and on. He was a perennial 'B' movie co-star with my personal favorite being 'Rocky Jones and the Clash of the Moons' in 1954. Superbeast was his last film appearance. He was also a gifted artist and ran an art gallery for many years. Just thought folks might like to know about a great actor that never really attained fame but who was a Hollywood regular for 41 years!","user":"alanjohnson-65117","rank":[12,12]},{"title":"Dr Moreau meets the most dangerous game in the Phillipines","rating":4,"date":"2 July 2006","review":"But for all those elements there is too much time spent with the dull lead actress walking silently around and some travelogue footage to pad out the proceedings. She just rarely changes expression and quickly sinks any hope the movie has.<br><br>Production values are decent(if you can make them out through a poor copy) the music isn't bad and main element of note is probably John Chambers (Planet of the Apes) make up design for the mutants and final superbeast. They are pretty much just cave man looking things though decently done.<br><br>So this is in some ways above average Phillipino production which seems to use mostly production sound, rather than being redubbed in post production. But it just becomes a bore, unless there is gore or nudity cut from the version I saw there's not much in the way of excitement or suspense.<br><br>The turning the tables on the bad guy element is pretty lame as well and the final battle doesn't even develop until the last ten minutes. One odd ball dream scene with the lead, still with the fixed facial expression, having a erotic encounter with one beast man, is odd indeed but not erotic.","user":"HEFILM","rank":[7,7]},{"title":"A fun-filled jungle romp goes horrible bad!!","rating":2,"date":"14 February 1999","review":"Okay that quote is misleading, there is nothing fun-filled about this movie at all. It manages not only to confuse you, it also can put you to sleep in twenty minutes or less. After watching this movie several times on cable I still don't know what's going on? Jungle beasts ???  Mad Doctors ??? Hello anyone out there??? guess not. Nothing actually happens until the last half-hour or so but, If you can watch it until then, well I got two words for you, DEEP HURTING. Unless of course you fall asleep before then.","user":"DISC","rank":[5,6]}]