[{"title":"One of My Top Ten","rating":10,"date":"18 April 2004","review":"Caught this film on cable, late night, a few years back.  No idea what to expect, just wasn't ready to go to bed.  By the time it ended, it was in my Top 10 of all time.  Certainly the lowest budgeted film (accounting for inflation, anyway) on that list.<br><br>Gibson was terrific, capturing a handicapped young man perfectly.  But, hey, the entire cast was great, especially Awyn Kurts as Tim's father.  And, after appreciating Piper Laurie for years and years, that night I fell in love with her.<br><br>I've never seen such a \"tight\" little film.  I doubt that there were more than 12 seconds of even semi-wasted frames.  Michael Pate did an amazing job.","user":"TomColeman","rank":[30,31]},{"title":"Possibly the most unknown film Mel has done...","rating":10,"date":"16 March 1999","review":"\"Tim\" is possibly the most unknown and under-rated of all the films Mel Gibson has done.  It is certainly one of the best and proved, quite early in his career, that he knows his craft very well and is well able to carry off a challenging role to perfection.  The title character, Tim, is seeking to know the adult world around him without an adults' understanding of the subtilties of life.  Mel Gibson plays the part to perfection, neither feeling sorry for himself nor being so crass as to portray this child/man as \"cute and silly\".  He is simple, \"Not the full quid\", as Tim puts it.  But he feels all of an adults needs and finds the person to explain life to him in a way he can understand.  Piper Laurie, as Mary, becomes the most important person in Tim's life; and she plays the role with a kindness and compassion usually not seen in today's actors.  This film is a must for anyone concerned with raising and educating a child with the challenge of a mental handicap.  One could hope that Mel will do more movies of this type, with the love and understanding and true actor's ability he shows in this, his second movie.","user":"lillian-3","rank":[29,30]},{"title":"A \"MUST-SEE\" for those who are open minded enough to accept romances between older women & younger men !!!","rating":10,"date":"28 July 2004","review":"Even though we now live in the 21st century, there are still many people who cannot bring themselves to accept anything that is out of the \"norm\". There still exist segments of our societies, that perpetuate the practices of intolerance.....especially when it comes to romance. For such individuals, this movie \"TIM\", is no doubt unbearable to even look at.<br><br>However, for those of us who are not stuck in the ways of the closed minded past, \"TIM\" is an example of a movie that is ahead of it's time. It is the touching story of two people, who find happiness and love, through an unorthodox relationship.<br><br>This film explores a romantic relationship between two people, that on paper, would seem almost unbelievable. Yet magnificently, this story is portrayed so well on screen, that it seems as realistic and natural as any other common relationship.<br><br>Yes Mel Gibson is in this film, but as a heterosexual male, my favorite character is played by leading lady Piper Laurie...........Who just so happens to be H - O - T, Hot Hot Hot !!!!!<br><br>In the words of young people today, \" She's a real M.I.L.F. !!!!! \" My goodness,......that flaming red hair and that navy blue bathing suit she wears at the end.....(Oh be still my beating heart !!!!) Piper Laurie is absolutely gorgeous in this film. If you can appreciate the beauty of an older woman, then this DVD is worth buying just to see her !!<br><br>What makes this movie so sweet though, is that there is nothing in this story that is perverted about their romance. You truly fall in love with Piper Laurie, as an honest woman who genuinely cares. Although she is an accomplished and successful woman, she is as emotionally innocent as Mel Gibson's character. Their romance develops naturally, and without sex as an ulterior motive.<br><br>This film, in it's own quiet little way, shows us that just because a relationship might seem bizarre to you, does not mean that there's anything wrong with it. The love of a lifetime, can spring forth between the most unlikely people.","user":"R1H2B3","rank":[32,34]}]