[{"title":"Murder At The Presidio","rating":5,"date":"11 March 2007","review":"A Military Policeman investigating what looked like a break-in at the Officer's Club at the Presidio in San Francisco is shot down. The same man also shoots an SFPD officer while fleeing the first crime. This makes the whole thing a dual jurisdiction between the Army and the local law enforcement.<br><br>Hard enough normally, but in this situation you have a detective played by Mark Harmon who's a former MP who has a bad history with Sean Connery the provost marshal in charge at the Presidio. Though they hate each other's guts they of necessity have to work together.<br><br>Sean Connery is one of those players who just being in a film elevates in class. Without him in the thing this would be just a routine police yarn, might have been good enough for a made for TV film and nothing more. Another conflict in the film is Connery with daughter Meg Ryan who takes an interest in Harmon at first to spite dad, but then finds herself falling for him.<br><br>Acting honors in this film go to Jack Warden the retired sergeant major who won a Congressional Medal of Honor saving Connery's life in Vietnam. Warden and Connery keep you interested in the film, in finding out just why the MP and the SFPD officer had to die. Without them, I doubt anyone would care.","user":"bkoganbing","rank":[18,21]},{"title":"Better-than-average thriller","rating":8,"date":"22 August 2001","review":"Despite what some people have said about this movie, I must tell you I thoroughly enjoyed it. Sean Connery, as always, gets into his character Lt. Col. Caldwell very well (he should be cast as a military officer more often). Meg Ryan, though limited in screen time, shines as his daughter Donna...they're father-daughter sessions make for some good drama.<br><br>Mark Harmon, who for some reason hasn't received many offers to star in big movie roles, plays Jay Austin. He's a cop who used to be an MP at The Presidio, the base at which a murder takes place. Harmon does an excellent job, both as Donna's lover and Caldwell's unwanted partner.<br><br>The fact is, the performances are wonderful, the story is fascinating, and the chase scenes create pulse-pounding excitement. If you like action, romance, drama, and a little humor every now and then, I recommend The Presidio.","user":"jhazelett72","rank":[31,40]},{"title":"Enjoyable But Predictable And Unexceptional Military Police Thriller","rating":5,"date":"27 August 2009","review":"When a military police officer is murdered on the Presidio of San Fransisco, a city detective and a provost marshal must form an uneasy alliance as they investigate the case.<br><br>This is a fair thriller with some exciting elements and is slickly made all round from the always watchable Hyams. It's one of his weakest films though, and I think I lay the blame for that mostly in Larry Ferguson's script. It lacks originality - all the elements of the characters and their relationships come from In The Heat Of The Night, Dirty Harry, Lethal Weapon and a hundred other cop movies. Also, and this bothers me about a lot of Hollywood movies, what is the point of the whole daughter romantic interest subplot ? Unless I'm mistaken, this is a film about diamond smugglers and a murder investigation. I don't really see (or care) what that has to do with Connery's inability to communicate with Ryan. I'm also not very taken with the cast here; Harmon is one-note, Ryan pouts and preens in her usual whiny and annoying manner, and the supporting cast aren't very interesting. Connery and Warden fare better, but both are hamstrung by the predictable story. When it's moving though, it's a pretty good flick - what it has going for it are pleasing Frisco locations, a couple of taut chase sequences, good photography and a moody score by Bruce Broughton. There's one scene I really like - Harmon charms some information out of a dispatcher purely by talking about The Grateful Dead; it's quirky, original and unexpected. The problem with this movie is that every scene in Capricorn One or 2010 is like that. A pleasant way to kill some time, but a rather lacklustre thriller. Trivia - Calfa and DiSanti sort of reprise their roles from The Star Chamber.","user":"ShootingShark","rank":[9,10]}]