[{"title":"\"The point is of no return, and you've reached it!\"","rating":12,"date":"12 June 2001","review":"From the beginning, you know that this monochrome Meyerama is going to be incredible--an Outer Limits-style voice-over pontificating on the violence of women, followed by incredible shots of three luscious go-go girls doing the Watusi as the Bostweeds' wild theme song blasts from the jukebox. Then things move to the barren California desert for drag races, catfights, murders, straining blouses, and a lot of torrid action and satirically overwrought melodrama.<br><br>Tura Satana, Haji, and Lori Williams have terrific screen presence as the three tough-as-nails villainesses. They're the kind of deliciously over-the-top antagonists that you root for, especially since the nominal heroine (Sue Bernard) is a ridiculous dimwit who couldn't act her way out of a paper bra--I mean, bag. Highest honors go to the amazing Satana, shouting most of her lines and dropping sexual innuendos while resting her boobs on the dinner table.<br><br>As usual, Russ Meyer fills the screen with sharp dialogue (\"Breast or thigh, darlin'?\") and sharp camerawork. There is no nudity, since Meyer was trying to circumvent the censors in 1966, but there are some incredibly sexy scenes all the same. Excitement and laughs abound in this straight-faced send-up of action-flick conventions. This celebrated cult classic is one big-breasted Gothic melodrama-satire that really...um...stands out!","user":"Vince-5","rank":[61,67]},{"title":"The \"Citizen Kane\" of trash cinema","rating":10,"date":"3 October 2006","review":"Three go-go dancers - Varla (Tura Satana), Rosie (Haji) and Billie (Lori Williams) - are racing their sports cars out in the desert when they meet up with a young man named Tommy (Ray Barlow) and his girlfriend Linda (Susan Bernard). Tommy is an amateur car racer who has come out to do some time trials. Varla challenges him to a race. When she cuts him off with her car it leads to a fight and she kills him. Dragging the frightened Linda with them the trio go into the nearest town to fill up with petrol. There they see a muscly young man (Dennis Busch) carrying his crippled father (Stuart Lancaster) to his truck. The petrol station attendant (Mickey Foxx) tells the girls that the muscle man is retarded and that his bitter old father is reputed to be rich, but must have his riches stashed away somewhere at his isolated homestead. The girls decide to drop in for a visit hoping to find the old man's riches. They pass off Linda as a rich man's runaway daughter they are bringing home against her will. What they don't know is that the old man is a misogynist who delights in kidnapping women for his son, whom he refers to only as The Vegetable, to rape. They will have to rely on their own deadly talents and the possible decency of the old man's other son Kirk (Paul Trinka).<br><br>Russ Meyer's black and white \"ode to the violence in women\" made little impact when first released in 1965. Meyer had taken the world by storm with \"The Immoral Mr. Teas\" (1959), the film most often credited with kicking off the nudie cutie craze. And he would become a household name with the success of \"Vixen!\" (1968). But the films he made between those two landmarks, though some of them are among his best work, didn't attract much attention. But then John Waters, in his 1981 autobiography \"Shock Value\" wrote : \"'Faster, Pussycat! Kill! Kill!'...is, beyond a doubt, the best movie ever made. It is possibly better than any film that will be made in the future.\" Waters dubbed Meyer \"the Eisentein of sex films\" because his use of skillful editing to get maximum impact out of scenes of sex and violence is reminiscent of the methods by which the Russian director managed to powerfully convey his political messages. Waters' championing of \"Faster, Pussycat!\", in particular, led to it becoming a favourite on college campus's across America.<br><br>If Meyer is \"the Eisenstein of sex films\" then \"Faster, Pussycat! Kill! Kill!\" is the \"Citizen Kane\" of trash films. I don't use the term disparagingly. For me a trash film is a film which appeals on a visceral rather than purely emotional level. In trash films realism is bad style. We must always know that we are watching a movie and enjoy it as a fantasy formed from our own base drives - from those uncivilised aspects of our nature that we must repress to live a civilised existence. Hence the term \"trash\" for the substance of these films is those aspects of ourselves which must be discarded. The violence in the trash film appeals to the knot in our stomach from every time we've had to bite back on our anger. It's prurient sexuality appeals to the lusts generated by everyday existence for which we may have insufficient outlet. We don't sympathise with the characters in a film like this, but we can identify with their actions because they take place in an obvious fantasy world. But the trash film has another appeal - the exhilaration that comes from the transgression of the bounds of good taste. And its sense of humour is the kind which elicits a belly-laugh. The anarchic spirit of the trash film has no less value than the more rarefied pleasures and intellectual stimulation of the art film.<br><br>What makes \"Faster, Pussycat! Kill! Kill!\" great is the way that it takes the sex and violence of the trash film and distills them into something more iconic than explicit. Unlike most of Meyer's films, there is no frontal nudity or sex scenes. The violence is powerful, but not extended or shown in gory detail. Yet Tura Satana in her tight black jeans, half-exposed breasts practically bursting free as she eyes up a man like a side of beef or takes him out with karate chop to the neck, distills any amount of sex and violence into a single unforgettable mythic figure. Similarly the vastly underrated Stuart Lancaster is the very personification of sleazy misogyny. Add to this the brilliant build-up of the opening monologue, Meyer's masterful editing and Jack Moran's eminently quotable and often hilariously funny camp dialogue and you have a trash film masterpiece that just gets better and better the more times you watch it.","user":"pinback-3","rank":[65,75]},{"title":"Russ Meyer's immortal trash classic. Has to be seen to be believed!","rating":27,"date":"27 January 2003","review":"I have watched and enjoyed most of Russ Meyer's output, and will quite happily defend his lesser works, but two of his movies have a life of their own and have managed to reach a larger audience than \"just\" card carrying Meyer nuts. They are 'Beyond The Valley Of The Dolls' and this one, 'Faster Pussycat! Kill! Kill!'. Both movies are trash classics and never fail to entertain no matter how many times you have seen them. 'Faster Pussycat!' really succeeds mainly because of the three strong leads, Tura Satana, Lori Williams and Haji. Any one of them would be enough for Meyer to plan a killer movie around, but all three together is dynamite! Satana, strangely enough, did very little movie work after this, mainly a couple of Ted Mikels turkeys. But it doesn't really matter because her screen immortality is assured. Her performance in this movie is more than enough! Williams also went on to very little, but she is very good here, and stylistically reminds me quite a bit of Erica Gavin in 'Vixen!'. In fact one could almost bet that if Meyer had been aware of Gavin when he made this movie she would have played the part of Billie. Haji appeared in a few more Meyer movies, including his masterpiece 'Supervixens', but this is probably her strongest role. All three women, who play go-go dancers by night, thrill seeking criminals by day, are simply wonderful and their chemistry and repartee are priceless. Meyer regular Stuart Lancaster is also in fine form as a dirty old man with more issues than a daily newspaper. There are so many unforgettable scenes in this movie it's difficult to single any out. The whole movie just rocks period. Many late 60s movies attempted to emulate a camp, comic book appeal ('Barbarella', 'Diabolik',etc.etc.) but in many ways Meyer beat them all, and did so without technicolor, large sets, multiple costumes, special effects and other gimmicks. Just crisp black and white photography and three chicks in the desert. Plus a brilliant theme song later immortalized by The Cramps. Russ Meyer divides most viewers. You either \"get it\" or you don't. If you aren't familiar with his work this is probably THE place to start. Watching this movie for many is a life changing experience! 'Faster Pussycat!' is one of the most original and entertaining movies made in the 1960s, and continues to amuse and inspire right into the 21st Century. Every time I watch this movie I am knocked out. This is a bona fide cult classic that gets better and better as the years go by. Absolutely essential viewing for anyone who loves exploitation movies, The Sixties, rock'n'roll and/or buxom babes!","user":"Infofreak","rank":[55,65]}]