[{"title":"What are the odds...","rating":6,"date":"6 June 2002","review":"...of running a Jeep into a huge water-hole in the middle of the desert?I don't know, but Chuck Norris did in this surprisingly funny flick.  It seems people either like it or hate it.  Granted, it's no classic, but it is funny (not hilarious) and the whole family can watch it together.  It has some pretty good gags (like our two heroes dressed up in priestly frocks) and one liners (\"You'll still be bald\").  It's a good example of efficient 80's film making.  Don't expect a bloated CGI filled Speilberg epic.  Firewalker is just plain fun.","user":"witsend64","rank":[14,15]},{"title":"Great comedy adventure","rating":8,"date":"25 May 2006","review":"I personally love this movie. I think the interaction between Norris and Gossett is hilarious. Quite a few of the fight scenes are really funny, while still showing good action. One of the best things about this movie is that Chuck Norris isn't perfect in it. His character fights very well, {the karate sequences are excellent} but he can't hit the broad side of a barn with a gun, and isn't particularly bright. <br><br>For those that hadn't figured it out, this is intentional. I found the imperfect Chuck to be a delightful part of this movie. I thought it was a great spoof of the treasure hunter movies. and it's tongue in cheek approach was very refreshing.","user":"Wyndeweavyr","rank":[28,34]},{"title":"I disagree with the one who said Pathetic","rating":8,"date":"16 May 2006","review":"I actually think this movie is Norris's best effort to date. I enjoyed it. The interplay between him and Gossett was good stuff and it didn't have much of the martial arts nonsense I hate so much. I give it a 9 out of 10. I liked the story and to me, Chuck was funny. He's a far better actor than Seagal, but then, who isn't? It's kind of a pity Chuck didn't continue along the lines of this movie and went in other directions. None of which, in my opinion, were as entertaining. As a rule, I never watch any movies made by Martial arts people turned \"actors\" but I made an exception for this one and was pleasantly surprised. Not a classic by any means, but worth watching.","user":"dch48","rank":[25,30]}]