[{"title":"He's from Newark Too!!","rating":18,"date":"18 January 2001","review":"I love this movie. Like other reviewers here, I agree it's hard to explain exactly why. But maybe that's the definition of a good film, one that is consistently coherent, that flows together so well one is left with an overall impression rather than remembered bits and pieces.<br><br>Part of the attractiveness of Disorganized Crime is the setting. To watch it is like taking in gulps of fresh air when you laugh. Which is often.<br><br>This is a balanced story. No one is good or bad, just assorted characters connected by cross purpose and disjointed competence. Each man does his job very well, and the hilarious thing is that it makes no difference at all. Some things are just not meant to be. No matter how hard the gang or deputies work together or alone, somebody ends up in a pit with a horse skeleton or losing his pants to save his flashlight.<br><br>Only excellent writing can save broad comedy from slapstick, and the writers certainly have succeeded here. This movie is a pleasure and an antidote for depression. I mean, if these guys can laugh...","user":"annmason1","rank":[16,16]},{"title":"I don't know why this is one of my favorite movies, but it is.","rating":10,"date":"25 October 1998","review":"The plot is tight. The acting is flawless. The directing, script, scenery, casting are all well done. I watch this movie frequently, though I don't know what it is about the whole thing that grabs me. See it and drop me a line if you can figure out why I like it so much.","user":"Nomad-7","rank":[17,19]},{"title":"A Comic Caper","rating":9,"date":"9 November 2007","review":"Corbin Bernsen's sent letters to four criminal associates he's worked with in the past and it's a real intergenerational mix with Fred Gwynne, Lou Diamond Phillips, William Russ, and Ruben Blades. They're to meet him in this obscure Montana town and he doesn't explain why because he's then picked up by out of state police from New Jersey on a warrant. <br><br>Of the criminal group that's been gathered together, they all know Bernsen, but don't know each other. A lot of comedy involved is them feeling each other out. As the oldest Gwynne though denying it kind of takes charge with the others grumbling, but going along. Especially when they figure out what Bernsen had in mind.<br><br>As for Bernsen, he's got the good fortune to be picked up by a pair of bumblers in Ed O'Neill and Daniel Roebuck. He gets the drop on O'Neill and escapes.<br><br>After that it's the four criminals trying to finish what Bernsen started and Bernsen getting away the police. In the intricately plotted screenplay, it's fascinating how both story lines keep intertwining with each other. Hoyt Axton as the local sheriff watches in amazement at what unfolds in his town.<br><br>Disorganized Crime is a fabulously funny caper film by a bunch of players who seem mostly to have had a background in television or would soon. I can't say that anyone stood out in the cast they also seem to click so well together. <br><br>Ironically none of these people are comedians per se, but they all exhibit a light comic touch that good directing brought out. <br><br>Disorganized Crime is one very funny caper movie, the kind of film that well known pessimist Mr. Murphy would have written.","user":"bkoganbing","rank":[12,14]}]