[{"title":"Laurel and Hardy","rating":17,"date":"17 January 2000","review":"OUR RELATIONS is probably the most classiest production Laurel and Hardy were involved with because of the great cinematographer-director Rudolph Mate (who worked on Dreyer's THE PASSION OF JOAN OF ARC (1928)). Mate was a talented cinematographer who knew how to use lighting to enhance the scenes of Laurel and Hardy's comedy. Harry Lachman, a talented director, kept the complicated story line under control very well. The whole story is a kind of updating of William Shakespeare's COMEDY OF ERRORS. The story was actually based on THE MONEY BOX by W.W. Jacobs, author of the Grand Guignol classic THE MONKEY'S-PAW. The supporting cast is great, especially Daphne Pollard, Betty Healy, Sidney Toler, and Alan Hale. The whole film maintains laughs. Unfortunately, it rarely shows up anywhere today, although I do have a copy on video. It is probably the least-seen of Laurel and Hardy's major features.","user":"CHARLIE-89","rank":[14,15]},{"title":"A charming, instantly likeable comedy (spoilers)","rating":6,"date":"29 December 2000","review":"This is the first feature-length Laurel and Hardy movie I'd seen.  Before this I'd only caught bits and pieces of the shorts if they happened to be on TV while I was waiting for something else.  It made me decide to watch as many of their movies as I can.<br><br>Our Relations is an inventive comedy, and made me realise how lazy slapstick has become - someone simply falling over is now thought of as enough to raise a smile from the audience.  Here, every scene and every prop has its potential realised completely.  What surprised me was how violent some of it was (setting someone's chest hair on fire, putting a light bulb in someone's mouth and punching their jaw so it explodes) but it is done more in the spirit of Tom and Jerry than Itchy and Scratchy, and throws in some cartoon sound effects just to make sure.<br><br>It's no revelation pointing out that Laurel and Hardy have real charm and great timing, but I want to point it out anyway.  I found it impossible to take my eyes off them regardless of who else was on screen, and they work so well as a double act and are so great individually that I couldn't decide on a favourite.<br><br>I'm glad I finally watched one of their movies, and I feel now like I felt when I watched my first Hitchcock; that there's all those movies waiting for me, and all I have to do is work my way through them.","user":"Jim Griffin","rank":[9,9]},{"title":"Very well written comedy.","rating":9,"date":"15 April 2006","review":"This has got to be one of the better 'long' Laurel &amp; Hardy pictures. Reason why this movie is better than most of the other Laurel &amp; Hardy comedies is that this movie has a very well written story, that at times gets a bit confusing but remains solid, enjoyable and funny all at the same time throughout its entire running time.<br><br>It isn't really a comedy with many slapstick moments or other silly events. It's more a movie that relies on its story, that might not be 'hilarious' but it remains consistently funny all the time. It makes \"Our Relations\" one of the more consistent Laurel &amp; Hardy movies to watch and because of that it also becomes one of the most enjoyable ones.<br><br>Yes, it really is the slick tight story that is filled with some good comical moments that made this movie such a good and pleasant one to watch. Especially toward the ending the movie becomes really good, although also a bit confusing at the same time. It's very hard to tell who is Stan Laurel &amp; Oliver Hardy and who is Alf Laurel and Bert Hardy (the twin brothers of the two boys, who are of course being played by Oliver Hardy and Stan Laurel as well.) and who is being chased by who and why. It makes the movie a bit too hard to follow in the end but the good comical moments and situations compensate this more than enough.<br><br>Stan Laurel and Oliver Hardy really show their acting skills in this movie. They have more lines and interacting with other characters than usual. It's good to see that James Finlayson also shows up again in a fairly big role. Other fine roles are being portrayed by; Sidney Toler, Arthur Housman and Alan Hale.<br><br>OK so the movie might not be 'hilarious' by Laurel &amp; Hardy standards but the story is extremely well written and has some well timed and executed comical moments in it, which will surely make you laugh.<br><br>9/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[18,20]}]