[{"title":"Brat Pack Go West","rating":7,"date":"2 June 2006","review":"Kiefer Sutherland, Charlie Sheen, Emilo Estevez and Lou Diamond Phillips star in this light weight western, re-telling of the Billy The Kid story. This movie plays fast and loose with history and is in not particularly accurate about most details but as an enjoyable western adventure it succeeds. The movies style harks back to the old days of the western adventure such as Rio Bravo etc and while nowhere near it in terms of class it is a worthwhile watch. Jack Palance makes a fantastic bad guy and Terranc Stamp puts in a good performance as the gangs father figure. Performances of the brat pack are pretty good and I really enjoyed Estevez's portrayal of the kid. If you like westerns and enjoyed modern versions such as Tombstone you'll enjoy this movie.<br><br>7/10 - Not exactly Unforgiven or Rio Bravo but still a worthwhile watch for any western fan.","user":"no-skyline","rank":[29,36]},{"title":"Siemaszko, Estevez and Phillips make this show.","rating":22,"date":"22 June 2001","review":"With a cast of six great actors (especially the three mentioned up above) you know you can't go wrong. Estevez was powerful and a dead ringer for Billy the Kid. He was fast, furious and he takes you on a wild ride from the moment he hits the screen (very beginning). His character didn't really sit still for a second and his sharp wit and devilish humor are masked well underneath his thirst for revenge and blood. I also believe that he had a need for power and this was entwined well with the other facets of the character. Phillps was truly incredible as the spiritual leader of the team, who had a serious bone to pick. I really saw true talent being performed in the scenes where he painted his face black and guides the others in a spiritual journey.  He also especially eminates this talent at the end where he talks about the attack on his family. However, I think the finest performance of the pack goes to Casey Siemaszko's Charlie Bowdre. Almost an innocent, laid back character in the beginning, you see each of his layers peal away until you see an amazing sequence of emotions. Ranging from a good humored farm hand, to a lonely vigilante, to a newly wed to a soldier of justice and then finally in the end giving everything he has to obtain some justice. Amazing. It's a shame he's not more recognized in the eyes of Hollywood today. 8.5 out of 10.","user":"Thornfield2","rank":[23,29]},{"title":"Lots of great stars = entertaining movie","rating":7,"date":"11 July 2002","review":"With a brilliant collection of characters, this movie proved to be one of the more entertaining modern day westerns. Charlie Sheen, Keifer Sutherland, Emilio Estevez, Lou Diamond Phillips and the other guys all shined in this movie, making it memorable in a landscape of a lost art form. Sure, some movies have tried to equal this film's motif (American Outlaws, Texas Rangers, Ride With the Devil, etc.) but all have failed in the process. Coupled with some good shoot-out scenes, this proved to be a rather entertaining movie.","user":"Agent10","rank":[32,43]}]