[{"title":"Chevy Chase = Fletch","rating":9,"date":"13 June 2005","review":"What a sad world it is when people can sit back and gripe about \"Fletch Lives\". Tsk, tsk, tsk! First of all, how can anyone pick up a video with this sort of picture of Chevy Chase on the front and expect it to not be stupid--in the best possible sense! Indeed, I admit, the movie is stupid, but that is wholly what I love about it. Sure, if you want a more realistic mystery story, watch the first one. But for purely enjoying Chevy Chase's ridiculous antics, this one surpasses it. Though I can't imagine any other actor who could have pulled this script off and made it anything worthwhile! I generally end up watching this movie at least every few months and have yet to grow tired of it. And yet I have only recently added the first movie to my private collection.<br><br>Chevy Chase is one of the best out-and-out comedy actors available in my opinion. And you can't expect him to be serious in a movie that was intended to be anything but.<br><br>I think the best part about Chevy Chase as Fletch, is that he lives out those crazy ideas we sometimes get (such as convincing someone of invisible squealing bugs, simply telling someone their house is on fire, and marching into a corporation like you own the place), and he gets away with it when most of us don't dare in the first place. Perhaps the people who can't enjoy him simply don't get the same temptations, and therefore can't see why he appeals to those of us who have to repress the desire to introduce yourself as a famous sixteenth-century astrologer.","user":"StarDragyn","rank":[38,48]},{"title":"One of Chevy Chase best !","rating":7,"date":"13 September 2001","review":"When Gregory McDonald created the character I. M. Fletcher \"Fletch\", he must have had Chevy Chase in mind.  Both \"Fletch Lives\" and \"Fletch\" are perfect vehicles for Chevy's brand of dry humor.  Snappy dialogue and amusing disguises by Chase make these two Fletch movies, his best film work.  If you like Chevy Chase you'll love \"Fletch Lives and \"Fletch\".","user":"Ron-181","rank":[16,20]},{"title":"Ed Harley, Harley Davidson Motorcycle","rating":8,"date":"26 July 2007","review":"Another classic Chevy Chase film. This film is only just better than the previous movie. There are plenty of wise-cracks and smart remarks to keep you laughing. A must see for Chevy Chase fans and comedy fans in general. This film is very similar to the original. Irwin Fletcher has inherited a mansion from his Aunt who has passed away. Soon enough Fletch finds that his land is worth more than he expected, around lets say $250,000. Remember this is back in 1989 and that was a hell of a lot of money back then! Soon enough Fletch discovers that whoever wants his land, will not hesitate to rid him as well. I don't want to give away too much information, it will be better for you to discover it for yourself. Pros - Entertaining Story, many hilarious jokes, Chevy Chase. Cons - Last Fletch film starring Chevy Chase, not quite a satisfying ending for the two films Overall a must see and a guaranteed laugh. Heres a tip, invite a few mates over your place, order some pizza and you are set for a night of entertainment. Movies don't get much better than this.","user":"amck89","rank":[18,23]}]