[{"title":"The games people play","rating":9,"date":"30 December 2003","review":"Polanski's first feature, on paper, sounds like nothing more than a run-of-the-mill claustrophobic thriller set on a boat - a couple takes a loner on board, you figure out the rest. 'Dead Calm', 'The Deep', etc etc etc.<br><br>Instead, 'Knife In The Water' is an agonisingly tense look at male posturing &amp; ego, the husband &amp; hitch-hiker constantly challenging each other in every possible way - sailing prowess, games of fiddlesticks, knife throwing &amp; just generally strutting about. There's almost never a single moment where the two aren't trying to trump each other, &amp; one gets the impression that it's not even to impress the girl, so much as themselves. As the film progresses, the tension mounts &amp; tempers fray.<br><br>In a Hollywood film, this would build up to a dramatic climax of violence &amp; catharsis, accompanied with thunder &amp; lightning. Polanski doesn't let us off the hook that easily - things get rough, but the games continue, right until the very end of the film.<br><br>Shot in black &amp; white, with a cast of three, &amp; virtually one small location, 'Knife In The Water' puts bigger films to shame. No stars, no pyrotechnics, no special effects, probably very little budget, &amp; it's completely riveting from start to finish.<br><br>It was nominated for the Best Foreign Film at the Oscars - the first feature of a young Polish film student - &amp; rightly so.<br><br>A brilliant start to a brilliant career.","user":"Michael_Cronin","rank":[83,90]},{"title":"Polanski's film has artistic integrity...","rating":8,"date":"30 April 2005","review":"In Polanski's feature debut, \"Knife in the Water,\" strange power games were again to the fore, with ridiculous macho rivalries arising when a young looking man hitches a lift with a sportswriter and his attractive wife Though the plot itself is slim, the film is distinguished by Polanski's precise visuals, which point the shifts in allegiance between the three characters through subtle groupings; impressively, although almost the whole film is situated on a small yacht, the effect is always cinematic rather than theatrical <br><br>Polanski's film is implicit, ingenious, mesmerizing, and has artistic integrity It is filled with a very different sort of suspense There is no violence The suspense is hinted at, suggested, refined tautly, glimpsed, did-he-mean-what-I-think-he-meant? <br><br>The rich man's confidence was in his possessions, among which was numbered his attractive wife, lying in bikini, teasing by arousing expectations between them on the deck The student's confidence, casual, almost unaware, was in his very being... The husband resented the youth, the strength, the \"cool,\" the easy virility of the student and worked out a compulsion to keep challenging them, to try to show his superiority <br><br>Polanski was fair  each had his own strengths and skills; but the one obsessively resented the others","user":"Nazi_Fighter_David","rank":[80,89]},{"title":"Lubricated Blade","rating":20,"date":"20 January 2005","review":"There is nothing more thrilling than discovering a natural filmmaker for the first time. There are only so many, and you can only have menarche once. Its an introduction into another life.<br><br>I first saw this in 1965 at the Orson Welles Cinema near Harvard Square. We were told it was made behind the backs of Iron Curtain thugs, only surviving because of international attention. (I wouldn't meet Tarkovsky or Kieslowski until later.) And that it was made by the fellow who had made the striking \"Repulsion,\" which at that time was anticipated but yet unseen in the States.<br><br>I've since learned some striking things: that both Polanski and his co-writer wanted to play the hitchhiker and indeed it is Polanski's voice. And that the mistress who seems only half alive was in fact played by a non-actress they found by looking at swimming pools. Also that the situation was suggested by a long planned and discussed Orson Welles project (\"The Deep\") that was started after this and never completed. <br><br>The writing is good of course, especially the central image the title denotes, but the camera finds the perfect place always. It is like Altman's camera (after this) that discovers the action rather than, say Spielberg's where the action is obviously happening in such a way to be cleanly seen by the camera. And so much harder on a boat!<br><br>But the interesting thing about such an introduction to a filmmaker is the relationship that follows: we know certain things about how he thinks and sees. We expect the conversation to continue and mature over the years. And what a rocky ride this man has taken us on, through perfectly created worlds (in which I include \"Ninth Gate\") but also through pure dreck and rank sentimentality (both of which tag \"The Pianist\").<br><br>Sometimes he's internal to the narrative, even the charmed actor. Sometimes he is outside the narrative, pulling strings (as with this film) but sometimes it is clear he never got out of bed.<br><br>As with Kubrick and so many others, you really must start at the beginning, which essentially means here.<br><br>Ted's Evaluation -- 3 of 3: Worth watching.","user":"tedg","rank":[62,74]}]