[{"title":"One of the most neglected","rating":9,"date":"6 December 1999","review":"I just noticed that \"Melvin and Howard\" registered a mere 6.6 on the IMDb rating scale.  Don't you believe it!  This is a great American movie. Director Demme and writer Goldman take a footnote to history -- a contested Howard Hughes will that named Melvin Dummar, a milkman who once loaned him a quarter, as one of his heirs -- and turn that slight material into a wry meditation on the American Dream.  Or more specifically, the thin line that separates the American Dream from pure hell.  Demme has a great eye for people like Dummar, a dreamer whose clock for realizing his dreams is winding down.  The performances are terrific, especially Paul Le Mat as Dummar (whatever happened to Le Mat?) and Mary Steenburgen who won an Oscar for playing his wife.  Jason Robards does one of his patented cameos playing a real life character (his Howard Hughes makes a neat hat trick with his Oscar winning performances as Dashiell Hammett and Ben Bradley.)  Watch for the real-life Melvin Dummar as the counterman in the bus station where Steenburgen makes a sandwich for her daughter.  This is a small but knowing and winning movie. It definitely gets my vote for \"Milkman of the Month\"!","user":"Joel I","rank":[28,33]},{"title":"Quirky Film Deserves A Look","rating":8,"date":"18 April 2006","review":"Here's a strange tale of a couple and their on-and-off again marriage and the stupid things they do.....and the eventual flak over money billionaire Howard Hughes supposedly left the man.<br><br>Paul LaMat plays the husband and supposed beneficiary. He's just fun to watch, a likable, never-loses-his-cool kind of guy. Mary Steenburgen plays his wife and kind of surprised me by how much skin she showed, not the usual scenario with her. Both of them are somewhat low-lifes. Heck, even Hughes (Jason Robards) is pictured to look kind of scummy character in here. Then again, his last years on this earth were a bit strange!<br><br>It's a fictional story but those of us who remember, there WAS a lot of flak over the will of Howard Hughes. Despite this being on the grungy side (typical for movies between 1970-1981) this is still an appealing film in a sweet kind of way. <br><br>One thing for sure: it's different. Well worth a look.","user":"ccthemovieman-1","rank":[27,34]},{"title":"No Special Effects, No Mega-Buck Stars, Just a Great Film","rating":10,"date":"4 June 2004","review":"In this day of $100 million plus movies with special effects that drown out the dialog and stars with out-sized egos and paychecks to match, a film like Jonathan Demme's minor masterwork, \"Melvin and Howard,\" would be lucky to get a video distributor.  Even a quarter century ago on its initial release, the film was largely ignored by audiences despite glowing reviews, Academy Awards, and critics kudos.  However, those who make the effort to seek out this wonderful fable will be rewarded.  Based on a story that may or may not have been true, \"Melvin and Howard\" spins the tale of an easy going hard luck kinda guy named Melvin Dummar who gives a lift to an old man he finds asleep in the desert.  The man says that he is Howard Hughes, and, years later, when Hughes dies, Melvin finds a will that has been left on his filling station desk that names him as one of the heirs to the Hughes fortune.  Since we know the ending before the film starts, the pleasures lie in the quirky characters and situations that screenwriter Bo Goldman and a terrific cast have created.  Despite the circus that surrounded the question of the will's validity, Melvin was content just knowing that, during their drive, Howard Hughes had sung a song that Melvin had written.  His evident joy in that simple event was a rare personal quality even in 1980.  There are a lot of other unpretentious, yet memorable, moments in this outstanding film.","user":"dglink","rank":[21,28]}]