[{"title":"Different","rating":8,"date":"3 August 2001","review":"Usually, romantic comedies are all the same, concerning their tone and their dialogue. Green Card` by the great director Peter Weir (Truman Show`, Witness`!), is a little different, which alone makes it sympathetic.<br><br>The film evokes interest right at the beginning because if people don't know exactly what it is all about, they might not get immediately what's happening. Brontë is already married to Georges the French composer. Other directors or screenwriters would have shown their wedding in detail, peppered with gags. But Weir sees that this is not necessary, it would only follow the convention.<br><br>Later we have unexpected plot twists and changes in the characters that are not always convincing but give the film an interesting, not too light base tone. And actually, Peter Weir is a too enthusiastic director to make a visually rather undemanding romance film. So he introduces some wonderful visual ideas like the scene where Georges is standing in front of Brontë's door, covered with a blanket, calling her name, while the camera shoots him from inside, through the watcher`. I'm not particularly fond of Andie MacDowell because she always seems even more nervous than my English teacher, always presenting herself with a pained smile. In Green Card` of course, the fact that she is not at all likeable (to me at least) fits perfectly, and one little wonder of the movie is that Gérard Depardieu can convincingly play that he is falling in love with her.<br><br>A comedy surprise.","user":"Mort-31","rank":[28,32]},{"title":"Offbeat and uplifting","rating":13,"date":"13 June 2003","review":"For those looking for an offbeat, uplifting romantic comedy, this one fits the bill.  Andie McDowell plays Bronte; she is a young city gardener who has her eye on a beautiful apartment with a greenhouse. The problem is she must be married in order to apply for it.  Enter Gerard Depardieu.  He plays an immigrant Frenchman looking to marry an American so he will have permanent residency status in the United States. A mutual friend arranges a paper marriage between the two.  Bronte gets her apartment; Depardieu has what he wants, also.  Unfortunately, the INS suspects it is a bogus marriage and the two have to \"temporarily\" move in together in order to prove their marriage is real.  From the start, Bronte and her immigrant husband dislike each other. Yet, strange things can happen.  This is a sweet story with plenty of laughs sprinkled throughout.  McDowell looks stunning and Depardieu, despite carrying a lot of extra weight, charms and delights. Nice little touches, such as the scenes where the couple take fake photographs of their honeymoon, are prevalent.  Take a chance on Green Card; it's guaranteed to give the viewer permanent smiling status.","user":"inkblot11","rank":[19,21]},{"title":"Green Light for Viewing (DVD)","rating":10,"date":"20 December 2005","review":"A movie isn't never as much great as it can speak personally. This movie does it for me and I'm lucky. This review is thus very subjective but it comes from the heart....<br><br>First, it is a rare movie in which I feel my favorite town, New York as my neighborhood. The town really appears as an endless collection of big cubic buildings, but under the soft menace of the green invasion (trees, garden,...). All the roof scenes are memorable...<br><br>Then, McDowell plays an almost introvert woman in contrast to the French extraversion of Depardieu. Sure, being French, I support our national icon, who is particularly in his turf here, but I was more over captivated by the development of the Bronte character and her feelings. From her initial motivation, then indifference to exasperation and finally complicity &amp; deep devotion, it was a remarkable evolution to behold and understand.<br><br>Finally, there's also a lot of subtext &amp; subtlety here and it's great for the brain: I mean some things talks to our unconscious and the connection isn't immediate. For example, think how Africa is the main background: the emigration subject, the Afrika bar, the drums, the safari life ... There's also the sweet translation from Green Card to Green House, and the role of ecology... Like I already said, the green tries to grow in every free space left from the rock buildings, which is a poetic metaphor for the emigration...<br><br>So, a great romantic story in a wonderful setting &amp; which leaves many doors to open...","user":"leplatypus","rank":[42,53]}]