[{"title":"Confessional time.","rating":6,"date":"18 May 2008","review":"As slow-burns go, Fred Walton's mysterious catholic-bounded thriller takes the cake with its minimal and sombre treatment. It's one of those progressive and morally hounded plots (from William X. Kienzle's novel), which is a puzzle to decipher, as you find yourself also personally getting involved with the brooding investigation with realistic characters. Some of the scheming is a bit hard to swallow, but for most part it's smartly penned (by Elmore Leonard and Fred Walton) and the low-key approach seems to make you concentrate on the lyrical waxing (especially on those commitments to the priesthood and the self-doubting). However the pacing seemed to plod a bit too much, where some monotonous patches seemed to lose focus. Two stalwart figure heads; an impressive Donald Sutherland and equally so Charles Durning are engagingly strong. Sutherland has a sincere presence about him, that even if he looks half-asleep. He's still watchable. Josef Sommer and Belinda Bauer offer able support. Walton's direction is slickly presented, but feels shapeless and dry. At least he did construct a subtle, startlingly dreary atmosphere and the music score etches out a placidly haunting vibe. The violence happened mostly off-screen, but managed to leave a chilling mark and the Detroit setting complements the weary imprint. A sleepy and glum, but well-acted and rather moving thriller.","user":"lost-in-limbo","rank":[10,11]},{"title":"This film rises above its major flaw.","rating":7,"date":"28 June 1999","review":"The author has relied heavily upon the literary device of COINCIDENCE in constructing his plot; i.e., he expects you to believe that several people living in the same part of the country would have certain proper names. I'd love to explain that in detail, but doing so would ruin part of the ending. Rent this movie and see if you agree.   But this flaw will not diminish your enjoyment of the film, as there is enough action to keep the murder mystery fan happy.  I was never bored during any of the times I watched this film. I recommend this any day of the week.","user":"Tim-177","rank":[18,25]},{"title":"Catholic mystery is a whole new genre","rating":6,"date":"15 September 2017","review":"Is this a giallo? A neo-noir? A detective story? Let's not play with labels. Let's just see it for what it is — a whodunit where priests and nuns are the victims of a serial killer who leaves a black rosary on their dead bodies.<br><br>Directed by Fred Walton (When a Stranger Calls) and adapted by Elmore Leonard, this is a dark, rough take on William X. Kienzie's novel (Kienzie left the Catholc priesthood in 1974 after 20 years due to the Church's refusal to remarry divorced people). This may have been the only movie concerning the detective skills of Father Robert Koesler (Donald Sutherland), but the character appeared in twenty three more novels from Kienzie.<br><br>The character is a progressive priest — even falling for a reporter, Pat Lennon (Belinda Bauer, RoboCop 2, Flashdance). He serves with Father Ted Nabors (Charles Durning, Tootsie), who is the exact opposite — a racist throwback to pre-Vatican 2 who follows the Church to the letter of the law.<br><br>The central dilemma of the film? The killer confesses to Koesler, who can't do anything about it, thanks to the Church's Seal of Confession. But what if other lives — maybe even his own — are in danger?<br><br>The film was shot on location at Detroit's Holy Redeemer Parish, and if you look hard enough, you'll see an uncredited Jack White — years before The White Stripes — as an altar boy. That feels like it should be an urban legend, but it is true.<br><br>The film has what some describe as a leaden pace. There are some great moments in it, such as when Koesler hears the killer in a cemetery and the ending, where the real killer is revealed. I'm always debating with myself whether or not to spoil the ending. It's a thirty year old movie, but I feel weird doing so here. Must be the Catholic in me.<br><br>Read more at bandsaboutmovies.com/2017/08/16/the-rosary-murders-1987/","user":"BandSAboutMovies","rank":[3,3]}]