[{"title":"Late Classic Western.","rating":8,"date":"27 April 2010","review":"\"NOW I OWE YOU!.......YOU PUT TWO HOLES IN ME\"!<br><br>20 Century Fox's HOMBRE is an excellent and engaging western! Although somewhat unappreciated when it was first released in 1967 it has since gained cult status and is now recognized as a splendid example of the genre. Like the brilliant \"The Stalking Moon\" made the following year HOMBRE initially suffered from the drop in appeal of westerns with the general public that occurred in the sixties. But now with the production of the western all but extinct and western fans yearning for it to make a meaningful return (sans inane revisionist remakes like the awful \"3 Ten To Yuma\") - Hollywood's past efforts at producing them in the forties, fifties and sixties have gained considerable popularity with a younger generation. This has resulted in the works of John Ford, Raoul Walsh, Anthony Mann, Delmer Daves, Budd Boetticher and Henry Hathaway becoming just about as popular today as they were all those years ago. <br><br>From a fine novel by Elmore Leonard HOMBRE was brilliantly written for the screen by Irving Ravitch and Harriet Frank. Produced by Ravitch and Martin Ritt it was beautifully photographed in Panavision and Deluxe colour in the mountains of Arizona by veteran genius cinematographer James Wong Howe (\"King's Row\"/\"Body &amp; Soul\") and was masterfully directed by the underrated Martin Ritt.<br><br>Paul Newman is John Russell - a white man raised by the Apaches. He is a discriminated passenger on a Stagecoach occupied by an array of quirkish characters. Jesse (Diane Cilento) is on her way to Bisby to start a new life after her marriage proposal is turned down by (about to go bad) Sheriff Frank Braden (Cameron Mitchell) (\"I don't want a wife Jesse...I want out!\"). There's Dr. Favor (the always wonderful Fredric March) as the Indian Agent who has just embezzled the Indian funds from the reservation accompanied by his beautiful and pert wife (the lovely Barbara Rush). And Cicero Grimes (Richard Boone) who intends to hold up the Stage and with his waiting gang make off with the Indian funds. But after a series of events in which Russell kills some of the gang and retrieves the money it falls to him to lead the hapless passengers all the way back to town on foot. They take refuge in an abandoned mine-works fending off Grimes and his men until finally Russell confronts Grimes face to face and his Mexican gunman (Frank Silvero). \"that Vaquero is more than a fair hand with a gun\" Grimes warns Russell followed by what is a climactic but ultimately tragic fast draw shootout.<br><br>Performances are quite exceptional from the entire cast! Newman is terrific in what is one of his best ever roles. It is certainly the best western part he played. Terrific too is veteran Fredric March in what would be his third and final film. The rarely seen Diane Cilento (Mrs. Sean Connery at one time) is superb in the female lead and never better is Martin Balsam as the Stage driver. But the acting honours has to go to Richard Boone as the baddie with the cracker of a name Cicero Grimes. His role not terribly unlike that which he played ten years previously in the Randolph Scott classic \"The Tall T\". And lest we forget the effective brooding score contributed by composer David Rose which lends a melancholy and reflective quality to this memorable and outstanding western.<br><br>Classic line from HOMBRE....... When Grimes sees he has been duped by Russell with empty saddle bags he snarls quietly.......\"Well now....and what do you suppose hell is going to look like?\".","user":"jpdoherty","rank":[39,40]},{"title":"Elmore Leonard's wonderful anti-hero story","rating":10,"date":"5 April 2006","review":"Martin Ritt made a lot of good movies. This is one of his best. It deserves to be remembered and to live forever. Elmore Leonard wrote this wonderful western of a man who is no hero in the classical western-style. He is of white origin, brought up by Indians. He wants to live in peace with his fellow man, and faced with violence he withdraws, but when it comes to injustice or survival he turns out to be some sort of hero just the same. Paul Newman's leading role as Hombre is a performance as convincing as ever. And all other leading characters are played by wonderful actors too. Richard Boone's bullying criminal is almost to be smelled through the screen. Even in the smaller roles there are some real gems. See this movie again and again - and again!","user":"Erik_Svinding_Olsen","rank":[18,19]},{"title":"A wonderful slice of strength, needed, but not appreciated or loved.","rating":8,"date":"27 November 2006","review":"This film made Paul Newman my favorite male actor for decades. It affected the way I have seen every one of his roles, even his salad dressing. The story line brings John Russell's (Newman) personal strength of character and survival into sharp contrast with many of the other characters' own sense of strength, and therefore the viewers' as well. There are villains all around and innocent (and not so innocent) victims for the taking. Personal values of all kinds (racial, greed, criminal) are set up for display and comparison against Russell's simple personal strength and integrity like a painting competition at a state fair. <br><br>My most remembered quote from this film is Russell's response to Dr. Favor(the embezzler)when Favor attempts to educate Russell that white (implying civilized) people stick together and help each other out and Russell responds, \"They better\".","user":"bjbrownell","rank":[13,14]}]