[{"title":"Wow. The most fun I've had with a movie, probably ever ...","rating":10,"date":"25 October 2006","review":"I attended a screen writing class once, and the teacher said that the worst movie ever made was \"Willow\" ... he also defended \"White Chicks\" (in the same class) as being some sort of underrated theatrical gem.<br><br>What an idiot. Obviously, this man has no soul.<br><br>Anyway, it must have been this sort of \"I'm too good for that\" attitude that killed \"Willow\" in the theaters. I remember seeing previews for it when I was a kid, and there was nothing more in the world that I had wanted to watch. I was raised on \"The Neverending Story,\" \"Legend,\" \"Krull,\" \"The Beastmaster,\" and \"The Dark Crystal.\" So, sure, I loved fantasy. It was my favorite genre. And even though many will say that \"Lord of the Rings\" is better, I have to disagree. \"The Lord of the Rings\" is a good melding of drama, real-life struggle and fantasy, but's it not fun to watch. \"Willow,\" on the other hand, is a blast to watch.<br><br>The music from Horner's great ... I can still whistle the adventure theme song, and often do sometimes. Val Kilmer as Madmartigan was a great rogue hero, who had plenty of great lines, laughs. Sorcia was by Joanne Whalley, was hot as hell ... a fiery redhead who just refused to be ordered or commanded. General Kael (who was supposedly based on one of Lucas' critics) is awesome. His look spawned an entire decade of me thinking that people with skull masks were horribly cool. The woman who played Fin Razel (sp?) was great. The Brownies were hysterical. And last but not least, give it up for Billy Barty and Warwick Davis, little people with big roles. I think little people probably thank Mr. Lucas and Ron Howard for making them stars for once, for giving them a showcase piece. Davis really had no better role in his life than this one. And he shined in it.<br><br>Well, if that particular teacher is reading this by any chance, I hope you go back and re-watch this as a kid. For me, and obviously many others on this website, the movie was more than a fun, little escape ... it was almost a genre-leading film. If there's one thing that pre-prequel George Lucas was good at, it was at giving the audience a good time ... Indiana Jones, Willow, Star Wars ... the best adventure/fantasy films ever to come out. Each of them with charming heroes, obvious bad guys, magic, swords, and humor.<br><br>\"Pirates of the Carribbean\" resurrected this sort of cinema, I think, and the American public responded to it with verve. I still remember hard-nosed critic Lisa Schwarzbaum giving \"Pirates\" a D rating in Entertainment Weekly. I bet she about choked on her own vomit when she saw how much fun everyone had with the film.<br><br>And \"Willow\" is the same thing. It's pure magic. Pure escape. Especially good for children, but good for the adults, too. If you can't have fun with this one, than you better go get your laughs from movies like \"White Chicks\" ... just don't be surprised when the kids come out making jokes about d*cks and p*ssies afterward.","user":"shizaquawn","rank":[171,200]},{"title":"A Stunning 80s Epic","rating":8,"date":"26 June 2000","review":"I remember seeing this film in theaters back in '88 and long to see it again on the big screen. There is a motherload of crappy fantasy flicks out there and this one is better than most. I was kinda young when I saw it and didn't find it too violent but some parents may think it gruesome at times. I myself feel that gave it an edge. Along with swordplay there are nasty trolls,a 2-headed beast,mean-spirited characters and some intense scenes at the end. Of course there are lots of special effects. This was a technically well made film with awesome cinematography and interesting locations. Every now and again Fox airs the movie but it's 2 1/2 hr running  can be really cut. Ya gotta see it!","user":"joshjgs300","rank":[77,96]},{"title":"A Morphing Delight","rating":10,"date":"24 July 2004","review":"I'm typing this being dictated to by my 11 year old son, in whose opinion this is the best movie he has ever seen. He's outgrown the Disney variety and various animations but he's still not ready for hardcore action movies so what is there for him to enjoy - well as a mom, I can tell you, very little. That's where the fantasy movies are so great. They have mystery, action, a little romance but the greatest value comes from the good moral story of good wins over evil, truth over deceit and small truimphs over powerful.<br><br>The most amazing fact is that at the time of first seeing this movie, it is 16 years old - Thank you George Lucas, thank you Ron Howard and thank you for a wonderful cast who have brought this eternal story to eternal life and I'm not joking either. I think we are on viewing #25 already and still going strong.<br><br>Movies are about people sharing a story but magic certainly helps get the message across...","user":"sheena-1","rank":[108,145]}]