[{"title":"Where You At, Chere?","rating":8,"date":"13 May 2001","review":"A good cop, who has allowed his principles to be compromised once too often, has it catch up with him amid allegations of internal corruption and what appears to be an impending war between the criminal elements of New Orleans, in 'The Big Easy,' directed by Jim McBride. Dennis Quaid stars as Remy McSwain, an eleven year veteran of the New Orleans Police Department, who from the day he joined the force learned that the 'perks' that went along with the job were all just a natural, acceptable part of the way things are done in the city they call The Big Easy. It's just the way it is; and all is well until Assistant District Attorney, Anne Osborne (Ellen Barkin), shows up one day, and becomes inordinately concerned with a recent 'wise guy' murder Remy is investigating. And it isn't long before things start to get a bit sticky for Remy and a few others who suddenly find themselves caught with their fingers in the cookie jar. But there are indications that something is going down at the precinct that is somewhat more serious than the penny-ante graft apparently being enjoyed by a number of New Orleans' finest, and Osborne's job is to get to the bottom of it. Remy, however, doesn't buy the idea that there are 'dirty' cops amongst his own, and quickly puts some moves on Anne to find out what she thinks she knows. And it starts him off along a path which, before it's over, he may wish he hadn't opted to tread.<br><br>From the opening credits, as McBride takes you aloft and opens up his camera for a thrilling shot of the bayous and countryside rushing by below (backed by the blood stirring zydeco music that drives the entire film), he saturates the story with an atmosphere that brings New Orleans to life. And the vibrant sights and sounds of the city (including the engaging Creole dialects), are so richly textured that the city itself becomes as much an integral part of the story as many of the characters. As Remy would say in greeting, with his best prepossessing grin in place, 'Where you at, chere?'<br><br>And though the story itself is nothing especially original, the lively presentation and the mood McBride sets, as well as some unique characterizations and that special sense of time and place he captures, make it all seem fresh and new. The zydeco music, alone, is a treat and-- like the city-- is something of a character in itself.<br><br>Quaid fairly oozes Southern charm as the irrepressible Remy, a guy secure with his world and sure of his place in it. He's obstinate and self-assured, but without being pretentious, which makes it easy to like him. The natural fluidity of his distinct mannerisms and speech give his performance a ring of authenticity that makes Remy very real and entirely believable-- which, of course, adds credibility to the story. The character is a good fit for Quaid, and he definitely makes the most of it.<br><br>Barkin does a good job, as well, as Anne, employing her trademark crooked smile to great effect, and she has a genuine chemistry with Quaid that works well for the story. She brings a decided definition to her character, making Anne a woman who is strong without being overconfident, and not immune to vulnerability; it's her very humanness, in fact, that make her so accessible. It's a well rounded performance that allows you to see beneath the facade of the professional cop doing her job, to the very real person within. Barkin plays it all very well, and lets you know that there's more to Anne than meets the eye.<br><br>Notable in supporting roles are Grace Zabriskie, as Remy's mother, and Charles Ludlam as Lamar Parmentel. Their performances are great examples of the value of a good character actor, and the significant impact they can have on a film. Far too often they go unnoticed and unappreciated.<br><br>The supporting cast includes Ned Beatty (Jack), John Goodman (Andre), Lisa Jane Persky (McCabe), Ebbe Roe Smith (Ed), Tom O'Brien (Bobby), Marc Lawrence (Vinnie the Cannon) and Solomon Burke (Daddy Mention). Like a good bowl of spicy gumbo, 'The Big Easy' packs a wallop and will give you a good helping of satisfying entertainment, well worth the two bucks or so you plunk down for it. And by the time it's over, you'll be calling people 'chere' and fighting the urge to strap a washboard to your chest. So, hey-- where you at? It's the magic of the movies, chere. I rate this one 8/10.","user":"jhclues","rank":[42,49]},{"title":"Steamy romance and an interesting thriller...","rating":9,"date":"31 August 2002","review":"I've seen various comments from those who say \"The Big Easy\" is one huge stereotype and/or unrealistic.  Well, sure, the stereotypes exist here, but I feel that the directing of Jim McBride and excellent acting and chemistry of Dennis Quaid and Ellen Barkin rose above it.<br><br>As for its being unrealistic...so is almost every movie ever made!<br><br>Dennis Quaid and Ellen Barkin had phenomenal chemistry as Remy McSwain and Anne Osborne.  Their first love scene was, by turns, steamy, tender, and touched with a sense of not taking itself too, too seriously as some love scenes tend to do.  Out of the bedroom, they prove to be just as interesting as in (Remy's \"gray\" concept of right and wrong definitely adds to such interest, as does his \"crisis of conscience\" later on), and that is truly, IMHO, a rare feat for a lot of such films.<br><br>Add in a great supporting cast (Ned Beatty's crooked, yet fatherly Jack Kellom, John Goodman's dirty cop André, Grace Zabriskie as Mrs. McSwain, Lisa Jane Persky as Det. McCabe, and many more) that actually lends more depth to what could have been a cut-and-dried shoot 'em up flick (mixed with some bed scenes for variety), as well as characters/actors who actually play off of each other well, and the film is very entertaining.<br><br>Sure, the whole \"gumbo, let's party, Cajun fest\" thing can be a bit much, but I still found this film a whole bunch better than a lot of films made in the same or similar vein.  It also still seems remarkably fresh today, 15 years later (even if typing police reports via a typewriter now seems a bit passé).<br><br>In other words and in short, I am glad to own this on DVD and have it in my library.","user":"Wendy-17","rank":[29,35]},{"title":"You're a cop for God's sake, you're supposed to uphold the law, but instead you bend it and twist it and sell it.","rating":7,"date":"14 May 2012","review":"The Big Easy is directed by Jim McBride and written by Daniel Petrie Jr. It stars Dennis Quaid, Ellen Barkin, John Goodman and Ned Beatty. Music is scored by Brad Fiedel and cinematography by Affonso Beato.<br><br>Remy McSwain (Quaid) is a slightly corrupt New Orleans cop, who whilst investigating the murder of a mob man, finds himself under scrutiny by assistant district attorney Anne Osborne (Barkin). The waters start to become muddied when the pair begin to have a passionate affair, just as the can opens and worms spill out everywhere.<br><br>It's an odd film at times, a bit too jovial to be considered proper neo-noir, and Quaid's Southern accent takes some getting used too. It's also nearly derailed in quality as conventionality dominates the last quarter of film.Yet judged on its own thriller terms it entertains well enough whilst also having some neat technical touches to help it along. Petrie's script contains spiky dialogue and a number of bravura sequences light up the otherwise standard crooked cop story.<br><br>McBride dose good work on this, he opens his film up with a cracker of a camera tracker, and he makes good use of the New Orleans locations. He also has a good sense of prop choices to help the mood, none more so than with a scene involving Mardi Gras costumes, whilst he gets strength for the film by garnering tense and sexy performances out of Quaid and Barkin. Support actors also leave good marks, with Goodman as a cop colleague dominating the screen and Charles Ludlam almost stealing the film as McSwain's dry and near sleazy lawyer. Soundtrack, too, is well thought out, with the Cajun flavours spicing up the sweaty Orleans stew. 7/10","user":"hitchcockthelegend","rank":[7,7]}]