[{"title":"MW: One one of the reasons I fell in love with film as art","rating":10,"date":"22 May 2000","review":"Although I am a long-time Patty Duke admirer, and thus far from objective, this film still stands the test of time. This is the kind of filmmaking that prompted me to fall in love with the movies. Brilliantly inspired writing by William Gibson, from his equally inspired play. Intelligent, austere direction by Arthur Penn (one of the true gentlemen and masters of the American cinema); Penn had the sense to retain the inate artistry and grit of the original stage play and simply allow the camera to capture the actors' intuitive - albeit, well rehearsed, performances, recreating their stage roles which generated an unheard-of 19 curtain calls when it first graced the stage in its Philadephia opening. The film, in stark, black and white, speaks total reality to the film audience of 1962 - and, of course, well beyond that year. Finally, one would be hard pressed to think of another film that so exquisitely defines the term \"2-character\" study. Bancroft and Duke deliver A-plus, no bones about it, top-drawer, performances.  It is a film about the undaunted human spirit and our need to communicate.  Although much has been written about 11-minute breakfast donneybrook, which is certainly wonderful cinema to behold, the entire film is breathtaking from opening credits to the final scenes. I dare anyone to even breathe during the climactic water pump scene when teacher Annie Sullivan finally \"connects\" and communicates with her \"unreachable\" charge, the deaf, blind, young Helen Keller. It's an absolutely astonishing, \"can't take your eyes off it,\" moment of celluloid. Duke, Bancroft and Penn worked beatifully to create this incredibly touching masterpiece of dramatic filmmaking, which is not without its moments of \"comedy,\" as all fine dramas are capable of conveying. It is a film which breathes life - and it is especially brought to life by two of the best actresses America has ever produced. The Miracle Worker is a story and film portraying real human courage, patience and individual, personal will. It continues to live in my memory as a work of art that has rarely been equalled before - or since - on screen.","user":"gevaultski","rank":[55,57]},{"title":"An Exceptional Movie That Appeals to the Imagination","rating":21,"date":"21 December 2004","review":"With two terrific leading performances, an absorbing and thought-provoking story, and many well-conceived touches by Arthur Penn and his production team, this classic version of \"The Miracle Worker\" is an exceptional movie that appeals to the imagination and that has much to say about humanity. The story itself is so good that even the lesser remakes have been worth seeing, but there is really no reason at all to look any further than this nearly flawless filming of the story.<br><br>As Annie Sullivan and Helen Keller, Anne Bancroft and Patty Duke could not have been better. The battle of wills and wits between the two is engrossing, becoming quite involved and very interesting. The lengthy dining room struggle alone would make any movie worth watching - it is worthwhile even beyond the interesting action itself, as it brings out aspects of human nature and human learning that go beyond even Helen's own trials.<br><br>There is a great deal of substance to the movie that goes beyond the immediate issues and confrontations, and a significant reason for the greatness of the film is the way that Bancroft and Duke tap into the imagination of the viewer. The concept of seeing an unseen world (and the challenge of helping someone to see it) is brought out in ways that are profound yet accessible.<br><br>The two leads carry almost the whole picture, as the other characters are there primarily for Annie and Helen to play off of. Accordingly, the supporting cast keep their characters more simple, and their performances stylized and almost exaggerated, which allows Bancroft and Duke to have most of the moments of significance. The production also enhances the picture through simple but well-conceived settings, use of lighting, and other features that nicely complement the main action.<br><br>It's always rather unfortunate that movies like this one, which take a little effort to appreciate fully, are not given more attention. If you stop to consider what Helen Keller had to face in life, it is a situation far more terrifying than facing any of the cartoonish, artificial movie villains that gain so much notoriety. And if you consider the job that Annie Sullivan had to do, her accomplishment is far more impressive and worthwhile than almost any scientific discovery, feat of athletics, or military exploit.<br><br>That this movie is able to convey such themes makes it a memorable classic that is much more worthwhile than many movies that have received far more acclaim.","user":"Snow Leopard","rank":[90,99]},{"title":"A Story That Needed To Be Told","rating":10,"date":"22 May 2004","review":"An inspiring movie. I watch it now at the age of 48 and I remember why I idolized Anne Bancroft and tried to emulate her acting style when I was a theatre student. I still cry during the final scene at the water pump when she cries out - mother, father - she knows!!!! Thank God that Penn and Gibson made sure that she got this movie part. I still wish she would have gotten the the part of Gittel Mosca for the movie version of their broadway play \"Two For The Seesaw\" because I will never be able to see her performance. Patty Duke was magnificent. She was very convincing and there is never a moment when you don't think she is deaf, dumb and blind. There is no doubt that this pair deserved the Academy Award for their performances. Helen's story needed to be told and this film was a beautiful and poignant tribute to her life","user":"rockstar74","rank":[50,54]}]