[{"title":"\"Oh Boy! Smooth!\"","rating":12,"date":"12 February 2000","review":"Another self-opinionated reviewer bites the dust.  Having blithely pronounced \"Lover Come Back\" to be the best of the three Day-Hudson comedies without even having seen this one, I now willingly eat crow and and say I was wrong.  \"Send Me No Flowers\" is the best.  \"It's a honey!\"<br><br>    This is a wonderful suburban world of lawns and yards, bridge games and country clubs, commuter trains and divorce rumours.  George Kimball (Rock) is a malade imaginaire, and Judy  (Doris)is ... well, blonde.  Tony Randall is at his considerable best as the nerdy neighbour Arnold who gets entangled in the Kimballs' misunderstandings, with delicious comic consequences.  Paul Lynde turns in a marvellous cameo as Mister Akins of the funeral parlour, and the annoyingly perfect Bert Power is played with breezy confidence by Clint Walker, TV's Cheyenne (the incidental music gives him a witty little cowboy theme).<br><br>    \"My hypochondria has finally paid off,\" announces George after hearing (and misconstruing) his doctor's talk of impending mortality.  Arnold prepares a eulogy which mentions George's 'unfailing good humour', a phrase which could stand as the movie's subtitle.  Hudson is masterly as the doom-laden George, showing how assured he can be when the material is strong.  This well-crafted script is derived from a Broadway play, and its quality shines through.  Doris wears a very prominent wig and, in true Doris style, keeps her bra on under her negligee.<br><br>    Made in 1962 when television had clearly won the battle against the cinema, the film uses TV's ascendancy in a very knowing way in the opening gag.<br><br>    Verdict - Near-faultless domestic comedy with great work by Hudson, Day, Randall and Lynde.","user":"stryker-5","rank":[38,40]},{"title":"Immortal classic","rating":15,"date":"15 July 2000","review":"The main character is dying, but not the movie! It shall live forever. This is one of five golden, grown-up comedy classics Doris Day starred in, the others being \"Teacher's Pet\", \"Pillow Talk\", \"That Touch of Mink\" and \"Lover Come Back\". Of course, Hollywood never gives an Oscar for comedy. Drama is deemed deep! Nothing is deeper than comedy. Actually, drama is often unintentional comedy.<br><br>The critics disliked the movie because the subject is grim: terminal illness, or fear thereof. But if you take that attitude, nothing at all is funny. Actually, death is just the theme around which a lot of variations about modern life are spun. This film is masterful in every respect, a real treat. Paul Lynde is priceless as the effeminate undertaker. Doris Day is a miracle. Even the theme song is a thrill. Oh, why did we stop making these clean, domestic movies dealing with practical issues and everyday life?","user":"ivan-22","rank":[34,36]},{"title":"Domestic comedy 101","rating":10,"date":"9 July 2001","review":"Very good screenwriting here and a very good example of early sixties suburban lifestyle.Very funny and this movie is one of the best comedies of all time.The cinematography was splendid as well.Comedy fans please watch this one!","user":"kenandraf","rank":[22,24]}]