[{"title":"Atmospheric Wuxia Film from Yuen Chor","rating":7,"date":"23 March 2007","review":"Yuen Chor was having a good run of films during the second half of the 1970's. Sentimental Swordsman, Magic Blade, Clans of Intrigue, Jade TIger were all made during this five year period. \"Death Duel\" is just one more during this time. As with his other films you can expect good photography, unique art direction and dozens of characters.<br><br>As with other successful Yuen Chor films, this one succeeds by focusing on one enigmatic main character for most of the film. However, the viewer will still have to deal with a lot of fascinating characters who show up and usually are killed off quickly. The body count in this film is very high. This film is very moody and the withdrawn character of Ah Chi make the story interesting. There are some uneven parts and the constant guest cameos from Shaw stars is a little annoying as you might wish that they would stick around longer in the film. That said, the script is above average, the pacing is good and by the time the ending comes around the film holds up.<br><br>Recommended.","user":"ChungMo","rank":[7,8]},{"title":"DEATH DUEL - Shaw Bros. swordplay drama introducing Derek Yee","rating":8,"date":"8 April 2003","review":"DEATH DUEL (1977) is another Shaw Bros. swordplay-and-intrigue extravaganza directed by Chu Yuan (aka Chor Yuen) from a novel by Ku Lung. Its release on DVD follows that of KILLER CLANS (1976), THE MAGIC BLADE (1976) and CLANS OF INTRIGUE (1977), all also reviewed on this site. The plot here is a lot simpler than those of the earlier films and involves fewer characters and, unfortunately, fewer fight scenes. It does, however, offer a fresh star in then-newcomer Derek Yee who plays a character who calls himself \"Hopeless Ah Chi,\" a wandering, enigmatic kung fu expert who is challenged by numerous other swordsmen in the course of the film for reasons that are made clear in the second half. That's basically all there is to the film: various challengers pop up to try and kill Ah Chi until Yen Shih-San (Ling Yun), the only one who truly qualifies as Ah Chi's equal, shows up for the final bout. There are only slight hints of the interlocking clan rivalries, conflicting loyalties and vast spy networks that made KILLER CLANS, et al, so fascinating.<br><br>The film is beautifully shot and scored and filmed entirely on Shaw Bros. studio sets. The costumes are pretty snappy also. The fight scenes involve lots of breakaway walls and furniture and are often staged in extreme long shot, perhaps to cover up the frequent use of a stunt double for the lead.<br><br>\nAs usual, the cast offers a number of Shaw Bros. notables, including dependable character actors Ku Feng and Fan Mei-Sheng as Ah Chi's allies and--in welcome action cameos--Shaw Bros. stars Ti Lung, Lo Lieh, and David Chiang. Also appearing are Wang Lung-Wei, Norman Chu, Yueh Hua, Yuen Wah, Chan Shen and Cheng Miu, along with many other familiar faces from kung fu films. As usual with Chu Yuan films, there are some lively and beautiful women on hand to spice up the action, although not as many as in the earlier films. Candy Yu plays Yee's girlfriend while Chan Ping plays a rival clan leader stirring things up behind the scenes.<br><br>The two leading men, Derek Yee and Ling Yun, are adequate but lack the flair of the aforementioned cameo players. Still, Yee makes an interesting hero--young, deadpan, and far more handsome than most kung fu stars of the era. He acted for approximately 20 years, but also turned to writing, directing, and producing and wound up making some key Hong Kong New Wave dramas of the 1990s, including C'EST LA VIE MON CHERI, FULL THROTTLE, and VIVA EROTICA.","user":"BrianDanaCamp","rank":[6,7]},{"title":"Really entertaining 90mins.","rating":7,"date":"28 January 2005","review":"Pleasing purposeful and taut Swordsplay - movie based on stories by Gu Long, about the supremacy of the Jiang Hu. Third master [ Derek Yee ] is the #1 at the moment , considered as the best sword fighter, but he's tired of his way of life, pretends his death and begins a simple life. Too early for Yen Shi kwan [ Ling Yun ], who aimed the whole life for fame and the answer if he could be the real #1.<br><br>Death Duel is a little different from other Gu Long movies directed also by Chu Yuan, no obscure jumble of plot and persons here, it's strictly concentrated oh Third Master and his tries to survive the power struggle, where he's attacked again and again. The then 20yrs old Derek Yee [ now director of movies like ONE NITE IN MONGKOK, VIVA EROTICA, FULL THROTTLE ] does a strong impression, mainly optically and particularly with his mimic, and performs the action sequences well. These are well choreographed, unbloody swordplay with martial arts and jumps varied, there's also good use of the environment Optically the film is rather lyric - magical, many red and blue contrasts, much fog, added a calm, but appropriate score. Really entertaining 90mins. <br><br>Movie has some relation to the other Gu Long picturizations like KILLER CLANS and MAGIC BLADE, Ti Lung has a cameo as his Swordsman Fu and Lo Lieh as the killer Han Tang.","user":"mj970128-1","rank":[8,11]}]