[{"title":"Appealing even if chaotic","rating":6,"date":"6 October 1999","review":"Terry Southern's novel, \"The Magic Christian\" is very different from the film. However the film, which was written by Southern, among other, still maintains the spirit of the novel.<br><br>The film is simply a series of vigniettes centering around Sir Guy Grand (Peter Sellers), and his adopted son, Youngman (Ringo Starr), who goes about \"making things hot for people,\" by using his vast wealth to perpetrate elaborate practical jokes largely aimed at seeing how many of their principles people will give up for money.<br><br>The movie is very silly, fragmented, and horribly dated. &gt; Now that you have heard the case against, I have to say that this is one of my favorite movies of all time. The movie destroys or humiliates all social icons, from the police, to \"the old school,\" to the snobbish upper class, to the art world.  Its great to see, and once you make up your mind that the movie is just a series of sketches, its funny, and immensely satisfying, albeit somewhat vicious.<br><br>Look for cameos by Yul Brynner (in drag), Spike Milligan (Sellers' partner in \"The Goon Show\"), John Lennon and Yoko Ono, among many others.<br><br>Other notes: The novel, \"The Magic Christian\" was banned for a time, because it was viewed as obscene. Peter Sellers loved this book, and after he read it, he sent copies of it to all of his friends. It might say something about his tragic and depressed personality, that he found this book, with its many vicious stabs against society, so appealing.","user":"JasonS-5","rank":[50,57]},{"title":"\"Just Wanted to See if You Had Your Price...Most of Us Do...\"","rating":9,"date":"3 July 2006","review":"No one slices comedy with an obsidian knife the way Terry Southern does. Guy Grand changes from the American zillionaire in the novel to an English gentleman tycoon (Sellers) &amp; gains a soulmate when he adopts scruffy vagrant Youngman (Starr), but Southern's unique low-key, vicious zaniness remains. The pair's purpose in life is to skewer institutions in particular &amp; society in general by bribing, with their unlimited wealth, professionals, experts &amp; officials to humiliate themselves and/or their employers. Some of the novel's funniest scenes make it to the screen, including: free cash given away to those willing to wade into vats of hideous filth to get it; Big Fang, the \"Congo Black Dog,\" wreaking havoc at Crufts; Guy's dining experience at Chez Edouard; a traffic officer (Milligan) paid to eat Guy's parking ticket; and, of course, the \"Magic Christian,\" the cruise ship from Hell. Worthy additions include Laurence Harvey turning Hamlet's soliloquy into a striptease (\"with a bare, bare bodkin!\"), Attenborough helping to turn the Oxford &amp; Cambridge crew race into a \"punch-up,\" and Guy collecting \"French noses\" at Sotheby's art auction. Sellers is perfectly deadpan &amp; dignified as the tycoon whose determination to find everyone's price is even more believable today, the age of \"Fear Factor\" &amp; \"Big Brother,\" than in the 1970s. Starr, at the height of his creativity before his solo career spun into jaded dissolution, is just right as Guy's sounding board (as in their ambition to rewrite great books, including the Bible, with the nouns left blank for the readers to fill in). Graham Chapman &amp; John Cleese demonstrate their trademark Python casual nonsequiturs (\"the crowd seems sickened by the sight of no blood!\") as well as playing small parts: Chapman as the (nearly) incorruptible Oxford crew captain &amp; Cleese a pompous art expert. But it's the \"Magic Christian\"--Guy's ultimate prank--with her all-star, wacky crew that puts the film over the top. Hyde-White is the clueless captain (or is he?), Welch the chief engineer, AKA \"Priestess of the Whip,\" Frey the cloying shrink, Lee the bloodthirsty steward &amp; Polanski the silent drinker. And don't miss that lounge singer! Like most Southern &amp; Python films (and Marx Bros. films before that), \"The Magic Christian\" doesn't so much wrap up as end simply when it runs out of gags. It's best appreciated for the sum of its parts, but in that it never misses a beat. No collection of satirical films--or Python or Sellers movies--is complete without it.","user":"tom-darwin","rank":[21,24]},{"title":"Brilliant!!!","rating":10,"date":"12 September 2003","review":"This film takes a brilliant thrust at British notions of class and propriety, if not Western Society as a whole. Peter Sellers plays Guy Grand, a man with a perverse sense of humor, and to whom money is no object.  The film begins as Grand legally adopts a young vagrant, (a monosyllabic Ringo Star), and the two set out to turn everyday life into a kind of black surreality worthy of Monty Python. Though Grand has no spoken manifesto, his overriding goal is to mock, humiliate, and freak-out his pretentious peers via elaborate practical jokes, revealing the underlying hypocrisy of polite society. Ultimately Seller's character is dismayed when his social-experiments prove his suspicions: respectable citizens will do ANYTHING for money and prestige.<br><br>This movie is not for normal people, in fact, this movie hates you. Don't watch it. Go away.<br><br>(this movie has some colorful freak-out scenes that put Austin Powers to shame, especially when visually contrasted against the gray bleakness of industrial London)","user":"toaster917","rank":[40,49]}]