[{"title":"The vampire legend get the sex treatment from Hammer Studios","rating":24,"date":"24 December 1999","review":"Hammer Studios speeds up to the more sexually explicit times with Vampire Lovers, a sleek, beautifully filmed atmospheric filming of the vampire tale Carmilla by Sheridan Le Fanu. This wonderfully done film combines the traditional vampire legend with the more permissive sexual standards of the 70's resulting in a sensual yet frightening version of this well crafted story. Ingrid Pitt is breathtakingly beautiful &amp; sensual as the main character Carmilla. She is the human embodiment of a sexually charged feline, and Peter Cushing is appropriately sincere as her nemesis The General. This film singlehandedly established Ingrid Pitt as the reigning queen of vampirism in the 70's. Vampire Lovers is well worth the time for a viewing.","user":"augiedog","rank":[35,39]},{"title":"Similar to all the other Hammer horrors, except that it has some surprising elements of eroticism.","rating":1,"date":"1 October 2004","review":"Hammer studios, having more-or-less exhausted the Dracula franchise by 1970, decided to freshen up their tales of vampirism by bringing in a lesbian angle. The result was The Vampire Lovers, a decent horror flick taken from Sheridan Le Fanu's story \"Carmilla\". The film breaks no new ground in terms of horror, but in terms of eroticism it probably raised a few eyebrows back in 1970, with its frequent nudity and explicit lesbianism. There's more to it than just the erotic stuff though - Ingrid Pitt and Peter Cushing are in commanding form; Tudor Gates's screenplay is pretty good; and there are some gruesome moments - including several decapitations - to satisfy gore-hounds.<br><br>Elusive vampiress Carmilla (also known as Mircalla and Marcilla - and played by the luscious Ingrid Pitt) escapes death at the hands of an Austrian vampire hunter. Carmilla fakes an accident to win the sympathy of the Morton family - nearby aristocrats - and soon she has been taken into their noble household. One thing to which Carmilla is quite partial is the blood of female victims, and pretty soon she has befriended Emma Morton (Madeline Smith), whom she hopes to entice into a lesbian love affair before vampirising her. However, Emma's father Roger (George Cole) and his friend Von Spielsdorf (Peter Cushing) realize that something isn't quite right and eventually uncover Carmilla's sinister secret.<br><br>The film is handsomely photographed and nicely directed by Hammer veteran Roy Ward Baker. There's not much here to distinguish this one from all the other Hammer horrors, other than the stronger-than-usual sexuality. However, fans of the Hammer style films will not mind that, as the \"sameness\" of the studio's films quite often adds to their charm. I can't really bring myself to recommend this film whole-heartedly. Let's just say that if you like Hammer's period horror films - or if you're a fan of Pitt or Cushing - you'll find plenty to enjoy here.","user":"barnabyrudge","rank":[31,35]},{"title":"The lesbian vampire movie as moonlit poetry","rating":10,"date":"26 September 1999","review":"An ocean of mist hangs above a grave. A figure enveloped in a white shroud swirls through that mist with balletic grace, then rakes a hand across a bloody mouth.* A man at his niece's deathbed calls for her missing friend. The call echoes through the empty chambers of the house and down the terrace outside, where the wind blows fallen leaves through the autumn night. The calls merge with older echoes in a cemetery beneath a ruined castle. A woman walks in those mists, clad in her nightgown. The mists dissolve her from sight. * \"I want you - to love me - for all your life,\" pleads a beautiful vampire turning from the view through a moonlit window to clasp the girl she loves with desperate intimacy. * That same vampire woman stands on a terrace in the sunset, tears glinting in her eyes while she listens to the ancestral echoes that condemn her to her fate. *<br><br>Yes, this is pure Hammer Horror: a work conceived as sheerest exploitation which somehow transforms itself - in its greatest moments anyway - to an authentic romantic poetry. Yes, of course, a lesbian vampire movie made by men may seem the height of sexism, and at a conceptual level the movie may be open to those charges. But a female gothic artist was involved here: Ingrid Pitt, whose Carmilla is such a vivid presence as to render herself the character we root for and her patriachal enemies as the true pale-faced monsters (Has Peter Cushing ever come across as less loveable?). Other screen vampiresses are bimbos or boogeywomen or upmarket fashion plates by comparison: Pitt is tigerish, witty, tender, passionate, vulnerable, savage and tragic: Perhaps the only actor, male or female, who has brought to full life all the complexities of the vampire psyche. She's great and the other film-makers, at their best, rise to the challenge she sets. The movie is hardly unflawed but when its accidental poetry gels, few movies in its genre can surpass it.","user":"Forester-2","rank":[26,31]}]