[{"title":"Early 70s cult movie which just fails to make the top grade","rating":7,"date":"22 October 2008","review":"I recently purchased a VHS of the 1973 movie 'Man at the Top' and I see that there are no reviews yet so here is my offering.<br><br>In this film Kenneth Haigh reprises the role of Joe Lampton which he made famous a few years earlier in the TV series with the same title. I have not seen those TV programs so can't make any comparison between the film and TV versions. Joe is a gritty and straight-talking Northerner (in UK) who had travelled down to London to make a success of himself in business. In this movie he is selected for a top position within an international pharmaceuticals company headed by Lord Ackerman (played by Harry Andrews) after the previous occupant of that position mysteriously committed suicide in a London park. As the story progresses Joe becomes increasingly angry at the corruption and double-dealing he finds within the company and resolves to find out why his predecessor killed himself. Along the way the now-divorced Joe finds time for an affair with the Lord's wife Alex (played by the lovely Nanette Newman). No spoilers here so I won't reveal any more of the plot. Suffice to say that there are some cameo roles played by the boxer John Conteh and the comedian Charlie Williams. There is also of course some nudity though sadly that of Ms Newman is provided by a body-double!<br><br>This was considered quite a cult film when it was released. And it is indeed a good movie, well worth watching if you can obtain a copy (as it is now pretty rare). But for me it just fails to capture the atmosphere of the early 70s in the same way that (for example) 'Shaft' did (in US) or 'Get Carter' did (in UK). Both of these films were released around the same time as this movie. So to that extent it failed to rock my boat. But others must make their own minds up and may draw a different conclusion.","user":"whatleym","rank":[9,10]},{"title":"\"I've got two problems - one; I think I'm a b*****d. Two; I think I like it\"","rating":9,"date":"27 April 2013","review":"The story of Joe Lampton began in 1957 with the publication of John Braine's novel Room At The Top. It told the story of Joe, an ambitious 25 year old who has to choose between heart and head in deciding whether to sacrifice the warmth and love of an older woman who is dependent on him in order to marry Susan, the daughter of a wealthy businessman to get his foot on the ladder of success. He chooses the expedient option - but when the older woman commits suicide, he's so ripped apart with grief, he's unable to enjoy his triumph. It was filmed in 1959 with Laurence Harvey as Joe. The story continued in 1962 with the sequel Life At The Top in which the 30 something Joe finds the fruits of success have turned into ashes - Susan is having an affair, and he's utterly trapped by his father in law, Abe. An attempt to break away and succeed on his own terms proves fruitless and he realises he's truly a victim of his own ruthlessness. This too was filmed with Harvey, in 1965. <br><br>There were no further novels, but in 1970 Braine created the TV series Man At The Top which carried the Lampton saga into the 70s with Joe now in his forties. It ran for two series from 1970 to 1972 with Kenneth Haigh replacing Harvey as Joe. Abe has set Joe up as a management consultant with his friend from Room At The Top, Teddy Soames. As the series progresses, with much heartache for Susan, Joe loses the aunt who raised him like a mother back in his home town, Dufton, which provokes a crisis of conscience and he finally breaks free of Abe - for a while. Subsequently the business folds. After struggling,eventually Joe is employed again, but when his ruthlessness causes the death of his little girl, his conscience flares up again and he tells his employer he's through eating s**t. Abe persuades him to enter politics, but when he realises the aim is to exploit the workers of Dufton, he publicly denounces Abe and his partners - and effectively self-destructs. <br><br>The big screen spin off arrived in 1973 and had to be consistent with Joe's backstory without requiring a PhD in John Braine to follow the story. It had to stand alone, as well as tie in with what had gone before. It does this very well indeed, and casual viewers can enjoy the film as well as seasoned Lampton followers. <br><br>After irretrievably damaging relations with Abe and Susan, Joe is single and now has a relatively low level job on a construction site, but has been head hunted by the Ackerman Group, a pharmaceutical company, to be their managing director. Joe takes the job, but can't help wondering why they want someone with no scientific background. He investigates - and soon he finds a sinister conspiracy to discredit and destroy him. But as many a devious businessman has found to his sorrow, if you try and shaft Joe Lampton, it'll end in tears - and Joe's eyes will be dry as a bone........... Much more explicit visually and vocally than the series was able to be at the time, Man At The Top is a minor, but unjustly forgotten film which has been long overdue for reissue. Haigh brilliantly recreates his TV role and there's ample supports from such dependable actors as Harry Andrews and Nanette Newman. There's even an appearance from then-popular TV comedian Charlie Williams to savour.","user":"christophernash290","rank":[5,6]},{"title":"Disappointing film created from a great source","rating":5,"date":"17 January 2016","review":"As a great fan of John Braine's two books about Joe Lampton – Room At The Top and Life At The Top – plus the corresponding monochrome films starring Laurence Harvey, I found the movie to be a lazy attempt to cash in on the character of this seminal working class hero. It appears to be nothing more than a vehicle for the leading man to jump into bed (or shower, or woodland copse) with as many women as possible. The acting is fine, with Kenneth Haigh (complete with Mexican bandit moustache) doing a reasonable job as the sardonic Joe, and the reliable Harry Andrews playing the part of the upper class boss with his usual flair. The gorgeous Nanette Newman also does her bit, despite surrendering herself to a blatant body- double in the requisite nude scenes.<br><br>The story is paper thin, set in the dubious world of pharmaceuticals, with a ludicrous irrelevant sub-plot concerning two hitch-hiking girls, one of whose father is played by ex-Doncaster Rovers footballer turned comedian, Charlie Williams, an affable chap whom I once met on The Generation Game (but that's another story). Another well-known face pops up at the beginning – ex Light Heavyweight WBC boxing champion John Conteh. He takes the role of one half of a pair of pugilists who look as if they couldn't fight their way out of a wet paper bag. <br><br>I am afraid that I shall have to park this film at the 'do not watch again under any circumstances' end of my shelves of DVDs. It's no wonder John Braine ended his days in a one-room flat in Hampstead, and deeply in debt, if this is what they turned Joe Lampton into.","user":"tony-hesford","rank":[2,2]}]