[{"title":"My eigthth Godard..","rating":13,"date":"13 February 2011","review":"\"The film reveals how and why a supposedly revolutionary Italian girl has in fact fallen prey to bourgeois ideology\". By this plot synopsis I was expecting a film where Godard and his friends in Maoism call into question the conceit of being a revolutionary from a safe distance, in a complacent society.<br><br>That's not quite so, probably because at this point Godard saw no conceit in his chosen political milieu. It wouldn't be until a few years later in Ici et Ailleurs when he'd begin to re-examine that belief and his involvement in it.<br><br>In Lotte in Italia, it's not the conceit of being revolutionary from a safe distance that is analyzed but the problem of it, the conundrum of how the two can be combined in one social position. In the first part of the film we see the girl trying to formulate or conform to the political rhetoric expected from a communist as capitalist society around her provides for her. In the second part the problem is outlined, then Godard offers solutions, thinking for example not in terms of food or clothes but the production of them, not in terms of money but labour.<br><br>What worries Godard here, as with other films of the period, what he's preoccupied with, is deeply esoteric for communism. He simply devises in film ways to express the concerns of every other communist of the time. The liberation for him in this Maoist phase, as it were, is that he has a reason to keep making his art. He finds a cause not in some inner personal turmoil, but in the greater turmoil of the world. As such, I sense very little personal attachment, no expression that comes from the soul.<br><br>In my ongoing Godard quest, what fascinates me the most is not any individual film but the struggle for expression, being able to chart the creative ebbs and lows and the evolution of an artistic voice and does a chronicle unfold. Here, I find a talented film mind working beneath his abilities, operating under the assumption that he's lending those talents in the service of those important, imminent, changes in the world he presaged in Week End.<br><br>The thing that intrigues me the most then is this sense of dichotomy I get from Godard, between a feverish intellectual who places too much importance in cinema to completely abandon it and a satisfied bourgeois who really has little incentive to keep making it. At this point at least he had found a cause, now I'm setting my eyes on the time when he abandoned it.","user":"chaos-rampant","rank":[6,11]}]