[{"title":"a documentary?","rating":9,"date":"30 December 1999","review":"This film is in no way a documentary, but the filming style and plot line lend to its feeling so.  Sally Field's acting in this movie is impeccable. She becomes Norma Rae.  We see her fear, her disgust, her anger at the mill's treatment of its employees, and the passion she has for what she believes in.  Although the best known scene from the movie is her standing at the mill with the \"Union\" sign, I believe the most memorable scene is towards the end when she talks to her children, telling them what to expect. The movie tends to turn away from her children, but this scene focuses in on her relationship with them.  Beau Bridges is great, and the character of the Union leader (can't remember his name) is terrific.  The sexual tension between Norma Rae and he is palpable.  I strongly recommend this film to any Sally Field fans, or anyone interested in social issue films.","user":"evso","rank":[39,52]},{"title":"More than one actress's tour-de-force, an indelible and moving human story","rating":7,"date":"17 November 2001","review":"In trying to get the textile mill she and her family work for unionized, Sally Field's Norma Rae Webster also tries to earn self-respect at any cost. She's been leading a dead-end existence: a single mother, still living with her family, sleeping with married men who abuse her. But after being inspired by a union-organizer (Ron Liebman, in an Oscar-worthy supporting performance), Norma Rae is awakened to the possibilities of life, and, what's more, everything that is wrong with the mill that seems to suck the energy and hope from those who stand there day after day trying to earn an honest dollar. There are problems with the picture: Beau Bridges' role as new husband Sonny is treated in a trivial manner (he's supposed to be a voice of reason, but he's too smooth, maybe condescending, and it's an unconvincing character); Oscar-winner Field's fiestiness occasionally feels overdrawn and/or one-note, but in many of the scenes outside the factory she does indeed excel, seeming vibrantly natural and exuberant. Martin Ritt's direction is focused and firmly rooted (he never sugarcoats Norma Rae's character, and sometimes she's not that likable) and the script manages to sidestep preachiness to get its points across entertainingly. The art direction is really the second star of the film: vivid, palpably hot and sweaty, with bits of cotton floating about in the air. The mill in question becomes very familiar to us, as do the people who work there. \"Norma Rae\" is involved and long, yet it is memorably bittersweet, and with a simple, haunting finish. *** from ****","user":"moonspinner55","rank":[33,44]},{"title":"Unions A Timely Film ****","rating":9,"date":"8 March 2006","review":"Sally Field's first Oscar came way via \"Norma Rae.\"<br><br>The factory where she and her dad work does not know or want to know about unions. Workers are routinely abused and there is no way out for these hard-working laborers.<br><br>Along comes Jewish Ron Leibman, from the north, with the idea of forming a union. He meets up with much hostility. We see the southern hatred of unions in general and there is an underlining feeling of anti-Jewishness here as Jews have always been in the forefront of labor issues in America.<br><br>Pat Hingle's fatal coronary spurs daughter Norma to action. Her stopping work and turning around with the sign union is memorable.<br><br>This picture is timely due to the rash attacks on the labor movement from the federal government on down to management. Made at a time when President Reagan destroyed the Air Traffic Controller's Union, the film is most appropriate.","user":"edwagreen","rank":[25,35]}]