[{"title":"A unique film experience","rating":8,"date":"24 June 2002","review":"What a strange and surreal experience this film presents. While this is supposed to be a movie, it comes off as more of a high budget play, complete with random crowd scenes and odd looking stage sets. While most films try to present the real, this film encompasses the opposite side of the spectrum, presenting a world that is completely reconstructed within a small plot of space. Entertaining and unusual, this is one of those films a person should watch for the pure visual appeal of film.","user":"Agent10","rank":[16,17]},{"title":"The Best Kind of Music","rating":10,"date":"18 February 2005","review":"First off, Luis Valdez is a genius, he managed to take a real life story, and make it into a musical, not only was its the best kind of musical, with great acting and symbolism, but with meaning to the Chicano race.<br><br>This film is about Chicanos and their history during the 1940's, and even though it's about the gang, the actual Zoot Suit and the ending are all very symbolic, and this movie should be credited for all the creativity and work put into this brilliant masterpiece.<br><br>The songs were good, but what I really enjoyed was the acting, James Omos is talent behind measurement, yet he receives no credit for such a role. He doesn't play the role, he is the Zoot Suit. All around the acting from everyone was excellent, I wouldn't change a thing about the film.","user":"arlmovies","rank":[18,20]},{"title":"Outstanding focus on an overlooked and important culture.","rating":10,"date":"30 May 2002","review":"Having seen the original stage production at the Mark Taper Forum &amp; Aquarius Theatres, in Los Angeles. I was quite blown away by both the production and performances. This was one of my all time favorite stage productions.<br><br>An attempt to mount the play in New York was a disappointing failure. I guess the \"snobs\" of the New York Theatre world, at that time weren't appreciative of something they just didn't get.<br><br>When I hear about the film being in production, I awaited it's release with anticipation. It's impossible to replace the presence of live performance with film. This filmed version was a truly impressive attempt to relay the success of the \"live\" production. I have long had my own copy of this film on Laser Disc and wish it was on DVD.<br><br>If you haven't seen the film and are ready for something different with some cultural insight, rent it on VHS, the only format currently available.","user":"mjmarkic","rank":[15,17]}]