[{"title":"A WELL CRAFTED LITTLE GEM","rating":9,"date":"12 March 2004","review":"I remember seeing this on late night television years ago, and had very fond memories of it. Recently i caught up with it on dvd, and found that my memory had not let me down. Every aspect of this film demonstrates film making talent of the very highest order. The script is superb, keeping you guessing right up to the end. The acting of the leads is faultless, but the icing on the cake is the amazing direction by Fuest. He manages to turn the open, sunny, French countryside into a nightmare landscape. Gradually cranking up the tension, alienation, and paranoia with the skill of a master. He really should have been a massively successful director. Pure craftsmanship, with a very creepy edge.","user":"EDDIEBLKMR","rank":[51,55]},{"title":"superb English suspense film set in rural France","rating":9,"date":"4 February 2005","review":"Surprisingly good suspenseful mystery here! I watched a used copy of the full frame HBO Video VHS, and I'm tempted to upgrade to the widescreen DVD which also has a commentary track.<br><br>Two pretty young English women are bicycling across the French countryside using scenic backroads (shot on location). The blonde spots a young Frenchman with sunglasses at a café that she thinks is \"dishy,\" and they keep encountering him on the road, since he speeds by on his scooter and they continually pass him when he stops somewhere (a cemetery, a café).<br><br>They rest off the side of the road on the edge of some woods, and have a spat. The brunette wants to stick to their schedule, while the blonde wants to sunbathe and perhaps even turn back around to find and talk to the young man. The brunette goes on ahead, while the blonde stays put.<br><br>The brunette feels guilty, though, and stops at a café and waits. Her friend doesn't show up. The proprietress tries to tell her something, but the English girl speaks very little French. The French that is spoken is appropriately not subtitled, putting those of us who also don't know French into her shoes. The café owner knows a tiny bit of English: \"bad road.\" The girl decides to go back for her friend, and finds her missing, though her camera is still there.<br><br>There are a lot of suspicious people in the movie. The young man with the sunglasses is the first obvious suspect, but there's also a farmer in a field, the café owner and a man in overalls at her café, an older British lady, a gendarme, the gendarme's father.... The poor English girl doesn't know who she can trust.<br><br>I really enjoyed this movie a lot, and I didn't find it to be slow at all.","user":"FieCrier","rank":[56,68]},{"title":"Vacation spoiled","rating":9,"date":"1 August 2005","review":"I really liked this film. Although the twist ending was not exactly unexpected, the story kept me guessing. Beautifully shot with lots of very effective scenery adding to the overall feel. Director Robert Fuest's work is evocative of Hitchcock. The use of French actors and the absence of subtitles is a smart move, giving the viewer a sense of the young girl's confusion and mounting fear. The location filming in France pays off beautifully as the movie had an otherworldly feel to it. Pamela Franklin stars and it quit good. She is asked to tell a lot of story with only her expressions and she does so splendidly. Fuest trusted her performance and it paid off. Solid story, good acting and a firm, polished hand at the directorial helm make this an underrated thriller.","user":"hoodcsa","rank":[30,35]}]