[{"title":"Give me flights of imagination over drama anyday!","rating":19,"date":"19 October 2004","review":"Wasn't feeling the very best today, but had to get on with it anyway, as you do, you know, and, when I finally got a chance to sit down in my own living room this afternoon who should come bursting thru the door but my 6 year old son and about 7 of his friends... JUST as this movie, which I've always adored, came on one of The SKY movie channels. I closed the living room curtains for cinematic effect and we all sat down and watched it. They were all entranced by it, even tho' some of them had seen it already. <br><br>I've seen \"The Adventures of Baron von Munchausen\" myself many times and it never fails to fascinate me. It goes a very long way to explain many things that are omnipresent in life (war, sex romance, childhood innocence, adult disillusionment) by illustrating, and somehow making real, well-known classical myths and fairy tales. Oliver Reed deserved some sort of award for his portrayal of the god Vulcan. I read that Sean Connery was slated for the part of King of The Moon but it HAD to be Robin Williams. Mork calling Orson indeed.... <br><br>This is my first review in this forum and, therefore, I will not go on at great length except to say that viewing this movie again made me determined to state that my favourite movies are movies like \"The Adventures of Baron von Munchausen\", \"Pirates of the Caribbean\" and \"Yellow Submarine\". May you all develop a talent for living happily ever after!","user":"kitchen-1","rank":[71,81]},{"title":"Wonderful Nonsense (a forgotten classic?)","rating":8,"date":"7 August 2006","review":"A young Sarah Polly is swept on a grand storybook adventure when her father's theater is visited by the source of its drama; the real Baron himself (perfectly played by John Neville). The town is under siege by the Turks and only Munchausen and his band of curious adventurers can save it, so long as Death or a doctor doesn't catch him.<br><br>Terry Gilliam, having hit his stride with the 1984-and-a-half classic Brazil, went on to fulfill his ultimate fantasy film with a great cast of actors (Jonathan Price included), beautifully detailed sets and costumes, and a very strange yarn of a tale indeed. Bit parts are filled out by Robin Williams, the late Oliver Reed (seen most recently as Proximo in Gladiator) serving up a fiery Vulcan - husband to a young (not to mention stunning) Uma Thurman as Venus.<br><br>A great deal of the magic that sparkled in Brazil seems to have been rekindled here, and while it may have been panned at the time of its release, time has treated it well. The effects have that pre-cg feeling that makes me warm and fuzzy inside, and while its a little slow to get started, it surprises around every turn. <br><br>Fans of Gilliam's work (and those who still possess that curious inner child) will find much to enjoy here - even if it is nothing more than wonderful nonsense.","user":"juubei-2","rank":[48,54]},{"title":"The King Of The Moon, and other wild things","rating":9,"date":"25 April 2004","review":"The Adventures of Baron Munchausen is one of those films that you either love or hate. You may hate it because the inner child in you has not been released. You may love it because the inner child in you have full reign and want a wonderful fairy tale. This film has all the elements, flying ships (A balloon made of ladies knickers), monsters (A gigantic whale that looks like an island), and a little girl observing all the fantastical adventures. A city is under siege and a theater troupe is trying to perform a play during all of this. In comes an elderly man (The wonderful John Neville)who claims that the troupe has it all wrong and that he, himself, is the real Baron and wants to tell the story straight. From there, his adventure really takes off. He and Sally (The cute as a button Sarah Polley)go off in search of his friends to help save the city: Berthold (Clever Eric Idle), the fastest man around; Albrecht, the strongest man in the world; Adolphus, the man with the sharpest sight around and Gustavus, the man with the keen hearing and breath that can blow elephants off their feet. The gangs adventures bring them to the Moon, where the King (Wild as ever Robin Williams)has trouble holding on to his head, to the Underworld, where Venus (Beautiful Uma Thurman)drives her hubby Vulcan (The wonderful Oliver Reed) insane with jealousy. The story and the visuals (Especially the Moon) are beautiful and the ending is interesting. You get so caught up in the story that the viewer gets lost in what is real and what is not. Great for teens and up. Kids may get scared at some of the scenes.","user":"domino1003","rank":[55,63]}]