[{"title":"Bravo, Bel Amis!","rating":8,"date":"31 October 2005","review":"Director Lewin started out on his own with a trio of literary adaptations: Somerset Maugham's Moon And Sixpence (1943) was followed by Oscar Wilde's The Picture Of Dorian Gray (1945), and then came this version of Guy de Maupassant's best novel, Bel-Ami, in 1947. George Sanders appeared in all three, giving each a distinct flavour by his presence. A self-obsessed and destructive individual appears in all, increasingly prepared to isolate himself from conscience or morality in order to achieve his goals - at least until an ending brings some comeuppance or resolution. In the first, Sanders plays a Gauguinesque painter, who deserts his family to work in Tahiti. In the second, Dorian Gray pursues his famously immoral activities, Sanders in attendance, whilst Gray's famous painting grows ugly in the attic. In The Private Affairs Of Bel Ami (aka: Women Of Paris, 1947), Sanders returns to centre stage portraying a man climbing to social success over a succession of suffering women.<br><br>Scriptwriter-director Lewin brought to each of these films characteristic qualities: literate dialogue, visual excellence, and a representation of interior states through colourful moments of art among them. In the fin de siècle worlds of Dorian Gray and Bel Ami, Lewin sharpens the unease and implicit questioning of mores shown in his earlier Maugham adaptation. Avoiding the temptations of melodrama, he chooses specific historical milieu by which to communicate the ennui of the privileged and the corrupt. Sanders is excellent as George Duroy, the title's charming and unscrupulous social climber, who cannot be trusted with hearts - or come to that, much else: one in the words of the title song who \" will be leaving me, (and) who will be deceiving me..\" First seen down to his last few francs in 1880's Paris, Duroy's suave looks continually make him irresistible to women have brought him little in the way of fortune. Offered a chance job in journalism by his ex-army friend Forestier (John Carradine), Duroy asks Forestier's independently minded wife Madeline to help with the creation of a first article, while also entering into a relationship with the far more doting Clotilde (Angela Lansbury). Soon the seductive antihero is on his way up the social scale after marrying Madeline (a suggestion he promptly broached in the hapless Forestier's death chamber). Later after engineering a scandal, he divorces this first wife, and acquires a defunct aristocratic title with a view to moving on and up again.<br><br>\"You're a sneak thief... you take advantage of everyone, you deceive everyone,\" is the way the disillusioned Clotilde eventually personifies Duroy towards the end of the film, after he callously steals her heart, another man's wife and half her inheritance, then the family name of a missing heir, and finally inveigles the hand of a rich innocent. This single-minded obsession in reaching the top of the social ladder echoes that of the ambitious Horace Vendig in Ulmer's Ruthless, made the following year. Duroy's manipulative, seductive charm brings echoes too of Chaplin's Monsieur Verdoux, also from 1947. But while Duroy's progress does not directly lead to murder, it is more detestable and insidious. Whereas at the close of his film Verdoux offers disingenuous apology for his actions, Bel Ami (although saddled with a ending more in line with the demands of the censor than the original novel) is unrepentant, equating his final misfortunate as being \"scratched... by an old cat.\" There are several elements that make Lewin's film interesting today, being the independent work of a minor, if idiosyncratic auteur, then relatively unusual. Even though the aspirational cad makes use of the women he gets to know, Madeline remains a strong and talented character in her own right. Besides helping Duroy with his writing at the very start, there is a strong suggestion that she has actually been doing much of her first husband's journalism for him too. And despite her final betrayal, she continues to impress as an individually motivated female, in contrast to the ever-loving and forgiving Clotilde. Both are victims but Duroy's emotional abuse and subjugation of them and others is a comment on his own coldness as well as on the liabilities of females in a prejudiced society, made especially keen by the knowledge each woman has of her own predicament. For men, the answer to honour slighted is a duel. Women at best are obliged to fall back on subterfuge or, at worst, live with the grief of a broken heart.<br><br>Each of Lewin's first three films was made in black and white. But they also included moments when the screen bursts into startling colour, as the audience contemplates painting central to the theme. The Moon And Sixpence brings a final sequence showing the artist's work, a form of artistic justification for preceding events. In The Portrait Of Dorian Gray, the painting in question reflects back directly the moral dissolution of the subject. Bel Amis' canvas occupies a more complex position in its narrative than its predecessors. It's an expensive work of art, bought by a wealthy patron and admired by Duroy, - one of the few moments in which, half to himself, he evidently expresses an honesty with anything. Painted by Max Ernst (his Temptation Of St Anthony) it reflects back the decadence of its admirers, as well as continuing the plot's subtle thread of damnation.<br><br>An excellent cast includes a young Lansbury as Duroy's one true love, and John Carradine as his tuberculosis-ridden journalist friend. Audiences today will be impressed by how modern the feel of it all is, whether in the depiction of Duroy's amoral, manipulative character, completely unfazed at being disliked, or the film's sophisticated and sympathetic treatment of women. Lewin's next work was the weirdly romantic Pandora And The Flying Dutchman (1951), his most ambitious film, the reception of which proved a disappointment. He never rose to such heights again. The Private Affairs Of Bel Ami, is less flamboyant perhaps but just as unforgettable, remaining his most satisfying work.","user":"FilmFlaneur","rank":[33,33]},{"title":"The Eternal Cad","rating":7,"date":"1 January 2007","review":"The Private Affairs of Bel Ami gave George Sanders to play a leading role as Guy de Maupassant's gentleman cad who rises in Parisian society over the bodies of a number of seduced and abandoned women. Sanders is a former dragoon who uses his charm to acquire money and power and in the end a title of minor nobility in Third Republic France. The one woman whom he truly loves, Angela Lansbury, is forever lost to him. Would she have brought him real happiness? It's for the audience to judge.<br><br>The comparisons between Bel Ami and Sanders's Oscar winning Addison DeWitt have to be made. Both men are cynics about human nature, but whereas theater critic DeWitt is an observer and a behind the scenes manipulator of others, Bel Ami is doing it all for his own advancement. Both performances have that touch of cad about them and they rank as some of the best work George Sanders did.<br><br>Look for good performances from John Carradine as Sanders's only true male friend and Angela Lansbury who he loves, but who can't give him the social standing he needs.<br><br>Also of course look for Warren William in his farewell role as Sanders's main antagonist. A not very brave, but a fairly shrewd sort, Sanders regularly bests him until the very end.<br><br>The Private Affairs of Bel Ami was a rather daring film for Code run Hollywood, it doesn't surprise me it was an independent movie, released by United Artists.<br><br>Fans of The Eternal Cad George Sanders will eat it up.","user":"bkoganbing","rank":[24,25]},{"title":"Arresting, Biting, Cynical, Honest Portrayal of Power and Control!","rating":18,"date":"18 August 2002","review":"\"The Private Affairs of Bel Ami\" is one of the most unusual films to come out of Hollywood during the Golden Age of Hollywood (1920-1950).  An adaptation of a Guy de Maupassant work, \"Bel Ami\" honestly and bitingly portrays an \"homme fatale\", a man who uses sex to gain social, economic, and political power.  This is the only film, to my knowledge, that portrays such a phenomenon that in real life has been much more common than is commonly held.<br><br>George Sanders was never better than as Georges DuRoy. His playing displays the numbing of feelings, desperation of a life of poverty and low social rank, and misogyny that propel him to do what he does.  No film character in the Golden Age of Hollywood was as blatantly hateful of women as Georges DuRoy.  Witness the scenes with Sanders and Marie Wilson!<br><br>The female characters display a moderness in attitudes, relationships with men, and an awareness of their roles in their relationships with Georges DuRoy that is startling not just for 1880, but for 1947, when the film was released.  Only French and some Italian films of the 1960's have equalled that frankness by female characters of what their place is in the lives of men.<br><br>Ann Dvorak carries much of the film gracefully and with a strong, frank portrayal of a woman much like Georges DuRoy and unapologetic about it. This is definitely Dvorak's finest and the showiest role of her career. Unfortunately, it did not propel her to major stardom and she retired from acting only three years after filming \"The Private Affairs of Bel Ami\".<br><br>Angela Lansbury proved here in this early film of her career what a fine character actress she is.  Her portrayal of Clothilde could've been pathetic.  Instead, Clothilde emerges as well-rounded character who is never tiresome to watch.<br><br>Marie Wilson never got a dramatic part like the one in this film as a Folies Bergere dancer.  She only proves the point that behind every great comedienne lies a fine dramatic actress.  She truly evokes a character, not the dumb blonde comedy relief that was her stock-in-trade.<br><br>A surprising number of top character actors in this film!  The film's look and score are very noirish.  That only highlights the modernity of the characters in the film, much like 2000's \"Moulin Rouge\".<br><br>The movie looks and plays like an RKO-Radio film noir of the mid-'40's.<br><br>Cool concept.  The startling use of color for the one scene in which it is used only adds to the uniqueness of this film's acting and look.<br><br>The only drawback is the use of decidedly obvious painted backdrops.  They only highlight the low budget that was obviously involved in making the film.  Too bad, while the rest of the sets appear well-lighted and -appointed.<br><br>\nAn arresting film!  Definitely worthy of critical and popular reevaluation!","user":"caribeno","rank":[23,25]}]