[{"title":"Comparisons","rating":9,"date":"20 January 2005","review":"Remember seeing this film on the big screen in an art film house in Ottawa while I was a student in Visual Arts two decades ago. Absolutely loved it and have pretty clear recollection of most of it, it's amazing! I was a bit blinded by some of the homo-erotic content and had no idea that Jarman would go on to make a number of art-house films, many also dealing with homosexual texts such as Carravagio, a painter I absolutely love as well as Edward the Second, film version of Christopher Marlowe's play of the fay king of England. The acting in Sebastiane may seem stilted but that also might be due to the fact that many of the actors were amateurs; the Latin for me also lent an aura of authenticity since I studied Latin in high-school for five years. The historical accuracy of the life of Sebastian, the saint, was more correct than most of the hagiographies of his life. The settings were perfect, the depictions quite accurate, the drunken scenes were real because they really were drunk. The hand held quality of the film was a pioneering method of filming that also lends to the realism of the period. All in all a wonderfully creative, even innovative, stylised film that I remind to those who enjoy auteur and art-house plus homo-erotic movies. The sound track was done by Brian Eno and was released separately as \"Music for a Movie\". This is the only part of the film that strikes me as incongruous but somehow the moody style set by Eno's pioneering electronic music does work. Needless to say that Jarman's short filmography is to my mind very impressive.","user":"aarmese2004","rank":[23,23]},{"title":"Killing the One We Can't Have","rating":7,"date":"14 April 2006","review":"It's funny how only now, over twenty years after coming out, I've been able to have access to SEBASTIANE, the movie that once upon a time in a sheltered country such as Dominican Republic, was, aside from MAURICE, the ice-breaker that would identify two gay men to each other in a non-gay environment. Seeing it now I can understand how in the mid-80s (or when it came out in 1976) this would have been one of those films so controversial even the act of lifting the sleeve off the video shelf meant (if you weren't out) you first had to look to the left, to the right, and over your shoulder to make sure no one was looking. Such is the power of a film like this: no disguised theme, no hints of the \"other sexuality\" -- this is homosexuality at its frankest and cruelest.<br><br>The story of the love-hate relationship between Sebastiane and a Severus, a Roman centurion, and its consequences. It's shot in an entirely realistic setting even when it bears a loose plot thread, but this is Derek Jarman's tendency to focus on style over substance. While there were times when I wondered what would the purpose of such a story be the theme of unrequited love/lust wasn't lost on me: Sebastiane is an outsider, with brooding looks, and an aura about him that sets him apart from his fellow comrades who spend their time engaged in trivial hedonism. Severus is smitten by him, lusts at him from a distance, and then decides to submit him to torture after torture because of the indifference, then rejection, he suffers. (This is a reflection of a dance sequence seen at the start of the film in which a dancer is \"sacrificed\" to the lust of a group of dancers.) <br><br>Derek Jarman's movie seems to be less a straightforward narration instead of a contemplative poem of a homo-social society where women are absent, and men are allowed to engage in intimacy with one another. It's on occasion a slow movie because of this and by today's values could even be considered a little cheesy here and there, especially in the slow-motion sequence when Severus observes Sebastiane take a shower. Is Sebastiane provoking him by showering like that or is this Severus' gaze taking in all of Sebastiane's body? One wouldn't know had it been for another scene, that of Anthony and Adrian, lovers in the open, again observed by Severus's point of view. These two scenes make Severus less a flat villain and closer to a man desperately love with a man he cannot have, a man who is, essentially, a tease.<br><br>Not a movie that will appeal to everyone, but one that has, due to its release and presence in video stores, and due to its director's prominence, opened the doors to more films of this kind which have their own audience and acceptance whether they are contemporary classics or exercises in homoerotic cheese. Derek Jarman accelerated conscious, gay film-making by decades at a time when a \"gay presence\" was little more than a shadow or something to be laughed at or pitied (as with the advent of AIDS and AIDS-themed films). You have to admire a man who, having died of the disease, decided to \"get up and do something\" instead of wallowing in maudlin. There hasn't been anyone quite like him, but hopefully, that will change.","user":"nycritic","rank":[21,22]},{"title":"9/10","rating":9,"date":"25 April 2005","review":"Not being overly familiar with Bible stories or Christian history (and the fact that the opening rolling titles are impossible to read), the factuality of this film will escape me. But Jarman is a visual artist, and his film has more in common with the many paintings of Sebastian than it does with factual storytelling. Jarman's ornate decor can sometimes feel dull and bland -- his films can seem lifeless, bogged down by the set decoration. This calls to mind \"Velvet Goldmine,\" a complex film I didn't care for, even though I love Todd Haynes; I want to like Jarman -- I love his books -- and this is the first film of his that I've been actively enthusiastic about. It has much more to do with sex than history; and it's apolitical and political at the same time.<br><br>Consider the film's approach to homosexuality. No one is defined as being a homosexual, so that at first seems like a de-politicization of sex -- all there are are acts, and acts are not political. But at the same time, it's acts that are disdained and made illegal, and without the \"political\" approach to defining (and thereby defending) people as homosexuals, it leaves the acts open to censorship and condemnation -- politicization. As a film itself, though, it is not pedantic or accusatory -- in fact, Sebastian is killed, it seems, because of the lust of Severus, who he refuses. Like the Christian God who Sebastian loves and sees as more beautiful than Adonis, Severus wants Sebastian. But it isn't just condemning lust, either -- Anthony and Adrian are openly lovers, and the abundance of male nudity, and the eroticism of it by Jarman, could hardly be called prudish. In fact, there is a scene at night of the men grabbing each other, their dark-lit bodies, and the soldier pressing his near-naked, muscled body on his lover, that still seems shocking in its passion today.<br><br>It's more like a lyrical tone poem, and Brian Eno's New Age-y score goes well with that. Jarman isn't a bully, and when the crucifying comes around he doesn't bludgeon us -- first we see a close-up of his face, as arrows pierce through Sebastian's skin, silently with the exception of the wind, and Jarman gives us one final distorted image to meditate on the death of the one we can't have. 9/10","user":"desperateliving","rank":[34,38]}]