[{"title":"Not as good as the first 2","rating":8,"date":"24 February 2020","review":"Definitely not my favorite of the 3 but it's hard when the first 2 were just that good. It still portrays well, from my historical knowledge, much of the struggle of the mob families to legitimize their business dealings and try to enjoy life in the later age of the mafia in America. Al Pacino performs brilliantly and I enjoyed Joe Mantegna in his roll. Definitely worth the watch if you were a fan of the previous 2 films.","user":"MR_Heraclius","rank":[44,47]},{"title":"Outstanding, But Sadly Forgotten and Somewhat Misunderstood by Many","rating":13,"date":"13 October 2001","review":"Many believed that the series was complete in 1974. Even Francis Ford Coppola thought that another installment was unlikely. However in 1990, some 16 years later, \"The Godfather, Part III\" was released with results that few could have perceived. The film was not very successful at the box office and many who did see the movie said \"ho-hum\". The critics were also indifferent to an extent. A Christmas release would create enough steam for the film to achieve a best picture nomination and seven nominations in all from the Academy (it failed to win any though). Of course \"Dances With Wolves\" dominated the night and that film along with \"GoodFellas\" are considered the class acts of that year. Why has \"The Godfather, Part III\" failed to achieve a following like its two predecessors (parts I &amp; II)? I am not sure I can answer that question. Michael Corleone (Al Pacino) is becoming an old man and his health is slowly worsening. He wants the family to become 100% legitimate and even makes a deal to link his finances to the Vatican. However Michael has become a bit naive and everyone double-crosses him. Now it appears that the only answer is to get back to the old ways. Younger sister Connie (Talia Shire) believes that Michael has grown soft and that Santino's (James Caan from the first film) illegitimate son should take control (Andy Garcia, in his Oscar-nominated performanece). He is ambitious and has the short fuse that his late father had and this is going to lead to fireworks for the family. He also starts seeing Michael's teenaged daughter (Sofia Coppola, Francis Ford's real-life daughter) and a romance blossoms. Meanwhile crime bosses Eli Wallach and Joe Mantegna pose threats to the Corleones. Kaye (Diane Keaton) has divorced herself from Michael and their son (Franc D'Ambrosio) has somewhat sided with her. Michael's health takes a turn for the worse as he actually goes into a diabetic coma for a time during the film and when he does recover (not completely though) he starts to reflect on a life of loss. The ordering of Fredo's death (John Cazale) in the second installment and his Sicilian wife's murder in the original haunt Michael and he tries to come to terms with his life, but learns from a Catholic cardinal while in Sicily that he deserves all the suffering he experiences and realizes that his suffering will be even greater in the future. In fact there will be a finale that will be the \"fatal nail in the coffin\" for Michael. \"The Godfather, Part III\" is focused on Michael and that is why it is unique to the series. The first two sported so many rich characters that it was impossible to focus on just one. This film could be best described as \"Reflections of a Life of Loss\". The film is excellent and even though it is likely the weakest of the three when you compare them, it is somewhat unfair to put the three \"Godfather\" movies together because they can all stand on their own. Great movies stand on their own and \"The Godfather, Part III\" does just that. 5 stars out of 5.","user":"tfrizzell","rank":[488,619]},{"title":"It really isn't that bad..","rating":10,"date":"11 December 2004","review":"Having heard the endless amount of critique and insults that the last part of the Godfather saga carries.. I have to disagree. Although people seem to love to hate Sophie Coppola and say she ruined the film, I think her part alone wasn't that frail it'd ruin the entire cinematic experience. Saying that is just humorous. Also, the absence of Tom Hagen played by Robert Duvall is really a loss and even I think this film would've been a lot better if there was him in it.. but he got too greedy and couldn't make it into the movie, and that's that. I'm not going to judge a movie by what it could have been, but what it is and how good it ends up being.<br><br>Despite some shortcomings, Godfather Part 3 is a decent ending to the trilogy. While it may have been an attempt to cash off the audience, they still have Coppola bring us his finest directing. I found Al Pacino's performance extremely satisfying and even terrifyingly so. He embodies the mistakes and losses of his life with excellent skill, showing us a don that has lost his health, the loved ones of his life and even the respect for himself. While I never found Diane Keaton's performances in the saga that good, she still fills the spot required, same goes for Talia Shire, whose role in the ending finale of the film really came as a surprise to me - which was a good thing. I didn't find her role in Part 2 too appealing but in this one she has more character, more importance. Sophie Coppola was OK, like I said a lot of people have complained about her acting skills and I gotta admit she was a little \"stiff\" or sorts in some scenes but it's not notable all the time and it didn't spoil any moods for me. Andy Carcia was just excellent, my favorite add to the saga cast, playing the son of his father with excellence.<br><br>So, umm.. this film is perfectly fine. The ending finale was tremendously well shot and very climatic, filled with a lot of excitement. I'm telling you this movie is a great ending to the saga even because of that one particular scene so just go see it, despite what a lot of people have said about, badmouthing it for faulty reasons.. it brought a tear into my eye. It did.","user":"tazamaster","rank":[424,568]}]