[{"title":"Cronenberg's Impressive Feature Debut","rating":20,"date":"20 July 2000","review":"Shivers(1975) is a fascinating first film especially for a person who was learning to direct professionly on the job.  An interesting part about this movie is that Cronenberg did Shivers(1975) without having a clue of what people in the film crew does or containing knowledge of film terms.  The fact that he made a cult classic is a testament to his potential at the time to be an excellent movie maker.  Shivers is basically the first horror film made in Canada as far as I know and David Cronenberg was the first director to open the flood gates for the horror film in Canada.<br><br>\nThis motion picture mixes together the erotic with the zombie genre made famous by George Romero in 1968.  In fact, there are many references to the zombie classic Night of the Living Dead. The movie is about parasites who enters people's bodies and turn them into sex maniacs.  It dares to break many sexual taboos that many film makers would be afraid to explore.<br><br>\nShivers would provide a starting point for some themes that David Cronenberg would explore in later films like Rabid(1977), The Brood(1979), Scanners(1981), Videodrome(1983), The Fly(1986), Dead Ringers(1988), and Crash(1997).  The two themes are disease as the transformation of the body into the next state of evolution for the human being and the other theme of the outsider who does not understand why they are so different from other people.  Barbara Stelle provided the movie with many memorable moments especially the infamous \"bath tub\" scene.  It is a groundbreaking movie because it would become a source of many movie directors for the next two decades.<br><br>\nOne great scene is the \"bath tub\" scene which is a classic example of building up suspense until the final moment when the scene ends.  Another excellent scene is when the protagonist tries to escape outside and he goes back in as swarms of Sex zombies go chasing after him.  I consider this movie the beginning of a trilogy I call the 'sexual evolution'  trilogy. The trilogy starts out with Shivers(1975), continues with Videodrome(1983), and finishes with Crash(1997).<br><br>\nShivers(1975) would be a major influence for the scifi-action thriller The Hidden(1987), especially with the idea of a parasite entering a person's body and changing their entire personal behavior. Also influenced by Shivers were the Alien series(especially Alien(1979) which was made four years after Cronenberg's directioral debut) and there are a couple of examples of this influence.  First, the two movies involve parasites who go in and put out of a person's body as well as having acid for blood.  Second, They both take place in an isolated and high placed area with Alien(1979) taking place on a spaceship in the middle of nowhere and Shivers(1975) takes place on a apartment complex called the Skyliner Towers on the middle of an island that is isolated from the rest of Canada.","user":"eibon09","rank":[55,65]},{"title":"Influential debut for the great Cronenberg.","rating":7,"date":"7 March 2008","review":"The first big screen flick for Canadian horror master David Cronenberg was this skin-crawling B horror movie.<br><br>Residents of a high rise apartment building are being attacked by parasites that are turning them into crazed zombies with nothing but sexual assault on their minds! <br><br>Shivers is an effectively disturbing movie, not unlike most of Cronenberg's later horror classics. It's had a good hand in influencing later creature flicks. The story has a good premise and builds some terrific tension as it escalates to a great claustrophobic climax. What's clever about this movie is that most of the horror is suggested, we don't see the parasites much and their elusiveness just helps to create more tension. The makeup effects are decent for a low budgeter and the cast turn in some adequate performances, horror veteran Barbara Steele is a nice addition to the cast.<br><br>Shivers is a entertaining slice of B horror that manages to live up to its title well. A must-see for Cronenberg fans.<br><br>*** out of ****","user":"Nightman85","rank":[17,19]},{"title":"Intelligent social-commentary disguised as a lurid slice of pure exploitation; a great film","rating":20,"date":"20 June 2008","review":"For me, the best of Cronenberg's earlier works is an exercise in claustrophobic tension building, wrapped in a concept of pure exploitation, and all further used as an excuse for a wicked Buñuelian-like satire on the woes of contemporary consumer culture and the antiseptic nature of modern living. The way that Cronenberg creates this world of gated purification turned into a beacon for the very best of late twentieth century existence, only to then pull the walls down from within as the characters are turned into dribbling, sex starved deviants is not only an effective horror-film scenario - drawing on the prevalent notions of isolation and paranoia usually found in films of this particular nature - but also as a comment on the vapid, overwhelming sense of boredom that modern life, with all its consumer fads and soulless pursuit of social fulfilment can present.<br><br>Like the very best of these retro exploitation films, Shivers (1975) works on at least two distinct levels of enjoyment and interpretation, with the obvious shocker elements suggesting an even more warped take on the territory of Night of the Living Dead (1968) - with sidelines into the same kind of atmosphere created by John Carpenter in his subsequent Assault of Precinct 13 (1976) - while the more personal and psychological aspects of the script complement the more recognisable elements of horror in a way that creates a perfect symbiosis between presentation and form. Admittedly, the look of the film and the obvious limitations of the low budget might disappoint some viewers more accustomed to glossier, 21st century thrillers; whilst the once shocking elements of the film might even seem somewhat quaint, especially in light of the veritable pornography of violence in films such as Saw III (2006), Hostel (2005) and The Hills Have Eyes (2006). Nonetheless, I think many viewers more familiar with horror/thriller/science-fiction cinema of this particular period will still be able to appreciate what Cronenberg was trying to achieve with this depiction of violence and depravity; with the scenes and scenarios - especially in the film's frenzied final act - really going for the jugular in terms of outré shock spectacle and the subversion of traditionally wholesome, all American iconography.<br><br>The idea of a small band of survivors coming together in the name of self-preservation as an inexplicable horror affects those closest to them is still a well worn concept in horror cinema, and one that works incredibly well when combined here with Cronenberg's cold, Kubrickian vision of a sterile, social environment as sex and death become distorted amidst moments of stock exploitation, sly wit and a genuinely subversive sense of satirical absurdity. Though it is admittedly rough around the edges and lacking in the obvious prestige of films like The Brood (1979) and Videodrome (1982), I'd still take this over A History of Violence (2005) or Eastern Promises (2007) any day; with Shivers standing out as not only one of Cronenberg's very best films, but one of the most unique, unconventional and completely engrossing exploitations works of this particular cinematic period.","user":"ThreeSadTigers","rank":[15,17]}]