[{"title":"A bizarre love triangle - Henry II, Becket and God","rating":10,"date":"8 December 2007","review":"Richard Burton is \"Becket\" in this 1964 film starring Peter O'Toole as Henry II and John Gielgud in a small role as the King of France. King Henry creates a Frankenstein monster when he makes his best friend, Becket, the Archbishop of Canterbury, believing this will solve all of his problems with the Church. It's a decision he lives to regret. Becket finds that he loves serving God and is in his rightful place, living a life of prayer, retreat, and helping the poor and the needy. When he comes up against the King, his response is not what Henry expects. Becket now serves another master - God.<br><br>This is such a beautiful film, not only the sweeping landscapes and muted colors but the stunning, sometimes stark images throughout of the two men, the scene on the beach toward the end in particular.<br><br>\"Becket\" is a clash of two titan actors and historical figures. O'Toole and Burton, so different in their acting approaches, are a match made in heaven, with O'Toole playing Henry as a childish, selfish rogue in a very overt performance and Burton playing Becket with an internalized quiet strength and resolve. They are both magnificent. Both deserved the Oscars for which they were nominated; they didn't receive them. O'Toole would go on to play Henry II again in Lion in Winter, giving him an interesting place in cinematic history - he's the only actor to play the same character in two completely different films, neither one of which was a sequel or prequel (before you invoke the name of Al Pacino).<br><br>Much is made in these films of historical inaccuracies. What makes these period movies so wonderful is whether or not you watch them knowing much of the history, after you've seen them, you rush to the Internet to read more. I was most interested in the homoerotic aspects of the relationship between Becket and Henry - but none was mentioned in anything I read. It was, however, very apparent on the screen.<br><br>The '60s was really a time of these great historical dramas, similar to that period later on when Merchant-Ivory produced their many sweeping films. In a time of Spiderman and Transformers, these wonderful character-driven films are sorely missed. This is a particularly fabulous one.","user":"blanche-2","rank":[18,18]},{"title":"A meddlesome priest","rating":10,"date":"31 January 2006","review":"The tale of Thomas Becket has had many incarnations over time. T.S. Eliot's 'Murder in the Cathedral' is but the most recent acclaimed literary treatment; each revisitation seems to draw new elements forth from the story. Edward Anhalt won the Oscar for best screenplay (adapted from other material) for this film. This film shows Henry and Thomas Becket roughly equal in age (at variance from history, for in this time the age difference of 15 years is practically a generational difference). Becket is shown as being a guide to Henry, but less from a master/pupil standpoint as it is a clever diplomatic with a utilitarian and almost Machiavellian sense about him. Henry is presented as coarse and unrefined, uneducated and in need of assistance, but historically this is unlikely.<br><br>Becket is played admirably by Richard Burton; Henry II is portrayed by Peter O'Toole. Both were nominated for the best actor Oscar, but neither won. In addition to these nominations and the best screenplay award, the film was nominated for nine other Oscars, running the list from costumes, music, directing, best picture, and a best supporting actor nod for John Gielgud, whose cameo as the King of France is rather interestingly presented.<br><br>Indeed, the movie has a remarkable realistic feel to it, particularly for a film from the 1960s, when cinema was as likely to portray stylised and idealistic images of the past. The sets are in bare stone with a minimum of ornamentation, as would have been the case in Plantagenet times; likewise, the ceremony around the royal person is much less grand, and the church rather grand, which is both accurate and serves to highlight the underlying conflict of the story in the film.<br><br>Becket is portrayed as a man of ambiguous loyalties -- a man of principle who has yet to find principles worthy of loyalty. Finally, in the role of archbishop, he finds a calling from the honour of God (and in so doing is not unlikely many priests who see their path to ordination as the means of spiritual grace; indeed, many are disappointed that the faith does not come with the office). Whether Thomas Becket actually experienced a spiritual conversion that made him a strong champion of the church, or in fact saw the power of the church as a means to an end of dominating the country, we will perhaps never know.<br><br>In the film, Becket is often disparaged as being a Saxon; this is perhaps overstated, given his Norman lineage, which is never hinted at in the film. While he does not come from Norman nobility, he is far from being a simple Saxon. Burton's portrayal of Becket shows the change from worldly chancellor to spiritual archbishop in unsubtle terms. Even so, there is an ambiguity that plays out marvelously in both his performance, and the reactions of the other characters who constantly question his sincerity.<br><br>O'Toole's performance is not as polished as Burton's; when he plays an older, wiser Henry II in 'The Lion in Winter' four years later, the acting is much more dramatic and effective. It perhaps goes without saying that Pamela Brown does not make the same impression on the screen as Eleanor of Aquitaine as Katherine Hepburn does in the later film, but Eleanor is an incidental character in Becket in any case.<br><br>Music in this film is not a prominent feature -- various trumpet and brass flourishes announce events or major scene changes in parts; a lot of chant (long before Gregorian chant achieved popular status) accompanies church scenes -- indeed, I credit this film for giving me my first real taste of Gregorian chant. The scene with Sian Phillips as Becket's love Gwendolyen is accompanied by period string instruments -- again, Phillips is a remarkable actress who is under-utilised in this performance.<br><br>Done in a flash-back manner, there is a resolution in the film -- Becket is dead, made a saint, honour is satisfied as the King does penance, and the people are happy. We know what is going to happen, but then, anyone with knowledge of history would likely know the story already. In fact, Henry's reign was rarely without challenge, but he was always powerful, and much more effective after Becket's death than before. Reigning for nearly twenty years after Becket's death, he left a very powerful Western European coalition of lands that soon fell apart, and embroiled England and France in war for centuries later. The tensions between church and state carry forward to this day; while the specifics of the challenges faces Becket and Henry II are very different from issues today, the principle of the relationship between church and state is far from definitively resolved.<br><br>Also, the side-line issue of class warfare and racial prejudice (teased out with subtle nuance between the Normans and Saxons, who, ironically, look exactly the same on the screen) are addressed in an interesting, pre-civil rights sort of manner. This issue is never resolved in the film, as indeed it wasn't in the 1960s, either.<br><br>This is an intriguing film, with great acting and great production values, and an interesting story that, even if not completely historically accurate, does not alter the history so much that it becomes a parody of the subject.","user":"kurt_messick","rank":[73,86]},{"title":"Towering performances by 2 actors at the zenith of their powers.","rating":13,"date":"13 June 2004","review":"My comments here tend to be Misremembrances of things past. I know I saw \"Becket\" decades ago while I must have been suffering from a periodic bout of reviling Richard Burton. Having recently seen \"Cleopatra\" again, I will forgive myself. Still, there are movies that I've enjoyed - \"The Spy Who Came in from the Cold\" and \"The Night of the Iguana\", to name 2 - so I thought I'd give \"Becket\" another try.<br><br>Historical movies are among my favorites, although the IMDB parameter of not spoiling restricts me from discussing plot. But this is a movie that made me click on here to see who directed it...since directing Burton and O'Toole must have been like being a meterologist tracking a tornado and a hurricane. Their synergy is astounding...but whereas O'Toole launches himself on occassion into a thespian stratosphere it is Burton's performance that is incandescent. There are scenes...\"inner monologues\" - queries to God, where the ribald Burton is transformed into a man illuminated by a spiritual puzzle - he cannot believe that he is becoming who he is becoming - and it is Burton's challenge to share that bewilderment with us.<br><br>Well, I'm comforted that I can now stretch the glory days of historical film-making at least to \"Becket.\"  Any film in which John Gielgud, Martita Hunt, Felix Aylmer and Pamela Brown are \"supporting\" - how do I put it, \"supporting\" performances such as these are most other actors' triumphs. The costumes and sets are sumptous. Finis.","user":"edward-speiran","rank":[51,60]}]