[{"title":"The Plot/Jokes/Screenplay save the Day!!!","rating":10,"date":"27 February 2005","review":"Many would say if the Name \"Carry On Jack\" was mentioned, \"I haven't seen that one\" or \"That was terrible wasn't it.\" To many Carry On Fans..the film is often very underrated.This is due to a very large lack of regulars within it.<br><br>Sid James is not in it, nor is anyone common from the Hudis films such as Liz Fraser or Ted Ray.<br><br>This was in fact the first film \"written\" by Talbot Rothwell (though Carry On Cabby was screened first but written second).<br><br>The film i feel is a classic.The jokes come thick and fast.Many are quite visual! (wont spoil it for you!) Superb Performances from Charles Hawtrey, Jim dale (In the little part he plays) and Bernard Cribbens(in fact his first carry on outing!).<br><br>8.7/10","user":"dhsb58","rank":[18,21]},{"title":"No, *I* am Ensign Albert Poopdecker, RN.......","rating":9,"date":"28 June 1999","review":"As a fan of the entire Carry On .... series, I was always disposed to like this movie.  True, it had few regulars, but the script allowed the cast to shine.  Kenneth Williams gives his usual over-the-top performance as the anything-but-fearless Captain Fearless, Juliet Mills gives the most amusingly unconvincing impersonation of a man since Some Like It Hot, and Bernard Cribbins is great as the good-hearted, but woefully naive Albert Poopdecker.  Charlie Hawtrey plays his usual character as well as ever, and all in all the plot once more becomes just the backdrop for all the gags, double entendre, and slapstick we all expect and love from the movies we know so well.","user":"drummie","rank":[14,16]},{"title":"it looks great","rating":7,"date":"5 September 2008","review":"This Carry ON looks very impressive. The sets, the scenery and the costumes are first rate. It is also well written although I must say I did not find it very funny, there are not that many laughs but kids I think will love it.I have found it interesting that the carry on movies are no longer as funny as I recalled them as a child. The slap stick in the movie seems very much geared to kids. Australian audiences are in for a special treat when they see one of this country's most loved actors, the great Ed Devereaux as Hook, the pirate. He was in a few Carry on movies but in this one he has a rather lovely cameo. He also is clearly having a ball hamming it up... something this fine actor rarely, if ever did. There are fine actors in the movie such as Donald Huston who puts on a star turn. Then in an all too brief appearance there is the great Cecil Parker. England's great actor brings a great deal of class to the movie.Of course Hawtrey and Williams are as much fun as always but there are many new faces. This is a great idea because it added a bit of variety to the series. Its nice to have a change.Jim Dale has a small appearance and the \"taxi\" gag (Flintstones inspired?) is cute rather than funny. Juliet Mills is utterly delightful and as always does a great job in the film.Of course its really pushing the boundaries of belief that the crew actually thought she was a bloke. She made another light comedy called Nurse on Wheels... wish it was available on DVD. The real star of the movie is the great Bernard Cribbens who is absolutely brilliant. Cribbens was a great talent and so much better than the awful Kenneth Connor who was the weakest link in all the Carry on movies. Its lovely not to have him in Jack.","user":"petersj-2","rank":[9,10]}]