[{"title":"Touch of red... in glorious colour","rating":8,"date":"10 June 2009","review":"Ah, the glamour and pure entertainment of Golden age Hollywood! Shapely saloon queen is caught in the middle of the Wyoming cattle war and between two men: suavely villainous gambler and distrusting sheriff hero. Red-haired Maureen O'Hara, the star of the picture among unknowns, and her dresses blaze in gorgeous 1950's Technicolor, and routine western shenanigans between cattle kings and new settlers are enjoyably went through. Script by Polly James and Herb Meadow is just an excuse to show beauty of O'Hara's heroine and her rosy cheeks, the scenery and glorious colours. Bad thing? No, not at all, on the contrary. Dennis Weaver, Sheriff McCloud from my childhood, has a minor role.","user":"rose-294","rank":[11,13]},{"title":"An Above-Average But Predictable Horse Opera with Fiery Maureen O'Hara","rating":8,"date":"11 April 2010","review":"\"Tarzan's Magic Fountain\" director Lee Sholem's Technicolor western \"The Redhead from Wyoming\" qualifies as a thoroughly predictable but nevertheless entertaining, horse opera about a range war between trigger-happy cattlemen and homesteaders in the 1880s, with Maureen O'Hara at her fiery best. Indeed, Scholem's oater modified the Johnson County War which was immortalized later in the notorious, big-budget debacle \"Heaven's Gate.\" Mind you, the 1929 and the 1946 versions of \"The Virginian\" and \"The Ox-Bow Incident\" (1943) dealt with the Johnson County War, too. \"The Redhead from Wyoming\" appropriates one real life participant James Averell as its villain here. Furthermore, Averell's conspirator is his girlfriend. Like Averell's real-life wife, both were accused of cattle rustling. The Maverick law, true-life, old West legislation, ignited the conflict. \"Mrs. Parkington\" scenarist Polly James, with an uncredited assist from Herb Meadow, who penned 1956 \"Lone Ranger\" movie, wrote the screenplay from her own story. The dialogue ripples with memorable lines. James and Meadow don't squander a melodramatic second sic-king the heroine, the sheriff, the cattle baron, and the villain at each other. Sholem orchestrates the action with unobtrusive aplomb. Lensed by three-time Oscar-winning cinematographer Winton Hoch of \"She Wore a Yellow Ribbon,\" \"The Redhead from Wyoming\" bears a rough-hewn, frontier look despite being shot on the Universal Studios backlot. This medium budget oater boasts an adequate amount of gunplay during its larcenous, 81-minute running time.<br><br>\"The Redhead from Wyoming\" unfolds with the following narration that sets the stage for the showdown between both factions. \"When the territories of the great west were thrown open, men of all kinds rushed in. Most came to settle peaceably, lured by free land, gold, cattle. A man could begin a herd with a maverick, an unbranded stray on the public range. By putting his brand on it, he owned it. The cattle barons had started their great herds with mavericks. Now, they fought each settler who tried to do the same. They fought to keep the settlers off the public lands, drive them from their homes, destroy their towns. Vast ranges became the battlegrounds of cattle wars. When the Wyoming big ranchers found guns were not enough, they used the Maverick Law, a law through which they appointed themselves commissioners with power to rule on the ownership of every maverick branded. A commissioner's ruling could declare the settle a rustler, outlaw his brand, make his mavericks illegal to sell. Of course, there was no shortage of sharp-witted men who were quick to take advantage of the law.\" <br><br>Sholem backs up the narration with action footage before he shifts the scene to the town square of Sweetwater, Wyoming, where city slicker clad Jim Averell (William Bishop of \"The Walking Hills\") campaigns for the high political office of governor. Watching from horseback on the fringe is big-time cattle baron, Reese Duncan (Brooklyn-born Alexander Scourby of \"Affair in Trinidad\"), and he doesn't like a word that Averell utters. \"The Maverick Law,\" Averell avers, \"was designed to protect us all against cattle rustling. There is nothing in the law that says new settlers can't pick up unbranded cattle and call them their own. When a cattle commission was appointed to watch over brands and cattle that was for our protection, too.\" Duncan has had enough of Averell's speech and blasts a hole in his city slicker's hat. Sweetwater Sheriff Stan Blaine (Alex Nicol of \"Gunfighters of Casa Grande\") fires his gun and calms down everybody. This scene opens up when our leading lady, Maureen O'Hara, arrives by stagecoach with a gaggle of other fancy saloon girls. Kate Maxwell (Maureen O'Hara of \"The Quiet Man\") learns she is a part of Averell's grand scheme to infuriate Reece Duncan. <br><br>Averell announces his plans to turn ownership of the saloon that he has been renovating over to Kate. Now, everybody can enjoy music, high-kick dancing, and \"the straightest card game in Wyoming.\" Averell promises the homesteaders that they will have the bucks to blow, too. He adds with a dastardly gleam in his eyes, \"Kate's a cattle buyer now. She aims to buy up every maverick you can lay a rope on. Kate's got her own brand, and not some outlaw brand. She'll market your mavericks for you and there's nothing that Duncan and his Cattlemen's Association can do about it.\" Kate is already suspicious. The last time that she saw Averell was \"running out of Abilene like a jack rabbit\" leaving her to hold the sack. Duncan rides up and warns Kate not to buy any of his cattle. \"Anything you take from me has lead coming after it.\" As everybody disperses and Averell escorts Kate over to her saloon, they meet Blaine. Averell accounts for Blaine to Kate. \"He's just a drifter. Doesn't make any trouble, doesn't want any.\" In the saloon, Averell draws Kate a sketch of her brand: K Bar M. Kate wonders if the world isn't coming to an end. \"Not only is Jim Averell giving things away, but he's paying his debts.\" Indeed, Averell wants to woo Kate back into his arms. He explains if Reese Duncan is eliminated, he will become governor. Brags Averell: \"I'm going to make the whole territory of Wyoming my own private range.\" <br><br>Meantime, the nefarious Averell incites anarchy. He hires his own desperadoes to rustle Duncan's livestock. Eventually, Kate learns the truth but is powerless. Kate and Blaine meet. He explains he started drifting at age 13 after his entire family died in a deadly range war. Kate takes a shine to him. She tries to warn Duncan about Averell. James and Meadow provide everybody with an interesting back story. This good, old-fashioned western is a treat, especially the big finale in Sweetwater as well as in the saloon with Kate, Averell, and Blaine shooting it out.","user":"zardoz-13","rank":[8,9]},{"title":"Maverick, where are you going","rating":9,"date":"15 November 2009","review":"Okay, Maureen O'hara's dresses are over the top and half the cast in most scenes, seems to be thinking, \"why is she wearing that\". Still, the movie has some interesting qualities and good moments. First, we have a woman who not only looks pretty and sexy, but can ride fast, think and use a gun. The writer, Polly James, is probably responsible for the fact that we have an interesting and strong woman character in the lead, a refreshing change for a 1953 Western. Second, the film makes several references to Maverick. First Jeanne Cooper (36 years on the Guiding light soap opera later) gets called a maverick, then Maureen O'hara starts referring to Sheriff Stain Blaine as \"Maverick\". This was four years before the \"Maverick\" television series and probably this movie was an inspiration for it. William Bishop, as the heavy, Jim Averell, is a much more interesting character than the drifter Sheriff played by Alex Nicol. Bishop is also a better actor than Nicol. The plot twists are silly, but fun. For example, at one point, when you think there is going to be a battle between two gangs, the sheriff convinces everybody to throw their gun belts on a wagon. Surprisingly everybody does it. I just wondered how they were going to get the fifty or so gun belts redistributed back to their original owners when they left. There's some fun in watching Dennis Weaver (later \"Gunsmoke\" and \"McCloud\") in one of his earliest roles. He's fine. Also Jack Kelley who went on to play Bart Maverick in the television series is around in a slightly smaller part. Altogether, this is a rather pleasant 80 minutes. Maureen O'Hara, feminists and Western fans should especially enjoy it. Incidentally, costume designer, Edward Stevenson, went on to win an Oscar in 1960 for \"the Facts of Life.\" He designed costumes for over 190 movies. Guess, everybody has an off-day.","user":"jayraskin1","rank":[15,20]}]