[{"title":"More true than you might think.","rating":10,"date":"18 February 2005","review":"I went to Navy OCS (for ship drivers, not aviators) a year after this movie came out. A lot of us considered it one of the best movies ever made. Despite the fact that there is some serious license taken with reality, the movie captures the intensity and high stakes of OCS, and how people who barely know each other become bonded so quickly; how the least likely candidates sometimes become the star performers; how some people are changed beyond recognition by the experience. There was never a lack of old hands like Sid's father, telling you you had it easy because of some difference in the rules he didn't enjoy 10 years earlier. DOR is translated by Foley as \"drop on request\". In 1983, the terminology was DE, which meant dis enroll. I always wondered what happened to the candidates in my class who DE'd. The ones who graduated I kept running into in the fleet, sometimes in places like the Philippines. The most unrealistic thing about the movie was the premise that local girls want to marry officer candidates. Not so in Pensacola or Newport RI, where OCS was in those days. The locals actually called us behind our backs \"cockroaches\" because we wore all black and had to run away to our barracks by 10 pm. The second most unrealistic thing was the foul language. That comes later, in the fleet, but not in OCS. No we did not have martial arts duels. All in all, however, the essence of the experience, if not the specifics, is found in the movie. One of our marching songs went \"left right left right / you HAD a good job and you LEFT / you're RIGHT!\" We really did have nowhere else to go. I say 10 stars. The VHS version gets only 8 because of changes to the soundtrack songs.","user":"elvismanson","rank":[97,110]},{"title":"The best of its kind","rating":9,"date":"21 January 2014","review":"Released in 1982, \"An Officer and a Gentleman\" was the obvious inspiration of films like Tom Cruise's \"Top Gun\" and \"Days of Thunder.\" \"An Officer and a Gentleman\" was the first and best, by far.<br><br>The plot similarities are obvious: They all include the angry young man who needs to prove his gifting, the uncompromising mentor, the encouraging babe, the craft, the arena and the doomed buddy. In \"An Officer\" the angry young man is Richard Gere as Mayo, the mentor is Louis Gossett Jr. as Drill Instructor Folely, the babe is Paula (Debra Winger), the craft is aviation basic training, the arena is a Naval academy and the Puget Sound area of Washington (shot on location) and the buddy is Sid Worley (David Keith).<br><br>Thankfully, the film doesn't get bogged down telling the back-story of Mayo. Instead, it ingeniously shares his past in a matter of minutes at the very beginning. It's all we need to know to understand why Mayo is the way he is. And then we're off to basic training where he's tested. Does he have what it takes? Can someone as lowborn, aloof and un-trusting as Mayo make it as an officer?<br><br>Debra Winger and Lisa Blount shine here as Mayo and Worley's babes. Winger is alluring in a humble \"girl next door\" type of way (she out-shined Lynda Carter as Wonder Girl on \"Wonder Woman,\" which is hard to believe), but Blount is even more alluring -- yes, despite the negative aspects of her character. I'll just put it this way, she really fills out a pair of jeans, lol. <br><br>Both couples get intimate way too quickly, but maybe this is one of the flaws of the \"Puget Debs\" and explains why they have a problems getting marriage material, if you know what I mean. Besides this, time has to be condensed in a two-hour film.<br><br>BOTTOM LINE: If you're in the mood for a film of this ilk \"An Officer and a Gentleman\" is the best of the lot.<br><br>GRADE: A<br><br>INSIGHTS ABOUT THE ENDING (***SPOILER ALERT*** Don't read further unless you've seen the film):<br><br>An officer is a military leader. Drill Instructor Foley's job is to weed out those who can't hack it as an officer. It's an important job because people's lives in combat are dependent on the quality of the leaders and Foley takes his job seriously.<br><br>Foley rightly pegs Mayo as a lowlife loner from the outset -- a wannabe officer -- and therefore puts on the pressure. This is especially so on the one weekend where he has Mayo to himself. Foley does everything he can to make Mayo break AND quit, but Mayo doesn't. He breaks, indeed, but he refuses to quit on the grounds that he has no where to go. At the end of this scene you can see that Foley develops respect for Mayo (which you get a glimpse of earlier when Mayo does extremely well on the obstacle course).<br><br>Later, Mayo disregards breaking the record on the obstacle course (which he was definitely able to do) in order to encourage Seegar (the female recruit) to finally make it over the wall. Foley sees that Mayo's no longer the aloof and selfish loner he was when he rode in on his motorcycle. He's matured; he's developed character. It was already there, of course, but the boot camp training has brought it to the fore, and Foley sees it.<br><br>After Worley's tragic death, Mayo confronts Foley while he's drilling the platoon. Foley informs Mayo that they all know what happened and even tells him they're sorry about Worley. He didn't have to do this and it shows that Foley isn't just an honorable man, but also that he cared about Worley. After all, Worley was only one week away from graduating! In a sense, he was one of Foley's kids. In other words, Foley and the platoon were grieving too. But Mayo was closest to Worley and he's crazy with shock &amp; grief at this point. He insists that he's going to quit, to which Foley tells him to meet him for a fight. Sure, there's some testosterone in his words, but he actually does this out of respect for Mayo as a last ditch effort to keep him from dropping out.<br><br>And Foley doesn't \"kick his axx\", as some claim. It was essentially an even match and Foley barely walks off the mat, which is the only reason he technically wins. But that's inconsequential. The purpose of the fight was to run Mayo's steam out so he didn't make a rash decision in an obvious moment of grief &amp; anger. Foley accomplished his purpose. Once Mayo was no longer blinded by rage he makes the right choice and graduates.<br><br>This is why he thanks Foley at the end.","user":"Wuchakk","rank":[16,16]},{"title":"A Classic 20 years on...","rating":10,"date":"25 September 2004","review":"This movie has certainly survived the test of time, in that it can still provoke a happy yet poignant tear when everything turns out for the best in the end. And that really is the source of its appeal. <br><br>College graduate Zack Mayo (Gere) enlists in the Naval Officer Candidate programme to realize his ambition of flying fighter jets, and also to escape a haunted past of his mother's suicide and his alcoholic sailor father.<br><br>While training, not only does he have to survive the Drill Instructor (Gossett Jr) but he also recognises the solitude that has been holding him back his whole life. Throw Debra Winger into the mix as the girl looking for a husband amongst the class and David Keith as Mayo's best friend with his own problems, then you have this classic movie.<br><br>I have seen this movie many times and it never gets boring. Richard Gere is at his most powerful here and I don't think he's ever had a better role. The supporting cast is also solid, with Gossett Jr. firmly deserving his Academy Award and Winger proving once again that she is thoroughly underrated by Hollywood.<br><br>A firm 10/10 from me.","user":"staceym","rank":[49,54]}]