[{"title":"Entertaining, touching at times","rating":11,"date":"11 January 2003","review":"Very cute, with clever interweaving of cartoon and live action ( particularly for an older movie.  Lemmon does an outstanding job, as does Gerritsen.  Many endearing scenes, peppered with mostly good fun throughout.","user":"alopo","rank":[8,8]},{"title":"Not a masterpiece, but Jack Lemmon and Lisa Gerritsen are good","rating":17,"date":"17 March 2003","review":"Peter Wilson is a cartoonist who doesn't want to admit he is going blind. So he memorizes the eye chart, and when his eye doctor uses a different chart, he accuses the doctor of being unethical.  In the lobby after his eyes have been dilated and he is wearing dark glasses, he trips over Terry. Later, he and Terry meet when Peter has broken his glasses and almost gets run over trying to cross the street.  Terry takes Peter home and he meets her children.  Possible romance?<br><br>Peter's work goes downhill after he gets interested in Terry.  The proof: his book gets taken out of the front window at the bookstore where Terry works and replaced with her ex-husband's book of war photography.  Still, the relationship progresses, and most of the rest of the movie has funny moments involving Terry's children and pregnant dog, and the return of Terry's ex.  Toward the end the movie takes a serious turn, but that's okay because the characters are so likeable they don't have to be funny all the time.<br><br>Peter's drawings come to life several times in the movie, including in the opening credits.  There are several really good scenes where the drawings are animated, including one where Peter and Terry's ex have gotten too friendly for Terry to be comfortable with the situation and the two men have had too much to drink.  A 'real' war breaks out.  There is also a great scene with Terry's middle child Linda, where Peter's drawings have taken on a different meaning.  Several fantasy scenes are quite funny, including one where Peter's sloppy apartment looks perfect for a change (then reality comes back and it's more like Oscar Madison's place; a real ironic twist considering Lemmon is the neat one in 'The Odd Couple').<br><br>This isn't one of Lemmon's best movies, but it's not bad.  And Lisa Gerritsen is quite good.  I don't recall her having a speech impediment, but it seems to be an important part of her character, and she does it really well.      <br><br>This movie may have children in it, but younger children maybe shouldn't see some of the more risque material.  It's quite tame compared to today's movies.","user":"vchimpanzee","rank":[14,17]},{"title":"Unfulfilled comedic and dramatic quirks result in a peculiarly benign film...","rating":6,"date":"10 November 2009","review":"One of Jack Lemmon's most innocuous pictures. He plays a professional humorist in New York City, a cynic and confirmed bachelor quickly losing his eyesight, who thinks very little of marriage, women and dogs. How soon do you think it will be before bookstore manager (and marriage-minded divorcée) Barbara Harris gets him to the altar? She's got the dog, plus three kids and a puppy dog-like former husband, but what's in it for Lemmon? We are never sure what motivates him to take on this brood, to attempt winning over the children, to compete for attention with the ex-spouse. It isn't incredible that Jack should fall for Miss Harris (she's winsome and a little daft, despite an ugly hairdo), but it is fairly difficult to believe Lemmon's character would take this plunge--and there's nothing in the script to convince us otherwise. The production is colorful, the animation interesting (if not amusing) and the acting very fine (particularly by young Lisa Gerritsen), however the essence of a plausible story is missing. Based on the writings of James Thurber, screenwriters Danny Arnold (who also produced) and Melville Shavelson (who also directed) shift from satire to the more outré, silly kind of TV comedy without grounding the scenario in a bittersweet style of realism. As such, the movie is one-part comedy (with satirical inflections), one-part drama (with pathos) and one-part character study (disguised as a family's journey). It isn't any wonder the end results are cute, yet iffy. Shavelson, Arnold and Gerritsen had all previously tackled Thurber on the short-lived television series \"My World and Welcome To It\". **1/2 from ****","user":"moonspinner55","rank":[5,5]}]