[{"title":"Mad Max is 70's classic dystopian action film the film that became the first in the series that launches some awesome great sequels.","rating":7,"date":"3 October 2015","review":"Mad Max is 70's type of classic dystopian action film the film that started it all and became the first in a series that launches some awesome great sequels. Max Rockatansky is iconic hero till it's day he is a true legend. Mad Max settle Mel Gibson a sure path to superstardom this highly acclaimed crazy collide o-scope of highway of mayhem cinematically defined the post apocalyptic landscape. Featuring eye- popping stunts that are electrifying and very convincing and an authentically nihilistic spirit this unforgettable actioner from Director George Miller is pure cinematic poetry.<br><br>In the ravaged near future, a savage motorcycle gang rules the road. Terrorizing Innocent civilians while tearing up the streets, the ruthless gang laughs in the face of police force hell-bent on stopping them. But they underestimate one officer: Max (Gibson). And when the bikers brutalize Max's best friend and family, they send him into a mad frenzy that leaves him with only one thing left in the world to live for - revenge! Also staring Joanne Samuel,Hugh Keays-Byrne he later started in Mad Max: Fury Road as an Immortan Joe another villain. This actor is fantastic and makes TERRIFIC job of been one of the best villains in the movie history ever. Also starring Steve Bisley, this rugged race car of a film runs on comic book volatility... exhilarating, rowdiness and visual intensity. <br><br>I love this film not much as I love Mad Max 2: The Road Warrior and Mad Max: Furry Road but I still love it. The plot doesn't start until 1.hour ago after Max family is attacked and killed. I love Max's car V8 Interceptor, high speed chases action sequences, that I guarantee you want see in any Action film today. There is any cgi in this film I didn't see them at all. The chases between Max and Toecutter on a motorcycle is fantastic, the crash and death Toecutter scene is AWESOME. I love this movie, I love it. As an dystopian action film is a fantastic that remains a true classic till it's day. The film has one problem that is focusing on max and his love life which is drama that hurts the movie and the plot starts really slow in the film. And between the film becomes very boring. <br><br>The high speed chases on the road makes this movie interesting so that you don't fall asleep. I still don't get that hate for this film, some people are comparing Thunderdome to this film, clamming that is better than Mad Max is and this is the worst one and the weakest film in the franchise which is not. I highly disagree with all of the haters of this film. It Is still good so much better than Thunderdome ever was. I will always take this film over Thunderdome,I have tried many times to take this film as the best one in the series but I couldn't because it does have some problems. <br><br>NOTE: The film is not a revenge flick like some people are saying, it is a film about car and motorcycle gang on a road it is Australian post apocalyptic dystopian action film. 7/10 B-","user":"ivo-cobra8","rank":[94,102]},{"title":"Low budget classic that is now a genre landmark.","rating":8,"date":"4 March 2008","review":"Set somewhere in the future we are privy to a world where the roads are ruled by maniac gangs with souped up cars, and bikers that literally could come from hell. Trying to stop these marauding loons are the overstretched police force who themselves ride in exceptionally fast cars. At the front of this story is Max Rockatansky, a good honest cop trying to hold his own against the chaotic world that is forming around him. After his best friend is burned and left for dead he decides enough is enough and thinks about retiring from the service, but whilst on a vacation with his wife and child things go decidedly bad and Max becomes an avenging force of fury with devastating affect.<br><br>When evaluating this film I feel it really needs to be put into perspective just how brilliant a job director George Miller did with next to no cash to work with, in fact Miller edited the film in his own bedroom just to emphasise the low-fi nature of the beast. The costumes are excellent, the cast are terrific, with Mel Gibson as Max particularly impressive, and here we have villains to truly fit the word villainous, but it's the stunts and chase sequences that makes this film a rich rewarding experience. The opening ten minutes alone are pure adrenalin pumping genius, but the film as a whole delivers a crash bang wallop punch that has often been imitated since its release, but rarely bettered, and although the heart of the film is a simple revenge story, it grabs your attention and delivers right to the corking finale, 8/10.<br><br>Footnote: Region 2 Users should note that the bargain bucket Mad Max Trilogy flip pack set still contains the foolishly dubbed version of this film, incredibly stupid move from the American distributors.","user":"hitchcockthelegend","rank":[31,37]},{"title":"Mel's got a car and he knows how to use it.","rating":6,"date":"25 October 2010","review":"\"Look, any longer out on that road and I'm one of them, a terminal psychotic, except that I've got this bronze badge that says that I'm one of the good guys.\"<br><br>Mad Max is all about vehicle fueled vengeance. A young Mel Gibson plays a lawman in a near-future, gang infested Australia. His encounters with a especially vile gang result in a deadly attack on his wife and infant son, and the last act of the movie focuses on his single-minded payback on those responsible.<br><br>Mad Max is certainly low-budget, but the movie doesn't really suffer from it. It is dated, however, and so many movies with similar premises have been made in the last thirty years that this one doesn't make nearly as much of an impression now as it probably did back in 1979. Watching this is a near-requirement for fans of Mel Gibson, but for everyone else, it's a decent movie that should be seen more for its classic status than its current entertainment value.","user":"lewiskendell","rank":[27,33]}]