[{"title":"Check out the Ladies","rating":9,"date":"9 December 2001","review":"Not a bad film, Im sadly quite a fan of Andy Sidaris so i thought this was Ok. When i say this, I dont mean you wanna go comparing to Citizen Kane or something. But if you like; poor acting (to point where its funny), top heavy women, and script writing of an all together different calliber, then this is for you. The highlight for me (other than the naked beach scene) was the japenese wild mans origin story. Only let down - no Julie Strain!!","user":"cannibalfreak100","rank":[10,13]},{"title":"Hope Marie Carlton bids the Sidaris sagas farewell","rating":10,"date":"10 August 2011","review":"Donna (Dona Speir) and Taryn (Hope Marie Carlton) are back! After busting some cocaine dealers (who smuggle their stock in pineapples), our busty federal agent duo find themselves delivering a medical serum to an island for Shane Abilene (Michael J. Shane). Yes, another Abilene! Anyway, a storm causes the plane to mess up and they get way off course before landing on a deserted island. They get company quick though when a group shows up to locate some lost Japanese gold. And, of course, there is also some stranded Japanese World War II vet still living on the island. No sure why, but I enjoyed this much more than previous entry PICASSO TRIGGER (1988). Maybe because it was a bit more focused in the plot department, even though it is convoluted as hell. My mind was also reeling as this was my first \"wait, who is this guy again\" experience with director Andy Sidaris' roving band of players as Rodrigo Obregon is back for a third time as a new villain. Sidaris also capitalized on the Asian influence and cast James Lew and Al Leong is supporting roles. The end is the best with one of the funniest explanations/flashbacks from the Japanese warrior (who has terrible age make up). Naturally, the film is packed with nudity and Sidaris should get credit for what I believe is the world's most gratuitous airplane changing scene. Sadly, this marked the end of the road for Carlton in Sidaris-land and I'm genuinely sad to see the team of Donna and Taryn break up.","user":"udar55","rank":[6,7]},{"title":"What's lost is meant to be found (#4)","rating":26,"date":"26 May 2008","review":"\"Savage Beach\" has the most unusual story of the Lethal Ladies series. Instead of an over-equipped investigation with a plan, this is more like an accidental adventure. No Las Vegas night clubs or expensive sports-cars - \"Savage Beach\" plays on a lonely island where a gold treasure was lost in WW II, yet still guarded by an isolated Japanese soldier. Not a new story (I remember \"Who Finds a Friend Finds a Treasure\", 1981), but with Sidaris' attention grabbing techniques (from explosions to boobs) it works great. Our heroines, the two pilots Donna (Dona Speir) and Taryn (H.M. Carlton), make an emergency landing on that island after a storm (another rarity: bad weather in a Sidaris movie). More and more sinister characters arrive to make the island unsafe. Al Leong (who later played the helicopter pilot in \"Hard Hunted\") gets a good role as a tough bad guy. A situation that stuck to my mind is when the Leatherface samurai frees Taryn and explains later: \"I can't kill those eyes again\" - what a moment of poetry, folks! Oh, and would you believe a bloke who calls Donna \"bimbo\" survives the next few seconds? This is the 4th out of 12 Sidaris movies I reviewed (in chronological order), and one should note that after 3 successful pictures which he had financed basically from his personal money, Sidaris was offered a deal about 5 more which kept the Lethal Ladies series going. \"Savage Beach\" surely was an impressive start for this new... uh... pentalogy!","user":"unbrokenmetal","rank":[6,9]}]