[{"title":"An invisible man sequel worth seeing","rating":16,"date":"16 April 2003","review":"It took Universal Studios seven years to produce this sequel to The Invisible Man, but in some regards, it was worth the wait.  Geoffrey Radcliffe (Vincent Price) is an innocent man condemned to death for a murder he didn't commit.  At the last minute, Radcliffe's gal pal, Helen (Nan Grey), and the friendly mad doctor, Frank Griffin (John Sutton), decide the only way to save Radcliffe is by injecting him with the invisibility serum invented by Jack Griffin. Radcliffe's invisibility enables him to escape the gallows and easily elude the police led by the wily Inspector Sampson (Cecil Kelloway).  Radcliffe figures out the identity of the murderer but his behavior soon borders on madness, unsettling Dr. Griffin and Helen.  Should they continue to aid Radcliffe or rat him out to the constabulary?  Will Radcliffe remain sane long enough to clear his name or will the law have to gun him down like his phantom predecessor, Jack Griffin? <br><br>\nThis is a real rarity among sequels in that it is nearly as good as the original.  It's one of my favorites in this genre.  The story moves along briskly, features some intriguing scenes, and offers some occasional humor. The acting is solid.  The special effects though primitive by today's standards are still effective.  That doesn't mean it is without it share of faults.  Chief among them is why they didn't inject Radcliffe earlier instead of waiting till the day of his execution?  Or better yet, inject Helen, so she might solve the crime.  Speaking of solving the crime, Radcliffe uncovers the real murderer's identity much too easily.  Still, I would love to see Universal Studios remake this someday with a woman as the unseen protagonist/fugitive-Thandie Newton would be my choice.  But, knowing Universal Studios, I probably couldn't get that lucky.","user":"CommandoCody","rank":[18,20]},{"title":"Chills, Humor, Tenderness and Passion","rating":8,"date":"26 August 2006","review":"There are a lot of reasons why this 1940 sequel is better than the original INVISIBLE MAN. In the first movie, the Invisible Man was a dilettante, a haughty scientist who shot himself up with the invisibility drug \"for kicks.\" Claude Rains played the character with such a supercilious air that it was hard to care when he lost it all.<br><br>But in this well-written sequel, the Invisible Man is a true hero. Geoffrey Radcliffe is a wealthy gentleman with class, courage, and a sense of humor. Someone has framed him for murder, and with the help of his devoted girl friend and trustworthy company doctor, he sets out to make things right.<br><br>Vincent Price is perfect as Geoffrey. He gives this invisible man plenty of guts, along with goodness, humility, and a wonderfully self-deprecating sense of humor. When madness sets in, of course, Price can babble with the best of them. But this time around, you care. This is a man who ran his business empire for the benefit of the workers, a man who can tease his weeping girl friend about how \"lucky\" she is not to see his face.<br><br>Ladylike and innocent-looking Nan Grey is a horror legend for her bit role as the waif-like streetwalker in Dracula's Daughter. Here she gets to play the same gentle, sensitive type, only warmer and more womanly. Watching Helen Manson sit up all night watching over her suffering love, falling asleep in her chair, and fainting at the sight of his disfiguring bandages, you will fall in love with her yourself. It's easy to see why Geoffrey loves her enough to risk madness and death to be by her side, and why the villain was willing to stoop to murder for her sake.<br><br>Sir Cedrick Hardwicke is mostly remembered today for playing kindly, kingly old gentlemen in epics like THE TEN COMMANDMENTS. But here he is a ruthless, cold villain, a murderer who fights for greed and gain. The attraction to lovely Helen is only hinted at, just a glance here and a tender word there. But it gives just the right touch of depth and tragedy to an amazingly nuanced performance.<br><br>Just as many critics feel Dracula's Daughter was a deeper film than Dracula, so INVISIBLE MAN RETURNS may well be an improvement over the original classic.<br><br>Long live Universal Horror!","user":"Dan1863Sickles","rank":[24,28]},{"title":"Great Classic Sequel","rating":20,"date":"20 June 2003","review":"The Invisible Man (1933) stands alone as being the greatest adaptation of H.G. Wells' story because it follows the novel's storyline and captures the atmosphere of the original work.  The film also has the ability to polish some of the scenes with humor.  Like other Universal horror classics, it deserved and got sequels, and though the Invisible Man Returns was a lesser effort, it was far superior than any other attempt to remake the classic (the recently made Hollow Man was down right horrible and, yes, hollow.) The Invisible Man Returns begins by introducing us to the brother of the first film's invisible one who escapes prison using the formula his brother developed.  This is a far-fetched and awkward way to create a sequel, but once it's out of the way the rest of the film again captures the formula, fun and atmosphere of the original.  Followed with mixed results by The Invisible Woman (comedy), The Invisible Agent, The Invisible Man's Revenge and Abbott and Costello Meet Frankenstein (which features the Invisible One).","user":"SanDiego","rank":[19,22]}]