[{"title":"One of the better \"nature on the rampage\" flicks.","rating":12,"date":"12 April 1999","review":"\"Kingdom of the Spiders\" has earned a bit of notoriety in the 20+ years since its release, mainly because it features Captain Kitsch himself, William Shatner.  However, this is actually a decent, watchable (though somewhat intense) horror film.<br><br>\"KOTS\" was one of the numerous \"nature on the rampage\" films that (pardon the pun) swarmed into theaters in the mid to late 1970s, riding the successful crest of Steven Spielberg's \"Jaws\".  It seems to draw inspiration not only from that film (in that it is set in a small town that relies on a summer festival to survive), but also \"The Birds\" (an antagonistic romance between the two leads, a small town turned into utter chaos) and even \"Night of the Living Dead\" (the main characters ultimately wind up barricading themselves in a house to survive the onslaught).<br><br>The plot is typical: Shatner plays a veterinarian in a small Arizona town who is baffled by the sudden death of a seemingly healthy calf.  When he asks for help from a university, they send an entomologist, played by Bolling, who informs Shatner that the animal died from a massive dose of spider venom.  Sure enough, an investigation uncovers a massive \"spider hill\", a kind of giant ant hill inhabited by hundreds of tarantulas, in a local farmers' field, and many others are discovered later.  Bolling theorizes that the normally solitary tarantulas have banded together to find food since farmers have killed their natural prey through overuse of insecticides.  The hairy little devils show they have also become quite intelligent, as they carefully disrupt attempts to eradicate them, and ultimately invade the town.<br><br>Although the script is paper-thin at times, the special effects are well-done, giving the viewer a genuine \"this could really happen!\" feeling. Not recommended for those who suffer from real-life arachnophobia, but highly recommended for anyone looking for a good thriller.","user":"funnygy","rank":[23,25]},{"title":"Better Than It Seems","rating":11,"date":"11 June 2002","review":"Let's be perfectly honest. \"Kingdom of the Spiders\" is not a blockbuster. But, neither is it junk. It's where it needs to be -- director John \"Bud\" Cardos aimed to make an interesting, creepy film on the level of good and succeeded. It's not \"Arachnophobia,\" which aimed high as a summer blockbuster and didn't meet its lofty goals. But, if the American Film Institute (AFI) comes out with a list of the top \"nature goes wild\" films, I'd rank \"Kingdom of the Spiders\" in the top 10 with \"Them,\" \"Tarantula,\" \"Jaws,\" \"The Birds\" and \"Alligator.\" Of course, when you think about it, most of the \"nature goes wild\" films (\"Empire of the Ants,\" \"Grizzly,\" \"Beaks,\" \"Great White,\" \"The Giant Spider Invasion\" etc.) would actually rank among the worst films ever made.<br><br>\"Kingdom of the Spiders\" was actually a made-for-TV movie, although a few four-letter words make it into the film. There's a brief glimpse of the underside of Tiffany Bolling's left breast, which is tame compared to \"Melrose Place.\"<br><br>It takes place in peaceful Verde Valley, Arizona (\"A great place to live in\" as a radio announcer says). Ironically, the Arizona desert was also used for the 1955 classic \"Tarantula,\" as well as the 2002 spider flick \"Eight-Legged Freaks.\" The soundtrack (every song) is by country singer Dorsey Burnette. This is his only claim to fame, but the theme song will actually grow on you. Listen closely to the background music, then rent a copy of \"Tarantula\" and you'll hear the same notes.<br><br>William Shatner is actually a little more reserved here, playing a vet named Rack Hanson. That's him actually taking a blood sample from a calf, and he also corrals a steer so he can jab it in the butt with a real syringe (that the steer didn't kick him where it counts shows how much confidence Shatner had in the scene). He is perplexed by a series of animal deaths, especially the aforementioned calf, owned by Walter Colby (Woody Strode) and Birch Colby (Altovise Davis -- Sammy's wife -- in her movie debut). A sample sent to Arizona State University (breaking another Hollywood cliche by using an actual college). The college sends Tiffany Bolling up to explain that the calf died from a massive dose of spider venom.<br><br>From there we really get creepy. Hoke Howell -- the John Carradine of the 70's, 80's and 90's -- as a garage owner gets bitten by a pesky tarantula, which actually tries to chase him for another bite. Strode reveals a spider hill to Bolling and Shatner, which is abnormal because tarantulas are loners. A later scene involves a prize bull crashing out of its stall while<br><br>covered with tarantulas. It's so sudden it will make just about anyone jump.<br><br>It seems the tarantulas have gotten a little p***ed that overuse of pesticides has killed off their normal food supply. They decide to band together to fight back. After taking care of the domestic animal population, they turn on Man.<br><br>The movie has many aspects similar to \"Jaws.\" Verde Valley is a small town dependent on its county fair for its life. It even has a jackass of a mayor who doesn't want the fair tarnished. It features an enemy that is made to appear intelligent. And it has a recognizable cast of veterans that acts well enough to let the monsters be the real stars of the film.<br><br>The really creepy aspect of the film is the enemy. There are no real special effects. The scene where spiders get inside a plane that's about to bomb them with DDT is predictable, but the real beauty is seeing the tarantulas crawling all over the pilot's head and face. When the plane crashes into Howell's garage, that's all real stunt work. Another creepy scene involves the local sheriff telling a woman that her husband's been killed by tarantulas. As he does it, nearby, atop a fence, sits a tarantula. When the woman bursts out crying, the tarantulas turns and slowly crawls away, as if it was actually paying attention to the whole scene. I won't try to give away too much, but other creepy bits include a child on a swing just inches above a horde of tarantulas that seem to leap up to get at her. More tarantulas are inside a speeding truck. Still others get the jump on Shatner, who should get points for having them crawl all over his face!<br><br>The ending is really the kicker. Shatner, Bolling and a few others hole up in a lodge as thousands of spiders try to get in -- through open windows, through the air vents, through the kitchen stove vents, through the fireplace, even through the windows by weighing down the glass with their bodies. Meanwhile, in town, we see the panicked population running around, screaming, covered with tarantulas. I personally believe the screams were real since the spiders were real, though defanged. We see cocooned bodies everywhere. The spiders are all over the road, inside buildings and cars, just everywhere. Worst of all is that Tiffany Bolling discovers that foam fire extinguishers kill the spiders by coating their book-like lungs, but we viewers know there's not enough foam in Arizona to stop this invasion. It seems to only be delaying the inevitable.<br><br>A word to the wise. There is a painting shown at the end of the film and it does look cheesy now. But the concept it implies is what matters and that makes for one of the strangest and creepiest movie endings of all time.<br><br>Overall, the movie is good. It aims high, but not too high and it succeeds. It has a few flaws (noticeably why Shatner and company don't leap into a nearby RV and get the hell out of Dodge instead of waiting around for the sheriff to come back), but they're not too bad. Shatner, Bolling and Strode acquit themselves well (amazing for Shatner, too). Even the potential cliches are dispelled. In one scene, Bolling takes a shower and we see a tarantula crawl up and into her dresser drawer. She comes out of the shadows, sits down at the dresser and reaches into the drawer. Instead of screaming, she gently picks up the tarantula, pets it and takes it back outside (lucky tarantula). Another scene does away with Shatner's leading man role as he only gets a brief kiss with Bolling before the tarantulas turn his life into a living hell. His character panics just as badly as the rest of the cast and he even has to get his butt saved.<br><br>On a side note, the SPCA would go mad now, but all the spiders in the movie were real. They used 10,000 live tarantulas (!) for the movie. Even the ones that get coated with foam, get stomped, get run over by tires are real. All the ones one the people are real. Reportedly, the extras were paid double wages because they had to have spiders crawl all over them. Even the pilot of the plane that crashes had spiders on him and he had to resist the urge to just jump up and pull them off his face. The producers had to drug the calf and, later, the prize bull so they wouldn't freak at having spiders all over them and so they would collapse as if affected by the spider venom.<br><br>Also, George Lucas and Steven Spielberg were supposedly inspired by this movie and added that opening scene in \"Raiders of the Lost Ark\" where Indiana Jones and his companion go into the cave and get covered by tarantulas.<br><br>All in all, it's an very good film. I've watched it many times and I still sometimes get bugged out (no pun intended) when I fall asleep afterwards and feel a breeze across my body.<br><br>Rent or buy it, but just get it. Just don't try to compare it to \"Arachnophobia\" or try to make it into a classic. It's just a fun and creepy movie.","user":"pv71989","rank":[31,38]},{"title":"You are their prey!","rating":8,"date":"3 July 2014","review":"Top notch nature-on-the-rampage thriller takes its time getting started, but emerges a real grabber. It's extremely well directed (by John \"Bud\" Cardos), with lots of great animal action. It's solidly acted by a sturdy cast led by the almighty William Shatner. It builds to one hell of an intense \"Night of the Living Dead\" style climax, intercut with catastrophic scenes in the local town that makes one wonder how the characters can possibly hope to prevail. The onslaught of ferocious tarantulas is awe-inspiring.<br><br>The Shat, at his charismatic best, plays \"Rack\" Hansen, amiable small town veterinarian who calls in big city entomologist Diane Ashley (70s B movie hottie Tiffany Bolling) when faced with the death of rancher Walter Colby's (Woody Strode) prize calf. She realizes that the cause of death was injection of spider venom. Soon scores of tarantulas swarm through the desert, attacking humans and other larger life forms basically because the over use of DDT has eliminated the arachnids' normal food supply.<br><br>Shatner, Bolling, and the always excellent Strode are well supported by Lieux Dressler, David McLean, Natasha Ryan, Altovise Davis, Marcy Lafferty (Shatners' then-wife, playing his sister- in-law), Roy Engel, and Hoke Howell. The movie is nicely photographed by John Arthur Morrill on picturesque Arizona desert locations. The images of numerous extras covered with tarantulas - and webbing as well - is pretty chilling. There's a touch of \"Jaws\" in the screenplay by Richard Robinson and Alan Caillou in that the local mayor (Engel) doesn't want anything to hurt the success of the county fair going on. And the implications of that final shot are spooky.<br><br>A very fine movie of its type.<br><br>Eight out of 10.","user":"Hey_Sweden","rank":[10,11]}]