[{"title":"A big, lusty, brawling film of the Colorado Gold Rush","rating":1,"date":"1 December 2004","review":"\"Great Day in the Morning\" is a western from RKO in 1956. It takes place just before the Civil War and deals with Union and Confederate factions both trying to get some gold in Colorado in order to finance the war. Based on the novel by Robert Hardy Andrews, the film is quite faithful to the book. Robert Stack plays a southern gunslinger with cynical overtones. Virginia Mayo, a Technicolor knock-out, meets Stack on her way west and has a love/hate relationship with him. Ruth Roman is a hostess with cleavage in Raymond Burr's saloon and she falls like a ton of bricks for Stack. Burr plays a heavy and gives Roman a bad time. A highpoint of the film is a critical card game between Stack and Burr with Roman dealing the cards. Of course Mayo and Roman are fighting like crazy over Stack.","user":"wc1996","rank":[17,19]},{"title":"unconditional love or a love that works both ways?","rating":7,"date":"5 June 2010","review":"Jacques Tourneur had the talent for westerns to be like Anthony Mann or Budd Boetticher, but somehow something was missing in the script or the budget. This film starts very well showing the conflicts between people in Denver when the Civil War is just about to start. In a kind of incredible card game Owen Pentecost (Robert Stack) wins the saloon from Jumbo Means (Raymond Burr), He also gets involved with the men from the South, who want to take gold to the future Confederate army. But mostly, this is a romantic western, and here it excels with two of the most beautiful actresses of the fifties, Virginia Mayo and Ruth Roman. Virginia is Ann, a kind of cold beauty, who loves Owen, but at the same time hates him for his tough and selfish way of being. Ruth Roman is Boston, who is madly in love with Owen. Roman steals the film from Virginia, but whoever saw Mayo in Colorado Territory or Across the great Divide knows how great she can be. The high point of the film is when both women have an argument about the way they love Owen, Boston with unconditional love, and Ann with a love that has to work both ways.","user":"tmwest","rank":[16,18]},{"title":"Superior western by Tourneur","rating":8,"date":"9 May 2001","review":"This western starring the inimitable Robert Stack is quite good, overcoming a somewhat weak and syrupy script, which nonetheless contains some classic lines (my favorite is:  When I first stepped out into the world, a drunkard took one look at me and shouted: 'the elephant is loose!'  since then, an elephant has been my good luck charm.  What's the secret to your remarkable charm?  ANSWER:  A complete indifference to Elephants.\")<br><br>Not Jacques Tourneur's best film, but his direction is good and the technicolor outdoor fight sequences (especially the dramatic opening sequence, similar to that in Johnny Guitar) are beautiful.","user":"funkyfry","rank":[17,20]}]