[{"title":"splendid visuals, anticipating Miyazaki. Disney it ain't!","rating":9,"date":"27 April 2003","review":"Loosely based on the nineteenth-century classic \"The Witch\" by historian Jules Michelet, \"Belladonna\" tells the story of a young \"everywoman\" in a brutally repressive and exploitative feudal society; in her powerlessness she is gradually driven to ancient superstitions and satanic practices, and then accused, tortured and executed for witchcraft. This storyline provides for a pageantry of sado-erotic scenes. \"Belladonna\" hovers uncomfortably on the edge of pornography but the film is saved, and viewer bewitched, by the incredible wealth of imaginative visual flourishes. Yamamoto's style in this medieval story hovers between classical Japanese landscape painting and twentieth-century underground comics (western style and manga), conjuring up, with accomplished technique, his dark fantasies. Think of Disney's Fantasia, but with more visual variation of style, and dedicated to the themes of lust and cruelty. \"Belladonna\" is a very early masterpiece of Japanese anime, anticipating Miyazaki by more than two decades.","user":"leerssen","rank":[80,90]},{"title":"Belladonna of Sadness was the product of an animation studio that knew it was doomed.","rating":8,"date":"18 February 2008","review":"\"It becomes apparent early on when viewing Belladonna of Sadness that this film is quite unique. Certainly the first, and possibly the only animated film that might be classified in the pinku genre. But even though the film is supposedly animated, nothing seems to be moving at first. You instead see a series of elegantly designed still drawings depicting a harmonious wedding between a peasant couple in 14th century France, as a woman sings her narration in the soulful style of a 70s rock opera. This is the film's only joyous scene, as moments later the new groom is pleading with the local land baron to reduce the marriage tax he can't afford. The baron instead decides to exercise his \"droit de seigneur\" with the bride. It is here, several minutes into the film, that full animation is finally used, in order to depict the rape of the virgin bride with metaphorical imagery much more disturbing than what a literal depiction of the same events could provide. A sign of things to come, as this is only the first in a series of tragic events that push this woman, through desperation, into the world of witchcraft.\" ...","user":"iuasdhfu9","rank":[50,57]},{"title":"Visually and aurally incredible piece of cinematic art","rating":10,"date":"26 June 2016","review":"Wow. Sometimes something comes along that really genuinely blows me away and the viewing of this movie is one such very rare occasion. It's a film that was released in 1973 in an era when the adult cartoon was a new concept, typified by the likes of Fritz the Cat (1972), but Belladonna of Sadness by contrast attracted mainly negative criticism and it then seemed to more or less fall off the radar for many, many years. Having just seen it I can only say that this is a criminal state of affairs and that it is pretty seriously unfortunate, to say the least, that something so overwhelmingly artistically beautiful was disregarded and cast aside. The amount of artistic imagination and creativity on display here is pretty monumental.<br><br>Its regarded as a very early example of Japanese anime but it's like no other anime I have ever seen. While it definitely does have some material that would go on to be associated with the manga branch of Japanese anime, it is executed in a somewhat experimental manner. This is quite honestly more of an art film than an actual story. Many folks seem to have taken all manner of things away from this one in terms of its content, such as a feminist message and such. And while I agree that this is there, the sheer beauty of the artistry is so overwhelming that the contents of the story were completely overshadowed by the visceral sensory experience of watching this one. Despite its Japanese origins this one is set in the Middle Ages in Europe and it begins with a wedding of a young couple. The groom cannot pay the marriage tax so the baron exercises his 'rights' and rapes the bride. This trauma deeply affects the young couple and the woman turns to witchcraft.<br><br>Some may be taken aback by certain aspects of this one. Firstly, despite being an animated work, much of the story is told by still paintings and drawings. There are many elaborately detailed tableaux which the camera pans across and in so doing expands upon the narrative. There are many still pieces of art of varying styles, such as landscape watercolours, comic-book style figures and surrealism. These visual ideas are interwoven with early 70's styles such as psychedelia and transgressive underground comics. There are animated sections too, which make even more impact because they only appear every so often. There seems to be a general split where the narrative is depicted using stills and the inner working of the protagonists mind are animated. Consequently, this leads to the extended animated sequences being more dreamlike and surreal in nature. Accentuating all of this is an excellent soundtrack which works fantastically well with the imagery on screen. It's quite an eclectic score which features what could best be described as Japanese folk-pop and some out-and-out prog-rock.<br><br>As I said before, this isn't a film for everybody. Aside from its experimental approach, some may find the sexual content difficult. There are many examples of sexual imagery, although I wouldn't say it's exactly in erotic territory on account of its highly stylised presentation but also due to the disturbing nature of much of it. But despite the dark undercurrents to the material this is a film of enormous visual and aural beauty. In my personal opinion this has to go down as a stonewall classic and a great example of what the animated movie format is capable of.","user":"Red-Barracuda","rank":[28,33]}]