[{"title":"William Castle Classic","rating":7,"date":"16 June 2014","review":"Cyrus Zorba (Donald Woods) and his family learn they have inherited the house of his late uncle Plato. This couldn't come at a better time for the Zorba family as they are struggling with financial problems. However, once they move in they discover the house is haunted by ghosts that dear old uncle Plato collected from all over the world. Uh-oh.<br><br>Filmed in \"Illusion-O,\" William Castle never missed a beat with a good gimmick. This is a fun movie with no pretensions about doing anything other than entertaining you for eighty minutes. Charles Herbert was an enjoyable child actor with a good screen presence. Sadly this was his last credited film role. I guess the same fate befell him that would many other child actors. Donald Woods, decades removed from his leading man days, is very pleasant and likable in this. Lovely Jo Morrow plays the daughter Medea. Margaret Hamilton has fun with her Wicked Witch reputation here. The direction is solid, the music very nice, and the special effects are fun. Okay, they are relatively simple effects but still fun. Maybe it's not that scary but it sure is enjoyable. Way more entertaining than the gory CGI remake.","user":"utgard14","rank":[17,17]},{"title":"If You Believe...","rating":6,"date":"5 April 2004","review":"William Castle set out to make a fun, spooky, scarey picture for anyone who ever believed (or wanted to believe) in ghosts, and the result, 13 GHOSTS, is a marvelous and memorable little picture, that even after 40-odd years, still has creeps, scares, thrills and fun galore.<br><br>If at all possible, see it the way it was meant to be seen- - -with proper Ghost Viewers-(available with the DVD edition) -so you can experience Illusiono, by which you can actually see the ghosts in Ectoplasmic Color!<br><br>\nThe plot, acting and production values may be unsophisticated, but what matter?- -The important thing is THE GHOSTS- -and they are all there as promised, including the mysterious thirteenth ghost- -and a wonderfully familiar witch (who was delighted to play the part)- -<br><br>This is a great movie for kids (and adults) who love ghosts and spooky stuff, but are not at all ready (or desirous) of watching a movie full of gore, putrescent language or non-stop violence.<br><br>You'll remember the ghosts, the fun and the thrills, for years to come.","user":"Jweybrew","rank":[60,66]},{"title":"Loved this Vintage Movie!","rating":10,"date":"15 March 2012","review":"I actually loved this movie (and so did my six year old!)..... I watched it over and over again with him! The \"special effects\" are quirky and funny and clearly 1960's but that was the allure of the movie to me. It was Vintage Royalty Gold and I immediately became a fan of \"William Castle\" Movies. I loved many of the scenes: 1. Appearance of ghosts were quite strange and quirky. 2.The Seance, with the Ouiji Board gave me the chills...which was interesting, because the special effects were quite odd. 3. Then the diabolical, attorney who's trying to get the treasure from the bowels of the house who meets an untimely demise by being \"smooshed\" in a canopied bed that becomes a death chamber. (OK then....). Watch it...you just might like it.","user":"charmaine70","rank":[11,11]}]