[{"title":"Worthy sequel to \"Romancing the Stone\".","rating":20,"date":"20 November 2000","review":"This is a worthy sequel to \"Romancing the Stone\", although not as polished, with the featured actors already a little stilted after the first outing. It is probably significant that the following 15 years have not yet seen a further addition to the series, despite the star quality and charisma of the two leads who do play comedy well together, both in this truncated series and in the blacker \"War of the Roses\". The film suffers from a disjointed plotting, which appears to serve only to link together both some admittedly fine action sequences (a ground-based escape in an F-16 fighter plane, among them) and also the interminable arguments and subsequent reconciliations between Douglas and Turner.<br><br>Whilst certainly not reaching the heights of style of the original film, \"The Jewel of the Nile\" nevertheless provides a good rounded slice of action/adventure/romance entertainment, with some witty one-liners for DeVito delivered in his own inimitable style and featuring an endearing cameo from Avner Eisenberg as the mystical `Jewel' of the film's title who delivers his religious and philosophical pronouncements in a curious combination of the spiritual world and western pop culture.","user":"rgshanks","rank":[17,21]},{"title":"Great replay value","rating":18,"date":"18 April 2003","review":"There are two kinds of good movies: The movies that, because of one or more characteristics, win grammys, oscars, and much lauding by critics. Gladiator comes to mind. Great cinematography, plot, acting.<br><br>Then, there are movies, that, although they don't win critical acclaim, seem to find their way onto my TV much more than an oscar-winner. Princess Bride is a good one. Timothy Dalton's bid for a James Bond movie as well. And Jewel of the Nile.<br><br>Jewel of the Nile is not a stellar specimen of a film in any way. There are movies that are better filmed, better acted, better scripted, ones that don't have as many plot holes, whatever the comparison. It doesn't leave you in a state of deep pondering or leave you not wanting to go to bed for fear of your life. But it is a movie that I, and my family, put in when we want to watch something light, uninvolved, comical, and with actors we like to see. It's something to watch on a Sunday afternoon, over whatever sorry excuse for lunch I decide to have, and to go to sleep on the couch to. It's a good movie to put in and listen to while doing housework, homework, or another activity. It is full of great one-liners that find their way into conversation as well as a severe cheesiness factor in some parts(which isn't a bad thing).<br><br>Bottom line, I guess, is this: You will find movies that are of superior quality to this one. Ones that you will feel outweigh this one in every single way. All the same, I would highly recommend adding this movie to your cabinet (but purchase and view Romancing the Stone first) because every once in a while, you'll come back to the Nile.","user":"jinkywilliams","rank":[40,58]},{"title":"Not abysmal but not as good as the first one","rating":6,"date":"9 July 2011","review":"\"The Jewel of the Nile\" is a follow-up to \"Romancing the Stone\". It lacks the greatness of the original but it keeps the same spirit. This one has lots of adventure and action (even more than the original, and is also far more violent).<br><br>Robert Zemeckis didn't return to direct this one, but 4 of the same actors reprise their roles: Michael Douglas (who also produced it), Kathleen Turner, Danny DeVito and Holland Taylor. The rest of the cast is entirely different. There are plenty of new characters and new villains.<br><br>As the title says, this movie takes us not to Colombia again, but to the Egyptian deserts (in Africa, close to the Nile river). Exotic like the original's but a completely different scenario than the original's.<br><br>The main villain in this is Omar Khalifa (well portrayed by Spiros Focás). He is just as treacherous and dangerous as Zolo from the original film. Like Zolo, he fools Joan Wilder so that she falls in his entrapments. He pretends to be a good person, but he's a brutal dictator. But I do like Omar's Egyptian accent. He speaks with a charming accent. Funny that he plays an Egyptian when the actor is Greek, but then, Demis Roussos is a Greek who was born in Egypt.<br><br>Avner Eisenberg does a nice portrayal of The Jewel but the character has a mix of charm and silliness and isn't always lovable.<br><br>This film has some really funny and great sequences, but also has a large number of faults and does not possess the charm of the original. Therefore, it doesn't match the original's greatness.<br><br>Apparently Michael and Kathleen only made this movie because their contract forced them to. Kathleen even attempted to back it out but was threatened by 20th Century Fox to be sued with a $25 million lawsuit. Geez, that is just so wrong! They shouldn't have been forced to do something they didn't want. I sort of can see why they didn't want to do it and why Robert Zemeckis refused to make the sequel.<br><br>I used to like this movie almost as much as the original. But now it doesn't seem that great to me anymore. Looking at it now, many things about it don't make much sense. The original is a great blockbuster and a timeless classic.","user":"Atreyu_II","rank":[10,12]}]