[{"title":"Edward G. At The Top Of His Form.","rating":7,"date":"26 May 2009","review":"HOUSE OF STRANGERS is another classic from the Noir vaults of 20th Century Fox and is one of their very best. Under the guiding hand of the brilliant director Joseph L. Mankiewicz the film emerged in 1949 and remains to this day a remarkable piece of cinema! All credit must go to the excellent screenplay by Philip Yordan, the masterful low key black &amp; white cinematography of Milton Krasner and the atmospheric score by the Russian composer Daniele Amfitheatrof.<br><br>The stellar cast is headed by the great Edward G. Robinson. Fresh from his wonderful Johnny Rocco in Houston's \"Key Largo\" Robinson plays Gino Monetti, the Italian immigrant who runs the bank he founded in New York's lower east side. He runs it with an iron fist as he does his family of four sons who work for him. Three of whom are resentful of him because of the poor wages he pays them and the domineering way he treats them. Robinson's Gino Monetti is a deftly crafted and skillful piece of acting and with just the right Italian accent the actor once again demonstrates that he was one of the finest players in American cinema. Watching him here one can't help but think what a fine Corleone he would have made had he been around (he died in 1972 the year \"The Godfather\" was released)<br><br>Richard Conte, in one of his best parts, plays the loyal and favoured son Max Monetti with his trademark serious look and in his best oppressed hero style. The other siblings are played by Luther Adler as the oldest and meanest, Efrem Zimbalist as the ladies man and Paul Valentine excellent as a slow witted amateur pugilist. Romantic interest is supplied by the ever lovely and vivacious Susan Hayward whose star at this time was about to start its rise. But it is Robinson's movie from the moment he comes into it - you simply cannot take your eyes of him!<br><br>Five years later the studio re-fashioned Yordan's screenplay (itself loosely based on Shakespeare's \"King Lear\") and turned it into a splendid western called \"Broken Lance\" with Spencer Tracy. This fact is strangely omitted from any text on the DVD?<br><br>A curious footnote: At the end of the picture we don't hear Amfithetrof's finale music! What we get instead is the end title from Alfred Newman's score for \"The Razor's Edge\" (1946). Why and how this should be is anybody's guess! Apart from this sloppy denouement it is still a fine movie in a fine package which has a commentary,a trailer and a good behind the scenes still gallery.<br><br>Classic line from \"House Of Strangers\".......... When one of Robinson's errant sons declines to help his father during his trial - \"I'm sorry pop I don't want to stick my neck out\" to which Robinson wryly inquires \"Why - what's so good about your neck\".","user":"jpdoherty","rank":[32,36]},{"title":"Superb","rating":8,"date":"16 August 2006","review":"An Italian-American family is the subject of \"House of Strangers,\" a 1949 film starring Edward G. Robinson, Richard Conte, Susan Hayward, Luther Adler, Debra Paget, Hope Emerson, and Efrem Zimbalist, Jr. Being of Italian extraction myself, I actually thought this film was written by an Italian and was surprised to see it wasn't. It was dead on.<br><br>Edward G. Robinson is Gino Monetti, who owns a bank in the '30s. He runs it like he's selling items out of his garage, with lousy bookkeeping, some people being charged interest up front on loans and some getting more money than they asked for. He has four sons, three of whom he treats like second-class citizens: Pietro is a guard at the bank by day and an amateur boxer by night, Joe is a teller, and Tony is a clerk. When Joe, who married a woman from a good Philadelphia family, asks for a raise he was promised, he gets a lecture from Gino about how the family lived in the back of a barber shop when Gino made $15 a week. When Pietro loses a boxing match, Gino takes the jacket off of his shoulders that says \"Monetti Bank.\" Gino runs his home with more rigidity than he does his bank: His wife doesn't say much, and he has mandatory Wednesday night spaghetti dinners during which he plays opera recordings such as \"Il Barbiere di Siviglia\" starring Lawrence Tibbett.<br><br>Gino has a favored child, and that's Max, his lawyer son. When the Feds start investigating Gino, Max comes up with a solution. If all the brothers will take responsibility for the sloppiness at the bank, the Feds won't be able to pin anything on anybody. But the sons refuse to lift a finger to help their father, ultimately forcing him out and starting their own bank. Max goes to prison for attempting to bribe a juror, and when he gets out, he's bent on revenge against his brothers.<br><br>The acting is this film is nothing short of fantastic. Robinson is perfect as the dictatorial, ruthless Gino. Conte is totally believable as the favorite son - efficient and slightly to the right of slimy. Luther Adler gives a brilliant performance as the henpecked Tony. The rest of the cast is uniformly excellent. Susan Hayward plays Max's love interest, a woman who gives as good as she gets. She looks sensational and does a terrific job in her role. Stardom is right around the corner for her, and it's no surprise.<br><br>With a great pace kept by Joseph Mankiewicz, this is a film that I'm surprised we don't hear more about. It just goes to show that there were so many great films made in Hollywood in the past that even some marvelous ones are overlooked. \"House of Strangers\" is definitely one to see and remember.","user":"blanche-2","rank":[31,36]},{"title":"Every once in a while a great film comes along, and is somehow forgotten over a period of time...but is still well worth watching!","rating":31,"date":"31 May 2004","review":"This film appears in John Springer's movie book \"Forgotten Films to Remember\" by Citadel Press, and certainly lives up to it's name! It is a dark movie about the dysfunctional Monetti family. The late great Edward G. Robinson portrays Gino Monetti, the controlling patriarch banker father that rules his family with an iron fist. Richard Conte gives a sterling performance as the well meaning faithful son, Max Monetti. He takes a prison rap for embezzlement for his aging father. While he is in prison he helplessly learns that his brothers Joe (Luther Adler), Tony (Edward Zimbalist Jr., and Pietro (Paul Valentine plan to take over the family banking business. As a result of this his father dies. Max returns home from prison focused on revenge. Fortunately, Max's girlfriend (Susan Hayward)convinces him that the revenge he seeks is not worth it. Realizing that his father Gino was the real source of hatred and evil in the family, he decides to peacefully leave town with his girlfriend, but is soon confronted by his evil brothers. <br><br>Amazingly this 1949 film was re-made in 1954 as a Western of all things! The title of the re-make was \"Broken Lance\". Same story different setting. Spencer Tracy (Controlling Rancher Father) plays the Robinson (Controlling Banker father) part, Robert Wagner plays the Conte part (Faithful son), Richard Widmark plays the Adler part (Ambitious older brother), Hugh O'Brien plays the Zimbalist part, and Earl Holliman plays the Valentine part (strong arm brother). Both films share a powerful script and good performances. Worth seeing!","user":"wgie","rank":[34,43]}]