[{"title":"The Cost of Money","rating":12,"date":"12 May 2008","review":"L'Argent (1983) ****<br><br>This is a hard film to rate for any number of reasons. It is challenging for one, and not really a movie for another. L'argent is more a philosophical essay on celluloid than anything else. This could be said for any or all of Bresson's films for that matter. His style of film-making is not really cinematic. It is philosophical and, to quote Paul Schrader, transcendental. L'Argent is a tale about the evils of money and materialist ideology. Bresson has been spoken openly about his shock and fear at the ever increasing materialism in society. The film begins as a spoiled school boy is refused the necessary money by his father to repay a debt. He goes to a friend who gives him a counterfeit bill, which they then go off to spend. They go to a photo shop, and buy something cheap so as to get as much real change as possible. The woman sees that it is fake, but accepts it anyway so as to make the sale. Her husband, the owner, scolds her for it, but does not report it, and instead passes it off to an unsuspecting oil delivery man, Yvon. He then goes to a restaurant and tries to get a drink, unknowingly using the fake bill. He is arrested, and the shop owners and their cashier refuse to acknowledge the man not only got the bill from them, but was ever in the shop to begin with. From this incident Yvon's life spirals out of control. He is let off without jailtime, but the scandal costs him his job. He turns to a life of crime to make money. He gets thrown in jail, his wife leaves him, and his child dies. From here the film goes really out there, as Yvon becomes an axe murderer upon his release. It is certainly far fetched, but I think that may have been Bresson's point. The movie is a damnation of the costs of money (no pun) replacing the sense of God. Bresson once said that today there is no more God in the world, there is only money, which has become God. The film's total disregard for a plausible narrative and sense of restraint is frustrating. It is a short film, and it feels that way, as Bresson wastes no time getting from point A to point B. That is not to say that the film is not well directed though, it is superbly directed with the care and hands of a great master of the medium. It is difficult to comprehend why Yvon does what he does once released from jail by following any logical reasoning of the narrative, but that is the point Bresson wanted to make - the lust for money and material possession and the alienation and disenfranchisement from a purposeful existence causes people to do illogical and irrational things. Bresson uses this extreme (and i do not mean that lightly) example to highlight this. Bresson accomplished exactly what he was trying to do with L'Argent, and it is difficult to criticize him for that.","user":"MacAindrais","rank":[47,50]},{"title":"money is the root of evil","rating":8,"date":"18 July 2007","review":"\"L'Argent\" is Robert Bresson's very last film and a piece of work that went through a lot of financial problems to see the light of day. It was dismissed by many producers before being finally taken in hand by the Ministry of the Arts. At that time, Jack Lang was the ministry and his daughter served as a \"model\" for Bresson in the film where she is Yvette, Yvon's wife.<br><br>Sourced from a short story by Léon Tolstoï, \"l'Argent\" is first the assessment of a downward spiral for the main hero of the film, Yvon. Because he was given a forged note, this domestic oil delivery man will be caught in a chain of unfortunate events which will see him jailed, losing his cute, little daughter and wife before turning into a murderer. Through his decay, all forms of dishonesty, cruelty, injustice will be stated with money at their core, particularly in the first half of the film. Money is used for rewarding cowardice (the photograph who rewards his employee Lucien for his false evidence), for buying people's silence (Norbert's mother who gives the photograph's wife money to compensate her) and more generally, money is a God that makes Yvon's fate take a tragic dimension and drives a cruel, unfair world.<br><br>Its depiction is a perfect opportunity for Bresson to let his sparse, cold, neutral cinematographic writing shine. The more the film goes on, the more these epithets prevail with an accumulation of close-ups of objects, audacious elliptical sequences, a tightened editing and deliberately bland models who recite their texts and don't \"act\" it. Bresson's minimalist approach of this tragic story and harsh society amounts to a limpid harmony that inevitably brings an unshakable emotion and it's important to note down the moment when Yvon is put up by the old lady. These sequences are like lulls in Yvon's grisly fate and it's impossible to remain indifferent to the old lady's dreary way of life or when she's offered a few hazelnuts by Yvon. There's even a glimmer of hope when she pronounces the words: \"I would forgive to the rest of the world\".<br><br>It's true that Bresson's highly elliptical, straightforward style will leave many viewers baffled as there is no psychology or action but if you're sensitive to his unspectacular directing, you will realize that he pushed his art to the extreme to better get the audience involved in Yvon's woes. You can watch it only once but it will forever stay in your mind.","user":"dbdumonteil","rank":[26,31]},{"title":"A Great Film That Needs Close Attention...","rating":10,"date":"16 June 2004","review":"Robert Bresson tells the story of a handful of people who are manipulated by greed for the key component of capitalism: Money (originating in the form of a counterfeit bill, I'll also tell you it's based fairly loosely on a Tolstoy novella \"The Forged Note\"). A disturbing series of events change the lives of a few individuals and signifies how such a system can rot a human being to their core. Emotionally I connected with this film very strongly, at some points it made me sit up in my seat and shake my head in amazement. However, Bresson's directing style is very different from most. He'll pause and hold moments in time expecting the viewer to stay with him. He'll also decide to leave out parts of a film that most would deem very important (generally, he avoids showing too many scenes that are similar to each other) which can be confusing. But when it comes to paying attention to this film, you'll get much more than you give... I go back to this movie every now and then and find something new to love about it. Rating? easily 10/ 10.","user":"Steven_Harrison","rank":[38,53]}]