[{"title":"Stunning in simplicity--yet a film that offers food for thought","rating":9,"date":"9 December 2006","review":"This is a major work of cinema. It might not be well known but this film ranks with Fellini's \"La Strada\", De Sica's \"The Bicycle Thief,\" or Mrinal Sen's \"Oka Oori Katha\" based on Premchand's story--\"Coffin.\" Why is it a major work? A UCLA graduate makes a film far removed from Hollywood approaches to cinema in Iran during the Shah's regime. The film was made 10 years before Shah quit Iran and was promptly banned. It was smuggled out of Iran to be shown at the Venice Film Festival to win an award, even without subtitles.<br><br>The film does not require subtitles. It's visual. It's simple. The story is set in a remote Iranian village, where owning a cow for subsistence is a sign of prosperity. The barren landscape (true of a large part of Iran) reminds you of Grigory Kozintsev's film landscapes as in \"Korol Lir\" (the Russian King Lear) where the landscape becomes a character of the story.<br><br>The sudden unnatural death of the cow unsettles the village. Hassan, the owner of the cow, who nursed it as his own child, is away and would be shocked on his return. Eslam, the smartest among the villagers, devise a plan to bury the cow and not tell the poor man the truth. Hassan returns home and is soon so shocked that he loses his senses. He first imagines that the cow is still there and ultimately his sickness deteriorates as he imagines himself to be the cow, eats hay, and says \"Hassan\" his master will protect him from marauding Bolouris (bandits from another village). Eslam realizes that Hassan needs medical attention and decides to take him to the nearest hospital. He is dragged out like a cow. \"Hassan\" is beaten as an animal as he is not cooperative to the shock of some humanistic villagers. The demented Hassan, with the force of an animal breaks free, to seek his only freedom from reality--death.<br><br>The film stuns you. Forget Iran, forget the cow. Replace the scenario with any person close to his earthly possessions and what happens when that person is suddenly deprived of them and you will get inside the characters as Fellini, De Sica or Sen demonstrated in their cinema.<br><br>Every frame of the film is carefully chosen. The realism afforded by the story will grip any sensitive viewer. There is a visually arresting use of a small window in the wall of the cowshed through which the villagers watch the goings on within the cowshed. The directors use of the window serves two purposes--it gives the villagers a perspective of the cowshed and the viewer a perspective of the cowshed watchers.<br><br>The film is also a great essay on the effects of hiding truth from society and the cascading fallouts of such actions.<br><br>But there is more. Director Mehrjui affords layers of meaning to his \"simplistic\" cinema. There is veiled criticism of blind aspects religious rituals (Shia Islam), a critical look of stupid villagers dealing with their village idiots, the jealous neighbors, the indifferent neighbors, the village thief--all elements of life around us, not limited to a village in Iran. The political layering is not merely limited to the poverty but the politics of hiding truth and the long term effect it has on society. Ironically, there are values among the poorest of the poor--the hide of a \"poisoned?\" animal cannot be sold!<br><br>I was lucky to catch up with the rare screening of this film at the on-going International Film Festival of Kerala, India, that devoted a retrospective section of early Iranian cinema.<br><br>This is a film that should make Iran proud. It is truly a gift to world cinema.","user":"JuguAbraham","rank":[70,77]},{"title":"A film not to be forgotten","rating":10,"date":"30 July 2007","review":"Iranian director Daruish Mehrjuti's 1969 masterpiece is an all too forgotten work of film-art in the canon. The piece explores inter-community relationships and the life changing forces of nature, what ties man to his surroundings, better than any contemporary American film could, and as so few American films have. The film follows Hassan, an Irani peasant, who owns the only cow in his village. The tight frames and slow pacing reveals a special relationship between Hassan and his cow. Which creates an especial pressing moral dilemma for the town when they discover the cow dead while Hassan is away. What follows is a dark harrowing vision of the depths of the human psyche and man's dependency on nature for survival. Shot in harsh black and white, it takes on the luscious countryside of Iran and the strength of community and the fallibility of human kindness. Hassan's journey is an engaging, dark tale that has been lauded as a controversial film at Cannes and a difficult digest for modern viewers. But few films pack the emotional intensity of Mehruji's film.","user":"hereontheoutside","rank":[17,19]},{"title":"Surreal","rating":9,"date":"4 July 2009","review":"This movie is about as far as one can get from Hollywood blockbusters. Its about a cow. About a cow and a very loving owner. And what happens to them ultimately. There's melancholy and madness in the tragic ending. But the movie also scales new heights in the bonding between human and animals, in this case, a cow. The camera has been used is a surreal way. Shadows and people mix creating a spookiness which adds to the oddity of the general environment depicted. There's very palpable tension in the movie, created by the elements related to the cow and the three shadowy thieves who perhaps symbolize lawlessness. What also struck me was the looming silence of the black burkah-clad women and occasion glimpses of their crinkly faces. All very surreal. There are some very interesting personalities which come alive through the script, other than the cow of course!","user":"lyrxsf","rank":[11,13]}]