[{"title":"The Night of the Hunter","rating":9,"date":"21 February 2005","review":"THE MOST DANGEROUS GAME (RKO Radio, 1932), directed by Ernest B. Schoedsack and Irving Pichel, from the short story by Richard Connell, is a highly suspenseful drama with a neat twist in theme. But for the benefit for those who have never read Connell's original story nor seen the movie, this is something to really consider, especially for action and adventure fans. Categorized as a horror film, the only horror is the thought of a hunter being the hunted, especially by a crazed individual.<br><br>The story begins with an explosion and the sinking of a yacht with Robert Rainsford (Joel McCrea) becoming the sole survivor of the perished crew. He swims to safety on a remote island and soon encounters an ancient mansion where lives the Russian Count Zoroff (Leslie Banks), and his muted servant, Ivan (Noble Johnson) and Tatur (Steve Clemento). After getting into some dry clothes, Rainsford is introduced to Zoroff's other guests, Eve (Fay Wray) and her brother, Martin Trowbridge (Robert Armstrong), also shipwreck survivors. Gathering in the living room, Zoroff discusses his interest in game hunting, but instead of hunting animals, which now bores him, he hunts his new interest - a most dangerous game. Later that night, Zoroff has made the drunken Martin his latest prey, and after returning from his all night hunt, Zoroff shows Eve and Rainsford his trophy room, consisting of human heads and corpses, with Martin's body being among them. Because Rainsford is a noted author and hunter, Zoroff wants him to go game hunting with him, the hunting of man. Refusing to take part in his mad scheme, Rainsford, in turn, becomes Zoroff's next prey. Zoroff promises that if Rainsford eludes him until sunrise, he and Eve are set free, and if he doesn't, gets to recapture Eve alive, since he doesn't hunt the \"female animal.\" Being given a 12 hour head start for preparation, Rainsford, with Eve's help, works against time using his brains instead of his feet to try and outsmart the hunter, but after midnight, the hunt begins, with Zoroff's tracking them down with weapons ranging from bow and arrow, rifle, and, as the last resort, the release of his vicious dogs, climaxed by surprises for both hunter and the hunted.<br><br>THE MOST DANGEROUS GAME ranks one of the very best stories ever transferred on screen. In spite of alterations to Connell's original story, such as adding a female to accompany Rainsford, this adaptation is a fast-pace 65 minutes that never lets up for a minute. The first half hour devotes itself to character study, with Robert Armstrong's drunken performance somewhat slowing down the pace instead of providing humor. However, second half of the movie is tight on suspense, with the camera capturing every move and reaction from the three central characters, with Max Steiner's underscoring setting the mood and pace. Of course there's plenty of close calls and near misses to add to the excitement, making this a well staged and truly memorable experience after it is all over. What makes THE MOST DANGEROUSGAME worthy is the uncanny performance of British actor Leslie Banks, in his Hollywood debut, hamming it up to perfection, making his insane hunter come to life as intended by the author. Closeups of his eyes during the hunt is truly effective. If the jungle settings look familiar, it's the same set used for the much more famous adventure, KING KONG (RKO, 1933), that also features Fay Wray and Robert Armstrong.<br><br>While Joel McCrea has been on screen since the silent era, starting from small roles to the elevation of leads, THE MOST DANGEROUS GAME showcases him to best advantage, but cannot take away from the performance of Leslie Banks. While never a high rank leading man, McCrea did become a Hollywood survivor, better known for westerns, retiring from his successful career by 1962.<br><br>THE MOST DANGEROUS GAME was remade as A GAME OF DEATH (RKO, 1945) with John Loder and Edgar Barrier; RUN FOR THE SUN (United Artists, 1956) with Richard Widmark, and recycled numerous times, but none have captured the greatness to the 1932 original. It's also interesting to note that the theme was used as the basis in one of the better episodes to the comedy series, GILLIGAN'S ISLAND, titled \"The Hunter\" with Rory Calhoun guest starring as the title character who hunts people, namely Gilligan (Bob Denver).<br><br>Once regarded a \"lost\" movie, a print of THE MOST DANGEROUS GAME was discovered in the 1970s, and introduced to the small screen for the first time on public television in 1976. Prints shown in its initial premiere were crystal clear, but sadly, by the early 1980s, in the wake of home video, transfers circulated by distributors had that third to fourth generation look. A public domain title, it's unfortunate that a movie as good as this couldn't be available with better better picture quality. Aside from TV showings on various cable channels such as Nostalgia Television, and currently on some public TV stations after the midnight hours, THE MOST DANGEROUS GAME had yet to be shown on any commercial free classic movie channels until Turner Classic Movies aired it on June 28, 2007, but because of its reputation, continues to circulate in the VHS and DVD markets to a very favorable audience. An instant classic not to be missed. (***)","user":"lugonian","rank":[71,80]},{"title":"Working Up to \"King Kong\" With Style","rating":8,"date":"12 July 2004","review":"Films from the 1930s often featured imaginary and exotic worlds brought to life on sound stages.  For us today the sets are unreal, creations of both limited imagination and limited budgets.  Most of those movies are justifiably in the \"B\" range.  A few aren't and among those is the relatively little seen \"The Most Dangerous Game.\"<br><br>Joel McRae is globetrotting big game hunter Bob Rainsford on a yacht bound for exotic adventure.  Deliberately misplaced channel lights cause the vessel to hit rocks and founder.  Only Rainsford survives to drag himself onto the shore of a nearby island.  To his surprise the island is dominated by an eerie mansion owned by Count Zaroff, Leslie Banks.  A Cossack attended by a retinue of his countrymen, Zaroff exudes silken hospitality and refined culture.  Already there as guests are two people from a previous shipwreck, Eve Trowbridge, Fay Wray, and her perpetually drunken brother.<br><br>Zaroff is the film version of that familiar figure from Russian literature, the eternally bored aristocrat whose anomie can only be defeated by extreme diversions.  In Zaroff's case it turns out that he, a skilled huntsman since boyhood, is only brought to vibrant life by stalking and killing the most dangerous prey - man.<br><br>Zaroff offers Rainsford a deal he literally can't refuse.  Escape being slain by the count by outwitting him for a number of hours and he goes free. Eve elects to accompany the intrepid hunter on his journey through impenetrable backlot settings. Romance is in the humid air.<br><br>Zaroff is, of course, evil but he's also oddly sympathetic.  What's a count to do when he can buy anything and only the most extraordinary hunting will bring him happiness?  In that light his trophy room becomes understandable, his bloody diversion almost sympathetic. Banks is very effective in this role where he swings between culture and carnage.<br><br>Directors Irving Pickel and Ernest B. Schoedsack made \"The Most Dangerous Game\" on the same sets they'd employ a year later for the universally revered \"King Kong.\"  This film is only 63 minutes long indicating they intended it to be a second feature.  What they got was a truly engrossing movie with Fay Wray and Joel McCrea turning in first-rate performances.  Max Steiner's score is excellent (did he ever compose a bad one?).<br><br>Released on DVD by Alpha Video, it's both a bargain and a pleasure.<br><br>8/10","user":"lawprof","rank":[46,54]},{"title":"The Grandfather of them all!","rating":10,"date":"4 November 2003","review":"The second most used plot device (boy meets girl is the first) happens to be one of my favorites, Man Vs. Man. The Most Dangerous Game (based upon a short story) is about an eccentric hunter who has hunted every single animal there is to hunt except one. Man. On his tropical island surrounded by dangerous coral reefs he seeks out prey so he can add them to his trophy case. That is until the day he happens to meet the world's most famous big game hunter. This excellent film was shot by the same crew that was shooting King Kong (both films nearly have the same cast) Between takes they would shoot this one. If you want to see where it all started, then this is it!!<br><br>Highly recommended.<br><br>A+","user":"Captain_Couth","rank":[37,44]}]