[{"title":"Dana and Her Two Guys","rating":7,"date":"23 September 2005","review":"Despite the imposing title D-Day the Sixth of June which might lead one to believe it is an account of the Normandy invasion. It is in fact and old fashioned war romance. For Robert Taylor this was a throwback picture, back to the kind of romantic stuff he did in his early days of being MGM's number one pin-up boy. <br><br>Dana Wynter has Richard Todd as her steady beau who's gone to war just as America's gotten into it via Pearl Harbor. Todd goes missing in action and Wynter in her best British stiff upper lip style goes to help in the war effort herself as the Nazis loom perilously close to the island kingdom.<br><br>Robert Taylor gets to be one of the first American officers assigned over in Europe and Wynter and he meet via an altercation her father, John Williams, has with some bumptious GIs. Wynter diplomatically smooths things out and she and Taylor develop a relationship. It can't really go anywhere because Taylor's married. But they're both in need of each other at the moment.<br><br>Curiously enough this does parallel the situation of the Supreme Commander Dwight D. Eisenhower who carried on an affair with his British driver Kay Summersby. Ike of course was married and Kay was a war widow.<br><br>Todd does make it back and that does complicate matters. All this in the shadow of the impending cross-channel invasion.<br><br>Richard Todd had a promising career during the 1950s. He became well known to American audiences via his appearance in some Disney films and other American productions. Strangely enough it seemed to halt in the following decade and the international stardom that beckoned never came to fruition. He was a fine player capable of a wide variety of roles, even being a villain in a Hitchcock film. But I personally like him best as a hero.<br><br>And a genuine hero he was. He was actually at D-Day as a British Commando and won a whole slew of medals. Bob Taylor also was in the Armed Forces in World War II, he did three years in Uncle Sam's Navy in the Pacific.<br><br>Dana Wynter I've always thought of as a British version of Ava Gardner. And she had the talent to match. She also should have had a bigger career. I would say her beauty is regal and lo and behold she actually made that statement true when she portrayed Queen Elizabeth II in a film about Charles and Diana. <br><br>For war picture fans there's still enough action to satisfy. The only other role of real significance was Edmond O'Brien as Taylor's boss at the Supreme Headquarters Allied Expeditionary Force. Another reviewer said his role was not developed well. I wish it had been myself. But it probably would have taken away from the romance.","user":"bkoganbing","rank":[25,26]},{"title":"Romantic Melodrama With An American Bias","rating":5,"date":"10 January 2005","review":"It's rather strange watching D DAY THE SIXTH OF JUNE in 2005 because what strikes you is that it's a war movie made with a female audience in mind . Maybe it wasn't so strange at the time because a large proportion of the female population in Britain at the time could probably relate to having both a British boyfriend and an American lover on the go at the same time , but still the thought of a war movie marketed towards women seems somewhat bizarre since it's a genre most females seem to dislike . For example has anyone seen the comments on BLACK HAWK DOWN from teenage girls confessing they went to the cinema simply to see Orlando Bloom and had to endure two hours of on screen carnage ? <br><br>My problem D DAY THE SIXTH OF JUNE is that it's an American movie . Nothing wrong with that since the Yanks make better films than anyone else but since it's based on actual events it's a very poor history lesson . For example we cut via flashback to a radio broadcast in 1942 stating that because of American involvement in North Africa the campaign was now a foregone conclusion . I will state truthfully that Britain couldn't have won the second world war without American assistance , but we won the Battle of Britain without American assistance and in 1941 British Commonwealth forces numbering 36,000 managed to hold back an Italian army numbering 400,000 in North Africa , while the decisive battle in the region at El Alamein was an entirely British commonwealth victory save for some equipment that was made in America . Watching this movie you're led to believe that the Brits didn't have a clue what they were doing unless they had expert help from Uncle Sam . Britain spent almost two years alone fighting the Axis powers , which is not something you'd learn from this movie <br><br>There areone or two good points . One is Richard Todd's performance as a British para . Todd spent the second world war as an officer in the parachute regiment and took part in the D Day landings himself so he gives method acting a whole new meaning , though his character isn't on screen as much as he should have been . Despite being filmed 50 years ago the long awaited battle scenes are good and must have been outstanding in their day , and lastly despite having an American bias this movie occasionally points out the Canadian contribution to the Second world war something that THE LONGEST DAY negates somewhat","user":"Theo Robertson","rank":[28,32]},{"title":"D-DAY THE SIXTH OF JUNE (Henry Koster, 1956) **1/2","rating":6,"date":"8 April 2006","review":"Another big-budget WWII adventure, filmed in color and widescreen by Fox in the '50s - and a misleadingly titled one, as it barely concerns the crucial 1944 Normandy invasion it references (not surprisingly Fox returned to this subject, and tackled it much more comprehensively, in THE LONGEST DAY [1962])! As a matter of fact, the film's one genuine battle sequence, while quite well done, occurs only after having gone through some 80 minutes of incessant talk; the bulk of this footage is devoted to a romantic triangle, told in lengthy flashbacks, which comprises American Robert Taylor and Brits Richard Todd and Dana Wynter, plus a rather irrelevant subplot involving maverick Colonel Edmond O'Brien! That said, the film is glossily proficient and remains highly watchable as the kind of unassuming entertainment turned out on a general basis by Hollywood in its heyday...","user":"Bunuel1976","rank":[18,21]}]