[{"title":"Watchable Western with energetic performances!","rating":7,"date":"22 November 2000","review":"\"Seminole\" is set at Fort King, in the Florida, territory of 1835, where West Pointer Lieutenant Hudson is charged with the murder of a sentry...<br><br>At the court-martial he recounts his story: the wary co-existence between the settlers and the Indians was threatened by the strict commander (Richard Carlson) of the Army fort... Hudson's childhood sweetheart, Barbara Hale, agreed to meet with Osceola (Anthony Quinn), a mutual friend from their youth who had given up his own Army career to become chief of the Seminole tribe...<br><br>Through her influence and Quinn's respect for Hudson, the redskin leader eventually comes to the stockade under a truce flag... But Indian-hating Carlson imprisons Quinn in a detention pit, the latter dies, and the situation deteriorates from bad to worse until the Indians rescue Hudson, who had been jailed by Carlson for killing a soldier while trying to restore peace...<br><br>All the cast of the film (photographed in Technicolor) gives energetic performances... Barbara Hale's major asset is her physical presence, providing a tone of sincerity... Anthony Quinn plays the noble 'savage' for the last time...","user":"Nazi_Fighter_David","rank":[22,25]},{"title":"Their greatest enemy were the everglades.","rating":8,"date":"29 April 2005","review":"Before his famous films with Randolph Scott, Budd Boetticher made some excellent westerns and Seminole is one of them. The most impressive thing about it is the scenery, the beautiful colors, the everglades, the body painting and the costumes of the Seminoles. Rock Hudson is Lt. Lance Caldwell that goes to Fort King in Florida but does not get along with his superior officer Maj. Harlan Degan (Richard Carlson). Also his girlfriend Revere (Barbara Hale) seems distant. Both Caldwell and Revere had a common friend, half Seminole, who has disappeared. Degan wants to catch the Seminoles off guard and forces his men to go on a senseless mission on the everglades,carrying an enormous cannon. The group is not prepared to face the savage jungle, their own uniforms look out of place in that heat, where they are constantly sweating. Most of the film is told in flashback when Caldwell is in a court martial. This is an eastern western, entertaining, that did not age and that shows the Seminoles with respect and dignity.","user":"tmwest","rank":[21,26]},{"title":"Too Bad We Didn't Get The Real Story","rating":5,"date":"25 January 2011","review":"Seminole is a tale of those Indian Wars the United States fought with the native tribe of Florida and of their charismatic chief and martyr Osceola. Although Rock Hudson and Barbara Hale starred, the real star of the film and one who would have made a great Osceola had the real story been told was Anthony Quinn.<br><br>One thing that is true was that Osceola was of mixed heritage. Hudson plays a newly minted US Army lieutenant who is from Florida and assigned back there to do scouting for Major Richard Carlson commander of Fort King. The Seminoles are hostile now as they've not been before, with good reason considering President Andrew Jackson's Indian removal policy. They're not about to let happen to them what happened to the Choctaws, Cherokees, and Creeks to the north.<br><br>Quinn and Hudson knew each other as kids and both are rivals for Barbara Hale who serves as an intermediary. If a peaceful settlement of things were ever possible, it won't be because Richard Carlson, a spit and polish martinet is looking for military glory. Carlson really chews the scenery here, he should have dialed it down a bit.<br><br>In one respect the film is daring, showing an interacial romance between Hale and Quinn. Hudson is distinctly second fiddle to Quinn in his pursuit of Hale.<br><br>The story is told in flashback by Hudson at an army court martial presided over by Zachary Taylor played by Fay Roope. Although Osceola died in army custody, the facts here are totally wrong. He was tricked into captivity and was transported to Fort Moultrie in South Carolina where he died. I won't tell the story of the film, but do know that this ain't the way it happened. They've got the year wrong, Osceola died in 1838 and the film at the beginning identifies the time as 1835. Also the army is firing revolvers, not yet invented by Samuel Colt, though director Budd Boetticher spotted that one and he carefully edited the movie so as not to show anyone firing more than once. The cap and ball was still in use then. <br><br>Budd Boetticher took some time away from working with Randolph Scott and he would have been a good director to have told the real story of Osceola. He and Quinn would have made a great team.","user":"bkoganbing","rank":[20,26]}]