[{"title":"I'm with John Waters on this one: this movie is great.","rating":7,"date":"11 December 2011","review":"This cult favourite seasonal picture is writer / director Lewis Jackson's interesting, offbeat take on the holidays, focusing on a pathetic figure named Harry Stadling (Brandon Maggart), whose mind has been warped ever since seeing something as a child that he ought not to have seen. He's grown up with an obsession with Christmas; the decorations at his place have a Christmas theme, for one thing. He's dismayed at the attitudes displayed by co-workers at his place of employment, a toy factory, and goes so far as to catalogue the naughty or nice activities of children in his neighbourhood. When he learns that his company plans on donating toys to a local hospital, but expects all employees to make any financial donations, that's when he truly becomes determined to spread his own brand of Christmas cheer.<br><br>Now, this is not really for hardcore horror fans. True enough that Harry does end up murdering a few people, but this is not about racking up the body count. This is ultimately about one man's mental and emotional deterioration, and nowadays some folk might even insist on giving it the common \"psychological thriller\" label. Jackson takes aim at the crass commercialization of the holiday, a common theme in Christmas fare, and comes up with some very striking images, notably the police line up of Santas, and the homage to the Fritz Lang classic \"M\" with angry torch bearing citizens hellbent on getting their hands on Harry.<br><br>Talented star Maggart came in cold for his audition and delivered the exact performance seen in the movie; it's truly something to see. Fellow character veteran Jeffrey DeMunn ('The Walking Dead', \"The Green Mile\", etc.) is also effective as Phil, the younger brother frustrated over having to look out for Harry for many years rather than being able to look up to him. The cast and crew is filled with a number of people who did very well for themselves afterwards; the actors include future 'Home Improvement' wife &amp; mom Patricia Richardson, as well as Peter Friedman, Mark Margolis, Raymond J. Barry, Robert Lesser, Bill Raymond, and Rutanya Alda; the crew includes \"presenter\" and producer Edward R. Pressman, cinematographer Affonso Beato (who would shoot \"The Big Easy\"), and the late editor Sally Menke, who cut all of Tarantino's directorial efforts. Fun sequences feature Harry partying hearty with some strangers at a Christmas party and delivering toys to the children at a hospital. Seeing Harry spy on the kids, however, does create a fairly creepy vibe, no matter how good his intentions are.<br><br>One thing is for certain, and it's that this amusing low budget flick is fairly memorable, right down to its ending.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[25,27]},{"title":"Non dumb slasher alert","rating":8,"date":"5 October 2010","review":"oddball seasonal slasher that has more characterisation and less gore than many of its contemparies.After witnessing his mother getting it on with his father in a santa suit as a boy,a now deeply disturbed and grown up harry standling (Brandon Maggart) decides to celebrate Christmas his own way by metering out punishment to those who have besmirched the season of good will.<br><br>'Christmas evil' succeeds due to the film's emphasis on showing harry as a three dimensional character and for conjuring up a generally oppressive and Eerie atmosphere throughout,the fact that the death scence's are sporadic and often off kilter add too this 1980 slasher's unsettling nature.<br><br>'Christmas evil' will be far too off-beat for your average stalk and slash fan,but for those open minded and adventurous enough,'Christmas evil'is a one of a kind,genuinely original treat.","user":"samax_89","rank":[18,19]},{"title":"Better Watch Out... Better Not Cry... Or You May DIE!","rating":7,"date":"27 December 2006","review":"A young boy sees mommy having sex with Santa Claus (this seems to turn a lot of people crazy in these movies) and grows up Christmas-obsessed. He has his own \"Naughty and Nice List\" and takes Holiday cheer seriously...very seriously. If any adults are mean to Santa, they get a punishment a little worse than coal.<br><br>This movie was definitely odd. It was odd because of one scene, in which the psycho Santa brings toys to kids in a hospital. It actually... warmed my heart. Yes. Christmas EVIL warmed my heart. I felt horrible for the killer, as the director intended. It's like a Christmas Slasher version of Frankenstien, where the villain is tragic and just in his killings. Plus, both feature a town of mobbing people with torches. But there were little scene scattered about, the end scene, the toy scene, that actually... made me happy. So it manages to scare AND celebrate Christmas at the same time.<br><br>Oh boy, what am I saying? All in all it's a weird ass film that's pretty entertaining. 7/10. HO HO HO! MERRY Christmas!","user":"Pet_Rock","rank":[17,19]}]