[{"title":"Tedious, unrealistic, and worst of all, NOT funny","rating":4,"date":"26 July 2003","review":"There is nothing quite so painful as a comedy that isn't, and unfortunately Gene Wilder is is making more and more of them.  Normally both Wilder and Christine Lahti are talented performers, but this script would win awards for boring.  Not only that, but Lahti and Wilder have no chemistry at all, and it just gets worse when Mary Stuart Masterson is brought into the picture.<br><br>This is one of those \"slice of life\" 80's pictures that resemble nothing more than a bad Lifetime TV movie.  Wilder's reactions run the gamut from unrealistic to inappropriate; when he's consoling Masterson in their break-up scene, it's like a father with a daughter, which (quite frankly) I found exceedingly creepy.  The relationship with Lahti falls apart realistically enough, but with no humor, wit, or even insight possible as Lahti plays it straight and Wilder plays it far too broadly, even for a comedy.<br><br>** SPOILERS **<br><br>When he and Lahti get back together at the end, it's all rushed together, complete with an adopted baby coming out of nowhere, and with Lahti's lipstick still damp on Wilder's lips from their first kiss, she introduces Wilder and baby to a restaurantful of strangers as her family.  For that matter, the way his mother dies (and how flip Wilder is about it throughout the rest of the movie) conflicts terribly with the way he treats his father when he starts dating again.  Nothing in this movie makes any sense or bears any resemblance to human interaction.<br><br>In short, no subtlety, no humor, no great or even good performances (none bad either, except the inexplicable Susan Ruttan, doing her autistic impression once again), no connection to reality whatsoever.  Let's hope that Wilder hooks up with Mel Brooks and they both turn out something that makes us forget their work from the last fifteen years or so.","user":"Captain Ed","rank":[7,8]},{"title":"Funny How Love Isn't Funny In This Movie","rating":1,"date":"30 November 2002","review":"Cartoonist Gene Wilder's marriage to Christine Lahti falls apart after they fail to conceive a child, but they manage to get back together after Gene has lots of sex with a younger woman.  Love might be funny, but this film is something else entirely.  Sure, there are a few laughs, but not enough to make this poorly-structured, badly-directed film work.  it's about time for Leonard Nimoy to ask Scotty to beam him up.  By the way, the soundtrack sucked too.","user":"hausrathman","rank":[10,13]},{"title":"One of my Favorites!","rating":10,"date":"6 October 2016","review":"One of my favorite Gene Wilder films. This is a funny, but not side-splitting funny film,and you could say it is more sweet humor that can also be endearing. The supporting cast, especially Christine Lahti and Anne Jackson are terrific! Gene Wilder is so lovable in this movie that it will make you forget some of his sillier films.In this he plays Duffy Berman a well-known cartoonist who yearns to have a child before his 'biological clock' stops ticking.So when things don't go as he planned,his life is turned upside down with some very funny and tender moments. Give it a try if you haven't already seen it,you may be pleasantly surprised.","user":"Terrycmad","rank":[3,3]}]