[{"title":"Visual mastery","rating":8,"date":"7 July 2005","review":"I saw this film last night at a \"pre-Code\" film festival, and I have to tell you that when Gary Cooper turned his head for his introductory close-up, the entire audience gasped. He was just that beautiful.<br><br>Cooper's looks aside, this film displays Rouben Mamoulian's directorial artistry to perfection. Wonderful scene-fades, creative camera angles, symbolic allusions--Mamoulian just keeps exploring the directorial medium and coming up with innovation.<br><br>This was Sylvia Sidney's first role in Hollywood, after her success on the New York stage, and she is just as lovely as a Gary Cooper leading lady ought to be. It's nice to see her in a role with a harder edge than many she was given--so often she looks like she's afraid she's about to be hit by someone.<br><br>There are lots of familiar faces in this film, including the wonderful Wynne Gibson. Most striking is Guy Kibbee, best known for playing fatuous rich men, as a grinning and mendacious hit-man.<br><br>There aren't nearly enough of these pre-Code films available on VHS or DVD, so if you can't find a pre-Code festival near you, try campaigning Turner Classic Movies for a broadcast! As for the reviewer who believes Gary Cooper was too stupid to have dialogue more complex than \"Yep\" or \"Nope,\" he should perhaps consider Coop's performance in films such as \"Mr Deeds Goes to Town\" or \"Meet John Doe.\" Although heaven knows anyone who looked that good shouldn't have to be smart as well.","user":"klg19","rank":[33,35]},{"title":"Early gangster flick a pleasant surprise","rating":7,"date":"2 April 2007","review":"Clearly patterned after the first gangster movies that Warner produced the same year,Little Caesar (1931) and The Public Enemy (1931),this gangster movie is one of the better efforts I've seen. Although not quite in the same league as the previous mentioned classics, it has a powerful performance by young Sylvia Sidney.She's magnificent and delivers her lines more natural than perhaps anyone did at the time.Gary Cooper is better than usual at this stage in his career and shows signs of what would follow the next few years when he rose to the top. The movie has some fascinating villains in Paul Lukas (never seen him this detestable) and Guy Kibbee (what a shock to see him act the hoodlum).The direction of Rouben Mamoulian is very inventive,probably the first voice-over to show a persons thoughts appear in this movie. If you get the chance to see this little gangster flick, don't let the chance go by.","user":"nnnn45089191","rank":[24,25]},{"title":"Not a Minute Wasted!","rating":10,"date":"17 July 2008","review":"I thought I'd witnessed every wrinkle the crime/gangster flick had to offer, but the Garrett-Marcin-Hammett combination pull off some genuine thrills and surprises here, thanks to the inventively forceful direction by Mamoulian, the atmospheric photography by Lee Garmes, plus remarkably sharp film editing and flawless special effects. Brilliant acting helps too. Coop gives one of his most convincing performances as the reticent hayseed-turned-fearless bootlegger (the sort of character progression he was to repeat in other roles such as Sergeant York). Miss Sidney (pictured center) in her first major role is also an eye-opener. The principals receive great support from Paul Lukas, Wynne Gibson and Stanley Fields as the heavies, and even from Robert Homans' hard-as-nails detective. The movie has obviously been realized on an extensive budget which is brilliantly deployed in its realistic, crowd-filled sets.","user":"JohnHowardReid","rank":[20,22]}]