[{"title":"Extraordinary swordsman walks path of self destruction","rating":4,"date":"4 May 2000","review":"As an afficionado of samurai films, I have to admit that Sword Of Doom stands out as an oddity amongst my modest collection because of its progressively stylish presentation (a 'cool' samurai flick if I ever saw one) and its unusual ending.  Much has been made (by those I know who have seen this film) about the abrupt, violent climax that for spoiler reasons will not be elaborated upon in any further detail.  But to truly understand why this film ends the way it does, one must go all the way back to the beginning and realize with completeness the destructive path Ryunosuke (played superlatively by Tatsuya Nakadai) takes throughout the film.  At the beginning, Nakadai finds an old man praying to die so that he won't be a burden on his granddaughter anymore.  As if Nakadai were the deliverer of that prayer's intent, he strikes the man down for no good reason other than it was asked.  This sets off a chain of events that revolve around the granddaughter and the choices people make because of her.  And her story isn't the only one Nakadai affects in the movie.  If nothing else, Sword Of Doom espouses the notion of karma at length, and effectively at that.<br><br>The movie carries a philosophy that if a man's sword is violent, then it is because the man is violent or will become violent because of it.  This idea implies that a bond between a samurai and his sword is an evolving, mutually effecting affair.  We see many times throughout the movie how Ryunosuke uses his strength to survive.  As the story progresses, we come to realize that the man only knows one way, the way of the sword, because it has ever been all he has needed to get by.  He's never bothered to learn compassion since he's never had a use for it.<br><br>There's a romantic sympathy for this destroyer, this slayer of men.  We see that he is listless and morose and truly wants a cause, any cause, to fight for and believe in.  But because he kills anything in the way of what he wants, he inevitably destroys the object of his desire in one way or another.  And Nakadai emotes this tragic quality with the greatest skill, makes you care about him even though you'd probably hate him if you knew him.  You can see that he is a strong man, determined to live and die by by his skill.  Life is there for him to take, if it suits his needs.  As Ryunosuke descends into madness, his psyche haunted by his own cruel actions, we see the intensity of his plight in Nakadai's expressiveness. Without having to say anything, we know that the character is falling prey to his own crimes and that the pressure is building within his soul. Ryunosuke keeps the guilt inside him, lets it swell, until the end of the film when it becomes too much for even his intensity to contain any longer. Then he becomes a storm of chaos and violence.<br><br>The premise of karma is, in the most plebian of terms, 'you get what you deserve'.  There's more to it than that, but in this film Ryunosuke suffers in many ways because of who he is and the choices he's made.  In one scene that subtly ratifies this point, he visits the school run by Toshiro Mifune, who in this role plays a wise teacher of fencing, and asks to have a duel with him.  Nakadai instead ends up fighting Mifune's top student, and defeats him in front of all to see.  It is obvious to Mifune the cruel intent in Nakadai's technique, and because of this decides not to fight him. He knows no good can come of a duel between the two.  For Mifune, it's simply a wise decision to avoid the conflict for a number of basic reasons. But for Nakadai it's a reflection of his karma: to unwittingly destroy his own ambitions, which in this case is a fight with Mifune to prove who's better.<br><br>The disappointments all add up for Nakadai's Ryunosuke, and he responds to it by continuing on in his chosen path with a sullen, steely gaze.  Sword of doom, indeed.  Doom for all others around him but even more so for himself. Although he brings suffering to others in the hopes of attaining his ambitions, he is denied the one thing, due to his skill and mindset, that would probably be best for him: his own destruction.  Nakadai plays the character as knowing deep down in his heart that he is the cause of his own suffering, but refuses to fully accept it.  Furthermore, he seems to be hanging on to the notion that redemption is around the corner.  If he can just find himself a cause to live for, every crime will be erased and he will have proven to everyone that his methods, in fact, led him to his destiny.  This is all the more ironic considering his mistress and their illegitimate child live with him, and that he could at any time find a cause in devoting his life to them.<br><br>But that would require he surrender his blade, and he can't do that because that would be admitting failure.  And it's so obvious that Ryunosuke wants to be right about his choices.  He needs so much to be justified that he continues on this path, regardless of what may come of it, for self vindication's sake.  The ultimate culmination of this, without revealing too much of the ending, is that he finally DOES get what he needs in the end, although not how you'd expect.<br><br>Sword Of Doom is a success in every area it endeavors.  The acting is powerful, the story is moving, and the action is intense and masterfully portrayed.  And while I won't call the film 'perfect', it's pretty close.","user":"tais0","rank":[61,63]},{"title":"interpretation of the ending of \"Sword of Doom\"","rating":7,"date":"9 November 2007","review":"I won't go on at length about the film, because others have already done so, and well enough.<br><br>I will add my opinion about the ending, though.<br><br>Let me begin by saying that I understand the film was intended to be the first part of a trilogy, and so the unresolved ending could easily be attributed to a \"cliffhanger\" ending that might be resolved in a second film; however, we don't get the rest of that trilogy, so we must contend with the film as a complete work of art.<br><br>With that in mind, I propose that the unresolved ending of the film - the sudden, freeze-frame ending, still within the throes of an unfinished combat - is meant to suggest this: <br><br>:::Ryunosuke has actually died at some unknown point during the final sword battle; what we are in the process of observing, then, is Ryunosuke in his own real and private Hell, an afterlife of endless opponents, brutal killings, and constant injuries to his own body, none enough to kill him, but enough to cause him pain and torment:::<br><br>The reasons I see to accept this idea are several: <br><br>1) The inn is now on fire; fire is an easy metaphor for Hell (certainly for Western audiences, but possibly for Eastern ones as well). As to that fire, no one is responding to it directly, as people would tend to do if a well-populated inn was burning. There is no sound or image of commotion, shouts, running for exits, etc., as we usually see during burning-building scenes, even when there is a battle going on. <br><br>2) The scene immediately before the final battle is focused on ghosts and hauntings - it begins with Omatsu telling the tale of the courtesan who killed herself in the now-unused room, and quickly proceeds to multiple images of Ryunosuke fighting the ghosts of his own victims.<br><br>3) The room that Ryunosuke is in, and proceeds to tear apart before the attack of the samurai, becomes almost supernatural - the curtain walls he cuts through are endless, repeating, circling back upon themselves - he cannot escape this room, even by cutting his way through and out. Then, the rooms of the inn he fights his way through become endless, maze-like, and repetitive, with no occupants except the endlessly attacking samurai.<br><br>4) The final freeze-frame suggests to the audience that there is no logical ending to this scene; indeed, it never ends.<br><br>So there you have my interpretation of the ending of \"Sword of Doom\". If you like it and ever quote it, please give me, and this review, the credit!","user":"ithearod","rank":[28,33]},{"title":"A pure action movie","rating":10,"date":"4 February 2002","review":"Imagine your favorite action movie, then take out all the cheesy one-liners (\"Asta la vista, baby!\"), the irritating sidekick, the love interest, the techno-porn, and the off-handed moralistic ending. Then add a Commando-league body count, incredible swordplay, and great photography, and you've got Sword of Doom. This is a wrenching, visceral drama about an antagonist armed not with a stolen nuclear device, but with the best sword-fighting skills in Japan and a psychopath's indifference to human life. Unlike other more recent movies that try to portray the same raw, killing-machine kind of character, Sword of Doom does not resort to grimy photography or an adolescent delight in visual assault. Instead you get pure, distilled, ultra-kinetic fighting suffused with a thrilling coldness.","user":"alberich68","rank":[60,76]}]