[{"title":"A fun thing to watch","rating":7,"date":"27 June 2005","review":"I remember watching this movie when I was a little kid and what a great time I had at doing so! Because, when you're this young you just don't care about plots or film-making. So, if you sit back and analyze this flick you won't find many Oscar winning angles, but that is not what this movie is trying to achieve. We just may call this another typically silly Tom Hank's early age's movie that many have come to love at first sight.<br><br>Simply put, this movie is all about funny situations and the comical performances of Tom Hanks and the dog (that dog was a great actor!). Nowadays, I continue to enjoy it because the \"chemistry\" between Hanks and the dog is very good!","user":"thefreakone","rank":[50,52]},{"title":"Hanks Turns Water into Wine, With a Canine Assist","rating":8,"date":"24 July 2014","review":"Tom Hanks is an obsessive-compulsive cop who takes in a filthy, slobbish French Mastiff when it's the only witness to a murder. Basically The Odd Couple with a dog. It's predictable and formulaic to the bone, but hits a strange nerve that allows us to overlook its shortcomings and appreciate the sweetness of the ride. Hanks is largely to thank for that, at the top of his game very early in his dramatic career. Though a few not-so-surprising supporting actors pop in from time to time, (Reginald VelJohnson as a policeman? What a shock!) it's almost entirely a one-man show that sails beyond expectations on the merits of his lone performance. In fact, the closest competition is Beasley the dog, who's absurdly emotive and personable throughout the film. He and Hanks make for a great team, as silly as that might sound, and it's easy to tell that a lot of their best scenes were ad-libs that miraculously avoided the cutting room floor. Funny, bittersweet movie magic that really has no business being as entertaining as it is.","user":"drqshadow-reviews","rank":[20,20]},{"title":"Man and His Best Friend","rating":16,"date":"16 January 2009","review":"Hanks and Beasley make for an odd couple but they are clearly the best thing about the film. In terms of storyline of 'Turner &amp; Hooch' is not developed from a novel concept, the humorous treatment and the hilarious and endearing interaction between the lead pair is what makes it a charming little film. Tom Hanks is totally great in one of his early roles as a policeman who suffers from perfectionism and is challenged by the entrance of a pooch into his life. The guy shows a flair for comedy that has hardly been noticed by many filmmakers. Beasley is fantastic and absolutely adorable (once you get passed the drooling). Mare Winningham is good as Hanks's love interest. They are quite convincing enough as a romantic pair. There are plenty of wonderful moments in the film and it is hard to pick a favourite but the first scenes that come to mind are the stakeout scene where Turner is chatting with a bored Hooch and the scene where he comforts a grieving Hooch. I love the film for its simplicity and heart along Hanks and Beasley. An awesome fun little flick!","user":"Chrysanthepop","rank":[25,28]}]