[{"title":"New Wave in New York","rating":18,"date":"18 November 2005","review":"Melville is clearly enjoying himself in this picture. As director, there is a virtuosic flourish to many of the extended shots and the night-time cinematography. As actor, the constant smirk on his character's face is surely that of Melville himself, playing out his personal fantasy as a film noir character in his favourite city.<br><br>When the story arrives, it's revealed to be an ethical dilemma: our two principals (Melville as an Agence France Presse journalist and Pierre Grasset as his photographer buddy) discover a French diplomat and ex-Resistance hero dead of a heart attack in an actress's apartment. Do they report the truth, cover it up to preserve the guy's reputation or sensationalise it even more to make a fortune from the exclusive?<br><br>Melville was by no means a great actor, but his baleful eyes, bland smile and spiffy bow tie in this film give him a kind of sleazy charm that brings to mind Peter Lorre. His character's name (Moreau) is a pun on \"moraux\", which means moral, and indeed he is intended to be the moral centre of the film. There are moments, though, when he seems genuinely sinister: when he peeps on a bare-breasted dancer in her dressing room (the scene was censored in the UK), and when he looms threateningly over another girl who has just attempted suicide.<br><br>\"Deux hommes...\" is the most New Wave of all Melville's films. The raw, documentary-style shots, the improvised feel to some of the scenes (Melville makes frequent mistakes when speaking English), the use of real locations and untrained actors (including Melville himself), were jarring to audiences and critics at the time. In the light of Godard and Truffaut we can now better appreciate the type of film-making that Melville helped to inaugurate. Nevertheless, Melville regarded \"Deux hommes...\" as a failed experiment, returning in his subsequent films to a more classical approach.","user":"kinsayder","rank":[26,29]},{"title":"Rich, ambiguous, underrated gem from maestro Melville.","rating":8,"date":"6 December 2000","review":"'Nothing seems real.  You don't exist.  I must wake up' moans the failed suicide and actress, as she is gently pressured by journalist Moreau into revealing the whereabouts of her lover, missing UN diplomat, womaniser and Resistance hero Fevre-Berthier.  Melville's most realistic film, shot amid the bright-neon signs of New York, is also a pure dream, its narrative unreeling over one very dark night, swamping its protagonists into mere silhouettes or fragments, as they walk and drive and drive and walk in an echo-laden, empty silence, punctuated by fierce jazz squalls.<br><br>'Deux Hommes' is generally considered one of Melville's least successful films, and the director rejects it in his famous interviews with Rui Nogeuira, claiming that its failure made him seriously rethink his way of making films.  It's not easy to see why it should be so disapproved of.  The narrative is brisk if conventional, as it follows a traditional detective story route of problem, investigation, solution.  Perhaps what is most objectionable is the film's theme, the idea that sometimes it is honourable and proper to conceal the truth from the public.<br><br>I may be biased - this was my first Melville film, eight years ago, beginning a love affair that is even more intense today - but I think 'Deux Hommes' is pretty good, for a number of reasons.  Most immediate is Melville's use of light and darkness, the way he works between blazing neon and dense obscurity, as he does between noise and silence or sharp montage and Wyler-like deep-focused long-takes.  This visualises the theme of the film, the darkness of the 'victim''s absence brought to light by the investigative journalists, with truth thrown back into the darkness.<br><br>Although Melville's heroes seem less 'deconstructed' here than in his most famous films, he uses subtly elaborate means to undermine them.  Throughout, they are in a position of power, moving with ease through the different worlds of New York, from burlesque houses and brothels to expensive bourgeois apartments, linking two seemingly disparate realms.  When interviewing people who knew Fevre-Berthier, Moreau remains rigidly framed, while his interlocutors are shot from different angles, cut up, fragmented, figuring his unbreakable integrity, and their dissimulating multiple identities.<br><br>But Moreau, for all his supposed decency, is never as powerful as he thinks. His firm point of view is often broken up by unmotivated angles that problematise scenes he dominates.  He is frequently swallowed up in darkness, his authority literally disappearing.  God-like camera angles looking down on him mirror the car that follows him - unlike a conventional detective, he has less information than we do, and so is emasculated.  His body is sometimes broken up by Melville's compositions, particularly when the pair come out of Capitol Studios, and are shot from inside a car, watched by an unseen stranger, or in the climactic chase, as he keeps getting out and back into the car, his head repeatedly lopped off.<br><br>this undermining is linked to the theatrical metaphors strewn throughout. The four women interviewed are all linked to performance - an actress, a singer, a call-girl pretending to be Marilyn Monroe, and a stripper.  Dalmas mimics Fevre-Berthier, and invents a different death for the victim, just as Moreau and his boss finally do.  The men play the role of brother and friend to sneak into the hospital.  They repeatedly enact what they're going to do or see.  Throughout the film we get shots of the surface of New York, as if nothing has changed, but once we have penetrated the world beneath the glitter, it is impossible to take these signs, or these men, in the same way again.<br><br>Unusually for a Melville 'crime' film, the protagonists are detectives and not gangsters.  However, Melville uses similar tropes to his gangster films to further undermine his heroes.  The hospital scene is familiar from these films, the shaking up of someone with information, Moreau waiting outside like a boss, while his henchman does the dirty work.  Moreau, throughout the sequence, with his 'gentle' persuasiveness, becomes genuinely sinister.<br><br>As they wait with the corpse in his lover's apartment, Moreau and Dalmas are visited by the editor, the 'Boss', wearing shades - his dealing with the body, his wearing shades indoors, his re-arrangement of the truth are all gangster staples, and yet he is the editor of a reputable magazine, determined to bury the truth about a Churchill-praised Resistance hero.<br><br>Melville is often acclaimed/reviled as France's greatest Americophile.  It is here significant that Melville the director is also the lead actor, because just as the actor goes through a real geographical space, the director goes through an imagined cultural space of favoured American landmarks, Time Square, Broadway, Mercury Theatre, Time Magazine, Capitol Studios etc.  The anti-hero's name is Delmas, a reference perhaps to John Dalmas, Chandler's prototype Philip Marlowe.<br><br>This kind of allusionism further destabilises the film's realism, as do narratively irrelevant shots of cigarette packets, the brand smoked by Melville's one-time friend Godard.  Melville is always pushing back the limits of his genre, the hilarious, 'A Bout de Souffle'-like jazz-warnings to remind us of the car following our heroes, the car-lights seem to wink at us, as if we're both in on the joke on the heroes.  In a very striking scene, flagrantly breaking 'plausibility', Moreau gets into the driver's seat with the address card of their next destination.  The soundtrack suggests they start up and drive off, but the camera stays in an immovable car on the driver holding the card.  In the penultimate scene, as Delmas lays slumped on the floor, the band that had been the act become the audience; a trumpeter approaches and blows with mock-melancholy.<br><br>There is so much more in this deceptive, short film that deserves a reconsideration, especially for its incredibly detailed technique that never forces itself, but is very rich.  But the film works best for me as a (Hustonian?) study in failure, of the film's other hapless womaniser, Delmas, a great talent doused in impotence and drink, prepared to do vicious things for a break, a man who could have had everything, but seems shell-shocked by life, who can only find beatitude through alcohol.  Rather him than the deeply creepy probity of his partner.","user":"the red duchess","rank":[28,32]},{"title":"Intriguing mood piece","rating":7,"date":"7 March 2009","review":"The main character in this film is Manhattan, as imagined and idolized by Melville. This impression is strengthened by the mostly unknown cast and the director himself playing the male lead. The rudimentary plot is mostly an excuse for Melville to feast on his favorite scenes and images: shiny cars driving through nocturnal city streets, neon signs and all-night bars, sultry women and smoky jazz music. The emotional tension of the film comes from the familiar Melville treatment of men's code of honor and loyalty tested by their weakness, here mostly the temptation of women, money and whiskey. Recommended for fans of Melville and stylish noir films.","user":"jimisalo","rank":[14,15]}]