[{"title":"Jimmy Stewart did NOT murder the hangman.","rating":7,"date":"11 August 2015","review":"Contrary to the opinions of some reviewers, amateur and professional, Mace Bishop (Jimmy Stewart) does not murder the hangman Ossie Grimes (Guy Raymond) in order to steal his garb and take his place. <br><br>A check of James Lee Barret's movie script clears this up, revealing a scene unfortunately cut from the film.<br><br>At the end of their seemingly convivial trailside meeting, Mace suddenly draws his gun.<br><br>Mace: \"I'm afraid I'm going to have to impose a little more on your hospitality, Mr. Grimes, but I imagine a man who loves life as much as you do will get over it.\"<br><br>Ossie Grimes: \"I don't understand.\"<br><br>Mace: \"You don't have to. I'm taking your ropes, your horse and your clothes.\"<br><br>Ossie Grimes: \"That don't leave me much, does it, friend?\"<br><br>Mace: \"It leaves you naked and afoot. There'll be a stage by here in two days. Now, let's get 'em off.\"<br><br>(As the camera fades into the next scene.)<br><br>...and Ossie Grimes went on to have a wonderful life as a farmhand on the cast of \"Green Acres\".","user":"erb-97464","rank":[15,15]},{"title":"Spoiling a good necktie party","rating":7,"date":"5 January 2006","review":"Bandolero starts out as an amiable western. Former Quantrill raider Dean Martin gets caught robbing a bank where Raquel Welch's husband was killed. He and his gang are sentenced to hang and the town of Valverde Texas even sends for a professional hangman to do it right. Of course Dean's brother James Stewart hears about it and waylays the hangman and takes his place.<br><br>Stewart helps effect an escape for the outlaws minutes before the hanging. And after Dean and his gang get away, Stewart goes and robs the bank that they were unsuccessful in robbing in the first place.<br><br>Up to this point Bandolero is one of the funniest westerns I've ever seen and had the film stopped right there and been a television special it would have gotten rave reviews. <br><br>But Bandolero changes and becomes deadly serious as a posse led by Sheriff George Kennedy and Deputy Andrew Prine chase them across the border and into Bandolero (bandit) country. Mexican bandits who have no use for Americans. These are probably the ancestors of Alfonso Bedoya's bunch from Treasure of the Sierra Madre. Along the way Stewart and Martin connect and Martin takes Raquel Welch as a hostage.<br><br>Bandolero is a good film, but it's far better in the beginning when it is played for laughs than when it becomes serious. Still I would recommend it to western fans.","user":"bkoganbing","rank":[29,34]},{"title":"The first hour is amiable enough but the story is unengaging and the characters unconvincing","rating":4,"date":"4 December 2004","review":"Mace Bishop is slumming his way across Texas when he hears that his brother has been caught robbing a bank and is due to be hung, along with his whole gang. Posing as a hangman, Mace manages to convince the Sheriff of his stolen identity and merrily sets about preparing for the execution. When the day comes Mace goes through the motions until the first chance he gets to slip Dee a gun unseen  allowing them to escape. While all the men ride out of town, Mace finishes off the bank that Dee failed on and rides on to meet up with the gang fleeing to Mexico  however even with a hostage, the Bishop gang are closely pursued by an angry Sheriff Johnson.<br><br>From the very start this film marks itself out as a strange mix that relies on its stars more than anything else. The opening scene is edgy but then the credits are laid back with an almost comic theme tune. The first half continues with this tone and is quite relaxed and enjoyable while also being a bit amusing; however once the Bishops escape, things begin to go downhill but yet there is still over an hour to go. The film forgoes the amiable tone it had in the start and tries to build a story and characters but does neither very well at all. It all drags and is never really convincing with the actual 'chase' sort of petering out in a distracting subplot involving Mexican bandits while the rest of the characters change and act totally unconvincing. It affected my enjoyment of the film  not because it got more serious but because it never got involving. The ending is a massive gunfight that is more silly than exciting and is just a lot of noise to satisfy the audience rather than a good conclusion to the story.<br><br>The characters are a problem because they seem to have been written to suit the stars rather than being true to the story and situations. The best examples of this are Maria (who falls in love too easily), Dee (who is just Dean Martin and not an end of the road bandit) and Mace (who is just James Stewart). People on this site have said that this film gave the stars the chance to play bad guys but this is nonsense  the 'bad guys' here are the gang, who are set as mangy in order to help us see how likable and honourable the Bishops are. Martin plays to his smile but does nothing else  certainly he is not the tough criminal that the opening scene would have us believe he is. Stewart suits his role but there is nothing to him other than a watered down version of his personae and a bit of relaxed charm; this makes for dull viewing though. Welch looks gorgeous and yet she cannot make us believe in her character at all and she is all about being Raquel Welch rather than being a character  heck, even an attempted rape seems to have been shot to show off her back and legs. Kennedy just saunters along in a wasted role and the rest of the gang just do the best they can with thin characters.<br><br>Overall this is a pretty poor film that has an enjoyable little first half but then unsuccessfully opens up into an attempt at a story with characters and such. The story is weak and falls down in the second half, partly due to the characters just not convincing at all. The stars try to work with the material but they are only ever partly successful  Stewart being OK, Welch forcing the emotion and Martin just smiling and relying on his celebrity status. The first hour is OK but this is one for real fans of the actors but nobody else.","user":"bob the moo","rank":[16,18]}]