[{"title":"Blessed Are The Peacemakers","rating":8,"date":"3 November 2005","review":"Broken Arrow was actually the start of James Stewart's return to the western genre. His first western was Destry Rides Again in 1939 and he waited for over 10 years to do another. After that he did them quite regularly.<br><br>Broken Arrow was made first, but held up over a year before release so Winchester 73 was actually Stewart's official return to the west. But both films had a lasting impact on his career.<br><br>This is the story of Army Captain Tom Jeffords who with a simple act of kindness started a peace process with the Apaches led by their charismatic leader Cochise. Jeffords, a veteran of the Union Army and the frontier wars is heartily sick of the slaughter he's witnessed and participated in. He finds an Indian boy who's been wounded by whites and he tends to them and heals him.<br><br>One thing leads to another and pretty soon Jeffords finds himself in the camp of Cochise with whom he strikes up a friendship. He also woos and wins an Apache maid named Sonseehray. Jeffords and Cochise with General Oliver O. Howard make a treaty with the Apache, at least most of them.<br><br>Broken Arrow did a lot for James Stewart, but even more for Jeff Chandler who plays Cochise. Cochise was a man in his late 60s when this was really taking place, but Chandler in his prematurely gray hair, portrays him well. Chandler got an Oscar nomination for Best Supporting Actor for Cochise. <br><br>Jeffords and Cochise are men of good will and decency who see an honest peace as the only answer. Of course both have to contend with people who won't or can't accept peace with the other race. It's those people and what they do break the peace that is the rest of Broken Arrow's story.<br><br>Delmar Daves is a good director of western films and in fact did another film about the U.S. government trying to make peace with another Indian tribe, the Modocs in Oregon, in the film Drumbeat. He gets good results out of the rest of the cast. Note the performances of Will Geer as an Indian hating rancher, Debra Paget as Sonseehray, and Basil Ruysdael as General Howard.<br><br>The screenplay was done by Albert Maltz of the Hollywood Ten. How ironic that Maltz was blacklisted after this film. I suppose a film about peace between the races and good will towards one's fellow men was highly subversive.<br><br>Broken Arrow was given much acclaim for being the first film to express the view that Indians were something more than bloodthirsty savages. That's not exactly true, other films around that time started saying the same thing. Nevertheless Broken Arrow's message is an eternal one. <br><br>Says so in the Scriptures if I'm not mistaken.","user":"bkoganbing","rank":[65,76]},{"title":"not the usual western movie","rating":8,"date":"7 June 2000","review":"Although the story is entertaining and the performances of James Stewart, Jeff Chandler and Debra Paget outstanding, what makes Broken Arrow a landmark film is its portrayal of the Apache Indians as something more than savage killers. Indians in the movies were always seen as brutal and inhuman. Here they are seen as people who want what the \"white men\" wanted: to live in freedom with their families on their own land and to live their lives in their own way.<br><br>Jeff Chandler is terrific as Apache leader Cochise, who he would play twice more in other films. There is a moving scene when they return from battle and he recites the names of those killed with a pained look in his eyes. Cochise and Stewart's character have a relationship which grows from mutual respect to a true friendship as they try to work out peace between the whites and indians. Stewart is looked on as a traitor by his friends and things are complicated further by his relationship with the young Apache girl played by Debra Paget.<br><br>I cannot think of another western in which indians have been portrayed as real people with emotions who hurt, who love. When this film was released 50 years ago, blacks, asians and American Indians were still being portrayed using the worst kinds of racial stereotypes.","user":"dave fitz","rank":[62,77]},{"title":"Delmer Daves offers an important major role to an Indian character, treating him with quality and esteem as human being...","rating":8,"date":"17 April 2005","review":"Delmer Daves offers an important major role to an Indian character, treating him with quality and esteem as human being...<br><br>Stewart plays a scout who seeks to heal the divisions between the Apaches and white men But while \"Broken Arrow\" is a perfectly acceptable depiction of frontier struggles, it does not display Stewart to the best advantages Delmer Daves was competent enough, but he lacked the ultimate virility and intensity of Anthony Mann <br><br>\"Broken Arrow\" examines, rather intensely and directly, the mistreatment and flagrant exploitation of the Indians by whites in the early West <br><br>The strength of this often lyrically photographed picture which will a1ways have an honorable place among Westerns lies particularly in the touching dignity of Stewart's love and marriage to an Indian girl (Debra Paget). Indian haters, of course, stir up the usual sort of trouble and Stewart's bride becomes a victim with all the consequent poignancy for which the film is best remembered<br><br>The over-wise Chandler counsels him that he must learn to live with his whiteness just as his new friends must contend with their own place in the cosmic scheme of things Cochise has words of stark consolation for Stewart: \"As I bear the murder of my people, so you will bear the murder of your wife.\" <br><br>The most interesting aspect of \" Broken Arrow\" is not the interracial romance between Stewart and Paget, but Stewart's relationship with Chandler's Cochise There is intra-character complexity here, as Chandler struggles to overcome his disturb of all whites, and Stewart attempts to comprehend the different philosophy and cultural of the Indians <br><br>Jeff Chandler was quite apt and professional He was so believable in the role of the Apache chief Cochise that he was to essay it again in George Sherman's \"The Battle at Apache Pass\" in 1952 Chandler's facial bone structure lent itself to noble, incisive Indian profiles, and unlike other Caucasian actors he did not look out of place He was even nominated for Best Supporting Actor at that year's Oscars","user":"Nazi_Fighter_David","rank":[40,49]}]