[{"title":"This movie is never a 5.9 thats insulting","rating":8,"date":"16 September 2007","review":"I was just looking up movies here on IMDb when I noticed that The Great Outdoors had received only a 5.9 mark I find this incredible as I thought that this movie was and is a cult comedy classic. With Dan Akroyd and the late great John Candy on top form .The comedy in this movie is fantastic the scene with the old dead guy in it is one of the funniest scenes I have ever seen in a movie and the gags come thick and fast it is never only a 5.9 more like a 7.0 in my opinion. It takes a lot to make me laugh when I go to the movies but this comedy hits the spot so don't let the low mark put you off checking out this movie as it is far better than its 5.9 suggests and you wont be disappointed .Well thats me finished i just had to write this as I was shocked at the low mark this great movie received.","user":"goodkat2","rank":[18,19]},{"title":"Remember these classics!!","rating":8,"date":"12 September 2004","review":"The eighties was a decade of film brilliance. Not Academy Awards maybe, or deeply intriguing movies but instead R-Rated, ridiculous, fun, pompous, films that were just not thought provoking but instead FUN!! What was R-Rated back then would be barely a PG today which also reflects the kind of society we have turned into. Enter \"The Great OutDoors\" with fellow Canadian comedians who knew comedy unlike no one has since. <br><br>Dan Akroyd and John Candy are just great. They aren't brilliant actors (although Dan has shown some promise in great movies such as The Arrow and My Girl) but instead they can get together to deliver laughs and they do. The Great Outdoors is the quintessential eighties film about a family on vacation. It's about the desire to succeed and BUY STUFF (an eighties must.) It's about who is the better man, and man vs nature and all that kind of stuff. More importantly it delivers the perfect blend of physical comedy AND one liners that actually made me laugh out loud. Akroyd and Candy play like a stand up comedy act and it works so well that you forget everyone else. They really don't add or take away from the story, you just forget anyone else is there...it doesn't really matter much. You're in this to see Chet and Roman battle it out mostly behind each other's backs. The cinematography is great in this movie as well. They used an actual lake although it was in California, not Wisconsin and it really helps the setting. You feel as though you're roughing it out right beside them. The best part is the climax with the bear, what a great scene. As predictable as you might think it is...it's just awesome. Candy is hilarious and sadly missed in future endeavours. Akroyd pulls off the pompous, greedy and loud mouthed lawyer type to a T and manages to not take himself too seriously. As with all eighties films they manage to toss in the someone is in trouble, everyone has to pull together and save them story ending but it works and this movie is without a doubt a classic, whether comedy or just film in general, it will always be remembered fondly. 8/10","user":"Robert_duder","rank":[25,33]},{"title":"As long as Dan and John make me laugh, I love this movie","rating":10,"date":"17 November 2003","review":"The Great Outdoors is one of the most under rated comedies that I have ever seen! It's actually one of my hidden favorites, because this is the type of comedy that I love, slap stick. Dan and John make such a great comedic duo in The Great Outdoors, you can't help but laugh hysterically at every scene or be touched by a sentimental moment. I miss stories like this, that are not only heart warming but have a great mix of comedy as well.<br><br>Chet is a family man who wants to bond with his songs on a camping trip, so he, his wife, and their boys go out to the great outdoors. But an uninvited guest tags along, their rich and snobby cousins Roman and Kate and their two Shinning creepy twin girls. Since Roman likes to live it up, he practically jumps all over Chet's plans and just takes over the vacation! <br><br>There are some great scenes like a bat gets loose in the cabin and Chet and Roman decide to take it on themselves. The bat gets onto Chet's face and Roman hits the bat and Chet's face with a tennis racket! Chet's reaction is just priceless! And they go to a restaurant where Chet has the opportunity to eat a 16 ounce steak and if he eats the whole thing, the family eats for free, and they do it like as if he was Rocky in his first major boxing match, it was just great to watch. The Great outdoors is one of those great under rated comedies that I'm sure you'll fall in love with.<br><br>10/10","user":"Smells_Like_Cheese","rank":[46,66]}]