[{"title":"a drive-in fantasy!","rating":6,"date":"9 April 2007","review":"The best movie ever! OK, so its not. But trust me if your'e looking for exploitation fare at its best, this is it. I'm talking teenage prostitution, guns, the sunset strip in all its decadent glory, drag-queens, dykes, nerds, high school pressure! This movie has it all! <br><br>This isn't Shakespeare, it is what it is. The use of La is fantastic, the soundtrack is great. Director Andrew Davis ( the Fugitive) worked on the photography. Donna Wilkes (where have you gone Donna?), is simply so precious, so innocently sexy, she takes your'e breath away. Rory Calhoun, matinée idol in the '50s, is totally whacked out here, he's surreal as Kit Carson(!) Cliff Gorman does a great job as the cop whose seen too many young kids sucked into the sewer of LA, he should have gotten better parts after this. Dick Shawn, who I never really liked, is just great here, a totally sympathetic drag-queen! WOW! Susan Tyrell is awesome as always,s he repulses and fascinates in the same frame.<br><br>Angel is the type of late-night viewing that really sticks with you. The plot is complicated by a serial killer, well-played by John Diehl, and you really feel the tension build. Note the small performances in Angel, the guy who plays the street performer was in love with one of the murdered prostitutes, notice his face when he learns of her brutal death. Terrific.<br><br>Angel is well worth your trouble, sure it reaches out to the slimy pervert in all of us, but it makes you think at the same time. Is it ever worth it? To damage one person so severely just to get off? <br><br>Terrific movie.","user":"windypoplar","rank":[12,12]},{"title":"A champion of sleazy 80s cinema","rating":1,"date":"1 March 2004","review":"Released to critical assault(and one surprisingly enthusiastic review from Roger Ebert), ANGEL managed to glean wide audience appeal and raked in the dough. It was ingeniously marketed- \"High School Honor Student by Day/Hollywood Hooker by Night\" was the memorable tagline, featured with ad images of a knee-socked high school pigtailer and her high-heeled \"come-hither-with-cash-in-hand\" alter-ego. Our sympathetic young heroine is played on-target by Donna Wilkes(looking a hell of a lot sexier than she did on TV's HELLO LARRY a few years earlier). An eccentric supporting cast(Tyrrell and Calhoun, most notably) shine as various \"creatures of the street\"<br><br>On the surface, it's a fairly conformable psycho-slasher crime picture with a heapin' helping of tittie and some very dodgy scenarios. But there's a distinct tongue-in-cheek subtly underlying the obvious pastiche of ANGEL, implying a wry sendup of the base material. Too, it joyously celebrates its own trashy nature with a good sense of humor about itself, yet still maintains a steady momentum of raw tension, violent action, and crisp direction.<br><br>With the surprising box office this film generated, a string of inferior but inevitable sequels followed(without the lovely Ms. Wilkes). Next up was AVENGING ANGEL. <br><br>7.5/10","user":"EyeAskance","rank":[16,18]},{"title":"hilarious Hollywood street spoof with great cast","rating":9,"date":"23 April 2002","review":"Is it the best movie ever made? No. Is it one of the of the funniest of this genre? Yes. Definitely a must see. The story is a young prostitute meets murderer, but the supporting cast is what makes this a gem. The supporting cast includes: Rory Calhoun, as an aging western film star who still wears his holsters, boots and hat, and protects the streets; Dick Shawn as a transvestite with a heart and in one of his most hilarious roles - this was really Oscar stuff - just fun acting, no stuffiness here; and Susan Tyrrell, who steals the picture as a jaded Hollywood woman with more makeup that a tv evangelists wife. This is a film for a time when you really need to be entertained, not preached at, the film is a gas. Great late night fun flick for a group of friends. Really well done.","user":"lorenzo212","rank":[15,17]}]