[{"title":"Without question, one of Bergman's most intense and unforgettable films","rating":14,"date":"14 April 2008","review":"This is without question one of Bergman's greatest and most rewarding films, and indeed, one of his most subtle. Like his more iconic work - such as The Seventh Seal (1957), Wild Strawberries (1957), Persona (1966), Cries and Whispers (1971), etc - it presents a rich tapestry of wounded characters and painful memories that are affective on a completely external level. However, what elevates this from a great film to a work of unforgettable genius is in the questions that the film asks - but never answers - and in the window that it offers into the world of Bergman's previous film, the surreal, anti-war parable Shame (1968).<br><br>Like many of his greatest films, A Passion (1969) looks at characters disconnected from the world in which they inhabit and slowly becoming disconnected from themselves within the process. There are the obvious parallels with Shame - which we will come back to - as well as Persona (1966) and Hour of the Wolf (1966). As with those films, A Passion has strong roots in existentialism; creating a barren landscape that comes to represent the internal psychological state of the characters and that particular sense of deep despair and quiet alienation that drives them to take solace in other, equally damaged souls. We also have a series of continual stylistic juxtapositions and attempts by Bergman to disarm and distract us. The most obvious of these is the use of the narration, which on our first exposure, seems to fulfil no real purpose, instead, merely jarring against the natural, almost-documentary like presentation of the film. Added to this, there is a subtle breakdown in reality happening with the notions of fact and fiction, which is again mirrored externally by the way in which Bergman breaks the fourth-wall of the drama to offer us the opinions of his actors on the roles that they are about to perform.<br><br>The technique is reminiscent of Toshio Matsumoto's equally compelling psychological examination, Funeral Parade of Roses (1969), only without the obvious kaleidoscopic influences of pop art, psychedelic rock and the spirit of Jean Luc Godard. It also suggests the confessional element of films like Hour of the Wolf, Scenes from a Marriage (1973) and Rite (1969), only in a way that is far more obtrusive. What these scenes represent for me at this exact point in time is somewhat unknown, although they certainly don't feel out of place; especially within the context of that closing shot and the final revelation.<br><br>The plot here is a maze of pure emotions, with Bergman's cold and clinical narration and ironic deconstruction of the narrative elements turning A Passion into an examination, with characters trapped in metaphorical glass jars and analysed by spectators in order to understand something, not necessarily about the characters, but very much about ourselves. Alongside these deconstructive elements we have characters that seemingly can't be trusted with the information that they have to offer us, with lies, guilt and deceit all swirling 'round us like a whirlpool of blame, disappointment and critical self-examination. The characters are running away from things that there is no real escape from, and the relationship that seems to offer a further window out of their self-imposed exile and malaise ends up leading back again; leaving the characters broken more so than they were at the start of the film. Although it is done subtly by Bergman, the ending of the film is every bit as desolate and apocalyptic as the ending of Shame, or as deconstructive and subversive as the ending of Persona.<br><br>Alongside the creation of a setting that is barren and desolate, and the claustrophobic feeling created by the use of cramped interiors and a limited psychological space, Bergman also creates tension from the enigmatic quality of his characters and the questions that they present. In one of the film's most fascinating sub-plots, we discover that the animals on the island are being slaughtered by an unseen madman; an intelligent and disturbing idea that further suggests the notions of reality breaking down and the nightmarish thoughts and feelings of the characters spilling out and enveloping them. The identity of this violent and cruel individual remains a mystery throughout, with Bergman leaving us to draw our own conclusions; forcing the audience to question not only the actions and intentions of the character observing this horror, but also whether or not this same horror is merely an extension of the character's crumbling world. This is further illustrated by a third-act dream sequence that not only contextualises the whole of A Passion - and, in particular, the character of Anna - but also the director's previous film, Shame.<br><br>Without a doubt, this is raw and extremely powerful film-making; evident from Bergman's uncomplicated use of editing and cinematography. As a result, the film looks and feels very much like an obvious precursor to Lars von Trier's later examination into human fragility, Breaking the Waves (1996), with the filmmaker shooting in muted colours with naturalistic lighting, minimal production design, choppy editing and the use of hand-held cameras. This, combined with the towering performance from Max Von Sydow as the central character Andreas Winkelman, and fine support from Bergman's greatest collaborators, Liv Ullmann, Bibi Andersson and Erland Josephson, create something truly astounding and truly unforgettable.","user":"ThreeSadTigers","rank":[22,24]},{"title":"My First Bergman","rating":10,"date":"10 June 2004","review":"Bergman is a name one hears so often, and it is so associated with slowness and close-ups that he's intimidating even before one gets to watch him.  I picked this movie off the shelf just as I could have picked any other of his movies, and since I haven't seen others, I wouldn't know how to compare this to the rest of his work.<br><br>But I liked it, I really liked it.  I didn't find it as 'slow' as much as 'focused,' where even the twitch of an eyebrow or a glance to the left is an action.  This minuteness was truly amazing.  In a lot of ways it reminded me of Bresson's Journal of a Country Priest. Because of this minuteness, I also found it very cruel and raw.  I am particularly thinking of the scenes with the animals (not only the sheep, but the dog as well, and especially the bird).<br><br>And I have to say something about the colors.  They were amazing, so warm and so different from the narration, which was in itself detached and indifferent (maybe 'disinterested' is a better word).  The light was amazing (like what seemed like an eternal sunset when Eva and Andreas have dinner). If this were a painting I suppose it would be realist or naturalist work, but the way the interviews cut in make it hyper-realist.  Other reviewers have criticized this but I found it as adding depth to the characters, because it gave them a new, real, life.<br><br>The English title is misleading though, because it forces the viewer to focus on Anna, whereas the original title doesn't do that.  I found myself waiting for things to happen to Anna until I found out that there was no reason for that to happen.  <br><br>I am very happy to have seen this, and will definitely not shy away from watching more Bergman movies.","user":"msultan","rank":[34,45]},{"title":"It's wonderful to see a film made with such care","rating":10,"date":"22 July 2001","review":"This is par for the course with Bergman, though. I have enjoyed all of his films that I've seen, which I admit is not many. This one touched me even more deeply than the others.<br><br>The topics touched on in this film include isolation, truth in relationships, mob mentality, but most importantly isolation from an emotional point of view. The interviews with the actors that are spliced into the film provide insight as well as divisions between sections of the narrative.<br><br>Perhaps what I liked best, however, is the inventive way the script reveals elements of the story. Sometimes a voice-over provides necessary information, and other times the information comes through the characters' conversations -- but never in an annoying \"quick exposition\" kind of way. For example: Although the affair between Anna and Andreas is the central story, it shows up in an odd place in the film.<br><br>But that is just one of the examples of the unusual construction that makes this film so unique and masterful. I recommend this to anyone who can read subtitles.","user":"Jeff-370","rank":[19,25]}]