[{"title":"Life's a city full of strange streets --","rating":7,"date":"29 August 2002","review":"A superior movie, except that the ending is completely contrived and unbelievable. Morgan Freeman generally gets the palm for his performance in \"Street Smart\" and deserves it for turning in a masterful performance. Called in to straighten out some difficulty between one of his girls and her trick, he calms everyone down, the soul of reason, until the trick is distracted, then Freeman kicks him in the family jewels and does a number of his face too. It's a shocking burst of violence. And his rattlesnake-like ability to strike quickly isn't limited to important economic confrontations either. During a basketball game, one of his shots is blocked. He shoves his opponent to the pavement, suggests that he'd look particularly good dead, then notices that everyone is standing around agape, smiles reassuringly, pats the guy on the shoulder and hands him a good deal of money to buy and bring back -- \"Some chicken, ribs, stuff like that.\" He calls out, \"Keep the change,\" to the grateful survivor of this encounter. All of Freeman's violence comes as a surprise, particularly when Chris Reeves tries to cool him down and Freeman whips around and holds a broken bottle before Reeves' face, with the steady, sure hand of a surgeon. Almost invariably, these episodes are followed by big friendly grins, pats on the back, assurances that things are back to normal, generous offers of food, drink, or money. The change takes place in less than a second. <br><br>Freeman is smarter than anyone else in the movie too. The main figure in a celebrated journalistic effort, he and his girl are invited to the publisher's party where everyone showers them with attention while they chat about \"the Hamptons.\" Afterward, Punchy exults over the attention but Freeman sees through it all. He knows condescension when he sees it, and he is filled with resentment. Trying to put something over on Freeman is like trying to slip sunrise past a rooster.<br><br>But Kathy Baker as the used Punchy deserves credit as well, although her part isn't nearly as showy and dramatic as Freeman's. She's just beyond the bloom of youth, rather used looking and heavily made up, and her figure, while ripely pleasant wouldn't draw stares in a supermarket. She's very appealing indeed in her vulnerability and aloneness.<br><br>Chris Reeve is usually ignored in reviews. I don't know why. He's rarely anything but bland, but this is by far his best performance, and he invests his character with ambition, confusion, fear, and compassion -- not an easy role. The scene in the hotel bedroom with Kathy Baker, in which she seduces him knowing that behind that facade of journalistic objectivity lies a man who would just love to get it on with her, whether or not he realizes it. She demonstrates how she made it with her first john and makes Reeve play the partner. The silly made-up dialog fades and is replaced by \"Natural Woman\" on the sound track. The two have a relaxed, enjoyable-looking, mutually appreciative little love scene. <br><br>It's a pretty good movie and involves us emotionally in several different ways. Alas, as I say, the end is almost an embarrassment. The bumbling Reeve character turns into a genius, and other characters into the fools they never were. Don't let that stop you from watching this.","user":"rmax304823","rank":[25,28]},{"title":"the casting of Freeman, and even to an extent Reeve, make up for faults in Street Smart","rating":7,"date":"15 August 2008","review":"Jerry Schatzberg (Scarecrow, Panic in Needle Park) can be an attentive director to the mundane and the types of people in urban environments left by the wayside, but he needs something of a really powerful script to work with. For some of its powerful and intriguing and sometimes oddly funny scenes, Street Smart doesn't have a great script. It is mostly conventional, in fact, tailored for Christopher Reeve's pet project (apparently he got to star in this thanks, and/or no thanks, to Superman 4), and it is also tailored for what Reeve can do as a somewhat limited actor. He's a great star in the sense of his presence and charm on camera, but can only be taken so far as to how he can work with other actors, or what he has to work with which is usually not very much. Thankfully, there's one actor that shoots to the moon and outshines everybody by a mile, particularly for this kind of project.<br><br>(Reeve's) character Jonathan in Street Smart is a journalist who's down on his luck with stories until he comes up with a sure-fire bet to spring him back: the day in the life of a pimp for New York magazine (yes, New York has done and still does these kind of profiles). At first, he just makes it up with a person named 'Tyrone'. But it turns out his story, which includes details of a murder, fits relatively (or a lot) with Fast Black (Morgan Freeman), a take-no-prisoners thug in the guise of a man of the streets who is a force of evil, but a devilishly charming one at that, turning on a dime from street-savvy pimp to ruthless abuser and, as it turns out, killer. Jonathan thinks it'll be alright despite what was or wasn't in the written piece, and meets with and follows along Fast Black for a day. It soon starts to go further down from here.<br><br>Schatzberg does best in capturing this now (thankfully) wiped-away street life and porno district along Times Square and in other parts of New York, going along at times casually- too casually perhaps- in getting this mood down. He also neglects certain things in the story, like the importance of Jonathan's own flaws and fooling around with a prostitute, and some details about him as a TV news reporter. And yet, even with faults in the writing, Schatzberg got one thing incredibly right: casting Freeman as Fast Black. This is a part that could have been played up, maybe even as an exploitation flick, but Freeman takes hold of it and creates his breakthrough film performance (it was shortly after this he got Lean on Me and Driving Miss Daisy). It would be one thing if he hammed it up, but somehow he doesn't; his Fast Black is a lucid, hot-headed, vicious but somehow human villain in Street Smart, and he ends up bringing out the best in Reeve and Kathy Baker and his other co-stars like his prostitutes, including one terrifying scene where one asks to quit.<br><br>Years from now, when Freeman likely will get some AFI tribute or something or lifetime achievement on TV, Street Smart might be neglected among his most famous parts but shouldn't be. It's a case of an actor raising material, which is neither spectacular or mediocre but just about alright 80s material, higher than it deserves to be, which is both a credit to him and to Schatzberg for reeling him along just right.","user":"Quinoa1984","rank":[15,16]},{"title":"Very good movie. One of Morgan Freeman's best!","rating":4,"date":"4 January 2001","review":"This film brought Morgan Freeman to my attention for the first time. After, I became a devoted fan. The \"scissor scene\" between he and Kathy Baker was absolutely chilling and a tribute to both actors. I was mesmerized. The love scene between Christopher Reeves and Baker was sensuality personified.","user":"risaacs","rank":[16,18]}]