[{"title":"quick reviews!","rating":8,"date":"26 May 2004","review":"Here we goI don't care what anyone says, this is funny. Yes the series gets worse with each film, but any of the first 4 are better than any American Pie, or any teen comedy ever. The characters have already been established, with the main additions being Bobcat Goldthwaite as Zed, who is endlessly funny, and Mauser as the rival Cmndt. Plot? There are two Police Academies; one must close so a series of competitions are set up to see which is better. Mauser recruits Copeland and Banks from Lassard's school as traitors, but Mahoney and crew eventually prove the better. But these movies are not about plot. Some would say they're not about comedy, or anything else, but as a kid, nothing made me laugh more than these films. And they still do. Jones makes loads of noises, Tackleberry watches his in laws punch each other, Mahoney makes his usual comments, but Zed and Procter are my favourites here. The Blue Oyster Bar is back, and other scenes that keep me laughing are the arrival of Sweetchuck to the Academy, crashing into the car, and Zed singing to make a door fall. I see why people find these completely irritating, but I'm pis*ing myself thinking about them. While I was reading some of the (mostly negative) reviews of this, where people were slagging off the parts they didn't find funny, I was in stitches. May say something about me-but that's something I'm not ashamed of.<br><br>8 out of 10","user":"malkane316","rank":[21,23]},{"title":"Revenge of the 80's: Multiple sequels.","rating":6,"date":"9 January 2005","review":"Police Academy 3 (1986) The inmates are now running the asylum. Mahony and company are now instructors at the place they once attend. Running out of ideas and funny situations, the film starts to repeat (ad naseum) many of the gags and punchlines from the first two films. While new characters are being added to the series, a few old one decide to leave (for good). If you notice, the bigger the star Steve Guttenberg becomes, the lesser screen time he gets. Oh well.<br><br>Slightly recommended. If the producers have thought with their heads instead of their pocket books, they should have put this series to bed instead of dragging it out and running the series until the wheels and the engine fell off.","user":"Captain_Couth","rank":[12,14]},{"title":"It's Back To School","rating":20,"date":"20 August 2002","review":"(POSSIBLE SPOILERS) Police Academy 3:Back In Training is a brilliant film which returns our heroes back to the academy.<br><br>Since the second film, Mauser has been promoted to Commandant in charge of his own academy...but his job may be in jeopardy. The state decides that it cannot finance two academy's so a competition is declared between Eric Lassard's academy and Commandant Mauser's academy.<br><br>All the favourites such as Mahoney, Jones, Hooks, Hightower and Tackleberry are back to help train the new recruits which include Zed (the punk from the second film)and Sweetchuck (the little wimp from the second film). We also see the return of the sneaky Kyle Blanks and Chad Copeland. Copeland and Blanks are in cahoots with Commandant Mauser who wishes to discredit Lassard's academy.<br><br>As usual, there are some great scenes. My favourite scenes were the sneaky Sergeant Proctor ending up nude on the streets, Mauser losing his eyebrows and the ending where the new recruits chase the bad guys on speedboats.<br><br>All in all, Police Academy 3 is a damn good film.","user":"Big Movie Fan","rank":[5,5]}]