[{"title":"\"The film that stopped the sun\"","rating":30,"date":"30 October 2003","review":"How incredibly appropriate if not downright eerie that the sun should turn on a full eclipse during the filming of BARABBAS that was captured by the Technirama 70 cameras for the crucifixion scene.<br><br>Arguably the \"forgotten epic\" when talk of the 60's blockbusters brings inevitably mention of BEN HUR, KING OF KINGS, FALL OF THE ROMAN EMPIRE, SPARTACUS, LAWRENCE OF ARABIA, GENGHIS KHAN, CLEOPATRA, SODOM AND GOMORRAH, etc. Many see in this film an individual depth and emotion, lacking in other such works. Quinn in fact brings (despite the poetic license taken with historical confirmation) to Barabbas, a portrayal of a man tortured by his past, his reason to still be alive and his destiny. From the claustrophobic escape from the sulphur mines to his gladiatorial deeds in the arena, Barrabas is a driven man of open-ended religious conviction. He embraces Christianity but does he understand it? He saw Christ die in his place and lived his life to find out why!<br><br>Palance whose face has been his career, was the ONLY choice as Torvald the head gladiator who lives only to kill! It was one of his best ever roles.<br><br>\nI saw this film in London at its premiere in 1962. It received luke-warm critical reception at the time but had a successful run in the West End of some six months or so. Has had far less screening on television and cable than other epics of its ilk which is a pity as it had a lot to offer the discriminating viewer.","user":"uds3","rank":[61,76]},{"title":"Just Where Do Some of Those Peripheral Bible Characters Go?","rating":7,"date":"7 December 2005","review":"I've often wondered at times from a literary as well as religious point of view what happens to some of the peripheral cast of characters in the Scripture. I'm sure that's a question that more than a few have pondered on, whether they are believers or not.<br><br>Case in point is Barabbas. All we know about him is that he was the guy that the mob shouted for when offered a choice between pardoning him or Jesus of Nazareth. Some tradition has him as a common bandit, others have him as a rebel against Rome. <br><br>As played by Anthony Quinn, Barabbas is a troubled soul. As the message of Jesus of Nazareth spreads, Barabbas is unsure of what his role is. He's realized he's been a participant in something historic to say the least. But people treat him differently. The early Christians view him with some resentment. To Pontius Pilate, played by Arthur Kennedy, Barabbas is still a no good bandit. Of course Barabbas gets himself arrested again and begins his odyssey.<br><br>The movie is an adaption of a novel by Swedish Pulitzer Prize Winning writer Par Lagerkvist and a Swedish film adaption had already been filmed prior to this international cast epic. Might be interesting to view it side by side with this one. I'm sure the Swedish film didn't have half the budget this one did.<br><br>The movie fuzzes certain issues as films of this type generally do. Pacifism is a tenet of the early Christian faith of those hiding in the catacombs. Turning the other cheek is a big thing. But Anthony Quinn isn't a Christian so his modus operandi isn't exactly turning the other cheek.<br><br>Some top flight professionals are in this cast. The aforementioned Arthur Kennedy as Pilate, Silvana Mangano as Barabbas's girl friend who becomes an early convert, Vittorio Gassman as Sahek who is Barabbas's martyred Christian friend and most of all Jack Palance in a scene stealing performance as the top gladiator in Rome. You should watch this film for him alone.<br><br>The message the film tries to convey is that Barabbas in and of himself wasn't important. Jesus's life and death were pre-ordained and it could have been Barabbas or any of hundreds of others who could have been where he was. <br><br>But the way certain folks enter into biblical stories does give writers a whole lot of license to construct wholly fictional lives around them. This is as good a film as any for that purpose.","user":"bkoganbing","rank":[49,62]},{"title":"Among the best of all Biblical epics","rating":9,"date":"17 April 2006","review":"Richard Fleischer was a good jobbing director but there were occasions when he seemed inspired. \"The Vikings\" is one of the great genre movies and \"The Boston Strangler\" is one of the best police procedural films ever made. This is very much in the same class and has much to commend it. It's biggest drawback is that the early scenes never quite shake off the enforced piety that engulfed Hollywood movies that centered on Christ. Is it any wonder that Monty Python lampooned such movies in their \"Life of Brian\"? On the other hand, coming as it does from a novel by Nobel prize-winning author Par Lagerkvist and scripted as it is by Christopher Fry, the film is more intellectually challenging than we have any right to expect, (for example Barabbas has a discussion with Lazarus on what it was like to have died and then to be raised from the dead), while at the same time not skimping on the spectacle, (the gladiatorial scenes are superb).<br><br>It begins with the freeing of Barabbas in the place of Jesus, then follows him on his own journey of redemption as he realizes that it was through Christ's death that he came to live. It's a theme, of course, as old as the Bible itself and as religious movies go it's a bit simplistic but it does work on a primitive, intellectually jarring level and it doesn't thrust it's religiosity down our throats. Barabbas' journey of discovery is long, slow and painfully questioning and is consequently quite moving.<br><br>No one in the large, international cast gets to rise above being a Biblical or gladiatorial cliché with the exception of Anthony Quinn in the title role. He is excellent and had yet to give way to the bombast of Zorba the Greek. Still, neither Quinn's performance nor the film have ever been given their due. Perhaps a movie about the man who lived so that Christ might die proved unpalatable. Nevertheless, it is certainly worth rediscovering.","user":"MOscarbradley","rank":[28,35]}]