[{"title":"Romantic comedy about young love.","rating":6,"date":"6 May 2000","review":"Writer John Hughes has the 80's pegged. But this story could have been set in the 50's or 60's and still worked well. That is why I think this movie is so relevant. Devotion, friendship, and self worth are quizzed. The young actors were better than expected. I have watched this over a dozen times and I don't care if some people refer to this as a \"chick flick\".<br><br>A young girl falls in love with a boy from the other side of the tracks. Problems occur when his peers think the object of his desires is socially beneath him. <br><br>Molly Ringwald was very good. Andrew McCarthy and Jon Cryer seemed to feel their part more than the rest of the cast. But James Spader was such a realistic jerk, you want to get up and punch his face in. Harry Dean Stanton and Annie Potts play the adult roles of substance. Have you ever seen Stanton so sympathetic? <br><br>A very upbeat soundtrack keeps the movie flowing and helps you feel the atmosphere. Don't write this off as just another teen movie. Highly recommended.","user":"michaelRokeefe","rank":[72,80]},{"title":"John Hughes knows the 80's!","rating":9,"date":"29 July 1999","review":"It is hard to believe that this was 13 years ago.  Has it really been that long since we said goodbye to the Brat-Pack?  When I watched Pretty In Pink it made me laugh, but more importantly it brought me back to a time that was fun, had less pressure ( in some ways ), and there were a plethora of films that were made aimed at us teens.  The early 80's will at least partly be remembered as a time when teen flicks ruled.  Everything from Fast Times and Porky's to The Breakfast Club and Pretty In Pink, they were all there and they all tried to do the same thing.  Entertain.  Sure John Hughes always seemed to have some heavy issues in his films, but ultimately his films were there for us to enjoy for 90 minutes.  Pretty In Pink is one of the best at accomplishing that.<br><br>What makes this film such the standout that it is, is everything really. The actors were fresh and cool.  The dialogue was smart and easy for us to relate to.  The situations of love covered areas that we have probably all been through.  There was the unobtainable love that just seemed like a fantasy.  There was the two really good friends, one male and one female, that just weren't meant to be lovers and the heartbreak that one is inevitably going to experience.  There was perhaps not being accepted by your love interests peers and so on.  Watching this film I could understand how Duckie felt.  I could feel his anger when he watches his best friend, and his secret love interest, date the personification of what ( and Andie ) consider the personification of snobbery.  She has probably complained many a night about how she is tired of being treated unfairly just because she wasn't born with a silver spoon in her mouth, and now she dates one.  I could feel Ducky's pain.  And that can be attributed to John Hughes for writing a brilliant script, but also to Jon Cryer for making his character what he is.  You can sense his insecurities and his undying devotion to a girl that he knows he will probably never get.  And when he sits with Andies dad and chats about love, there is one of the greatest lines in the film. Jack ( Harry Dean Stanton ) tells him that you can't force love, it is either goging to happen or it isn't.  You can't control these things.  And that is what makes love so painful.  While you may be perfect for someone, that someone wants the perfection of someone else.  And that sucks, love's a bitch Duck.  Love's a bitch.<br><br>Pretty In Pink epitomizes everything that made the 80's a great time for teen flicks.  Secret loves, proms, a great soundtrack and John Hughes. What more can you ask for?  This is one of the best.","user":"baumer","rank":[72,86]},{"title":"A cute love story spoiled by a slightly disappointing ending.","rating":7,"date":"20 June 2004","review":"PRETTY IN PINK is the tale of an original, but slightly outcast, girl named Andie Walsh (Molly Ringwald) who is from the poorer part of her town. She never minded this until one day when the rich, \"preppy\" Blane McDonnagh (Andrew McCarthy) asks her if she'd like to go out sometime. All of Blane's rich preppy friends immediately disapprove, and Andie gets caught in the middle when her own best friend Duckie (Jon Cryer) disapproves as well. Andie decides to go out with Blane anyway, although their first date ends up being somewhat of a disaster. Blane takes Andie to his friend Steff's (James Spader) house party, where nearly everyone snubs her, and Andie is embarrassed to let Blane see where she lives and what kind of house it is. In the end, Andie has to decide whether pursuing potential love is worth the humiliation she receives from everyone else for doing so.<br><br>PRETTY IN PINK is the last of the three famous Molly Ringwald-John Hughes collaborations, and is also the least favorable, in my opinion. Which is not to say that it's not a good movie, though. While its two predecessors dealt more with status and popularity issues, this movie deals with a more serious topic of class differences. However, I find this to be a pretty unrealistic scenario by today's standards and not very easy to relate to, in my case at least. However, the whole concept of two lovers dating despite their differences and everyone else's disapproval is pretty cool and receives my commendation. The ending, though, is a bit of a disappointment.<br><br>What I really commend the movie on, however, is its portrayal of what love is really like. It manages to show just how beautiful it can be at times, and just how destructive it is most of the time. Having experienced something similar to Andie's struggle, I have to say that that feature of the movie made it a lot more personable and relatable for me, taking on a deeper meaning than it probably would for others who haven't experienced such a battle.<br><br>As far as technical aspects go... well, what can you say. The acting is terrific, namely from the always-great Molly Ringwald and the spectacularly wacky Jon Cryer as the film's most memorable character by far, Duckie. Jon Cryer easily delivers the film's best performance, along with most of its best lines. Annie Potts is also wonderful and funny as Andie's coworker Iona. John Hughes was a great director, even though his area of expertise was '80s teen movies--but, let's face it, no one could have done them better.<br><br>To wrap it up, PRETTY IN PINK is a cute love story with fantastic acting and characters that manages to capture a bit of the true essence of love, even if it is a bit disappointing in the end. 7/10.","user":"sublime501","rank":[60,75]}]