[{"title":"One of the great movies","rating":9,"date":"6 October 2005","review":"Whether or not you care a hoot about westerns or western scenery, whether or not you like Gregory Peck or Jean Simmons, whether or not you like movies with action - this is a powerful moving experience.<br><br>The movie has so many Shakespearean tones - the father-son relationship, the rival families, the mismatched romantic couple - it will remind you of so many of his plays. It was also said to be Wyler's comment on the Cold War - and probably also reflects the feelings of a director who grew up in Alsace-Lorraine and felt from birth the enmity between the French and Germans before World War I.<br><br>One of the things I most enjoyed was the way in which the viewer had some sympathies with every single one of the seven main characters.<br><br>The least sympathetic is probably the Chuck Connors role -- yet even with him, one feels right from the start his dynamism, his love of life, his all-too-human pleasure in things. He's not a simple bully - in some respects he could easily fit in with the trio of Gunga Din who burst from windows, enjoy women to the fullest if they aren't tied down, play tricks, and live life to the fullest. The director makes us FEEL the joy of Connors and his brothers in showing off, in their daring, their vivacity when we see them on horseback early in the movie.<br><br>The most sympathetic are Peck and Simmons - and wow, what a combination. They were born to play opposite each other - and it's terribly sad that this is their only pairing.<br><br>Charles Bickford, Burl Ives, Carroll Baker, Charlton Heston, we feel with each one. For example, Baker is given a wonderful scene in which she pleads that she will do whatever it takes to get Peck back, apologizes for her behavior, insists it will never happen again. She is shallow, too young for Peck, concerned enormously with appearances - yet Wyler shows us a warm creature easily capable of love and affection.<br><br>We feel with Heston - who has grown up loving a woman who has put him in his place and who has now tied herself to a stranger - who will presumably in time became his boss even though Heston was raised as practically a stepson to Bickford. We see Heston subtly change over the course of the film - to an independence of Bickford that is wonderfully done.<br><br>The astonishing courage of Bickford's character, his stamina, his truly rugged independence, his native refinement, and his outrage at the coarseness of the Hennessys, is so well-drawn.<br><br>Ives' character is brilliantly drawn too - a great sense of fair play, an admiration for gentlemen - which he is decidedly not and knows - a feeling that he has never gotten much of what he wanted, his disappointment in his son - these are fascinating to see.<br><br>This is really a great movie - with great characters who themselves cause the plot to go the only way it could.<br><br>My only objection is the too neat ending - but Simmons and Peck just looking at each other is SO right.<br><br>Don't miss this. It is both powerful and subtle - it is never rushed and devotes time to the development of all the seven characters which I find quite rate in movies generally.<br><br>Thus, we see Simmons and Baker together alone - and Baker's comment, \"You always think you know everything\" to Simmons gives us a pretty strong idea of their characters' relation before the movie ever began.<br><br>We see Heston alone with Baker - his barely suppressed desire breaking out - and her feeling that he is beneath her.<br><br>We see wonderful scenes of Bickford and Heston alone together - and the great scene where we realize that the men hold with Heston far more than with their nominal boss when they refuse to go where Heston won't go.<br><br>This is monumental - fascinating - very American - and wonderful.","user":"trpdean","rank":[34,34]},{"title":"Magnificent","rating":10,"date":"23 June 2005","review":"As a rule, I don't like westerns. This isn't because I'm a city slicker (though now, I do live in a city). I grew up in rural Eastern Oregon where \"real\" cowboys still herd their cattle through the center of town in John Day, Oregon. My stepfather owned a 10,170 acre cattle ranch. After being raised among \"real\" cowboys, the Hollywood versions tend to leave me flat. The Big Country was an exception.<br><br>Jim McKay (Gregory Peck) introduced us to a different kind of man, far different than most stereotypical men of the Wild West. If I were to compare McKay's character to any other film character, it would be Ghandi. He's a man who doesn't feel obliged to seek the approval of others ... a man who believes that violence doesn't need to be used to solve problems. His secret ride of Old Thunder, making Ramon (Alfonso Bedoya) swear to keep quiet regardless of the outcome, set the tone for McKay's character. His later secret fight with Steve Leech (Charleton Heston), making him swear to keep quiet regardless of the outcome, cemented that tone. This was a REAL man whose opinion of himself was not dependent upon anyone else's opinion ... in stark contrast to anyone else in the film outside of Julie Maragon (Jean Simmons). As Ramon said, \"Such a man is very rare.\"<br><br>Outside of McKay, my #2 favorite character in the film was Rufus Hannassey (Burl Ives). I found nothing about him distasteful considering he was a character whose back was against the wall ... whose livelihood was threatened. The things he did make perfect sense in such a situation. His only flaw was his obvious poor parenthood. He really blew it with Buck (Chuck Connors) and Buck's siblings were of the same ilk.<br><br>I'm so glad that MGM/UA finally released the widescreen version in 2001. This is a film that deserves such a presence. It may not be playing in theaters anymore but seeing it in any other display size takes so much away from it. I've seen the pan/scan version before and will never go back.<br><br>One note. The full listing of writing credits for the film adaptation is lacking. \"Ambush In Blanco Canyon,\" originally serialized in a magazine, was later novelized into \"The Big Country\" by Donald Hamilton ... and Hamilton also worked on the adaptation as well as Leon Uris (\"Topaz,\" \"Exodus,\" \"Gunfight At the OK Corral,\" etc.).<br><br>This epic film was not lacking for anything. It had the best writers, the best actors, the best musical score, and the best scenery of any other film of its time ... western or otherwise. And the film remains one of my favorite films of all time.","user":"alecwest","rank":[139,155]},{"title":"\"How Many Times Does A Man Have To Win You?\"","rating":9,"date":"30 January 2006","review":"The Big Country is one big and fun western with concurrent plot lines. The first is the struggle between two implacable enemies, Charles Bickford and Burl Ives. The second is a four sided romantic triangle involving Gregory Peck, Jean Simmons, Charlton Heston, and Carroll Baker with Chuck Connors trying to horn in.<br><br>William Wyler directed the almost three hour western with a sure hand and your interest does not wane for one minute in this film. Gregory Peck also was a co-producer on this film as well as the first billed. He had a hand in casting a lot of the film, specifically Burl Ives in his Academy Award winning performance as Rufus Hannessy.<br><br>It's the Terrills versus the Hannessys. Charles Bickford is the local Ponderosa owner Major Terrill. Presumably the title comes from the Civil War. Bickford does play Terrill with a military bearing. My guess is that he was a Yankee soldier.<br><br>The Hannessys would now be called white trash. They look like hillbilly folk who also came west for fame and fortune. They've also got a big spread in a place called Blanco Canyon. They hate the Yankee Major as much as he hates them.<br><br>Sitting between them is Jean Simmons who has inherited a modest piece of land that sits across a river that both outfits water their cattle on as per an agreement with her late grandfather. She doesn't work the land herself any more, she teaches school in town. <br><br>Simmons tries to keep above the feud. She is friends with Carroll Baker, Charles Bickford's daughter. She's been east and is bringing home a prospective bridegroom who is a former sea captain played by Gregory Peck. That doesn't sit well with Charlton Heston who is the Terrill foreman. He's got eyes on Baker himself and Chuck Connors who is Burl Ives eldest son has eyes for Simmons when he's not in the local bordello.<br><br>A lot of started and broken relationships and a few of the cast members being killed occurs in The Big Country. My favorite scene and line in the film is when Burl Ives gives some advice to Chuck Connors on how to woo and win Jean Simmons. His big advice is to show her how much you care by taking a bath occasionally.<br><br>Charlton Heston took a role that was fourth billed because he wanted the opportunity to work with William Wyler. That was one great career move because Wyler and he hit it off so well that Wyler signed him for the lead in his next film which turned out to be Ben-Hur. Heston in his memoirs, conservative as he became, says he also got along very well with Gregory Peck who he called a \"thinking man's liberal.\"<br><br>Peck and Wyler had worked together previously on Roman Holiday and had done good work there and also hit it off. However with Peck as a co-producer as well as star they had some clashes on the set. One notable one involved Peck wanting to retake the carriage scene where the Hannessy brothers attack Peck and Baker on the way to the Bickford ranch. Peck wasn't satisfied and wanted a retake. Wyler who was legendary for doing scenes dozens of times until he got what he wanted refused. Later when shown the finished film, Wyler had edited out and around what Peck didn't like and it came out OK. They remained friends, but never worked together again.<br><br>Simmons as the independent minded school teacher and Baker as the spoiled daddy's little girl acquit themselves well in their roles. Baker is disappointed in Peck not seeing him as her ideal western man and Simmons upbraids her with the quote I put in the review title.<br><br>This is also the final film of Alfonso Bedoya who never did get a role in an American film as good as the one he had as Gold Hat in The Treasure of the Sierra Madre. Still this is a fine farewell performance to a very colorful and talented player.<br><br>When he's on the screen Burl Ives dominates and fills it and not just physically either. Rufus Hannessy may not be to the manor born, but he has his own sense of integrity and fair play. All that Burl Ives captured in Rufus and The Big Country is worth watching just for him alone.<br><br>And that Jerome Moross score; simply one of the best ever done in the history of film.","user":"bkoganbing","rank":[129,148]}]