[{"title":"CARRY ON COWBOY (Gerald Thomas, 1965) ***","rating":7,"date":"12 January 2008","review":"This is not only one of the best sustained efforts from the “Carry On” crew but a classic film in its own right. I had mentioned it as a rare example of a British Western spoof when I recently watched THE FROZEN LIMITS (1939) with The Crazy Gang; incidentally, the film’s style is pretty close to that of BLAZING SADDLES (1974) – but it actually anticipates Mel Brooks by almost a decade! <br><br>There are so many inspired gags in this outing (right from the opening sequence with the black-clad Rumpo Kid arriving in town and immediately gunning down three men, only to then ask himself “I wonder what they wanted?”) that it’s hard to remember them all – even a mere couple of hours later. Notable, however, is the merciless lampoon of the Wyatt Earp legend by making its namesake here (played by soon-to-be Dr. Who Jon Pertwee) – and whom the Mayor even addresses as Twerp – completely useless, being both short-sighted and hard of hearing! <br><br>The “Carry On” stalwarts are in top form, foremost among them Sidney James (as the afore-mentioned Rumpo Kid, amiable outlaw leader – in urgent need of cash at the saloon, he excuses himself to casually hold-up the bank situated just opposite!), Kenneth Williams (as the Mayor of Stodge City – reportedly, he lifted his American accent from legendary comedy producer Hal Roach), Jim Dale (as Marshall P. Knutt, a sanitary engineer mistaken for the new sheriff because of his name!), Charles Hawtrey (as the unlikeliest Indian Chief ever – he’s actually introduced emerging from a tepee-cum-lavatory!) and Joan Sims (as the traditionally sultry saloon hostess); besides, Angela Douglas (who subsequently appeared in three more “Carry Ons” and would later become Mrs. Kenneth More!) – playing the real-life Annie Oakley – makes for an extremely charming gun-toting heroine.<br><br>The last third of the film turns into a spoof on the seminal HIGH NOON (1952) – with Dale left to face James and his gang alone in a delightful, and most original, climax. Incidentally, the sheriff’s heroic resistance of a stagecoach raid by Hawtrey’s Indian warriors (ending with James – who engineered it – disappointingly quipping, “I’ve met braver cowards than you braves!”) was actually the work of Douglas i.e. in the vein of THE MAN WHO SHOT LIBERTY VALANCE (1962); Dale’s subsequent awkward coaching in the handling of firearms, then, is hilarious. Another influence from classic Westerns is in the catfight between Sims and Douglas – in this case drawing on DESTRY RIDES AGAIN (1939).<br><br>While CARRY ON COWBOY’s send-up of a popular genre easily makes it one of the gang’s best-known entries, I was surprised to learn that it’s not held in highest regard by even staunch fans of the series – such as the people behind the official “Carry On” website, citing its (deliberate) lack of authenticity as a major drawback; I couldn’t disagree more since, to my mind, the level of humor and ingenuity displayed throughout is soaring indeed for this erratic (and idiosyncratically crude) brand-name...","user":"Bunuel1976","rank":[16,20]},{"title":"Carry on in the saddle","rating":8,"date":"12 April 2006","review":"I have a weakness for western movies and maybe that's the reason why I enjoy this one so much when I find so many others in the series to be bland and boring. It predates Blazing Saddles and, to my mind, makes better use of genre clichés.<br><br>Sid James is superb as the Rumpo Kid. As are the rest of the regulars though Kenneth Williqams' accent takes some getting used to. The studio sets look suitably like the American frontier and the plot involves all the western conventions from cowardly sheriffs, Indians and the obligatory bar room brawl. <br><br>Carry on laughing indeed.","user":"authorwriting","rank":[11,14]},{"title":"What A Lark!","rating":18,"date":"18 June 2004","review":"I wasn't sure if Carry On Cowboy was going to be English tourists to the American west or not.<br><br>Well, it wasn't. I wanted to compare it to the Doctor Who episode \"The Gunfighters\" but to tell the truth, that wouldn't be fair.<br><br>This was actually good. No reason why the American accent, western or otherwise, should be difficult for these skilled masters of the language to duplicate.<br><br>Kenneth Williams was lost however in his mayor. Shockingly interesting to see him delivering such a performance, but they should have done more like Carry On Cleo and allowed the caricatures they portrayed to still shine through.<br><br>Or better yet, do some mock-up of the dialects like \"Allo, Allo\" used to do.<br><br>Then it was extremely funny for Hawtrey to not attempt anything different when doing the native chief.  <br><br>As an American, I can point out one cliche that was inaccurate. When Williams was shocked at the dancehall girls. That was always a man of the cloth, never a politician. But then I suppose he was sticking to the Kenneth Williams' Carry On persona, wasn't he?<br><br>Sid James really surprised me with his western speech. I was waiting for some \"oy\" or \"look 'ere, mate\" to slip out, but either it never did or I wasn't paying attention. <br><br>Jim Dale looks like Michael Palin. That was half who I thought it was when he was in \"Carry On Spying\".<br><br>And then there was that monster of a scene-stealer again, the soothsayer from \"Carry On Cleo\" this time as the sheriff. What a talent this underrated fellow, Jon Pertwee, was. <br><br>Best known for a sci fi tv show, a good one, yes, but still.<br><br>\nAs I sit with just one more \"Carry On\" that I possess on DVD to review (I've already watched it), I can say that for some odd reason \"Carry On Teaching\" was my fave, perhaps because it was the first one that hit me funniest and raised my expectations, whether they were met or not, I can honestly say I didn't know what to expect here.<br><br>Well, on to the last Carry On film in this set: Carry On Screaming.","user":"richard.fuller1","rank":[12,16]}]