[{"title":"The Edge of Avant Garde Cinema","rating":10,"date":"4 April 2011","review":"This is a fantastic film from Dziga Vertov. It is quite personal and yet shows the intense and varied activities of numerous people in the Soviet Union of 1924. It is as artistic and creative as anything being done in the United States or Germany at the time. It was cutting edge cinematic constructivism.<br><br>It is interesting to compare this film with Vertov's \"Three Songs of Lenin\" ten years later. While \"Kinoeye\" is interested in showing the truth about life and the world, \"Three Songs\" is only interested in dogmatic praise of Lenin. The two films show the difference between the Soviet Union of Lenin and the Soviet Union of Joseph Stalin. This film shows people drinking, smoking, taking cocaine, and joking. We see disfigured people in an insane asylum, we see a homeless boy sleeping in the streets and a man who died in the streets. In contrast to this, in \"Three Songs,\" everybody is heroic and everybody is marching forward, there are more machines than people, and the film suggests that Lenin magically solved all the problems of the past. One can argue that the Soviet Union was facing the threat of Nazi Germany in 1934 and therefore needed heroic militaristic films to inspire their people. The same images of poverty and people just surviving day to day, that we get in \"Kinoeye\" would not have inspired people faced with the threat of Nazi insanity.<br><br>These things are hard to judge, but when socialist realism turned into socialist heroism and only showed the good and strong instead of showing everything, I think it took a big step away from the truth. I should like to think that Lenin would have loved \"Kinoeye\" and hated \"Three Songs of Lenin\". After all, he never flinched from looking upon and seeing the darker sides of reality.","user":"jayraskin1","rank":[8,8]},{"title":"An Interesting & Creative Early Vertov Feature","rating":17,"date":"17 February 2005","review":"This is an interesting and creative earlier effort by Dziga Vertov, and \"Kino-Eye\" often shows the same kind of imagination and experimentation that reached near-perfection in his later feature \"Man With a Movie Camera\". The distinctive style is quite recognizable, and the experimental sequences - many of them using camera tricks - are quite resourceful.<br><br>Although there isn't a story in the conventional sense, two common themes hold it together and give it substance beyond the individual sequences. In terms of content, the activities of the Young Pioneers form the connection between the numerous short sequences. The various experiments and special camera effects themselves form the other main thread, because they are much more than mere visual tricks. In every case, they represent Vertov's effort to take the obvious, literal images that are inherent in the material, and to project them to an extreme that is either perfectly logical or perfectly impossible, depending on one's point of view.<br><br>In most of Vertov's features, he is openly interested in promoting what he considered to be the virtues of the Soviet state. Yet the interesting thing about his best features, of which this is one, is that they also have a timeless quality, because - whether he realized it consciously or not - his way of looking at things sometimes goes well beneath the surface, and when it does, it can bring out themes that underlie humanity in general, without respect to political systems.<br><br>\"Kino-Eye\" is certainly not as polished as \"Man With a Movie Camera\" - in particular, it could have benefited from tighter editing and selection of material - but it is definitely worthwhile in itself. Not only can you see Vertov's technique in a stage of advanced development, but the movie also has some material and sequences that are quite interesting in themselves.","user":"Snow Leopard","rank":[9,11]},{"title":"Just enjoy the pictures (and the kids' faces)","rating":8,"date":"28 September 2006","review":"I watched this movie after being completely blown away by Vertov's \"Man with a Movie Camera\". No, it is not the same (not nearly as abstract), and, yes, it certainly qualifies as 1920's agit-prop. But there are many, many beautiful little moments and wonderful little scenes with children, showing innocent yet enthusiastic faces, energy and passion.<br><br>Looking past the inter-titles and the propaganda aspects, this remains thoroughly enjoyable and still an amazing piece of work given the 1924 date of the movie. It's real Vertov (his style is apparent from almost every frame), and if you like his other pieces, this will certainly be worth watching. The editing also worth noting.<br><br>The bouncy semi-pastiche soundtrack on the version I watched did not help much --- I turned it virtually all the way down.<br><br>Just amazing, here I'm sitting in South Africa, in 2006, having watched a movie from 1924 --- perhaps the greatest thing about the DVD standard!","user":"cmischke","rank":[5,6]}]