[{"title":"Steve Martin's Most Enduring","rating":8,"date":"25 November 2002","review":"Roxanne is probably going to go down as the pinnacle of Steve Martin's career as both an actor and a writer.  Granted, he's made better movies (L.A. Story, The Man With Two Brains), but this is the one movie that seems to have grabbed the public's attention and keeps bringing them back.  And that's because it's deceptively simple, the story of the underdog falling for the girl who has it all.  It's peripherally based on Cyrano de Bergerac, but most people haven't read it (or even seen a movie adaptation), so much of the intricacies will be lost.  But everyone can identify with the main character, C.D. Bales, and the story of his doomed love.<br><br>The movie is a romantic comedy, but that's too simplistic.  It's full of incredible situational and verbal humor.  Whether he's playing a slapstick routine trying to leave Roxanne's apartment or trying to think up the (more than) twenty insults that would be better than `Big Nose,' Martin's pen rarely falters.  He can do drama, as evidenced by the scene on the roof with the overweight kid. And he writes compelling poetry: when C.D. speaks from his heart under Roxanne's window it threatens to turn hokey at any moment, but never does. The power of the movie is in the screenplay, and Martin's written a doozy.<br><br>Of course, it also doesn't hurt that C.D. is such a sympathetic character. Actually, sympathetic is probably the wrong word.  He's such a strong and dynamic character that every man would want to be him and every woman would want to have himif it weren't for that stupid nose of his.  Think about it: he's athletic, charming, well-read, witty, and handsome.  And that's what makes it even worse for the viewer: knowing all these wonderful things are stuck inside this man and people can't see past his nose, pun not intended. Martin totally inhabits C.D. Bales: he knows him so well that it's second nature.  He looks like he's having a blast with it, too, which helps the audience quite a bit.<br><br>It's not all Steve Martin, though (although it seems like it at times).  The supporting cast does well with their roles and goes far beyond what I would have thought possible.  Example: Daryl Hannah, an actress with a hit-and-miss record that's mostly miss, is surprisingly convincing as an astronomy student who knows about sub-nuclear particles and comet trajectories.  Or Michael J. Pollard, who takes a role that's pretty much a series of one-liners and makes me remember him above all the other firefighters by the pure glee that he takes with every line.<br><br>It's certainly not perfect, nor is it Martin's best offering, but that's beside the point.  The point is that it's the kind of movie people really enjoy but can't put their finger on just why.  Well, the movie is smart, and that's why people find it refreshing.  It's not simply a cookie-cutter romance with the typical leading man and the regular lines: it's got a heart and humanity that most romantic comedies disregard as unnecessary. 8/10","user":"Dr.Teeth","rank":[53,57]},{"title":"Extremely effective updating of a timeless story","rating":9,"date":"5 August 1999","review":"I do not routinely enjoy Steve Martin, but was extremely impressed with the sensitivity and deftness with which he played Cyrano de Bergerac in modern guise. There is nothing archaic or stilted about the script, yet it is surprisingly faithful to the character of the original play (which in turn is closely based on Cyrano's true history). Numerous scenes - including most of the best ones - are lifted almost intact from the Edmond Rostand play, but a viewer who is unfamiliar with that source probably will have no idea which scenes they are. The poetry, imaginative spark and romantic instincts of the original play are handled lovingly and with finesse. Daryl Hannah is just right as a thoroughly modern Roxanne, willingly surprised to find that there is still romance in the world. You do not have to be familiar with the source to enjoy this witty, satisfying, and very funny movie - but if you are, you will enjoy it all the more.<br><br>Note added 2015: When I first wrote the above in 1999, Steve Martin had not yet done most of his (in my view) best work; but I still go back to this as my very favorite of his performances.","user":"Steve G-2","rank":[38,42]},{"title":"...or did you lose a bet with God?","rating":28,"date":"28 January 2001","review":"Mozart would have loved Roxanne. This perfect film rests on some of his greatest hits...as choreographed and performed by Steve Martin. There is nothing \"Roxanne\" lacks, from aliens dropping out of trees to \"make love to older women\", to a water ballet courtesy the local fire department.<br><br>The characters are beautiful: the brilliant misfit; the gorgeous \"astrologer or astronomer, or something\"; the bronzeable but- alas, dumb- hunk...all gather on the mountainside for our pleasure. Toss in a big rubber nose, a couple of the greatest lines from literature, stir with that Mozart stuff, and poof...a great valentine evening.","user":"annmason1","rank":[21,23]}]