[{"title":"\"This man's carrying a loaded weapon.\"","rating":11,"date":"11 November 2001","review":"Hell Comes to Frogtown is a hilarious cult classic. The plot alone makes this one a must see. It's the stuff of legends. No kidding, the greatest plot of all time. Get this: Rowdy Roddy Piper is one of the last fertile men on the planet. He has some kind of super sperm and humanity is a dying race because of a lack of fertile men and women. So, he is forced by a largely female government called MedTech to go to Frogtown (ruled by mutated Frog people known as Greeners) to rescue fertile women from the evil Toady so he can impregnate them. It's all in the name of freedom of course. Great huh? The supporting cast features Sandahl Bergman, Big Will Smith, Nicholas Worth, and Rory Calhoun. Rent only if you're looking for laughs, and laughs you'll get. A thousand thanks go to Anchor Bay for re-releasing this hard to find classic.","user":"Backlash007","rank":[24,26]},{"title":"Cheesy science fiction yarn...but watchable.","rating":8,"date":"8 December 2003","review":"'Hell' is the name of the hero of the story. He's a prisoner of the women who now run the USA after a nuclear/biological war. Results of the war are that mutants have evolved, and the human race is in danger of extinction due to infertility. Hell is given the task of helping in the rescue of a group of people from the harem of the mutant leader (resembling a frog). Hell cannot escape since he has a bomb attached to his private parts which will detonate if he strays more than a few hundred yards from his guard. Some cool special effects (the frog creatures look really good), bad acting, cheesy plot....Leave your brain at the front door, there's some entertainment to be found here.","user":"willywants","rank":[28,31]},{"title":"Worth renting, worth buying","rating":2,"date":"2 August 2002","review":"I rented this video many years ago, and enjoyed it enough to spend several years hunting down another copy I could buy for my own collection. The video is a great sendup of all the post-apocalyptic Road-Warrior-ripoff movies of the 70s and 80s. It doesn't take itself too seriously, but is written, directed, and acted well enough to be thoroughly enjoyable. Some of the scenes are hilarious. The interplay between Roddy Piper and Sandahl Bergman is worth watching as well. If you like B-movies, this one is a keeper.","user":"spotter-8","rank":[22,26]}]