[{"title":"Wow, what a movie, fantastic score and choreography","rating":6,"date":"6 November 2004","review":"If you like musicals don't look beyond this one. MGM goofed when it slashed the movie's budget and gave it away to Brigadoon in 1953 but it doesn't matter for the simply stunning songs and choreography shine through. As good as Brigadoon was, it is outclassed by this, for me, the greatest musical of them all.<br><br>Howard Keel stars with Jane Powell but for me I cannot look beyond the awesome dancing talent of Matt Mattox as Caleb. Check out the 'polecat scene' and bookmark it on your DVD. It doesn't get any better than this. Thank you Matt, you were great!<br><br>Terry","user":"terry-265","rank":[35,39]},{"title":"Spectacular dancing and great music..Keel and Powell never did anything better!","rating":13,"date":"13 April 2001","review":"A permanent place in the history of film musicals is obviously the fate of 'Seven Brides for Seven Brothers' the minute Howard Keel begins to sing 'Bless Your Beautiful Hide'. His robust romantic presence and voice are perfectly suited to blend with Jane Powell's sweet soprano--the Nelson and Jeanette of the '50s era. Jane is as perky as can be as the girl who impulsively marries him only to find that she's expected to keep house for him and his seven handsome brothers. (Echos of 'Snow White and the Seven Dwarfs' here and a touch of political incorrectness). But all that can be forgiven, for what follows is the most outrageously entertaining musical treat from the MGM factory--singin' and dancin' like you've never seen before! The exuberant acrobatic dancing of the brothers is a special highlight--particularly during the barnraising sequence. And their wistful rendering of the carefully staged 'Lonesome Polecat' is another high point. Powell and Keel get to warble some enchanting tunes and both are totally charming and professional in their roles. Keel probably never had a better role--except perhaps 'Showboat' or 'Annie Get Your Gun', handsome, macho and utterly believable. By all means reward yourself with this gem--either in regular format or widescreen, it's certainly one of the greatest MGM musicals of the '50s. Perhaps, as others have noted, the only drawbacks are some of the obviously painted mountain backgrounds--but this never destroys the overall charm of the film. The songs are splendid and the dances are as zestful as any you're ever likely to see.","user":"Doylenf","rank":[37,44]},{"title":"Irresistible with its vitality and freshness...","rating":9,"date":"28 July 2002","review":"A former Broadway dancer and choreographer, Donen's initial encounter with MGM was as choreographer on a number of musicals, including 'Cover Girl,' 'Anchors Aweigh,' and 'Take Me Out to the Ball Game.'<br><br>Nominated for 5 Academy Awards, 'Seven Brides for Seven Brothers' tells the story of the seven Pontipee brothers, who are living a rough lonely existence on their farm in Oregon... It is also the story of a rugged young farmer, in 1850, who rides into town to trade for some supplies, and pick himself up a comely bride...<br><br>In town, Adam finds just what he's looking for'Pretty and trim, but not too slim. Heavenly eyes and just the right size. Simple and sweet and sassy as can be.' Adam meets the young spirited Milly working at a local inn... He is instantly attracted by her good looks and her cooking... For her part, Milly likes her tall, and self-assured man... Also his directness, and the sound of his good house in the wilderness... After a whirlwind courtship, the two agree to wed... <br><br>Millie chirps an engaging 'Wonderful, Wonderful Day' as she welcomes what she expects will be a perfect new life... But when she arrives at the ranch, all her dreams about love and marriage and such, are shattered... She discovers that her new husband has not been entirely truthful... Instead of an idyllic honeymoon cottage just for two, she finds he really wants 'a cook, a washerwoman, a hired girl,' for his small army of six sensitive brothers living in one filthy cabin...<br><br>After the shock, Milly immediately sets out to transform the young rowdy men into the region's most eligible bachelors, with an eye to marrying them off as quickly as possible... <br><br>Milly's good cooking and stubborn nature inspire the rambunctious young men that they cannot expect to attract wives if they dress and behave the way they do... They have to learn some social graces... At the perfect opportunity, the boys put Milly's teaching to good use, meeting the town girls whose glances express an obvious interest...<br><br>Unfortunately, the women are spoken for..<br><br>Adam could hardly believe it how his little wife tamed his backwoods brothers... He suggests to the wild and grieving 'Romeos,' reduced to what he can only describe as \"a bunch of mamma's boys,\" forget gentle methods of love, and kidnap the unwilling gals they want, following the actions of the Roman with the Sabine women... <br><br>Howard Keel is at his commanding best... He develops an unorthodox solution to his brothers loneliness, much to the chagrin of the town fathers and their romantic rivals... With a voice singularly warm and precise, he rises magnificently to the occasion, singing a firmness 'Bless Your Beautiful Hide,' while he appraises the qualities of womanhood in general... <br><br>In her probably best screen performance, Jane Powell had the required amount of grit and spunk that was needed to lay the woman who could tame seven backwoodsmen... She sets about to refine her unkempt brothers-in-law giving them the manners and habits they need to court and to win their own sweethearts... Her clear, high, spring-water voice is just right for the songs, seemingly meant to be heard in the open with the mountains and meadows to echo it... <br><br>Unquestionably, the highlight of the motion picture is justly the 'Barn-raising' sequence... It begins as a 'challenge' dancea truly breathtaking display of acrobatic leaps and ballet steps, in which the brothers compete for the girls with the more 'refined' men of the town, and it ends inevitably in a noisy, undignified fight as the men actually try to raise the four sides of the wooden barn... <br><br>The collective presence of the six brothers is simply dynamic... All the players move rhythmically with grace and ease... Russ Tamblyn jumps both forward and backward over an ax held in his hands... Stanley Donen again displays his visual originality and creates a new style of musical, irresistible with its vitality and freshness, lovely to look at and hear...","user":"Nazi_Fighter_David","rank":[34,42]}]