[{"title":"Hot chicks, bad acting, and silliness.","rating":3,"date":"12 May 2000","review":"This used to be a regular on USA Up All Night, back when Gilbert and Rhonda were still hosting. Phyllis Davis is really gorgeous in a Russ Meyer kind of way (if you don't know what I mean, go rent a Russ Meyer film and you'll understand). It's supposed to be an action film, and is along the same lines as \"Chained Fury\" and \"Reform School Girls\". Closeups of breasts, simulated sex, etc. The acting is pretty bad, but combined with a ridiculous plot and the sexual innuendo it makes for an unintentionally hilarious film. If you've got a Saturday evening with nothing to do, invite a few pals over and rent this. You'll be laughing in no time...","user":"matlock-6","rank":[16,18]},{"title":"\"The kind of a woman/The LOOOOVEEERRRRR...\"","rating":5,"date":"14 September 2005","review":"Thanks to a friend I used to work with at a local video store, we had weekend contests to see who could find the Most Gawd-Awful Movie to play on the monitors...something so bad that it would stop the customers in their tracks from shock and disbelief. He thought he'd won with this hysterically bad gem, starring the amply endowed Phyllis (VEGA$) Davis as a horny free spirit, who gets spirited away to a prison/sugar cane colony in the middle of God-knows-where, after the local 'policia' frame her on a phony drug charge.<br><br>Covering all the bases, from mad-scientist flicks, women-in-prison movies, Seventies soft-core porn and badly made action flicks shot overseas on the cheap, it even throws in a little blackexploitation vibe with the faaaabulous presence of Ella Edwards. Cliff Osmond and Angus Duncan commit thespian thievery every chance they get, and Duncan seems to have popped in a set of steel dentures, as he gives every scene he's in a good going-over, like a fresh pack of Wrigley's.<br><br>The surefire way to know if you will love or hate this movie, is to find it under its original title and not any of the other name-changed versions. Because SWEET SUGAR may be the only version that contains that howler of a theme song, which sounds like the L.A. band X going on a HUGE acid-and-tequila bender in some South-of-the-Border dive bar, crossed with The Mamas and The Papas on Zoloft. If the priceless opening number doesn't do it for ya, you either need to switch to an actual film that has some tangible artistic value, or do what we did, and continue the quest to find the All-Time Worst Film on the shelf.<br><br>(In case you're wondering, BTW, I won the Contest after picking BLOOD ORGY OF THE SHE-DEVILS.)","user":"cchase","rank":[11,14]},{"title":"Phyllis Davis was Gorgeous","rating":10,"date":"13 January 2014","review":"TITLE: SWEET SUGAR opened in theaters on January 1 1973 starring Phyllis Davis, Pamela Collins, and Jacqueline Giroux. This movie is 90 minutes long.<br><br>SUMMARY: The movie opens with a feisty prostitute Sweet Sugar goes up to a room with a man and he tells her he has something for her and gives her what looks to be a rolled up joint. He tells Sugar that he has to go get something and leaves the room. Then two cops enter the room and arrest her on grounds of illegal drugs. Sugar is taken and thrown in jail and end is offered a plea deal that includes Sugar of serving two years hard labor cutting sugar cane at a harsh prison plantation farm. The prison is run by a wicked and deranged warden Dr. John who grossly mistreats the inmates by subjecting them to all kinds of twisted and inhumane medical experiments. Naturally, Sugar forms bonds with Simone her chief rival, Doleres and Fara. The women try to escape on several different occasions only to have something go wrong. After each time one of the girls is whipped, caged or is forced to be alone with the guards. Each day the women have to go out into the plantation to cut sugar cane. The girls get very little wages and what wages they do get they have to pay back for the food, clothes, and other things the girls need.<br><br>QUESTIONS: Who was the guy that framed Sugar? Why was Sugar sent to this plantation instead of another prison? What were the other girls sent to the plantation for? <br><br>MY THOUGHTS: I love this movie. This movie is full with action and drama and it keeps you guessing on what's going to happen next. I thought that Pamela Collins and Jacqueline Giroux were great in the roles as Sugar co conspires. However, to me this movie was about one person and one person only Phyllis Davis. She was excellent in her role as Sweet Sugar. This movie also used Phyllis Davis beauty in this movie also. There's several scenes that involves Sugar that will get your blood racing. Despite what other reviews stated about this movie I thought it was an excellent picture. So based on the action, drama and most of all Sweet Sugar beauty and talent I give this movie 10 weasel stars.","user":"garyldibert","rank":[6,7]}]