[{"title":"Like Chaplin","rating":11,"date":"11 December 2004","review":"I always find it strange that people think a comedy should have you rolling in your chair not so! There are movies that one gets a warm, funny feeling inside and that one appreciates the subtleties of the acting and set ups. Often a laugh a minute movie is forgotten quickly, but those movies that simmer and let the humor seep out slowly often linger in the mind.<br><br>The Party is a movie shot in the sixties with all the hang-ups and social undertones that were abundant then. I laughed myself silly then and today I still laugh with the benefit of hindsight and years of social and cultural change.<br><br>Peter Sellers' performance is on a level par with Chaplin; a rare achievement for any actor.","user":"jacob-45","rank":[133,143]},{"title":"Elvis' favorite movie..","rating":9,"date":"7 August 1999","review":"What can you say about Peter Sellers? From the Goon Show, through the Ealing comedies, the Pink Panther films, up to Being There, he was consistently brilliant! Kubrick knew it, Blake Edwards knew it, and this movie does a lot to prove it to everyone else. Instead of making his stereotype just a vehicle for laughs, he brings out the pathos and beauty inherent in alienation..instead of using scripted antique gags as an invitation to walk through the role, he transcends each tired joke with impeccable timing and facial expressions. Even the silly sixties situations don't ruin the comedy here, as they did in Alice B. Toklas. In my opinion, this one is timeless, and should be seen by anyone who has a sense of humor.","user":"Lirazel","rank":[93,102]},{"title":"We have a saying in India","rating":8,"date":"6 April 2014","review":"Is there a more iconic comedic prologue than The Party's, with Hrundi Bakshi (Peter Sellers, priceless), a bumbling actor involuntarily, repeatedly sabotaging some kind of schlocky adventure / period piece first by refusing to die, then by showing his wholly anachronistic watch and finally by blowing up the set while trying to tie his shoelaces? Because if there is, I can't think of one at the moment.<br><br>The movie belongs to veteran comedy director Blake Edwards and especially to Sellers, who provides an hilarious turn as Bakshi, a sweet, meek individual so clumsy and inclined to disaster, he is essentially the human version of a tornado. Material is droll, but at times so thin that with a lesser lead it would have collapsed - Sellers being who he is, the mere sight of him staring with awkward alarm at a toilet which refuses to stop flushing provokes laughter.<br><br>8,5/10","user":"petra_ste","rank":[20,20]}]