[{"title":"Better than you might expect","rating":26,"date":"26 April 2008","review":"These IMDb comments were intriguing enough for me to order this, and I must say I liked it more than I expected to. \"Savage Intruder\" (my DVD is titled \"Hollywood Horror House\") reminded me much more of \"Baby Jane\" than \"Sunset Boulevard\"--although the Hopkins character chatters on the phone about making a comeback and gets herself booked as a parade queen, the main focus of the film is simply to cut down her drinking and give her a more dignified retirement. John Garfield Jr (who looks a lot like his father) ruins that plan.<br><br>Regarding the \"semi-nude scene\" comments, my DVD did not carry this, or I was simply underwhelmed by what passes for risqué skin. When Garfield gives Hopkins a back massage her back is clearly bared, but even when she is startled you don't see anything revealing, seemed like a very ordinary massage to me.<br><br>Regarding the comment about the alternate ending that was apparently filmed (where the Gale Sondergaard character shoots Garfield), my DVD did not carry his but it would have been neat to see. I won't give away the ending, but it is a little ambiguous.<br><br>Pluses: beautiful color cinematography, and Hopkins fans will be pleased to know that in general she looks like a million bucks and wears beautiful costumes (when she is not being massaged!). The great location of Norma Talmadge's mansion and the careful attention to costuming and cinematography make this film look much higher budget than it apparently really was. Great performances from just about the whole cast if you ask me. The title sequence is genius: far-away view of the Hollywood sign, then closeups of how bullet-ridden the sign pieces are, how trashy the hillside is--great opening sequence that really sets the tone.<br><br>Minuses: Unlike Baby Jane, where servants did not live in and created some suspense by unexpectedly popping up, the hotel-like atmosphere of so many live-in servants oblivious to the virtual disappearance of their mistress is a little too unrealistic. Ironically the beautiful Talmadge mansion works against suspense; a bomb could go off in the mansion and the kitchen staff wouldn't notice. Also, Hopkins is basically only in the first half of the film, and the second half drags a bit without her. The film tries to cover for this, and John Garfield Jr is regularly snarling at the staff not to bother the missing star, but you wonder why Gale Sondergaard isn't yelling at the employment agency by day two of Garfield's arrival.","user":"nisiimperasset","rank":[11,11]},{"title":"Sick slice-and-dicer with a few good moments.","rating":16,"date":"16 November 2000","review":"This is really nothing more than a slightly gorier rendition of SUNSET BOULEVARD/BABY JANE hysterics. Miriam Hopkins, one of Hollywood's finest actresses during the '30's, gives an appropriately hammy performance as a demented former movie queen who, when not chugging down a bottle of vodka, is staggering around her decaying Hollywood mansion(the real-life home of famous silent screen star Norma Talmadge) plotting to make a comeback. When she breaks her leg during a drunken episode, she is assisted by a good-looking, but strange young man(John Garfield, Jr.) who passes himself off as a male nurse, but is, in fact, a sick psychopath who has been dismembering several women who live in the Hollywood hills. Despite being almost totally beyond redemption, the movie offers some occasionally worthwhile moments supplied by several familiar old-time character actors, and Miss Hopkins, in her final film role, gives a much better performance than the circumstances warrant. Also out on video as: HOLLYWOOD HORROR HOUSE. Originally titled: THE COMEBACK.","user":"verna55","rank":[13,15]},{"title":"One of The Great Examples of \"Old Hag Horror\"","rating":9,"date":"14 April 2012","review":"Savage Intruder is one of those late 60's/early 70's horror films that adorn formerly famous, formerly glamorous Hollywood starlets in their elder years. Kick-started into action by the surprise horror hit \"Whatever Happened To Baby Jane\" which breathed new life into Bette Davis and Joan Crawford's practically non-existent careers at that point, suddenly other actresses, who were shunned by the studios which had used them up and spit them out, started lining up to star in low-budget horror movies. Their loss is our gain, because even though Hollywood has no use for them, I find seasoned actresses to be the most fun to watch - especially in a horror film.<br><br>This one stars Miriam Hopkins and Gale Sondergaard (who was criminally black-listed by Hollywood when she refused to testify against her husband during the McCarthy-inspired \"Red Scare\" hysteria in the 1950s). Hopkins is (surprise-surprise) an aging actress who lives as a recluse in her Hollywood mansion of memories. Sondergaard plays her tough but caring assistant. Suddenly, a young handsome stranger who harnesses a charismatic charm as well as a bad temper worms his way into the household, fooling Hopkins but not Sondergaard. <br><br>There is a nice helping of sadism, murder and weirdness embedded into the film, sure to please lovers of these kinds of horror movies. Although it is very hard to find, this one is well worth the effort.","user":"josephbrando","rank":[11,13]}]