[{"title":"Fantastic Fun","rating":7,"date":"27 January 2006","review":"This is one of the quality films from Jackie's early years made the year after Snake in Eagles Shadow with much of the same cast and crew this built on the comedic style of Kung Fu action that Jackie was to make his own. Of the two films I actually prefer the earlier Snake in.... but its this later film that is more often considered Chan's earliest masterpiece.<br><br>This is a more traditional set kung-fu film than the later stunt fests that made his name. The fighting styles on show are unique, inventive and fascinating to watch. The showdowns are impressive and with no trick photography, CG or massive effects fueled blow outs and shows just how good a martial artist Jackie is. The comedy works well and Jackies on screen master is very funny and they spark well off each other as a team.<br><br>This is a really good old style kung fu flick fans of Jackies later work such as Rush Hour etc. may not find what their looking for here this is Jackie in one of his most pure kung fu movies. But for anyone who loves martial arts you must see this!! Great entertainment 7/10","user":"no-skyline","rank":[26,27]},{"title":"The film that propelled Jackie to stardom","rating":10,"date":"6 January 2005","review":"I am not very familiar with the true story of Wong Fei Hung. I've read about him before, and from memory, he was an exceptional martial artist (he practiced Hung-Gar) and became a folk-hero to the people of China, much like his father, Wong Kei Ying. So there is the true story, and then there is the 200 or so movies made about him. 'Drunken Master' is one of these.<br><br>I haven't seen most of those 200 movies, except for the Drunken Master movies, Jet Li's 'Once Upon a Time in China' series, and 'Iron Monkey'. The 'Once Upon a Time in China' movies and 'Iron Monkey' may be somewhat over-the-top wu xia movies, but they portray Wong Fei Hung as a serious hero. 'Drunken Master' features a very different take on the character.<br><br>Jackie Chan's Wong Fei Hung is a rebellious trouble-maker. His father, Wong Kei Ying, has given up on disciplining him, and sends him to his uncle, So Hai, the master of drunken boxing, hoping that a year of training with So Hai will sort Fei Hung out. Fei doesn't seem to learn his lesson until a chance encounter with Thunderfoot (Hwang Jang Lee)...<br><br>Story-wise, it is a bit of a standard kung-fu plot. However, in a documentary on Jackie Chan (I can't remember the name, I know that as of this review, it isn't listed on IMDb, but it was shown on SBS in 2003), 'Drunken Master' was mentioned as his breakthrough hit that nearly killed his career: Apparently Chinese viewers were insulted by Jackie's portrayal of Wong Fei Hung and nearly boycotted him when he was just gaining fame as an actor.<br><br>Onto more important matters. Like kung-fu. 'Drunken Master' is one of the kung-fu classics. Boosted by the presence of martial-arts star Hwang Jang Lee, this pretty much made or solidified the careers of Jackie Chan and Yuen Woo Ping (in his directorial debut). 'Drunken Master' features some very well choreographed fights and training scenes. 'Drunken Master' is very funny too, and is one of two movies I know where a young main-character gets beaten by an older middle-aged lady (which is always funny, more movies need a scene like this) - the other movie is Battlefield Baseball.<br><br>As a matter of interest for Jackie Chan fans: 'Drunken Master' signaled the end of Jackie Chan's work with director Wei Lo. Yay. In fact, the Columbia Tristar DVD release of 'Drunken Master' includes audio commentary by experts on Hong Kong cinema. I will check that out sometime, but it sounds like it would appeal to fans of kung-fu movies. Some more trivia - the latest release doesn't have the complete Cantonese sound track, and so the English dub is used where the Cantonese track is incomplete.<br><br>'Drunken Master' features awesome kung-fu scenes, and has some interesting historical perspectives. Ah, kung-fu movies and history, some of my favourite hobbies together at last - 10/10, a must see for any fans of Jackie Chan or kung-fu movies, 'Drunken Master' is kung-fu perfection.","user":"AwesomeWolf","rank":[40,46]},{"title":"not only lives up to legend, it creates it","rating":9,"date":"29 June 2006","review":"It is said that this is the film that made Jackie Chan a star, but that isn't really true, since Snake in Eagle's Shadow actually had a bigger impact at the time, and allowed Chan to make this film. One way we know this is that there are some two dozen films made in the late '70s- early'80's designed to imitate Snake in Eagle's Shadow, and only a couple imitate this film. By the time Drunken Master had become legendary world-wide, the chop-socky cycle (to which it still belongs, to an extent) had passed into history, and Chan himself had abandoned historical 'fu films for contemporary comedy-thrillers.<br><br>It should be noted that the idea of making a film based on the early years of Wong Fei Hong was not original to Chan; at roughly the same time this film was being made, well-known martial arts choreographer Liu Chia Leung made a straight (non-comic) version of the story (without drunken boxing) over at Shaw Brothers, Challenge of the Masters, with Gordon Liu as Wong Fei Hung.<br><br>The defining moment for the Chan-Yuen version of the film is the use of Drunken Boxing. There is no real evidence that the historical Wong Fei Hung was a master of this style; his more famous innovations involved the development of the shadowless hand technique and the no-shadow kick. Interestingly, in order to highlight Chan's use of Drunken Boxing, these other two techniques, better identified with Wong, are assigned in the film to the villain, \"Thunderlegs\" played by Hwang Jen Lee.<br><br>At any rate, it would not be clear that one could consider this a Wong Fei Hung film at all - if it weren't for the fact that this film effectively redefined the Wong legend, so that it has since become pro-forma to assume that Wong was a bit wild in his youth. (Just to set that record straight, Wong was actually extremely studious, and recognized as a real child-prodigy in the martial arts, winning his first major public duel at the age of thirteen.) Drunken Master is solid martial arts entertainment. There are decided weaknesses in the plot and over-all staging of the film, but these can easily be ignored, as the film thrusts us along with kung fu and comedy to the grand final fight at the end. It must also be noted that these characters - even the villain - are well acted and quite likable and familiar, and thus add a credibility to the film. And Yuen's direction is also very professional and a couple notches above the average for a Hong Kong genre film of the time.<br><br>Lives up to its own legend, and well-worth the viewing.","user":"winner55","rank":[28,33]}]