[{"title":"Romance and Adventure on the Oregon Frontier","rating":7,"date":"27 December 2005","review":"Dana Andrews is a merchant/entrepreneur on the Oregon frontier during its period of pioneer settlement in the 1840s. He's got two women interested in him, Susan Hayward and Patricia Roc, a weak business partner in Brian Donlevy who's addicted to gambling and a big and mean man played by Ward Bond who wants to kill him. And of course there are the ever present Indians around.<br><br>Canyon Passage is directed by French expatriate director Jacques Tourneur and I have to say Tourneur did a good job in immersing himself in American frontier culture. I don't think John Ford could have done better with the story, the cast, and the superb outdoor photography that puts those B studio westerns to shame.<br><br>Patricia Roc who was a big name in Great Britain made a couple of American films at this time. Until the boundary was finally fixed at the 49th parallel, British settlers would not have been uncommon in the Oregon territory so the casting is not as strange as one might normally think. Ms. Roc didn't make much of an impression on American audiences and she was back in Great Britain shortly thereafter. Not too many British players of the period could boast a western in their credits though.<br><br>Susan Hayward is strangely subdued in this film. She looks a bit out of place in this one. She's far better suited to an urban setting. Later on she did films like Untamed and Garden of Evil, but far more of her fiery personality was shown in those roles than in Canyon Passage.<br><br>Ward Bond is the villain here, a misanthropic loner of a man, brooding and strange. I guess you can best compare his role to that of Judd Fry in Oklahoma. Has the same kind of problems relating to people, especially those of the opposite sex, that Judd does. It's one of Bond's two or three best performances on screen.<br><br>The popularity of Canyon Passage was helped in large measure to the Hoagy Carmichael-Jack Brooks ballad Ole Buttermilk Sky which Hoagy also performed in the film. It was a big hit that year both for Hoagy himself and others who recorded it. Carmichael was an amazing triple talent in the entertainment field as composer, actor, and singer of his own and other's songs. His best known movie parts besides Canyon Passage would be in Young Man With a Horn and The Best Years of Our Lives.<br><br>Tourneur keeps the film moving at a steady pace and gets quite a lot crammed into the 90+ minutes of the film. Western fans who like their films slow and easy will take to this one.","user":"bkoganbing","rank":[33,33]},{"title":"Any man, I suppose, who believes as I do that the human race is a horrible mistake.","rating":9,"date":"7 February 2010","review":"Canyon Passage is directed by Jacques Tourneur and is adapted by Ernest Pascal from the novel written by Ernest Haycox. It stars Dana Andrews, Brian Donlevy, Ward Bond, Susan Hayward, Lloyd Bridges &amp; Patricia Roc. In support is Hoagy Carmichael who offers up ditties such as the Oscar Nominated \"Ole Buttermilk Sky\". Music is by Frank Skinner and cinematography by Edward Cronjager.<br><br>More famed for his moody black &amp; white pieces (a year later he would craft one of film noir's best pics in Out of the Past), Canyon Passage finds Tourneur operating in glorious Technicolor on Western landscapes, the result of which is as gorgeous as it is thematically sizzling. The story follows Andrews' Logan Stuart, a former scout turned store &amp; freight owner who has landed in Jacksonsville, Oregon. Also residing here is the girl he is courting, Caroline Marsh (Roc) and his friend George Camrose (Donlevy) who plans to marry Lucy Overmire (Hayward). However, there are problems afoot as George has a serious gambling problem, one that will send this tiny town into a vortex of turmoil. Affairs of the heart also come under great pressure, and to cap it all off, the Indians are on the warpath after the brutish Honey Bragg (Bond) kills an innocent Indian girl.<br><br>The first thing that is so striking about Canyon Passage is the town of Jacksonville itself, this is a vastly different Western town to the ones we are used to seeing. Built in a sloping canyon that helps to pump up the off kilter feeling that breathes within the picture, it's also green, very green, but in a most visually interesting way. The greenery and red flowers give a sense of harmony, a sneaky way of diverting the viewer from the smouldering narrative, for we find that Tourneur is delighting in not only painting a pretty picture that belies the trouble bubbling under the surface of this apparent place of prosperity, but he's also revelling in using various camera shots to embody the unfolding story and the characterisations of the principals. This really is a film that begs to be revisited a number of times, for then you find with each viewing comes something new to appraise, to pore over to see just why Tourneur did something in particular. The host of characters are varied and have meaning, each given impetus by the uniformly strong cast - the latter of which is also a testament to the supreme direction from the Parisian maestro.<br><br>I honestly feel that if this was a John Ford film it would be far better known &amp; appraised accordingly. At time of writing this review it's still something of an under seen and vastly under rated Western, and this in spite of it garnering praise over the last decade or so from some big hitters in the directing and film critic circles. Cronjager's Technicolor photography is rich and piercing, where Tourneur and himself expertly utilise the Diamond Lake and Umpqua National Forest exteriors to expand mood of the story. Skinner's score is excellent, as is Carmichael's (wonderfully creepy characterisation) musical input, while the costuming is top dollar. Now widely available on DVD, there's hope that more people will seek this out. With the number of finely drawn sub-plots, and the wonderful visual delights and directorial tricks, Canyon Passage is essential viewing for Western and Tourneur purists. For sure this is a film that rewards more with each viewing, so just keep your eyes and ears firmly on alert and enjoy. 9/10","user":"hitchcockthelegend","rank":[29,30]},{"title":"CANYON PASSAGE (Jacques Tourneur, 1946) ***1/2","rating":8,"date":"28 May 2007","review":"A bland, generic title disguises a sublime little Western which, despite being one of a string of prestige genre pictures shot in color around the same time – like DUEL IN THE SUN (1946) and California (1946; included in Volume 2 of Universal’s “Classic Western Round-Up” series) – only in recent years did its reputation soar considerably through the championing of renowned admirers like Martin Scorsese and Jonathan Rosenbaum. It is also important in that it marked Jacques Tourneur’s first film in color and for being the first of several Westerns he would go on to helm, the most distinguished of which was the black-and-white STARS IN MY CROWN (1950) with Joel McCrea.<br><br>All the familiar Western ingredients are present (love triangles, crooked bankers, bar-room brawls, Indian attacks, impromptu court hearings turning into lynch mobs) but which are literally rendered fresh once more by impeccable handling and production values – the beautiful color photography (courtesy of color lighting expert, Edward Cronjager), skillful music accompaniment (composer Frank Skinner) and a splendid cast who rise up to the occasion of breathing life into their three dimensional characters: Dana Andrews’ restless hero, Brian Donlevy’s likable rogue, Susan Hayward’s feisty heroine, Ward Bond’s mean town-bully, Hoagy Carmichael’s balladeer-cum-cynical observer, etc. Besides providing notable roles also for Lloyd Bridges (as a hot-headed miner), Stanley Ridges (as Hayward’s lawyer father), Onslow Stevens (as a tubercular conman) and Rose Hobart (as Ridges’ enigmatic, exotic wife), screenwriter Ernest Pascal – working from material originally published by noted Western writer Ernest Haycox – adds the nice touch of introducing English émigrés (Patricia Roc and Halliwell Hobbes) into this community, which further aids the film in standing out from the crowd of similar fare.<br><br>CANYON PASSAGE is undoubtedly one of the most vivid portrayals of pioneer life in the Old West ever brought to the screen, certainly on a par with John Ford’s DRUMS ALONG THE MOHAWK (1939) but arguably working on a greater level of sophistication: for one thing, the relationships between the characters are more complex in nature than they at first appear (practically every major character is engaged to marry someone but is truly in love with somebody else) and the fact that Tourneur boldly chooses to have some of the film’s major events take place off-screen – Donlevy’s killing of the miner whose money he has been pilfering (which leads to the trial in the bar), Ward Bond’s slaying of the Indian girl (which leads to the climactic Indian attack), Andy Devine’s death at the hands of the Indians, Donlevy’s own ‘execution’ by the villagers, etc. – also hints that we are watching is indeed something quite special.<br><br>Director Jacques Tourneur and leading man Dana Andrews went on to collaborate on two more films a decade later – the superlative occult chiller, NIGHT OF THE DEMON (1957; which is apparently getting a fully-loaded release on R2 DVD later on this year) and the obscure Cold War thriller, THE FEARMAKERS (1958). One final note about CANYON PASSAGE: multi-talented Hoagy Carmichael composed and sang four songs for the film – one of which, “Ole Buttermilk Sky”, became a hit tune and was, sadly, also the film’s sole Academy Award nomination!","user":"Bunuel1976","rank":[24,25]}]