[{"title":"Ray Harryhausen at his very best","rating":10,"date":"13 February 2005","review":"When I saw this in the theater as a 7 or 8 year old kid, I cried when it finished. It was by far the most captivating movie I had ever seen. I liked it better than Star Wars. The unbelievable stop-motion effects of Harryhausen still look great, even when compared to CGI. Things have not improved much. And Jane Seymore in the belly-dancer outfit! Good Lord! You must see this movie to believe it! The gold minotaur rowing the boat and the fight between the troglodyte and the saber-toothed tiger at the end stand out in my mind so strongly when I think of this movie.Get a copy of this movie, Jason and the Argonauts, and then Clash of the Titans and you have a fantastic Saturday afternoon of movie watching.","user":"wvcruffler","rank":[41,45]},{"title":"Really cheesy but lots of fun","rating":10,"date":"7 February 1999","review":"This is one of my guilty pleasures; everyone makes fun of me because I love this movie. Ray Harryhausen has been panned over this film, but I think he did a fantastic job. It's inventive and eye-catching, and the Minoton is a marvel.<br><br>Patrick Wayne is strong-jawed and stalwart as Sinbad, but Jane Seymour, as the princess, obviously hadn't done much acting yet when she made this film. She's really bad in the role of Sinbad's love interest. She beat Bo Derek by 4 years in starting the cornrow hairstyle, and most of her hairdos in this movie are more interesting than her acting. The biggest hoot in the movie is Margaret Whiting as the evil Queen. She's got an accent that won't quit, but as the film goes on that accent begins to fascinate the viewer; she's a really good actress, which surprised me. Even when she turns herself into a seagull. <br><br>It's the outlandish creatures, scenes, and settings that a Harryhausen movie always has that are its great charms, and this film is one of the most inventive of his career. Don't expect rocket science when you watch this, just expect to be royally entertained. The new Twilight Time Blu-ray release (December 2013) of the film is a wonder and highly recommended, but hurry and order it today...there are only 3,000 copies available.","user":"Marta","rank":[24,26]},{"title":"7/10 ~ 4/5 ~ Imperfectly Wonderful Ray Harryhausen Fantasy Fun.","rating":7,"date":"10 March 2005","review":"Sinbad the Sailor voyages to the mythic northern realm of Hyperborea to restore a caliph from an evil witch's transformation.<br><br>Sinbad and the Eye of the Tiger, the follow-up to the classics The Seventh Voyage of Sinbad and The Golden Voyage of Sinbad, is an uneven conclusion to Ray Harryhausen's celebrated \"Sinbad Trilogy\". The troubled production began with a draggy script, budgetary restrictions and an inexperienced director; the film as released suffers from choppy editing, over-length and routine music scoring. One animation highlight (the giant walrus) is obscured by an optical snowstorm. The attractive cast performs listlessly and the villain is campy rather than truly menacing, although former \"Doctor Who\" Patrick Troughton is delightful as a befuddled wizard.<br><br>Yet, for all its flaws, Sinbad and the Eye of the Tiger remains an entertaining escapade in the old-fashioned Saturday-Matinée tradition. Costuming and settings are colorful and the film looks handsome in widescreen. The quest for the mystical Shrine of the Four Elements has a particularly epic quality with the usual eclectic blend of mythical elements set against the backdrop of the Arabian Nights.<br><br>Most importantly, Harryhausen's realistic stop-motion animation is as extraordinary as ever, with two of the animated-puppet creatures -- Kassim the Baboon and Trog the Troglodyte -- successfully functioning as actual communicative characters within the body of the story. Other wonders include insectoid demons, an over-sized mosquito, Minaton the Brass Minotaur and the saber-tooth tiger of the title.<br><br>Genuine movie fantasy is a rare commodity, and Ray Harryhausen's vision and conviction shine through the circumstances of production to make this a satisfying final visit to the land beyond Beyond.","user":"Doctor_Mabuse","rank":[20,22]}]