[{"title":"The best come-uppance story ever!","rating":10,"date":"14 April 2001","review":"You know you've had a boss like this. Someone who stole your ideas, used you to advance their career, and did everything to keep you from getting the credit you deserve. I think of him every time I watch this movie, and although he got his come-uppance, as such people usually do, this one is still more satisfying.<br><br>Griffith is a little annoying as the giggly secretary with ambition, but it works. Weaver is the greatest comedic villain since Cruella DeVil. You know she's going to fall, and she does in more ways than one. While she's mending broken bones from a ski trip, her secretary finds a memo capitalizing on her idea the boss had pooh-poohed as a \"secretary's notion.\"<br><br>In her boss's absence, Tess (Griffith) uses her boss's name, her office, her home, even her clothes, to break into the rarefied New York mergers and acquisitions world. She even falls for the boss's boyfriend.<br><br>Alas, the boss is a fast healer and comes home early. She finds an entry in her secretary's day planner, and it hits the fan.<br><br>It's hard to believe this gem was written by the same writer who inflicted Meet Joe Black on us, but we can forgive him. Harrison Ford is at the top of his game as the boyfriend, but Joan Cusack almost walks away with this one, as usual. Joan is the best comedic supporting actress around. <br><br>Weaver has one of the the greatest one-liners of all time. When asked if she's sure her boyfriend will propose, she says \"We're in the same city now. I've indicated I'm receptive to an offer. I've cleared the month of June. And I am, after all, me.\" <br><br>The go-go 80's may be long gone, along with the power suits, the BIG hair, the Perrier, and the bull market, but this hilarious and heartwarming comedy still works without relying on nostalgia or sentiment!","user":"budmassey","rank":[72,88]},{"title":"Bright, feel-good comedy...George Cukor - move over!","rating":10,"date":"10 September 2007","review":"It's up there with any of screwball comedies of the 30s... Carole Lombard, Jean Arthur, Margaret Sullivan. a modern classic...and that's not hyperbole!<br><br>I've been watching this movie every now and again for almost 20 years (ye gads!), and it's always entertaining. Tonight, I noticed how effective and subtle an actress Melanie Griffith can be when she's directed well. She's a real jewel in this film. Sweet, sexy, smart with a \"brain for business and a bod for sin\". Mike Nichols clearly loved filming her. Her expressions are priceless. Watch for the wonderful scene when Harrison Ford and she are walking to the elevator and he's asking her out. That face of hers as the elevator doors close is just heavenly. That's Mike Nichols craft/artistry.<br><br>Sigourney Weaver also does a masterful job as a two-faced shark business woman. What's so wonderful about her character, the writing, is that Katherine doesn't have a conscience. She's crafty and slick and manipulative, but she's not out to hurt anyone, just put herself first. It's too bad if anyone get's in her way. She's not nasty, but there is no question that she is the most important person in the universe. It's interesting, too, how her duplicity is reflected in her wardrobe. Most of the professional women in the movie are dressed in ultra-conservative boxy business attire, but Katherine/Sigourney dresses sophisticatedly and elegantly. She knows how to play both sides, the professional yet still sexy professional. She's so powerful in herself that she doesn't feel like she has to dress like a man just because she's in a male- dominated career (mergers/acquisitions). yes, she's a monster/ogre, but as she states, \"This is BUSINESS\".<br><br>Harrison Ford is his usual witty, slightly befuddled nice guy. He's the James Stewart of the baby boomer generation.<br><br>Joan Cusack is a phenomenon with her iridescent eye-shadow and Bozo hairdo. I think has the funniest line in the movie-a warning to Tess: \"You know, sometimes I sing and dance around the apartment in my underwear. Doesn't make me Madonna....never will\". that's rich.<br><br>Look for Ricki Lake at the wedding.<br><br>I put this movie in the same category as Moonstruck, Educating Rita, Shirley Valentine. Transformation movies. I suppose you could call them modern day Cinderella Stories, but it's more about the women saving themselves as opposed to waiting for Prince Charming.<br><br>It's a pleasure to see this movie. I hope you enjoy it as much as I do.","user":"niborskaya","rank":[46,56]},{"title":"Career Women with Big Ideas and Even Bigger Hair","rating":8,"date":"27 July 2008","review":"A pure fantasy served up by Mike Nichols, but a vastly entertaining one.<br><br>Melanie Griffith is the secretary with massive hair who pretends to be a corporate business woman when her boss is layed up with a broken leg. The catch is, she finds out she's pretty good at it, and things get complicated when she ends up spearheading a business deal and falling in love with her key partner (Harrison Ford), all the while trying to keep what she's doing from her boss (Sigourney Weaver). It's the kind of movie that could just as easily have been made as a screwball comedy in the 1940s, perhaps with Barbara Stanwyck in the lead role.<br><br>The film is a classic in its own small way, one of the best comedies to emerge from the 1980s. Griffith is matched well with her role, so her limitations as an actress don't draw too much attention to themselves. But it's Weaver who steals the show as Griffith's imperious boss. She's a riot as a confident and powerful career woman from hell. And Joan Cusack steals a few scenes of her own as Griffith's best friend and fellow secretary, who sports hair as big as Griffith's and a Joisy accent to boot.<br><br>Nichols knows how to direct a comedy so that the funny bits speak for themselves.<br><br>Grade: A","user":"evanston_dad","rank":[19,22]}]