[{"title":"Very underrated","rating":8,"date":"29 June 2005","review":"\"Winter Kills\" is based on a novel by Richard Condon (\"The Manchurian Candidate\") about a man who confesses to having killed the President on his death bed. The President's brother (Jeff Bridges) witnesses the confession and stumbles upon a conspiracy plot involving more murder and silencing.<br><br>This movie somehow slipped under the radar years ago. Whereas \"Manchurian Candidate\" got the attention it rightfully deserved, \"Winter Kills\" was killed by its controversy and production faults.<br><br>It was allegedly filmed in 1975 and only released in 1979, although I can't find any evidence to back this up. What I do know is that it was given an X rating in the UK, and when a movie in the UK gets an X rating, you know something's wrong.<br><br>I'm not sure why it received such a harsh rating but evidently that had something to do with its box office failure. I suppose its themes (clear allusion to the JFK assassination) were too heavy - not to mention the violence was rather explicit.<br><br>Seen today, this movie is an underrated gem. John Huston delivers a great performance as Bridges' father, while Bridges is equally great. The music in the film is eerie and tense - without it, I doubt the film would be quite as good as it is.<br><br>It was directed by William Richert (who played the gay Bob Pigeon in \"My Own Private Idaho\") and he does a fine job. The movie builds its suspense well; the only segment I didn't like too much was when Bridges goes to visit his father for the first time. I felt it went on too long and was out of place.<br><br>Other than that, this is a very good film and a sadly underrated conspiracy theory movie that never got its chance to make a mark.","user":"MovieAddict2016","rank":[31,37]},{"title":"One of the strangest productions in film history","rating":8,"date":"2 July 2005","review":"Condon wrote a magazine article about this movie production around 1980 that makes it ten times as strange as the story itself. Among other details:<br><br>The movie was financed with money from cocaine dealers.<br><br>When the production went over budget, the executive producer brought in additional \"financiers\", then was able to keep the crews working for two weeks - in New York - with no pay. Jeff Bridges and Tony Perkins both offered their salaries as collateral.<br><br>After the film was finished, the studio was purchased by a bigger studio which then ultimately declined to release it. At one point, at a test preview at Grauman's Chinese Theatre, passers by were being offered $1 to watch the movie.<br><br>A few months later, the executive producer was found in a New York hotel room, handcuffed to a bed, with two bullets in his head.","user":"wsherrett","rank":[51,66]},{"title":"OFFBEAT, TO SAY THE LEAST","rating":18,"date":"18 May 2001","review":"William Richert's \"Winter Kills\" is a strange, offbeat film, to say the least. It begins seriously, but then changes tones and becomes a searing black comedy. I felt a little guilty about enjoying the film so much, considering that it's about a political assassination cover-up.<br><br>\nBut, then I changed my mind. After all, this, \"Prizzi's Honor\" and the great \"The Manchurian Candidate\" were all based on novels written by the same author, Richard Condon. The one thing these films all have in common are that they are savage comedies about serious subjects. So perhaps that was the tone Condon was going for. The humor will escape some, but those who can appreciate dark humor will love it.<br><br>The film also contains a gallery of great performances by top talent. The cast includes Jeff Bridges, John Huston (a great actor as well as a great writer and great director), Anthony Perkins, Sterling Hayden, Richard Boone, Eli Wallach and in a cameo, Elizabeth Taylor. They make the most of this material and play it very straight. This is the key to the film's success. If they had played it slyly, it may not have worked as well.<br><br>But it's not fair to praise the cast only. William Richert also deserves praise for maintaining such uneven shifts between tones and for telling such a potentially confusing storyline with style and grace. It's such a solid script and such strong direction that he should have received Oscar nods for his work. <br><br>\"Winter Kills\" exists in two versions. In 1980, Magnetic Video briefly released the theatrical cut, which was edited to deemphasize the comedy and rush-released by Avco Embassy. However, in 1983, Richert was given the green light to re-edit his film. This version, with the original ending restored and many of the comic moments restored, was released by Embassy Home Entertainment in 1984.<br><br>My rating applies to the 1983 re-edit, although I would really like to see the original 1979 edit. If anyone out there has a copy of the 1980 Magnetic Video release, e-mail me.<br><br>**** out of 4 stars (1983 re-edit)","user":"Katmiss","rank":[26,33]}]