[{"title":"the poor animal just would't stop screaming, can't you hear it?","rating":3,"date":"28 August 2011","review":"i'm not a naive person. i realize that animals in nature are killed and sometimes slowly. i just don't understand what it had to do with the film. why did they have to have 5 minutes of an innocent animal screaming before the huge snake finally coiled tight enough to cut off it's air. i love cannibal, zombie, and monster movies. i enjoy movies of humans getting killed. you wanna know why? because i know at the end of the day they took home a paycheck no matter how small it was. they got to get up, take a shower and go home. they didn't end up in a digestive system for real for somebody's (mainly mine) entertainment. that part of the movie in no way, shape, or form had anything to do with any part of the movie. it wasn't like blondy could send the little sucker to get help or anything. i'm also just wondering if maybe one of the sickos that made this movie just didn't add in some extra audio of the little guy screaming just for his own \"i killed the neighbors cat last night mom\" ya yas. this might seem stupid but i'm just saying the people signed up to be killed, the little animal didn't. just some food for thought.","user":"imwithstupid89","rank":[40,51]},{"title":"The Anthropophagi does not Exist","rating":6,"date":"10 March 2012","review":"In Brooklyn, in New York City, the drug dealer Mike Logan (John Morghen) steals US$ 100,000.00 from his suppliers and flees to Colombia. The police detectives seek out the touristic guide Myrna Stenn (Meg Fleming), who shared her apartment with Mike.<br><br>Meanwhile, the anthropologist Gloria Davis (Lorraine De Selle) travels on vacation to Paraguaya, in Colombia, with her brother Rudolph \"Rudy\" Davis (Bryan Redford) and her friend Pat Johnson (Zora Kerowa) expecting to find the town of Manioca to prove her thesis that cannibalism does not exist. However, their Jeep breaks down in a lonely road and they need to walk. They meet the Americans Mike Logan and his friend Joseph \"Joe\" Costolani (Walter Lloyd) that is wounded and Mike tells that the local Indians have eaten their guide Portuguese and they join the trio of friends. <br><br>Soon the promiscuous Pat stays with Mike and Joe tells the truth about Mike to Rudy and Gloria and how cruel he had been with the Indians, torturing elders, women and children. Rudy and Gloria feel that they are in danger but there is no place to hide from the young cannibals that are returning to their hamlet.<br><br>\"Cannibal Ferox\" is another brutal Italian film of cannibalism extremely realistic. The story is not bad and the special effects are very impressive; however, the cruelty with live animals is unbearable and does not add any value to the movie. I do not know what viewers could or expect to see in a B-movie with the title \"Cannibal Ferox\". I saw this film on a Brazilian DVD and the quality of the image is only reasonable. My vote is six.<br><br>Title (Brazil): \"Cannibal Ferox\"","user":"claudio_carvalho","rank":[15,18]},{"title":"Ugly and terrible entry into the cannibal sub-genre","rating":3,"date":"9 October 2011","review":"The film begins with the murder of a drug addict in an unknown apartment by some gangsters looking for a man named Mike Logan. As the police begin their investigation into the shooting, the action relocates to the Paraguayan jungle, where two students, Gloria (Lorraine De Selle) and Rudy (Danilo Mattei), and one tag-along Pat (Zora Kerova) are making their way into the heart of the jungle looking for native tribes who have been accused of cannibalism. Gloria is out to disprove the claims of cannibalism for her dissertation, and after they come across two mangled bodies of tribesmen, they also come across Mike Logan carrying his injured partner Joe (Walter Lucchini), who both claim to have been attacked by savage cannibals.<br><br>Between 1977 and 1981 there was a huge boom in cannibal films. They boasted exotic locations, horrific gore, real animal killings, and the threat of the unknown in the primitive tribes. It was Ferox's director Umberto Lenzi who kick-started the sub-genre with Deep River Savages in 1972, but they only really hit their stride in 1977, when the Grindhouse theatres were at their most popular. The cannibal genre died out pretty quickly, thankfully, as they represent everything that is ugly about the horror genre, and Cannibal Ferox, possibly the second most notorious after Cannibal Holocaust, is no exception.<br><br>The gore and violence is by no means convincing, or even disturbing, but it is clear from the off that the film's sole purpose is to be more repulsive than anything else before it. Multiple cocks are hacked off (and one is eaten - yummy), a woman is lifted into the air with fish- hooks through the breasts, there is an eye-gouging, and of course, no cannibal film would be complete without a bit of the ol' brain eating. This is all well and good and what can be expected from an Italian exploitation film at the height of the nasties era, but the animal killings are simply needless.<br><br>I always found myself defending Cannibal Holocaust for the animal cruelty, as that is a genuinely good film, and the horrific animal scenes really do add to the horrible and deeply unsettling atmosphere. But after seeing Ferox, I realised there is really no excuse for it. Regardless of the film's quality, there is no place for the pointless killing of animals. Radice refused to wield the knife during the pig- killing scene, and in the DVD commentary, director Lenzi said 'Robert De Niro would have done it!', to which Radice replied 'Robert De Niro would have told you to f**k off!'<br><br>Anyway, the film really is pretty damn awful. Why the action keeps shifting back to New York is anyone's guess. Mike is a wanted drug pusher that legged it off to Paraguay in search of cocaine and a fortune in gemstones, but surely knowing this is enough? There is a rescue attempt near the end that looks like joining the two stems together, but nothing comes of it. It seems to be there only to add a few more minutes onto the running time, allowing the film to render itself a feature. As you would expect, the acting/script/story is guff, but the strange thing is the moral message it seems to be putting out. When it revealed that Mike was lying and it was in fact him that attacked the tribe (shock horror), it seems to be a 'don't judge a book by it's cover' type message. But when the tribe acts out their revenge, they revel in the torturing.<br><br>Well anyway, the real torture victim was me, who had to sit through this. There's a few more cannibal films to get through for the nasties project (maybe I'll leave them to Marc), and although I'll welcome (if that's the right word) another viewing of Cannibal Holocaust, I have to say that I would be happy not to have to sit through another cannibal film. And there's always the Mondo sub-genre I suppose!<br><br>www.the-wrath-of-blog.blogspot.com","user":"tomgillespie2002","rank":[17,22]}]