[{"title":"Quintessential pure bad-ass the best action film my number 1 personal favorite","rating":10,"date":"1 January 2018","review":"Rambo: First Blood Part II (1985) is the finest pure bad-ass the best action film of the 80's of all time for me. My number 1 personal favorite film in the action genre I think it is one of the best action movies of all time. I love this film to death and it is my childhood film. Sylvester Stallone returns as John Rambo, the former Green Beret who is given the opportunity for a Presidential pardon if he accepts a mission to confirm the existence of American POW's captured during the Vietnam War. <br><br>Rambo: First Blood Part II influenced many of action films. Commando come out the same year and it was very competitive with Rambo but this movie won because it was more box office successful. I love this film to death It is the sequel to First Blood (1982), and the second installment in the Rambo film series In my opinion it is Stallone's best film.<br><br>\"Sir, do we get to win this time? \"<br><br>Awesome and very great intense underrated sequel . it Is a very joy great action movie . Action adventure fun with some substance. Different than the first one , but great as an archetypical good versus bad movie. Very decent, good movie, very entertaining, fast paced wonderful action Hard-R fight scenes and some nice one-liners war movie. There's no shaky cam or CGI here but real explosions. Bad-ass action film I absolutely love it to death! James Cameron and Sylvester Stallone wrote the script that is why this movie was such a bad-ass action. Terminator 2: Judgment Day and Aliens proves to be one of the best action movies from James Cameron he wrote and directed them, that is why Rambo: First Blood Part II was such a success. Brilliantly directed by George P. Cosmatos who later directed Cobra (with Sylvester Stallone again) Leviathan (with Richard Crenna again) and Tombstone. <br><br>Of course, this wouldn't be an action movie without some action. There's plenty of it, and it's perfectly done. Great action, a slick pace and a barrage of great moments (a random soldier being shot by an exploding arrow being my personal favorite) may not make this high art, but it does create a fun time at the movies, which is what movies are meant to do. It also helps that it has a great score, which sets the tone very well. You have ton's of explosions real practical effects. You see a lot of heavy weapons and they are used well. <br><br>Rambo uses a knife and kills the bad guys, well, he's Rambo and his knife completes him. Rambo uses Hoyt Archery compound bow which has been well know as the \"Torque Bow\" because of the high explosive arrow tips. I have never seen in any action movie a bow and explosives arrows. Rambo uses a flying helicopter kills all the bad guys blows whole base and saves POW's captured prisoners. <br><br>In this movie you have Russians and Vietcongs as the bad guys. Rambo blows up an enemy boat by pulling an RPG-7 anti-tank grenade launcher blows them to hell. Great explosion I have ever seen. Rambo blows up Podovsky's Hind helicopter with another grenade launcher M72 LAW.<br><br>Excellent solid cast Sylvester Stallone does great excellent performance as legendary John Rambo Vietnam vet. I love the character to death. Richard Crenna R.I.P. as Col. Samuel Trautman was excellent I really miss him. Charles Napier R.I.P. as Marshall Murdock was fantastic bad guy. The acting is fantastic from Richard Crenna and Charles Napier the politics were important, such as a right-wing stance coming from Trautman and his nemesis, Murdock, contrasted by Rambo's obvious neutrality. Great music score from Jerry Goldsmith R.I.P.<br><br>10/10 Bad-ass action film I absolutely love it to death, it is my number 1 action film ! Puts most of action movies to shame. Today they aren't action movies like are this one. Today they are just lousy CGI bullsh** crap.","user":"ivo-cobra8","rank":[99,125]},{"title":"Dragon Fly. Wolf Den..colorful names.....You may scream, there is no shame.","rating":10,"date":"9 July 1999","review":"First Blood and Rambo are completely different movies. They have same two characters bu that is where the similarity ends. First Blood was a tightly wound excellent action picture directed very well by Ted Kotcheff. Rambo is an action extravaganza that is not to high on the psychological element the way the first one was. They are both excellent films but I find them entertaining for different reasons. One of the reasons that I find Rambo so damn entertaining is because I enjoy that Rambo is now larger than life. He is the ultimate fighting machine who's only desire is to win a war that someone else lost, and if winning means he has to die then he'll die, no fear, no regrets. That is what makes Rambo the ultimate fighting machine and the ultimate movie character.<br><br>I love this movie. I love how far fetched it is. I love that Rambo can withstand hours of torture and then have enough energy to escape into the jungle and take on the whole Vietnemese and Russian army. That is what makes this movie so damned entertaining. When I was 14, this was my favourite movie, and it took a great many films and years before it was dethroned. I think I can enjoy and appreciate movies like Apocalypse Now and JFK better than when I was 14, but my love for Rambo and films of its kind will never diminish. This movie is amazing from start to finish.<br><br>Rambo's mission in this film is to go back to Vietnam and see if he can find a certain camp that may be harbouring POW's. But if he finds these men, he can only take pictures. He has a problem with that and when he does find one he is left behind by the \"stinkin bureaucrat\" named Murdoch who orders the mission aborted before Trautman can pick him up. It is while Rambo is captured that the movie becomes tight, tense and incredibly entertaining. Rambo is also fun to watch on a physical level. Stallone was in the best shape of his life in 1985 as he simultaneously made Rambo and Rocky IV. He is huge, ripped and strong as hell in this movie and it is his psychical presence that adds to his persona. He single handedly goes through a whole army and lives to go get the bastards that left him behind. Rambo is one of the old school feel good summer type movies.<br><br>Rambo does not claim to be JFK or Mississippi Burning in the sense that it wants you to leave the theater with a message. It has its own beliefs that is for certain, but what Rambo does just like Raiders does is, it entertains. It has you rooting and cheering for Rambo and dissing and swearing at the bad guys for 90 minutes. It is so much fun that I highly recommend this film to anyone who likes to be entertained. Leave your politics for some other movie, that is not what Rambo is about. It is about being entertained and wearing your emotions on your sleeve. That is what is beautiful about this movie. It doesn't apologize for being a bit over the top. Neither should you, for enjoying the film. It is a true wonder. A great piece of entertainment.","user":"baumer","rank":[142,184]},{"title":"A GREAT action film; Stallone IS THE PERFECT RAMBO!!","rating":20,"date":"20 March 2002","review":"Sylvester Stallone returns to the silver screen in this second chapter of the Rambo trilogy. This time, he is released from prison under the condition that he return to the  Viet Nam area to take pictures of suspected camps where American POW's are being held. He has to deal with having orders not to use deadly force and then having to dis-obey those very same orders or be killed. He has a new antagonist in the form of a Washington Bureaucrat named Murdoch who leads this fact finding mission. He soon realizes that no one can be trusted and even his former mentor Colonel Troutman (well portrayed by Richard Crenna) is in no position to assist him. What follows is battle after battle with Asian as well as Russian troops leading to an exciting climax where he confronts the REAL enemy. Add this one to your shelf of DVD's in the action section. This is a well directed and excellent film!","user":"brian james","rank":[47,59]}]