[{"title":"One of the best sequels known to man","rating":12,"date":"12 February 1999","review":"When I went to my local video store a year and half ago, I noticed that there were no less than four \"psycho\" movies there.  Having seen the original, I figured that they would all be cash-ins.  Two weeks ago I finally hired psycho 2 in to finally prove my point to myself.  I was wrong. This movie has everything a sequel to psycho could need. A great plot (probably better than the first one's), excellent direction, and great acting.  Perkins is so much better here than in the original psycho that one can't help thinking it's a shame that he passed away. There are heaps of reasons to see this movie, and very few not to if you're a suspense fan.  If you liked the original you'll love this, and even if you didn't you'll still love it.","user":"Beegee","rank":[41,45]},{"title":"Surprisingly good","rating":7,"date":"29 May 2001","review":"Norman Bates (Anthony Perkins) is released after over 20 years in an asylum, supposedly cured. He goes back to Bates Motel...but then he starts seeing his dead mother again, gets phone calls from her and the murders start up again. Is it Norman going crazy again or is someone trying to drive him to it?<br><br>A very good, intricately plotted sequel to Hitchcock's classic. This could have been a disaster, but it isn't. The plot has many twists and turns and moves quickly. Director Richard Franklin does an excellent directing job, setting up some very eerie shots and duplicating some of Hitchcock's shots from the original. Perkins is just OK (he should have toned down on the twitches) and Meg Tilly is her usual blank self but there is a strong supporting cast including Vera Miles and Robert Loggia. One minor problem--was it necessary to get so violent and bloody at the end (although it's restrained for a 1980s horror film)? Still, worth catching. Great final shot too.","user":"preppy-3","rank":[40,45]},{"title":"Underrated","rating":26,"date":"26 August 2003","review":"What a pleasure it is to see good old Norman in this rather decent sequel to the acclaimed the movie 'Psycho' - Anthony Perkins' role in this film is one fantastic, also an interesting and unpredictable plot buffers up the quality of this film, a great film, and a hidden gem....RECOMMENDED","user":"samip15","rank":[12,12]}]