[{"title":"Charlie Chaplin at his best.","rating":10,"date":"15 May 2001","review":"The Gold Rush is one of Chaplin's best films, as well as one of his most famous. It has been said that it is the film that he most wanted to be remembered by, and it's not hard to see why. Chaplin plays the part of the lone prospector, a young miner during the gold rush. After getting caught in a storm, he hurries to the only shelter that he can find, a wood cabin in the middle of the storm. It turns out that it is already inhabited, and by a tough criminal named Black Larson, no less, and the scene in which Charlie and Big Jim, another prospector, insist to Black Larson that they are going to stay is one of the countless memorable scenes in the film.<br><br>\nCharlie and Big Jim are left alone and without food when Larson goes off to face the storm looking for food (having drawn the lowest card in another amusing scene), and the scenes in the cabin are some of the best in the entire film. There is, of course, the boot eating scene, memorable not only because of its cleverness and effectiveness, but also because while making the film, Chaplin ate so much boot (which was made out of licorice) before he was satisfied with the take that he had to be taken to the hospital to have his stomach pumped. Another thing that was really well done was the special effects. I am still amazed every time I watch the film at how realistic it looks when there is a long shot from outside showing Charlie hanging from the door of the cabin, which is balanced precariously on the edge of a cliff. Also notice the fast paced and very effective music during this scene, the same song that is played in the best scene of the 1996 film Shine, with Geoffrey Rush. <br><br>There is also a very noteworthy love element of The Gold Rush, a part of the story that Chaplin generally has much success with in his films. Charlie's amorous interests in Georgia, a dance hall girl, leads to the scene where he performs the famous dance of the dinner rolls, probably the most famous scene in the film, which was also performed very well by Johnny Depp in Benny &amp; Joon. Charlie's relationship with Georgia is also the thing that leads to his presentation of his sympathy for the lower classes, when he meets her on the ship after having become a multi-millionaire. Chaplin's full length films are inherently more famous than his earlier short comedies, and The Gold Rush is one of the best of his full length features. A must see for any Chaplin fan, but The Gold Rush is also a film that anyone who is interested in quality comedy should watch.","user":"Anonymous_Maxine","rank":[45,57]},{"title":"You just can't beat Charlie Chaplin!","rating":10,"date":"13 May 2005","review":"The 1898 Gold Rush to Alaska may have been harsh, but Charlie Chaplin makes it hilarious. As an unnamed prospector, Chaplin goes through a series of gaffes while seeking gold in the Yukon. Most famous of course are the shoe for dinner, the dancing roles, and the cabin teetering on the edge of a cliff. His companion, Big Jim McKay (Mack Swain) at one point is so hungry that he believes Chaplin's character to be a chicken, and before long, a bear enters their cabin. In the midst of it all, the prospector falls in love with dancer Georgia (Georgia Hale).<br><br>A real triumph for Charlie Chaplin! They must have had a lot of fun filming it!","user":"lee_eisenberg","rank":[29,36]},{"title":"Gold is the operative word here.","rating":10,"date":"7 June 2004","review":"The Gold Rush is pure gold.  It was Charlie Chaplin's third feature-length film, and marked his comeback of sorts following A Woman of Paris (1923), which he had directed to great critical acclaim but which had been unsuccessful at the box office because it lacked his signature character The Little Tramp.  <br><br>This movie should be counted among Chaplin's best and most enduring works; many people name City Lights (which I've also seen) as THE best Chaplin movie, but The Gold Rush is still an excellent showcase for one of movie comedy's immortal geniuses.<br><br>Having first seen this movie years ago on TV, I saw it again in October 2003 as part of my college's silent-film class, on a poor-quality videotape that often prevented the other students and I from laughing at it because we could barely discern what was happening on the screen. <br><br>\nEven so, I was sufficiently intrigued to buy the GR Chaplin Collection DVD, which has a restored silent version of the film that is so good I haven't even bothered to watch the 1942 sound version that's also on the disc.<br><br>The viewing quality of this restored silent version is excellent, although certain minor details are still hard to see, such as the faces of the cards drawn by the Tramp, Jim McKay and Black Larsen as they try to determine who should go out into the blizzard.  On the other hand, in the shot of the cabin teetering on the edge of the cliff, the viewing clarity makes clearly visible the wire used to pull the model cabin farther over the edge!<br><br>Also, the film seems to skip in the scene when the Tramp dances with Georgia, perhaps due to a transfer problem with the DVD.  But these are minor complaints, and certainly the restoration allows for full appreciation of the film.<br><br>The first half-hour of The Gold Rush is in itself worth the purchase price, as it contains some of the funniest scenes I've ever seen in any movie. Even the throwaway bits, such as the Tramp trying to use a crude hand-drawn compass, are more genuinely funny than the extreme gross-out gags offered by most contemporary comedies.  <br><br>And the shoe-eating scene is so famously funny that even people watching it for the first time may feel that they've seen it already: this is in no way a bad thing, but merely reflects the fact that the best silent films long ago entered into the collective memory of our culture.<br><br>I don't say this to sound pretentious.  I believe that because Chaplin had such influence on the development of movie comedy, that to a certain extent people today may take him for granted.  It's hard to approach his work with fresh eyes only because so many people have watched his movies for so many years.  <br><br>For example, before the success of The Kid (1921), Chaplin's first feature film, the movie industry doubted that audiences would accept a film that blended comedy and drama.  In The Gold Rush, Chaplin further explored cinema's potential to be comedy and drama simultaneously.  Only he could have distilled humor from scenes of starvation and struggles to survive the ravings of a madman.<br><br>The joy of watching this film today stems from seeing how well Chaplin, as both star and director, finds and maintains the right tone and style for his work, negotiating the fine line between comedy and tragedy.  This is most evident in the scene when McKay and Larsen struggle for the shotgun in the cabin and the Tramp tries desperately to escape the muzzle's aim: the sequence is undeniably hilarious, yet even today the Tramp's grim predicament is just as likely to horrify the viewer.<br><br>One pleasure of silent comedies such as The Gold Rush is that the lack of a soundtrack leaves more to the imagination, in the same manner that old-time radio comedy got laughs from funny sound effects that showed the audience nothing.  <br><br>When Black Larsen sees the Tramp in the cabin, for example, he enters and slams the door, causing the Tramp to spin around in alarm.  This is the kind of joke that could only work in a silent movie, because no door-slamming sound effect could be quite as funny as the piano score imitating the noise, as rendered by Neil Brand on the DVD.  <br><br>The second act, in which the Tramp gives up prospecting, returns to town and becomes infatuated with Georgia, was probably inevitable, as Chaplin realized he couldn't sustain the entire film at the cabin.  Still, he must have drawn much of his inspiration from that one location, because he returns his characters to the cabin in the film's third act. <br><br>\nI don't want to spoil the climax for anyone who hasn't seen it, but I believe that even today it remains one of the most vivid depictions in cinema history of man versus the elements, and Chaplin milked all its potential for comedy and suspense.<br><br>Mack Swain is hilarious as Jim McKay, creating a memorable comic image with his ridiculously small boots and high-domed fur coat.  Chaplin generously gave him some opportunities to be funny on his own in this film, just as he was content to let Jackie Coogan share the spotlight in The Kid.  From what I've seen of City Lights and Modern Times, he was not so generous in his later films, seeming to think that he himself was the whole show. <br><br>\nThe Gold Rush may not be a perfect 10 compared to today's more sophisticated stories and special effects.  The ending is cheerfully cynical, improbably reuniting two characters and never revealing Georgia's true feelings for the Tramp.<br><br>But the bottom line is that The Gold Rush is still funny after almost eighty years, and that's a feat few comedies in any year can ever accomplish. Chaplin, in his ability to extract maximum humor and poignancy from his material, has no equivalent today.  What a shame.<br><br>Rating: 10 (One of the best movies of 1925.)","user":"PhilipJames1980","rank":[60,81]}]