[{"title":"Decent, fairly enjoyable film.","rating":20,"date":"20 June 2004","review":"When Robert Redford delivered this film to the studio upon completion, the suits weren't sure what to do with it.  How does one sell a pensive film about Pyrrhic victory?  Against Redford's wishes, the studio ultimately marketed the film as a sports movie (\"See hottie Robbie in exciting skiing scenes!\"), and confused audiences avoided the film in droves.  Redford, frustrated with the experience, created the Sundance Film Institute as a reaction to his experiences with \"Downhill Racer\".  <br><br>Today, it is for this reason that \"Downhill Racer\" is best remembered, but one shouldn't overlook the work itself.  The film, the first in an unfinished trilogy of films about the price of success (the second was \"The Candidate\"), is a thoughtful study of competition and competitiveness.  Gene Hackman shines as the impatient coach, but Redford gives one of the finest performances of his career as the brooding, singular-minded athlete. Redford's performance is reason enough to watch the film, but the skiing scenes are also quite entertaining, as they fully capture the excitement and exhilaration of Olympic competition.  The dark, ironic story, while slight, is still effective enough to make its point.<br><br>I shouldn't like to call this film a masterpiece; it isn't.  It's a decent slice of cinema that is very unfairly maligned by too many.  If you, like those studio executives, prefer a straightforward sports story in which the underdog wins and gets The Girl, look elsewhere.  However, if you prefer an intelligent investigation of the human condition, well, you could do worse than \"Downhill Racer\".","user":"Donny_Stay","rank":[23,27]},{"title":"Downhill Racer is a character study.","rating":22,"date":"22 May 2001","review":"In this film, Robert Redford plays David Chappellet a young man training on a ski team with hopes of making the Olympics. The film is basically a character study of a somewhat narcissistic, shallow, self-centered guy from a simple rural background who dreams of attaining fame and fortune by entering the Olympics as a downhill racer.  Throughout the film we see examples of his failure to connect with people.  He visits his dad on his ranch and is received with complete coldness and indifference.  He pulls into town and picks up an old girl friend, takes her for a ride and they have sex.  Afterwards, he completely ignores her when she tries to tell him about her life. He pursues Camilla Sparv who plays the beautiful Carole Stahl.  In her, he has met his match. She seems to be someone who also uses people, never lets them get very close and always has an agenda to get what she wants.  She works for a ski manufacturer who seems to use her to bait the young up and coming skiing stars that he seeks to groom for product advice and future endorsements. She is narcissistic, shallow and self-centered like him but she is also elusive.  This plays to the competitor in him and she knows that.  Throughout the film we see Gene Hackman who plays the skiing coach Eugene Claire.  We witness numerous scenes where Chappellet ignores his advice and counsel, where the coach calls him on his arrogance and selfish attitude.  But in the end, they triumph and seem to be headed for the Olympics.  But in the last brief scene, victory and fame seems so fickle, elusive, short lived, it all seems superficial.  Redford is wonderful in this and of course, Gene Hackman is just as good.  Seeing these two early in their careers, that alone makes this a film worth watching.","user":"MICKEYGORMAN","rank":[18,21]},{"title":"An unpolished gem","rating":16,"date":"16 May 2001","review":"Redford gives a low-key performance as a thoroughly unlikable member of the US Ski Team in the late 1960's, and he doesn't become any more likable as the story unfolds. Perhaps that's why the film gets such mixed reviews. The Olympic and racing sequences have an almost-documentary look to them, and for good reason. The story goes that IOC officials refused permission for the film crew to shoot during the actual Olympic events; the producers got around that inconvenience by giving hand-held cameras to cast members so they could shoot crowd scenes and background footage on the sly. It's hard to like David Chappellet, and making him a more sympathetic character might have been easier, but I think it's a much better story as-is. As we know all too well these days, world-class athletes aren't always aren't always the charming heroes we'd like them to be.","user":"oldskibum2","rank":[14,17]}]