[{"title":"Wonderful political drama/comedy by Ford","rating":9,"date":"25 July 2005","review":"\"The Last Hurrah\" tells the story of old-time, machine driven, local politics. Both the good and the bad sides.<br><br>On the good, you had a cluster of politicos who worked hard for their citizenry. Efficient, powerful and determined, they could get the job done, with a pat on the back or the wink of an eye.<br><br>On the bad you had a cluster of politicos who expected a quid pro quo for favors they delivered. They expected those they helped to help them at the polls. They also usually helped members of their own group more than other people, as well.<br><br>In \"The Last Hurrah\", this type of old-time politics is coming to an end. Television campaigns are being introduced, and at least one of the candidates is learning that you can reach more people in a two minute ad, than you can by standing on local street corners giving speeches. It is the dawn of a new political era.<br><br>Spencer Tracy plays Mayor Skeffington, an old political pro, who is about to run his last campaign. He believes in the old ways. Pressing the flesh, meeting his constituency face to face. He is more apt to apply the pressure of his office in order to get what he wants, than he is to seek a consensus on matters. Tracy is perfect in this role. In many ways it is Tracy's last hurrah. He would appear in only a handful of films after this one. Since the film was made in 1958, you could also say that his style of acting is giving way to a new breed as well.<br><br>Jeffrey Hunter is effective as Tracy's nephew. A political neophyte, who learns to admire Skeffington the man, and mayor.<br><br>Tracy is surrounded by one of the best supporting casts to be seen on film. His \"backroom\" boys are Pat O'Brien, James Gleason, and Edward Brophy. Watching them, you get the sense of the type of \"cigar filled rooms\" they worked in to get deals done.<br><br>Basil Rathbone, Donald Crisp, John Carradine are all perfect in their roles as well. Wallace Ford and Frank McHugh add \"local flavor\" to their roles as traditional opponents to Skeffington.<br><br>But it is Tracy who carries this film, and he does so handsomely. I am one who believes that many of his best performances were his last ones. I think because he seemed more natural and there seems to be less effort and fewer mannerisms in these performances. \"The Last Hurrah\" demonstrates this.<br><br>Tracy at the top of his game with many of his, and Ford's, old cronies, making another classic.","user":"alfiefamily","rank":[45,46]},{"title":"Somehow, Ford has managed to make a film that is BOTH cynical and sentimental","rating":8,"date":"29 November 2006","review":"John Ford's version of the book, THE LAST HURRAH, is a behind the scenes look at one last election campaign for an aging mayor (Skeffington) of a town whose name is never mentioned in the film. In many ways, the film is a bit cynical as it showed the way that politicians wheel and deal and manipulate--but in this case, always for a good cause. While Skeffington is definitely not above using these questionable tactics, at the same time, he is shown as fundamentally decent and very, very sentimental--with a true love for his constituents. This is a very difficult balancing act for the film--combining gritty realism with sentimentality, but it manages to do so.<br><br>In many ways, this is highly reminiscent of the real life Ford, as he was by many accounts a highly manipulative son of a,.....well, you know what I was going to say. Yet, at the same time, sentimentality abounds in his films like no other film maker. You can see it here in his liberal use of old and almost forgotten supporting stars--such as Eddie Brophy, Frank McHugh and Jane Darwell.<br><br>Overall, the film is very interesting and manipulative (in a good way), as you find yourself pulling for Skeffington and feeling his pain as well--even though he is a fictional character AND a politician! The film is well worth seeing and the film is extremely well-acted and directed.","user":"MartinHafer","rank":[15,15]},{"title":"\"Skeffington...Skeffington...Cast Your Vote For Skeffington...\"","rating":10,"date":"28 November 2006","review":"In the early 1930s John Ford directed a relatively unknown actor in a forgotten film called UP THE RIVER, about prison. After that effort they went their separate ways, Ford usually directing at 20th Century Fox, Republic, and other studios (RKO for MARY OF Scotland), but rarely at MGM. And when he was developing into Hollywood's greatest director, Tracy, after an initially unrewarding period at Fox, went to MGM and became their leading actor-star. But neither managed to find a project to do with the other. Then in 1958 Ford approached Tracy to play Mayor Frank Skeffington, the hero of Edwin O'Connor's novel THE LAST HURRAH. This time, with both director and actor at their peaks, the result was far more memorable than UP THE RIVER had been.<br><br>O'Connor's novel (a best seller in it's day) was a fictionalization of parts of the career of James Michael Curley, a man who became synonymous with the city of Boston. Boston's laws were peculiar regarding electing Mayors. After some bad experiences in the 19th and early 20th Century, the city decided that Mayors could not have consecutive terms in office - that they could serve as Mayor frequently but (like Grover Cleveland's two terms as President) not one term following another. This was okay with Curley, who ended up the most re-elected Mayor in Boston, serving four terms (each four years in length) over a period of two and a half decades, with a two year term as Governor of Massachusetts as well. A remarkable career for his day or any day. <br><br>He was corrupt as they come - but he always pointed out that his corruption benefited the public (usually it did). It was like the old Tammany Hall dictum of their Sachem George Washington Plunkitt about good graft and bad graft. Good graft enabled the construction of roads, repairs of streets, public building projects (that were needed), bridges, tunnels, etc. In short, they enhanced or helped the city. Bad graft was like stealing the tin roof of the town orphanage to sell it to a metal dealer! Boston had many improvements under Curley, but plenty of pay-offs. Yet, he was a master at manipulating public opinion. The Irish and other ethnic groups (including Jews and African-Americans) became his voting blocks because the conservative opposition was hide-bound old Puritan - Yankee (and old money), and anti-minority. It worked like a charm for Boss Curley. It got him to the state house. It was only towards the end of his career (when he got involved in a postal fraud) that he went to prison for two years. He left prison and was re-elected Mayor of Boston!<br><br>The novel emphasized the more \"hamish\" elements of Curley's success. His ability to have loyal lieutenants (here played by Pat O'Brien, Ricardo Cortez, James Gleason, and Ed Brophy as his gopher \"Ditto\") and to have loyal friends (even including opponents) like Anna Lee, Wallace Ford (as a crank political rival), Frank McHugh, and Jane Darwell. Even some of his critics like and respect him (even if they don't always support him), such as the Cardinal (Donald Crisp) and the local Episcopal Bishop (Basil Ruysdael). <br><br>Tracy basks in this warmth, as well as that of his nephew Jeffey Hunter. It's good he has it, as his son (Arthur Walsh) is a total wash-out as an emotional support (the boy just likes dating pretty girls, going golfing, and hearing jazz). <br><br>Tracy invites Hunter to follow the last campaign. He is smart enough to realize that this mayoralty campaign is the last of the old time, political clubhouse type elections. Tracy has noted the rising media of television and radio, and knows in a few years they will dictate the political future. Ford captures this horrible future well, showing the inept, wooden candidate McCloskey, with his wooden wife and kids (four of them), and a rented dog they don't like, on television. <br><br>It's a rich film, and a warm one. The villains are evenly dispensed - Basil Rathbone as banker Norman Cass, John Carridine as editor Amos Force, Willis Bouchey as Roger Segrue are a trio of types, but each is different. Rathbone is a patrician, and dislikes Tracy for his background (he represents the loss of the patrician class's power to the lower classes). Carridine simply hates him for a piece of bigoted history on his own family's part. Segrue demonstrates that intolerance can be found in the Catholics as well as the Protestants. But there are differences. Rathbone, fed up with his ally Carridine at one point for his suggesting the banker could have put pressure on Ruysdael on a political matter, shoots a cutting statement that if it was up to Carridine (a former member of the Ku Klux Klan) they'd be burning a cross in the bishop's front lawn!<br><br>The film ends with Bouchey suggesting that if Skeffington had it all to do he would do it differently. Skeffington smiles, and says \"Like Hell I would!\". When the novel came out James Michael Curley was still alive, and angry...he threatened to sue. But then he noticed the public liked this friendlier image of himself from the novel. He dropped the lawsuit, and wrote his memoirs. He entitled the memoirs, \"I'D DO IT AGAIN!\"","user":"theowinthrop","rank":[15,15]}]