[{"title":"Excellent movie for a date","rating":7,"date":"15 May 2006","review":"I first saw this film in a theater on a date, and it was an excellent choice, with science fiction for the guys, romance for the ladies, a pleasant feel throughout, and nothing too racy or too gory. I'm really surprised at all the negative comments about this film, and how it should be remade. I thought it was quite good as it was, other than in a few minor details, and I can't imagine it being remade without destroying the special moods it created.<br><br>My favorite part is the aerial scene of the orange groves and eucalyptus trees in inland California as David and Allison are driving down a rural highway, seeking out David's old friends. After all the tension in the earlier part of the film, this peaceful interlude set to pleasant music while soaring over the rolling hills is a beautiful contrast, and it becomes the high part of the film. The soothing old '40s music that David switches to on the car radio adds to the ambiance, and it becomes easy to imagine that time has stood still in this part of the country, which of course fits perfectly with the main plot. This mood is extended by David pointing out old landmarks he remembers: a church, a big old tree, and an old gas station. Then old black-and-white photographs on the wall of the gas station of David and his father bring the point home that David was telling the truth all along. It's a poignant scene as David is proud of his dad's accomplishments late in life while he simultaneously laments his father's passing. Too often nowadays films are made with \"yang-on-yang\" nonstop tension, action, and violence without any pleasant, relaxing high points, so I think this film was very well balanced in that way.<br><br>There are a number of other very well-done tidbits throughout the film. For example, David's question to the doctor, \"Is this sort of thing possible now?\", when describing time travel is something that only a bona-fide time traveler would say, and I remember the audience chuckled in delight at that perfect bit of dialog. Another gem is when David bluntly asks the transvestite in his jail cell, \"What the hell are you dressed like that for?\" I've known down-to-earth, practically-minded, heterosexual sailors, and that's exactly how they react to our modern era's confusing gender bending. Another gem was David flatly declaring that the water his friend Jim sees in the distance is a mirage, and then Jim ribbing David about David's mistake as they trudge through miles of water.<br><br>I thought the romance worked extremely well. Note David's defensiveness about his love life when he's in the '40s, and how standoffish his '40s girlfriend is, and then contrast that to the magnanimous personality of Allison in the '80s, who coincidentally has the same curly red hair as his '40s girlfriend--evidently the look David likes. Allison becomes the ideal version of his '40s girlfriend, and understandably becomes David's new focus in life. They make a very nice couple, I think.<br><br>There are admittedly some weak points in the film. The 2001-type vortex travel scene has some unconvincing effects, but considering they're trying to show what the fourth dimension looks like, which presumably has nothing in common with our universe, it's hard to find fault in their visualization. The glowing hands and electric arcs flying out from the arcade games and power lines are a little weak, as are people's reactions to those, and the carrying of top secret papers, and the implausible landing on a ship in a vortex, but I regard those are minor points. The modern day reaction of Jim to his old friend seems unrealistic at first until you think about it, and the explanation given about Jim's psychological problems after the experiment makes perfect sense and adds a bit of unexpected realism. In real life you can't expect to look up old friends and have everything go back to the way it used to be. Such details in the film fit together quite well, I believe. <br><br>Whether or not this movie follows the historical facts and rumors of the original Philadelphia Experiment isn't particularly important to me. What I care about is whether the film stands on its own as a piece of art, and in my opinion it definitely does. This is a film I find myself thinking about from time to time, and I like to watch it every so often. To me it's a film worth owning.","user":"simnia-1","rank":[57,70]},{"title":"Underrated, Excellent","rating":11,"date":"11 March 1999","review":"This film is brilliant - I don't care what others think - It is your basic adventure time travel film. I think the plot is genius - When something disappears nobody thinks what's going on while it's invisible - This is what happens in the film as a ship is cloaked during world war 2 to prevent radar detection but the ship completely vanishes - while invisible 2 crew members jump overboard into one of the best time warps i've ever seen, into 1984 - I think the acting, effects and overall tension of the movie was way ahead of it's time and will remain my personal favourite film.","user":"Madman-10","rank":[65,82]},{"title":"I'm a sucker for a time travel movie...","rating":29,"date":"29 May 2001","review":"I've seen every time travel movie ever made, and I must say that the Philadelphia Experiment ranks pretty high on my list of favorites. Despite the cheesy love story (almost as bad as Titanic or Pearl Harbor) the effects are pretty good and the story is cool.<br><br>The actors were fair (Nancy Allen was great, though) and the screenplay is pretty good. It's a really interesting story in itself, though. If you have any interest at all in this movie, I would strongly recommend looking for books about the actual Philadelphia Experiment. (sometimes found in collections of paranormal phenomenon) The supposed true story involves tests to camoflauge a navy ship - rendering it either invisible to radar or TRULY invisible (stories vary as to the exact intent of the experiment) apparently through the use of magnetic fields. The rumor is that the ship disappeared from the Philadelphia naval yard and TELEPORTED to a Virginia naval yard. The crew had a variety of side-effects, ranging from temporary invisibility and/or intangibility to getting phased into solid objects and getting stuck there. (a couple of people who were phased into solid objects can be seen in the movie - pretty cool!) The \"true\" story makes a great read and even if only a fraction of it is true, it's a pretty remarkable idea that any of it happened in reality.<br><br>The Philadelphia Experiment is an entertaining movie, but more for sci fi fans and their girlfriends rather than the average moviegoer. Stay away from the Philadelphia Experiment II, though... it's just awful.","user":"Lone Wolf","rank":[53,66]}]