[{"title":"I love this movie!","rating":10,"date":"18 March 2006","review":"I know this movie is so cheezy, but it cracks me up every time I watch it. I grew up watching this movie and I'm sure that had a lot to do with it. It is so great! \"Is good, is funny!\" My best friend and I use to watch this movie so often that at one point I believe we knew all the words to it. It is not a movie that most people would like watching it for the first time as an adult. I have many fond memories of my friend and I laughing and repeating the lines while we were and weren't watching the movie. The best scenes in the movie are with Michael Richards who plays Fejos. He is absolutely hysterical! I think that he totally made the movie. I think it was a very fun movie.","user":"holliday0531","rank":[27,36]},{"title":"awesomely hilarious","rating":10,"date":"18 August 2005","review":"This movie is possibly my favorite ever. The comedy is at times intelligent, at other times just plain slapstick-style hilarious (micheal richards, slapstick similar to \"kramer\" from seinfeld style action), and at the best times the movie contains that awesome brand of sarcastic comedy that jeff goldblum is famous for. I love jeff goldblum and certainly all of the other actors of this fine film. Jeffery Jones, whose amazing comedy stylings were also a part of what made Ferris Bueller's day off and beetle juice great movies, brings the same amount of quality acting to this flick. Speaking of beetle juice, i would have to compare this movie with that, they both are extremely funny movies that have horror based plots. Plus, this movie has lobotomy in it!","user":"ibooklover123","rank":[21,29]},{"title":"Good one","rating":15,"date":"15 October 2004","review":"Transylvania 6-5000 is the movie that my siblings and I make inside jokes about and no one ever gets them. This movie is funny. The person that wrote the highly retentive review above is lacking a significant character trait necessary to positively judge such films: persistent immaturity. OK, his mother may be really proud of him. However, the ability to appreciate the validity of Transylvania 6-5000 is unique, and I am quite happy to admit that I am a fan. And believe it or not, I am not a weirdo movie buff who goes out of her way to \"appreciate\" stupid ass movies. Rather, I look to flicks such as the one in question to remind me so fondly of my 80s childhood. Stupid humor is remarkably cathartic, especially when nostalgia pervades, and that is why I love Transylvania 6-5000. Watch it and love it.<br><br>One liners make my life worth living.","user":"calabrella","rank":[28,43]}]