[{"title":"Better than you would expect!","rating":28,"date":"28 April 2006","review":"Tatum O'Neal and Irene Cara end up in court together. When a shootout in the courtroom cause everyone to flee, Irene and Tatum inadvertently end up running from the bullets and the cops. Pretty fast paced action keeps this B-Movie humming along pretty good. Tatum and Irene believe it or not have good chemistry together. Tatum plays a hardened toughy pretty well and in my opinion makes this movie entertaining. A little far fetched (what Hollywood flick isn't?) but still enjoyable. See it uncut as a TV version will be heavily edited. Peter Fonda makes a cameo as a sleazebag. One thing I learned from this movie is that sewer gas is highly flammable? Who knew?","user":"Hoohawnaynay","rank":[7,7]},{"title":"50% prime exploitation","rating":5,"date":"5 March 2017","review":"As noted by other IMDb users here, \"Certain Fury\" is essentially an updating of the Sidney Poitier / Tony Curtis movie \"The Defiant Ones\", though changing the sex of the central characters as well as adding gratuitous exploitation material. Nothing really wrong with that idea, at least if you are as big a fan of exploitation movies as I am, but the end results are only partially successful. <br><br>The movie gets off to a great start, being swift and packing in much exploitation and other good stuff. Though after the first thirty or so minutes, the movie becomes greatly uneven. There is some good stuff to follow, but they are bright moments lost in a suddenly slowing storyline. The movie almost gets boring at times because of this. Also, the ending is kind of weak, written and directed in a way that seems to come out of a much more serious movie than this.<br><br>Is the movie worth seeing? Well, if you are a patient fan of B movie exploitation, and you can see the movie cheaply or for free, then you'll probably get a reasonable amount of enjoyment out of it. If not, you'll probably be in the title state long before the movie reaches the ending.","user":"Wizard-8","rank":[5,5]},{"title":"Or, what happens when excesses of the 1970s bottom out in the 1980s...","rating":6,"date":"5 December 2006","review":"Oscar-winners Tatum O'Neal and Irene Cara in an exploitation B-flick? Well, yes and no. \"Certain Fury\" was obviously made to appeal to the midnight-movie crowds, but there is strength in some of O'Neal's scenes with Cara (playing two girls on the lam after a courtroom shootout leaves blood and bodies everywhere). I liked it when Tatum suddenly turns maternal towards Irene and nurses her back to health (after rescuing her from a drug den). With Cara slung over one shoulder burbling about her mom, Tatum quietly says \"I know, I know.\" This is a good scene; in fact, the picture has several good moments, but every bit with Cara's father (played by Moses Gunn on the verge of tears) is a bummer and Peter Fonda's cameo appearance is awful (you can't tell if he's slumming without effort or if he's just a lousy actor). There's an elaborately staged fight scene between O'Neal and her boy-toy which is unintentionally funny, and the dialogue is so perpetually profane it becomes a running joke. But I enjoyed \"Certain Fury\" and think O'Neal's fans will love her tough girl performance. **1/2 from ****","user":"moonspinner55","rank":[7,8]}]