[{"title":"a flawed masterpiece","rating":8,"date":"27 September 1998","review":"This underrated/underseen Huston film is definitely worth a look. Newman is wonderful as Roy Bean, and the large supporting cast is amazing, especially Anthony Perkins as a travelling padre, Stacy Keach as Bad Bob, Roddy McDowell as a wormy lawyer, Ned Beatty as the outlaw who'd rather be a bartender, and John Huston himself as Grizzly Adams. This is not a perfect picture at all. It falls apart by the last third or so, has a terrible day-for-night process shot that doesn't really work, and a unnecessary and embarrassing \"raindrops keep falling on my head\"-type musical montage, but the rest of it is great fun.  This is the crazy kind of script Milius used to write in the 70s, like Apocalypse Now and especially 1941. The tone is very odd, but if you like your comedy dark and your westerns satirical you'll find lots to like about this one. A very broad and dark performance by Newman, who manages to find the pathos and integrity of this western charicature.  It's a nice companion/contrast to Butch Cassidy and the Sundance Kid. Kind of what Rami must have been going for in The Quick and the Dead (minus the Spaghetti Western style), and the examination of the mythic hero that Roderiguez tried for in Desperado, but much better achieved by Huston (duh). Fun stuff.","user":"Holden_Pike","rank":[30,41]},{"title":"Newman does his best with the material","rating":7,"date":"3 July 2005","review":"Bean rides into Vinegarroon, Texas in 1890, and is promptly beaten, robbed and hanged by degenerate outlaws and whores The rope breaks, and he returns, shooting everyone in revenge Then he declares himself \"the Law West of the Pecos,\" makes the saloon his courthouse, and swears to uphold the honor of his ideal, the beautiful British actress, Lily Langtry <br><br>He takes Marie, a Mexican girl (Victoria Principal), as his mistress, and administers justice by hanging men and confiscating their property to make the town (renamed Langtry) prosperous Eventually, the community turns against him, and Bean rides out, defeated <br><br>Twenty years later, in 1925, the town is run by Prohibition gangsters and evil oil men Out of nowhere, Bean, now seventy, appears and purges the town by shooting the criminals<br><br>In a sense, Newman comes full circle from his first Western, in which Billy the Kid also said, \"I am the law,\" and fought evil by becoming judge, jury and executioner But whereas Billy was a neurotic, pitiful adolescent, Bean is presented as an admirable, mystical character <br><br>The film tries to make Bean another lovable character on the order of Butch Cassidy: he hangs and shoots men while quoting the Bible and delivering wisecracks, and he punctuates their deaths with punch lines<br><br>Newman's funniest scenes are with a huge bear named Bruno, who, like Bean, is grizzly, guzzles beer and deals violently with outlaws; at one point he delightfully evokes Bean's wrath by drunkenly licking Lily's poster In William Wyler's \"The Westerner,\" Walter Brennan as Bean upstaged Gary Cooper; here Bruno upstages Newman In any case, the outrageous gallows humor and broad caricatures fail to disguise the fact that unlike Butch, Bean is a vicious fellow","user":"Nazi_Fighter_David","rank":[22,29]},{"title":"A timeless treasure by one of Hollywood's greatest directors","rating":9,"date":"29 June 2002","review":"The late 60's and early 70's produced several great comedic westerns i.e. Cheyenne Social Club, Dirty Dingus McGee, Great Scout, The Rounders, Evil Roy Slade, Support Your Local etc. The list goes on and on. Those movies were all great, but pretty much one dimensional and set the tone for some collective disappointment over the content of Judge Roy Bean. There are some great hilarious moments in this film and I never really got it until recently. It's actually a love story, and a comedy as well as John Huston's own statement about the retreating old west. If you view it in that context you'll be very impressed. If you're looking for pure comedy you may find that it drags in moments. However, this is the last time you'll get to see Paul Newman with that devilish Eddie Felson/Ben Quick light in his eyes, he was made for the part as a self-appointed and self-styled Judge/philosopher that dispenses justice to just about everyone that wanders through his town whether they deserve it or not. And Judge Bean also showcases IMO the best villian of all time in Bad Bob, a murderous long haired psychotic albino come to lay ole' Beano to rest. Victoria Principal is so cute you just want to, well you'll see. Anyway, it's very funny but it is a love story. I found that rather distraction 30 years ago but I didn't get it. Well worth a watch. 9/10","user":"Ghenghy","rank":[27,37]}]