[{"title":"Are you someone's parent? Are you someone's child? SEE THIS MOVIE!!","rating":18,"date":"18 April 2001","review":"When \"Parenthood\" first came out, I did my level best to avoid it, certain that it seeing it would be roughly akin to being embalmed with maple syrup. Then came that dreadfully slow night at home a couple of years later, faced with a choice on the ol' tube between endless reruns of \"Three's Company\" and HBO showing -- oh, no! -- \"Parenthood.\"  So I clicked on HBO, gritted my teeth, prepared for the worst . . .<br><br>And was wrong.<br><br>Ron Howard is one savvy filmmaker.  Maybe one of the savviest, I'm not sure. But I do know that, to make \"Parenthood,\" he combined his savvy with all the heart he could muster (which was plenty, apparently) and that the result is a masterpiece.<br><br>Virtually every aspect of parenting is examined; moreover, it is done in a way that -- miracle of miracles! -- causes you to think, and to feel, every bit as much as it makes you laugh.  Throat lumping up?  Not to worry, here comes another belly-laugh to smooth it out.<br><br>The key to the film's message may lie with Jason Robards' speech --\"There's no goal line in parenting, no end zone where you spike the ball and that's it . . .\" -- or it may lie with Keanu Reeves -- \"You know, Mrs. Buckman, you need a license to drive a car or buy a dog . . .\" -- or it may simply be Gil Buckman's (Steve Martin) heroism in salvaging his emotionally disturbed son's birthday party; then again, it might be embodied in the frantic, stressed out stoicism of Dianne Wiest's single mom character as she comes to grips with her teenage daughter's choices and impending motherhood.  But wherever you find it herein, the message is simple and profound: Parenthood is nothing less than heroism on a daily basis.  Quiet, unheralded, underappreciated heroism.<br><br>One of the finest things about this movie is that nobody steps out of character.  There are no miraculous revelations, no nick-of-time cavalry charges or character transformations.  Characters here solve their individual dilemmas by growing WITHIN their characters.  And realistically, at that.<br><br>It's been said that a really good story leaves its author crying as he/she writes the final pages.  Sometimes -- not often enough -- a really good movie can leave a reviewer the same way as he finishes his commentary, crying and laughing simultaneously.<br><br>Well, don't just stand there!  Someone get me a Kleenex!!","user":"bigpurplebear","rank":[79,86]},{"title":"Excellent mix of comedy and drama.","rating":9,"date":"2 May 2006","review":"This might very well be the most balanced- and excellent mix of drama and comedy I have ever seen. I already loved \"Parenthood\" when I was a kid and I perhaps love it even more now as a grownup, when I recently watched it again.<br><br>Perhaps the greatest strength of this movie is in its realism. Sure every character and event in the movie are somewhat silly and over-the-top but yet they also feel like very real problems and persons at the same time. This due to the great portrayal of the drama elements in the movie. These are real, recognizable or not, family-issues portrayed in this movie. It handles some delicate subjects but never without a smile as well. It makes this movie both touching and warm to watch, as well as fun and amusing.<br><br>Reason why both the dramatic and comical elements all work so well is also thanks to the cast. The movie has many well known actors in it. Tom Hulce especially impressed me and also Steve Martin was a great leading man, from the period when he was still funny in movies. Solid as always were Mary Steenburgen and Dianne Wiest. Rick Moranis surprisingly doesn't play a loser this time but he still is a nutty character in the movie. He shows in this movie that he also has some real acting skills. Keanu Reeves is also good in his role, from the period when he appeared mostly in just comedies. The still very young Joaquin Phoenix also plays a great and quite big role in the movie.<br><br>It has some totally unforgettable moments in it, both comedy-wise as in its drama. It all makes this movie one of the most warm and subtle movies ever made. It doesn't try to be funny, it doesn't try to be melodramatic. The end result of it all is an extremely well balanced and crafted mix of drama and comedy that works on both levels. You can watch this movie as a drama or as a comedy, so fans of both the genre will be pleased with this movie that surely does not disappoint in any way.<br><br>An early subtle Ron Howard masterpiece, that is criminally underrated here on IMDb.<br><br>9/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[39,43]},{"title":"parenting 101 (and a graduate course)","rating":9,"date":"2 July 2004","review":"there are movies that entertain... enlighten... challenge... confuse.<br><br>parenthood is a movie that will be more and more a classic as YOU move through life. it's a look at family-life and how we do the right things and the wrong things as we move from the \"parentED\" to the \"parentERS\". as lead-pastor of a church that is dedicated to serving 19 to 29 year olds, this is one movie that is as much a teaching lesson as it is entertainment. <br><br>when one looks to learn, there are many notes to be taken here. equally entertaining, the whole ensemble is stellar as it portrays the inner workings of the buckman family tree. <br><br>the 4 children of the patriarch and matriarch have grown and are now dealing with the parenting world first hand. they deal with the issues we all do: workaholism, divorce, \"super\"parenting, self-promotion, etc. as their circles of life intersect (and they always do...), all the family members come to some conclusions... between over-parenting and under-parenting, there's a place where love resides in all of its splendor and strain. love HAS to win the day... even when those we love do and act they way that troubles us. life is an eXpedition:... where we can struggle through it alone, or in with the support of others... but we're definitely going to have to be moving forward. <br><br>\"parenthood\" reminds us all of the journey we're on. as parents we really cannot live FOR our children... for really, we ALL are children... still learning and making mistakes along the way. we recognize that what we really need in our lives are people who will love us all along the way. we then realize this is what our children need as well. <br><br>the movie has so many deeply poignant, yet roll-on-the-floor funny moments. <br><br>two of many favorites: when the patriarch (jason robards)talking to (steve martin) realizes that his job as father never ends... \"there is no end, you never cross the goal line, spike the ball and do your touchdown dance, never... i'm 64 and larry is 27... and he's still my son, like kevin is your son... you think i want him to get hurt?... he's my son\". also when grandma explains life to her joy of a roller-coaster over a merry-go-round... \"that a ride could make me so frightened, so scared, so sick, so excited and so thrilled all together... some didn't like it... they went on the merry-go-round... that just goes around... nothing... i like the roller-coaster... you get more out of it\". life is seen as it's best understood... an amusement park that we all are going through. our perspective and our faith are the important factors.<br><br>to me, this movie is way more then entertainment... it's a blessing. it will teach... if we are willing to learn.<br><br>enjoy... and take good notes, ron","user":"wotrwokr-1","rank":[38,48]}]