[{"title":"Put that on DVD !","rating":8,"date":"10 December 2007","review":"I don't know much about the history of this movie which nevertheless seems to be interesting. I've read nearly all the comments on IMDb about it (on a rainy Sunday) which, with a few exceptions, sound all alike. I'm 37, so I didn't have the chance to watch it in a theater. I'm unfortunately not able to find out anything about the original aspect ratio of it. A video (VHS) (with aspect ratio 1.33 : 1) edition came out in Germany in 1987 and it's not hard to track down these days. I bought it a week ago together with Friedkin's 'Cruising' from that same year and watched them as double features with friends (all around my age). First I have to say (for both movies): Neither my friends nor me (all being not 'politically correct' but very sensitive about offensive perspectives, words or actions going out from filmmakers concerning their attitude about the subject of the particular movie) found anything projectedly homophobic in those movies! Talking about 'Windows' I'm not quite sure that Elisabeth Ashley's character is a lesbian at all. She seems to be more like a split personality with psychotic parts. There may be lesbian undertones but the topic in itself is not exploited (negatively or machoesque or in any other way) here! I'm sure there were no 'bad' intentions (not from Gordon Willis and not from Mister Friedkin, concerning the other 'case')even if considering that times were pretty different in 1979/1980. As you can see from the title windows are used as key visuals in this movie. Much of it is seen (in both directions) through them, very often the city and the (then intact) skyline of New York (which is photographed so hauntingly beautiful that sometimes it seems to stand in the middle of the room with the actors). So naturally a voyeur's view is achieved, which stresses the (as I see it) purpose of the movie: A comment about dysfunctional social life in modern big cities used as background for a moody thriller. Talia Shire (as Emily Hollander) is stuttering and having a divorce, everybody seems to have an analyst and even Elisabeth Ashly's character is almost painfully lonely and more of a victim than anything else. Being a very important and successful director of photography Gordon Willis nonetheless relies a bit too much on his strong, dark and sometimes (seen from today) beautifully old-fashioned photography and his obvious love for New York. The script is not the strongest, at least seen in a badly dubbed German version. 'Windows' is not a classic, but I'd recommend it if todays films sometimes appear to be a bit too hasty and fast-cut to some of you. I don't really understand the negative fuss, even when it came from a young and perhaps a bit too careful (again seen from today) gay movement, that's been made around it for the last 27 years and that even killed the career of Mr. Willis as a director. He was hassled so much by the reactions on the movie that he said a couple of years ago that 'Windows' would be the biggest mistake in his entire life! As one conclusion I think especially the people at Warner's should take all this into consideration (rewatch and rethink!), give absolution and perhaps a 'sorry' to Mr. Willis (he's not the youngest anymore!!!) and put it out on DVD.","user":"richard-seelbach","rank":[14,15]},{"title":"Genuinely Disturbing","rating":7,"date":"16 September 2013","review":"WINDOWS reminds me of REFLECTIONS IN A GOLDEN EYE. When REFLECTIONS came out in 1967, it had the book thrown at it for being deviant, sick, perverse, reactionary, offensive, pretentious (which is such a mouthful that it makes one believe that the hater(s)doth protest too much). On top of these epithets, was the final body blow, and \"just plain boring.\" It's difficult to be all of the above and be \"just plain boring\" to boot which is the reason I was compelled to check out both movies. I'm glad I did. WINDOWS is not the outright triumph REFLECTIONS IN A GOLDEN EYE is, but it's thoughtful and original about something that shouldn't be dismissed by film lovers out of court. It's not sleazy or exploitative; as a matter of fact, that's a major problem with it. It refuses to further sensationalize its wildly lurid \"givens.\" It's artful enough in its intentions to try to suggest that the tragedy of urban life is not the violence of melodramatic evil, but the glass cubicles people live in that link and separate them in devastatingly emotional ways. Gordon Willis' direction is typical of a first time director. It suffers from being too studied but it's far from daft or moronic; visually, it's as thought through as REAR WINDOW, its obvious predecessor in voyeurism. But there's nothing in REAR WINDOW, as seriously naked and exposed as Elizabeth Ashley's performance. It's interesting that when great actors like Brando (in REFLECTIONS IN A GOLDEN EYE), and Ashley in WINDOWS attempt something that goes beyond the average viewer's opinion of how a homosexual SHOULD be portrayed, there's is an automatic reflex action on the part of said viewer to distance themselves from the performance, to laugh at it or automatically dismiss it as being \"over the top.\" This response is, in fact, more reactionary than the sins that have been dumped in the picture's lap. WINDOWS is not as dumb or insensitive as the knee jerk response it provokes in most people who feign an interest in the dark side until it becomes too real.","user":"jacegaffney","rank":[10,11]},{"title":"Willis gets a chance to take the reins...and drops them","rating":5,"date":"24 January 2010","review":"This is one of those flicks I've wanted to see since it came out (I was underage at the time). The plot just sounded very freaky and bizarre. Regardless, it is one of the THE most impossible films to find since I don't believe it got a video release (except overseas) and I don't even think it played on cable in the '80s. It is however on YouTube now :-).<br><br>This film gets trashed by a lot of people immediately as being non-PC and homophobic. I think that's more a signpost of when the film was released, when attitudes toward people with other orientations weren't so enlightened.<br><br>No, the core problem behind this picture is that it's just a raving, stinking mess, and it really is virtually all Willis' fault. When you read the opening credits, your jaw drops...they read like an A-list of movie greats: Morricone, Bourne, Willis as DP. How could they screw this up? Easy. A) Don't build any suspense; B) Don't establish any characters or motivations; C) Allow the writer to write any damn thing he wants to, no matter how stupid or no matter what expense to the actors; D) Resort to constant dissolves when you don't know what else to do, especially since there is virtually no coherent action; E) Don't direct your actors...after all they're pros, they know exactly what to do. The list goes on....<br><br>This is a stalker movie....it should be about stalking. There is absolutely no fear built, no tension. It's a real master class in wasted celluloid.<br><br>Still, part of me has to admire this in a way you sometimes admire any bad movie. It sure didn't have any self-censoring going on. it did what it wanted to do and took no prisoners. One of the many things that makes it a museum piece today, even if that museum is a wax one.","user":"bob_meg","rank":[12,18]}]