[{"title":"Colonel Bouquet","rating":4,"date":"6 July 2019","review":"I saw this film in the theater when I was nine. All I and my contemporaries cared about was shooting and dying. Years later I wondered why Colonel Bouquet spoke accented English. Some mild research turned up the fact that Colonel wa an historic figure. Bouquet was a Swiss mercenary who commanded troops for the Brits. Who ever expected that level of hitoricity from De Mille. I leave to others to research whether the flag over the british fort was correct.","user":"vernc1","rank":[20,23]},{"title":"Colonial-era corn","rating":4,"date":"31 August 2015","review":"Unconquered (1947) is a miracle of bad filmmaking. This is Cecil B. DeMille overindulging himself for two and a half hours, offering us a healthy heaping of camp, costumes, sexual titillation, and over the top action.<br><br>Where does one even begin? The characters are all idiots who wander from scene to scene, somehow surviving an onslaught of ridiculous events ranging from plunging from a waterfall to surviving an attack courtesy of offensive Native American stereotypes. Poor Paulette Goddard finds herself spending 75 percent of the movie trussed up, leered at, threatened with phallic objects, and in her undergarments, usually several of those things at once. I'm surprised the Code was okay with such sadomasochistic elements in the picture, but maybe they just laughed it off because it was so silly.<br><br>The cast is made up of a talented bunch, but their performances are largely uneven. Gary Cooper, Paulette Goddard, and Boris Karloff seem embarrassed to be there and alternate between being wooden and cartoon-y. Only Howard Da Silva as the lecherous villain comes off with his dignity intact, knowing that when you're in schlock, you have to go gloriously all out with the camp.<br><br>The whole look of the film is studio-bound and garish, so it's not visually appealing either. If you are a connoisseur of kitsch or have a group of like-minded friends, then this turkey is a fun one.","user":"MissSimonetta","rank":[20,28]},{"title":"The Perils of Paulette...","rating":6,"date":"15 February 2006","review":"I must confess I really like Cecil B. DeMille's pseudo historical epics. They are as fascinating to watch as a head on collision between two (2) trains and about as subtle. So lets get this clear if your looking for any sort of historical accuracy, LOOK ELSEWHERE! For hand-wringing political correctness BEGONE! The Colonial Settlers are good, the Indians bad and the British are incompetent, thats it. If you are expecting dialog by way of Hamlet thats not going to be here either. Like Harrison Ford said about George Lucas, \"You can write dialog like that, but we can't say it\".<br><br>The fun of this film is to watch it unfold in all it's glorious Three (3) Strip Technicolor and follow the adventures of Paulette Goddard with Gary Cooper as they move from one (1) set piece to another. For thats what this film is as series of set pieces. Or as what some critics of DeMille felt, he did not make motion pictures but moving paintings, though very entertaining ones.<br><br>\"The Perils of Paulette\" is what the critics referred to this picture upon its original release. I think very few actresses were put upon more then she was in this movie. She was bound (chains, rope or leather), almost whipped, almost burned at the stake, almost drowned going over a waterfall, almost raped, etc. If this had been a pre-code film I am sure we would have seen something like the excesses in 'THE SIGN OF THE CROSS'! It would have been interesting to see what ended up on the cutting room floor that could not make it past the censors. Supposedly during filming she blew up and walked off the set until DeMille could bring things down to an acting (or pain tolerance) level, referring to DeMille as a SADIST! DeMille liked troopers such as Barbara Stanwyck and did not forget this. When Paulette wanted the role of 'Delilah' DeMille told her to take two (2) drop dead pills and effectively ended her career. When the 'UNCONQUERED' was finished CB issued gold medallions to those he felt were real troopers. Boris Karloff got one (1) and the drummer boy (for not flinching when a ball of fire bounces off his drum), not Paulette.<br><br>When you watch a Cecil B. DeMille film the important thing is not to take it seriously and just enjoy the ride. There are alway some neat things that you can pick up. Though he plays fast and loose with history (most directors do to this day; Michael Moore, Oliver Stone) he gets a lot of details right. The firearms, swords, uniforms even the shape of the British star fort are all right on. There is also excellent attention to detail on the day to day life of this period of history. He did build his films from the ground up and if did not convey historical accuracy gave a good imitation. Sort of a 1940's version of virtual reality. It looks great but is not all there.","user":"xerses13","rank":[30,50]}]