[{"title":"Eternal Smile","rating":10,"date":"10 February 2005","review":"\"Smiles of a Summer Night\" is one of the most elegant and charming carnal comedies ever filmed. It is clever, witty, and incredibly sexy. Did I mention that it was written and directed by The Ingmar Bergman whose name would not usually be associated with the comedies? <br><br>\"Smiles of a Summer Night\" was a great success with both the critics and the audiences and was submitted for the Cannes film festivalwithout its creator's knowledge. The film was nominated for the Golden Palm and won the Award for Best Poetic Humor. Bergman describes how he found out about his movie's international recognition, \"I was sitting on the toilet reading a morning newspaper. One of the articles was entitled, The Great Victory for a Swedish Cinema at Cannes. I thought, what a wonderful news, what is the movie? And then I read the title, \"Smiles of a Summer Night\" by Ingmar Bergman.\" He recalls how poor he was then and he borrowed the money for a ticket to Cannes from Bibi Anderson whom he dated at the time. <br><br>I did not laugh a lot but I don't think I was supposed to - \"Smiles... is a different kind of comedy, sensual and subtle, with the characters often weak but not ridiculous. The beauty of it is in the dialogs, ironic looks, the charming struggle of wits, and in the realization that not everyone will be blessed with the true and passionate love but the life goes on, anyway. The actresses (Ulla Jacobsson, Eva Dahlbeck, Harriet Andersson, and Margit Carlqvist) were incredibly sexy, especially Eva Dahlbeck smoking a cigar and Harriett Andersson as a chambermaid talking to her mistress about the virginity  delightful! <br><br>There are no words to describe the beauty, splendor, charm, humor, and sensuality of this film. The best I can do - to paraphrase Woody Allen's line -\"that was the most fun I've ever had without sex.\"","user":"Galina_movie_fan","rank":[44,53]},{"title":"Not your typical Bergman film...","rating":10,"date":"10 June 2001","review":"Charming, light-hearted, delicate, and romantic are not the terms most people think to use when describing Bergman films, and yet \"Smiles of a Summer Night\" is all of these.  This is one of the most sophisticated romantic movies ever filmed, and a pure delight.  It is a clever and witty romance based on the classic elements of French farce.  Simply wonderful.","user":"clavallie","rank":[37,47]},{"title":"Bravo Bergman","rating":10,"date":"17 January 2005","review":"Men, as a gender, do not come off well in Bergman's charming sex comedy Smiles of a Summer Night, made only one year before his breakthrough hit, The Seventh Seal. At the center of the film is Frederik Egerman (Gunnar Bjonstrand) pompous and self-assured as a lawyer but insecure and frightened by competition as a lover. His son, Henrik (Bjorn Bjelvenstam), torn between the church and the bedroom, is filled with self-hatred for even thinking about going to bed with Petra the maid (Harriet Andersson). Another over-the-top male character is Count Malcolm (Jarl Kulle) a poseur whose only response to his wife's infidelity is to challenge the paramour to a duel or a game of Russian Roulette.<br><br>In Bergman's world, men are childish, selfish, and arrogant. The women on the other hand are stronger, more self-reflective, capable of pandering to the male ego and to direct their affections elsewhere when the need arises. They suffer greatly, however. Charlotte Malcolm(Margit Carlqvist), the Count's wife admits that she hates men and finds them repulsive with their \"hairy\" bodies but nonetheless is hopelessly in love with her philandering husband. She says that in any event \"a woman's view is seldom based on aesthetics. And one can always turn out the light.\" Set at the turn of the century, Frederik is married to the very beautiful 19-year old Anne (Ulla Jacobson) but their marriage has never been consummated even after the passage of two years. Though it remains unclear as to why this is the case, nonetheless, Frederik is not at a loss for romance, taking up with a famous actress the equally lovely Desiree Armfeldt (Eva Dahlbeck), a relationship that began soon after Frederik's first wife died but never revealed to Anne. He confides in her in a way that he cannot with his young wife and she is a comfort to him though their relationship is full of bitter verbal thrusts and parries. Desiree on the other hand has a string of lovers and it is not hard to understand why, given her fame, beauty, and rapier wit. One of them is the aforementioned Count Malcolm, a ludicrous character with his military getup and macho posturing.<br><br>The Count is also not averse to playing around and it turns out that he is also married to the stately and elegant Charlotte. He says that he can accept someone making overtures to his wife but if anyone goes after his mistress, he becomes a \"tiger\". Later he says the exact opposite when his wife and Frederik have a go round. Oh yes, Henrik secretly desires Anne, and Petra, well she's open to any offers. The situation could have deteriorated into farce but in Bergman's assured hand, everything is resolved in a civilized and even graceful way at a gathering of all eight combatants at Anne's mother's country retreat. Here they all drink a mystery wine and sort out their relationships in a remarkably satisfying manner.<br><br>Smiles of a Summer Night came as quite a surprise to me, being used to the philosophical Bergman of Wild Strawberries and The Seventh Seal (yet always with an added bit of humor). I found it thoroughly enjoyable, an opinion apparently shared with Woody Allen whose film A Midsummer Night's Sex Comedy mirrored it and Stephen Sondheim who based his musical \"A Little Night Music\" on the film. I can't remember when there was such a collection of beautiful women in one film. Not only do they look wonderful but act impeccably and say wise and witty things. Bravo Bergman!","user":"howard.schumann","rank":[35,46]}]