[{"title":"In A Word: Tough","rating":7,"date":"23 December 2005","review":"Written, directed and produced by Sam Fuller, this is a tough, straight-talking, no nonsense film noir. This is like a 1940s noir but it's 1961 instead. So, instead of the boxy cars, of the Forties you have long- finned late 1950s automobiles. Otherwise, it''s the same genre.<br><br>You get the same film noir photography: black-and-white with lots of nighttime shots and a lot of tough characters. I just wish they had at least really likable person to root for, but I didn't find any. The \"hero,\" played well by Cliff Robertson, is a tough, revenge-obsessed guy and that's basically the storyline as he tracks down the hoods who beat up and killed his father.<br><br>Even though the rest of the cast doesn't have big names, many of the faces are familiar and all are good actors. This is an earlier \"Point Blank\" film seven years before that came out - same kind of story.<br><br>Of the women in here, I found Dolores Dorn the most interesting.","user":"ccthemovieman-1","rank":[30,32]},{"title":"Raw and Ruthless Samuel Fuller Masterpiece","rating":3,"date":"3 August 2002","review":"From its brisk opening, this dark and seamy underworld drama moves like a well-oiled machine, laying out and glorifying Cliff Robertson's revenge tactics to punish the men who killed his father.<br><br>Not unlike John Boorman's \"Point Blank\" which also featured an almost cyborg-natured Lee Marvin punishing the bigshot criminal overlords who did him wrong, here the pursuit is more humanized but suffers no slack as Robertson gives an extraordinary performance.<br><br>With a glinty-eyed, crooked smile and a gleeful look which seems to creep into his face as he torments his victims, Robertson suggests a little of Mel Gibson's instability in the first \"Lethal Weapon\", but without the looniness. His more understated moments are not only very realistic, but are the epitome of cool. Robertson can definitely smoke cigarettes better than anybody.<br><br>Fuller's direction is taut, featuring plenty of creative cinematography and a lot of sequences which are far more ahead of their time than the majority of crime films being made around 1961. As always, Fuller manages to tell his story with both hysteria and pathos. This is definitely a must-see for fans of Don Siegel's work or the crime films of Phil Karlson and Anthony Mann. \"Underworld USA\" could very well share a double bill with John Flynn's \"The Outfit\" as well. Superb stuff.","user":"HughBennie-777","rank":[32,35]},{"title":"Action and intensity make up for some second rate aspects...","rating":7,"date":"4 August 2010","review":"Underworld U.S.A. (1961)<br><br>Sam Fuller's movies have an edgy, reckless quality to them, as if lacking propriety. Which is good. What Underworld U.S.A. lacks in subtlety it makes up for in surprise and a kind of sultry sizzle, something very different than more usual \"romance\" that other crime and noir movies have. There is some second rate acting throughout, but if you accept some of this as \"style\" and go with the flow, it's click along nicely. In fact, the lack of star power makes the film a hair more everyday, and therefor a hair more realistic in a good way. And the lead male going solo through much of it is first rate, Cliff Robertson.<br><br>Not that this is actually believable--it feels contrived all the way--but it has a modern interpersonal selfishness and sometimes cruelty that is fun to watch. The plot? Great enough. But the searing looks, the slaps, the brooding closeups. This is movie-making! Certainly an influence on Tarantino.<br><br>As a black and white crime film with a slightly low budget feel, this naturally comes labelled as a film noir. And there are some similarities. But it's also a crime drama, more directly, and it explores (and exploits) the violence of cops and robbers circa 1960. There a lot of unsavory types involved, and some crisp filming. If you like other Sam Fuller films, you'll like this one.","user":"secondtake","rank":[9,9]}]