[{"title":"Classic Drive-In Movie!","rating":10,"date":"22 January 2003","review":"In a conventional sense, there really is no redeeming value in the film Raw Force.  However, if you are willing to let go of your need for logic for ninety minutes, you will find Raw Force to be fun.<br><br>The story, such as it is, deals with the sale of nublile woman to monks on a small island.  The monks believe that consuming the flesh of the woman will allow them to have the power to raise the dead.  You can tell the monks are evil because they are always shown in slow motion!<br><br>Throw in a guy that looks like Hitler in a leisure suit and the beautiful Jewell Shepard and some American Bruce Lee wannabees and you have the ingredients for the perfect drive-in movie.<br><br>Oh, did I mention that Cameron Mitchell was in this.  Some may say that his appearance in The Toolbox Murders was his low point (others might say The Demon).  I think this is it.","user":"wdgreen","rank":[13,13]},{"title":"Babes, blades, zombies & Cameron. Freaking. MITCHELL.","rating":7,"date":"26 February 2008","review":"I was going to give this one 9 out of 10 but had to knock it down because it quite simply wasted Jillian Kesner (RIP; you kicked my ass). <br><br>A nutty German who is apparently Hitler's younger brother, Chip, trades Philippine hookers for Jade to some weird monks (\"Zey eat zem,\" Chip tells us) and uses a group of head-band-wearing Kung-fu thugs to protect the operation. If that sentence right there doesn't make you want to watch this film...<br><br>Zee chade mine must be kept a zeecret...sorry. Chip doesn't want anyone to know about the jade mine and when he finds out a low rent cruise ship is planning on making a tour of \"Warrior Island\" (dun dun duuun) he tells his thugs to take care of it. They fail of course, due to the First Commandment of Kung-fu: The good guy will always kick butt no matter how many bad guys attack him at once.<br><br>The thugs do manage to set the ship on fire and kill everyone on board except the plucky group of heroes. Their life raft beaches on the island and more Kung-fu ensues. The monks capture the group and tell them they may not leave until they have fought the monk's Kung-fu masters which is the queue for the Kung-fu ZOMBIES (!) to enter (I freaking love this film!).<br><br>The fight scenes were great, the over-acting was wonderful and the concept was so far out that it clicked like Fred Astaire in tap shoes. I can't end the review without a special shout out to Mitchell who was the ONLY man who could play the part of the captain. I laughed out loud every time he fired his pistol, especially when he tried to get the attention of a potential rescue plane by firing his pistol AT it! This film had it all and I can't do it justice here. Just see this film!<br><br>Things you didn't know: The South China Sea is loaded with piranha Asian chefs are ALWAYS Kung-fu masters Buddhist monks aren't always the peaceful guys they are rumored to be","user":"doc_hartman","rank":[10,10]},{"title":"A wild tale of martial artists vs cannibals, zombies and Nazis.Unfortunately the uneven tone and dull action wound an near exploitation classic","rating":7,"date":"20 May 2006","review":"This movie has everything a good exploitation movie should have: Zombies, cannibals, Nazis, naked chicks, blood, action, comedy, piranhas ...unfortunately this movie doesn't quite work as well as it should.<br><br>This is the story of a cruise ship that promises some people a trip to exotic locales one of which is Warrior Island where disgraced martial artists go to die. Also on the Island are a band of cannibalistic monks. Through a chain of events too complicated to explain the Nazi pilot who is trading kidnapped women to the monks for jade sinks the cruise ship so it can't go to the island and ruin his deal. The survivors end up on the island anyway and the monks let loose the zombified remains of all of the dead martial artists on the survivors.<br><br>At this point you're either intrigued or repelled by the nonsense you just read. If you're repelled move on to the next movie, if you're intrigued keep reading.<br><br>Lets be honest this isn't a good movie by any conventional standards. Its got bad acting, bad special effects and a dumb plot. But then again its got the spirit to go for it anyway and it almost manages to be one of the all time classics.<br><br>Unfortunately the film falls down in two key areas. First it doesn't know whether its serious or tongue in cheek. There are times when the cast seems to be playing it straight and times when they seem not. The unevenness of tone makes it hard to know how to take the movie so it ends up rubbing you the wrong way. The other problem is that the action sequences are filmed basically in a point and shoot style. There is no excitement generated from what we are seeing on screen because the camera man seems bored by it all. Its awful because this is often a really fun movie at times.<br><br>If you are an exploitation movie fan, or a fan of movies that are just out on another planet I'd give this movie a shot, because even with all of the bad in it there is just an incredible collection of wild and way out things going on that you're very likely to find something to love.<br><br>On the exploitation scale of 1 to 10- 6.5 rounded up to 7.","user":"dbborroughs","rank":[12,13]}]