[{"title":"Conrad's treatise on fear, heroism, cowardice and death","rating":8,"date":"10 March 2006","review":"I have seen the film three times over the past thirty years and each time I loved it. The subject of the film must have attracted director Richard Brooks who was essentially a screenplay writer who later became a director. He knew the merits of a strong script with philosophical lines from Conrad. Coppola was to use the related original material (Conrad's) in his \"Apocalypse Now\" for the Brando scenes several decades after this film was made and mostly forgotten.<br><br>What Brooks does not realize is that lines like \"it only takes a split second to make a coward a hero or turn a hero into a coward\" and \"every sinner wants a second chance at redemption, without realizing he is damned for ever\" are philosophical lines that one expects to hear from very literate individuals. Here, in \"Lord Jim,\" the lines are often spoken by the dregs of society. Jim, of course, we are told by the narrator (Jack Hawkins' Marlowe) was philosophical, dreamed of heroism, and was a gentleman.<br><br>The film is made up of three distinct segments: 1. the \"sinking\" of SS Patna 2. The liberation of Patusan (\"Patna\" + \"us\" make up the name Patusan, remarks Jim to his love) and 3. The battle with a group of scoundrels (led by James Mason's 'Gentleman' Brown) with some fine speeches on honor, death, and fear.<br><br>Each segment could stand alone but together the film adds considerable worthiness that exceeds the action and plot, the elements that most viewers use to judge a movie. The lesser characters in the film add color and counterpoints to the script. Christian Marquand's French Captain who defends Jim's \"cowardice\" with the words \"fear can make us do strange things\" or Paul Lukas' Stern who compares his dead butterfly collection with the \"wonderful, perfect human beings that God created\" or the native who wonders why some pray to one god instead of a host of Gods are a few examples of dialogs that force you to reflect on what you heard.<br><br>The film's subject covers several religions. The fervent Muslims on the way to Haj survive the storm. The Christian Jim prays to his God. The Buddhists pray to Buddha. And the natives pray to their array of gods (a touch of Hinduism?). Yet, the film is not a religious film. But faith in God is underlined at every stage.<br><br>Conrad was Polish and a seaman before he became a writer. Brooks is an American. O'Toole leads a cast that is predominantly British. Daliah Lavi is Israeli, Marquand is French, Jurgens is German...The film is truly international.<br><br>Brooks not only wrote and directed the film but this was the first film that he produced. The film proved to be ideal for O'Toole reprising his roles of \"Lawrence of Arabia\" and \"Becket\", roles that draw thin lines between cowardice and heroism and consequent attempts to redeem oneself. The film is not great cinema--but will remain for me cinema based on related major literary works (\"Lord Jim\" and \"Heart of Darkness\", both narrated by the fictional Marlow) adapted for the screen with some delightful performances from O'Toole, Mason, Wallach, and Marquand and commendable photography by Freddie Young.","user":"JuguAbraham","rank":[55,62]},{"title":"J.Conrad superb novel portrayed in a dark and poethic cinema language","rating":10,"date":"25 January 2004","review":"The double edge of humanity: fear and courage. In his darkest hour, Lord Jim finds a redeeming path of self-sacrifice facing his past and the burden of a dramatic split-second decision. A coward´s decision aboard the Patna? Heroes before the action, dreaming of epic challenges often \"freeze\" in the face of danger. The survival instinct is in clear contradiction to the strong desire of young Jim to do good. Peter o´Toole reveals a dramatical and deep performance, outstandingly faithful to Conrad´s masterpiece. James Mason is superb giving life to an ignominious as well as charming dark face of evil. The vivid colour of the jungle and the thick river myst create the perfect atmosphere for this dark novel(with a major future influence in Coppola´s \"Apocalypse now\"). In this film you can see portrayed the all time dilema of our lives. Everyone in his or her lifetime will sometimes have to make a decisive split-second decision, that will change irreversibly his life and that of others. If it is the wrong decision, will we ever have a chance of redemption?","user":"jfsequeira","rank":[41,49]},{"title":"Superb Acting; Don't Miss This Classic Drama","rating":24,"date":"24 October 2001","review":"\"Lord Jim\" is a film that offers viewers satisfaction on many levels. Although it is set in an exotic locale and has a considerable amount of action, the real story of this movie is its exploration of the human condition.   Love, honor, courage, commitment and redemption all come into play as the story moves from the sea to the jungle.  It reminds us how a split-second decision can alter dramatically the course of our lives.<br><br>\"Lord Jim\" is a well-paced, engaging film.  Peter O'Toole's thought-provoking and moving performance will stick in your mind long after you see this movie.   I haven't read the book so I can't speak to the movie's faithfulness to the original text, but it does stand on its own legs as a thoroughly entertaining film. If you like movies such as \"Lawrence of Arabia\" or \"The Sand Pebbles\", you will definitely enjoy \"Lord Jim.\" I highly recommend it.<br><br>Hopefully, it will become available on DVD soon.","user":"illini86","rank":[41,50]}]