[{"title":"Simply Beautiful","rating":10,"date":"11 December 2015","review":"I don't know why this movie always hooks me the way it does; it's obviously a masterpiece and a revered piece of British/American cinema - but that alone is not the reason (there are other such masterpieces which fail to have that effect on me). Maybe it's the setting: the beautiful city of Vienna right after World War II, the scars of the most devastating conflict in human history still visible at every corner. Or it's the contrast between the eerily happy music tune - which plays throughout the entire film - and the dark, tragic story of murder and betrayal which I find so strangely captivating. Whatever it is, I just love this movie.<br><br>'The Third Man' now has more than 60 years on its back, but its age hardly shows. Despite the story's dark themes, the general mood of the narrative is rather light, sometimes darkly funny, and the slightly cynical tone and morally ambiguous characters give the movie a very modern feel. What also stands out and makes the film memorable - in addition to the fantastic soundtrack - is the outstanding, Accademy Award winning cinematography. Black and white has rarely looked better. The way DOP Robert Krasker plays with unusual angles and virtually \"paints\" this city of Vienna with light and shadow, he adds an almost expressionistic quality to the film. I always felt that the city plays an essential part in the story, - a key character if you will - with its damaged buildings reflecting the damaged human characters. The recent war is a looming presence throughout the film, and to me this is as much a story about the desensitizing effect of war on people as it is a murder mystery. And there is yet another quality to the film which needs to be mentioned: it's very entertaining. 'The Third Man' has fantastic pacing and there is simply not a dull moment in it. <br><br>To sum up my overall impressions, this is one of those rare occasions where everything just falls right into place and helps create a unique film experience: Carol Reed's masterful direction and the wonderful performances by the fantastic actors (Joseph Cotten, Trevor Howard, Alida Valli and Orson Welles); the beautiful soundtrack by Anton Karas; the gorgeous cinematography by Robert Krasker, and, perhaps most importantly, the story and screenplay by Graham Greene with its unexpected twists and turns (although the unusual, iconic ending wasn't Greene's idea). A true work of art and highly enjoyable entertainment: 10 stars out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/","user":"gogoschka-1","rank":[74,88]},{"title":"A movie ahead of its time","rating":10,"date":"26 June 1999","review":"The Third Man is a movie that looks and feels not like a movie of the 40s, but like a neo-noir of the late 60s/early 70s. This wonderful example of classic noir is one of the all time greatest films. It combines amazing visuals, sounds, dialogue, and acting to tell a thrilling story and comment about the atmosphere after WWII.<br><br>Of all the movies durring the studio era (pre-1960ish), there are three movies with cinematography that always stick out in my mind: Gregg Toland's work in Citizen Kane, Russel Mety's work in Touch of Evil, and Robert Krasker's work in The Third Man (all starring Orson Welles funny enough). I just recently saw a restored 35mm version of The Third Man. The crisp black and white visuals of a bombed out Vienna are so breath-taking. Shadows are everywhere. The unique way Krasker tilts the camera in some shots adding to the disorientation of the plot. And who can forget the first close-up of Welles with the light from an apartment room above splashing onto his face; one of the great entrances in movie history (Lime gives his old friend a smile that only Welles could give).<br><br>The cinematography is backed by strong performances by Welles, Cotten, and italian actress Vali. The writing of Greene is wonderful; you can see the plot twisting around Cotten tightly. But what makes The Third Man so great is its historical commentary (well not really historical since it was commenting on its own time, but to us it is historical). On one level The Third Man is a story of betrayal and corruption in a post-war, occupied Vienna. On the other hand, its giving the audience a glimpse of the mood of Europe after the great war. The uncertainty that the Cold War was bringing is evident through out the film; Cotten is constantly trying to figure out who to trust. Vienna is on the frontier of the new communist bloc (we even see the communists infiltrating Vienna trying to bring Vali back to her native Czechoslavakia). The zither music score combined with the stark images of bombed out Vienna are reminiscent of the frontier towns of American Westerns. So The Third Man is not only a wonderful film noir, but a unique look at the brief time between WWII and the height of the Cold War.","user":"mmt02","rank":[306,404]},{"title":"Confused ethics in a devastated world","rating":10,"date":"31 March 2016","review":"\"The Third Man\" is generally considered as the best British film ever (e.g. British Film Institute 1999 poll, Sight &amp; Sound polls). It is a landmark in worldwide cinema notably for its unique mix of genres: historical, thriller, comedy, tragedy. And it is a brilliant reflection about ethics.<br><br>The movie is not adapted from a pre-existing book: when Graham Greene was tasked to write the screenplay, he wrote a novel to have a fully consistent plot that he immediately adapted for the screen. As Greene modestly admitted in the preface he wrote afterwards: \"The film in fact, is better than the story because it is in this case the finished state of the story.\" The book and the movie plots are very similar, although there are a few significant variances: for instance, the novel is narrated by the Major and ends differently (on the latter, more below).<br><br>*** WARNING: CONTAINS SPOILERS ***<br><br>The movie starts as a historical account of post-war Vienna. The opening speech portrays chaos in Europe. The plot revolves around black market, some relatively harmless (clothes, watches, IDs, etc.), some deadly: penicillin, which is historically accurate. Life is random like a roll of dice... which Anna symbolically plays in Harry's apartment. Throughout the film, we see different parts of Vienna, once a splendour of culture and history, partly destroyed as many major cities were. Depiction is realistic, we are lost like Holly is: many dialogues are in German without subtitles. Some scenes are tragic, notably the one in the children's hospital.<br><br>Rapidly, the movie evolves into a thriller. Was Harry victim of an accident or a murder? Who was the third man? This mystery remains unsolved, although it could be Harry himself. Then the porter is also murdered and Holly closely escapes assassination. There are three chases (Holly and Anna, Holly, Harry).<br><br>The comical elements are continuously present, except at the end. Holly is a small-time writer of cheap novels, getting drunk, attracting trouble and failing with women. The excellent score adds a sarcastic tone to the whole story (although it is sometimes too present and partly spoils scenes that would have been better off silent; also this reduces the impact of music when needed).<br><br>The combination of these styles is easy but efficient. One example: when the military are tracking Harry... a balloon-seller barges in! Another: Holly is brutally driven by a taxi to an unknown destination and thinks he will be killed (thriller). But he is actually dropped at a conference... that is a disaster (comedy). However two killers show up so he has to run (thriller)... and gets bitten by a parrot (comedy).<br><br>Above all these elements, the motif of good versus evil is dominant. We see a shattered world that has lost its moral compass. Some cynically take advantage, some stick to their values: Harry and Holly, once friends, are antagonists.<br><br>But is it so simple? Holly is on the good side, yet because of his blunders the porter and the Sergeant get killed. The \"righteous\" Major blackmails Anna: information or deportation by the Soviets. Anna loves the criminal Harry regardless. She says: \"He is part of me.\" In this chaotic environment, references are blurred: the porter points up to designate hell and down for paradise; Anna tells the Major \"You have everything upside down\"; she sometimes calls Holly \"Harry\"; a key scene occurs in the Ferris wheel where the world turns around; the sewer with its foul smell ends up in the romantic blue Danube, as the Sergeant highlights.<br><br>Additionally, the main villain is seducing. At first mysterious (he only progressively appears after an hour), he turns out to be extremely intelligent. His speech in the wheel is at the same time ignominious and rhetorically impressive. It is not easy to answer the question: why do we stay virtuous? Revealingly, the \"honest\" Holly remains silent at that moment. Orson Welles' performance is so outstanding, we think he appears on screen longer than an actual cumulated five minutes. On top of being a great director, he was a great actor.<br><br>Visually, the historical and moral instability is expressed by frequent darkness, shadows and inclined shots, where we constantly feel buildings and characters are going to fall (even though these shots are somewhat too systematic). Material distress breeds ethical crisis.<br><br>Eventually, the movie rightfully ends in the sewer. Aesthetically stunning, this sequence is symbolic in different ways. The underground is where criminals escape the law by crossing borders: it represents the evil, underlying part of this confused society. When everybody but Anna goes down there, they want to extirpate evil from its roots. Also, when Harry is looking for a way out, voices emerge from dark tunnels that look like funerary steles: it is as if he guiltily heard the people he murdered talking to him. Last, the sewer feels anthropomorphic: complex, dark, liquid, noisy, with different levels and small tubes. Hence figuratively characters dive inside their subconscious to be confronted to their evil part: Holly faces Harry for the last time. Their gazes are similarly intense. Harry nods to Holly, a sign of agreement and/or understanding.<br><br>This famous climatic sequence is followed by one of the greatest closing shots in cinema history. After the funeral, Holly waits for Anna. The image is deep, in the axis of the road. Leaves are falling. Music plays softly. Anna is a small figure that progressively grows bigger. Slowly, she just walks past Holly without a look and moves out of the frame. He is left alone. (It constitutes an important difference with the novel, which ends happily: Holly and Anna walk together holding arms. But Carol Reed thankfully imposed his ending.)<br><br>It is a dazzling shot, slow and melancholic, crowning an uneven yet compelling movie. Anna despises Holly for his law-abiding betrayal. It is one of the dramas about life: we sometimes prefer charismatic rascals to honest fools, and love is blind.","user":"Teyss","rank":[28,36]}]