[{"title":"Like the film? Read the book.","rating":9,"date":"20 November 2017","review":"I've seen the film many times, have always enjoyed it. But I've been reading the book for the first time. It's a very long novel, and you have to stay with it if you want to see the ending. It's a good read, but Margaret Mitchell, former newspaper reporter, is very thorough in her description of both Southern culture and the changes that the Civil War brought to it. It's the size of the book that was the biggest challenge for David O Selznick. Not what parts to film, but which parts to leave out. So many characters that appeared in the book couldn't be introduced in the movie without extending the film's length to well over four hours. So he had Sidney Howard write the screenplay, then cut that down to a filmable length by hiring several more writers to further pare the script, and was still rewriting it himself while it was being filmed. Selznick was close to running out of money, so he asked his angel, millionaire Jock Whitney, to loan him enough to finish the film. The film was finally completed and edited, then was test-marketed at a theatre not far from LA. The viewers were excited about having seen it and said so on their preview cards, which allowed Selznick to rest easy, knowing he had a hit on his hands.","user":"paskuniag-584-890551","rank":[27,28]},{"title":"Scarlett's So High Spirited And Vivacious","rating":10,"date":"21 October 2006","review":"Before I ever saw Gone With the Wind, I was well acquainted with Max Steiner's theme. It opened WOR TV's Million Dollar Movie before every broadcast in New York in the Fifties and Sixties. When my parents took me to see Gone With the Wind in one of MGM's re-releases as the film music started in my youthful eagerness to show off my knowledge I remarked to all who could hear that that was stolen from Million Dollar Movie.<br><br>Million Dollar Movie is gone now, but Gone With the Wind, book and film, remain eternal. In these days Margaret Mitchell's southern point of view book might have trouble finding a publisher, let alone selling film rights to the story. But it is a tribute to her and the characters she created that they remain alive in everyone's mind who reads the novel or sees the film. And that's just about the same because I can't think of another film that remained so faithful to the text.<br><br>It is said that Margaret Mitchell wrote the book with Clark Gable in mind as Rhett Butler. As the sober and ever realistic, but charming Rhett, Gable for most of the film is playing a character not to dissimilar from what he usually played on screen. However in the last half hour of the film when he's hit with unbelievable tragedy and he edges to the point of madness, Gable reached dimensions he never did before or subsequently. <br><br>If Mitchell knew who she wanted as Rhett, nobody knew who would be Scarlett. The search for Scarlett O'Hara is one of those Hollywood legends as every actress with the possible exception of Edna May Oliver read for the part. Gone With the Wind started filming without a Scarlett as the famous burning of Atlanta sequence was done first. While it was being down, David O. Selznick settled on a fairly unknown British actress, at least in the USA, Vivien Leigh.<br><br>It was a stroke of casting genius. Vivien Leigh's screen output is pretty small, she was primarily a stage actress. Gone With the Wind is more her film than Rhett Butler's. The story is her story, how she evolved from a flighty young southern belle to a hardbitten woman who is determined to survive in the style of living she's become accustomed to from the pre-Civil War era. In the process she helps all those around her economically, but loses all their previous affection. <br><br>I've always felt the key scene in the film is after Leslie Howard tells Leigh, he'll be marrying Olivia DeHavilland and Leigh makes a fool of herself with him, she finds out that Clark Gable has overheard the whole thing. He's fascinated by her, but because of that he's on to all her ploys.<br><br>Leslie Howard usually comes in for the smallest amount of analysis among the four leads. His Ashley Wilkes is not all that different from Alan Squire in The Petrified Forest. Imagine Squire as a wealthy plantation owner and you've Ashley. He's stronger than he realizes though, he's the one that reluctantly enlists in the Confederate Army while the cynical Rhett Butler makes some big bucks as a blockade runner.<br><br>I've always felt however that the most difficult acting job in Gone With the Wind was the role of Melanie Hamilton. Olivia DeHavilland after initially considering trying out for Scarlett, decided to go after Melanie. <br><br>It's a deceptive part, superficially it's a lot like the crinoline heroines DeHavilland was doing at Warner Brothers. Melanie is the counterpoint to Scarlett, an incredibly kind and decent soul who can't see bad in anyone. One of her best scenes is with Ona Munson who is Belle Watling, the most prominent madam in Atlanta. The other women of society snub her, but DeHavilland accepts her help for the Confederate cause. It's not about politics or slavery for Melanie, her husband is at war and his cause is her's.<br><br>And DeHavilland's death scene would move the Medusa to tears. It's a great tribute to the playing skill of Olivia DeHavilland in that Melanie NEVER becomes a maudlin character. She got her first Oscar nomination for Melanie in the Supporting Actress category, but lost it to fellow cast member Hattie McDaniel as Scarlett's mammy.<br><br>Hattie's a shrewd judge of character, she's a slave, but she's also a family confidante of the O'Haras. As Gable says, she's one of the few people he knows whose respect he wants.<br><br>Of course Gone With the Wind is from the southern point of view. Growing up in Atlanta, Margaret Mitchell heard reminisces from many Confederate veterans and the stories they told found their way into Gone With the Wind. It's about what the white civilian population endured during the war and Reconstruction.<br><br>David O. Selznick got a bit of irony in there though. Please note during the burning of Atlanta the slaves who are being marched out to dig trenches are singing 'Let My People Go.' And that's just what the Union Army was coming to Atlanta to do.<br><br>Gone With the Wind copped so many Oscars for 1939 that Bob Hope quipped at the Academy Awards ceremony that it was a benefit for David O. Selznick. Of course it was the Best Picture of 1939 and Vivien Leigh won the first of her two Best Actress Awards.<br><br>Metro-Goldwyn-Mayer kept itself in the black for years by simply re-releasing Gone With the Wind. Unlike any other classic film, it won new generations of fans with theatrical re-release. Somewhere on this planet there are people seeing this 67 year old classic and it is winning new fans as I write this.<br><br>And I think Gone With the Wind, the telling of the interwoven lives of Rhett, Scarlett, Ashley, and Melanie and the world they knew, will be something viewed and read hundreds of years from now.","user":"bkoganbing","rank":[103,124]},{"title":"Georgia on my mind","rating":10,"date":"22 February 2005","review":"This film shows the best of the American cinema. Whether we like the film, or not, one has to recognize the greatest achievement, perhaps, of the creative talent of the people working in the movie industry. \"Gone with the Wind\" represents a monumental leap, as well as a departure, for the movies, as they were done prior to this film.<br><br>The vision of David O. Selznick, the power behind bringing Margaret Mitchell's massive account about the South, before and after the Civil War, pays handsomely with the film that Victor Fleming directed. This movie will live forever because it reminds us of how this great nation came into being, despite the different opinions from the two stubborn factions in the war.<br><br>\"Gone with the Wind\" brought together the best people in Hollywood. The end result is the stunning film that for about four hours keep us interested in the story unfolding in the screen. Of course, credit must be due to the director, Victor Fleming, and his vision, as well as the adaptation by Sydney Howard, who gave the right tone to the film. The gorgeous cinematography created by Ernest Haller gives us a vision of the gentle South before the war, and the Phoenix raising from the ashes of a burned Atlanta. The music of Max Steiner puts the right touch behind all that is seen in the movie.<br><br>One can't conceive another Scarlett O'Hara played by no one, but Vivien Leigh. Her beauty, her sense of timing, her intelligent approach to this role, makes this a hallmark performance. Ms. Leigh was at the best moment of her distinguished career and it shows. Scarlett goes from riches to rags, back to riches again and in the process finds an inner strength she didn't know she possessed. Her impossible love for Ashley will consume her and will keep her away from returning the love to the man that really loves her, Rhett.<br><br>The same thing applies to the Rhett Butler of Clark Gable. No one else comes to mind for playing him with the passion he projects throughout the movie. This is a man's man. Captain Butler was torn between his loyalty to the cause of the South and his sense of decency. His love for Scarlett, the woman he knows is in love with a dream, speaks eloquently for itself.<br><br>The other two principals, Olivia de Havilland and Leslie Howard, give performances that are amazing to watch. Ms. de Havilland's Melanie Hamilton is perfect. Melanie is loyal to the woman that does everything to undermine her marriage to Ashley. Mr. Howard's Ashley gives a perfect balance to the man in love with his wife, while Scarlett keeps tempting him.<br><br>The rest of the cast is too numerous to make justice to all the actors one sees on the screen, but omitting the contribution of Hattie McDaniel to the film would be sinful. Ms. McDaniel was such a natural actress that she is excellent no matter in what movie she is playing. This huge talent is a joy to watch.<br><br>Comments to this forum express their objections to the way the race relations play in the movie, but being realistic, this movie speaks about the not too distant past where all kinds of atrocities, such as the slavery, were the norm of the land. While those things are repugnant to acknowledge, in the film, they are kept at a minimum. After all, this film is based on a book by one of the daughters of that South, Margaret Mitchell, who is presenting the story as she saw it in her mind, no doubt told to her from relatives that lived in that period of a horrible page in the American history.<br><br>Enjoy this monumental classic in all its splendor.","user":"jotix100","rank":[252,316]}]