[{"title":"The Mummy's Hand (1940) ***","rating":7,"date":"16 February 2005","review":"Not a sequel to Boris Karloff's THE MUMMY (1932), but the start of an entirely different series of unrelated films featuring a new mummified prince called Kharis. A group of amateur but likable treasure seekers search for the tomb of an ancient princess, but they encounter the still-living mummy instead, bent on destroying anyone who would dare defile the ancient Egyptian gods. <br><br>While not a great Universal horror movie by any means (one critique would be the re-usage of the same exact shot again and again of Kharis shambling about in the wilderness) this was the first and best of four Universal films featuring the mummy Kharis. At this stage of the game the formula was still fresh and not at all clichéd or monotonous, so that already places HAND at a distinct advantage over its other sequels and spin-off's. Tom Tyler makes one very creepy mummy, all arthritic and twisted, with weird eyes that are optically blackened out for full effect in chilling closeups (albeit the same repeated closeup). George Zucco takes top honors as the deliciously mad High Priest who keeps the mummy alive and killing via the sacred brew of nine ancient tana leaves. Dick Foran, Wallace Ford, Cecil Kellaway and the perky Peggy Moran are all very pleasant as the awkward explorers who stumble upon Kharis' cursed tomb. Comic relief is well used throughout, but never becomes intrusive, as the action always remains dead serious whenever the mummy takes center stage.<br><br>*** out of ****","user":"JoeKarlosi","rank":[38,42]},{"title":"Universal Tea Time - Just Don't Use 9 Leaves!","rating":29,"date":"29 June 2003","review":"Easily the best of the four \"Kharis\" films made by Universal as follow-up to their 1932 original The Mummy.  The film differs dramatically in scope and mood from the original.  Whereas the original was darkly romantic, mystical, creepy, this first sequel goes more for humour than suspense and romance. Dick Foran and Wallace Ford are two archaeologists out of work in Egypt who come across some pottery that leads them to the final resting place of the Princess Ananka.  Just made High Priest of Karnak, George Zucco has pledged his life to defend the secret of her resting place. What ensues is a good, interesting, sometime humourous tale of Zucco trying to thwart Foran, Ford, and their backers, Cecil Kellaway and Peggy Moran.  Obviously not backed with a huge budget, this mummy film is fun.  Foran is very good as the male lead.  Ford is bearable at best, but Kellaway is as always a charming, affable presence on the screen.  Moran is beautiful and effective in her role.  But it is George Zucco's film, as he utters the great lines that have come to be associated with the \"legend\" of Kharis.  Zucco has great screen persona and this is really one of his great roles.  Tom Tyler, a western star, plays the bandaged one with reasonable aplomb(okay, effectiveness if you prefer).  Although nothing in stature to Karloff's interpretation of the Mummy, Karl Freund's methodic direction, and the dark atmosphere of the original The Mummy, The Mummy's Hand is enjoyable and has given us the story of Kharis.","user":"BaronBl00d","rank":[27,30]},{"title":"More fun than frightening","rating":27,"date":"27 May 2005","review":"This movie wisely decides to proceed on a different track entirely than the masterful Karloff \"The Mummy\". Very few horror films could match the earlier entry for sheer atmosphere and dreamy menace.<br><br>Instead, \"The Mummy's Hand\" opts more for adventure, with a generous helping of laughs thrown in. We follow the trail of two American treasure hunters as they seek the lost tomb of Ananka. Little do they know that the tomb is protected not only by a fanatical cult, but also the living mummy Kharis, who has become the guardian of the woman he once loved. Dick Foran is extremely likable as Steve Banning and seems like a regular guy. As wise-cracking sidekick Babe, Wallace Ford sometimes annoys but not to the point where you actually want to see him get killed. Peggy Moran is fiery and most attractive as Marta. Naturally she winds up butting heads with Steve and naturally they are attracted to each other.<br><br>Two grand old actors really liven things up. Cecil Kellaway is delightful as the scatterbrained magician the Great Solvani who bankrolls the expedition. And George Zucco has a signature role as Andoheb, sinister high priest of the cult of Karnak who controls Kharis. Much time is devoted to the workings of the Karnak cult and the mechanisms that animate Kharis. The lore of the tanna leaves starts here. Nine are needed to fully animate Kharis, but if he ever drinks the brew of 10 tanna leaves, \"he will become a monster the likes of which the world has never seen\". Sadly, we never really see what Kharis would be like with an overdose of tanna leaves.<br><br>Cowboy star Tom Tyler makes for a creepy mummy in his few scenes. Totally lacking the charismatic presence of Karloff, he instead opts for the familiar crawling lurch that would later become a parody. His blacked out eyes are particularly unnerving.<br><br>A little bit too much comedy and not quite enough Kharis keep this from being really top notch, but it's still quite an enjoyable programmer.","user":"drmality-1","rank":[29,34]}]