[{"title":"Bud & Terence: the rescuers of European B-movies.","rating":7,"date":"5 June 2007","review":"The dynamic duo strikes again, in one of their funniest adventures! Matt Kirby (Terence Hill) and Wilbur Walsh (Bud Spencer) are two small-time crooks whose path will cross, and lead them into an unsuspecting Police Academy. Now, armed and driving recklessly Miami's Police vehicles, they'll thwart a gang's plan led by gruesome harbor workers, their evil boss, two stunning and manipulative blondes and their intellectually challenged butler...<br><br>Bar fights, bowling fights, open-air fights, all the staples from the great silly Italian comedies are here, with all the heart you can expect from our heroes Spencer &amp; Hill. Not to mention the theme music, which became an instant classic, as well as the whole movie. A must-see in that genre.","user":"Squeele","rank":[10,10]},{"title":"IN MY OPINION,\"CRIME BUSTERS\" TIED WITH \"WATCH OUT WERE MAD\" FOR THE BEST TERENCE AND BUD MOVIE!","rating":8,"date":"20 February 2000","review":"This movie has to be one of the best slap-stick comedies EVER made!Heres the plot: Two guys named Matt Kirby ( Terence Hill ) and Wilbur Walsh( Bud Spencer )are sick of having no work which means no money so they decide to rob a super market. When they are ready they go around the back of the building, jump in,  and its a police recruitment office...not good! So they become cops. They hate being police so they decide to really mess thing up, like arresting the Leiutenant Govenor, but they are still with the police because the Captain of police( David Huddleston ) likes Matt and Wilbur, every time they \"MESS UP\" they help solve a case or prevent robberies and fights!<br><br>My favorite scene is when Bud Spencer destroys some guys car and then says \"Have a nice day!\" Excellent, 8/10<br><br>If you liked this movie, i suggest \" Watch Out were Mad\" and \"They call me Trinity\"","user":"Mark-371","rank":[23,28]},{"title":"The best one of the Spencer/Hill legacy!","rating":8,"date":"9 January 2007","review":"I grew up with them, here in Germqany their films are extremely popular. Now that I'm a grown-up, of course I must admit that most of their films are pretty silly, yet still they had an effect on me and influenced my preferences. This one is definitely the best one of them. Its slapstick humor is brilliant and the story is silly but absolutely hilarious. But the best thing about the film is the music. The moment you start whistling it, everybody knows exactly where it comes from. Genius! Even aspects like photography and set decoration are very convincing in this one, you find some beautiful pictures and scenes in it. So it's still a classic simple slapstick-buddy-movie, but a very special one: Their best one! It's a hell of fun to watch it!","user":"DoctorKay","rank":[19,23]}]