[{"title":"Clever & Surprising","rating":8,"date":"3 September 2005","review":"This is actually quite a bright spot in the late 70's Brit Horror Film Industry breathing its last few gasps. It comes in a few different versions, some bloodier and sexier than others. It actually works in either the softer or hotter versions. The grue-- including a nude woman threatened with scissors, a head crushed in a door, a gory fall of a ledge, a woman slashed with a jagged piece of glass, and a nail driven into an eye-- is lively, but the central story about the traumatized heroine being cared for by her malevolent uncle and his murderous son is strong enough to stand on its own. There are also the expected scenes of black mass and nude female worshipers. The film plays nicely on our expectations and manages to surprise. With all the garish colors and hazy turn of events, we're never quite certain if everyone is off their rocker, the heroine especially possibly going off on some flight of fantasy triggered by the accident and exacerbated by the legend of the ancestress witch. Plus, characters you expect to play a pivotal role die suddenly, it's hard to tell who is trustworthy and who isn't, and Martin Potter as the cousin vacillates so perfectly between being a morose companion to the girl and a frenzied monster to everyone else that I found myself just as lulled in by him. The violent scenes are shocking and unpredictable, while the talkier sequences have a weirdly cold atmosphere to them. For me, this one gets unfairly written off far too often.","user":"haxan-1","rank":[31,39]},{"title":"Sex-horror concoction baits censor, delights fans","rating":4,"date":"19 January 2005","review":"SATAN'S SLAVE <br><br>Aspect ratio: 2.39:1 (Techniscope)<br><br>Sound format: Mono<br><br>While visiting her uncle's country estate, a young girl (Candace Glendenning) becomes involved with satanists who believe she's the reincarnation of an ancient witch.<br><br>A key work from cult director Norman J. Warren (TERROR, INSEMINOID), SATAN'S SLAVE combines gratuitous nudity and horrific violence in a censor-baiting concoction designed to compete with the gore and cynicism of its contemporary American/European counterparts. Tellingly, SATAN'S SLAVE was written by David McGillivray, a film critic-turned-scriptwriter whose collaboration with another Brit maverick (Pete Walker) resulted in some of the most memorable exploitation movies of the 1970's, including HOUSE OF WHIPCORD and FRIGHTMARE (both 1974). McGillivray's scripts were always distinguished by their tongue-in-cheek attitude and gleeful subversion of accepted morés, and SATAN'S SLAVE is no exception. Sadly, despite its lip-smacking excesses, the movie is a disappointment.<br><br>In fact, much of the film's problems can be traced directly to McGillivray's screenplay, a skeletal mixture of witchcraft and paranoia, driven by dialogue rather than action, which coasts along on auto-pilot in between bouts of skin and sadism. Cast for her waif-like beauty and startling blue eyes, Glendenning (in what appears to have been her final appearance in a theatrical feature) fits the bill as a stereotypical heroine, but she emerges as little more than a colourless wimp, and her one-note performance is a liability. Second-billed Martin Potter gives an equally lacklustre performance as Glendenning's cousin, a psychopathic brute who subjects a pretty young girl (Gloria Walker) to a terrifying ordeal in the opening sequence (more of which later), before turning up as a resident in the home of Glendenning's enigmatic uncle, played by Michael Gough. SATAN'S SLAVE may not have been Gough's finest hour, but he rises to the occasion with predictable flair, delivering his fruity dialogue with Shakespearean relish and acting everyone else off the screen; his obvious talent and lack of pretension has earned him the devotion of cult movie fans worldwide, and with good reason.<br><br>Warren uses the widescreen format to visualise the gulf between the characters, and to exploit the landscape and décor of Gough's isolated residence. In fact, the film's threadbare production values are clearly bolstered by its primary location, a Gothic-style mansion located within the Surrey countryside, filmed in all its autumnal splendour. But the movie's rough-edged beauty is frequently tempered by scenes of horror and brutality, visited mostly on female characters who are often stripped naked before suffering the kind of cruel indignities which characterised exploitation cinema of the period. The downbeat ending is also typical of the era, though die-hard horror fans will guess the outcome long before the on-screen characters.<br><br>During post-production, Warren was asked to beef up the sleaze quotient for a number of European and Asian markets, so the director prepared a variant edition at odds with his original vision: The rough foreplay between Potter and Walker in the opening sequence (preceding Walker's murder) was extended by having the killer run a pair of scissors over his victim's naked body (the original version develops in a different way and features alternative dialogue, which means the 'new' material can't simply be edited back into the print), and a brief flashback was added to a later scene, in which Potter is seen stabbing an unidentified woman to death. The BBC dispatched a film crew to cover the production for a documentary entitled \"All You Need is Blood: The Making of SATAN'S SLAVE\", which they subsequently refused to show, though it has since been issued on video.","user":"Libretio","rank":[21,29]},{"title":"Entertaining garbage","rating":4,"date":"3 January 2006","review":"Charming psycho Stephen (Martin Potter) gets a blonde girl drunk, ties her to the bed and then threatens to do naughty things to her naughty parts with a pair of scissors before she decides she's had enough. On her way out, Stephen smashes her head in the door and then stabs her death in charming close-up. Meanwhile, pretty London teen Catherine Yorke (Candace Glendenning), who is plagued by some odd premonitions, heads out on a week long vacation with her parents to visit some distant relatives she's never met before. Unfortunately, as soon as the car pulls into the secluded Yorke family country estate, the car crashes into a tree in the front yard. When Catherine gets out to get help, the car blows up and kills both dad and mum. Though she's only slightly distraught by the bizarre accident, uncle Alexander Yorke (Michael Gough), who immediately announces he's not only her uncle but also a doctor, decides it would be best if Cathy stayed for a few days to re-coop and get to know him and his son, her cousin Stephen (the nut from the opening sequence). Also in the house is a bitter \"secretary\" named Francis (Barbara Kellerman), who is also Stephen's part-time lover.<br><br>Catherine's premonitions continue, including a strange dream where she's stripped naked by (naked) female cult members, has a pentagram carved into her stomach and a metal staff shoved where the sun don't shine. In another dream, a blonde is stripped naked, branded and whipped by a priest, who is played by writer David McGillivray. A few days after the shock of her parent's death, Catherine feels well enough to screw Stephen (the fact they're first cousins doesn't seem to phase anyone and is never even commented upon once). Francis gets jealous and bitchy (\"I won't be rejected for good!\") and then decides to get revenge on Stephen by helping out Catherine and explaining the devious plans her uncle and kissin' cousin have in store for her. See, there's a family ancestor named Camilla who is powerful witch that can only be revived by the blood of a direct female descendant. Guess who that is?<br><br>Shot in Surrey, England, this OK exploitation jumble has gobs of full female nudity (that the cameraman doesn't hesitate to get close-ups on), some gore (sometimes employing an obvious dummy) and surprisingly good acting from the four leads. The script stinks to high heavens and the ending is poor, but it's lively enough to keep you watching for an hour and a half.","user":"capkronos","rank":[12,17]}]