[{"title":"the ultimate nonsense comedy","rating":27,"date":"27 August 2003","review":"Well, this is unquestionably one of the funniest movies ever made. The first time a saw it I laughed to tears and this is the only time that counts. The first time you get the best experience. I really envy those who haven't seen it yet. <br><br>From the opening scene to the sudden ending this one won't let you leave the room. Especially the opening scene: \"Are you trying to say that coconuts migrate\" or when John Cleese trying to be Tarzan, hanging on the rope said: \"Can somebody give me a push.\" An absolute masterpiece.<br><br>\nConsidering the low budget that the creators of the movie had at their disposal would probably make \"The Holy Grail\" the best movie in this genre-silly nonsense kind of stuff. It shows the great creativity and acting capabilities of the Monty Python crew. It comes to say that a movie can be made with a little bit of money - a great movie. 10 out of 10","user":"vladymirror","rank":[263,308]},{"title":"They could grab it by the husk.....","rating":10,"date":"16 February 2004","review":"King Arthur and his Knights of the Round Table set out on a quest to find the Holy Grail...as told to do so by a cartoon God that lives in the clouds... <br><br>Easily the most hilarious and original comedy ever made, Monty Python and the Holy Grail claims it's undisputed throne through insanely ridiculous situations and characters that will very likely never be duplicated. Pure comedic genius that doesn't go stale with age or decades of competition having been released. Simply seeing the way comedy films are made today, this film will very likely have a long reign before anything can even hold a candle to it. An absolute belly-laugh fest that never lets up.<br><br>Only the cast of Monty Python could have pulled this film off, with each actor playing many different characters...all hilarious! The genius in the actors' lines themselves are truly to be admired. The comedic style of talking in circles is one technique that most comedies do not try to do, simply because they can't compete with the genius of this film, which uses it flawlessly. Those that do try usually fall flat on their faces. Two particularly excellent examples of this can be seen in the beginning scene, in which the characters discuss the origins of coconuts.....and the other when Lancelot breaks into the swamp castle to save the \"damsel in distress.\" This is merely one technique that the cast has perfected to conjure up laughs consistently throughout the entire film. The only way that I can imagine that someone might not like this film is if they simply do not enjoy it's type of humor. Too bad for them.<br><br>Another hilarious technique used in the film is the use of comedy in the background. From people slamming cats against poles for no apparent reason, to people filling up baskets with mud in the fields....all very strange and hilarious at the same time. It's also simply amazing that all of the characters are played by the same group of actors, which shows the great range all of them have. Some are simply unrecognizable from one character to the other and it sometimes takes a good eye to pick them out, which makes it fun. And I don't want to ruin it for anyone, but this film takes some turns that no sane person could see coming.<br><br>Ridiculous characters in ridiculous situations equals ridiculous laughter.<br><br>The epitome of all-star comedy that will no doubt continue to stand the test of time. Kudos to Gilliam and the rest of the Python crew. If you haven't seen it yet, make it your first priority in life!","user":"Manthorpe","rank":[218,264]},{"title":"The reason Robin Williams isn't in a nut house.","rating":10,"date":"3 October 2004","review":"This is perhaps one of the greatest, funniest parodies in the history of film. I think the greatest definition of irony is that to be believably stupid on screen, you have to be very intelligent. This is a rare occasion where something can be so stupid that it's funny, with the addition of feeling you got your money's worth at the end. Examples of failures would be anchorman, austin powers, scary movie etc. The gore and clichés of three headed, and goofy \"NI!\" yelling knights are what give this movie discreet beauty.<br><br>Did I mention that the acting is also very good for a movie of this sort. All of the main characters, as they do in the series, take on numerous characters, all of whom are well established and each have their quirks about them. This was a well written, well thought out, and perfectly directed, low budget comedy. The funniest of any monty python film, and amongst the top comedies of all time. I laughed from beginning to end and bruised one of my lungs. I highly recommend this film to anyone. This is living proof that all you need is a good script and good actors.","user":"uckpshh","rank":[321,399]}]