[{"title":"Classic, original, best supernatural comedy's masterpiece!","rating":10,"date":"25 December 2015","review":"This movie is what it is, a perfect 10, because it takes the vision of one of the most imaginative directors on Earth, and realizes them almost perfectly with all the tools that fit the task -- actors, stunts, puppetry, models, and CGI.<br><br>Ghostbusters (1984) is the best classic original spectacular supernatural masterpiece from Ivan Reitman! One of if not the greatest films ever! My favorite film of all time! \"Ghostbusters\" is the film that made me become a fan ever since I was young! It had an awesome cast, cool special effects, hilarious dialogue and a kick-ass soundtrack! The film that can be watched over and over again! I grew up watching Ghostbusters on TV and the animated TV series The Real Ghostbusters (1986 - 1991). Ghostbusters II (1989) actually introduced me in to Ghostbusters. I loved them so much that I even said to my mom, when I grown up I will be a Ghostbuster! It was my fantasy. Watching it yesterday and I still love it. I love this flick to death! I still can't believe it how the world changed and how in the 80's the world was better than today! I always have enjoyed the sequel much better than as a child, it was my first movie but now as an adult, I love and enjoy the original movie to death! It is the only movie I own on Blu-ray disc and I still love it. <br><br>This is an amazing movie! Funny, smart, well written and directed. It features an outstanding performance from Bill Murray, great showings by Harold Ramis, Rick Moranis and one of the last documented instances of Dan Aykroyd being funny on film (he was blown by a ghost!). In fact, the film gets a great performances from nearly everyone who appears in it- from Annie Potts, to the guy who played Lenny the Mayor, to the handsome cab driver who calls Rick Moranis an asshole. In addition, they had one of the best \"a-hole\" guys ever to appear on film, as the film's bad guy- I'm talking of course of the grossly under-rated William Atherton- who played the EPA guy, \"Dickless\". Atherton, of course went on to play memorable a-holes in Real Genius and of course he was the annoying reporter in Die Hard (1988) but here in Ghostbusters, you really see a solid performance by maybe the best guy to play an a-hole in films in the 80's. <br><br>Next Year the reboot is coming out as Paul Feig's Ghostsnuters, Ghostbitches or Ghostflufers./: Ghostbusters (2016) with women now as a Ghostbusters! Why rebooting this awesome supernatural spectacular comedy flick? I know the sequel failed and Bill Murray did not want anything to do with it. But that doesn't mean that they shouldn't have made Ghostbusters III in the 90's, they should have! Dan Aykroyd and Harold Ramis tried so hard to convince Bill Murray to do it for the third sequel and they couldn't convinced him. They are going to ruin the Original movie! I don't want to see Ghostbusters with a female leads. Come on? The girls are not the Ghostbusters, they are three man a scientists and a one civilian. The Ghostbusters are the only one Harold Ramis, Dan Aykroyd, Ernie Hudson and Bill Murray. They were always be the Ghostbusters that will be the case. No one else will be! No one else will replace them! This is like A Nightmare on Elm Street (1984) that come out the same year as the Ghostbusters did, they remake it and that remake failed!! It was awful boring! Why remaking or rebooting my classic horror comedy's that I Love?! Ghostbusters (1984) are unique, classic 80's masterpiece! These were the best times for movies ever!!! One of my favorite soundtracks and movie of all time!<br><br>They just don't make them like this anymore. This is comedic writing and performance at its peak... with quotes that everyone knows and enjoys. From \"This reminds me of the time you tried to drill a hole in your head\" to \"Symmetrical book stacking. Just like the Philadelphia mass turbulence of 1947\" to \"Many Shuvs and Zuuls knew what it was to be roasted in the depths of the Slor that day, I can tell you! \" this is a CLASSIC movie! Ghostbusters is a true classic comedy that stands the test of time. The film is funny, awesome and entertaining. It has a lot of laughs. I love the soundtrack Ghostbusters Written and Performed by Ray Parker Jr. I think he did made a great soundtrack in the 80's. If there's something strange in your neighborhood, who you gonna call? GHOSTBUSTERS!!!! A film that can be watched with the various youngest to the very oldest of the family. Wonderful collection of characters. A film that is treasured by just about everyone that watches it. I miss movies from the 80's and this film felt so realistic. Sigourney Weaver was just so outstanding as Dana Barrett after she made the horror flick Alien (1979 and Aliens (1986). <br><br>Ghostbusters is a 1984 American supernatural comedy film, directed and produced by Ivan Reitman and written by Dan Aykroyd and Harold Ramis. The film stars Bill Murray, Dan Aykroyd, and Harold Ramis. <br><br>10/10 Grade: Bad Ass Seal Of Approval Studio: Columbia Pictures, Black Rhino Delphi Productions Starring: Bill Murray, Dan Aykroyd, Sigourney Weaver, Harold Ramis, Rick Moranis, Annie Potts, William Atherton, Ernie Hudson Director: Ivan Reitman Producer: Ivan Reitman Screenplay: Dan Aykroyd, Harold Ramis Rated: PG Running Time: 1 Hrs. 45 Mins. Budget: $32.000.000 Box Office: $291,632,124","user":"ivo-cobra8","rank":[101,107]},{"title":"My favorite film as a child and still brilliant today!","rating":25,"date":"25 February 2004","review":"I have special affection for this film. When I was a youngster, growing up between the ages of four and ten, this was my favorite film. I loved the whole Ghostbusters thing. I loved the sequel, the cartoon series, I had to have the toys and merchandise every Christmas, you name it. Strangely, as I have gotten older, I find myself appreciating the film more and more. When I was a child I loved it for the special effects, the gadgets and the ghostbusting especially. Nowadays I love it for the same reasons, but now that I'm older I find myself appreciating the dialog which is some of the funniest committed to a film, the oddball humor, like Venkman's line about dogs and cats living together and the in jokes, like Slimer being the ghost of John Belushi and Venkman rubbing his hand at glee at the thought of the money to be made from the merchandising of the ghostbusters brand. Not only that, but some 80's hairstyles aside, the film as aged remarkably well. My cousin who is five years old has developed a love for the whole Ghostbusters thing, showing that this is truly worthy of being branded one of the most successful films ever made.<br><br>Unlike many of today's blockbusters which are humorless and pompous thinking that they are serious films and forgetting about any sense of fun along with the complicated visual effects, Ghostbusters is funny and a fun paranormal movie. The set pieces are superb as we see the Ghostbusters going up against Slimer, Gozer and, undeniably the classic movie moment of the 80's, the Stay Puft Marshmallow Man. For a film made in 1984 the climax is very well done and looks exceedingly realistic, without any hint of clues as to the fact that it is a special effect. This is what going to the cinema should be all about. Fun with a capital F. All the actors get into it with great comedic aplomb. Bill Murray, one of the finest comedy actors to grace the screen, is superb as Peter Venkmen who gets the best lines in the film as well as the funniest moments. Just check out the \"there is no Dana, only Zool\" moment. Murray's priceless reaction to Dana Barrett's possession is one of the most side splitting moments I have ever seen. In fact, the casting is pretty much spot on. As well as Murray, we have co writers Dan Akyroyd and Harold Ramis sharing the spotlight as the fellow Ghostbusters, Sigourney Weaver making a wonderful damsel in distress, Rick Moranis is almost scene stealing as her nerd of a  neighbor who becomes possessed himself, while Ernie Hudson and Annie Potts both put in wonderfully sardonic supporting roles who get their chances to shine.<br><br>Add to this one of the best theme tunes and a truly apocalyptic finale, it is no surprising that this was the biggest film of 1984. A summer blockbuster with humor, trills, spills and some of the best special effects money could buy at the time, this is truly a genuine classic and is one of the best Hollywood blockbusters ever made.","user":"eamon-hennedy","rank":[167,193]},{"title":"A severely underrated film","rating":9,"date":"16 September 2002","review":"What's that you say? Ghostbusters, one of the most financially successful and over-hyped comedies of the eighties, underrated? Yes. Precicely because it was so over-hyped and made so much money, there has been a stigma attached to this film identifying it as a childish FX piece, when it is nothing of the sort. Most of the lines people remember(\"He slimed me,\" \"OK. So? She's a dog,\" \"When someone asks you if you're a god, you say YES!\") are not its funniest or wittiest lines, which often are missed on first or even second viewing. I laugh every time I observe a gag or a quip that I somehow missed the other 20 times I viewed a scene; \"Egon, this reminds me of the time you tried to drill a hole through your head, remember that?\" \"That would have worked if you hadn't stopped me\", or, to the driver of a van from a loony bin, \"Dropping off or picking up?\" Brilliant.<br><br>Not only is Ghostbusters funny, it manages to include some truly scary scenes. And not just lose-your-popcorn moments like the fridge from Hell, but also scenes of quiet, thoughtful chill, like Egon's retelling of how the possessed apartment building came into being, or Winston recalling the Book of Revelation. Which other film has managed to combine the Marx Brothers with HP Lovecraft?<br><br>The special effects hold up well, besides some obvious studio sets and models, but what really creates this film's world is the stunning cinematography. Manhattan, perhaps the pinnacle of Gothic architectural evolution, is brilliantly utilised here to create a sense of menacing grandeur. After watching \"Ghostbusters\" I couldn't imagine the realm of the Old Gods opening into our world from anywhere else. The soundtrack is great, not the overrated theme (Which was in fact lifted from Huey Lewis' \"I Need a New Drug\"), but the wonderfully blusey \"Cleaning Up the Town,\" the creepy proto-techno chiller \"Magic\" and also the wonderful score by the late and much lamented Elmer Bernstein.","user":"magic_marker","rank":[251,295]}]