[{"title":"No, It's Not The Original, But It's Still Very Funny","rating":8,"date":"11 March 2006","review":"This was another sequel that was fashionable to knock when it came out. It got panned because it couldn't live up to the first Ghostbusters. Well, what could? The first one was so original, so enormously popular than any sequel was bound to fail as far as matching it.<br><br>This second Ghostbusters was just fine, very entertaining and it was nice to see all the main characters back. It had a little nicer feel to it and was more family-friendly language-wise, so it even had some things going for it the first one didn't have.<br><br>The other major different in this sequel was watching Peter MacNichol, who reprized his \"Renfield\"-type character from Mel Brooks' \"Dead: And Loving It\" comedy with Leslie Nielsen. Here, MacNichol plays \"Janosz Poha,\" another wacko with a thick Eastern European accent. He is hilarious, and elevates the enjoyment of this film. Otherwise, the rest of the cast plays and acts just as they did in the first film, which means you'll get a lot of laughs out of them The story just isn't as intense, that's all. No, it can't equal the original, but.....<br><br>The bottom line is this: Don't try to compare the two films. If you enjoyed the first, you'll like this.....period.","user":"ccthemovieman-1","rank":[97,124]},{"title":"They're back!","rating":8,"date":"30 October 2007","review":"I could lie and say I think \"Ghostbusters II\" is an inferior sequel to the original 1984 \"Ghostbusters,\" but \"Ghostbusters II\" is an entertaining film in its own right. Nothing can come close to the gleaming perfection of the first film but damn it, the sequel works in most places. It's chiefly because the movie is just so damn entertaining! It's still mostly watchable despite its flaws and misjudgments about what the filmmakers may have seen as an apparent mean-spiritedness in a lot of people during the late '80s.<br><br>True, comedian and star Bill Murray still steals the show whenever he gets the chance and he also gets some of the best lines, and he's just so gosh-darn funny as a leading man. Screenwriter team/co-stars Dan Aykroyd and Harold Ramis are also in top form, and it shows in their wily and hilarious script. Unlike the first picture, though, it seems like they took the family-friendly route and didn't feel like building up to the oh-so-apocalyptic tone of the first film (even though \"Ghostbusters\" was still pretty funny aside from the occasional dark tone).<br><br>And also, director Ivan Reitman knows their material and it looks like the filmmakers made the wise decision of bringing back everybody from the original film, including Sigourney Weaver and Rick Moranis. It's been five years since the first film (a title card confirms it), and it seems that most of New York City doesn't even remember who the Ghostbusters are and what they did for the city. Everyone in the city is miserable and the opening moments confirm that as well. After being almost bankrupted by countless lawsuits and being unable to practice their trade because of a judicial restraining order, the boys are reduced to moonlighting in other fields, such as catering to the needs of spoiled yuppie children at their birthday parties, a task that neither Ray Stanz (Aykroyd) or Winston Zeddemore (Ernie Hudson) take pride in.<br><br>Egon Spengler (Ramis) is the only one of the original Ghostbusters who seems to have actually moved on with his life. Peter Venkman (Murray) hosts a television show called \"The World of the Psychic,\" a show that apparently draws in modest ratings but no respected psychic will appear on his show because they think he's a fraud. Anyway, things get underway when the boys discover that nasty pink slime of supernatural origin is discovered building up underneath the city, something that old friend and Venkman's old flame Dana Barrett (Weaver) realizes first hand when the slime attacks her infant son, and it's an investigation they have to do on the down-low because of their current legal situation.<br><br>This slime, they learn, feeds off the misery and stress of a downtrodden New York City, and it's only getting stronger as the holidays are approaching. But because no one believes in ghosts anymore, their task is even more difficult. Well, after ghost-busting the two ghouls that crash in on their trial hearing, we have no choice but to be ready to believe them. They're back in business, all right - with cynical Janine Melnitz (Annie Potts) answering the phones and Louis Tully (Moranis) on the books - tracing the source of their ghost-busting investigations to a 17th-century Moldavian tyrant named Vigo the Carpathian who wants in on the 20th century, and has possessed museum curator Janosz Poha (a hilarious Peter MacNicol) to go out and kidnap Dana's son so he can have a body so he can live again.<br><br>One thing \"Ghostbusters II\" provides for the viewer is solid entertainment, which is what any good sequel should do. It would be impossible for this movie to any way live up to the original, so you can't blame the filmmakers for at least trying (trying is italicized). It would be pointless to say that the acting is good from our players, but my God, they're good and again in top form. The special effects are still pretty impressive, even from their early ghost-busting capers, to a finale where the boys are actually able to walk down the streets of the city in an animated - yes, animated! - Statue of Liberty (yes, Lady Liberty has sprung to life, and good thing she's on our side!). And even the R.M.S. Titanic (don't ask, just watch) pops up too.<br><br>\"Ghostbusters II\" hasn't been particularly well-received, even despite its more family-friendly tone and message about the folly of mean-spiritedness. But it's just a good sequel, nonetheless, not bad, not superior to the original, maybe on par with the original, but it's just really good fun.<br><br>8/10","user":"dee.reid","rank":[40,50]},{"title":"This film shouldn't be panned","rating":8,"date":"9 October 2000","review":"I say that one line summary not in the meaning you should watch this film in widescreen, but in that this film isn't as bad as some people say.  Sure it might not have the ultimate originality of the 1st (of course), but it is still entertaining, one of the best of 1989.  This time, we see 5 years later where the Ghostbusters parted ways (Venkman to a Talk show, Spengler to a child psychologist and Stanz as a book store owner) but are put back together because of new activity in the paranormal that could end the world (courtesy of a painting named Vigo).  Then, comedy ensues with great visual effects to match.  Still pretty funny (the talk show scene with Chloe Webb is utterly hilarious), but maybe just a tad lesser than the first. A-","user":"Quinoa1984","rank":[73,99]}]