[{"title":"Good Film With a Bad Reputation","rating":9,"date":"11 January 2003","review":"I've heard a lot of things about this film -- it generally gets low reviews, is described as \"unBergmanesque\", and the fact that its so difficult to find led me have very low expectations for the film. I expected something between the atypical Bergman plot of \"The Serpent's Egg\" and the disturbing social violence of \"From the Life of the Marionettes.\" I finally tracked down a copy, poor in quality, and expected mediocrity at best when I put it in.<br><br>After having just finished watching it, I can say I was very pleasantly surprised with the film. A lot of the things said about it are just plain false -- the plot is very much in keeping with Bergman's other material. A married woman, Karin (Anderson), falls in love with a disturbed architect, David (Gould), and the two begin an emotionally confused love affair. Karin is caught between her happy bourgeois life with her husband (Sydow) and children, and her passionate, unconventional relationship with David. Acting in bad faith, Karen refuses to choose between her two lives, though both David and her husband eventually push the decision on her. Like most Bergman films, its a psychological roller coaster and a bleak portrayal of the coarseness of human relationships.<br><br>Bibi Anderson does a wonderful job in a very difficult role, and Max von Sydow plays the part of the honest and good intentioned husband very well, playing hard on the viewer's sympathies. The stiff performance of Gould echoes that of Carradine in \"The Serpent's Egg,\" so it must unfortunately be attributed to Bergman's struggle with directing in English, not on Gould himself. If I recall, the film was made in both Swedish and English, both versions filmed at once, which poses obvious production difficulties which might account from the some times mechanical treatment of the script.<br><br>\nThe film has an excellent pace to it, and moves very swiftly and smoothly, wonderfully shot by Nykvist in a way very similar to \"The Passion of Anna.\" Unlike a lot of Bergman's depressing work in the 1970s, I felt good about the film when it was over.<br><br>I don't know why this film has such a poor reputation -- I'm very much baffled after having seen it. My guess is the obvious mistake of having made it in English accounts for most of this.<br><br>Its seems a lot like Bergman's other work in this period. Very Good.","user":"Tartarlamb","rank":[26,28]},{"title":"Bergman shows us the analysis of a vulnerable woman's double life","rating":10,"date":"10 February 2000","review":"This underrated Ingmar Bergman film is a disappointment to some and a puzzle to others.  But if the viewer looks past the mundane story line, a middle class marriage threatened by a moody, violent stranger, one can see just how much richness Bergman has invested into this otherwise predictable type of story.  I found Karin, the modern heroine in this story, to be a perfect symbol of the flip-side of Bergman's fascinating female protagonists.<br><br>The harsh criticism that Elliott Gould received for having accepted this role was unjustified and grossly exaggerated.  Taking on a role like this is a thankless task at best and his interpretation of the despicable David was misunderstood.  I think it was an authentic and courageous performance, an example of an actor who decides to portray the character straight without looking to advertise his own star persona.<br><br>Confronted by a type like David, we can understand how Karin could succumb to his advances and not even see where she's heading in this self-destructive relationship.  We see stranger stuff than this in real life, why not accept it being put to an audience by the greatest film director who ever lived?","user":"waldorfsalad","rank":[18,20]},{"title":"Under-rated: this is one of the more potent Bergman romantic dramas I've seen...","rating":9,"date":"1 May 2005","review":"...and I think part of the reason for that is, aside from some notable uses of symbolism (some subtle, some not so subtle, in part due to the photography), the story is rather simple. This gives Bergman room to try and get us to understand these characters. In lessor hands (or rather, hands not as proficient in the soul-searching drama as Bergman is) this could be almost a TV melodrama. But I would disagree with some critics- notably with Ebert- that Bergman has lost his tone with this picture. In some ways it is more modernly set than some of his other films (and that it is in English sets it apart from some of his trademark Svensk Filmindustri pictures), however it doesn't hurt it terribly so. There were times while watching the film, mostly in the first fifty minutes, that I thought this was one of Bergman's best, by giving his control somewhat over to the actors, who are all sensational. While it doesn't quite live up towards the end, and feels abruptly finished, the climax doesn't feel too compromised. The Touch is like the Adrian Lyne film (which draws itself from a Chabrol film) Unfaithful, only this film seems a little more steeped in reality than outright sexuality.<br><br>Karin (Bibi Andersson, one of Bergman's key actresses) lives a rather calm, routine life with her husband Andreas (Max von Sydow) and their two children. After her mother dies (which I suppose sets up her emotional indecisiveness for the film), she meets David (Elliot Gould), and the two slowly begin an affair. But David is not the most stable of people, and it shakes Karin up at first. Soon they fall in love, but are separated, the sort of usual machinations with an infidelity story begin to unfold, and yet not losing the emotions from before. The three key actors of the film, Andersson, Von Sydow, and Gould, seem to live in these characters, and especially Gould (for whom this would be his only role with the director) conveys a sort of double nature that is also within Karin. His performance is one that I would put in a list of his best- you can tell everything he wants and fears in his face and actions, within the careful framing, this is a man on the edge. Bergman had once described Gould as a \"difficult\" actor to work with, but that tension came out the right way on screen, at least from my perspective.<br><br>As I mentioned, in lessor hands this could become a further melodrama, and part of the films refusal to subvert to that category is a credit to not only Bergman, but to cinematographer Sven Nykvist. Whenever I see a film with their collaboration (or even if it's Nykvist with, perhaps, a lessor director), I always watch for how Nykvist moves the camera. How seamlessly he follows these characters, and in their darkest recesses he lights them like the light and control on their faces is part of the writing. A lot of times (appropriately so) one may not even feel the presence of the camera, as if Nykvist doesn't even have a technique. But it is here where not only does he and Bergman go with their touches of light and dark, they also go for a documentary feel in the production.<br><br>Basically, this is an experiment for Bergman, as it is for his fans to endure. He's experimenting with a genre done hundreds of times, he experiments with music (unlike some of his dramas, which includes Bach or Mozart, here it's kind of pop-sounding for the period), and he experiments with his cast this time around. Is it as powerful and awe-inspiring as his \"trilogy\" or his other great works? Probably not. But it is unfortunately panned down as a lessor work of his, which isn't necessarily true. The film also needs to be seen by more people of today, as it is virtually impossible to buy on video or DVD. A-","user":"Quinoa1984","rank":[20,24]}]