[{"title":"Tight Lipped Burt","rating":6,"date":"4 August 2007","review":"In Malone, Burt Reynolds is a CIA paid assassin who's tired of the life and wants out of the company. Of course the company doesn't see it his way and his former protégé Lauren Hutton is sent to terminate his contract with the agency. <br><br>But Reynolds in looking for obscurity finds a place where a mysterious millionaire Cliff Robertson is buying all the land in some obscure valley in Idaho to make it his headquarters for some ill defined right wing conspiracy. Robertson's bought the sheriff, Kenneth McMillan and several local louts to enforce his will on the community. Reynolds's car broke down here by sheer chance and he's taken in by garage owner Scott Wilson and his daughter Cynthia Gibb. When Robertson's thugs start leaning on them, Reynolds springs into action.<br><br>Burt Reynolds's style is a whole lot like James Garner, quizzical, cynical and charming. I'm not used to seeing him play it as tight lipped as he does in Malone, but he does carry it off. The film borrows a lot from the plot of Shane and I could certainly see a 1987 version of Alan Ladd in the part.<br><br>It's a good action film even though a lot of the plot issues are unresolved. More than fans of Burt Reynolds will enjoy this.","user":"bkoganbing","rank":[20,22]},{"title":"great 80's action no brainer","rating":10,"date":"30 August 2006","review":"Even though some people state that this film is awful, but they are forgetting that most 80's action films where and this was one of many that was churned out then forgotten.<br><br>I vividly remember first watching this on video rental and thought it was brilliant and even though it's very dated I still love the film as an 80's classic like I would watch some old black and white film.<br><br>I don't feel I should have to wait until the film is 40 or 50 years old to claim it is an classic nor should I go with other persons comments that it is crap just because they are watching the film without growing up in the 80's when the film was made and is set in.<br><br>with regards jpclarke","user":"jpclarke2005","rank":[24,27]},{"title":"The Burt Reynolds I like best","rating":29,"date":"29 October 2000","review":"This was a breath of fresh air compared to the silly movies that he made from about 1980 to 1990.   There were no silly comments just lots of action. VanDamme or Segal could not have done better.   The local filming was beautiful and the acting by the supporting cast was first-rate and not overdone. Burt might be too old for this type of movie now but this is the stuff that he should have done when he was in his prime.  I am glad I saw it as I gained new respect for his acting.","user":"TC-4","rank":[15,17]}]