[{"title":"But Awful is what makes it a cult classic....","rating":1,"date":"19 November 2007","review":"My uncle told me this was the WORST film he ever directed. He was a contract director and the studio wanted him to make a movie about Communism. \"This McCarthy thing seems to be catching on,\" he said they told him, \"and we need a film quick.\" They gave him six weeks and $100,000 budget - an unheard-of pittance for a feature film, even in 1949. He didn't have a cast, a crew, a script, or even a story line. So he called friends who had very little screen time, knowing no \"Name\" actor would commit to a project like this. Besides, most of Uncle Gordon's actor friends were Western stars, like Roy Rogers.<br><br>Gordon got a writer from the studio to pen the script, but he quit half-way through filming. So he and another actor had to complete the script, adding to it as they went. At the start of each day's filming, they had no idea what they were going to do.<br><br>But, as promised, Uncle Gordon got this movie made on time and on budget.<br><br>It saddened him a little, knowing that with all his directing credits, he would probably be most remembered for the worst film he ever made. He was proud of the rest of his filmography, and enjoyed directing well into his 70's.<br><br>As for me, well, I think its kinda cool that my Great Uncle had a lot to do with the making of a cult classic. Its no Rocky Horror, Reefer Madness, or even Attack of the Killer Tomatoes, but in the genre of ridiculously bad films, Red Menace can hold its celluloid head high.<br><br>Just remember, Bud Springsteen had to work under extreme conditions to churn out a film this bad.","user":"BudsNephew","rank":[35,43]},{"title":"The \"Reefer Madness\" of Cold War films","rating":10,"date":"26 March 2003","review":"And throw in a touch of \"Plan 9 From Outer Space\" and you've got the idea. The commies are using sex and booze to lure all-American boys to do ... just what isn't exactly clear, but the ultimate goal is to promote atheism and destroy freedom. Meanwhile, all they seem to be doing is killing their own members when not turning them in to the INS. An added treat for 50's TV fans is that the dimwitted hero is played by Robert Rockwell, who later portrayed Mr. Boynton, the suspiciously uninterested biology teacher eternally pursued by Eve Arden in \"Our Miss Brooks\"","user":"RickeyMooney","rank":[17,32]},{"title":"A sobering account of Communist Party life, chillingly presented.","rating":8,"date":"17 August 2006","review":"In view of what the Soviet archives revealed about the U. S. Communist Party(thank you, Gorby), this movie hits the nail right on the head. All the tactics Communists used to gain members, such as having female members sleep with prospective male members, as well as the means they used to create trouble, are shown in this movie. My father-in-law was once a Communist. He told me that the CPUSA would take up a collection for African-Americans on trial somewhere and keep the money for themselves. If a man quit the party, not only would he be shunned, but other members' kids would be expected to bully his kids! All this is shown in the movie, including even the beatings administered to wayward members. See this film and learned what we narrowly escaped from ending up as.","user":"h_palka","rank":[26,63]}]