[{"title":"\"A classic Freddie Francis directed horror film.\"","rating":9,"date":"20 September 2003","review":"*CAUTION - HUGE SPOILERS* Five strangers are separated from their tour party while touring ancient catacombs. In attempt to find the others, they end up trapped in an eerie crypt where they meet the Cryptkeeper (SIR RALPH RICHARDSON), a sinister monk who shows them their grisly fortunes.<br><br>AND ALL THROUGH THE HOUSE: Joanne Clayton (JOAN COLLINS) murders her husband on Christmas Eve for his life insurance but ends up being attacked by a psychopathic killer dressed as Father Christmas.<br><br>REFLECTION OF DEATH: Carl Maitland (IAN HENDRY) leaves his family for his young mistress Susan (ANGIE GRANT). As they drive off into the night, their car crashes into a ravine. Carl manages to struggle out of the wreckage but Susan is nowhere to be found. Everyone he approaches runs off in fear at the sight of him and when he manages to get to Susan's flat, he discovers that she was blinded by the accident and that he had died two years previously. Bewildered, Carl looks into a mirror and discovers that he is a walking corpse. Suddenly Carl awakens and it was all a nightmare, but then the car crashes exactly as it did in his dream and the horror begins for real! <br><br>POETIC JUSTICE: Ruthless property developer James Elliot (ROBIN PHILIPS) feels that his neighbour, the kindly dustman Arthur Grimsdyke (PETER CUSHING) is an eyesore. However, his property has considerable land value and Elliot launches a smear campaign in the hope that he will sell up and leave. Instead Grimsdyke commits suicide after he sent him a number of poison Valentine cards, but a year on Grimsdyke returns from the grave to deliver a particularly grisly St Valentine's Day present! <br><br>WISH YOU WERE HERE: Ruthless business tycoon Ralph Jason (RICHARD GREENE) is declared bankrupt by his lawyer Charles Gregory (ROY DOTRICE). But Jason's wife Enid (BARBARA MURRAY) has discovered a statuette, which can grant three wishes. After Ralph is killed in a car crash, Enid wishes her husband alive forever and as a result Jason returns from the dead. However, his body has been embalmed and this means that he must live in eternal agony forever. Enid attempts to end is suffering by chopping him up with a sword, but this means that his suffering is only increased.<br><br>BLIND ALLEYS: Selfish Major William Rogers (NIGEL PATRICK) takes over the running of a home for the blind. However, Rogers uses funds allocated to the needs of his patients for his own comfort. When his negligence results in the death of one of them, the other patients exact a nasty revenge, in which Rogers is trapped in a corridor lined with razor blades and is set upon by his vicious starved dog.<br><br>After Rogers' fortunes are told, the Cryptkeeper informs them that he wasn't showing them the future, but telling them why they ended up in the crypt. The only exit leads into a fiery pit and they realize that they are all dead and are in hell as a result of their sins.<br><br>TALES FROM THE CRYPT was Amicus's fourth portmanteau horror film and is based on stories from the EC horror comics of the fifties by William Gaines. Freddie Francis' direction is first rate as is Norman Warwick's camera-work, which ideally suits the comic strip style of the film. A star-studded cast does fine work especially Peter Cushing as Arthur Grimsdyke in POETIC JUSTICE, a touching performance which won him the Best Actor Of The Year Award in France. REFLECTION OF DEATH is well staged and shot in dark uncompromising colors. WISH YOU WERE HERE is a variation on THE MONKEY'S PAW, while BLIND ALLEYS is neat and suspenseful thanks to imaginative camera-work and good performances from Nigel Patrick and Patrick Magee as the victimised blind man. I guarantee that the way Francis shot this episode will have you on the edge of your seat! AND ALL THROUGH THE HOUSE carries a touch of sly black humor as Joanne Clayton's little daughter played by Chloe Franks gleefully lets in the psychotic Santa Claus not realizing the real horror of what's going on. All in all, TALES FROM THE CRYPT is unmissable for both addicts of the genre and for those who appreciate fine acting.<br><br>Also of interest is the collectable novelized version of the film by Jack Oleck, which is well presented and good to read. Genre addicts will have a good laugh when they see the follow up, VAULT OF HORROR (1973), in which that very book is used as a prop by actor Michael Craig in the buried alive segment. In the 1990's, the EC horror comics were developed into an American TV series entitled Tales From The Crypt only the crypt keeper was a horrific skull like puppet and a 1996 episode called Last Respects was directed by Francis.","user":"jamesraeburn2003","rank":[56,60]},{"title":"Nice collection of bitter little tales","rating":18,"date":"18 May 2004","review":"Based on the old (and rather controversial) E.C. Comics of the mid-20th century, this horror anthology is an above average entry in an intriguing (and all but dead) genre.  Here there is a tour group seen roaming through some ancient catacombs with five attendees obstinately staying behind, despite numerous warnings to stick close together.  They find themselves severed from the group and wind up in a tomb-like room with creepy Richardson in a monk's robe doling out orders and insights.  The quintet is made to sit while each one gets a glimpse into his or her recent life.  Thus the five brief stories are presented in order, each one with a morbid, ironic or gory twist to it.  Collins (looking svelte and attractive) is in the first one.  She splits her husband's head open as he's benignly reading the newspaper while cheery Christmas music plays on the soundtrack. (Hilariously, she kicks him down the steps while \"God Rest Ye Merry Gentlemen\" drones on.)  Before she can properly dispose of his body, an escaped mental patient in a Santa suit starts terrorizing her!  Then Hendry is shown leaving his wife and children for a younger woman.  A fateful experience on the freeway changes his life forever.  Next up, snooty Phillips is being driven up the wall by his neighbor - kindly, but eccentric, old man Cushing.  Phillips continuously thwarts Cushing until he gives up...but does he?  A fourth tale features Greene (as a greedy gunrunner) who is forced to part with his possessions, but his wife spies an inscription on an old statuette and discovers that she can use it to ask for three wishes.  This doesn't work out quite as optimistically as she had hoped.  Finally, Patrick is a militant, heartless administrator of a home for the blind.  He pushes the male inhabitants there to their limit and winds up paying dearly for his sins.  Though no story gets enough time spent on it to really flesh it out to it's greatest potential, most of them are really intriguing and usually very well acted.  The spareness of the locations and effects help set a rather desolate and chilly mood.  The finest acting is probably provided by Cushing in a very atypical role.  The most memorable vignette is the last one which features an unforgettable comeuppance.  Fans of British horror (and especially of anthologies) will rank this pretty highly, but it's interesting enough to lure other viewers as well.","user":"Poseidon-3","rank":[29,30]},{"title":"Ghoulish Fun","rating":10,"date":"10 July 2000","review":"Five people wander off on a tour and come upon the crypt-keeper.  Each tells his or her last memory.  Each one confesses to doing something wrong.  The crypt-keeper listens to each before telling the five what has happened to them and where they are.  Easily this is one of the best Amicus horror anthologies.  It is well-crafted, well-acted, and suitably directed by genre stalwart Freddie Francis.  All of the stories are pretty good, with three standing out.  The first story about Christmas and a loose killer is well-done and shocking for its day.  The best story stars Peter Cushing as a genial old man suffering desolation and humiliation from a heart-less(no pun intended) neighbor.  Cushing does a wonderful job here, and in a way it is a sad performance as it was made shortly after the death of his long-time wife Helen.  The last story is almost as good about a group of blind residents who stop taking being treated poorly and give out punishment to a military man with razor-sharp justice.  Patrick Magee and Nigel Patrick both excel in this little vignette.  The frame story is also well-executed and Sir Ralph Richardson hams it up amicably as the keeper of the crypt.  A great group of frightening stories...each with a moral of sorts.","user":"BaronBl00d","rank":[37,39]}]