[{"title":"From The Heart Of Mark Twain, Into The Hearts Of The World","rating":10,"date":"7 June 2001","review":"THE ADVENTURES OF TOM SAWYER keep the small town of St. Petersburg, Missouri in constant turmoil, circa 1850...<br><br>This is a splendid family film, one of producer David O. Selznick's very best. Presented in wonderful Technicolor, it is like looking through the pages of an illustrated copy of the classic novel. All the favorite episodes are here. All of the performers are perfect in their roles. It is difficult to imagine a better transition from book to screen.<br><br>Elderly May Robson has one of her finest roles as harried, temperamental, lovable Aunt Polly. She easily steals every scene she's in &amp; provides the sentimental heart of the movie. However, breaking out a bit, her last scene at the film's conclusion is hilarious. A small cluster of veteran character actors - Walter Brennan, Victor Jory, Donald Meek &amp; Margaret Hamilton - are also exceptional in their roles.<br><br>12-year-old Tommy Kelly IS Tom Sawyer - he will instantly gain the respect &amp; admiration of every prepubescent male in the audience. Beguiling &amp; mischievous, with an infectious grin &amp; sad eyes, he admirably fills the bare feet of America's most famous literary kid. The movie's other child actors - David Holt, Marcia Mae Jones, Ann Gillis &amp; Jackie Moran - give excellent support. (Legend has it that Selznick found young Master Kelly in an orphanage. True or not, this was his best role. Very soon he was playing only bit parts and eventually left films around the age of 25.)<br><br>The cave sequence is especially noteworthy, thanks to the art design of William Cameron Menzies, the flickering camera work of James Wong Howe, and the moody music of Max Steiner. Spooky &amp; claustrophobic, these scenes are the embodiment of every viewer's nightmares, and, thus, are tremendously entertaining.<br><br>It should be noted that while the character of Jim is correctly depicted as a slave, the film itself is blessedly free of the racism that blights so many Hollywood films of the 1930's.","user":"Ron Oliver","rank":[29,34]},{"title":"The Original Boys of Summer","rating":8,"date":"25 May 2007","review":"I suppose that if The Adventures of Tom Sawyer had been made at MGM we would have seen Mickey Rooney as Tom with possibly Freddie Bartholomew as Sid with maybe Judy Garland as Becky Thatcher. But David O. Selznick was out on his own as an independent at this point so he chose to use talented child performers who didn't quite have the name clout that those urchin titans of MGM did.<br><br>But this universally loved story by America's greatest author certainly had a built in market that had no need of name players to sell it. Selznick saved on player's salary and put the money into production values and he and the public came away winners.<br><br>Tommy Kelly, Ann Gillis, and Jackie Moran as Tom Sawyer, Becky Thatcher, and Huckleberry Finn fill just about everyone's conception of what those kids from Hannibal, Missouri in the 1850s were like. They are given able support from such beloved character players as May Robson as Aunt Polly, Walter Brennan as Muff Potter, Victor Jory as the villainous Indian Joe, Olin Howland as the Sunday school teacher, Margaret Hamilton as Mrs. Harper, and Donald Meek as the school superintendent.<br><br>Selznick did a faithful adaption of the novel, the famous fence whitewashing incident is there as well as Tom and Huck getting a glimpse of their own funerals when everyone assumes they've drowned and the climax, the chase with Indian Joe in the cave.<br><br>It's a timeless classic, it can be shown to kids of all ages for centuries.","user":"bkoganbing","rank":[13,14]},{"title":"To be young and in love . . .","rating":14,"date":"14 December 2003","review":"There have been numerous film adaptations of Mark Twain's beloved story, \"The Adventures of Tom Sawyer,\" but few capture the boyish wonder and childlike bliss which permeates the classic yarn. Luckily, 1938 rendition is one of the select few that do. The acting is first class; the directing often innovative, and the whimsical screenplay is respectful of the novel.<br><br>The novel itself is entertainingly superior to Huckleberry Finn in its lack of a political agenda or societal commentary. Its sole objective is to return us once more to the naivety of youth when our life was far simpler and, in many cases, far happier.<br><br>For the older generation of film aficionados, child actor Tommy Kelly was the definitive Tom Sawyer. His winning smile, visible freckles and bright eyes encapsulate the literary character to a tee. After watching this film and re-reading Twain's novel, it is impossible to remove the image of Tommy Kelly from one's mind as he or she remembers Sawyer's antics.<br><br>It is in the supporting characters, however, that this film truly shines. The grade-A performances of Walter Brennan as the likable Muff Potter, a make-up smeared Victory Jory as the menacing Injun Joe and Olin Howlin as the violent schoolmaster are highlights of the film. Brennan seems to infuse a perpetual helplessness in his inebriated character that epitomizes the small town bum of a forgotten America; Jory makes Injun Joe the personification of evil and a red-faced Howlin is superlative as an authoritarian teacher who makes the audience cringe when he canes Tom. Australian-native May Robeson, who portrays Aunt Polly, is able to make smooth, believable transitions from harsh severity to tender leniency as the script demands.<br><br>Remarkably, the numerous child stars in this film were destined for unhappy lives. David Holt (Sid) spent his early life as a child actor in poverty as he, much like Tommy Kelly, waited for star-making film roles which never came. Jackie Moran (Huckleberry Finn) soared briefly higher towards elusive stardom when he was cast as the energetic sidekick of Buster Crabbe in a \"Buck Rogers\" (1939) serial. Immediately afterwards, Moran's career plummeted into oblivion. Perhaps the only exception to this streak of bad luck was Ann Gillis (Becky Thatcher) who found herself always in demand to portray a screen brat. Upon coming of age and legally capable of making her own decisions, Gillis wisely left the film industry to find happiness elsewhere.<br><br>\"The Adventures of Tom Sawyer\" (1938) is also significant in that its talented screenwriter, John V.A. Weaver, died shortly after its release of tuberculosis. His successful but altogether short career included writing screenplays for such cinematic classics as King Vidor's \"The Crowd\" (1928) and \"The Saturday Night Kid\" (1929). In a sense, this film was his last hurrah and it is only fitting that Weaver's last project in his old age should be subtly based upon the universal human longing to be young once again.","user":"flask","rank":[26,31]}]