[{"title":"I love this flick to death - A Wes Craven's underrated classic horror flick!","rating":10,"date":"1 November 2016","review":"Shocker (1989) is a master of horror Wes Craven's underrated excellent horror flick, that I do believe is a classic and I love it to death! It is my third favorite Wes Craven's horror flick. This movie is a memories on my childhood, I grew up watching this movie as a kid. The same thing that was with the Chinese director John Woo by me, I had no idea who was Wes Craven or that it was directed by him. The only movie I memorized by Wes was Scream, which become my favorite film when I was 15 years old, I watched Scream with my mom and even my mom liked Scream. I found out a year later about this film Shocker, but version I had on VHS was extremely horrible lousy picture quality and awful audio. The subtitles were extreme lousy dubbed so I couldn't watch this film. Now recently I got this film on Blu-ray and I really had a blast watching this horror film! <br><br>A Nightmare on Elm Street and New Nightmare are my favorite Wes Craven's horror films that I love to death and Shocker is my third favorite horror film is my number 3 Wes Craven's slasher horror flick, that I love to death! This amazing stylish horror film from the late 80's is about a diabolical mass murderer who harness electricity for unimaginable killing powers. Why I love this film? because Horace Pinker is a bad ass, kick-ass villain! The film simply reminds me on A Nightmare on Elm Street the original flick. Btw I hate horror idiotic icon Michael Myers from Halloween franchise, I hate him and I hate Jason Voorhees the same as Myers, but Horace Pinker could kick both of their assess! I love this film because in any horror film that I remember the main hero of the whole film is a kick ass guy who is likable decent male hero character trough whole film! In every horror film that I remember the main hero is always some stupid girl, but Wes tried something else which it worked.<br><br>You have a great horror, likable characters, a lot's of action, a lot of fantasy in it and a lot of fun. This is Peter Berg's best film in his whole career which is an awesome classic! Nancy Thompson (Heather Langenkamp) from A Nightmare on Elm Street is my favorite number 1 horror icon heroine but Jonathan Parker is my favorite number 1 horror icon which I love him to death.<br><br>I love the music scores from Megadeth and The Dudes of Wrath, I love soundtracks No More Mr. Nice Guy and shocker to death.<br><br>My favorite scene is when Horace Pinker (Mitch Pileggi) posses the body of 9 year old girl and drives an excavator and try's to kill Jonathan which that scene was incredible awesome! Horace posses the body of Lt. Don Parker (Michael Murphy) and hunts down Jonathan (Peter Berg) and shots with a gun on him, missing him and they both fight face off on a tower when they both climbing up and Don Parker kick's him away.<br><br>Ghost Alison Clemens (Camille Cooper) kick's Horace's spirit away from Jonathan.<br><br>Jonathan face's off Horace him self and fight's him off and finally beat's him in his own game, like Nancy did and he survives.<br><br>The cast is very solid in here: Mitch Pileggi gave a solid performance﻿, Peter Berg's best underrated role, Camille Cooper is very underrated and excellent actress in here.<br><br>You also have Ted Raimi in here and Heather Langenkamp in a cameo scene as Horace's Victim.<br><br>Wes Craven did amazing job as script writer and director you have a solid script and awesome dialogue in the film.<br><br>R.I.P. - Wes Craven (1939 - 2015) I really miss you and thank you for all the Freddy movies, thank you for all horror franchise and movies like are: A Nightmare on Elm Street, New Nightmare, Scream, The Serpent and the Rainbow, Shocker and The People Under the Stairs. I love you so much I wish you could done more horror movies I really love them.<br><br>Overall: I love Shocker to death and it is my third favorite Wes Craven's horror film! The rating is a 10/10 for me.<br><br>Shocker (also known as Wes Craven's Shocker) is a 1989 American horror film written and directed by Wes Craven. It stars Michael Murphy, Peter Berg, and Mitch Pileggi as the evil antagonist Horace Pinker <br><br>10/10 Grade: Bad Ass Seal Of Approval Studio: Universal Pictures, Alive Films Starring: Michael Murphy, Peter Berg, Cami Cooper, Mitch Pileggi, Sam Scarber, Richard Brooks, Ted Raimi, Heather Langenkamp, Lindsay Parker, Janne Peters Director: Wes Craven Producers: Warren Chadwick, Wes Craven, Bob Engelman, Peter Foster, Shep Gordon, Barin Kumar, Marianne Maddalena Screenplay: Wes Craven Rated: R Running Time: 1 Hr. 50 Mins. Budget: $5.000.000 Box Office: $16,554,699","user":"ivo-cobra8","rank":[26,29]},{"title":"a good craven film...drags a bit at the end","rating":7,"date":"7 February 2011","review":"This is better than expected. Wes Craven tries to create another boogeyman in the character of Horace Pinker. Pinker is a serial killer who studies voodoo and kills entire families in their sleep. A young college football player named Jon (Peter Berg) develops a psychic link with Pinker. Jon begins an attempt to help the police catch the crazed killer. The first half of the film is realistic and intense, but the second half is based in the supernatural. Pinker gets the electric chair but becomes an evil entity that can transfer from body to body (mush like \"Fallen\" with Denzel Washington) and move through electricity. Once again Jon must use his link to stop the killer. Or is the killer to powerful to be stopped? There is some surprising gore and a pretty nifty plot twist. It's fun to watch a young Peter Berg in an earlier role but the film tend to drag a little. This film came near the end of the slasher craze and Craven was trying to cash in on it one more time. Craven was trying to make a point about televisions and the media, it was evident in the film. Overall, it was a solid and better than average slasher flick with a supernatural killer.","user":"ManBehindTheMask63","rank":[12,13]},{"title":"One of Craven's Most Wanted","rating":8,"date":"20 December 2003","review":"======POSSIBLE SPOILERS AHEAD!!!=====<br><br>During the 80's, Wes Craven put out a couple of films that were either a hit (A Nightmare on Elm Street and Swamp Thing)or a miss (The Serpent And The Rainbow and Invitation To Hell), and some that fall in between (Deadly Friend and Deadly Blessing). \"Shocker\" falls into this area. The premise is pretty good: Horace Pinker (Pileggi)is an EXTREMELY vicious serial killer that has been caught by Jonathan Parker(Berg), who has a strange kind of link to Pinker, and whose family and girlfriend (Cooper)were killed by Pinker. Pinker is executed by electric chair, and that is where the story really comes to life. Seems that Pinker ends up with the ability to jump into bodies (Sort of reminds you of the movie, \"The Hidden.\"), and is after Jonathan. <br><br>Many things are not quite explained, such as Jonathan's psychic ability, and many things are not explored, such as what is behind Pinker's link to Jonathan and why he turned killer(They did for Freddy Krueger!). The film is not really that scary(Not by today's standards, anyway), although it has it's moments. Still worth a look if you want to look at 80's horror or are a Craven fan. Too bad they never made a sequel, although if they did, would Pileggi played Skinner on \"The X Files?\" I guess we'll never know!","user":"domino1003","rank":[15,17]}]