[{"title":"Cult film which needs to be seen more","rating":24,"date":"24 September 2001","review":"De Broca's delightful and surreal anti-war fantasy quickly attained a cult status when it was first released, but in recent years it has dropped more and more out of sight. A shame, because it is a charming film, the whimsical, romantic nature of which is entirely French. Even though the underlying message, that of preferring one kind of insanity to another is a simple, absurdist one, the viewer is still carried along by the Gaullic charm of it all.<br><br>As the much-put-upon martial ornithologist, It's not just because Bates is the only English member of the cast that one is aware of some awkwardness in his casting. For English cinema goers in particular, familiar with his career, his usual jocular masculinity is hard to reconcile with an child-like character, swept along by events. Those who remember Bates and Oliver Reed wrestling nude in 'Women in Love' (1962) from the same period, or his cocky Vic in 'A Kind of Loving' (1962), may bulk at Bates portraying such a confused innocent. Having said that, Bates' actual performance is balanced and restrained, all of a piece with the rest of the cast.<br><br>'King of Hearts' is primarily an ensemble piece. Many of the film's most delightful moments spring from the fancy-filled and flirtatious lunatics who quickly fill the streets, shops and occupations left by the fleeing villagers, their interaction with each other, and Plumpick. This world of fantasy is curtailed by the village walls, which physically as well as mentally encircle their environment. Outside is reality (no matter how ludicrously it is presented), conflict, death. Inside the walls is harmony of sorts, life celebrated. This distinction between outside and inside is made clear in the film. As soon as Plumpick attempts to ride a horse back into the real world for help, the music and the mass accompaniment of him by the inmates has to end until he is obliged to return.<br><br>As the 'King of Hearts' Plumpick is at the center of his motley 'people', as well as of Coquelicot's (Geneviève Bujold) affections. Once he awards himself his name, in a panic and on the run, his 'subjects' call out for him. He is promptly 'crowned' (both by banging his head, inducing his initial confusion, and though acquiring his 'kingship'). He is awarded a bride, and accepted as an unique traveller into the society of the amiably mad. Their acceptance of him anticipates the final scene of the film, when a chastened Plumpick re-admits himself into their company, having rejected the larger insanity of warfare.<br><br>It's fitting in a way that the least successful parts of the film lay outside of the village, where comic stereotypes replace whimsy and the comedy is drawn with much broader strokes. In particular Colonel MacBibenbrook (Adolfo Celi, better known as Emil Largo in 'Thunderball') is uncomfortably close to parody, and his part would have been much better cast with an actor like Trevor Howard who could excel with a line in ironic bombast. The Germans fare no better and, although amusing and lightweight in their capers, one misses the delicacy with which the lunatics are portrayed. One suspects that De Broca associates more with the geniality of the insane, as we all do given the options, and this sympathy is reflected on screen<br><br>Tellingly, the lunatics are not completely oblivious to the hostile world which surrounds them, although they are content to ignore the immediate threat of destruction and Plumpick's warnings. At the end of the film, once the opposing forces have symbolically destroyed themselves, Marcel says:'I'm tired of this game, let's go back to our rooms'. With deliberate sadness, they divest themselves of their play robes and return to their asylum, a divestment scene at the same time quiet, serious and eminently sane. It is clear that they are mad - but not crazy.","user":"FilmFlaneur","rank":[35,35]},{"title":"Subversive Anti-War Fairy Tale","rating":10,"date":"10 November 2005","review":"Perhaps I am biased because the female lead, Genevieve Bujold (Coquelicot / Poppy) reminds me of a young French girl whom I fell in love with, and then lost, 40 years ago - the very same year that I first saw the film (1966 or early 1967). <br><br>But personal memories apart, it is stunning to watch how French director Philippe de Broca managed to fuse hilarious fun and melancholy reflection in a mold that is an incredible mixture. There is fairy tale, commedia dell'arte, circus, slapstick, comedy, romance - and World War I carnage. Among the supporting roles, the cast features some of the foremost French actors of those times; and it is obvious that they enjoyed every bit of it, especially as they put in a number of biting quips along with marvelous cameos.<br><br>This is what happens: For one day Private Charles Plumpick (Alan Bates) becomes, rather against his will, the mock king of a group of lunatics. This motley crowd have escaped from their asylum and have temporarily taken possession of a deserted town in Northern France between the 1918 front lines. Eventually Plumpick owes it to his lunatic friends that he survives when his Scottish battalion and their German counterpart meet in battle. There seems to be no way out of the madness of war. But don't miss the penultimate scene! (Rumour has it that it was censored in the American version at the time...) <br><br>My favorite scene is when young, innocent Coquelicot takes the shortest way from the brothel (well - it's a French film, isn't it?) to the town hall to meet her loved one, the King of Hearts - using two telegraph wires as a tightrope. <br><br>Why the film was a flop in its own country, and why neither a DVD or at least a video tape is available in France, I simply do not understand. Is it because only the French speak French but the Scots speak English and the Germans speak German? (Note de Broca himself, very early in the film, in a 5 second cameo as Private Adolf Hitler!) No need to worry - there are subtitles to help you along. Actually the DVD recently on sale in the USA *is* the original French version! Subtitled, and uncensored, to be sure.<br><br>I cannot deny that the film does have its shortcomings. The story is somewhat inconsistent, there seem to be goofs galore, continuity is lousy. But then it seems that de Broca had to make do with a lousy budget, too. And what he has created is essentially a dream which opposes to the nightmare of war a vision of humanity. In such dreams inconsistency, goofs and lousy continuity do not really matter. So it is still 10 out of 10.","user":"martin-941","rank":[22,22]},{"title":"They don't make them like this anymore","rating":10,"date":"17 November 2004","review":"As I was reading through the comments here for \"King of Hearts\" I noticed two different schools of thought on the film. Many, like myself, have fond memories of seeing this film in the 60s and 70s and were delighted by it. The other comments come from younger viewers who see this film as being \"dated\" and not that funny, yet worthwhile viewing. At first I was a little miffed at this generations comments about a gem of my generation, until it dawned on me that they were somewhat correct. The film is a bit dated because they just do not make films like this anymore. It was never meant to be knee slapping funny. The humor was a non-intrusive \"gentle\" humor that seems to be a foreign concept in this day and age. Another reason many younger viewers do not \"get\" this film is because one of the themes here is non-conformity. This was a crucial concern of those growing up in the 60s. We wanted our individuality to show and not be just a number. Society has did a 180 since then. Today people are more concerned with fitting in than standing out. So yes, this film possibly is a bit dated. It is a bit of movie magic from a far simpler time and I have a feeling that there are a lot of people under 30 who would not see this as dated at all. King of Hearts is one of a small handful of films that celebrates the simple magic of being alive. Come and experience it.","user":"RDenial","rank":[68,75]}]