[{"title":"A blast from the past; Franklin's fun homage to Hitchcock","rating":9,"date":"13 March 2003","review":"FINALLY!  The complete Australian language version of Richard Franklin's gem from 1978!<br><br>An enigmatic young man kills his mother, then somehow winds up in a coma in a private hospital.  Enter the pretty young nurse who discovers Patrick has capabilities no one seems to know about, or want to admit they know about. For those that are thrill seekers, this film is not a fast-paced, action-packed story.  BUT, for those of us that appreciate characters over wild thrills and enjoy careful buildups to a final reveal, this one is nicely done.  There IS a reason it was an initial success and has gained a big cult following; people understood Franklin's intentions.<br><br>Sure, Patrick is not grand \"cinema,\"  but it's a nice mystery/love story with great performances, a keen sense of humour (\"self-referential humour\" as it has been described), and some rather strong adult content &amp; nudity for what was supposed to be a PG-rated film, even in the altered version for American audiences back in 1978.  I first saw it theatrically and was surprised by its content, but appreciated the homages to Hitchcock (which Franklin carefully points out in many scenes on the DVD's commentary track), and Brian May's score has a nice hermann-esque feel (I'm a proud owner of this score on vinyl).  I was only disappointed that it was dubbed with American actors, which dummies down a film -- just take a peek at the dubbed version of Anatomy (aka Anatomie).  Finally seeing this film in the original Australian language version on DVD made me like this film a lot more 25 years later.<br><br>While this film is not extremely original, it still provides enough intrigue for those who look deeper into films that the general public would brush off.  Patrick could be considered an acquired taste, so those who are familiar with it and liked it will find the Elite DVD a very satisfying purchase and a nice surprise to see it in its original form. Others be warned, you might stick with more familiar \"blockbuster hits.\" But realize, when films are pushed as \"the hottest releases,\" you know something might be lacking and that it's processed for mass-friendly consumption.  At least the Australian audiences did accept this film back then, and it won recognition.  I'd like to think I was one of the Americans that understood why they found this film to be so great!","user":"hippiedj","rank":[21,22]},{"title":"Cheaply-made, but stylish and effective.","rating":3,"date":"3 December 2003","review":"I didn't know Aussies were making horror films like this in the late 70s, full of visual imagination and inventive direction.  Aussie horror flicks are rare enough as it is, but genuinely good ones are a rarity, I am sad to say.<br><br>    \tPatrick is one of the rare good ones, and it is a seriously underappreciated film.  The titular character is a young man in a coma, shocked into inactivity by the death of his mother.  He is, according to all medical tests, clinically dead, kept alive only by machines.  The new nurse, however, thinks otherwise.  Is there something going on behind that vacant face?  Something evil? ...and powerful?<br><br>    \tThe first thing that struck me, mere seconds into the film, was the wonderful camera work and direction.  Richard Franklin, who later went on to direct the also-underappreciated Psycho II, did an amazing job.  On the topic of Psycho, it is obvious that he was a fan of Hitchcock - there are many visual tributes to Psycho and other Hitchcock films.<br><br>    \tMade on a shoestring, as all Aussie films are, but especially horror films, it features only the most basic of optical, on-set, and make-up effects, but the way in which the cast takes them seriously lends them far more weight than they would otherwise carry.<br><br>    \tSpeaking of the cast, they are uniformly excellent, especially the sublime and sadly missed Sir Robert Helpmann - more famous for his dancing than his acting, he was never the less a greatly-respected cornerstone of 70s and 80s Australian cinema.  While the rest of the cast are very good, it is Helpmann who really carries the film, exuding class and professionalism even while being flung about on strings and wrestling with a rubber axe.<br><br>    \tPatrick is an effective thriller, which transcends its miniscule budget and makes good on its rather lofty ambitions.  If you don't mind Aussie accents in your cheaply-made supernatural thrillers, I recommend it highly.","user":"DexX","rank":[9,9]},{"title":"An under-rated Aussie chiller.","rating":8,"date":"19 February 2008","review":"Following the success of Brian De Palma's 'Carrie' in 1976, movies featuring psycho-kinetics became all the rage. In 1978, Hollywood cashed in with 'The Fury' (also by De Palma) and the Richard Burton vehicle 'The Medusa Touch'; US TV gave us 'The Initiation of Sarah'; and even Disney got in on the act with 'Return from Witch Mountain'. Meanwhile, in Australia, director Richard Franklin joined in the craze with his creepy, offbeat chiller 'Patrick'.<br><br>Susan Penhaligon stars as Kathy Jacquard, a pretty nurse who discovers that her new comatose patient Patrick (Robert Thompson) is not only capable of communicating via psychokinesis (and the occasional bit of spitting!), but is also able to kill. As Patrick gradually begins to fall for Kathy, any other man hoping to get close to her automatically becomes a target of his awesome mental powers.<br><br>To feature a malign character who spends 99.9% of the film's running time absolutely motionless, staring into space, is an unusual, but very effective idea, and one that director Franklin cleverly uses to crank up the tension: his audience know damn well that Patrick will move at some point in the film, but have absolutely no idea when it will occur (I jumped twice: first, when Patrick unexpectedly spits at his nurse, and... well... you'll definitely know the other moment when it happens).<br><br>There are those who may find the slow-burn approach of this movie a little laborious, but I loved its leisurely approachparticularly as it gave me time to fully appreciate the movie's more bizarre moments: Kathy's job interview, during which the hospital's Matron mentions that such a job attracts certain 'types' (lesbians, scoptophiliacs, necrophiliacs, zoophiliacs and enema specialists!!); two scenes in which frogs don't do so well (one has his brain smushed with a needle and another is eaten by a doctor); Kathy attempting to prove that Patrick can feel by giving him a little 'wrist action'; and repeated appearances by Patrick's 'neighbour', a crazy old man who wets himself.<br><br>7.5 out of 10, rounded up to 8 for IMDb.","user":"BA_Harrison","rank":[18,20]}]