[{"title":"Good standard dumb action movie!!","rating":7,"date":"6 January 2005","review":"This is a middle of the road but enjoyable action comedy. John Badham a veteran of the action genre handles proceedings with flair and paces the movie well. The film hardly lulls despite a someone choppy ending set in a zoo. The film is routine but gets by with the likable leads, Mel Gibson and Goldie Hawn. Gibson was making a name for himself as an action man by this time having already done 3 Mad Max films and 2 Lethal Weapon movies. Gibson's everyman likability and at the same time tough guy physique worked well in these movies, despite wasting his acting ability, with the exception of a great role in Lethal Weapon. At the same time as Gibson evading death by the pursuing dirty lawmen, David Carradine and Bill Duke, Goldie Hawn seems to be in her very own light-hearted Goldie movie about the posh bird who learns there is more to life than money and essentially she is still acting from her previous movie, Overboard. Despite this Hawn is likable and has good chemistry with Gibson. The trademark showing of her ass is once again here and Hawn parades her derrière in her movies even more than Jean-Claude Van Damme. The film also features the gorgeous and future queen of soft core, erotic, B-movies Joan Severance.<br><br>The film has some good action scenes and plenty of on screen carnage and thanks to Badhams brisk direction it engages. The story maybe wafer thin but the film moves by so quickly it is difficult not to enjoy. The chemistry between the two leads more than make up for the clichéd by the numbers performances of the bad guys Carradine and Duke. Carradine is so far from his great performance in Kill Bill 2 that you have to wonder why it takes so much inspiration to coax a performance from the man whose wooden demeanour has led to him being a B-movie staple for nearly 20 years.<br><br>Overall this is enjoyable stuff and typical of the sort of harmless and moronic fun action movies of the 80's. ***","user":"supertom-3","rank":[37,43]},{"title":"fun romantic comedy-chase thriller","rating":9,"date":"12 August 2008","review":"Beats me why so many people want to trash this action-packed screwball romantic comedy-chase thriller. Instead of comparing it to other Mel Gibson and Goldie Hawn films, I compare it to basically similar type films, such as \"What's Up Doc?\", \"Smokey and the Bandit\", \"High Road to China\", \"The Big Steal\"(perhaps the granddaddy of this type of film) and, more recently, some of the Jackie Chan films. The stunts have gotten much wilder and more numerous in recent decades, including in this film. I love both Goldie Hawn and Mel Gibson as actors, and to have them together in this type of film is just great.<br><br>Gibson gets things started with a scary practical joke on his coworker. Goldie, a divorced lawyer, happens to drive into the gas station where Gibson is working and thinks she recognizes her almost husband of 15 years ago. He seemingly convinces her she is mistaken, being embarrassed about the circumstances of his sudden disappearance. Goldie returns in the evening to spy on him from across the street. Apparently, she intended to follow his car home, but instead witnesses a confrontation with 2 men intent on killing him. The assailants accidentally kill his coworker. Gibson manages to burst out of the garage in a car, but it is soon wrecked. He sees Goldie and pleads that she let him in her car, acknowledging that he is who she thinks he is. As the station explodes in a fireball, they drive off in a hail of bullets, with a murder charge soon to be filed against them. They're off to the races! Sound promising?","user":"weezeralfalfa","rank":[31,36]},{"title":"Nice, entertaining","rating":8,"date":"23 July 2007","review":"I don't think this movie is as bad as some comments say, it is not a hit, but it is just the kind of movie I like very much and that IMHO are not being made anymore. It's a classical 90's easy-going action/comedy that won't disappoint anybody, who is not looking for a complicated plot and surprising end :)<br><br>I really enjoyed watching this movie, especially thanks to a beautiful couple made by Mel Gibson and Golide Hawn. It's just one of those movies you can watch over and over again and it sill keeps you entertained (well, the final scene seems a little boring to me...).<br><br>If you are looking for a nice action/comedy, check this one out, you won't be disappointed.","user":"Willy_D","rank":[17,20]}]