[{"title":"Great 'little' movie","rating":10,"date":"30 June 2000","review":"What more could you ask for?  This movie shines with a brilliant line-up of actors playing up the script for all it's worth.  Directed by Roy Ward Baker, VoH oozes with direction and style (see his filmography).  Fans of classic not-too-low-budget horror will appreciate this film, as will anyone with a lust for british films.  And Hammer films.<br><br>To date, this is the ONLY multiple-story film I can watch more than once. Maybe it's the era bleeding through the screen into my brain, bringing me back to a time when cgi didn't exist and movies held their own magic without having super budgets spewed into them.  Maybe it's because Tom Baker, my all-time favourite Doctor, plays a rather scruffy-looking artist with a serious dark side.  Maybe it's the memorable soundtrack, oddly orchestral amid the tumult of intrusive moog soundtracks of the period.<br><br>As mentioned in another review, get the UNCUT version if you can.  If there are kiddies about and you want to frighten them without the (very mild) gore found in most films of today, the edited version will do.  It is near-impossible to find a commercial copy of this film in the states, but maybe Cinemax will run it again late at night?  Please?<br><br>If you see it on a shelf, get it.","user":"dubnut","rank":[35,40]},{"title":"From The Crypt To The Vault","rating":9,"date":"13 September 2008","review":"Five men enter an elevator in a London building. Instead of taking them to the ground floor, it whisks them to a basement, where they become hopelessly trapped. While they wait to be rescued, they pass the time by telling each other their most recent ( and strange ) dreams.<br><br>Rogers ( Daniel Massey ) tracks down his missing sister to a strange town and kills her. She had recently inherited the family fortune, which he wants for himself. But he did not know that she had become a vampire...<br><br>Critchit ( Terry-Thomas ), a man of fastidious habits and with an obsession for neatness, marries the lovely Eleanor ( Glynis Johns ). His constant complaining about her untidiness drives her mad, and he winds up inside his collection of storage jars...<br><br>Sebastian ( Curt Jurgens ) is a professional stage magician. After seeing the Indian Rope Trick for himself, he is impressed sufficiently to want it for his own act and resorts to murder. He now has enough rope to hang himself...<br><br>Maitland ( Michael Craig ) comes up with the perfect insurance scam. He takes a drug designed to simulate a heart attack, and then arranges for a friend ( Edward Judd ) to collect the money, then go the cemetery where he is buried and dig him up. But the unexpected intervention of a pair of medical students causes him to lose his head...<br><br>Moore ( Tom Baker ) is an artist who acquires voodoo powers in Haiti. From now on, anything he paints comes magically to life. Returning to London, he uses this ability to avenge himself on the three art dealers/critics who swindled him out of a fortune...<br><br>One year after the financially successful 'Tales From The Crypt', Amicus were back with more weird tales from the E.C. Comics' back catalogue, all vividly brought to life by a fine British ( apart from Curt Jurgens ) cast. With the likes of Arthur Mullard ( as a gravedigger ), Tommy Godfrey, Robin Nedwell, Geoffrey Davies, and Terry-Thomas around, it is fair to say that this is hardly 'The Exorcist' ( which also opened that year ) though.<br><br>What it is is an entertaining horror picture boasting good stories and nice black comedy touches. The casting of Nedwell and Davies as medical students was in itself a joke, as they were known for their roles as 'Dr.Duncan Waring' and 'Dr.Dick Stuart-Clark' in I.T.V.'s 'Doctor' series. For copyright reasons, they had to be renamed 'Tom' and 'Jerry'! ( why didn't Hanna Barbera kick up a stink about that? ). When Steve Coogan did a spoof of this movie for his 'Dr.Terrible's House Of Horrible' show a few years back, it fell flat because the original was funny to start with.<br><br>Logic occasionally goes out of the window. Why does Maitland so implicitly trust his friend to dig him up out of the grave? Why does Rogers have a meal in a restaurant only a few yards from the spot where he just killed his sister? Why does the air in Moore's safe take so long to run out? Answers on a headstone please.<br><br>The cast are, as one would expect, marvellous. Tom Baker is suitably menacing in one of his last roles before putting on his scarf and hat to become the fourth 'Dr.Who'. Terry-Thomas is hilarious as the ever-so neat and tidy Critchit, a sort of English 'Felix Ungar' from 'The Odd Couple'. Distinguished thesps Denholm Elliott and Terence Alexander are also around. The late Daniel Massey appears opposite his real-life sister Anna, a neat bit of novelty casting Amicus pulled off again in 1975 when 'From Beyond The Grave' teamed Donald Pleasence with daughter Angela. Getting top-draw actors to commit themselves to a few days' filming worked a treat and was preferable ( in my eyes, at least ) to watching talentless teenagers pretending to be scared by a loony in a fright mask. <br><br>'Vault' has for a long time played on television in a cut version, without the scene where Rogers is hung upside down by vampires who then drink his blood through a tap they installed in his neck. That was in the most recent version I saw ( on Film 4 ), although the climax where the trapped men turn into walking corpses still is missing. The ending is never in any real doubt of course. Anyone who saw even one of Amicus' earlier multi-storey horror pictures will be able to predict it well in advance. But if you like your horror slightly refined, and not just consisting of non-stop blood and gore, you should seriously consider opening this particular vault.","user":"ShadeGrenade","rank":[16,18]},{"title":"\"An underrated horror omnibus from Amicus!\"","rating":18,"date":"18 September 2003","review":"An underrated horror omnibus from Amicus, makers of such hits as Dr Terror's House Of Horrors (1965) and Tales From The Crypt (1972).  All the stories (taken from the EC comics by William Gaines and Al Feldstein) are great fun. These feature Daniel Massey who murders real-life sister Anna Massey for her inheritance, only to walk into a restaraunt frequented by vampires-including his sister!  Glynis Johns is driven over the edge by her nagging husband Terry Thomas, whom she kills and dismembers his body neatly putting the body parts into correctly labelled jars.  Michael Craig and Edward Judd are fun as two unloyal friends who plan to fake the death of one of them, claim the insurance money and kill the other.  However, the most accomplished story is left until last.  It's a superb tale about the consequences of Voodoo featuring Tom Baker as an artist who is cheated into believing his work is worthless by three men.  While working in Haiti he visits a witchdoctor who gives him power in that whatever he paints will come true.  He uses this power to get back at the people who have been profiteering behind his back, but this ultimately results in horrifying circumstances!  Often criticised for being a pedestrian production, director Roy Ward Baker's approach to the film is simple but very effective.  The tales are played for laughs but at the same time they all have something to say underneath.  The professional cast does it's stuff and the whole film is well staged.","user":"jamesraeburn2003","rank":[25,30]}]