[{"title":"cultural classic","rating":9,"date":"23 November 2003","review":"Right turn Clyde.  A man, a monkey, some hells angels wannabee's and some dude named Orville.  What more could you want?  Throw in some bare knuckle action of Clint breaking everyones face loose and its a classic. This is without a doubt one of the all time late night classics. The story, (its fluff), revolves around blue collar tough guy Filo Beddo and his buddies.  One of which is Clyde, an orangatan and Orville, a greasey tow tuck driver.  Which is worse is up to you. The gang gets into some bare knuckle boxing fights for cash and heads out on the road.  Running into trouble with a hilarious wannabe biker gang and ending up with a showdown between Tank Murdock and Philo for some sort of tough guy championship. The movie is dated, has some cheasy music, (at least its not disco) lots of fight scenes, some great running gags at bikers, cops, rhinestone cowboys, and generally anyone clint doesnt like, but its very enjoyable and definitely worth a trip to blockbuster.","user":"bustercolon","rank":[43,49]},{"title":"Incredibly underrated","rating":7,"date":"7 January 2000","review":"I know what you're thinking- I'm such a huge Eastwood fan so my opinion isn't that significant. Honestly though, this has got to be one of the most underrated movies of all time. I laughed harder and had a better time watching this movie than just about any \"comedy\" I can think of. Clint did an excellent job in a different role for him as a guy who isn't so clever and great with the ladies. His best friend Clyde turned in an awesome performance as well. I also loved Geoffrey Lewis and the gorgeous Beverly D'Angelo and Ruth Gordon does a typically great act as the tough old lady. I agree with an earlier writer with respect to the one negative here- Sondra Locke's acting and singing. The only justification is that in the movie her character is just as bad. I have to believe that even people that aren't major Clint Eastwood fans would still like this one. Big fans should love it.","user":"Stu-42","rank":[51,61]},{"title":"Tons of fun from start to finish","rating":10,"date":"28 February 2006","review":"I'm currently taking a Clint Eastwood course at UT Austin, and we recently watched this movie.<br><br>And its a bit confusing. I'm not sure what to make of this fun, wacky, and somewhat random movie. Eastwood himself seems to strive and always aims for ambiguity in his work. And it shows here.<br><br>There were a lot of dumb ass critics in the 60's and 70's that liked to bash Eastwood and used the popular buzzword of fascist and labeled him as such. So in response, Eastwood was very particular about what he did afterward and would do things that contradict (in the eyes of critics) his previous work or characters. This of course confused critics and ultimately forced them to look at his work again and see that they were being dumb ass idiots and were just going along with the popular liberal clap trap at the time.<br><br>So we have this movie, in which Eastwood is this hillbilly mechanic and competent street fighter and his adventures with his orangutan (not a monkey Afsheen, they have 12 ribs like us). And its this almost really weird PG comedy. It has these sort of random plots and events that are kind of incorporated into the story and well, not really sure how I can best put it into words, but its just fun. It shows that Eastwood can do this wacky road, comedy.<br><br>But it has some surprisingly dramatic moments as well. The audience is well aware of the Sandra Locke's characters true intentions before Eastwood's Philo. And when he does figure it out, its pretty brutal. And I really bought into that emotional confrontation and Philo's reaction. And then Eastwood throws a fight, and in some ways its bleak. But in other ways it isn't. Philo I think found a little bit about himself and learned who his true friends are, people like Clyde and Orville, and Orville's girl Echo(a young Beverly D'Angelo).<br><br>The character of Tank Murdoch I believe is meant as an allegory to Clint Eastwood and his celebrity status, his celebrity and his star persona. Philo wants to challenge Murdoch and beat him. Murdoch is a guy who everyone knows and has this huge reputation. And then Philo sees Murdoch who's really pretty sad. His friends turn on him and aren't real friends, and he realizes he doesn't want to be Tank Murdoch. And he doesn't want other people gunning for him. So at the end of the movie, it almost feels like it was Eastwood REJECTING his own star persona and choosing to stay in obscurity with his friends. Makes me wonder how Eastwood truly feels about his celebrity status.<br><br>Jeffrey \"The Vile One\" Harris","user":"vileone316-1","rank":[44,58]}]