[{"title":"Cimarron; mean, wild and crazy?","rating":5,"date":"3 May 2011","review":"Cimarron is mostly directed by Anthony Mann and written by Arnold Schulman. It's based on the Edna Ferber novel of the same name and was previously made into a film in 1931. It stars Glenn Ford, Maria Schell, Anne Baxter, Harry Morgan, Russ Tamblyn, Mercedes McCambridge and Lili Darvas. Franz Waxman scores the music and Robert Surtees is the cinematographer. It's a CinemaScope production, filmed in Metrocolor and exterior locations were shot in Arizona.<br><br>--At high noon April 22, 1889, a section of the last unsettled territories in America was to be given free to the first people who claimed it. They came from the North, they came from the South and they came from across the sea. In just one day an entire territory would be settled. A new state would be born.<br><br>They called it Oklahoma--<br><br>With changes from both the novel and the 1931 film, Cimarron 1960 was a big budgeted production. With a huge cast and a running time to match, it was expected to be an epic winner for MGM. It wasn't. For although it has undoubted qualities to please the keen Western fan, it has just too much flab on its belly to let it run free. On the plus side is Surtess location photography and Anthony Mann's ability to stir the blood by way of his action know how. The highlight of the film, and certainly a Western fan's must see sequence, is that of the actual \"land-rush\" that forms the narrative starting point of the film. A stunning collection of crashes, bangs, death and heartbreak are put together by Mann and the heroes that form the stunt team. Sadly the bar is raised so high so early in the film, it's all down hill from there for expectation and actuality. With the last third of the film laborious in the extreme as an ill equipped Maria Schell attempts to carry the dialogue driven heavy load.<br><br>The story is a good one, and Schulman's adaptation doesn't want for trying to reach epic horse opera status. But it's just not a fully formed whole, it comes out as a small group of fine scenes slotted into a gargantuan story of no real distinction. How else can you react to having sat thru two hours of film, to get to the big historical oil strike, to find the film petering out into a series of uninteresting conversations? Much of the problem can maybe be put down to problems off screen? Mann was fired towards the end of production, to be replaced by Charles Walters (High Society), while producer Edmund Grainger himself added scenes in an attempt to clarify the relationship between Yancey (Ford) and Sabra Cravat (Schell). The latter of which was without Mann knowing. This probably accounts for why the final third is so dull. The cast are mostly safe, with Charles McGraw and Aline MacMahon standing out in support slots, the latter of which excels during a graveside scene. But Tamblyn is hopelessly miscast and McCambridge and Baxter are, for different reasons, underused. Waxman scores it as more reflective than sweeping, tho the accompaniment for the \"land-rush\" sequence is boisterous and uplifting, while hats off to the nice costuming by Walter Plunkett; where Baxter, and us the viewers, benefit greatly.<br><br>The great scenes make it a film for Western fans to seek out. But in the context of two of the genre's heroes in Ford and Mann, it's one to easily forget about. 5.5/10","user":"hitchcockthelegend","rank":[11,13]},{"title":"Much Overrated Western","rating":3,"date":"3 June 2009","review":"CIMARRON (1960) was MGM's big Cinemascope/colour remake of RKO's 1930 epic production of Edna Ferber's classic story of the same name. From a screenplay by Arnold Schulman it was, I am loathe to say, unevenly directed by Anthony Mann.<br><br>I am quite astonished - even aghast - that some reviewers on these pages elected to award this film a seven, eight, nine and in some cases a ten star rating? Some even hinted that it is Mann's most underrated western and could be his best work. \"Cimarron\" is nowhere near his best work! His best work is \"El Cid\" (1961) and his best western is \"Winchester 73\" with \"The Naked Spur\" coming a close second. \"Cimarron \" isn't even a good western! Not in the normal sense of what is regarded a good western like \"Shane\", \"The Searchers\" or \"Last Train From Gun Hill\". Even Ford's \"The Sheepman\" is a superior western to \"Cimarron\"! More lighthearted - sure but much more fun to watch!<br><br>The first half of CIMARRON isn't at all bad and contains the best staging of the 1889 Oklahoma land rush ever put on the screen and in widescreen too (though in 1992 Ron Howard made a good fist of it in \"Far &amp; Away\"). But let's face it the second half is relentlessly boring and just drags and drags! Firstly Anne Baxter, who has third billing after the leading lady Maria Schell, is written out of the film which I suppose isn't very noticeable since she didn't have a very important role in the picture anyway. But then Glenn Ford - the star of the movie - is also written out of the picture and only makes a brief and perfunctory reappearance just before the last reel. Then he's up and gone again never to be seen in the movie any more. With its star gone from the film the picture loses much of its balance and never regains the stature it had in the first half. Of course the story is the old chestnut of the mismatched couple who get hitched - she wants to play house and raise a family - while he wants to be charging up San Juan Hill, winning battles wherever they are and never seems to want to come home to his lovely wife. Well, to my mind any man who could leave the stunning Maria Schell - even for a long weekend - isn't playing with a full deck! Hmmm!<br><br>Nope I'm sorry but I really don't think that \"Cimarron\" is all that great a movie! There are some great things in it! Besides the gorgeous Miss Schell there is the fine Cinemascope/Colour cinematography of Robert Surtees, the elaborate score by Franz Waxman (his Anthem like choral Main Title and his recurring main theme throughout plus his frenetic music for the land rush is outstanding) and the land rush itself is wonderfully exciting to see but there is nothing in the turgid second half that can persuade me to give this movie any more than a three star rating. Pity!!","user":"jpdoherty","rank":[42,60]},{"title":"In defense of a much maligned remake","rating":31,"date":"31 May 2002","review":"Sorry but despite the fact that the 1931 version of this novel was the only western film to win an Academy Award for Best Picture it does not compare to the entertainment value of this version. True this is perhaps not the best adaptation of Ms. Ferber's novel, but then how many films are perfect adaptations of their source material. There are wonderful scenes missing from this adaptation, but then there are wonderful scenes missing from the adaptation of GWTW.  No, I am not comparing this to a classic like GWTW.  But the '31 version is not in the same class as GWTW either.  This film should be taken for what it actually is, a good solid epic entertainment with spectacular scenes and good performances. Glenn Ford is perfect casting for Yancy. His performance is far superior to that of the overripe, stilted scenery chewing one delivered by Richard Dix in the original. Ford's boyish manner easily captures the charming immature nature of the character. Maria Schell is on a par with Irene Dunne.  It is a pity her character was rewritten from the novel to be weaker than Ferber intended.  This was obviously done to make the film Ford's but she's still gives a performance that is on the money.  As so do the myriad supporting players in the film. Back in 1960, MGM obviously needed a big movie to move into the theaters that had been playing \"Ben-Hur\" for over a year.  So this production was rushed to completion to fit the bill.  The fact that it was shot in Cinemascope instead of a \"Big\" 70 mm process is evidence of this. It has been written that the production was shut down before the scripted ending could be filmed.  This explains the rather abrupt and somewhat awkward end to the film.  Perhaps a regular non \"Roadshow\" release might have fared better both with the critics and at the box-office. It often seems that those who praise the older version over this film have seldom actually seen the former.  For many years the 1931 version was not available for viewing.  During that period many film historians gushed in their praise of it.  When it finally reappeared on screens most of them found it very creaky and revised their opinions but the older opinions are still in print, available and read.  True, they didn't change their opinion of this version, but the older fell into proper perspective...Cinema History and rather dry history at that.  While this version is not a classic it remains good entertainment.  Compare it to \"How The West Was Won\" made by the same studio just a few years later.","user":"play78rpms","rank":[27,38]}]