[{"title":"Beautiful Film","rating":8,"date":"29 January 2002","review":"\"The object of this massive tribute died as he had always lived, without wealth, without property, without official title or office.  Mahatma Gandhi was not the commander of armies, nor the ruler of vast lands.  He could not boast any scientific achievement or artistic gift.  Yet men, governments, dignitaries from all over the world, have joined hands today to pay homage to the little brown man in the loin cloth, who led his country to freedom.\"<br><br>This quote is from the funeral scene in the 1982 film \"Gandhi\".  Richard Attenborough directed this massive epic about the man that freed India. The film opens with Gandhi's assassination.  The next scene, his funeral, is one of the greatest scenes in cinematic history. Attenborough managed to recreate Gandhi's funeral on January 31st, 1981, the 33rd anniversary of the actual funeral.  It is estimated that nearly 400,000 people were on hand to be a part of the filming the recreation. This film was made before CGI (computer generated images), so the funeral scene is probably the last live action crowd of that magnitude that will ever be filmed.<br><br>\nMahatma Gandhi's message of non-violent resistance is delivered in an interesting and enthralling body of art.  This film has made and will make millions of people aware of the little brown man that took on the British Empire and won.  \"Gandhi\" serves both as entertainment and an important historical record of one of the most important figures in history.<br><br>\nBen Kingsley played Gandhi.  He was the perfect for the role.  He resembled the real Gandhi.  He was young enough to portray Gandhi as a young man. He is a British actor that nailed the British influenced Indian accent.   He is a wonderful actor that was patient and humble with such an important part. And he was a relatively unknown actor at the time, so the \"big-time actor\" persona did not get in the way of viewing the film.  He did win both the Academy Award and Golden Globe for best actor, for this role, which I agree he deserved.  He became Gandhi.<br><br>The cinematography was outstanding.  Attenborough filmed \"Gandhi\" on location in India.  The scenes of India are spectacular, and India is very much another character in the film.  This film is as much about India itself as it is about Gandhi.  Attenborough shows the audience the people of India from its countryside to the vast city of Calcutta.  It is suggested by Kingsley, on the DVD, that Attenborough had a difficult time with the elite class in India at the time of filming.  They were against the making of such a film by an Englishman.  Undeterred by their negative thinking, he persevered to enlist thousands of Indians to help make this film.  Every crowd scene, he used real Indians from the area. Attenborough also won both the Academy Award and Golden Globe for best direction.<br><br>This movie is a must see for everyone.  It should be required viewing in high schools, as part of History class.  The fight against prejudice will forever be relevant.  It is also a beautiful work of art.  This movie is not tainted by the embellishment of Hollywood (see \"Pearl Harbor\" for that). Of course, it would have been hard to screw up a movie about such a great man. 10/10","user":"Rod-88","rank":[210,247]},{"title":"Took nearly twenty years to make - not a single minute was wasted","rating":9,"date":"24 December 2001","review":"Here indeed is one of the great films of the 20th Century about one of the greatest men of the 20th Century. Ben Kingsley's interpretation of the Mahatma must go down in history as one of the most perfect cinema rôles ever carried out. Throughout the long film you forget you are watching an actor playing the part of a great man in history: you are watching the real Gandhi. A gigantic performance indeed. Richard Attenborough's patient and perfect directing added all the superlatives possible to make a crowning achievement, transporting  biographic films into another dimension.<br><br>It is all there: from the most intimate and poignant portrait to the incredible crowd scenes, beautifully captured in the most painstaking photography. You do not just watch the scenes unfold  you live them, you feel them, so captivating they are; and Ravi Shankar's music tugs at you, spellbinds you, forces you into sympathy, admiration and so many other feelings. <br><br>Enthralling: how such a cinematographic work of art can reach such proportions is truly amazing; this film is nothing less than a miracle. During 1971 I travelled a good bit around India; I constantly had to apologise to energetic Indians who approached me on the subject of the British Raj. I had not even been born. But as a young and unappointed ambassador, I felt it my duty to bow my head in that country which is a microcosm of the whole planet. Thanks to this film, `Gandhi', Attenborough and Kingsley have said just about all there was to say.<br><br>&lt; For men may come and men may go, but Gandhi goes on forever &gt;","user":"khatcher-2","rank":[138,162]},{"title":"A great epic; Kingsley's best performance","rating":5,"date":"5 December 1999","review":"As soon as I finished watching Gandhi, I thought to myself \"This movie had to have won Best Picture.\" I think it's one of the best epics of all time. It masterfully tells one of the most important stories of the 20th century, that of India's struggle to free itself, spearheaded by one of the most extraordinary men of all time, Mahatma Gandhi. I would be hard pressed to name anything lacking about it. Direction, cinematography, costumes, they're all great. And Ben Kingsley! Without a doubt his portrayal of Gandhi is one of the best performances of his career, if not THE best. Playing the pacifist Indian lawyer-turned-leader couldn't have been an easy task, and I don't think anyone could have pulled it off as well as he did. This movie deserves all the praise anyone gives it and more. Excellent.","user":"The movie man","rank":[161,198]}]