[{"title":"A classic even after 30 years","rating":10,"date":"15 August 2003","review":"This was Eddie Robinson's 101st film and his last, and he died of cancer nine days after shooting was complete. All of which makes his key scene in the movie all the more poignant.<br><br>Although some of the hair and clothing styles are a bit dated (also note the video game shown in the film), but the subject of the film is pretty much timeless.  Heston said he had wanted to make the film for some time because he really believed in the dangers of overpopulation.<br><br>Several things make this film a classic. The story is solid.<br><br>The acting is top-notch, especially the interplay between Heston and Robinson, with nice performances also by Cotten and Peters.<br><br>The music is absolutely perfect. The medley of Beethoven, Grieg, and Tchaikovsky combined with the pastoral visual elements make for some truly moving scenes. This was the icing on the cake for the film.<br><br>And the theme (or the \"point\") of the film is a significant one. Yes, it's a film about overpopulation, but on a more important note it's a cautionary tale about what can go wrong with Man's stewardship of Earth. It's in the subtext that you find the real message of the film. Pay attention to what Sol says about the \"old days\" of the past (which is our present), and note how Thorn is incapable of comprehending what Sol is saying.<br><br>This film is one of my top sci-fi films of all time.","user":"Loadmaster","rank":[199,234]},{"title":"The 1970s was another mighty fine decade for science-fiction.","rating":8,"date":"20 February 2017","review":"Nowadays, it's easy to suspect governments and big corporations of just about any nefarious doings. And there's a sinister plot afoot here to deal with an Earth of a future year (2022, just five years away in reality), where the \"greenhouse effect\" and over population have turned the planet into a portrait of Hell. For example, the opening text tells us that there are 40,000,000 people in NYC alone. A hard-driving NYPD detective, Thorn (Charlton Heston), stumbles onto something big when he investigates the murder of Simonson (Joseph Cotten), a corporation bigwig.<br><br>Partly because this movie has been in the public consciousness for so long, it's hard to imagine many people not knowing what the story's big reveal is. You of course won't hear it from this viewer, but it's not hard to figure out. Still, the plot constructed by novelist Harry Harrison (originally titled \"Make Room! Make Room!\") is intriguing enough to pull you in, and keep you entertained. It might not be quite meaty or involved enough for some \"tastes\", mind you. Part of Thorn discovering the big secret involves our wrongdoers not seeming to go to great lengths to keep it hidden.<br><br>One of the most impressive marvels is the use of extras, as MGM and director Richard Fleischer (of the classic Disney adaptation of \"20,000 Leagues Under the Sea\") give us an amazing depiction of overcrowding. For instance, every day, on his way to work, Thorn has to clamber over dozens of bodies filling the corridors and stairways of his run down building. Excellent use is made of classical music, both pre-existing and new stuff composed by Fred Myrow (\"Phantasm\").<br><br>The cast is full of reliable, familiar actors: Chuck Connors, Brock Peters, Paula Kelly, Stephen Young, Mike Henry, Lincoln Kilpatrick, Roy Jenson, Leonard Stone, Whit Bissell, Celia Lovsky, Dick Van Patten. Leigh Taylor-Young is beautiful and endearing as Shirl, a young woman living in a future where a young woman can be referred to as \"furniture\" and simply come with an apartment. Heston is solid as usual, but \"Soylent Green\" really belongs to the wonderful Edward G. Robinson, around 80 years old at the time and making his 101st feature film appearance. Sadly, it would turn out to be his last, making his final scenes even more poignant and powerful.<br><br>This is definitely striking entertainment, even more when one considers the ending.<br><br>Eight out of 10.","user":"Hey_Sweden","rank":[21,22]},{"title":"a true classic","rating":30,"date":"30 September 2004","review":"I saw this movie shortly after it first came out - when I was a kid. The scene that sticks with me to this day is when the scoops come to break up the riot. The cop says, \"The supply of Soylent Green has been exhausted. The scoops are on the way.\" Then the front-end loader trucks come and scoop the people up like so much garbage. The fact that 2022 looks like 1973 is entirely plausible because society has gone retrograde. Charlton Heston's performance is beautifully nuanced and believable. Edward G. Robinson is unforgettable as Sol. References to this movie pop up in shows like \"The Simpsons\" and \"Millennium\" for the simple reason that it is a visionary look at the future with real heart - a true classic.","user":"aurorastudios","rank":[138,172]}]