[{"title":"This movie is timeless","rating":23,"date":"23 April 2004","review":"Maurice' had a deep emotional impact on me when I first saw it in my early teens, more than ten years ago. I just saw it again for the first time since then and I was a bit worried that I would be disappointed, but then I was definitely not. It still had the same magic.<br><br>To me, this is the #1 Merchant-Ivory work. I find this movie astoundingly profound compared to several other of their movies. This movie is above all accomplished by the excellent acting. It tells a pure and convincing story about struggling to be true to oneself in a world of not only prejudice and firm standards but even serious legal sanctions. <br><br>I think Maurice' is far more romantic, and sexy, than most heterosexual love stories I have seen. The love and longing of these men seems so real and pure, especially by the fact that they are consistently being told that their inclination is `unspeakable', and their futures and careers are at stake.<br><br>It is great to see Hugh Grant in an early role (his first real movie role?) that is so different from the mainstream comedy entertainer he has become. The ending is stunning. I love that the movie ended exactly where it did, although it is a dread to acknowledge that the war would break out soon after. The music score is enthralling. And Alec Scudder is so beautiful that it hurts.","user":"goldilocks_78","rank":[130,136]},{"title":"Fabulous, Beautiful and Romantic","rating":10,"date":"13 December 2003","review":"The filmmakers did an incredible job of bringing E.M. Forster's touching novel to life -- and I suspect that was no easy task because so much of the novel involves the main character's innermost thoughts and feelings. However, Merchant and Ivory did a beautiful job conveying the loneliness, fear and desperation of the main character, Maurice Hall.<br><br>\nThe movie follows Maurice (James Wilby) down his road of self-discovery; from his embarrassing teen years to Cambridge (where he gets his first exhilarating taste of love) to his post-collegiate years as a young man struggling to come to terms with his sexuality in a time when homosexuals were mercilessly persecuted.<br><br>The movie is also very much about class struggle. Maurice is a gentleman born and bred, with a penchant for snobbery. As he comes to terms with his sexuality, he is forced to deal with differences in class when he realizes he is in love with someone from the serving class.<br><br>Readers of the novel will be delighted as much of the wonderful dialogue from the book appears in the film.<br><br>The characters were perfectly cast, with Hugh Grant (before he was a mega star) as Clive Durham, the perfect young gentleman from Cambridge (and Maurice's first love), Rupert Graves as the smoldering, lower class hunk who wins Maurice's heart, and Ben Kingsley in a hilarious turn as Maurice's junk-psychologist. James Wilby was spot-on in the title role and he perfectly captures the isolation, sadness and ultimate joy of the conflicted Maurice.<br><br>\"Maurice\" is a touching love story that anyone -- straight or gay -- can enjoy. Romance knows neither of these terms. And, the movie *is* unabashedly romantic and optimistic -- your heart will soar when Maurice finally gives in, casts societal conventions aside and visits his beloved at the boathouse. The hopeful ending is inspiring, though the close-up of Clive at the window at the end of the movie will break your heart.<br><br>\nBeautifully filmed, superbly acted -- a must-see film.","user":"ttugreeklady","rank":[102,107]},{"title":"On Scudder and Maurice's future","rating":10,"date":"27 October 2006","review":"I'd like to add my two cents' worth of speculation about what the impact of class differences would have been on Alec and Maurice as a couple.<br><br>Maurice is middle class, not upper class, as Clive's mother makes clear when Maurice offers her his hand at their first meeting. The gaffe is surprising, because even here in America it was a rule that a man never offered his hand to a woman unless she extended hers first. Maurice seems not to know this, for he extends his hand to Clive's mother even though she has not offered hers. We see a flash of surprise on her face as she tepidly accepts and shakes his hand. It's funny, and a little painful, if you understand what's happening.<br><br>That little bit of business shows us that the gulf between upper class Clive and middle class Maurice is every bit as wide as that between Maurice and working class Alec. If we take it as a matter of fact that Maurice could survive in Clive's world--and we see him doing so--why should we be any less willing to admit that Alec could survive in Maurice's?<br><br>We shouldn't. Maurice expects Clive to treat him as an equal just as Alec expects Maurice to treat him as an equal. In fact, Alec demonstrates repeatedly that he IS Maurice's equal, and he even tells Maurice so to his face. After they've \"shared\" Alec drops some of his deference to Maurice (but not entirely, after all, some of it is just automatic from habit), but he talks to him as an equal: \"Ordering me about again--you would!\" and \"My people wouldn't take to you either, and I wouldn't blame them\" and, most effectively, \"What does your engagement matter?\"<br><br>And, too, a lot of what might be thought of as their class difference is perhaps more about the differences in their environments. Alec is a country boy and Maurice is a suburban/urban boy. These are lifestyles that are very different but they are lifestyles that can become familiar, even comfortable, with exposure.<br><br>Alec would make the relationship work. Alec has initiative (he climbs in the window and stays), and determination (he goes to London). We need to remember that when we express apprehension about the happy couple's future.<br><br>Overall I had the impression that Alec would be a quick study, adapting easily to whatever joint lifestyle he chooses for them. After all, Alec will be the boss of the relationship, as made apparent when he delivers what is probably THE most romantic line in all of gay cinema, \"Now we shan't never be parted. It's finished.\"<br><br>I too think they would have emigrated, to Canada or the U.S., or anyplace where the differences in their accents would not be so obvious. They would live someplace where they would be perceived as two Englishmen, rather than as two different kinds of Englishmen.<br><br>After a couple years, Alec's eye would wander, and he would stray. But he'd be sure to be home every night with Maurice, snug as bugs in a rug.","user":"ekeby","rank":[53,55]}]