[{"title":"oh mary","rating":11,"date":"11 October 2000","review":"Actually I am surprised at the lack of comments on this one. I rented this late one night after eyeing the video box for months. I hesitated because I had never heard of the director/cast w/ the exception of the late John Carradine. I was more than happy with this picture. Mary has more than her share of nudity violence and gore. The paintings are weird. Some of the editing is ahead of it's time. I highly recommend this picture to anyone looking for cool low budget horror.","user":"gardner-3","rank":[11,15]},{"title":"All About Cristina Ferrare","rating":7,"date":"1 January 2013","review":"More exploitation than horror, MARY, MARY, BLOODY MARY is a visual treat. Not only because the leading lady, Cristina Ferrare, is downright gorgeous but the Mexico location offers an abundance of locales providing eclectic situations to keep the viewer interested and entertained, and the characters always have something to do, and somewhere to go.<br><br>From beaches to highways, villas and art galleries, here's a low-budget flick that, despite an abundance of wooden acting, will keep you in entranced during every single frame.<br><br>Mary is a surreal artist about to enjoy a show displaying her strange artwork. When not painting, she hangs around with a handsome drifter, who becomes the only person she doesn't sink her teeth into Actually, that's the one thing that separates this from all other vampire flicks. Mary doesn't use her teeth (and her teeth aren't fangs): Instead she stealthily carries a finger-sized dagger that she stabs her victims with and devouring them of blood.<br><br>After a few kills, including a fisherman and in one delectable scene, a bisexual female art collector, the police begin to catch on – each corpse is not only bled from the neck and sucked dry but were drugged beforehand, using the same chemical.<br><br>But Mary's not the only killer on the road John Carradine plays a mysterious masked man that travels around leaving his own bodies behind, including a sexy hitchhiker. He's also after Mary, who becomes more of a heroine after this new darker menace is introduced. She's now more vulnerable as she falls deeper in love with her boyfriend, who doesn't know her dark secret.<br><br>After a car chase replete with a 1970's slick soundtrack (think STARSKY AND HUTCH meets a game show theme), there's a showdown along a rolling hillside where John Carradine reveals his true identity and battles our heroine in a prolonged wrestling match he has a knife and she her own wits resulting in a fitfully bloody finale that includes her one true love being put to the test.<br><br>The direction is creative, relying on a stockpile of the usual close-ups and zooms from this era, and the pacing is suspenseful. Although the love scenes with Mary and her pretty boy boyfriend drag; you'll wish she'd either take off to find more victims or turn him into lunch.<br><br>Not scary in the conventional sense, MARY is more creepy and sadistic. And fans of vampire flicks will have to put some rules aside. Other than the non-biting technique, this particular sexy vamp roams the daylight hours. In fact that's where most of the bloodletting takes place, so you can see Cristina Ferrare even better! For More Reviews: www.cultfilmfreaks.com","user":"cultfilmfreaksdotcom","rank":[3,3]},{"title":"Best late night rental ever","rating":10,"date":"10 November 2004","review":"Of all the films that my buddy and i rented (back in our high school days) for our late night horror movie marathons, this one stands out as the most memorable.<br><br>To this day we still discuss the bath scene, the chase-scene set to bongo music where the characters run in entirely opposite directions yet meet each other, and the classic (and i mean CLASSIC) scene where the two main characters are walking along the beach, and a bunch of mexicans can be seen kicking the hell out of a SHARK in the background..<br><br>Was it a fake shark? Was it real? What the heck was it doing there?<br><br>Who knows...But it WAS there.. My friend and i rewound and watched it about 27 times.<br><br>Mysteriously, after we rented this film, it disappeared from our videostore.. I had been worried that we had dreamt the whole thing.. Nice to know there are others who have seen it!","user":"drew_atreides","rank":[13,20]}]