[{"title":"Self Indulgent Brat","rating":4,"date":"21 April 2009","review":"William Richert directed and wrote the novel as a youngster on which A Night In The Life Of Jimmy Reardon is based. Sad to say he failed to capture whatever charm there was in the book for his lead character. As River Phoenix plays him, Jimmy is spoiled, hedonistic, self-indulgent, and a liar. Maybe he should have gone into politics.<br><br>Richert wrote the book in the Sixties and that's where the film is set, a rich suburb of Chicago. Phoenix as Jimmy Reardon is spoiled kid who has sex more on his mind than anything else, not atypical for someone his age. He's a chick magnet even when he's not trying.<br><br>What this one wants to do is somehow get an airline ticket to Hawaii where he believes he can be a beachcomber and live off tourists. His father, Paul Koslo, wants him to go to school or get a job, the nerve of the man. So Phoenix hatches this scheme to somehow get enough money in the next 24 hours to fly to Hawaii or its either, the street, a job, or school. That is if the women can leave him alone, which apparently they can't.<br><br>Including one cougar who is deliciously played by Ann Magnuson, she's the best thing in the film.<br><br>River Phoenix's fans usually consider this one of, if not the worst film of his short career. I'm inclined to agree with them. River is certainly sexy enough in this film, but he's so incredibly dislikeable in this part.","user":"bkoganbing","rank":[16,24]},{"title":"Sad that most people doesn't understand most of it...","rating":7,"date":"31 May 2002","review":"I miss movies like these. strong and poetic writing with intense narration by Phoenix. the story is at the same time simple but influent and memorable to our common lives of all days.<br><br>the scene when Phoenix rides the car through the alleys and talking about cigars is hardly forgotten.<br><br>we all, not even for once, have lived like this, we all have been a teen like this, we all have had our small and big frustrations like these, and we all have had surprises... ...and there's always a new day to come.<br><br>;)RIC","user":"rictome","rank":[19,31]},{"title":"Netflix should make this a tv show!!!","rating":10,"date":"7 April 2018","review":"Phoenix plays a character you love to hate. Incredible movie. Incredible ending. Comes full circle. 10/10! I recommend.","user":"iman-adem","rank":[7,10]}]