[{"title":"the sins of the fathers...","rating":9,"date":"17 December 2006","review":"The Third Generation is anything but an accessible film. It's story is relatively simple - a group of rather middle-class young radicals set off bombs, hold up banks and kidnap an industrialist, whilst a police net closes in around them. There is a traitor in their midst, and little do these bumbling terrorists know that the person holding the purse strings for their organisation is the rich industrialist himself, who has begun the film by pontificating how the lack of terrorist activities in Germany makes it difficult for he and his political friends to move Authoritarian measures into place. A topical film then. What is striking about it is Fassbinder's extraordinary approach to both narrative - made up of stark, elliptical scenes veering between polemic, realism and surrealism - and mis-en-scene. Most of the sets are domestic interiors, and these are filmed from such odd angles, and lit with a strange plasticity, so that the environments become as much characters in the film as the human figures. One scene, a long and fairly talky piece in which the cell go over their plans and review their situation, is filmed with such choreographic virtuosity that it takes the breath away - a single long pan around the room catches snatches of dialogue and interaction, as the characters themselves crisscross the screen, rising or sitting as the camera moves onto them, each piece of the conversation picking up as its speakers encounter the screen. It must have taken a great deal of minute rehearsal and a perfectly mathematical mind to carry off this exceptional sequence, which is truly bravura.<br><br>The film looks and sounds like no other. Besides the weird visual quality of the interiors, the soundtrack has a constant backing of TV speak, mood music, a strange din which is always competing for the viewer's attention against what is being said by the characters on the screen. This has a two-fold purpose: it both emphasises the way in which these people encounter a world mediated by broadcasters; and also does the Brechtian trick of emphasising the phoniness of the cloak-and-dagger noir/spy thriller situations the film places its characters in. These are emphatically people caught in someone else's plot, or in their own, it's hard to tell.<br><br>The Third Generation is scabrous about the bourgeois values of the industrialist and his associates (these values are condemned as the same values the Nazis cherished - hard work, obedience to authority, family life) and about the terrorists, who are bunglers, dreamers, chaotic buffoons whose \"war\" against the bourgeoisie is merely a carnival arranged by the elite class to promote itself. The terrorists, for all their bravado and antics, are pretty good for nothing, and trapped in a paradigm of male domination of the female, as if being a male chauvinist pig were a radical, anti-bourgeois move. Fassbinder's view of then contemporary Germany was bleak - it was a country being punished for the sins of the fathers \"even unto the third generation\". I doubt whether, if Fassbinder were alive and turning his vision on our present situation, he would consider that those sins had been expiated yet.","user":"jaibo","rank":[37,37]},{"title":"The World as Will and Idea...","rating":9,"date":"28 September 2008","review":"Along with In A Year of 13 Moons, this is the only other Fassbinder film on which the director/writer/producer also served as director of photography. Like that film it features bold striking compositions and rich colours that are perfectly saturated and stylized to the right amount. The Third Generation was made in 1979 two years after the German Autumn, the crackdown of the Baader-Meinhof gang. Despite it's topicality however Fassbinder's film is about the future about the world of tomorrow as exemplified by it's evocation of science-fiction masterpieces like Solaris mentioned and cited in this film, the casting of the star of Alphaville, Eddie Constantine as the head of a computer business organization and the constant presence of technology in this film, either off-screen(speakers and recording equipment) or on-screen(TV screens and later guns and bombs). The score by Peer Raben is appropriately electronic.<br><br>The story of The Third Generation is hard to summarize or describe and most people won't understand one bit of this film when they see it for the first time. See it twice and thrice and then it adds up. The story is just as fragmented as the personalities and lives of it's characters. The terrorist cell at the center of the film is a group of mostly middle-class misfits and apathetic junkies who are a mass of unresolved tensions and contradictions. Bulle Ogier's a stern history teacher(crucially introduced to us discussing the 1848 revolution in Prussia) but she's also a would-be feminist who submits to becoming a sex toy of Paul the \"leader\" of the group. Hanna Schygulla is your average bubbly corporate secretary but she's also carrying out a sado-masochistic affair with her father-in-law. Most of these \"terrorists\" activities for the first half are relegated to living in an apartment of a drug addicted young girl, later joined by her former boyfriend and his friend. Their activities here are confined to juvenile games and irritating each other out of their skulls later extended to breaking-and-entering and bank robbery. The sole murder committed by them is revenge acted out by a submissive over the dominant.<br><br>The actions of the police, the business interests, the government bureaucracy however is that of self-justification, of ruthless exercise of power and repression whose machinery ultimately incorporates these terrorists willingly and unwillingly.<br><br>The relation of this film to our current-day hell-hole needs little elaboration. This is a film for the 21st Century, the children of the third generation, one just as compromised and confused as it's forebears.","user":"artihcus022","rank":[23,24]},{"title":"Undeserving of neglect","rating":27,"date":"27 July 2000","review":"I saw this film when it first came out, so I apologize if my recollections are a bit vague after so many years.<br><br>This film reflected Fassbinder's increasing alienation from violent German leftist grouplets such as the Red Army Faction (a.k.a. Baader-Meinhoff Gang) with which he had earlier (e.g. in \"Deutschland im Herbst\") shown some sympathy. Still, the film also contains its own stark critique of capitalism: in a plot somewhat reminiscent of the McCarthyist-Communist conspiracy of \"The Manchurian Candidate\", the \"third generation\" terrorist organization of the title turns out to be backed by a wealthy industrialist who backs terror in order to create the danger that will help him sell his security systems.<br><br>The film's middle-class protagonists turn to terrorism as an escape from their boring lives. And they have no idea who is financing their terrorist spree. At first it's a lark. Then they discover (surprise!) that those who live by the sword... well, you know the rest.<br><br>All that makes the film sound very heavy and serious. Actually, it's a very dark comedy. And the sequence near the end, wonderful. A vivid memory 20 years after I saw it.","user":"jmabel","rank":[24,27]}]