[{"title":"A Masterpiece of German Expressionism","rating":10,"date":"1 April 2004","review":"Made in 1919, \"The Cabinet of Doctor Caligari\" was literally years ahead of its time and remains a triumphant accomplishment in the genre of German Expressionism. Remembered mainly for its stunning sets, which featured crooked buildings and twisted landscapes, \"Cabinet\" also boasts one of the first attempts at a twist ending, something quite new and shocking for its time.<br><br>Told mainly from the point of view of Francis, a young man who lives in the small village of Holstenwall, Germany, \"Cabinet\" tells the tale of murder and madness which seems to accompany the arrival of a carnival. Francis and his best friend Alan go to the carnival and are presented with the sideshow attraction Cesare the Somnambulist, a gaunt and hideous young man who spends his life sleeping in a coffin-like cabinet and seems able to predict the future when awake. Cesare (played by a young Conrad Veidt, who later went on to play the evil Nazi general in Casablanca) informs Alan that he will soon die, and indeed, Alan is found murdered the next morning. Suspicion turns to the eerie somnambulist and his strange keeper, a man called Caligari. As Francis desperately tries to solve the mystery and find his friends killer, it seems that the beautiful young Jane, beloved by both Alan and Francis, has been targeted as the next victim.<br><br>This is a genuinely creepy film which delves deep into the mysteries of the abnormal mind...an uncomfortable journey to say the least. Everyone is suspect and, in the end, we must ask ourselves: \"who is really the mad one here?\" <br><br>Subtle and ingenious, we see the world the way an insane person might see it; warped and confused, a nightmarish terrain where nothing makes sense and balance is not to be found. <br><br>The impact of this film is still being felt and seen today, and for good reason. It is a shocking, disturbing masterpiece. I cannot recommend it highly enough.","user":"Gafke","rank":[137,147]},{"title":"Discovering Silent Film...","rating":27,"date":"27 March 2002","review":"It struck me last night that I've never seen a serious silent film. Everyone's seen a silent comedy: Charlie Chaplin, Buster Keaton, the Keystone Cops... They've all been immortalized in the minds of every film viewer, and I enjoy them as much as anyone. But it seems a strange and almost disrespectful lack to never have seen anything but comedy; so many silent films were created, and the only ones I've seen starred waddling tramps.<br><br>It was partially for that reason that I rented this movie. I had read about it on a film review site (the name of which escapes my memory) and decided it was worth the half-hour drive to the video store. The basic premise is that of a man relating a story that happened to him and his friends - their unnerving discovery of a crazed mountebank, Dr. Caligari, and his prophetic sleepwalker. It follows a series of murders and growing madness, keeping you in constant suspense and confusion until the very last scene.<br><br>There's a period of adjustment when watching it - unfortunately necessary for a modern audience. The titles seem too slow. The camera seems to hold on scenes too long. The makeup on the actors' faces seem ghostly and horrible - even on the hero.<br><br>But before long, the movie has you in its grip. You spend time staring at the architecture - buildings, doors, and windows that would have been funny in a Dr. Seuss book. In the film, they make you uneasy. The whole atmosphere is of a world gone wrong; like a dream worthy of Salvador Dalí. Nothing is square or straight. The buildings loom in on you; windows sweep upward, slanted or curved; doors are obscenely angled holes beckoning you to enter and be trapped inside.<br><br>Throughout, the story defies expectations. Small plot twists confuse and mislead you until the final surprise, completely tearing down everything you thought the movie was about. Strange shadows and shots from inside alleys paint the film's world as something terrible, never allowing you a normal look at the village, never allowing you to enjoy the quaintness of it. Through it all, the grinning, hunched figure of Dr. Caligari hangs in your mind, pushing out rational thought.<br><br>The movie is well worth your time; there's a certain pleasure in trying to capture the feeling of terror an early audience, unaccustomed to the visual effects we see every day, would have had the first time they saw this movie. It's an intellectual terror in the grand old style, giving you the same thrill you get from reading Frankenstein or Dr. Jekyll and Mr. Hyde. At the risk of sounding cliché: two thumbs up!","user":"ninepence","rank":[144,159]},{"title":"Caligari: A creepy, distorted gem of the silent era...","rating":10,"date":"4 April 2000","review":"Like so many of the films from the silent era, The Cabinet of Dr. Caligari gets overlooked (if you can even find it!) for big budget duds, and runny romantic comedies. Directors of the period like Griffith, Lang, Eisenstien, and Caligari's Wiene, are never given the credit they deserve. And if credit is given, it is in small cultish circles in various pockets around the world.<br><br>The set design here is amazing, not a single right angle can be found in any one of the sets. This may not only apply to the disjointed and distorted characters in the film, but also the state of Germany at the time. After all, the film was made in the dark ages in Germany between WWI and WWII. This point is validated by Siegfried Kracauer, with his notion of how the main character of Dr. Caligari can be easily interpreted to Hitler, and vice versa. Both controlled subjects with a form of \"brainwashing\", both were upset with current forms of society and government, and both were masters of deception. In a period where Germans were looking for direction, and let's face it, authority as well, Dr. Caligari embodied it fully.<br><br>In the area of the players, all the names in the film turn out a literally \"speechless\" performance. Dagover, Krauß, and especially Veidt as Cesare (pronounced Chez-a-ray) are excellent in the use of gestures and motion to get their point across without using words. The camera, stationary as in most early features, uses the mise-en-scene effectively, letting us identify with characters such as Francis and Jane, and disjointing us from Caligari, and the Criminal.<br><br>The use of lines and stripes, not only in the sets but in small places like in the good doctor's hair and on his gloves, adds to the telling of the character. Colour tints of the B&amp;W film also play a special part in bringing the whole film together. An amazing sequence where Caligari reveals his true madness, pits Caligari stumbling through the unequal streets of Germany while being haunted by textual ramblings written in the air. A marvelous achievement for it's time. And it adds so much.<br><br>The Cabinet Of Dr. Caligari has changed the way I look at horror films, and even films in general. I urge anyone reading this to pick up this film. The DVD offering is utterly fantastic with the restored print, an audio essay of the film, and production notes. Bypass the overblown \"motion picture events of the year\", and pick up Caligari, quite possible the greatest motion picture event in the history of motion pictures.","user":"clurge-2","rank":[75,84]}]