[{"title":"Insider info about the Monster Sound FX","rating":7,"date":"12 February 2008","review":"My Father,Jeffery Sandler, was Supervising Sound Editor on this film when I was just a boy of 11 years. He took me to work quite often, and during post production on The Boogens, he got stumped as to how the monster should sound. Well he comes to me and asks if I have any ideas? And I played around with sounds that scared me and I came with the following:<br><br>Breathing: Vampire Breathing<br><br>Heartbeat: Heartbeat sound sped up and slowed down repeatedly<br><br>Monster Roar: Dog&amp;Cat Fight,slowed down,played backward<br><br>That roar was the most horrific thing you ever heard. We set up the sound rig in a hallway intersection in the building(Glenn Glenn Sound)and put speakers at the end of each hall. We turned out the lights so we had dark down all of the hallways(like being in a mine)and played the sound from random directions....even though we know we were alone in the building,Me,My Dad,and a co-worker of his,none of us wanted to walk down into the dark to turn on the light alone. We were all scared out of our minds. Well, my Dad used the sound fx I came up with and gave me $50 for my work. And that was my start in the movie business at age 11.","user":"thedeadguy-1","rank":[44,50]},{"title":"Surprisingly Good, Deserving Of A Higher Rating","rating":7,"date":"1 March 2010","review":"An old mining town in the American West harbors a deadly, 70-year secret, one that is about to be awakened when its silver mine is re-opened.<br><br>'The Boogens' is a largely-forgotten classic B-grade horror film with a title that suggests monsters emerging from people's noses and inflicting green, slimy terror. Thankfully, that idea is light years wide of the mark, the film instead occupying the 'monsters beneath the ground' category, predating the silliness of the more well-known 'Tremors' franchise by 9 years. In fact, though its modus operandi is principally just to provide shivers for 95 minutes, it's actually quite well-executed and has more to offer than at first might seem apparent. The script treats its audience with some intelligence by avoiding gratuitous blood-splattering early on, instead allowing the story and the menace to develop at a meaningful pace. This in turn allows us time to get to know the principal characters, who are fairly well-drawn and likable, thanks to the naturalistic performances of Fred McCarren, Rebecca Balding, Anne-Marie Martin and Jeff Harlan - as opposed to the performance of Jon Lormer, who gives his best 'mad loon' acting as the crazed local who knows what's happening but isn't very forthcoming with the details. Of course, the cynic might argue that keeping the monsters of the piece out of the limelight for as long as possible is more to do with the limitations of the practical effects budget, and it's true that once they do appear, they don't stand up to 21st Century scrutiny. However director James L. Conway, who would go on to work on a number of high-profile shows (Star Trek fans should be familiar with his efforts), knows how to make the best of limited resources and accentuating the production's strengths, for example, drawing rising tension from good lighting and suggestions of menace just beyond vision with well-placed camera angles and good cutting - which is probably just another way of saying that you see the characters more than the monsters, but this leads to a good build up of suspense, and that when something nasty happens to one of the leads, it makes an impact. These are the hallmarks of a decent film and they elevate 'The Boogens' as far as I'm concerned to greater heights - doubtless also the reason why Stephen King gave it the thumbs up upon its release.<br><br>The film is also helped by some very good choices for location backdrops, from the sleepy mountain town featured (Park City, Utah, according to the end credits) to the presumably authentic mine entrance. The sense of isolation is helped by the rolling hills and coating of snow to make it clear that civilisation, and therefore help when the Boogens hit the fan, is far distant. The musical score provided by Bob Summers is fairly unmemorable, but it fits the bill, boosting tension where appropriate. Finally, special note has to be made of the dog who played Tiger the poodle, the mischievous pet of one of the leads. Between the obvious talents this dog had to respond on cue to verbal and visual stimulus and the committed efforts off-screen to get him to do so, Tiger is very much a character in his own right, practically stealing the show - and not in a cheesy Disney way, either.<br><br>'The Boogens' was for me a pleasant surprise, very much surpassing my expectations, given that it could so easily have been an unintelligent exploitation gorefest. Genre fans should definitely check it out, possibly fogging up their lenses a little when the Boogens hit centre-stage.","user":"Muldwych","rank":[11,12]},{"title":"A fun romp with an eighties classic horror!","rating":10,"date":"21 January 1999","review":"This was the first horror film my parents ever took me to in a movie theater.  I was only 11 yrs old when I first watched this film, and I remained mentally scarred for many years to follow.  (I couldn't enter the garage by myself without first looking under our car to check for teeth and tentacles).  This is certainly a silly movie by today's horror standards, but scary enough to give any child nightmares for awhile.  Come on folks and watch it with your kids!","user":"pablo-28","rank":[20,24]}]