[{"title":"Still Very Relevant","rating":9,"date":"23 June 2004","review":"Caution-possible spoilers ahead.. Just watched 'Joe' for the second time. The first time was 30+ years ago on an Air Force Base. I was reminded of that by the Air Force overcoat with Tech. Sgt. stripes wore by the boyfriend/dealer; we airmen had quite a laugh the first time that appeared on the screen because that is a 'lifer' rank. Over the years I have carried several other images from the film. Foremost was the absolutely beautiful and vulnerable daughter of the executive. As someone else commented, you could not take you eyes off her. I did not realize until now that this was a 20-year old Susan Sarandon in her first movie. What a loss that she did not do more movies when she looked like that. I also recall the irony of having a counterculture hero like Peter Boyle playing the title role of a right-wing gun nut. Not unlike George C. Scott playing generals in Dr. Strangelove and Patton. And of course the shocking ending made a lasting impression.<br><br>30+ years ago it was the most talked about movie that ever played on the base. We thought it was a great film then and I have been reluctant to see it again because I was afraid that it would be as disappointingly dated as Easy Rider. But watching it today I was amazed at how well the film has held up. It is a very strong script with few holes although you have to wonder about the boyfriend immediately getting out of the bathtub when Sarandon gets in with him.<br><br>Searching for an explanation of why this film is still so entertaining I have to think it has something to do with the perfect physical casting. Boyle was physically believable as Joe (as others have pointed out his portrayal would inspire the Archie Bunker character a few 'years later). Did Ted Knight model his 'Caddyshack' character-Judge Smails after the Dennis Patrick's advertising executive in 'Joe'? They look alike and sound alike. Patrick was totally believable as the wrapped-too-tight upper middle class executive. And Sarandon's doe-eyed innocent with the Raggety Ann doll still evokes a protective response from all male viewers-perfect casting. <br><br>The nude and drug scenes actually hold up (they were very provocative for their day) and are as explicit as anything to be found in 'Thirteen'. About the only thing that dates this film is that the violence is not realistic or graphic. 'Joe' was about the same time as 'The Wild Bunch', and the tone of movie violence had a just begun to change. <br><br>Another reason this film holds up is that events in the past couple of years have brought back the relevancy of the theme and context of this film. In the film both types of 'conservatives' are portrayed as full of fear and hate toward the unconventional ways of the counterculture; and filled with envy at their free and hedonistic lifestyle. The counterculture is portrayed as mocking the straight culture; and although paranoid toward conservatives (legitimately so given that this was just a couple months after Kent State) they cannot resist flaunting their lifestyle in an attempt to antagonize. The political landscape is not all that different 30+ years later. I'm not sure conservatives envy young people and liberals as much as 1970, but they fear and hate them more.<br><br>An excellent film that surprisingly is as relevant now as it was in the early 1970's.","user":"aimless-46","rank":[54,63]},{"title":"Some people shouldn't try to cross paths; unfortunately, they do.","rating":7,"date":"26 June 2005","review":"\"Joe\" is one of those movies where, although you think that it might go along smoothly, ends up hitting you like...I can't come up with an analogy. It showed not only that America's long-standing idea of unity was moot, but also the various aspects within our society. Melissa Compton (Susan Sarandon) is the ultimate flower child, while her father Bill (Dennis Patrick) is a clean-cut executive. One day, Bill accidentally kills Melissa's boyfriend. In the immediate aftermath, Bill gets acquainted with Joe Curran (Peter Boyle), an ultra-right-wing, rabidly racist working stiff. As a result, the two of them end up associating more and more with the hippies, whom Bill finds unpleasant and Joe outright hates. But in the end, everything has dead serious consequences.<br><br>True, some parts of the movie are a little bit dated, but it's a good juxtaposition of America's two sides during the Vietnam War. And rest assured, the residual effects of all that will probably never go away.","user":"lee_eisenberg","rank":[29,33]},{"title":"A stunning portrait of unbridled hatred.","rating":8,"date":"20 July 2013","review":"The 1970 classic \"Joe\" owes a lot to the performances of its leading actors, especially Peter Boyle in his star-making turn in the title role. Joe is a blue collar bigot; he's actually pretty democratic about it, as he seems to hate all those who are \"different\" equally. He makes the acquaintance of Bill Compton (Dennis Patrick), a well-off advertising executive who's just accidentally killed the drug pushing boyfriend (Patrick McDermott) of his young daughter Melissa (Susan Sarandon, in her film debut). Joe figures out that Bill is a killer, but even armed with this knowledge, he doesn't exactly blackmail Bill. Rather, he thinks he's found a kindred spirit, somebody who despises hippies as much as he does. The result is an uneasy sort of relationship that forms the crux of the movie, as it develops. Bill isn't as angry a man as Joe, but he does find him to be an interesting individual.<br><br>The way that a few separate worlds, and worldviews, collide, makes for good entertainment in this effort from screenwriter Norman Wexler and director John G. Avildsen. The generation gap provides further conflict, and seeing Joe and Bill eventually immerse themselves in the hippie universe is no less than fascinating. (The two of them do so as a means of searching for Melissa, who's run away.) They try to prove to each other how well they can adapt to this kind of lifestyle, including taking hits from a bong. Naturally, it isn't long before Joe is reminded of just how much he loathes hippies when he and Bill are robbed, and he spurs the increasingly distressed Bill on to a violent revenge - and a devastating conclusion.<br><br>Described in many reviews here as an even more volatile version of Archie Bunker, Boyles' Joe is a true force of nature, and the actor is so good in the role that he basically makes the movie. The other actors (such as Audrey Caire as Bills' wife and K. Callan as Joes' wife) are fine, and Boyle and Patrick do work well together.<br><br>A film very much of its time, \"Joe\" is a well paced drama that is definitely worth a viewing. It's likely to stick in peoples' minds after it's over.<br><br>Eight out of 10.","user":"Hey_Sweden","rank":[10,10]}]