[{"title":"Come For The Pretty, Stay For The Witty","rating":8,"date":"19 July 2004","review":"This was my introduction to the world of Jacques Tati...and I liked it. If Tati's filmmaking M.O. was to remind us of Charlie Chaplin &amp; Buster Keaton, mission very successfully accomplished. 'Mon Oncle' could have been a silent film. It uses sound effects and music to tell 75% of the story anyway, just as Charlie and Buster and their contemporaries did so well in the talk-free era. He also has their simplicity of camera movement. And as with those film giants, Tati is the star/director/producer and co-writer of this project. His recurring Monsieur Hulot character isn't as famous as the Little Tramp, but the quirky Frenchman is just as bumbling and likable.<br><br>In line with Chaplin's 'Modern Times', the theme of 'Mon Oncle' is the inability of one man to adapt to new technology. The slapstick sequences that result from the clash of man versus machine are more amusing than truly hilarious. There are a few big laughs, but you'll smile more than than you'll guffaw. There's no standard plot. Hulot's sister, her husband, and their son live in an ultra-modern '50s house. (This weird set is truly magnificent.) Occasionally, they have trendy guests---the out-of-place Hulot among them---and he inadvertently gets the ball of chaos rolling. If his sister's house is too bizarre for him, he still gets to enjoy old-fashioned pleasures in other areas of France. He doesn't fit in with these social climbers, but the man is charming and unflappable in his own eccentric way.<br><br>This movie looks as stunning as Hitchcock's 'Vertigo' (also released in '58). Both pictures use colour extraordinarily well (especially green) and Tati's film would be worth seeing for the visuals alone. He also makes it a delightful aural experience with a jaunty music score and comical sound design. It's not all a cold technical exercise, though. The acting is a bit exaggerated (except for Tati's underplaying), but they only look foolish in the name of laughs. Will you enjoy a French comedy from nearly 50 years ago? Is 'Mon Oncle' just a critical darling (Oscar for Foreign Language Film, a prize at Cannes) and not an audience picture? Hey, I didn't think I'd be entertained by a two-hour French trifle, but I was. Rent the Criterion DVD and drink in the plush visuals, then have some grins. Come for the pretty, stay for the witty.","user":"flickershows","rank":[57,64]},{"title":"There's so much more to this movie that I never noticed","rating":10,"date":"24 July 2001","review":"When you see Mon Oncle for the first time, you'll be charmed, catch some of the bigger jokes, maybe catch the film's major theme, and you'll walk away with a pleasant experience. Given its masterpiece status, you may very well be wondering what makes that so (confer my posts further down the page for my initial and secondary reactions). On the second viewing, you will probably notice some of the smaller jokes, discern major motifs, and ultimately see it as a better film. The THIRD time, you may notice just how meticulously this film was crafted. In wonderment, you will gaze at the screen, your eyes glancing every which way trying to find the tiniest of jokes. And there are some jokes that are tiny, believe me.<br><br>The first time I saw this film, I gave it an 8/10, the second time a 9/10, and the third time a 10/10. I actually wept when Hulot said goodbye to his neighbors. Boy, I cannot wait to watch it a fourth time, and a fifth. I hope Playtime and M. Hulot's Holiday are as good as this utter cinematic masterpiece.","user":"zetes","rank":[72,87]},{"title":"My brief review of the film","rating":18,"date":"18 October 2005","review":"A superior sequel to 'Mr. Hulot's Holiday', it has a more solid story, funnier jokes and some things to say about the coldness of modern technology this time round. The humour does not rely on the dialogue, as there is hardly any, but it does not rely on physical humour either. Instead, the puns come from the way in which Tati sets up the shots. The mathematical precision of certain sequences, and the way that the actors are positioned within the frame, are what is amusing. The jokes are much more subtle, not hand-delivered, and therefore there should be more that can be picked up on multiple viewings. One of the funniest scenes gives a building two moving eyes, thanks to a clever set design and great lighting. The art direction is simply excellent, the music is wonderful, and the timing for every shot is just superb. Not everything is brilliant though. The continuity is a bit off at times, no thanks to some awkward jump cutting, and towards the end the jokes become a bit repetitive and tiresome. There is also little plot, but there is certainly a satisfactory amount of storyline, it being an original take on the fish-out-of-water plot line. The supporting characters are silly, but they actually benefit the film here. Characters such as the neighbour show just how out-of-touch some persons are in the technology crazed world. This film may not be for every taste, but I simply found it delightful stuff myself.","user":"sol-","rank":[32,37]}]