[{"title":"Convincing thriller","rating":13,"date":"13 March 2002","review":"Sadly neglected 70's thriller shot on location in Oslo, Norway. Sean Connery looks great as \"Scandinavian Security Chief\" Nils Tahlvik, and director Caspar Wrede has made some great use of Oslo scenery including a West Side residential area, Oslo's City Hall and Fornebu International Airport (which closed down in 1998). It's also nice to see one of Norway's greatest stage actors, Knut Wigert, as Connery's commanding officer.<br><br>All though slow-moving at times this gritty looking thriller has a nice realistic flair to it, including some surprising plot twists along the way.<br><br>One final note: from a Norwegian point-of-view it's fun to see how much this British production has the look and feel of a 70's Norwegian film!<br><br>Update/comment on Mike's user comment with the headline \"Boring Swedish hijacking action\": I don't know where he gets all this \"Swedish\"-stuff as the movie is mainly shot on location in Norway, it has Norwegian actors in some of the supporting roles (most notably Knut Wigert and Alf Malland) and not one Swedish actor, and as IMDb states it is a British production. Sweden had nothing to do with it.","user":"Renaldo Matlin","rank":[33,38]},{"title":"fine 1970s thriller with GREAT Jerry Goldsmith score","rating":10,"date":"3 June 2007","review":"I cannot believe the negative comments I am reading here. This is a complex, atmospheric and well-acted thriller, which fully captures the 1970s atmosphere of European terrorism, fashion and mannerisms.<br><br>The photography is stunning of the Norwegian snowbound landscapes, and Sean Connery gives one of his best performances.<br><br>And to cap it all there is a great - and I mean GREAT score by Jerry Goldsmith, one of this best.<br><br>Check the scene of the plane chase through the mountains, also the stylish montage of scenes involving London being struck by terrorism in the opening credits and the way the photofit of the terrorist leader gradually appears.<br><br>Goldsmith's score is so good, it is worth watching for that alone!","user":"mombasa_pete","rank":[31,38]},{"title":"Hostage situation","rating":6,"date":"15 September 2006","review":"The main reason for watching this thriller on the Fox cable channel was the cast. Not having a clue as to whether this movie was ever distributed in this country, but the allure of actors like Sean Connery and Ian McShane in its cast, proved to be the deciding factor for watching this 1975 British production directed by Finnish director Caspar Wrede. The film had the title \"The Terrorists\", in the version we watched.<br><br>After a series of bombs are detonated in London, we are taken to Oslo, where a group of terrorists have kidnapped the British ambassador to that country. The masked individuals demands are passed to the local security forces. Nils Tahlvik, the negotiator wants to put his own plan of action in place. There is a conflict with a British agent who wants to give in to the kidnappers' demands, something that Tahlvik doesn't want to do.<br><br>In the meantime, a commercial airliner, about to land at Oslo's old Fornebu airport is taken over by a group of hijackers. The captain takes a chance by making the tires of the plane blow up as they land. All attempts to surprise the kidnappers on board fail. As preparations begin to bring the ambassador and the men holding him to the aircraft, that by now has been fixed for an unknown flight, the police tries, unsuccessfully to send security forces masquerading as the criminals, but everything fails until the end when Tahlvik himself boards the aircraft and a surprise, that has been kept from us, is revealed.<br><br>The screen play by Paul Wheeler is confusing, at best. We don't have a clear picture of what is really going on, that is complicated by the ending in which that surprise comes out of nowhere regarding one of the hijackers and the duplicity of someone in the negotiating team.<br><br>Sean Connery is not at his best in the film. We get to see Mr. Connery as he looked at that time before any cosmetic enhancements, especially his teeth, which went through quite a change after this film was done. Ian McShane makes an interesting appearance as the evil Ray Petrie, who is in charge of the hijacking team on board the plane. Isabel Dean, has a good moment as the British ambassador's wife pleading with Tahlvik.<br><br>While the film is by no means horrible, it could have been probably better with another film treatment and a action director. The best thing in the movie is Sven Nykvist cinematography, which unfortunately doesn't quite show in its splendor because of the faded quality of the copy that was shown.","user":"jotix100","rank":[20,24]}]