[{"title":"A rarity among family-oriented films...","rating":8,"date":"12 February 2005","review":"There have been many films that claim they can entertain audiences of all ages. Indeed, this seems to be the most profitable kind of film to make, with the family-oriented often translating to the lowest common denominator. There is a rare kind of film in this oversaturated market, however. Namely, the film that claims it can entertain an audience in almost any age bracket, and really can deliver on this promise. I know how this sounds, so bear with me a moment.<br><br>Short Circuit is, at heart, a comedy about what happens when a robot designed to replace a special forces soldier is struck by lightning, and starts to believe he is a living entity. Much of the rest of the film revolves around either Number 5's attempts to evade capture by the people who made him, or his attempts to convince the people he meets of the truly wonderful thing that has happened to him. Ally Sheedy and Steve Guttenberg provide an excellent support cast that does a first rate job of interacting with the character. This was one of the first films to show human actors engaging in conversation with what was essentially a full-scale puppet, and it remains one of the best. With brilliant voice acting by Tim Blaney, Number 5 seems more human than some of the other actors in the film, especially G.W. Bailey. They must have had a special on Police Academy alumni that year.<br><br>Speaking of Police Academy, the \"let's rip the front seats out and sit in the back\" joke gets a couple of references here. In fact, a few old classics get a good reference in this effort. Interestingly enough, the Three Stooges short that is shown and imitated in a couple of sequences is called Woman Haters. Go figure. The one weakness of the film is that it seems primarily constructed around a few puppeteering or special effects sequences. The use of the laser beams here seems very dated by modern standards, and the computers would look unbelievable if I hadn't personally seen the computers that were available to the public and business around this year.<br><br>Sadly, they do not make films like this anymore. In this day and age, where every film has to be made as expensively as possible, and even films aimed at children seem segmented, nobody seems willing to consider that the adults in the audience might need to be entertained, too. Which is a real pity. Films like Short Circuit have the ability to appeal to this viewer even more now that he is twenty-something years old than was the case when he was eight years old. I doubt that anyone who turns twenty-six in 2020 is going to same the same about the Pokemon or other such mind-numbing single-digit-age-only crap that is being churned out.<br><br>I gave Short Circuit an eight out of ten. It is starting to show its age, but as a relic of the mid-1980s, it also shows that there were people asking questions about the advancement of technology. Indeed, on the basis of films like Short Circuit, I am almost willing to regard the 1980s as the last bastion of creativity in the mainstream film industry. Give it a look expecting a film about more than money, and you may be pleasantly surprised.","user":"mentalcritic","rank":[77,84]},{"title":"Underrated","rating":9,"date":"25 July 2005","review":"I'm sorry, I can't see why this film has been given such a low rating. This film is wonderfully life-affirming through the character of robot Jonny 5 (the scene where he realises what it means to be alive through crushing a grass hopper is beautifully portrayed), Ally Sheedy brings a bucket load of positive energy to the character of the naive but loving Stephanie, and to top it all there is a subtle but powerful comment on American militarism. There is a real emphasis on quality screen writing here which only comes through on a small ratio of films. The characters could easily have become 2 dimensional stereotypes, but instead given some interesting dialogue and motives (science, military etc). Yes it is cheesy, and I think many people label it as a cheap and tacky 80's movie, but having watched it again recently I think history may well judge it a minor classic.","user":"simonperera2000","rank":[106,118]},{"title":"A sweet and genuine comedy","rating":7,"date":"17 September 2000","review":"I think anyone any age can appreciate this film, and some might even find it funny.  Not terribly funny, but just good.  The plot involves a robot (#5) who after getting electricuted, becomes malfunctioned, in a good way (the robot thinks it's alive).  And some light hearted comedy (and some messages about life) ensues.  Nice to watch on a weekend day.  A-","user":"Quinoa1984","rank":[29,31]}]