[{"title":"Hilarious, surreal satire of a high society soiree gone terribly wrong...","rating":2,"date":"2 March 1999","review":"After an evening at the opera in Mexico City, a group of high society friends meet at the house of their hosts, Nobilé and his wife, to dine and spend the evening indulging in \"sophisticated\" conversation and whatever else such folks do at their parties. They stay later and later and eventually it's the next day, but no one has left. By that evening, they're all still in the salon, no one has left and no one will leave: they're trapped! All the have to do is walk out the door, but no one wants to be the first to leave.<br><br>As time goes on, one gravely ill guest dies, they run out of food, and eventually their genteel façade deteriorates and they become, as the Spanish title suggests, \"shipwrecked\", in their house on Providence St., losing all track of time. The subtitles typically leave out a lot of the Spanish dialog. Listen for the Voice of Reason, el Doctor, who's always saying \"calmanse todos\" (\"everyone be calm\") whenever there's a confrontation. Also listen for the electric shaver at odd times, much to the irritation of one of the guests.<br><br>I came across this crazy film in the summer of '86 after having purchased my first VCR. I soon found myself watching it twice daily and read all the books I could find on both the film and its director, Luis Buñuel. I found a lot of good information along with some glaring errors regarding the film, to which I attribute the possibility that the authors probably did not have access to a videotape copy of the movie and were thus unable to view it many times over.<br><br>That being said, I've been able to gather that the movie is primarily Buñuel's impression of \"high society\" parties that seem to go on forever (as he stated himself in several interviews). Much is made of the various repetitions in the film, and he stated that in some cases he'd actually witnessed the same people being introduced to each other several times throughout an evening, as is seen in the film itself.<br><br>Beyond that, I get the clear impression that a lot of this film is essential a joke in the sense that Buñuel throws in a lot of stuff just to confound the viewer and make himself laugh. When the women talk of seeing eagles when relieving themselves in large vases in a closet, this is in reality taken from a time in Buñuel's youth when he'd visit relatives in the mountains. Their outhouses extended over cliffs and it was indeed possible to see eagles, etc., flying underneath (poor birds!).<br><br>Then there are Buñuel's favorite targets like the upper class and classical music, including condutors and cellos. The dialog is rich in non-sequitors and ironic responses that are all the more hilarious when translated from Spanish. One great example is when Nobilé responds to his wife after she's noticed a guest has removed his coat (gasp!), \"let us remove our coats as well, to attenuate the incorrectness\".<br><br>I've watched a fair amount of Buñuel's films, and this is by far my favorite. There are others that are better in their technical acheivement, e.g. \"The Discreet Charm of the Bourgeousie\", but this, and its contemporary, \"Simon of the Desert\", are as good as he gets in my book.<br><br>I've been searching for a copy of the screenplay in Spanish.<br><br>\"We don't want answers, we want to get out of here!\"","user":"JohnnyCNote","rank":[53,67]},{"title":"An excellent surrealist fantasy","rating":8,"date":"31 October 2005","review":"I can't say that I'm a big fan of director Luis Buñuel. While I admire his visual flair - his movies often lack backbone, and this brings them down. The Exterminating Angel is the first Buñuel movie that I've really enjoyed. I enjoyed it because I never got the impression that the point of this film was simply to be weird. Buñuel has found a premise - basically, a satire on the behaviour of the upper class - and lampooned it brilliantly. The key to this movie is setting up the central plot, and the director does such a good job of it that after a while; we don't care that the film is based on an idea that makes no sense at all, and are just able to run with it. The film follows a bunch of guests at a dinner party. At the end of the party, none of them make any effort to go home and after a while it becomes apparent to the party that they physically cannot leave the room. We then watch as the upper class, people who are used to sipping champagne and smoking expensive cigars are reduced to surviving in the most basic ways. They have to hack through the wall to find a water pipe and even begin eating paper to quench their hunger <br><br>The satire works because the acting is just so different to the way that the upper class usually conduct themselves - either on screen or otherwise. The structure of the social classes is clearly defined by Buñuel's film also. This is the sort of thing that would really scare the rich, while other social classes have other things to worry about. Before the nightmare begins, various people are commenting on the conduct of one of their own who has had slightly too much to drink. This wouldn't worry anyone who isn't 'high society', but the fact that these people do care about it shows the difference in values between the classes. Buñuel directs the film with almost a complete lack of emotion towards the central ensemble - and this stood out to me as it really allows the film to be funny. It's almost like the director is laughing at the situation that he's put his cast of characters into, which suggests that the Spanish director isn't the biggest fan of the upper classes. There's a million and one ways that this film could be interpreted, and that is what makes it great. If you don't like films that don't make sense; this probably won't do much for you. However, I think that this is one of those films that need to be experienced; and I definitely recommend it.","user":"The_Void","rank":[70,95]},{"title":"An explanation? There is none.","rating":8,"date":"23 October 2003","review":"That was what Luis Bunuel used to answer when asked about the meaning of one of his least accessible works.Much less linear than \"Viridiana\" -featuring the same actress Silvia Pinal-which precedes it,\"El Angel exterminador\" can be looked upon as an allegory.We find a lot of permanent features of the Bunuel canon in it though.<br><br>The fact that the guests cannot leave the luxury house will find an equivalent in \"le charme discret de la bourgeoisie\"(1972) when the five characters cannot have a good meal at the restaurant;the guests turning like lions in a cage echo to this strange picture of the five heroes of \"charme discret\" walking on an endless road.<br><br>This is the kind of movie that will have as many interpretations as there are users writing about it.And Bunuel would probably be the first to say that anyone is allowed to see his movie as he feels it in his soul -which is a word he would not certainly approve of though.<br><br>Another put-down of the bourgeoisie ,probably;As Charlie Chaplin would not have let an ice-cream fall on a poor woman's dress,Bunuel's wholesale massacre concerns the rich,the well-to-do.The house may be a metaphor for their world which they want to keep exactly as it is.But Bunuel soon scratches the varnish and after long hours,his powerful bourgeois are just men and rather hateful selfish cowards -the scene when they rush to get a glass of water.And as they cannot rely on themselves and on their pals,the only assistance can only come from above:so they promise God they will chant Te Deums, they will go to Lourdes and buy a washable rubber Virgin (sic).Surrealist pictures,which had been absent since \"cela s'appelle l'aurore\" (1955) come back for a while during one night,and they mainly deal with religion and heaven.The mystery of the night hours will come back in \"le fantôme de la liberté\" (1974)<br><br>The last pictures bring the missing link :the army ,shooting people (talking about a revolution?) ,as the bourgeois keep on singing(?) and praying(?)in the cathedral.<br><br>Recommended?Everything Bunuel did is crying to be watched.","user":"dbdumonteil","rank":[74,102]}]