[{"title":"Early 80's Slasher Makes the Grade","rating":7,"date":"7 December 2011","review":"Anne Barron (Meb Boden) is a teacher's aide at the Jack-N-Jill Daycare Center in Boston. It's the early evening and the last child has been picked up by her mother. Anne is relaxing on the playground carousel when someone pulls up on a motorcycle, wearing a pink helmet. Anne is startled. Suddenly the stranger pulls out a machete and starts spinning the carousel. The machete is held up in the air and the terrified woman goes around and around - until she's struck with it.<br><br>Judd Austin (Leonard Mann) is the cop assigned to the case. He is called to the scene and when he gets there, he sees a gruesome sight. The girl was decapitated and her head was put in a bucket of water nearby. The distraught director of the center tells the officer that Anne worked there during the day - and was attending night classes at Wendell College. At the hospital, Judd and his partner Taj (Joseph R. Sicari) discuss a similar case from the previous week. Another girl was found decapitated and her head was dumped in a pond. They wonder if there's any connection between the two murders.<br><br>\"Night School\" is a typical run-of-the-mill early 80's whodunit slasher with a decapitation twist. This is the kind of movie where half of the money is trying to figure out where the detectives are going to find the missing heads. The twist ending is pretty predictable and the acting is a bit wooden (Rachel Ward, in her film debut, is all sorts of terrible here) but the film is never boring and has been directed with style. Boston looks positively wretched on film here and it gives the slasher a bit of a grungy \"Departed\" vibe. Overall, it's definitely worth checking out, just check your expectations-and your head--at the door.","user":"slasherstudios","rank":[13,13]},{"title":"Excellent American giallo","rating":9,"date":"12 March 2017","review":"Night School is an excellent, stylish American giallo with terrific set pieces and great use of Boston locations.<br><br>Several coeds are being murdered with their severed heads found in submerged in water and the detectives believe a sleazy professor is behind it. Add in a jealous lover, a predatory lesbian headmistress, and a whole lot of slashing and we have ourselves a grand ol' time.<br><br>Night School might just be a perfect mix of sleaze and class. It's hard to believe the same man made Chitty Chitty Bang Bang. Brad Fidel's spooky, somber score sets the mood perfectly and helps it stand out among the pack.","user":"carolinephillips-47427","rank":[11,12]},{"title":"Rachel Ward's Bottom in American giallo","rating":7,"date":"5 April 2012","review":"An excellent slasher/whodunnit you might not have heard about.Brutal killings,attractive women.attractive men,big knife,Freudian Symbolism,shower scene and red herrings.Even a surprise ending,although one that is a bit out of place especially compared to the rest of the movie.It's all there.So how come Night School isn't a more popular title? Your guess is as good as mine. But it could be that it has to do with the relatively late release on DVD. The pacing is a little uneven at times which does hurt the tension slightly. And the ending could be considered unsatisfying.It's one you will see coming and at the same time not at all. Very inventive I have to say although like I said earlier a bit out of tune with the movie overall. Honestly,I had fun watching since it does most things right.And to see Rachel Ward's bottom in all it's glory can't be that bad,now is it?","user":"chrichtonsworld","rank":[10,11]}]