[{"title":"A 1964 hidden goodie - to a point","rating":6,"date":"18 March 2007","review":"This film came on Turner Classic Movies recently, with the host mentioning that it was the film's debut on that channel, and the first film Patricia Neal made after winning the Oscar for Hud.<br><br>The story concerns a privileged upper-class blind woman named Alison (Neal), her husband Eric (Jurgens) and her younger sister, Robin (Eggar). At first all seems perfectly OK, given the circumstances, but bits of conversation are dropped here and there, darting looks are thrown here and there, and soon we realize that there is something lurking beneath the veneer of a privileged life. Alison, in the final stages of her second pregnancy, suffered a fall in her home that rendered her blind, though as she states early on, it's not that her corneas don't function, it's that her brain won't permit her to see images (paraphrasing here). Apparently this happened in 1959, hence the \"'59\" in the title: The story then takes place in 1964, five years after this fact, over a time period that seems to be about a month, or maybe two, when Robin re-arrives back into the lives of Eric and Alison after what appears to be a 5-year absence.<br><br>The black-and-white cinematography adds much to this film, such that I believe if it were in color, it would not be as effective. The language, dialogue and subject matter covered was ahead of its time, at least by U.S. standards, but stylistically, this matches a number of thrillers and socially-conscious dramas that came out of England in the early- to mid-1960s (e.g., Victim, Pumpkin Eater, etc.).<br><br>The first part of the film, set in London, sets up the story beautifully, and it isn't long before we start to realize that something's \"up\" - the carefully-worded dialogue, with certain key words and phrases omitted, or the glances of the blind Alison behind her sunglasses, to the beat of her words...you see that all that glitters is not gold, so to speak.<br><br>The second part of the film takes place at the characters' country house, located near a coastline; It is here that the set-up for what could be a riveting tale, as depicted in the first part of the film, loses steam and slows to a crawl, such that the conclusion is neither climactic nor satisfying; this is a shame, because it could have been done much better. Besides that, I do agree with the comments made by a previous observer, including that the grandmother doesn't seem quite grandmotherly (and actually, I'm sort of confused as to why this character is even in the picture).<br><br>Nonetheless, the acting is superb by all the leads, and particularly by Neal, who carries the film, in my opinion. Pay attention to every movement she makes, whether it's with her eyes, her head or her hands; listen intently to every syllable she utters, for it is through her character that we understand the real story of what has happened, or is happening, to these three people.<br><br>The movie is based on a book by the same name by Francoise des Ligneris, which is available online.","user":"numberone_1","rank":[30,32]},{"title":"Visually interesting psychodrama with a good cast.","rating":29,"date":"29 January 2009","review":"Made at a time when psychological dramas were enjoying popularity and at a stage when what could be depicted on screen was being tested with each new film, this movie showcases the talents of its star trio fairly well. Neal plays a blind woman, married to Jurgens, who is blind not because of any substantial injury or illness, per se, but because she has suffered some sufficient mental trauma to render her sightless  hysterical blindness. Her husband dotes on her while simultaneously seeming to resent her. Things get even stickier when Neal invites her baby sister Eggar back home to live with them. Eggar dates family friend Bannen, who already has a flirtatious rapport with Neal, while Jurgens struggles with an attraction to Eggar. Eggar, an unbelievably brazen and selfish person, leads him on deliberately, sometimes right under the nose of her sight-impaired sister. When Neal and Eggar head out to the country to visit grandmother March, with the gentlemen soon joining them, things take on a more upsetting tone, culminating in yet another traumatic series of events which call Neal's vision into question again. Neal, fresh off an Oscar win for \"Hud,\" is captivating to watch here and retains most of the film's focus. Jurgens, although top-billed, is somewhat less central though he does an excellent job. His steely eyes are well-served by the stark black and white cinematography (which is wonderful throughout.) Eggar is impossibly young and delectable. She shows off an array of 60s fashions and hairstyles, but also gives a strong performance in a role that could have been played very one-dimensionally. Bannen is likable and solid in his less-than-magnetic character. He has the bad luck to be in love with a vixen. March portrays with some degree of restraint the highly atypical grandmother who seems almost devoid of affection and doesn't hand out praise easily. This type of film will not appeal to all viewers as it is at times heavy-handed and strains to be artsy. However, for those willing to take it in, it's a very interesting and engrossing piece. Certainly, the work of the three leads is very strong. In the second half, the focus gets blurry, the pace begins to drag and the motivations of the characters get a bit cloudy, but there are some great moments of tension and anxiety on display. A heavily dramatic score by Kenneth Jones punctuates the opening credits and the emotional scenes. Fans of the leads really can't afford to miss out on it.","user":"Poseidon-3","rank":[11,12]},{"title":"Four characters battle for supremacy and survival","rating":10,"date":"9 September 2012","review":"I don't remember when I first saw this film – possibly around 1973 or 4 when probably shown late on a Friday night – I'm sure it was shown more than once – after that it disappeared from our screens and, to the best of my knowledge, has never been shown on UK television since – this rarity value ensured its legendary status, at least in my own mind if not the annals of film history. Patricia Neal plays Alison Crawford, a woman who has convinced herself she's blind – a blindness not only psychosomatic but also metaphorical as she no doubt wishes she was blind to her husband Eric's (Curt Jurgens) adulterous ambitions towards her younger sister Robin (Samantha Eggar) who is engaged to Paul (Ian Bannen). The story revolves around the psychological power play between Jurgens and Bannen and the relationships between these four main characters. Part of the drama is meant to occur in France – but when a taxi is summoned a Vauxhall Cresta PA in right hand drive on British number plates turns up. Better viewing then for car enthusiasts than seekers of realism. Of the actors and the acting, Patricia Neal never slipped below best form, and she makes a striking appearance here looking like a corpse in Ray-Bans. Samantha Eggar is nowhere near as good as she is in the following year's Return From The Ashes, but still not bad in an unsympathetic and shallow role. Ian Bannen is marvellous – witness him in The Hill (also 1964) and The Offence (1972) – you always know he's going to come off second best, but he does a grand job of getting there. Curt Jurgens is in pre comedy-high-ranking Nazi officer mode that he would perfect in time for Soft Beds, Hard Battles (1974) The background music can be intrusive at times: almost as if a small string section had been sat down in front of a tape recorder, had the film rolled for them and told to play whatever seemed appropriate. At one point they all stop playing, as though they realize something serious or dramatic is about to happen. It reminds me a bit of that silly plink plonk background music in Desperate Housewives that you only notice when it stops – the difference is DH is meant to be funny whereas '59 is meant to be serious – or is it? This film has now been released on region 1 disc in America, but if your DVD player won't play region 1 discs I can supply a superb quality region free disc – but without any artwork. Contact me by Email at marqymarqy@talktalk.net or text on 07949 792498.","user":"marqymarqy","rank":[10,11]}]