[{"title":"Dante does satire and nobody noticed ?","rating":8,"date":"4 March 2008","review":"I rate both films exactly the same but for very different reasons, the first film was an enjoyable romp fusing horror and comedy to great effect. When I saw that there was to be this sequel 6 years later I was very pleased indeed. What I hadn't bargained for was the sharpness of the writing and the satirical structure that director Dante laid out for audiences to watch.<br><br>Focusing very much on the then modern obsessions like tearing things down to build state of the art monstrous complexes, or the need for a better world; be it the laboratory testings for better life forms, or machines to run our lives; Gremlins 2 plays out as a sort of morality tale that sees the creatures themselves as byproducts of the human condition. In true classic creature feature fashion, Dante manages to garner a level of sympathy for the Gremlins. These vile offspring of the offspring are party animals, they have fun, they like to sing and go nuts, they are in short, quite like a stag party on the Costa Del Sol! Throwing in as many film references as it can, Gremlins 2 may have a satirical slant at it's heart, but sure enough the fun from the first film segues nicely into this picture to make this one of the better, and more smarter sequels on the market.<br><br>And those darn Gremlins are nastier and uglier than ever as well! 8/10","user":"hitchcockthelegend","rank":[60,67]},{"title":"Even more underrated of a film than the first.","rating":6,"date":"6 December 1998","review":"This film is often looked back on as not only the lesser of the two Gremlins flicks but not a very good movie in general.  I just don't understand it -- I love this movie!  It successfully continues the underlying theme of the original (unlike a lot of sequels which seem to forget their points entirely): \"gremlins\" are mythical creatures blamed for mechanical errors (if an appliance is broken, it must have been the work of gremlins).  In this movie, the gremlins are loose in a totally automated high-rise office building, already suffering from its own malfunctions, which serves as the perfect playground for them.  Charles Haas' script is absolutely hilarious, filled with more movie in-jokes than I can recall seeing in a single movie, and it even pokes fun at the more serious original.  In fact, I think many people disliked this film because of its total irreverence compared to the first; it didn't try to be scary for a second and Rick Baker's creature effects turned out goofier than Chris Walas's original creature designs.  Just realize...this is a comedy! Definitely worth seeing more than once to catch the barrage of jokes and references...and sit all the way through the credits!","user":"dgb","rank":[75,87]},{"title":"Strange, weird, bizarre, brilliant","rating":10,"date":"24 April 2005","review":"This movie came out when I was 5 years old. I remember the movie posters in the streets and the wacky preview for it on TV. I'm now 20 years old, and this is still one of my most favourite movies of all time. It's even better than the original, I believe. The reason I love it so much is because it is so damn strange. It really, really is! It's like a live action \"Looney Tunes\" episode. The gremlins are wacky, Gizmo is cute and mysterious, the human actors are all brilliant in their roles and the New York building setting is well, neat.<br><br>The basic premise for this movie picks up a few years after the first \"Gremlins\" movie. This time however, it takes place in the busiest city on the planet, New York.<br><br>The movie opens with the death of Gizmo's frail Chinese owner. In accordance with the owners death, the place where Gizmo is kept is demolished by a bulldozer and recking ball. Terrified, Gizmo flees from the building and into an alley where he is plucked up by a scientist and brought to the \"Clamp Cable Network\" building. The building belongs to media mogul Daniel Clamp and contains a vast variety of shops including: coffee houses, restaurants, dental clinics and science laboratories.<br><br>Coincidentally, Billy and Kate are both working in the same building. Billy is in the art department and Kate gives guided tours of the building. It is here that they stumble upon Gizmo and the inevitable happens.<br><br>I won't give anymore of the story line away. If you haven't seen this movie yet, I urge you to. It may not be brilliant in the eyes of the \"Academy of Motion Picture Arts and Sciences\", but it is in my eyes. 10 stars!","user":"cryofry","rank":[60,71]}]