[{"title":"A Well-Crafted Horror Classic","rating":27,"date":"27 October 2004","review":"With one of Boris Karloff's numerous acting successes and a production done the way that a horror feature should be made, this is a well-crafted classic of the genre. From the first scene, the right atmosphere is established, and the story is told at an implacable pace that slowly builds up the tension and possibilities.<br><br>As he does with his characters in so many of his horror features, Karloff makes \"The Mummy\" a menacing monster, yet one with enough human motivations to keep him from becoming cartoonish. Karloff's approach, as does the movie as a whole, stimulates the imagination rather than the senses, giving this classic version a depth and permanence that cannot be matched by those more recent adaptations that rely on boring \"special\" effects and contrived \"action\" sequences instead of a well-told story with solid characters.<br><br>Edward Van Sloan, David Manners, and the rest of the supporting cast also help out. The atmosphere and settings are kept relatively simple, but effective. Naturally, the story is far-fetched, but it has a consistency that makes it relatively easy to suspend disbelief. The picture fits together well, and it remains a solid entry in the list of classic horror films.","user":"Snow Leopard","rank":[64,66]},{"title":"The Most Subtle of the Universal Horror Films","rating":9,"date":"2 October 2005","review":"Although frequently reinterpreted, the original 1932 THE MUMMY remains the most intriguing film version of a story inspired by both 1920s archaeological finds and the 1931 Bela Lugosi Dracula: when an over-eager archaeologist reads an incantation from an ancient scroll, he unexpectedly reanimates a mysterious mummy--who then seeks reunion with the princess for whom he died thousands of years earlier and ultimately finds his ancient love reincarnated in modern-day Egypt.<br><br>Less a typical horror film than a Gothic romance with an Egyptian setting, THE MUMMY has few special effects of any kind and relies primarily upon atmosphere for impact--and this it has in abundance: although leisurely told, the film possesses a darkly romantic, dreamlike quality that lingers in mind long after the film is over. With one or two exceptions, the cast plays with remarkable restraint, with Boris Karloff as the resurrected mummy and Zita Johann (a uniquely beautifully actress) standouts in the film. The sets are quite remarkable, and the scenes in which Karloff permits his reincarnated lover to relive the ancient past are particularly effective.<br><br>Kids raised on wham-bam action and special effects films will probably find the original THE MUMMY slow and uninteresting, but the film's high quality and disquieting atmosphere will command the respect of both fans of 1930s horror film and the more discerning viewer. Of all the 1930s Universal Studio horror films, THE MUMMY is the most subtle--and the one to which I personally return most often.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[53,58]},{"title":"Moody, understated and succinct","rating":8,"date":"29 October 2004","review":"Boris Karloff plays Imhotep, a cursed Egyptian buried alive 3700-years-ago, returns to life to claim the reincarnation of his lost-love in this Universal classic. Moody, understated and succinct, The Mummy is one of the best films from Universal's classic horror period. Although much of the success can be credited to first time director Karl Freund, who normally worked as a top cinematographer, and the brilliant make-up artist Jack P. Pierce, it is Boris Karloff who gives the film its resonance. As he previously did with the Frankenstein monster, Karloff imbues this character with an aching sense of humanity which was completely absent later incarnations of the Mummy character. Credit must also be given to the able supporting cast including Zita Johann and the always reliable Edward Van Sloan. Now here's a question. Is the film scary by today's standards? I guess I'd have to say not really. However, I just watched this film again after seeing the American version of 'The Grudge.' 'The Grudge' certainly had me jumping more, but which film did I enjoy more? It'd have to be 'The Mummy.'","user":"hausrathman","rank":[64,71]}]