[{"title":"Here is where it starts to come together for Monogram","rating":8,"date":"5 October 2007","review":"Bela made 9 pics for Monogram, but it was only at THIS one, the 4TH, that things started to come together. All the rest in the series would use this one as the essential template for production, writing and character development. From here on, better or worse, the series would also deal with one essential theme: a scientist (usually Bela) makes experiments in the basement or the old house (sometimes IN the basement in the old house) that causes things to go blooey. This was also the first time that Art Director Dave Milton got a chance to spread his wings. He came on board for BLACK DRAGONS, the flick before, but THIS one is where he gets to make his craft start to click. Lewis made great atmosphere for next to nothing, and was around for all the rest of the Monograms. Casting is key in these, and it's a pretty good one B movie wise, here. You get Barclay and Harlen (also from BLACK DRAGONS),along with Russell, who would star in Lewtons' CAT PEOPLE movies..and Rosetto, from SPOOKS RUN WILD...a nice slice of Poverty Row talent. If you have limited time and budget, start with this one...it sums up everything they had learned up to this point, and gives you something to compare the rest to. The plot? Bela steals gland juice to keep his nasty wife young. They both like to sleep in coffins. If you can read that and smile, the rest will be easy.","user":"newportbosco","rank":[31,34]},{"title":"Not a Hitchcock movie.","rating":7,"date":"7 September 2005","review":"Rather nasty piece of business featuring Bela Lugosi as a mad scientist (with yes, a Renfield-like assistant and his mother, a dwarf and yes, the scientist's wife (sounds like a Greenaway movie actually lol). Lugosi gives his wife injections from dead brides (why them? Who knows?) so that his wife can keep looking beautiful. He gets the brides after doing a pretty clever trick with some orchids that makes the brides collapse at the altar. After another bride bites the dust, a newspaper reporter just HAPPENS to be around for the scoop, and decides to snoop around for a story. She gets all sorts of clues about the orchids and Lugosi. Heaven knows where the police were. Soon she's off to Bela's lair, when she meets a sort of strange looking doctor who may or may not be eeeevil. It all cumulates in a totally far-fetched plan to have a fake wedding to capture the mad scientist, but it seems that the scientist has x-ray vision, as he foils her plans, Oh no! What will happen? I actually liked this movie as a bit of a guilty pleasure. Lugosi is great here, his hangers-on are all very very strange, the story is actually quite nasty in some places which makes it all most watchable. A fun little view.","user":"Spuzzlightyear","rank":[28,31]},{"title":"Not That Bad!","rating":6,"date":"6 January 2000","review":"While I had pre-conceived notions of what this film would be like, I must confess that I was pleasantly surprised with this nice little old-fashioned horror story about a doctor who kidnaps \"dead\" brides only to remove spinal fluid in them to inject in his wife who is really 70 some odd years but looks thirtyish.  Whew!  Well I never said it was a great story, but it is a fine feature in which the great Lugosi can steal any scene he is in.  The rest of the cast is adequate or below...some of the cast are just plain awful as with the female lead Luana Walters and the fella that plays her boss(Boy! They stink!).  Yet, the story creates enough suspense to make this film very watchable and entertaining.  I think the fact that it is barely over an hour in length also helps it create its zippy pacing. Minerva Urecal(from The Ape Man with Bela) and Angelo Rossitti(from Freaks) are in here, and they are fine as mysterious mother and dwarf-son Toby.  The sets are pretty good considering the budget of the film and its Poverty Row Production.  The fact Bela is in it is enough reason to see it, but at least with this film you get pretty good entertainment in the old traditional horror way.","user":"BaronBl00d","rank":[21,24]}]