[{"title":"An Aviation Classic","rating":10,"date":"10 August 2005","review":"I am a great fan of \"633 Squadron\" and have read a few articles about the making of the film so I can correct a few errors in previous postings.<br><br>In the original 1956 novel the central character was Wing- Commander Roy Grenville. This was changed to Wing - Commander Roy Grant for the film. The script did make it clear that Grant was an ex - Eagle Squadron pilot. A number of Americans did fly for the RAF during WW2. After Pearl Harbour the Eagle Squadrons were eventually transferred to the USAAF but some Americans stayed in the RAF so it is not totally implausible to have an American leading an RAF squadron.<br><br>I agree that the Greek American actor George Chakiris does not look very Norwegian! However the casting of these two American actors (Robertson and Chakiris) was done to ensure the success of the film at the American box office. British war films with all- British casts tend to bomb at the American box office. The 1969 film \"Battle of Britain\" was the most successful film at the UK box office when it came out but it was a financial disaster in most other countries. That was why the American role in \"Operation Market Garden\" was prominently featured in the 1977 film \"A Bridge Too Far\".<br><br>I agree that the ending was ambiguous. In Frederick E Smith's 1976 sequel \"Operation Rhine Maiden\" it was made clear that Wing Cdr Grant had survived the crash and become a POW - in the film it is not clear whether he had died or just lost consciousness.<br><br>All the Mosquitoes used in the film were obtained from No 35 Civilian Anti Aircraft Cooperation Unit in Exeter which retired its last Mosquitoes only a few weeks before filming began. These civilian - piloted Mosquitoes were the last in service anywhere in the world.<br><br>A total off 11 Mosquitoes were used in the filming though only four were airworthy . Three Mosquitoes were destroyed during filming.<br><br>A few of the Mosquitoes used in the film still exist though none are currently airworthy. The B-25 Mitchell used as the camera plane still exists albeit in a derelict condition at North Weald Airfield in England.","user":"colin-barron","rank":[42,47]},{"title":"Fall in for the blood pumping joy of De Havilland's Mosquitoes.","rating":7,"date":"4 March 2008","review":"A WW2 squadron of Mosquito bombers are training for a perilous mission to bomb a cliff face in Norway; with the aim to bring the cliff tumbling down on the German arms factory below it.<br><br>633 Squadron may not be a film for the War enthusiast purists? But the work done here to make this film a winner should never be understated. In this day and age it's often forgotten how these type of film's relied on good aerial photography, deft model work, and a stirring score. All of which this picture contains, thus making 633 Squadron more than a wet day crowd pleaser. Sure the intermittent scenes between the training sequences and the actual mission are mere filler, and the subplots obviously halt the flow of the movie (hello romance, hello sacrifice clichés); but what they do do is give a sort of added feel to the proceedings come the mission at the end. We do after all have to have some sort of affinity with the characters putting their lives at risk, and we get that here courtesy of a well written first half. Also boasting (in my opinion naturally) one of the greatest scores used in a War movie, courtesy of Ron Goodwin, the film triumphs because the ending is all that you hope for. In truth it's never in doubt given the build up we are given (and being the normality for many genre pieces), but with little dashes of poignancy and slivers of adrenalin rushes, the impact is akin to a jingoistic chest thudding.<br><br>Besides which, if you can't get a tingle on your neck watching the Mosquitoes fly over the Norwegian fjord? Well you got no blood in your body say I. 7/10","user":"hitchcockthelegend","rank":[27,30]},{"title":"Cliff Robertson!","rating":7,"date":"5 November 2005","review":"I have a feeling this isn't the only time that Cliff Robertson played the trans-Atlantic star beefing up a late British war movie for the US market. However, Cliff is NOT playing a British squadron leader! There were a large number of Canadian and Australian flyers in British squadrons during WWII. We also have the fleeting appearance in the movie of an Indian pilot. I suspect Cliff is representing a Canadian - though there were also a few US volunteers flying in the RAF in WWII (as late as 1944 and in a bomber I'm not so sure about - but its not totally impossible!) The real casting problem is George Chakiris. Very Greek/Italian and not at all Norwegian in appearance or accent! Also he lacks the screen presence or acting ability of Robertson. Considering his sister's looks I can only assume that there was a Greek milkman in that Norwegian town in the 1930s! Maria Perschy looks suitably Norwegian (and stunning) and doesn't try too hard for an accent otherwise than educated English - which considering she was Austrian may well have been a very good thing! Oh but the film has real flying scenes of Mosquitos and a flying score to match the Dambusters March so its a film worth watching. The lack of CGI is a huge bonus (though it does present us with some very dodgy models in action and the memory they destroyed a few real Mosquitos making the film). It also has one of the most stirring old-fashioned closing lines in film history delivered as only Harry Andrews could.<br><br>So I'd recommend watching it with critical facilities on 'mute' - enjoy what's there to be enjoyed and ignore the rest of it!!!","user":"Crimpo2","rank":[27,30]}]