[{"title":"I'm Gonna Get You Sucka!","rating":7,"date":"15 July 2000","review":"Sugar Hill is that rare mixture of 70's blaxploitation and horror that started in movies like Blacula, Scream Blacula Scream, Blackenstein, and others.  It is a pretty neat little film with some good horror sequences of zombies in graveyards and zombies administering revenge.  The revenge is based on a woman who loses her boyfriend to thugs wanting to buy his business.  He is beat to death and Marki Bey(who by the way is VERY easy to look at)seeks the help of an old voodoo woman(played by the woman that played Mrs. Jefferson on the Jeffersons)that helps her reach the spirit world. She sells her soul for the help of the zombies.  The next part of the film deals with the revenge sequences for each individual in the mafia-like gang.  The murders are chilling, well-executed(no pun intended), and have a pinch of humour as well.  The acting is decent for this kind of film. Vampire star Robert Quarry, having to fill a contract obligation, plays the heavy with his usual charm and wit.  The scenery and sets are very good too, but remember this is the 70's...the music is something and the clothes are like WoW!  All in all a good zombie flick.","user":"BaronBl00d","rank":[22,24]},{"title":"Crude and heavy handed but also powerful and effective","rating":6,"date":"22 January 2006","review":"\"Sugar Hill\" has a lot of what made \"Foxy Brown\" so compelling, but adds an interesting plot device for a novel twist. I've seen lots of black gangster films where black heroes (and anti-heroes) get over on The Man and The Establishment, but \"Sugar Hill\" is the only film I've seen where horror monsters (as opposed to gun-play and car chases) are the vehicle for social justice. Of course, there could be others. I don't get out much. (And no, I don't count \"Zombie Nightmare\", which is a vanity project, not a movie.) <br><br>The heroine of the story loses her man to the predations of the local Mob when the Mob moves in on their nightclub. In order to exact revenge, she manages to contact a local voodoo cult (because in this film's social milieu, all black people in the South maintain contact with their pagan cult roots, don'chaknow) and convince them to aid her cause. Hilarity ensues.<br><br>On the plus side: the makeup effects for the zombies were novel and extremely effective - I've never seen any other film use 'brass eyes and cobwebs' effects and bluish \"bad skin\" tints like this. Someone did a wonderful job coaching the extras on how to be convincing as cold, soulless, remorseless, shambling piles of ex-humanity. And they are framed and filmed and lighted in setups out of your worst nightmares. The setups for each of the revenge scenes are well done, and there is a lot of variety in the scenarios, as well as some macabre humor - the 'death by massage therapy' scene managed to be both funny and appalling at the same time, which is a great trick. <br><br>Also on the plus side: The actress playing Sugar is very striking and carries the movie effortlessly. She's convincingly merciless and cold as she delivers judgment on each of her foes, and obviously relishes her revenge. The actor playing Samedi seems familiar; I think he shilled for \"7-Up\" some years ago. He's got a wonderful, deep, rich patois that resonates in the viewers' solar plexus. His sadistic glee and delight in the suffering and terror he inspires in his prey is enough to make you seriously considering defecting to the ranks of the \"voodoun.\" <br><br>On the minus side: Once Sugar gets the voodoo revenge ball rolling, it's just too damned easy for her - there is no struggle, or suspense at all. In \"Foxy Brown\", the heroine suffers rape and beatings and humiliation before she turns the tide on her enemies, and it makes the story more compelling because of it. Even in a Jim Brown \"Slaughter\" film, Jim had to sweat some to win the day. For that matter, Bruce Lee took some serious hits in his various fights for justice and revenge. But here, the Mob guys are dumb as toast and go down before the voodoo onslaught like mice under a field mower.That turns the film from a heroic struggle to an exercise in righteous sadism against a bunch of mannequins.<br><br>And traditionally in films and literature, if the protagonist messes with \"Dark Forces\" to exact their revenge, they have to pay a price themselves. But Samedi just goes out and tears Sugar's foes apart like an obedient supernatural Pit Bull and it doesn't cost her a thing, at least not overtly. The protagonist's desire for revenge and/or justice is much more convincing if the story shows them paying a real price to achieve it. So again, the film is less than it could be; instead of making Sugar Hill's story a tale of revenge no matter the cost, it becomes an plodding exercise in vicarious power fantasy and butt-kicking.<br><br>But still, it's a powerful experience, if only due to the fortunate accident of the makeup and the charisma of the two lead black actors. I'm glad I managed to catch it on Showtime, and if I ever see it on DVD for a reasonable price, I'll probably pick it up for my collection.","user":"lemon_magic","rank":[19,21]},{"title":"Politically Correct Zombies? Call Sugar Hill!","rating":22,"date":"22 August 2011","review":"One thing you can say about this movie, besides the fact that EVERYONE is good-looking (even the prince of darkness, Baron Samedi, is hot in a gold-toothed, evil, soulless kind of way) -- is that you always know who the bad guys are. They're the white ones.<br><br>Oh,there are a couple of black bad guys too, portrayed as jive-talking stereotypical 1970's Uncle Toms, but if you see a white person in this film you can just sit back and wait for the N-Word to fly. Which, okay, it's a blaxploitation flick and it was the 1970's and I get that. The problem is that it's not a bad movie, and could have been a pretty good one without all the heavy-handedly racist scenery chewing by every white person in a six-mile radius.<br><br>Diana \"Sugar\" Hill (Marti Bey, one the sexiest women of color to hit the screen since Lena Horne), a photographer of either high fashion or porn, I couldn't figure out quite which (one photoshoot of women tossing a beach ball looks suspiciously fetishy)is in love with Langston (Larry Johnson), the owner of a bar called Club Haiti. Club Haiti is coveted by a local gangster, Morgan (Robert Quarry, looking like a refugee from The Godfather), and Morgan doesn't really care whether Langston sells him the club legally, or gets beaten to death by thugs. Turns out to be the latter, and after Langston is confronted by several gangsters dressed like Huggy Bear and beaten to death in the alley, Sugar vows revenge.<br><br>How does a beautiful, intelligent, determined black woman get revenge in a 70's movie? Why, she goes to the swamp and asks the local voodoo queen, Mama Maitresse (Zara Cully) to summon the power of EVIL.<br><br>Mama Maitresse obliges by conjuring Baron Samedi (Don Pedro Colley) and that's when things get very weird indeed. Colley plays Samedi with appropriately unholy glee, bellowing operatically at everyone, flashing his gold teeth, and casting flirtatiously evil glances at anything female who happens to cross his path. \"He is a great lover,\" cackles Mama Maitresse as Sugar gazes at Samedi in astonishment...and maybe a tad bit of lust.<br><br>With Samedi's army of Zombie slave corpses at her disposal, Sugar dispatches each of Morgan's men in ways both amusing and unpleasant. One is slashed to pieces by zombies in a warehouse; another is eaten by pigs in a cornfield (\"You know,\" purrs Sugar, just before pushing the hapless gangster into the pigpen, \"these poor piggies have gone almost a WEEK without any garbage? They're righteously hungry, I'd say.\") She picks up another man in a pool hall by pretending she thinks he's hot; when he gropes her and leers \"You n****r chicks just can't keep away from the white stuff, can you?\" she rolls her eyes and murmurs \"Something like that, yes.\" By 'something like that', she means \"I'm going to put you under a voodoo spell and make you stab yourself in the chest with a dagger, you scumsicking pig, and then I'm going to laugh.\" And she does.<br><br>My personal favorite death is meted out to Fabulous, played by Charles Watson, A.K.A. Mac from Night Court. Watson plays Morgan's chief enforcer as a dedicated wearer of plaid shirts and outrageous hats. Sugar takes him down by paying off the proprietors of his favorite massage parlor and, when he is naked and facedown on the table, she unleashes a squad of hideous zombie girls to, uh, massage him to death.<br><br>As the bodies begin to pile up, Sugar is visited by Valentine (Richard Lawson, the black paranormal investigator from \"Poltergeist\"), a detective with whom she apparently has had more than a casual friendship in the past. Valentine wants to know why the murderers of Sugar's boyfriend are dying so creatively; Sugar wants Valentine to STFU and maybe give her a little tumble for old time's sake. At one point, Valentine seeks out Mama Maitresse, who puts her hands on his head, scrutinizes him, and spits \"This man is NOT A BELIEVER!\" before she stomps off, followed by a deeply amused Baron Samedi.<br><br>Morgan's girlfriend Celeste is played (with icy venom) by Betty Ann Rees as a cool blond with limited intelligence, great legs, and a very bad racial consciousness. When Sugar visits Morgan to discuss the Club Haiti and Morgan asks Celeste to get Sugar a cup of coffee, Celeste rolls her eyes and snaps \"I ain't waiting on no ni--\" before Morgan cuts her off. She spends most of the movie making nasty remarks about black people, once getting beaten to a pulp by Sugar for her troubles; at the end of the fight she shrieks \"I'LL GET YOU FOR THIS, YOU BLACK BITCH!\" as the bartender calmly wipes counters and picks up broken glass behind her.<br><br>Celeste is, in fact, such a thoroughgoing nasty bitch that you actually cheer at the end when she gets her comeuppance: after Morgan is dispatched by zombies in the old mansion, Baron Samedi shows up to collect his fee -- and Sugar pays her debt by handing Celeste over to a fate worse than death. When last seen, Celeste is being carried, shrieking, into the swamp by a wildly cackling Samedi, who no doubt is trying to figure out how he can sexually humiliate Celeste with her mouth taped shut.<br><br>The movie is surprisingly good. The performances are smooth; even the most overblown characters, like Celeste and Samedi, manage to take their portrayals right to the edge of parody before turning back without breaking character. The problem is that everyone is so over-the-top, scenery-gnawing evil or good that Sugar, who really stands somewhere in the middle, never finds her feet.<br><br>Also I think I wanted her to end up with Samedi. Their kids would have been gorgeous.","user":"sjrobb99-997-836393","rank":[8,8]}]