[{"title":"Good Civil War Adventure From Ford.","rating":6,"date":"6 March 2012","review":"John Ford's THE HORSE SOLDIERS is something of an underrated cavalry epic from the great director. Produced in 1959 for a United Artists release by John Lee Mahin and Martin Rackin it was nicely written for the screen by Mahin and Rackin and colourfully directed,if a little less auspicious, by Ford. Beautifully photographed in widescreen and colour by William Clothier the picture also benefited from an atmospheric score by David Buttolph which was made up from an array of rousing cavalry songs. Once again John Wayne was the star and making his one and only appearance in a Ford picture is the surprise casting of William Holden who, it has to be said, is much less flamboyant here than usual especially if you consider his marvellous Captain Roper in the excellent cavalry western six years earlier \"Escape From Fort Bravo\". His role in THE HORSE SOLDIERS, as the non-combatant regimental doctor, is almost totally overshadowed by the arrogant and irascible troop commander as solidly played by Wayne. Never reaching the lofty heights of Ford's memorable triptych of cavalry epics \"Fort Apache\", \"She Wore A Yellow Ribbon\" and \"Rio Grande\" THE HORSE SOLDIERS is nevertheless an engaging Civil War adventure.<br><br>The story of THE HORSE SOLDIERS is based on a real incident during the Civil War in 1863. Under orders from General Grant a division of Union cavalry, under the command of Colonel John Marlowe (Wayne), are to cross over into Alabama and Mississippi in the South and destroy the railway line at Newton Station deep in enemy territory which is the main supply depot of the Confederacy. On completion of their mission they are to make their way to safety via Union held Baton Rouze. The mission starts out and proceeds with little difficulty until disagreements erupt between Col. Marlowe and the regiment's doctor Kendall (Holden) who has been sent with the division against the wishes of Marlowe who distrusts and dislikes the medical profession. And then there's the beautiful Southern Belle (Constance Towers) who, eavesdropping, overhears the Union's plans and must now be taken along with the regiment lest she informs the enemy. The picture ends with an exciting battle between the two sides - the Union army routing the Confederates and making their escape to Baton Rouze.<br><br>Performances are splendid from all concerned. Wayne is especially good bringing great authority to his role. His Colonel Marlowe is arguably his best cavalry portrayal. Wayne's presence gives the movie a certain sheen and actually makes the film better than it really is. Holden is good too if somewhat more tempered than in anything he did before (He never handles a weapon throughout the film). But the antipathy between the two men makes for some engaging confrontations (the usually reticent Holden throwing a drink in Wayne's face, squaring up to him and yelling \"OK section hand - I've had it - strip your blouse\"). Regretfully though, and despite appearances by Ken Curtis and Hank Worden, there is a noticeable absence of Ford players. Particularly missed are Ben Johnson and Harry Carey Jn. But there is a nice bit of casting for General Grant at the beginning of the movie who is played by cavalry song writer Stan Jones. Jones composed the movie's featured song \"I've Left My Love\". And it was Jones also who, three years earlier, had written \"The Song Of The Searchers\" the stunning ballad sung by The Sons Of The Pioneers over the titles of the Ford/Wayne classic \"The Searchers\". Also of note is the casting of Althea Gibson in the role of Tower's coloured servant. Gibson was a champion tennis player. She was the first African American to win the Grand Slam in 1956 and was the first African American to play Wimbledon in 1951 and to win it in 1957.<br><br>Ford's picture is a handsomely mounted adventure with some blazing action from time to time. Not as good as some of the director's previous cavalry epics but thanks to Duke Wayne for being around and contrary to general opinion THE HORSE SOLDIERS is an enjoyable ride.","user":"jpdoherty","rank":[35,40]},{"title":"John Ford's Civil War","rating":8,"date":"4 August 2005","review":"John Ford probably did more to glorify the old American Cavalry of the 19th Century than any other major Hollywood Director. But while the Civil War is an element that keeps turning up in his movies, he never actually did do the Civil War film he wanted to do - a biography of the career of Ulysses Grant. In his career he tackled the Civil War three times. <br><br>In PRISONER OF SHARK ISLAND he dealt with the story of Dr.Samuel Mudd, who was sentenced to life imprisonment for involvement in Lincoln's Assassination. In HOW THE WEST WAS WON, Ford did the segment dealing with the battle of \"SHILOH\", with Harry Morgan as General Grant and John Wayne as General Sherman. This film was the nearest that Ford ever got to his dream film. THE HORSE SOLDIERS was the only film that was devoted to a full study of the effect of the war in the South, on both Union and Rebel soldiers. While not, perhaps, the best that Ford could have achieved - he was in the twilight of his master career - it is a fine film none-the-less. <br><br>The story is based on an incident in 1863 known as Grierson's Raid. Cavalry leader Benjamin Grierson was sent by Grant into Alabama and Mississippi on a raid to attack a railway junction, supposedly to destroy it for strategic reasons. While it was important to knock the railway junction out of effective work, the real purpose was to tie up Confederate forces in these backwaters. Since December 1862 Grant was struggling to capture the city of Vicksburg, Mississippi, the last major Confederate stronghold on the Mississippi River. But try as he did Grant kept losing to the Confederates under Joseph Johnston and John C. Pemberton (the commander in Vicksburg). But Grant had noticed how Confederate cavalry men like Earl Van Dorn and Nathan Bedford Forrest had forced him to use men to protect his supply lines, and took valuable time away from him trying to fight off or track them down. He decided that Grierson, a first rate Cavalry leader, could do the same thing to Johnston. A very intelligent Confederate Commander, Johnston was nervous at unexpected difficulties. Grant reasoned that Grierson's men would panic Johnston, and cause him to waste time chasing him down. <br><br>As it turned out Grierson's Raid worked. The pinning down of large numbers of Rebel troops in Alabama and Missisippi was wonderful for Grant's Vicksburg campaign. It was the beginning of the successful conclusion of the campaign, as Johnston's attention was now split between trying to help support Pemberton and trying to reassure frightened southern populations in the hinterlands. Grierson got most of his men back to Northern lines. Vicksburg was able to hold out until July 4, 1863. It's fall (the day after Lee's defeat at Gettysburg) really marked the beginning of the end of the Civil War.<br><br>This incident is the basis for THE HORSE SOLDIERS. Ford concentrates on what the experience of the war must have been like in the Southern countryside. Certain things are taken from other incidents and battlefields. When a military school's cadets are brought into the field to try to catch or slow down John Wayne's men, Ford is really picking up on an incident in the war in Virginia, when the young cadets at the Virginia Military Institute came out to fight the Union troops under Sheridan in 1864. One can forgive the transition of the incident. <br><br>It has been pointed out that one of the characters, Colonel Secord (Willis Bouchey) is a splendid type - the political officer. Men like Secord (usually in the position of General) bedeviled both sides, because of their usually normal level of mediocrity or idiocy. A few rose to the job well - the best of the Northern political generals was \"Black Jack\" Logan, who would be a valuable associate of Sherman in the battles around Atlanta. But for every positive General Logan, there were thieves like Benjamin \"Spoons\" Butler, who feathered his nest as military governor of New Orleans (he supposedly stole even the silver spoons of the citizenry). Actually Secord is normally intelligent, and follows Wayne's strategy. But he is constantly looking ahead at post-war elections. Towards the end he even wonders if the White House beckons.<br><br>Another lovely moment shows the fraying of the Southern cause. Wayne and his men come across two Rebel deserters (Strother Martin and Denver Pyle) who have tied up the local sheriff (Russell Simpson). Wayne thanks Martin and Pyle for their unofficial assistance to the Northern cause,telling them which way they plan to go. While Martin chatters away (mentioning the strength of Rebel forces in the area), Wayne carefully knocks out Pyle and then Martin, and then unties Simpson and assists in tying up the two deserters. William Holden is watching this, and later asks why he helped Simpson. Wayne explains that he decided to feed the deserters false information about his own movements, as they would probably give the information to the Confederates later on anyway.<br><br>All the performances are fine, with Wayne in particular as a man who hates doctors and medicine for a valid personal reason. Holden is in a subordinate role but he gets some nice moments. So does Constance Towers, in a rare leading part, as a passionate Confederate supporter who gradually gets to like Wayne. Carleton Young, as a former friend of Wayne, has a moment trying to rally Confederate forces at the railway depot. <br><br>It is a good Ford film, and makes one wish that Ford had made his Ulysses Grant biography.","user":"theowinthrop","rank":[49,69]},{"title":"Historically inaccurate but otherwise excellent","rating":8,"date":"5 January 2005","review":"This film has the usual Hollywood-style errors about the Civil War -- men talking about Andersonville Prison months before it was established, minor diversions treated as the pivotal event of a campaign, that sort of thing. The biggest error though was the replacement of the fascinating Colonel Ben Grierson with Wayne's railroad man character. Grierson was a music teacher who was afraid of horses because one kicked him in the head as a child. Joining the Union army to fight slavery (he was a staunch abolitionist) he wanted infantry duty but was assigned to the cavalry by mistake. He turned out to be good at it and stayed in the cavalry after the war, becoming the first Colonel of the 10th Cavalry (Buffalo soldiers). It'd have been nice to see Grierson on screen.<br><br>Historical inaccuracy aside though the movie did quite well. The film showed multiple viewpoints and a fair degree of respect for most of them. It showed aspects of the war that were generally ignored in other films of the period -- the bloody horror of battlefield amputations, the desire of people to give up on the whole thing (I can't think of an earlier film that talked about deserters and the way they disrupted the southern home front), and the pain of the sheer physical destruction of the war -- a pain that affected the destroyers as well as the victims, something Gone With the Wind never quite admitted.<br><br>Some posters have complained about southern belle Hannah Hunter's overuse of sex appeal to spy on Union soldiers -- while there was no historical Hannah Hunter there were plenty of southern women who did just that, including Belle Boyd, Rose Greenhow and others. Some posters have complained about the way the film trivializes slavery -- this is unfair. It underplays slavery but never trivializes it. It shows conflicts within the Union army about the institution and addresses the issue of personal loyalty between some slaves and masters without glamorizing the institution as a whole. Does the film go far enough by modern standards? No. But it goes much farther than its contemporary and treats the slavery issue more honestly than modern travesties like Gods And Generals.<br><br>One poster actually complained about how inaccurate southern snipers were -- this is completely unfair. There was no indication that the \"snipers\" were specially trained men with Whitworth rifles or anything like that. They looked more like ordinary troopers out skirmishing, or perhaps the even more poorly trained militia. Ordinary soldiers fired more than 100 rounds for every hit they scored, so poor shooting on either side is nothing to be surprised about.<br><br>8 out of 10","user":"gteatr","rank":[21,28]}]