[{"title":"Fantastic homage to the likes of Argento and Hitchcock","rating":8,"date":"13 September 2004","review":"I couldn't believe my luck when I stumbled on to this movie at a local video store in Iceland. It had subtitles and everything. What a find! As many of you know, this is the \"lost\" John Carpenter movie, and it's nothing short of fantastic. It plays like an homage to the likes of Dario Argento and Alfred Hitchcock, although the Hitchcock influences are more apparent here.<br><br>Lauren Hutton moves into a fancy apartment building and starts receiving mysterious phone calls and presents. And we, as the audience, know that this stalker lives in the building across from hers and that he's watching her every move.<br><br>Although not much actually happens here, the film's gradual buildup to a terrifying finale is nothing short of brilliant, orchestrated by a very fresh John Carpenter at the height of his creativity. <br><br>The cinematography (especially the POV's) makes one think of Dario Argento but the atmosphere (and storyline) reeks of Hitchcock. John Carpenter has admitted to the fact of having been inspired by both. <br><br>I strongly recommend this film. If you can locate it, that is.","user":"ODDBear","rank":[23,23]},{"title":"Packed with tension.","rating":8,"date":"31 December 2002","review":"John Carpenter's SOMEONE'S WATCHING ME! is an undisguised homage to REAR WINDOW, with nods to BLACK CHRISTMAS (an avowed favourite of Carpenter's) and the Italian Giallo genre, specifically Argento's DEEP RED.  One elaborate scene, wherein the anxious heroine drops a knife through a grate, and then squeezes laboriously into the crawlspace beneath to hide, is a clear riff on giallo scenography.  <br><br>The material is stale, but the execution is not.  Carpenter's virtuoso use of gliding camera shots, shadow detail, composition, and mise en scene, ratchets up the suspense even during what would otherwise be incidental scenes in another director's hands.  On occasion, TV-movie limpness creeps in momentarily, but, in the main, the picture's production is very professionally handled.<br><br>One major irritant is Lauren Hutton's protagonist, Leigh.  She is endlessly spunky, constantly talking to herself, always rushing headlong into situations.  It's grating right from the start, but as events unfold, her happy-go-lucky ebullience morphs (in the viewers' eyes) into a kind of blithe stupidity.  Most thinking people would have closed their curtains, locked their doors, taken the prank calls more seriously, or perhaps moved away (pride be damned), much sooner than did she.  Certainly most people wouldn't have walked knowingly into the stalker's trap, as Leigh does at the very end.  \"Someone's Watching Me\" is nerve-wracking enough for one to suspend one's incredulity, and good enough to belong in, or just below, the rarefied sphere of Carpenter's two best, HALLOWEEN and THE THING.","user":"Oliver_Lenhardt","rank":[15,16]},{"title":"Great!","rating":15,"date":"15 May 2002","review":"An early TV movie by director John Carpenter about Lauren Hutton who's being stalked in her apartment, you know the sort of thing. This is pretty good actually and it still plays well today. Definately one of my favorites, Halloween was made shortly after, I think.","user":"Bob-376","rank":[9,9]}]