[{"title":"Lean, mean and nasty revenge thriller.","rating":19,"date":"19 May 2002","review":"First off, yes, 'Vigilante' does bear some superficial resemblances to 'Death Wish'. But in other ways it is a different kind of animal, tougher, more realistic and believable. Directed by William Lustig in between his trash classic 'Maniac' and 'Maniac Cop', the movie greatly benefits from the strong performances of Robert Forster ('Medium Cool', 'Jackie Brown') and Fred Williamson ('Black Caesar'), two actors who unfortunately have generally been wasted in dull action movies and awful straight to video dreck. Forster displays dignity and  depth of character as a working class Joe pushed to his limit, and Fred Williamson gives possibly his most impressive performance ever, as his buddy who shows him a way to get closure. Both Forster and Williamson are supported by an above average cast of character actors including Richard Bright and Joe Spinell (both of 'The Godfather' as well as countless other roles), and veteran Woody Strode. This is a lean, mean and nasty revenge thriller worth tracking down.","user":"Infofreak","rank":[28,32]},{"title":"Rousing revenge flick.","rating":7,"date":"1 February 2012","review":"Director William Lustig followed up his classic \"Maniac\" with this equally potent thriller. Robert Forster offers an interesting, low key portrayal of Eddie Marino, a blue collar guy whose wife and son are savagely attacked by loathsome punks. When Eddie realizes that he cannot rely on the \"justice\" system - including a crooked defense attorney (\"Maniac\" star Joe Spinell, in an amusing cameo) and an incompetent judge (Vincent Beck), he finally takes a friend, Nick (Fred \"The Hammer\" Williamson), up on his offer to help clean up the streets. The tone is set up very well right away, as The Hammer addresses us all and delivers a monologue bemoaning the level of crime and violence in the modern world. One can indeed see that he and his associates, Ramon (Joseph Carberry) and Burke (Richard Bright), himself a former cop, don't necessarily ENJOY what they do, but see it as being necessary, stressing the basic human right to not have to live in fear. And Lustig and company pull no punches when it comes to the depravity of our antagonists' crimes, not being afraid to cross the line of what might constitute good taste. At the very least, the movie is decent, reasonably gripping entertainment that explores that oft visited theme of what the average person is capable of doing once they've finally been pushed too far. As in \"Maniac\", the use of the various NYC locations is excellent, and there are some great chase sequences and scenes of strong violence. The widescreen photography (it's cool that this movie was shot in the Panavision aspect ratio) is impressive; the haunting and catchy main theme by composer Jay Chattaway may very well stick in the viewer's head a while after the movie has ended. The good supporting cast is also a big help, featuring such performers as Rutanya Alda as Eddie's wife Vickie, Don Blakely as despicable lowlife Prago, salsa music legend Willie Colon as gang leader Rico, Carol Lynley as the ineffective district attorney, the awesome Woody Strode as imposing convict Rake, Frank Pesce as drug dealing scum \"Blueboy\", Peter Savage (to whom the movie is dedicated) as big shot gangster Mr. Stokes, and busy 80's action movie regular Steve James as Patrolman Gibbons. (Keep an eye out for the walk on by Lustig as he exits an elevator.) The Hammer is especially fun to watch in one of his best ever roles; overall, \"Vigilante\" is good of its kind and packs a pretty mean punch. Seven out of 10.","user":"Hey_Sweden","rank":[8,8]},{"title":"Lustig's Homage to the Italian Revenge Flicks","rating":9,"date":"7 October 2003","review":"Vigilante (1983) is a revenge flick in the style of 70's Italian Crime films (He even shot it in Scope). Robert Forester plays Marino, an average working joe who's family is attacked by an inner city street gang. When the justice system fails him, Marino can't take it anymore and with the help of his co-workers takes revenge on the street scum. Sophisticated trash from William Lustig (It looks and feels sleazy). The film has an all star cult film line up. Featuring Fred \"The Hammer\" Williamson, Joe Spinell, Woody Strode, Carol Lynley, Frank Pesce and Rutyana Alda.<br><br>Highly Recommended.<br><br>Old school ultra violence, Lustig style.","user":"Captain_Couth","rank":[19,24]}]