[{"title":"Quietly Impressive","rating":30,"date":"30 March 2003","review":"There is a scene, near the beginning, that shows our main character from a distance walking through mounds of coal to get to her father to ask him for some money.  The shot stays on her for what seems like several minutes.  The camera simply and slowly pans forwarded as she progresses. Some may say this is boring, others the work of a amateur that doesn't know when to cut.  Yet this is a very brilliant shot that shows the true essence of what this film is about and the plight of our character.  In life she is constantly walking.  Unable to fully grasp the true dissolution of her existence she continues to search for something, anything.  She is the victim of life's cruel riddle.  A riddle that has no answer.<br><br>     This is a very sad movie, probably one of the saddest movies you will ever see.  It is sad because Wanda's condition is not unique and probably makes up more of the working poor than we care to think.  It helps clarify the desperation that people in these circumstances both live and feel.  It also helps explain why they will get into such stupid situations and at times make such dumb and illogical choices. <br><br>     Here drifter Wanda meets up with a two bit crook named Mr Davis. The two create a very odd relationship and actually prove beneficial to each other.  She brings out his long dormant tenderness, while he, in one truly touching moment, actually gives her some confidence.  Of course it doesn't last, but it is an inspiring piece nonetheless. It shows that even the most pathetic of people, in the most bleakest of situations, can still transcend themselves.<br><br>     This is actually quite a powerful film.  It's very stark, grimy, almost home movie look is actually an asset.  No stylized interpretations here. The dingy bars, restaurants, homes, hotels, and factories are all very, very real.  You start to feel as trapped in their grayness as the characters. This is a far more billiant and manipulative film than one might initially believe.","user":"rwint","rank":[80,87]},{"title":"Quiet, memorable film.","rating":12,"date":"12 February 2000","review":"Mousy, uneducated, impoverished Wanda falls for a sleazy small-time crook, and they hit the road together.  This movie has everything going against it--it's very low-key, cheaply made (dig that shaking camera), and paced only a little more swiftly than your average Andy Warhol film.  But even though it plays like a cut-rate \"Badlands,\" it succeeds powerfully in evoking sympathy for its pathetic title character.  Its slow pace gives it a meditative quality for the patient viewer.  Depressing but memorable; it should be more widely seen.","user":"yeahman","rank":[40,46]},{"title":"Devastatingly barren void = incredible verite experience","rating":9,"date":"14 August 2008","review":"A stark and deliberate downer of a character study, Barbara Loden's Wanda is a captivating and unfairly forgotten addition to the indie American New Wave, that also shows the indie American New Wave what 'indie' REALLY means. The film's theatrical non-history is well documented in each review of the film: Wanda was screened, briefly, in one theater in New York, was fairly acclaimed, then vanished, before being championed by the European crowd a decade later, and perhaps finally getting a bit of the credit it deserves by appearing on the TSPDT top 1000 films list, which was, like many other obscurities, excellent and terrible alike, my impetus for seeing it.<br><br>The film is a grim and protracted look at a aimless, desultory layabout named Wanda (director Barbara Loden). She abandons her husband and children (we are witness to their divorce proceedings, he annoyed and impatient, she blank and tardy), and hers is a life filled with ennui and survival. She sleeps on couches, drinks and smokes to excess and goes home with men just to have a roof over her head. One night, she enters a closed bar, and finds a pacing man named Mr. Dennis (Michael Higgins) who turns out to be robbing the place. She follows him back to his hotel room, and ends up accompanying him on a sort of pseudo-road trip (in a stolen car, no less), packed to the gills with the Cassavetes special: two broken people (one volatile and dominating, the other crumpling and submissive) who somehow sort of counteract one another.<br><br>There is an emptiness to this film that recalls the ennui of the characters in one of the all-time greats, Antonioni's L'Avventura, but here, it's saddening in a more personal way because we are meant to empathize with the wastrel at the film's core. She is a hollow vacuum, devoid of interest and barren of meaning, so she is constantly on the move, but oblivious and unable to attach herself in any meaningful way to anything in her world. By the time she's getting inexplicably drafted into a bank robbery, it becomes clear that perhaps she's content to stay with Dennis simply because he'll put up with her and never follows through on his threats of expulsion.<br><br>Wanda features a cast of stiff, amateurish male actors, with an actress at its core whose performance is virtuoso in its realism. There's not a single moment in the film that doesn't feel natural, and with its slow pace, down-to-earth plot line, and the rough graininess of the film stock itself (it was filmed on 16mm and blown up to 35mm), it resembles nothing more than a heartbreaking bit of documentary film-making, as I have absolutely zero doubt that there are hundreds upon thousands of people in these exact sort of situations, uninhabited shells sleepwalking through life, finding nothing and accepting it readily..<br><br>Barbara Loden, despite being married to a fellow director, Elia Kazan, made this film, and this film only, and it's really quite sad in its own right. It took John Cassavetes, an acknowledged master, 15 years to make something in this style with the confidence and impact that Barbara Loden got on her first try, and really, I feel shortchanged because, unlike her titular character, Barbara Loden had all the potential in the world, but sadly, almost none of that energy became kinetic, as this heartbreaking f_ck-up ended up her last cinematic will and testament. But the legacy of Wanda endures, and I hope this review will do as much as possible to strengthen it.<br><br>{Grade: 8.75/10 (A-/B+) / #5 (of 28) of 1970}","user":"theskulI42","rank":[29,35]}]