[{"title":"\"We've got a saying down in Texas, ma'am. . .\"","rating":8,"date":"14 March 2005","review":"John Wayne's first \"A\" film at Republic is a good story carried by a strong cast. One year after Stagecoach, he still takes second billing after Claire Trevor in their third of four pairings together. They worked extremely well together, and remained close friends for the rest of their lives. Walter Pigeon is given the part of the heavy, Roy Rogers gives the finest acting performance of his entire career, and veteran character actors Gabby Hayes and Marjorie Main round out the cast. Veteran director Raoul Walsh keeps the story moving and gives emotional depth to the characters that was unusual for Republic films at the time.<br><br>Set in pre-Civil War Kansas, when both Northerners and Southerners were scrambling to settle Kansas and decide its political position on slavery, the story revolves around an uneducated Texas cowboy, Bob Seton (Wayne), who finds himself in conflict with local schoolteacher Will Cantrell (Pidgeon) over both the job of Marshall in Lawrence, Kansas, and the hand of the local Southern banker's daughter, Miss Mary McCloud (Trevor). When Seton appears to have won not only the job, but also Mary's heart, Cantrell decides that the way to power lies through lawlessness, and forms a band of freebooters who ravage both Northern and Southern settlements, causing destruction and terror in Kansas.<br><br>While the film is not totally historically accurate, it does do a good job of portraying the viciousness and ruthlessness of pre-Civil War Kansas. It is told from the Northern point of view, and is a nice contrast to Errol Flynn's Santa Fe Trail, which came out the same year (1940) and portrays similar events in \"bleeding Kansas\" from a Southern point of view.<br><br>Part-Western, part-Civil War movie, Dark Command is one of Wayne's best early starring roles. Fans of his, or of the genre's will not be disappointed.","user":"ejgreen77","rank":[41,42]},{"title":"Cleaning Up Kansas","rating":8,"date":"7 May 2006","review":"After John Wayne became an A picture star with the release of Stagecoach a year earlier, Republic didn't know quite what to do with him. In fact they put him back in some Three Mesquiteer films for a while. I'm sure it took a little negotiating on his part, but Republic finally decided to give him an A film under its own banner. Which set a pattern for his career over the next decade. The Duke would do at least one prestige film a year for Republic, but Herbert J. Yates would make just as much money loaning him out to the big studios also.<br><br>This is not the story of William Quantrill. In fact like Inherit the Wind where the real life Clarence Darrow and William Jennings Bryan are given pseudonyms, Quantrill here is named Cantrell. He's played quite well by a loan out from MGM, Walter Pigeon.<br><br>Pigeon in essaying Cantrell has captured the character of a man desperate to succeed and not particularly caring about what he has to do. His character is conveyed in the scenes he has with Marjorie Main as his mother. When she and Pigeon talk about the family of outlaws they left in Ohio, his background is vividly portrayed. Their words and the way they deliver them give us what Piddgeon's real nature is.<br><br>In fact Pigeon was heading towards the height of his career. Next year in How Green Was My Valley and the year after in Mrs. Miniver he was in back to back Best Picture Oscar winners. Not too shabby for that man.<br><br>John Wayne gets his third film with Claire Trevor which almost qualifies them as big a screen team as the Duke with Maureen O'Hara. She was in his breakthrough film Stagecoach and Alleghany Uprising with Wayne. Later on she was also in the cast of The High and the Mighty as one of the passengers on that nearly ill fated flight.<br><br>The Duke sits real tall in the saddle in his role as Bob Seton, the man who had a host of sayings from Texas. He's got an appropriate acolyte here as well in Roy Rogers who made one of his few departures from his own B western films at Republic. Rogers is Claire Trevor's younger brother in Dark Command with Scottish banker Porter Hall as their father. <br><br>Pigeon's ruthlessness is never more graphically demonstrated than when he both defends Rogers in court after Rogers murders a northern man in Lawrence, Kansas with Pigeon as his defense attorney by day. But as a night rider he and his gang intimidate the prospective jurors with the inevitable results. <br><br>Look for some good performances by both Gabby Hayes and Raymond Walburn in roles that were tailor made for the talents of each.<br><br>The film is directed by Raoul Walsh who gave John Wayne a first chance at stardom in The Big Trail back in 1929. That film flopped for many reasons, but John Wayne eventually made it to the top. Not too many folks in Hollywood get a second chance, but Wayne sure made the most of is. For reasons though that I can't explain, he and Walsh never worked together again. Odd because Wayne was definitely the kind of action star Walsh worked with best.<br><br>Although John Wayne is the hero and he's his usual Duke, the film really turns on Pigeon's performance as Cantrell. It's the most complex part in the film and it's a bit of offbeat casting for him. Still I recommend it to John Wayne fans wherever they be.","user":"bkoganbing","rank":[37,39]},{"title":"Quantrell, \"Bloody Kansas\" and W.R.Burnett.","rating":21,"date":"21 April 2004","review":"If the South can make a case that the abolitionist figure John Brown was not a martyr but a maniac, murderer, and traitor, the North can point to the so-called pro-Southern guerilla leader William Clarke Quantrell or Quantrill as a bloodthirsty killer and thief, and the trainer of a generation of criminals (i.e., his followers included Cole Younger and Frank James...and maybe Jesse James too).  The fact is that Bloody Kansas was where the violence that became our Civil War began, and it lasted there for more than the four years of the actual war. There are few movies that tackle this story.  SEVEN ANGRY MEN and SANTA FE TRAIL gave us versions of Brown's story.  There is a film called THE JAYHAWKER (with Fess Parker and Jeff Chandler) about a pro-Southern fighter in Kansas.  And there are about four mentioning Quantrell, though none are totally factual.  Most though do touch on the one event of his career that everyone recalls: the massacre at the town of Lawrence, Kansas in August 1863.  Lawrence was the center of the abolitionist movement in the state, and it's leading citizen was James Lane, a particularly violent anti-slavery fanatic who became first Senator from the state.  Quantrell was responsible for ordering the deaths of nearly 150 men and boys, but failed to get Lane (whom he wanted to burn at the stake) - the Senator managed to hide in the field of corn in the back of his farm. Quantrell barely survived the war - he was shot in the back, trying to flee Federal troops in Kentucky where he had gone in a ridiculous plan to reach Washington and assassinate Lincoln (little did he know someone else had similar plans).  <br><br>This film culminates in the attack on Lawrence - but here Quantrell is beaten back, when Seaton (John Wayne) reaches the town to warn the citizens that the guerillas are on their way.  In short, DARK COMMAND shows that the sacking of Lawrence was a failure.  Regretably it was a success. <br><br>\nQuantrell (here Cantrell) was a teacher at one point of his career, but he was also a thief and murderer before he found he could turn himself into a guerilla chief.  His patriotism is still questioned.  Southern leaders like General Sterling Price never fully trusted him - they suspected his motives and goals, and did not like the unregimented nature of his followers. Still, however, they let him have his semi-independent command.  To be fair the North too could have violent \"allies\" in their cause.  Witness the actions, in 1862, of General John Turchin, who let his Federal troops loot a southern town. Turchin was sidetracked for awhile, but back on the battlefield later in the war.<br><br>Keeping in mind,then, that the film does take liberties with the historical record, it remains the best film about Quantrell.  It does capture the spirit of sectionalism that rent Kansas society apart, and it does capture the nature of Quantrell and his opportunism.  In Walter Pigeon it has an interesting surprise.  Pigeon is (with Robert Montgomery and Franchot Tone and Robert Young) one of the leading second string leading men at MGM in the 1930s and 1940s, usually in comedies.  In his case he also was teamed (by accident, as it turned out) with Greer Garson in a series of films from MRS. MINIVER onward.  Here he has one of his rare western roles (another is as the sheriff in THE GIRL OF THE GOLDEN WEST with Eddy and MacDonald), and one of his few villains (another would be Morbeus in FORBIDDEN PLANET). He is quite effective - witness the scene when he addresses the jury at the trial of Roy Rogers - a jury he has individually intimidated in a nightrider disguise - repeating the word \"pain\" again and again.  This performance is the central one, though Wayne's Seaton is suitably relaxed and a balance to Pigeon.  Roy Roger's young McCloud is a surprise too - as he shows a hurt anger in much of the film.  Highly unusual for him.  Claire Trevor gives her normal good performance - she has a nice chemistry with Wayne, and also does well with Pigeon.  In the support one can name Gabby Hayes, Marjorie Main (ultimately a sad performance, reminding one of her similarly unhappy mother of a monster in DEAD END), and Porter Hall as the stubborn banker father of Rogers and Trevor. Even Raymond Walburn has some funny moments, one as a non-paying customer of Hayes.<br><br>Finally, take note that this film is based on a tale by W.R.Burnett. Forgotten by most of the public, he was an above average pulp novelist who gave the world LITTLE CAESAR, HIGH SIERRA, and WHITE HEAT.  Usually he did prototypes of film noir (especially WHITE HEAT), so DARK COMMAND is a pleasant surprise that he could handle westerns as well as crime.","user":"theowinthrop","rank":[56,61]}]