[{"title":"A Heartbreaking Work of Staggering Genius","rating":10,"date":"18 March 2011","review":"Take off your cultural blinders...the one you put on when you watch a \"trashy\" movie...and think about what you are actually experiencing as you watch this movie. Is it merely a \"trash\" entertainment? To be sure, Raquel Welch in her furkini, the now quaint quality of the Harryhausen effects, the girl fight between Raquel and Martine Beswick, all provide the frisson of \"trash\" delight. But this movie is much more than that, a tour de force of imagination, and a heartbreaking work of staggering genius. The vision of man adrift in a hostile universe, at odds with his fellow creatures, his own untamed emotions, and the apocalyptic earth itself, is haunting and beautiful. Our only hope is Raquel, who offers a transcendent vision of peace and love--without uttering a word.<br><br>Special kudos to the music. Where the special effects strain against their limits, as in the terrifying pterodactyl attack and the final upheaval, the music carries home the emotion. I am reminded of Schopenhauer: \"The internal relation that music has to the true nature of all things can also explain the fact that, when music suitable to any scene, action, event, or environment is played, it seems to disclose to us its utmost secret meaning and appears to be the most accurate and distinct commentary on it.\" In a film where words matter so little, the music is especially crucial. As you watch the pterodactyl snatch Raquel and carry her off to feed its young while the other humans watch in helpless dismay, listen to the music, and think about the \"utmost secret meaning\" of what you are witnessing. This is an artistic moment of astounding ambition, and there are many such moments throughout this sustained meditation on man and the universe.<br><br>A few years later, the same team made Creatures the World Forgot, a more \"realistic\" look at prehistoric survival sans dinosaurs, with a Cain and Abel story that is riveting...and my god, the cave people are hot!","user":"steven-222","rank":[20,21]},{"title":"Classic prehistoric hokum!","rating":24,"date":"24 December 2001","review":"Watching 1970s TV screenings of 'One Million Years BC', the Connery Bond movies, the original 'Planet Of The Apes' and 'The Omega Man' made an enormous impact on my childhood that I don't think I've ever truly recovered from! Looking at it now as an adult you can see how laughably stupid it all is, but you can't help but still love it! The vision of Raquel Welch in her animal skin bikini nearly brought puberty on five years early for me. She's still a sight to see but the charms of Martine Beswick ('Dr Jekyll and Sister Hyde', 'A Bullet For The General') are now more to my taste. She's sensational!<br><br>The plot, such that it is, concerns Tumak (John Richardson of 'She'), one of the \"rock people\" who look like spaghetti western refugees and like nothing better than grunting, wearing fur, and beating the crap out of each other. Tumak falls out with his old man and brother, is banished and after some aimless wandering around avoiding dinosaurs (and in one surreal moment a giant tarantula!), he stumbles across the hitherto unknown \"shell people\". They are blonde surfer types who introduce him to such innovations as improved spears, hot water, painting, crying and feminism. And also to the babelicious Loana (Welch) who takes a shine to him. Tumak still has \"attitude problems\" and ends up getting banished from their tribe too, but with Loana and a new and improved spear what more can the guy want? Of course he heads straight back to his homies and yes, there's trouble ahead including fraternal friction, a jealous ex (Nupondi, the stunning Beswick), lots of Harryhausen dinosaurs, and exploding volcanos. Does mindless entertainment get any better than this? Hardly ever. Add a cool score from Mario Nascimbene and what you have is a classic piece of unforgettably trashy exploitation.","user":"Infofreak","rank":[37,44]},{"title":"Solid-gold","rating":18,"date":"18 October 2002","review":"One Million Years B.C. is THE film that made me a movie fan and lover of all things prehistoric! Ray Harryhausen's creatures are great, the music adds superbly to the atmosphere, the location photography looks just right (just ignore the occasional obvious set), and there has never been a better-looking cavegirl than Raquel Welch!<br><br>A solid-gold guilty pleasure! Actually, what's there to be guilty about? This film is solid-gold entertainment!","user":"ken-miller","rank":[16,18]}]