[{"title":"Perfection of Simplicity and Innocence","rating":10,"date":"3 August 2011","review":"Actually it's hard to find any more words to define this masterpiece than the ones in the title of this review. If you are looking for something that would make you feel like you're reading a classic short story rather than watching a film, then this one is right that film. When you watch a film you have the vision, the sound, the effects, the music; almost nothing's left to your imagination and you watch the film effortlessly. Eventually, the story is misted over. On the other hand, in Khane-ye doust kodjast?, Kiarostami with his fascinating simplicity, takes you deep into a world of childish innocence. Everything from acting to cameras, is full of that precious amateur feeling. You actually feel amazed when you see how well Kiarostami managed to get such natural acting from a cast of all non-professional actors. Each character, each scene is tailored with Kiarostami's masterful observations. The film is so purely simple that, for a second, I even wished we didn't even have the music that plays only in two scenes, though I loved it. I personally believe, it really is a piece of art than a film.","user":"cchaoss","rank":[27,28]},{"title":"9/10","rating":9,"date":"2 September 2004","review":"This is one of the great works on youth, and Kiarostami wrings out as many ounces of emotional truth as he can. When a teacher punishes a student in front of the class and he cries, it has the potential to be cloying, but it's the more breathy, hiccupping type of crying as opposed to that doe-eyed variety that usually accompanies children in tears. The acting, as per usual with Kiarostami, is perfect, not at all showy or actorly. The film is told from the child's perspective, and we see how the adults view children as pestering annoyances, and how adults' duty-oriented simple-mindedness is so often not in tune to the rigid sense of morality that children sometimes have. The film is like an examination of children's moral code of righteousness -- the young hero here needs to return his friends' notebook so he can do his homework, but his parents fail to understand him and see it as more important for him to tend to his requirements outside of school. Meanwhile, his teacher tells the children that their schoolwork should come first. What is he to do? He's trying to do one right thing (that would help another) and getting quashed for not doing another right thing.<br><br>The film, which is addictively watchable, plays like a thriller in some ways (albeit a slow one): the notebook is its own character, and in jeopardy when another adult wants to write in it. The search for the friends' house (and the darkening of night indicating the loss of time for his friend to do his homework should he find him) is invigorating and thrilling. But more than that, the film has those little moments of pureness that Kiarostami blesses us with: The soft tenderness when one boy rubs water on another's knee after falling down outside; the wonderful images of children wandering in the slum-like houses and not at all worried about our immediate fears like violence or drugs; or the great scene where our hero sneaks away from his mother, who has forbade him from his mission, with the notebook tucked under his vest -- then realizing he's mistaken his own for his friends'. 9/10","user":"desperateliving","rank":[28,30]},{"title":"Gorgeous film, magnificent message, a must-see!","rating":10,"date":"27 July 2003","review":"This dear and simple story is the most wonderful film I have seen this year. The children are non-actors who bring a reality and wonder to this film that is sadly absent from American films, and you will be left in awe by their performances.<br><br>The story involves a little boy who must track down his friend to give him a notebook, or his friend may be kicked out of school.  All along the way he is blocked from this quest to \"do the right thing\" but adults who are too stuck on their own silly business to listen to him and offer assistance. Instead of helping this sincere and good child, they do everything imaginable to block him.  How very real this situation is, and how refreshing to see adults forced to examine the condescending way they communicate with children.  The child  Ahmed in this film is a refreshing hero for little boys... so much better than the smart-alleck and spoiled brats offered up in American films.  It is a beautiful story, and it is a beautiful experience to sit and take in this magnificent film!","user":"pyotr-3","rank":[47,54]}]