[{"title":"Too family-friendly","rating":6,"date":"9 May 1999","review":"I was looking forward to this film, because I'm a big fan of Tom Sharpe's novels.  At the same time I was rather apprehensive as well.  This is a comedy, and comedy movies are made these days with a family audience in mind.  Tom Sharpe's novel Wilt certainly does not fit into this bracket and so I expected some dreaded compromises.<br><br>Inevitably, they came.  Of course, the film still has a US R-rating and a UK 15 rating, but this has more to do with the intrinsic adult nature of the basic material than with the film makers' attempts to preserve the spirit of the novel.  The whole thing still felt much too sanitised, too toned down, too understated.  Part of the problem might have been that filming faithfully the original story would have made some middle-aged established actors and actresses occasionally prance around in the buff, simulate drug abuse, and molest each other, but the story really needed a higher dosage of excessiveness.","user":"SMK-4","rank":[16,19]},{"title":"Brilliant adaption of an outrageous book","rating":26,"date":"26 July 2000","review":"I saw the movie before I read the book and it urged me to get a hold of it. The movie is very true to the book - naturally it's unfair to compare the two media, but the script writers did a splendid job. I laughed from beginning to end. Another plus is the choice of actors. Griff Rhys Jones is perfect in the title role and Mel Smith is a tailor made Flynt. I really loved this movie and it made me a BIG Tom Sharpe Fan - I've got all his books now. If you like British comedy you have to see this. You won't see Hollywood produce a \"Wilt\"!","user":"baggy-5","rank":[14,19]},{"title":"Outrageous book, modestly funny film","rating":5,"date":"11 March 2011","review":"I remember looking forward to this just before it came out at the cinema. Great book, great comedy duo and the ever reliable Alison Steadman - what could possibly go wrong! Sadly, an hilarious book doesn't automatically make an hilarious film. As the film is quite faithful to the book its hard to spot it's failings - I wonder if it would have worked better if Mel Smith &amp; Griff Rhys Jones' roles had been reversed? Like the early Morecambe &amp; Wise films, this film demonstrates that without the right material, great comic talent can be left floundering. Toss in the bland 80s soundtrack, very lack lustre direction and adult humour which comes across more Harrison Marks skin-flick than slapstick and this is the result.","user":"malcp","rank":[4,4]}]