[{"title":"The end or the beginning?","rating":8,"date":"26 August 2008","review":"Britain, World War II.<br><br>A symphony conductor who has a few months to live.<br><br>A war profiteer.<br><br>A husband and wife coming to the end of their marriage, their daughter desperate to keep them together.<br><br>An elderly couple conflicted over the death of their son in the line of duty.<br><br>All of them wind up together at the Halfway House, a beautiful, yet strange Welsh country inn. Their hosts are Rhys and Gwyneth, the place appears to be stuck in a time warp, all the visitors here are here for a reason, a reason that will changed all their respective lives for ever.<br><br>Based on the Denis Ogden play, The Halfway House is brought to us from the wonderful Ealing Studios, it is, all things considered, an under seen gem from that particular Studio. There really is no great surprises as regards how the film unfolds, the makers, by way of Mervyn Johns first appearance, are not trying to bluff the viewer in any way, this is a halfway house after all. What drives the picture on is the unflinching stubbornness of the characters, despite the overwhelming evidence available to them, they all refuse to accept the mysterious hammer hitting them over the head. This makes the film a highly enjoyable piece, the mixture of comedy and mystery going hand in hand with it's fantasy led core, come the final reel the viewers should be in a state of warmth because in my honest opinion the film has undoubtedly done its job.<br><br>It's one of those films that wouldn't be out of place on Rod Serling's Twilight Zone show that aired some 15 years later, so enjoy the fantasy and the mystery unfolding, The Halfway House is a lovely little picture. 8/10","user":"hitchcockthelegend","rank":[41,42]},{"title":"Well worth a visit","rating":8,"date":"1 March 2015","review":"This was the first Ealing film I saw, knowing it was an Ealing film, because it was shown as part of a long Ealing film series on UK BBC2 from May 1977. I thoroughly enjoyed it, although then at 18 years old the wartime propaganda element of it paradoxically irritated much more than it does forty years later. Is it blood running cooler or a more resigned luxury of perspective in operation? I feel I have to repeatedly point out with British films made in wartime that present day allowances must be made: if the people in this movie had lost the war they were fighting I wouldn't be here writing this nor you reading it. But if the people who made the film could come back would they think their efforts then were worthwhile is another matter though Every week during that TV series my admiration and awe grew until I realised that British cinema would never again match the art and craft displayed by Ealing at their peak in the '40's and '50's; and by now I've watched some of their classics over a dozen times. However I find that I've seen The Halfway House for only the fourth time - maybe it was meant to be revisited only once in a while, like the ghostly inn itself.<br><br>A group of relatively unhappy temporal travellers find themselves drawn to and ensconced in a weird country inn in Wales complete with an unsettling landlord and his daughter who cast no shadows but end up casting large ones over the guests (and us), and for their own good. They were all fighting their own battles and problems but I admit! the biggest problem was that mine host Mervyn Johns was so firmly robotic in his anti-Nazi propaganda and posturing that his imperiousness ultimately became unconvincing and tiresome. It's a very gentle ghost story but at least it wasn't a musical like Brigadoon. Rather moralistic too and there's an array of familiar faces in here to back it all up: Tom Walls, more taciturn now; Alfred Drayton, Joss Ambler and rakish Guy Middleton, all as sharp as ever; Esmond Knight, in rural Wales one year before he memorably played a village idiot and a psycho in rural England; Sally Ann Howes, so posh you realise what today's inclusive society has lost or gained depending on your own prejudices. Sure that's not Wylie Watson playing one of the Welsh porters? There's plenty of beautiful atmospheric photography amid some lovely country and excellent sets. Favourite bits: Johns in a remarkably underplayed scene of mirror-trickery and his daughter Glynnis – like Peter Pan, in a clever for the time scene of shadow-trickery; the extended dinner conversation.<br><br>There's a few trite moments mainly involving the belief in the afterlife and the acting is rather stagey at the best of times but all in all it's still great escapist entertainment, which has imho er withstood the test of Time. And to hopefully echo back to the cast Glynnis's gentle farewell: good night to you all, see you in the morning.","user":"Spondonman","rank":[13,14]},{"title":"A sweet little ghost story.","rating":8,"date":"20 April 2007","review":"Never having been a fan of the concept of the dead returning to advise the living, I was none-the-less pleased with this charming film. The tragedies that occur during war-time can often be treated as 'due course' by most of us, but we are not usually those who have suffered a loss. Like many stories involving benevolent ghosts or angels, the supernatural beings are metaphors for the hand of God in the lives of the living, seeking to influence them along a better path than that which they currently pursue.<br><br>'Halfway House' is a kind-hearted, quirky little film, with talented character performances. Sally Ann Howes, the gifted musical actress, plays an early role as the daughter of an estranged couple heading for divorce. Her performance was amusing and poignant, as she tries to think of ways to get her parents back together. Françoise Rosay's character desperately attempts spiritualism, trying to contact her only son who has died in the war. They, and the other guests at a ghostly Welsh inn, seem to take a somewhat 'oh, well, so that's it' attitude toward their dearly-departed innkeepers, which makes the film that much more appealing. 'Halfway House' is exactly what it was intended to be, a comfort and a lesson.","user":"silvrdal","rank":[27,32]}]