[{"title":"A \"must see\" for jet air-to-air combat enthusiasts","rating":12,"date":"12 April 2004","review":"First, a bit of history: James Horowitz, West Point class of 1945, shot down a MiG-15 on July 4th, 1952, while flying an F-86E with the 335th FIS, 4th Fighter Interceptor Wing in Korea, and used a typewriter equally as effective as his Sabre. Under the pen name (and later changed his name to)James Salter, he published a novel, \"The Hunters,\" about Sabre pilots fighting in Korea. 4th Wing 2nd Lt. James F. \"Dad\" Low became America`s 17th and most junior jet ace with his fifth MiG kill on June 15, 1952, just six months out of flight school.Unlike the older pilots, many of them WWII veterans, Low became proficient in the use of the new A-4 automatic ranging gunsights on the E and F models of the F-86 Sabre. The novel and movie`s \"bad guy,\" Lt. Pell, is a defiant, risk taking junior fighter jock, played in the movie by Robert Wagner (I`m a killer man! I cut em up,you know!)Both Low and Salter acknowledge that the \"Pell\" character is, in fact, James F. Low. Korean War historians speculate that Robert Mitchum`s character, Major Cleveland Saville, is based on one or two of the four USAF Medal of Honor recipients from the Korean War: either Maj. Louis J. Sebille, who died in his F-51 as commander of the 67th FBS, 18th FBW, or double ace Maj. George A. Davis, shot down in his F-86 as commander of the 334th FIS, 4th FIW. James Salter is pretty much of a recluse, but was interviewed by Tom Brokaw for NBC Nightly News three years ago. The movie`s 54th Fighter Group is apparently a contraction of the actual 4th and 51st F-86 Fighter Interceptor Wings from Korea. The F-86F30 Sabres in the movie were painted with the distinctive yellow band and checkered tail markings of the 51st FIW, but with yellow noses much like the Sabres of the 12th FBS of the 18th Fighter Bomber Wing, and with post-Korean War anti-glare panels. A major technical flaw is an insertion shot of a crashing \"Sabre dancing\" F-100 Super Sabre in place of an F-86. American F-84F Thunderchiefs were painted up and used for the Russian-built MiG-15 in both \"The Hunters\" and \"The McConnell Story.\"  If you look closely, not all of the F-84Fs are painted like MiGs in \"The Hunters.\" The movie`s top MiG pilot is \"Casey Jones\" (7-11, the Crapshooter,)shown to be Chinese. We now know that virtually all the top MiG pilots were Russian. There were many \"Casey Joneses\" flying for North Korea. When bandit trains (an actual phrase used in allied radio jargon and used in the movie script) took off from Antung Airfield in Manchuria, the real or mythical flight wing leaders were dubbed \"Casey Jones.\" A 4th Wing F-86 Korean War veteran told me that Salter`s book was \"too close to the way the 4th Wing really was in Korea,\" and that the Air Force wanted the script changed if they were to cooperate in the making of the movie. Even though a big budgeted movie, budget restrictions prevented producer-director Dick Powell (my mother grew up with him in Mountain View, Arkansas) from filming oversees, preferable in Japan. According to Robert J. Lentz`s excellent book, \"Korean War Filmography,\" \"The Hunters\" combines Korean War aerial drama-in beautiful DeLuxe color and widescreen CinemaScope photography-with more turgid human drama on the ground involving sexual desire and fears of inadequacy. Only a few Korean War films actively depicted the sky battles in \"MiG Alley\" and \"The Hunters\" does so with better aesthetics and greater excitement than \"Sabre Jet\" or \"The McConnell Story.\" Until the advent of \"Top Gun\" and its imitators, \"The Hunters\" remained the premier jet air-to-air combat film in terms of its aerial proficiency.\" I loved the book and the movie as a 12 year old kid in 1958, and have always remembered the tune to Paul Sawtell`s theme music march. For years I searched nationwide for a video of this movie, with no success. A couple of years ago, a friend of mine noticed \"The Hunters\" was on Cinemax at 2 AM and taped it for me. Hopefully, 20th Century Fox will release \"The Hunters\" on VCR or DVD, or, better yet, produce a new Korean War movie involving the legendary air battles between the F-86 Sabre and the MiG-15!!","user":"ntgus","rank":[47,54]},{"title":"It is the superb aviation footage which makes \"The Hunters\" memorable","rating":7,"date":"8 January 2006","review":"North American's F-86 Sabre was the West's premier fighter aircraft during the early 1950s, and superior to any fighter aircraft in the eastern part of the world The F-86 scored consistent victories over Russian-built MiG fighters during the Korean WarHollywood didn't make nearly enough movies about it, but in \"The Hunters,\" we have the opportunity to admire this graceful and agile subsonic equipped with more powerful engines and armament systems that ranged from bombs and rockets to machine guns and cannons <br><br>Robert Mitchum portrays the big hunter, the 'Iceman.' Maj. Cleve Saville was like death: no feelings, no nerves, no fear In Japan, on his way to his first posting in Korea, he meets Lt. Carl Abbott (Lee Philips), a young pilot who thinks he is a bad flier Too much booze was the sign With 30 missions Abbott failed to get any enemy planes His wife Chris (May Britt) doesn't know what to do with him She asks Maj. Saville to look out for him and help him Saville finds himself falling in love with her, with some response from her <br><br>Filling out the story when they finally reach Korea are the first of the jet pilots, Col. Dutch Emil (Richard Egan), and Lt. Ed Pell (Robert Wagner), a rude young guy with big cigars in his face, considered as a 'little stinker who can get MiGs.' Their common enemy is the Chinese ace Casey Jones (Leon Lontoc). His plane has the numbers 7-11 on his fuselage <br><br>The MiGs are based in Red China, across the Yalu River","user":"Nazi_Fighter_David","rank":[35,45]},{"title":"Good air-combat scenes that still hold the attention of the audience, Mitchum and Wagner shine, also.","rating":7,"date":"19 September 2004","review":"\"The Hunters\", released in 1958, showed the so-called forgotten air war from the Korean War. Robert Mitchum portrays an aging air pilot from WWII who manages to find one more war to find some success in. He lands command of an air squadron led by Richard Egan, who was his leader during WWII. Mitchum puts together a wing squadron and starts out on hunting missions. His squadron consists of a nice guy, a loud-mouth guy, and a lush whose wife Mitchum falls for. However, the squadron does come together, and manages to down quite a few enemy planes, including a Korean ace nicknamed K C Jones.<br><br>The film focuses on electrifying flight sequences that hold the attention of the viewing audience, and the cast delivers performances that do carry the story. This film has been finally released in DVD by 20th Century Fox, and I have replaced my taped VHS version with the DVD. It's very watchable, and the flying sequences still hold their own. 7/10, but a strong entry in this genre.","user":"Mickey-2","rank":[19,24]}]