[{"title":"80,s cold-war cult","rating":7,"date":"16 September 2001","review":"This movie is a real 80,s movie but in a positive way. It also brings back those memories of the cold war that used to be. Especially in East-Berlin the movie becomes tense. Besides tense the movie is also quite funny.Anthony Edwards is well-cast as the young man being whirled into the wicked world of espionage behind the Iron Curtain, and I can´t help falling in love with Linda Fiorentino..That woman is so seductive and sexy in a strange mysterious way. She, and the border-tension of East Berlin, is my main reason for really liking this movie...They don´t make´em like this any more....Its Spy Game of the 80,s...","user":"fissiruhl","rank":[22,24]},{"title":"Don't let the picture on the box fool you!","rating":8,"date":"8 November 2000","review":"Gotcha is a perfect example of the old expression \"you can't judge a book by it's cover\".  In this case, you can't judge a film by the art on the video box.  If you can manage to ignore the misleading 80's teen sex romp box art long enough to give Gotcha a chance, what you'll find is a fast paced, surprisingly suspense filled, action-comedy starring everybody's favorite ER doc Anthony Edwards (who knew he ever had this much hair?) as a college loser hoping to find himself as he embarks for a few weeks in Europe.  What he finds is espionage, assassins and a beautiful stranger with a secret.","user":"creamfinger","rank":[31,37]},{"title":"Great Movie","rating":8,"date":"5 April 2004","review":"I remember seeing this movie when it first came out, it instantly became one of my favorites. IT was fun, had a nice plot, and Linda Fiorentino was  a bombshell. If those that have seen it did not notice, but this movie can pretty much be single handedly thanked for PAINTBALL. In fact when the movie came out they even had the Gotcha Guns, which was pitched by quarterback Jim McMahon. The game was played by Anthony edwards(E.R, Top Gun) and his friends around college, they each had a id card and were assigned a person to kill, honestly I thought it to be a great idea that could be a lot of fun.so everyone that is out there playing paintball every weekend which I am sure there are a lot of you, thank this movie.  If you are a fan of the 80's this is a definite must see.","user":"KooLLaiD","rank":[13,14]}]