[{"title":"It's not high art, but I love it.","rating":9,"date":"14 November 2004","review":"This is what I call one of my \"guilty pleasure\" movies. It's not a particularly well-made movie, and it is, admittedly, somewhat dated, but for some reason I never tire of watching it, and it still makes me laugh every time. I'm sure this makes me a geek (and some, I'm sure, will argue a geek with a poor sense of humor), but I think this film is hilarious. I've easily seen it 300+ times and have the whole thing memorized, and I still laugh at it. I love sophisticated comedy, old classics, art-house films, epics, and blockbusters as much as the next guy; but when I just need pure mindless entertainment or a good laugh, I pull out this film, and it always does the trick. Scavenger Hunt has a talented cast of famous names from the seventies, including Richard Benjamin, Richard Mulligan, Cloris Leachman, Tony Randall, Roddy McDowall, James Coco, Cleavon Little, Willie Aames, and Dirk Benedict plus cameos from such names as Vincent Price, Avery Schreiber, Scatman Crothers, Ruth Gordon, Liz Torres, Meat Loaf, and Arnold Schwartzenegger. Richard Mulligan, Avery Schreiber, and Stephanie Faracy play my favorite characters (actually I enjoy the whole servant team, which includes Faracy, McDowall, Little, and Coco). I remember seeing this movie as a kid, and I thought it was so funny (and maybe that's why I like it so much, because it reminds me of my innocent days of youth). I realize this flick isn't for everyone, but I find it humorous and entertaining, and it's clean. Some of the characters are overly broad, some of the humor is stupid, and some situations are simply unbelievable, but if you just go into this movie knowing that it's far-fetched comedy for comedy's sake and understand that it isn't taking itself seriously, you can still have a good time. I know I have.","user":"Griffinkay","rank":[22,25]},{"title":"An Unsung Classic","rating":8,"date":"7 October 2003","review":"This movie has not been given the credit it deserves.  An all star cast, well written script, and crazy situations makes this movie a classic, in my opinion.<br><br>If you enjoy movies like \"Rat Race\", \"It's A Mad Mad Mad World\", and \"Dirty Rotten Scoundrels\", you'll love Scavenger Hunt.  It is very dated (1970s period) but it is definately worth watching.  By the way...keep an eye out for several camios including a very young Meatloaf and Arnold Schwarzenegger.","user":"scheisty69@yahoo.com","rank":[11,12]},{"title":"A \"who's who\" of 1970's t.v. icons having fun at it's best","rating":28,"date":"28 June 2002","review":"This is a fun, adventurous, witty movie that the gang will love. In tradition of the original \"It's a Mad Mad Mad Mad World\" and the \"Cannonball Run\" series, this is another fun movie where you see your favorite t.v. stars of the 70's in situations that you normally wouldn't see them in. It's great comedy and you don't have to worry about harsh language and the adult humor you would see in more recent movies of the same sort. It's a good summer movie for the whole family to watch on a Saturday afternoon. You'll be surprised at who you will see in the film.","user":"rob_w_lowe","rank":[11,12]}]