[{"title":"Very, very '80s and very very good","rating":9,"date":"2 March 2000","review":"I hated the 1980s when I lived through them, but looking back from a distance, it's easier to make sense of them. Rita, Sue and Bob Too is an exemplary British '80s film. It's not very pretty - Rita and Sue are two giggling teenage girls, all decked out in white - from their stilletos to the highlights in Sue's hair. They live on a sink-hole council estate in Bradford. Bob is \"middle-class\" in that he lives in sterile private housing - all nice lawns and open spaces. But Bob drops his \"h\"s too, and wears a gold chain.<br><br>The three begin a \"relationship\" which is based on sex. None of the characters are represented as particularly nice, but instead they're \"real\". I knew a lot of Ritas and Sues when I was growing up, and the two young actresses who play these parts do a stellar job.<br><br>For me, a lot of the humour in the film derives from the depictions of \"class\" - from Sue's awful drunk father uselessly brandishing a baseball bat, to Bob's wife - clearly only about half a stilleto heel up the social ladder than Rita and Sue, but desperate to be seen to be something better. Her acting is stilted, laughable, awful. But it's supposed to be - the character is acting at being posh - badly. Lines like \"Make your own f**king tea\" when she's trying to impress and intimidate the girls are wonderfully comic.<br><br>I also like the racial slant to the film - the guy who plays Sue's Asian boyfriend is attractive, and presented both sympathetically and unsympathetically at the same time (like most of the lead characters in the film) - at first he's nervous around Sue, but quickly tries to assert control over her. When Sue drops him, he's pathetic again, but this too is only a ruse. I think this film paved the way for later films like \"East is East\", which reminds me of it a lot.<br><br>I also like the depictions of gossipy, interfering neighbours - both from the under-class estate (especially the strange old man who dances in glee at the \"street-fight\") and the middle-class private housing (the guy who endlessly waters his plants in the garden so he can spy on the events in Bob's house). One of my favourite sequences is when Bob's wife's friend comes to tell her that she's seen Bob with the girls. Her fakey \"concern\" is shown - not by speech, but by the fact that she is half running to the house: she can't WAIT to tell her news and ruin the relationship. All of this is so cleverly and wittily observed, in a completly understated way.<br><br>This is a brilliant film. Put it on your \"must-see\" list.","user":"bakerjp","rank":[41,46]},{"title":"This is a vastly under_rated film","rating":10,"date":"10 January 2004","review":"Someone has previously posted that this film is about class and social division which is certainly true and one of the many sub-texts of the screenplay. It interests me that reaction to this film also seems to be delineated along class lines and social division.  When I've mentioned this film in passing to middle-class types they turn their noses up in horror and say this film is so 'depressing'.  In contrast, to anyone from a hum-drum town anywhere in the British Isles (in my case Ireland) or inner city working class background, a mention of the film if they've seen it, brings on a laugh and smiles of recognition of shared experiences.<br><br>Hyper-realism may prevail in this film but there are many many reasons to watch it. The most important of which is to be reminded, if one needs reminding, what devastating changes took place during Thatcher's political reign during the 80's. The appalling errosion of social housing and services, and the introduction of the exploitative Youth Training Schemes which paid a pittance to participants. Overcrowded classrooms, and few opportunities to socialise meant teenagers had to make their own fun just like Rita and Sue.<br><br>To me no other film evokes the 80's like this film, it always brings me out in tears of laughter as I recognise the characters from my own life. Practically every girl in my home town dressed exactly like Rita and Sue, bare legged and white stillettoed. I can't remember any other film that captures the teenage mischieve-ness and innocence of 80's teenagers. That scene where they go to the museum with the other school girls and exiting onto a cobbled Yorkshire street Sue utters the immortal line: '..she called me a slag so I hit her!, after assaulting a virgin classmate, is a real hoot. For me the funniest scene is when Rita and Sue start giggling in embarassment as Bob and The Wife start having a barny after returning home after a night on the tiles. (N.B. if Rita and Sue have been hired as babysitters how come we never see the kid they're babysitting?)<br><br>\nThis film is not depressing. The two main protagonists (Rita and Sue) are finding fun, excitement and adventure (isn't it better to be walking around in cow dung getting fresh air and a 'jump' from the middle class neighbour in a car than loitering around a dreary housing estate?) as an antidote to their hopeless circumstances. They don't feel anymore more victimised than Bob's wife. They maybe poor and working class; but they're getting bonked regularly unlike Bob's missus!<br><br>The performances are absolutely sterling, there are no false moves or corny lines. And Lesley Sharp is truly comical as she jumps on Bob's suit and calls him every name under the sun. For me the actor who shines most is Michelle Holmes, and I always love watching her whatever role she's playing ever since seeing her in this film.<br><br>I wish the bourgeois critics could put aside their own prejudices and snobberies and see this film for what it really is. A gritty realistic picture of 80's England and a precursor to the highly successful 'Full Monty'. It is also a great heart warming film for adults that was way ahead of its time when it was being made in the mid 80's. Every time I see it I laugh out loud - if you're ever feeling  a bit down, watch this film! It will blow the cobwebs away completely, trust me!<br><br>As far as I'm concerned this is up there with 'Brief Encounter' as a classic British film. I'm serious!","user":"dannyfitzuk","rank":[27,33]},{"title":"Sad and funny and bleak and positive","rating":8,"date":"21 February 2000","review":"This was an excellent low-budget film full of strong performances.  Set in the North of England it follows two schoolgirls and a philandering husband on what appears to be a dirty and sleazy romp.  But none of these people deserve their grim and loveless lives.  None of them are \"bad\" and there are no victims.  This is not so much a morality play as an immorality play. When Bob says that his wife doesn't understand him, he is right. The \"seduction\" scene in the back of his car is one of the best ever.  With hindsight, it is impossible to tell who is being seduced.<br><br>Made for TV by FilmFour the camerawork reminds me of a soap opera.  The scenes are largely drab and impoverished but Rita, Sue and Bob have fun ! When they are together the world seems a better place. The scene at the dance with the terrible 80's party band Black Lace is wonderful, they are having a such a great time and it is in such contrast to their grim reality.<br><br>The ending is wonderful.","user":"shell-26","rank":[25,34]}]