[{"title":"Great trashy fun.","rating":7,"date":"30 May 2014","review":"William Dorn (Chuck Connors) is an angry and disturbed man. Frustrated over the drug overdose of his daughter, he decides to strike back at anyone whom he's imagined was responsible for her death. But what he really wants to do is punish society at large. He'll even leave bombs at feminist gatherings. Determined to nail this paranoid villain is grouchy, hard nosed detective Geronimo Minelli (!) (Vince Edwards), the kind of guy who does anything it takes to get his man. That includes working with the one man who can identify Dorn, and HE turns out to be a rapist! George Fromley (Neville Brand) is loathe to cooperate with Minelli until he realizes what the cop is capable of.<br><br>Producer / director / screenwriter / cinematographer Bert I. Gordon (a.k.a. Mr. B.I.G.) is better known for his \"giant monster\" flicks of the 1950s, but this endlessly amusing pile of garbage that he's created deserves to be just as well known. He brings the sleaze in a major way; his movie is slow at times and crude, but undeniably a real hoot. Fans of 1970s exploitation will be delighted to note the abundance of nudity (provided by Ilona Wilson as Fromley's wife) and the wonderfully graphic gore. Of course, it's the acting that really brings this one to life. Edwards is good as the unrelenting protagonist, and Brand is a very effective creep. Hank Brandt, Christina Hart, and Ted Gehring co-star, but it's Connors who will command most of your attention. With an array of truly priceless facial expressions, he's a hysterically nutty bad guy. The icing on the cake is a music score by Michel Mention that's sometimes entertaining but is also hilariously AWFUL at other times. The movie establishes Dorn in a great way right up front, as he chastises a stranger for littering on the sidewalk.<br><br>Well worth seeing if you like your cop thrillers to be on the trashy side.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[5,5]},{"title":"A Bert Gordon Film Without a B.I.G. Monster","rating":20,"date":"20 June 2005","review":"This is probably the only decent film that Bert I. Gordon ever did in his career. The story film is full of tension as we see the protagonist, Geronimo Minelli, not only hunting down the bomber, but he must also try to save the life of the creepy rapist who witnessed his second bombing. Vince Edwards does a pretty good job playing Minelli and Chuck Connors is good as Dorn, the title bomber. Connors really shows how much he really wants to get back at the people he feels has wronged him, and goes about his \"work\" with such cold, unemotional efficiency. However, Neville Brand steals the film as the rapist. Brand showed why he was one of the more popular villains in film with his disturbing performance. Its a shame that this picture isn't shown on television anymore.","user":"Sargebri","rank":[5,5]},{"title":"Dynamite sleaze.","rating":20,"date":"20 August 2004","review":"One of the more solid selections from the Bert I. Gordon roster, \"The Mad Bomber\" is the heartwarming tale of a man spiraling into insanity who decides that the sinful world needs to be punished through serial bombings. Chuck Connors plays this part well, but it's Neville Brand's show all the way as a pathetic scumbag rapist who holds the key to stopping the T.N.T maniac. Fairly terse low-budgeter is quite grueling at times, and deserves more substantial notoriety. <br><br>A flick likely to turn up on a local TV \"Late, Late, Late Show\", though possibly missing some of the more graphic moments. Still, worth a look and recommended.<br><br>5.5/10","user":"EyeAskance","rank":[15,20]}]