[{"title":"A wonderfull flashback!","rating":23,"date":"23 November 2002","review":"I'll admit that like many others here this is a movie I've seen many times as a kid in the 70's. :)<br><br>The concept and story are just wonderfull.  My favorite type of sci-fi, the kind that makes you think and doesn't completely bombard you with special effects.<br><br>Speaking of special effects, without spilling any beans I can say if you like The Thunderbirds, you'll love the SFX in this movie.<br><br>Gets a 8 on 10 for me.","user":"Lost_cow","rank":[24,24]},{"title":"Tour the solar system on $5 a day","rating":23,"date":"23 December 2003","review":"Spoiler Alert!! 100 years from now scientists discover a new planet in the solar system hidden on the far side of the Sun.  It shares earth's orbit and revolves at exactly the same speed so that it has remained undiscovered until now.<br><br>A consortium of nations collaborate to send two men to the new planet. Security leaks frustrate their desire for secrecy. The two men crash on the surface of the planet and are surprised to wake up back on earth.  They are accused of turning back halfway in their journey since a roundtrip flight would have taken twice as long as their trip.<br><br>One of the men dies of his injuries and the other becomes disoriented by his surroundings -- everything is reversed: cars pass on the wrong side of the road, words and letters are flipped. His interrogators are convinced when he can quickly recite lengthy passages of text read in a mirror.  When an autopsy on the dead astronaut reveals that his organs are in reversed position, the conclusion is bizarre -- the men did indeed complete the journey but landed on a parallel/mirror-imaged earth.  All matter is duplicated, and each person has a doppelganger partner on the far side of the sun. They attempt to return him.  With disastrous results.<br><br>While it doesn't rank in the top tier of sci-fi classics, Doppelganger is still worth looking for.  This film (aka, Journey to the Far Side of the Sun) is an oddity, beginning as pure SCIENCE-fiction then suddenly turning surreal -- almost fantasy. Slow by today's standards, it's intriguing if you put yourself in the mindset of its era, the space-race 60's.  (Suiting up and preparing for blast-off was more carefully depicted compared to how someone would film it today) I'm particularly impressed by the art/costuming/production design; it doesn't suffer from a cliched \"vision\" of what the future would look like. It's a low-budget poor-relation to GATTACA in this regard. The movie indulges in some delightful \"gee-whiz\" gadgetry -- [A spy uses a miniature camera in his prosthetic eye to record holographic images.  A trans-Atlantic flight ends with the craft disassembling itself on the runway so that the passenger section is carted separately for disembarking. Wrist-bands monitor everyone's vital stats and reminds them to take their meds.]  This was the sort of attention to detail that embellished \"2001: a Space Odyssey\", but on a much cheaper budget.  Often the miniatures don't look realistic -- but they were always very well crafted and painstakingly rendered.  This included a large number of rocketry, vehicles and many outdoor sets (buildings, launch pads, roads).  I admired them even in their artificiality; it lent a surreal tone to the project.<br><br>Roy Thinnes does a serviceable job in the lead (not his usual blandness) and it's fun to find another performance by Ian Hendry (whose brief career included the first season of TV's \"The Avengers\", and the sadistic guard Sgt Williams in THE HILL) Patrick Wymark is good as the pushy authoritarian who heads up the project. After the fateful conclusion -- where all evidence is destroyed that might prove the existence of the Doppelganger world -- he is left as a broken mumbling invalid.  The film ends as he rolls his wheelchair excitedly into his mirrored reflection.","user":"Swift-12","rank":[33,35]},{"title":"Love it or hate it","rating":27,"date":"27 September 2003","review":"Most people who enjoy this film enough to sit through it multiple times probably first saw it, as I did, during their childhood back in the late 60's - early 70's.  It was one of the first science fiction movies I saw as a child and it made enough of an impression on me for me to remember it decades later.  It was more thought-provoking than your average 1960's \"space opera\" and the special effects were among the best of its time (second, at the time, perhaps only to '2001' which came out about a year earlier).  And although the people behind it were definitely influenced by Kubrick's earlier masterpiece, it contains enough original thought to be fascinating in its own right.  Most adults who didn't see this movie when it first came out will probably be too critical to be able to enjoy it if they were to watch it now.  As for today's younger audiences, they would probably tend to measure it by the standards of today's movies with their much more advanced special effects and simply dismiss the film as too archaic for their tastes.  Unfortunately, this movie is probably destined to languish in ever-increasing obscurity as its original audience gets older and eventually fades away...","user":"x564","rank":[35,38]}]