[{"title":"An Intelligent and Solid Film About Divorce","rating":8,"date":"9 November 2007","review":"After a decade of turbulent unrest, American movies began to switch gears and turn their cameras away from war-torn battlefields, political corruption, and general social unease to the more intimate world of family dysfunction. The toll the selfish Baby Boomers began to take on the American family as they grew up and had kids of their own was making itself felt.<br><br>\"Kramer vs. Kramer\" is one of the first of these dysfunctional family dramas that would continue to be so popular throughout the 1980s, and it's one of the best. It gets a rather bum rap now, because it's known as the film that beat \"Apocalypse Now\" for the 1979 Best Picture Academy Award, but comparing these two films is like comparing a banana to a marinated chicken breast: they're not remotely the same, but can't we enjoy them both? Director/writer Robert Benton doesn't try to do anything fancy with his movie; its strength lies in its performances, those of Dustin Hoffman and Meryl Streep particularly, playing a divorced couple fighting childishly and selfishly over their son. The courtroom scene in which they duke it out for custody, and in which each is forced to hurt the other in terrible ways, is devastating, and feels authentic. The movie doesn't present Hoffman's solid dad as a hero, or Streep's straying mom as a villain. They're neither good or bad as people -- they're simply bad at being married.<br><br>The film is tear-jerky at the finale, but not in a manipulative way. It earns its right to elicit sobs.<br><br>Grade: A","user":"evanston_dad","rank":[79,90]},{"title":"Going Up?","rating":10,"date":"10 September 1998","review":"A beautifully done film rich with symbolisms that could be invisible to the unaware eyes. The elevator scene for example symbolizes two main themes of the movie, separation and emotion. One could notice that the first scene showed Joanna going down the elevator, symbolizing her feeling of depression, likewise Ted goes down the elevator after the last trial scene - knowing that he probably lost the case. On the other hand, Ted brings Billy to see his new office and it was another elevator trip but this time going up, showing the joy and excitement both have. Lastly, one could notice that both Ted and Joanna never are together in one elevator - with this we can foresee that they will never get together even in the end. The symbolism of separation with the use of the elevator shows this even though we never find out in the end.","user":"jaydj","rank":[14,14]},{"title":"Brilliant drama","rating":10,"date":"8 June 2000","review":"\"Kramer vs. Kramer\" is a terrific drama about an unhappy woman who walks out on her husband and young son. The husband now has to take up the responsibilities of taking care of the boy. As he does, they get to know each other better. But then, the mother and wife returns, and she wants custody of the boy. \"Kramer vs. Kramer\" has lots of drama with some wonderful bits of comedy thrown in for good measure. Dustin Hoffman won his first Best Actor Oscar for his brilliant performance here. Most people say his performance in \"Rainman\", which won him his second Oscar, is his best. He was great in that film, but I disagree that its his best. In my opinion, the best performance of Hoffman's career is in this movie. Scene after scene shows us why Hoffman is one of the best American actors working today. He's also funny at times. Also giving a terrific performance is Meryl Streep, who wasn't as well known when she made this film like she is today. Streep, like Hoffman, also won her first Oscar (for Best Supporting Actress) for her work in \"Kramer vs. Kramer\" as the wife and mother who tries to find herself after walking out on her family. Justin Henry, who was only 8 years old when the film came out, is wonderful as Hoffman and Streep's son. He won an Oscar nomination for his role here, and still to this day he is the youngest performer to receive an Oscar nomination in a competitive category (Best Supporting Actor). Jane Alexander is also fine as a conserned family friend. She too got an Oscar nomination (for Supporting Actress where she lost to co-star Streep). \"Kramer vs. Kramer\" is a great film from start to finish. Writer-director Robert Benton has made a film that's absolutely unforgettable. <br><br>**** (out of four)","user":"jhaggardjr","rank":[87,105]}]