[{"title":"Great First Half. But Than, Stripes Loses Comic Punch.","rating":6,"date":"6 May 2008","review":"Stripes begins as a fine and very funny military service farce with Bill Murray losing his job, girlfriend, and apartment, all in the same day. He decides, with his good buddy Harold Ramis, that they should both join the Army. Some of the funniest parts of Stripes are in the beginning of the movie with Bill's character trying to do push-ups, exhausted as he is trying to do as little as 5. Ramis cracks, \"I think your ready for the Special Olympics!\" Harold also shines in a bit-part in teaching English to a class of all foreign students. He finds out that there are only a few in the class that speak any English at all. He asked a student who raises his hand, \"You speak some English?\" The student answers back \"SOB and $hit\" and the whole class than repeats it.<br><br>The Basic Training sequences are very funny. Warren Oates shines as a tough drill Sergent, and in addition to SCTV alumni Ramis, John Candy joins the fun as likable, lovable \"Ox.\" There are the typical sex gags, simple jokes, visit to a strip bar, that you would expect in this type of movie and Murray, Candy, Ramis, and Oates keep the comedy fun to watch. However, this is probably due more to the talents of these actors, rather than the storyline, which was done a year earlier with Goldie Hawn in another similar Army movie, Private Benjamin. There is nothing new or original about Stripes. Its best parts are in the first hour.<br><br>After the graduation from Basic Training, our likable recruits are assigned to man a top secret vehicle on a special assignment in Europe. Here is where this great comedy falls apart, because at this sequence of the movie, all the good parts have already happened, so the viewer has to spend about 40 minutes watching the group operate the machine, having silly one-lines like, \"Wow!!! let's see what this thing can do.\" rescue some of their group who get temporarily captured in Czechoslovakia, and than arrive home to the predictable hero's welcome. The film goes from funny service farce to a bad Robocop sequel. It's almost as if the European mission sequence was needed, because the producers didn't want to end the film at 90 minutes.<br><br>I suppose that it was needed for the recruits to do something with their Army training. The problem is that once the team gets to Europe, the things they do aren't funny anymore and the plot wears thin because of this. The first half of Stripes gets a solid 8, the second half (a generous) 4. Therefore, my overall rating of Stripes is a 6.","user":"jbartelone","rank":[36,39]},{"title":"It Can Stand Up To Goofballs.","rating":6,"date":"15 December 2009","review":"Despite the fact that there is no way on God's green earth or this country's army that such a set of circumstances could ever happen, that's still no reason not to enjoy Stripes. The film is in a long line of service comedies that date all the way back to Charlie Chaplin's Shoulder Arms and further than that. Even Shakespeare found some humor in army life, just read how Falstaff made do in the service of his king.<br><br>Of course Falstaff wasn't a drill sergeant like Warren Oates who had a platoon of underachievers with the likes of Bill Murray, Harold Ramis, and John Candy as recruits. As is usual the service comedies make a mistake in that the basic training company stays intact with the same sergeant. In real life Oates would have taken a drink when the eight weeks was done and gone on to some fresh young trainees.<br><br>But some brain in the Pentagon decides that what a new type urban assault vehicle needs is some fresh recruits to maintain it, reasoning if the vehicle is worthy it can stand up to goofballs. The vehicle looks like your ordinary average camper, in fact Murray and Ramis while they're guarding it decide it would be a great chick magnet. So they pick up a pair of female MPs in P.J. Soles and Sean Young. <br><br>The officer in charge is John Larroquette who isn't much better than the recruits he has and when the vehicle turns up missing, he sounds the general alarm worthy of the Captain in Mister Roberts. He leads the whole troop after Murray and Ramis right into at that time Communist Czechoslovakia and some nasty Russians. Good thing they didn't have their A team playing either.<br><br>Stripes is your typical armed service comedy with a nice Eighties twist from Bill Murray and a crew from Saturday Night Live just coming into their prime as players. John Larroquette is the best in the film, imagine ADA Dan Fielding in an army uniform and you got Larroquette's character. You notice the New York County DA's office never gives Fielding any really big cases to handle.<br><br>And yes that vehicle can withstand anything and it has more tricks than James Bond's Astin-Martin. To see what and how much, you have to watch Stripes.","user":"bkoganbing","rank":[16,20]},{"title":"That's the fact Jack!","rating":10,"date":"29 June 1999","review":"Stripes is firmly planted in my vernacular as one of those films that helped shape me as a twelve year old boy. It is also one of those films that made me become the film lover that I am today. I know films like Star Wars and it's two sequels, First Blood and Rambo, Jaws and it's sequel, Halloween, Back To The Future, Ghostbusters, Raiders and it's sequels and Stripes ( there are many others but this review has to be under 1000 words )taught me the beauty of how a movie can make you feel. And Stripes was the first movie that me and my best friend at the time ( Gary ) ever memorized word for word. And I think that it is this movie that established Murray, Ramis and even guys like Candy and John Laroquette as comedians. It also has a small role for Bill Paxton in it somewhere. It was also a great stepping stone for the three amigos ( Murray, RAmis and Reitman ) to get funding for a bigger project like Ghostbusters. And if you were an executive at Columbia you would probably hand them a blank cheque for that project after seeing this film. Simply put this film is a classic in every sense of the word.<br><br>Stripes tells the story of how John Winger and Russell Ziskey ( Murray and Ramis respectively ) are two losers in life. Winger is an inept cab driver that hates his job so much that he throws his keys off the city bridge one day while driving an annoying lady to the airport. Ziskey is a terrible English as a second language teacher. And he is so inept that he tries to get is class to sing songs during class as their lesson. \" I met her on a Monday and my heart stood still \" Ziskey sings, and his class responds \" da do da da da da da da da do da da da da, \" and the he congratulates them and dismisses them until next week.<br><br>After Winger informs Ziskey that in the last three hours he has lost his job, his car, his apartment and his girlfriend, they decide to join the army. And then all hilarity breaks loose. It is here that we meet an assorted cast of hooligans and misfits that add to the enjoyment of the movie.<br><br>You have Ox ( Candy ) as an overweight guy who thinks the army is a perfect place to lose weight for free. There is Francis Sawyer, but everyone calls him Psycho, as a nut that thinks he is in Vietnam or someplace. You also have Cruiser, who joined the army because his father and brother were in the army and also because he thought he should join before he got drafted. Then there is Elmo, who is played by a pre-Fast Times Judge Reinhold. He is a wasted jolly stoner who is jjst looking to get stoned. Why he is joining the army is a little perplexing, but really, who cares? He is fun to watch so little details like this are overlooked. And of course we have Sgt. Hulka played with absolute earnestness by the late great Warren Oates. Needless to say, it is an interesting bunch of characters.<br><br>The film works for various reason, but mainly because Ramis and Dan Goldberg have written a hilarious script that puts the misfits through one twistedly funny situation after another. If only the army were this fun, everyone would want to enlist.<br><br>The first half of the film works because of the basic training scenes. The second half works because the misfit recruits are assigned to protect a secret R.V. that the army has concocted. Winger and Ziskey of course can't stay bored for long and they take the R.V. out for a run to Austria to go pick up their girlfriends.<br><br>Stripes is one of the funniest movies ever made and it should be checked out by younger people that were born after 1980. I was about 12 when I saw this and my dad laughed at this just as much as I did. And if all you have to go on for comedy is things like Waterboy and Big Daddy ( very funny movies in their own right ) you are missing some great older comedy. You should really check this out.","user":"baumer","rank":[59,86]}]