[{"title":"Surprisingly Good!","rating":10,"date":"25 October 2001","review":"I was not expecting much when I rented this from my corner store. I rented it anyway because I'm a huge horror movie fan. Most of the time when I rent crappy looking films, they turn out being crappy. This time I lucked out. This movie was really, really good. The plot is nothing new but it is very fast paced and suspenseful at times. The acting is good too. Give it a look if you see it. It is surprisingly enjoyable. A lost gem that deserves more attention.","user":"REDdog-1","rank":[15,23]},{"title":"Disappointingly generic slasher movie","rating":4,"date":"10 July 2016","review":"Jose Ramon Larraz was a Spanish director of horror pictures who was well known in the 1970s for his atmospheric, uniquely-shot movies like SYMPTOMS, DEVIATION, and VAMPYRES. However once his glory days were behind him he kept working through the 1980s, usually churning out cheap exploitation movies, and 1990's DEADLY MANOR is such a film. As with a number of Larraz's other productions, this one was made abroad, in New York in this instance.<br><br>The plot is entirely undistinguished and completely clichéd. Your stereotypical group of teenagers end up in an old deserted manor house which they soon discover is occupied by someone or something decidedly deadly. What follows involves your usual slasher antics as the group turn up dead in gruesome ways, one at a time. In the end the survivors have to band together to try to unmask the villain in their midst.<br><br>DEADLY MANOR is generic stuff indeed and the poor production values don't help it very much. The acting is pretty much the pits and the cinematography is very dark, inducing eye strain in the viewer. Larraz fails to bring much in the way of atmosphere to the picture and indeed he seems to have left his expertise at the door. There's a little gore and nudity on display here and I imagine most horror fans will find this film tests the patience more than anything else.","user":"Leofwine_draca","rank":[4,6]},{"title":"Not bad at all","rating":6,"date":"5 December 2003","review":"Contains Spoiler I took a chance on this one and bought it anyway. It turned out to be really quite good, despite the plot being old and predictable and some of the acting just a bit dodgy.<br><br>There are some quite nice touches:the smashed up car as a memorial, naked pictures of Jennifer Delora all over the house (and well worth seeing!), the hitch hiker who turns out to be a red herring.<br><br>Also your stock 'stupid teenagers' who aren't at all put off spending the night in this 'abandoned ' house (with no broken windows) by coffins in the cellar, bottled scalps in the cupboard, yesterday's paper in a chair and lights left burning.<br><br>Nevertheless quite an entertaining, cheap film and far better than many that cost much more to make. Worth a look.","user":"johnson50","rank":[5,10]}]