[{"title":"Another Wonderful Classic Western.","rating":8,"date":"19 May 2010","review":"\"A HUNDRED YARDS TO THE STATION - A HUNDRED SECONDS TO GET THERE<br><br>AND A HUNDRED BULLETS SAYING.... THEY'LL NEVER MAKE IT\"!<br><br>So goes the explosive text on the poster for Columbia Picture's 3.TEN TO YUMA (1957). An iconic western 3.TEN TO YUMA has quite deservedly taken its place in the pantheon of classic fifties westerns alongside \"Shane\", \"The Searchers\", \"High Noon\" et al. From a story by the tireless Elmore Leonard it was beautifully written for the screen by Halsted Welles and produced for the studio by David Heilwell. With stark monochrome cinematography by the great Charles Lawton Jr. the picture was arguably the best directorial effort to come from master craftsman Delmer Daves.<br><br>Glenn Ford heads a superb cast as notorious outlaw Ben Wade who, with his gang, holds up the Butterfield stagecoach, kills the guard and relieves it of its strongbox contents. Van Heflin is Dan Evens the struggling small rancher who - with his wife (Leora Dana) and two small sons try their best to eke out a living on their dried out small holding. But without rain or the money to buy water rights for a nearby stream to water the cattle Dan finds it difficult to carry on. But then luck comes his way. Wade is captured by the posse and the Sheriff offers $200 to anyone who will take Wade to Contention City and transport him by train on the 3. ten to Yuma prison. Dan immediately accepts the job and so begins a tension filled few hours as Dan holds his captive in a Contention hotel room to wait for the train. And all the while staving off the efforts of Wade's men to free their boss as well as contend with Wade trying to psych him out with tempting bribes to let him go. Excitement reaches fever pitch when its time to leave the hotel and go for the train. But then just as Wade's men are closing in for the kill, and in a surprise move, Wade capitulates and actually helps Dan to get him aboard the moving train.<br><br>Performances are excellent! Ford has rarely been better! As Ben Wade he is roguish, cool and throughly likable. Heflin is great too! His Dan Evens looking almost like an extension of his Joe Starrett from \"Shane\" four years earlier. And Looking gorgeous is the beautiful Felicia Farr in a splendid cameo as the girl in the saloon. There is a lovely moment at the bar in the empty saloon when Wade is trying to seduce her (\"Ye know ye look kinda skinny - but I don't mind a skinny girl if she's got blue eyes\"). Poignantly scored and beautifully directed - the scene in close-up, as he kisses her, is both amorous and heartfelt and played out by two superb actors.<br><br>Providing a wonderful atmosphere to the movie is the music of composer George Duning. Duning was composer in residence at Columbia Pictures and scored most of their prestigious productions like \"Bell,Book &amp; Candle\", \"The Devil At Four O'Clock\" and his best known work \"Picnic\" (1956) in which he pulled a master stroke by combining the tune Moonglow with his own love theme to great effect for the evocative scene where William Holden dances with Kim Novak. His music for 3.TEN TO YUMA boasts a lingering central theme. It is given lovely renditions throughout especially for solo guitar and distant solo female voice. Then with added lyrics by Ned Washington it was turned into a brilliant ballad and sung over the titles by the inimitable Frankie Laine.<br><br>Fifty years after 3.TEN TO YUMA an unfortunate revisionist remake was produced. It improved on the original NOT one iota and only served to emphasize how good the Delmer Daves classic really is!","user":"jpdoherty","rank":[51,53]},{"title":"Original Still The Greatest","rating":10,"date":"4 October 2007","review":"Long before it was re-made, I treasured this modest gem of a western.<br><br>From the first notes of its mournful, affecting theme to to the poignant finale it draws you in and keeps you riveted as the tension mounts. It accomplishes this by keeping to the Aristotelian unities: a single theme about a single protagonist on a single day. Yes, there is an obvious parallel to **High Noon**.<br><br>Though cast as a villain for the only time in his career, Glen Ford's natural likability shines through in the role of gang boss Ben Wade. Van Heflin's Dan Evans is Everyman--no hero but spurred to heroism by desperate circumstances and devotion to family. In contrast to Heflin's homeliness is the godlike physical perfection of the young Richard Jaeckel as the outlaw gang's second-in-command, smart, dangerous, utterly amoral yet loyal unto death to his boss.<br><br>There is not a bad performance anywhere. But I must single out Felicia Farr as the lonely barmaid who gives Ford a last, quick good time, and craggy-faced Ford Rainey as a town Marshal with a plan.<br><br>With its mix of deep focus shots and closeups of the actors' faces, the cinematography was the obvious inspiration to Sergio Leone in his spaghetti western series.","user":"kayaker36","rank":[38,43]},{"title":"Room 207 and the 3:10 To Yuma.","rating":8,"date":"16 November 2009","review":"Van Heflin plays rancher Dan Evans whose family and livelihood is at breaking point due to a devastating drought. Needing money fast, Evans gets thrown a financial lifeline when a reward is offered to escort a recently captured outlaw, Ben Wade (Glenn Ford), on to the 3:10 train to Yuma prison. But as Wade's gang closes in to free the shackled outlaw, and the clock starts to tick down, Evans finds himself torn between a sense of social duty and an easy option courtesy of Wade's mind game offer.<br><br>Based on a story by Elmore Leonard, this is a tight and tense Western that harks to the wonderful High Noon five years earlier. Directed by Delmer Daves, 3:10 to Yuma sees two of the Western genre's most undervalued performers come together in perfect contrast. Heflin's Evans is honest, almost saintly; but ultimately filling out his life with dullness and too much of a safe approach. Ford's Wade is the other side of the coin, ruthless (the opening sequence sets it up), handsome and very self-confident. This coupling makes for an interesting story-one that thankfully delivers royally on its set-up. As Wade's gang closes in, led by a sleek and mean Richard Jaeckel, Wade toys with Evans, offering him financial gain and gnawing away at him about his abilities as a husband, the tension is palpable in the extreme. Nothing is ever certain until the credits role, and that is something that is never to be sniffed at in the Western genre.<br><br>The comparison with High Noon is a fair one because 3:10 to Yuma also deals with the man alone scenario. A man left alone to deal with his adversaries and his own conscience; money or pride indeed. Daves' direction is gritty and suitably claustrophobic, with close ups either being erotically charged {watch out for Felicia Farr's scenes with Ford in the saloon} or tightly wound in room 207 of the hotel; where Heflin &amp; Ford positively excel. His outdoor work, aided by Charles Lawton Jr's photography, also hits the spot, particularly the barren land desperate for water to invigorate it. While the piece also has a tremendous George Duning theme song warbled (and whistled by Ford in the film) by Frankie Laine. Great acting, great direction and a great involving story; essential for fans of character driven Westerns. 8.5/10<br><br>Footnote: The film was very well remade in 2007 with two of the modern era's finest leading men, Russell Crowe &amp; Christian Bale, in the dual roles of Ben &amp; Dan respectively. One hopes, and likes to think, that they remade it purely because it was such a great premise to work from. Because Daves' film didn't need improving, it was, and still is, a great film showcasing how great this often maligned genre can sometimes be.","user":"hitchcockthelegend","rank":[16,17]}]