[{"title":"Universal's second-best Invisible Man movie","rating":7,"date":"1 November 2008","review":"Generally speaking, the horror films from the \"New Universal\" period (1937-1946) aren't as good as the ones from the era when Carl Laemmle, Sr. and Jr., were still in control of the studio (though \"Son of Dracula,\" a moody masterpiece, is not only the best in Universal's vampire cycle but the finest vampire film ever made in the U.S.). \"The Invisible Man's Revenge\" isn't the equal of the peerless 1933 Laemmle-era original, but it's certainly better than the previous run of \"New Universal\" Invisible Man movies. Jon Hall, relatively dull as the hero in \"Invisible Agent,\" proves surprisingly effective as a full-throated villain (in this version he's a psychotic madman BEFORE becoming invisible); Leon Errol's dry wit is several cuts above the usual un-funny \"comic relief\" in these films; Lester Matthews and Gale Sondergaard make a nice guilt-ridden couple for the Invisible Man to have his titular revenge on; Alan Curtis and Evelyn Ankers are certainly more than competent as the romantic leads; John Carradine is in good form as the rather dotty scientist with the invisibility formula; and the direction by Ford Beebe, usually a name associated with Universal serials, is convincingly Gothic and well-paced. Universal was on the downgrade as a horror studio by then (and their only further foray into invisible man-dom would be an Abbott and Costello vehicle in 1953) and some of the effects work is sloppy, but on the whole this film is convincing and vividly atmospheric. Incidentally, in \"The Face of Marble\" from Monogram two years later (another underrated film with a fine sense of atmosphere even though its plot doesn't make a lick of sense even by the meager standards of horror fantasies!), John Carradine also played a mad scientist who had a dog named Brutus.","user":"mgconlan-1","rank":[8,8]},{"title":"Don't intimidate a man you can not see.","rating":5,"date":"8 September 2001","review":"Directed and produced by Ford Beebe, this invisible man installment is quite interesting. Robert Griffin(Jon Hall) returns from the \"left for dead\" only to find out his business partners have cheated him out of a fortune. Griffin practically stumbles into the helping hands of Dr. Drury(John Carradine), who experiments with a new formula that makes animals invisible. Griffin feels if he himself was invisible he could better seek his revenge on his double crossers. After becoming invisible, the weird doctor is in no hurry to return Griffin to normal.<br><br>I have always liked Hall even though he is not an overly exciting actor. Along with Carradine there is a very able supporting cast that includes: Lester Matthews, Leyland Hodgson, Evelyn Ankers and Leon Errol. Very creative for a small budget film. Well worth watching.","user":"michaelRokeefe","rank":[10,11]},{"title":"Leon Errol meets the Invisible Man","rating":7,"date":"18 November 2006","review":"Here's Jon Hall, fresh from his triumphs as 1942's Invisible Agent, back in a rather odd addition to Universal's Invisible Man saga. At first it seems that Jon is the heroic victim of villainous schemers Matthews and Sondergaard (and certainly they seem a rather dubious pair). Halfway through the action, however, the screenplay has Jon change sides (or perhaps just reveal his real obnoxious character). The blackguards then become the victims, but only temporarily. At film's end, we are led to believe (by a chief constable who fails to mention them at all in his summing up) they have been whitewashed, presumably to set the heroine free to marry the movie's real hero, Alan Curtis (who makes a rather belated entrance when the movie is more than half over).<br><br>Adding to the story confusion is Leon Errol in a major comedy role as a Cockney spiv who befriends the Hall character, and does a fair number of mildly amusing turns, including a happy scene in which he attempts to blackmail the villain who persistently outwits him; and a long, almost completely irrelevant sequence in the local pub in which he challenges the local champion to a game of darts and then tries out various throwing combinations that will have special effects fans really cheering him on. Yet, for all that, Errol is sidelined in the all-action climax where he might have proved useful.<br><br>As for heroine, Evelyn Ankers, she may as well have stayed at home. If she has more than five or six lines of dialogue in the whole movie, I'd be surprised.<br><br>My guess is that the script was made up on the run. It certainly plays that way. Only John Carradine's scenes seem to have a formal scenario (necessary because of the special effects), enabling the actor to invest his role with dignity and even credibility. Mind you, Hall does play the heavy rather well, even if it does come as a bit of a shock.<br><br>By the humble standards of producer/director Ford \"Bomba\" Beebe, the movie comes over as a fairly creditable production, although lensed on a considerably lesser budget than Frank Lloyd's Invisible Agent.","user":"JohnHowardReid","rank":[9,10]}]