[{"title":"Excellent animated film--more for older children and adults","rating":10,"date":"6 September 2006","review":"British animated film about a bunch of rabbits leaving their old warren (which one psychic rabbit can tell is going to be destroyed) and searching for a new one. The movie recounts their adventures searching for one.<br><br>It may sound like a movie ideal for little kids--but it really isn't. It's an excellent adaptation of Richard Adams book which was written more for teenagers and adults. It's an ecological tale of how men are destroying the earth and (inadvertently it seems) killing innocent wildlife. It's also a very interesting story about how a group of rabbits survive on their own.<br><br>The animation is excellent--right up there with Walt Disney. The score is great, the script intelligent and the voices used perfectly match the characters. However, as I said, this isn't really for little kids. The story is dead serious and the only humor is provided by the bird Kehaar (who I personally found very annoying although Zero Mostel DOES have fun with the voice). Also, at the end, it gets very violent and quite bloody. When I saw it in a theatre in 1978 one small kid was in tears by the conclusion. So, use your own judgment but I would never let a small kid see this. This is perfect for teenagers and adults. A 10.","user":"preppy-3","rank":[92,98]},{"title":"The greatest adaptation ever...","rating":10,"date":"20 November 2001","review":"I would never spoil the wonder that is \"Watership Down\". The book and the film are timeless classics. I think it is the greatest adaptation of a novel (any genre) ever made and one of the most under-rated movies of all-time. They managed to capture more of a long novel (nearly 500 fantastic pages) than most films can compile from a 200 page source work. The soundtrack is beautiful (I'll be getting one for a Christmas present--thanx for the info IMDb!!) and matches the mood of the scenes perfectly.<br><br>Viewers will recognize someone they know in nearly every rabbit and, with unbiased observation, probably see themselves. It is at once gripping and gentle, heart-rending and endearing. You will find yourself humming the tunes incessantly for months afterward. I recommend reading the book first (also try \"Traveler\" by Adams, another classic), then purchasing the film, then the soundtrack--wait, better yet, write your Congressman and demand a DVD release. I long for another wide-screen viewing (hint, hint)!<br><br>\nI have noticed multiple comments that state the movie is too violent for children (it is somewhat graphic--to it's credit). For very small children, I would whole-heartedly agree, however, I think it depends on the individual. I was lucky enough to have a Father who took me to see it at the theatre when I was a youngster (about 5) and it did not scar me or give me nightmares--rather I learned the importance of the symbiotic circle of existence and the reality and necessity of life and death. It is still a comfort to me in times of sadness. In addition, the movie is highly layered and something new can be gleaned with nearly every viewing.<br><br>\nI enjoyed it for years and only later realized many people had never even heard of it...I take every opportunity to recommend it and not once, not once, have I heard anything but thanks for the suggestion. Most of them end up owning the film. Both symbolic and blunt, \"Watership Down\" is a triumph of emotional proportions and is exemplary of what adaptations, animation, scoring and good film-making should be about. This wonderful adventure is an asset to any collection...10/10.","user":"midnightrane","rank":[116,128]},{"title":"Simply brilliant","rating":10,"date":"7 April 2004","review":"'Watership Down' is quite simply my favourite animated film of all time.<br><br>\nThe vocal talent, animation style (both in the main story and in the mythical opening), soundtrack and script all work wonderfully, shortening the material of the book but not losing all of its themes. Efrafa was exactly as I imagined it would be from reading the book, Woundwort being suitably scary and unhinged.<br><br>Obviously the violence and horrific imagery has been toned down to make the film more accesible to a young audience (at 8 I wore out TWO copies of the film on VHS!!!) but not so much that the film becomes cutesy. Far from it. These are not fluffy bunnies in the vein of Thumper, they are real. They get hurt (Bigwig nearly is killed in a snare, Hazel is shot, Captain Holly arrives nearly dead), they fight, they flee from domestic dogs, cat, from humans with guns. There is blood and violence, the film does not shy away from that...Blackavar's torn ears are as wince-inducing to me now as they were to me when I first saw the film 10 years ago.<br><br>What does surprise me now though is that the film is rated U (universal, suitable for all) here in the UK. Not only is there some mild swearing, the level of violence and the visual horror (Fivel seeing the field covered in blood, Holly's description of the warren blocked with dead bodies) is surely at least PG? Hmmm....<br><br>To conclude it can be said that watching films from your childhood is often a bad move....they are usually best left in the memory. The same can not be said of Watership Down. Simply brilliant!","user":"Nice_Guy_Daz","rank":[67,73]}]