[{"title":"Ruthless men and the women who support them","rating":16,"date":"16 January 2000","review":"Well-done story of corporate shark, owner of a vast conglomerate, who tries to break the VP he thinks can no longer do the job.  Everett Sloane plays the heartless owner who nurtures his executives with bitter words and daily shouting matches. Ed Begley plays the downtrodden VP; he's more than able to take care of himself, but after years of fighting with Sloane he's exhausted.  He's 62 and afraid he won't find another job and refuses to quit; he's worked for the company for 30 years and believes he's got a place there.  Van Heflin is the executive brought in to replace Begley, unbeknownst to them both.  After Sloane tells him of his plans, Heflin tries to tell the boss that he doesn't want the job.  Begley is his friend.  But deep down, he finds that he really does want it, just not at that cost. After a particularly brutal meeting where Sloane taunts and belittles Begley, Heflin begs the older man to resign to save his health.  Begley staggers out of the meeting and collapses in the classically designed hallway.  Heflin's anger is magnificent to behold as he stalks in Sloane's office after the tragedy.  He tells the boss what he thinks of him, but Sloane doesn't care.  He knows he's a bastard but he has a business to run. Heflin resigns, but Sloane badgers him into staying.  Heflin does, but his own gargantuan terms, which include tripling his salary and writing into his contract that he hates Sloane's guts and that he reserves the chance to slug Sloane on the jaw in the future if he so decides, just like Begley always wanted to.  He's made his pact with the devil and come out with his pride and ego intact.<br><br>This is a man's movie.  Serling never wrote from the woman's point of view, and the women in this film are there for their men but not real players. Beatrice Straight is tried and true as Heflin's wife.  Elizabeth Wilson is Begley's loyal secretary who is transferred to Heflin, and feels like she should quit if she has to change her loyalties; she is remotely treated as a sort of junior executive, given some male qualities by Serling but not strictly one of his womanly pillars.  When she begins to like her new boss, she instructs him in all the ways that Sloane will try to drag him down and helps him through the dark waters of executive suite life.<br><br>This is the same corporate America Serling later wrote about in Twilight Zone and Night Gallery; \"Walking Distance\", \"A Stop at Willoughby\", and \"They're Tearing Down Tim Reilly's Bar\" are his famous trilogy focusing on the career of a harassed corporate pawn who is driven to emotional extremes by the greed and bias of the company and it's president.  They are supposed to be based on his own experiences with the upper echelon of the networks, which are still legend.  A Serling script of any kind is great, and this film, while difficult to watch since there is so much backstabbing, is an excellent example of how true to life he could be, and how he always rooted for the underdog.","user":"Marta","rank":[36,36]},{"title":"Rod Serling's landmark teleplay still speaks truth to power today.","rating":10,"date":"25 June 2004","review":"...Rod Serling is recalled today almost exclusively for his speculative fiction television series \"The Twilight Zone\" and \"Rod Serling's Night Gallery.\" Perhaps that's understandable, given the out-of-sight-out-of-mind nature of today's audiences, and the fact that the generation Serling first impressed with this lean but powerful work in 1955 on the \"Kraft Television Theater\" is now well into the process of dying out. Still, the kinetic nature of PATTERNS, either in this theatrical film or in the kinescoped original TV broadcast, is not lost on today's first-time viewers. It helped that two of the three leads in this picture, Everett Sloan and Ed Begley, were carried over from the TV productions (Richard Kiley was replaced in this film by Van Heflin, giving perhaps his single greatest performance). But Serling's screenplay has not lost one bit of its relevance; in fact, I'm surprised nobody's thought of remaking this one...","user":"kingdaevid","rank":[49,50]},{"title":"stunning","rating":8,"date":"18 September 2002","review":"I happened to stumble on this on TCM while channel surfing (I had seen the blurb in their program guide and had given it short shrift) and, although ten minutes or so into the movie I was immediately gripped by the acting. I stayed for the whole thing and was amazed at the quality of this practically forgotten movie with script by Rod Serling and superb performances by Van Heflin, Everett Sloane, Ed Begley and Beatrice Straight. Anyone who has been in the business world in even an incidental way will be taken by the way in which Serling has so effectively captured the machinations and power ploys in the corporate world. A bald description of the plot - ceo grooms upcoming exec to replace a company veteran - gives no idea of how exciting the realization is on screen (which is why I skipped past the program guide listing); it is simply gripping. Director Fielder Cook's work subsequent to this has been primarily in television.<br><br>If you're fortunate to find this rarity scheduled, by all means don't miss it.","user":"rupie","rank":[58,60]}]