[{"title":"Sing Melancholy Baby","rating":8,"date":"18 January 2005","review":"Is it possible to watch this fictional story without digressing to thoughts about the real life story of Judy Garland? For me it isn't. Both are permanently intertwined. And it's not just the parallel between fiction and fact, but also the dark, brooding, melancholy mood they engender, like ghosts calling out to us from a Hollywood that no longer exists.<br><br>The film's storyline is well known. I won't belabor it here, except to say that it communicates an honest and introspective indictment of the entertainment industry as it once was. The story can be thought of as a kind of archetypal Hollywood memoir, expressed as a musical.<br><br>But musicals are supposed to be upbeat, lighthearted, fun. This one isn't. Moments of humor and joy are swept away in a cascade of emotional pain and tragedy. Fiction mimics real life. How appropriate that the film's signature song \"The Man That Got Away\" is one that is so uncompromisingly serious, poignant, and smoldering ... a perfect vehicle for Judy Garland.<br><br>Some say she had the greatest singing voice of any entertainer in the twentieth century. This film lends credence to that assertion. Every song she sings is performed with such consummate verve, such emotional commitment that she seems to be singing not just for her contemporaries, but also for generations to come. Indeed, she is. My personal favorite is the \"Born In A Trunk\" segment, all fifteen minutes of it. Surrounded by sets of true cinematic art, she belts out one tune after another, including, of course, the poignant \"Melancholy Baby\".<br><br>Judy's singing and the music itself are what make the movie so memorable. But she also demonstrates her considerable acting talent. And the acting of other cast members is fine, especially the performances of James Mason and Jack Carson. I do think that the film was, and still is, too long, the result of an overly ambitious screenplay.<br><br>That Judy Garland was denied the Best Actress Oscar is poignant. But her talent was so massive, her uniqueness was so special, maybe fate required a compensatory level of pain and tragedy, as a prerequisite of legend.","user":"Lechuguilla","rank":[90,102]},{"title":"Judy Garland at Her Best","rating":10,"date":"22 June 2005","review":"The 1954 musicalized version of A Star Is Born is a great film. Judy Garland and James Mason (both Oscar nominated) turn in terrific performance as Esther and Norman. Like its 1937 predecessor (which starred Janet Gaynor and Fredric Marchboth Oscar nominated), the 1954 version follows the ups and down of two people set against the vicious world of Hollywood. The newer version sticks to the basic story but adds some great numbers for Garland, including \"The Man That Got Away\" and \"I Was Born in a Trunk.\" In a major comeback, Garland had not worked in films since Summer Stock (1950), and her performance here is the best of her career. That she lost the Oscar to Grace Kelly for The Country Girl is one of Hollywood's great inequities. Mason lost to Marlon Brando for On the Waterfront. Garland sings superbly and is a great comic and dramatic actress. Her Esther is more vulnerable than Gaynor's just as Mason's Norman is more pathetic than March's. I love both versions. Charles Bickford and Jack Carson play the other major parts, played by Adolphe Menjou and Lionel Stander in 1937. Two major supporting roles from the 1937 version were cut from the 1954 version: Esther's first Hollywood friend (Andy Devine) and her intrepid grandmother (the great May Robson). But Garland's musical numbers make up for their absence. Oddly, despite the great hullabaloo surrounding A Star Is Born, it was not nominated for best picture, and George Cukor was bypassed in the directing category. One of the best musicals ever made.","user":"drednm","rank":[62,75]},{"title":"Michael Arick or Tommy Will You Ever Turn Over Your Print?","rating":9,"date":"22 January 2018","review":"This is a great film. Yes it is long. Yes some of the songs should have been cut but they weren't but we get a masterpiece anyway.<br><br>In this film Esther Blodgett is a talented aspiring singer with a band, and Norman Maine is a former matinee idol with a career in the early stages of decline. When he arrives intoxicated at a function at the Shrine Auditorium, the studio publicist attempts to keep him away from reporters. After an angry exchange, Norman rushes away and bursts onto a stage where an orchestra is performing. Esther takes him by the hand and pretends he is part of the act, thereby turning a potentially embarrassing and disruptive moment into an opportunity for the audience to greet Norman with applause.<br><br>Norman then takes Esther under his wing and gets her a screen test at the studio in which he works. She ends up homecoming a major star and his drinking escalates! <br><br>After the film was released Warner Brothers recalled the prints. 30 minutes were edited out. In 1983 Ron Haver was able to restore most of the film. Where he could not find footage for the missing scenes he used productions stills. People claim this halts the picture. It doesn't! Besides it only last a total of 7 minutes. It is not 7 minutes all at once! <br><br>Now in 2010 it was reported that film restorer Michael Arick had a print of this film. He will not let Warner Brothers use the print. Some people claim that he doesn't have a print however \"He has never publicly denied it\". <br><br>It is also Rumored that Tommy from Beverly Hills has hours of the films outtakes on VHS however it is silent footage. Maybe it might include the missing 7 minutes.","user":"Sober-Friend","rank":[34,40]}]