[{"title":"What was wrong with this movie to get such bad reviews? I actually liked it.","rating":7,"date":"24 November 2003","review":"Bonfire of the vanities. A movie that has the reputation of being awful. I didn't think so. I saw it a long time ago but liked it. I have heard so much about how bad this movie was and never understood why. It isn't the best movie definitely not but there are so many BAD movies-this movie had a message (a pretty sad one) and the story was Involving. My attention was captured. I wanted to see what would happen next.<br><br>This movie is so true to life. There ARE people out there whose actions would be worse then some in this movie. People whose lives are motivated by greed. (The worst bad movie out there that I've seen that tells the story of truly horrendous people motivated by greed and power is \"in the company of men\". Much more unpleasant then this movie.) This movie, I GUESS is controversial, not considered as good as the book and maybe it was ahead of its time. I think it's worth seeing though and would give it a 7.","user":"triple8","rank":[85,99]},{"title":"This is what I call an honest movie.","rating":10,"date":"1 May 2005","review":"After reading a large number of negative reviews, it finally became clear to me why this movie is so widely hated - because it honestly depicts the modern biased race-based American society, in which uneducated crowds are ready to devour an honest person, and punish him for a crime he didn't commit. The acting is great, Tom Hanks does an admirable job, however,it isn't acting which makes the movie great. The superb directing, creating realistic and horrible scenes of dirty political games and black (literally) PR, capture my attention. So, to sum up, a brilliant political satire. The movie could make a laughable comedy, if it wasn't so terrifying...","user":"morfeus","rank":[110,134]},{"title":"An excessive but funny American satire. De Palma tries to film his great masterpiece switching from Hitchcock to Kubrick. Perhaps, not wholly satisfactory but fascinating and one of the most interesting film","rating":10,"date":"11 October 1999","review":"After giving us two excellent films - \"The Untouchables\" and \"Casualties of War\" director and auteur Brian De Palma tried to get the masters degree on major filmmaking with the very complex best-selling novel by Tom Wolfe. Faced to the challenge of making a great satire of nowadays America, De Palma does not find his own voice as he did in his two previous films, and goes back to the copy-and-paste path. This time it is not an imaginative and talented personal version of Hitchcock obsessions, but an interesting approach to Kubrick's style in \"Dr Strangelove\" and even \"Lolita\". After confessing that the director he admires in a most intimate way is Stanley Kubrick, Brian De Palma uses the witty Tom Wolfe novel as the story he needs to imitate one of his most admired masters.<br><br>The result is an excessive but funny satire. It is certainly underwritten, overacted and overdirected but, still, De Palma shows once again a great visual style and a wild sense of humour which makes us laugh several times.<br><br>Perhaps, De Palma should have remembered that such a witty and complex story has to be told seriously with the apparent simplicity and hidden complexity he reached in \"Casualties of War\", without trying to underline with the direction that every scene is supposed to be funny. Those strange camera angles taken from Kubrick nuclear satire do not work here and the characters are too exaggerated  -Jean Renoir said that each character has some reasons and here,if De Palma had tried harder not only to criticize but to understand them, it would have been a much more effective film- and being both a Kubrick and a De Palma fan, I think that Kubrick influence was not good at all here. In this satire, as in his Vietnam drama, such a talented director as De Palma  could have given more importance to substance that to form, given that this was not one of his brilliant thrillers where form is essential, but an intelligent satire about people. In fact, in many moments of the film De Palma uses a not so mannered and much more effective style and shows a great talent in portraiting situations ironically, something which is not usual in films from the nineties.<br><br>Overall this work remains as one of the most aggressive portraits of America ever filmed. Perhaps this is why the film was a flop in the Box ffice  -it was absurd to make it with such a expensive cast and budget, given that such an acid satire cannot be popular- and De Palma's career, which was on his best moment, did not recover completely even after the wonderful \"Carlito's Way\", one of his best films. If you study Film direction it is absolutely necessary to see it, because of its risks, mistakes and achievements.<br><br>In conclussion, one of those strange films which you will find fascinating both because of its values and its mistakes.Forget about the novel; the film is an excessive and wild satire which will make you both think and laugh. De Palma genius and talent are present in many scenes. Moments like the initial shot, Alan King's speech, Clifton James,Donald Moffat or Andre Gregory performances -even the Morgan Freeman final scene, which De Palma did not like and is really good, reminding me of Capra, something extremely difficult in such a cynical decade- are not easy to forget.<br><br>It is not often to find such a complex and interesting film. I strongly recommend it.","user":"ITAU","rank":[35,40]}]