[{"title":"Okay sue me! I actually liked it.","rating":5,"date":"4 February 2007","review":"Review summary: Mostly obvious knock-off of INDIANA JONES, but functions more as an entertaining parody. <br><br>I've heard many bad reviews on this film. They all say \"Indiana Jones rip-off\" or \"Worst movie ever\". But to me, this is actually entertaining, and it's silly fun indeed. The film is usually called a rip-off because they see some elements they also saw in the Indy flicks. Truth be told, this has more in kin with the Lucas/Spielberg classic than H. Rider Haggard's classic adventure novel. But seeing the film, it actually has a lot of fun with itself. It wasn't meant to be taken seriously, and I agreed to the bargain. Richard Chamberlain is not that heroic as Indy, but he throws in a lot of jokes to make viewers crack a smile. Sharon Stone shouts, complains, whines in the entire journey, but what would you expect on a big-screen debut. Herbert Lom, as I see it, is being more of funny than sinister intentionally. Same goes for John Rhys-Davies, but he looks more villainous. But it wasn't all parody and humor. \"King Solomon's Mines\" is also action-packed. Perhaps one of the real downer in the action department are the special effects (terrible process shots!) and stunts (the most obvious stunt doubles ever!!). Still, we have crocodiles, tribesmen, Nazis and exploding caves of lava. <br><br>Perhaps it's my love for old-fashioned adventure that made me like this silly, mostly campy adventure, but I couldn't deny the guilty pleasure I had with it. Overall, this is actually functions as an enjoyable tongue-in-cheek adventure flick, but make sure you leave any pretense of common sense at the door. It's stupid fun. <br><br>Rating: *** out of 5.","user":"vip_ebriega","rank":[36,44]},{"title":"Rip-off or classic?","rating":6,"date":"10 March 2005","review":"Well I read a lot of the reviews here and it seems to be pretty divided as to whether or not this is a good movie. So here's my 2 cents. In my opinion this was not trying to be Indiana Jones. I think the intension was to make a campy, cheesy spoof, and as that it succeeds fantastically. Keep in mind this was the early - mid 80's. Cheezeball B-movies were all the rage and popular. Look was came out in around that period. King Solomon's Mines, a year later a sequel, Lost City of Gold. But we had many other great cheese movies like Ice Pirates, Dungeonmaster, Dragonslayer, Spaceballs, just to name a few. Conan the Barbarian spawn a whole subgenre of barbarian movies as did Road Warrior for post-apocalyptic movies. I'm sure there where other movies of these subjects before, but these were the ones that really kicked it off for those subgenres. I think that many of those who are complaining that King Solomon's Mines is so bad are those who are too young to remember and appreciate these movies that came out in around that period or those who decided it's not \"cool\" to like cheesy movies.<br><br>Of course you can't compare the effects to that of Raiders of the lost Ark. Raiders had a near unlimited budget for the day, how do you compete with something like that? And do you honestly think that they blatantly ripped off scenes without getting permission first? I wouldn't be surprised if Lucas is making a small royalty of these movies, or at least did back when it came out. Yes, they rode the Raiders wave. Why is it that we criticize someone for riding a winning wave? If I had the chance, I'd do it in a heartbeat. I would argue that any of these movies have more heart than most of what comes out of Hollywood these days. These were made back when, for the most part, budgets were tight and people made movies for the love of making movies.<br><br>Having a weakness for violent gore movies and foreign, B-Movies and foreign probably comprise 60% of my DVD collection and 70-80% of my VHS collection. Almost 600 movies combined. But I have a rare gift to be able to sit down and watch a movie without comparison to another and judge it on it's own. That's why my collection contains everything from Little Mermaid and Aladdin to Cannibal Holocaust(Uncut) and Salo: 120 Days of Sodom(Uncut), from The English Patient to, yes, King Solomon's Mines. (I do, however, have Lost City of Gold on VHS) So sit back, try to watch movies without any preconception of what you are about to watch. Critics, friends, rumors are just that. You are your own person, make up your own mind. If you can't do this, you are probably looking at the wrong movie. All you will see is a bad Raiders rip-off and you should stick to what you know or \"reality\" *Ya Right* TV.<br><br>And that's my 2 cents.<br><br>ME","user":"iammedotcom","rank":[45,65]},{"title":"KSM: A Brilliant Comedy","rating":7,"date":"8 February 2007","review":"A long time ago, I was introduced as an \"outsider\" to a group of boys who would get together once a month to have a \"Cheese Fest\" of real bad movies. We watched three movies, and laughed until we cried. When it was over, I shyly suggested a movie called \"King Solomon's Mines\". They had never heard of the film, or hadn't seen it yet. This was my opening to be \"cool\" with the gang.<br><br>At the next gathering, I came over with a VHS copy I rented from a store. We watched it, and had to stop the movie several times because we were laughing so hard! We all agreed that this was the best worst movie we had ever seen! About two days later, my front door bell rang, and it was the boys there to give me a gift! I had been \"accepted\" into their gang! Many nights of \"Cheese Fests\" followed, but none were as successful as the night we watched \"King Solomon's Mines\"! The gift, by the way, was the very VHS copy of \"KSM\" (which we pronounce; \"Chaos, Mmm\") I had rented! I still have it to this day, and have shown it to many friends who thank me every time while wiping away a tear.","user":"simons1138","rank":[34,48]}]