[{"title":"Antiquated corn-pone movie-making","rating":19,"date":"19 March 2015","review":"As the title suggests, this obscure film is a '60s throwback to those cornball movies made for rural and southern audiences way back when, which famously went out of style in the '30s per Variety Newpaper's greatest headline: STICKS NIX HICK PIX. Now almost 50 years have passed, and it is merely quaint and silly.<br><br>Like a far more well-known picture LAS VEGAS HILLBILLYS, this one serves as a vehicle for country star Del Reeves, quite unimpressive in an acting role teamed with obscuro country singer Hugh X. Lewis. Their series of slapstick adventures caused by confusing Hollywood, Florida with the Left Coast's more famous destination is unfunny and tedious entertainment.<br><br>For me the high point, brief as it is, was the guest appearance by Greta Thyssen playing herself. She needs a ride because her car's broken down and poses briefly in a sexy polka dot bikini. Greta was the first pin-up I'd ever seen in a men's magazine, back in the late '50s, and was a very big deal back then -this is her last movie role. By contrast the other film LAS VEGAS HILLBILLYS filled her pulchritude slot (a tradition one remembers years later from the cute chicks filling the screen on TV's \"Hee-Haw\" series) with superstars Mamie Van Doren and Jayne Mansfield -now that's overkill!<br><br>Another career ends for big-eyed Lila Lee as a bossy country family matriarch. She was a silent star and I remember fondly in the bizarre Lon Chaney film THE UNHOLY THREE, second (talkie) version.<br><br>Paramount '40s star is another nostalgia inclusion, playing an old drunk here in his final movie. Except for a bit part later on, Maxie Rosenbloom made his final acting role here driving a jeep with \" U.S. MALE ROUTE\" painted on the side. So CHICKENPICKERS is not a jinxed movie, but merely a case of hiring people who were through with show biz.<br><br>Our duo does in fact steal chickens at one point, and film includes an inevitable subplot involving moonshiners. Future star Mel Tillis pops up, and romantic interest Birgitta Andersson was quickly shipped back to Sweden after this inauspicious American tryout.","user":"lor_","rank":[8,9]}]