[{"title":"Positive, enjoyable film","rating":8,"date":"2 June 2003","review":"I recently saw this movie again and I was surprised at how well it holds up. The story isn't dated, the situations are universal and current and the acting is fine.    The plots are believable, interesting and satisfying. For a sleeper of a film in 1980, it stands out as 1 of the better teen genre pieces that flooded the theaters in the 80's.  The ending is a bit sappy, but it still doesn't detract from a very sweet story with characters you can actually cheer for (except, of course for Moody and Mike, but it was fun booing them as well).","user":"teachbike","rank":[32,33]},{"title":"A Lasting Impression","rating":10,"date":"25 April 2004","review":"In his debut performance, Adam Baldwin does a wonderful job portraying the alienated Ricky Linderman, who is seen as a hulking, violent \"psychopath\" by most of his peers.  Baldwin's acting abilities are impressive and he touches the heart of the viewer by showing us Ricky's emotions.<br><br>Ruth Gordon is a joy to watch as Clifford's Gramma Peache.  Her character adds the touch of humor that is needed to balance the heavy subjects addressed in this piece of work.<br><br>I am slightly disappointed with the editing; they appear to be going for dramatic pauses that don't work well and slow the pace of the scenes at times.  However, I'm willing to live with that for the opportunity to see this wonderful story, which after 24 years still rings true to the reality of the cutthroat world of high school.","user":"Cyndy","rank":[37,39]},{"title":"A timeless, compelling and thoughtful movie about facing odds.","rating":8,"date":"15 April 2005","review":"This movie rings true on so many different levels. I find this a real gem because no matter how many times I watch it I find it compelling and refreshingly straightforward. Chris Makepeace is cast perfectly as a reluctant victim of extortion by Matt Dillon's high school band of thugs. Adam Baldwin relays a sense of pain, anguish, and grief that you can nearly touch. What can you say about Matt Dillon (Moody)? Anyone who has ever been bullied will squirm in their seat after watching him for just ten minutes. This is one of those special movies that will appeal to so many different people. Haven't we all been to high school? been bullied at some point? got caught up in ridiculous rumor and innuendo? if so, then definitely take time to watch this timeless classic.","user":"halpinsouth-1","rank":[24,25]}]