[{"title":"A Lot To Like In Yet Another Entertaining Flynn Film","rating":9,"date":"3 January 2008","review":"This is definitely an Errol Flynn classic, meaning one of his best films and the charismatic star of the mid-'30s to mid-'40s did a number of entertaining ones. He's best known - on screen, that is - as a swordsman from his \"Captain Blood\" and \"Adventures of Robin Hood\" days, but he also was terrific as boxer James J. Corbett in \"Gentlemen Jim\" and as western star \"Wade Hatton\" in \"Dodge City.\" <br><br>He's great here as pirate \"Geoffrey Thorpe\" and what makes this pirate movie different is that half of the action scenes are on land, not sea. (They on are on island, or back in the castle of Queen Elizabeth). Flynn captains \"The Albatross\" and is a privateering ship captain for her Majesty the queen in the 1500s. They are battling the Spanish in this story. The real bad guys are some of the turncoats in Elizabeth's court.<br><br>The film is interesting even with its length of over two hours. It keeps a good balance of drama, action, romance and suspense, never overdoing any of those.<br><br>While it's hard to beat the entertainment duo of Director Michael Curtiz and actor Flynn, Brenda Marshall as \"Doria Maria,\" Thorpe's love interest, doesn't quite cut it. Olivia de Havilland usually played his female interest, and - although that doesn't require she play in every Flynn movie - they could have found someone more attractive and likable than Marshall who, justifiably, had a thin career. Her casting in here is a big mystery to me.<br><br>Whatever, Flora Robson was fun to watch as \"Queen Elizabeth.\" Claude Rains and Henry Daniell played their normal bad-guy roles well and Thorpe's crew, led by Flynn's best friend Alan Hale, are all entertaining guys.<br><br>I enjoyed the sepia-tone sequence when Flynn and the boys go for the gold on the Panama island. That was a nice, little visual twist to this black-and-white movie..<br><br>Not to be left out is the sweeping score, under the direction of Erich Wolfgang Korngold, which is one of the more magnificent ones you'll hear in a classic film.","user":"ccthemovieman-1","rank":[38,41]},{"title":"Great Entertainment From Flynn & Co.","rating":21,"date":"21 May 2001","review":"In \"The Sea Hawk\", hero Errol Flynn, director Michael Curtiz, and composer Erich Wolfgang Korngold provide great entertainment very similar to that in their earlier classic that starred Flynn as Robin Hood.  Supporting actors Alan Hale, Claude Rains, and Una O'Connor also are back, joined by Brenda Marshall, Flora Robson, and Henry Daniell.  The movie provides rousing action, a good story, and some memorable characters.<br><br>Flynn's character is Geoffrey Thorpe, who is a \"sea hawk\", a privateering ship captain in the late 1500's indulged by Queen Elizabeth (Robson) and allowed to raise havoc with Spanish shipping in a time when Spain's dominance was at its peak.  The story in \"The Sea Hawk\", like the action in \"The Adventures of Robin Hood\", is loosely based on historical circumstances, although this time the tone is often more serious.  This film is in black-and-white instead of Technicolor, giving it a different feel. (There is a very nice touch when the scenes in the New World are tinted in golden-brown, an effective way of emphasizing the different setting.)  There are also extensive scenes of the suffering and humiliation experienced by the English galley slaves imprisoned by the Spanish fleet, instead of the very brief scenes of Saxon suffering in \"Robin Hood\".  But the main emphasis is still on the swash-buckling action that made Flynn so popular.<br><br>There are ship-to-ship fights, chases, escapes, and of course sword fights. Flynn's charisma and infectious good nature are usually enough to carry even far-fetched action, and here the story itself is more than good enough to be worthwhile in its own right.  \"The Sea Hawk\" is good, classic entertainment.","user":"Snow Leopard","rank":[29,31]},{"title":"Errol at his best","rating":10,"date":"12 February 2006","review":"My favorite Errol Flynn movie has always been The Sea Hawk. Flynn made this in 1940 at the height of his career. All it is missing is Flynn's usual screen partner in that period, Olivia DeHavilland.<br><br>Errol Flynn plays the fictional privateer Geoffrey Thorpe who with the well known real characters like Drake, Frobisher, and Hawkins, raid the rich Spanish commerce from the New World which is what Europeans of the day were referring to the western hemisphere as. Queen Elizabeth of England gave all knowing wink to their activities and the realm took a cut of their loot.<br><br>One day Flynn attacks the ship carrying the Spanish ambassador Claude Rains and his niece Brenda Marshall who's English on her mother's side. That's it for Flynn.<br><br>But Queen Elizabeth has some traitors in her midst. The clever Lord Wolfingham played by Henry Daniell is in the Spanish pay. Daniell was one of the best screen villains ever. He was always a cold and calculating individual and had a voice with a built in sneer. He very cleverly deduces Flynn's future plans and lays a trap for him. See the film and find out, but suffice it to say Daniell is no fool.<br><br>Jack Warner saw that Flynn's films were always well scored musically. Flynn swashbuckled to some of the best film music ever composed. Here the composer is Erich Wolfgang Korngold, in other films with Warner Brothers, it's Max Steiner. Korngold's score isn't quite on par with the one he did for Robin Hood, but it's one you will not forget.<br><br>This was the last film Errol Flynn did with director Michael Curtiz. David Niven in his memoirs made of Curtiz a figure of some fun, he was the guy with the fractured English who uttered the memorable phrase that became Niven's title for his memoirs, 'bring on the empty horses.' Flynn in his memoirs hated him with a passion in that Curtiz put his players in some dangerous situations without regard for safety. After this he refused to work with him. But between them, Curtiz and Flynn did some grand entertainment. Curtiz later won an Oscar for directing Casablanca.<br><br>Flora Robson repeats her role as Queen Elizabeth, she had previously portrayed Elizabeth in Fire Over England back in the old country. It's probably the part she's most identified with in her career.<br><br>Brenda Marshall who is probably better known for being Mrs. William Holden, pinch hits for Olivia DeHavilland. Olivia was trying to get some better acting roles that she knew she could do and not be a crinolined heroine all the time. Jack Warner refused to see her as anything else for a long time. <br><br>Others in the cast who stand out are Alan Hale, Una O'Connor, Gilbert Roland and William Lundigan has a death scene that will haunt you for a long time.<br><br>The Sea Hawk is also a film that made use of a film process known as sepia tone. It's probably the film best known for it. The whole sequence of when Flynn sails his ship, the Albatross, to Panama is photographed in sepia tone. It makes the film come out a kind of brackish yellow. Since Warner Brothers didn't want to spring for full technicolor, this process is effective in demonstrating the jungle heat that Flynn and his men and the Spaniards for that matter operate under.<br><br>It is also no accident that this film was made in 1940 showing brave England refusing to buckle under to a tyrant from the European continent. Phillip II of Spain, played by Montagu Love, controlled a whole lot of the world's real estate at that point in time and wanted more. The meaning for the audiences of 1940 could not have been more clear.<br><br>The Sea Hawk is grand entertainment. In my humble opinion Errol Flynn's best film and one of the best of the swashbuckling genre.","user":"bkoganbing","rank":[51,57]}]