[{"title":"6 out of 10","rating":7,"date":"7 August 2001","review":"I DIDNT HATE IT! which really surprised me, because everyone on IMDb said this movie totally sucked and I went in expecting the worst. Sure Jackie is miscast, but other than the addition of curse words, his character isnt any darker than in Crime Story or Police Story 2. The action is slow, but better than any of the American action junk I've ever seen. Plus, there is tons of full-frontal nudity! Bet you didnt expect that from a Jackie Chan movie, did ya? I can understand why JC was disappointed with it, because it is nowhere near as good as almost any of his other 80's-90's movies, but it aint all that bad. Go in thinking you will hate it, and you just might like it.","user":"dragon ma young","rank":[15,18]},{"title":"Not as bad as its reputation would suggest.","rating":6,"date":"4 August 2014","review":"In the second attempt to introduce martial arts superstar Jackie Chan to the North American market (after \"The Big Brawl\" in 1980), ever likable Jackie is amusingly miscast as Billy Wong, an NYC cop who, after some hot dog heroics, is demoted to crowd control at a fashion show, where he's partnered with Danny Garoni (the engaging Danny Aiello). Unfortunately, they prove to be pretty useless and Laura Shapiro (Saun Ellis), daughter of a wealthy big shot, is kidnapped by goons working for dastardly Hong Kong mobster Mr. Ko (Roy Chiao). Billy and Danny manage to convince their commissioner to let them travel to HK to advise and assist local authorities in defeating Ko and rescuing Laura, but of course these two mavericks are pretty much just going to do whatever they want to do.<br><br>There are *some* fine moments here for Chan fans, but there simply may not be enough. The tone *is* rather gritty, but although there's not a lot of outright comedy, the movie does still have a sense of humour. Chan has some fine action and fight sequences, especially one around the halfway point where he's trying to pursue a henchman escaping by boat. The stunts near the end are impressively scary. Writer / director James Glickenhaus (\"The Exterminator\") does a very fine job in utilizing the various HK locations. Jackie does his best in the lead, with Aiello offering fine support and Chiao being just right as our glowering bad guy. Jackie does have a decent if not spectacular climactic fight with fellow martial artist Bill Wallace. All things considered, it's not hard to see why Chan himself and some of his fan base might not care for the movie, but there is an alternate cut now available on Blu-ray with additional scenes created by Jackie himself, to better suit his vision (he really had no control on this feature at the time).<br><br>In any event, it's worth noting the presence of a couple of familiar faces among the supporting cast, including Becky Ann Baker, John Spencer, Mike Starr, Big John Studd, and Trey Wilson.<br><br>It would take another 11 years before North America finally, really took notice of Jackie with the release of \"Rumble in the Bronx\".<br><br>Six out of 10.","user":"Hey_Sweden","rank":[9,10]},{"title":"Gets A Bad Rap.","rating":7,"date":"15 November 1999","review":"This movie is a lot better than people say it is.  Sure, it's not a typical Jackie Chan movie, but it's good anyway.  It has lots of action and is better than most of the buddy cop movies of the 1980's.  Don't expect this to be like all of his other movies and you may like it.  I did.","user":"magilvilla","rank":[16,21]}]