[{"title":"Forgotten Gem","rating":7,"date":"5 March 2007","review":"Premise = Six actresses are invited to a cabin in the mountains to audition for the part of Audra. Well, all of these actresses are really good-looking (well or so they're supposed to be I guess) but one, there's someone running around in a hag mask killing people around the cabin. Anyone who gets in her way will die.<br><br>I watched this movie recently and found it very entertaining, quite different from the other slashers that came out during this era, and plus the acting is actually really good especially Samantha, there are many effective scenes like the ice skating murder scene which is really well done, the dream sequence with the doll at the beginning and the final chase scene which takes a rather unpredictable turn and last but not least the ending which has a bit of a twist which i never saw coming.<br><br>The killers mask is really creepy as well and the directing is rather sleek even though we know when the killer's going strike next. All in all this is a really entertaining slasher that deserves to be remembered.","user":"acidburn-10","rank":[19,29]},{"title":"Little known slasher isn't half bad","rating":7,"date":"31 August 2006","review":"A number of good Canadian horror movies have made their way to the USA, to become cult classics. Bob Clark's outstanding 1974 horror-thriller Black Christmas remains a staple of the modern \"scary\" movie. Beloved Jamie Lee Curtis came to horror fame through the likes of Prom Night (1980) and Terror Train (also 1980). However, you may not have heard of this interesting little shocker...<br><br>Curtains is a better-than average slasher, despite some of its reviews. The movie is about six actresses who go to audition at a director's country house, where it seems someone is willing to kill for the role! While this may sound cliché, the film has enough creativity on it's side for one not to really notice. It sets up some pretty good shock sequences. Anyone who has read about this film will surely have seen mention of the infamous \"ice skating\" scene, which is very memorable. <br><br>Curtains was a troubled production though. It was to be filmed in 1980 and ended up taking years before completion. So, any of the films \"loose ends\" are more likely a product of this problem. But it does hold together. The cast is quite good; Eggar, Griffin, and Thorson are in especially top-form. The direction is well done with a touch of style. Paul Zaza's music score is an effective one. Last, but not least, the story itself is a gripper!<br><br>For horror fans, Curtains is a rare treat that is well worth seeking out. It ranks with some of the better slashers of the early '80s.<br><br>*** out of ****","user":"Nightman85","rank":[16,25]},{"title":"Charming Yet Forgotten","rating":9,"date":"13 October 2010","review":"A little while ago, a local theatre was playing Curtains as a midnight feature, after unearthing a 35mm reel of it. I didn't understand why this movie had become so rare, but it's a common fate of most independent Canadian movies from the seventies and eighties. This movie's story of how it came to be is a sad, bruised one, with missing scenes and crew disputes, and it makes me happy to see other people loving the movie these days.<br><br>Slasher film enthusiasts may be let down by this film's pacing, as it certainly takes its time to get to the violence, and when it's there, it's not particularly gory. But most people will appreciate the film's tactic of keeping you on edge with some extremely tense scenes and twists throughout. What I personally loved about the movie was how it let you get to know each of the women who would later become victims, making them interesting, likable characters whom you actually don't want to die. Most horror movies of this era chucked in annoying, well-endowed victims with stereotypes for personalities and you just waited for them to die. Such is not the case here. The actors are excellent, and many people dote on Samantha Eggar for her role in Curtains. She deserves every bit of praise.<br><br>Along with the slasher plot, there's also an underlying theme about the perils of Hollywood, how showbusiness leaves you behind as you get older, and despair for some to be a part of it. The music is well-done and very effective, particularly the beautiful ending theme.<br><br>Overall, the movie is creative and under-appreciated, but unfortunately missing explanations for certain pieces of the plot and character development. I'm hoping that sometime during my lifetime this movie is remastered on DVD with all its missing scenes and actor commentary, and there certainly are thousands of people who want the same. This movie needs a wider release; if you don't love it for what it is, you'll at least be entranced by something in it.","user":"stcanard5","rank":[9,13]}]