[{"title":"Smell the testosterone! The Dirty Dozen is the quintessential \"guys on a mission\" movie!","rating":8,"date":"8 June 2003","review":"Quentin Tarantino looks like he just might follow through with his threat to make the ultimate \"guys on a mission movie\" if he gets his 'Inglorious Bastards' on to the big screen, but he'll be pushed to equal 'The Dirty Dozen', the quintessential movie in the genre. 35 years on and it's still one of the best WW2 adventure movies, and a strong contender for the ultimate guys movie. It shouldn't be taken too seriously - I don't think anyone is going to argue it's a realistic depiction of war - but it's still one of the most entertaining movies around, and it's impressive collection of tough guys and character actors is really hard to beat. Director Aldrich had previously made the classic noir 'Kiss Me Deadly' (starring Ralph Meeker who reappears here in a supporting role) and the wonderfully creepy 'Whatever Happened To Baby Jane', but this is arguably going to be THE movie he's remembered for. Screen legend Lee Marvin ('Point Blank', 'The Killers') with the assistance of his Sgt (Richard Jaeckel), must train a motley collection of criminal and misfits (including John Cassavetes, Jim Brown, Telly Savalas, Charles Bronson, Clint Walker and Donald Sutherland), for a suicide mission behind enemy lines. Marvin is just great, extremely cool and charismatic, but also a fine actor, something which is often overlooked. The ensemble cast (which also includes George Kennedy, and two future stars of 'The Wild Bunch', Ernest Borgnine and Robert Ryan) are uniformly excellent, but Cassavetes is particularly outstanding, Sutherland is memorable as a half wit, and Savalas is unforgettable as the religious psychopath Maggott. 'The Dirty Dozen' is first class entertainment and highly recommended. It put 90% of today's \"action movies\" to shame!","user":"Infofreak","rank":[44,51]},{"title":"One of the most quintessential macho movies of all time.","rating":10,"date":"11 December 2010","review":"The Dirty Dozen is directed by Robert Aldrich and adapted for the screen by Nunnally Johnson &amp; Lukas Heller from the novel by E. M. Nathanson. It stars Lee Marvin, Ernest Borgnine, Telly Savalas, Charles Bronson, John Cassavetes, Donald Sutherland, Richard Jaeckel, Robert Ryan and Jim Brown.<br><br>1944, just prior to D-Day.<br><br>Major Reisman (Marvin) is a none conformist kind of guy and he riles the higher brass no end, so it comes as no surprise to him that he is the man assigned the unenviable task of assembling a suicide squad of army criminals for a mission to destroy a château in France. This particular château has no military value as such, but as it is used by many of the Nazi big chiefs, destroying it whilst they relax inside will upset the German plans immensely. But can this rag tag band of murderers, rapists and thieves shape up into something resembling a fighting force? Their reward, should they survive the mission, is amnesty, but Reisman for sure has his hands full on both sides of the war.<br><br>\"One: down to the road block, we've just begun.. Two: the guards are through.. Three: the Major's men are on a spree.. Four: Major and Wladislaw go through the door.. Five: Pinkley stays out in the drive.. Six: the Major gives the rope a fix.. Seven: Wladislaw throws the hook to heaven.. Eight: Jiménez has got a date.. Nine: the other guys go up the line.. Ten: Sawyer and Gilpin are in the pen.. Eleven: Posey guards points five and seven.. Twelve: Wladislaw and the Major go down to delve.. Thirteen: Franko goes up without being seen.. Fourteen: Zero-hour, Jiménez cuts the cable, Franko cuts the phone.. Fifteen: Franko goes in where the others have been.. Sixteen: We all come out like it's Halloween...\"<br><br>The Dirty Dozen has become one of those films that is a perennial holiday favourite like The Great Escape, Zulu and The Magnificent Seven. Which while it most definitely deserves such big exposure, it's a little surprising it's part of the holiday viewing schedules given its cynicism and amoral core, something which is one of the many great &amp; intriguing things about Aldrich's testosterone laced movie. Met with mixed reviews on release, with the negative side of the fence bemoaning its nasty violence and preposterous plot, The Dirty Dozen none the less performed great at the box office where it was the fifth highest grosser of the year and the number one money maker in terms of profit to budget. Coming as it did during the middle of the Vietnam War, it was evident that the paying public quite easily bought into the thematics of it all. Over 50 years since it first lured people into the picture houses, Aldrich's movie shows no sign of aged frayed edges, or better still, and more remarkable, the enjoyability factors it holds has not diminished.<br><br>What makes it a great film, then? First off is the all-star macho cast assembled by Aldrich and his team, big hitters like Marvin (stepping in when John Wayne balked at the script), Borgnine, Kennedy, Ryan and Bronson were already names to the public, but these are also supplemented by soon to be \"stars\" like Cassavetes, Sutherland and Savalas (also stepping into a role vacated by another, this time Jack Palance who didn't like the racial aggression of the character) &amp; stoic performers like Jaeckel &amp; Robert Webber. Into the mix is curio value with the casting of singer Trini Lopez and Gridiron star Jim Brown. Throw Clint Walker into the pot as well and you have got a considerable amount of beef in the stew! Secondly the film led the way for a slew of movies that featured bad guys as heroes, so with that Aldrich's film holds up well as being a hugely influential piece. Then thirdly is that not only is it intermittently funny as the violence explodes on the screen, but that it's also chocked full of action and adventure. All that and for those so inclined you can find questionable morals under scrutiny and see the \"war is hell\" banner firmly flown during the nastiness of the missions' culmination.<br><br>Split into three parts - meet the guys - see them train - and then the mission, pic has been criticised for its lack of realism, but is that really needed in what is essentially a male fantasy piece setting out to entertain? Besides which, lets applaud it for acknowledging that brutality and atrocities were committed on both sides of the fence, rest assured, The Dirty Dozen still had enough edginess about it back in the 60s! It's also true enough to say that the characters, are in the main, stereotypes, and that the unravelling story is a touch clichéd, but these are men that men want to be (okay maybe not Savalas' religious maniac rapist!) and men that women can cast a flirtatious eye over - there's plenty of character here to hang your hats and undergarments on as they appeal to the inner rebel hidden away in many a viewer. The messages in here are not sledge hammered into the story (Aldrich always said he wasn't making a message movie, just a film about camaraderie and unlikely heroes), and the construction of the action is top notch from one of America's most under appreciated directors. It's nicely shot in 70mm MetroColor/MetroScope by Edward Scaife (Night of the Demon/Khartoum) and features a suitably boisterous music score from Frank De Vol (Cat Ballou/The Flight of the Phoenix).<br><br>It's a far from flawless picture, of that there is no doubt, but it's loved by millions and continues to gain an audience yearly by those who are willing to view it on its own entertaining terms. As a boy I wanted to be Lee Marvin because of this film, as a middle aged man now, I still want to be Lee Marvin in this film. That's yet another reason why The Dirty Dozen is so great. 10/10","user":"hitchcockthelegend","rank":[47,59]},{"title":"A violent war film, and a great action-adventure entertainment...","rating":8,"date":"16 January 2000","review":"Robert Aldrich seemed torn between American heroism or to indulge in a celebration of violence with an intriguing angle on combat in World War II adventure...<br><br>A dozen dangerous criminals (thieves, murderers, rapists, psychopaths) - serving life sentences - offered a chance of pardon if they take part in a hazardous commando mission... They are trained to kill on a different level under the leadership of an insubordinate major, very short on discipline, and dropped in parachute near Rennes in Brittany to destroy a large fortified château used as a rest center and a conference place for general staff officers...<br><br>The initial tension between Major John Reisman (Lee Marvin) and the convicts quickly collapses while Aldrich's ability was building considerable tough action scenes...<br><br>Aldrich didn't neglect the character development of his superb cast offering some insights into the personalities of this unusual recruits... His believes that self-interest is the motive of all human conduct... Aldrich filled the sense of outrage of his characters, a sense so brave and different in \"Attack,\" in 1957. <br><br>The claims about capital punishment and the anti-militarism spirit were quickly discarded in favor of the terrific and cruel action scenes: the bloody climax which has a considerable number of German officers with the benefit of female companionship, all trapped in a bomb shelter...<br><br>Marvin and Oscar Nominee John Cassavetes stand out among the cast...<br><br>Lee Marvin creates the most interesting and influential violent hero: the sardonic major!<br><br>The game of death is played at its best in a powerful man's picture...<br><br>\"The Dirty Dozen\" formula was held later in André De Toth's \"Play Dirty\" in which a group of ex-criminals led by Captain Michael Caine, destroy a German oil depot in the North African campaign in World War II.","user":"Nazi_Fighter_David","rank":[33,41]}]