[{"title":"CITIZEN KANE may let some people down, but it's still worth seeing.","rating":2,"date":"2 May 2004","review":"It's a difficult undertaking for someone of my generation to watch a film like CITIZEN KANE.  Not because it's \"too old\" or \"too boring\", but because it has been hailed--almost universally--as the single best motion picture ever made.  And while the anticipation of seeing a film with such overwhelming acclaim may be quite exhilarating, actually watching it is ultimately an intimidating and somewhat disappointing experience.<br><br>This isn't to say that I thought CITIZEN KANE was a bad film; in fact, I thought everything about it was downright brilliant.  From the enchanting performances right down to the meticulously planned camera movements and clever lighting tricks, there isn't a single element of CITIZEN KANE that isn't a stunning achievement in all areas of filmmaking.<br><br>CITIZEN KANE's storyline is deceptively simple.  Even though the plot unfolds by jumping in and out of nonlinear flashbacks, it is surprisingly easy to keep track of.  The straightforwardness and relatively fast pace of the story are what make it seem intimidating.  Because everything moves smoothly along without any standstill, it feels like we are being fooled-like there is something much greater that we just can't seem to grasp.  As a first-time viewer, I knew from its reputation that there must be *something* that separates this movie from all the others; something buried within its simple plotline that everybody else has seen, but that I just could not seem to get a handle on.  And then, during those final frames, that something was revealed, and it all began to make sense.  To me, it was these moments of confusion and uncertainty followed by a sense of enlightenment and appreciation that made watching CITIZEN KANE such a meaningful experience.<br><br>But no matter how great of a movie CITIZEN KANE really is, it can never live up to one's expectations.  Although I do feel that it is deserving of its acclamation, the constant exposure to its six decades worth of hype and praise will invariably set most modern viewers' standards at a height that is virtually unreachable--even if it really *is* the best movie of all time.","user":"Cowman","rank":[706,941]},{"title":"The march of time...","rating":13,"date":"13 August 2002","review":"Citizen Kane is majestic, elegant and noble.  It begins at the end, we see a man of obvious wealth and power breathe his last, and then the mysteries of his life are unraveled via a series of anecdotes, barely remembered scenes and highly subjective memories.  The boldness of this approach cannot be overemphasized.  At the time that this film was made Hollywood was for the most part used to creating straight-forward stories with clearly identified heroes and villains.  Kane dared to present Man as he is, rife with confusions, internal contradictions and uncertainty.<br><br>As the film progressed, we see Kane, loosely based on William Randolph Hearst, the famous newspaper tycoon slowly sacrifice his ideals in order to build his financial empire, losing his friendships with those who believed in him until ultimately he looses everything he has, his marriage, his friends, and his integrity.  Though he is the richest man in the world he lives his remaining isolated in his privately built mountain estate where he has surrounded himself with material pleasures, alone and despairing, one senses that he welcomes death.  The film takes the view that wealth and power are inherently  destructive of human values.  Kane himself states `If I hadn't been born rich I  might have been a really great man.<br><br>What is so masterful about Kane is its ambiguity.  We never are certain if Kane really did believe in the values that he professed.  At the same time that he sets himself up as above the world, he longs for the affection of the common people.  This is symbolized by his exploitative, and patronizing love for a chorus girl, Susan Alexander (Dorothy Comingore).  Her character is given a paper-thin characterization, the only obvious flaw in a nearly perfect movie.<br><br>Orson Wells gives a bravura performance as Kane, both identifying with and condemning the man.  This film was his first venture into movie making after the infamous War of the Worlds radio broadcast that threw America into an uproar.  Wells, a child prodigy, had a background in Shakespearian theater, offering modernized adaptations of the Classics, a bold and unusual gesture at the time.  He brought that kind of sweeping tragic romantic sensibility to his first film.<br><br>Unconstrained by Hollywood's traditions, he broke all the rules.  The deep focus photography that gives Kane its theatrical look was one of his innovations.  A mastery of sound, gained from years of working in the radio was another.  Kane is an avalanche of technical innovation, unmatched in any other Hollywood film.<br><br>Despite the film's pessimistic outlook, it is studded by moments of joy, beauty and emotional truth.  The supporting cast of characters, most of them regulars from Wells' Mercury Theater are also superb.  Joseph Cotton is memorable as Jed Leland Kane's close friend who believes in him more then he does.  And Everet Slone is wonderful as Kane's would be mentor Mr. Bernstien.<br><br>So many scenes in this movie linger forever in the memory, one is left with a stirring vision of the frailty of the human condition, the film gives us no easy answers and while being fiercely critical of many of it's characters is universal in it's compassion and sympathy, this is perhaps the most vital ingredient for great art.<br><br>Kane was one of the most controversial films ever made.  Hearst, offended by his portrayal, offered RKO a small fortune to destroy the film.  When that didn't work his newspapers embarked on a campaign of defamation against Wells, thus proving that the film's criticism of the power and corruption of the press were precisely on target.  Wells was never given a free hand to direct how he liked again and American Cinema was deprived of the one of the greatest geniuses to adopt it as a medium of self-expression.<br><br>It's influence, was immediate, incalculable and mostly unacknowledged, the film was a box office and critical failure due to Hearst's efforts and it was not until years later that this film got the respect it deserved. Nowadays there is not one living film director of serious artistic intent that has not been deeply influenced by Citizen Kane.  It's not just a masterpiece it's a creative touchstone.<br><br>Of course there were other talents at work in making Kane, Hermann Mankiewicz's efforts on the script were indispensable and Bernard Hermann, the composer most famous for working with Hitchcock provided the films beautiful music.  Still, the film remains most obviously the work of Orson Wells, a veritable hall of mirrors reflecting the great artist's dreams, obsessions and fears.  Citizen Kane is not just one of the great works of cinema it is one of the greatest artistic creations of the century","user":"Mr_Hulot","rank":[263,353]},{"title":"why did Citizen Kane create such an impact upon its first release?","rating":10,"date":"31 August 2006","review":"Well as a media student myself , i have come across this question many times in books and during lectures. There are simply 3 reasons the film, which was considered as the \"Mona Lisa of all films\" , created such a legendary appeal upon release in 1941: 1) This was Orson Welles first cinematic debut , even though he had been a huge star in theater , he was given an opportunity few first time directors were permitted to having. He had full artistic freedom and above all power, to direct , produce, write and even star in his own picture. Therefore the film industry and RKO pictures had absolutely no influence in the making of the film and were not to know what was happening on set .Of course this was bound to generate a number of problems as businessmen were curious about the nature and plot of the film , which takes us to the second reason the film caused controversy.<br><br>2)One of the main reasons the film posed contentions was because the main character , Charles Foster Kane(Orson Welles), featured a range of similarities with real media mogul and newspaper journalist William Randolph Hurst . Therefore the film was seen as depicting the life , problems and personal relationships of a real person thus fictionalizing his life. Some of the similarities between the two persona's are:<br><br>KANE: newspaper tycoon , worked for New York Inquirer , known as the Kubla Khan of Xanadu ,married talentless singer Susan Alexander Kane, he was a political aspirant to presidency by campaigning for governor, bought his wife the Municipal Opera House, Financier Thatcher, and threat Getty's. Hurst: yellow journalist , worked for New York Journal, political aspirant to presidency by becoming governor, married acress Marion Davies, bought his wife Cosmopolitan Pictures, financier JP Morgan , and threat Tammany Hall.<br><br>-differences: Susan Alexander Kane( Dorothy Comingdore) leaves Kane later in their life however there was no marriage breakdown for Hurst and Marion.<br><br>3) The last reason and most pivotal of all to why the film was regarded the way it was , was due to its technical and stylistic innovations . The film upon its release was misunderstood and unappreciated by critics as they couldn't comprehend many of its elements and were too concerned with its dark and mysterious nature which is one of Welles's characteristics in his films. The film after all was 20 years ahead of its time and was only regarded as a triumphant success upon its second release after the American Film Noir era in the 1950's. His most prominent artistic inventions were: -the low angled camera movements -extreme facial closeups -long uninterrupted shots -chiaroscuro lighting -overlapping dialogue , giving a realistic effect to conversations -subjective camera angles -deep focus shots and depth of field -flashbacks that make up most of the film All the above and more constitute to why the film is so influential to all would be film directors and for why many people regard it as the best film of all time. Lastly we musnt forget the exceptional score by Bernard Herrmann who had collaborated also with the best known director of all time, Alfred Hitchcock , and made him the chillin sounds of strings in Psycho and Vertigo to name a few . In addition the superb photography of Gregg Toland in regards to Welles's unique eye on details. After all he wanted to put in each shot everything the human eye can see if they were present.<br><br>There are many areas of the film which are crucial , these are some of the most important , and as you can see there is never too little or too much that you can add to this masterpiece .","user":"elleglw","rank":[231,314]}]