[{"title":"An unusual and surprisingly successful blending of low budget genres","rating":13,"date":"13 May 2002","review":"The filmmakers of Flesh Gordon spent so much effort lovingly recreating the look and feel of the original Flash Gordon serials of the 1930s that they actually created a soft porn movie with real (if very modest) cinematic worth.  In fact, it's in some ways superior to the original Gordon flicks - particularly its special effects - with an extensive and surprisingly good use of stop-action animation.<br><br>Fortunately, sub-par acting is common in both porn and the old serials and this adds to the authentic feel of this parody.  But there is also some genuine acting going on too.  The best actors in the movie deliberately over-play their roles to wonderful effect.  Emperor Wang and Dr. Flexi Jerkoff brilliantly recreate the essence of Emperor Ming and Dr. Zarkov. Craig T. Nelson gives the voice of the monster a kind of laid back (yet lewd) sophistication.  It's a voice that reminds me of Bing Crosby, which makes the scene just plain weird.<br><br>What makes this film work is that instead following the usual porn formula of using the plot as a mere device to show sex, Flesh Gordon uses sex as the fundamental source its humor, enthusiastically blending the rather banal soft-core porn of the seventies with the hackneyed storylines of the thirties.  The sex takes the hackney out of the story, and the story takes the banality out of the sex scenes.<br><br>Is this movie a masterpiece?  Clearly... OBVIOUSLY... not.  But it is distinctive and original.  Flesh Gordon is an unusual case where the quite good and the very bad somehow manage to complement each other and average out to make a very entertaining movie.","user":"roarshock","rank":[46,50]},{"title":"Fun Parody of The Original","rating":25,"date":"25 October 2003","review":"This is a wonderful parody of the original serial version from the mid 1930s.  The quality of acting, writing, directing, budget, costuming, and effects is dead on, almost a one-for-one match.  Lots of great dialog, very quotable (\"Good, there's Oxygen on this planet.\").<br><br>There are two versions of this film floating around, the unrated version and a cut \"R\" version. The unrated version is the one to see!  Most films can have \"X\" material edited out of them with no consequence, but not here. Whole sections of the plot (as thin as it is) are missing without the deleted footage.<br><br>This film features early work from Greg Jein, David Allen, Rick Baker, and Jim Danforth (who is listed with his name spelled backwards \"Mij Htrofnad\"). All went on to greater things in their careers.<br><br>Avoid the sequal from 1989, it tried too hard and fell flat on all fronts.","user":"moonman-6","rank":[29,31]},{"title":"Superb","rating":21,"date":"21 June 2004","review":"The beauty of Flesh Gordon is that it has no pretensions to seriousness. Much soft porn of the 70's was so mind-bogglingly asinine that lots of us nearly gave up sex. Flesh is so totally different, being funny, that it remains in my memory from the time I saw it in the Mid-70's. I still remember Dr Jerkoff unveiling his spaceship shaped like a giant erect phallus with the words \"Fortunately I was able to complete the design before the Sex-ray took effect\". <br><br>The word 'Penisaurus' has passed into the vocabulary of Britain now, as an insult, obviously. The rapist robots with their little spring willys still linger in my memory. <br><br>If I had seen it alone I would probably have walked out, but as a teenage miscreant with a friend it was hysterical. If you are not offended by the sight of breasts and enjoy a laugh watch it with some friends and a beer or two. Excellent fun.","user":"Bruce_the_Brilliant","rank":[17,18]}]