[{"title":"The art of visual storytelling","rating":8,"date":"26 June 2006","review":"Silent film may be the only unique art form ever to have flourished and then become extinct. The great ironyindeed, tragedyof its demise is that it reached its peak only in the last few years before the talkie revolution. Silent films from 1927 through 1930 dazzle with their fluid and sophisticated mastery of visual storytelling; the last thing they need is dialogue. F.W. Murnau's City Girl is a perfect example of this artistry, and what happened to it. The follow-up to Murnau's legendary masterpiece Sunrise, City Girl was made during the waning days of silents, and in a concession to the changeover to sound it was re-cut before its release and given a recorded score featuring singing farmhands. Not surprisingly, the hybrid film sank like a stone. Miraculously, an original silent print survived and was rediscovered in the vaults at 20th Century-Fox. I first saw it at the National Film Theatre in London during a Murnau retrospective. I'd never heard of it, but when I went to see Nosferatu the speaker introducing it added, \"Be sure to come back next week and see City Girlit's better than Sunrise!\" This claim would be very hard to defend, but while lacking the transcendence of Sunrise, City Girl is in some ways a more complex and interesting work.<br><br>It also defends the honor of city girls from the laughably caricatured vamp who causes all the trouble in Sunrise. Like the earlier film, City Girl deals with the clash between urban and rural values, but here the countryside is no more pure or wholesome than the city. Unlike the vague, timeless setting of Sunrise, City Girl's milieu is the contemporary American Midwest. Kate (Mary Duncan) is a waitress in a busy Chicago lunchroom who lives in a dreary tenement and dreams of escaping the city. She meets Lem (Charles Farrell), a naïve and sweet-natured farm boy who has been sent to the city to sell his family's wheat crop. They fall in love, marry, and set out for the wheat-fields. But Kate's dreams are shattered by Lem's harsh, tyrannical father (David Torrence), and she finds herself waiting on rowdy, leering farmhands who are even worse than the lunchroom customers. Kate loses faith in Lem when he is unable to stand up to his father, and the marriage appears to be over almost before it began, until a series of melodramatic events force the various characters to examine their true motives and feelings.<br><br>Every aspect of this story is expressed through visual details. We are introduced to Lem on the train to Chicago, eating hand-packed sandwiches, oblivious to the flirtations of a vamp across the aisle whose interest is aroused by his bankroll (we know right off this isn't going to be Sunrise II.) We see Kate sassily quashing passes from customers (\"What do you do in the evenings?\" \"YOU'LL never know!\") and we see her in her dingy little room, watering a pathetic dusty flower on the fire-escape and listening to a wind-up mechanical bird while the El rushes past the window. The sweaty, chaotic bustle of the lunchroom is captured with tremendous verve. Once the scene moves to the country, the symbolism of wheat becomes the heart of the film (which Murnau wanted to call \"Our Daily Bread.\") In a ravishing scene, the newlyweds run through a glistening, swirling field of grain; when they arrive at the house, Lem's little sister greets Kate with a bouquet of wheat stalks. When the dour father enters, he rebukes her for wasting their cash crop; to him grain only means money. He also notices that Kate has put her cloche hat down on the family bible, and he is convinced that she's a floozy who sees Lem as a gravy train.<br><br>The Torrence brothers, David and Ernest, specialized in hissable nastiness, but here David's worried, American Gothic face conveys the hard life that has turned this man into a monster. It's hard to believe he could be genetically linked to a sweet-faced, curly-haired cutie like Charles Farrell, but he does make Lem's anguished weakness believable. Mary Duncan is perfect as a feisty yet vulnerable working girl, a type that would become much more common in early talkies. Duncan left the screen in 1933 when she married a polo player named \"Laddie\" Sanford. She lived to be 98, but her retirement was Hollywood's loss. I would like to see this intelligent, natural, black-eyed actress in something else.<br><br>City Girl is marred by an ending that feels rushed and unconvincing, but it raises interesting, at times troubling themes concerning marriage, traditional gender roles and family relationships. The most poignant aspect of this exquisitely directed film is not that it was one of the last silent movies made in Hollywood, but that its director would die in a car crash just three years later, at the age of forty-two. That was cinema's loss.","user":"imogensara_smith","rank":[36,38]},{"title":"Stunning and Unforgettable!","rating":10,"date":"15 August 2009","review":"I was so astonished by this movie that as soon as \"The End\" came up, I started watching it all over again. For one thing, the restoration of this forgotten classic was so stunning it was like watching a black and white movie made an hour ago. Each scene simply glowed with amazing grays and whites and charcoals. Mary Duncan as the 'City Gir' was absolutely enchanting. She was a sweet, young girl who was also feisty and was so believable and likable that she became someone you'd love to know. The movie's great loss is that she made only one other movie, 'Morning Glory\" before leaving the screen to marry millionaire polo player. She only died recently at the age of 92 She was matched by silent screen great Charles Farrell who had t difficult role of Lem, who was also simple, sweet but manly, too. Although released in l930, this film confirms how incredibly smooth and profound silent movies had become. Director Murnau brilliantly cast and directed this amazing drama--proving to one and all what a profound loss silent movies became when they were overtaken by those noisy talkies. You should definitely check out this masterpiece and be amazed","user":"jery-tillotson-1","rank":[18,18]},{"title":"Solid Murnau drama","rating":4,"date":"4 April 2004","review":"Fairly familiar story, but told with real intimacy, restrained acting, and Murnau's always sensitive and virtuoso direction.<br><br>Murnau has been compared to Welles, since both directors have cultured, poetic sensibilities, work brilliantly with actors, and constantly experiment, testing and expanding the expressive possibilities of the film medium, but here is the difference:<br><br>Welles was an extrovert, a showman, parading his brilliance.  Murnau, no less brilliant, is more subtle.  His SUNRISE is to the silent era what CITIZEN KANE is to the sound era, but even in that film his innovations are \"the art that conceals art\".<br><br>A casual viewer will see nothing in CITY GIRL but a nice story, well-executed. But the film is full of technical bravura for cinema fans: notice the perfection of the process shots in the opening train sequence. You didn't see this done as well in many major Hollywood films made even in the 1950s.  Notice the farmhouse scenes where both the interiors and the brightly sunlit exteriors, visible through windows and doors, are PERFECTLY exposed.  Even today, in the 21st century, we see films in which this isn't handled as well as Murnau &amp; Co. do it here in 1928.<br><br>I saw the 90 minute silent version, which is the one to seek out -- not the shortened, half-talkie version.<br><br>Murnau's combination of technical brilliance, bold experimentation, superb direction of actors, and deep emotional sensitivity is practically unique in film history.  He did EVERYTHING well.  And if you have a chance to see his much earlier DER BRENNENDE ACKER (THE BURNING EARTH) see how much of this he was already achieving even with the primitive techniques and equipment of 1922.  What a tragedy such a genius had to die in a car accident at the youthful age of 42.","user":"fwmurnau","rank":[22,24]}]