[{"title":"The plot is based on real events","rating":10,"date":"26 April 2007","review":"The movie very closely parallels the real events of January 30 to February 16, 1925 in terms of the general story line. There are some significant differences concerning the actions of the characters.<br><br>Floyd Collins, a cave explorer working alone (not a real good idea), was trapped in Sand Cave KY, near Mammoth Cave. He was not looking for treasure, but for a new cave suitable for commercializing to produce income in an economically depressed region...and this was before the Depression occurred.<br><br>He became trapped on the way out of the cave by a 27 lb. rock which rolled onto his leg in a narrow crawlway. The configuration was such that it could not be moved enough to get his foot past.<br><br>When he failed to return home, the family went searching and quickly found him only 150' inside the cave.<br><br>A huge rescue effort was mounted and a cub reporter, Skeets Miller, from Louisville KY showed up to cover the story. It became one of the three most widely broadcast events of the time. Besides the extensive newspaper coverage, the relatively new medium of commercial radio riveted listeners with hourly accounts. It quickly became the first media circus ever seen.<br><br>Because of the print and radio coverage people began flocking to the site. A carnival atmosphere did indeed spring up around the cave. The state police and National Guard were called out by the governor to control the chaos and the more than 20,000 onlookers. The similarity between the real event and the movie on this account are likely nearly identical.<br><br>As in the movie, a decision was made to drill a shaft and, also as in the movie, the rock was fairly unstable and prone to collapse from the pounding of the cable tool drilling rig. The longer the effort went on, the more unstable the cave passage became.<br><br>Unlike Kirk Douglas' character in the movie, Skeets Miller served a most honorable role. Due to his small build he became one of very few persons able, and eventually the only one willing, to enter in an attempt to deliver food and water to Collins. He received a Pulitzer Prize for his reporting. Also unlike the movie, there was no manipulation of the event to delay the rescue, but there was considerable disagreement over how to best do it. Area coal miners made the initial attempts and the event concluded with the above-mentioned shaft.<br><br>Collins was presumed to have died 3 days before rescuers reached him. Because the conditions were so unstable, the body was left in the cave. The family was able to remove him about 80 days afterward for a proper burial. Later, his glass-topped casket was returned to the now-commercial cave as a tourist attraction. It was removed once again, and finally, in 1989.<br><br>In 1982, a definitive account of the event was published in the book 'Trapped!'. A most informative read.<br><br>In a take-off of the 'Free Tibet' bumper stickers, vehicles are occasionally seen with a 'Free Floyd Collins' sticker.","user":"castolon","rank":[68,75]},{"title":"A brilliant movie that lingers in the mind","rating":27,"date":"27 March 2004","review":"Of the many movies I viewed in the early 50's, so many ,like now, were here today, forgotten tomorrow. However some movies that became memorable and that were able to make a dramatic impact on this young guy  include, Duel in the Sun and  Gone with the Wind.   Strangely enough, Ace in the Hole is the most memorable of all movies viewed. It is one that invades the mind and leaves one sad.<br><br>Few films I remember as vividly as this dark movie, the images linger to haunt me still.  'Why?' one might ask 'would a sombre movie like this made over 50 years ago remain so memorable, when so many others have vanished. Was it the surreal inhumanity of the plot, the repugnant newsman devoid of ethics, the exploitation  of the trapped victim, the purposeful prolonging of the victim's entrapment to create a media frenzy, the ultimate commercial creation of an 'event' style attraction complete with a circus like atmosphere surrounding the cave while the victim remained entrapped and close to death.'<br><br>Supposedly based on a real incident, it's a tough movie to watch and more so if one is prepared to accept the premise that such inhumanity displayed in the movie has an element of truth.<br><br>I echo the desires of others to have the availability of this movie on VHS or DVD.  In the interim  my memory will continue to keep the images intact. See it if you can.","user":"dbtuson-1","rank":[57,66]},{"title":"A Prophetic film","rating":3,"date":"3 June 2002","review":"There are some films that when you see them you ask why they aren't available to rent or own.  This is one of them.  I had the fortune of seeing this hidden gem on the big screen and was pleasantly surprised. <br><br>With Kirk Douglas playing a Reporter whose been around the block, always looking for a shortcut, comes across an opportunity to exploit a man caught in a mine shaft.  I have read where critics had considered the circus atmosphere of the the film unrealistic.  It seems Mr. Wilder got the last laugh.  If you are interesting in great dialogue and good story telling, I suggest you find this","user":"noir1991","rank":[45,52]}]