[{"title":"An incredibly edgy, self-aware film","rating":26,"date":"26 January 2005","review":"Time has no pity, no sympathy, no joy and no sorrow. It's passage denotes the brevity in which the living inhabit the earth. In TIME WITHOUT PITY, a young man is dong time in prison for a murder he did not commit. A correctional institution is about to put a stop to that young man's time at the behest of the State. A father caught between the daunting task of fighting the system for more time, and forgetting time altogether at the bottom of a whisky glass. A broken woman mourning the loss of time never spent with one who's out of time. Every character in this drama is lost somewhere in their own guilt ridden space and time, but director Losey makes sure his audience is always aware, littering the screen with watches and clocks ticking like a giant timebomb about to explode as the desperately pathetic father searches for a clue to disable the alarm. Lost in an alcoholic haze that is almost dreamlike in it's ability to paralyze action, he clumsily attempts to win back for his son the time he let slip away. Is it too late? An incredibly edgy, self-aware film, TIME WITHOUT PITY clearly states its objection to the State as executioner. From the opening scene, we know the son did not commit the murder, but neither the State, \"You must keep your visit short . . . we don't want to upset the prisoner,\" the Church, \"He's given himself over to more compassionate hands,\" or the anti-capital punishment advocates, \"We're not interested in whether young Graham is innocent or guilty,\" seem to have a specific interest in the individual. To make matters worse, young Graham himself has given up hope and when his father pleads, \"don't give up,\" he asks, \"What difference would it have made if you had died when you were my age?\" And this question gets to the core of the film; it's resonance heavily influencing the final pivotal scene.","user":"stephen-357","rank":[30,34]},{"title":"Everyone has a secret. It's not always written in the face.","rating":9,"date":"15 April 2014","review":"Time Without Pity is directed by Joseph Losey and adapted to screenplay by Ben Barzman from the Emlyn Williams play Someone Waiting. It stars Michael Redgrave, Ann Todd, Leo McKern, Paul Daneman, Peter Cushing, Alec McCowen, Renee Houston and Lois Maxwell. Music is by Tristram Cary and cinematography by Freddie Francis.<br><br>David Graham (Redgrave) is a recovering alcoholic who comes out of the sanitarium to try and prove his son is innocent of murder. His son, Alec (McCowen), is to be hanged in 24 hours for the slaying of his girlfriend. David finds he is constantly met with brick walls and his sobriety is tested at every turn, but salvation may lie with the suspicious Stanford family...<br><br>Blacklisted in America, Joseph Losey went to the UK and made a number of films under various pseudonyms, Time Without Pity marked the first time he would put his own name to the production. It's also a film that stands tall as another of Losey's excellent British offerings.<br><br>Losey and his team do not make a murder mystery, from the off we see who the killer is and it's not young Alec Graham. This is a device that in the wrong hands has often over the years proved costly, where viewers looking for suspense have been sorely short changed. What happens here is that we are privy to an investigation by a man in misery, battling his demons as he frantically searches for redemption.<br><br>Tick Tock. Tick Tock.<br><br>Shunned by his estranged son, who would rather be hanged for a crime he didn't commit than accept his \"waster\" father's help - that might in turn give him false hope, David Graham is a haunted being who is closer to solving the case than he knows. This brings us viewers tantalisingly into the play, we know who it is, we can see how they react around David and how the other players who are hiding something also behave from scene to scene. The script never looses focus, it constantly keeps a grip on the tension as the clock ticks down on the Graham's.<br><br>Tick Tock. Tick Tock.<br><br>Losey and the great Freddie Francis are a dream pairing, a meeting of minds who could produce striking lighting compositions and scenes of other worldly distinction. Time Without Pity is full of such film making smarts. Time is a key, obviously, clocks feature constantly, including one classic era film noir extended scene as David visits a potential witness who has her home filled with alarm clocks! Alarm clocks that keep going off at regular intervals, thus putting an already twitchy and sweaty David Graham further on the edge of his nerves.<br><br>Tick Tock. Tick Tock.<br><br>One scene enforces that on the page there's an anti-capital punishment message, but as a bunch of suits sit in a room digressing about the ethics of it all etc, Losey and Francis fill the room with stripped shadows filtered via the lead patterned windows, it's that what you remember, not a social message. Gorgeous and potent all in one. Mirrors feature as well, with one elevator shot superb, while the bittersweet ending deserves better credit than it got at the time of release. Certainly noir lovers will enjoy it as much as they enjoy some other kinks in the story narrative.<br><br>Over the top of it all is a brilliant musical score by Tristram Cary (all his 50s work is worth checking out), three years before Herrmann brought bloodied strings to Psycho, Cary deals from an earlier deck of cards with string menace supreme, while his ticking clock motif is a pearler. Redgrave is terrific, a sweaty mass of fragility, while Todd, Cushing and Houston (wonderful) bring class to their respective characters. Losey's misstep is in not reigning in McKern, who is way too animated throughout, but such is the strength of everything elsewhere, it can't hurt the picture at all. Oh and look out for future Miss. Moneypenny Lois Maxwell, the little minx.<br><br>Now widely available on DVD with a good print, Time Without Pity demands to be better known. 9/10","user":"hitchcockthelegend","rank":[24,29]},{"title":"Relentless Thriller","rating":10,"date":"29 March 2002","review":"This Emlyn Williams play about the relentless search for truth intertwines craftily in and out of the lives of some very imperfect human beings and builds to a surprising but inevitable ending.<br><br>Redgrave, McKern, Todd, Plowright, Maxwell, Daneman and the rest of the cast all do well to bring this gritty black and white puzzle into focus. The son played by Alec McGowen was a bit over-the-top at times but then his character's madness required that.<br><br>It's not a masterpiece...but I don't expect there are too many of those around.  But what it does provide in dramatic tension elicits interest and compassion from the viewer until the very end.<br><br>The Tristram Cary music must be cited here for its unflinching power to shake us up and take notice of the action on the screen.  If there is any masterful work here it is the music.<br><br>The only qualm was the less-than-satisfying editing which tended to bring the down the tension-building instead of heightening it.<br><br>Yes, it was a low-budget movie...it's a cop-out to say that in view of the fine acting of the magnificent cast which redeemed it many times over.<br><br>I'd recommend this to fans of film-noir, classic thrillers, mysteries and the British cinema.","user":"Enrique-Sanchez-56","rank":[19,24]}]