[{"title":"25 years later?","rating":6,"date":"14 April 2014","review":"In March 1989, I was on spring break, staying at my dad's house, when I saw a TV commercial for \"She's Out of Control.\" Although I was a guy, I was fascinated by the idea of a geek who miraculously changes and ends up conquering all. It seemed to me like an underdog story, and I've always liked that kind of story. But upon rushing to the theater on opening night--April 14, 1989--I was surprised to discover that the movie was really about the dad and his obsession over protecting his daughter. Still, I found it enjoyable enough, even with the PG rating.<br><br>Exactly 25 years later, I find myself typing a review after having watched \"She's Out of Control\" for the second time--on DVD, and on my Xbox One. What compelled me to revisit a movie so notoriously reviled by Siskel and Ebert? I suppose I just wanted to watch again it 25 years to the day (for the perfect timing), and see it from the perspective of a 42-year-old, as opposed to my 17-year-old self in 1989.<br><br>As many others have noted, this movie is really a movie-length sitcom with some mild profanity, and some other PG-rated material. It's mostly harmless, at least for people 10 and older. It doesn't break any new ground or develop its themes in any insightful way, but I found it reasonably entertaining and likable. It's what you call a \"family movie,\" meaning that it tries to appeal to everybody--children, teens, and adults.<br><br>Those of you looking for late 80s nostalgia will be bombarded with music video-inspired editing and closeups, Paula Abdul-choreographed dancing, and Aqua Net-assisted hair. The girls' bedroom, with its George Michael poster, oversized Swatch clock, and Apple IIc, particularly encapsulates the final years of the Pastel Decade. Also, look for appearances by Todd Bridges and Dustin Diamond.<br><br>So, what do I think of it today? Am I any smarter than I was in 1989, two months before my high school graduation? Nah, I'm still stupid--and had a good time being stupid for the second time.<br><br>Exactly 25 years from now--April 14, 2039--I may find myself watching \"She's Out of Control\" for the THIRD time--in 4K. If IMDb still exists, I'll be sure to let all of you know about it on the review page.<br><br>Happy 25th birthday, \"She's Out of Control.\"","user":"jterrell","rank":[10,10]},{"title":"Lots of fun","rating":9,"date":"31 July 2001","review":"This is a really, really good movie.It's a great teen flick and it's enjoyable even if you're not a teen. There's no swearing in this movie;they only say b**ch once, that's it. There's no violence, there is however some sex-related talk. Except for that, it's a good clean movie. A great movie for fathers and daughters to watch together. Lots of very '80's hair, clothes,and music!Very funny, very cute, a good choice. I recommend it!","user":"daisyduke8000","rank":[13,16]},{"title":"Predictable But Fun To Watch","rating":27,"date":"27 February 1999","review":"If there's one thing to say about the 80's it's that their movies was aimed at about the same kind of audiences.  And this movie is no exception.<br><br>Tony Danza plays Doug Simpson, a widowed father who's been raising his 2 daughters pretty much alone since their mother died.  And according to him (which I agree with) he's done a pretty good job of it.  He pretty regularly gets help from his girlfriend, Janet, played almost flawlessly by Catherine Hicks.  His life seems to be perfect and in control.  Then he goes on a routine business trip and comes home to find his eldest daughter, Katie, the hottest ticket in town.  Doug is in a state of shock and isn't used to guys calling all hours of the night, and Katie coming and going as she pleases. So he seeks help in a psychologist who specializes in father/daughter relationships.  But can the doctor help him before Doug does something that he will regret?<br><br>This movie isn't the kind of movie you'd see on an Oscar Ballot but is fun to watch.  Tony Danza is perfectly cast as the nervous but loving father, Doug.  Ami Dolenz is well cast as Katie.  She actually looks like she's having fun playing the character.  Of course, who wouldn't enjoy playing a character that everyone thinks is hot and wants to date.   Laura Mooney steals every scene she's in as the sarcastic and under-appreciated younger sister Bonnie.  Matthew Perry (Friends) has a small part in this movie as one of the guys Katie goes out with.<br><br>It's also interesting to try and guess who exactly Katie is going to end up with in the end.<br><br>If you're in the mood for a sweet, often funny movie, or a fan of any of the cast, then I highly recommend this movie for you.","user":"Celine-4","rank":[5,6]}]