[{"title":"A Great Metaphysical Tragicomedy","rating":9,"date":"9 November 2003","review":"It's rare to find five films that offer as much combined intelligence, passion, visceral excitement, and uncontrolled belly laughs as this. \"The Ninth Configuration\" is the sort of film people either love or hate. Like many great works of art, it doesn't settle into any middle ground. It's my all-time favorite movie, not perfect but a real screen miracle all the same. This is the sort of movie they don't make any more, because they never really made anything like this. Just this one time. For that, and much else, it is unique.<br><br>Scott Wilson plays the despairing Capt. Cutshaw, who believes the universe is a random void based on suffering and cruelty. He is challenged in his atheism by Stacy Keach, a Marine colonel sent to command the institution where Cutshaw and other Army servicemen, many Vietnam War heroes, have been committed to after assorted acts of deviancy. Cutshaw's own madness culminated in his refusal to be launched into space during a final countdown, vividly pictured near the beginning in one of many arresting visuals when the horizon around the launching pad suddenly fills up with the sight of a ferocious, threatening moon, several times bigger than life.<br><br>Cutshaw and Keach's Col. Kane duke it out in a serious of probing yet riotous metaphysical dialogues. \"I don't belong to the God-Is-Alive-But-Living-In-Argentina club,\" Cutshaw announces. \"But I believe in the Devil alright. And you know why? Because the prick keeps doing commercials!\" Kane's counterargument, much weaker at the outset but gaining intensity as Cutshaw's desire to be converted becomes more clear, is that if evil is as powerful and omnipresent as Cutshaw thinks, correctly, than why doesn't he also believe in the real, counterbalancing power of human goodness as something that has its origins beyond humanity?<br><br>Meanwhile, the other inmates follow their own neuroses, adapting Shakespeare for dogs and trying to train atoms to allow humans to walk through walls. There's also Neville Brand's Major Groper, a put-upon asylum keeper who finds himself victimized by such pranks as having his name attached to a love letter sent out in a mass mailing addressed to \"Occupant.\" \"I got phone call after phone call,\" he complains, adding bitterly that the female respondents he did contact were \"ugly as sin.\"<br><br>People criticize the movie for being filled with such amiable nuttiness, but it relieves the heaviness of the central story and sets the right tone of anarchy and chaos to be sorted out as the picture develops. The third character in this film, after Cutshaw and Kane, is Ed Flanders' Dr. Fell, the medical officer who treats his hangovers with whisky and Alka-Seltzer and observes the lunacy around him with a bemused calm. But he has no small stake in the larger story being worked out between Kane and Cutshaw. In fact, he's more the central figure than anyone, and watching his reactions at key moments is one of the many treats of repeat viewings.<br><br>The acting is superb, particularly by the three principals. As we learn in the penetrating director's commentary that accompanies the DVD, the three leads were originally supposed to be Nicol Williamson as Kane, Michael Moriarty as Cutshaw, and Jason Robards as Fell. They would have been good, but not anywhere near as good as the three performances we have. Further proof of God's existence, for anyone who feels the \"Ninth Configuration\" argument advanced by Kane doesn't hold water, can be found in the fact Wilson and Keach were last-minute replacements in a low-budget film made only to help create a loss-leader for the producers. Unpromising origins to be sure, yet such a brilliant payoff. And how richly perverse: I love the way Kane makes his strongest case for man's goodness while dressed in full Nazi regalia. You don't even notice that the first time you see it, because the power of his words and the questing desperation in his eyes.<br><br>I'm dancing around the story itself, because a first-time viewer deserves surprises. Think of C.S. Lewis's \"The Screwtape Letters\" with a kick-ass bar fight, and you are in the right ballpark. Add to that the moody set design of an old castle in the Pacific Northwest (but actually shot in Hungary), an unobtrusive but powerful score, and surefire direction by screenwriter William Peter Blatty, who sets every scene as a sort of tableau of Cutshaw and Kane's inner turmoil.<br><br>Most of all, the film is amazingly quotable, particularly the canine Shakespeare adapter's (Jason Miller, sublime as Reno) unique take on \"Hamlet,\" which takes the story in a whole new direction while offering a brilliant analysis of Shakespeare's great play. Even the little lines resonate with rare power. \"Every kind thought is the hope of the world,\" Fell says at one point. Humble but true, as this film is proof.<br><br>You may not be converted into a belief in the divine, and the end does push things a bit harder than many would like (though with a blind courage rarely seen in film), but \"The Ninth Configuration\" will make you think a little more about the questions of our existence. And you will laugh a lot on the journey. Like I said, they don't make films like this anymore because they never did. This is a one-of-a-kind experience worth seeing.","user":"slokes","rank":[80,88]},{"title":"THIS is how to make a movie.","rating":10,"date":"8 March 1999","review":"I rented this film one night when I was tired of seeing the same things in the \"New Releases\" section, so I (shudder!) headed for the catalog titles, and picked this one out because--God, am I shallow--the cover looked interesting. Turning over to the back, I skimmed the summary, saw that it starred Mike Hammer and the guy who mooned us in the last season of \"St. Elsewhere\", so I thought that it may be just bad enough to be amusing. So I plunked down my three bucks and went home wondering if I wouldn't have just been better off watching reruns of \"Married with Children\" all night.<br><br>But I watched this movie. Then I rewound it and watched it again. Over the next three days, I watched and rewatched every frame of this masterpiece more times than I should publicly admit. I was moved beyond words, beyond being an audience. I became a disciple--even a proselyte--for this film. Stacy Keach completely astounded me, someone who knew him only as Mike Hammer. People, this man can ACT. I saw every demon his Colonel Kane carried with him. The rest of the cast, with a special metion for Scott Wilson's amazing performance as a tortured astronaut and for Ed Flanders, who kept his character's true motivation well hidden until it could stand to be covered no more, was perfect.<br><br>But this movie is, above all, about the writing and the direction. William Peter Blatty cared about his project, and the lucky few (sadly, VERY few) of us who shared in it were fortunate enough to see cinematic perfection virtually attained. Watch this film, let it develop, don't question where its motives are until it decides to let you in on them. Give it your full attention, and you will be rewarded with a treat we so tragically, rarely get to have. No special effects, no huge budget. Just artistry. Pure, refined artistry.","user":"DaJ","rank":[83,97]},{"title":"Aren't the hidden gems wonderful?","rating":10,"date":"22 October 1998","review":"Well, well, well.  At last a rating I can fully agree with.  Yes, the Shawshank Redemption was very good.  But this is a hidden classic. If you're one of those people (like me) who loves to be taken completely by surprise by a movie, this is the one for you.  The IMDB rating says it all: VERY few people know about this one, but those who do are nearly unanimous: this is outstanding storytelling.  First time viewers, be warned:  be patient.  Let it happen.  You won't know where it's going at first.  Your patience will be rewarded, I assure you - it all comes together, culminating in a bar-room brawl that is an absolute textbook piece of tension-building.  And then, you'll want to rewind it and watch it all over again, to pick out all the clues that slipped by you the first time through. Quentin Tarantino, eat your heart out:  THIS is how it's supposed to be done.","user":"JimSpy","rank":[35,40]}]