[{"title":"No Masterpiece But Very Fun","rating":20,"date":"20 January 2006","review":"Everybody's favorite transvestite serial killer is backwith her tongue firmly placed in her cheek and a little something missing from between her legs. This time around, quirky Angela Baker (now being played by Pamela Springsteen) daringly returns to camp once again with a completely different persona; that of an overly blithesome camp counselor with good intentions for her naughty little campers. But her sinister past fails to stay buried as each one of the troublemaking kiddies begin to show their true colors and quickly secure a place on Angela's bad side.<br><br>Since the beginning of the slasher craze, the moral being sent out to teenagers wasn't something you'd consider subtle. Getting involved with drugs, alcohol and premarital sex wasn't just a sin in these movies, it was a first class ticket straight to hell by means of brutal slaughter. Failed attempts to instill values in these unlikable little drug-addled fornicating sinners (a.k.a. campers) leaves Angela with no choice but to follow this slasher trend and \"weed out the bad\". The ongoing mistake of most filmmakers, however, was allowing this sort of teen behavior to seem funny and hip instead of shunned. But in Unhappy Campers, we're given a much needed satirical take as we find ourselves rooting for the crazed killer instead of the victims, which is quite a welcomed departure.<br><br>As the campers quickly begin dropping like flies, Angela smoothly covers up her tracks by disguising all the disappearances as nothing more than kids who were sent home for unacceptable behavior. But good girl Molly (played by Renée Estevez) realizes that something isn't quite right. Even though she's the typical virginal sweetheart we're meant to root for, I was very much in favor of Angela's motive and couldn't care less if she murdered a few innocents along the way. That, my friends, is the power of Pamela Springsteen. She somehow manages to put a hold over her audience, allowing her to get away with anything and still be lovable. She made me feel free to point and laugh at the mangled corpses of these idiots and not feel guilty about it. Sure, that's an awful thing to do, but hey these kids really had it coming, especially when they're named after members of the 80's Brat Pack and sport mullets among other things.<br><br>Although the death sequences don't have much gore and weren't executed to their full potential (as a result of budget limits I'm sure), they still came off creatively funny and deliciously mean spirited. Using silly one-liners just before brutally disposing her victims, Angela makes sure to get her point across of how uncompromisingly stupid teenagers can be, leaving us laughing and anxiously anticipating her next move. Adding to the satire, there happens to be plenty of girls who love to flash their wobbly bits just about every two seconds for no apparent reason. With acting that could barely pass as decent, there are also plenty of horribly delivered lines of dialogue peppered throughout. Don't be surprised if you're brought to laughter by the unintentional humor more than anything. But as long as you're laughing, who really cares, right? While most horror movie sequels tend to be nothing more than boring and unneeded retreads, writer Fritz Gordon thankfully brought us into new territory with his cheesy yet utterly lovable sense of cruel humor. Although Unhappy Campers isn't exactly a masterpiece and doesn't quite compare to it's predecessor, it still works nonetheless as a fun little guilty pleasure for us die hard slasher fans. After all, the world is a better place with killer Angela on the loose, ain't it?","user":"Apolcold","rank":[46,58]},{"title":"Good movie, but who the heck is the chick on the box cover?","rating":9,"date":"9 April 2000","review":"It's not easy being a horror movie fan. After seeing some spectacular masterpieces you start to realize that there aren't many good ones, and you'll spend most of your valuable movie-watching time on lame tripe that contains no originality or jollity, desperately searching for another classic. But I've discovered that if you lower your standards a bit you might find some less-than-classics that are still fun and enjoyable, if not legendary works of art. I humbly submit \"Sleepaway Camp 2\" as a tolerable entry in the slasher movie archives. <br><br>First of all, as far as deranged mass-murderers go, you could do a lot worse than Angela, a demented transsexual camp counselor who flips out at the most minor rule-breakers and reacts lethally, all while sporting a smile and never feeling blue. Our cheery Angela is the most \"can-do\" serial killer ever. You'll never find a copy of \"Catcher in the Rye\" or \"American Psycho\" near her victims- but maybe \"Life's Little Instruction Booklet\"!<br><br>Next of all, it's got a lot of killings. Some movies give you three, maybe four killings, but this one has a crate-full of slaughter- burning, eye-gouging, stabbing, beheading and more. Main characters or peripheral characters, on-screen or off, pretty much everyone gets it in this movie. There's even a classic scene where Angela forces one loathsome character down the hole in an outhouse! (If that doesn't sell you on this movie, nothing will.)<br><br>Finally, the cast is pretty good.  The heroine is the lovely Renee Estevez, who should be a bigger star. She's always super-likable, (most notably as Betty Finn in \"Heathers\"). The severely unstable Angela is brought to life by Bruce Springsteen's sister Pamela, and puts in a wonderful performance here. <br><br>I can't recommend parts one or three in the epic \"Sleepaway Camp\" saga, because they're pretty putrid, but part deux is a pretty good diversion from the standard cinematic defecation that's passed off as entertainment.","user":"zmaturin","rank":[24,31]},{"title":"A Wickedly funny and brutal horror spoof!","rating":10,"date":"29 February 2000","review":"Sleepaway Camp II is a great horror sequel, not only does it manage to equal the demented original, but in many areas, it actually improves upon the 1983 masterpiece.  <br><br>Angela is back, this time at Camp Rolling Hills and posing as a camp counselor.  She's pretty cheerful until some of the immoral teenagers start getting under her skin, then it's death by battery acid, power drill, knife and much, much more!  The character of Angela Baker this time out is played by Pamela Springsteen (Bruce's sis) and she does a wonderful job.  Some have criticized this film for making its maniac too likable, and that is a minor fault, but Pam is wickedly funny, often creepy, and always a great presence on screen.  <br><br>Sleepaway II ties horror and comedy together very well, being in turn funny and creepy, it's much more of a subtle horror parody than the likes of Scream, and a lot more fun!  For fans of the genre that have managed to miss this one, definately check it out, its got enough nudity, blood and overall fun for 10 summer camp slashers!  As horror goes, it rates a solid 8 out of 10 on a serious scale!","user":"matts1979","rank":[9,10]}]