[{"title":"Lots of humor, terrific performances, and exotic locales.","rating":27,"date":"27 September 2000","review":"Peter Ustinov's Hercule Poirot returns to it's big screen roots with lavish travelogue scenery and a roster of legendary stars.  Long time film star Piper Laurie steals the film as Emily Boynton, a Cruela deVile style evil stepmother, and former prison wardress.  Every moment she is on screen is pure delight as she marches around and belts out orders.  She has had a great second career in her elder years(\"Carrie,\" \"Wrestling Ernest Hemingway\").  The film begins when her lawyer, Jefferson Cope (David Soul), tells her that her recently deceased rich husband made up a second will that split her inheritance with her grown children, a rather spoiled and naive group of sniveling brats.  She knows the lawyer to have a few skeletons in his closet and forces him to burn the will, then announces she is taking her brood on a vacation to the Holy Land.  While on holiday she meets up with Lady Westholme (Lauren Bacall.)  Bacall is quite good as the American-turned-British member of Parliment.  If anyone could stand toe-to-toe with Piper Laurie's over-the-top performance it would be Lauren Bacall, but we see very little interaction between the two grand ladies of cinema.  An opportunity missed and for the most part just two women who happen to be on the same tour.  To fill out the cast we have Hayley Mills as Lauren Bacall's assistant, John Gielgud underused as the governing legal agent, Colonel Carbury, and a host of capable actors as the usual assembly of suspects in the usual assembly of sub-plots, mostly red-hearings. Ustinov perhaps does a little less sleuthing here than usual and is really not much more than an excuse for the film to be made.  In the first hour, the detective overhears just about everything the audience hears merely by the coincidence of having his chair in the right place at the right time. \"A gift\" he tells one of the suspects.  When such a fault in the script is so obvious that the director feels he must give an explanation (a shoddy one at that) to the audience, I suppose the movie moves more into the realm of spoof than mystery.  This film does have a lot more humor and entertainment than the other films in the series.  Whereas most of the Ustinov-Poirot films tend to be a bit dry and long, \"Appointment with Death\" is quite breezy and whisps us along a plot that has by now become way too familiar. Without the humor and eccentric performances there would have been little here to warrant a film.  Like the 100th episode of \"Murder She Wrote\" it is no longer important who did it, or who got killed.  It's just a lot of fun watching old pros ham it up.","user":"SanDiego","rank":[32,37]},{"title":"Underrated Christie Adaption","rating":9,"date":"12 August 1999","review":"This is the most under-appreciated Agatha Christie film in my opinion. The movie has a top grade cast (for the most part) including  Peter Ustinov, Lauren Bacall, Piper Laurie &amp; Hayley Mills. Mills and Bacall give the best supporting performances as an Archeologist and Member of Parliment respectively. The solution to the murder of evil mother Laurie isn't an easy one, but it all makes sense in the end.  The plot moves along at a good pace, and features beautiful locations. If you want a good mystery, go and rent Appointment with Death!","user":"MFH","rank":[36,47]},{"title":"Nice scenery and a very good cast save the weakest of the Ustinov Poirot films","rating":6,"date":"5 September 2009","review":"Agatha Christie's Appointment With Death is not her best book, but is well crafted and a pleasant read. This adaptation isn't terrible, but it is the weakest of Peter Ustinov's outings as Poirot. Speaking of Ustinov, he is excellent here, I had no problem with him. And Lauren Bacall, Carrie Fisher, Jenny Seagrove and John Gielgud give fine support. The film does have some splendid locations, even if Petra was changed to Jerusalem if I remember rightly, and the music was good too. However, the script isn't that polished, a lot is changed from the book and some of the changes are underdeveloped, the character of Hassan was unnecessary. But my main gripe with the movie was the character of Mrs Boynton. The same applies for the recent David Suchet version(which was more unfaithful but better musically and visually, and the acting was more solid in that one too), the character of Mrs Boynton was never done quite right, despite the wholly hateable portrayal given by Piper Laurie. In the book, she is a bit of a tyrant, in the adaptation, she was portrayed as nasty and cantankerous, but lacked the depth of the character in the book. Overall, not bad, but I did think Death on the Nile and Evil Under The Sun were better. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[10,11]}]