[{"title":"Surreal, bloody, erotically charged odyssey","rating":8,"date":"17 February 2006","review":"When you compare what Brian De Palma was doing in the 80's to what passes for entertainment today, his films keep looking better and better. \"Dressed To Kill, \"Blow Out\", \"Body Double\", \"Scarface\" and \"Carlito's Way\" are all superb works of a cinematic craftsman at the peak of his powers. The guy had a long run of better than average films. This is pure Hitchcock with an 80's dash of lurid perversion, an affectionately told tale of lust and murder with plenty of twists, huge helpings of style, a stunning Pino Donaggio score, and a trashy, giallo-inspired plot. De Palma's love of complex camera-work and luscious, blood-smudged visuals helps overcome the logical holes while the terrific performances of Dennis Franz, Keith Gordon (a good director in his own right), Nancy Allen (De Palma's wife at the time) and Michael Caine make every scene special. Let the virtuoso take you on a surreal, scary, erotically charged odyssey and you'll enjoy every frame of \"Dressed To Kill\".","user":"fertilecelluloid","rank":[63,78]},{"title":"De Palma's best known, but not best Hitchcock homage. Style triumphs over substance but it's still good fun.","rating":20,"date":"20 January 2003","review":"'Dressed To Kill' was Brian De Palma's third Hitchcockian thriller, and his most successful. I don't necessarily mean artistically successful, but it still remains one of his best known movies, and is the one on which his reputation as \"that Hitchcock\" guy mainly rests on. De Palma has made all kinds of movies in his long career but it says a lot for the impact 'Dressed To Kill' had on audiences for him to be stereotyped like that by many movie lovers. In 'Sisters' De Palma paid tribute to 'Rear Window', in his underrated 'Obsession' it was 'Vertigo', and this time around 'Psycho' is the major inspiration. Some critics of De Palma complain he is more interested in style over substance, and in 'Dressed To Kill' there is some truth in that. You will probably guess the murderer after the first 20-25 minutes, then think to yourself \"no, that's just a red herring and there will be an unexpected twist later on\". You might then be a bit let down when the your initial guess turns out to be correct after all, but there are enough thrills and dazzling sequences throughout to keep most thriller fans happy. Michael Caine and Angie Dickinson are both pretty good in their respective roles, but Nancy Allen ('RoboCop') gives the real outstanding performance in the picture. De Palma would subsequently give her another good role in 'Blow Out' opposite John Travolta. Also strong are Keith Gordon (who went on to star in John Carpenter's 'Christine') and Dennis Franz ('NYPD Blue') in supporting roles. Personally I don't think 'Dressed To Kill' is as good as 'Sisters', but I still think it's first rate exploitation thriller and definitely worth watching. Not De Palma's most interesting movie by a long shot, but still one of his most watchable.","user":"Infofreak","rank":[25,29]},{"title":"De Palma is in his element here.","rating":8,"date":"5 January 2013","review":"\"Dressed to Kill\" is an intense, dreamy, erotically charged thriller, and clearly another of filmmaker Brian De Palma's homages to the works of Alfred Hitchcock. It manages the neat trick of being fairly classy and rather trashy at the same time, as De Palma brings all of his directing skill to bear. This may not be his best but it's certainly one of his most well known, thanks in no small part to the excellent star trio of Michael Caine, Angie Dickinson, and Nancy Allen; Allen, of course, was married to De Palma at the time.<br><br>Caine plays an eminent psychiatrist, Dr. Robert Elliott, and Dickinson portrays Kate Miller, one of his patients who's not getting any sexual fulfillment in her life. Unfortunately, once she is able to experience an afternoon of passion the satisfaction is short lived, as a tall, cold looking blonde woman in sunglasses and trenchcoat slashes her to death with a straight razor. (This has to rank as one of the scariest ever elevator rides captured on film.) A witness on the scene is high priced call girl Liz Blake (Allen), who's accused of the crime after stupidly picking up the murder weapon. So she ends up working with Kate's son Peter (Keith Gordon) to try to identify the woman, who Liz and Peter guess to be another of Elliott's patients.<br><br>In the opening minutes of his film De Palma shows you what you're going to be in for, showing Dickinson pleasuring herself in the shower (intercutting shots of Dickinson with those of a body double) until a male stranger materializes behinds her and starts forcing himself on her. The combination of sex and danger is always stressed in this movie; as we will learn our killer has some severe psycho sexual problems. There are some highly memorable sequences, such as an extended seduction taking place inside an art museum, that being followed by a steamy coupling in the back of a cab. Other aspects that make it effective are Jerry Greenberg's editing (this was the man that cut \"The French Connection\", after all), Ralf Bode's widescreen cinematography, and Pino Donaggio's haunting music.<br><br>The actors each get an impressive showcase; both Dickinson and Allen look amazing to boot. Included in the cast are Dennis Franz as the investigating detective, David Margulies as the psychiatrist who explains everything for us in the end in case we didn't already get it, William Finley who does some uncredited voice work, and Brandon Maggart in a brief bit as a john.<br><br>Overall, the film has a definite ability to get under one's skin. It's often genuinely spooky and could easily shock more sensitive viewers due to the level of sexual frankness on display. While subtlety may be in short supply, it's hard to deny the ability of \"Dressed to Kill\" to manipulate us into a state of excitement and expectation.<br><br>Eight out of 10.","user":"Hey_Sweden","rank":[19,23]}]