[{"title":"The Lost of the Innocence","rating":8,"date":"13 April 2008","review":"While waiting for the night rehearsal of the ballet Swan Lake, the lonely twenty-eight year-old ballerina Marie (Maj-Britt Nilsson) receives a diary through the mail. She travels by ferry to an island nearby Stockholm, where she recalls her first love Henrik (Birger Malmsten). Thirteen years ago, while traveling to spend her summer vacation with her aunt Elisabeth (Renée Björling) and her uncle Erland (Georg Funkquist), Marie meets Henrik in the ferry and sooner they fall in love for each other. They spend summer vacation together when a tragedy separates them and Marie builds a wall affecting her sentimental life.<br><br>\"Sommarlek\" is a simple little film of the great director Ingmar Bergman in the beginning of his successful career. The plot discloses through flashbacks a tragic and timeless love story affecting the life of the lead character that builds a wall to protect her sentiments and loses her innocence with her corrupt uncle. The cinematography, landscapes, sceneries and camera work are awesome, using magnificent locations and unusual angles to shot the movie. Maj-Britt Nilsson and Birger Malmsten have great performances in this beautiful and melancholic film. My vote is eight.<br><br>Title (Brazil): \"Juventude\" (\"Youth\")","user":"claudio_carvalho","rank":[27,30]},{"title":"The first masterpiece of the great Swedish master","rating":10,"date":"8 January 2015","review":"On the face of it, \"Summer Interlude\" is a fairly straightforward narrative; a ballerina (Marie, masterfully played by Maj-Britt Nilsson) in her late 20s (so in the ballet world, nearing the end of her career) seems detached from the world. She lives with a fairly stolid and boring tabloid journalist (David, in a wonderfully understated performance from Alf Kjellin), but doesn't seem terribly invested in their relationship. On the day of the dress rehearsal before opening night, a package arrives containing a journal - she opens the journal, and suddenly she feels emotion again - as if part of an interior wall is starting to crack. She takes a ferry out to an island where she spent her childhood summers, and flashes back to a summer romance that occurred there in her teenage years - and thus a complex, beautiful, and tragic story begins.<br><br>This is considered by most - including the Swedish master himself - to be Bergman's first mature film as a director, and with good reason. His previous offerings, while showing glimpses of the promises he would deliver on later in his career, were hampered by his limp, flawed male protagonists. This is the first film in which he explores the female as protagonist, a trope which would continue through most of his career, and it's clear that he has a much better grasp on the female psyche than on the male - with one notable exception (\"The Seventh Seal\"), his male protagonists often come off as variants of the director himself. Marie is at once strong, uninhibited, and vulnerable as a young woman, and Nilsson plays this role sublimely. As a mature ballerina, she has the appearance of strength that comes from a deadening of the emotions, rather inhibited, and invulnerable - a woman behind a wall she was forced or persuaded to build around herself. Nilsson also takes on this role masterfully, showing the versatility and virtuosity of an actress whose career peaked far too early.<br><br>The male lead, and Marie's love interest, is Birger Malmsten as Henrik - also wonderfully played as (by this point \"yet another\") incarnation of young Bergman himself. But unlike the male leads of previous films, Henrik is played with such an earnest innocence and naiveté that we can't help but buy into this wonderful performance. This isn't the director subtly displaying a sense of self-loathing, but rather, baring his soul through his marvelous script and direction. The ancillary roles are all excellent, as can be expected from actors working under Bergman. Stig Olin is particularly fantastic as the master of the ballet company. Kjellin's \"regular guy\" is believable in both his distance and his frustration, and lascivious \"Uncle\" Erland (Georg Funkquist) is delightfully seedy and erudite. Gunnar Olsson - the obligatory Bergman priest - is a very minor character, but fits perfectly into the few scenes he appears in. The rest of the supporting cast is fantastic.<br><br>As one would expect from a Bergman film - especially an early collaboration with his first significant cinematographer, Gunnar Fischer, and frequent editor Oscar Rosander - the visuals are stunning. I won't get over-technical here, but a wonderful mix of slow-fades, natural summer lighting, and exceptional composition make this a visual gem. Working on-location - a rarity for Bergman at this point in his career - he masterfully captures the feel of a short (6-8 week) Swedish summer, from the cuckoo that officially announces the start of summer to the owl that signals its approaching end. The lighting is masterfully achieved; contrast the scene when Marie first bumps into Henrik on the island to that where she walks down the hospital corridor. Every scene - including the outdoor ones, which are far more difficult - are perfectly focused and use exactly the right perspective.<br><br>Thematically, \"Summer Interlude\" is almost a crystal ball we can stare into to see the marvelous things the director would do in the future. Love, and its reverse. Life, and its reverse. The questioning of god's existence, relevance, and goodness. This is one of the first Bergman films to significantly use the mirror as a thematic element, in two back-to-back scenes, near the end of the film - this theme would be repeated in many future films, from the shattered mirror in \"The Magician\" to the dual mirrors in \"Cries and Whispers\", this would be a leitmotif that Bergman would employ time and time again. There is a chess scene in \"Summer Interlude\" that would directly evoke that of \"The Seventh Seal\" had the former not been shot 5 years before the latter. The distance between Marie and David tangibly feels like the silence between the sisters in \"The Silence\".<br><br>The overall TL;DR synopsis: This is a beautifully shot, wonderfully acted portrayal of young love that evokes Bergman's recurring themes of love, loss, the distance that necessarily exists between people, the silence of god, self-reflection, and the existentialist notion that we might as well move forward because otherwise, all we do is wait for Godot. The first masterpiece of a director I consider second only to Tarkovsky, and easily in my top 10 of his films - which is saying a lot. A solid 10/10.","user":"ian-ference","rank":[11,12]},{"title":"The first stirrings of an outstanding talent","rating":22,"date":"22 May 2003","review":"Among outstanding film directors there are those who crash in with debut features that show something of the full extent of their talent (Satyajit Ray with \"Pather Panchali\", Neil Jordan with \"Angel\" and of course Orson Welles with \"Citizen Kane\") and those like Ingmar Bergman who creep into the scene with films that are little less than mediocre, but who develop slowly, almost unobtrusively, giving only occasional hints of the glories to come. Bergman first came to notice as the proficient scriptwriter for Alf Sjoberg's \"Hets\", a 1944 shocker with echos of \"The Blue Angel\". Sjoberg's direction is impressive with much use of expressionist shadows and angles. The strange thing about Bergman's directional debut, \"Kris\", two years later is what little he appeared to have absorbed from his mentor. \"Kris\" is a very two dimensional work that could have been made by almost anyone. This was followed by several similar apprentice works which again give very little indication of what was to come. I would date the emergence of the original Bergman voice from the appearance of \"Summer Interlude\" in 1951. Although on the surface this appears to be a very conventional tale of an idyllic romance cut short by a tragic twist of fate, the sort of youth/love/death cocktail that was the mainstay of so much Hollywood drama (\"Kings Row\", \"Love Story\" and \"Dead Poets Society\"), the treatment is often very personal in a way that we can almost feel an innate artist struggling to express something beyond the superficial. It opens with a visually stunning series of still-life shots of the sort that Ozu always inserted between each short dramatic scene. We immediately feel this is a film that is demanding to be taken seriously. When the ballerina heroine takes a boat to the archipelago where thirteen years before she met the young man who was to become the love of her life, memory is unleashed and we relive in flashbacks her past happiness. Sometimes Bergman is in complete control of his material as when the ballerina leaves the boat and uneasy memories seem reflected in the sound of the wind and there is a silent encounter with a mysterious elderly woman whose path almost touches hers - a device he was to use to even more chilling effect years later when Liv Ullmann passes an elderly lady in the corridor to an apartment flat in \"Face to Face\". In other places his command is less certain and borders on cliché - when the doomed young man speaks of his premonition of something dark, and indeed the shot of a black cloud a moment after the accident that is to prove fatal. Bergman also makes the mistake of sometimes cluttering the narrative with supporting characters which add very little to the forward flow - the rather tiresome behind the scenes workers at the theatre. Although the film is a romantic tragedy it differs from the works of his central period in the way it comes to terms with life's misfortunes. The ballerina learns from her memories that her life has a continuation, that it is still possible to forge new relationships. Bergman was to regain something of this confident belief in the worthwhile qualities of life in later works like \"Cries and Whispers\" and \"Fanny and Alexander\" but not until he had become resigned to rather than angered by God's silence. It is perhaps significant that in \"Summer Interlude\", where he had not quite sorted out his responses to life or the medium in which he was working, the most powerful scene of all is where the ballerina rails at God's silence after her lover has been taken from her and craves for the opportunity to spit at God should he appear. There is not a single scene that expresses anything like this that I can recall in Hollywood drama. It indicates more clearly than anything else in Bergman's output up to this point the path he was about to take in expressing his dark vision of the world, one in which the conventions of commercial cinema were to have no place.","user":"jandesimpson","rank":[14,18]}]