[{"title":"A musical curiosity","rating":20,"date":"20 November 2008","review":"\"My Gal Sal\" is not an unpleasant musical, but it gets a more lavish treatment than it deserves. It's a typically fictionalized musical biopic, with Victor Mature playing Paul Dresser, a popular Midwestern songwriter of the \"Gay 90s.\" (For younger readers, that's what the 1890s were called, though the description had to do with high spirits, not sexuality.) Rita Hayworth is Dresser's love interest and the title character. Several of the songs in the movie were not even the work of Dresser, though the title song is. As the movie notes at the beginning, Dresser, born Dreiser, was the older brother of famed novelist Theodore Dreiser, author of that grim classic \"An American Tragedy.\" The screenplay is supposedly based on Dreiser's reflective essay \"My Brother Paul.\" But if it were, this film would be a bit of a drag: Paul Dresser's fame was fairly brief and he died young, and Theodore Dreiser never wrote anything light. Hollywood was wise enough to make up some harmless stuff, pick a beautiful leading lady and play it all for fun.","user":"gerdeen-1","rank":[13,13]},{"title":"Nostalgic gay '90s period musical...standard but fun...","rating":17,"date":"17 October 2004","review":"RITA HAYWORTH and VICTOR MATURE make a pleasant co-starring team, although it's hate at first sight, proof positive that true love never does run smooth...at least not in these sort of backstage musicals where the paper-thin plot depends upon the boy-loses-girl-until-final-reel contrivances.<br><br>Rita has a temper to match her red hair and when she tears up all of Mature's clothes, he does the same to her. And so it goes. They fuss and feud all over the screen until the last moment--but it's all done with such style and charm that you can't resist it.<br><br>Alice Faye was supposed to do Rita's role but she was expecting a baby so Rita signed on. As usual, someone else dubs her singing but her dancing is a sheer delight and the technicolor costumes are showcased in all of the musical numbers.<br><br>Given short shrift in the cast is CAROLE LANDIS, with almost nothing to do after a bright start, and handsome JOHN SUTTON has a thankless role as Rita's would be suitor. Too bad Fox could never find a worthy starring role for him.<br><br>Fun to watch (if you like musicals) and easy to take.","user":"Doylenf","rank":[27,30]},{"title":"Routine Musical Ennobled by Hayworth, Mature & Fox's Shimmering Technicolor!","rating":11,"date":"11 October 2003","review":"The plot is silly &amp; preposterous, as is the case most often when it comes to these eye candy extravaganzas, but it is kept alive by the irrepressible charm of Rita Hayworth &amp; Victor Mature, not to mention Fox's customary glowing Technicolor (there are some moments that are not only gorgeous to look at, but also sublimely awe-inspiring and evocative of its Gay 90s milieu). <br><br>\"My Gal Sal\" is basically a nostalgic period musical, about 1890s songwriter Paul Dreiser (Mature) who leaves his country town in Indiana to find a big success on Broadway in New York. He meets and falls in love with a musical performer, a gal named Sally Elliott (Hayworth). They start hating each other at first but soon grow into one another. Their contrived romance is kept afloat by various passable numbers, including the title tune (written by Paul), \"On the Big White Way,\" \"The Convict and the Bird\", \"Liza Jane\", and \"Mr Volunteer\".<br><br>Not a classic, but it passes the time. Try to watch it along with Hayworth's other musical of 1942, the gloriously carefree \"You Were Never Lovelier\" with Fred Astaire.","user":"Kalaman","rank":[16,17]}]