[{"title":"Brilliant oddball comedy","rating":10,"date":"4 July 2009","review":"There are really few directors that are as consistent as the Coen brothers. Their strange sense of humour just works in every movie they make, and it's extremely fun and addictive. With that said, it's difficult to decide which of their movies is the best, but this one is a worthy contender. It's incredibly outrageous, wild and crazy, but at the same time it's close and heart-warming. It has a very surreal look, yet the emotional scenes still look very genuine, which is quite an achievement. The characters are also vintage Coen, they're all offbeat and weird, but that just raises more sympathy for them. It also helps that they all express themselves through some razor-sharp dialogues. I could barely make out the lines because I was too busy laughing at the previous lines, you wonder where these keep coming from. This movie just isn't like anything I've ever seen. It's astoundingly funny in all its weirdness.","user":"Sandcooler","rank":[41,55]},{"title":"Okay, then...","rating":10,"date":"6 September 2000","review":"This is one of those surreal experiences that make you wonder whether or not you laughed at what you saw or what you THOUGHT you had seen.  Of course, being concocted by Joel and Ethan Coen makes it even more surreal.<br><br>As \"repeat offender\" H. I. McDonnough, Nicolas Cage creates yet another strange, offbeat character that gets under your skin for days after.  After returning to the same prison time after time under the eye of Officer Ed (Holly Hunter), he goes straight and they get married, planning to have a big family.  It is only then, he finds that Ed is a \"barren, rocky place\". <br><br>\nSo, what's a couple to do?<br><br>This is where the \"Arizona\" of the title comes in, when they steal one of the quintuplets of the Arizona family.  Naturally, the father (Wilson) goes all out to find the culprits, even enlisting the aid of a \"tracker\" (Cobb), who is kind of an existential bounty hunter with a good nose.<br><br>From this deceptively simple story line, the Coens create a dreamscape that is mesmerizing, serpentine, loaded with all matter of visual input, deft one-liners and characters that are so off-the-wall that it's hard to forget them and the situations they get into.<br><br>Coen Brother stalwart John Goodman plays yet another flaky loon - this time an escaped con - who, along with his little brother (Forsythe) complain that the prison \"had no more to offer them\".<br><br>Of course, the chases, fight scenes and getaway scenes are elaborate, well-choreographed and exciting, as well as funny.  How could they not be? This whole movie is one huge snowball rolling down the side of a mountain, growing larger and rolling faster as it reaches the end of its trip.<br><br>But to try and explain this movie is an exercise in futility; you'd be better off explaining Kierkegaard to a room full of second-graders.  You just have to see it yourself.  If your sense of humor is a bit on the dry side and you love fancy camera work and Fellini-esque characters, it's your kind of movie.<br><br>Trust me.<br><br>Ten stars and a complimentary pack of Huggies for \"Raising Arizona\", the best Dadaist head trip film with kidnapped babies, exploding bunnies and Frances McDormand in the desert you'll ever find...that has a fight in a trailer.","user":"Mister-6","rank":[96,145]},{"title":"Hysterical, each time I see it","rating":10,"date":"24 April 2006","review":"A lot of things come together to make this film highly enjoyable; acting, writing, music, pace, directing... It's over-the-top fun. It took me several viewings before it sunk in that the film's base story is about child kidnapping; which is an extraordinarily serious crime. But this film makes you enjoy every minute so it's easy to forget the seriousness of the base story.<br><br>While I'm not a fan of Nicholas Cage, I thought this was a perfect vehicle for him. Holly Hunter is always excellent, IMHO. Their attention to detail in crafting their characters was on point and thorough.<br><br>\"Well alright then.\" :)","user":"ddmcc","rank":[56,89]}]