[{"title":"I hate snakes, but I love this film!","rating":9,"date":"12 January 2009","review":"A doctor who specializes in snakes develops a way to turn a human being into a king cobra! Will he use this on the college student who has just became his new assistant? <br><br>Sssssss (love that campy title, that's seven S's folks) is an above-average man-becomes-creature horror film. The film is very well made and despite its seemingly cheesy premise actually creates itself an effectively serious tone. The story is intriguing, thanks largely to the likable and well-rounded characters, and builds to some terrifically chilling scenes as well as a nice show-down finale. The makeup effects are solidly created and genuinely creepy. The lovely music score by Patrick Williams is also a highlight.<br><br>The cast is definitely one of the films best features. Veteran actor Strother Martin is excellent as he balances his performance between fatherly teacher and sinister scientist. Young Dirk Benedict is charming as Martin's young assistant and attractive Heather Menzies delivers a sincere performance as Martin's daughter, and Benedict's love interest. Also Reb Brown makes for a good bully.<br><br>So, you don't have to like snakes to enjoy this intelligent old-fashioned horror tale. It's definitely one of the best of its kind and well worth catching for fans of old school B horror.<br><br>*** 1/2 out of ****","user":"Nightman85","rank":[21,23]},{"title":"Still enjoyable after all these years.","rating":7,"date":"23 June 2006","review":"I have fond memories of watching this film as a kid. So often those movies you enjoyed as a kid turn out to be trash when you watch them as an adult, but this was a rare case of a movie that managed to hold up.<br><br>Sure it has it's faults, but nothing that can't be over looked. The plot is a bit silly, and the ending more so, but the way the movie is played you ignore the rampant over acting and outside of reality plot. <br><br>Plus, the film doesn't seem aged. So many films from the Seventies look so out of place looking at them in modern times, but this film managed to avoid all of the trappings that put it out of time. It holds up amazingly well for a thirty plus year old movie. <br><br>If you've seen this once and remember it fondly, i recommend a fresh look through grown up eyes.","user":"Bloody-Thumb","rank":[23,26]},{"title":"Clever Title, but it hurt Box Office","rating":16,"date":"16 June 2004","review":"Originally this was titled SSSSNAKE, but someone in Universal's publicity department thought SSSSSSS was clever. So the name was changed, and the movie did poorly in the theaters. In 1976, NBC acquired the rights to this film, and it became a sort of cult movie, growing stronger as VHS in 1997 and DVD in 2004 added fuel to the fire.<br><br>This is basically your standard mad-doctor film. Strother Martin plays Dr Stoner, who believes man is doomed as a species. He wants to speed up man's evolution, and since the King Cobra is the deadliest creature on the planet, he wants man to evolve into the King. So he finds a college student to act as his assistant, and injects him with cobra venom (the student thinks the serum is an inoculation against snake bites).<br><br>SPOILER ALERT ***** SPOILER ALERT **** SPOLIER ALERT ****<br><br>For those of you you have seen the film, you know that the film ends on a freeze frame of Heather Menzies screaming as the David/Snake is killed by the mongoose. I've always thought this was a weak ending! If this movie is ever remade (as everything is these days), I hope the producers would consider this ending:<br><br>Heather grabs the policeman's gun and shoots the mongoose. She saves David/Snake. Now that her father's dead, she runs the show on Sundays. She begins the show by saying: \"The King Cobra is the deadliest creature on the planet. But I have a very special Cobra here\" David slithers out. Heather pets David/Snake on the head. The crowd gasps in surprise. \"He is a very special friend of mine\".","user":"g_man07302","rank":[10,11]}]