[{"title":"Killer Workout","rating":6,"date":"2 April 2012","review":"There was a fitness craze in the 80s that probably all started with Olivia Newton John's \"Let's get Physical\" video suddenly working out became a cultural thing. People loved to get fit, not necessarily over concern of their heath but more because it was the \"cool\" thing to do. You see it in movies, TV, fashion trends and let's not forget the countless celebrity workout tapes with hosts from Fabio to Linnea Quigley. Another thing popular in the 80s was the slasher movie, and although by 1987 they were starting to die out it was still inevitable that a slasher movie be released that capitalized on the fitness craze sweeping the nation.<br><br>Killer Workout AKA Aerobicide is such a movie and to my knowledge, it still is the only fitness themed slasher movie in existence.<br><br>It starts with a semi-shocking mishap in a tanning booth. Then we are immediately thrown into the middle of a workout routine where about 30 gorgeous babes in spandex are getting fit and showing off their tight bodies. This is, essentially, what Killer Workout is about following a series of murders that take place in this gym (Rhonda's Gym) by a safety pin wielding mad person, then getting to see a sexy workout montage set to corny synth music over and over.<br><br>This is not a bad thing if you are into cheesy b-grade movies like myself. In fact, this is one of the more delightful bad movies I have ever seen. The movie moves at fast pace which keeps your attention. Acting is pretty bad from all parties, but some performances like Marcia Karr's are hilariously over-the-top. Plus, even if the acting is bad, chances are they are still beautiful to look at (you might even see some gratuitous nudity). The plot is pretty uninspired but it works and there are even a few surprising twists towards the end.<br><br>All in all, the movie is bad but it has a lot of charm. It offers plenty of laughs and if that is not enough to convince you to see it, the abundance of sexy people working out in spandex might. The movie is also a time capsule that lets us see just how ridiculous the 80s fitness craze got.<br><br>In the end, Killer Workout comes highly recommended for the bad movie enthusiast, others might want to stay away.","user":"sbaldwin999","rank":[12,13]},{"title":"One of the greatest movies of all time!","rating":9,"date":"28 February 2001","review":"Everyone should see Aerobicide (as it is known in England), everything about it is bad therefore, it's good! It's better than good; the gratuitous nudity, the gratuitous close ups of women in lycra, the dumb death scenes, shockingly bad production and acting values, it's a work of suppressed genius! One of the all time great so bad they're good movies every passing minute is a work of art. Top stuff.","user":"josh nolan","rank":[23,31]},{"title":"GREAT if you like spandex and sweaty babes, not the greatest if you like horror (or good movies)","rating":5,"date":"24 December 2012","review":"\"Killer Workout\" is one of those movies where I just can't figure out if it was made as a spoof or not. It's just that bizarre.<br><br>Set in a fitness club, there are multiple EXTENDED scenes of insanely sexy girls in spandex working out and practically revealing it all. The cameraman should be awarded for somehow immediately zooming in on the bustiest girl in the room in every one of these softcore aerobic fetish scenes. These are basically the highlight of the film, and you'd probably be better off watching exercise regiment infomercials than this. HOWEVER, I can not say I don't recommend it, because I absolutely do.<br><br>The body count is extremely high, though nothing is particularly gory at all. The killer uses a giant safety pin for some unexplained reason to kill the victims, having to stab each of them in the neck like ten times. Why none of the poor girls didn't try to simply use their arm to get poked instead of their jugular vein, I'll never know. I'll also never know why there are also multiple martial arts showdowns lasting an obscene amount of time between ripped bodybuilders, but I digress. The last twenty minutes of this one are an absolute glorious mess, with one of the most ridiculous plot elements in slasher history, and an incredibly long and dull chase scene.<br><br>While it may sound like I just tore this movie spandex limb from spandex limb, it is a must see on sheer absurdity value alone.","user":"warsystem04","rank":[8,9]}]