[{"title":"A Perfect Film Comedy!","rating":18,"date":"18 October 2003","review":"Have you ever watched a film and wished it wouldn't end? Where you loved all the characters, adored each scene, and laughed at every joke, even after you'd seen the film so many times that you could quote the dialog? MY FAVORITE YEAR is that kind of movie!<br><br>Directed with gusto by Richard Benjamin, the film is both a loving tribute to Sid Caesar's 'Your Show of Show', and the remarkable talents that brought it together each week, and a sincere homage to Errol Flynn, whose antics and larger-than-life persona, in the waning years of his life, still had a kind of magic that could enthrall a shy young fan, or make a woman swoon.<br><br>Three dynamic performances dominate the film. Mark Linn-Baker, as Benjy Stone, based on the young Mel Brooks, is a shy kid who hides his insecurities behind a rapid-fire wit. The dazzling young star in a staff of comedy 'pros', Stone suffers from an unrequited love from fellow staffer K. C. Downing (Jessica Harper), and has an inspiration, inviting legendary swashbuckler Alan Swann (Peter O'Toole) to appear on the show. As King Kaiser, star of the hit series, Joseph Bologna captures much of Sid Caesar's legendary physical 'presence' and irreverence to authority. When threatened by gangsters over a 'too close to home' series of parodies about crime boss Karl Rojeck (portrayed with brute menace by veteran actor Cameron Mitchell), Kaiser 'thumbs his nose' at them, mimicking the gangster mercilessly. \"I'll KEEP doing it!\" he taunts. \"Why? Because it's FUNNY!\"<br><br>Then there is Peter O'Toole's 'Alan Swann'. With his own career a roller coaster ride of alcoholism, resulting in the near destruction of his health, no actor could have 'channeled' Errol Flynn better. Just as Flynn, by the 1950s, was a nearly burned-out roué, his classic good looks long gone, O'Toole's matinee-idol appearance, after years of self-abuse, had aged into a gaunt mask, making Benji Stone's film montage of 'classic' clips more poignant. What Flynn still had, in abundance, were charm and a ready wit, and O'Toole's 'Swann' is so enchanting a personality that you can't help but love him, and root for him to succeed.<br><br>From the opening nostalgic strains of Nat King Cole's rendition of 'Stardust', through Benjy's futile effort to attempt to keep Swann sober (Red Skelton loved to tell how he kept Flynn sober on his program...he emptied all of the actor's bottles of vodka, replacing it with water...and Flynn couldn't tell the difference!), to a riotous Swann dinner with Benjy's family, to the near-disastrous broadcast, with Swann developing stage fright, and Kaiser brawling with mob enforcers...MY FAVORITE YEAR has one glorious scene after another, each unforgettable!<br><br>One of the AFI's '100 Greatest Film Comedies', MY FAVORITE YEAR will bring a tear to your eye, even as you laugh. It was a time of legends, and heroes who would live up to boyhood dreams.<br><br>Film comedy doesn't get any better than this!","user":"cariart","rank":[79,85]},{"title":"O'Toole at his best","rating":9,"date":"11 April 2004","review":"Peter O'Toole is at the height of his comic powers in this wonderful homage to Errol Flynn, the 50's, and early live TV. Alan Swann (O'Toole) is a swashbuckling, aging, alcoholic actor billed to appear on television - which is fine until he realises that the thing is going to be broadcast LIVE, which is unthinkable. This prompts severe stage fright and heavy drinking, as he is cojoled with endless patience by his adoring young minder, Benjy Stone, (Mark Linn-Baker).<br><br>The film is funny, brilliant, sad, stirring, inspiring, exciting - unique. The cast is perfect from top to bottom A tour de force by O'Toole. Watch it. 'My Favorite Year' should become one of Your Favorite Films. 9 out of 10.","user":"Lupercali","rank":[55,61]},{"title":"Plastered Makes Perfect","rating":8,"date":"15 May 2003","review":"Really fun movie, with a tone and style all its own. It has the same zippy sitcom character of the set which is its main stage, and the comedic acting is often over the top. Yet it drives through some very subtle and deep ideas about what makes a celebrity tick, the price culture extracts from its most ballyhooed figures, and the scars divorce and drink can leave on those with the smoothest of surfaces.<br><br>The secret to this film's success is O'Toole, who gives up some of his most intimate and affecting moments on screen and intersperses them with ass-over-elbow feats of physical schtick that would make a Ritz Brother proud. What a shock we never saw much else from him after this tour de force. Richard Benjamin did go on to direct other films like \"Shoot The Moon,\" but he never managed to get it all absolutely right the way he did here. It's so note-perfect, from the opening shot of midtown Manhattan 1954 with the cars, outfits, and bustle all coming together beneath the strains of Les Paul and Mary Ford's \"How High The Moon\" into a tight closeup of Benjy Stone carrying a cardboard cutout of his hero, Alan Swann, through an uncaring, jostling crowd.<br><br>I almost wish they could have made a sitcom featuring the King Kaiser crew, with of course Joseph Balogna, Bill Macy, Adolph Green and the rest all reprising their roles in a kind of \"Remember WENN\"-style show. O, what roads left untravelled. Balogna is so good, managing to carry off his Sid Caesar-inspired role with the same kind of aplomb that made the original Caesar early television's most dynamic and celebrated comedy performer. There's a nice scene early on where Stone sticks up for a prone Swann by telling Kaiser he can't fire the swashbuckler. \"You're a big star now, and I'm sure you always will be,\" Benjy says. \"But suppose, and I know it will never happen, you end up like this. I hope nobody does to you what you're doing to him.\" Of course Caesar did end up like this, strung out on substance-use problems that derailed his post-50s career, and knowing that gives the scene, both funny and tension-filled, a certain undertone of poignancy for those in the know.<br><br>Mark Linn-Baker could have taken it down a notch or two, and the Brooklyn idyll was to die for, and not in a good way. I'd like to know how the hell I'm supposed to lock lips with the woman of my dreams by stuffing my face with Chinese food and showing her old movies, but I don't think my repeated viewings have helped my love life much. It has given me many hours of pleasure though. This is one film that keeps on giving. With lines like \"Plastered? So are some of the finest erections in Europe\" \"These must be his drinking socks\" and \"Tongue...Death,\" how can it do anything less?","user":"slokes","rank":[30,33]}]