[{"title":"Late silent film shot in India is a fascinating oddity.","rating":9,"date":"9 June 2003","review":"Not a great movie, with none of the flamboyant technique characteristic of the last great silents - THE WIND, ASPHALT, SUNRISE - but the mix of German expats., British scripting and Indian subject matter filmed on location, remains an intriguing novelty.<br><br> The plot, with the scheming highborn lady (`Father, to become Princess and later empress of India I would dare anything') introducing an old flame into the women's quarter to discredit the heir's true love, is simple stuff which seems to belong to a period of film making from years earlier. Playing is at least restrained.<br><br> The film's major appeal is in placing it's action against attractive genuine Indian buildings and the occasional vista. There's a bit of suspense from the likelihood that a real elephant will stomp the admirer. The hint of exotic sadism which runs through these European visions of  The Mysterious East - `Kismet' or films like DAS INDISCHE GRABMAL and EMERALD OF THE EAST - is clear, as with demanding that the model maker's already blind eyes be put out.<br><br> The ending with the Empress' two devoted admirers sitting in front of the Taj Mahal is telling.<br><br> This one survives in a particularly sharp, well graduated copy - one of the best circulating, even if it isn't tinted. A pity the Sydney Film Festival, after bringing it half way round the planet, ran it too fast but the Tunji Beier - Linsley Pollak score they put with it was excellent.","user":"Mozjoukine","rank":[5,5]},{"title":"The Story Of The Taj Mahal","rating":6,"date":"8 September 2019","review":"The movie begins with a young Indian princess on a caravan across the Persian desert. Raiders strike, and the girl is found and succored by a village potter. After she is grown into Seeta Devi, she is seized and sold to prince Charu Roy. Her adoptive brother Himanshu Rai follows and proclaims her a free woman, which does no good. Roy loves her but cannot make her his Empress because he can only marry a princess, which no one knows she is.<br><br>It's a story of how the Taj Mahal came to be built, and it's given a fairy-tale cast, with some striking visuals. It's directed by Franz Osten, a German who moved to India in 1924 to make movies there until 1939 Eventually he was seized by British authorities -- he had joined the Nazi party in 1936. He was released in 1940 and returned to Germany, where he died in 1956, just shy of his 80th birthday.","user":"boblipton","rank":[2,2]},{"title":"Courtly Love and intrigue..timeless!","rating":8,"date":"22 August 2018","review":"Free binge courtesy of IMDB &amp; loved it..more moved than I thought I would be and Anoushka Shanka really adds to the the film like all great film music.","user":"Jaszs","rank":[2,2]}]