[{"title":"Fun, Fun, Fun","rating":9,"date":"9 August 2001","review":"I'm not sure, but I bet that if one were to do research on the most shown film on cable/satellite,REMO WILLIAMS would be in the top three.  It seems like every month its being shown on Cinemax or The Movie Channel.  But that's okay, as long as they keep showing it, I'll keep watching it.<br><br>I've read complaints about the movie's bad guy not being bad enough and the story not being big enough and to that, I say hogwash.  Not every movie has to have the hero saving mankind from global destruction and Remo's mission may not be global, but its entertaining fun nonetheless.  This is a movie best enjoyed on a slow Saturday afternoon when you don't feel like going out and just want to zone out for a few..<br><br>Put this one in your VCR and enjoy the absolutely wonderful score by Craig Safan (this movie's got one the best theme songs I've ever heard)The interplay between Fred Ward and Joel Grey (their dialog is side-splittingly funny at times, especially Grey's one-liners) and a pre-Star Trek: Voyager Kate Mulgrew.","user":"DerrickFerguson1","rank":[46,49]},{"title":"Very entertaining, yet often misunderstood.","rating":8,"date":"10 July 2003","review":"This movie inspires different reactions from people, depending on the expectations they bring to their first viewing.  It's a semi-serious, semi-spoof Action/Comedy/Crime/Thriller/Martial Arts movie that doesn't fit neatly into any category.  It is tremendously entertaining, as long as you aren't expecting something totally serious or totally comical.  This movie is often misunderstood, and that, coupled with its somewhat-lower-than-average-budget look, may explain why there was no sequel to the movie, which was subtitled in the US \"The Adventure Begins.\"  It wasn't quite big-budget enough to satisfy people wanting to see a competitor for James Bond, and it wasn't quite like any other movie enough for people to \"get it\" right off.  Taken at face value as an action movie, therefore, Remo Williams isn't all that noteworthy.  However, viewed as an entertaining mixture of action and fun, the movie delivers quite well.<br><br>Fred Ward does a fine job as Remo, especially in his scenes with Chiun, his Shinanju master played fantastically by Joel Grey.  Some have argued that Ward was too old for the role, which would be debatable even if this were a straight-out action movie; given its true nature, Ward was an excellent choice, and the dynamic between him and Grey makes for some of the most entertaining sequences in the movie.<br><br>Joel Grey's Asian \"sensei\" character stereotype can be forgiven in the context of the semi-spoof, tongue-in-cheek nature of the movie.  Chiun's humor shines through his sarcastic commentary about America and Remo; the success of the humor relies on the Korean Shinanju master's strength and ability.  Chiun is the most powerful, competent, intelligent, and witty character in the movie.  There is also the pleasant story line of Chiun passing on to Remo the legacy of his Shinanju wisdom and knowledge... and wit.<br><br>People have also criticized Kate Mulgrew (Star Trek: Voyager) for her performance of Major Rayner Fleming.  Overall, her performance is very good, and appropriate for the character, especially before her character meets Remo at Mount Promise.  I am still somewhat disappointed, however, to see Major Fleming change from a competent military career-woman into a bewildered character smitten by Remo and Chiun and carried along in their wake.  In the role of the army major, Fleming is competent, witty, and believable: an appropriate portrayal of a mid-1980's woman military officer. The directors could have let the character carry that competence through to the end of the movie.<br><br>The movie does have some great action sequences, especially the chase around the scaffolding surrounding the Statue of Liberty (remember when they were remodeling it, back in the 80's?), and it is very funny in many places. (See the \"memorable quotes\" page.)  If you watch the movie expecting to have fun and to be entertained, if you suspend your disbelief just a little and don't take it too seriously, you will really enjoy it.  It has just enough action, just enough \"buddy movie\" dynamic, just enough tongue-in-cheek humor, just enough spoof, just enough comic-book type fantasy elements, and just enough enigmatic and amusing martial arts to make it terrifically entertaining.  Watch it with your friends on a lazy Saturday afternoon, have some laughs, and be entertained.  You'll be glad you did.","user":"antigraviton","rank":[51,55]},{"title":"This movie has it all","rating":10,"date":"8 March 2001","review":"This is a classic 80's action flick, with a twist.  The two main characters are a kick to watch as the hardboiled New York cop is trained in the ways of the wise master of shinanju.  The action scenes are awesome, and there are plenty of laughs as we watch our hero Remo struggle to overcome his fears and vices to become a master of shinanju.  Fred Ward as Remo and Joel Grey as Chun really capitalize on the comedic opportunities here.  The soundtrack is top-notch, perfectly blending a patriotic hero theme with graceful oriental influences.  I highly recommend you take this one home and check it out - it's a lot of fun.","user":"martinr","rank":[55,63]}]