[{"title":"Fainted?.......Mister, I thought you were dead!!","rating":9,"date":"13 December 2003","review":"Cinema, once in a while, can provide frustrations of the highest order. You watch with interest, only to have your train of thought switched elsewhere by a movie that steers you off course. You are perplexed, through missing something, but this is even more annoying when you don't quite know what that something is.<br><br>This is precisely the criticism leveled at The Man Who Fell To Earth, which carries the hallmark of a controversial directorial style. Nicolas Roeg directs this science fiction/drama/love story with one eye on the main event and another on the various sub plots that weave their way in and out of the principal tale. By creating passages of snipped time that do not knit together as logical flashbacks, there is a somewhat disjointed narrative which is seen as a personal indulgence. Many were puzzled enough to claim that the whole project was flawed and that, chronologically, it simply didnt \"work\". That is a harsh judgment; the film is highly stylized, but this does not detract from it's undoubted quality. You have to 'want' to understand it and invest a bit of patience. See it twice (I had to) and it will sink in, or read the IMDB reviews to get a taste before you digest it wholeheartedly.<br><br>Thomas Jerome Newton (David Bowie) lands, as surely all self respecting aliens would choose to do, in New Mexico. How come he is wearing 'normal' clothes? Where did he get the precious metal rings that he wastes no time in trading so eagerly? Why is he carrying an Englishman's passport? These are the kind of questions that confront you at the outset, causing many to bark in dismay. To get the maximum benefit from the film, you simply have to take these unexplained occurrences - and also the rapid and disjointed passing of time - on board, because the whole is more significant and understandable than its component parts.<br><br>Newton arrives on Earth to suck on the capitalist system, recruiting a top patent's lawyer (Buck Henry - superb as Oliver Farnsworth) along the way to help quickly mould his business idea, World Enterprises, into an immense scientific and commercial colossus. He proceeds to convert the Earthman's physical cash into an enormous scientific solution, in the hope that it will reverse the desperate decline of his own, remote world - and save his family - light years away. A disillusioned college professor, (Rip Torn, magnificent as Nathan Brice) stale with the stench of academia and tired of bedding his female students joins Newton as a chief scientist. He is actually the closest to understanding the man, but he ultimately fails him. The mocked time lapses in this film are, in my view one of it's strengths. It enables us to see Mary Lou (Candy Clark) pass from young humble hotel maid to alcoholic old wretch, via live-in lover and 'Tommy' worshipper. Clark &amp; Bowie share a key scene where Newton decides to reveal his true self: Newton discards his human-eye contact lenses, strips away the false body hair and fingernails. Mary Lou goes hysterical with fear as the real Newton appears in all his extra-terrestrial glory and this is made all the more grotesque when he starts to exude a complete bodily slime during the ensuing love ritual.<br><br>A special mention should be made of Anthony Richmond's photography, particularly in the spectacular terrain of New Mexico. Indeed, the whole film is a technical masterpiece and the acting is also of the highest level.<br><br>Of course, the Man Who Fell To Earth is himself beaten at the outset. The Intelligence Services, jealous, as opposed to curious, of his corporate success, want this weirdo brought to order. They achieve this by hounding Farnsworth and infiltrating the company, finally spoiling everything.<br><br>Imaginative, vibrant, different, ambitious and memorable: class comes in original packaging. So, open it up....and immerse yourself in an adventure","user":"freemanist","rank":[98,108]},{"title":"Moody, Understated, Strange","rating":9,"date":"27 June 2005","review":"Of all the movies I saw as a teenager (I am now middle aged) this is the one that has remained with me the most, more so even than the highly acclaimed \"Deerhunter,\" which came out 2 years later in 1978. I have not seen it since 1980, so if my memory fails me, please excuse. This eerie, moody movie encapsulated for me -- an alienated kid, I'll grant you -- the perils of living in, and partaking of, the modern world. An alien falls to earth in search of water for his planet, and somehow loses his way, corrupted by materialism, sex, alcohol, the physical world.<br><br>I recall Candy Clark's cool, almost southern voice (just saw her in a cameo performance tonight, playing Christopher Walken's girlfriend in the 1986 \"At Close Range, another great) purring at Bowie after he has built a little house for her at the end of a dock, \"You're such a nice man,\" and there is something so unsettled about the cinematography -- cloudy and dark and too still -- in the scene that you know he is definitely NOT a nice man, but deeply troubled and unable to respond to human emotions. The other reviewers noted the somewhat disturbing sex scene towards the end of the movie, but for me, at least, that was not needed. I didn't need slime or removed eyeballs (although that is a great scene) to tell me the man is a freak who is human enough to lament his own inability to connect with these creatures from Earth. For the most part the movie was understated, unfolding in its own, detached time.","user":"judithwolf","rank":[71,84]},{"title":"Don't bother seeing this film unless it is the director's cut","rating":9,"date":"23 July 1999","review":"I first saw \"The Man Who Fell to Earth\" when it was first released, and found it to be a jumbled mess.  There were plot holes galore, and scenes that went nowhere or had no connection to anything.<br><br>A few years back, I saw the director's cut, and it was an entirely different film.  The plot holes were filled and all the scenes fit together perfectly. As bad as the original release version was, the director's cut is great and worth seeing.","user":"michaelf","rank":[67,82]}]