[{"title":"Vincent Dawn's messterpiece","rating":6,"date":"16 March 2011","review":"Ah, leave it to the directorial talent (or lack thereof) of Bruno Mattei to make me yearn for the Citizen Kane Reb Brown classics such as Space Mutiny or Yor the Hunter from the Future.<br><br>Think of this outing as a prolonged hike in the nature preserve. Reb is Murphy Black; the leader of commando group on a mission of...actually what WAS their mission(?) as it's evident that Reb himself wasn't even sure of. Heck, I don't even know if I'd let Reb lead me in a game of horseshoes let alone on a reconnaissance endeavor. No tears are shed on this journey as people are killed and you have no iota clue (or concern) about who they are or what purpose they serve except as bullet fodder. Thrill at the menacing Omega 1 (that reminds me to get multivitamins at GNC this week) as his state of the art pixelated kill-o-vision makes him...well, pretty lame. His 8 bit speech makes him sound like he contracted a form of Robot Tourettes. I can't be too angry with him as he helps to thin the herd thus providing a semblance of entertainment. Herr Mattei also had access to bio lab skeletons and you're bloody sure that he was going to use them!<br><br>All levity aside, many thanks to Smoke Manmuscle, I mean Reb for making this trial somewhat amusing. Whether it's his high shrilled helium-ated octaves of unforgettable lines such as 'Incoming, get out of here!' and 'Move out!' or his constant bickering with Mascher (less than Carl Weathers and more like Andy Richter's shady uncle), Murphy Black weathers the storm to the beat of a Casio laced soundtrack. Beware the true horror of Robowar: the cutoff shirt prone to exposing Rebbish midriff.<br><br>The horror...the horror....","user":"InzyWimzy","rank":[16,17]},{"title":"Another one of Mattei's xerox classics (two-for-one this time)!","rating":10,"date":"21 March 2011","review":"\"Reb Brown stars in this action-packed adventure story of fighting men pitted against an unseen enemy, a force more powerful than the fiercest weapons. Recruited by the CIA to rescue hostages held by guerrilla fighters in a Central American country, Brown and his men encounter an enemy unimaginably more deadly than any on Earth - because the Omega One is not of this Earth!\"<br><br>What you have just read (save the references to Reb and Omega One) is the VHS plot synopsis of the Arnold Schwarzenegger vehicle PREDATOR (1987) because that is exactly what this Bruno Mattei flick rips off! Why waste my time cooking up a synopsis, right? A virtual scene-for- scene, shot-for-shot remake of the big budget sci-fi epic, ROBOWAR is bad. So bad that it is amazing. There are some liberties taken with the \"source\" material though. Reb Brown's top secret unit is named B.A.M. (Bad Assed Mutherfuckers). When they assault the village, Brown throws a smaller knife into a mercenary and then quips, \"Hang around!\" as opposed to Arnold's \"Stick around.\" Oh yeah, and the group's native empath is named named Quang and of Filipino descent. Sadly, no \"What's got Quang so spooked?\" line. Mattei usually wouldn't settle for just one flick to rip off and throws us a curve ball by also copying 1987's other classic sci-fi flick, ROBOCOP. You see, Omega One turns out to be part man, part machine. Even funnier, the human chunks inside are Brown's old Nam buddy Woodrig. And, yes, Brown does say, \"Woodrig, it's you!\"","user":"udar55","rank":[9,9]},{"title":"Bruno Mattei does Predator, results are predictably awesome","rating":7,"date":"7 April 2012","review":"There was very little chance of this film not being badass. A combined rip-off of Predator and Robocop directed by hack trash grand wizard Bruno Mattei and starring veritable Colossus of kick-ass charisma Reb Brown in the Arnie role, along with Massimo Vanni looking like Chuck Norris and the always reliable Jim Gaines, and a script by husband and wife super-scribes Claudio Fragasso (Troll 2, Zombie 4: After Death)) and Rosella Drudi. Oh and our Claudio is also the guy in the robot suit, credited under his regular pseudonym of Clyde Anderson. Anybody reading this already knows whether this film is for them or not, people generally are either Mattei fans or have sh!tty taste. But for your sake dear reader I shall go on, lest you not be quite convinced. The pacing is the only drawback here, the film takes a little while to really get into the groove so during the first third there's mostly the dialogue to go on. Fortunately the dialogue is worthy of Mamet, my favorite line being probably \"You walk like a ruptured duck\" . Clearly a film that should be shown to screen writing classes as an example of how to get this sort of thing right. The action is pretty steady when it gets going though. Things tend to alternate between people and trees being shot up real good, and trees and huts being blown up real good, with occasional people being blown up real good for varieties sake. Oh and there is a bit of knife work, but I don't know that I'd describe it as real good. It's OK though.Basically if you like films full of people walking around in the jungle and shooting at trees with occasional explosions and a robot that speaks in comically mangled digital gibberish then this is a film for you. I like all of these things, so Robowar was definitely a film for me. It even musters up occasional pockets of genuine excitement and suspense in amongst the hilarity and repetition, with a climax that is more affecting than one might expect. There's no gore other than mangled corpses and a severed limb, and no sleaze which definitely hurts things, but as far as goofy action trash aimed at the undemanding goes this is definitely a winner. Not as good as the classic Strike Commando mind you, but in Mattei rip off terms this is pretty darned decent. Way better than Shocking Dark at any rate. So watch it folks!","user":"Bloodwank","rank":[11,12]}]