[{"title":"Great study of deadly obsession!","rating":8,"date":"22 September 2003","review":"\"Don't Go in the House\" is an obscure early 80's horror film that seems to be forgotten by many horror fans.The film is well-made and slickly directed by Joseph Ellison,a talented musician and a screenwriter.Donny Kohler is a tormented young man.His mother tortured him by holding his bare arms over a gas burning stove.He grows up to be a psycho who delights in burning young women with a flamethrower inside his steel paneled bedroom crematorium.The film is filled with truly sick atmosphere and there is one of the most sadistic burning killings ever captured on screen.The underlying theme of child abuse is also taboo-breaking.\"Don't Go in the House\" is often trashed by some politically correct people-still it beats most of the crap being put out today.Highly recommended.","user":"HumanoidOfFlesh","rank":[50,61]},{"title":"It achieves what it sets out to do","rating":7,"date":"26 June 2003","review":"I'll never understand people who complain that a horror movie is too gruesome or horrifying. It's like a person saying he/she didn't like a comedy because it was too funny.<br><br>The negativity towards DON'T GO IN THE HOUSE is odd. Yes, there is ONE moment where it's particularly gruesome and lurid but I've seen mainstream movies (LETHAL WEAPON 2 or TOTAL RECALL) where the super violent action was more nauseating to me than an entire film like DGITH. I suspect that a lot it has to do with the fact that DGITH is a low budget movie, with unknowns and made by unknowns, and those suffering from an elitist complex will renege anything if it doesn't look a certain way or stand-up to their (prefab) expectations. The great thing about DGITH is that it doesn't gloss over the violence. The film is grim, dour and depressing, as it SHOULD be.<br><br>\nAnother notch against DGITH is that the story follows the depressing actions of the killer, who's the only main character of the film. And like so many horror films with the main character being the killer himself, few people identify with (or what to identify with) the killer, and because of this knee-jerk reaction towards the way the film portrays the killer, many dismissed it without even trying to see it for what it is. Ironically, the film is dismissed for what it is (and isn't) as much as the character it portrays is dismissed in reality for who he is. Oddly enough, I thought his friend was more annoying than the killer himself.<br><br>DGITH is not the greatest movie ever made. But it does what it intended to do: it unsettles and it's grim and unpleasant, with its post-Vietnam war tone. There's NO black humour in the film, and a lot of films these days like to include touches of black comedy here and there in serial killer stories. But I'm glad there aren't any touches of black comedy in DGITH. Its straightforwardness is actually what sets it apart from most films of its kind.<br><br>The only big mistake in the film is the tacky \"surprise\" ending that has nothing to do with the rest of the movie. Otherwise, the film is solid and packs a mean punch. And I dig that disco music!<br><br>So, if you don't like your horror movies with a depressive tone. If you don't like movies that don't look splashy or stylized, then DON'T GO IN THE HOUSE is not a movie for you. Personally, I think it's light years better than the overrated MANIAC (1980).","user":"Maciste_Brother","rank":[38,47]},{"title":"What? Creepy verstehen surrealism isn't enough??","rating":10,"date":"9 May 2004","review":"First off, I don't like real life violence, but I like realistic violence in the appropriate media forms. That being stated, I appreciate the effort and crafting of any horror film that does good with what it has, which is what this film does exactly and which is the reason why I love it. But there is a part of me that cannot understand why they thought this movie was so bad. I mean sure, it has obvious signs of a low budget production, a little bit of a strong focus on a sub-theme layered somewhere in the movie and a bit of ambiguity, but everything else from the mundane spoken lines, the acting (especially with Mr.Grimaldi...hey, every big career has to start small) the synthesized music and disturbing imagery that you could rarely find in horror movies were memorably effective.<br><br>I can understand how some people just don't think it's scary in general and I'm not worried about that at all, but what confuses me is when people give it a bad grade for being 'sick' and 'perverse'. Were they just expecting some lame kill scenes like the kind we see today where we see the killer with weapon in hand, we see the victim scream and then we suddenly cut to camera two and they're magically dead? I particularly understand that some people are sensitive to such material and want to express being politically correct in their every day lives (apparently with the old movies they watch as well), but come on ladies and gentlemen!<br><br>This movie takes steps in a different direction! It pulls you into the life of a throughly traumatized man (hence verstehen = a walk in another person's shoes), it was made a few years after famous real-life serial killers such as Jeffery Dahmer, Ted Bundy and David 'Son of Sam' Berkowtiz were caught. All disturbed men who performed terrible acts of cruelty and murder due to the horrors of their personal traumatized lives, and you don't find it horrifying, scary, disturbing and/or unique to witness the fictional account of such a man who let his squelched mind wander too far on a positive gamut at all??<br><br>If you cannot deal with the aspects talked about in this movie then watch something else and don't complain about how sick a horror movie is. It's a HORROR movie to begin with, it's supposed to be that way! But if you are looking for a psychological horror movie that is uniquely creepy and different for a change (I'm really getting tired of that old 'EEEK', splat, ketchup-on-the-wall crap), and if you KNOW you can take the explicitness, then be my guest, hop on in, watch the movie and see what you think!","user":"iate","rank":[31,39]}]