[{"title":"Criminally underrated.","rating":9,"date":"28 June 2012","review":"A lot of people know the Rambo series as a ridiculous 80's action series. But what a lot of people tend to forget is that the first movie in this series was not a ridiculous action movie. It's a serious, dark, thriller that has a very somber tone and a sympathetic lead character. Almost everything that Rambo is known for nowadays is completely absent in this movie. From the multitude of explosions to the high body count to the unrealistic action to the ridiculous story line is completely absent. There are only 2 or 3 explosions (not to mention they are realistically done) and only one person dies throughout the whole picture. and the action, while there isn't a lot, it's realistic. Even the story line you believe can actually happen. It's for these reasons that make this my favorite Rambo movie. And not to mention the fantastic and heart breaking performance given by Stallone. Why the Academy didn't nominate him for Best Actor at the Oscars is beyond me. If you didn't like the other Rambo movies because of their ridiculousness and haven't seen this film, I highly recommend seeing it. It's one of my favorite post-war movies if not one of my favorite movies of all time.<br><br>Final rating: 9/10","user":"Goldwaterproductions","rank":[42,49]},{"title":"They drew first blood not me. They drew first blood.","rating":10,"date":"14 June 1999","review":"First Blood is simply one of the best films ever made. I think it transcends the action film genre and has stood the test of time. Stallone was immensely popular back in the 80's and if it is true that he hated the first cut of the film, then one can only say that he is lucky that he didn't get his wish to scrap the entire thing.<br><br>John Rambo is first introduced to us as he is walking into a small town to look for a friend of his that he served in Vietnam with. Upon discovering that he contracted cancer coming back from the war, Rambo wanders aimlessly into town. He is greeted by a small town overzealous sheriff named Will Teasle, played wonderfully by Brian Denehy. He at first tells Rambo that he will help him out and give him a ride. When Rambo asks if he can find a good place to eat, Teasle directs him to a diner about 10 miles up the highway. Rambo asks if there is a law against him eating in the town, Teasle, says yea, me. This sets up the premise as Rambo begins walking back into town. Arrested for vagrancy, Rambo is taken to the local jail and we meet some of the local redneck officers, notably, a young David Caruso, who seems to be the only one who empathizes with Rambo. Finally, he escapes the jail and takes the entire small town sheriff department and the military on a hunt into the local \"jungle.\" <br><br>First Blood has strength of character. It has frenetic action scenes and every actor in the film is at the top of their game. Samuel Trautman, Rambo's mentor and former Colonel in the war, is played by Richard Crenna as a no nonsense but empathetic man. He knows Rambo has pushed back a little too hard but he understands where his plight comes from. He wants to avoid more bloodshed but at the same time he doesn't completely agree with how Rambo has been treated. He is obviously a law abiding citizen, but he knows that not all the laws were upheld when dealing with Rambo.<br><br>Sylvester Stallone is RAMBO. There is no one else that could play him. Just like Harrison Ford embodies Indiana Jones and Bruce Willis is John McClane, Stallone is about as good as he has ever been here. He is quiet, he is strong and his physicality creates a character that many of us can empathize with and eventually root for. David Morell wrote a different character in his book but Stallone paints him more as a sympathetic character. He is correct in doing so. While Morell's vision is still present, this is more of Stallone's creation. Rambo is about as unique a character present in film history.<br><br>First Blood is a film released in 1982, but in my opinion it set a new standard for action film stars. I think James Bond was pretty much your standard action film star before that. He was smooth and debonair and nothing went wrong for him. Rambo, at least in First Blood, is realistic. He bleeds, he cries, and he wears his emotion on his sleeve. This is someone that many of us could and can relate to. The sequels made him larger than life and that is fine, but this small film done by the Carolco guys is about as perfect a film as you can get.<br><br>10/10","user":"baumer","rank":[230,294]},{"title":"Rambo movie that started all in the action genre my personal favorite Stallone's best movie","rating":10,"date":"2 January 2018","review":"First Blood (1982) is a classic action movie that started all action genre one man army types action movies. It is my personal favorite movie of all time. I am a huge Rambo fan and I love John Rambo character. I love First Blood, Rambo: First Blood Part II and Rambo to death. I love them so much it is my favorite film series. I love First Blood to death this is my personal favorite action film. It is in my top 5 Stallone's favorite action films part 4 and 5 is Cliffhanger and Demolition Man. It is my personal favorite action film in the Rambo series. I love Rambo: First Blood Part II to death it is my number 1 favorite action film in the action genre. First Blood is my personal favorite action film of all time it is right up there with Part II. It is my number 3 favorite action in the Rambo series but I still love First Blood to death.<br><br>This is my comic book hero this is my childhood movie the movie I grew up with it. This is the best movie ever my all time favorite action movie. It is the best of the best of all time. Sylvester Stallone co-write the script and started and the men can act, he is an action hero on screen in my opinion his best film. Yours is Rocky mine is Rambo action hero. I love Rambo's Survival Knife he rally's on his knife. <br><br>\"I could have killed 'em all, I could've killed you. In town you're the law, out here it's me. Don't push it! Don't push it or I'll give you a war you won't believe. Let it go. Let it go! \"<br><br>First Blood is a realistic film portrayed about John Rambo a troubled and misunderstood Vietnam veteran who saw hell in the Vietnam War and he is hunted by the past. Sylvester Stallone plays the character of John Rambo very convincingly and Director Ted Kotcheff brings out the story to an effective scale allowing us to see the action through the character's eyes.. \"First Blood\" doesn't deal with CGI nor does it deal with special effects. It deals or tries to deal really hard on what is real. He feels that society is against him and he is angry. <br><br>The movie has ton's of action, the motorcycle chases. Rambo climbs the wall of mountain and is been pursued by a helicopter and the police officer becomes the killer and try's to shoot Rambo with a riffle. Rambo jumps and hangs him self on the tree. That jump was for real and Sylvester Stallone really performed it. Rambo uses his martial arts to defend him self against abusive corrupt cops to escape. I love how the film shows Rambo trying to survive out in the woods while the guards are hunting him when in turn he is hunting them creating these traps putting these officers in painful situations. <br><br>The best thing about \"First Blood\" is that we know that John Rambo was in the Vietnam War and was trained to kill, yet, he doesn't kill a single human in the film on purpose. John Rambo uses M60 machine gun and shoot up various stores in town including police station destroys the gun store and gas station. \n \nBrian Dennehy and Richard Crenna both acted opposite Sylvester Stallone and they both acted well. Brian Dennehy as Sheriff Will Teasle was excellent bad guy he performs his character well. Richard Crenna is Colonel Sam Trautman who trained and command Rambo in Vietnam for 3 years he is excellent as father figure to Rambo. <br><br>\"First Blood\" is the best of the Rambo series mine personal favorite action film . The movie has beautiful music score from Jerry Goldsmith 10/10 Grade: Bad-Ass Seal Of Approval My personal favorite action movie of all time.","user":"ivo-cobra8","rank":[116,145]}]