[{"title":"A great film headed by a classic director and strong star William Holden","rating":4,"date":"4 August 2004","review":"William Holden is always in the shadows in `Stalag 17', he's always behind the characters or off to the side of the camera.  You see, despite Holden's character Sgt. J.J. Sefton being the film's main character, he is only seen through the eyes of his fellow POWs, rarely ever alone.  When they start to think he's the spy so do we.  Oh, sure, we know he isn't the rat (movies don't do things like that), but since the story is told by all of the POWs who think Sefton is the rat, we start to think like them too.  That is the mastery of Billy Wilder's `Stalag 17', it takes the film's most interesting character and sets him apart from the rest for most of the film, letting us learn about him as the characters do.<br><br>The story focuses on a group of POWs living in the American section of Stalag 17, supposedly the     's best POW camp.  Among them are barracks chief Hoffy (Richard Erdman), Price (Peter Graves), Shapiro (Harvey Lembeck) and Animal Casava (Robert Strauss).  They all have their own special job when their fellow prisoners try to escape, Price, for instance, is security'.  The film starts when two prisoners try to escape the barracks. Everyone inside is enthused, thinking the two will make it very far, except Sefton, who bets precious cigarettes that they wont make it past the outer forest.  When he turns out to be right the POWs start thinking there's a rat and that rat is Sefton.  And as the first hour passes we think so too, it's only logical, Sefton has any luxuries because of his deals with the s.<br><br>The POWs start to bully Sefton, and once they beat him to a pulp he decides to discover who the real rat is (at this point, of course, we know he is     ).  His investigation isn't handled with dialogue though, we get this by seeing his facial expressions and his lurking in the shadows of the barracks.<br><br>So, what starts as a light, `gung-ho' type war movie (there's lots of comedy in the first hour) turns into a dark, sort of gritty thriller with a twist that left me with my mouth open.  I wont reveal it, but I'll just say that Sefton smartly solves the mystery and redeems himself to the rest of the barracks (I didn't spoil anything, come on, it's expected).<br><br>As I said, there's lots of comedy in the first hour and some in the second, mostly from Strauss and Lembeck's characters.  Some of the comedy is key in showing how these characters cope with their nearly hopeless situation, handled well by Wilder and the actors (Strauss' performance even gained him an Oscar nomination) but some of it just seems tacked on and out of place, like when a drunken Strauss thinks that Lembeck is a hell.<br><br>But that is a small qualm, and the rest of the film is excellent.  The direction and writing are great in showing us a war film, a mystery, a thriller and a dark comedy all at once.  I'd have to say I like the acting the most though, Holden (who won a leading Oscar for his work in this) is suave and charming, as well as mischievous and cynical, he creates a real `cool' character without trying too.  And the rest of the cast - Graves, Otto Preminger - are admirable as well.  The POWs aren't clichés or caricatures, they're all their own separate people.<br><br>`Stalag 17' is great as a war movie, a mystery, a thriller and a dark comedy.  It's a classic film, for all who appreciate good cinema, 8.5/10.","user":"NoArrow","rank":[67,77]},{"title":"Underrated? - understatement!","rating":10,"date":"28 February 2000","review":"In his lengthy and eventful career, Billy Wilder created many films that have rightly attained classic status, but his WWII prisoner of war comedy-drama Stalag 17 is arguably one of his best. The scripting is a perfect example of how to marry a tight plot with sharp dialogue and great characters, and the acting is flawless on all counts. While William Holden's performance as the cynical American sergeant rightly won him an Oscar, it is the comic antics of Robert Strauss and Harvey Lembeck that steal the show. And if there was ever a more entertaining ensemble of previously unseen (and sadly subsequently unheard of) supporting players - with the possible exception of Casablanca - I would love to see it. This film predates the more famous WWII pow film The Great Escape by more than a decade, but had Wilder, Holden and company not caused havoc in Stalag 17, the world would never have seen Steve McQueen play the cooler king with such wry aplomb. Stalag 17 is easily one of the finest films of its time, if not of all time, and I would encourage anyone who has never experienced its unique blend of cynicism, comedy, suspense and drama to check it out at the earliest available opportunity.","user":"jmcsween90","rank":[77,96]},{"title":"Quasi-realism and burlesque: a comedic drama","rating":10,"date":"7 February 2004","review":"There was surprisingly enough a lot of humor in the American attitude toward the Nazis and the Germans during World War II. Life goes on even under the conditions of being prisoners of war, and people need to laugh. In such circumstances, they especially need to laugh. We can see that in some of the songs from that time and in this play from Donald Bevant and Edmund Trzcinski that Billy Wilder made into an unusually good movie. It should be realized that the full extent of the horror that the Nazis had visited upon Europe was not known until after the war was over and we saw the films of the concentration camps.<br><br>William Holden stars as Sgt J.J. Sefton whose amoral cynicism and gift for the cheap hustle allow him to feather his nest even while a prisoner of war.<br><br>He's the guy who always had a storehouse of cigarettes, booze, silk stockings, candy, etc. under his bunk, the guy who always won at cards, whose proposition bets always gave him the edge. We had a guy like that when I was in the army. We called him \"Slick.\"<br><br>But William Holden's Sefton is more than Slick. He is outrageously cynical and uncommonly brave. He takes chances because he doesn't have the same kind of fear that others have. Most people would feel self-conscious (and nervous) eating a fried egg while everybody else in the barracks had watery-thin potato soup. Others might feel uncomfortable with bribing German guards for bottles of Riesling or tins of sardines. Not Sefton. He flaunts his store of goodies.<br><br>Perhaps that is overdone. Perhaps the real hardships that prisoners went through are glossed over in this comedic drama--a comedy, incidentally, that plays very much like a Broadway musical without the music. Perhaps it is the case that from the distance of 1953 the deprivations of Stalag 17 have faded from memory and it is the \"good times\" that are recalled.<br><br>At any rate, I think it is this kind of psychology that accounts for the success of this unusual blend of quasi-realism and burlesque. Certainly Stalag 17 has been widely imitated, most familiarly in the TV sit-com \"Hogan's Heroes\" and to some extent on Rowan and Martin's \"Laugh-In.\" Roberto Benigni's Life Is Beautiful, on the other hand, which also finds humor in the horrific, is of a different genre. Like Ionesco's Rhinoceros, Benigni's movie is from the theater of the absurd, not the Broadway stage.<br><br>Holden won an Oscar for his performance and Robert Strauss who played Animal was nominated in a supporting role. Otto Preminger, the legendary director and producer, was excellent as the two-faced Col Von Scherbach, the ex-calvary commander and camp commandant who can only take a phone call from the high command with his boots on so he can click his heels. I also liked Sig Rumann as Sgt Johann Sebastian Schulz (\"always making with the jokes, you Americans\") whose previous career as a wrestler in the US accounts for his English-language skills. Gil Stratton, who for years did the sports for CBS Channel 2 in Los Angeles, is interesting as Sefton's sidekick and funky.<br><br>Indeed, what is responsible for the success of this movie as much as anything is this fine cast playing well-defined character roles. By the way, Strauss and Harvey Lembeck (\"Sugar Lips\" Shapiro) were reprising their roles from Broadway.<br><br>Important is the fine plot line in which Sefton is accused of being a spy for the Nazis while the real spy is exposed step by step. At first we don't know who it is, and then we do, and then the prisoners find out. <br><br>This should be compared with Sunset Boulevard (1950). While very different movies they have similar elements which reveal part of the psyche and methods of director Billy Wilder. First there is the anti-hero as the protagonist, in both cases played by William Holden. Then there is a lot of the old Hollywood crowd appearing in both films including directors appearing as actors, Erich von Stroheim (not to mention Cecil B. DeMille in his memorable cameo as himself) in Sunset Boulevard, and Otto Preminger here. Sig Rumann has over a 100 credits going back to at least the early thirties. Finally there is the discordant mix of comedic and dramatic elements, a mix that works on our psyches because life is to some very real extent filled with tragedy in close congruence with the laughable.<br><br>But see this for William Holden who was the kind of actor who was best playing a compromised character as here and as the failed writer/reluctant gigolo in Sunset Boulevard, an actor who drank too much and tended to undistinguished, but when carefully directed could rise above his intentions and give a sterling performance.<br><br>(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)","user":"DeeNine-2","rank":[72,91]}]