[{"title":"Andy's best movie, though admittedly that isn't saying much.","rating":29,"date":"29 March 2001","review":"I first met Andy Milligan in 1985 and told him how much I enjoyed his movies.  I remember how he actually blushed when I asked for his autograph. This 1972 movie is his best . . .but I am the first to admit that is small compliment. The Mooney family has no end of problems.  Pa Mooney claims to be 199 years old, daughter Monica (Hope Stansbury) is a sadist, son Malcolm is a halfwit and the whole family are werewolves!  There is enough plot here for two movies!  The eldest daughter in the family (Jackie Skarvellis) returns home from medical school with a new husband, which Pa Mooney heartily disapproves of, but she is the last hope that they can overcome the ancient curse.  Will she succeed?  Remember, this is an Andy Milligan film we are talking about! Clearly Hope Stansbury is the best actress in the picture.  A Milligan perennial, she turns up in several of his pictures.  Andy always denied it but I suspect it is he playing Mr. Macawber, the one armed, disfigured shopowner who sells Ms. Stansbury the rats which serve to pad out the picture by 11 minutes (11 l-o-n-g minutes!).  Notice during one scene in Mr. Macawber's shop if you look at the background you will see several cardboard boxes labeled \"Hires Root Beer\". A great movie?  No.  A fun movie?  Yes, definitely.  I miss you Andy.","user":"reptilicus","rank":[13,16]},{"title":"A morbidly interesting curio.....","rating":19,"date":"19 April 2006","review":"I'm not going to try to pretend that this (or any other Andy Milligan movie I've seen) is actually a good movie, but I can't help feeling there's a good movie buried somewhere in this mess, trying to fight its way out. The dialogue, while soap operatic, is reasonably intelligent, with none of the overt howlers that make (for example) Ed Wood's movies so laughably amusing. Some of the performances are pretty good. The principle locations are quite good. And there are moments of (twisted) imagination. But countering these assets are debits too numerous to mention. The technical standards are pathetic. Even granting that is was shot in 16mm reversal nearly forty years ago the picture is grungy and badly lit. The sound is so bad that you frequently can't understand what the characters are saying. The costumes were apparently whatever Milligan could get his hands on. The editing is poor, the make-up is poor, and (perhaps most unforgivable of all) for a horror movie the shock scenes are very badly handled. I'm glad I satisfied my curiosity by checking this movie out, but I don't think I could sit through it again.<br><br>And if that really was a live rat being nailed to a board, then that's the part that's TRULY unforgivable.","user":"horrorfilmx","rank":[4,4]},{"title":"I can see how this one slipped into the public domain!","rating":2,"date":"6 March 2014","review":"The crazy title of this film would seem to indicate that it's a bad movie, but that doesn't even come close to describing this film and just how bad it is. The film reaches levels of amateurism that are hard to believe and you just have to see it to believe it. I'll try to describe its wretchedness as best I can. The acting appears about the same quality as local community theater. Not a big community and not a good theater mind you. The actors(?) over-emote wildly but that is not the big problem. The big problem is that they deliver their lines so rapidly that it makes your head spin and the director (Andy Milligan) SHOULD have told them all to slow down. The costumes and sets are just odd. But the oddest thing is the strange and disjoint plot. At times, it is enjoyable as a guilty pleasure (much like \"Spider Baby\") but much of the time it just seems like everyone is winging it!<br><br>The film begins with some nonsense involving some maniac lighting someone on fire. Exactly what's going on is vague and you hear from the demented family that the youngest son has once again run amok. Soon the youngest daughter who has been away at college arrives home with a new husband. Her father is not happy—apparently there are weird genetics abounding in the family and her duty is to work on some formula to correct it. At this point, it is obvious the youngest son is some sort of primordial weirdo—not really a werewolf. However, you soon see that one of the three sisters is just plain nuts and delights in tormenting and tearing apart animals. This is the part that angered me because they really did torment animals for the picture—and I think the animal that was literally ripped apart on the camera might have been a real animal. Normally I am not a big supporter of PETA, but here they really have reason to be angry! There's also a deformed guy who loves rats and sells them to this crazy sister—but none of it really made sense. It was more like watching a freak show as the actors hammed it up and tried to shock the viewer. The biggest shock for me, however, is that the film just rambled and seemed to have no point or direction. The only reason I am giving this one a 2 and not a 1 is that it did keep my attention—at least for a while. All the nutty antics were mildly interesting. But artistically, this film is just awful and pointless.<br><br>If you care (and really, you shouldn't), the nuttiest sister refers to her new pet rats by name—one of which is Ben and the other Willard—and are taken from the movie \"Willard\".","user":"MartinHafer","rank":[5,6]}]