[{"title":"I thought I lived in the United States.","rating":30,"date":"30 July 2005","review":"Where are all the protesters who gather whenever some idiot tries to censor artwork or expression that is contrary to American culture? None of them seem to have shown up when this great work was put on the shelf, then later chopped up. Europeans, with an open eye to American society (only due to the benefit of being distant), were able to see this film with honesty. I say this because that's where it was shown uncut and critically acclaimed.<br><br>The truth is that it is a statement about and against racism, completely misunderstood by the civil rights groups and the others who opposed it. It is a good, hard look at the way racism is propagated in America, through the training of not only this one single dog, but of young people by racist adults and peers as the young people mature into adulthood. It tackles the subject with an honesty that is sadly missing in the statements of most anti-racist organizations.<br><br>Most groups prefer to gloss over the true causes of racism with platitudes, and a few often have a political agenda that promotes socialistic ideals, so they really don't give full attention to the true causes of racism. Everybody now is so afraid of offending anybody else, that everything becomes a watered-down, grayish, inoffensive litany no more bothersome than grouchiness. Sam Fuller stated in film what it really is, and that is that people learn from others throughout childhood, not always by overt indoctrination but by subtle methods, to think in stereotypical and racist terms. Not just whites thinking of blacks as uneducated gangster-rappers, but also those who think of Native Americans as lazy drinkers, Italians as loud-mouthed mob disciples, country folks as hillbilly trailer trash, and so on.<br><br>And Hollywood does little of significance to dispel this, because they mostly grind things down to these kind of stereotypes to fit into the 2-hr film story mode that they like, which is long on violence, sex and action, and short on character. It's easier that way. Thanks to Sam Fuller for his courage.<br><br>ADDENDUM: I had the opportunity to see this again recently after 25 years, and it is still as powerful as I remembered. It does have a B-movie quality to it, a roughness that actually makes it better than if it had been a polished film. The final sequence remains as terrifying as anything I've seen in any type of film, horror, suspense, Hitchcock, and so on. And it has a fabulous music score by Ennio Morricone. I'd confidently call this one a must-see!","user":"rixrex","rank":[98,109]},{"title":"underrated and heartbreaking","rating":10,"date":"6 February 2005","review":"\"white dog\" is one of the best films of the 80's,it's a very very hard film but also a really clever and lucid film about racism,conditioning,hatred and the complex connections between people and animals. The acting (especially from Kristy McNichol and Paul Winfield) is great,Fuller's direction and his sense of editing and use of slow motion are really effective,the screenplay is brilliant and ennio Morricone's soundtrack is really beautiful and haunting. I have only an old VHS (with bad dubbing and full screen format)of \"white dog\"...this underrated masterpiece really deserves a beautiful edition on DVD!","user":"guigui-paul","rank":[54,62]},{"title":"Unseen Masterpiece","rating":8,"date":"8 September 2004","review":"I can't let this be the only comment for White Dog.<br><br>The best film about racism and hatred I've ever seen, with the basic message that hatred isn't something a child is born with, it's something they have been taught. And the question is raised, can you un-teach them?<br><br>A black animal trainer (Paul Winfield) attempts to re-train an attack dog taught to kill people with black skin.<br><br>Paramount tucked it's tail between it's legs when protesters who had never seen the film claimed it was the work of racists.<br><br>Fuller moved to France and never made another American movie. (He made one in France)<br><br>PS: to the lady above me, that annoying piano is Ennio Morricone and he has forgotten more about music than you will ever know.","user":"ryanlangerud","rank":[60,75]}]