[{"title":"Blistering tale of love and pain","rating":22,"date":"22 December 2001","review":"This afternoon, the Fox Movie Channel ran the trailer for The Panic in Needle Park. I was intrigued, and when the movie followed (uncut--accept nothing else) I watched. I am still stunned. This livid, documentary-style look at a faction of society that most people prefer to ignore of simply lock up is a brutal and powerful piece of cinema. <br><br>It is a film devoid of simple black and white categorizations. Bobby and Helen, deeply in love and deeply addicted to smack, are not bad people; rather they are people in a very bad situation--screwed up, screwed over, strung out, and doing whatever they can to survive. We watch as they go from \"just chipping\" to crippling, $80-a-day dependency. They steal, deal, hook, and shoot the profits into a scarred vein. A tone of bleak, tragic inevitability infuses their lives and the film. We care about them, but all we can do is watch; there are no offers of help, no outstretched hands. In an extremely telling moment, Helen says she wants to move out of Needle Park, to which Bobby simply responds, \"It's where I live.\"<br><br>Panic has such a natural, improvisational feel that those existing on a diet of super-glossy cash-cow cinema may be put off. It is only slightly more polished than Andy Warhol's Trash, which it resembles by turns--from the camera that loses focus and trembles ever so slightly to the close-ups of needles sliding into veins. The gritty city is perfectly captured, with a tremendous atmosphere of desperation and misfortune. As Bobby, Al Pacino is marvelous (as usual), but I was really impressed by Kitty Winn in the role of Helen. I'd only seen her in The Exorcist, where she was mostly relegated to the background. Here, her portrayal is gut-wrenching, courageous, and unforgettable. I can say without a doubt, Needle Park is a must-see. It may not be pretty, but it's life.","user":"Vince-5","rank":[67,69]},{"title":"One of the best ever","rating":10,"date":"28 February 2005","review":"One of the rawest images of drug addiction ever shown in a movie ! \"Drugstore cowboy\" and \"trainspotting\" turn into cartoons by seeing this film. Pacino and Wynn : what an impressive performance. One of the best ever ! The film shows a horrifying image of the junk life in the city of New York in the seventies. This motion picture does not have the sparkling colors and action, of expensive Hollywood productions nowadays and that is just the beauty of it ! It's the brutal reality that makes us realize what harder drugs can do to a persons life. Every fourteen year old kid should see this film because of the damage hard drugs can do. Forgive me, English is not my native language i hope people understand what i am trying to say. Anyway great movie and it should be better known ! What in the name happened to Jerry Schatzberg ?","user":"davewagner","rank":[26,27]},{"title":"A great portrayal of a relationship between two drug addicts.","rating":9,"date":"5 August 2004","review":"This movie is not for people with sensitive nerves. Its harsh realism is very breathtaking, at times almost overwhelming. It concentrates in showing what drug addiction does to people in a relationship and succeeds in doing that. That's also the reason for its timelessness and artistic value.<br><br>Al Pacino and Kitty Winn, who plays the two main characters, Bobby and Helen, are very realistic in showing the ups and mostly the downs in the life of a drug addict. Especially the way they at times put their craving for drugs above each others needs.<br><br>The first time I saw the film I was 15. It was shown at my school and it made a very strong impression on me, especially its portrayal in the miserable life of a drug addict. I can therefore, among other things, recommend it as a preventive film for young people.","user":"jacob_ostergaard","rank":[55,62]}]