[{"title":"One of Bergman's most underrated","rating":9,"date":"14 October 2012","review":"I am a great admirer of Ingmar Bergman, Sweden's greatest director, and his films. Waiting Women(or Secrets of Women) is not one of his very finest, but it is one of his most underrated. Perhaps it is a touch overlong and episodic, but compared to everything else on display they are entirely forgivable. Bergman's direction is polished and never detached, while the film looks beautiful and is photographed every bit as strikingly. The music is hauntingly understated, the right approach for the story Waiting Women is conveying, while the writing is splendid(as is the comic finale) especially in the elevator sequence. The three stories that form the film are done in a heart-warming yet sincere way, the first is a tad clichéd and probably the weakest of the three but still does its job well, while the second story was the one with the most heart and the third was the one with the most pleasantly funny moments. What really matters is that all three had subjects that anybody can identify with and dealt with them realistically. The characters weren't the most likable on the planet, nor were they intended to be. That said, I wasn't annoyed or frustrated by them. All six leads give deeply felt and believable performances, Eva Dahlbeck and Gunner Bjornstrand are particularly note-worthy. Overall, while not one of Bergman's best it is one of his more underrated films and is very well done. 9/10 Bethany Cox","user":"TheLittleSongbird","rank":[14,14]},{"title":"Gorgeous","rating":9,"date":"17 September 2002","review":"A very beautiful film by master Ingmar Bergman. Four women, all sisters-in-law, await their husbands in a house on an island. They converse, and soon begin to tell each other the big stories of their lives. The first tells how she had an affair with her teenage sweetheart and how her husband reacts. The second tells of how she was seduced and became pregnant. And the third tells about how she once got her husband to admit his philandering when they were stuck in an elevator. Meanwhile, in the framing episode, a younger sister of one of the women has fallen in love with the fourth brother. The first and third stories are a little cliched, especially the elevator sequence, but they're still quite great. Being trapped in an elevator is a nice, easy, and overused way for two characters to solve problems, but the dialogue between Gunnar Bjornstrand and Eva Dahlbeck is so excellent that it works out wondefully. The heart of the film is in the second story. It's so simple and well-done, so utterly beautiful in its conception and execution. It is, of course, a flashback, like the other two stories, but the story itself is also told in flashbacks. It works far better than I would have ever guessed. Secrets of Women is an underrated Bergman film, a must-see for any fan. 9/10.","user":"zetes","rank":[18,22]},{"title":"Both Poignant and Sad at Times","rating":8,"date":"13 March 2015","review":"Four women await their husbands/lovers and tell stories of their early encounters with these men. I won't go through the plot but suffice it to say that there is selfishness, self- loathing, sacrifice, and even some empty headed joy. One story tells of a spiteful woman and her boring husband. A childhood lover comes while he is gone and has tryst with her. She tells her husband and this leads to some soul searching. The second is an encounter with an artist that leads to a child being born and his self-centered departure. The third is a couple, married for several years, trapped on an elevator, giving what they say is an honest view of one another. The fourth has arranged to run off with her boyfriend, leaving the family behind. This may sound a bit vapid, but it is done with a master's touch, with the artistry that is Bergman. Every bit of cinema is framed and filled with emotion.","user":"Hitchcoc","rank":[5,5]}]