[{"title":"The Royale Treatment","rating":8,"date":"19 April 2004","review":"CASINO ROYALE is one of the truly great bad movies of all time. It is a wonderfully weird, bold, funny and incoherent mess of a movie. What should stink of embarrassing desperation, instead proves to cheerfully insane, unpredictable and remarkably free of common sense.<br><br>The film was intended to be the ultimate spy spoof, an attempt to out-Bond the James Bond movies and their innumerable imitators. To this end, the untold number of writers and directors involved have opted to take the everything-but-the-kitchen-sink approach to storytelling, mixed with a cut-and-paste style of editing. It is obvious that no one gave the slightest thought to creating a genuine spy film and instead approached the film with a devil-may-care attitude. As far as the actors are concerned, CASINO ROYALE seems to be little more than an excuse to have a multimillion dollar party at the studio's expense. As a satire of Bond films, CASINO is adequate; as a satire of the then trendy-swinging-cool-hip-with-it-now youth films of the era, it succeeds beautifully.<br><br>Basically you have a whole bunch of big name stars -- past their prime, but still with box office credibility -- ridiculing the very youth market that was squeezing them off the theatre marquees. Yet, the film has no malice; it is as bright and breezy as a screwball comedy with just a touch of British absurdity. It is amazing that a film that is so overblown, over produced and over budgeted can still be so light and airy. Despite a chaotic recipe, the film has a lot of really great ingredients. The cast is slumming in style (where else can you find Orson Welles, John Huston and Woody Allen hamming it up in the same film or Peter O'Toole, George Raft, Charles Boyer and Jean-Paul Belmondo dropping in for fleeting cameos?) And you have one of the best soundtrack albums ever, including Herb Alpert's title track and Dusty Springfield's sexy, sultry rendition of the Bacharach and David classic \"The Look of Love.\" Plus, you get Woody Allen as an evil genius out to take over the world and Deborah Kerr dangling from the drain pipe of a Scottish castle.<br><br>And, to some extend, the film gets Bond right. As the legit James Bond series grinds on, getting ever more pompous, humorless and heavy-handed, CASINO ROYALE sees the whole genre for what it is: an absurdist lark. Indeed, if CASINO ROYALE has a soul mate, it is not GOLDFINGER, but the \"Batman\" TV series, another pop culture phenomenon designed to deflate pretense with overblown villains, outrageously silly situations, off-the-wall cameos and a tongue placed firmly in the cheek.<br><br>What's not to love?","user":"majikstl","rank":[186,231]},{"title":"An experiment that didn't quite work","rating":5,"date":"1 June 2005","review":"Casino Royale has some outstanding elements. The production design is worth a 10. There are beautiful, often provocatively dressed or relatively undressed women everywhere you look. Many of its segments are funny; it's even occasionally hilarious.<br><br>The problem arose in putting all of it together. And with at least five directors and at least ten writers, it's not difficult to see why. The whole is a mess. There is little in the way of overarching plot. Most threads are just completely abandoned after awhile.<br><br>The story, which is very loosely based on Ian Fleming's James Bond novel Casino Royale (published in 1953--it's the first Bond novel), is a spoof of the typical adventure featuring the infamous secret agent. The real Bond (David Niven) went into retirement when his skills were at their peak. This Bond is quite different than the Bond we know--he is almost chaste, he's a homebody, he dedicates each evening's twilight to playing Debussy on the piano, and so on. Casino Royale has it that the Bond we know from other films is a decoy.<br><br>A group of older men, representing the secret agencies of the US, the UK, Russia and France, are on their way to the real Bond's home to ask for his assistance. It seems that someone has been trying to wipe out as many secret agents as they can. While they're pitching the idea of coming out of retirement to Bond, they're attacked. Bond's house is blown up, and he (implicitly) agrees to the assignment. Casino Royale is the story of the real Bond trying to get to the bottom of the sinister agent-wipeout plan. Part of carrying that out involves changing the identity of nearly every spy to James Bond--if the real Bond is to work unimpeded, he can't always be worrying about being killed by the criminal mastermind.<br><br>Each director worked on a different segment in relative isolation from the rest. This went so far as having their own portions of the script written. The problem was that despite Eon Productions (the production company behind most of the Bond films) not owning the rights to Casino Royale, they had used many of the \"bits\" in other Bond films. So there wasn't much of the book left to adapt. In addition, it was felt that a serious alternative Bond film couldn't compete against the Albert R. Broccoli/Harry Saltzman-produced films. So Casino Royale producers Jerry Bresler, John Dark and Charles K. Feldman had different writer/director teams create their own, parodic Bond segments that would be loosely tied together--it was almost a filmic version of the \"Exquisite Corpse\" game, in which you fold a piece of paper so that you can't see other persons' work, and you have to continue the drawing on your section with only a couple visual anchors.<br><br>Each segment features a different set of stars--the primary sets centering on Niven, Woody Allen, and Peter Sellers with Ursula Andress and Orson Welles. Those are all great actors, and great comedians in at least two cases. They all do a bit of their own schtick--in some cases, they demanded this. Woody does his neurotic New York Jew character, Peter Sellers rides the gray area between bumbling buffoon and suave playboy, with a couple generic Indian and Chinese impersonations thrown in for good measure, Orson Welles does his best Paul Masson Wine-pitching \"elder statesman\" demeanor, and also throws in a few of his more famous magic tricks. All of this stuff is good, but does it work as a unified film? No. And if that's not enough evidence for you, consider that the segments were further chopped up into set-pieces. There's the \"M\", or McTarry funeral stuff, the Niven car chase stuff, the Sellers/Andress romance stuff, and so on. Each set piece ends up being largely independent--you could almost see this as a series of skits on a similar theme. These facts make Casino Royale not quite work. It's certainly no match for a legitimate Bond film, despite the similarity of location-hopping, outrageous villains, spy gadgets and so on.<br><br>But, in isolation, the segments tend to be good to excellent. The stretch with Bond visiting the faux M widow is probably the funniest. It also presages the Sir Robin section of Monty Python and the Holy Grail (1975), but bests it in a way, if only because of its extension. The madcap ending of the film is a lot of fun for its embrace of absurdism as a supreme aesthetic disposition--and it may have even influenced some later films. And the segments with the trippiest visuals, both in the climax, are a fantastic treat for any fan of surrealism. They're good enough to watch the film just to see them. The production design is incredible throughout the film. Not just for the surrealism, but the lush Edwardian and Victorian interiors, complete with copies and works in similar styles to unique, influential artists such as Gustav Klimt and Otto Dix.<br><br>If we felt like being overly generous, we might be able to argue that the overarching mess of a plot was part of the point. This is a spoof of Bond, after all, and Bond novels and films tend to have sprawling plots--both geographically and narratively. We do travel to many exotic locales, meet many exotic people, doing exotic things, and we receive many plot intricacies and twists in both the typical Bond story and in Casino Royale. However, Bond films aren't quite convoluted or messy enough to deserve this kind of spoofing, so excusing the messiness of the whole to parodic intent seems an over-ambitious stretch.<br><br>Casino Royale is worth seeing, particularly if you're a big Bond fan or a big fan of any of the cast, or even if you just like a lot of late 1960s/early 1970s big, madcap comedies. Just don't expect anything like a tight story.","user":"BrandtSponseller","rank":[122,152]},{"title":"How Many 007s Does It Take To Change a Light Bulb?","rating":7,"date":"18 April 2005","review":"Eon Production's DR. NO was a great hit in the early 1960s, and Eon quickly snapped up the rights to the rest of Ian Flemming's novels about super spy James Bond--except for the CASINO ROYALE, which had already been purchased earlier by CBS for a 1950s television adaptation. When the property wound up at Columbia Pictures, they decided to create the satire to end all satires with a host of writers, five famous directors, and an all-star cast led by Peter Sellers. Unfortunately, Sellers' ego reached critical mass during the production and he was fired mid-way into filming--and suddenly roles that were originally envisioned as cameos had to be expanded to finish the project. The result is one of the most bizarre films imaginable.<br><br>The story, such as it is, finds James Bond (David Niven) called out of retirement to deal with the sudden disappearance of secret agents all over the world. In order to confuse the unknown enemy, Sir James orders ALL secret agents to use the name James Bond--and before you can blink there are Bonds aplenty running wild all over the globe. Eventually all the Bonds, including (through the magic of editing) Peter Sellers, wind up at Casino Royale, where they confront the evil agents of SMERSH and a diabolical mad man with a plot to rule the world.<br><br>The plot is absolute chaos, but that doesn't prevent the film from being a lot of fun to watch. The entire cast runs wild with some marvelous over-the-top performances, and whenever the writers can jam in a gag or a weird plot turn they do precisely that: Bond (Niven) is attacked by decoy ducks; counter-agent Mimi (Deborah Kerr) swings from a drain pipe; Bond's daughter by Mata Hari (Joanna Pettet) is kidnapped by a UFO; double agent Vesper (Ursula Andress) hides bodies in the deep freeze. And that's just for starters.<br><br>At one point Niven blows up the locked door of a psychedelically decorated dudgeon with lysergic acid--better know as LSD--and in a way this is indicative of the entire film, which was made at the height of the 1960s ultra-mod movement: the whole thing has the feel of a blow-out acid trip, right down to flashing multicolored lights and swinging 60s fashions. It is visually arresting, to say the least. And then there is that famous Burt Bacharach score, easily one of the best of the decade, sporting Herp Albert on the main theme and Dusty Springfield's legendary performance of \"The Look of Love.\" On the whole, the film is one of the most entertaining hodgepodges of talent and weirdness I've ever encountered, and it never fails to amuse. I've found that viewers tend to have extremely different reactions to this film--they either love it or hate it, so you may want to rent this one first. But it's one of my favorite guilty pleasures, and I recommend it for fans of the unexpectedly odd.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[75,92]}]