[{"title":"Blood's A Winner","rating":23,"date":"23 July 2004","review":"1975's \"A Boy And His Dog\" defies categorization, much like the outspoken author who penned its Nebula-winning source novella. Harlan Ellison has resisted the genre label for his entire 900+ short story career (\"call me a 'science fiction' writer, and I'll come to your house and nail your pet's head to the table\", he's warned), and yet his collections are stacked alongside \"Sliders\" novelizations in most bookstores. With its multiple world wars, mutants, and robot assassins, \"A Boy And His Dog\" is superficially science fiction, but only in the service of aspiring to a level of satire a la \"A Clockwork Orange\" or \"Slaughterhouse Five\".<br><br>Phoenix, Arizona 2024 AD: nomadic hunter-gatherers roam the radioactive wastelands ravaged by World War Four. Libidinous Vic has managed to survive his eighteen years as a \"Solo\" thanks largely to the aide of his far more intelligent - not to mention telepathic - companion Blood, a \"Rover\" who searches out supplies, women, and enemies and provides the requisite witty repartee. A post-nuke buddy pic? Well, of sorts--you see, while most viewers will recognize recently-bankrupt \"Nash Bridges\" star Don Johnson as the very young solo, fewer will realize that Blood is portrayed by the same veteran who managed to avoid being stereotyped as \"Tiger\" on The Brady Bunch. That's right: \"Rovers\" are intelligent, telepathic dogs, bred for warfare. If you're thinking of tuning out--don't, because this film has a lot to offer beyond an outrageous premise. When Blood sniffs out a disguised Quilla June (Susanne Benton) at a desert camp, Vic is surprised that he won't have to force her to be his evening's bedmate. Fleeing scavengers and the dangerous \"Screamers\" (nocturnal mutants who roam the deserts), Quilla June convinces Vic to join her in her subterranean home \"Topeka\", leaving Blood behind. Quilla June's father and leader of \"The Committee\" Lou Craddock (Jason Robards) sent her above ground to lure Vic into impregnating Topeka's women and offers the boy all of the perks of this bizarre Our Town meets Body Snatchers hamlet. But Vic finds out that his stud service will be extremely brief if he doesn't play by the rules, and after escaping The Committee's robotic enforcer, he finds loyal Blood on the brink of death, awaiting his return. Luckily, Quilla June has tagged along, and will provide a restorative service that reinforces Vic's worldview that the only \"true love\" is the one between a boy and his dog...<br><br>Produced in the days when \"indie\" typically meant \"exploitation\", \"A Boy And His Dog\" was a guerilla project for several Hollywood veterans who craved to do something different outside of \"The System\". Ellison had turned down big studio offers from Warners and Universal and instead handed over screen rights to L.Q. Jones, who had best been known as a stuntman (and still appears to this day in such fare as The Edge and Walker, Texas Ranger) to write and direct. The late Alvy Moore, of television's Green Acres, produced the film and appeared as Robard's accomplice \"Dr. Moore\". Tim McIntyre provided the voice of Blood and composed the music. Ellison wasn't happy with the Topeka sequences (and blamed his own story for their shortcomings) and was even less pleased with the film's final spoken line (a morbid pun penned by Jones). He offered to re-loop the dialogue out of his own pocket, but audiences loved the line. Despite Ellison's protests, the film impressed his peers enough for them to award it the 1976 Hugo Award for Best Dramatic Presentation. Fourth-time director Jones displays such a gifted eye for widescreen compositions and maximizing limited resources, and propels the story forward so breezily with witty voice-overs and bouncy acoustic score that it's amazing that he's never directed another film. The assured depiction of difficult character \"Blood\" is a true revelation: as voiced by McIntyre, reading dialogue more or less verbatim from Ellison's prose, the shaggy Rover ranks as one of the most believable and three-dimensional non-human screen characters--ever. I never cried when Old Yeller got shot, but I still get moist-eyed when Blood and Vic part ways at the entrance to Topeka.<br><br>\"A Boy And His Dog\" regularly shows up on most lists of the Top 10 Science Fiction Films Of All Time, and I certainly rank it alongside another independent S.F. marvels like \"Dark Star\" and \"THX 1138\". So, do give the dog a chance; after all, Tiger won the 1975 \"Patsy Award\" for his performance &lt;g&gt; The Region 1 DVD contains audio commentary from L.Q. Jones and two trailers (the promised \"liner notes\" are nowhere in evidence in my version). But be warned, purists: worse than the shoddy packaging and frequent misspellings (\"Harlen\" Ellison?), is the print itself: marred by emulsion scratches, dirt, and missing frames throughout. Still, the cheap price, and the sad fact that this is the only version fans have to choose from until someone like Blue Underground comes to the rescue, makes this disc a Must Have.","user":"spumco","rank":[83,96]},{"title":"Strange and enjoyable.","rating":7,"date":"4 January 2004","review":"The setting of this film is not only a material wasteland, but a moral one as well.  Our protaganists are a wandering teenage misogynist and his super-intelligent telepathic dog.  The latter helps the former to locate potential rape victims.  Their pursuit of one particular sexual quarry leads the young man on a journey into a subterranean perversion of smalltown America.  The dog is the most sympathetic character in the movie, and is brilliantly voiced by Tim McIntire.<br><br>If you are able to wrap your head around the bizarre moral construct, this film is a nihilistic hoot.","user":"dusikyon","rank":[76,91]},{"title":"Kinky Cult Classic= A great film!","rating":10,"date":"13 May 2004","review":"Vic and his telepathically talking sheep dog, Blood, travel post-apocalyptic Arizona.  Besides scavenging for food and sex, this movie features old, terrible porn clips, evil Amish looking people with clown makeup and possibly the greatest pun in movie history.  Blood provides hilarious commentary to all Vic's endeavors, his comments while Vic and a girl he finds have sex are particularly entertaining.  At parts, this movie gets so strange you can't do anything but laugh at it, which is definitely not a bad thing!  A Boy and His Dog is not something that will ever be universally popular, but it is a great movie for late nights and all nerds.  A classic piece of science fiction.","user":"emma5050","rank":[58,75]}]