[{"title":"\"Dark Days, Bright Nights\"","rating":9,"date":"19 September 2004","review":"The third film in George A. Romero's immensely popular \"Living Dead\" trilogy is by far the bleakest and most complex film the director has ever worked on. \"Day of the Dead\" received a lot of negative press upon its release in 1985 - people picked apart unsavory characters, OVER-acting from a no-name cast, and outlandishly gory special effects that only Tom Savini himself could be proud of.<br><br>But none of this makes it a bad experience really, does it? I don't think so. For the reason that I usually detest zombie flicks, I have worked up a fondness for the works of Romero and over the last two weeks have separately watched each film in his trilogy.<br><br>\"Night of the Living Dead\" (1968) virtually defined a new genre of horror movie-making and basically set the standards for the many zombie flicks that would follow in its footsteps. Next up to bat was the most praised film in the trilogy - \"Dawn of the Dead\" (1978) - which was more of an action film than a horror movie and was nothing short of epic. Then came \"Day\" in 1985, which got the tongue-lashing that I described earlier.<br><br>However those that did like it, praised the Savini effects, its complex, plot-driven characters, and satire. While \"Day\" is certainly a step down from \"Night\" and \"Dawn,\" \"Day\" is more of a claustrophobic horror movie and that allows it to stand on its own as a fitting end to Romero's trilogy. It's more in sync with the tension of \"Night\" than it is with the adrenalin-laced action, zombie-slaughterfest that was \"Dawn.\"<br><br>A team of civilian scientists and a loose army unit clash with each other's motives after they have taken shelter at an underground military base from the hordes of living dead that storm the surface above. The civilian scientists aren't seeking to eradicate the zombies like the soldiers are hell-bent on doing, but are instead trying to get to the bottom of what is causing them to be what they are.<br><br>In doing so, they need live zombie specimens, which are held captive in a maze of dark underground tunnels where they're corralled like cattle. We later get what is one of the most profound and moving experiences in the entire trilogy with \"Day,\" when we see one zombie, nicknamed \"Bub\" by one particularly eccentric scientist, who eventually learns what it means to be \"alive,\" so to speak.<br><br>\"Day of the Dead\" obviously isn't a perfect movie, but is more or less a fitting conclusion to one of the most daring film trilogies in the horror genre. It may be best to not watch \"Day\" thinking it'll be anything like \"Dawn\" just because it has military men blasting away mercilessly at the living dead. Zombie slaughter is few and far between and much of the first hour of the film is clashing dialogue between the characters.<br><br>The darkest day in the world - \"Day of the Dead.\"<br><br>9/10","user":"dee.reid","rank":[69,78]},{"title":"A long-time sufferer of the \"Alien 3 Syndrome\"","rating":7,"date":"7 September 1999","review":"\"Day of the Dead\" is a film that is an unfortunate sufferer of the \"Alien 3 Syndrome\". And, no, I don't classify those that are affected by the syndrome to be disappointing final entries in a trilogy. To suffer from \"Alien 3 Syndrome\", you must follow two exceptional films, and the entry that has preceded you must be so exciting and action-packed that when you dare take a grimmer, more deliberately paced approach to your material, you will become universally reviled, with many people failing to notice that you have more than your fair share of merits on your own. In fact, \"Day of the Dead\" has a LOT of merits - even more than the film that its syndrome is based on. While it doesn't quite approach the greatness of \"Dawn of the Dead\", it is still an intelligent, first-rate horror effort and stands as one of the best genre films of the 80s.<br><br>In this final entry of George Romero's \"Living Dead\" trilogy, the walking dead supposedly outnumber the humans by a ratio of 400,000 to 1. Twelve people who have devoted themselves to studying and wiping out the zombies hole up together in an underground missile silo, and for all we know, these could be the last twelve living humans on the face of the planet. Most of these people don't capture our sympathy like the foursome who holed up in the shopping mall in \"Dawn\". Half of them are gung-ho soldiers who seem to take great pleasure in threatening the scientific team, and Romero spends much of the first half focusing on the bickering and intense conflicts between these people. In fact, for over an hour, the hordes of living dead get very little screen time, as the story focuses on the tension between the characters, and the efforts of an off-the-wall scientist to train a captured zombie named Bub to act human. Compared to its predecessors, this long section of the film may seem slow and talky, but it is always interesting and, for the most part, effectively performed by its unknown cast. Besides, it all eventually leads up to a corker of finale when the zombies finally invade the compound, and most of the humans become showcases for the brilliance of Tom Savini, who outdoes even himself in the gore F/X department.<br><br>While most of this material is very grim, \"Day\" ironically has the most hopeful, upbeat conclusion in the trilogy - which, alas, is its only major shortcoming. The quick transition to the final scene is so abrupt and unexpected that the audience feels cheated, leaving the impression that the production ran out of money before the whole climax could be filmed. Indeed, Romero has often expressed his unhappiness about being underfunded for this project, which prevented him from creating a truly definitive final chapter for the trilogy. But while \"Day of the Dead\" may not quite be the ultimate finish to one of the greatest trilogies of all time, it is still a very satisfying conclusion (at least until Romero gets funding for his long-rumoured \"Twilight of the Dead\"). It may not be popular among everyone, due to many unfair comparisons to its superior predecessors, but on its own, it is about as good as horror films get.","user":"Robin-97","rank":[140,180]},{"title":"Another zombie classic from Romero. Highly recommended!","rating":5,"date":"5 April 2004","review":"'Day Of The Dead' is one of the greatest sleepers in the history of horror movies. A flop when originally released almost twenty years ago, its reputation has slowly increased over the years, and now is generally regarded as a classic. I certainly underestimated it for a long time. In my opinion Romero's 'Night Of The Living Dead' and 'Dawn Of The Dead' are two of the greatest horror movies ever made, but I always thought that 'Day...' was a bit of a let down. But after watching it again for the first time in several years (via the highly recommended double disc \"special edition\" DVD) I must humbly eat my words. This is a GREAT movie! Romero and special effects Tom Savini do wonders on a limited budget, and the movie is full of suspense, a claustrophobic atmosphere and plenty of gore. It probably flopped the first time around because it's so bleak, but now that's one of its strengths. Interestingly Romero features a strong female protagonist (Lori Cardille) and a strong black supporting character (Terry Alexander), something not all that common in horror movies. Both actors give good performances, the soldiers led by Rhodes (Joseph Pilato) are all suitably ultra macho and deranged, and it was cool to see John Amplas ('Martin') in a supporting role, but the two stand out performances are by Richard Liberty ('The Crazies') as Dr. Logan (who the soldiers refer to as \"Frankenstein\"), and Howard Sherman as Bub, the zombie he has tamed. The sequences between Logan and Bub are just terrific and add a whole new level of pathos to the movie. The only negative comment I can make about 'Day Of The Dead' is that it brings home the depressing fact that George Romero hasn't made a truly outstanding movie in close to twenty years. I really hope he makes his long threatened fourth Dead movie 'Dead Reckoning' and that it turns out to be his masterpiece. But whatever happens he has already carved his name out in horror history as the creator of three classic zombie movies that just get better and better as the years go by.","user":"Infofreak","rank":[82,103]}]