[{"title":"One of Allen's best films and definitely his best performance...","rating":14,"date":"14 May 2004","review":"\"Hannah and Her Sisters\" is a comedy/drama (though mostly drama) about a dozen characters and their stories, all connecting back to three sisters: Hannah (Mia Farrow), Lee (Barbara Hershey) and Holly (Dianne Wiest).  Hannah is the favorite, talented and kind, Lee is almost equally favored, but Holly is the outcast, with a past of drugs and always asking for money.  Other characters include Hannah's hypochondriac ex-husband Mickey (Woody Allen), her current husband Elliot (Michael Caine), Lee's boyfriend Frederic (Max von Sydow) and Holly's friend April (Carrie Fisher).<br><br>Like I said before, this is not so much a comedy as it is a drama.  The comedy that's in it fits, and is good, but the drama is better.  Elliot's secret love for Lee is handled in a romantic way, but their infidelity is still seen as wrong, and you feel their guilt and inner turmoil.  Mickey thinks he has a brain tumor, he finds out he doesn't and then he feels worse, and starts desperately searching for a purpose to live.  All the other stories are equally dramatic, with comedy fittingly sprinkled in places too.<br><br>The acting is quite good, everyone playing their part perfectly, whether it's big or small.  The film's best performances come from Allen (in what's no doubt his best performance) and Dianne Wiest as the extremely under-confident youngest sister.  Allen and Wiest don't necessarily carry the film, as there's no need to, but their segments were certainly the best, for me at least.  The rest of the cast put forward too, especially Max von Sydow and Michael Caine in his first (and so far his only deserving) Oscar win.<br><br>Woody Allen's direction is at the top of its form here too, much like \"Annie Hall\" and his other greats.  The camera work and use of voice overs are excellent.  For instance, there is an intensely dramatic scene where the three sisters have lunch together and for the entire scene the camera rotates around the table, the speaker not always in the frame.  His script is great too, it knows when to be dramatic and when to be funny and when to be both.<br><br>One of Allen's very best, 8/10.","user":"NoArrow","rank":[61,70]},{"title":"perfect allen","rating":10,"date":"23 August 2005","review":"Very funny comedy has one of Woody's all time best casts. Dianne Wiest is the best; glowing, neurotic, irritating and vulnerable, within minutes. Michael Caine is the most touching, Mia Farrow, as always, close to heartbreaking. I think it's her voice that does it. Nice scenes with her and her real-life mother, Maureen O'Sullivan.<br><br>Like Manhattan, this picture looks beautiful; NY in all its many breath- taking colors. The relationships of everyone on the screen are perfectly woven, and Woody has the best sight gag of the film when he takes a bible and a crucifix out of a paper bag (to find religion), and follows them up with some Wonder Bread and mayonaisse. Hilarious!<br><br>Deserving of its writing and supporting actor Oscars, it's too bad everyone in the movie couldn't have won. They're all believable and enjoyable to watch. My favorite: Max Von Sydow as the very cynical, older Frederick. He should have had more moments. Imagine him at one of the Thanksgiving dinners...","user":"Movie_Man 500","rank":[45,53]},{"title":"Arguably Allen's Best Work....","rating":10,"date":"27 April 2004","review":"Hannah and Her Sisters (1986) Probably when all is said and done, my favorite Allen movie. This is definitely one of those examples where the sum is greater than the parts. Great shots of New York (specifically the city's architecture), great situations, great parties and great music<br><br>Among the Manhattan-dwelling characters is Michael Caine, who is married to Hannah (Mia Farrow) but lusts after her sister (Barbara Hershey) who lives with a tormented artist (Max Von Sydow.) Hannah's ex-husband (Woody Allen) starts dating her other sister (Diane Weist) who wants to date Sam Waterston, even though he'd rather date her friend (Carrie Fisher).<br><br>In addition to the cameo by Julia Louise Dreyfuss, the film features two supporting performances by old school actors, Lloyd Nolan and Mia Farrow's real life mom, the original Jane in the Tarzan movies, Maureen O'Sullivan.<br><br>If that's not enough, Allen throws in plenty of his trademark hypochondria hysteria, questioning the meaning of the universe and whether God exists.","user":"mrcaw1","rank":[89,110]}]