[{"title":"Thrilling and daring.","rating":9,"date":"20 February 2020","review":"Another Disney masterpiece. Excellent storyline, thrilling action, absolutely delightful, and the tune you can fly will bring a tear to your eye, but maybe the last part's just me. The only problem is, this is a Disney movie where some real sexist comments and stereotypes come out. However, it's an old movie, and people had a different way of thinking in 1953 than they do today. Overall, an absolute delight to watch, and a must see Disney classic!","user":"MR_Heraclius","rank":[38,39]},{"title":"Definitely one of Disney's best films","rating":10,"date":"23 November 2003","review":"Peter Pan is one of my all time favorite animated films, this is just such a great classic that doesn't get enough notice. This is one of those movies that is so memorable and I'm surprised that honestly this movie isn't in the top 250. Captain Hook is one of my favorite Disney villains if not my number one, he's just plain hilarious and great entertainment. It's odd that I voted more for him and his pirates, just that they seemed like they were the group that you would invite to a party. Watching this movie for so many years, since I was a child, the story still hasn't lost it's touch. It's such a wonderful movie that not only the family could get into, but even I'll just watch it on my own if I want a cute movie. This is one of the best Disney movies of all time and the story of Peter Pan is told so wonderful you can't help but fall in love with it as well.<br><br>In London, George and Mary Darling's preparations to attend a party are disrupted by the antics of the boys John and Michael, acting out a story about Peter Pan and the pirates, told to them by their older sister Wendy. The father angrily declares that Wendy has gotten too old to continue staying in the nursery with them, and it's time for her to grow up. That night they are visited in the nursery by a pixie named Tinker Bell and cocky Peter Pan, who teaches them to fly and takes them with him to the island of Never Land. A ship of pirates is anchored off Never Land, commanded by Captain Hook with his sidekick Mr Smee. Hook boldly plots to take revenge upon Peter Pan for cutting off his hand, but he trembles when the crocodile that ate it arrives. The crew's restlessness is interrupted by the arrival of Peter and the Darlings. The children easily evade them, and despite a trick by jealous Tinker Bell to have Wendy killed, they meet up with the Lost Boys, six lads in animal-costume pajamas who look to Peter as their leader. John and Michael set off with the Lost Boys to find the island's Indians, who instead capture them, believing them responsible for taking the chief's daughter Tiger Lily. Meanwhile, Peter takes Wendy to see the mermaids, where they see that Hook and Smee have captured Tiger Lily, to coerce her into revealing Peter's hideout. Peter and Wendy free her, and Peter is honored by the tribe. Hook then plots to take advantage of Tink's jealousy of Wendy, tricking her into revealing the location of Peter's lair. The pirates lie in wait and capture the Lost Boys and the Darlings as they exit, leaving behind a time bomb to kill Peter. <br><br>I'm always going to love Peter Pan, my sister and I still have so much fun with this movie, we constantly rehearse the scene of George, the father, screaming about how the family loves the dog more than him, it's a great scene. But still one scene that always gets me rolling on the floor laughing is when Peter Pan tells Captain Hook to scream in front of his crew and Peter's lost boys that he's a codfish, and you see everyone just cheer and make fun of Captain Hook as well as that blasted crocodile that won't leave him alone. This is such a great movie, if you haven't seen it, I highly recommend it, it's a fun film to watch and will always hold a great place in my heart. <br><br>10/10","user":"Smells_Like_Cheese","rank":[63,67]},{"title":"One Of The Great Animated Films Of The 50s","rating":10,"date":"25 March 2003","review":"If Walt Disney had never made another cartoon feature after BAMBI in 1942 he would still be remembered as the man who transformed the animated full length film into an art form. SNOW WHITE , PINOCCHIO , FANTASIA and BAMBI all belong on the list of the greatest achievements in American Film. Disney's next phase in full length animation took place after World War 2 and although these subsequent works may not match the brilliance and creativity of the earlier films, they still possess the superb craftsmanship the Disney artists are famous for. Missing from the new batch of films was the meticulous background detail that distinguished the earlier projects. Starting with Cinderella in 1950, the animators seemed to concentrate more on clean, uncluttered backgrounds but the drawing was just as professional as before , characters still brought to life with fluid, lifelike movements. Colors tended to be bright and splashy, but the cartoonists also knew when subtlety was called for, and scenes occurring at night were done with convincing atmosphere and shadows. The success of Cinderella confirmed that the movie-going public was still willing to be entertained and moved by a cartoon movie, and Disney and his artists forged ahead with an impressive array of animated features that to this day remain models of the Art Form. Perhaps the greatest of these was PETER PAN, first released in 1953. Based on J.M. Barrie's immortal play and novel about the little boy who doesn't want to grow up, PETER PAN had been a project stewing in Disney's mind for years. It wasn't until after the War that work on the film really took off. When the movie was completed and finally released to theaters, Disney seemed rather ambivalent about its achievement. He had a hard time defining who Peter actually was as a character but to millions of children in movie theaters all over the world, that didn't seem to matter. PETER PAN is not very deep story-wise. It lacks the heart and sentiment of the Barrie original, which to some degree is a good thing. Past stage versions and the spectacular 1924 Paramount film version could be cloyingly sentimental at times.<br><br>The Disney version is light and breezy and moves at a clip. The London sequence which opens the picture is spectacular in both the backdrops and the animation itself. When Peter, Wendy, John and Michael leap out of the Darling nursery window and fly over nighttime Edwardian London the viewer is treated to some of the most thrilling animation ever created for the movies. Later sections of the movie are equally enchanting, and the personage of the villainous Captain Hook is brought to great comic life by Disney animators and the marvelous vocal talent of Hans Conried. As with past Disney efforts, the song score is superb. \"Second Star to the Right\", \"You Can Fly\" and \"Your Mother and Mine\" are highlights in a tuneful soundtrack created by Sammy Cahn and Sammy Fain.<br><br>PETER PAN holds a special place in my heart. It was the first movie I ever saw. As a 4 year old sitting with my father in an ornate, red carpeted movie palace in Cincinnati, Ohio, looking up at that big screen watching Peter and his friends swooping and flying over the roofs and spires of London was an overwhelming experience. I was hooked, so to speak, and it is an image that has stayed with me ever since. This is the film that initiated my love affair with movies. PETER PAN is one of the iconic films of the Baby Boom Generation.","user":"mpofarrell","rank":[37,41]}]