[{"title":"One of the most tragic missed opportunities of all time...","rating":19,"date":"19 October 2001","review":"Look at the cast list of this film; try and name someone famous in late 1960s British comedy who is not there. It is not easy. This film had a huge comic talent to call on, a promising premiss, writers-a-go-go and the head-start of a fairly funny punning title. Where did they go wrong? Where did they go right?! Here is a question: into which of the 7 deadly sins would one normally put the notoriously leering Casanova Leslie Phillips? If you answered 'Gluttony' you are absolutely correct! He eats his way through a load of éclairs and has a heart attack. Spike Milligan's segment--Sloth--is probably the best overall, mainly because it is silent. However, director Graeme Stark has written quite a small masterpiece in 'Lust'--a more or less one man play with the sadly-missed Harry H Corbett. He plays the rather sad Ambrose Twombly (the fastest lighter on the Bakerloo). This is my favourite segment although it is clouded by a pathetic ending. It is worth watching this film; I think anyone would definitely enjoy it. But when it is over you will probably think, as I did, 'Why wasn't that funnier?'","user":"alaneobrien","rank":[20,23]},{"title":"From bad to brilliant","rating":3,"date":"14 May 2004","review":"Just watched this little known 1971 comedy film today, after purchasing it as a budget DVD title. Though I'd heard it was rubbish, the cast made me get it (Ian Carmichael, Spike Milligan, Harry Secombe, Harry H Corbett... basically every comedy actor in the early 70s makes an appearance).<br><br>It's a very lop-sided film. Basically, it's just 7 sketches, all padded out to about 15 minutes, strung together and placed under one banner, each one ostensibly about one of the 7 deadly sins.<br><br>We start with some very cheap looking animated stuff with a director and cameraman gaping at some footage of a naked woman (seen from behind), including an HILARIOUS bit where the woman turns around and the two animated characters cunningly place themselves between her unmentionable areas and the audience. You might be tempted to turn off the film now, though this brief intro is saved by one funny gag. The director (voiced fairly disastrously by Graham Stark throughout) says something like \"this has nothing to do with the film you are about to see, unless you count being a peeping Tom as one of:\" \"THE SEVEN MAGNIFICENT DEADLY SINS\"... \"which it isn't.\"<br><br>Yeah, written down it's rubbish, but it works quite well watching it. Anyway, wee little animated Stark gets chucked into a cinema and watches the credits of the film that are so small you can hardly read them - though from what I could see they were mostly played in reverse order. Hmm. We then actually start the film proper with the first segment:<br><br>\nAverice<br><br>Bruce Forsyth (!!!) is the chauffeur of an arrogant fat bloke. His boss loses a 50p coin down a drain, and Bruce is told to get it back. So begins a long, painfully drawn out and unfunny segment in which Bruce tramps around some sewers for a while, Bernard Bresslaw turns up to say a few lines, Joan Sims appears as a policewoman, and a fisherman pulls some young dolly girls. If you find Bruce walking off screen, followed by a \"WOAAAAAAHHHHH!\" and a splash sound effect amusing (and this joke is employed 3 times), you'll like this. If not, then, like me, you'll find yourself being distracted by a speck on the wall.<br><br>\nGreed<br><br>Geoffrey Bayldon and June Whitfield own a posh house. Harry Secombe and his wife, who apparently have won the pools or something, pull up in a car, where the wife tells Harry she wants the house, and that he should make the inhabitants an offer. When Bayldon naturally refuses, Harry is told to get the house - or else. It makes absolutely no sense, like many other segments of this film. It's also not very funny. Secombe tries gamely, but you can only go so far with the old \"are you going to let me have it?\" / cue bucket-of-water-thrown-in-the-face gag. He also attempts to disguise himself as different characters, all of whom sound exactly like Harry Secombe. Oh, and the ending is rubbish too. Mostly irredeemable.<br><br>\nGluttony<br><br>Thank God, it's Leslie Phillips! In a sketch called \"Gluttony\"! Surely this one will hark back to funnier, saucier works? Well, no, not really. Rather than play his usual sex-hound, Phillips plays a man who works for a health-food firm, but who loves to eat junk food. The sexy female vice-president invites him for dinner, which he is told by his doctor he cannot eat. Cue some slapstick which is so hard to work out it's not worth worrying about - I hadn't a clue what was supposed to be represented most of the time, though it somehow ends up with Phillips eating roast duck in a shower. Of course, this being Phillips, he gets seduced by the woman, but it's handled dreadfully (if you pardon the expression). Some innuendo so bad it would make the Carry On team whimper, and you've got possibly the most disappointing segment of the film, and certainly the worst thing Phillips has ever been in.<br><br>\nLust<br><br>It was around now that I felt like giving up, but persevered when I saw it was good old Harry H Corbett up next. And this segment is indeed pretty good - actually, from now on, each segment has some merit. This one is very simple - Harry is a fairly sexually frustrated bloke who wants a bird. He spends a while talking to himself, before popping down to pull a woman ... at the local London Underground station. Like you do.<br><br>Despite this fairly illogical set up, it's actually pretty funny - Harry H takes some fairly weak material and turns it into something golden, simply because he's Harry H. A bit where he mistakenly chats up Bill Pertwee on a train is the highlight of this segment. However, the last scene where he, using a phonebooth, chats up a woman in the very next booth becomes distinctly more uncomfortable the longer you watch it, with Harry coming across as someone you'd likely want to put away - until the last gag, which makes you feel sorry for him. A very uneven sketch, this one, which only just manages to succeed thanks to it's star.<br><br>\nPride<br><br>Ian Carmichael and Alfie Bass are driving their cars, down a one way road in the country, and meet each other up in the middle. Both refuse to back up. And so a battle of wills penned by the always fantastic Galton and Simpson (more remembered for their work with Tony Hancock) plays on. This sketch somewhat loses steam about halfway through, but there are enough twists and turns to keep you interested. Ian Carmichael is sublime at playing his usual toffee-nosed twit, and doesn't disappoint. There isn't much to really say about this one, besides the fact that it's good.<br><br>\nSloth<br><br>The best piece of the film, managing to be laugh out loud hilarious. It's by Spike Milligan, and is a silent movie composed of lots of rapidly cut scenes, in which characters are amusingly idle. On paper, this looks disastrous - it isn't. Lots off familiar faces turn up in it, including Spike himself, Marty Feldman, Peter Butterworth, Graham Stark, and Ronnie Barker. Most of the lines are very Goonish, and include Barker purchasing a walnut, which he can't open - so he asks a woman in front of him in the bus queue if she could place it in the road - \"A passing vehicle might break it open.\" Another theme has a man walking along a field and coming into contact with a tree. Rather than simply walk around it, he decides to wait till the tree falls down. It's all wonderfully silly, and well worth your time.<br><br>\nWrath<br><br>Two old men decided to kill off Blakey from \"On the Buses\". Utterly bizarre, this sketch succeeds in being amusing for the most part as it combines usual class-warfare humour with the utter inanity of it's premise - Ronald Frazer and friend feel victimised by the miserly Blakey, a park keeper. When they litter the park in protest, Blakey says something like \"I'll 'ave the law on you!\" to which Ronald a few seconds later responds \"We'll have to kill him.\" It's mad. There's a homage to \"Psycho\" in there, and all three characters are killed in an exploding public convenience. The two old chaps are sitting in a white cloudy void, and decide they can litter all they want. Blakey turns up and tells them to put it all in the bin.<br><br>\"We can do what we like! We're in Heaven.\"<br><br>\"Oh no you bloody well 'ain't!\"<br><br>The entire film ends with the two old men being made to pick up the paper with a pitchfork, whilst Blakey laughs at them like a loon whilst the screen goes red. Possibly the most enduring, and frighteningly macabre, image of the film.<br><br><br><br>So, all in all, a mixed bag. Only the last three sketches really work, with the one in the middle being OK, and the first three being terrible. The animated linking material with the animated Graham Stark is inane and grates quickly, and the whole thing ends with a twee 70s song. Overall, this film would probably get a 5/10 from me, though frankly I'm still too bewildered by the last sketch to think straight.","user":"The_Secretive_Bus","rank":[22,27]},{"title":"Se7en was funnier.","rating":3,"date":"30 July 2019","review":"Written by and starring a veritable who's who of '70s British comedy, one might reasonably expect The Magnificent Seven Deadly Sins to be a laugh riot from start to finish; nothing could be further from the truth. Of the seven skits on offer, five are embarrassingly unfunny and one is downright depressing. Only an absurd black-and-white spoof of silent movies succeeds in tickling the ribs, with plenty of walnut-based humour.<br><br>Being a product of the '70s, the film is unashamedly un-PC, with dolly birds in hot-pants aplenty, innuendo, and even a moment involving blackface (which is funny for all the wrong reasons). Things kick off with a tasty blonde bit of crumpet stripping off for the camera, supposedly because the girl is a friend of the director (who is presented as a horribly dated cartoon character courtesy of animator Bob Godfrey, best known for cartoon dog and cat, Roobarb and Custard). The animated film-maker then introduces the first of the seven stories...<br><br>Avarice stars TV gameshow legend Bruce Forsyth as chauffeur for a greedy businessman who demands that his driver retrieve a 50p coin that has fallen down a drain. Much of the humour is derived from Forsyth falling over in the sewer, which gives some idea of the level of sophistication at play. Didn't he do well? Well, no, actually.<br><br>The second story is even worse. Envy sees Harry Secombe as a henpecked husband ordered by his wife to buy her dream home (owned by Geoffrey Bayldon and June Whitfield), whatever it takes. The 'hilarity' includes Secombe having not one, but two, buckets of water thrown over him - it's that clever!<br><br>Up next is Gluttony, written by Barry Cryer and Graham Chapman, and starring Leslie 'Ding dong!' Phlllips as an advertising executive promoting a slimming biscuit, but who cannot help but tuck into junk food whenever he can. This is tedious stuff, only worth watching for sexy Julie Ege as vice president of the biscuit company, who, for some strange reason, has the hots for Phillips.<br><br>Number four is Lust: Harry H. Corbett plays a 38-year-old single man desperate to pull himself a bird. Rather than go to a club or pub, he hangs around a tube station and eyes up the talent, eventually settling for a girl who has been stood up by her date. While she is in a phone booth, wondering what to do, Harry pops into the next booth and rings her, chatting her up and asking if she would like to meet up. What happens next is not only not funny, but actually rather heart-rending. Corbett puts in a solid performance, but a side-splitter this is not.<br><br>Pride features Ian Carmichael and Alfie Bass as two stubborn drivers who meet halfway down a narrow country lane. With neither man willing to back up, the scene is set for laughs galore, but none arrive. What do arrive are an AA man and an RAC man, who add to the confusion, until a bobby turns up to settle the argument. Written by Galton and Simpson (Hancock's Half Hour, Steptoe and Son), but with little of their magic in evidence.<br><br>The sixth chapter is the best. A silent movie (complete with caption cards) written by and starring Spike Milligan, Sloth is sublime lunacy, featuring a cast of characters who will do anything to save themselves from effort, from a man who would rather wait for a tree to fall than walk around it, to Ronnie Barker sat down at a bus queue, asking the woman in front to help him open his walnut. This is nutty nonsense in more ways than one, and extremely funny.<br><br>It's a return to dreadful form for the final story, Wrath. Two old men on a park bench decide that they've had enough of the grouchy park keeper (played by Stephen Lewis, Blakey from On The Buses) and plot to kill him. Like a live-action Roadrunner/Wile. E. Coyote cartoon, none of their schemes go as planned, the pair eventually blowing themselves up in a public convenience (along with the park keeper, who continues to torment them in hell). It's a chuckle-free way to end what is a mostly disappointing movie, especially considering the talent involved.","user":"BA_Harrison","rank":[4,4]}]