[{"title":"Great Early Vehicle for Eddie Murphy","rating":22,"date":"22 June 2005","review":"This is probably one of the funniest films of the 1980's. It not only is a play on the classic nature vs. nurture theme, but it is also a somewhat comedic commentary on the \"greed is good\" decade of the 80's. However, it is also a nice bridging of the generations as it features two of the biggest stars to come from \"Saturday Night Live\" Eddie Murphy does a fine job as con man Billy Ray and Dan Ackroyd is great as Louis. Jamie Lee Curtis is also wonderful as Ophelia. In fact, it was good to see her do something other than the \"scream queen\" roles which she became famous for during the early part of her career. She definitely shows the comedic timing that she would display later in her career and would make her one of the finest comedic actresses in film today. However, the one that really steals it for me is Denholm Elliot as Coleman. He delivers a very low key performance that is befitting for that role. This is a real gem.","user":"Sargebri","rank":[81,87]},{"title":"Murphy and Aykroyd are Perfect!","rating":8,"date":"31 January 2002","review":"When it comes to great comic films, nobody recalls the magic between Murphy and Aykroyd in Trading Places. In the early 80's Eddie Murphy was considered the funniest black comedian next to Richard Pryor. Dan Aykroyd was one of the all time great cast members of Saturday Night Live. Both actors started on SNL and were ready to make their career in films. Trading Places is an example of a perfect comedy. It is funny yes, but there is so much more. With its story, the acting, and the political, racial, and economical plots in the film add to its greatness. One of the best comedies to come out of the 1980's, it stands as one of Eddie Murphy's best earlier films as well as Aykroyd's performances as a character actor. A wonderful and somewhat good family film. If you're that kind of family that is.","user":"caspian1978","rank":[57,62]},{"title":"Murphy and Aykroyd at their best","rating":7,"date":"11 December 2005","review":"Could this movie honestly have been any more funny? I saw it again, as I have repeatedly for years, and still laughed. My new son had never seen it before and liked it as well. Murphy was at the top of his game back then and Aykroyd is the perfect snob-class elitist. Some of these jokes are so timeless that I still refer to them from time-to-time and they STILL get laughs, both from people who have and haven't seen this film.<br><br>Yes, the jokes are a bit dated and somewhat slapstick, but this was a sign of the times. Most 80s comedies were full of slapstick moments. Jamie Lee Curtis was at the height of her sexy image and I'd forgotten how well she'd played her role. The late Don Ameche is so animated that it played perfectly into the mood of the film.<br><br>You can find this film in the bargain bin of most stores these days. I saw it for sale for only $5.50. It's worth owning.","user":"Cube_TX","rank":[74,83]}]