[{"title":"More than exploitation!","rating":7,"date":"16 June 2003","review":"As I watched this low budget film I came to realize that while it is exploitation, it's still a story of an angry man that deep down wanted respect from those close to him. The film starts out with a young kid in 1953 Harlem who makes money giving shoe shines and gets involved in a mob hit and is told to take a package to a building to a bad cop named McKinney (Art Lund). McKinney accuses the kid of stealing money from him and is beaten badly until he has a broken leg. Fast forward to the mid 60's and young Tommy Gibbs (Fred Williamson) is now a grown man and executes a mob hit on his own and tells a mafioso named Cardoza (Val Avery) that he's responsible and wants in with the mob and just wants to run an area in Harlem. He rises in power and has some important log books with all the information on important people on the take. He has a girl named Helen (Gloria Hendry) but doesn't have the sophistication to keep her. Finally the mob decides to get rid of him and now he's the target! This film was directed by Larry Cohen (It's Alive!) who is a veteran of low budget efforts and the film is benefited by his experience. The film is actually shot on location in Harlem and in several shots you can see people staring at the camera. Also, the Apollo Theater is seen as the camera pans the street. While this is another version of \"Little Caesar\" there is an aspect of the story that I found very well handled and it was the scenes where Tommy Gibbs is feeling betrayed and alone. One scene in particular that stands out is at his mothers funeral and he asks his father if he's all right. What adds to these scenes is the effective use of music that helps establish the mood of the film and these scenes in particular. The music is by James Brown and Barry DeVorzon. Even with limited funds and some poorly dubbed dialogue can't detract from the emotions in parts of this film. Fred Williamson is a former football player and his acting experience was very limited so his performance is even more impressive to watch. The guy has natural charisma on screen but he also shows that he can bare his emotions like any good actor. If you like these types of films than this is one of the classics of its genre. As much fun as it was to watch Williamson smear shoe polish on Lund and make him sing \"Mammy\" the film has more to offer than that. The scenes of Williamson's character feeling alone and betrayed along with the good music score are what make this film stand out from the others of its kind. Classic exploitation.","user":"rosscinema","rank":[20,25]},{"title":"The Rise and Fall of a Gangster","rating":6,"date":"9 November 2018","review":"In 1953, the delinquent teenager Tommy is raised in Harlem in a period of a racist American society. When he grows up, he becomes a hitman (Fred Williamson) working for the Italian mafia. When he steals accounting ledgers from the mafia, he becomes a powerful kingpin in Harlem, keeping the mobsters and the dirty police commissary McKinney (Art Lund) under his control. But his fall begins when he learns that his mistress Helen (Gloria Hendry) is betraying him with his best friend.<br><br>\"Black Caesar\" is an American action film by Larry Cohen, with the dramatic story of the rise and fall of a black gangster in Harlem. The plot may be dated in the present days, but in 1973 it was a full of action classic of blaxploitation. My vote is six.<br><br>Title (Brazil): \"O Chefão do Gueto\" (\"The Big Boss of the Ghetto\")","user":"claudio_carvalho","rank":[5,5]},{"title":"Larry Cohen plus Fred Williamson equals movie dynamite!","rating":12,"date":"12 April 2003","review":"'Black Caesar' is one of the most underrated movies of the early 70s blaxploitation boom. Fred \"the Hammer\" Williamson was one of the most charismatic and cool male stars of the period. Added to that writer/director Larry Cohen ('Q', 'The Stuff', 'Maniac Cop', 'It's Alive!, 'God Told Me To',etc.) and you've got yourself movie dynamite! This gritty rise and fall crime saga will not only appeal to fans of 'Superfly' and 'Coffy' but also to fans of 'Scarface', 'Goodfellas', 'The King Of New York' and even 'The Godfather' trilogy. Williamson plays Tommy Gibbs, a crippled ghetto kid who grows up with one thing in mind - revenge. He ingratiates himself with a local mobster Cardoza (Val Avery, 'The Anderson Tapes') then works his way up until one day he seizes power and becomes \"the black Godfather\". Along the way he uses and discards many people including his girlfriend Helen (Gloria Hendry, 'Black Belt Jones'), and creates many enemies, not least of which is corrupt cop McKinney (Art Lund, Junior Jackson's Dad in 'The Last American Hero'), a man he has a long history with. The supporting cast in this one is really strong and also includes Julius Harris ('Superfly') as Gibbs' estranged father and D'Urville Martin ('Dolemite') as his childhood friend, the now  Reverend Rufus. 'Black Caesar' is gritty, exciting and raw. Williamson's performance is unforgettable and the whole thing is brilliant entertainment. Highly recommended!","user":"Infofreak","rank":[10,13]}]