[{"title":"Nature as hell","rating":10,"date":"2 September 2006","review":"Excellent period film, story of survival in the bleak, bleak wilderness. Richard Harris plays a fur trapper in 1820s America who is left for dead by his expedition party after surviving a bear attack. Harris (amazingly) manages to keep himself alive and catch up with the hunting party. Minimal dialogue and action. More a mood piece than anything else, but a very effective one.<br><br>I really enjoyed \"Man in the Wilderness\". It's fairly obscure, and its easy to see why. It basically presents nature as hellish and threatening in every way. It also (wonder of wonders) presents the situation realistically. Most films that take place in the 1800s look terrifically groomed and contemporary, as if the stars had spent the day filming and the night relaxing in a jacuzzi. Not so here. This is grimy and gritty. Lots of gray and black and brown. Harris looks dirty and beat-up. I love it.<br><br>I also love all the scenes of the expedition members pulling that big, muddy boat all over creation.<br><br>A really good film. Highly recommended if you like films that attempt a certain realism - like robert altman's \"McCabe and Mrs. Miller\"","user":"tbyrne4","rank":[50,52]},{"title":"Savage Compassion","rating":10,"date":"5 December 2005","review":"Savage and unrelenting, but, compassionate and immensely rewarding tale of a fur trapper, near-fatally mauled by a bear, surviving to exact revenge upon those who left him for dead. A distant and withdrawn character, Zachary Bass (Harris), who through a series of ordeals, recalls both the tumultuous and neglected events in his life that he is now compelled to resurrect. His quest is both a harrowing and moving experience, with a sincere, thoughtful performance by the late Richard Harris.<br><br>\"Man in the Wilderness\" boasts breathtaking scenery, a memorable score, and supporting performances played with conviction, particularly by John Huston and Percy Herbert. While it might draw parallels with Harris' \"Horse\" trilogy, this role is a more complex characterisation, developed without the benefit of dialogue, but through actions, expressions and emotions.<br><br>I've read reviews of this film that claim that the movie is uninvolving and gratuitously violent, but nothing, in my opinion, could be further from the truth. If ever there was a character with whom you could empathise, and follow to a poignant (and satisfying) conclusion, Zachary Bass is that character. A metaphoric journey from his own personal \"wilderness\" to a state of self consciousness in both his existence, and purpose. If ever there was a movie that could depict the challenges that he would face, and intertwine them with the complex motivations for his desire to survive, \"Man in the Wilderness\" is that movie. A rare gem.","user":"Chase_Witherspoon","rank":[48,50]},{"title":"raw and gutsy","rating":2,"date":"2 November 2002","review":"I was very saddened to read that Richard Harris died. He was a very fine actor who left an outstanding body of work. Man In The Wilderness really showcases this remarkable actors talent. Its based on a true story about Hugh Glass (here called Zack Bass) a man on a trapping expedition torn apart by a bear and left for dead. He travels miles and miles to get revenge(Jim Bridger was one of the men who left him). I'm amazed this man lived after such a savage attack and being left to die. Bass did some unusual first aid on himself, he rolled in maggots so they would eat the dead flesh off his body. This film has got an outstanding opening score. Its one of the best I ever heard. Harris's challenge is that he doesn't have a lot of dialogue and has to act like he is crippled and in pain for most of the film. John Huston is also fine as the sinister leader of the expedition who leaves him for dead.","user":"dtucker86","rank":[33,35]}]