[{"title":"I actually Cried!","rating":10,"date":"20 October 2000","review":"When I saw this movie in the video store, I thought, \"Gee, this ought to be good for a few laughs.\" Well, I was right to some degree, since there is some humor in the movie, but I didn't count on the compelling story and even the fine performances. The movie is about a kid named David, who seems to have the perfect life. He has a loving family with a little brother who adores him, he is accepted to a great college, he is a musical director for the school's drama production, and his band just got the opportunity to record some of their songs. But he feels very pressured, and his best friend, played by Keanu Reeves, tries to get him to lighten up a little. What nobody knows is that David feels that he can't handle the pressure anymore. One night, at a party, David goes off to the cliffs by the ocean alone. Keanu follows, but when he goes to the area where David was just standing, David has disappeared, with nowhere he could have gone but down. Keanu's life starts going down the tubes, as he is the only one who knows that David didn't die in an accident, and that information is eating him up inside. When he finally tells David's parents, he thinks that things might start to go back to normal, but, suddenly, he is taking on the responsibilities that David has left behind, including writing the music for the band. The situation is at it's worst when Keanu is driving drunk and almost runs over David's little brother. As David's father is screaming at him for being so reckless, Keanu grabs him, starts hugging him, and, tearfully, says that he was David's best friend and should have been able to stop him. This scene literally brought me to tears, and I never would have thought that Keanu Reeves would ever be able to make me cry, even though I am a big fan of his. I think this is Keanu Reeves' best performance since \"River's Edge\". His portrayal of this character is basically the same as his portrayal of Ted Logan in the \"Bill and Ted\" movies, but with much more emotion and depth. The dramatic scenes, like when he throws a book through the principal's window, are done to perfection. He is completely believable as a confused teenager who suddenly finds himself alone without a best friend. The movie itself is an accurate reproduction of the effects of suicide on the people who are left behind: David's parents, brother, and friends. This is not a lighthearted film, but it is absorbing and actually makes you care about the characters. A definite must see.","user":"Romana-5","rank":[22,22]},{"title":"Remarkable film with a remarkable heartfelt performance by Keanu Reeves","rating":10,"date":"18 July 2003","review":"Long before there was The Matrix, before there was a Bill and Ted, Keanu Reeves starred in Permanent Record, a movie that inexplicably has gone unnoticed. Permanent Record is a wonderful, moving, touching film about how one deals with those tragedies in life that have no explanation, and no matter how much we ask Why?, we know there will never be an answer to that question.<br><br>If you have never seen this film, my recommendation would be that the first time you view it, you watch it cold without knowing anything about what is to take place.  That would mean not reading this review or any of the others posted here.  After you have watched the film you will understand.  The film begins as if you are watching any other film about teenagers, high school and their day to day lives.  The two main characters are Chris (Keanu Reeves) and David (brilliantly portrayed by Alan Boyce), who are good friends.  They play in a band together for which David is writing the music. David is a straight A student whom seems to have everything going for him. He is popular, he has been accepted into a major music college, he has a very loving, caring, wonderful set of parents (played by Barry Corbin and Kathy Baker), a younger brother who looks up to and admires him and a beautiful girl friend.  Yet, we begin to see little things that hint there is something wrong in David's life.  The first time you watch Permanent Record, like his family and friends, you may not even notice that things are not as perfect for David as they seem.  We see the signs, but we ignore them or overlook them.  <br><br>It is not long until one fateful night a tragedy occurs that will forever alter the way Chris along with his friends and classmates view their lives. We are there when it happens, along with Chris, yet like Chris, we don't actually see the event occur. At first, as Chris does also, we are sure it must have been an accident.  We soon find out it was not.  Instead David's family and friends are only left with questions   How could this happen when David seemed to have everything going for him?  Why did it happen?  Couldn't they have seen it coming?  Shouldn't they have been able to stop it from happening?  They are questions for which there will never be any answers, not for us not for them.  They must come to terms with what happens, without ever understanding.  In the end that is what Permanent Record is about. There are so many things that happen in life which will be beyond our understanding or reasoning.  We may look back angrily when we think about it, as Chris and his classmates surely will, as they learn their own lives are changed forever.<br><br>Keanu Reeves gives an emotional depth to his character that I have never seen him bring to any film since Permanent Record.  He has all the characteristics of a typical High Scool boy down, yet we are able to see the pain he is going through, and we feel it as much as he does.  Alan Boyce as David, plays him with such perfection, that even when he is no longer on the screen, that we miss him along with Chris, his parents and his classmates. <br><br>\nThe last five minutes of this film are five of the most poignant minutes I have experienced in any film.  It is a scene that touches at the very heart of this film.  Though we may never understand many of the tragedies that occur in life, we remember those we have lost and the things they brought to us while they were here.  Then, in the end, we must move on.  Sometimes there just are no answers.","user":"clydestuff","rank":[26,27]},{"title":"An excellent, worthwhile movie","rating":13,"date":"13 July 2003","review":"This movie was by far one of the best I've seen in quite some time. Keanu Reeves gives a very heart-felt performance while handling the things in the movie he has to handle. Also, there is some great singing in this movie. Jennifer Rubin's character sings a song at the end of the movie that I would love to be able to find. The singer, whether or not it truly is her, is terrific. The story line is serious, as is the movie, but anyone who wishes to see Keanu master his dramatic, sad role should definitely see this movie.","user":"Ms_Ada_Monroe","rank":[15,15]}]