[{"title":"The Most Complete of Vampire Films","rating":10,"date":"11 February 2001","review":"The vampire genre has seen its share of lackluster films. Indeed, the centerpiece of the grand tradition, the Dracula legend, has seen so many remakes and revisionist attempts that one would be hard pressed to find a version of the tale that is original in its telling. Dracula, like it or not, is a cornerstone of Western society. And it is wholly unfortunate that Bela Lugosi is considered THE Dracula (although Hammer fans may contend that Christopher Lee holds the title since he played the good Count over twenty times).<br><br>With Werner Herzog's \"Nosferatu: Phantom der Nacht\" (also known as \"Nosferatu: The Vampyre\"), the old Hollywood rules seem to have been thrown out the window in favor of F.W. Murnau's striking silent film, the 1922 masterpiece \"Nosferatu: Eine Symphonie der Grauens\" (\"Nosferatu: A Symphony of Terror\"). While many purists of the genre balk at the idea of favoring the Nosferatu tale over the time-tested Tod Browning and Terence Fisher entries, one must realize that the cape-clad widow's peak Count has been sullied by a thousand parodies over time, and is simply not a frightening entity any longer. This was a matter much pondered by Francis Ford Coppola when considering his adaptation. While Gary Oldman's portrayal was serviceable and definitely different, something key was lacking from the tale.<br><br>This is what Herzog and his long-time \"trouble and strife\" lead man Klaus Kinski found when they ventured upon the \"Nosferatu\" remake. Herzog shifted the attention of the viewer away from the plot, which acts mostly as a backdrop for the imagery, and made it so the primary intake becomes a visual one. Kinski's Dracula is not the scowling insect of the Murnau film. He portrays the Count in a way that no other actor has quite grasped. In this film, Dracula is a suffering being, loathing every moment of his curse's continuation. Of course, as the good Count himself states, \"Young men. You are like the villagers. and cannot place yourself in the soul of the hunter.\" The vampyre is trapped by his instincts, and Kinski's eyes betray harrowing madness (as they did in \"Aguirre, der Zorn Gottes\"), spiteful malice, and a sorrow so bottomless it defies description. It is as if the beast wishes to weep, but has forgotten how.<br><br>Filming on location in Germany, Herzog uses the same dreamlike camera angles, mixing them with a rich color palette and masterful lighting. There is a certain uneasiness that filters outward from the screen as you watch. As Jonathan Harker explores his surroundings during his lodging at Castle Dracula, there is inexplicably a young gypsy boy incessantly playing a scratchy violin under the archway. The surreality of the picture is only matched by its attention to the dark magic of the vampire. Like its predecessor, it actually seems to believe in the creatures, and respects them. It holds the legend, the plight of the people of Wismar, and the plight of the Count himself in deep reverence.<br><br>What can be extracted from the dialogue and plot is that this is not your average bloodsuckers extravaganza. In fact, the good Count only sets his fangs to the throat of the living once on screen, and when that occurs, it lends more of a feeling of sacrifice and sorrow than of terror. Indeed, the tone of the film is driven toward tragedy, and does not shift its course. One of the film's more telling moments is when Dracula, alone with Harker's beloved Lucy, ventures to plead with the beautiful lady, \"Will you come to me. become my ally? Bring salvation to your husband. and to me. The absence of love. is the most abject pain.\" When she refuses, he does not lash out or decide to make a meal of her then and there. He instead moans with the intonation of a wounded animal and slinks off into the night.<br><br>\"Nosferatu: Phantom der Nacht\" is the most complete of vampire films, and towers over the genre. It could be considered a pity that the only film that sits upon its coattails is its predecessor of the same name. Under Herzog's direction (wisely choosing to avoid remaking classic shots), we get an entirely different film that exudes an entirely different feeling. It not only maintains the eerie horror that the genre deserves, but also achieves a beauty and mystique that has been lost over the years. A must-see.","user":"kilgres_bloodmoon","rank":[147,165]},{"title":"Atmospheric, creepy and gorgeous","rating":10,"date":"28 September 2005","review":"Another classic collaboration of Werner Herzog and Klaus Kinski, Nosferatu is not just a remake of the F. W. Murnau silent classic, but an extension of it. Herzog not only develops the Stoker story more directly than the original did, but even reintroduces the original characters - Orlok becomes Dracula, and the Hutters become the Harkers. <br><br>Like many of the films involving Herzog and Kinski, Nosferatu is a period piece and creates the context of its plot through beautiful cinematography and a relentless but unhasty pace, not through the script. ThoughKinski dominates the screen just as he always does in these collaborations, the performances of fellow greats Isabelle Adjani and Bruno Ganz are also worthy of mention. Ganz's Jonathan Harker is certainly the most sympathetic character in the film, and Adjani's Lucy is beautiful, spooky, and just odd enough to fit the role perfectly.<br><br>Nosferatu is a retelling of the Dracula tale. Unlike its generally inferior competitors, Nosferatu - both the 1922 and 1979 versions - sticks very close to Bram Stoker's text - neither elaborating the focus on bloodsucking (obsessed upon by most American interpretations of Dracula), nor revising Jonathan Harker and Dr. Van Helsing as heroic characters, nor adding erotic or romantic elements to the depravity of the original concept. If you know what Stoker was about, you will thrill to the often forgotten aspects of Stoker's novel which are redeemed here - the plague rats, the gypsies, etc.<br><br>Kinki's intensity allows him to become a perfect Dracula. He understands his role perfectly and never once slips out of 'the hunter'. This is another very important aspect of the Stoker legend which has been sadly contorted by the popularization of the Dracula legend. Nosferatu's Count Dracula is not a charming eastern European gentleman with a quirky bloodsucking habit and a lovesick soul, he is a wily, terrifying, soulless, inhuman, obsessive, predator. And he has absolutely no concern for the affairs of Homo sapiens sapiens.<br><br>The film is mostly shot in Amsterdam's old city, which fits the mood of the film well. Other locations are in Germany, and Dracula's castle, for once, is an actual castle - even the interior shots! The wonderfully eerie and disorienting Popul Vuh soundtrack compliments the typically Herzogian picture-perfect visuals.<br><br>This is a great film for those seeking an accessible introduction to film-as-art, and the legendary collaborations of Herzog and Kinski. It will likely annoy those who think of Dracula as a good looking romantic guy with a nasty habit, but is highly recommended for fans of Stoker's original work.<br><br>.","user":"mstomaso","rank":[83,97]},{"title":"Beautiful","rating":10,"date":"11 December 2003","review":"Werner Herzog's remake of F. W. Murnau's classic film (the story for which Murnau stole without permission from Bram Stoker) is, thus far, my absolute favorite vampire film.  I've only ever met one other person who made this claim.  Everyone else said they were so bored by it that they either gave up on it or fell asleep in front of the TV.  <br><br>I can understand this, even if I don't like it. Herzog's film moves at the pace of a fever dream, lingering long on shots of misty mountains and majestic rivers that some (like myself) will find breathtakingly beautiful, and others will find stunningly dull.  This is a shame, but in these days of ten car chases, eight explosions and five sweaty sex scenes per film, I guess no one wants to appreciate the scenery as a main character anymore. Herzog has always had a knack for this, as anyone who has seen \"Aguirre, the Wrath of God\" well knows.<br><br>But, I digress. This version of Nosferatu, in places almost a frame for frame remake, is a masterpiece of homage.  The slow, somewhat exaggerated reactions of his characters brilliantly echo the performances given by the silent actors in the original film.  The landscape is moody and lovely and the sets are gorgeous, especially the phantom castle of The Count, haunted by memories and the strange ghost of a violin playing child.  Lovely, ice-white Isabelle Adjani is here as the good and virtuous Lucy (the name reversal of the female characters is rather inexplicable, but it doesn't really matter) floating through the film like a beautiful dream and never once weakening in her faith, even in the face of ultimate horror.  Bruno Ganz is somewhat stiff and unemotional, and one has to wonder why Lucy goes to such lengths to save this man who, for some reason, she loves with all her heart.  Only in his moments of sickness and fear does Ganz emerge from his emotional void.  But it is Klaus Kinski's incredible shadow that stretches over this film and swallows it whole.  <br><br>Kinski plays his rat-faced, bald headed vampire with perfection.  Yes, he complains about the loneliness of being undead, he laments his existence outside the realm of love and humanity, but he does it with a shrug instead of a whine, as if to say: \"Yeah, I'm pretty much screwed, but what're ya gonna do?\"  He brings to his role of Vampire what very few actors (aside from Gary Oldman) have been able to: sympathy.  He may hate what he has become, but he never apologizes for it.  He is the ultimate scavenger, feeding off the dead and hiding in the darkness.  Kinski's Count cannot even seduce.  He simply takes.  But his one scene with Isabelle is simply devastating, as he at long last reaches out to someone, hoping for love and salvation, and then quickly withdraws, the pain quite clear on his face, as he is sternly rejected.  <br><br>The ending seems rather rushed and not very well thought-out; a true downer which basically nullifies the film.  But the rest of the film is more than worth it, from the opening scenes of rotting mummies and bats flying in slow motion through to the muted spectacle of plague ridden madness as the dying dance in the streets to mournful background music.  If you're expecting lots of splattering blood and half dressed girls writhing on their beds, then forget about appreciating this movie.  You won't.  But if you have a taste for grown-up fairy tales and stunning visuals, see this film.","user":"Gafke","rank":[89,106]}]