[{"title":"Magnificent","rating":10,"date":"5 June 2004","review":"On a perfectly normal, lovely afternoon in the English countryside, a small town is suddenly taken over by an unseen presence. Everyone within the town - man, woman and child - suddenly passes out cold for no apparent reason whatsoever. Anyone who attempts to enter the town from the outside is also stricken down, yet revive instantaneously when removed from the danger zone. No one, not police or military, can pass the invisible barrier, but within a few hours the strange presence is gone. Everyone seems to be alright...until a few weeks later, when all of the women in town who are of childbearing age discover themselves to be pregnant. Nine months later, a dozen identical children are born to these somewhat suspicious mothers, children with white- blond hair and scary eyes that glow. The children are oddly emotionless and only associate with each other, acting as a single entity. Worst of all, they can make anyone do whatever they want them to do, which often has fatal results. Can kindly schoolteacher (the wonderful George Sanders), whose beloved wife has borne one of these creatures, help the alien children embrace their human half? Or will he have to destroy them all?<br><br>This is an absolute masterpiece of paranoia, sci-fi style. The acting is superb, especially by the late and under-appreciated Mr. Sanders, whose compassion and intellect sets the tone for this quiet and somewhat sad little tale. The lovely Barbara Shelley as Sanders loving wife is sweet and totally believable. Indeed, the townsfolk are all very realistic and approachable, kind and simple folk who don't really deserve the wrath of the spooky children who have invaded their small town. Young Martin Stephens, who also turned in a creepy performance in the ghostly masterpiece \"The Innocents\" is every bit as creepy here as George and Barbara's \"son.\" <br><br>Filmed in moody black and white, this movie creeps along with all the menacing stealth of a thick London pea souper. This is an intelligent horror film which deserves better attention. It probably won't be appreciated by people who consider expletives and explosions to be main characters, but for people who prefer horror with brains (and not brains ripped out of skulls) this is the film for them. Fans of George Sanders shouldn't miss this; it's quite a switch from his usual smarmy roles, and a nice switch at that.<br><br>Highly recommended!","user":"Gafke","rank":[90,101]},{"title":"Brick wall, brick wall","rating":3,"date":"3 October 2004","review":"This classic low budget, black and white film is right up there with the best of the sci-fi/horror movies of the time. It appears that it was shot on a very low budget ($300,000), thus no special effects beyond the superimposed glowing eyes of the children and the burning house at the end (not much of an effect). But it became a real moneymaker and a cult developed around it. They went on to make a sequel which doesn't live up to the original.<br><br>The cast, though limited, is quite good. The ever sophisticated, urbane, George Sanders as the scientist; Barbara Shelley from Hammer films as his wife; and little Martin Stephens as David, putative offspring of Shelley and Sanders. This kid is evil personified and does a bang-up job for such a youngster.<br><br>The story involves the village of Midwich and the birth of 12 children fathered in a very strange way that is never totally explained, who are intellectual giants with one purpose.....take over the world. Should they be destroyed or studied?....that's the problem facing Sanders and the government. Sanders comes to the inevitable conclusion and because they can read his thoughts, he must think of a brick wall in order to mask his intent. The ending, although not surprising is still effective.<br><br>This film is a keeper and is recommended to all those who like their films straight to the point without all the special effects and computer generated action. It's minimal with maximum punch.","user":"Bucs1960","rank":[64,71]},{"title":"Low-key and very effective sci-fi horror, made with intelligence and restraint","rating":7,"date":"7 December 2006","review":"The best way to watch this movie is ignorantly. Go to Netflix now, put the movie at the top of your queue and watch it when it arrives. Read about it later. If you enjoy sci-fi classics like \"The Day the Earth Stood Still\" and \"Them!\"; if you love the Britishness of the Hammer horror pictures; if you prefer a well-told story, rich suspense, sympathetic characters and black-and-white photography to special effects, color and gore, you will want to see this film right away.<br><br>The movie begins in Midwich. We meet the scientist Gordon Zellaby having a telephone conversation. Mid-sentence he passes out. At the same moment, every single person and animal in town has passed out just as suddenly; some unknown force has put all the inhabitants of Midwich to sleep. When the army gets involved, we discover this force has precise boundaries. One soldier, after being lassoed around the waist, walks past the boundary, loses consciousness and immediately revives when his fellows pull him out of the infected area. A few hours later, this strange force disappears and everyone wakes up. The mystery remains unsolved for weeks, but it has a sequel. All Midwich women of childbearing age are unaccountably pregnant.<br><br>Watching this science-fiction movie paired with almost any modern one demonstrates how storytelling has devolved as special effects have advanced. It also demonstrates how one simple effect can be more memorable than a thousand complex ones. I happened to see this just before watching \"The Forgotten\" (2005), a stupid movie with expensive effects; but not of those expensive effects is as potent as this movie's signature device. When the blonde-haired Midwich children wreak psychic havoc, the picture freezes and their eyes glow. That inexpensive trick shot is worth the millions blown on \"The Forgotten.\"<br><br>Another nice effect: George Sanders. He plays the hero, Gordon Zellaby, a scientist who becomes a dubious father to one of the Midwich freaks. Sanders plays rogues in almost every other movie, but here he is sweet-natured and convincingly so; he betrays not a shadow of his usual cynicism. Were this his only surviving film, one would think he was born to play kindly old men. The excellent cast has one other outstanding performance by Martin Stephens, who plays Sanders's cold-hearted \"son.\" Would you be surprised to learn his voice was dubbed by a female actress specializing in children? I was surprised to learn it wasn't. That is the boy's own eerily precise diction.<br><br>Special praise must also go to the director and photographer, Wolf Rilla and Geoffrey Faithful, who give the movie the detached air of a documentary. The script, credited to Stirling Silliphant, George Barclay and Rilla, is an excellent adaptation of a fine book, \"The Midwich Cuckoos\" by John Beynon Harris. Fans of this movie will want to read it. The book has many enjoyable details that were necessarily and wisely cut from the adaptation. To note one difference, the children in the movie are psychically linked: what one knows they all know. But in the book, the boys are psychically linked with the boys, the girls with the girls; but there is little or no link between the two sexes. The reasons for this are fascinating.<br><br>I haven't seen the John Carpenter remake, and I don't want to. What would the ideal remake of this film look like? It would look like the original: black-and-white, set in the late fifties, cast with Brits and scripted with the same restraint. Maybe modern resources could add a piquant touch or two; it would be amusing to see all those sheep fall asleep in the opening scene. Oh, and that awful model shot of the school could be replaced. Otherwise, we have the film we want, so why remake it?","user":"J. Spurlin","rank":[40,45]}]