[{"title":"A look at life in NY","rating":7,"date":"2 February 2010","review":"'Mean Streets', the earliest Scorsese film people have heard of, is the result of an on-form film maker, telling a personal story.<br><br>One thing to immediately note about 'Mean Streets' is the performance of our two leads, Harvey Keitel and Robert De Niro, both looking young and are full of energy. They deliver the goods, big time. They are both so watchable and make up at least half of the movie's appeal. In fact, 'Mean Streets' is an inherently watchable movie overall, helped by some fine dialogue and Scorsese's trademark energetic and involving camera-work. The main draw is the antics of the characters and their relationships rather than a high-stakes narrative. Dramatic things happen but don't relate intrinsically to the central plot: that of De Niro's character Johnny Boy, his debts to clubs, bars and old pals along with his long-suffering buddy Charlie (Keitel).<br><br>In comparison to other Scorsese films (which is inevitably going to happen if this is not your first Scorsese), it is very low on scale and as mentioned before, low on stakes. This is no gangster epic or psychological portrait but simply a 2 hour window into the streets of New York. It is certainly worth watching.","user":"innersmiff","rank":[41,44]},{"title":"Quintessential early Scorsese, and one of De Niro's most convincing and varied roles.","rating":23,"date":"23 September 2004","review":"The first time that Robert De Niro appears up-close in Martin Scorsese's Mean Streets is to the tune of the Rolling Stones' Jumpin' Jack Flash. It's from this point forward that the movie leaves the realm of being a 'good film' and becomes 'one of the greatest films of all time.' Simply put, the energy of Mean Streets is fantastic. De Niro's flamboyant entrance is one of many iconic moments in the film, which has influenced just about every crime film made since  for good reason.<br><br>And yet ironically Mean Streets is rarely acknowledged as the masterpiece that it is, perhaps because a number of people actually forget about it. Everyone remembers Taxi Driver, Raging Bull and GoodFellas in particular, but Scorsese's breakthrough remains one of his most important and honest pieces of work, given little recognition apart from the praise by movie critics who do remember it.<br><br>Harvey Keitel, giving one of his most realistic and three-dimensional performances of all-time, plays the lonely and worried Charlie, a 20-something New York City Catholic who is haunted by his friend, Johnny Boy (De Niro), the local loner who has to jump off the sides of streets in order to dodge the local Mafia thugs he owes money to.<br><br>Mean Streets has been accused of lacking a point, and one critic calls it 'too real,' but I'd take this over most recent films any day of the week. Mean Streets doesn't have a dynamic arc like most motion pictures do  sure, there's the rising action leading up to the climax, but it doesn't move from one frame to another trying to figure out the easiest way to end the movie while managing to stress all its points in such a manner so blatant that a four-year-old could pick up the themes.<br><br>It respects its audience enough to study its characters in such a way that they are given ten times as much depth as those seen in modern films released through Hollywood. As Johnny Boy, De Niro paints the ultimate portrait of a typical street loner  a dumb kid who 'borrows money from everyone and never pays them back.' Charlie, much smarter and wiser, takes Johnny under his wing and tries to help him get a job, so that he can pay back what he owes to a local kingpin. However, Johnny is so irresponsible and stupid that he doesn't show up for work and begins fighting with the mob  leading up to an inescapable conclusion that features some very ancient themes colliding together. It's the classic tale of redemption and escaping one's past, and if the film has a point it is that some people can't change and you'll get what's coming to you, even if you've got other people helping you out.<br><br>The film does have its technical flaws, such as poor dubbing, inconsistency, and the occasional goof. It's a raw movie, filmed on a low budget by a young and far more naïve Martin Scorsese. But all his typical elements are in place, to be expanded upon later in his career.<br><br>Keitel and De Niro are superb, particularly De Niro who shows great range very early on in his career. Almost unrecognizable in shabby clothing, hats and a scrawny figure to boot, this is a role that would typically be more suitable for Christopher Walken or other charismatic character actors  but De Niro pulls off the role with intense talent, proving once again that he can handle any type of role. He's known for his psychotic roles, but in Mean Streets, he plays the opposite of Travis Bickle. Johnny Boy isn't unstable or psychopathic  he's just wild and stupid.<br><br>Keitel channels all the thoughtful consciousness of an older child, considering Johnny Boy to be a brother of sorts. He feels that if he fails Johnny, he will somehow fail himself.<br><br>Mean Streets is a careful character study that never resorts to cardboard cutout caricatures or the standard clichés of the genre. Dialogue does not exist to move action forward towards the next adrenaline-packed sequence; Mean Streets focuses on its inhabitants with such strong emotional power that it's impossible not to be caught up in its grasp. A true classic from start to finish, and undeniably a very moving film.","user":"MovieAddict2016","rank":[180,223]},{"title":"Redemption on the Lower East Side","rating":3,"date":"3 May 2000","review":"Mean Streets has all the characteristics we have come to associate with Scorsese - the fluid camerawork, the expressionistic lighting, the sudden explosions of violence, the eclectic soundtrack.  In later films, he took cinema to new heights with the flowering of his technical skills and the broadening of his material, but Mean Streets remains unsurpassed for the emotional intensity which only a young director, passionate about film and intent on making a personal statement, could achieve.<br><br>The theme of the film is contained in the famous first line 'You don't make up for your sins in church; you do it in the streets' (a Scorsese voice-over).  An extended preface which delineates the nature of the film and its characters before the narrative begins includes brief cameo scenes introducing the four protagonists (a much copied device: see, for example, Trainspotting).<br><br>Scorsese's alter-ego is played as in the earlier 'Who's That Knocking At My Door?' by Harvey Keitel, giving the performance of his young life.  He is Charlie, a junior member of a Mafia family who collects debts and runs numbers, but who also has aspirations to sainthood. The other key figure is his anarchic friend, Johnny Boy, played with ferocious energy by de Niro.<br><br>Charlie is introduced coming out of confession, dissatisfied with his penance.  Reciting words doesn't mean anything to him and he can't believe that forgiveness could come so easily.  Deliberately burning his hand in a candle flame is a more effective reminder of the pain of hell.  The camera follows Charlie from the altar into Tony's bar, a red-lit inferno, and when Johnny Boy comes in, to the tune of Jumping Jack Flash, Charlie recognises that this is the form his penance will take.  Johnny Boy is the cross he must bear.  'You send me this, Lord' he says resignedly.<br><br>Johnny Boy's irresponsibility and impulsiveness make him everything Charlie, with his controlled, anxious, guilt-ridden persona, is not.  The argument which follows in the back room about Johnny Boy's debts deserves its reputation as one of the great scenes in seventies cinema.<br><br>Charlie's life moves in well worn, claustrophobic circles.  Hardly anyone outside his immediate circle appears in the film and other ethnic groups are viewed with suspicion.  The characters seldom appear outdoors or in daylight. Charlie inhabits a world of bars, pool halls and cinemas.  In the one scene he appears in sunlight, he looks ill at ease.  The suit and heavy overcoat he wears (reflecting his Mafiosi ambitions) look distinctly out of place on a beach.  It's significant that in this scene Teresa, his girlfriend, scorns his small-time gangsterism and challenges him to join her in moving away to a new life. But Charlie is trapped by his desire to please his uncle.<br><br>Scorsese has said that his choice in adolescence lay between becoming a priest and becoming a gangster and that he failed on both counts.  Mean Streets allows him to explore that choice to devastating effect.","user":"judy.dean","rank":[65,82]}]