[{"title":"An interesting Flick","rating":7,"date":"16 August 2006","review":"Maniac is one of those hard to define flicks. Although, it would seem easy to lump this into one category because of the subject matter, this is actually a hard movie to categorize. It is not really a horror film and not really a slasher. Sure, it has its typical slasher suspense scenes with the random girl running and hiding from the killer and the gory moments are all there, but, there is something about this movie that separates itself from most of the others of its genre. This, in my opinion, is typical of Tom Savini special effects flicks from the early 80's. The grittiness, disturbing nature of most of those films will never be duplicated. And I am not talking about flicks like \"Creepshow\" or \"Day of the Dead\" (although, that one is disturbing), I am talking about films like \"Friday the 13th\", \"The Prowler\", \"The Burning\", and \"Nightmare in a Damaged Brain\" (even though Savini said he never worked on that flick it certainly looks like his style).<br><br>Maniac is simply about a man named Frank (played very well by actor Joe Spinell) who was tormented by his mother when he was very young. As a result of this, he grew up to be a sick person who murders woman, scalps them, and uses their hair to nail on to a collection of mannequins. He ends up falling in love with a woman named Anna (Caroline Munro), and when he sees her he seems to be a normal fellow. This all leads up to an interesting climax.<br><br>Now, the storyline is rather simple but the movie is suspenseful enough to hold your interest. I will admit, the first 40 minutes were a bit slow, but once when the story starts going more into Franks behavior when he is by himself and then when he acts towards Anna, things start picking up.<br><br>Of course, Savini's gore scenes are excellent just like the rest of his stuff. We get to see Savini in the movie himself in a rather famous scene where he gets his brains splattered all over the inside of a car. Though, as a gore fan myself, this is definitely not the goriest flick I have seen. But after listening to the cast and director talk about the movie, I don't think it was meant to be. Joe Spinell himself said that the flick wasn't as violent as a Hershell Gordan Lewis film but was meant to be more realistic and shocking. So, when watching this movie it is important to know this instead of going into the movie expecting a real gore-fest.<br><br>I enjoyed this movie, but that is just me. Many people don't like this movie, but if you haven't seen it yet this is for you to decide. I just hope this review helps out. 7/10","user":"CMRKeyboadist","rank":[35,38]},{"title":"What's a good son to do???","rating":7,"date":"10 June 2005","review":"Poor Frank. <br><br>As a child, Momma was a mean hooker who used to lock him in the closet while she turned tricks. She loved those men and their money more than she ever did her own son. How's a sweet &amp; innocent child to recover? <br><br>Kill em all!! That's how!! <br><br>As an adult, Frank Zito now wanders the lonely streets of New York nightly, looking out for his next victim. Whether it' a hooker, a cheating spouse, a snooty model, or just someone out and about in the late night hour, Frank's M.O. is always the same : Kill em, Scalp em, take their head of hair home, and nail it onto one of the several female mannequins around his scummy apartment. <br><br>Good boy Frank! <br><br>Now Frankie doesn't have to be lonely anymore. He has a department store full of victims around his apartment, all to himself! They will never leave, and will be kept always by Frank. <br><br>This guy has a lot of heart, and it shows.<br><br>Maniac isn't the fastest paced movie, but it has some of the most awesome graphic violence that 80's horror produced (thank you Tom Savini!). The late Joe Spinell (who also co-wrote) is simply irresistible as Frank Zito. He's terrifying, childish, maniacal, and downright lovable as the crazed New York madman.<br><br>Maniac is gritty, dark, horrifying, and directed in many parts as a \"documentary\" film, allowing the viewer to see things through Franks eyes. You feel like your right along for the ride with this fine gent!<br><br>It's a beauty of a horror film, one not to be forgotten after the credits roll.","user":"Boggman","rank":[42,50]},{"title":"Excellent make-up FX and claustrophobic atmosphere.","rating":7,"date":"10 July 2002","review":"I'd first like to applaud Tom Savini for his work here; MANIAC contains some of the most realistic and unrestrained gore fx I've seen; possibly THE best up until the time of its release. Anyone who says that horror film make-up men (and women) don't deserve to be called artists is an idiot. Here you get explicitly bloody murders and scalpings, plus a show-stopper head-being-blown-off-with-shotgun murder and a man being ripped apart nightmare and it all looks pretty damn convincing to me.<br><br>Aside from the effects, director William Lustig does an OK job with color schemes (especially considering the budget) and the grimy, sleazy underbelly of New York is brilliantly exploited to give this film a truly nihilistic and seedy feel. The film itself, I thought, was scary, disturbing, intense and even suspenseful in parts (the subway sequence was especially well handled), which is how it should be. Reliable character actor Joe Spinell (from TAXI DRIVER, THE GODFATHER, etc.) also offers an effective performance as the sweaty, overweight, emotionally- scarred killer.<br><br>On the down side, a plot would have been nice and it's unforgivable to waste British actress Caroline Munro on such a poorly scripted nothing role. Her beauty, charm and smile light up the screen and could have been better harnessed to counteract the ugliness on hand. Anyway, the film at least provokes some kind of reaction from its audience. Seeing a few of my squeamish female friends appalled and horrified by the film made it well worth the watch to me!","user":"capkronos","rank":[25,29]}]