[{"title":"John Ford goes cops and robbers","rating":7,"date":"7 June 2000","review":"John Ford, the esteemed director, worked in many film genres but up until this film he had never done a Cops and Robbers movie.<br><br>In this one, he takes us on a \"typical\" day of a Scotland Yard Inspector in which we get a view of his private life as well as his professional.<br><br>In fact if Gideon's Day is \"typical\", what is dull?  Chief Inspector George Gideon catches a double murderer, a single murderer, a robber, suspends a crooked cop, and ends the day catching three men who break into a vault and murder the guard(not related to the other 2 murderers he catches).<br><br>John Ford who usually takes his time in telling a story, uses a much faster pace than he is accustomed to in most of his narratives.  And if it doesn't work to perfection in this film, it still is enjoyable due to some of the characterizations.<br><br>Jack Hawkins is perfectly British as Gideon.  He seems to be constantly in a dither, but in the end he is the consummate cop, tough, sensitive and smart.<br><br>Ford uses a large cast and many characters and they play off Hawkins as if they were on a lark.  T E B Clark's story has moments of comedy, drama and pathos.<br><br>Most critics consider \"Gideon's Day\"(or \"Gideon of Scotland Yard\" as it is known here) to be beneath the standards of one of the great directors in film history.  There is no question that this is true.  However, If you watch it as a straight cops and robbers film and forget that Ford was at the helm, this one is a pretty good one","user":"JB-12","rank":[21,22]},{"title":"A busy life in the day of Inspector Gideon of Scotland Yard...","rating":6,"date":"3 May 2007","review":"JOHN FORD seems a strange choice to be directing a British film starring JACK HAWKINS in the role of a very busy Scotland Yard inspector who has no time for anyone else in his domestic life as long as he's on the trail of various culprits. ANNA LEE is his patient wife at home who's more concerned with raising two children and cooking meals to pay much attention to her husband's urgent calls of duty.<br><br>It's a very fragmented kind of story-telling, more a series of vignettes featuring Hawkins in his role as detective, getting able assistance from JOHN LODER (Hedy Lamarr's ex-hubby during the '40s). He covers cases involving a psychotic killer, a hit and run murder and a bank robbery--with some wit and sardonic humor injected into all the proceedings by director Ford. DEREK BOND, ANDREW RAY and ANNA MASSEY (her film debut) round out the supporting cast.<br><br>Summing up: Above average thanks to some interesting, very flawed characters involved in crime and a brisk pace and brief running time that deserves praise in this day of films that go on and on forever, although the film was not a critical or commercial success.","user":"Doylenf","rank":[16,18]},{"title":"This is an overall excellent Irish production.","rating":8,"date":"20 March 2005","review":"This film is unique historically for more than one reason. It is the first - I believe only - cops and robbers film directed by John Ford. It is also unique because it is an Irish production. The 'Rising of the Moon' was an Irish production directed by John Ford. He made it clear that he would like to do another. The Irish Lord who had produced the 'Rising' read a book called Gideon's Day by an unknown writer called J.J.Merric. He loved the book, rang John Ford, and sent him a copy. When he negotiated buying the book it was discovered that J.J.Merric was in fact the famous John Creasey. Ford was captivated by the book, the deal was struck, and the wheels set in motion. In the film itself there is no indication that it is Irish other than Cyril Cusack being in it. It is the only Irish film made so far that does not have an Irish factor in its content. The world premier was in the Savoy Cinema in Dublin.","user":"ceadcara","rank":[25,30]}]