[{"title":"More triky bizness for Baker","rating":6,"date":"24 January 2018","review":"Notable actors: Carroll Baker! Jean Sorel!<br><br>I'm required by law to explain that the alternative title for this film is Paranoia, but that is the real title of Lenzi's other Giallo, Orgazmo, and that there's another Umberto Lenzi film called An Ideal Place to Kill too. Also, at least four Umberto Lenzi gialli star Carroll Baker, and additionally they are all generally of the 'bunch of people scheming against each other' plots rather than 'someone carving up Euro-babes' variety. Got that?<br><br>*Absolute silence from the rest of the Universe*<br><br>Right. This one starts off with Carroll Baker as a racing car driver who has some sort of brain fart while driving and ends up in hospital. Once discharged, she finds that she's been invited to the big fancy house of ex-husband/complete jerk playboy shag machine Jean Sorel, who previously mooched all of her money. Being a character in a film, she doesn't just throw the invite in the bin, but instead immediately packs her bags and drives off there.<br><br>Once there, Carroll realises that Jean has remarried an extremely rich lady who owns oil fields. It also turns out that this lady is the one who sent the invite - but for what reason? To play footsie with her under the table while Jean is doing the same thing? This lady, Constance, wants to be Carroll's new special friend, but is it for the usual giallo reasons (i.e slow motion lesbian sex scene)? Much discussion of how men are bastards ensues. <br><br>It's hard to write about these films without revealing the entire plot, and the twists are the highlights of the film, so let's be as vague as possible. There may or may not be a murder halfway through the film but a tremendous amount of obstacles suddenly present themselves that the killer (or killers) that they have to surmount to avoid being caught (that's if they murdered anyone, which they might have). Someone with a film camera may or may not have unwittingly filmed the murder which possibly leads to a hypothetical scene where everyone involved has to watch the film, plus there might even be the sudden appearance of someone else later in the film to throw a spanner in the works. Or perhaps not. <br><br>What I will reveal is that Umberto Lenzi further cements his position as the top animal killer of Italian cinema by having a scene set at a pigeon shooting club. It isn't enough that the guy would go out of his way to kill animals in his cannibal films, but here's a giallo that racks up a few pigeon deaths for the sake of a film. LEEENNNNZZZIIIII!!!!!<br><br>Just like his other late sixties Gialli, Lenzi has the whole film look amazing, keeps the camera angles fresh, but reigns in the psychedelics. He does include the old 'dancing in the club' scene that's a favourite from this particular era, including a band who wouldn't have looked out of place in the early nineties! <br><br>Slow to start, but as usual Lenzi proves he can tell the same story, with the same actors, a different way, and have everything and everyone look like an ad for a holiday villa.<br><br>And that's it - that's all the Carroll Baker gialli watched too, with the exception of some obscure psuedo-giallo called The Body from 1974. Carroll would later go on to star as the pushy mother of the bad guy in Big Arnie's Kindergarten Cop!","user":"Bezenby","rank":[6,7]},{"title":"A QUIET PLACE TO KILL (Umberto Lenzi, 1970) **","rating":5,"date":"31 August 2008","review":"To begin with, when I acquired this, I was under the impression it'd be the 1969 Lenzi/Carroll Baker giallo released in English-speaking countries as PARANOIA and originally given the lurid title ORGASMO; I watched that film, which was quite decent (and had a jaw-dropping final twist, to boot), during the 2004 Venice Film Festival  with the genial elderly director in attendance! <br><br>This one, then, was released in Italy as PARANOIA and, to confuse matters even more, its English title was very similar to the director's follow-up effort (and which I'll get to presently), UN POSTO IDEALE PER UCCIDERE  translating to AN IDEAL PLACE TO KILL  which was itself retitled OASIS OF FEAR for export purposes! For the record, Lenzi made eight giallos in all: none would perhaps rank among the genre's finest offerings  though, with this, I'm only half-way through them (having checked out KNIFE OF ICE [1972] and SPASMO [1974] as well, the latter also at Venice as part of a night-long marathon!). Anyway, the film turned out to be something of a disappointment: the plot recalls Henri Georges Clouzot's classic DIABOLIQUE (1955) but, given rather indifferent treatment, it's not particularly engaging in this case. Incidentally, both stars  Carroll Baker again and Jean Sorel  would appear in a number of giallos over the years: the two, in fact, had already made THE SWEET BODY OF DEBORAH (1968) together and, while the former would make four for Lenzi alone, the latter appeared (among others) in two of Lucio Fulci's best filmsone of which, ONE ON TOP OF THE OTHER aka PERVERSION STORY (1969), was also partly inspired by the aforementioned Clouzot thriller! Perhaps the most determining factors in PARANOIA's lack of stature are its positively underwhelming credentials (the film is an Italian/French/Spanish co-production); that said, the glossy look  particularly in the beautiful widescreen print I viewed  and Gregorio Garcia Segura's bouncy lounge score easily emerge as its most pleasing (and durable) assets.<br><br>After a fairly dreary first half, the narrative gets pretty complicated, though the many plot twists aren't exactly surprising: one I liked, however, was when the scheme of playboy Sorel's two wives to get rid of him backfires, he's quick to take matters into his own hands and dispose of the current spouse (which would leave him tremendously wealthy) there and then! Even so, a third woman enters the picture soon after  the daughter of the deceased (gorgeous if perennially sullen Marina Coffa) who, then, conspires with him to oust his ex (Baker) by elaborately framing her for Sorel's 'murder'! The frenzied climax, in fact, sees the distraught heroine's car plunging from a cliff (she's being chased by the police when Sorel's phantom suddenly 'haunts' her)  but Baker has the last laugh after all as, in the search to find his 'missing' body, the corpse of Sorel's second bride literally turns up to incriminate him! Mind you, the film's still quite watchable  as much for the reasons already stated as for Baker's frequent nude scenes","user":"Bunuel1976","rank":[9,17]},{"title":"Impressive visuals, merely OK thriller","rating":7,"date":"7 July 2011","review":"The other IMDb reviewers have done a fine job evaluating this Umberto Lenzi thriller, and I'll chime in with just a few comments.<br><br>With Joe D'Amato of all people as cameraman, this low-budget European B movie looks sumptuous, with excellent driving scenes (pegged to star Carroll Baker introduced as a race car driver) and consistently attractive Majorca locations befitting a jet set backdrop. The only crappy scene for me was the mandatory (and now dated/unwatchable) visit to a discotheque where Baker and many extras are shot in low angle montages attempting to do the frug and other dance steps.<br><br>While Lenzi dangles DIABOLIQUE as a red herring plot gimmick, the real ripoff here is from an equally distinguished source, René Clément's PURPLE NOON. Long one of my all-time favorites, that classic Patricia Highsmith movie presented the thriller format in sundrenched, always bright &amp; beautiful settings, probably the best such example of that approach since LEAVE HER TO HEAVEN in the '40s.<br><br>SPOILER ALERT: <br><br>Lenzi adopts the same against-the-grain (no Gothic or gloomy visuals) look and carefully imitates the key elements of PURPLE NOON's suspense. The murder takes place on a yacht, and the final twist of the film, the \"return of the repressed\" frisson moment, is identical, as the incriminating corpse is dredged up from Davy Jones Locker not as part of the official search but rather accidentally from another search instigated by the guilty parties.<br><br>Side note: In the '80s I was motion picture editor in NYC at Variety newspaper and I once asked our Rome correspondent Deborah Young about Italian directors' personalities, since she dealt with them on a one-to-one basis daily. She responded with a surprise for me, stating that Umberto Lenzi was the classiest of the lot, a true gentleman. Having been exposed in America to drive-in and 42nd St. showings of his often lurid and exploitation-oriented films I was surprised, but it was another lesson in the dangers of equating one's work (and its artifacts) with the creator's personal attributes.","user":"lor_","rank":[3,6]}]