[{"title":"Lots of Stop-Motion Fun!","rating":8,"date":"30 July 2005","review":"Fans of Ray Harryhausen's stop motion animation process will have a field day with JASON AND THE ARGONAUTS, which Harryhausen considered his best work. And certainly Harryhausen's special effects are the highlight of this film, which is generally based on the ancient Greek myth of Jason's search for the golden fleece.<br><br>The film as a whole is very much like a superior sword-and-sandal epic of the 1950s and 1960s, very colorful and over-run with manly men and beautiful dancing girls. A bit slow to start, once the story line is established the pace leaps forward--and we are treated to some of Harryhausen's most enjoyable creations, including Talos, the bronze statue; two of the most evil looking harpies you can imagine; a really nasty hydra; and Harryhausen's most famous (and his own personal favorite) bit of work: an attack by skeleton warriors.<br><br>In the wake of computer generated graphics, Harryhausen's work may strike some as dated, but this is actually part of its charm, for we will never see its like on screen again; it has a certain visual appeal not found in contemporary films, and Harryhausen's creations always have remarkable personality. On the downside, however, some of the film's other techniques have not aged as well, and the use of rearview projection is extremely noticeable (and often annoying) to the modern eye. Still, even those who aren't overly enthusiastic about these types of special effects will find the film an excellent choice as a \"family night\" film. As for Harryhausen fans--the film is a must-see, must-own, and must-watch as often as possible! Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[40,41]},{"title":"Good old fashioned fun!","rating":8,"date":"4 September 2005","review":"As entertainment this movie is perfect. The movie is a fun adventurous one, with lots of spectacular moments and fights. From a technical point of view this movie is even a masterpiece. The stop-motion scene's created by special effects pioneer Ray Harryhausen is simply brilliant and makes this movie one of the most influential and important one's, when it comes to special effects. But also the movie uses clever camera tricks and some well made miniatures. Yes, of course the effects all look out dated now but they still surprisingly, look convincing enough and at times they are even still simply breathtaking and spectacular to look at. Especially of course the legendary, fantastic end fight against the skeleton warriors.<br><br>The story is like good entertainment should be; Adventurous, exciting and simple to follow. The movie truly is none stop fun entertainment to watch with lots of spectacular moments with the legendary skeleton fight as the ultimate highlight. You don't have to be a fan of 'classic' movies in order to enjoy this movie, everyone should be able to appreciate this movie and be entertained by it, especially when you are a fan of ancient Greek tales.<br><br>Something that is not praised enough of this movie is the musical score by Bernard Herrmann.<br><br>The movie is not exactly filled with impressive and memorable actors. As many movies as I have seen in my life, I don't think I have ever seen any actors from this movie in any other movie, with the exception of course of Honor Blackman who will always be remembered for playing the Bond girl Pussy Galore in \"Goldfinger\". But this movie clearly isn't a character-adventure movie, it's a special effect adventure movie. The special effects are really the most important element of the movie. So for the fans of special effects this is especially most definitely a must see.<br><br>A movie that should be fun and enjoyable to everyone, of all ages.<br><br>8/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[55,62]},{"title":"A Fine Fine Movie","rating":8,"date":"29 December 2004","review":"What do I like about this movie...besides Harryhausin's special effects? Besides the frenetic battle with the skeletons and the seemingly hopeless fight against the statue of Talos? I like the way the people are presented, I suppose...<br><br>Heracles is presented, not as a young ripped body builder, but as one would expect a middle-aged strong man to be: Formidable, a little grey and a little swaggering. Argos, the ship builder, is tan and fat, as one would expect the veteran of many sea voyages to be. The crew looks like what one would expect a crew of ancient greeks to look like.<br><br>The acting is not spectacular, but sincere. No one looks embarrassed to be in this movie. It is tight with great special effects...wonderful for children...<br><br>And, I must mention Hera, normally portrayed as a matronly and vindictive woman, is here presented as a beautiful and helpful goddess by Honor Blackman, no less. Although many of you may be more familiar with her as Pussy Galore from Goldfinger...","user":"masercot","rank":[47,53]}]