[{"title":"Good movie, bad DVD","rating":8,"date":"22 May 2004","review":"Death Rides a Horse is one that Spaghetti Western fans (and fans of Lee Van Cleef) would thoroughly enjoy. The FILM is most watchable (read below about the DVD and possible hopes for a Region 1 letterbox DVD release), and Van Cleef is at his best in this one, playing a thug who is betrayed by his com padres. We usually see him playing the ultimate bad guy in most of his films, with his knife-deep stare filling the screen. At times, though, Van Cleef exposes his compassionate side for just a tease, and then just as quickly masks his inner humanity behind The Stare, as he plays Ryan, who arm-wrestles throughout the movie with stubborn youngster Bill (John Phillip Law), who has forsaken his lady and his life by embracing only revenge - and a single spur - after watching his father murdered, only to then bear witness to his mother and older sister brutalized at the hands of an out-of-control gang, greedy for gold. <br><br>The match-up between Ryan and Bill is one that plays itself out quite well, as Ryan acts as surrogate father, dishing out advice through some memorable quotes, teaching young Bill with his words and actions. Bill's anger is worn heavily on his sleeve, while Ryan steadily and calmly works out his own dishes of revenge, suppressing his anger even better than his empathy for Bill, which he touches on even as the pair first meet. Phillip Law was okay, but not thoroughly convincing as a bitter young man who witnessed his family's killing. Every once in a while, he might could have done just another take or two, but it's an easy pill to swallow since Van Cleef balances him out.<br><br>I wouldn't want to go deeper into reviewing the movie, except that there's a nice plot twist somewhere inside the film. Many of the actors seen in this 1968 film have been in films by the great Sergio Leone. It seems that there was a core of actors who performed in a number of Italian Westerns, and for good reason: the chemistry was there. Add a good dose of Ennio Morricone film scores, and you have the potential for a quite watchable film. Most spaghetti's would be overcooked and unpalatable if not for Morricone music, which acts as an unseen, yet incredibly talented main character. <br><br>Once in a while, the dialog (like Bill's off-balance delivery: \"I'll find out who he is. If he is who I think he is...get ready to get mad\") detracts from the slow and steady pace of Death Rides a Horse (that line makes me want to Kill Bill, myself), but the overall storyline works well enough to entertain Spaghetti Western fans. There are very few plot holes to pick at in the film, which has an air of dread or darkness throughout much of its length. A lighter moment always seems to pop in just when the viewer might like to come up for air (like a character who offers Bill a kiss). <br><br>For those concerned about bad or unbelievable endings, Death Rides delivers without disappointment. <br><br>Now, for the DVD: Sadly, there seems to be no Region 1 release that does this nice yet overlooked film, justice. Mine, which is a 2-4-1 DVD with \"God's Gun\" on the same side, and \"Quality\" as the title logo, is horribly lacking in everything but bad quality, perhaps one of the worst DVD productions I have EVER seen. The letterboxed original, cropped to pan/scan, suffers from multi-generational degradation of image quality. <br><br>One particular scene that makes the argument to respect the director's intent by preserving a film's original screen aspect ratio is the card game between Bill and Burt Cavanaugh (Anthony Dawson). Watch as the camera pans the players. Terrible cuts were placed into the scene at the card table as the camera panned the players, in order to preserve timing since the film transfer is a TV format crop from letterbox. It's an unforgivable way to present such a scene, which can lead the viewer to believe that it was the fault of a lazy film editor, or an incompetent director . I can't wait to see the film in its original format.<br><br>There is not one frame in my DVD that has any kind of decent image quality with respect to color, tone, or saturation. Its terribly washed out and either too contrasty and bright, or too muddy and dark, and neither extreme results in any texture. And in some scenes, the image degrades to a pixelated mess, which you'll see in the opening scene, and it returns of and on throughout the presentation. The only reason I watch it again and again is to enjoy the Morricone tracks and view an entertaining film. MGM has released a PAL-Region 2 DVD, and subsequent DVD reviews suggest that they finally did \"Death Rides a Horse\" justice. It has the original letterbox (2.35:1) and infinitely better video quality. Search online for some businesses in the UK as I will, and once I get it, I'll burn my copy and play it in my region-free DVD player.","user":"EyeDunno","rank":[49,51]},{"title":"Powerful","rating":7,"date":"27 October 2003","review":"From the stark opening, director Giulio Petroni lets us know that he is going to take us on an interesting ride. The sequence for which we watch through Bill's eyes as his family is brutalized and murdered is one of the most disturbing ten minutes ever put on film.<br><br>Even more stunning is the sequence for which there is jump cut from Bill as a child after the carnage to Bill as an adult, as a living killing machine. It plays like a version of THE TERMINATOR if it was set in the 19th Century American West.<br><br>What progresses from there is a very interesting revenge film, loosely patterned like POINT BLANK (1967) where Bill is the wild card in the middle of Ryan's quest for vengeance.(Watch both films....Van Cleef and Marvin's characters function the same way....\"All I want is $15,000...nothing more, nothing less...)<br><br>What I found the most interesting is the way Petroni chose to photograph the three sections of the film. They are all visually distinct and this change seems to map the character's journey through out the film, that being Bill's progression from a traumatized child to a hate-filled adult on the road to hell.<br><br>My only complaint is the quality of the prints.<br><br>I hope MGM manages to track down a decent negative and have this film restored.<br><br>It deserves it.","user":"Ramon_Rojo","rank":[28,29]},{"title":"Far from ordinary.","rating":8,"date":"20 August 2005","review":"When Bill (John Phillip Law) was a young child he witnesses a gang kill his father, and rape and kill his mother and sister, while he was spared. Now Bill is a young man who is now intent on exacting revenge on those who were responsible for killing his family. He also meets a gunslinger/ex-con Ryan (Lee Van Cleef) who has just been released from jail and who's out to even the score with those exact outlaws, which betrayed him. So, now the two, tussle with each other to see who'll get to them first, but with the time they spend with each other, Bill also learns some valuable tips from Ryan.<br><br>As a kid growing up I loved my Westerns, but they had to be Cowboys and Indians, if there were no Indians, I just didn't give a damn. But how have times changed. I have just started to get back into the genre (and no, I don't care if there ain't no Indians), and lately the spaghetti western sub-genre. I'm a big fan of Sergio Leone' s Dollar films, which people say are the catalyst for spaghetti westerns. I didn't know anything of this film and probably wouldn't have paid much attention to it, but since I read some positive comments about it on a thread (in the horror board, of all places), I thought it would definitely be worth a look. But, I didn't have to go out of my way to find it, as it pop up on TV a week or two later. Anyhow, I've babbled enough about my personal experience, back to the film.<br><br>What gripping stuff! It surly was better, than I expected. A lively spaghetti western that had plenty of surprises along the way and it just wasn't a shoot-'em-up story with plenty of violence, but the cleverly laid out plot, builds on the revenge tale with some mystery and panache and kept the violence within the story's limits. Everything comes together rather perfectly with such a dark and macabre opening to its fitting finale. The story did kind of reminded me off Leone's \"For A Few Dollars More\", which Luciano Vincenzoni who penned this film, was also co-writer in the last two Dollar films. As for the script, there is lot spite, wit, but also it was rather standard and stiff dialogue. There probably could've been a bit more flair, especially from American actor John Phillip Law who was basically dead as wood in delivery and probably the film's weakest point. But the same can't be said of legendary actor Lee Van Cleef's performance. He brought a hard-boiled character that also added some dry humour and sizzling skills that ideally fitted in the overall tone. Combination between Cleef and Law goes down quite well and adds another dimension into the film (father and son figure). The rest (especially, the villains) gave your usual mean performances. Though, throughout the film, those Mexican outlaws seem to find the funny side of things, out of really nothing. I just find it rather amusing, especially because of the irony of it all. Ennio Morricone (also from the Dollar films) came up with a standout music score, which mixed some soothing Mexican music with an uplifting and rousing western score. The camera-work isn't that potent, but it still gets some flashy treatment. With its sharp and encroaching shots. It also captured the vastly desolated landscape that sprawls on the screen. Direction by Giulio Petroni keeps the film grounded and keeps a rather brisk pace. He creates some well-designed shootouts and sequences. One being the eerie opening and another an explosive showdown amongst an empty town during a dust storm. By the way, it's a great title isn't it? <br><br>A must-see for any Western or Lee Van Cleef fan.","user":"lost-in-limbo","rank":[23,24]}]