[{"title":"\"Let's go.\"","rating":10,"date":"16 March 2006","review":"There comes a point at which every man reaches the end of the road and is forced to make a decision. Fade away, or go out in a blaze of glory. It goes without saying that the main characters of this film chose the latter. Sam Peckinpah's classic western is the tale of a gang of outlaws who see the world they know slipping away all around them. Scores are getting more dangerous. Technology is making killing too easy. Still they fight on, because they simply wouldn't have it any other way.<br><br>William Holden plays a man named Pike Bishop. He and his gang of outlaws hit banks, trains, you name it. They stick together no matter how thick things get. After a failed attempt at a bank robbery in which nearly an entire town is gunned down, the gang sets out to steal a shipment of new guns from the US Army and sell them to a Mexican general. But this will not be an easy score. Not only will they have to fend of US soldiers, but the railroad has hired a former member of their gang named Deke Thornton and a bunch of sloppy bounty hunters to stop them. Also, the Mexican general is a dangerous man with hundreds of men at his disposal. Pancho Villa and his army are also in the area. Bullets are going to fly, and fly they do.<br><br>From the opening shot of children torturing a couple scorpions to death by feeding them to a colony of ants, this film makes its point very thoroughly about violence. In this shot we see efficient killers overwhelmed by an army of a weaker species of animal. The scorpions are a metaphor for Pike and his gang. Outnumbered at every turn, they are still a handful for those who would try to hunt them down.<br><br>Pike and his men are able to pull off the score and deliver the guns to the general. But they don't go riding off happily into the sunset like the heroes of a traditional western. Their story could never end that way. Knowing that their way of life is coming to an end, and knowing that one of the gang is being tortured by the general, Pike calls the remaining members together. \"Let's go,\" he simply tells them. Each man knows what this means. They grab every gun they own and all the ammunition they can carry. Then they take a nice stroll down the main street of the general's compound to pay him and his army a little visit. The resulting gun battle has to be seen to be believed.<br><br>Once the shooting stops, there is an odd; sad feeling that settles over the compound. The bounty hunters show up when the vultures do. The sight of his former companions' dead bodies slumped over the backs of horses is too much for Thornton to bear. You know he would have rather been there by their side during the battle, and now he cannot bring himself to claim the reward for their hides. He simply sits down in the dirt as the survivors of the compound quietly file out and an ominous wind begins blowing through the dusty streets. Moments later it's his turn to make a choice. You can't help but feel he made the right one.<br><br>The Wild Bunch is an incredible film. If ever a film was ahead of it's time, this is it. See it! 10 of 10 stars.<br><br>The Hound.","user":"TOMASBBloodhound","rank":[79,85]},{"title":"Brutal and elegiac masterpiece.","rating":10,"date":"4 March 2008","review":"Outlaws led by Pike Bishop on the Mexican/U.S. frontier face not only the passing of time, but bounty hunters (led by former partner of Pike, Deke Thornton) and the Mexican army as well.<br><br>In 1969 Sam Peckinpah picked up the torch that Arthur Penn lit with 1967's \"Bonnie &amp; Clyde\", and literally poured gasoline on it to impact on cinema to the point that the shock wave is still being felt today. The death of the \"Motion Picture Production Code\" in 1967 ushered in a new era for cinema goers, it was a time for brave and intelligent directors to step up to the plate to deliver stark and emotive thunder, and with \"The Wild Bunch\", director Sam Peckinpah achieved this by the shed load.<br><br>The Wild Bunch doesn't set out to be liked, it is a harsh eye opening perception of the Western genre, this is the other side of the coin to the millions of Westerns that whoop and holler as the hero gets the girl and rides off into the sunset. Peckinpah's piece is thematically harsh and sad for the protagonists, for these are men out of their time, this is a despicable group of men, driven by greed and cynicism, they think of nothing to selling arms to a vile amoral army across the border.<br><br>The film opens with a glorious credit sequence as we witness \"The Bunch\" riding into town, the picture freeze frames in black &amp; white for each credit offering, from here on in we know that we are to witness something different, and yes, something very special. The film is book-ended by ferocious bloody carnage, and sandwiched in the middle is an equally brilliant train robbery and a slow-mo bridge destruction of high quality. Yet the impact of these sequences are only enhanced because the quality of the writing is so good (Walon Green and Roy N. Sickner alongside Peckinpah).<br><br>There's no pointless discussions or scene filling explanations of the obvious. Each passage, in each segment, is thought through to gain credibility for the shattering and bloody climax. There is of course one massive and intriguing question that hangs over the film - just how did Peckinpah make such low moral men appear as heroes, as the \"four outlaws of the apocalypse\" stroll into town, their fate to them already known?. Well I'm not here to tell you that because you need to witness the film in its entirety for yourself. But it's merely one cheeky point of note in a truly majestic piece of work. A film that even today stands up as one of the greatest American films ever made. 10/10","user":"hitchcockthelegend","rank":[59,63]},{"title":"Still Savage, Still Bloody, Still Great","rating":8,"date":"27 November 2004","review":"\"The Wild Bunch\" is one of those movies people don't agree on, even those that agree it's great. It's definitely complex, entertaining in a disturbing way, and manages to be at once nihilistic and moralistic, not an easy trick, especially for a cowboy film.<br><br>The first problem we have to deal with when watching this film is the fact there's very quickly a gunfight going on and, against all movie convention, no one to root for. There's an all-star cast on one side, including William Holden, Ernest Borgnine, Ben Johnson, and Warren Oates, but against all expectation, they turn out to be a pretty black crew. About the first thing out of Holden's mouth, said about a cowed group of innocents, is \"If they move, kill 'em,\" and before the battle is over, we've seen him and his team commit all sorts of savagery. About the only reason we don't immediately see them as evil is that the people they battle are no better.<br><br>Over time, we are encouraged to find something of value in Holden's Pike Bishop and his ruthless confederates, as they ride away, lick their wounds, and try to figure out how to get something else going, anything. The only problem is its 1913 and these outlaws are running out of time and options. \"I'd like to make one good score and back off,\" is how Pike says it, to which Borgnine's faithful buddy Dutch exclaims: \"Back off to what?!\"<br><br>Chasing the bunch, and offering the viewer the film's one sympathetic character, is Robert Ryan as Deke Thornton, a former partner of Pike's who doesn't want to go back to jail and for whom killing the bunch is the one unpleasant means of securing his freedom. Ryan, who died in 1973, is probably not as recognizable as the other leads today, but he lends a sad, elegiac presence to his on-screen moments that give the film much of its grace and warmth.<br><br>The final star is director Sam Peckinpah, who made a truly revolutionary film that not only pushed the art of film forward but holds up today as a cinematic experience. Time has been kind to this film in a way it hasn't to other ground-breaking auteur moments from the same era, like \"MASH\" and \"Easy Rider.\" When \"The Wild Bunch\" came out just as the 1960s were ending, people were truly shocked by the violence and cruel characters. Today, of course, such things are so common, and so mindlessly celebrated, that we find ourselves admiring what Peckinpah does for the surprisingly subtle and restrained way he goes about presenting us with mayhem and carnage, and his refusal to glorify it, however exciting and entertaining the overall package.<br><br>Surprisingly for a director who had trouble getting work at the time, Peckinpah landed three Oscar winners in the cast, and a fourth, Ben Johnson, who'd win his a couple of years later. Obviously, the acting is strong, each player investing his spare lines with the right degree of space and spirit, but it's probably worked even better that the movie game in 1969 was in the process of passing the fuddy-duddy likes of Holden, Borgnine, and Edmond O'Brien behind. This makes them very believable as a group of hard-nosed has-beens. In that light, it's kind of cool how hip this film so quickly became when it was released.<br><br>It's such a good film it's easy to overlook minor weaknesses. There's a nice bit of symbolism in the beginning, now famous, where the gang rides past a group of children tormenting scorpions and ants, but the point, once made, is beaten into the ground. There are some bits of convenience that stick out, like when a gunned-down outlaw rises and mows down his attackers with a few too-precise shotgun blasts. The general dislikeability of just about everything and everybody does feel a bit of a weight after a couple of viewings.<br><br>But what's great is just awesome, especially that opening sequence and the final showdown at Bloody Porch. Such terrific punch-drunk ambiance, it's almost a shame to watch it sober. The feeling of a new era coming upon us, which we see in everything from the doughboy uniforms at the outset to the car General Mapache rides around in, is redoubled by the glorious splendor, even clarity of this picture. Is it too much to praise a movie for the quality of the film stock itself? This is a paradox film, one about obsolescence and growing old that remains startling new-looking and fresh 35 years on.","user":"slokes","rank":[98,121]}]