[{"title":"Randolph Scott's Finest Hour.","rating":8,"date":"9 February 2010","review":"Columbia Picture's THE TALL T is one of the great westerns of the fifties! It is also one of the best westerns Randolph Scott would appear in under the banner of \"Ranown\" his jointly owned production company which he headed with his partner Harry Joe Brown. Not only that but it is arguably the best of Scott's westerns to be directed by his favourite director and friend Budd Boetticher. Beautifully photographed in Technicolor by the great Charles Lawton Jr. it boasts a superb screenplay by Burt Kennedy which derived from a story by Elmore Leonard. This, together with Boetticher's masterful direction and the cast's adroit performances turned it into a taut and suspenseful drama located in a remote and engaging western setting.<br><br>Scott is Pat Brennan making his way home to his ranch when the stagecoach he is on is held up by three desperate killers. A newly married woman on the coach (Maureen O'Sullivan) is taken hostage and held for a ransom from her affluent father. Her squeamish and cowardly new husband (John Hubbard) is killed along with the stage driver and Brennan and the woman are held until the ransom is paid and delivered. Eventually the opportunity comes about where Brennan sees the chance to thwart the gang's intentions and take them on in what is a well executed and action packed finale.<br><br>The cast couldn't be better! Scott, of course, is his usual granite-faced self. With that terrific voice, easy going manner and a way at delivering a line with a wry smile that is altogether appealing. Richard Boone who always excelled as a baddie doesn't disappoint here. As Frank Usher the leader of the errant trio he is unsmiling, cool and calculating. He must have kept his part here in mind when ten years later he would play a similar type role in Paul Newman's \"Hombre\" as the gang leader with the cracker of a name... Cicero Grimes. Playing his partners in crime here are Skip Homeier as Billy Jack the childish, naive and gullible gunman and the brilliant Henry Silva as Chink the hardened killer with a creepy effeminate demeanor (\"hey Frank I've never killed myself a woman yet - have I?\"). Usher has little time for them both and even less respect as he confides in Brennan \"I don't like them - the way they are, always talking the same words about women, drinkin' and such\". Accusingly Brennan retorts \"You run with them!\". As the only female in the picture Maureen O'Sullivan gives a fine performance as the unattractive and somewhat drab hostage and Arthur Hunnicutt is splendid as Rintoon the ill-fated stage driver. <br><br>Underlining this thriller of a western is the fine atmospheric score by Heinz Roemheld. Born 1n 1901 Roemheld had a voluminous output that would almost put Max Steiner to shame. During his lengthy career he either composed, conducted or arranged the music for almost 300 films. It is a wonder he was not better known. But he is remembered for his fine score in 1952 for the Kirk Douglas Warner picture \"The Big Trees\". Randolph Scott seemed to like his work as he had him score all of his Boetticher/Columbia films of which \"Commanche Station\" (1960) stands out. Heinz Roemheld died in 1985.<br><br>THE TALL T is a fondly remembered western and new generations have discovered it. It had a great star in Randolph Scott who remains an enduring icon of the Hollywood western alongside Gary Cooper, Joel McCrea, James Stewart and of course John Wayne.","user":"jpdoherty","rank":[50,54]},{"title":"Tall T - stands for TENSION","rating":10,"date":"31 January 2005","review":"**** I never really figured out what the Tall T exactly was. It doesn't matter. This is a great film and an outstanding western. The actors are all good, especially Randolph Scott as a western everyman (I always want to repeat the \"Blazing Saddles\" homage to Scott whenever I say his name)and Richard Boone as one of the most evil bad men in western film history. Skip Homeier and Henry Silva give great performances as two young guns who are teamed up with Boone. They are sexy and evil at once. The dialogue is biting, the situations are adult and dramatic, the scenery is superb, and the music complements the film's tension to a Tall T.","user":"lwetzel","rank":[37,43]},{"title":"One of the best of the Ranowns","rating":10,"date":"5 November 2002","review":"Excellent low budget western with an intelligent script (thanks to Kennedy), tight directing and good acting.  It tells its short, stark tale of abduction, murder, and attempted escape very well.  <br><br>There was one moment early in the film where the way the camera moved just amazed me, but mostly there is nothing showy going on, just solid suspense and storytelling. <br><br>Scott is not his usual later era persona of the experienced but emotionally barren gunfighter -- instead he's refreshingly old-fashioned as an old ranch hand intent on striking it out on his own in the West.<br><br>\nFirst rate and very dark.  10 out of 10","user":"funkyfry","rank":[49,60]}]