[{"title":"Don't miss this beauty - she's a trip!","rating":17,"date":"17 July 2003","review":"Wow, how did I manage to go so long without seeing this wonderfully corny '60s title, lost among thousands of other obscure, late-night drive-in classics? I had heard about it many years ago, just a rough plot outline, and always thought it sounded like cheesy fun, but I never had the chance to see it. However, I managed to view the film recently, under its alternate title, \"The Haunted House of Horror\", and I must say that I enjoyed every minute of it! Where do I begin? Well, first of all, those amazing '60s fashions! Go-go boots and mini-skirts haunt this picture more than the house itself does, and it must be said that throughout the entire movie the curvaceous Jill Haworth looks absolutely stunning (and yes, in many scenes she is wearing  mini-skirt). Basically, the plot revolves around this girl Sheila (Haworth), her swinger beau Chris (Frankie Avalon!) and all of their groovin' swinger friends who get bored with the usual Friday night party antics in swinging London and decide to go \"ghost-hunting\" at an old deserted mansion in the countryside. Well, what follows is that someone ends up dead (in a murder scene which is surprisingly bloody for a PG-rated film) and the kids try to figure out whodunit! I guess one could describe this little number as a more mature, live-action British version of \"Scooby Doo\"! It's an absolute hoot, and I really enjoyed it. The plot was really nothing special, but from beginning to end I was hooked on this movie, and I was surprised at how ahead of it's time it was, and of course by the bloodiness of the killings. There is one killing at the climax of the film that will surely make your eyes pop out of their sockets - unbelievable! I won't give anything away, you'll have to see for yourself, but this baby is just amazing, from the corny dialogue: \"Sheila, the way you dig blood, people'd think you're a vampire!\", \"You'd better watch out, darling, next time I give you a love bite!\", to the swingin' sixties fashions, to the Scooby Doo antics and gory knife murders, plus a very downbeat, disturbing ending and a creepy atmosphere - you can't go wrong with this one. Unfortunately it's pretty hard to find, but it has found a cozy little home on cable, so if you get the chance, give it a look!","user":"anawesomemoviefanatic","rank":[25,30]},{"title":"Michael Armstrong talks us through the film that never was.","rating":27,"date":"27 April 2006","review":"This film is available on disc in the UK from Anchor Bay as part of their Tigon box-set, along with 'The Beast in the cellar', 'Witchfinder General', 'Virgin Witch', and 'The Body Stealers'.<br><br>'Haunted House' was available on the late lamented Vampix video label in the early 1980's in the UK. That release was notable mostly for the dark, drabness of the print. It looks considerably improved here, with lustrous, bright colors and correct aspect ratio. The film itself is not up to much, but remains watchable for its late 60's period frills and a couple of effectively nasty murders.<br><br>What makes this incarnation of the film interesting is the director's commentary supplied as an audio extra. Michael Armstrong's career had unfortunate beginnings: He shot this flick, his first, when he was 24 and the experience was painful, with the film taken away from him and his original cut undone by studio re-writes and re-shoots. The following year he went to Germany to make 'Mark of the Devil' and suffered exactly the same fate. The financial success of both titles (especially 'Mark', which was a huge exploitation hit) was little consolation to the tyro film-maker and he vowed to stay away from movies until he was guaranteed complete creative control.<br><br>Armstrong here explains the changes made to his original concept in great detail, pointing out exactly which scenes he shot and how they would/should have fitted into his scheme of things. The film he wanted to make - 'The Dark' - certainly sounds pretty interesting the way he tells it, and the most frustrating thing about the whole episode is that it seemed to boil down to a personality clash between him and Louis 'Deke' Hayward, AIP'S man-in-London at the time.<br><br>Hayward tried to shoehorn Boris Karloff (who owed AIP one film as part of a contract) into the plot at various junctures, a ploy which Armstrong vigorously resisted, resulting in a war of wills that Hayward was destined to win. Hayward went on to extensively re-write the script, inserting Dennis Price as a policeman and George Sewell as a lurking spurned suitor, and employed a technician called Gerry Levy to shoot the necessary patch-up sequences. It's fascinating to watch the film whilst Armstrong indicates continuity errors in the insert sequences and identifies the various loose ends that commemorate the residue of his original script.<br><br>Its no surprise, then, that 'The Haunted House of Horror' is a bit of a mess. Its perhaps remarkable that it plays as well as it does. But I recommend this release for the commentary, yet another that uncovers machinations and interference undreamed of by the casual viewer. As an education in the unseen political wranglings of film-making it is most enlightening.","user":"LewisJForce","rank":[23,29]},{"title":"Surprisingly decent British horror flick","rating":6,"date":"21 February 2008","review":"I have to say I was pleasantly surprised by this one; I went in expecting nothing and actually found a more than decent horror movie. The film is directed by Michael Armstrong, a British man who would go on to direct the excellent 'Mark of the Devil' a year later. The title is a bit misleading as it makes the film out to be a haunted house movie, when in fact it's closer to the slasher genre if anything. The film takes place in sixties 'swinging' London and focuses on a group of young friends. They're out one night and looking for a party when one of them suggests that they go to an old house that is supposedly haunted. Their party turns sour when one of the friends gets sliced by an unseen killer and, believing they would be in trouble with the local bobby's if they come forward, they decide to dispose of the body themselves. I have to admit that the film is really quite predictable and even though it's a \"whodunit\", there's never a great deal of mystery surrounding anything in the film. The film is very well shot, however, and the director does a good job of capturing the swinging sixties feel. It's also a very colourful film, which is nice. The acting is rubbish of course, but that's not too important and it all boils down to a nice little twist at the end. I can't say this is brilliant stuff; but it's not bad and worth a look for horror fans.","user":"The_Void","rank":[12,14]}]