[{"title":"Weird sleeper sci-fi B-movie an unintentional work of genius.","rating":8,"date":"8 October 2000","review":"I will not attempt to describe this movie. It would be fruitless. You may at first be frustrated by the seemingly inept invocation of all the tried and true cliches of the \"genre\" - from Mad Max to its weirder post-apocalyptic cousins. But this is not Circuitry Man in reverse - it is much, much stranger. By the time the polka-dotted bikini-wearing ex-girlfriend of the hero is playing hostess at the disney-esque bubble-dome camp of the desert-dwelling homicidal outlaw gang... oh, never mind. By the way, Melanie Griffith was much better looking before lip surgery. Almost hot, in fact. But rest assured, this is a work of genius, exposing a deep understanding of the rift between genders during the height of the supposedly post-sexual-liberation 1980's, an almost sublime sense of humor about sexual alienation and most of all, the erotic link between women and cars in American culture is finally completely laid bare.<br><br>In fact, this movie is so profoundly subversive that it could only be made under cover of shlock. Do not be fooled by what seems like coke-addled acting and tourette-syndrome editing. This film is high art. Especially the part where the robot says \"is that your hand?\" Stay up late and watch it on TBS tonight! And take notes!","user":"enlight","rank":[72,78]},{"title":"Surprisingly fantastic...a real treat","rating":8,"date":"17 September 2003","review":"Okay, \"Cherry 2000\" has finally achieved \"cult film\" status. But unlike many other cult movies, it actually deserves the title.<br><br>There are many things to like about this flick. The nuanced, likeable Ben Johnson has a good role that even delivers some tragedy (how often do you get that in a b-movie?). The charismatic Griffith is alternately contemplative and kick-ass. Of course, Tim Thomerson as Lester nearly steals the show, providing a truly strange, ruthless villain.<br><br>The effects are cheesy, sure, but they never look fake, unlike a lot of the CGI films coming out today. When you see E. Johnson's Ford being dangled over the Hoover Dam, that is an ACTUAL car, not some stupid digital effect.<br><br>The movie does lay its message on thick, but considering the obvious budget constraints they were working with, that's a perfectly excuseable flaw. The satire is at times hilarious (watch for Larry Fishburne's turn as a lawyer with Morpheus-esque reflecting sunglasses, and the final exit of the villain is truly visually ironic). I bought this on DVD (having never seen it on TV) and really liked it...maybe you will, too.","user":"Mulliga","rank":[60,70]},{"title":"Man Meets Robot, Ditches Robot for Hot Babe with Gun","rating":10,"date":"19 August 2000","review":"Cherry 2k is a low budget one-off adaptation of the Mad Max concept mixed in with futurist technology ideas and a very cool love story. The male star goes on a quest to replace his lost robot sex android. That's the basic plot.<br><br>What's unusual is that this movie succeeds in mixing these elements without screwing up. The Sci-fi perspective doesn't overwhelm the overall plot, and vice versa.<br><br>Very few B grade movies from this time period were watchable, much less worth keeping in one's collection. Fortunately, Cherry 2000 bucked this trend and deserves a spot on the shelf of any cult classic and/or Sci-fi movie collector.","user":"flakwagen","rank":[63,74]}]