[{"title":"A film of shattering power","rating":24,"date":"24 March 2003","review":"In the powerful 1985 film The Official Story, Director Luis Puenzo tells the story of a teacher's awakening to conscience at the end of Argentina's \"Dirty War\" of the late 70s and early 80s. As in Pinochet's Chile, the military secret police sought to consolidate their power by routinely torturing and murdering students, political activists, opponents of the regime, and even expectant mothers. Many ended up as desaparecidos, people taken by the government and not returned. The film is about one mother's search for the truth about her adopted daughter and her discovery brings harsh political reality very close to home.<br><br>In The Official Story, Alicia (Norma Aleandro) lives a comfortable middle class life. She teaches History to high school students and enjoys a family that includes her well-to-do husband Roberto (Hector Alterio) and 5-year old adopted daughter Gaby (Analia Castro). Not used to asking questions, she believes whatever she has read in history books and is confused when one of her students tells her that \"history is written by assassins.\" She sees the demonstrations of the \"Mothers of Plaza de Mayo\", a group seeking information about missing family members but remains uninvolved. When her friend Ana (Chunchuna Villafane) visits after living in exile for many years, however, she learns, in an intensely emotional scene, that Ana had been imprisoned and tortured by the police trying to locate her husband, a suspected \"subversive\". <br><br>Ana tells Alicia that many others had \"disappeared\" and that babies had been taken from their mothers and given to childless friends of the junta. Alicia begins to wonder if her own child was the daughter of a political victim and questions her husband but when he is evasive, she suspects that he may be hiding a dark secret. Although fearful at the prospect of losing Gaby, Alicia is determined to find out about her daughter's past and begins to search hospital records and government archives. Ultimately, she must confront her own responsibility in a climax of shattering force that underscores the tragedy of political ideologues who would rather destroy family solidarity than risk losing power.","user":"howard.schumann","rank":[60,65]},{"title":"All-time favorite","rating":10,"date":"10 August 2003","review":"I cry each time I watch this film. (The scene with Norma Aleandro and the baby clothes) Always gets me.  An American film-maker would have made a film about one of the \"desaparecidos\" (disappeared ones) - but Puenzo is too sharp for that - by making a film about one of the quietly complicit, he has indicted all of us who are aware that things aren't quite right in the world, but choose to ignore the fact...and do nothing.  Devastating, political and yet personal.  My all-time favorite film.","user":"jereco","rank":[33,38]},{"title":"a very important and well-made film","rating":10,"date":"23 July 2005","review":"Unfortunately, few people outside of Argentina remember the bad old days of the late 1970s and early 80s and Argentina's military junta. During its reign, literally thousands of people just \"disappeared\"--never to be seen again. Any possible dissent was wiped out through torture, intimidation and murder. It was this climate of repression and ultra-nationalistic rhetoric that the fatal invasion of the Falklands was staged--ultimately leading to the ruin and collapse of the Argentinian government.<br><br>Now that I've spouted out all that stuff about the historical context for the movie, let's get to the film itself. The story begins with a rich and well-connected family (just how well-connected you find out much later in the story). They are about to celebrate the 5th birthday of their adopted daughter. However, unconfirmed stories about where many of these adopted babies came from begin to fall on the ears of our heroine. Alicia (Norma Aleandro) is horrified to hear that many adopted babies are probably those taken from these political prisoners that vanished while in police custody. When she brings these concerns to her husband, he ignores her and changes the subject--something he did repeatedly throughout the movie. However, she can't live a lie and MUST find out from where they adopted their daughter.<br><br>The acting is superb throughout the film as is the pacing--as she goes from a strict conformist to ultimately demanding to know more. The progression is NOT abrupt and it makes sense how it evolves thanks to excellent writing. Also, Ms. Aleandro's acting (as well as that of the supporting actors and actresses) is wonderful--so much that you feel yourself feeling what they are trying to portray. As a result, this movie will definitely get the tears flowing. Also, the final confrontation with her husband, though important, is a bit tough to watch (be forewarned).<br><br>FYI--this movie is rated R because of the intensity of the subject matter and some pretty horrible domestic violence towards the end of the movie. The movie should be okay for most teenagers to view.","user":"MartinHafer","rank":[17,19]}]