[{"title":"some folks should just stick to Disney","rating":10,"date":"14 May 2005","review":"One of the best British films of the sixties, The Entertainer was written as an allegory of Britain's fall from grace by the leading fist-shaker of England's band of Angry Young Men who stormed the London stage with revolutionary new ideas and content, John Osborne. While Look Back In Anger is a more decorated play, this film adaption by Osborne and Nigel Kneale carried the flag of teeth-crunching kicks that the gang of young playwrights hoped to startle the daylights out of England with. Reading the other viewer comments, it is obvious most folks were looking for a Disney story with a Shakespearean performance by Lawrence Olivier. A happier ending? Great Britain forgot to supply one, Andy up there in the mountains somewhere, and the seedy digs were meant to be depressingly seedy, as was the dwindling talent of the family, and its reliance in the end on the grand old name and the grand old accomplishments of the past, as Archie Rice gave his best in replacing his revered father, Billy. Note his offkey performance in singing early on and then the eloquent on key final rendition of \"Why Should I Care\" as the final performance ends not with a curtain call, but with the hook, as the theater management (those other nations running the world today) angrily demand that Archie get off the stage because he is through, finished, washed up, fired, kaputsky, so long and goodbye. From the direction of Tony Richardson to the selection of grand old places along the sea that Britain once ruled with absolute certainty, everything and every moment of this film are topnotch. The aforementioned slandered scene with Roger Livesey as the Grandfather, Billy Rice, and Brenda de Banzie as Phoebe Rice, involving a misunderstanding over a piece of cake, is one of the most moving and depressingly realistic family arguments ever written. It may not be Olivier's greatest performance ever, but for certain it is the best one ever filmed. It also features the film debut of two actors who would establish themselves among the very best performers Great Britain has offered us, Alan Bates and Albert Finney, along with the introduction of Joan Plowright. As for the unkind comment about Olivier marrying Joan Plowright and this somehow having an ironic similarity to the theme of Archie and his young women; they married in 1961 and REMAINED together until Olivier's death in 1989, which is completely the opposite of the point made in the story. Well anyone is allowed to be in error, but this great film has to rank with our own country's Night of the Hunter as one of the most misunderstood films of all time. Don't miss it,ever, and MGM Vintage Classics has issued an excellent DVD edition.","user":"nuntukamen","rank":[84,92]},{"title":"Nuns, clergymen, and dogs","rating":8,"date":"8 February 2007","review":"Laurence Olivier is \"The Entertainer,\" in a 1960 film based on the John Osborne play in which Olivier played one of his greatest roles, Archie Rice. He's surrounded by Joan Plowright as Archie's daughter Jean, and Brenda de Banzie as his emotionally fragile second wife, Phoebe. Olivier, Plowwright and de Banzie all repeat their stage roles, and it was while in the play that Olivier and Plowright met, fell in love, married, and stayed together until his death. Albert Finney is Mick and Alan Bates is Frank, Archie's sons, and Roger Livesey is Billy Rice, Archie's father and a beloved, well remembered music hall performer. Daniel Massey plays the role of Graham. It's an auspicious cast of veterans and newcomers.<br><br>Archie has followed in his father's footsteps with a lot less success. He's a second-rate entertainer - and that's being kind - in a seaside resort - and his show is in trouble. Archie's in trouble, too, as he's an undischarged bankruptcy and everything is in his wife's name. He's a fairly overt womanizer, which makes his wife a wreck. She's afraid of dying alone and wants the family to move to Canada and join a successful relative in the hotel business. But Archie won't give up following every dream in spite of some harsh realities. He takes up with a 20-year-old second prize beauty contestant - her father's rich and can back his new show.<br><br>As I read through the reviews on IMDb, I have to wonder where some people's hearts are. That's not a comment on the people, believe me, rather on the world we live in. I can tell you this - if you think what Olivier does isn't special and can't understand why he was nominated for an Oscar, if you can't see that he is Everyman, if you can't see the comment on Britain in general - you just haven't lived enough yet. You'll see this film again one day and it'll hurt, believe me. There can't be anyone my age, especially with ambition and a creative mind, who can't understand what Archie Rice is going through. Though he's in no way a sympathetic character, one can empathize with his life and begrudgingly admire the fact that he refuses to take the easy way out.<br><br>Jean, since she doesn't live full time with this bad road company version of \"Long Day's Journey Into Night\" - i.e., her family - is sympathetic to both Phoebe's hysteria and her father's delusions. The scene over the cake - one of the reviewers on the board found it disturbingly realistic - there's someone who knows dysfunction when he sees it. A brilliant scene, but nothing beats Archie's monologue to his daughter when he asks her to look at his eyes. \"I'm dead,\" he says.<br><br>Olivier has said this is his favorite character as it contains so much of him. It's obvious from interviews with Olivier that it does. Like many highly successful people, he began to see himself as Archie, a kind of fake who, as Archie says, can be warm and smiling and feel nothing. \"It's all tricks,\" Olivier told writer Jack Kroll once. It's not an uncommon feeling. It wasn't all tricks, of course, and as we see in Archie's final version of the song that ran through the film, \"Why Should I Care?\" he had finally reached the part of himself that makes a truly great artist, like the woman he heard sing the spiritual. Olivier, of course, hit those heights many times.<br><br>England is pronounced as a \"dying country\" in the beginning of the film, which sets up the metaphor of Archie as a symbol of the country. I'm not British - it's for those who lived during that time period in 1960 to comment on it, and they have. There are some brilliant reviews on the board covering that subject.<br><br>\"Why Should I Care?\" Archie sings. I don't have an answer. But if anyone could make me care, it was always Lord Laurence Olivier, be he the ruined man in \"Carrie,\" the beautiful Heathcliff in \"Wuthering Heights,\" James Tyrone on stage in \"Long Day's Journey,\" or Max de Winter in \"Rebecca.\" An amazing legacy, one in a million - don't miss him as Archie Rice in \"The Entertainer.\"","user":"blanche-2","rank":[35,37]},{"title":"Fascinating, a must-see.","rating":25,"date":"25 January 2004","review":"\"The Entertainer\" is a fascinating film based on the play by John Osborne (\"Look Back in Anger\"); Osborne co-wrote the screenplay.<br><br>Olivier plays Archie Rice, a fading entertainer in a fading medium (music halls) in a fading empire (the Suez crisis of 1956 figures into the action).<br><br>Archie's speech to his daughter (Joan Plowright), onstage in an empty theater, about being dead behind his eyes, is especially memorable.<br><br>Along with other fine actors, Alan Bates and Albert Finney as his sons flesh out this film, which is a must-see for fans of any of these actors.","user":"ejpede","rank":[33,35]}]