[{"title":"Fun 80's teen movie","rating":8,"date":"7 July 2005","review":"I can't help it--I love this movie. It's so adorably cliché and predictable that I get a kick out of it every time that I see it. The soundtrack is great 80's pop, and the songs keep playing in my head long after the movie's over. What teen girl hasn't wished she could \"magically\" put the \"snobby cheerleader\" in her place and walk away with the popular guy? Louise gets that chance when she inherits her powers on her 16th birthday and uses them to make herself \"the most popular girl.\" Yes, it's a bit silly in spots, but it has fun dance numbers and great 80's hairstyles and clothes. If you love the 80's, you will enjoy this movie!","user":"rebecca-188","rank":[24,26]},{"title":"What Is This???","rating":6,"date":"12 March 2015","review":"Louise Miller (Robyn Lively) is not very popular at her high school. Then she learns that she is descended from the witches of Salem and has inherited their powers.<br><br>First, what is up with that little brother (Joshua John Miller)? He is a terrifying mutant and it is hard to tell exactly what he is going for with those faces and voices. Oh my. And then there is the Rob Lowe joke, which is even funnier now (2015) than it was then (1989), given Lowe's departure from fame and triumphant return.<br><br>Somehow, despite losing millions of dollars at the box office, this has gone on to be a cult classic (allegedly) and there is a musical adaptation. Who is in this cult? But the musical makes sense, as there are a number of song and dance numbers that could be easily adapted. The film is not completely horrible, just somehow a bit off.","user":"gavin6942","rank":[5,5]},{"title":"Perfect 80's time capsule","rating":12,"date":"12 July 2002","review":"Okay, so the 80's were evil. We can all agree on that statement, right? But Teen Witch is still a fun movie to watch, if only for looking back and laughing at the decade. Pink socks on the fellas, acid wash jeans, Madonna attire...what the heck were we thinking? Aside from the chance to cringe at the fashion trends, Teen Witch has some amusing and truly original moments. Here they are, in no particular order:<br><br>1. I'm pretty sure Teen Witch is a musical, even if the movie won't admit it. Who can forget these songs? There's \"I Like Boys,\" where cheerleaders prance around the locker room in neon leotards and treat towels like dance ribbons. And there's \"Top That,\" a rap cession between Acid Wash Boy and Madonna Gal that's hilarious.<br><br>2. There's a scene where the Teen Witch and her 'popular' boyfriend explore a lighthouse or something while peeling off small articles of clothing. We leave with them kissing, but its kinda suggestive for a teen movie. Did Teen Witch get herself some action??<br><br>3. I like the ending. The cool guy could have turned out to be a jerk, trying to make out with her or something, but Teen Witch doesn't go on that familiar route. Instead the 'geek' manages to nab the cool guy without her powers, showing that she just needed confidence. Way fab.<br><br>See Teen Witch. It's like, totally mackadacious. 3 out of 4 stars.","user":"perni","rank":[22,30]}]