[{"title":"Sensible Time Travel Story","rating":8,"date":"25 May 2002","review":"As a youngster, I was a fan of Irwin Allen's works. \"Lost in Space\" and \"Voyage to the Bottom of the Sea\" were afterschool fixtures on New York stations WNEW and WOR. To me as an adult, these shows don't hold up well. \"Voyage\" in particular degenerated into episode after episode of rubber-suited monsters, alien invaders, evil doubles and mind control in the later seasons, due mostly to chief writer William Welch, who also destroyed any semblance of logic in Allen's \"The Time Tunnel\" series.<br><br>Allen tried to revamp and revive that 1966 time travel series with this 1976 TV movie and pilot, going so far as bringing back Sam Groom as a cast member (he was a regular as the control room technician, Jerry). \"Voyage\" alumnus Richard Basehart likewise became a Special Guest Star. Trish Stewart later became better known to science fiction viewers as the female lead of \"Salvage 1.\"<br><br>As it was, 1976 was a good year for television in general, and ABC reserved Friday nights for science fiction. In the doldrums before Star Wars burst onto the scene and changed the world, science fiction fans weren't very picky, but \"Time Travelers\" was surprisingly good. The acting wasn't Oscar caliber, but it was certainly serviceable. The plot actually made sense, unlike much of Allen's sci-fi. Also, unlike the Time Tunnel series and more recent shows, it didn't depend on a lot of action. No fistfights or car chases (or rather horse-drawn carriage chases) here. These men were thinkers, not fighters. Nevertheless, the story moves along at a snappy but not frenetic pace.<br><br>This was Allen at his best, a fine example of '70s vintage TV science fiction. There's little to no forced humor and precious little technobabble. Morton Stevens's theme is rather dated now, being very \"mod\" with synthesizers, but still somewhat catchy to those of us who don't care for today's bass-rich, melody-poor music.<br><br>Allen had a penchant for economizing, so there really wasn't much in the way of special effects here to distract from the story. Mostly fire footage recycled from the Fox film vaults. There were also the \"modern\" computers that reused panels of flashing lights, straight from the Irwin Allen warehouse. At least the set design in the period segment, with its ornate Victorian look, seems convincing enough to this layman's eyes.<br><br>As far as TV science fiction goes, you can do a lot worse. This is probably due in no small part to Rod Serling's original story. Alas, given Allen's track record, it's a foregone conclusion that this would have slipped very fast and far had the show been sold to a network. As it was, this was far superior to its ancestor, \"The Time Tunnel,\" and also easily outshines Gene Roddenberry's failed TV pilots of the era, \"Planet Earth,\" \"Genesis II\" and \"Questor Tapes.\"<br><br>This movie was shown on the SciFi Channel occasionally, at least until recent years when the channel moved away from showing older movies. It's worth catching for anyone who's sick and tired of recent Star Trek and their \"reset button\" subgenre of time travel stories.<br><br>Update: This, along with the 2002 Time Tunnel pilot, is available on the last disc of the Time Tunnel series DVD box set. Finally, a chance for more people to see just how good this was.","user":"TVholic","rank":[21,24]},{"title":"What a Wonderful Movie!","rating":10,"date":"30 October 2011","review":"I was really captivated by this wonderful pilot.<br><br>I am an enormous fan of the time travel genre, and intelligent sci-fi genre (not the cyber cowboy-cum-Star Wars-action-shoot-em-up kind of sci-fi)...and an avid fan of history and historical chronicles on film.<br><br>I should probably give credit where it is due, and that would be to ROD SERLING whose story was the solid germ which inspired this pilot/movie. We can't ever go wrong with SERLING, his was a great and yet in his time, woefully under-appreciated talent. Had the rest of the stories of this potential series been principally from his mind, I would venture to say it would have been a big hit.<br><br>I am so disappointed that it never went off the ground and I am perplexed at this fact after seeing this today. Another reviewer said that it would become dull eventually. I disagree vehemently. Was Quantum Leap dull? It was not and never jumped the shark! I am writing this just because the industry really needs to revisit this genre in a big way. We are bombarded all the time with time travel movies these days...and there must be a writer out there with deep knowledge of this genre and its foibles-to-avoid enough to make for intelligent television! We need MORE INTELLIGENT SCI-FI around. Not what the present SYFY garbage channel churns out in the past few years. SCI-FI is being DUMBED DOWN instead of lifting us up like the greatest OUTER LIMITS, TWILIGHT ZONE, OUT OF THE UNKNOWN, JOURNEY TO THE UNKNOWN, SCIENCE FICTION THEATER, TALES OF TOMORROW, ONE STEP BEYOND and a few others.<br><br>We need more INTELLIGENT TV, period! I recommend this movie for all ages.","user":"Enrique-Sanchez-56","rank":[11,12]},{"title":"Time Traveling can be hot","rating":8,"date":"7 May 2009","review":"Irwin Allen's \"The Time Travelers\" is a surprisingly good TV film. As previously mentioned in other reviews, Allen's record with sci-fi might lead the casual science fiction enthusiast to bypass this film. That, however, would be a mistake.<br><br>Without going into too many details, the film's slow moving story about present day doctors (in 1976) seeking a cure for a deadly flu virus outbreak just prior to the 1871 Great Chicago Fire (believe me, that is not an insult) builds methodically to its satisfying, if not a bit predictable, conclusion.<br><br>Based on a Rod Serling tale, this is the stuff of old style SF that is sorely missed in a lot of today's productions.<br><br>The cast is top-notch. The four lead actors, actors Sam Groom (an alum from Allen's \"The Time Tunnel,\" Trish Stewart *, Tom Hallick and especially Richard Basehart provide a warm, thought provoking charm to this small scale but involving tale. One of the nice touches are the bit roles filled by relatively unknown, but experienced actors one might recognize from many of the TV/film productions of the 1970s.<br><br>*Stewart played Jane Henderson-- in another review here mistakenly identified Francine York filling that role.<br><br>This reviewer highly recommends this small, somewhat obscure film. Fortunately, it can be found on the boxed DVD set to Allen's \"Time Tunnel.\" Incidentally, on that same DVD is the 2002 filmed pilot, an attempt to revive \"The Time Tunnel.\" It too, is VERY satisfying. It is really too bad this production didn't make it as a new TV series.","user":"dmappin-1","rank":[10,11]}]