[{"title":"A simple but beautifully executed little tale","rating":9,"date":"17 May 1999","review":"This film embraces everything that contemporary Hollywood cinema is so afraid of - intelligence, moral complexity, and rich characterisation. It is a simple tale really - an alcoholic vagrant in Paris is lent 200 francs by a stranger, on condition that he repays it to a local chapel when he can afford it. But what makes this an extraordinary film is the manner in which we are drawn so completely into this seemingly trivial and futile quest. This is principally down to Rutger Hauer's towering performance as the haunted, suffering tramp, who has to battle both ill-fortune and his own past to repay the debt and find peace. There is little in the way of either dialogue or action, yet Ermanno Olmi's vision of a timeless, enchanted Paris is dazzling. A lesson to others in how to tell a story on film.","user":"barfly99","rank":[47,50]},{"title":"Vintage stuff","rating":9,"date":"4 September 2001","review":"Olmi is one of Europe's last Old Masters in the art of film making. He is usually regarded as a belated neo-realist, but after you've seen \"The Legend of the Holy Drinker\", you will realize the label simply does not stick. This is a film about spirituality, about communion, one of the most deeply religious movies ever, whose only rivals might be Dreyer's \"Ordet\" or Bergman's rather pretentious \"faith trilogy\" (\"Through a Glass Darkly\", \"Winter Light\" and \"The Silence\"). However, you will not find Scandinavian mists or angst in Catholic Olmi's adaptation of the beautiful novella written, oddly enough, by a great Jewish novelist, Joseph Roth. Wine is a metaphor for life, and Paris is a metaphor for our urban world. In this symbolic universe, it takes a great actor to give flesh and blood to the character of Andreas, the holy drinker, a beggar endowed with an amazing sense of dignity. Rutger Hauer was the man for the job: this was his best performance: he was never better, and, to judge from the course his career has taken, I fear he will never be better than in this film. It is not a thriller, but it is thrilling. It takes its own leisurely pace, but goes very far, very deep indeed into the human soul. After so many insipid or unpalatable cinematic concoctions, treat yourself to this film: it truly is vintage stuff.","user":"jordiainaud","rank":[38,42]},{"title":"A film which gives the audience time to think.","rating":10,"date":"14 November 2003","review":"This simple tale is told at a pace which allows the audience time to reflect within the context of the moral challenges it presents. The result is a level of engagement far superior to the gamut of empty sophistication in the movie world. One is able to explore the implications of the actions and decisions of Hauer's character without leaving the narrative - there is no pressure for post viewing reflection when the spell of the film is broken and thought is coloured by a context inappropriate to the narrative. Here is a complete experience - moving, profound and visually beautiful  -  if only Hollywood could produce cinema of this standard.","user":"duinnuk2","rank":[31,35]}]