[{"title":"silly but hit my funny bone square-on","rating":15,"date":"15 May 2004","review":"They had to take me to the emergency room; I was laughing so hard they thought I'd gone crazy. It turns out my brain was knocked out of joint by the hilarious gags--gags that should never have been funny to a reasonable person, but I wasn't trying to be reasonable at the time. <br><br>Harry's asinine comments make him look like a real ass but he isn't. Once you get that, it's easy to get into the humor. That's John Candy's genius; his ability to humanize a variety of unlikely or impossible characters and make us love them even if we don't believe them. this is party because of the expressiveness of his face but also because of his indefinable comic spark.<br><br>Harry Crump is a great comic impossibility. Don't watch it if you prefer to keep you dignity.","user":"Logans-1","rank":[19,22]},{"title":"Easy to talk about!","rating":10,"date":"10 September 2002","review":"One of my favorite comedies, Who's Harry Crumb is the story of a bumbling private detective played by John Candy, who uses a number of disguises throughout the film. Jeffrey Jones is excellent as Elliot Dreisen. A relatively clean movie, the comedy revolves around Harry and his earnestness and naivete you could say. A lot of viewers will laugh at Harry, but I laugh with him as he tracks down the kidnappers - and find them he will! A number of good lines, interesting dialogue, funny disguises, and cool cameos. Plus this movie actually makes Annie Potts a believable sex object. A very easy 10 for me!","user":"sincitybrant","rank":[25,34]},{"title":"not as bad as many say it is","rating":23,"date":"23 July 2003","review":"This is one of the better John Candy movies out there, if that isn't damning with faint praise.  It's not terrific, but it definitely will tickle your funny bone if you're in the right mood.  The only real flaw is the soundtrack, which doesn't accentuate the humor enough.  If you enjoy comedies about cute moronic characters who are too blind to see their own faults, you will love this.","user":"LATENITE","rank":[16,22]}]