[{"title":"Champagne, Scotch, Vodka, or Coke?","rating":2,"date":"2 June 2004","review":"I just saw this film on a not-too-great VHS copy and wish it could be released on DVD. It would be a great companion to Tales of Hoffmann by the same team, though it is quite different in flavor.<br><br>As in Hoffmann, the film is full of dancing--but much of it has an improvised flavor, a polka down the hall, a can-can by Michael Redgrave in full military evening dress and kepi, as well as lots of waltzing-- and some of the actors are lip-synching the arias as sung by folks with bigger voices. But there is also a lot of spoken dialogue, so the actors get to establish their characters in their own voices. The trouble is that the characters are still the silly, exaggerated characters of an operetta, with chiming watches, comic hangovers, and huge plot-enhancing blind spots.<br><br>The most interesting character is of course Anton Walbrook's Dr. Falke, the Bat. As in The Red Shoes and La Ronde, Walbrook plays the man who keeps the whole thing going, the leader of the dance, but here he is euphoric, almost ecstatic. Falke is presented as a black-marketer who arranges parties for the higher-ups of the Four Powers occupying Vienna, and keeps them on good terms with each other; he exploits them, lives off them--and he would like to see them all go home. He is witty and views everything with cheerful irony, but he never stops enjoying himself for a moment, never goes down, only up, up, up. <br><br>Ludmilla Tcherina is a delightful French farce heroine, flirting only when absolutely necessary. Michael Redgrave gets to do some great swooping physical comedy (apparently he also did his own singing, but who can tell?). Mel Ferrer comes off well in his light role as the old boyfriend, as does Dennis Price in a smaller role whose main duty is to be recognizable for plot purposes. Anneliese Rothenberger is a reminder of more conventional stagings, where the singers act instead of having actors \"sing.\"<br><br>I felt that the 1955 setting was a bit thin--were the 50's really THAT much about denying what had happened and \"moving on\"? Maybe they were--Pressburger and Powell were good at telling where the wind was blowing.","user":"jshoaf","rank":[18,18]},{"title":"Oh... Rosalinda!! (1955)","rating":7,"date":"6 January 2012","review":"Powell &amp; Pressburger take Strauss' \"Die Fledermaus\" and update it. I'm not familiar with the original work, but from what I can tell most of the plot points remain intact. The updating comes in the form of bringing it to postwar \"Four Power\" Vienna (like THE THIRD MAN) with some light commentary on the occupation. My problem with opera is quite similar to my problem with Shakespeare. The story is being advanced in a manner I find difficult to comprehend. Sometimes it's alright, but whenever there's a large chorus singing, it all sounds like mush to me. And some of the ladies go into that ridiculously high register where all words turn into \"aaaaaaEEEEEEeEeEeEeee!!!\" Still, when I couldn't make out the words I managed to get most of it from context, and the movie is fun musical comedy. The farce is well-constructed and the performances are very enjoyable (including Michael Redgrave being far more flamboyant than I would have ever imagined him). It's not brilliant, it's not stunning, it doesn't stick with you, but it's a good little romp with some nice tunes.","user":"MartinTeller","rank":[8,8]},{"title":"Much better than anticipated","rating":7,"date":"9 August 2016","review":"Though their 1940s output is unanimously celebrated by critics and audiences, the Powell/Pressburger collaborations of the 1950s are often forgotten or outright dismissed. I have not seen all of them, save for Gone to Earth and Oh... Rosalinda!! but I was surprised by how good both of them were. No, they're not on the same transcendent heights as the likes of The Red Shoes or The Life and Death of Colonel Blimp (heck, precious few movies are), but they are good in their own right and still lovely to look at.<br><br>Oh... Rosalinda!! may be a bit of an acquired taste for some people. The aesthetic is very flat and artificial, stagey even, much like the more elaborate Tales of Hoffman but with apparently less of a budget. It's also a bedroom farce, so if you're not much for that kind of comedy, you may find it hard to get into the swing of things. I myself care little for such comedies, but I rather enjoyed this one, mainly due to the strength of the performers. Anton Walbrook is great as the black market dealer who manipulates everyone, showing a great penchant for comedy he rarely got to express in his English language projects. Ludmilla Tcherina is playful and sexy as the woman everyone wants. Mel Ferrer is a bit overdone, but he's not bad at all.<br><br>No great classic, but Oh... Rosalinda!! is worth at least one glance from Powell-Pressburger devotees.","user":"MissSimonetta","rank":[7,7]}]