[{"title":"It's the most, man!","rating":10,"date":"9 August 2001","review":"Perhaps the coolest movie ever made!  It's worth watching for the lingo alone, you sound me?  And it's a movie with a lesson... \"You flake around with the weed and you're gonna end up using hard stuff!\"  Yes, it's just that cheesey.<br><br>Hot-shot Tony Baker (Russ Tamblyn) is the new kid at Santo Bello High School and he makes everyone aware of his arrival.  He muscles his way into the Wheelers &amp; Dealers, run by J.I. Colridge (John Drew Barrymoore - Drew's dad) and not only tries to push him out of the picture, but also goes after his girl, Joan Staples (Diane Jergens).<br><br>Tony lets it be known that he's looking to \"graze on some grass\", but not just a few \"sticks\", he wants five pounds!  Not only that but he also wants to score some coke, H, goofballs and caps.  He is soon humbled when he finds he has to score 100 sticks from J.I. at the big race.  While haggling for the weed Tony learns that J.I. is pushing for the mysterious Mr. A. (Jackie Coogan).  Tony wants to meet Mr. A. so he can score a kilo of heroin. Eventually, a meeting is set up between Tony and Mr. A.<br><br>School teacher Miss Williams (Jan Sterling) takes a liking to Tony and sets out to save him from himself.  Tony takes a liking to his teacher, but with different intentions.<br><br>The comedy (unintentionally) abounds in this 50s flick.  Check out Barrymoore's hep-cat slang rendition of Columbus' voyage to America or the Beat Poetess' poetry reading or Michael Landon as a dorky student Tony mocks, or the slinky, Mamie VanDoren as Tony's drunken, slutty aunt or the cop explaining the difference between a real cigarette and marijuana.<br><br>I could go on for days about this movie, but instead, I'm going to stop writing and pop the tape in my VCR and watch it for the five billionth time. I suggest you do the same.","user":"DBPVI","rank":[34,37]},{"title":"Notes on some misused talent in campy teen-exploitation flick","rating":4,"date":"25 August 2002","review":"There's not much to be said about High School Confidential, a teen exploitation movie from the end of the fabulous fifties, except that it's hard to think that it wasn't just as laughable upon release as it is today. But some comments on its cast members may be in order:<br><br>\tRuss Tamblyn was a child star, then primarily a dancer.  This `dramatic' role fell to him between his memorable assignments in Seven Brides for Seven Brothers and West Side Story.  He's not at all bad here (in an badly written and implausible role), but was never able to establish himself as a serious actor, though he continued to work, showing up notably decades later in Twin Peaks.<br><br>\t \tJohn Drew Barrymore had just taken up his middle name to distance himself from his legendary father; in earlier roles (The Big Night, While the City Sleeps), he was billed as John Barrymore, Jr.  Here he brings off an eerily precise impersonation of Elvis Presley, speaking both in hillbilly accent and in basso-profundo register.  (Alas, he does not sing.)  It's clear he inherited the family talent, which he was to squander, because he also inherited the predisposition to chemical experimentation.<br><br>\tJan Sterling seemed destined for a bigger career than she ended up with. The high points of her filmography  Billy's Wilder's The Big Carnival/Ace In The Hole being the most impressive of them  were behind her, and she was taking secondary roles to the likes of latter-day Joan Crawford ( in Female on The Beach).  Here, as a schoolteacher, she not only does a riff on Eve Arden's Our Miss Brooks character, she even looks like Arden. <br><br>\n\tThe late fifties were the blazing noon of Mamie Van Doren's fling at playing third-string sexpot (after Marilyn Monroe and Jayne Mansfield).  All Dagmars and platinum hair, she was rarely called upon to display what might have been a comic talent, visible here in fits and starts. Her role as a married nymphomaniac whose attempts at fulfilment  absent her husband  seemed doomed to disappointment is practically a clone of the part she played in The Beat Generation, a slightly more interesting vehicle that covers much of the same ground as High School Confidential.<br><br>High School Confidential remains notable from a view of drug trafficking and the process of addiction that had advanced not a whit since Reefer Madness in the thirties.  And of course its view of teen-aged life in the second Eisenhower administration bears not the slightest resemblance to any reality  then or now.   That said, it's fun to watch.","user":"bmacv","rank":[38,42]},{"title":"NEEDS MORE MAMIE!","rating":6,"date":"11 October 2004","review":"This decent late 50's teen-exploitation flick is one of the better ones, although the hot Mamie Van Doren is in it all too briefly. Jackie Coogan adds a weird twist, and Russ Tamblyn is appropriately youthful (a few years before WEST SIDE STORY). Michael Landon has a small part (around the time he started BONANZA). <br><br>A 6 out of 10. Best performance = Mamie Van Doren). This film needed more rock 'n rock songs, beside the GREAT opening number by Jerry Lee Lewis on the back of a truck. Jan Sterling is subdued as the \"good\" teacher and John Drew Barrymore is rather strange. Great B/W cinematography helps this slide along. Check it out!","user":"shepardjessica-1","rank":[22,25]}]