[{"title":"A positive review!","rating":15,"date":"15 October 2001","review":"How many times have we heard \"The film isn't as good as the book\"? Let's face it. What film IS?! Red Dragon was a masterpiece and so is Manhunter.<br><br>To appreciate that there are two issues. Firstly, the film was created in 1986. It's stylised and looks slightly dated. The soundtrack is excellent but again very 1980's. Secondly, Red Dragon was not an easy book to write a screenplay for. There is way too much information that made the book so enthralling to squeeze in to 2 hours.<br><br>The cinematography, in particular the clever use of light and colours, is breathtaking. The choice of locations was also very deliberate. The scene where Will is running out of the building after speaking to Hannibal Lecter. They chose a building with a long spiral ramp down. The ramp is white, clinical. Running down the ramp is like those dreams where the bad man is chasing you and you can't get away. Will runs his heart out but doesn't get very far.<br><br>I agree that Cox plays a different Lecter but then the book wasn't about Lecter. There was some mention made but Lecter in this film is very much a Cameo appearance. The way in which Will goes about catching the killer is every bit as clever as Starling's methods, if not more so. In addition, we are treated to the thoughts, the inner monologue, the frustration and triumph of a hunter.<br><br>Make no mistake, if you expect an up-to-date movie as good in every respect as the book, you'll be disappointed. If you're sensible and expect nothing more than 2 hours quality entertainment you'll enjoy this one.","user":"kdidymus","rank":[165,187]},{"title":"Basically the most underrated thriller of all time.","rating":8,"date":"21 June 2005","review":"Besides the fact that it was released without much hoopla in 1986, and that it was recently remade(the same exact movie except for the end) as Red Dragon, Manhunter is undoubtedly the most overlooked movie of the past 20 years. The plot is tremendous, Mann's direction is outstanding, and the acting(especially Noonan) is equally amazing. What Mann realized while making this film is that a thriller was not just meant to shock and disgust the audience but to develop the characters carefully so that there is an even greater sense of anticipation for the climax of the movie than there otherwise would be. Recent thrillers are clearly lacking in the character development that made movies like Manhunter and Silence of the Lambs so good. Its a shame that Red Dragon had to be made, since it is basically a strait ripoff of Manhunter except for a different ending which is much worse than the original and way too predictable. Anyone who thinks Red Dragon was a good movie should watch Manhunter and compare the two. If you try this you'll see that there is no comparison. Tom Noonan's performance alone is worth the watch.","user":"Jusgure","rank":[109,126]},{"title":"Recover the mindset.","rating":10,"date":"17 June 2012","review":"Retired FBI specialist Will Graham is lured back into action to track a serial killer who is killing families, seemingly linked into the lunar cycle. In the process it opens up some old mental wounds that were born out during his last action out in the field...<br><br>Before the gargantuan success of Silence of the Lambs, where the name Hannibal the Cannibal moved into pop culture, and before director Michael Mann became a named auteur often referenced with relish by hungry film students; there was Manhunter, Michael Mann's brilliant adaptation of Thomas Harris' equally brilliant psychological thriller, Red Dragon. It feels a bit redundant now, years later, writing about Mann's use of styles to bear out mood and psychological states, his framing devices, his commitment to his craft, but after revisiting the film on Blu-ray, I find myself once again simultaneously invigorated and unnerved by the magnificence of Manhunter. Visually, thematically and narratively it remains a clinical piece of cinema, a probing study of madness that dares to put a serial killer and the man hunting him in the same psychological body, asking us, as well as William Petersen's FBI agent Will Graham, to empathise with Tom Noonan's troubled Tooth Fairy killer. Here's a thing, too, Francis Dolarhyde (The Tooth Fairy) is a functioning member of society, he is quite frankly a man who could be working in a shop near you! This is no reclusive psychopath such as, well, Buffalo Bill, Dolarhyde is presented to us in such a way as we are given insight into this damaged mind, he is fleshed out as a person, we get to know him and his motivational problems.<br><br>Dream much, Will?<br><br>Mann and his team are not about over the top or camp performances, gore is kept to a premium, the real horror is shown in aftermath sequences, conversations and harmless photographs, but still it's a nightmarish world. Suspense is wrung out slowly by way of the characterisations. Will has to become the killer, and it's dangerous, he knows so because he has done it before, when capturing Dr. Hannibal Lecktor. Needing to pick up the scent again, to recover the mindset, Will has to go see the good doctor who has a penchant for fine wines and human offal. These scenes showcase Mann at his deadliest, a bright white cell filmed off kilter, each frame switch showing either Lecktor or Graham behind bars, they are one. When Lecktor taunts Will about them being alike, Mann understands this and visually brings it out. Dolarhyde's living abode is murky in colour tones and furnished garishly, and with mirrors, paintings and a lunar landscape, yet when Dolarhyde is accompanied by Joan Allen's blind Reba, where he feels he is finally finding acceptance, this house is seen at ease because of the characterisations. Switch to the finale and it's a walled monstrosity matching that of a killer tipped back over the edge. Brilliant stuff.<br><br>If one does what God does enough times, one will become as God is.<br><br>Lecktor, soon to be back as the source material Lecter in the film versions that follow, is actually not in the film that much. Brian Cox (chilling, calculating, frightening and intelligent) as Lecktor gets under ten minutes of screen time, but that's enough, the character's presence is felt throughout the picture in a number of ways. The Lecktor angle is very relative to film's success, but very much it's one strand of a compelling whole, I realise now that Mann has deliberately kept us wanting more of him visually. Noonan is truly scary, he lived away from the rest of the cast during filming, with Mann's joyous encouragement, the end result is one of the best and most complex serial killer characterisations ever. Lang scores high as weasel paparazzi, Allen is heart achingly effective without patronising blind people and Farina is a huge presence as Jack Crawford, Will's friend and boss who coaxes Will back into the fray knowing full well that Will's mind might not make it back with him. But it's Petersen's movie all the way. His subsequent non film career has given ammunition to his knockers that he is no great actor. Rubbish, with this and To Live and Die in L.A. he gave two of the best crime film portrayals of the 80s. He immerses himself in Will Graham, so much so he wasn't able to shake the character off long after filming had wrapped. There's a scene in a supermarket where Will is explaining to his son about his dark place, where \"the ugliest thoughts in the world\" live, a stunning sequence of acting and a showcase for Petersen's undoubted talents.<br><br>Newcomers to the film and Mann's work in general, could do no worse than spend the ten minutes it takes to watch the Dante Spinotti feature on the disc. Apart from saving me the time to write about Mann's visual flourishes, it gives one an idea of just how key a director and cinematographer partnership is in a film such as this. The audio is crisp, which keeps alive the perfect in tone soundtrack and eerie scoring strains of Rubini and The Reds. Some say that the music of Manhunter is dated? I say that if it sits at one with the tonal shifts and thematics of a story then that surely can never be viewed as dated. And that's the case here in Manhunter. The director's cut is included as part of the package but the transfer is appalling, and for the sake of one cut scene that happens post the Dolarhyde/Graham face off, there's really not much to the DC version anyway. The theatrical cut is perfect, brilliantly realised on Blu-ray to birth a true visual neo-noir masterpiece. 10/10","user":"hitchcockthelegend","rank":[63,72]}]