[{"title":"Great mindless 80s Horror!","rating":8,"date":"15 March 2000","review":"The 80s were overrun by all those HALLOWEEN/Friday THE 13TH slasher-style horror movies, so this is something of a relief.<br><br>Ten unbelievably annoying teenagers (would you want to hang out with these jerks?!) decide to throw a Halloween party at a local former funeral parlor called \"Hull House\". During a \"past life séance\" a demon is accidentally released, and each person becomes possessed and kills off the others.<br><br>This all sounds very EVIL DEAD/DEMONS-ish, but Tenney lends some directorial style to the proceedings, there are some good one-liners, the music is excellent, the Steve Johnson prosthetic make-up FX are scary and Linnea Quigley is quite fun as a boy-crazy bimbo who pokes out eyeballs with her fingers and does an amazing new thing with a tube of lipstick!<br><br>Great fun on a no-brainer level! After checking out the breakdown of the voting and the other posted reviews, I don't understand how this only received 4 out of 10 (?!)<br><br>I give it, 8 out of 10.","user":"capkronos","rank":[38,48]},{"title":"Classic 80's horror picture","rating":7,"date":"1 April 2004","review":"Night of the Demons is by far one of my favorite horror films to date. You really cannot go wrong with this picture. It's directed by the master Kevin (Witchboard) Tenney and based on a Joe Augustyn script.<br><br>The film is based on a rowdy group of high school teens who decide to throw a party in an old abandoned funeral parlor. Both Angela (Amelia Kinkade) and and Suzanne (Linnea Quigley) are the ones responsible for throwing this party together. They invite a small group of personal friends together and host this party on none other than Halloween Night. The party starts off as a real smash. However, throughout the course of the night, Angela and Suzanne transform into demonic characters and infect the rest of the guests.<br><br>There are some real classics deaths in this one. Jill (Sleepaway Camp III) Terashita and her beau Philip Tanzini meet their untimely death, while they are \"working it out,\" in a casket of all places. Stooge, who happens to be one of the highlights of the party, crushes them both in the coffin. This death here, is one of my all time favorites. Also, check out the lipstick scene with Linnea Quigley. <br><br>This movie has it all, the house, the booze, naked chicks, violence and demons. If you are into real bad movies, like myself, then go ahead and check out this masterpiece.<br><br>I am also pleased to report that Anchor Bay has received the rights to be able to release this fine movie finally on a DVD release. Boy, I cannot wait. The street date is slated for an August 24th 2004 release date.<br><br>If you haven't seen nor hear of this movie then I advise you to go ahead and check it out. If you have seen this then hopefully you'll pick it up on DVD once its released. 10/10 for a classic!","user":"ryannemetz","rank":[42,56]},{"title":"They don't make demon movies like these anymore. 80s was the best.","rating":7,"date":"27 March 2016","review":"This movie just rocks. It has everything, Halloween, the costumes, the big house, demon possession, great 80s cheese music, even creepiness through-out. The demons are actually creepy. Director Tenney is obviously skilled at creating a creepy mood and the film is pretty stylish as well. Once the demon action kicks in, its fun. If you r a horror movie fan you owe it to yourself to check this out. I remember seeing Night of the Demons back in the late 80s on a rented VHS. Its directed by Kevin Tenney (witchboard 1 n 2, witchtrap, 2007-brain dead). It has Linnea Quigley ( Silent Night, Deadly Night, Return of the living dead, Nightmare on elm street-4, Night of the demons remake). Looking forward for more projects from the director Kevin tenney. Saw the sequel of this in the mid 90s on a VHS, which was OK. Saw the third part in the late 90s on a vcd, which was a bad movie. Saw the 2009 remake starring Edward furlong on a DVD, which I dint enjoy.","user":"Fella_shibby","rank":[18,23]}]