[{"title":"An overworked and rather depressing theme, but redeemed by unusual sensitivity.","rating":6,"date":"1 August 2004","review":"Yes, this is one of the early entries into the unending series of sexploitation movies about male teenagers with raging hormones looking for relief. But also, yes, I quite enjoyed it and gave it a respectable viewers rating - so I have a little explaining to do, even though I do not fully understand why this somewhat simplistic film appealed to me in the way that it did. <br><br>\tPerhaps it is simply that after an unending series of \"Porky's\" like movies, any film which features believable characters that are marginally more than cardboard cut-outs automatically gets rated more highly than it deserves. I cannot dispute the fact that this is not really a good movie, but it is so much better than most of its contemporaries covering the same scene that I feel it deserves to be recognised. In the story we have a young man of intelligence, born to rich parents and destined for Yale, who meets a glitch when he fails his French examination. He has to resit this, and is lucky enough to have a father who engages a very attractive young lady as his private coach to see that the resit is successful. Whether flowing juices improve study or not, may be debatable; but in this case the tutor not only meets Bobby's academic needs, but also recognises the basic problem he faces, liking him enough to guide him towards achieving a more mature appreciation of the mutual responsibilities any loving relationship will impose. This part of the film is handled with unusual sensitivity and in my opinion elevates the film from a piece of soft porn to a serious and significant treatment of an important social issue. Caren Kaye's treatment of her role as Terry, the tutor, deserves  the highest praise - with a different leading lady this film could have been a complete disaster. In addition Kevin McCarthy, as the father, also delivers a fine performance in the character of someone wealthy enough to believe that he can buy whatever he needs or wants, and the scene towards the end of the film when his son turns upon him for the first time is quite well handled.<br><br>\tIn parallel with this we are presented with the classic Hollywood slapstick treatment of a story about Bobby's best friend who is experiencing similar urges and makes continual disastrous efforts to satisfy them. This occupies a significant part of the first third of the film and is just awful. The two threads of the story are so far apart in their mood and appeal that my reactions when watching this film varied from a loud cheer to a bored yawn, depending upon which thread the current sequence belonged to. Presumably someone in the studio felt that a generous measure of this type of slapstick would be required in order to increase the overall appeal of the film. If so the person concerned should have been drummed out of Hollywood at short notice. The two themes are totally incompatible and if this secondary story had not been kept mercifully subordinate the whole film would have been completely ruined. As it is, it is quite easy to understand how viewers ratings for this film can vary from very high to very low. The average viewers rating recorded on the IMDb database at the moment is 4.5 out of 10, but there was an unusual spread with significant numbers of viewers rating it both very highly (8-10) and very poorly (1-3). <br><br>\tThere were two scenes that I particularly enjoyed. The first was the one featuring a girl in a telephone booth, This starts when Bobby encounters the situation we have all experienced when waiting to make an important call, where the person occupying the 'phone booth is behaving as if about to leave it, but never quite does so; and it develops to the point where he is watching what ensues with fascination. In these days of cellular phones it will not be long before this scene becomes almost meaningless for many young people, but in the meantime it is a minor gem of its kind. Jewel Shepard, who plays the girl, is an under appreciated actress and I wish we could have seen more of her. The second, and far the more important of these two scenes, was the one showing the parting of Bobby and Terry. Here Bobby's education has progressed to the point where he appreciates that his tutor has developed a genuine affection for him, and that he has a moral responsibility not to let her down too sharply. His relief when it becomes clear that she intends to make a complete and clean break, is palpable. Again this was not an easy scene to present with the necessary sensitivity, but the director deserves about 7 out of 10 for his treatment of it. It is only spoiled right at the end by a grotesque display of relief by Bobby which should have been trimmed, but instead was turned into a freeze frame used as the background throughout the painfully slow scrolling of cast members and credits.    <br><br>\tOverall I feel inclined to rate this film at what is probably a generous 6 out of 10. Watch it with your significant other when you simply want to relax together one evening. No doubt I have missed other similar films released more recently which treat the same theme with equal sensitivity, but the only comparable one that I remember seeing was \"Y Tu Mama Tambien\", released in 2001. Almost twenty years has been a long time to wait!","user":"bbhlthph","rank":[20,23]},{"title":"1983 High School Kids Looking for Sexual Adventure","rating":6,"date":"22 April 2006","review":"This is the backdrop of the movie: The plot of this movie revolves around a guy, who has just graduated from high school, and his father's wish for him to get into Yale University. Upon learning that he has flunked high school French, his father arranges for him to spend his summer with a private tutor. He must pass French before the summer is over, or he will not get into Yale.<br><br>Now that the backdrop has been established, the movie entails the adventures of a fresh high school graduate, and his friends, quest to get laid before the summer is out. There are many funny squences, and twists, and even imaginary \"fantasy\" scenes dealing with sexuality throughout the movie, circa 1983.<br><br>The movie shows a lot of topless females, and even features real life porn star Kitten Natividad.<br><br>I would say that this movie lies somewhere in between a \"B-Movie\" &amp; a light comedy/serious film making effort.<br><br>I remember this movie from my childhood, and it was refreshing for me to see it again recently.","user":"oakley29073","rank":[14,16]},{"title":"see this for cheap laughs and crispin glover","rating":7,"date":"5 March 1999","review":"My Tutor would have been another useless teen sex movie if not for the superb performance of Crispin Glover. There are some funny moments throughout the film, and it's definitely worth 90 minutes of your time.  Be sure to check out the freeze frame at the end of the movie, it's ludicrously tragic, and tragically ludicrous. Success!","user":"mordax","rank":[6,6]}]