[{"title":"Why do modern horror movies never attempt atmosphere?","rating":9,"date":"7 March 2005","review":"It is really astonishing to see how movies from the sixties could get to be very exciting in the horror genre, hardly using any special effects and relying exclusively on the acting of the cast. In this goo die, the old lady really scared me with her eager emotions and the well played desire to live a more dangerous life. Though not really exceptional in one way or the other, the movie creates a very realistic and horrid atmosphere, based upon the simple assumption of mind control. When compared to modern horror movies where bad acting seems to be a basic requirement, the attention is constantly drawn to the tits of the leading, utterly stupid actresses, and the only -supposed to be - scary effect is raised by some fast moving camera shots and horrid gore scenes, this film is a real gem. It furthermore charmed me as a documentary of the sixties, as in a no nonsense style the popular youth culture is shown as it must have been...","user":"dddionys","rank":[25,25]},{"title":"Sadly forgotten, well worth a look","rating":18,"date":"18 August 2000","review":"The aged Karloff stars as a disgraced hypnotist, eager to try out his new thought transferal device at the urge of his domineering wife (Lacey). Finding an ideal subject in a jaded youth (Ogilvy), the couple discover they can vicariously experience his every sensation while controlling his actions.  Karloff wishes his invention to be used for the crippled and elderly to take a virtual vacation, while his wife revels in the thrill of committing various crimes through the young man. Her wishes increase from theft to murder.  After she has successfully shattered Ogilvy's life and relationships, it boils down to a battle of wits between the two for control of the young man's psyche.  It plays like an episode of the original Outer Limits series, with the couple's venture into realms man was not meant to explore, and tragic denouement although there is no Control Voice to lull us back to normality or offer a moral here.<br><br>Michael Reeves made one other film, the stunning Witchfinder General before taking his own life at the age of twenty-five.  Who knows what the film's enfant terrible director might have accomplished had he lived?  From subtle tricks of lighting, and the use of a story that fits the budget, to imaginative shots and an emphasis on action, it contains all the elements today's independent filmmakers should take note of.  It is worth noting Ogilvy would later take on the role of mad scientist involved in mind control techniques in Fugitive Mind.<br><br>While dated in many aspects, it's a shame this film is all but forgotten, and unavailable commercially.","user":"C. M. O'Brien","rank":[22,24]},{"title":"They coulda been contenders...","rating":2,"date":"2 March 2004","review":"Anyone even vaguely interested in British horror cinema will be well acquainted with the resume of Michael Reeves. Retrospectively crowned the great white hope who-never-was by genre commentators like Kim Newman and Allan 'Dark Side' Bryce, Reeves' work showed the promise of an English Spielberg. Or possibly just another Peter Sasdy. Unfortunately we'll never know, as his life was truncated by an overdose of sleeping pills. But on the evidence of this film and it's successor,'Witchfinder General', it's clear that he possessed a genuinely cinematic imagination to rival young Steven's. A quality all too rare in British film.<br><br>'Witchfinder' is good. Very good. But on balance I prefer this piece. Perhaps that's partly a personal reaction to the rather inflated claims made for Reeves' last film by certain critics, who seek to present it as the work of a suicidal soul-in-torment auteur. C'mon fellas. 'The Sorcerers' is quirky and takes itself slightly too seriously, resulting in a strange, enjoyably naive atmosphere. I particularly enjoy the unique screen presence of Victor Henry, who plays Ian Ogilvy's ginger haired friend Alan. I was saddened to learn (via the ever-educational IMDb) that he was involved in a road traffic accident not too long after making this film, and spent the last 17 years of his short life in a vegetative state. Another potential talent lost.<br><br>Ignore the wits who claim that this is a work which dissects and critiques the function and form of cinema itself, etc, etc. These people create subtexts for Pete Walker films in their spare time. Enjoy it simply as a movie where Ian Ogilvy listens to Cliff Richard's 'Out in the country' on his dansette, and then slashes up Susan George with a pair of scissors.<br><br>Hey. 'Wired for sound' gets me the same way.","user":"LewisJForce","rank":[26,29]}]