[{"title":"Nicolas Roeg delves into erotic obsession in this film, with surprising results","rating":7,"date":"30 August 2008","review":"His movie rates high in production value and acting and has an innovative approach to an old story <br><br>The film is basically a character study Alex (Art Garfunkel) is a depressingly dark and shadowy American psychoanalyst living in Vienna Theresa Russell plays Milena, a resonant, carefree American girl They meet by chance at a party and are thrown into a roller-coaster ride of an erotic relationship He wants to smash her free spirit because he can't understand it, but she won't let him The result is a near-fatal break-up <br><br>Roeg comes close to the story from the middle (obeying Jean-Luc Godard's authoritative saying, a film \"must have a beginning, a middle and an end, but not necessarily in that order.\" We quickly move to the different parts of Alex and Milena's relationship, moving through time as if it were Jell-O. The editing is intricate, but not confusing As we change location back and forth, we begin to see more clearly how these two unlikely lovers ever got together <br><br>The motion picture is filled with exceptional images, and Theresa Russell is outstanding","user":"Nazi_Fighter_David","rank":[34,37]},{"title":"Roeg's forgotten masterwork","rating":10,"date":"20 June 2004","review":"When BAD TIMING: A SENSUAL OBSESSION emerged in 1980, its distributor dropped it like a hot potato. Sex! Surgery! Semen stains! Strippers rolling around on meshy overwire! It was all too much for the Rank Organization, a fading production empire with a long history of releasing family classics like GREAT EXPECTATIONS. (Curiously, Rank did sponsor a 'Win a trip to Vienna, location of BAD TIMING!' publicity contest at early bookings). The only reason they financed the picture, allegedly, was for its Freudian-tinged pedigree. When they saw the finished product, they labeled it 'a film about sick people, made by sick people, for sick people.'<br><br>Deviant psychology is but one of the many twisted pleasures in this tragically neglected masterpiece from '70s visionary Nicolas Roeg. With iconoclastic films like WALKABOUT, DON'T LOOK NOW and MAN WHO FELL TO EARTH, Roeg pioneered a new kind of film language. He replaced traditional narrative storytelling with stunning photography, explicit carnality and a signature editing style of jump cuts, cross cuts and subliminal flicker cuts Mixmastered into a mosaic of multiple interpretations. (Unlike today's A.D.D.-inducing overkill, Roeg's fragmentary cutting technique always provided insight into character psychology.) To those of us weaned on art cinema in the '70s and energized by the limitless possibilities of the medium, Nicolas Roeg was (and remains) a god. No filmmaker since has picked up the maverick torch that this deity carried for more than a decade.<br><br>Trying to encapsulate BAD TIMING's nuanced, character-driven plot is like describing Europe in a postcard. Essentially, it's about an eroticized interpersonal attraction that goes horribly awry, spiraling into jealousy, paranoia and (of course) sexual obsession. Theresa Russell's wild child Milena (the personification of Henry James' headstrong American girl abroad) is compulsively drawn to a fellow Yank stationed in Austria -- the buttoned-down, Freudian shrink/visiting prof Dr. Linden. Their passionate affair has led to a potentially tragic outcome, and it's up to a local police inspector (Harvey Keitel) to sort out what went wrong, why, and whether criminal malice was involved.<br><br>What makes this relationship drama so compelling is Roeg's structure: the film starts in the middle, jumps ahead to the end, then back to the prologue within the first four minutes  and continues in a non-linear fashion until the final shot. It takes us viewers a while to get our bearing, but it also elicits our rapt attention to detail. Never are we certain if the cascading flashbacks are meant to be objective on the filmmaker's part, or the skewed perspective of one of the three main characters. Is Russell a victim, or a tramp? Is Garfunkel a creep, or is that just Keitel's projection? Is Keitel a sympathetic doppelganger, or a crafty manipulator? The stars turn in complex, though off-center performances. Keitel turns miscasting to his advantage; never has he underplayed 'menacing' like he does here. Garfunkel's lack of charisma will turn many viewers off, but he's 100% believable as a shrewd, unstable shrink. Yet it's Russell who's the revelation  those who subscribe to the lazy theory that she can't act will be astonished here. What she may lack in formal technique, she compensates with fearless commitment. Hers may be the most passionate performance by a 21-year old ever captured on film.<br><br>Tony Richmond's widescreen photography is particularly rich in color and composition (the film's look was based on the art of Gustav Klimt). He shows us a Vienna that's cold, academic, clinical  but electric whenever Russell's on screen. There's a sequence in a university courtyard where he changes lenses, practically from shot to shot, to convey Russell's emotional collapse. (In the background, Keith Jarrett's 'Köln Concert' mourns her sad dilemma.) It's a heartbreaking passage, poetically surpassed only by the connecting shot of Garfunkel brooding through a polarized car windshield at daybreak. Frequently Richmond balances the stars' close-ups on the very edge of the screen, which is why the film's power is neutered on cable TV, where 2/3 of the image is lopped off. In that pan-and-scan atrocity, the screen is forever hovering on backgrounds and earlobes.<br><br>The real tragedy is that BAD TIMING has never been released on any home video format, and I fear it may never happen. It was made at a time when music licenses weren't automatically cleared for home viewing. Considering the eclectic soundtrack incorporates Jarrett, Tom Waits, The Who, Billie Holiday, Harry Partch and others, the idea of renegotiating deals at this point would be any lawyer's nightmare. Even worse, Roeg himself believes the few prints that Rank struck are probably lost or damaged beyond repair, and one fears for the state of the negative. My overlong, effusive review here is a direct plea for a rescue operation. Is any entrepreneurial DVD-releasing outfit willing to salvage this forgotten treasure from obscurity and give it the best letterboxed release possible? Once people are able to see this film as it was intended  for the first time in 24 years or more  I believe its reputation will grow immeasurably. There is simply no other film like it, and, based on current popular trends, nor will there ever be.","user":"arturobandini","rank":[127,154]},{"title":"Doubts that Bind","rating":22,"date":"22 February 2010","review":"Love is internal. It is sustained by questions of doubt, tension, expectation. The solidity of the hand is strengthened by the slipperiness underfoot.<br><br>So suppose you wanted to make a film about the fields that animate your anchor relationships. You couldn't do what everyone else does: deal with the tokens: the looks, the physical moving away of bodies and then re-entering. You want it to have the passion it deserves, which is a tricky thing: the passion in the relationships between the film and the viewer has to be based on the same field of passion between lovers. That field requires faith to overcome doubt. This need for investing in love as a counter to the doubts about love is what drives us, with religion and tribalisms as mere side effects.<br><br>Roeg wanted to do this. During a certain sweet spot in his career, he could shape any story into this, a story about what makes story. And to do it all by cinematic misdirection. This isn't \"Last Year at Marienbad,\" which is abstract. This is internal, subconscious, but with the real fleshy stuff we actually dream in.<br><br>Some viewers will think this is a simple detective story. Bad guy lies; insistent detective catches him. It is all about sequence, the \"timing\" of the title. What happens first; how the thing is \"explained.\"<br><br>But I believe this is something much more important. Like Roeg's other films, these are dreams. The things that happen here — that we see — drift close to what actually happens, and then away being more like imagined fears. <br><br>It is all about urges; the grandest passions rest on a collection of urges, most of which slip into uncontrollable futures.<br><br>I will advise you to approach this as something that goes on in the character's soul. Polanski and Kiesloswki have the same relationship to reality, but here we work closer to image and the uncontrollable ends. <br><br>The overall shape of thing is a love affair, one that is deep and all-consuming. The hero/filmmaker's mind has some tools that allow us to enter the world of dreams:<br><br>— He is a \"research psychoanalyst\" in Vienna. This is the most unlikely of cities for intellect, and even today produces ideas that fold in on themselves in tightly wound ways. Roeg quotes \"The Third Man\" a bit, and assembles a number of Austrian artifacts, all having something to do with control. It is Wittgenstein in his first period.<br><br>— He is a spy. He lectures about spies. He spies on patients as a theorist of obsession. He literally works for a spy agency, spying on the woman, who in other identities he is falling in love with. This is Wittgenstein in his second period, having renounced the genius of his knotted mind and theories of word play as mazes.<br><br>— He is a detective, instanced as a second being, a sort of \"Fight Club\" alter ego that examines himself from the outside. This is Wittgenstein in his third, suicidal period, where his work was on himself. He literally builds a container, a house, here a film. Harvey Keitel since Taxi Driver understood the idea of playing and imagined other. Garfunkle's cluelessness as a person and actor is overwhelmed by him, just as that part of the character's mind is.<br><br>These three fight for control of self over a woman. The film is so effective, and so energetically unsprung that there is a fourth layer outside. Roeg himself developed an obsession over this woman, falling deeply in love with her. (He would marry her.) <br><br>The visual storytelling, the editing, the timeshifting, the identity swapping, the depth of texture could not have been as effective were he not obsessively in love in the three ways of the doctor.<br><br>The genius of starting with Tom Waits and ending with Jarrett's Koln concert is by itself enough to make this an essential experience.<br><br>Ted's Evaluation -- 4 of 3: Every cineliterate person should experience this.","user":"tedg","rank":[17,18]}]