[{"title":"a legendary and fascinating mess","rating":19,"date":"19 May 2004","review":"Not too many movies create myths. <br><br>Anyone who read Harold Robbins', \"The Carpetbaggers\", (some 40 years ago) which in turn spawned \"Nevada Smith\", gets a superbly fictionalized accounting of Howard Hughes. Such fiction prefixes reality. It took a great number of years before I finally saw \"The Outlaw\" - an eagerly awaited event.<br><br>I've attempted to view the AMC-aired movie some three times - but got so antsy that I abandoned it. Few movies of this caliber have been so uneven. And yet it endures. Vintage alone gives the film status.<br><br>There's nothing wrong with anecdotal (vignette) - points-of-view movies, but in \"The Outlaw\", it was like watching one of those lumbering, exasperating silent films: where the actors stand across from each other, and each speaks their lines as if orchestrated by an off-stage conductor. Spontaneity is not this movie's long suit.<br><br>The actors: Jack Beutel is one of the most beautiful men to ever stand before a camera. His eyes are smoldering, his gaze laconic, his smile cheeky one moment and sensuous the next. Walter Huston is a young man in a middle-aged body; Thomas Mitchell (Scarlet's daddy in 'Gone With the Wind') is shifty, Irish, as conniving as Wally Beery, sniveling and crafty. And then there's the statuesque Jane Russell. Robbins gave us the intimate details of the suspension bridge-designed brassier - and Jane herself speaks of how she finally pulled the damn thing off and lined her breasts with a few Kleenex. She is as luscious as a near-nude Barbie doll, she is 19 years old, her lips inspire poetry - yet her voice is as monotonous as the Valley-inspired Val-speak of 25 years ago.<br><br>I wouldn't hazard to guess Howard Hughes' emotional consistency in the movie, however something went hellishly wrong. Someone fell on his face when it came to editing and scoring. Take the music, for example. It's Scoring 101, embarrassingly manipulative, often overriding the dialogue and ranging from 'Pathetique' to 'The Lone Prairie' mélange.<br><br>And then there's the acting: the Mexican senora rolls her eyes with all the panache of a 1940-Mexican B-movie bit actress. There is no spontaneity; she delivers her lines badly and with burning self-consciousness. And when Huston shoots Beutel in the hand, the latter doesn't even flinch; ditto, when he pierces both his ears with bullets. Staggering disbelief.<br><br>As to the scene where Jane Russell falls for Jack Beutel and kisses him, it's like watching two trains headed straight for each other. Overblown, top-heavy, agonizingly overreaching...it nonetheless has the sexual potency of an orgasm. The music, the god-awful Close-CLOse-CLOSE UP of Jane's lips bearing down on the half-delirious Beutel. Wow, what power! The men watching this film back in (ca) 1940 must have had to cover their laps.<br><br>I leave it to those with a sense of adventure to debate the movie's homoeroticism. There's no such implications from Beutel toward the two older men.<br><br>The movie, finally, has to be taken for the time in which it was made. The cinematography is as splendid as if it were turned 10 years ago. It is impossibly uneven, anecdotal, horrifyingly edited, pathetically scored, wretchedly acted...yet the actors are painful in their beauty. Many of the IMDb comments suggest that the film wants watching several times. I second that. It can be slow, cantankerous, giddy, sullen - but Jane's and Jack's beauty are undeniable, Walter is everybody's favorite grandfather. Toland can be thanked for giving us the movie's clarity. --And Howard... Howard was just having fun.","user":"IRVIN8","rank":[75,93]},{"title":"How fast was Billy?","rating":7,"date":"24 February 2005","review":"When I was 14 or 15, I sneaked into our local flea pit to watch this film. Billy the Kid was every kid's hero in those days. But the posters of Jane Russell was the main reason that I risked getting caught. She didn't let me down. Her first film, and it showed, but wow, she was a creature from another planet. I'd certainly seen nothing like her. Having been brought up on Johnny Mac Brown, the Durango kid, and the like, this film was, at the time, a revelation. My pals all wanted to know how fast Billy was. Did he shoot Doc Holliday? Did Pat Garrett shoot him in the back? All I wanted to do was describe Jane Russell.<br><br>I watched The Outlaw on TV this week, and was disappointed. Time had done it no favours. The background music, which I hadn't noticed the first time round, was truly dreadful (Tchaikovsky was it? mixed with cartoon type sounds) I still found myself admiring Russell, who for most red blooded males of my age has been a great inspiration. Like Shane, and others, I think this was a film of its time, and probably doesn't deserve to be judged by this generation, who are seeing it for the first time.","user":"beau geste 38","rank":[47,62]},{"title":"Truly One Of The Weirdest Movies I've Ever Seen","rating":4,"date":"11 October 2009","review":"There's something in its very weirdness that makes this almost worth watching - which is a positive, because there really isn't much in the story itself that would make it worth watching. Best known as the film debut of a very bosomy Jane Russell, the movie actually describes a completely fictionalized friendship between Billy the Kid (Jack Beutel) and Doc Holliday (Walter Huston). According to the story, Holliday arrives in the town of Lincoln, NM and meets up with his old buddy Sheriff Pat Garrett (Thomas Mitchell.) Their friendship is strained when Billy shows up on the scene and Holliday becomes more involved with him. That's really where the weirdness comes in. Although Billy and Holliday are supposedly in a romantic competition for Rio (Russell), this really comes across as a 3-cornered homo-erotic relationship, with Holliday jilting Garrett for Billy. In the scenes between any combination of the three of them, that's really the sense you get of the relationship. It's truly bizarre to watch, which is perhaps not surprising for a movie produced and directed by Howard Hughes, who was already in a period of significant mental decline while he was putting this out. Hughes' OCD undoubtedly led to the very realistic and surprisingly detailed sets, but there was a lot that didn't fit well at all - including a dreadful musical score and some ham-fisted attempts at humour. The movie also includes surprisingly little gunplay for a Western. There's really not very much of interest here, but for Russell's sheer beauty as well as the over the top bizarre-ness of the whole thing, it gets a 4/10.","user":"sddavis63","rank":[25,32]}]