[{"title":"Unjustly overlooked","rating":8,"date":"22 September 2002","review":"It puzzles me why this film appears to have been so forgotten and neglected because I find it richly entertaining and, like so much of Wilder's work, it shows an abiding, (although not uncritical), love / hate of Hollywood and all it represented. Wilder has no illusions about the Monster Hollywood could be in its heyday when it created an almost parallel universe which consisted of those on the inside the industry, and the rest of us who paid homage at the box-office. Both parties were almost entirely oblivious of the reality of life as experienced by each other.<br><br>FEDORA is much more bitter-sweet than SUNSET BLVD., (his other film with which it is natural to compare it, and of course the presence of William Holden in both makes this even more compelling), but here we see people who, having made a pact with the devil of Hollywood fame and fortune, find it is a two edged sword that keeps them in the service of its mores and values forever, even though the effort of doing so nearly makes them die from exhaustion. Death or permanent seclusion is the only way to preserve a legend's immortality.<br><br>Beautifully structured, and with some excellent dialogue, all the cast acquit themselves with credit, and I find it a fascinating and valuable glimpse into a world that has now gone forever and which is never, ever likely to return. Perhaps more reflective and introspective than we expect a Billy Wilder film to be, but all the more richly satisfying for it. Highly recommended.","user":"Dave Godin","rank":[51,66]},{"title":"Mesmerising and Historically Valuable","rating":30,"date":"30 June 2000","review":"I wish to defend Fedora somewhat from the sole previous IMDB reviewer. It is not a great movie such as \"Sunset Boulevard\" but it is hugely enjoyable and a real treat for anyone interested in old Hollywood, and the bitter-sweet quality of fading glamour.<br><br>Since the death of Marlene Dietrich, and especially with the publication of a biography by her daughter Maria Riva, it is now clear that Fedora is a direct portrait of Ms. Dietrich with much telling accurate detail.<br><br>Billy Wilder knew  Dietrich and old Hollywood well, and even though made in the 70's, the film captures a genuine essence probably for the last time as figures from the golden age of film have since then moved into retirement and sadly largely slipped the mortal coil.<br><br>The real story of the EXTRAORDINARY Ms. Dietrich is better than any of her movies, and Fedora tells some of that story. It makes for more comfortable viewing than Maximillian Schell's documentary \"Marlene\".<br><br>Wilder is an intelligent director, which makes \"Fedora\" worthwhile viewing. I have always found \"Sunset Boulevard\" a little too arch and self-consciously aware; \"Fedora\" is a more lyrical piece by the director as an older man.","user":"djj-2","rank":[42,57]},{"title":"little gem","rating":29,"date":"29 April 2018","review":"Many reasons for see this little gem. the performances, the atmosphere, the crumbs of old Hollywood, the tragedy of glory in passing time. and a touching story. remembering \"Sunset Blvd\". but being, for its bitter poetry, so different. for me, the basic motif for see it was the presence in cast of William Holden. and this \"key\" works. for discover not exactly a world but a form of survive. and its precise limits. a film about the traits of past. and meeting with wise use of suggestion, from illustrious names to small details of biographies for transform the film in a form of trip across Hollywood Golden Age.","user":"Kirpianuscus","rank":[6,6]}]