[{"title":"Iconic Film of the 1950s","rating":9,"date":"10 March 2009","review":"The wonderfully fresh and vivacious Jean Seberg here shines in her second film. The previous year she had played Joan of Arc (chosen from 18,000 young girls who auditioned for the role), and here Otto Preminger directs his protégé again to superb effect. The film opens with very dramatic music by Georges Auric. This film is based upon the best-selling first novel by the young Francoise Sagan, which created a scandal then but now is not scandalous at all. What passed for 'decadence' at the time was a life of aimless idling by the rich on the Riviera, some gambling, some boating, some swimming, some affairs, and a great deal of insipid self-indulgence. This we see epitomised in Seberg's father, played to perfection by David Niven, a shallow idler and womanizer who straightens his bow tie self-consciously between seductions in the bushes. He and Jean have a 'father-and-daughter-thing' because her mother died long ago, and they really don't want anybody else in their lives apart from casual partners with whom they can romp, only to throw them away when used, joking about them to each other as they get ready to have an evening out. As the film opens, Niven's girlfriend of the moment is Elsa, a charmingly empty-headed creature played delightfully by Mylene Demongeot, who shows such talent as a restrained comedienne. Juliette Greco makes a full-throated appearance in a club, singing the film's theme song all the way through as the dancing and whirling Jean stares at her glassy-eyed over men's shoulders, lost in haunted visions of regret. In 1958, the teenage girls of Britain all swooned over and identified with Jean Seberg, who seems to have originated the shorn boyish haircut which Mia Farrow later copied. Niven as the amiable cad was pretty much what one would expect. But into this mix comes Miss Straight, in the form of Deborah Kerr, who says to Niven when he gets flirty: 'I don't want to be casual.' That's for sure. When Niven finally decides he wants to marry her, she becomes a Little Hitler in no time, bossing Jean around, stopping everyone having 'fun', and generally making herself odious with her control-freakery. This leads to a campaign to drive her out by Jean and Elsa, who has been unceremoniously dumped. Meanwhile, Kerr has fallen hard, and in a revealing shot in the harsh sun we even discover that her true complexion was rather gingery and freckly, something concealed in her other films. Tragedy is not long in coming, hence the 'tristesse'. This is a social document of the 1950s which people interested in knowing what things were once like should watch. The film is directed by a master, Preminger, and Jean Seberg 'makes it' entirely. She is so refreshing, natural, young, real. Poor Jean Seberg. By the age of 40 she was dead. But she left much to remember her by: no one who has seen 'Breathless' (1960) can ever forget her. This film too keeps her wonderful memory alive. Her best acting performance was probably in 'Lilith', but she does well enough here, wholly dominating the screen and acting circles round the old pros. Oh yes, and then there's the inside joke about Eveline Eyfel playing three identical sisters who act as the maid, which is an amusing touch. The Mediterranean sparkles in the sunshine, the pine trees along the beach are exuding their aroma, swim suits dry in minutes: come on in, the water's fine!","user":"robert-temple-1","rank":[29,32]},{"title":"Preminger in transition","rating":9,"date":"18 July 2006","review":"A fascinating, frustrating, though ultimately deeply satisfying film. Many readers have commented on the frustrations, and they are hard to deny. My experience of this movie goes back to the early 70s, when I first encountered it in ideal circumstances, at the Museum of Modern Art during its complete Preminger retrospective, and in a gorgeous, perfect print. A great introduction to a film whose very meaning resides in its glossy surface. The first few minutes of the film powerfully set up the tragedy that is to come: Saul Bass's dripping teardrop titles underscored with Auric's deeply tragic music, followed by the first black and white scenes depicting Cecile's current active but deeply disengaged life. Then, as Cecile arrives home and begins remembering \"last summer\", the blue Mediterranean sea begins to invade the frame, little by little -- a striking effect, to say the least --, we are there, in the midst of a carefree vacation with Cecile, Raymond and Elsa, and quite successfully invited to forget the tragedy that seems to be in the making and enter a carefree, sunlit world where nothing, seemingly, could ever go wrong. Masterful film-making, and, thus far, perfectly pitched: Seberg's perfectly expressionless and beautiful face has no small part in making it work. That she is less secure in the flashback scenes is unfortunate, but her physical presence at least gives the right signs: this is a very young girl, happy but extremely shallow. (Yes, I will admit that the line readings are quite stiff -- no question she is \"acting.\" But, if one is already in the proper frame of mind they are not all that damaging.) What's important is the holiday mood, and the performances of Niven and Mylene Demongeot are sufficiently effervescent to evoke it. (Demongeot is a real charmer -- beautiful beyond belief and full of joie de vivre.) The arrival of Deborah Kerr on the scene changes all this: a dignified Lady coming into the midst of a world she finds immoral, distasteful and, in the deepest sense, unacceptable: her reaction to realizing that Raymond is, shall we say, shacking up with Elsa is the turning point of the film, the crossroads of comedy and tragedy. And from this point we are invited to see how, step by step, comedy turns to tragedy. What's most wonderful about this film is how diverting that progression is. The world of the French Riviera is, after all, a world of carefree bliss (at least on the surface), and we are given ample opportunity to enjoy that along with the characters in the film: a delightful casino scene (enlivened by the presence of that wonderful actor, Walter Chiari, a truly handsome man with a wonderful flair for comedy, and here, playing opposite Demongeot, particularly delightful) and a visually stunning dance at the dock, a masterpiece of costume design in delicious color and Cinemascope, worthy of a Minnelli musical (and, in its delirious scale, surpassing most of them). Finally, let me just say that the final moments of the film (and I will refrain from spoiling them) are among the most moving in all cinema: an evocation of self-loathing and emptiness that remains unrivaled in its beauty. Yes, beauty. Caveat emptor: It is useless to see this film in the pan&amp;scan version (I have had the experience, and it is horrible). The Columbia DVD edition looks great (absolutely NO extras, by the way; it appears to have been simply dumped on the market -- odd treatment of a masterpiece). Oh, yes, my title heading: Preminger's previous films had mostly dealt with \"little\" events -- noirs, small comedies, etc.; most of his subsequent films (\"Exodus,\" \"The Cardinal,\" \"Advise and Consent,\" \"In Harms Way\") with Big Events. This one is still on an intimate scale, but has much in common visually (particularly the masterful use of CinemaScope, to which Preminger took like a fish to water) with the later films.","user":"tentender","rank":[41,50]},{"title":"Jean Seberg weaves her magical charm on the viewer like none other.","rating":9,"date":"15 November 2004","review":"Jean Seberg is an absolute joy. I just wanna give her a big fat hug and kiss... well that's just two things anyway. What makes Otto Preminger's film so wonderful is that Seberg is the right age to play the part of a spoiled rich girl coming of age. Also the film is given an authenticity and heart because it was written by Françoise Sagan when she was the same age as Cecile (Seberg). That's right, this amazing and brilliant work was penned by a 17-year old. <br><br>The plot is fairly standard. A young girl living with her playboy father becomes jealous of his new love and when marriage is proposed she does her best to break it up. Gee nothing remarkable there. What is remarkable is the characters and their relationships. They have an extra amount of depth and the situation between Cecile and her father, Raymond (David Niven) borders on the incestuous. This gives it an added dimension and depth when Anne (Deborah Kerr) threatens to \"steal\" her father away. Another place where it avoids clichés is dealing with Anne. Kerr plays her magnificently and with a warm passion. She is not the wicked step mother here, but a sympathetic and self sacrificing woman who wants to bring love and stability into Cecile and Raymond's morally ambiguous and flighty lifestyle. This film while a modest success in America was a huge hit in Europe and inspired Jean-Luc Godard to work with Seberg. <br><br>Bonjour Tristesse also foreshadowed the films dealing with the idle rich that quickly popped up in its wake including two masterpieces, Antonioni's L'avventura and Fellini's La Dolce Vita. Preminger directs Bonjour Tristesse with a sure hand and I love how the flashbacks are in color and the present day scenes are in a somber black and white to fit with the mood. Oh and yes the story is told in flashback for the most part and the technique along with Seberg's narration gives a heightened sense of loss that Cecile and Raymond feel towards the events that transpired concerning Anne. Remarkable film and Seberg is so delightful and hot running around in her bathing suit practically the whole time. <br><br>Grade: A","user":"ztruk2001","rank":[64,82]}]