[{"title":"One of the most intelligent and moving films ever","rating":10,"date":"9 February 2005","review":"A Man For All Seasons is an erudite examination of the old Biblical maxim: a man cannot serve two masters. Sir Thomas More (poignantly portrayed by Paul Scofield) struggles to be true to both his faith and his monarch (the lusty and hearty King Henry VIII superbly played by Robert Shaw). I think it is difficult for citizens in our present secular society to truly understand just how central a role religion played in a man's life during the period of the film; it was an age of faith when Christianity exerted the most powerful of influences on one's thinking. On a side note, the American Republic wisely sought a nation that \"divided church and state.\" However, the fine distinction remains that it would be a state informed by faith but not run by the church. The aforementioned exemplary performances by the leads are backed by excellent supporting turns, especially from Orson Welles as the less than saintly Cardinal Wolsey and the eternally ebullient Susannah York as Sir Thomas's daughter Margaret. This is a true masterpiece that richly deserves all the accolades and plaudits it has received.","user":"perfectbond","rank":[136,146]},{"title":"\"This silence of his is bellowing....\"","rating":9,"date":"15 December 2005","review":"One of the greatest cinematic studies of the nature of personal integrity, I sometimes think that this film is in danger of being forgotten -- and it shouldn't be. One wonders at the degree of corruption in More's time that he should have been so highly regarded for his honesty -- and how he might have been regarded today.<br><br>What Robert Bolt and Fred Zinnemann had wrought is absolutely brought to glorious life by the incomparable characterization of Sir Thomas More by the chronically underrated Paul Scofield. Bringing superb support to the role are Nigel Davenport as More's close friend Norfolk, who is caught between the rock of his respect and concern for More and the hard place of his duty to (and fear of) Henry VIII; Leo McKern as the jovially sinister Thomas Cromwell, whose verbal jousts with More are virtual poetry from Bolt's pen; John Hurt as More's fair-weather friend Richard Rich; Dame Wendy Hiller as More's devoted but frustrated and misunderstanding wife; and the elegant Susannah York as his equally devoted and strong-minded daughter. Two stand-out performances in relatively small but vital roles: Orson Welles, magnetic as the shrewdly pragmatic Cardinal Wolsey; and Robert Shaw, whose energetic portrayal of a young Henry VIII (before his corpulent days!) dominates the screen the two times he's on it.<br><br>As with \"The Lion in Winter,\" the remarkable scriptwriting is the driving force behind the story, but Scofield's dignified, restrained, but at the same time quietly forceful delivery are what give the writing its power. The great quotes of the film (\"Why Richard, it profits a man nothing to give his soul for the entire world...but for Wales?\" \"When you are sent to heaven for doing your conscience, and I am sent to hell for not doing mine, will you come with me, for fellowship?\" etc.) are conveyed with either enormous gravity or poignancy by nothing more than the tone of Scofield's voice.<br><br>I think that the dilemma at the heart of the tale and how men of power came to grips with it is artfully summed up in the dying words of Wolsey and, of course, More. Wolsey regrets he did not serve God as well as he served his king. More, on the other hand, dies as \"His majesty's good servant...but God's first.\" Whether criticized or praised as a morality play, it's wonderful to at least HAVE an uncompromising morality play to watch from time to time -- especially one so well crafted.","user":"alynsrumbold","rank":[74,78]},{"title":"The Ultimate Lead Performance","rating":10,"date":"4 March 2004","review":"Paul Scofield's rendition of Sir Thomas More as written by Robert Bolt and directed by Fred Zinneman is the greatest lead dramatic performance EVER in cinematic history.  He is that magnificent.  He IS Sir Thomas More.  We feel his hope, weariness, fire, virtue, protectiveness, morality, and bemusement as richly as he conveys each one frequently, one right after another.  He was made for Bolt's dialogue, and Bolt's dialogue is drilled forever into our conscious by Scofield's flawless performance.<br><br>Everything else is also here.  Leo McKern is brilliant as politically motivated prosecutor, Lord Cromwell.  A bit subtler, but no less brilliant is Nigel Davenport as a man of some conscience, but not quite enough.  John Hurt is unforgettable as ambitious young Rich led into temptation by Lord Cromwell.  The incomparable Dame Wendy Hiller -- who passed just last year -- adds several more dimensions than her rather sparsely written role as Scofield's wife should have allowed for.  Every minute she is on the screen is magnificent.  Susannah York walks a tightrope between being scholarly reason and her passion for what is right.  Robert Shaw as Henry VIII and Orson Wells as Cardinal Woolsey are larger than life and completely compelling during their all-too-brief virtuoso solos.  The cinematography is lush.  The soundtrack is historically accurate and perfectly positioned. Key sounds punctuate three pregnant pauses with explosive impact.  The movie is technically as perfect as an historical epic can be.  The film is simply exquisite.<br><br>All that being said, as I reflect momentarily in my head on closing this, it is Scofield's incomparable and breathtaking performance which still leaves me in complete awe.","user":"tomreynolds2004","rank":[140,152]}]