[{"title":"A classic of the genre","rating":8,"date":"19 December 2007","review":"Shot in stunning B&amp;W Colditz is exactly what you'd want from a 1950s British war film - horrible conditions, very stiff upper lips, and lots of self-deprecation and self-deprecating humour.<br><br>THe surprise is how well it is directed and the acting - all of which are classic for its genre. Now overshadowed by bigger productions like the fictional Guns Of Navarone, Colditz is actually probably one of the truest to its source material, and is a rewarding view.<br><br>For this viewer it is notable because it is at times an uncomfortable watch - it really did try to understand what being in Colditz meant - and yet it is exciting, human, and full of wonderful moments.<br><br>Highly recommended.","user":"intelearts","rank":[23,24]},{"title":"First class prisoner of war tale - with British stiff-upper-lips to the fore","rating":8,"date":"13 March 2004","review":"Allied prisoners - that normal prison of war camps can't hold - are sent to a mountain stronghold that they are told is \"escape proof.\"<br><br>Colditz Castle (in Germany) remains one of the most daunting and visited memorials of World War II. Looking a little like Count Dracula's castle from the outside the very sight of it must have made many a heart sink - especially those that didn't know if they were going to their deaths. Even when they found out that they weren't they still had to be vetted to see if they were not stool pigeons!<br><br>This was originally a book and in the fullness of time it would be turned in to this film, a TV series (and a very good one at that) and even a hit board game. The film has to scrap a great deal of the (excellently written) book and can only represent a few of the many plot lines. In truth the prisoners ran out of escape ideas near the end and had only one left - to build a glider to escape from the roof. The war ended before it was tested!<br><br>Anything with John Mills in is usually pretty good (ok - Who's That Girl, with Madonna falls short) and this is no exception. The prisoners realise that escape committee's are needed so escape attempts - between various nationalities - wouldn't cross one another. Everything here is based on a real incident, although some of the facts around it are fictionalised.<br><br>A good memorial to a tough place and some tough people that were prepared to risk machine guns and attack dogs to get over-the-wall to continue the war. While this type of movie always has many dramatic plus points built in, it is - still - one the top hundred British movies ever made and one of my top two hundred (made anywhere) films. There isn't a second of boredom in the whole movie.","user":"Pedro_H","rank":[23,25]},{"title":"Made at the height of post - war optimism","rating":7,"date":"5 February 2008","review":"Most P.O.W.s had a fairly pragmatic attitude to their fate.They settled down,got on with life as best they could and sat the war out.Opportunities for successful escapes were very limited,punishments harsh,and chances of reaching home via a neutral country extremely slim. With a bit of judicious bribery life could be relatively tolerable and most of the German guards were all for a quiet life. But to some the very idea of imprisonment was an affront.They became obsessed with the idea of escape,making attempt after attempt.Colditz castle was opened up to hold officers from all over occupied Europe and the U.K.with such a history. \"The Colditz Story\" was adapted from a book by Major Pat Reid ( it says \"novel\" in the titles)about his time in the camp. He is played by Mr John Mills as a man almost exploding with frustration. He clashes with the Senior British Officer ( a first - class performance by Mr Eric Portman)in a most insubordinate and untypical manner over a planned escape attempt in the key scene of the movie where Mr Mills learns what burdens are borne along with high military rank. Mr Richard Wattis and Mr Ian Carmichael do a splendid turn as \"Flanagan and Allen\" at the concert party put on to cover the major escape attempt - the chorus warbling \"I belong to Colditz\" bringing a more modern interpretation to the term Camp Entertainment. Fun is poked at the Brits total inability to speak any other language than their own,the Poles,French and Dutch all being multi - lingual. Some of the behaviour of our chaps is rather public schoolboyish,but these were officers in the 1940s and quite conceivably many of their number had been at Winchester,Salisbury,Charterhouse or Rugby a few short years before and therefore hadn't had the chance to grow up. The scene at the end when Mr Portman quietly calms them down and averts a riot on \"appell\" is very well done. It was a very popular film in its day when it was still thought that winning the war would be the end of the obscenity of genocide,bullying megalomaniac dictators and death from the sky - and the start of a brand new age of decency,justice, liberty and prosperity for all.The fact that that didn't happen is the worst betrayal of the Allied soldiers who gave their lives.","user":"ianlouisiana","rank":[16,17]}]