[{"title":"20-somethings and the Goonies","rating":10,"date":"20 September 2004","review":"Just prior to graduating with a degree in Film Studies a lecturer asked us, \"So what's your favourite film now?\" Whilst my peers spouted out Goddard films and obscure German expressionist shorts I sat quietly thinking; my favourite film has been My Favourite Film since I was seven... So when it came to me and I mumbled \"The Goonies\", I was expecting scorn, ridicule and possibly minor injury, but instead was met with concurring shouts and whoops and cries of \"Hey you gu-uys!\" from the rest of the class. You see this is the unifying thing about The Goonies; mention it in a room full of twenty-somethings and they'll whell up and utter \"Sloth loves Chunk\" or adopt a harassed Chinese tone \"Thats what I said...Booty traps!\". And if that room happens to be a pub, several chairs will scrape back and semi-inebriated grown men will lift their shirts, shake their bellies and revel in the truffle shuffle. People may say it's an Indiana Jones wanna-be I think that is the defining beauty of it all. When we first watched The Goonies it was like watching our dreams come true on screen! We'd loved seeing Indiana's adventures and escapades and in The Goonies we saw kids like us actually doing it! They got to be just like the mini-Indies we imagined ourselves to be in the playground. But its not just the adventure that makes us love the film, we love those Goonies themselves. They were like our friends. We got annoyed with them sometimes, and we wanted to protect them, and we laughed at their jokes and cheered when they had a brilliant plan. Identifying with those kids was what we loved and why, as adults, we quote them and 'become' them when talking about the film. I still want to be like Andy, having a perilous adventure sliding down tunnels and facing the bad guys on a huge pirate ship... but of course also making time to kiss Brand AND Mikey! I also think that this is why Goonies 2 is such a relevant and exciting concept. We've all grown up together and I'd love to see how the guys are doing now...I just hope it doesn't disappoint... So if you've not seen it do it right now, and if you have kids sit them down, hold their hand through the scary bits and enjoy! They'll thank you in twenty years time!","user":"susannahvwhite","rank":[308,356]},{"title":"Goonies r good enough","rating":10,"date":"23 October 2002","review":"Anyone who grew up in the 80's will list the Goonies as one of their favourite films, or at least look back at it with a misty eye.<br><br>It had everthing you could want, thrills, spills, pirates, booty, adventure, freaks and bad guys. I just wanted to be a Goonie or go on a Goonie style adventure. Even the place where they lived was cool. A big old house in a picturesque bay town. You don't get houses like that in England. The only interesting thing you would have found in my loft would have been a dead pidgeon.<br><br>Then there were the Goonies themselves who just seemed so cool. Data's gadgets and smart mouthed ..erm.. Mouth.<br><br>We are first introduced to them one by one in the fantastic introductory sequence. The bad guys of the piece, the Fratellis, organise a jailbreak in a huge 4x4. In the process of doing so they speed past every member of the Goonies, introducing their character traits. Then they all get together at the leader Mikies house and just doss around for a while feeling sorry for themselves, because a property magnate wants to but there little town and turn it into a country club (although the bay looks like it would make a poor golf course, but hey). So this is the Goonies last day together and they have to do something about it. And don't they just.<br><br>What follows is like a comedy Hardy Boys crossed with a game of Mousetrap. Some of the set pieces are genius (the pirate, One eyed Willie, had a penchant for elaborate traps to stop people pinching his booty) and the sets are equally inventive. The gang get themselves into various scrapes with the traps, or the Fratellis or both and somehow always come out on top.<br><br>Richard Donner's direction is always brisk, the young actors performances are superb (specially the fantastic 'Chunk'), the senior cast is very good and the dialogue is chock full of hilarious lines.<br><br>I must admit I look back at it through rose tinted glasses. I was in awe of it when I was a kid, and now when I watch it, it reminds me of my childhood and all the things that was great about it. I cant fault the Goonies, even now. I still believe it is the perfect kids film.<br><br>I am probably preaching to the converted, but if you havent seen the Goonies, go and buy it now! And if you don't like it, what the hell is wrong with you!?!?!?","user":"nickthegun","rank":[168,209]},{"title":"The Goonies ARE good enough","rating":10,"date":"29 June 2005","review":"It was in 2001 or thereabouts that I watched and listened to the audio commentary track that is on the DVD version of The Goonies. Nostalgia is a wonderful thing, and seeing how the principal cast had aged (or hardly aged in Josh Brolin's case) was worth the price of admission on its own. But this is just one of The Goonies' selling points. Despite what the IMDb's ratings would have you believe, it is an immortal classic that warrants repeated and frequent viewings. It is not a coincidence that many of its cast and crew have repeatedly appeared in all sorts of productions before and since. Indeed, this was probably the first film that introduced me to the reality that the same actor will often play ten different parts in ten different films when I realised that Jonathan Ke Quan was the same brat that made parts of Indiana Jones And The Temple Of Doom so amusing. Seeing him in the video-enhanced commentary of the DVD nearly two decades later was a surprise and a half.<br><br>The film revolves around a group of children and adolescents who live in the poorer, less trendy part of a beachfront town. Unlike an episode of Barney, every member of this principal group is given a background and a string of differences from their castmates. You will not see the teenaged Brand responding to the same situation in the same manner as the ten year old Mikey, and that is where a major part of the film's strength is derived. The only weakness in the characterisations is with Martha Plimpton and Kerri Green, who join the adventuring boys a little way into the film. Exactly what they are doing other than giving the character of Brand something similar to himself to bounce his more adult-oriented lines from is anyone's guess, but they do work in their limited capacity. It is just a pity that Chris Columbus' screenplay did not give them a little more to do, other than defuse one fiendish trap towards the end of the ride.<br><br>Speaking of fiendish traps, the adventurers journey from one puzzling location to the next with barely a stop for breath. It works because unlike similar adventure films where the director expects us to be impressed by a fiendish-sounding name, the specific places that are visited by the Goonies have function. The bone piano shown in one such sequence, for example, would appear in the nightmares of children learning a regular piano for years after the film's theatrical release. It also gives Corey Feldman a good chance to act out a character who speaks very fluent Spanish. And while I am on that subject, who could forget the immortal scene early on in the film where Mouth deliberately loses something in the translation when Rosalita is shown around? But the prize for scene-stealing goes to John Matuszak, who plays the unofficial eighth Goonie, Sloth, with a weird aplomb that may well scare the willies out of parts of the intended audience. But then, in 1985, scaring the intended audience a little was considered a healthy part of making a film for those in the age ranges depicted here.<br><br>They say you cannot have a good protagonist without a good antagonist to bounce off. Robert Davi, Joe Pantoliano, and Anne Ramsey provide antagonists so good that they utterly hose the rule about not working with animals or children. The Fratellis work so well here because they are working with children. The late Anne Ramsey played her part so well that the mere thought of watching her in anything scared the willies out of me for years. Nowadays, as I have fully realised the mechanics behind film for some years, I am keen as mustard to see some of her other work in such pieces as Throw Momma From The Train (now there's a title that brings images to mind) or Meet the Hollowheads. That a performance can produce two entirely different reactions in the same person at different stages of their life should tell you all you need to know about its quality. Robert Davi and Joe Pantoliano are somewhat overshadowed here, but the manic, cackling quality of their introductory act also left quite a lasting impression.<br><br>You might have noticed that I have so far only mentioned the special effects in passing while heaping praise upon the acting. This is because unlike films such as the recent Star Wars prequels, the effects complement the acting rather than overshadow it. From what I am able to tell, all of the effects in The Goonies are practical, and some of them quite inventive. There is no use of blood squibs, which may disappoint some viewers, but there are enough mechanical sets and air vents to fill three films. Some of these effects did not turn out so well and were cut from the final film (the squid sequence being the most famous example), but unlike a lot of films that depend on special effects for a crucial element, everything shown in the final cut is in perfect sync here. Suspension of disbelief is never an issue, which is just as well considering some of the preposterous things that roll by the screen with a certain nonchalance.<br><br>I gave The Goonies a ten out of ten. Like Superman or the original Lethal Weapon, it shows that Richard Donner knows how to make a classic. Now that it is twenty years old, it stands forever as a relic of a time when the world of those under the age of eighteen was far less oppressive. If you have not introduced your children around the age of ten or greater to its joys and moments, then shame on you.","user":"mentalcritic","rank":[124,160]}]