[{"title":"An Interesting & Creative Film-Noir","rating":24,"date":"24 November 2004","review":"This interesting, creative film-noir is much less widely known than are most of the classics of the genre, but it is well worth seeing both for the story and the cast. In a relatively brief running time, it packs in a satisfying and unpredictable story with numerous turns, with a very good cast that work together quite well. The settings are well-conceived, and together with the photography and the rest of the production, they establish a convincing noir atmosphere.<br><br>Dan Duryea is always so good at straightforward villainous \"noir\" roles that he sometimes seems not to have received many opportunities to do anything else, and so it's very nice to see him get such an interesting role here. He delivers very well, believably portraying the different sides of a more complex character. He also works surprisingly well with June Vincent, as together they try to solve the mystery.<br><br>Peter Lorre does not have a very large role, but as you would expect, he makes the most of it. Toss in Broderick Crawford as the police captain, and you have a cast very well suited for film-noir.<br><br>The story is not all that complex, but it is well-written, features some well-conceived turns, and fits together nicely. Roy William Neill has a good touch with the material, not trying to make it fancier or bigger than it is, but simply crafting a solid, enjoyable movie that has just about all that you could reasonably ask for in a film-noir.","user":"Snow Leopard","rank":[44,48]},{"title":"Minor Noir classic is a treat.","rating":8,"date":"3 December 2002","review":"Don't miss this great Universal film noir mystery! Excellent cast brings to life a gritty story of neer-do-well songwriter, the murder of a dispicable sexy blackmailer, and the death sentence of seemingly the wrong man. Throw in wise guy police inspector Broderick Crawford, sinister nightclub owner Peter Lorre (in a fascinating role reversal from \"Casablanca\"--this time HE is the club owner)Peter Lorre is ALWAYS a treat!!<br><br>What a shame Dan Duryea didn't do more pictures! He's very effective in his role. The beautiful love interest June Vincent is another who should have made more pictures--she's very sweet and believeable.<br><br>This is another example of the Film Noir genre which was so popular in the 40s and early 50s--gorgeous photography, mood and plot twists!","user":"trw3332000","rank":[47,54]},{"title":"An unjustly neglected noir gem","rating":17,"date":"17 July 2003","review":"\"Black Angel\" (Universal, 1946) is one of the most entertaining films noir of the 1940s, that era when Hollywood discovered the genre and brought to it a high polish.<br><br>In this outstanding dark mystery, based on the novel of the same name by Cornell Woolrich, director Roy William Neill guides stars Dan Duryea and June Vincent through a byzantine plot that begins with murder and proceeds through the arrest and conviction of an innocent person, then finally ends with the true murderer being uncovered.<br><br>It sounds simple and straightforward, but Neill keeps the audience off balance throughout.  Just when we think one piece of evidence will pay off, it doesn't.  When we think another bit of business is benign, it turns out to be a crucial clue to the unraveling of the mystery.<br><br>Duryea and Vincent are compelling throughout, and they are supported by two excellent character actors, the always-sinister Peter Lorre and future Oscar winner Broderick Crawford.<br><br>And I like to think that with \"Black Angel,\" Universal finally atoned for the fatal mistake it made with another Woolrich thriller, \"Phantom Lady,\" in 1944.  In the book \"Phantom Lady,\" written by Woolrich under his pseudonym William Irish, the plot was a tightly woven murder mystery, with the revelation of the culprit coming as a surprise to all but the cleverest readers.  But when the story was filmed in 1944, Universal made the outrageous decision to reveal the killer's identity to the audience from the start.<br><br>In \"Black Angel,\" the murderer's identity is kept from the public until the end, the suspense is sustained, and the final scenes allow the audience to exhale after an hour and a half of diverting tension.<br><br>Now that \"Black Angel\" is available in VHS, you can enjoy one of the finest examples of American film noir on your own screen.","user":"eldorado2","rank":[35,41]}]