[{"title":"Enjoy irresponsibly","rating":7,"date":"20 May 2005","review":"\"A sports caris a sign of man's virility. You should get two, maybe.\" - Peter Sellers, to Woody Allen<br><br>'What's New, Pussycat?' is not a great movie. There isn't much in the way of a plot, it's constructed haphazardly, and parts of it don't make a lot of sense. <br><br>That's part of its charm. 'The Pink Panther', from the same era, also has a large, recognizable, hugely talented cast, and it's a much more coherent, technically proficient film. It is also less funny. <br><br>Just in case you've never seen anything about the movie before: Peter O'Toole plays Michael, a magazine writer and philanderer in mid-1960's Paris. His dilemma (dramatic conflict, if you will) is Carol (Romy Schneider) a woman he loves so much he wants to be faithful to her, if indeed he can give up all other women and marry her. Other women include Paula Prentiss, Capucine, and Ursula Andress; Woody Allen is the friend with the not so secret crush on Carol. Michael's psychoanalyst is played by Peter Sellers, which should tell you about as much as you need to know. <br><br>WNP? has a mood, created in large part by the Bacharach score, that I don't want to call innocent because it tries so hard to be naughty, but there it is. The drug culture hadn't yet picked up the cultural grip released by post-50's paranoia, and a sloppy, silly picture like this seemed to be a good idea. <br><br>And that's enough of that; a movie that contains the line 'it's my wife  the creature that ate Europe' shouldn't be over-analyzed. Enjoy it for what it is.","user":"bobf-9","rank":[57,70]},{"title":"Feather-light entertainment","rating":10,"date":"28 August 2007","review":"Some have \"analyzed\" this (movie) with the heavy, combat-boot tone of the cerebral and moral second-millennium spirit. They say it belongs to the past, the bad bad bad 60s, full of irresponsibility and partying, sexual license and depravity.<br><br>Well I say HA! --- HA! HA!<br><br>Forget all those (mostly young!) preachers and dive into a silly, inconsequential, wacky movie, full of unrealistic characters doing unrealistic things. It is colorful, full of joy and beautiful people, unpretentious and charming. And in the end, the guy gets the girl and they get married.<br><br>As a young boomer, watching this is like slipping into Hush Puppies. You may say what you want about or against the \"guilty\" innocence of that era, but it sure was comfortable! I miss those times. And a note for the moderns: we were not that innocent, we knew that some of this was dangerous ground... but what do you know, living is the thing that makes you die.","user":"corvinello","rank":[33,41]},{"title":"Michael James: \"Pussycat from the sky, I can't resist you\"","rating":6,"date":"29 April 2007","review":"\"What's New Pussycat? (1965) was directed by a British director, Clive Donner and it is the first feature film for which Woody Allen wrote the original screenplay. Allen also played a supporting role of Victor Skakapopulis, the friend of Michael James (Peter O'Toole). Michael is a fashion editor, surrounded by beauty and glamor of his models which he can't refuse. He truly loves his fiancée Carole (Romy Schneider) and wants to be faithful to her but what can a man do if the gorgeous women literally fell for him from the sky? He sees a psychoanalyst Dr. Fassbender (Peter Sellers) who is not much of help and faces his own demons. Meanwhile, Victor is desperately in love with his best friend's fiancée...<br><br>The movie reminds a lot \"Casino Royale\" - it was made in the 60s, has a great cast (Peter Sellers, Peter O'Toole, Romy Schneider, Capucine, Paula Prentiss, Woody Allen, Ursula Andress), strikingly beautiful women and the song by Burt Bacharach. It takes place in Paris - and it is almost as much mess as \"Casino... \" is - silly, naive, and often simply ridiculous but somehow it works after all these years. One of the reasons I believe is Allen's script, the dialogs and one-liners that are hilarious. This time, Allen received more screen time that in Casino.... and he made his scenes very funny. \"What's New Pussycat?\" is not a great movie but it is charming and I like it.<br><br>6.5/10","user":"Galina_movie_fan","rank":[19,23]}]