[{"title":"One of a kind","rating":25,"date":"25 January 2000","review":"Now here's a real oddity.  Made before the British scifi/horror boom of the late 50s, this eccentric film mixes gruesome scientific experiments with farcical comedy, set in a fictitious Iron Curtain state.  And one of the stars, playing a straight role, is Leslie Phillips.  So is it any good? Well the clash of styles is somewhat disconcerting, but the film is attractively photographed and the action and horror scenes well staged. Some talented personnel worked on it ; the likes of Ted Moore and John Box, plus John Gilling who went on to do some good Hammer horrors.  \"The Gamma People\" isn't quite in that league but still merits a viewing.","user":"heedarmy","rank":[34,38]},{"title":"SPOILERS HERE...Is your head getting warm Mr. Vilson?","rating":7,"date":"19 April 2008","review":"The Gamma People is a classic mix of post WWII aimlessness sprinkled nicely with a generous dose of Hitlerian medical experimentation by a quasi dictator named Boronski. Unnoticed by the outside world save a chance happenstance of an uncoupled railroad passenger car with 2 reporters, American and British sliding down a side rail and ending up engine-less in the rail yard of the Dutchy of Gudavia, the whole town is in an uproar about the arrival of uninvited foreign guests.<br><br>A postage stamp country if there ever was one, in fact, it's smaller than a postage stamp. With a pompous Hoenzollern-like police chief, a quaint hotel, and other assorted hovels leered at by a castle on the hill (that's where Boronski lives), Gudavia holds a hideous secret. The youth of the town are being zapped by Boronski with a huge gamma-ray projector causing two types of effects, geniuses like Hugo, a Teutonic dictatorial little snit and Hedda, a musical genius, able to whip out complex Beethoven or Bach at the drop of a piece of strudel, and morons, goon-like guys who run around with their arms at their sides and mouths wide open, catching flies, and moaning their compliance to the will of Boronski and his broken pitch pipe. The Brit Lothario goes wench hunting and ends up running into one of the goonies..<br><br>The two reporters decide to visit the schloss and see what's happening in Good Old Gudavia's seat of government. The castle is ostensibly a school, with a lot of secret doors that make the coolest sound when opening and closing.. much neater than the doors on the original TOS Enterprise. There, they meet Dr. Boronski's assistant Frau Wendt, who tours the guys around the school ending up with a sculpture class where they meet Hugo and his huge goon mask, that still scares me. Here and there mysterious deaths, screams and crumpled bodies in the bottom of ravines spoil the peaceful tranquility of Gudavia,maybe you were expecting all edelweiss and shtollen ? A totally trippy festival with an awesome musical piece is used quite effectively to flesh out a who's hunting who scene in the city streets. Finally, Hedda is kidnapped and conveyed to the castle where she, Paula Wendt and the American reporter Wilson are subjected to the gamma rays, while Hugo watches, becoming more and more upset until he finally turns on the doctor pushing him off a balcony as the building begins to crumple in the intense explosion caused by the falling Boronski. Hugo and Hedda and Wilson and Paula are safe, staggering away from the castle Boronski which is now erupting like a big volcano, fade to a happy scene another festival, Hugo and Heda are happy-go-lucky young children again, free of the shackles of artificially induced genius, now just a couple of crazy kids. I think I liked them the other way.<br><br>You can read into the movie whatever you want. I look at it as a classic that fascinated me as a child, and now still does as an adult. Safe, escapist, preachy but in a nice way, and entertaining. It may be corny and cheesy but hey, I like corn and cheese.","user":"dfarhie-1","rank":[21,23]},{"title":"Gamma Goodness","rating":6,"date":"24 August 2002","review":"A train-passage car carrying 2 reporters--one who resembles Prof. Quatermass a bit too much--accidently winds up breaking off from the rest of the train leaving the 2 men stranded in a strange little European country named Gudavia. Once there, they find they cannot leave as those running the country have other plans. They investigate and uncover a mad scientist's conspiracy to control the people by turning them all into slaves of the state with the help of a gamma ray machine. This movie is pretty outrageous and displays some serious leaps of logic. It also features a most unlikely change of heart in one of the main characters. Still the lead actors are likable and the film is silly  fun.","user":"Space_Mafune","rank":[21,26]}]