[{"title":"A wonderful portrayal of one woman's dream","rating":10,"date":"10 January 2001","review":"Who was Dian Fossey?  Enviromental enthusiast?  Insane eco-warrior?  Or both?<br><br>Gorillas In The Mist is the story of this extraordinary woman whose work with Mountain Gorillas in Congo, and subsequently Rwanda, quite possibly saved these beautiful creatures from extinction.  Her hard work and determination in studying these wonderful animals led to an amazing living arrangement with them.<br><br>How simply amazing must it be to touch, play and hold hands with a silverback Gorilla in the wilds of Africa?  How would it feel to find that same silverback with his head, hands and feet cut off by poachers? To be frank, these gorillas were Dian Fossey's children - each had a name, each had their own unique trait - so it is hardly surprising that she became a little possessive and started treating the animals as her own.  The horrors that she experienced on those mountains would send anyone mad.<br><br>Sigourney Weaver is simply superb as Fossey, portraying her hard work and gradual decline into insanity with that touch that only a few actresses possess.  Her chemistry with co-star Bryan Brown adds to the feel of the film and the fact that she was brave enough to go anywhere near real gorillas is fascinating.  To be fair, the two hours do drag a little, but Weaver is talented enough to carry the film through it.<br><br>Weaver once said \"I only get the parts that Meryl [Streep] passes up\" but to be honest, I couldn't imagine this brilliant woman being played by anyone else but Sigourney.","user":"GilraenEstel","rank":[49,53]},{"title":"Inspiring, moving, provoking and educational.","rating":26,"date":"26 October 2004","review":"Based on Dian Fossey's own autobiography, this true life story is inspiring and has helped these amazing animals in many ways by waking us up to their plight. Originally Dian herself was helping to make the film, until she was murdered and the production team had to go back and start it all over again several years later in 1988. <br><br>I am aware she did complete a degree when she returned to the USA in 1980 and wrote her book, which was published in 1983, and then revised in 1985. She returned to Africa in to help the gorillas and was murdered in 1984/1985 I believe near Christmas. <br><br>She may have done things that weren't ethical according to some, though her plight to save the gorilla came first. <br><br>This movie does give a fairly accurate but slightly toned down version of the events, which took place, though there were a few changes in details. It would be impossible to fit 13 years of events into just over one and a half hours of footage. So I think Hollywood did a good job.<br><br>The main alterations, leaving out some of the details of horrific animal abuse that would have otherwise pushed the rating up to an R16 and probably left any animal lover in tears. The details they left out as well may have made the film a little to shocking for the chief censors.<br><br>The special effects makeup, I believe done by Rick Baker, and real gorilla footage is seamless, making it hard to tell which parts were real gorillas and which are very well created costumes.<br><br>After purchasing the DVD I now realize they had Dian Fossey's original tracker with them to help with the film.<br><br>All up I think this film gives us just enough drama, action and thrills to make it a hit. I think Sigorney Weaver should have won an academy award for this especially considering how brave she was to film on location with real gorilla right next to her.<br><br>This movie has inspired myself to change my career path and am also reading the book, which I would recommend for anyone who wants to see how much more horrific the events were in reality.<br><br>This movie is a must see, who knows it may even change your life.","user":"aaronnz","rank":[27,30]},{"title":"very fine movie \"based on\" the life of Primate expert Dian Fossey","rating":8,"date":"20 March 2007","review":"this movie is based on the life of Dian Fossey and her work with the gorillas in a remote part of Africa.\"based on\" usually means that some of the content is true and parts of it are fictionalized for dramatic effect.for sure Dian Fossey did work with gorillas in Africa and was instrumental in the increase of their population.some of the details may have been altered,but the gist of the story is true.i thought it was a very entertaining,touching and heartbreaking story.i think Sigourney weaver did a great job as Dian Fossey.she really brought some passion to the character.the movie was also thought provoking and i actually became angry more than a few times about some of the incidents that occurred.i find it rare to become so actively involved with a movie nowadays.for me \"Gorillas in the Mist\" is at a strong 8/10","user":"disdressed12","rank":[10,10]}]