[{"title":"Still Innovative, Unbelievably Colorful","rating":8,"date":"15 November 2005","review":"Over 35 years later, this is still an innovative animated film: colorful, clever and different. In fact, you'd have to look hard to find a more colorful film ever made.<br><br>The Beatles characters are fun, spouting a number of good puns and inside jokes concerning lyrics from some of their past songs. The bad guys here, the \"Blue Meanies,\" are also fun to watch and really different from anything you've seen.<br><br>This is wild stuff which can appeal to adults even more than kids. The only improvement I would have made would have been to shorten it a bit. Even at a fairly short 90 minutes, some could have been trimmed.<br><br>The DVD is fine, except for the last 30 minutes when it gets grainy. However, the 5.1 surround sound more than makes up for that, affording the viewer to hear all these famous Beatles songs in a better format that surrounds you as a CD could never do.","user":"ccthemovieman-1","rank":[39,46]},{"title":"If you think music video started with MTV, see this film...","rating":24,"date":"24 June 2005","review":"\"Yellow Submarine\" is a great film but it's not because of the plot or even the whimsical, non-sequitur filled dialogue. \"Yellow Submarine\" works best as a series of loosely connected music videos that pre-date MTV by 12 years.<br><br>If you grew up with MTV and you think that most music videos consist of 80's Hair-Metal bands \"in concert\" or rappers in hot tubs with women in bikinis, take a look at some of the musical numbers in \"Yellow Submarine\".<br><br>You have \"Only a Northern Song\" which is presented with Andy Warhol style pop-art images. \"Nowhere Man\" is a whimsical, trippy, rainbow colored cartoon. \"When I'm Sixty Four\" is illustrated by a \"Sesame Street\" style numerical countdown. Even \"All Together Now\", for which The Beatles themselves actually appear on screen, contains little camera tricks and quick cut edits that are common tools of more recent music videos.<br><br>The two best segments in the movie, in my opinion, are \"Eleanor Rigby\" and \"Lucy in the Sky with Diamonds\". \"Eleanor Rigby\" uses black and white still photos of what is apparently Liverpool rotoscoped with occasional splashes of color to illustrate the dreariness of the lives of \"all the lonely people.\" The full-color rotoscoped images for \"Lucy\", such as the can-can dancing chorus line and the horse running in the field, are beautiful.<br><br>If you are a fan of The Beatles, great animation, or music video, this film is for you.","user":"edman59","rank":[40,48]},{"title":"Inventive, hilarious, and visually extraordinary","rating":10,"date":"10 March 2007","review":"'Yellow Submarine' is a visual stunner and an extremely well-scripted movie. There are lots of Beatles in jokes, George's fascination with Indian music and John's fascination with scientific theories are lampooned, the Beatles' power is joked about (\"Nothing's Beatle Proof!\") and poor old Ringo is just plain made fun of. The movie itself is arguably the most psychedelic ever made. The Beatles' descent into Pepperland is just one psychedelic scene after the other. The animation isn't great, but everything is just done so strange and fun that it becomes absolutely irresistible. The colors, landscapes, and creatures are just really different and vivid and vibrant. The songs are fit in very, very well (although \"Nowhere Man\" is undoubtedly the best sequence). Overall this works great as a musical or as an animated film, and there's definitely a lot of priceless, subtle dialog. I would name it one of the top 20 animated films of all time, really. Definitely worth watching, just because there simply isn't any movie like it.<br><br>10/10","user":"ametaphysicalshark","rank":[37,45]}]