[{"title":"Rodney Dangerfield at his best!","rating":9,"date":"25 January 2005","review":"Classic Rodney... expanding on the work he did in 'Caddyshack' as well as his own stand-up routine persona. He's crass, crude, and just plain hilarious. The whole joke of the movie is trying to force him to NOT be himself in order to earn the \"easy money\" his wife's mother has left in her will if he can straighten himself out. It's not just in watching him be \"Rodney On the Loose\", but also getting to see what happens when he's forced to stop being, well, Rodney. Even then, he's still Rodney, and maybe even more hilarious.<br><br>In this movie he has a supporting cast that's up to the job: Joe Pesci as his over-the-top best friend, Jennifer Jason Leigh as his newlywed daughter to a hilarious Taylor Negron, Candace Azzara as is fed-up wife. The scenes between Allison and Julio are classic line merits alone, without Rodney. The exercise bike into the Christmas tree is PERFECT Rodney. <br><br>And you will never ever walk away from this film being able to just \"browse\" around a dept. store again; nor will you resist wanting to go for your own \"Regular Guy\" look.<br><br>My sister and I have watched this movie maybe 50+ times since it originally appeared on HBO, and we still quote lines back and forth. \"Caddyshack\" we laughed until we cried; \"Back to School\" we chuckled. It was this movie that we still watch and go into fits over, reciting lines, because it is classic Rodney at is best. Not set to the side just to bring on a chuckle or two, not given some over-sentimentalized junk, but just the guy we watched doing stand-up late at night when we were probably supposed to be in bed.<br><br>Thank you Rodney from me and my sister!","user":"kirstymd","rank":[13,13]},{"title":"Rodney and Joe Pesci Rule the screen!","rating":10,"date":"21 December 2004","review":"The funniest film I have ever seen (29 viewings and counting)! Rodney's overall lifestyle as a married with two daughters Staten Island baby photographer who happens to drink, gamble, go to strip bars and get late night diner food with his best pal Nicky Marino (played by Oscar winner Joe Pesci), is unlike anything I've seen before and since. His struggles to live without his vices in order to collect the \"easy money\" are hilarious and include dealing with his daughter's slimy Puerto Rican boyfriend Julio and having to photograph a bratty child while still going through withdrawal. Pesci is a cross between his Good Fellas and Lethal Weapon 2 characters and has never been funnier.<br><br>This is a companion film for anyone who liked Caddyshack.","user":"BigfootNY","rank":[30,34]},{"title":"Watch this during \"must see TV\"","rating":9,"date":"17 February 1999","review":"Forget about those hyped up banal TV shows, and rent yourself a copy of this film.  It features Rodney Dangerfield at or around his acting pinnacle, as well as some early entertaining performances by Joe Pesci and Jennifer Jason Leigh.  Damn funny stuff from the beginning.  Suffer along with Monty as he is forced to give up most all the things in life he holds dear, so as to satisfy the requirements of his mother-in-law's will.  Some highly memorable situations and one-liners will serve as the basis of much reference material for fellow fans.","user":"Satch-2","rank":[20,22]}]