[{"title":"Va-va-va Voom Vice Raid","rating":6,"date":"4 January 2012","review":"Syndicate crime boss Malone (Brad Dexter) wants to get do-gooder vice cop Whitey Brandon (Richard Coogan) out of his hair so he sets up a rather intricate plot of framing him. Malone gets \"model\" Carol Hudson (Mamie Van Doren) to come into town and lie that Brandon tried to extort her during a bust. Thankfully, the department is prone to believing the testimony of floozies over their most decorated cop and Brandon is fired. So he sets out to get his revenge and receives an unlikely ally in Carol after her teenage sister is raped by one of Malone's hoods. This was actually my first Van Doren film and I enjoyed it. She is definitely a looker and you can bet the soundtrack fills with swooning jazz when she enters the picture. She is also pretty decent as an actress. Also of note is Juli Reding, who has one scene early on as a \"model\" who is more than proud to show her magazine work to Brandon (\"Close it up or you might catch cold.\") Coogan, looking a bit like Robert Stack, is good in the lead, if a little stiff. Director Edward L. Cahn definitely won't be accused of doing anything inventive during the proceedings, although there is a nice dummy fall during the final shootout.","user":"udar55","rank":[9,9]},{"title":"Also Take on the Syndicate","rating":7,"date":"6 February 2013","review":"A vice detective goes up against a call girl (Mamie VanDoren) and loses in court. But once unemployed, the cop starts handling investigations his own way.<br><br>I really liked this film. As a historian who focuses on organized crime, I liked the idea of the \"octopus\" and \"syndicate\" without the film having to say Mafia or resorting to Italian-American stereotypes. While the Mafia probably was the dominant force at this time (the 1960s), they were hardly alone.<br><br>The subject matter was also handled really well. Although the story centers on prostitution, it was done in a clean manner -- no sex, no nudity, no vulgar language. There were some slinky outfits, but nothing racy. Today, I doubt they could make this film without plenty of sex in it, and I much prefer this version. I liked it even more because of the narration.","user":"gavin6942","rank":[7,8]},{"title":"A fair to middling crime caper form the late 1950s","rating":5,"date":"12 August 2013","review":"Vice Raid (1960) <br><br>A sensational topic, some steamy jazz, and the gritty big city. Could be good, I think. And it starts with a bang and a twist. <br><br>But it does not keep its high level of surprise and suspense, and it never quite forms a convincing plot The center of it is a vice squad, which is a police unit that investigates what are moral crimes like prostitution and, in the old days, things like homosexuality. The units are much revised (luckily) from the days in the mid-Twentieth Century when they would do raids on gay bars and suspicious clubs with back rooms, you get the idea.<br><br>I watched this very B-movie look at a vice squad in an unnamed city (let's say it's Cleveland) partly for the photographer, Stanley Cortez, who has some classics to his credit, yet even the photography is routine. The actors, and the acting, isn't bad, and they generally are fitting for the plot, which does keep interesting if a bit stiff all along.<br><br>It starts with a well used omniscient voice-over that makes it a pseudo-documentary. And the first part of the movie is a straight up story of a cop going after prostitution in town. And then things go wrong. And then, in a fun shift, the prostitute becomes a main character and her sweet little sister comes to town. This gives things another dimension, and if not exactly any more convincing, it's a welcome layer.<br><br>Eventually the tables turn again, and we see law enforcement do a clever job breaking up a syndicate. I don't think this makes for great watching--and for 1960 it feels very old, as if the director hasn't noticed the times both in the movies and in television have changed.","user":"secondtake","rank":[4,4]}]