[{"title":"Great then and still great","rating":8,"date":"30 March 2005","review":"I just saw \"It Came from Outer Space\" on DVD today. The last time I saw it was in 1954 in a small town theaters on the Saskatchewan prairies. I was ten years old at the time and my world did not extend a hundred mile radius. I still remember that film until today. Beautiful Barbara Rush, calm, cool,intelligent Richard Carlson. Joe Sawyer could have been one of my neighbors. Full of suspense, intrigue, and mild fear, this movie was indeed a classic. Not knowing what the \"It\" looked like added to the mystery and wonder. Surprisingly no one was ever seriously hurt. Wearing those 3_D glasses and watching those rocks coming at you was pretty cool in those days. I was glad to see it again and relive those 50 years that have gone by.","user":"krydor2002","rank":[91,98]},{"title":"Holds Up Well","rating":8,"date":"29 May 2002","review":"This is director Jack Arnold's first science-fiction effort and one of the earliest to use a desert setting. Richard Carlson is very believable as an astronomer who, along with his fiancee, witnesses a meteor crash-landing that turns out to be a spacecraft. No one in the small town believes him until they start disappearing. Arnold uses theremin music to great effect, the photography is eerie, dialog (by Ray Bradbury) poetic, and the alien a terrifying large crawling mass with one bulging eye that leaves a snail-like trail in its path. The aliens are not bent on destruction - an interesting precursor to Steven Spielberg's expensive \"Close Encounters of the Third Kind\" (1977)- even its main titles are at the End. This is low-key, intelligent, satisfying drama. Co-starring are Barbara Rush (she's a babe), Russell Johnson (likewise), Charles Drake, Joe Sawyer, Kathleen Hughes (who's tantalizing in a cameo).","user":"twanurit","rank":[55,60]},{"title":"One of Arnold's best (even though it's not his favorite).","rating":23,"date":"23 November 2001","review":"Jack Arnold directed this screen version of Ray Bradbury's short story, `The Meteor',  about a crashed spaceship in the mid-western desert.  The alien crew kidnaps several inhabitants of the local  town and assumes their form. A writer of science articles (Richard Carlson) who lives on the outskirts of the town witnesses the crash, although he thinks it's just a meteorite. When he goes down into the smoking crater, he sees the open hatchway of the spaceship and an alien creature within it, but when the alien closes the big hatch it starts a landslide in the crater which covers the ship.  Afterwards none of the local authorities will believe Carlson's story about a buried spaceship filled with alien invaders.<br><br>A moody and beautiful movie, with fine music by Henry Mancini.  Many fans of Jack Arnold's sci-fi films consider this one his best (although personally I prefer `The Space Children' -- and so did Jack Arnold, according to his own statement).<br><br>Charles Drake (`Tobor the Great') is the skeptical sheriff.  Russell Johnson plays both a human and an alien (a treat for genre' fans).  The supporting cast includes Joe Sawyer and Kathleen Hughes.  Special effects by David S. Horsely and the great Clifford Stine.  Makeup by Bud Westmore, of the famous Westmore family who contributed much to all the `Star Trek' spin-offs.<br><br>Originally released in 3-D.  A 3-D tape was available a few years ago, but the quality was not good . . . sad to say.","user":"Bruce_Cook","rank":[54,60]}]