[{"title":"Up on that great island in the sky, Aaron Spelling must find this neat.","rating":7,"date":"24 June 2006","review":"Aaron Spelling's death yesterday brings to mind all of his work, including \"Fantasy Island\". I have never seen that show - the truth is that I don't really know his work at all - but I have seen the Looney Tunes' spoof of it. And let me tell you, \"Daffy Duck's Movie: Fantastic Island\" is really something. Portraying Daffy Duck and Speedy Gonzalez stranded on an uncharted island (hmmm...then couldn't they have done this like \"Gilligan's Island\"?) and finding a wishing well that Daffy uses to make money by granting visitors wishes, the movie manages to be clever as well as entertaining. Naturally, they use classic cartoons to show the various characters' wishes (such as Prissy wanting to have a husband, Porky Pig wanting to be an agent, or Granny wanting to be a nurse). But little does anyone know that Yosemite Sam and the Tasmanian Devil - whose ship just got sunk by Bugs Bunny - are searching for the person who stole their treasure map.<br><br>OK, so how many compilation films can there be, we ask. Well, this one has some neat tricks up its sleeve. And they still had Mel Blanc doing the voices, so it was good in that respect. Maybe up in that great cartoon studio in the sky, he and Aaron Spelling are having fun talking about this movie.<br><br>All in all, very funny.","user":"lee_eisenberg","rank":[4,4]},{"title":"A good compilation film","rating":8,"date":"10 July 2011","review":"I personally enjoy these Looney Tunes compilation films, they aren't a patch on the original cartoons but they're are very entertaining, at least to me even with the cutting and shortening of some of the cartoons.<br><br>Daffy Duck's Movie:Fantastic Island is a good compilation film. I prefer QuackBusters and Bugs Bunny/Road-runner Movie, but Fantastic Island is better than in my opinion 1001 Rabbit Tales and Looney Looney Looney Bugs Bunny Movie, which I also liked.<br><br>The cartoons featured are very entertaining, especially Captain Hareblower, though I don't consider either of them masterpieces, while the Yosemite Sam trying to do good and Sylvester battling a dog in the hospital episodes are very entertaining too. However one doesn't entirely work and that is the one with Porky Pig looking for talents I agree, Porky is more a support character and the cartoon wasn't as funny as it could have been, and I can understand if Foghorn Leghorn's goes over the heads over some, I get it now, as a kid I didn't.<br><br>The story surrounding the cartoons is a good idea, and kept afloat by the characters and witty dialogue, but it didn't make me feel any different about the rather short length and the fact the story feels rather thin and often feels like filler.<br><br>The Looney Tunes characters are delightful. Daffy is the star of the show, and I liked it that Speedy was less loud and abrasive as he can be in the hit-and-miss series he was in- the ones with Sylvester I liked, not so much excepting a few the ones with Daffy(ie. See ya Later Gladiator is one of the weakest Looney Tunes cartoons in my opinion)- while Yosemite Sam is still as cantankerous and amusing as ever before.<br><br>The animation is excellent, not just in the cartoons featured but also in the links. I admired also how much effort was done into making the characters and animation style as true to the original cartoons as much as possible. The music is also rousing and energetic, the dialogue witty and funny and the sight gags fresh and inventive. The voice work is top notch, June Foray is great as Granny but once again Mel Blanc gives a bravura performance.<br><br>Overall, a good compilation film. 8/10 Bethany Cox","user":"TheLittleSongbird","rank":[3,3]},{"title":"some of it's \"Fantastic\"...","rating":7,"date":"29 July 2005","review":"The Looney Tunes cartoons were always some of the most smartly written animated shorts ever. Long before robots and explosions dominated kids afternoons, the Looney Tunes staff depended on something harder: writing. Bugs Bunny being one of the more relatable cartoon characters for adults and kids. Adults laughed at his hidden references, kids laughed when he got Elmer Fudd to shoot himself. That magic of the old days is halfway featured here, in an obvious Fantasy Island spoof. It begins with perennial cartoon loser Daffy Duck stuck on a remote island with Speedy Gonazales (how the to got there is unknown). Following a fire-fight with Bugs Bunny on a ship, Yosemite Sam seeks sanctuary on the shores of said island. Daffy has discovered a map in a treasure chest that was sent airborne in the ship explosion, and it leads him to a magic wishing well. Instead of wishing to get off the island and become rich, he asks that the sand-glob be turned into a resort. Wherein he will charge tourists five-hundred bucks to wish in the well. Daffy Trump is born, and several notable Looney Tunes characters fly in to make requests of the well. The odd thing is, the well is not always forthcoming, instead screwing over the payee at the end. But, anyway, I'm getting sidetracked. What we're treated to are Tunes shorts from years ago, which are melded into people's wishes. Kids don't care if they've already seen it on Saturday morning, and just go with it. Others might be bored at stuff they saw 20 years ago. But if you have a vague memory of the shorts used, you'll enjoy it. Some clever ones like Sylvester the Cat battling a dog in a hospital room, and Yosemite Sam trying to go \"good\" in the presence of Bugs Bunny, who is the bearer of riches. The old material still comes off fun, but the new bits are definite filler. Daffy going through his manic motions, and Sam spending most of the film trying to match an errant feather to whomever stole his map. But if you can slog through that, you'll end up with some positive results in the \"flashback\" vain.","user":"mcfly-31","rank":[3,3]}]