[{"title":"Campy adventure for those with an '80s nostalgia kick!","rating":9,"date":"16 June 2005","review":"I enjoyed this movie as a kid when it came out, and to this day still do. A simple story involving the search for a kidnapped girl and an adventurer literally straight out of paperback lore. It has actors that were more recognizable back in the day. This shouldn't keep the viewer from giving it a whirl. Wayne Crawford stars as the main character Jake Speed. Sure, it might bite from certain elements of Romancing the Stone, and Indiana Jones. But this movie is done well enough to keep it out of the cellar. I am surprised not too many people know about it. It must have been overshadowed by other movies in the theaters back in '86. I watched it back then on cable TV. It might be hard to find since it's out of print on both VHS and DVD. I managed to get a DVD from ebay at less than 8 bucks! Cool flick.","user":"polo3378","rank":[17,21]},{"title":"You'll have fun","rating":10,"date":"2 May 2002","review":"The first thing I have to say is that I own Jake Speed. I've seen it at least 10 times. This movie is one of the most fun movies ever made. The film begins with Margaret (Karen Kopins) trying to find her sister. Her sister was kidnapped in Paris and the family has heard nothing. Along comes Jake Speed (Wayne Crawford), telling her exactly where her sister is and making an offer to find her. Jake Speed is a hero. He doesn't work for money because he just wants to help and have a good adventure. His partner (Dennis Christopher) follows him around and writes their adventures into novels. This film is a great adventure. It's hilarious, it's action-packed, it's just great. I guess it's a cult film with a very small cult following. Crawford is perfect as Jake Speed and throws out some one-liners that you'll never forget. Kopins and Christopher are also good as the girl and the sidekick, respectively. John Hurt, the guy who's stomach blew up in Alien, plays the devilish, pervertish villian which just adds to the fun. In many ways, this film is similar to Indiana Jones, in some ways it's similar to James Bond films. Maybe it should have been called Indiana Bond but whatever it's title is, it's a very enjoyable film.","user":"mynameisalreadychosen1","rank":[19,24]},{"title":"GREATLY MISUNDERSTOOD MOVIE.........","rating":14,"date":"14 September 2000","review":"\"Jake Speed\" was NEVER meant to evoke \"Indiana Jones\" in any way shape or form. This film is both a satire and an homage to the great pulp-fiction adventures of the cheap paperback literature series....ala` \"Doc Savage\",and the more contemporary exponents such as \"The Destroyer\" and other similar adventure series. In that light, the movie succeeds admirably,and should not be dismissed by those who came looking for Harrison Ford and did not find him......","user":"parmrh","rank":[18,23]}]