[{"title":"Fassbinder's darkest and most punishing examination of personal exploitation","rating":24,"date":"24 June 2008","review":"Many, if not all of Fassbinder's films focus on weighty, emotional issues and characters plunged into personal despair, but none more so than the torturous and overpowering melodrama of In a Year of 13 Moons (1978). Here, Fassbinder created a film that is completely miserable in both tone and content from the first frame until the last; with the director taking the personal loss over the suicide of his lover Armin Meier and turning it into a suffocating chamber piece of pain and humiliation. Like his earlier masterpiece, Fox and his Friends (1975), the film focuses on the personal exploitation and persecution of a sensitive character at the hands of the people that he loves, as he finds himself cast against a cruel backdrop of the grimy and oppressive homosexual sub-culture of 1970's Frankfurt. However, unlike Fox and his Friends, the spirit of Meier's death and the guilt that we assume Fassbinder was suffering from at the time of the film's conception have here removed any prevailing notion of hope or the promise of escape that hung-over the character of Franz - the lottery winning carnival worker from the aforementioned \"Fox\", as he sought an end to his cruel suffering - and replaced it with a continually degrading emphasis on shame and deprivation.<br><br>Fassbinder establishes the pitiless tone of the film right from the start, with an opening vignette showing our central character, dowdy transsexual Elvira Weishaupt, dressed as a man and wandering through a park in the early hours of the morning looking for trade. After successfully managing to hook-up with a suitably butch male-prostitute, her secret is soon discovered and the 'john', alongside a couple of similarly macho friends, beat and mock Elvira, leaving her as a shivering, crying wreck, half-naked on an disused train-track. From here, Elvira limps home to her cramped apartment only to be plunged into a torturous, violent argument with her ex-boyfriend, which again, leaves her used and humiliated. The film continues in this episodic approach as we follow Elvira over the course of a few days and eventually find out more about her true character and personality and the events in her life that led to the eventual creation of the person that she is when we first discover her. These events are no less cruel and humiliating to the character of Elvira - who has clearly made a number of mistakes, either as a result of naiveté, arrogance or blind stupidity - as we discover the process that turned a handsome young man with a wife and infant daughter into an overweight, alcoholic wreck, abused and betrayed by the various men in her life, and the social pariahs that hang on the periphery.<br><br>As ever with Fassbinder, the presentation of the film underpins the feelings of the character and the world that she inhabits perfectly; with the cramped spaces of her apartment made even more prison-like and oppressive by the director's claustrophobic use of staging, design and composition. Fassbinder undertook the role of cinematographer himself here and shot the film on grainy 16mm, which again, adds to the stark and colourless feeling that the film conveys. The ugliness of the cinematography, with its dimly lit rooms, fragment composition and awkward camera movements could be seen as either amateurish on the part of the filmmaker, or as a deliberate attempt to distance the viewer from the characters and the emotional subtext in a manner that is reminiscent of Brecht; or, more appropriately, Godard's cinematic appropriation of Brecht and his theatre of alienation. As with the subsequent political satire, The Third Generation (1979) - once again, shot by Fassbinder himself - the unconventional approach to cinematography is combined with further elements that attempt to similarly disarm us and make the process of viewing the film as difficult as possible. The opening scene itself is emblematic of this approach, with Fassbinder obscuring the frame with large titles and an opening text that scrolls slowly over the entire frame before continuing with his use of obscured images and fragmented mise-en-scene.<br><br>Fassbinder also uses jarring cuts, with scenes seemingly beginning during the middle of a conversation or after the context of the scene has already been established, whilst sound and the disorientating way in which the director has characters talking over one another while music plays disconcertingly in the background all continue this idea of deconstruction and emotional distraction. The ugliness of the film fits perfectly with its tone; with the legendary scene in which Elvira and her friend wander ghost-like through an actual slaughterhouse, where cows are dispatched in graphic detail, whilst a monologue is recited to give us the entire back-story of this truly tragic figure. Whether or not Elvira is an extension of Fassbinder or the personification of Armin Meier is unknown, though there is certainly that element to the interpretation. I'd imagine that there is also some of the director in the portrayal of manipulative antagonist Anton Saitz, who recalls the depiction of Fassbinder in the director's own segment of Germany in Autumn (1978). Regardless, In a Year of 13 Moons is a fascinating if entirely difficult work from Fassbinder; one that brims with an uncomfortable feeling of personal confession and searing self examination that is grotesque, repellent and utterly draining, whilst also standing as a powerful and passionately realised piece of work that is both remarkable and affecting.","user":"ThreeSadTigers","rank":[22,23]},{"title":"Brilliant, naturally, but very difficult to watch. (spoiler in first paragraph)","rating":8,"date":"1 September 2000","review":"Part melodrama, part infernal parody of 'Candide', 'In a Year of 13 Moons' is one of Fassbinder's most moving films, without once relinquishing his icy formal control or savage cynicism.  It achieves a remarkable effect whereby its protagonist's world seems to open up as the film continues - he begins alone, meets people, traverses a lot of places - but actually closes in, imprisons him, simply reinforcing the labyrinthine world of his own private hell, where the only escape is death.<br><br>When we first meet Elvira, the film's transexual heroine, she is dressed in men's clothing, trying to pick up boys in a dusky park.  When her female appurtenances are discovered, she is beaten up by  a group of thugs, left limping on a railway track, offering a promise of escape she cannot take up. Fassbinder's alienating method here is typical of the film as a whole.  It is very difficult to make out what is going on, the scene is very murky. Fassbinder's editing and composition tend to fragment rather than establish<br><br>the action, leaving us with a montage of darkness and sinister figures, scored to Mahler in an ironic rejoinder to the passive gay fantasy of Visconti's 'Death in Venice'.  To add to our confusion, Fassbinder's intertitles begin explaining the meaning of the title, making it difficult to follow both levels.  Just as we've finally made out what's going on, and the film reaches what might be considered a dramatic or emotional crisis, forcing the viewer into the scene, Fassbinder hurls us back, framing it in long shot, and throwing screen-filling credits over it!<br><br>So, while I suggested the film was moving, it's with no help from the director.  Elvira shares a narrative trajectory of decline similar to one of Fassbinder's most famous characters, Fox; indeed, here it is worse, she never begins with wealth and 'love', but is abused from the very start. The opening sequences reveal the extent of Fassbinder's despair.  Elvira is beaten up by thugs, in the outside world.  When she comes home, she is attacked by her so-called boyfriend, who abandons her, having savagely and interminably insulted her, mocking her alcoholism, her weight problems, suggesting her brain has shrunk - that it would be better for the world if she was crushed like an insect.  Fassbinder's vision is not a reassuring one; there is no refuge from a brutal world, the violent poison infects home and outside alike.<br><br>So Elvira would seem to be a figure deserving of our sympathy.  There is worse to follow, including being flung off her lover's speeding bonnet.  In true melodrama fashion, her past is revealed onion-like, and her tragic quest to find the entrepeneur Anton Saitz, to apologise for insulting remarks made about him in an interview, inspires devastating revelations, as does a trip to the nunnery orphanage where she was brought up.<br><br>\nThis mixture of emotional masochism and traumatic incident might suggest a film of overpowering pathos.  But Fassbinder never uses the methods that would allow us get close to Elvira's plain, sympathetic music, or the close-up.  Indeed, it is very difficult to make out the drama at all. Invoking his mentors, Sirk and Godard, Fassbinder does not foreground the drama; very often what is going on in the narrative is marginalised, squeezed into a tiny doorframe, so that what's privileged on screen is a door, or a wall, or the objects of a room; each scene is very lengthy, theatrical, like a self-contained episode, as, I suggested, in 'Candide', with lots of talk, stylised movements and positioning of character; at other times, you can barely make out characters in the dim lighting, who is actually speaking in a scene (this might be just my inability to differentiate German); even those scenes that seem to concern Elvira crucially, explanations of her past, for instance, have no room for her, characters talking about her as if she wasn't even there.<br><br>But, like Sirk, the film is shot through visually with Elvira's sensibility, her feelings of confinement, ironically, considering her apparent gender fluidity, a fluidity Fassbinder provocatively refuses to sentimentalise or celebrate.  Elvira's vision is truly one of hell, where horrific scenes in a slaughterhouse offer a peaceful refuge to the human world; of confined, indoor spaces, of intrusive decor; or frightening emptiness; one scene, with the suicide, glows with a blazing red light, suggesting infernal fires. This is not a realistically rendered Berlin, but a living nightmare - there can barely be 20 people in this sparse dream landscape, even though Elvira seems to travel the whole city.<br><br>Naturally, such a bleak Fassbinder film is incongruously funny (the reunion scene is unbelievably flippant), but the humour turns back on the viewer, and we must ask ourselves, when we laugh, are we laughing at Elvira, sharing in her oppression.  Is her lethargy, her paralysed will also sharing in her oppression?  The film is full of lingering images of destruction (eg the primitive computer games).","user":"the red duchess","rank":[31,35]},{"title":"Brutal, honest, excellent:","rating":10,"date":"29 August 2006","review":"The movie should have been called \"Despair\" had Fassbinder himself not made the film with that title just before \"In einem Jahr mit 13 Monden\" (1978) which was very personal for the writer/director who had to come to terms with his lover's suicide. This drama follows the last few days in the life of Elvira - Erwin Weisshaupt. Several years back, Ervin underwent the sex change operation in hopes to win love of the man he loved. It did not help him to make Anton love him and it did not make him happier. It may sound beautiful, \"I'll do anything for love, I'll be anything you want me to be\" but by trying to be someone else, a person simply loses his/her own identity, becomes lonely and desperate and has no way out.<br><br>The movie is the most touching, moving, powerful and devastating Fassbinder ever made - it is impossibly difficult to watch at times but it does not make it a bad movie. The acting is fantastic by everyone; the directing is tight and Fassbinder is always in control taking movie from its melodramatic roots to the heights of pure tragedy, never been over-sentimental and even providing some humor. The choice of music with the references to \"Death in Venice\" (eternal and never fulfilled longing) and to Fellini's \"Amarcord\" (looking back at one's life trying to find the roots in the childhood, to understand how and why the things happened the way they did) makes the film even more compelling.<br><br>Warning: there is a scene in the slaughterhouse which is almost unbearable to watch. It is the very important scene but be prepared for it. It does not spare any details of the job done and in its emotional impact is as horrifying as \"The Blood of the Beasts\" (1949), the short documentary by Georges Franju.","user":"Galina_movie_fan","rank":[22,26]}]