[{"title":"Portrait of an Artist as a Tortured Man","rating":10,"date":"31 December 2006","review":"Kirk Douglas is Vincent Van Gogh in \"Lust for Life,\" directed by Vincent Minnelli and also starring Anthony Quinn as Gaugin (Oscar winner for his performance), and James Donal as Van Gogh's brother Theo.<br><br>This film is actually based on the Irving Stone novel and while it leaves out parts of Van Gogh's life, it does seem to hit the high points. A sensitive man with a spiritual sense of life, Van Gogh seeks from the beginning to express God in some way and to give something to the world. He is unsuccessful as a minister and eventually takes up painting, supported by his loving brother Theo. Basically he lives somewhere until whomever he's living with gets sick of him and throws him out. He is a terribly lonely man, but he has an intensity that is almost frightening to people. At one point, he takes up with a sometime prostitute with a baby - she eventually leaves. In actual fact, when Van Gogh met this woman, named Sien, she was pregnant with a second child, who grew up believing Van Gogh was his father. Sien some 20+ years later commits suicide.<br><br>Van Gogh establishes a friendship with Gaugin and has dreams of an artist colony, but his relationship with Gaugin, as with everyone but his brother, ends terribly when he stalks Gaugin with an open straight razor, later cutting off part of his own ear. It is evident from the film that whatever Van Gogh's mental problem was (and there are many theories, from bipolar, to epilepsy, to schizophrenia), it worsened as time went on, as did his physical condition. He would often buy paints rather than eat and would work ceaselessly.<br><br>Van Gogh only sold one painting in his lifetime - however, what the film does not show is that, had he chosen to live, he was on the brink of being recognized for his work. His paintings had started being exhibited and appreciated and began to sell shortly after his death. What also isn't in the film is that his brother died shortly after Van Gogh did. It was Theo's widow who carried on the work that would be involved with Van Gogh's vast collection.<br><br>The film reduced me to tears - indeed, the song that says \"they should have told you, Vincent, the world was never meant for one as beautiful as you\" was certainly true. The only person who ever \"got\" Vincent was his brother.<br><br>As for the performances, Kirk Douglas makes a brilliant Van Gogh. Michael Douglas once said his father isn't considered a great actor because the style back then in the types of roles he played has changed. It's true - seen today, Douglas' work seems too intense at times, too big, too over the top in these times of acting so naturally as to almost be boring. However, I believe that Van Gogh must have been like the Douglas characterization. He obviously drove people away in large masses, and Douglas captured that passion, drive, and overeagerness perfectly. As Theo, James Donal is perfect as the calm one in the family. Anthony Quinn has a short but memorable role as the flamboyant Gaugin. He's wonderful - arrogant, opinionated, temperamental, with a bad temper, and Quinn plays him as an artist without the soul of Van Gogh. But who, after all, had the soul of Van Gogh? Vincent Minnelli lovingly directed this film and it definitely has his wonderful attention to detail, flow, and artistic touch. And the paintings are breathtaking. A beautiful film that will stay with you for a long time, and you'll never see \"Starry Night\" in the same way again.","user":"blanche-2","rank":[57,68]},{"title":"Brilliant, Yet Painful Classic Offers Douglas' Finest Performance...","rating":10,"date":"3 January 2007","review":"\"Lust for Life\", Vincente Minnelli's rich interpretation of Irving Stone's Vincent Van Gogh bio-novel, is a film both compelling and repelling; in delving into the psyche of the artist (unforgettably portrayed by Kirk Douglas), one can see an untrained, unbridled genius smashing convention to open viewers' eyes to a world defined by passion; yet in doing so, we share in the growing nightmares and agony of his creative mind, teetering toward the madness that would destroy him, and it is an unsettling experience, to be sure! <br><br>This is a film so rich in visual imagery (with a Technicolor 'palette' that attempts to recreate Van Gogh's view of his world), that it demands repeated viewings, just to savor the details. From wheat fields 'aflame' in color, to night skies that nearly writhe in waves of darkness, the elemental nature of the artist's vision is spectacularly captured. And in experiencing the world through his eyes, the loving, yet uncomprehending concern of his brother (James Donald), and more hedonistic, shallow patronizing, and gradual disgust of fellow artist Paul Gauguin (Anthony Quinn, in his Oscar-winning performance), become elemental 'barriers', as well. Van Gogh wants to 'speak', but no one can understand his 'language', not even the artist, himself! <br><br>Kirk Douglas never plunged as deeply into a portrayal as he did, in \"Lust for Life\", and the experience nearly crushed him, as he related in his autobiography, \"Ragman's Son\". His total immersion in the role SHOULD have won him an Oscar (Yul Brynner won, instead, for \"The King and I\"), and his bitterness and disappointment at the snub would haunt him, to this day. With the passage of time, his performance has only increased in luster and stature, and it certainly shows an actor at the top of his form! <br><br>\"Lust for Life\" is an unforgettable experience, not to be missed!","user":"cariart","rank":[39,46]},{"title":"An Accurate Biopic","rating":17,"date":"17 February 2001","review":"This film is a rarity, a biopic which is more accurate than the book it's based on. Irving Stone's book was a major best-seller which did much to make Vincent Van Gogh one of the ten most famous artists in history but it did have its inaccuracies, particularly when it depicted its protagonist in Paris with other great painters of the time. In the book, Gauguin, Lautrec, Cezanne and Rousseau come off as typical bohemians while Vincent was made much more of a leader than he was. Minelli doesn't give us a detailed look at any of the artists except Gauguin but he is more accurate about who influenced Van Gogh and he does include his best friend, the now-forgotten Emile Bernard, if only as an extra in Tanguy's shop.<br><br>When Lust for Life came out, several critics dismissed it as too lurid and melodramatic, but those adjectives are accurate in describing Van Gogh's life. Note that Kirk Douglas does not play his usual cool, fun-loving tough guy and actually uses his whole body in his acting. For once Hollywood outdid itself.","user":"phred22","rank":[49,59]}]