[{"title":"A total hack job, but still quite entertaining","rating":6,"date":"13 July 2007","review":"'Game of Death' is the equivalent of having your dog swallow a gold ring - you've got to sift through the cr*p to find the polished stuff.<br><br>Completely different to Bruce's original vision, the 1978 version is hugely controversial. To some, it's a shameless cash-in and insult, to others it's a curiosity. To me personally, it's a guilty pleasure. Obviously, with such limited footage of Bruce Lee to use, the film was always going to suffer. Not only that, but how do you incorporate the footage into a film and give it context? The stand-in's that are used to fill the time leading up to the Lee footage are never going to fool anyone. Even as a kid, I could tell it someone else. The techniques used to have Bruce Lee on screen range from awful (superimposed heads) to tasteless (his real funeral) to fairly good (quick cuts from old footage). The disguises that Billy Lo and Bruce's doubles wear throughout the film are hokey but nothing that we haven't seen in Lee's films before (Fist of Fury), so that didn't bother me too much.<br><br>Despite some awful dubbing and a poor script, 'Game of Death' is still watchable for it's action. Fight choreographer Sammo Hung makes the non-Lee fight scenes entertaining even if the doubles don't match Bruce Lee's speed or technique. However, they do capture some traits of Lee's fights including the slow motion finishing move. Also, the film's budget allows for a number of locations ensuring that Billy's quest for revenge keeps moving. In this regard, the Hollywood frills that are added give the film a degree of watchability, especially the classy score which appears throughout and heightens the final scenes.<br><br>But of course, the main point of watching 'Game of Death' is to see Bruce in action. Although criticised for cutting down the \"pagoda sequence\", I think it still contains enough to satisfy. You have to remember that this original footage included two companions of Lee's who don't feature in the 1978 film, meaning a lot had to be left out. The nunchuk duel is unique while the fight with Kareem Abdul Jabbar is bizarre but thrilling.<br><br>There are some moments of bad taste, but on the whole the film is a cheesy and quite fun attempt to build up to the final 20 minutes. Whether you think this was a cash-in or a tribute, you still need to see it in order to understand the 'Game of Death' phenomenon.","user":"mjscarface","rank":[43,45]},{"title":"dubious but entertaining","rating":6,"date":"5 August 2000","review":"lee didn't manage to finish this film but director robert clouse (of e.t.dragon fame) manages to pick up the pieces left behind and make a film out of it which is where the film falls down. you see they had to bring in stunt doubles to replace Lee so everytime he's wearing shades or has his back to you you just know that it's not really lee. for the scene in which lee is shot they reused scenes from the superb fist of fury(it is sooooo obvious because the colour quality is different)!!! apart from the fun of spotting which scenes lee failed to complete, the changing room scene is fantasticly good fun to watch, your jaw will drop open at lee's two final finishing moves the penultimate kick is compareable to lee's complete bicycle kick in e.t.dragon. overall this film is well worth the mere £5.99 of which it costs in england","user":"molotov85","rank":[22,24]},{"title":"A Bruce Lee movie that appears to have been edited by Ed Wood, Jr.!!","rating":4,"date":"14 February 2007","review":"Let me explain the above comment. In the horrible movie PLAN 9 FROM OUTER SPACE, writer/director Ed Wood, Jr. incorporated some footage he'd shot of Bela Lugosi just before Bela's death. While the footage had nothing to do with the script for PLAN 9, Wood decided to \"cleverly\" use this film and hash out Lugosi's role by having a much taller guy (a dentist by the way) hold a cape over his face in all the Lugosi scenes not available in the original reel of footage! The result, not surprisingly, is horrid. Now all of the reason for PLAN 9 being named the worst movie ever made wasn't all due to the Lugosi footage, but it was one of the main factors contributing to the pure crappiness of the film.<br><br>In the case of GAME OF DEATH, some initial footage had been shot back in 1972 but was temporarily shelved in order to finish another Lee film. But, Lee's untimely death left about 30 or 40 minutes of unusable footage. So, the studio big-shots decided to \"pull an Ed Wood\" and use the old footage and write an entire movie around it--using extras and irrelevant footage to make a \"coherent\" film. Well, the result wasn't great but at least it was a good bit better than PLAN 9! As far as integrating a dead guy into a movie, the results were often pretty pathetic. Now I am NOT saying they shouldn't have made the movie. Instead, they should have just admitted that they were using a double and not even bothered trying to fool the audience--it just wasn't possible! Having an extra wearing sunglasses inside and out just looked stupid and playing the part straight, without stupid tricks, would have been better. A couple other stupid \"tricks\" they tried to make a coherent film included cutting closeup shots of Lee into scenes where he obviously wasn't acting! His clothes and the backgrounds just didn't match the double! The worst case was near the beginning when Lee was supposedly almost killed by a falling light. The close up was of the Real Lee--standing outside against a brick wall. But, the scene was filmed INSIDE and there was no brick wall! This was true Ed Wood editing!!! Even worse was one scene where they literally pasted Lee's face over another person's face for a very brief scene! Clutch Cargo episodes were constructed better than this! Probably the creepiest aspect of all this was that Bruce's son, Brandon, also died prematurely while filming THE CROW and the studio did pretty much the same trick (though with modern computer techniques it did look better). In addition, to add another creepier element, Brandon was killed in an on-set accident where he was killed by a prop gun---something that is in the plot of GAME OF DEATH--when a bad guy pretends to be using a prop gun but really shoots Bruce in the face!!!! This is just so surreal and sick. Also surreal and sick is seeing Gig Young in his final film--just months before he killed himself and his partner! This truly seemed like a cursed production! While I am trashing the film, I may as well point out a few other things before I actually go on to praise the film. First, while I greatly enjoyed watching Chuck Norris BRIEFLY at the beginning of the film, somebody should have told him to shave his back hair!!! Chuck just looked like some sort of missing link with all that hair--a major turn off and something I am surprised made it into both this film and another Lee picture, RETURN OF THE DRAGON. Second, the female co-star Colleen Camp very ably sang the final song in the film but when they show her singing earlier in the movie, she's obviously out of sync with the music.<br><br>Now apart from the MANY serious flaws with the film, let's talk about the good. While a tad cheesy, the overall production values were pretty good (apart from the way they dealt with Lee)--especially for a kung-fu movie. Seeing the American supporting actors (especially a foul-mouthed elderly Dean Jagger) was pretty interesting and the music for the film was exceptional. The opening titles were highly reminiscent of a James Bond film and the recurring strains throughout the film were very clearly inspired by the music from ON HER MAJESTY'S SECRET SERVICE. Plus, the effects and fight scenes were pretty good throughout.<br><br>Despite occasionally seeing tiny glimpses of Lee in the first 2/3 of the film, he is the clear star of the final portion of the film--the only portion of the movie that should have included Lee in my opinion. Here, he does perhaps his best stunt-work ever and the battles are well worth seeing for fans of the genre. In particular, seeing Lee fight Kareem Abdul-Jabbar was majorly cool. It really is a shame that such great material was never used the way it was originally intended. For fans of Lee, this is STILL a must-see film, but for most others it's a mixed bag--a lot of good and a lot of really, really, REALLY bad editing.<br><br>FYI--In the wonderful kung fu comedy, SHAOLIN SOCCER, the goalie is clearly meant to look and act just like Bruce Lee. In fact, his yellow outfit is a copy of Lee's in the finale of GAME OF DEATH. This was a cute little homage to Lee.","user":"MartinHafer","rank":[9,9]}]