[{"title":"Vastly underrated / unnoticed film","rating":9,"date":"3 August 2005","review":"3 O'Clock High is a wonderful film. It bears little resemblance to the 80's teen archetypes, such as _Fast Times at Ridgemond High_ or the Hughes films, excellent as those films may be. 3 O'Clock is purely plot-based; a sensitive view of teenage angst can be found elsewhere.<br><br>The basic plot: Jerry Mitchell, everyman adolescent, manages to get himself into an after-school fight with the school psychopath Buddy Revell by 8:00 am, and spends the next 7 hours contriving every scheme to escape the certain flogging which awaits him at 3pm. The film opens with a clicking alarm clock (peculiar for an electric clock) and ends with an image of the school clock; in between, clock dials, and class bells serve as symbolic death watch beetles.<br><br>Jerry's gradual disintegration amongst his friends, the school administration, and the school store manager as well as his physical and moral decline as the day wears on is very amusing.<br><br>What's memorable about the film is its radical cinematography which we presume is the contribution of long-time Coen collaborator cinematographer Barry Sonenfeld. Extreme wide-angle shots, and a clever technique of high-speed crane shots make for a very distinctive look (which I have never seen duplicated). While clever technique this could create a ponderous over-theatrical look (like some of Spielberg's 80's work as viewed today) or a vapid MTV look, Joanou uses the showy technique to great effect and the film looks as fresh today as it did nearly 20 years ago.<br><br>The enigmatic Buddy Revell is a wonderful creation, masterfully introduced by a continuous moving shot following, in succession, three sets of exchanges between students recounting Buddy's legendary reputation for psychotic violence. The roving camera threads through each group of students as deftly as if in a Fellini film, (at the risk of being bombastic).<br><br>As well as a sharp plot and dialog, and an innovative technique and excellent production values, the assembled cast is uniformly superb. Casey Siemaszko is perfect for the role, and Richard Tyson gives an absolutely straight interpretation of Buddy Revell. Seconday roles are played by character actors Jeffrey Tambor, John P. Ryan, Mitch Pileggi among others.<br><br>In conclusion, you know it's a special film because so many of the images and the dialog stick in one's mind. The cheerleaders tearing apart the effigy and skull as the horrified Jerry watches, the library shelves toppling like dominoes to reveal Jerry and Vince cowering in the corner, all of the scenes with \"The Duker\", the Dean of Discipline's dungeon of an office, the educational 8mm insect film, the sinister retelling of the Iliad, Jerry frantically attempting to break open a cash register using a world globe and fire extinguisher. <br><br>The film probably didn't make it big because no big names were connected to it. Joanou would go on to do a curiously unrelated string of projects, some music videos, television documentaries, and even sitcom work. He did do another mainstream film _State of Grace_ (1990) with Sean Penn, another excellent and underrated film.","user":"shino","rank":[62,66]},{"title":"Very good, sadly ignored, teen movie of the 1980s.","rating":10,"date":"3 September 2004","review":"This is a teen comedy from the 1980s, every bit as good as anything made by John Hughes in those days (Breakfast Club, 16 Candles, etc.).<br><br>The plot: our hero, Jerry, is assigned by the school newspaper to interview the new kid at school. The new kid, Buddy, is a big thug with an attitude. To make his reputation, Buddy bullies and intimidates Jerry, and tells Jerry that, come three o'clock, he is going to beat him up. Jerry spends the rest of the day trying to get out of participating in the fight.<br><br>The story is full of the usual parodies of teen-aged stereotypes, but they are somehow more believable and human than the characters in most films of this genre. The protagonist, for example, suffers from under-confidence resulting from being hypoglycemic. The story is all about him overcoming his under-confidence (a process we all go through in high school), which is a really common plot in teen movies. What comes through in this film is that *all* of the students are going through the same process. The cool, spooky girl next door turns out not to be so cool, underneath. The hero's buddy tries to help in the struggle, but gets sick of him and abandons him. The villainous tough ends up feeling ashamed of himself. These comic characters stick with you because they are so much like real teenagers: naive, under-confident, and overreaching.","user":"el_nickster","rank":[32,33]},{"title":"A great film that was never given a fair chance.","rating":22,"date":"22 June 2005","review":"Another little known, rarely mentioned film that for unknown reasons fell between the cracks. When atrocities like The Wild Wild West and Men In Black I &amp; II make hundreds of millions, it is an enigma that great films such as Three O'clock High languish in obscurity. I am an avid film buff but have no recollection of this movie ever being released. It only made 3.7 mil. at the box office, I wonder if the director stepped on the wrong toes and someone intentionally tanked the project? IMDb trivia says Stephen Spielberg executive produced it, but had his name removed from the credits. That is always a negative thing in Hollywood, something done in protest. Joanou's trivia says he once punched out a studio executive on the set, could this be that set? Very strange, and what a pity, because this is a very good film. I gave it a 10 to up it's IMDb rating, though it is probably more like an 8. It has it's moments, however, that are well worth checking out, that occasionally make it worthy of a 10. <br><br>One of the more enjoyable elements of this film is the photography. Director Joanou, who started in music videos, teams up with Barry Sonnenfeld, of Coen brothers fame, and makes for some highly stylized cinematography. Though some of it might seem passé today, keep in mind at the time it was made (1987) nobody was doing anything like it. Guy Ritchie seems to have been influenced by it... 13 years later. <br><br>Superb performances by the two leads, Casey Siemaszko and especially Richard Tyson as the bully. The only time I have seen Tyson match his caliber here was in, of all things, Something About Mary, but I still think he has it in him. He plays a great heavy. The film is a bit slow now and then. Certain bits could be completely removed and the film would be better off without it. Overall it is a good film and, save a little language, safe for kids. Also, great soundtrack by Tangerine Dream. Check it out.","user":"RT Firefly","rank":[42,46]}]