[{"title":"Who needs drugs?","rating":25,"date":"25 June 2001","review":"When you've got movies like this to watch! This is one of the oddest things you'll ever see. Seems like Young, Stockwell and co. had ideas for several movies but decided to put them all into this one. Part musical, part comedy, part fantasy, part anti-nuke message film, all filmed on a stylised set somewhere between Pee Wee's Playhouse, One From The Heart and The Wizard Of Oz. You've got Neil Young with goofy teeth, and a supporting cast of solid cult types like Stockwell, Hopper, Kirkland and Tamblyn, plus Mary from Eraserhead and DEVO! Can you dig it? If you can pick up a copy of Neil's unfairly maligned album Trans too. The guy isn't just a folksy singer-songwriter and the Godfather of Grunge, he's a freakin' VISIONARY people. Well if not a visionary, a wacko with a loony sense of humour.","user":"Infofreak","rank":[17,19]},{"title":"I will never put down Neil Young again.","rating":6,"date":"11 February 2001","review":"I'm watching this movie in anticipation of catching my two favorite actors, Dean Stockwell &amp; Dennis Hopper, in a couple of offbeat roles....but wait, is that Devo?  And who is the weird character in the doll's mask?  And why is the art direction so...arty?  And Neil Young, with buck teeth and thick glasses, acting like a kid brother of Jerry Lewis....hold on, this ain't no offbeat movie - this movie is so OFF the beat, it's incredibly hip!  I couldn't stop watching the damn thing....yep, Neil is really singing \"Tonight\" from West Side Story while wiping the windshield, 'cause, you see, Russ Tamblyn is his buddy, and, oh forget it.....Then, to find out Dean Stockwell and Russ Tamblyn helped write this production...and, what, you say Stockwell directed it?  I'm in love.  And I will never put down Neil Young, either.","user":"Jill-68","rank":[17,21]},{"title":"New wavers and hippies get together and make weird movie.","rating":11,"date":"11 August 1999","review":"Why don't they make movies like this any more?  Sure it's a stupid movie. Sure, it's pointless too.  But damn, if it isn't cool.  Best part is forced perspective set and Devo deconstructing \"My My Hey Hey!\"  Plus, look for Neil doing a one of a kind \"shovel dance!\"","user":"choppy-4","rank":[10,12]}]