[{"title":"One of England's finest hours","rating":8,"date":"9 May 2005","review":"Sir Laurence Olivier once said that he thought his work before Wuthering Heights markedly inferior to that after because it was William Wyler who taught him the art of film acting and the difference between that and the stage. Although he overacts in spots in Fire Over England, even with that it comes natural because the character he's playing is an impetuous youth.<br><br>England did not have the big navy and the empire it boasted of in later centuries. Spain was the big kid on the European block in 1587 when this story takes place. It's Hapsburg King, Philip II either directly or through his Hapsburg relations lay claim to about half of western Europe and about 3/5 of the North and South American continents combined. <br><br>And Spain was driven by a religious ideology in the Roman Catholic faith with its Inquisition determined to stamp out diversity of thought in it's wake. England had broken away from the Roman Church and the Pope and was asserting its own religious sovereignty.<br><br>England didn't have a navy, but it did have privateers, although the Spanish called them pirates. They raided Spanish commerce and exacted a heavy toll in life and property. That got Philip II pretty mad and he set out to build the biggest fleet anyone ever saw to wipe these upstarts out. He called it the Armada.<br><br>These upstarts had a female ruler in Elizabeth I, played by Flora Robson. Over 400 years before Germaine Greer and Betty Friedan were writing about feminism, in that most masculine of ages Queen Elizabeth devoted her very existence to her people and sacrificed a lot of personal happiness in doing so. Flora Robson gives the definitive portrait of Elizabeth of England in this film. She did it so well that when she came to America, Warner Brothers had her play Queen Elizabeth again in The Sea Hawk. Elizabeth in this writer's humble opinion was the greatest monarch the English have ever had.<br><br>Raymond Massey plays Philip II, a dour humorless man who also unceasingly worked for his country. He's a cunning adversary for Elizabeth.<br><br>Fire Over England was the first film that Olivier did with his future wife Vivien Leigh. On this film they started the affair that was the Taylor-Burton romance of it's day. I'm sure the publicity helped the box office here. Vivien Leigh is one of Elizabeth's ladies in waiting and she falls big time for Olivier who has been captured, escapes Spain and then sent on a confidential mission by Elizabeth to find out about some English fifth columnists she suspects. How Olivier escapes the first time and what happens on the mission, well that's for you to see Fire Over England for.<br><br>Two other main characters are Lord Burleigh played by Morton Selten and the Earl of Leicester played by Leslie Banks. Leicester in his youth was the lover and chief confidant of Elizabeth even before she became Queen. Their story is a part of the rich tapestry of pageant that was Elizabeth of England's life. Why they didn't marry is a whole film in and of itself and Banks's anguish is captured well here.<br><br>Grand entertainment and a grand historical pageant tribute to one of the most heroic times in English history.","user":"bkoganbing","rank":[34,37]},{"title":"Flora Robson is Magnificent; Good Fictional Story of Elizabeth I's Realm","rating":7,"date":"29 June 2005","review":"This is a dramatic B/W film made just before WWII was begun by Adolf Hitler. The British Empire-based filmmakers draw a distinction between the theocratic Spanish Empire of Philip II, ably played by Raymond Massey, and the somewhat parliamentary government of England's island under the Protestant governance of Tudor Queen Elizabeth I, portrayed by Flora Robson with yet-unmatched power and skill. The distinction is important; although the misuse of their powers by neo-imperial-U.S. and post-Empire British governments have lessened our perception of the difference between the two regimes, that difference is in fact real and cleverly presented. The vehicle for the storyline was a novel by A.E. W. Mason. Clemence Dane's screenplay follows the adventure of young Michael, agent of the Queen, as he tries to uncover the nature and extent of a Spanish spy-ring operating in England. This requires him to pretend to be one of them and present himself to Philip; but his pretense fails for lack of a missing password. He is imprisoned in Spain, falls half in love with a lovely Spanish girl, daughter of his jailer, although he really loves one of Elizabeth's ladies-in-waiting; but she allows him to escape when she sees what Philip's evil is doing to her country's people, and he hastes back to the court in time to uncover the plot and save Elizabeth. Elizabeth then give her famous speech that rallies the English to defeat the Spanish Armada and save England, to become another empire and finally in our century a country again. The plot is fairly well-done, but the beauty of the film lies in its characters and dialogue and the way these are brought to life by an excellent cast. Laurence Olivier is Michael, Vivien Leigh is the girl he loves, Leslie Banks is the Earl of Leicester, Morton Selten is Lord Burleigh ;and Robert Newton heads the villains with Tamara Desni as the Spanish girl, plus many other fine British stage actors. The music was composed by Richard Addinsell, William K. Howard directed, cinematography was by the legendary James Wong Howe and camera-work by Wilkie Cooper. This is not a great film, but the restored B/W version is beautiful; the characters memorable, the villains intelligently unethical and some of the actors, especially Robson, superb. This is also a very good film about the era of Elizabeth and the meaning of tyranny--and what honorable men need to risk to avoid having its shadow fall over their lives; and what one group of men in the late 1580s dared to do.","user":"silverscreen888","rank":[15,17]},{"title":"The events of 1587-88","rating":8,"date":"23 March 2005","review":"There is not real film about the events leading to Philip II's great enterprise of 1588, the sailing (and destruction, as it turned out) of the great Spanish Armanda. To understand the story would take too many twists and turns. I recommend Garrett Mattingley's classic account of the Armada from the 1950s for those interested. Philip, tired of the aid that Elizabeth I of England gave to the Dutch and French Protestants, made a plan to transport an army under his nephew, Alexander Farnese, Duke of Palma, from Belgium to England using the Armada. He put the fleet under command of the Spanish nobleman, the Duke of Medina Sidonia. But Medina Sidonia was not a sailor (although a conscientious nobleman and servant of Philip). The Armada would first suffer a raid (by Walter Raleigh and Francis Drake). After it was repaired it did sail, only to find the faster English ships of Drake, Howard, and Frobisher more deadly, and the heavy winds, seas, and storms even deadlier. Many ships were wrecked off Scotland and Ireland. It was one of the worst naval catastrophes of history.<br><br>However it was also Philip's finest moment. Always a firmly religious man, he did not despair at the disaster to his fleet and plans, but he saw it was God's will. He actually put together Armadas again twice in the 1590s, but neither got as far as the first one did.<br><br>The complications of the story make it too confusing for anything but a full television seris: Philip was spurred on when Mary, Queen of Scots was executed in 1587 - he had been named her appointed heir to the English throne in her will; the French religious wars were approaching a critical moment, and Mary's uncle (the Duc de Guise) was leader of the Catholic forces at war with King Henri III of France and King Henri of Navarre (the leader of the Huguenots). There have been films dealing with Elizabeth's sea rovers, such as Drake (\"Seven Seas To Calais\", \"The Sea Hawke\"), but only this film tries to tackle the actual story of the Armada. As an adventure story it is excellent. As history, not exact but pretty good in parts.<br><br>First it does touch briefly on Mary's execution, in an early scene where one of Mary's servants tries to assassinate Elizabeth (Flora Robson). It really concentrates on the complex world of Elizabethan spying and the Elizabethan Catholic \"underworld\". The latter is an unfair description, for the Catholics were being persecuted in England. They had been supporters of Mary, and now that she was killed they gave support (mostly begrudgingly) to Philip. England's master of spies was Sir Francis Walsingham (who does not appear in this film). Instead the espionage against Spain is handled by Robert, Earl of Leicester (Leslie Banks) in the film - but in fact, Leicester died in 1587 in Holland, so he was not around for the Armada.<br><br>Lawrence Olivier is splendid in this early role as the young agent sent to spy on Philip and his plan (going in place of James Mason, who committed suicide in trying to avoid arrest). Olivier manages to get close to Philip (Raymond Massey) but that is not fully possible. Philip does not even like Englishmen, but he is willing to go along with the Catholics to get rid of Elizabeth and her regime. Philip is not easy to fool, and in a marvelous (almost comic moment) he stops Olivier from disclosing anything by finding that there was one name Olivier does not know that he should.<br><br>I won't go into the rest of the film's story. Watch it to see how Olivier still manages to escape and save England, and end up with his love (Vivian Leigh). For a 1937 historic film it is quite good, even if it could not tell the completely true story of the invasion of 1588.","user":"theowinthrop","rank":[17,22]}]