[{"title":"Donat and Carroll dance a Hitchcock tune","rating":9,"date":"17 April 2018","review":"Tight and delicious. Everything matters and nothing matters. An amazing commercial eye without detracting from the poetry. Poetry? Yes poetry. Robert Donat was one of the best actors of his generation - I wonder why he's not better known. Maybe he will be rediscovered. The 39 Steps, The Winslow Boy, Goodbye Mr Chips just to name 3 of his spectacular performances. Madeleine Carroll is perfect as an early, classy and icy Hitchcock blonde. The coupling of Donat and Carroll has all the signature traits of the Master and it's downright irresistible. Not to be missed.","user":"danielledecolombie","rank":[50,52]},{"title":"The Quintessential Hitchcock","rating":29,"date":"29 April 2003","review":"Trust and betrayal have been a recurrent theme in several of Alfred Hitchcock's works. The 39 Steps, made in 1935, has the all the classic elements of the master filmmaker that set the standard for later Hitchcock films. The 39 Steps has the classic Hitchcockian theme of an average, innocent man caught up in extraordinary events which are quite beyond his control. The sexually frustrating institution of marriage is another major motif present in the film. The strained and loveless relationship between the crofter and his wife, the placid relationship of the innkeeper and his wife, the (physical) bond between Hannay and Pamela can be examined in terms of degrees of trust between the couples. In fact, the short 'acquaintance' between Hannay and Smith and Hannay and the crofter's wife are also built completely upon trust. It is these couples, and the chemistry between them (or the lack thereof) that drive the entire film.<br><br>Over a span of four days, the smart and unflappable protagonist, Richard Hannay (Robert Donat) is involved in a circular journey to prove his innocence and expose the hive of intrigue.  He is involved in chases and romantic interludes that take him from London to the Scottish Highlands and back again and he assumes numerous identities on the way - a milkman, an auto mechanic, a honeymooner, a political speaker among others.<br><br>The opening of the film, the first three shorts do not show him above his neck. With his back to the camera, he is followed down the aisle to his seat. He is then assumed to be lost in the crowd. This gives the audience the feeling that he could be anybody. Later when he takes in the identities of a milkman, a mechanic, a politician one realizes that he is Hitchcock's archetypal 'everyman' who unwittingly finds himself in incredible dilemmas.<br><br>In one of the brilliantly managed sequences on the train, Richard Hannay throws himself at a lone girl and forces a kiss just as a detective and two policemen pass by their compartment. It reveals his desperation to remain free until he can prove his innocence. In the scene after Annabella staggers into his room with a kitchen knife in her back, Hannay sees her ghostly image (which is superimposed) talking to him, `What you are laughing at right now is true. These men will stop at nothing.' The double exposure achieves a result which is a tad chilling and sad. The hallmark of Hitchcock's style is his ability to completely shock his audience by deliberately playing against how they would be thinking. In such episodes as the murder of the woman in Hannay's apartment or when the vicious professor with the missing finger casually shoots Hannay, the action progresses almost nonchalantly leaving the viewers stunned.<br><br>A great story, interesting and likeable characters, slyly incongruous wit, classic Hitchcockian motifs and a great MacGuffin are just a few things that make the The 39 Steps the quintessential Hitchcock.","user":"Amit_Verma","rank":[114,127]},{"title":"Don't be put off by its age - this one is worth seeing.","rating":10,"date":"13 April 2005","review":"If what you want from a thriller is in-yer-face mugging, special effects, noise, a booming soundtrack, gore, nudity and flashy editing, this one is not for you.<br><br>However if you are a more discerning moviegoer who values a great script, exquisite understated acting, wit, humour and intelligence, and you are willing to overlook the technically rough bits (come on, this was 1935, you cannot measure it by 2005 standards !!) - then enjoy, because you are in for a treat.<br><br>Robert Donat is one of the most charming heroes that ever graced the screen, and but for his frail health and loathing of the Hollywood pzazz (he later refused some great movie parts offered to him, which eventually went to the likes of Erroll Flynn and Douglas Fairbanks Jr) he might have become one of the greatest. Watch the dinner scene with the crofters, in which he manages to convey his plight to the wife entirely without words. Great acting. Also the wickedly funny bravura piece at the political rally.<br><br>Madeleine Carroll must be among the coolest and feistiest of Hitchcock's favoured blondes, not as insipid or irrelevant as many of the others were. She is a veritable icicle and it takes a long time for her to thaw, but then watch the sparks fly.<br><br>I feel a little sad for the people who cannot be bothered to check out this movie because of the tinny sound or the b&amp;w photography. Forget about those superficialities and concentrate on the real values - the script, the acting, the lighting, photography and camera work -, just allow yourself to get carried away with the fast paced action, and you'll love it.","user":"palinurus2","rank":[106,119]}]