[{"title":"FailSafe on a Surface vessel.","rating":23,"date":"23 June 1999","review":"Along the same lines as FailSafe this is a tense Cold War drama with a cat and mouse game going on between an iron willed Navy Captain and an essentially unseen Soviet submarine. Great performances all around are what make this a good film. Richard Widmark is great as the somewhat tyrannical ships skipper who has his crew drilled, trained and poised for all out war up to the breaking point. Sidney Poitier as always does another superb job as the journalist aboard to do a story of a Navy deployment and gets more than what was expected. Despite the fact that an individual like the Poitier character would not enjoy that much freedom aboard a US Naval vessel this motion picture is quite realistic. Martin Balsam and James MacArthur also put in outstanding performances with Balsam as a newly arrived unappreciated ships doctor and MacArthur as an Ensign who is dogged endlessly by his commanding officer.","user":"yenlo","rank":[17,17]},{"title":"best of its kind","rating":14,"date":"14 January 2003","review":"Channel surfing, I stumbled across this movie on TCM and must say, \"Wow!\" As a child during the Cold War, I remember the tension between America and Russia, which this film captures well -- at least from the U.S. perspective. Richard Widmark's performance tops that of Humphrey Bogart in \"The Caine Mutiny,\" strawberries or not. Sidney Poitier fits his role like a glove -- the scene between Poitier and Widmark in the latter's cabin is splendidly acted, allowing the viewer to get inside Widmark's head while not giving away too much -- and Martin Balsam gives another example why he was one of the screen's greatest supporting actors. It's better than \"Fail Safe,\" sparing us Henry Fonda's hysterics as president. The tension builds aboard ship until a breathtaking climax. One worth watching.","user":"swisener","rank":[32,34]},{"title":"\" If He Fires One . . . . . I'll Fire One \"","rating":9,"date":"29 August 2007","review":"The Cold War is one of the world's most frightening conflicts ever as it nearly extinguished humanity. During this time, suspicious nations rattled atomic sabers at one another and secret agencies scurried about disseminating Ideological propaganda and psychological warfare, but for the most part the only thing accomplished was that Americans spent billions threatening a distant enemy who ultimately became our friend. One exceptional film which appear during this era, was \" The Bedford Incident.\" It is the story of an American reporter Ben Munceford (Sidney Poitier) who seeks out a controversial naval officer, because he believes him to be a rare individual. That particular man is Captain Eric Finlander. (Richard Widmark) a no-nonsense commander who is determined to do his duty, even if it means destroying a stray Russian Submarine, armed with nuclear missiles. While Munceford is trying to fathom the Captain, he notices everyone under Finlander's command is being subjected to increasing pressure, enormous stress and intolerable strain to remain on high alert as if war could be initiated at any time. From an audience point of view, the tension on board the Bedford, mirrors the terrifying state of fear in the world. Helping the audience analyze the situation is Lieut. Cmdr. Chester Potter (Martin Balsam) a naval Doctor who warns the Captain of mounting psychological dangers of his crew. One such officer is Ensign Ralston (James MacArthur) who the doctor warns is wound 'too tight' to be on duty. Another is Seaman Merlin Queffle (Wally Cox) who believes he controls the ship. This is a remarkable film, for it's characters, it's drama and eventually it's inevitable ending. It's a reminder, the fears we create are as real as our nightmares. ****","user":"thinker1691","rank":[45,51]}]