[{"title":"A Simple, Thoughtful Movie","rating":23,"date":"23 February 2001","review":"Tom and Mae Garvey (Mel Gibson, Sissy Spacek) are the owners of a small eastern Tennessee farm that has been in the Garvey family for generations. It is the early 1980s, when the staggering U.S. economy threatens the welfare of the American family farm.  The Garveys' struggles are compounded by the fact that their property is in a flood plain, and by the enmity of Tom's rival Joe Wade (Scott Glenn), who is a wealthy and powerful foe. This is not lighthearted entertainment.<br><br>For me, the film's most powerful moments come when cash-strapped Tom has to leave the farm to find work elsewhere.  He unknowingly becomes a scab in a factory where the regular labor force is on strike.  At least there is a regular paycheck, but the contrast between the man-made hell of a iron foundry/steel mill and the natural beauty of the family farm is compelling, and you can see why the Garveys struggle to hold on to their agricultural way of life, however hard it is.  The cinematography for this movie is way above average, a celebration of rural America.<br><br>Sissy Spacek delivers her usual fine performance.  Mel Gibson is very good-- his Tennessee accent quite convincing.  The two youngsters who play their children deserve special praise for their natural performances.  This is a good, thoughtful movie-- not romantic, thrilling or exciting-- but one the family can watch together and think what sacrifices they would make to keep a heritage and a way of life preserved.","user":"kypioneer","rank":[21,27]},{"title":"Slow building, exhausting & beautiful struggle of an American farm couple","rating":7,"date":"3 November 2015","review":"I enjoyed this movie for the most part, it wasn't fantastic, it was interesting though and somewhat exhausting, watching how hard this family works to keep afloat. <br><br>Its a slow building movie following Tom and Mae Garvey (Mel Gibson and Sissy Spacek) a hardy Tennessee farming couple who must defend their farm against man and nature, constantly one step away from foreclosing or flooding. This is from the early 80's so Mel Gibson is very good looking here as well as doing a decent southern accent. Sissy looks good too.<br><br>There are also some interesting scenes in this, one in particular stands out when Tom takes a job at a foundry and a deer enters which then has all the workers surrounding it, planning on killing it and then they just release it. I'm not entirely sure what it was meant to signify? <br><br>The ending felt a bit abrupt with yet another flood and a somewhat cheesy conclusion to everything with the outcome of the bad guy land developer (Scott Glen). I was left wondering and then what happens? Probably the same exact circle of events next season. 10/24/15","user":"juneebuggy","rank":[5,5]},{"title":"Maltin's summary is off base","rating":8,"date":"24 July 1999","review":"I recently rented this movie because I'm a Mel Gibson fan, but before I did, I read over the review by Leonard Maltin on these pages and found that his comment \"but Gibson's character is so coldly stubborn that it's hard to empathize\" regarding the character Tom Garvey was pretty harsh.<br><br>This is not a man so stubborn you cannot empathize with him in the least. Harrison Ford's character in Mosquito Coast was such a man, but this guy is a good man trying to do what's right for himself and for his family and I didn't see him as cold either.  Again, look to Mosquito Coast if you're looking for a father who's cold, TOO stubborn and unloving.<br><br>If you want to see a good movie about farmers facing adversity from the weather and from their \"neighbors\" this is a good one to rent.  Justly nominated for cinematography, it's a very pretty movie, although I'd have liked to see it on the big screen to get the full effects of the river shots.  Sissy Spacek was of course excellent as well.","user":"MovieFan-48","rank":[21,29]}]