[{"title":"All About Maria","rating":24,"date":"24 November 2017","review":"Four years after the phenomenal All About Eve, Joseph L Manckiewicz moves away from Broadway and lands in Hollywood. Naturally, everything in Hollywood is bound to be louder, more vulgar, more shallow and more expensive and surprisingly less relatable, less credible. Ava Gardner is breathtakingly beautiful and Jack Cardiff photographs her like a goddess but that's no match for any of the exchanges between Bette Davis and Thelma Ritter in All About Eve. Here the soap opera elements dominate the tale. The Italian aristocrats as played by Rossano Brazzi and Valentina Cortese take the story for a ludicrous spin. Josseph L Manckiewicz as a writer and director makes sure the film doesn't become \"The Legend Of Lylah Clare\" for instance. Humphery Bogart plays the lead and I forgot to mention it. I wonder why. He's wonderful in it but the Oscar went to Edmond O'Brian for his unbearable press agent. Ava Gardner presence transformed this lurid tale into a classic and it's bound to remain so for ever.","user":"ptmcq05","rank":[25,27]},{"title":"Interesting depiction of a Hollywood goddess","rating":7,"date":"30 December 2006","review":"Ava Gardner is beautiful Spanish dancer Maria Vargas who is discovered and given a Hollywood contract in \"The Barefoot Contessa,\" also starring Humphrey Bogart, Edmund O'Brien, Rossanno Brazzi, Marius Goring, and Valentina Cortese. Written and directed by Joseph Mankiewicz, the story is supposedly based on Rita Hayworth, who turned down the role. There are some similarities - the Spanish roots, the dancing angle, the studio head who desires her but doesn't get her, a la Harry Cohn, and the great sadness of her life. The famous story about Rita is that her first husband, Edward Judson, was nothing more than a pimp, though he is the man who turned her into a movie star. He demanded that she have sex with Harry Cohn, and Rita refused time and time again. Finally, Judson made a date for himself and Rita to go on a boat trip with Cohn, and Judson cancelled at the last minute, leaving Rita alone with the studio head. She still didn't go to bed with him.<br><br>The story begins at Maria's funeral and is told in flashback by the various men who were in her life. Most of the narration is provided by the Bogart character, writer-director Harry Dawes, who had a unique relationship with Maria - he cared for her deeply and was always there to listen to her and advise her. Maria was a woman whose life was lived as a barefoot Cinderella looking for her prince. Harry has a sixth sense about things, and when Maria is about to marry the man she believes to be her prince, Count Torlati-Favrini, Harry starts to worry. He knows that, as is often pointed out in the film, real life is much more erratic than a movie script.<br><br>Edmund O'Brien gives a terrific, Oscar-winning performance as a yes man/publicist who does all the talking for the studio head, Kirk Edwards (Warren Stevens). Bogart is excellent, but he does not have a great role; although he has top billing, he doesn't even have the starring role. One suspects he's there for box office pull.<br><br>The dialogue has been praised here - Mankiewicz was one of the great dialogue writers, but I found some of the dialogue in this a little pretentious and the pace slow. It's an interesting story, but for me it doesn't compare with \"All About Eve\" and \"Letter to Three Wives\" in script or in pace.<br><br>The star of the film is Ava Gardner. For this writer, Gardner and Hayworth were ultimate sex symbol/movie stars - gorgeous, sexy, exciting women. Around 32 here and living the wild life she always did, Gardner is breathtaking to look at. After the beginning of the film, she drops the Spanish accent, but she more than makes up for that in presence. Like Lana Turner and Rita Hayworth, she was one of those actresses whose appearance and private life often received more publicity than her actual acting - but Ava could act. There was always something uninhibited, earthy, sexy, and inherently honest about her performances - and she was that way as a woman, too. I highly recommend her autobiography to anyone who hasn't read it.<br><br>To see this marvelous cast and especially to see them in something written and directed by a fine artist like Mankiewicz is worth it, even if it's a little flawed. Nobody's perfect.","user":"blanche-2","rank":[39,54]},{"title":"Just couldn't care about the story or characters.","rating":6,"date":"20 February 2010","review":"This movie sounded like a good idea. It's about the rise and fall of a female movie star and focuses on the upper-class society and the world of Hollywood but in truth and honesty the movie is just too much of a drag, due to the fact that the story just never seems to take off and the characters are not very compelling ones.<br><br>It probably foremost is the pace that makes this movie its story come across as slow and dull. It seemed like an interesting idea to tel the story of this actress from the viewpoint of several male characters she met throughout the entire movie. However this way of storytelling instead causes the story to feel like a messy one. I also just don't see how this movie is a good one as an inside-Hollywood movie or social commentary perhaps. The movie to me just seemed pretty pointless and it wasn't going anywhere. It all still could had worked out had the characters been better ones.<br><br>You can't really blame the actors for not letting the characters work out well enough for the movie. I mean when you have actors like Humphrey Bogart, Ava Gardner and Edmond O'Brien involved, you can hardly blame the acting can you?<br><br>The movie is just too much talking and not enough drama or romance involved. I didn't very much liked watching this movie and didn't feel involved with it enough but nevertheless I also couldn't hate it. After all, it certainly ain't no bad movie but it still is one that comes across as being uninteresting and pretty pointless overall.<br><br>6/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[38,53]}]