[{"title":"Forgotten gem","rating":25,"date":"25 March 2007","review":"Here we have the movie that Jean Renior considered his favorite of all his American efforts. It's truly a forgotten gem from this great director.<br><br>It involves the Tucker family, a hard-working but poor clan who toil in the cotton fields as day workers. The family is led by Sam, played by Zachary Scott, accompanied by his lovely wife Nona played by Betty Field. They are accompanied by Beulah Bondi's ornery Granny Tucker, two small children and a frisky little dog. They represent the best of America's hard-working poor, with Sam and Nona truly being dedicated to each other and their family.<br><br>We are introduced to them as they pluck cotton beneath the burning sun, hauling huge sacks stuffed with the crop. Suddenly an elder member of the family falters and he is quickly aided by his nephew and his wife, Sam and Nona. Sam takes his uncle's load of cotton, telling him that he'll finish his row. Nona Tucker stays with the old man as he languishes in the fields, flies buzzing around him as he sweats and wheezes. Sam soon rushes back after delivering his cotton, and Nona informs him that his uncle \"isn't doin' too good.\" They give the old guy water, and urge him to hold on, but with his dying breath he tells his young relatives, \"...grow your own crop.\" This advice Sam truly takes to heart, and soon asks his sympathetic boss to let him farm a piece of land on a kind of rent-to-own deal. Sam and Nona's experiences making a life on this fallow piece of land are the focus of the movie.<br><br>Truth be told, I've always found talented Betty Field to be one of Hollywood's most unsung and under-appreciated actresses. She seems to generate some vague aura of tragedy, with subtle underpinnings of a quiet sexuality. Her voice has a low register, which also can have a beautiful clear resonance that is unique and memorable. Betty Field was the main reason I was so excited to finally be able to view \"The Southerner.\" And I certainly was not disappointed! Her Nona and Scott's Sam are extremely believable as soul mates and married lovers, and there is a certain erotic electricity in there quiet scenes together.<br><br>Zachary Scott'character is earnest, sensitive and ultimately heroic, and his presence lends a quiet soft-spoken American spirit to the proceedings and he voices a soft Southern accent to perfection. His Sam Tucker is intelligent, brave, and determined, and the movie really gives him the opportunity to demonstrate his strength and prowess. Scott is wiry and strong, and his performance is athletic and inspiring. One can easily believe him to be the kind of man who would inspire the love and dedication of his wife and family. His obvious intelligence, goodness and his determination help make his long and difficult journey extremely involving. After a major catastrophe, when Sam experiences dark feelings of hopelessness, Zachary Scott truly conveys the reality of a common guy who questions all his decisions and abilities.<br><br>Jean Renoir's ability to capture the distinctly American essence of these characters is remarkable for a director from Europe. He certainly has a fascination and love for the land, and uses the landscape to reinforce the emotional high points of the film. In one remarkable scene, when the couple's young son battles an illness, Nona runs from the family's house into the freshly plowed field, crying as her husband follows her. She throws herself down onto the dirt and hugs the soil as she weeps, and confesses her innermost feelings. Renoir seems to almost turn the dirt and mud of this field into a third character in the scene.<br><br>But yes, there are a few elements in \"The Southerner\" that must disqualify it from masterpiece status. One disconcerting thing was the Hollywood makeup on Betty Field, who was never without mascara and lip gloss even when picking cotton or burning brush off a field. She certainly looked lovely, but also inappropriate for the movie. And the expert character actress Beulah Bondi has some moments where Renoir allowed her to perhaps play it a little too broadly. She's much of the comic relief in the film, and serves this purpose well, but her crotchetiness does begin to grate somewhat. And unfortunately the superb Blanche Yurka is underused as Sam's mother, and she appears so suddenly that it seems some of her scenes must have been cut. Percy Kilbride plays a thankless role as Yurka's suitor, and his screen time could have been used more efficiently.<br><br>But other supporting player deliver wonderful little turns in the film. There's Charles Kemper as Sam's rotund best friend and city slicker, Tim. He's likable and warm, and the narration that opens the film is his. He is perhaps the polar opposite of Sam in appearance and philosophy, and lends a voice to the advantages of city living. Then we have J. Carroll Naish as a terse and bitter neighbor who supplies much dramatic impact in his scenes with good guy Sam. The deliberate and thoughtful interplay between these two characters is packed with tension and foreboding. Norman Lloyd as Naish's nasty lowlife farmhand gives a unique performance and seems to bring an almost animalistic quality to his character. Also Dorothy Granger is both frightening and sad as a drunken barroom floozy who doesn't run from a fight.<br><br>\"The Southerner\" could probably be considered \"The Grapes of Wrath, Lite.\" But to view it that way certainly underestimates its own power, and its relevance even today. Stripped to its essence, the movie could be the tale of any close-knit family who struggles to survive and to flourish in an uncaring world. Renior's talent, with the help of a great cast, makes \"The Southerner\" an impressive portrait of the struggles and rewards of American farm life. It has the ability to resonate in the memory because of both its Hollywood artistry and its gritty Southern strength.","user":"mikhail080","rank":[42,44]},{"title":"Wow","rating":10,"date":"11 January 2000","review":"I saw this film on a Saturday morning and loved it.  It's about a man, his wife, their two children and the grouchy grandma, who are dirt poor (and I mean that literally) farmers.  It's based on the book by George Sessions Perry called \"Hold Autumn in Your Hand,\" but the movie and the book are completely different in style and manner.  I personally like the movie more, as it showed the family's togetherness much better than the book.  A wonderful Renoir film (I think my favourite of all his) and definitely a must see.  The courage of the family is really touching.  I gave it a...10/10.","user":"oleander-3","rank":[47,52]},{"title":"Hard Times, Good Earth","rating":8,"date":"8 March 2007","review":"Beautifully shot, absorbing film about the close-knit Tucker clan - Sam (Zachary Scott), the handsome dad who loves being a farmer, Nona (Betty Field), a good wife and mother who always seems to look well-groomed in spite of her hard work, two really cute kids, and then there's ornery old Granny (Beulah Bondi), she of the sharp tongue and stubborn will. In a gorgeously photographed scene where they are working for hire in the bright, sunlit fields picking cotton - the couple watches as their Uncle dies in the fields saying in his last breath \"Grow your own crops\", and they decide to do just that. Soon they have rented a property where they can raise cotton and be their own masters, so to speak - well, the house turns out to be nothing but a broken-down, ramshackle shack, the whole place needs loads and loads of work - but one good thing\" it has \"good earth\". Troubles ensue - trouble with the neighbors, trouble getting food, sickness troubles, weather troubles, oh brother!<br><br>Well, this is an excellent, heartfelt, and well photographed film done in an unusual, distinctive style. The actors who play the Tucker family do a good job in making this actually seem like a real family and make you want to root for them - but it is Beulah Bondi as cantankerous Granny who really steals this film for me - I really enjoyed her scenes and thought they added a little spice to this! The hardships this clan has to go through can be hard to watch sometimes, but the story is involving and the film is quite memorable.","user":"movingpicturegal","rank":[30,34]}]