[{"title":"Masterpiece.","rating":9,"date":"14 November 2004","review":"Legendary Swedish director, Ingmar Bergman's probable precursor to Wes Craven's notorious 1972 shocker 'The Last House on the Left' is a far more compelling and emotionally draining film that adroitly and continuously switches the viewers sentiments up until the despondent, tranquil and haunting ending. While one minute the viewer is laughing along with the youthful, if naïve, exuberance of the young Karin (Birgitta Petterssen), the following minute will encourage different emotions as Bergman plunges the viewer into the middle of a nightmarish crime perpetrated by nothing less than the evil inside man. Although the portrayals of the acts committed in 'The Virgin Spring' are far less graphic than the modern viewer may have become accustomed to, they still retain an immense power to horrify as one cannot ignore the great lengths Bergman has gone to in order to give his characters a base in order to harden the impact of what we see. With just the simplest of dialogue, the viewer continues to learn about the relationships and personalities of each of the characters so that we may appreciate the consequences and, in some ways, forgive the actions that we see. This film is, after all, a tale of morality and repentance and therefore, even while in some cases the actions may be evil, it is necessary to accept the goodness that is still there. This thought is made no clearer than during the solemn and subdued final scene which fades out abruptly and leaves the viewer in a state of quiet reflection.<br><br>Bergman's pacing and subtle direction which at one point leaves the viewer in suspense for what seems like an eternity is surely the reason for the greatness of this film. As if he were playing chess, he manipulates not only the characters, but the emotions of the viewers with intelligent and surprising maneuvers while pressing home his own sentiments regarding the story so that we may at least take into great consideration the events that we have seen. Bergman has an amazing ability to flip the atmosphere of a movie in a split second using various lighting and camera angle techniques as well as motivating his performers to follow suit. The simple expression changes on the faces of Birgitta Petterssen, Max von Sydow, Birgitta Valberg and Gunnel Lindblom at various points throughout the film quickly alter the mindset of the viewer and indicate that all is not well; so beautiful in undeniable simplicity.<br><br>'The Virgin Spring' is nothing short of a masterpiece and a film that few will be able to forget. 9½/10","user":"Snake-666","rank":[96,113]},{"title":"A fine, grim, little tale that will make you ponder afterwards.","rating":10,"date":"19 September 2005","review":"I have to agree with the previous comment, this is certainly a sad film I would go further, it's actually a grim little tale. Bergman pulls no punches, the medaeval world he shows is a hard, harsh, bleak place. There is a sense of menace in almost every scene and the actual rape is graphic and nearly unwatchable. The characters are not finely drawn, but after all this is a fairy tale in the older mould. They are there to represent types and conditions. The sad, doting mother; the unbending Christian gentleman; the flawed cleric; the ferocious, deceitful rapist-murderers. The tale on one level is very simple and can be simply followed; jealous sister curses more favoured sister, favoured sister is cruelly killed, killers ironically claim refuge of her father, father exacts revenge on them. So far we have something that could have come out of many a European ballad tradition. However, on another level it contains fundamental comments on humanity and human behaviour, Christian moral theology and our reaction to it. The father's faith is tested, he is not the man he thinks he is and his religion is not what he thinks it is either, though he submits and adopts a position of blind hope. The killers represent the complete absence of good that Aquinas maintained was the definition of evil. The young brother is the pain of conscience. In many ways it is a play on the deadly sins, apart from gluttony they are all there; wrath on the part of the father and pride in his daughter; envy in the half-sister; lust and avarice in the herdsmen and so on. It is truly an exemplary tale, as a medaeval legend should be. I bought this film casually at a street stall in Taipei for an absurdly small amount of money and it lay on a shelf unwatched for quite some time. In a bored moment one night I slipped it in the player and found myself enthralled until the finish. The cinematography, of course, is excellent but the joy is the dark threat that filigrees it, the simple but powerful emotions both quietly and violently displayed. It lacks the grandeur of \"The Seventh Seal\". It's a smaller and more compact number but it some ways the better for it, the evocations are more direct and the violence unnerving. I recommend it very highly indeed, you will be thinking on its themes long after this simple little tale finishes.","user":"rowan_h","rank":[51,58]},{"title":"One of the most heartbreaking films I have ever seen","rating":10,"date":"15 February 2004","review":"... and that's about all I can SAY about it. I saw this film four, maybe five years ago. And to this day, I feel a blow to my gut whenever I remember it. To this day, it haunts me - especially (and not surprisingly) the figure of the little boy. <br><br>This is a raw, uncompromising, unbiased parable on love and revenge; on humanity. It is set in 14th century Sweden - but its \"message\" is timeless: as timeless as love and vengefulness themselves. As timeless as humanity itself. Because the mores may change, but today, as 800 years ago, people are still helpless in their (perhaps inevitable) core existential ignorance, still subject to the immense pain of losing a loved one, of the inexplicable torments that often befall just and righteous, \"good\" people. <br><br>And that is what makes this a brutal, heartrending, unforgettable film.","user":"BlueGreen","rank":[73,89]}]