[{"title":"A disjointed ride through a feverish dream","rating":7,"date":"26 July 2005","review":"I saw this film as a part of a Suzuki retrospective in Amsterdam, my first meeting with Suzuki, not knowing that it is all but representative for his more famous work from 50s-60s.<br><br>The plot of the film is difficult to describe because it is told almost without a cohesive narrative and totally non-linear and disjointed. I've never seen a film that resembles a feverish dream so closely. Roughly the story is about man confronted by one man (a rich business-man) and two women (a Japanese Geisha and a European, who dresses like a Japanese women).<br><br>Besides the 'narrative' distorted uniqueness, which allows the characters to jump from one location to the next or pop up (even within the same shot), the other interesting aspects of the film are the locations, the visuals and inter-textual connections. Just to name a few: We see the protagonist on a range of different locations in the Japan of the 1920s, both in the city as in the countrysides. Also the European woman with her piercing blue eyes and blonde hair (only when the moon shines) is a fascinating image. Suzuki's use of distorted Japanese paintings as a backdrop and a No-play performed by children in the final part of the film send shivers down my spine.<br><br>Although the film drags a bit in the middle, I left the theater with a positive, if slightly confused feeling. Maybe I liked it because it lacks any form of explicit explanation, just like a dream subjects you to an illogical and irrational 'story' that somehow makes sense. It is a film that forces you to leave every sense of (western) storytelling at the door. Or maybe it was just because it is fascinating to see a film in which every next shot is the complete unknown.","user":"MZRN","rank":[24,27]},{"title":"Taisho Part Two","rating":7,"date":"25 July 2017","review":"A 1920s playwright (Yûsaku Matsuda of \"Black Rain\") meets a beautiful woman (Michiyo Ohkusu) who may be the ghost of his patron's deceased wife.<br><br>With \"Zigeunerweisen\" being a commercial and critical success, Suzuki teamed up again with producer Genjiro Arato, and this time had double the budget. With \"Kagero-za\", the source material is a short story by Kyoka Izumi, a writer most famous for his idiosyncratic Gothic-flavored ghost stories. And, indeed, this very much captures the \"spirit\" of Suzuki's Taisho series.<br><br>The plot is intentionally obscure and unclear. The beautiful woman, Shinako, remains unnamed for almost the first half of the film, as is her identity as Tamawaki's wife, if in fact that is who she happens to be. Some ambiguity is necessary for the story to play out as it does, but it is taken an extra step by being purposely vague with identities. (Rather than a shortcoming, this could be seen as a strength, as it would encourage repeat viewings for a deeper understanding, not unlike \"Mulholland Drive\" or other David Lynch films.) <br><br>According to critic Tony Rayns, \"Kagero-za... may well be Suzuki's finest achievement outside the constraints of genre filmmaking.\" Variety called it a \"beautiful film\" and said it was an \"Orientalized\" take on Luis Bunuel, which is not only complimentary, but apt. Still others have compared the film to Luigi Pirandello's theater of the absurd, which may be going a bit too far.<br><br>Arrow Video has released the film on Blu-ray as part of their Taisho Trilogy set. Though perhaps not as celebrated as \"Zigeunerweisen\", there is much to love about \"Kagero-za\" and the film is worthy of deeper exploration and contemplation.","user":"gavin6942","rank":[3,4]}]