[{"title":"We're In On the Joke","rating":10,"date":"17 May 2004","review":"This movie is exquisitely directed and acted. The \"fourth wall\" is gone; the movie rides so high and smart that we as audience can be subtly acknowledged throughout and made complicit in the production, while we continue to believe in the characters and care about what happens to them.<br><br>Much of the important dialogue is \"throw-away\" dialogue, in a sense. It's clear to the hearing, but lines are often spoken by the characters to themselves, for their own (and our) amusement, or delivered in very deftly choreographed \"simultaneity,\" each speaker maintaining an independent point of view in rapid-fire repartee. Implications are understated. We are expected to expect the unexpected, to listen to every line.<br><br>The plot is composed like a piece of music. Each scene takes moment from the time-line established by the impending day and hour and minute at which a husband (Cary Grant) and wife (Irene Dunne) become legally divorced, and the movie ends at precisely the stroke of midnight which marks that moment. They clearly want each other back, but will they cleave together or cleave apart as the clock strikes midnight?<br><br>One extended \"movement\" of the movie lets Cary Grant charmingly undermine his wife's new relationship. In corresponding scenes later, Irene Dunne brilliantly plays a dumb floozie, pretending to be the husband's sister and demolishing in one evening his reputation and his prospects for marriage in respectable society. In these later scenes, in another of the movie's nice compositional touches, she does a reprise of a hoochie musical number performed earlier by a girlfriend of her husband's, and then falls into her husband's arms, apparently drunk. He gestures for her to look back and say goodnight to the horrified guests (and to us) as they do a wonderful little wobbly dance out the door, having burned their bridges behind them. <br><br>I found the opening few scenes of the movie unlikable, but with the entrance of Irene Dunne, the movie gets us on board. There's so much great understated visual and verbal double entendre (in the best sense) that I want to go back and see if there's more that I missed. In one scene, Cary Grant has brought to Irene Dunne's new fiancé the paperwork on a coal mine the divorcing couple still own. Interrupted by a visitor while advising the fiancé on where it would good to sink a shaft (har!), he explains that he and the fiancé (brilliantly played by Ralph Bellamy as a very successful bumpkin businessman) are transacting a business deal. The movie moves along briskly and doesn't play up the point, but we catch, for a fraction of a second, Irene Dunne squirming as she finds herself looking like the business transaction in question. The movie moves through moments like this quickly, with high respect for our intelligence and our capacity to get in on the joke.","user":"stmichaelsgate","rank":[73,84]},{"title":"This movie is utter nonsense -- and it's great!","rating":10,"date":"24 August 1999","review":"Nothing in this movie makes sense, and it really doesn't matter. It succeeds with its self-assured anarchy and the charm of its stars.<br><br>Cary Grant, Ralph Bellamy and especially Irene Dunne are in top form. Dunne has been unjustly overlooked for her comic talents. The contrast of her well-bred demeanor and inner wickedness is a delight -- like when she does a burlesque dance for a parlor of society snobs. She always appears to be on the edge of bursting out in laughter at the antics of Grant and the buffoonery of Bellamy. A wonderful nonsensical scene is of the musically skilled Dunne at the piano trying to sing \"Home on the Range\" with the hopelessly off-key Bellamy.<br><br>Grant is in the period of his career where he's not afraid of self-parody. He's at his best when he takes nobody and nothing seriously, and he's especially funny at tormenting the slow-witted Bellamy. And Bellamy is so good at playing dumb, you have to wonder if perhaps he's not really in on the joke. (Grant and Bellamy basically repeat their roles, with the same success, in \"His Girl Friday,\" another first-rate comedy).<br><br>\"The Awful Truth\" is the masterpiece of Leo McCarey. There's really nothing else quite like it.","user":"Andrew_Eskridge","rank":[70,81]},{"title":"You're A Lucky Fellow, Mr. Smith","rating":8,"date":"13 February 2006","review":"Cary Grant and Irene Dunne catch each other in a white lie and the quarrel leads to a marriage breakup. The only bone of contention is that there's a dog who is a family pet that they both love. They go to court and Dunne with a bit of trickery wins the custody battle.<br><br>This is one of those comedies where the people can't live with each other or without each other and both are too stubborn to admit it. Cary gets himself involved with society debutante Marguerite Churchill and Irene takes up with mother fixated oil millionaire Ralph Bellamy.<br><br>Any fan of old Hollywood films can tell you how this one will end. My favorite bit is when Irene crashes the Churchill household with Cary there and pretends to be his drunken floozy of a sister.<br><br>Leo McCarey won an Oscar for Best Director and Irene and Bellamy were nominated for Best Actress and Best Supporting Actor. McCarey keeps the laughs coming and takes advantage of the talents of all his players, Irene's voice and Cary's gift for physical comedy.<br><br>And as for Mr. Smith the little terrier who finds out he's not all that Cary and Irene have in common. Well he's one lucky little fellow to be in a classic comedy like this.","user":"bkoganbing","rank":[29,33]}]