[{"title":"Triple the fun","rating":7,"date":"25 January 2013","review":"Both Cannonball Run movies are films to totally relax and let your funny bone rule you. No plots that make any kind of coherent sense, just a whole lot of people getting a great chance to overact with gusto and abandon. And since Cannonball Run II just about tripled the number of name players who did walk ons, it could be considered triple the fun. <br><br>Folks like Burt Reynolds and Dom DeLuise who are the nominal stars, Jackie Chan, Jack Elam, Dean Martin and Sammy Davis, Jr., and Jamie Farr make return appearances and a whole lot more get in on the fun.<br><br>Farr who is carrying the prize money as the fabulously wealthy hedonistic idiot son of an Arab sheik played here by Ricardo Montalban gets to be the target of some gangster heist when the wise guys find out what he's carrying. At that point the contentious rivalries cease among the Cannonballers as they band together against a common foe and to retrieve their prize money.<br><br>Along for the ride this time with Reynolds and DeLuise are a pair of ersatz nuns played by Shirley MacLaine and Marilu Henner. Martin and Davis now pretend to be cops instead of priests from the last film. They're the chief rivals of Reynolds and DeLuise. Telly Savalas does a great takeoff of his Kojak tough guy image on the other side of the law, Tim Conway and Don Knotts reunite as a pair of brain dead deputies. And Reynolds and DeLuise who pretend to be a general and his aide draft none other than Gomer Pyle on their 'top secret mission'.<br><br>Frank Sinatra even makes an appearance and it turns out that Cannonball Run II was the farewell big screen role for both he and Dino. As Dino says, he's royalty in America, surely in show business that's what he was.<br><br>Cannonball Run II which was starting to approach It's A Mad Mad Mad Mad World in terms of casting funny people in it and Don Knotts and Sid Caesar are in both is just a film to turn off the gray cells and put the funny bone in hyper drive.","user":"bkoganbing","rank":[17,17]},{"title":"These 2 movies have a special place in my heart","rating":9,"date":"11 March 2003","review":"Like I said, The Cannonball Run and it's wonderful sequel have been entertaining me since I was a little viewer and I love these two films. Once again Burt Reynolds and Dom De Luise joke and fool around through the entire movie. I think that the major reason that people give this movie bad reviews is that they take it too seriously. It is obvious that no one in the movie was taking it seriously. Like in the first one, it is as if everybody just decided to get together and make a movie for fun. The Cannonball Run films weren't made to win awards or further careers or make a statement. The Cannonball Run and Cannonball Run II were made to show that even big stars can goof off sometimes. It makes me wonder if all the movies the Rat Pack made were made for the same reasons. Anyways, I love this movie and think that it's great fun. The out takes at the end are hilarious and more, nay, all movies should have out takes. Bottom Line: Buy it, watch it until every gag is committed to memory, and live better for it. You're welcome.","user":"chvylvr80","rank":[35,45]},{"title":"Mindless fun","rating":8,"date":"18 September 2007","review":"Cannonball Run II is the sequel for The Cannonball Run.A bunch of crazy people go racing all around the country-illegally, of course.Hal Needham's movie from 1984 has got the best and the biggest stars there could be.Burt Reynolds and Dom DeLuise make us laugh.Mr.Cool and Mr. Bojangles Dean Martin and Sammy Davis Jr. make a terrific couple.Then there's the third member of the rat pack, Frank Sinatra himself.Marilu Henner and Shirley MacLaine as the naughty sisters are wonderful.Jackie Chan is there with Jaws of the James Bond films, big man Richard Kiel.Don Knotts is hilarious kissing the orangutan.The great comedian Sid Caesar tries to catch the big fish.Jack Elam is there with his shots.The hairless Telly \"Kojak\" Savalas is very convincing as the bad guy.Abe Vigoda is fantastic as the gangster in the Godfather way.Then there are greats such as Jamie Farr, Tim Conway, Tony Danza, Ricardo Montalban, Charles Nelson Reilly, Henry Silva, and Jack's son Chris Lemmon.This movie offers many fun moments.I sure had fun watching it.","user":"Petey-10","rank":[14,17]}]