[{"title":"Zelig is a masterpiece","rating":10,"date":"3 July 2004","review":"Yes, a masterpiece.  The entire premise of the movie is wildly original, even coming from WOODY ALLEN who continually cranks out one interesting film after another to this day.  <br><br>The label of mock-umentary just doesn't do justice to the uniqueness of this film.  ALLEN and his amazingly talented staff created a movie that no other director could have made nor even thought of doing.  Some of the humor is rather modern like the forward references to self-gratification during the psychiatrist scenes with MIA FARROW.  But mostly, it's filled with humor from another time and place which we'll never return.<br><br>To me, one of the wonderful aspects of this is the period music dispersed throughout with joyful admiration.  We are lucky that ALLEN has continued to use music from the early part of the 20th century.  I think no other director has so consistently had such a reverence for this wonderful music. Perhaps no other director has such a strong knowledge of it either.<br><br>That WOODY ALLEN normally portrays himself as a nebbishy character in many of his own movies works so well in this movie.  A more aggressive person who becomes a chameleon would not have worked as well at all.  I am glad that MIA FARROW was still associated with him when he made this film, I think no other modern actress could have pulled this off as well as she did.  She has that timeless look that is appealing but has a far-off feeling.<br><br>The flavor of the period-looking cinematography and photography is part of the genius of the implementation here.  It is so right on the money.  The flickering of projectors, the out-of-focus look to so man scenes shot today meld amazingly well with the contrived shots.<br><br>THINK ABOUT THIS - this is years before CGI took over Hollywood...years before FORREST GUMP and countless of other knock-offs have proliferated in movies.  Gee whiz, there is CGI in so many movies these days.  I watched a DVD of a recent movie recently which used special effects in the most unexpected, unlikely and unnecessary parts you'd be surprised.<br><br>Yes, ZELIG is a masterpiece and I only feel sorry for those who cannot see the astounding piece of cinema this is.","user":"Enrique-Sanchez-56","rank":[89,103]},{"title":"A Delightful Story In An Engaging Format","rating":9,"date":"27 March 2005","review":"Was this the first \"mockumentary\"? I checked out IMDb and it predates Guest, Reiner and co.'s This Is Spinal Tap by a year. Not only was it a fake documentary, it sustained the format throughout, never once breaking into an enacted scene. Allen told his story, set in his favorite time period, The Roaring 20's, using special lenses to create the old style newsreels. Using photo stills, mixing real footage with his, and providing exposition via modern-day \"historians\" and aged characters, he gave this innovative film such an authenticity that if one didn't know any better, you would swear there had been an actual Leonard Zelig.<br><br>Allen plays Leonard, a man so devoid of identity, so eager to assimilate, that he literally takes on the appearance or, at least, the attributes of anyone he comes in contact with. Mia Farrow plays his psychiatrist, Dr. Eudora Fletcher, and taken in smaller doses, she actually is perfect in this role. There are a few moments when you get to see an extended dialogue between the two, most notably when her brother is filming \"The White Room\" sessions at her country estate. This is the only time that Allen's shtick gets to flex, as he cracks jokes about teaching a Masturbation class. Advanced. I also loved Zelig groaning about Eudora's terrible cooking under hypnosis. Eventually, Dr. Fletcher is able to cure him, and with his newfound personality, he and Eudora fall in love.<br><br>Allen also introduces the idea of Zelig's story being filmed as a movie, so he inter cuts some of the news sources with scenes from the film (very funny). The one thing that really stood out for me, though, was this revelation towards the end of the film. Woody as Leonard Zelig was smiling. A lot. It was kind of weird to see, but his happiness actually imbued the film with positive emotion and charmed the pants off me (not literally, of course) to such a degree that I will undoubtedly be repeating my viewing pleasure many more times.<br><br>I'll be honest. There were moments early on that I perhaps wondered if he was going to be able to sustain my interest. I thought he might be playing this conceit a little too long. What had, in the first 20 minutes, been enchanting and amusing seemed to dwindle in the middle of the film. Would he really succeed at telling an engaging story in this method? Well, I stuck with it and I'm glad I did. He layers so many meanings into his character's transformations, and all of his historians offer different interpretations. The importance of being yourself. How Zelig's journey was America's journey during the tumultuous and wild 20's. He also has a great running gag about Moby Dick that lampoons the Great American Novel.<br><br>Will Allen ever be this innovative and original again? Well, it appears he's making an attempt with his newest film, Melinda and Melinda, in which he tells the same story twice, with one tone being humorous, while the other is tragic. If nothing else, he at least continues to strive for an authentic voice in this littered landscape of movie franchises and ridiculously insulting comedies. Go Woody.","user":"Salon_Kitty","rank":[55,63]},{"title":"Woody Allen Does the Chameleon","rating":9,"date":"25 April 2003","review":"\"Zelig\" is a very clever movie, the kind you just know Woody Allen is capable of.  In this \"mockumentary,\" Woody plays Leonard Zelig, an insecure man who goes to the ultimate length to fit in.  Mia Farrow offers the love interest as Dr. Eudora Fletcher.  In \"Zelig,\" we get to see Woody spliced into old footage, including the Nazi rally.  This came before the effect became used more often, in movies like \"Forrest Gump.\"  I see this as a transition in Woody's movies.  It comes somewhere between his early funnier movies, like \"Bananas\" and \"Take the Money and Run,\" and his later, more introspective ones, like \"Hannah and Her Sisters\" and \"Husbands and Wives.\" It makes a statement about individuality, and produces laughs in the process.","user":"EmperorNortonII","rank":[29,32]}]