[{"title":"Rear Window is 64","rating":10,"date":"15 April 2018","review":"I must say, no signs of aging. Embedded in its day and yet totally relevant. Perhaps the most entertaining of all of Hitchcock's films. Marriage is the theme and murder is the hook. James Stewart is as perfect as he's ever been. He uses the contradictions of his character to create someone immediately familiar. Thelma Ritter's practicality includes a rant about the destructive effect of intelligence. Grace Kelly enters the scene like a character in a dream. She remains a sort of dream that's why to see her climb the killer's balcony is one of my most cherished film memories. If you haven't seen the film you may think I'm rambling but if you have, you know exactly what I mean, don't you?","user":"yocarlosvarelapr","rank":[132,139]},{"title":"Our Obsession with Voyeurism","rating":10,"date":"8 April 2004","review":"After viewing 'Rear Window' again, I've come to realize that Alfred Hitchcock was not only a great moviemaker but also a great moviewatcher. In the making of 'Rear Window,' he knew exactly what it is about movies that makes them so captivating. It is the illusion of voyeurism that holds our attention just as it held Hitchcock's. The ability to see without being seen has a spellbinding effect. Why else is it so uncommon to have characters in movies look directly into the camera? It just isn't as fun to watch someone when they know you're there. When we watch movies, we are participating in looking into another world and seeing the images of which we have no right to see and listening to the conversations that we should not hear. 'Rear Window' and Powell's 'Peeping Tom' are some of the best movies that aren't afraid to admit this human trait. We are all voyeurs.<br><br>When watching 'Rear Window,' it is better to imagine Alfred Hitchcock sitting in that wheelchair rather than Jimmy Stewart. When the camera is using longshots to watch the neighborhood, it is really Hitchcock watching, not Stewart. Hitchcock's love of voyeurism is at the center of this movie, along with his fascination with crime and his adoration of the Madonna ideal.<br><br>In many of Hitchcock's movies, 'Rear Window,' 'Vertigo,' 'Psycho,' 'The Birds,' etc, the blonde actresses are objects. Notice how rarely they get close with the male leads. In 'Vertigo,' Stewart's character falls in love with the image of Madeleine; in 'Psycho,' we see the voyeur in Hitchcock peeking out of Norman Bates at Marion; and in 'Rear Window,' Jeff would rather stare out of his window than to hold the beautiful Lisa by his side. For Hitchcock, these women are ideals that should be admired rather than touched.<br><br>However, the story of 'Rear Window' isn't about the image of women, as it is in 'Vertigo.' 'Rear Window' focuses more on seduction of crime, not in committing it but in the act of discovering it. At one point in the story, Jeff's friend convinces him that there was no murder, and Jeff is disappointed, not because someone wasn't dead but because he could no longer indulge into his fantasy that someone was. Think how popular crime shows are on television, and noir films at the movies. People do not want to commit crimes; they want to see other people commit them.<br><br>'Rear Window' is one of the most retrospective movies I've ever seen. In a span of two hours, it examines some of the most recurrent themes in film. When we watch 'Rear Window,' it is really us watching someone watch someone else. And all the while, Hitchcock is sitting on the balcony and seeing our reaction. It is an act of voyeurism layered on top of itself, and it allows us to examine our own behavior as we are spellbound in Hitchcock's world. The only thing that I feel is missing in the movie is a scene of Jeff using his binoculars and seeing himself in a mirror. Why did Hitchcock leave it out? Maybe because it would have been too obvious what he was doing. Or maybe he was afraid that the audience would see themselves in the reflection of the lens.","user":"dxia","rank":[316,377]},{"title":"2020 Review. Just being honest...","rating":4,"date":"17 April 2020","review":"If this movie was made today it would get slated by critics. A man spies on all his neighbors but no one takes notice of him despite him sitting DIRECTLY in front of a window with huge binoculars and the biggest camera you've ever seen. The same man also thinks rolling his wheelchair back 2 feet makes him invisible.<br><br>The plot is basic: a man suspects his neighbor killed his wife. It turns out he actually did kill his wife. There's no twist.<br><br>The movie contains two moments of suspense: the soil digging scene - Grace Kelly entering the killer's apartment. And the ending, the killer confronting James Stewart.<br><br>If any movie needed a twist ending it's Rear Window. If the ending revealed that Thorwald didn't in fact kill his wife and there was an entire subplot that the audience missed, that would have added another dimension to Hitchcock's storytelling.<br><br>But as it stands, the plot is basic and nonsensical, there's very little suspense and the runtime could have been 30 mins shorter.<br><br>I also watched the original 12 Angry Men today. Brilliant movie. That one holds up much better.","user":"shammaarb-47379","rank":[12,12]}]