[{"title":"Easily the best arm wrestling movie EVER MADE!","rating":10,"date":"21 November 2005","review":"I challenge anyone to find a better arm wrestling movie.<br><br>Since becoming a professional arm wrestler and losing my ex-wife, this film has inspired me. <br><br>It's not easy being a single dad whilst trying to cope with the rising gas prices to keep my rig on the road.<br><br>I'm sure a lot of Americans find themselves in this position, and they too should benefit from this realistic docu-drama of the typical American man.<br><br>To anyone, who find themselves in a similar rut, or experience any type of bad luck, I thoroughly recommend renting this movie, and joining the local arm-wrestling club.<br><br>Like I said this is easily the best made arm-wrestling movie, and I look forward to perhaps a left-handed sequel.","user":"doyles-1","rank":[51,54]},{"title":"Am I delirious or is this an alright flick?","rating":7,"date":"28 December 2001","review":"I recently remembered seeing this film when I was much younger and liking it.  When I checked it out on IMDb, I was quite disturbed.  Why in the world would I like this weird, arm wrestling movie with Sylvester Stallone?  So I rented it again to see why I had liked it as a kid or to see if I had been delirious when I first saw it.  The strange thing is, even though it is not at all my type of movie, I still really enjoyed it.  I've heard that the kid is a bad actor and all, but I really don't think he is.  Maybe I'm still delirious, but I thought the movie was pretty darn heart warming.","user":"jehn","rank":[91,101]},{"title":"A real crowd-pleaser","rating":8,"date":"17 December 2005","review":"It's hard to dislike Over The Top. Sure, it can get corny, old-fashioned, far-fetched (the gate-crashing scene, fun and unbelievable.) The movie sorta plays like a cross between Highway to Heaven and THe A-Team. But somehow, you find yourself watching despite whatever 'good judgment' you think you might have regarding the cinema. You get swept up in the film's good vibes. You care about what happens to Hawke and his son. Most of the credit for this has to go to Sylvester Stallone. He plays the part of a truck driver coping with the new experience of getting to know his twelve-year-old son for the first time quite well. You care because you sense how much HE cares. it is conveyed by a sure delivery from Stallone. His character never seems too slight or well, too Over the top. There is a bond that slowly forms between him and his son. And the movie has a great \"training\" montage complete with great song that will remind you of what was so good about the Rocky films. David Mendenhall agreeably plays the part of Mike with the combination of distrust, arrogance and vulnerability you would expect from someone his age who went thru what he did.. No, he's not Haley Joel Osmont. We won't leave the movie shaking our heads at his incredible,precocious talent. That doesn't mean he didn't acquit himself nicely in the film. Robert Loggia's role could have been fleshed out a little more. He seems to much like a comic-strip villain. The film could have delved more into his reasons for hating Hawke. that part could have been beefed up a bit. <br><br>I enjoyed the Arm-wrestling backdrop. It was a refreshing change for movies of that era that boasted big stars like Stallone. Usually, movies that were sport-specific other than the trad football, baseball, or boxing stories tended to use people who were less known (Gotcha, Gleaning the Cube)<br><br>A good film. warm, funny, exciting. The better face of the Eighties cinema.","user":"BeyondRosebud","rank":[25,27]}]