[{"title":"\"All in all fantastic light hearted fun.\"","rating":8,"date":"12 February 2006","review":"Miss Marple joins the board of senior trustees for a youth reformation committee, which prides itself on reforming troublesome teenagers by means of naval cadet training on board a ship called The Battledore. But when one of her fellow trustees is murdered by his snuff being laced with poison, Miss Marple learns that he had just returned from a routine visit to The Battledore and she suspects that the motive for his murder must lie on the ship. Using her position as senior trustee, Miss Marple pays a visit to the ship much to the chagrin of the eccentric Captain Rhumstone (Lionel Jeffries) who seems anxious to get rid of her. With the help of her loyal friend Mr Stringer (Stringer Davis), she soon learns that the shore leave patrol has been committing a series of jewel thefts from the high society. But the question is which one? Meanwhile, Lieutenant Compton (Francis Matthews) has been run through with a sword and hung from the ship's yardarm and suspicion immediately falls on Sub Lieutenant Humbert (Derek Nimmo) whom didn't get along with Compton because they both fancied the same girl, Nurse Shirley (Norma Foster). As usual, Chief Inspector Craddock (Charles Tingwell) thinks he's got an open and shut case, but Miss Marple isn't convinced of Humbert's guilt even though the jewel robberies were all committed after high society parties, all of which he and Shirley had both attended. In her usual shrewd way, Miss Marple sets a trap for the killer and uncovers a big swindle attached to the higher ranks among the committee but not before Shirley is murdered by a poisoned spike primed to a mousetrap...<br><br>Murder Ahoy was the fourth and final entry in the series of comedy whodunits starring Rutherford as Miss Marple. The series was doing well at the box office, but the producers were unable to get the rights to any more of Christie's works. In addition, this is the only one that wasn't adapted from a Christie novel and the film was produced in 1964, but released at the end of 1965 in order to space out the series. Following the end of the Miss Marple franchise, director Pollock would make one more feature before he more or less vanished from the scene. Another Christie, Ten Little Indians (see my review), for Fu Manchu producer Harry Alan Towers.<br><br>All in all, Murder Ahoy is fantastic light hearted fun with Rutherford on fine form as usual as the spinster detective. She gets good support from Lionel Jeffries as the Captain and Stringer Davis offers his touching portrayal as the local librarian Mr Stringer who is Miss Marple's closest friend and is always concerned that her meddling may result in her getting bumped off, but its never any use as she is determined to unravel the mystery and she does in her own inimitable fashion. Moments to savour here include her sword fight with the killer at the climax when she assures her assailant \"I must warn you that in 1931 I was the winner of the ladies fencing championship.\" Screenwriters David Pursall and Jack Seddon came up with quite a good storyline of their own and the identity of the killer is well concealed until the end, but I felt that the script could of been a little tighter. Nevertheless, its all good fun and Rutherford has no trouble in dominating the film with her uniquely individual performance as Miss Marple, George Pollock's direction is smooth and the atmospheric black and white camera-work of Desmond Dickinson is an added bonus.","user":"jamesraeburn2003","rank":[31,32]},{"title":"Delightfully old-fashioned.","rating":20,"date":"20 August 2004","review":"When I saw the movie for the first time some 25 years ago I did not like it.Today I find it quite entertaining and I have much fun to watch it.Hindsight displays its charm.First of all,this is the kind of movie they do not do (and won't do) anymore.George Pollock,the par excellence Agatha Christie director -he directed three other Miss Marple films and the second version of \"and then there were none\" aka\" ten little Indians\" - is no genius but his movie has its fair share of humor,even black humor (the doctor does not seem to take the deaths seriously,always making sure a child be born to carry on,so to speak).This is an original screenplay ,not adapted from a Christie's book and that accounts for the rather weak detective plot.But interest lies elsewhere:Margaret Rutherford's mischievous old lady detective is allowed things Mrs Christie would not have thought of : spending a night in jail and fighting a duel (sabers) with the culprit!","user":"dbdumonteil","rank":[27,28]},{"title":"All Aboard!","rating":9,"date":"9 February 2000","review":"The third and arguably best film from the Miss Marple films of the 6o's. This time out Miss Marple must solve a mysterious death concerning a trustee and a snuff box, which eventually lands her on board a ship as an observing trustee.  Once aboard, Miss Marple  and her presence seemingly invite murder after murder.  Margaret Rutherford furls her sails and lends the film her gargantuan aplomb.  She is a battleship on screen.  The cast also includes Stringer Davis(real-life husband) and Charles Tingwell(Inspector Craddock) reprising earlier roles.  Lionel Jeffries is the ship's captain and he is simply marvelous as he bemoans Marple's presence and even calling her \"a Jonah and an ill wind blowing.\"  Definitely a treat and comic tour-de-force for Rutherford, who we get to see fence no less, and Jeffries.","user":"BaronBl00d","rank":[21,22]}]