[{"title":"Cheerful musical","rating":5,"date":"6 August 2013","review":"I watched this movie as it's from the Rogers/Thomas stable that went on to make the Carry On films. Tommy Steele appears in two roles and seems to be able to handle the acting rather well for a pop star, his cheerful personality certainly helps to keep the momentum going in this picture.<br><br>The musical numbers get simple production, there are no large dance routines here. Part of the fun with a musical is guessing when songs will appear, so you can bet your bottom dollar that when Tommy is being shown around a guitar factory, well, yes - he gets presented with a guitar and starts to sing.<br><br>This is a lighthearted film, but not a comedy. The support cast do a good turn in keeping this moving, but this is not a film to watch for spotting familiar faces of English comedy.<br><br>I've given this film a 5 as it's passable entertainment, an interesting outing from the Carry On production team in their early years. The songs, written by Lionel Bart, who would go on to write Oliver!, are not too bad, and there are even one or two hit songs in the film. Interestingly Eric Rogers, who composed for most of the Carry On films had a role in the orchestration for Oliver! (he had nothing to do with this film, the composing honour here went to Bruce Montgomery).<br><br>All in all, old fashioned, pleasant, unexciting. Worth a try.","user":"karl-a-hughes","rank":[16,16]},{"title":"Lightweight musical that never gets beyond mediocrity.","rating":5,"date":"28 November 2019","review":"This is the second film outing for the Tommy Steele, the short lived English rock 'n' roll star, who not only gets the opportunity to sing several forgettable songs, but also enables him to act and dance with June Laverick, his love interest in the film. The film is essentially a showcase for the young pop singer to expand his career by more then just strumming a guitar and singing pop songs copied from American artists. Here, he does his best to keep the interest of the audience in this low budget film, with his toothy grin and cheeky demeanour, but his wooden acting, the absurd storyline, together with the very dull dance sequences, renders this film as simply mediocre and a yawn. Eric Pohlmann and Alan Wheatley are particularly good in supporting roles, but despite their valiant efforts, the film never moves out of second gear.","user":"geoffmcauliffe-60295","rank":[5,5]},{"title":"Oh, that princess!","rating":10,"date":"7 May 2006","review":"Oh yes. I was 9 when I saw this film at a tiny little cinema on a rainy day in Padstow, Cornwall. Must have been school spring or summer holidays. I immediately fell madly in love with June Laverick. I've remembered all of the tunes since then, and can remember so much of the movie too ... that's 50 years ago. I suppose that was the gift of Lionel Bart's music.<br><br>I've always felt that \"Princess, If You Love me, I'm Prince\" is/was the most romantic of songs. And I loved \"Happy Guitar\", \"It's all Happening\", \"My Family Tree\" ... still know all the words, so it must have hit me hard.<br><br>I've not seen it since but would love to, and long ago lost the 10\" LP of the music.","user":"taylorjulian","rank":[15,20]}]