[{"title":"It 's a must see for Western fans and cult movies lovers","rating":7,"date":"23 June 2006","review":"Jessicca Drummond ( Barbara Stanwick ) is an untameable owner who rules over a small city in Arizona county . The cattle queen is supported by a little army formed by forty gunfighters . Her power will be modified in arriving the Bonnell brothers ( Barry Sullivan, Gene Evans and Dix ). One of them ( Sullivan ) is proclaimed sheriff and his vision from law and justice differs quite of Jessica Drummond and her brother ( John Erikson ), a young gunman eager to take up a life of crime .<br><br>This is a magnificent Western plenty of violence , hatred ,gun-play, an impossible love story...in a word : emotion , besides it contains effective action sequences as the raid on the small town . Of course , there are ritual shootouts among gunslingers confronting each other in some quick-draw duels in the accepted Western movie fashion , but this time with no observing the honorable ¨ Code of the west ¨ . The showdown isn't the usual because of it is developed of strangest manner and no habitual rules , just like is seen at the initial and final feud . The film has exciting and captivating images as when Barbara Stanwick appears riding in her white stallion with his forty henchmen worn in black and in column( just like Alibaba and the forty thieves from ¨Thousand and one nights¨ book ) and strange images of a dead man on the showcase with the caption : murdered by Bonell brothers and shot in back . Furthermore , it packs a sensational black and white cinematography by Joseph Biroc . The film gets excellent edition by Gene Fowler , he is a famous editor and occasionally director of Western and Sci-Fi ( I married a monster from outer space , I was a teenage wolf ). Samuel Fuller direction is inspired , he directed other three especial Western ( Run of the arrow , Baron the Arizona , I shot Jesse James ). But ¨ Forty guns ¨ is the best , he realized a thrilling and fascinating story , nowadays converted in an essential and indispensable cult movie. Rating : Better than average. Wholesome watching .","user":"ma-cortes","rank":[43,48]},{"title":"A Decent And Odd Western","rating":8,"date":"5 August 2007","review":"If you've never seen this film, I think you'll find it a bit different from most classic westerns. It's really more of a film noir, I thought, and I liked that angle. I say \"film noir\" because of feel. This western had stark black-and-white photography with tons of shadows and it had a dramatic scene near the end that was very noir-ish. I was very impressed with the ending, and that's all I will say as to not spoil it for others.<br><br>The DVD has the option of fullscreen or widescreen. Please consider the latter, because that is how it was presented: in \"cinemascope,\" and you'll want to see photographer Joseph Birac's work in all its glory.<br><br>For Barbara Stanwyck fans, this might be a little disappointing because Barry Sullivan is the star of the film, not her, despite the billing. Sullivan plays \"Griff Bonnell\" and he is the principal figure in the movie, although Stanwyck's presence and character in the story are very strong as \"Jessica Drummond.\" \"Griff,\" along with his brothers, played by Gene Barry and Robert Dix, have more lines than Stanwyck, who doesn't even come on screen until 20 of the 80 minutes have elapsed. <br><br>All the characters are pretty interesting, however, no matter what their screen time. Those include some strange supporting roles, particularly two lawmen who don't sound and act like lawmen: Hank Worden's marshal role in the beginning and Dean Jagger's stint as the sheriff who has designs on Stanwyck.<br><br>To repeat, this is an odd story. I mean, how often does one see a tornado in the middle of a western movie? Some of the lines in here were quite profound, too, and some were uttered really stupidly. It's a curiosity piece, that's for sure.....but definitely worth watching if good photography and odd characters interest you.","user":"ccthemovieman-1","rank":[31,37]},{"title":"West Slide Story","rating":8,"date":"8 September 2002","review":"`Can I touch it?' asks Barbara Stanwyck's cattle queen, presumably referring to Marshal Barry Sullivan's gun. `It might go off in your face', replies the Marshal. In this brief interchange lies the implicit heart of Sam Fuller's somewhat surreal and operatic western, `Forty Guns'. Fans of more mainstream western movies moseying in from great but chaste works like `My Darling Clementine' or more contemporary cheroot-grinders like `Silverado' will find their expectations seriously challenged.<br><br>`Forty Guns' gets your attention immediately with a thunderous opening-credit ride-by. Ms. Stanwyck is astride a pure white stallion leading her Forty `guns' in a column of twos, like a female Custer on her way to a last stand that only she might be able to imagine. As the riders flow, without breaking stride, around a buckboard carrying the three Bonnell brothers, of whom Barry Sullivan's Griff is the eldest, each bro registers the proceedings with a facial expression consistent with his age and experience. It is, perhaps, with the exception of the previously-quoted sequence, the best moment in the film. The dust having settled, much of it on the Bonnells, 164 hooves fading into silence, the brothers repair to a nearby town for a rollicking bath. Thus it begins. Eventually it ends. You may or may not be quite sure what happened in between. But this is not necessarily a bad thing.<br><br>In terms of fundamental style, `Forty Guns' is really a 50's TV western jumped up the big board, complete with that genre's trademark, clothes-make-the-hombre ambience. The 50's TV western was a highly stylized form in which anyone having the correct attire could be a cowboy, even Gene Barry, who plays the middle Bonnell brother. Mr. Barry went on to a successful TV career, launched by the series `Bat Masterson', in which his undeniable urbanity percolated up through his character for several seasons, forcing out a Masterson who was rather too smirky, and overburdened by savoir faire. (The real Bat, born in rural Kansas, was a colleague of Wyatt Earp, and cut from the trans-outlaw cloth. He had polish, compared to many contemporaries, but was not a fop). A form as stylized and libidinously constrained as the 50's TV western then falls into the hands of Samuel Fuller, one of Hollywood's most intense and emotional directors; a man who would have shoved a submarine through a soda straw if he had felt the cinematic need. In the case of `Forty Guns', the result is a movie that struggles to proceed, straining in one direction while constantly implying that it would love to go in any number of others, like a big dog on a short leash. But it is this quality that gives the film much of its cult appeal. I'd be hard pressed to call it a good film, although many would. But it is absolutely interesting.<br><br>`Forty Guns' should probably not be anyone's first Western (It's really film noir, podnuh). Said person might not ever want to see another. Still, it's worthy of appreciation, if for no other reason than for what it tried to be. Westerns of the 60's and 70's (of which I remain a die-hard fan) often did service by examining sensitive social issues, mainly racism, buffering them with the remove of a century or so. Why not a western that attempts, in its own unusual way, to examine sexuality? Post-feminist womanhood will not be thrilled with the somewhat perfunctory, testosterone-uber-alles ending. But, given the rather startling preceding scene, the ending is entirely consistent with the film's innate strangeness, and its apparent message: love may be over-rated and should probably be avoided whenever possible. I can honestly say that I have never seen anything quite like `Forty Guns', at least under a Stetson, though certainly under a snap-brim fedora. `Johnny Guitar' is in the same angst-arama zone but it's a girl-fight. In `Forty Guns', Barbara Stanwyck, though certainly a presence, is more the May Pole around which the boys gyrate, or on which they hang. The only films I can recall hitting me in quite the same way were some 60's products of the Kuchar Brothers (George and/or Mike). Kuchar films were works of droll, satirical, goofiness that happened to have assumed cinematic form (try keeping a straight face while just reading a list of their titles). `Forty Guns' felt much the same at times but was, apparently, being serious.<br><br>`Forty Guns' might stand up quite well to a remake, now that most audiences and studio suits have accepted that sex exists; preserve the stylistic essence of the original but let it be as tumescent as it needs to be. There is actually nothing wrong with the fundamental plot, which I won't reveal so you can project your own understanding. It simply lacks a certain level of on-screen flow. Story elements sort of roil in and out of view in this nearly over-full cauldron. But they're all in the same film, which helps. `Forty Guns' has a slightly messed-with feel to me and may not be entirely what the late Mr. Fuller had in mind. But, unfortunately, we probably won't be seeing a director's cut. The song, `High-riding Lady with a Whip', should certainly be preserved in any remake. It's a piece of music that is as hilariously strange as the rest of the film; one that seems to take itself entirely seriously while making you wonder, `Can this really be happening?'<br><br>Don't get off the Sam Fuller train at this outlying station. Fuller's the real deal, an artist who wielded a very distinct brush. Reboard and move on to the `The Steel Helmet', his gritty Korean War drama. If this one works for you, consider hanging out in Fullerville for a while. Anyone who appreciates film should become familiar with his work. And, if you thought the device of looking at one's target through the bore of a gun originated with the James Bond films, `Forty Guns' will set you straight, right down to the lands and grooves.","user":"rrichr","rank":[60,79]}]