[{"title":"Very interesting...to say the least","rating":7,"date":"29 October 2006","review":"In Victorian London Anthony Perkins plays shy but brilliant Dr. Henry Jekyll. He has a loving wife (Glynis Barber), a beautiful home and is a respected man. One night he accidentally ingests some vapors from alcohol mixed with cocaine and becomes evil, vicious, sex-obsessed Mr. Hyde. Also around this time Jack the Ripper is killing prostitutes. Is it Perkins...or someone else?<br><br>This came and went VERY quickly in 1988. It was cut to ribbons by the MPAA and the critics called it a sick, unpleasant piece of trash with Perkins at his worst. While I agree it's no classic it's not the disaster I heard it was.<br><br>It's a very sleazy movie and makes no apologies for it (which is sort of refreshing). It's full of female nudity and even full frontal male (which was cut out of the R rated version). It is unpleasant with graphic stabbings but it's shot on elaborate, beautiful, expressionistic (check out Perkins' lab) sets. It's obvious a lot of money went into this. The script is also quite interesting getting into Jekyll's mind about what's going on.<br><br>Good acting all around helps. Ben Cole (looking like he came from \"A Clockwork Orange\") plays a male prostitute and is good. Barber is excellent as Jekyll's wife. All the ladies playing prostitutes are actually pretty good actresses--they're beautiful and have no trouble taking off their clothes. However Perkins holds this movie together. He does overact as Hyde but in a good way. When he's on screen you can't take your eyes off him.<br><br>The MGM DVD released a few years ago is the unrated version, not the R one as is advertised---not that I'm complaining. So it is graphic and unpleasant but also very interesting and well-made. Worth seeing if you're not easily offended. A 7.","user":"preppy-3","rank":[21,21]},{"title":"Lavish take on the Dr. Jekyll - Mr. Hyde and Jack The Ripper tales","rating":8,"date":"29 September 2002","review":"*CONTAINS SPOILERS*<br><br>Those who have been dogging Edge Of Sanity should have known what they were getting into before they watched this film -- the film summaries on the video packaging alone gave enough warning that this was going to be a twisted story full of perverse material. I for one am not afraid to say I really LIKE this film!  I first saw it in an \"unrated\" edition on VHS back when it was first released on home video in the late 1980s, and I was enthralled.  Now, MGM has released it on DVD in what I think is the closest to that unrated version there is, if in fact it is \"re-edited\" like the notice on IMDb.  I wouldn't be surprised if this DVD edition was actually that original unrated version, as many titles have been showing up on MGM DVD in uncut editions with the original MPAA rating on the cover.<br><br>\nWhile experimenting with anesthetics, Dr. Henry Jekyll accidentally inhales fumes from an altered drug.  This unleashes not only ability to act out his inhibitions, it unleashes repressed sexual feelings he had experienced as humiliation during his childhood.  He then goes on a killing spree, murdering prostitutes in the area (possibly to get back at the woman who laughed and taunted him in his childhood?).  He also obsesses over a prostitute named Susannah that looks just like that woman from his past, and rather than kill her he relishes in her similarly shared dark nature when he gets her to inhale the drug.  Note that near the ending, Johnny is hanging upside down while Susannah laughs maniacally, mirroring the opening scene. This brings the film full circle.  It's a fascinating idea that Henry Jekyll/Jack Hyde is also Jack The Ripper.<br><br>Yes, Edge Of Sanity is sinister, twisted, perverse, and trashy.  It's also lavish, elegant, and beautifully done, and downright intriguing.  The cinematography is excellent (the DVD is a vast improvement over the old VHS of Unrated and R versions), the costumes are a wow, and the music score is superb as well as appropriate to the scenes it enhances.  A lot of imagination went into this production, and it's unfair to say it's an inappropriate film.  I found it to be more disturbing and wickedly fun than the more recent FROM HELL (which was more a CGI visual feast) and more sexually appropriate than the grandiose arthouse T&amp;A of EYES WIDE SHUT. <br><br>\nThere's a fair amount of sex, nudity (more full frontal male nudity in a bathhouse scene than the topless prostitutes combined), and even a hint of male bisexuality during Hyde's tryst with Susannah and Johnny. It also says a lot about how things haven't changed so much in society's decadence in issues of drugs and sex.  The only thing that I found distracting was that during the rooftop scene, the actress playing the prostitute seemed to have breast implants, something I'm sure that is quite wrong in the context of the time the film is taking place!<br><br>Anthony Perkins chews the scenery well, playing his part of Jack Hyde to the hilt.  It would be hard to think of any other actor that could have carried this part so well.  Those who adored him in Psycho, Pretty Poison, and Crimes Of Passion will find a lot to love about his role in Edge Of Sanity. For film collectors of the dark and sinister, this is a nice addition and I am happy that MGM has rescued this film from obscurity for a whole new audience to discover as well as make established fans like myself very, very happy.<br><br>Call it trash if you want to, but it's quality, wicked, ELEGANT trash!","user":"hippiedj","rank":[13,13]},{"title":"Anthony Perkins at his lunatic best!","rating":8,"date":"18 February 1999","review":"Anthony Perkins gives a bizarre and unhinged performance in this gothic style adaption of the Dr.Jekyll and Mr.Hyde story complete with elements from Jack the Ripper. This time it's a cocaine-like substance which causes the good doctor to metamorph into the uncontrollable Jack Hyde. When Perkins is transformed into the savage beast he decides to make slashing the throats of prostitutes a hobby. Intriguing take on the over-played Jekyll and Hyde story with some twists and turns thrown in to keep the viewer interested. Also an excellent performance from Glynis Barber as Mrs.Jekyll. Atmospheric settings, weird situations, and over the top performances make this one an eye opener for anyone looking for something a little different. And when it comes to the role of Perkins, Edge of Sanity is a more than appropriate title.","user":"Smokey-13","rank":[18,19]}]