[{"title":"What's Wrong With It ?","rating":8,"date":"11 December 2001","review":"\"Name's Dangerously Johnny Dangerously.\" - \"Did you know your last name's an adverb?\" - In the last twenty years, movie parodies have become really bad wastes of time and money utilizing weak actors and exploiting out-of-work celebs, but at one time they used to be funny, hilarious and worth watching more than once. \"Airplane,\" \"Naked Gun,\" \"Young Frankenstein,\" \"Blazing Saddles,\" and \"Scary Movie\" top the list as among the best movie parodies ever made, but one movie that tends to get forgotten is \"Johnny Dangerously.\" How can anyone not love this movie? It's a hilarious spoof of all the old gangster movies of the 30s and 40s, and if you've never seen them, watch this instead. It has a talented top notch cast with hilarious writing, incredible comedy and one thing modern parodies don't have: a plot!! Michael Keaton has a ball in this role as anything goes playing a young mobster suddenly at the top of the New York mob and putting his kid brother through law school, and when he makes it to city district attorney, the brother vows to arrested Johnny Dangerously, totally unaware he's the only guy unaware its his brother. Popular and recognizable comedy stars fill nearly the entire cast. Marilu Henner is Johnny's girlfriend, Richard Dimitri plays Johnny's nemesis mangling the English language every time he talks (One line concerns he ought to be arrested for murdering the English language.) and Griffin Dunn plays the clueless D.A., but my favorite role has got to be Joe Piscopo. He has all the best lines, and there are a lot of quotable references in this movie. (\"You can't park here; it's a handicapped spot!\" – \"I am handicapped. I'm psychotic!!\" – Just as Joe whips out his parking placard describing him as a psychopath.) There are both hilarious lines and visual sight gags through this movie, and no one anywhere close to normal. Danny DeVito, Alan Hale, Ray Walston round out the cast in this under appreciated star-studded action comedy movie that lampoons gangsters and Prohibition a heck of a lot funnier than \"Mafia\" ever did, and the best part, there aren't any gay jokes, drug references or sophomoric humor anywhere in this movie and the sexual references are so subtle, you can actually watch the movie without rolling your eyes and being offended.","user":"aesgaard41","rank":[39,41]},{"title":"Fargin Corksuckers!!!","rating":9,"date":"22 May 2003","review":"This movie is just too funny, a totally non-PC gangster romp. If Mel Brooks made a picture about the Mob in the 30's, it would probably look like this. Too many great one-liners to to remember, and while its not for everyone, anyone who DOESNT laugh a whole bunch of times doesnt have a pulse. So, put it on and LAUGH you Iceholes!!!","user":"the_mad_mckenna","rank":[34,38]},{"title":"Very funny movie that gets a bad rap!","rating":8,"date":"13 February 2004","review":"For a movie that gets no respect there sure are a lot of memorable quotes listed for this gem. Imagine a movie where Joe Piscopo is actually funny! Maureen Stapleton is a scene stealer. The Moroni character is an absolute scream. Watch for Alan \"The Skipper\" Hale jr. as a police Sgt.","user":"JR541","rank":[24,26]}]