[{"title":"Still my favorite horror film...","rating":10,"date":"10 February 2000","review":"When you want brutal, look no further, but when you also want to see perhaps the greatest of all comic-book movies not based on a comic-book, it's in George Romero's original take on his continuing mythology. It's not just one of the towering horror films, or horror comedies (what will a poor dead fellow do when the escalator starts?!) but one of the great sequels, more ambitious and ass-kicking than its predecessor, with a filmmaker more confident and technically proficient with his abilities.<br><br>Romero didn't originally want to do *any* sequel to his original 'Night', but after a visit by some friends to a soon-to-open mall nearby his hometown of Pittsburgh, it struck a chord as to who would be coming here – and what so much consumerism in one place would mean. \"Why do they come here?\" one of the four survivors that happens upon this mall swarming with these flesh-eaters asks another. \"This meant something to them. Instinct, maybe. This was an important part of their lives,\" he responds.<br><br>I don't think necessarily Romero meant to show the film as any sort of 'This is what will happen!\" type of social horror thing. It's more about, this is where we are at NOW, and in that sense, though broader and a whole LOT bloodier, it holds a place right next to a film like Network as one of the magnificent satires of its time and place, and as much about what the public is like. Romero acts as both pessimist and optimist in this world though; past all the chopped limbs, exploding heads (oh yeah!), Tom Savini stunt and make-up and intestines ripped apart, what holds up the film for me is seeing these four characters come to grip with the horror they've made for themselves, holding up in this \"paradise\" of a mall.<br><br>Balls-to-the-wall horror, social horror, and some genuine paranoid horror stuff (note to self, never try and fire a gun at a single zombie when in a dark room full of electrical wiring and pipes), and plenty of rock and roll attitude, this is a personal favorite and the most entertaining horror film of its time. And the Goblin music soundtrack yummy.","user":"Quinoa1984","rank":[98,114]},{"title":"How much is that Zombie in the window","rating":22,"date":"22 January 2001","review":"By turns horrific, hilarious, disgusting and absurd Dawn of the Dead is the work of a director truly on top of his game.  Given almost total control (something which was to be denied Romero in later years) George Romero gives us his unique and vivid view of a world in absolute turmoil.<br><br>Not just a mockery of the hedonistic and empty America of the late 70's Dawn is also a parable or warning if you like of the brittle structure of society and how easily it can be disintegrated.  Many have criticised the film for being too over the top and questioned the quality of the acting.  This for me is one of the joys of the film, Romero uses gaudy sets and effects and combines this with comic book hero dialogue to lull us into a false sense of security. Then masterfully Romero pulls the rug out from under us and brings the reality of the situation crashing in on our heads.<br><br>Dawn stands alone well but really comes into its own as part of the trilogy to which it belongs.  One theory of mine is that the Alien trilogy (forgetting the miserable fourth installment) takes a lot from the dead trilogy namely the pace and claustrophobia of the two which book-end the mass hysteria and over the top horror and violence of the middle film.<br><br>Undoubtedly one of the great Horror films of modern time. Or perhaps there is something about being the only people left alive and living in a shopping mall that appeals to the kid in all of us. 10/10","user":"gary_dillon","rank":[138,165]},{"title":"George A. Romero's masterpiece - the best zombie apocalyptic movie of all time my number 1 favorite","rating":10,"date":"4 March 2018","review":"Dawn of the Dead is George A. Romero's masterpiece - one of the best zombie apocalyptic movies of all time. It is 1978 classic this movie really started the zombie genre. It is been almost 40 years anniversary now since this movie come out. Night of the Living Dead was George A. Romero's first film that really introduced the zombie genre, but this to me really started the zombie praise. This in my opinion is one of the best zombie movies of all time. <br><br>It is my number 1 favorite zombie movie I love this movie to death and it is one of my personal favorite horror films of all time. This movie is based on a Zombie apocalypse this group find's them self's with this pilot who takes them with the helicopter in the air and they find a shopping mall. There is a perfect place to go in to a \"Zombie Apocalypse.\" So they go in to shopping mall and they have every single item in that shopping mall after disposal to use on the zombies. <br><br>As you can tell it is a very fun movie but more important this movie inspires zombies. Without this movie there wouldn't have been The Walking Dead there wouldn't be 28 Days Later there wouldn't have been any of that. This movie is very important this days it was remade in 2004. It is a fun, fun ride I enjoy this film it is entertaining horror flick. Back in the 1978 that come out it was more scary than it is today. This is where I give this movie the most credit, just like... you have a great time watching people murdering zombies. This movie has a great action, great story, plot, great effects the real zombies. It has gore, blood, you se heads been blowing off. George A. Romero's wrote and direct brilliantly this movie. Tom Savini creates a great special effects for the zombies. Great make up, great blood squibs. The film is fast paced it is excellent brilliant. You see all those SWAT team sieging the building shooting the zombies and gunning the down violent gang. You see whole world comes to an end and people shooting zombies even kids are zombies in this movie. <br><br>The group in the shopping mall has to deal not only with zombies and the disposing them, they also have to deal with poachers who break in to their home and start stealing items and letting zombies in the mall. Tom Savini was one of the motorcycle poachers who was stealing items in the mall. Gaylen Ross was a fantastic babe as Francine news reporter. David Emge as Stephen the pilot was excellent. Ken Foree as Peter a SWAT team member was the best in this movie. Scott H. Reiniger as Roger another SWAT team member was good in his role. They don't make movies like this today anymore. It's a R-rated movie and it is a perfect 10. Dawn of the Dead is one of the best zombie apocalyptic movies of all time, I highly recommend this film to any horror fan.","user":"ivo-cobra8","rank":[96,114]}]