[{"title":"Power of the Press","rating":6,"date":"30 December 2011","review":"Capra-esque (in fact, Capra even directed a movie with the same title years earlier) story of a humble small town editor trying to take down a big city isolationist publisher. The plot is fairly engaging and the script has some snappy lines, but it's all so thick with propaganda that it's hard to take seriously. Otto Kruger is so malicious and devious, he might as well be wearing a swastika on his arm. Heck, they practically call him a Nazi in a half dozen different ways anyway. Still, as heavy-handed and hokey as it is, it's kind of fun, and I enjoyed Gloria Dickson's performance as the loyal, brassy secretary (shades of Jean Arthur in MR. SMITH). The best of the three early features in the Sam Fuller box set, even if that's not a tough contest to win.","user":"MartinTeller","rank":[10,11]},{"title":"A bit too idealistic and obvious towards the end, but otherwise a very good film.","rating":7,"date":"11 March 2010","review":"This film is part of a Sam Fuller DVD collection that was recently released. However, unlike most of the films in the set, he only wrote this film--he did not direct it.<br><br>The film begins with the owner of a New York newspaper coming to realize that his paper has betrayed the public's trust by distorting stories in order to sell papers. He's about to give an important speech and decides to use this platform to announce important changes to the paper. However, he is shot and killed and the amoral man who was about to get fired for what he's done to the paper is now in charge. Little does he know that the boss dictated a new will before dying--leaving the paper to an honest small-time publisher (Guy Kibbee--in a rare dramatic role).<br><br>The purpose of the film is to discuss the abuse of the first amendment's freedom of the press. At times, it draws a parallel to the yellow journalism and half-truths of Nazi Germany. In many ways, the film is an attack on extreme nationalism and implies, quite rightly, that Americanism is best exemplified by an open mind and a desire to print the truth. Sadly, the sort of distortions and manipulations shown in this film are not exactly things of the past--though I assume newspapers don't hire hit-squads like they did in this film! The movie is quite entertaining though it does on a bit strong and seem a bit idealistic. However, despite the heavy-handed ending, the film is quite entertaining and a nice low-budget film from Columbia.<br><br>By the way, another reviewer said that this film effectively killed Otto Kruger's career. Though it could be argued that the quality of the scripts he got after this film might have declined, it certainly didn't ruin his career as he has more than 60 credits following \"Power of the Press\".","user":"MartinHafer","rank":[9,10]},{"title":"Capra-esquire drama of abuses of the press that is still relevant today.","rating":5,"date":"3 May 2010","review":"Had Frank Capra done this film 5-10 years earlier, he could have called it \"Mr. Bradford goes to Press\". Under the thumbs of Columbia after Capra had left their employ, it ended up in the \"B\" category, running barely over an hour. Guy Kibbee is excellent here as a small town newspaper owner who is left controlling interest in a big city paper after the owner is brutally murdered after planning on changing the methods in which the paper is run. He must face the very nasty Otto Kruger who fights his presence ruthlessly and editor Lee Tracy who at first is out for the almighty buck then changes his tune when he fights his own moral conscience.<br><br>I like the fact that the leading hero was not a leading man like Gary Cooper or Jimmy Stewart, but a portly teddy bear of a man usually stuck playing dumb politicians or gullible businessmen suckered in by some gold-digging chorus girl. Kibbee plays the role honestly and beautifully, and could not have been more perfect. Lee Tracy gets to show many different layers of the editor who goes from just wanting the big headlines to fighting for truth. Gloria Dickson, as the late owner's loyal secretary, is fine too. Otto Kruger is extremely one dimensional as the villain, whom I assumed to secretly be Nazi. I have always had an issue with this actor as the distinguished older gentleman who somehow ends up with a younger woman on his arm, and usually loses her to the more handsome hero by the end. Every time I see a picture of Kruger with his slimy hand on some younger stars shoulder, I get a cringe of disgust. It's not his fault he was stereotyped, and fortunately here that doesn't happen. He is the poster child for Carrie Fisher's definition of distinguished: Ugly with money.<br><br>Minor Watson is very good in his short appearance as the unfortunate newspaper man. A young Larry Parks is recognizable as the young reporter accused of his murder, while Victor Jory is appropriately evil as Kruger's henchman. This film went in with a lot of things to say and got to the point very well. It's unfortunate though that the very rushed conclusion diminished the impact of the message and gave Kruger the chance to deliver a performance that can only be described as embarrassing. One can almost envision Capra's take on the film's message that would have added at least 20 minutes onto the running time. Plus, an actor such as Edward Arnold or Claude Rains would have made Kruger's character more understandable and less one dimensional.","user":"mark.waltz","rank":[5,6]}]