[{"title":"australian bicycle exploitation kid-flick that's wheelie good!","rating":10,"date":"13 January 1999","review":"I went to see BMX Bandits when it first came out with an eleventh birthday party gang of mates. We were mostly BMX fanatics and figured we'd be running out of the cinema pulling pretend stunts on our handy imaginary bikes but alas we'd kinda just wheeled out, a little let down. Cut to many years later and I catch it on saturday afternoon TV and that's when I flip. I was too harsh on the pic as a kid coz i thought it pandered to a younger audience but now looking back on my days as a kid it's got some innocent magic like those british children's film foundation pics. Nicole Kidman is a star and her fellow BMX bandits form a fun team but it's the pursuing criminals that steal the show with their manic and obviously improvised actions and dialogue. And hey, any movie that ends with a flour bomb fight on wheels and a huge explosion of foam [which always renders the baddies useless] it's just gotta be top!","user":"jaydeluxe","rank":[22,23]},{"title":"It's like The Goonies on wheels!","rating":28,"date":"28 May 2002","review":"Excellent movie.  Great stunts.  Horrible villains.  I'll never forget watching this with my friends.  It made us want to catch bad guys and then race bikes.  The music is just as much fun.  Everyone should see this at least once.","user":"rustinc","rank":[32,37]},{"title":"Cool movie!","rating":23,"date":"23 June 2004","review":"I have similar feelings about this movie as a lot of the other reviewers.<br><br>As kids, my friends and I used to rent it at all opportunities. I can still remember fighting in the car over who got to look at the cover!<br><br>\nI watched it again a few years back. The plot seemed silly. The acting was no longer brilliant. Overall it dropped about 2 stars!<br><br>But I still enjoyed seeing it again. It was good memories. Of course having Nicole Kidman in one of her first movies ever is also great fun to watch. Who'd have known she'd go on to become such hot property.<br><br>P.s. She must spend a fortune keeping her hair straight!","user":"tomfrh","rank":[16,18]}]