[{"title":"There's Nothing Like It","rating":8,"date":"23 January 2011","review":"I understand how some (perhaps most) viewers found The Visitor an incoherent mess, but it may be due to poor editing since its U.S. release in 1979 which, evidently, was also released theatrically to international audiences. However, I am only speculating, but I do know the original Italian version is longer. That version may help to fill in the gaps and possibly extends some of the more emotional scenes in the film which have been severely cut. As I was watching The Visitor, I was disappointed at how abruptly some of these scenes concluded. I wanted and expected a deeper connection to the material and the characters. Regardless of these setbacks, the movie is unquestionably unique on many levels, and I didn't find it difficult to follow. Perhaps because it IS so outlandish, I enjoyed fitting the pieces together. There was never a dull moment with so many things happening throughout the course of the story line. The atmosphere was classic 70s style, and the acting was not bad at all despite (again) the poor editing.<br><br>The Visitor is an Omen copy to a degree, but instead of demonic forces at work, the film centers on an evil alien force. This alien force is actually an escaped prisoner named Zatteen, who finds refuge on Earth many years in the past after fleeing from a deadly battle in space. Before his eventual death, he impregnates a number of women, passing along his mutated genes and allowing his future offspring to possess telekinetic powers. Since Zatteen had evil intentions and only wanted to kill and destroy others, his children are of the same breed. In order to carry out his catastrophic deeds, a cohort of wealthy men led by Dr. Walker (Mel Ferrer) is assembled to ensure his plan of world domination succeeds. This mission is challenged when only one woman on the planet in the present day bears the ability to fertilize Zatteen's seed, and her name is Barbara Collins (Joanne Nail). Barbara has already given birth to Katie (Paige Conner), a now eight year–old daughter who shows us she is no angel with some of the wicked things she says and does. The cohort wants Barbara to give birth to a son so he can become the new Zatteen of his generation. This task of impregnating Barbara is given to Raymond Armstead (Lance Henriksen), who must convince her to marry him despite the fact she is unwilling to commit to marriage. Barbara, of course, does not realize she has the special gift of carrying Zatteen's seed in her womb, but she knows intuitively that something is wrong with Katie. That sets up the premise of The Visitor. Of course, there are birds that attack on command, a watchful babysitter (Shelley Winters), a police detective on Katie's trail (Glenn Ford), a mysterious butler, a Jesus–like character who tells tales of the evil Zatteen to a group of young bald–headed children, and the good–guy visitor himself (John Huston), who congregates his disciples on the roof of a large skyscraper. The first fifteen minutes of the film unravels the basis of the plot, but as the viewer, it's important to listen to the dialogue. A lot happens quickly. <br><br>Whether you like the film or find it a mess, to say it's not an entertaining effort would seem unfair. The only thing that really was annoying to me was part of the soundtrack dealing with the discotheque music. It was way over the top and out of place for this type of picture. I'm sure it fit the times and some people enjoyed it, but if the movie is to be taken seriously on any level, then that music has to go. If the movie was intended as hype – which doesn't appear to be the case – then the histrionic melody is warranted. On the other hand, the moody, ambient music was excellent, and the ending was solid. Give this cult classic a shot and be prepared to go on a strange journey of plot twists and turns. Watch it on a rainy day when you have the time or are feeling ambiguous and/or disconnected from the world. We all have those days sometimes. That's when The Visitor will leave you a little numb, confused, and scratching your head... but in a good way.","user":"vorazqux","rank":[40,43]},{"title":"Utterly bizarre midnight movie with some charms","rating":10,"date":"10 November 2013","review":"This oddball midnight movie is getting a re-release and eventual DVD courtesy of the Alamo Drafthouse.<br><br>It's about an evil little girl, who is so evil that John Huston and his pacifist army of intergalactic bald yoga practitioners arrive from space to stop her. Meanwhile Lance Henriksen is the evil boyfriend of her clueless, innocent mother, who sold his soul to the satanic forces nurturing her in a Faustian bargain for...a basketball coach position.<br><br>Which leads to the early and highly memorable slo-mo basketball set-piece, easily one of the most unique choices of setting for a horror film sequence I've ever seen! <br><br>The atmosphere of this weird, weird film alternates between genuinely and oddly poetic (mostly thanks to the music), pure B-movie cheese, and unintentional hilarity. It's one of the strangest films I've ever seen, but that's not a bad thing in this case. If you give yourself over to its strange charms, this is some kind of consciousness-expanding experience.<br><br>Will you like it? There are folks who seek out these sorts of bizarre, unique B-movies. You know who you are. At the very least, you should this film an object of curiosity.<br><br>Somehow, and for some reason, John Huston, Glenn Ford, Franco Nero (as Jesus Christ), Shelley Winters, Lance Henriksen, Sam Peckinpah, Mel Ferrer and Kareem Abdul-Jabbar are all in this movie.","user":"outdoorcats","rank":[23,25]},{"title":"I LUV this film!","rating":8,"date":"28 January 2008","review":"I found this film in the bargain bin and sensed that it was a lost treasure and right i was! I understand why some people dislike it so, but I see it as a classic of its time. Its low-budget, gritty location-driven shooting is hardcore 70's style cinema, with a twist of manic Giallo style editing thrown in. It is the story of a visitor from a planet that was overtaken by storms so that their children had to become pure force, as shown in some fantastically composed sci-fi images of a lone planetscape and a chaotic sky that reminded me of \"The Man Who Fell to Earth\".<br><br>On earth a fiercely independent widowed mother does not want to marry the wealthy man who she's dating, which is a good thing because he's really working for a mysterious group of wealthy men who want her to have a son so that they may harness his powers for their own greed and corruption. Her pre-teen daughter Katie has these powers, is crazily talented at ice-skating and gymnastics, and also wants her mother to marry so she can have a brother. She cripples her mother during a bizarre birthday party scene so that her independence is at risk and she is forced to marry, but still the mother is determined to remain single. The Visitor (played by John Houston) intervenes in order to strip Katie of her evil urges and reclaim her as a force of good.<br><br>It does indeed sound confusing, but I had no problems in 2008 keeping up with its twisting plot, and appreciate the (by now) retro big screen TV and pong game that Katie's always playing, as well as the use of 1970's architecture, mod sci-fi imagery, and the use of birds as a recurring violent motif manifesting the alien powers. My only complaint is the music they chose... way too heavy.<br><br>Shelly Winters is awesome as the housekeeper keeping tabs on Katie and her emerging evil ways.","user":"franz66","rank":[23,27]}]