[{"title":"Nothing special this time","rating":5,"date":"3 June 2002","review":"Legacy of Rage is directed by Ronny Yu, the genius behind Bride With White Hair. Rage stars Brandon Lee is his only Hong Kong production and Michael Wong, the guy who played the sicko role in Fatal Love, starring beautiful Ellen Chan. Legacy of Rage is normal HK actioner and nothing special. The fight and action scenes are okay as always in these films(well, at least almost always), and at the end fight, they are occasionally brutal, too. But considered what kind of achievements we have seen coming out from Hong Kong, this is very mediocre but still watchable and recommended, of course, to the fans of Lee family. I don't think Michael Wong is so bad actor, as some have said. I think he's okay and has nice eyes. Lee junior is pretty normal here and is not as powerful as in his future roles, but we must remember that this is so early work for him, and he may have had some pressure thinking about his father and his reputation..<br><br>After all a decent Oriental actioner with nothing particularly exciting or worth mentioning. Still, a must see for Hong Kong fanatics. 5/10","user":"Bogey Man","rank":[8,8]},{"title":"Pretty Cool","rating":7,"date":"15 June 2009","review":"Before I saw this, I thought Rapid Fire was Brandon Lee's first movie, but I like him more in this one than Rapid Fire. This movie shows that he really had talent. Michael Wong looks so young in this movie, and he's one good looking son of a gun. Regina Kent plays her usual role of bossy brat. Her career ended short like Brandon's.<br><br>The movie is dubbed, and it's a so, so job. You can still tell that its a dub because the lip and the word doesn't match.<br><br>Simple story, but it works, and is pretty good entertainment even after quarter century. One thing that's original about this movie is that each scene happens in a little bit different settings than you usually see, and each scene is beautiful.<br><br>See it for the charisma of Brandon Lee, and unusual settings where thing happens.<br><br>7.5/10","user":"ebiros2","rank":[3,3]},{"title":"He had an important \"Legacy\" to live up to...","rating":6,"date":"1 January 2015","review":"The 1986 martial arts action flick \"Legacy of Rage\" has the benefit of being the first starring role of the late Brandon Lee (the ill-fated son of deceased martial arts legend Bruce Lee). It was also the only film that Brandon Lee made in Hong Kong, and likewise the film is spoken in Cantonese (though the voices are dubbed - as the practice at that time was to film movies without sound, and then dub in the actors' voices later).<br><br>Brandon Lee is in fine form here (despite never hearing his natural speaking voice), though the film itself - written and directed by Hong Kong action veteran Ronny Yu (who would later gain fame in the West with the American horror films \"Bride of Chucky\" and \"Freddy vs. Jason,\" and the martial arts epic \"Fearless\" with Jet Li) - is somewhat of a mixed bag; it's more or less a standard action film, with lots of stuff about gangsters, drugs, and John Woo-style gun-play. Also, disappointingly, there isn't much of Brandon Lee using his father's patented Jeet Kune Do skills against the bad guys being sent his way.<br><br>Lee plays Brandon Ma, a hard-working average Joe with a beautiful girlfriend named May (Regina King, in her film debut) and dreams of buying a motorcycle. Brandon's best friend is Michael (Michael Wong), who is also the son of a local Hong Kong gangster and is looking to take over his father's business and thus make a name for himself. He also has unrequited feelings for May, and he soon cooks up a scheme to get rid of Brandon so that he can have her for himself. This scheme would involve the murder of the undercover narcotics detective that has been hassling his father's organization, and then setting up Brandon as the scapegoat. The plan goes off without a hitch, and Brandon is sent to prison for eight years for the crime. But when he learns the truth about what's happened to him and why, that's when he sets out to get revenge and save May.<br><br>While we all know Brandon Lee's tragic story (he was killed while filming a scene of his last film, 1994's \"The Crow\"), \"Legacy of Rage\" definitely shows the talent the younger Lee inherited from his more-famous father. Brandon Lee may not have been as skilled a martial artist as his father (this is really debatable and a pointless argument, if you ask me), but he certainly may have been a stronger and more charismatic and charming actor. He certainly did not want to be remembered as a martial arts star like his father, but he did want to be remembered as an ACTOR. \"Legacy of Rage\" may not have much in the way of kung-fu action, but it does show that Lee was a strong and capable action hero, much like he would show in his later English-speaking features \"Showdown in Little Tokyo\" (1991), \"Rapid Fire\" (1992) and of course, \"The Crow\" - his last and most famous film.<br><br>So \"Legacy of Rage\" is worth viewing maybe once or twice, as a worthy introduction to the skills of the extraordinarily talented Brandon Lee.<br><br>6/10<br><br>P.S.: Bolo Yeung (who appeared as a villain in Bruce Lee's last completed film \"Enter the Dragon\") also has a brief appearance here, as well.","user":"dee.reid","rank":[2,2]}]