[{"title":"Take My Film... Please","rating":18,"date":"18 February 2002","review":"SPOILER: The last gore film of Herschell Gordon Lewis is perhaps one of his goriest and remarkably one of his funniest..intentional and unintentional.  Lewis has eyeballs squeezed, nipples cut off of breasts with scissors(one breast has white liquid flowing while another has chocolate), a woman's rump bludgeoned and then salted, a host of throats slit, a woman being run over by a truck, and a woman having her face shoved in a boiling bowl of french fries(you might have noticed in this scene that the pot was tall and not very wide in the first shot prior to the actress having her face embedded in the pot then in the close-up the pot is short and wide to accomodate her face).  No question about it, the film definitely has a misogynistic edge to it.  Women are beaten and killed senselessly(isn't that every Lewis film?). The story about an amateur detective being paid by a newspaper to solve the crime was not THAT bad...certainly better than most plot constructs used in other Lewis vehicles.  Frank Kress as Abraham Gentry certainly also is one of the best actors ever used in a lead in a Lewis film.  His acting style was fresh and he could convey irony and wit.  The rest of the cast was so-so, with lots of naked girls jiggling(none of them particularly attractive and looking in that sleazy, has-been 70's kind of fashion). Henny Youngman, the only big name to grace any of Lewis's horror films, stars as a night club owner and talks so fast you will have trouble hearing what he says!  Lewis wants to sicken you in this film, but he also goes for the laughs and some of them work.  The photographers in each murder scene are hilarious as is the general mood of the film when some poor girl isn't losing appendages, skin, or having her eyes gouged out.  The score is like some sleazy jazz theme and Lewis even has the temerity to use pieces of classical music and opera such as the Anvil Chorus.  Despite all the twisted killing, the film kind of grew on me.  Now, maybe I am the sick one.  Watch out for the ending...it is Lewis having some more fun...and the revelation of the killer is one of the most ludicrous explanations put on film.  Look fast too because the killer meets his/her end so fast you'll have to rewind it to see what happened.","user":"BaronBl00d","rank":[26,34]},{"title":"Cheap effects increase the disturbing factor.","rating":26,"date":"26 September 2004","review":"Popular Video Nasty that features some explicit and brutal death scenes. The plot is easy to follow and also easy to get hooked by it. A private detective is after a killer on the loose whose victims are strippers from different clubs. So we have a serial killer and strippers. That's all I need to know to like it.<br><br>An ex marine is the principal suspect because most of the strippers' murders are similar to his combat techniques when he killed soldiers. There's a feminist group that is against a specific club, and whose leader is another suspect.<br><br>Who is behind the murders and why?<br><br>There's plenty of nasty gore and some violent scenes that are better remembered for it's cheese factor. Still the effects look cheap but nasty which adds more to the disgusting factor against the movie. The porno movie look and feel that this movie has it's great and gives it a tone of sleaze.<br><br>Watch it at your own risk. It's not a movie for everyone.<br><br>6/10.","user":"insomniac_rod","rank":[17,24]},{"title":"Some people's favourite Herschell Gordon Lewis movie, but not mine.","rating":3,"date":"3 October 2002","review":"Herschell Gordon Lewis' movies are an acquired taste, and 'The Gore Gore Girls' is a perfect example of this. Many people find the combination of silly humour with extreme gore shots involving the torture and murder of women difficult to get a grip on. I don't have a problem with that so much. HGL doesn't take the material seriously as a film maker, and doesn't expect the viewer to either. Many regard this as his best movie. It certainly gorier than 'Blood Feast' or '2000 Maniacs', and has slightly more sophisticated production values, but overall I found it a little repetitive and dull, and nowhere near as entertaining as those two or 'Color Me Blood Red'. The plot involves a \"gentleman detective\" investigating the bloody murders of go-go dancers. The detective is played by the unknown Frank Kress who is fairly amusing. Veteran Henny Youngman appears briefly as a club owner and is not amusing at all. I suggest you only watch this if you have seen and enjoyed earlier Lewis efforts, otherwise give it a miss. Apart from the infamous meat tenderizer, face-frying, and nipple scenes there's not all that much to recommend this one. Plus the DVD commentary is one of the most tedious and uninteresting I've ever heard.","user":"Infofreak","rank":[14,20]}]