[{"title":"Actually, the film was shot in multiple languages","rating":3,"date":"3 May 2007","review":"The post above that states that this film was shot in English is only partially correct. Each of the characters spoke their own language, and the script was available in quite a few. How do I know -- I am the deputy who goes up to the stagecoach and gets used as Lee van Cleef's coat rack. Lee and Jess did speak English, but the people in the stagecoach spoke mostly Italian. The bounty hunters spoke a multitude of languages, one even spoke Serbo Croatian. Do not know about the speaking any of the cast after the stage left Gila Bend, that was the only part I saw. I was a young Army Officer in Italy and had the opportunity (along with one of my NCOs -- Bill on the rack with the Gila Bend sign) to play the role of the deputies in the beginning of the film. It was an opportunity I will always remember. Lee was a true gentleman, Jess was a hoot, and Lee's stuntman/double, X Brand (Pahoo in the Series Yancy Derringer) was an extremely nice person. I will always remember being in this great film","user":"clarkb-2","rank":[59,66]},{"title":"Van Cleef is the standout in a good example of the genre","rating":7,"date":"12 September 2006","review":"It could be said that The Grand Dual is merely a vehicle for its lead star, and whoever said it wouldn't necessarily be wrong; but while this film doesn't feature a lot of originality, it's also true that Italian cinema was based on repeating itself, and the film definitely succeeds in providing an enjoyable slice of western action. The script was penned by Giallo supremo Ernesto Gastaldi (The Strange Vice of Mrs Wardh, The Case of the Bloody Iris), and that's not surprising as there are shades of Giallo throughout, and the film works both as both as a violent action flick and an intriguing mystery film. The plot focuses on Sheriff Clayton as he becomes involved in the murder of a man so-called 'The Patriarch' through his association with the sly Philipp Wermeer. The film follows the pair as they make their way through bandits and bounty hunters and eventually end up in Saxon town, where the sons of the Patriarch live. They've fingered Wermeer as the murderer of their father, and naturally want him hanged; but there's a twist to the identity of the murderer.<br><br>Lee Van Cleef made his name with Sergio Leone and the masterpiece westerns 'For a Few Dollars More' and, of course, 'The Good, The Bad and The Ugly'. This film is nowhere near the quality of those two, but Van Cleef does well in his 'man in black role', which is a variation on the common western 'loner' theme, which was made famous by the likes of Clint Eastwood and Django. Van Cleef's presence is felt throughout, and he continually makes every scene his own. As you might expect, the rest of the cast don't live up to the central star; but even so, The Grand Dual features a good ensemble cast, and Peter O'Brien does especially well in his central role. The film features a lot of shootouts and chases on horseback, which are always good to see; but at times, The Grand Dual puts too much focus on entertainment value and this can mean that the plot suffers. Even so, the story plays out well; and the final twist is a real standout, as even though it's pretty obvious throughout - Gastaldi manages to throw in a twist just before it, which makes the final twist come as a surprise. Overall, this film isn't one of the great Spaghetti westerns - but it's a good one and comes recommended.","user":"The_Void","rank":[23,26]},{"title":"Lee Van Cleef, Man In Black","rating":6,"date":"27 June 2007","review":"I read the other comments previous to mine, and won't add to what's already been said, except to say that I really thought there were some remarkable features here.<br><br>For example, there's the device of panning a shot from point A to point B. I'm sure there's a technical term for this kind of shot, but I'm no professional, and don't know what it is. But what seemed to me unusual was the very smooth, automatic auto-timing of the transition. Say looking at Clayton for a few long seconds; then as if someone flips a switch, the camera looks from Clayton to Wermeer, traveling at a fixed rate of speed; and upon arriving at Wermeer, the camera proceeds to look at Wermeer for several long seconds.<br><br>There were some strange anachronisms. The hair styles seemed very much out of 1970s era. Some of the strangest \"western\" headgear I've ever seen were in evidence. These chapeaux looked more like something from the Mardi Gras of New Orleans or the Carnivale of Milano than any Western story. Likewise, the almost Gucci-esquire look of the attire of Adam Saxon.<br><br>Some very \"spaghetti western\" style over-the-top grittiness. So in the opening scene, the tall, tall, tall rock. Then we have Lee Van Cleef playing Clayton in a black, black Western outfit in stark contrast to the white outfits of the Saxons. Then we have this strange contraption involving a gun booby-trap set up to blow up their carriage on opening the door near Silver Bell. I loved the game of checkers played with full shot glasses that the players drank whenever they \"jumped\" someone. Then the room Clayton stays in, full of bullet holes in the walls. When he asks the proprietress if he could have another room, she says there are three kinds of rooms there: \"rooms with women in them; rooms for card-games; and this one is for shooting bullets in.\" Nuff said, right? I loved the final scene ... sort of a Spaghetti Western version of the Shootout at the OK Corral. The love of the grotesque - such as Adam Saxon's pock-marked face - he is sardonically called \"Pocksy\" at one point. The typical spaghetti western tongue-in-cheek humor is present in such bits, and throughout the movie.<br><br>All in all, if you like spaghetti westerns, please do yourself a favor, get this one on DVD, and enjoy! Charles Delacroix","user":"cdelacroix1","rank":[22,28]}]