[{"title":"A Disney classic","rating":10,"date":"18 January 2004","review":"When I was a little girl, Sleeping Beauty was my all time favorite Disney film. I was so in love with this story, it's crazy how many times I wore out the VHS. But growing up, I lost touch with the story, but I recently bought the DVD and re-watched the film and you know what? I'm still in love with this movie. I really miss these old Disney movies where the animation was so bright and beautiful, the characters were so lovable, and the story was so magical. I'm not bashing Disney films from today, just I'm sure we could all relate on this subject where the older Disney films just had a certain charm about it. Sleeping Beauty is just a timeless story and has so much wonderful romance, I guess since I'm a girl, I just couldn't help but still be in love with this beautiful story.<br><br>Princess Aurora is born and is the future queen of her land, three fairy's, Flora, Merryweather, and Fauna bless her with three gifts: beauty and song, right as Merryweather is about to bless Aurora, the evil witch, Maleficent, comes in and curses Aurora that she shall touch a spinning wheel by her 16th birthday and die! Merryweather changes it to where she won't die, but sleep and could only be woke up by the kiss of true love. The fairy's wish to keep this from happening still, so they take Aurora and raise her as their own. One day Aurora on her 16th birthday goes out in the forest and meets the charming and handsome Prince Phillipe, but she doesn't know he's a prince and she doesn't know he's fhe man she's actually betrothed too. She is told by the fairy's that she can never see him again and that she's a princess; later that night the curse happens! Now the fairy's need Phillipe to save Aurora before it's too late.<br><br>Everything about Sleeping Beauty is just a perfect Disney film and I can't wait until to show this to my future kids one day. I know that their generation is going to have just the CGI animation, so it's good that at least we still have these films, they're treasures. The voices, the animation, the story, Sleeping Beauty is the most romantic fairy tale that anyone could easily fall in love with. If you are a Disney fan, this is a must see, it's a great family film or if you're just a film buff in general, I'm a grown up and I still tear up when I watch Sleeping Beauty.<br><br>10/10","user":"Smells_Like_Cheese","rank":[94,101]},{"title":"Hail to the Princess Aurora!","rating":9,"date":"9 July 2006","review":"\"Sleeping Beauty\" was envisioned by the great Walt Disney as his masterpiece--the feature-length cartoon par excellence. And, in many ways, it is. The then-record budget (six million dollars) was the largest ever for an animated motion picture. The widescreen Technirama 70 process had never been used for an animated feature. The six-track magnetic stereo sound was a step upward from the \"Fantasound\" system employed in \"Fantasia\" (1940). Also new and trend-setting was the style of the animation--a more realistic, geometric design which, surprisingly left many critics and audiences cold. The extra expense needed to showcase the widescreen film properly, together with the lukewarm reviews, prevented \"Sleeping Beauty\" from turning a profit at the box office when it was released (with much fanfare) in 1959. But time has been kind to the film, subsequent reissues have finally put it in the profit margin, and both viewers and critics are appreciating it for the beautiful fantasy it has always been. However, like it's predecessor \"Snow White and the Seven Dwarfs\" (1937) which was Disney's first fairy tale, as well as his first full-length film, this screen adaptation of \"Sleeping Beauty\" strays from it's origins. While the Charles Perrault version of the tale is given as the source, there are new variations. <br><br>The original story is as follows: When a baby girl is born to a King and Queen, they invite seven (or, in the Grimm version, twelve) Fairies to the christening. Uninvited is an evil fairy, who shows up anyway, and curses the child with death on her 16th birthday. Although a good fairy is able to alter the spell, the princess is doomed to sleep (along with the court) for 100 years. Despite the precautions taken, the curse is fulfilled (accidentally, in most versions of the story) and the princess does indeed sleep for a century, after which a prince awakens her. Understandably, Disney's telling departs from Perrault here as well, because in Perrault's version, the King and Queen are the sole members of the court who do not succumb to the sleeping spell, and, eventually die of old age. The Disney version of the tale whittles the number of good fairies down to three, giving them the appearance and personalities of elderly women. Meanwhile, the evil fairy, dubbed Maleficent, is a cold, flamboyant villainess who, for better or worse, overshadows everyone else in the film (but then, the villain always does). Disney's retelling also dispenses with the Heroine's 100 year sleep which lasts merely one night. There is much emphasis put on the three fairies who secretly, in the guise of peasants, raise the baby princess Aurora, (whom they dub \"Briar Rose\" interestingly, the name given the Princess in the Grimm retelling) and, unwittingly make it possible for Maleficent to execute her curse. Also new, is the introduction at the beginning of the film of Prince Phillip, who is immediately betrothed to Aurora. The climatic battle he has with the evil fairy, here transformed into a dragon, has become one of the most memorable parts of the film, though it was purely the scriptwriter's invention. In the end, however, it is best to appreciate the film as a stand-alone creation, rather than a faithful adaptation of a classic story. <br><br>Indeed, as some latter-day critics have pointed out, \"Sleeping Beauty\" has been embraced by the young and old audiences who find in it many of the same sword and sorcery elements in films like \"Legend\" and \"Excalibur\". And every penny of it's then-unprecedented budget is on the screen. One marvels at the intricate design of the animation, all accomplished well before the advent of computers, which the Technirama screen showcases to full effect. The voice talent is perfect. Mary Costa, who went on to an estimable opera career, is a lovely and expressive Aurora, while Bill Shirley is an ingratiating Prince Phillip. Eleanor Audley (so deliciously cold as the stepmother in Disney's \"Cinderella\") is the embodiment of majestic evil as Maleficent. Verna Felton (the Fairy Godmother in Disney's \"Cinderella\"), Barbara Jo Allen and Barbara Luddy are the delightful (and all too human) fairies, Flora, Fauna and Merryweather. Aurora's father, King Stefan, is voiced by Taylor Holmes, with Bill Thompson as Phillip's father King Hubert. A word should also be said for Candy Candido, who provided the sounds made by Maleficent's goons. The Tchaykovsky ballet score provides both the background music and melodies used for the new songs. All this blends perfectly in an epic adventure/fantasy seldom experienced on screen, and one with enough heart to capture the most cynical viewer. <br><br>The Special Edition DVD, released in 2003, and currently out of print, is another example of what a \"Special Edition\" truly encompasses, including a fully restored widescreen print of the film, a new 5.1 stereo mix which fully showcases the Academy Award nominated score, as well as many bonus features with appeal to all ages (including a widescreen/fullscreen comparison which should be the last word on that subject). Also included are several complimentary historical shorts like the Academy Award winning \"Grand Canyon\" which accompanied \"Sleeping Beauty\" on it's initial release. Trailers, games, interviews with Mary Costa and surviving animators, vintage featurettes which delve into the making of the film, and last, but not least, footage of Disney himself, complete the dazzling package. Finally awakened from her long slumber, and more refreshingly lovely than ever, \"Sleeping Beauty\" is a film (and DVD) for the ages.","user":"phillindholm","rank":[59,65]},{"title":"I have a theory about this movie...","rating":8,"date":"5 September 2003","review":"...which is that it may have been designed more for an adult audience than a children's. At any rate it was way ahead of its time in 1959. \"Sleeping Beauty\" was one of the movies I watched as a child, and its grandness overwhelmed me even at the age of ten. I couldn't be happier to see it finally in the DVD format. But watch closely; you'll notice many subtle, sophisticated things which other viewers have touched on in earlier reviews. The animation is almost surreal-- so incredibly lifelike that it abandons its cute, 'Disneyesque' pretensions from previous fairy tales. There are no talking mice, dogs or cats anywhere to be seen. Here the animals are silent, as animals are supposed to be. (I love the sequence with the forest animals as they are awakened by the singing of the barefoot princess and join up with her, like multiple chaperons, in harmonious whistles.) Even the fairy godmothers- who may initially appear as sugary stereotypes- spend so much time bickering (well, two of them do anyway) that you get to identify them as thoroughly fleshed out personalities. The adaptation of the original Perrault fairy tale is also impressive. An ingenious move was to have the prince and princess meet in the forest *first* and fall in love- unaware that they are already engaged to be married. Someone mentioned the chilling sequence which shows the princess, cloaked in an eerie green pallor, actually being lured to the fateful spinning wheel. So dark, so frightening- when was the last time you saw something like this in a Disney fairy tale? And then immediately afterwords is a cleansing sequence of unmatched beauty showing the fairies sailing through the sky like fireflies, magically dusting the rest of the castle to sleep. It is, of course, only matched by the film's finale which shows storm clouds, lightning, a forest of thorns, and a flame-spewing dragon-- all seamlessly bringing the story to a 75-minute conclusion. It stands, in my opinion, as Disney's masterpiece.","user":"movibuf1962","rank":[93,106]}]