[{"title":"Two Thumbs UP; Where IS it?","rating":6,"date":"6 December 2004","review":"I saw this black &amp; white film back in the early 70's on television, when they used to show movies in the afternoon, and not hours of info-mercials...!<br><br>It's stuck with me all of these years; I'd like to see it again. Where IS it? Carol Lynley is a be-a-u-tiful little thing, and Brandon De Wilde was good also (it was good to see him in something besides SHANE).<br><br>I was a young teenager when I viewed the film; it did play like a \"Father Knows Best\" episode, but I didn't expect it to go so far, even to include an unexpected teenage pregnancy...! We barely understood the consequences of that issue in the public school at the time, quite a surprise to see it on television (then).<br><br>It made an impression on me as a youth; I'd like to see it again, but don't know why it's not available... if the movie studios can put \"Killer Klowns from Outer Space\" on DVD (or even VHS), why can't they put this nice little play on plastic? What's the hold-up?","user":"icu2rjb","rank":[38,43]},{"title":"A welcome surprise","rating":8,"date":"3 November 2014","review":"I watched this by chance yesterday. And was quit pleasantly surprised, it's a terrific little film. Far more sophisticated than I would have expected for a film made in 1959 dealing with teenage pregnancy. The two leads, were only about the same age as their characters at the time and looked it, it was quite surprising. Of course nowadays the early consummation of their relationship would have been shown in far more graphic detail, and this film made me realize that those kind of scenes aren't really needed to get the message across. I am not a prude, but I find sometimes the full revelation of a young performer's(normally female)unnecessary and exploitative. This mall film , makes it's point and is quite sensitive in doing so. Contrary to some of the other critics , I did not find myself tempted to laugh at all.","user":"aceellaway2010","rank":[19,21]},{"title":"See Dick. See Jane. See Dick and Jane...","rating":20,"date":"20 July 2004","review":"Based upon a stage play, this drama about teen angst regarding sex and it's consequences comes close at times to resembling a situation comedy, but fortunately the performances of the cast bring out its feeling and drama as well.  De Wilde is a tender teen who's just had his lifelong pal, his dog, put to sleep while he was at school.  He seems adrift as his parents fuss over his older sister's pending nuptials.  He tries to act tough around best friend Berlinger and soon finds himself captivated by lovely neighbor girl Lynley.  Lynley has a meek, overly refined father who can't seem to get in touch with his young child.  Eventually, De Wilde and Lynley take their relationship to the next level and a mystifying and unwanted pregnancy is the result.  They agonize over what to do while the parents seem to exist on another plane, entirely.  De Wilde was already a showbiz veteran at 17, having played hundreds of Broadway performances and starring in \"Shane\".  He brings a lot of depth and feeling to his role.  Lynley is also fine as the sensitive good girl who bites off more than she can chew.  The best performance is that of Berlinger as both friend and conscience of De Wilde. He gives his role a jolt of energy and sincerity that really helps sell the film.  As De Wilde's parents, Carey and Hunt give very good performances, balancing humor and concern.  Unfortunately, due to the sometimes jokey nature of the script and the film's setting, this occasionally threatens to become \"Dennis the Menace Knocks Up Margaret!\"  Some of the dialogue and situations are corny and cartoonish, robbing the film of a chance to be as realistic as it might have been.  However, by the time the kids have learned their lesson, some authentic and touching emotions have come through.  It must be noted that Lynley has perhaps the flattest, most oily-looking ponytail of the '50's.  It's also hard to picture what De Wilde and Lynley's awkward first encounter must have been like as they both exude such charming innocence in the film.  Bernard Herrmann's \"Vertigo-on-the-Playground\" score is pretty, but also a bit overwhelming for a story with this subject matter and these small town characters.  It can be a little preachy and more than a little pat, but it's definitely worth watching and at 89 minutes, doesn't overstay its welcome.","user":"Poseidon-3","rank":[31,37]}]