[{"title":"When Life Imitates Cartoon Art","rating":8,"date":"17 May 2005","review":"This was the last of the three comedies that Jack Lemmon made in the middle 1960s that he hated. Like GOOD NEIGHBOR SAM (and not like the abysmal UNDER THE YUM YUM TREE) HOW TO MURDER YOUR WIFE had a clever script and good production. Lemmon played a successful cartoonist who carefully scripts and photos the scenes he will use in his detective adventure strip. He lives in a townhouse, complete with top rate valet (Terry-Thomas) and has a wonderful life as a bachelor. But while attending a stag party, he meets Virna Lisi, and takes her home. Apparently he has married her (the groom at the stag party had broken up with his fiancé before the party, and throws the wedding ring out - and Lemmon uses it). As a result Lisi starts domesticating him, and Terry Thomas walks out. Lemmon uses the changes in his lifestyle in the comic strip, but finally he revolts and kills off the comic strip version of Lisi. When Lisi sees this she walks out, but everyone thinks that Lemmon killed her. So the scene is set for a murder trial.<br><br>This is not a film for feminists. It takes a dim view at the effect of domestication on Lemmon (and his lawyer, a hysterically funny Eddie Mayehoff). But I point out that before the end Lemmon does admit he misses the domestication. Even Terry-Thomas gives into it at the conclusion. It still a good comedy, a worthy minor work if not one of the high points in Lemmon's acting career.","user":"theowinthrop","rank":[22,26]},{"title":"Cartoonish, and I Mean that in a Good Sense","rating":10,"date":"10 July 2005","review":"I really want to recommend this movie to you.<br><br>Sure, it has a weak third act which pounds a particularly misogynistic message. And the end is so formulaic it hurts. But up until then, it classifies as among the best of comedies.<br><br>I have a particular admiration for it as what I think is the first example of a cartoonist whose drawings interweave with his life. Its a clever idea at root but handled with extra sophistication here.<br><br>The setup is that our hero (Jack Lemmon) is a cartoonist who draws himself in his strip as a sort of James Bond character. But before he draws each strip, he actually acts it out as movies that we see in the movie within the movie. (How he hires the actors and arranges the locations is a detail left unexplained.)<br><br>Thus, strip and life have a relationship within the story proper. Much is made of conflating the movie, the life depicted in the movie, the strip, and the movies within.<br><br>He ends up with an unwanted (well, sort of) wife and acts out her murder. Since she left in a huff, he has no defense when his readership (the whole country it seems) accuses him of real murder.<br><br>The pinnacle of this confabulation comes when his butler comes to the realization that the murder has actually been real with the enactment an alibi. Things go downhill from there. But until that point, this is sublime, a comic \"Draughtsman's Contract.\"<br><br>See it.<br><br>Ted's Evaluation -- 3 of 3: Worth watching.","user":"tedg","rank":[41,52]},{"title":"Great fun.","rating":10,"date":"6 November 2005","review":"Neil Hefti's music is wonderful. He parodies spy thrillers and sex comedies in one clever score. He uses horns for the sex farce and echoes of the same horns for the spy parody. Simply brilliant.<br><br>I saw this movie when it came out and I remember more details than any movie I've seen. It made an amazing impression on me - at age 14. I was fascinated by the NY townhouse with that tiny front door right next to the single car garage with the electronic opener. Then there's the glopita glopita machine and the world's most powerful remote control.<br><br>And, today, it is still as funny as ever. Terry Thomas as the butler and on screen narrator is bragging away about his all-male world, when... Virna Lisi arrives as Mrs. Ford.<br><br>I know that many think it is an unadulterated attack on women, wives, and marriages. But, in an odd sort of way it lays bare the reality of human relationships. Everyone in every relationship that has lasted over the years has fantasized about killing the other person. It isn't a fantasy we want to come true. We've all thought at one time or another, \"I'll kill myself and that will show'em!\" Remember, that, at every step of the way it is clear that Mr. Ford loves Mrs. Ford - Bash lays Mrs. Brannigan on the bed, covers her with a blanket, and kisses her just as he's off on his caper to murder her.<br><br>It is certainly one true that the movie is dated as are 50's and 60's sex farces. But, the thing about this one is that it is so clever and it goes to such extremes even with the title. \"How to Murder Your Wife.\" Indeed! But part of the fun of this movie is that it is so unpredictably predictable. We want to suspend disbelief for this movie. We want to laugh along.<br><br>It is said that this is one of Jack Lemmon's favorite movies - except for the murder trial. Funny thing is I thought the trial set the perfect notes for this farcical send-up of male fantasies.","user":"geoff-161","rank":[38,48]}]