[{"title":"If you're going to critique the history, then know the history.","rating":31,"date":"31 January 2003","review":"I find it difficult to believe that some reviewers' negative reactions to this film are based on their (misguided) beliefs that none of this could possibly have happened. Comments like these make it crystal clear that what some people don't know about history is appalling. If you are going to judge a film based on historical fact, it helps if you know what it is.<br><br>\nIt is well-documented what amazing technical feats the POW's were able to accomplish in the stalags. There was even an entire section of the British Secret Service dedicated to coming up with all sorts of clever ways to send these captured men the tools they needed to facilitate their escape attempts, i.e., sandwiching maps between the split sides of a record album (yes, the Germans allowed the prisoners to have records in the camps) or compasses in pens. At Colditz Castle, one of the more forbidding stalags, (actually an offlag since is was for officers only), many, many tunnels were dug and disguises created. One man actually created a German sergeant's uniform totally from scratch, donned a moustache and created an overall impersonation so realistic, it fooled two out of three sets of sentries. Some of the POW's built and concealed an entire glider that would have carried two men off the roof and over the wall! The only reason it didn't fly was because the prison was liberated before they got the chance! The Colditz experience is well documented. There are many books written about that particular prison complete with photographs, including one by a German officer confirming these amazing escapes and attempts. The reviewers who doubt what can be done when necessity is truly the mother of invention should look for them and learn something. <br><br>As for the prisoners not being in jumpsuits, as suggested by one reviewer as one reason to question the authenticity of the film? Ludicrous, POW's wore what they were captured in. The German military (different from the Gestapo and the SS) considered them soldiers and allowed them to keep their badges of rank.<br><br>As for the film itself, it is long, but absorbing. There are historical flaws (as there are in all movies), but several of the former POW's participated in the filming process, keeping it, for the most part,  very authentic. As for the emphasis on Americans, it's true they were not among the escapees per se, but several did assist in the effort before they were transferred out, as mentioned by a previous reviewer. However, you must remember that the movie was made for an American audience in 1963, long before international distribution revenue became so important to a studio's bottom line. They needed American stars who would appeal to an American audience. Who knows, perhaps if they were to remake it today, the cast would be all British and German, but I doubt it (see \"Hart's War\" where not only the plot, but all the British and Canadian characters that were in the book, disappeared).<br><br>All in all, \"The Great Escape\" is an entertaining movie telling a fascinating story of what ordinary men can achieve in adverse circumstances. It's well worth the time.","user":"FABabe","rank":[165,178]},{"title":"GREAT MOVIE: MORE HISTORICALLY ACCURATE THAN SOME REALIZE...","rating":11,"date":"11 January 2004","review":"This is a great movie which much more historically accurate than it is often given credit for. So many who say otherwise are ill-informed and obviously don't know much about the actual history of that actual escape. The depiction of what happened to the recaptured prisoners in the movie of THE GREAT ESCAPE is reasonably accurate as detailed on the historyinfilm site...specifically on the \"Reprisal\" page; along with being detailed in the various published accounts.<br><br>Hitler ultimately calmed down after being reasoned with by Goering, Feldmarschall Keitel, Maj-Gen Graevenitz and Maj-Gen Westhoff, and dictated that more than half the prisoners be shot and cremated. So, as depicted in the film, several of those recaptured were not executed and were indeed returned to confinement. In fact, even those executed were not \"shot on the spot\" for the most part, but were actually executed later after being turned over to the Gestapo; most being shot while being allowed to relieve themselves, under the guise of \"trying to escape\".<br><br>Furthermore, there are many accounts as to how much more humane the environment was within the camp (which even had a popular and very successful theatre, featuring prisoners who would later be name performers) than many other POW camps...and certainly nothing like the harsh conditions associated with the Concentration or Extermination camps.<br><br>To quote one source:<br><br>\"It must be made clear that the German Luftwaffe [the German Air Force], who were responsible for Air Force prisoners of war, maintained a degree of professional respect for fellow flyers, and the general attitude of the camp security officers and guards should not be confused with the SS or Gestapo. The Luftwaffe treated the POWs well, despite an erratic and inconsistent supply of food.<br><br>Prisoners were handled quite fairly within the Geneva Convention, and the Kommandant, Oberst (Colonel) Friedrich-Wilhelm von Lindeiner-Wildau, was a professional and honourable soldier who won the respect of the senior prisoners.\"<br><br>Finally, virtually all the major engineering aspects in regards to the tunnels and the initial escape in the film are as they were actually acheived in the real escape.<br><br>It would behoove some to learn a little more actual history or do a little simple research before shooting from the hip with supposed \"knowledge\" of reality. THE GREAT ESCAPE certainly takes liberties in tone and character portrayal, but not in the key elements that are disparaged out of sneering ignorance.<br><br>BRIDGE ON THE RIVER KWAI is also a great film, but took even greater liberties with the technical details of the events described than THE GREAT ESCAPE did....and offering up VON RYAN'S EXPRESS as a more realistic alternative is simply delusional and ridiculous.","user":"warrior_sarah","rank":[192,240]},{"title":"Great Escape,Great movie","rating":10,"date":"25 December 2005","review":"This must be my favorite movie of all times. Having seen it for the first time,in I guess 1987,a BBC Christmas broadcast,I was captivated by this brilliant piece of work. In the years after,I probably have seen it a \"million\" times,owning it on VHS and DVD,and still watching,whenever it is broadcast,in the original language. Why is it so great? This is a movie that keeps you locked to the screen,because it has everything a great movie should have. A great story,a good length,tension,it is a WW2 movie and the actors give top performances.Not just Steve McQueen,although his performance is brilliant,but also James Garner,James Coburn,Richard Attenborough,Charles Bronson and in this film,one of the greatest roles Donald Pleasance,playing the forger. It isn't historically accurate,please read the book by Paul Brickhill,but that doesn't matter a bit. This film gives you an image of POW camp,the prisoners and their guards,the Germans are also played brilliantly by German actors. I will not repeat the story here,but I can tell you,this film will capture you,all the characters are portrayed brilliantly by the actors. There is excitement,humor,tension,drama and emotion. See it,you will not regret it.","user":"bas-21","rank":[128,161]}]