[{"title":"Excellent But Frustrating Story","rating":8,"date":"20 January 2007","review":"Boy, what a frustrating film to watch....even though it is very good and has been a part of my collection for a number of years now. Still, it's hard to see the good guy, the little guy, beaten up by the big guys. Here's one story where Goliath beats David. <br><br>Anyway, this was an interesting supposedly- true-life story of how Preston Tucker got a raw deal form the Big Three car-makers of the day, and by the government after he built a much better automobile in 1948. The film details how the big boys made sure Tucker's company never sold any of those cars.<br><br>As mentioned, it's maddening to watch at times, to hear lies and false charges brought against a man who had the right ideas about car safety and engineering and was way ahead of his time.<br><br>The 1940s atmosphere in this film is very good and the old music is fun to hear, too. The cinematography is great, too, with some tinted vintage-type color at times. It looks wonderful on DVD.<br><br>The car is super to look at and admire. Jeff Bridges does a solid job of portraying Tucker, an upbeat, positive-thinking inventor. It also was refreshing to see a nice, supportive family, too. I enjoyed all the main actors in this film: Bridges, Joan Alen, Martin Landau, Frederic Forest, Elias Koteas and Christian Slater","user":"ccthemovieman-1","rank":[53,56]},{"title":"Gutsy, smart, way ahead of the curve","rating":25,"date":"25 September 2004","review":"It's been a while since I saw this movie, and I was already acquainted with they story when I realized they'd made a movie about it. The movie lives up to the reality.<br><br>No question, Preston Tucker was brilliant. When Uncle Sam requested designs for combat vehicles, he submitted, and demonstrated, a design which significantly blew away all competitors. He was turned down because his design significantly outperformed what Uncle Sam asked for. Small-minded individuals, mired in the relatively wimpy requirements, wouldn't take the more advanced design. It boggled his mind that they would turn down \"steak with all the trimmings\" in exchange for a \"plain hamburger.\" I've been in the Military, so it doesn't surprise me.<br><br>When he wanted to make a point about safety, emphasizing the need for safety glass and seatbelts (which were NOT standard equipment at the time), he invited the appropriate people to lunch, served medium-rare roast beef, then showed pictures of people who'd died in car accidents. Lots of blood, lots of \"raw meat.\" My driver's education teacher, trying to convince us to be safer drivers, did the same (minus the fancy lunch). Anyway, the similarities between what they saw on the screen, and what they'd just eaten, caused many of them to be \"re-acquainted\" with their lunch. I sincerely doubt they ever forgot the presentation, and his point was very well made.<br><br>I like this guy. He's whip-smart, practical, maybe a little too optimistic.<br><br>I identify with him.<br><br>And they broke him.<br><br>Welcome to reality. Bites, doesn't it?<br><br>In the end, he knows he's beaten, but he still gets the last word in. I hope I manage to do so well.","user":"tmchesser","rank":[41,44]},{"title":"This is one not to be missed.","rating":9,"date":"21 May 2001","review":"Thus is a superb movie. Firstly, the story line is just great. The true story of a man who fights against all the odds to realize his dream. Secondly, it's hard to imagine a better cast. They do an extraordinary job in bringing to life all the wonderful characters involved. Jeff Bridges is perfect as Tucker, and Landau is brilliant as the money man. But what really makes this work, is the way Tucker's undying spirit is brought out. He seems to lose the battle of making cars, but wins the ultimate battle of fulfilling himself and keeping his integrity. {\"They're only machines, the idea's the important thing.\"] Over the years, I have collected many hundreds of movies, but this one has to be in the top ten. By the way, I just loved the music sound track. Very 40's.","user":"rhoughton","rank":[26,30]}]