[{"title":"A Pretty Good Action Sleeper","rating":6,"date":"15 November 2002","review":"I caught this one on cable recently, seeing it for the first time as an adult. I must admit to a slight bias toward this film: when I was growing up in the dreaded BC (before cable) days, it was standard Saturday afternoon TV fare on our local indie channels. I was surprised at how well it's held up after all this time.<br><br>Master of the World is actually based on two little-remembered Jules Verne novels. Price is his usual hammy self as the standard Verne not-quite-villain, Robur (read: Nemo in the air) who, like Nemo, seeks to end war through technology. The young Bronson, as a sympathizer who then rebels against Robur's violent methods, is far less wooden than in his later years. But the real star of this movie is its production design. The rendering of what an aircraft might have looked like in Victorian days (had such a thing been possible) is dead-on, and the special effects are pretty impressive for 1961. The script, by Richard Matheson, is a little overwrought, but true to Verne's spirit while eliminating the blatant racism of the original stories. This time around though, I found the sweeping, melodramatic score to be a bit overpowering.<br><br>In short, not a perfect film or even a great film, but Master of the World remains a well made, entertaining action fantasy. I'm surprised it isn't better remembered by fans of the genre.","user":"failedscreenwriter","rank":[42,45]},{"title":"20,000 Leagues Above The Sea","rating":9,"date":"30 January 2005","review":"Set in the Victorian era, a mad genius named Robur (Vincent Price) has devised a futuristic flying ship for a devious, slightly contradictory, though possibly admirable purpose. He travels halfway around the world with an imprisoned quartet and a crew of \"air sailors\".<br><br>Although there are some problems with this film primarily due to its budget, and some viewers might be put off by the obvious similarities to Disney's version of 20,000 Leagues Under The Sea (1954), I enjoyed this somewhat wacky sci-fi/fantasy/adventure film quite a bit, and gave it a 9 out of 10.<br><br>The film actually opens with a brief but clever, tongue-in-cheek black &amp; white documentary about the history of flying machines. Abruptly, at the narrative line \"Master of the World\", the documentary ends. Then we change to color as we're taken to a sumptuously fantastic Pennsylvania town, complete with towering mountains and a seeming volcano.<br><br>I have to admit that director William Whitney already had me in the palm of his hand at that moment. I'm all for weird transitions, surrealism and beautifully saturated color cinematography. To make things even better, just as a character tells us how boring the town is, a booming voice (obviously Price's), quoting a doom-laden passage from scripture, emanates from the vicinity of the mountain.<br><br>I was also easily sold on the film because I'm a big Vincent Price fan. Price is great, even though the context of the role is a bit unusual for him. There is a lot of comic relief throughout most of the film, and the genre wasn't his norm. However, he comes across as menacingly demented yet suave as always. The rest of the principle cast was marvelous, too, with Charles Bronson playing an early version of Harrison Ford (maybe he always did that), Mary Webster as an appealing love triangle target, and some very fun and appropriate overacting from Henry Hull doing an early obnoxious \"I'm an American\" shtick and David Frankham as the perpetually irascible Victorian sap.<br><br>It's a blast noting all of the future tech elements from past eras' perspectives, and the set design and special effects are actually admirable given that this was a low-budget film for its ambitions. Even the stock footage and footage from the 1944 Henry V (the shots of London that look like a medieval town), although at times obvious, are incorporated well. On the other hand, there is some similarity between the set design and that of a particular era and class of television show--say the Adam West Batman, the original Star Trek, or even the Tom Baker Doctor Who--which all have a fairly low-budget look, but I have to admit that I love those shows, too.<br><br>There isn't much of an easily discernible subtext in the film, but of course that's because Master of the World wears its messages proudly on its sleeve. I won't state them explicitly here, as in my view that would be a spoiler, but it's notable, like many other aspects of the film, for its similarity to 20,000 Leagues, including its moral ambiguity. This would actually be a good film, as would 20,000 Leagues, to show a freshman-level ethics class as an exemplification of and discussion launching pad for both utilitarianism and deontology.<br><br>Although it's not exactly the most original film to come down the pike (but primarily just because of 20,000 Leagues), and it's not a faithful adaptation of author Jules Verne's work, I don't subtract points for either of those characteristics. Master Of The World has an engaging, solid story that is both thought provoking and a lot of fun.","user":"BrandtSponseller","rank":[40,47]},{"title":"A Fun Little Film, Though Strange By Today's Standards","rating":6,"date":"1 March 2011","review":"A sleepy Pennsylvania town is awakened in 1868 when Captain Robur (Vincent Price) comes sailing in on his airship. A few of the city locals join him, curious about this new way to fly, and eager to stop him when they think he has had a bit too much power for his own good.<br><br>Let me start by saying that I absolutely loved the prologue, which was perfect for this film. The montage of various flying devices that did not work. Some of this footage has become classic, but it fit the theme perfectly here: a world where the only way to fly is with balloons suddenly seeing a new method in disbelief.<br><br>Vincent Price is great as Captain Robur, but when is he not? He would go on to declare this one of his favorite roles. Charles Bronson plays the other lead, John Strock, and may surprise fans of Bronson. (Some have said he was miscast, but I do not see any problem with it.) We also have Henry Hull as Prudent, more or less representing the \"old ways\" (which are quite old by now, given the story takes place just after the Civil War).<br><br>David Frankham is also great, and interestingly came on board thanks to Vincent Price. His role was already filled by AIP regular Mark Damon, but Damon skipped out to film another project. Price suggested Frankham because they had worked on \"Return of the Fly\" together. Frankham is not as well known as Damon, but he is a valuable resource because he has provided multiple commentaries in recent years.<br><br>Richard Matheson wrote the script, based on two Jules Verne stories. Matheson has consistently been a great writer, particularly in conjunction with Vincent Price and AIP. Jules Verne is not a source used often enough -- beyond \"Around the World in 80 Days\" and \"20,000 Leagues Under the Sea\", his work remains largely untouched. This film proves that more can be done -- and also that you can get around the world in ten days. <br><br>Interestingly, the plot revolves around a man who thinks he can end war by using the threat of invincibility. While the idea of having a war on war is admirable, one has to wonder if Matheson had in mind the nuclear bomb when writing the script -- surely the bomb's creation was thought to end war as we knew it, but only encouraged others to acquire nuclear bombs. Likewise, one assumes that governments would push to build Robur-style airships.<br><br>Vincent Price (or Charles Bronson) fans should check this one out. It is not a horror film, not by any means. It is typically classified as science fiction, though I would put it more in fantasy. Price still has a bit of the villain inside him here, but it is not the murderous, insane type... it is a misunderstood, misguided antihero. <br><br>As always, the definitive edition is on Scream Factory's Vincent Price Collection (Volume 3). We have an incredible audio commentary with David Frankham and a moderator named Jonathan -- Frankham is very knowledgeable about Les Baxter, and even offers a slight diversion to discuss \"Werewolf of London\". Few people alive today know the AIP of the 1960s like Frankham. The disc also includes the full-length documentary \"Richard Matheson: Storyteller\", which is priceless and will be covered in its own review.","user":"gavin6942","rank":[9,9]}]