[{"title":"Brando vs. The Beetles","rating":10,"date":"20 August 2005","review":"My son-in-law recently saw \"Easy Rider\" for the first time and became totally confused. \"What's that all about?\" he asked me. What could I say? I replied, \"You just had to have lived through those times to understand and appreciate the movie.\" The same can be said of \"The Wild One.\" Before \"Blackboard Jungle,\" before \"Rebel Without A Cause,\" before \"Look Back in Anger,\" there was \"The Wild One.\" \"What are you rebelling against?\" \"Whatcha got?\" That certainly sounds like James Dean in \"Rebel Without a Cause\" but, no, it's Johnny (Brando) in \"The Wild One.\" I saw this movie for the first time when I was 13 and was mesmerized by it. Apparently it was distributed again after \"Blackboard Jungle\" and \"Rebel Without a Cause\" came out because I saw it the same year I saw the other two. As far as fascination of the three, this one effected me most. Almost as good as Brando is Lee Marvin. I've read conflicting accounts of how The Beatles came up with their name. One, they so admired Buddy Holly and the Crickets that they adopted Beatles as a replacement for Crickets. The other story is that John Lennon so admired \"The Wild One\" that he took the name of the rival bikers and gave it a new spelling. Whatever the case, Lee Marvin is a good foil for Brando.<br><br>My favorite part of the movie is the opening. The open highway is a symbol for the movie. The highway is a means of passage for new ideas, new challenges, new life styles. The highway can bring evil as well as good. It is symbolic of freedom and a carefree way of life. It's not surprising that trucks began replacing freight trains as the major means of transport for goods and services following World War II. The highway also began replacing the rails as the major means of escape for the socially and spiritually oppressed among us. The viewer sees the blacktop for what seems to be several minutes. Suddenly, something appears on the horizon. Before the viewer knows it, rebels in the form of bikers are headed directly toward the camera. Then it seems they actually run through the camera and come out of the screen into the audience. What a piece of cinematography. Hungarian-born Laszlo Benedek mainly concentrated on television after this film. Being such a gifted director, one wishes he had done more films.<br><br>There is actually not much of a story in this movie. Supposedly based on a true account of a biker gang taking possession of a small California town, it's mainly a comment on changing times and mores in post-war America. But from the first roar of bikes journeying down the pavement, the viewer is hooked and stays spellbound to the very end. One thing puzzles me about the film's history: How does a movie get banned in Finland?","user":"krorie","rank":[54,68]},{"title":"Like old wine !!","rating":10,"date":"7 October 2014","review":"\"Mostly I remember the girl, I cant explain it, a sad chick like that...\" is how it starts and you already know that the next 80 minutes will be a privilege. The movie is symbolic with subtle subtlety and still every viewer will get it. Yes! its about a rebellious youth and how the devil in others brings out the devil in him, its romantic, its stylish and still so profound. Who wont love a film with a beautiful girl saying \"You are still fighting aren't you ? Why do you hate everybody ? \" (the same message American History X will deliver half a century later).<br><br>If nothing, you'll love it for the evergreen story about a tender girl changing a tough guy.","user":"ravikishore28","rank":[8,8]},{"title":"\"The Wild One\" introduces the motorcycle as the symbol of youth rebellion...","rating":9,"date":"16 February 2003","review":"The 1950's was a period of review and questioning, as a new postwar generation sensed that much was wrong but could not grasp what it was nor offer any solution... It was, in fact, a generation with a sensitive exposed nerve that gave constant pain... <br><br>Marlon Brando, a young 'Method' actor (the \"Method' was itself a manifestation of the times) began his film career with 'The Men' (1950) and continued with 'A Streetcar Named Desire' (1951), 'Viva Zapata' (1952) and 'Julius Caesar' (1953), all roles concerned with rebellion... Then, in 1953, he made 'The Wild One' and his rebel image crystallized...<br><br>Brando plays Johnny, leader of a motorcycle gang calling itself the Black Rebels, which terrorizes Wrightsville, a little American town...<br><br>The gang members release their frustrated emotions by racing, overturning a car, and by vicariously participating in a savage fight between Johnny and Chino (Lee Marvin), formerly a part of Johnny's gang but now a rival club...<br><br>Violence escalates when the town forms a vigilante committee, and inevitably there is an accidental killing... Johnny is saved from wrongful arrest by Kathie (Mary Murphy), a local girl who, in spite of herself, falls in love with him, as he does with her... She senses beneath his cruel exterior an innate gentleness, and is attracted by his sexuality, an element that was increasingly to become a factor in the evolution of the rebel hero...<br><br>Johnny and the gang finally leave town and life returns to normal, but many questions that the film poses were left unanswered... <br><br>Brooding, and compulsive, the film created a noisy tumult partly because it failed to show 'why' youths were this way, ending up, in the words of one critics \"violent for violence's sake.\" However it is an important film... It reflected the problems of the period and it marked a step in the progress of the rebel hero... It also introduced the motorcycle as the symbol of youth rebellion foretelling such films as 'Wild Angels' (1966) and 'Easy Rider' (1969).","user":"Nazi_Fighter_David","rank":[33,41]}]