[{"title":"\"If this movie doesn't make your skin crawl... then it's on too tight!\"","rating":10,"date":"3 November 2003","review":"Released and ignored in 1973, \"Black Christmas\" became a forgotten classic. The Canadian shocker was eventually re-released as \"Silent Night, Evil Sight\" in order to avoid confusion with the blaxploitation films of the time, but it bombed once again. In the early 80s, it was broadcast on cable as \"Stranger in the House\" in order to snatch up some rantings. Right when the movie seemed dead, NBC decided to cancel a prime-time airing of it because it was deemed \"too scary\" for network television. This was all film-buffs needed to go back and discover the wonderful \"cool movie that you never heard of\" that is \"Black Christmas\".<br><br>Before I go on, here it goes: \"Black Christmas\" is one of the scariest (and finest) horror films ever made. Major credit must go to director Bob Clark (who went on to direct the epic \"Citizen Kane\" remake and because of legal reasons had to change it's title to \"Porky's\") who like John Carpenter in \"Halloween\", is able to create a current and simplistic creepy atmosphere. \"Black Christmas\" is indeed very similar to \"Halloween\": Both movies are themed with a particular time of year, both movies feature a killer with breathing problems who loves POV shots, and both movies have a long and slow build-up that makes the audience care for the characters that are about to get slashed. The difference is that \"Black Christmas\" does it much better, in fact, I think it is a superior film.<br><br>The movie begins with a shaky POV shot of a stranger who decides to sneak inside a sorority house in order to get some fresh meat. That's it! Plain and simple. There is no \"your father killed my cousin's cat\" motive, the killer wants to kill because he simply wants to. Isn't it much scarier like that? No motive at all?<br><br>The cast is not your usual teen slasher stereotypes: There is the not-so-virginal sweet leading lady Jess (Olivia Hussey) who is having trouble because she wants to have an abortion. Her boyfriend Peter (Keir Duella) eventually disagrees. In the sorority house there are many other odd characters, including chain-smoking, foul-mouthed, heavy-drinking Barb (ironically played by Margot Kidder) who steals the show with the much-needed humor. Unlike the countless other slashers out there, \"Black Christmas\" takes time for the audience to get used to these characters and actually care for them. Unlike in \"Halloween\", the entire top-notch cast in \"Black Christmas\" give excellent performances. Olivia Hussey is perfect as not-so-innocent Jess, Keir Duella is scary and misleading as her deranged boyfriend. And of course, Margot Kidder steals the show with an excellent and amusing take playing herself. Also noticeable is cult star John Saxon as Lt. Fuller who many years later started showing his personal love for \"Black Christmas\" on interviews.<br><br>The well-balanced doses of drama and comedy connects the audience to the characters on screen so strongly that they sometimes we forget it is a horror movie. And when something scary eventually happens, it comes as a total shock. Bob Clark eventually became famous for his comedies, and you can sense his upbeat sense of humor though the entire film. Recent movie audiences lost their patience, so movies like that can't be made anymore. And there is a good reason \"Black Christmas\" is currently labeled as a comedy at the IMDb, it is really funny. So many memorable quotes here: \"These broads could hump the Leaning Tower of Pisa if they could get to top of it!\" or \"I'm a drunk? Here we have the queen of vodka herself!\" and of course, the whole Fellatio address.<br><br>But isn't this a horror film? It really lives up to it's tagline. To begin with, the killer is not a silent invincible maniac on a Santa Claus costume. Instead, he is never seen. Most of his moments come from POV shots and dark takes. He is confined to the sorority house's attic for most of the time. How is that scary? Sound comes to play. The killer calls the sorority girls though the phone many times (early shades of \"Scream\" and \"When a Stranger Calls\") and uses some of the most disturbing voices you will ever hear. He imitates pigs squeaking, perverted dirty talk, animal noises, screaming, heavy breathing, and many other weird sounds. Does it work? Of course. This guy makes Norman Bates look like Richard Simmons.<br><br>These disturbing elements are all put together though the brilliant cinematography by Reg Morris, who is able to capture the silent Christmas atmosphere perfectly with the wonderful use of silent snow-covered streets and decoration. Let's face it, Christmas is a bit creepy, isn't it? It certainly will be after watching this flick. The piano score by Carl Zittrer is simplistic and effective as well. The repetitive use of Christmas carols also add up to the tension.<br><br>Ignored over the years and unknown outside the cult horror fans, this is an underrated classic that deserves much more attention that it ever got. Everything is perfect in this Canadian chiller: The atmosphere, the music, the overall spooky look, and one of the scariest villains in history. No gore (although the killings are so disturbingly shot they don't really need any) no sex, no nudity, just plain old-fashioned horror. This is \"Black Christmas\": Snow-covered silent streets, creepy Christmas carols, spooky use of lightening and color, scary atmosphere and the overall look of the plastic bag suffocated victim in a rocking chair staring from the attic window. Trust me, you will never go to your attic the same way again.<br><br>\"Twas the night before Christmas, and all through the house, a creature was staring...\"","user":"fdpedro","rank":[158,184]},{"title":"The original and perhaps the best slasher film ever made.","rating":8,"date":"28 July 2004","review":"The girls of a sorority house are being tormented by a twisted prank caller who continually calls to convey increasingly vile and abusive sentiments. What at first appears to be a sick joke eventually turns violent for the girls during the season of supposed goodwill and merriment.<br><br>The original and maybe even the best, Black Christmas' set the ball rolling for the slasher genre and was the biggest influence for the phenomenally successful John Carpenter classic, Halloween' (1978), which was, in fact, originally conceived as a sequel. Although Italian director, Mario Bava, had previously created what some see as the first slasher movie, Bay of Blood' (1971), it was Black Christmas' that was to become recognised as the catalyst for one of the most lucrative sub-genres of horror cinema. Bob Clark (who previously made the kooky, enjoyable, low-budget zombie film Children Shouldn't Play With Dead Things' (1972)), still at this point something of an amateur director, took a simple yet naturally frightening concept and turned it into one of the most unsettling and nerve-wracking one hundred minutes in cinematic history. Only a select few films such as The Haunting' (1963) and Alien' (1979) are atmospheric enough to truly equate to the eeriness and feelings of apprehension that are to be induced by Black Christmas'.<br><br>The simplicity of the production is what makes it so endearing. There are no overly bloody death sequences or unlikely, comic-book style events; the viewer is just presented with an unnerving tale which could easily have a strong basis in reality. Inventive camerawork and POV shots as well as a superlative use of lighting are the elements that combine to achieve the desired results. The often pseudo-claustrophobic environment of the sorority house, from where the vast majority of events occur, offers the perfect, vulnerable and unguarded location susceptible to intrusion and thus attributes to the continual foreboding atmosphere. Clark was not afraid to take time building both the story and characterisation as well as introduce the viewer to the aspects that he would use to build the suspense. This is prepared before plunging the viewer into a seemingly uncontrolled nightmare that one experiences along with the protagonists. Another aspect that firmly stands out is the mysterious way that everything is presented; even at the very end, very little has truly been explained yet everything seems like it should have an obvious explanation. Even in its undoubted simplicity, Black Christmas' has complicated facets that require thought from the viewer to entirely comprehend the film. In some ways, the concealing of several key points puts the viewer's knowledge of events on a par with the actual characters.<br><br>Black Christmas' is also complimented wonderfully by strong acting performances from Olivia Hussey, Margot Kidder, John Saxon and a highly pleasant and amusing turn from Marian Waldman. Despite the tiny budget, this is a highly polished horror film that genuinely belongs among the elite of the genre. This is where it all started and those familiar with later slasher films such as Halloween', Friday the 13th' (1980), Slumber Party Massacre (1982) and The House on Sorority Row' (1983) should be able to spot several of the now-clichés that first materialized in Black Christmas'. My rating for Black Christmas' - 8½/10.","user":"Snake-666","rank":[90,104]},{"title":"Heavily Underrated and Overlooked Classic Slasher","rating":10,"date":"24 September 2001","review":"To those of you Halloween fans, THIS is the film that came first, John Carpenter's Halloween is doused with aspects lifted directly from Bob Clark's Black Christmas. Alongside Psycho it remains one of my personal classics. Very unnearving and in parts horrific - the phone calls for instance. Basically its Christmas time, as the title suggests and an unknown killer has found his way into the attic of a sorority girls house and begins killing them one by one. Kidder's performance of the drunken, outspoken Barb is fantastic, followed closely by Olivia Hussey, who is truly beautiful in this movie. The camera work and direction is first rate, the first person perspective, heavy breathing - which most will know from Halloween, Mr Clark did it here first, and in my opinion, did it better than JC. It's not full of gore its full of suspense and wonderful creepy atmosphere, as I mentioned before, the phone calls really will put you on edge, as will the 'eye' scene. Get ready for a shocking ending and watch it again for all the bits that you didn't catch, believe me there will be some. Alongside Jacob's Ladder, Don't Look Now and The Fog this really is one of the most frightening films I have ever had the pleasure to acquire.","user":"Mr_Jase_UK","rank":[64,78]}]