[{"title":"Not one of my favourite Bergman films, but a charmer all the same","rating":9,"date":"6 November 2012","review":"Ingmar Bergman has many several superb movies. A Lesson In Love is not one of his best, or one of my favourites shall I say, but I found it to be a fine and very overlooked film in many ways. It looks wonderful, the cinematography is especially good in the picnic scene and the scenery and images are all stunning to watch. The script is cynical, charming and funny at the same time, while the story is lighter in tone than most Bergman but is well balanced also with intelligently explored issues within the family especially the tension between David and Nix. The flashbacks are very carefully calculated, and there are some standout scenes, like at the picnic, on the train and with the granddad. Bergman as ever directs superbly. It is the performances that make A Lesson in Love the charmer it is, aside from the writing that is. The ever elegant Eva Dahlbeck and Gunnar Bjornstrand give superb performances that gives A Lesson in Love that extra sparkle. Fellow Bergman regular Harriet Anderssen is also impressive, though went onto even better things. Overall, a charming and funny film, definitely recommended. 9/10 Bethany Cox","user":"TheLittleSongbird","rank":[8,8]},{"title":"a perfect example of a successful comedy","rating":10,"date":"20 January 2006","review":"Bergman is a sublime comedy director and writer. This fact becomes apparent in \"En lektion I kärlek\", where the comic elements range from pure slapstick to deep, yet very emotional scenes. This movie is paves the way for Bergman's later comedies \"Sommarnattens leende\" and \"Kvinnodröm\", all of them starring Gunnar Björnstrand as well as Eva Dahlbeck. This is an excellent movie with which to start your Bergman experience, acutely portraying emotional troubles of the young as well as the old. The cinematography by Martin Bodin is astounding, for instance in the picnic scene. In short, the movie is a perfect example of a successful comedy, with a clarity of depth even surpassing some of Bergman's own comedies.","user":"johanvillaume","rank":[17,22]},{"title":"An Ironic and Erotic Comedy about Marriage","rating":8,"date":"1 July 2012","review":"\"A Lesson in Love\" was, at least to some extent, an exception in Ingmar Bergman's production which reached its breakthrough one year later with \"Smiles of a Summer Night\". Then continued with such masterpieces as \"The Seventh Seal\" and \"Wild Strawberries\". However, even if \"A Lesson in Love\" wasn't the film which defined Bergman, it is still very enjoyable, witty and intriguing. In a sense, it meant a follow-up for \"Summer with Monika\" which gave a kick-start for the sexual liberalization of Scandinavia. In the very beginning, \"A Lesson in Love\" reveals the essence of its nature, which is veritably ironic: \"A comedy for grown-ups. This could just as well be a tragedy. Its protagonist isn't the man nor the women but the unpredictable life itself.\" <br><br>The story centers around a couple who have been married for 15 years. Both have had their affairs but now -- through memories of past and days spent together -- it's time for a possible reconciliation during a train travel where they 'accidentally' come across with each other. Gunnar Björnstrand is fabulous with his sarcastic charm as the man who has lost his faith in enduring, eternal love. In addition, Harriet Andersson plays a fantastic supporting character as the man's charming yet rebellious daughter.<br><br>It is no wonder that Bergman chose train as the main milieu for this film which is, for most parts, built on numerous flashbacks, memories and dreams. For isn't train really the milieu which captures the core of our logic -- of our subconsciousness? During the train travel, all that is essential is performed in front of our eyes: the unhappiness of the protagonist's marriage is, paradoxically, due to its harmonic welfare. It lacks on something very substantial, something irrational. It is as if the sterility of bourgeois life had suffocated all genuine emotions which often are the factors that make marriage lively and vivid. That is to say, similar thoughts prevail the mood of this film which were due to characterize all of Bergman's subsequent films.<br><br>\"A Lesson in Love\" is not necessarily your regular comedy of the 1950's but, to my mind, it has several laugh-out-loud moments. In this film, Bergman is at his best striking a few blows at the patriarchal, while depicting marriage as a real purgatory. In fact, Bergman's comedy is so black that, at times, laughter is about to get stuck in one's throat. Such serious matters he makes fun of. The whole ridiculous absurdity of the society, which is built on the unjust institutions of marriage, religion and fatherland, culminates in the dinner party scene where a prayer is rendered, a thigh is flashed and a fight breaks out. Such anarchist criticism bears a striking resemblance to the films of Luis Buñuel who also operated poignant analyses of the western society. By conducting a rather sensual study on sexuality and the contradiction of eroticism and love, \"A Lesson in Love\" even manages to gather some feminist features, making the film extremely interesting in its historical context.<br><br>Although the film includes a few expressionistic images and discusses some existential themes, which have made Bergman so famous, it is still a very unusual work for the director. It is really the thesis of the film which makes it recognizable. For, in the end, the lesson of this session, both gloomy and jolly, isn't left ambiguous: romantic love is impossible unless if structured on the act of deception and severe self-betrayal.","user":"ilpohirvonen","rank":[8,9]}]