[{"title":"A perfect, light hearted Sci-Fi Comedy which keeps you entertained for the whole two hours","rating":10,"date":"1 March 2010","review":"WARNING!!! POSSIBLE SPOILERS!!!!!!!! \"Star Trek IV: The Voyage Home\" is arguably the greatest Trek. It is the most popular Star Trek film (not including the 2009 reboot). Before the reboot, it was the only Trek to gross over $100 million domestically, plus it was extremely well received by critics and fans alike. It surpassed every expectation that it had set up for itself, simply because it is the funniest and most light hearted Trek.<br><br>The best part is the interactions between the characters. Yes, the film was nominated for 4 Oscars (once again, the most of any Trek) including best effects, but the effects aren't the best part. It was the success of this film that convinced Paramount Television to give a spin-off series a shot. As you probably know, TNG, DS9, ST:V, and ST:E were all very successful, and they were the result of a chain reaction which started with the success of \"The Voyage Home\".<br><br>The film also noted Leonard Nimoy as a top-notch comic director. This won him the job of directing \"Three Men and a Baby\".<br><br>If you like Star Trek, this is definitely the film for you. Everyone else? Just research the characters a bit and I'm sure that you'll have a good time.<br><br>This film earned its money and its acclaim. It features many classic moments (Spock mind-melding with the whale, Scotty talking to the computer, Kirk using \"colourful metaphors\" to handle an angry cabbie, Spock using the nerve pinch on a punk on the bus, Kirk and Spock arguing over their preferred foods, and that's just scratching the surface!).<br><br>10/10 A Sci-Fi Comedy along the quality of \"Ghostbusters\", \"MIB\", and \"Back to the Future\"! That might be an overstatement, but I think it's true!","user":"jmanchak6","rank":[25,28]},{"title":"My Favorite Star Trek Film!","rating":10,"date":"19 February 2017","review":"10/10 This is very much a personal rating and not a critical rating. I love this film! It's fun and silly, and it's my favorite Star Trek film. The whole premise of going back in time to save the world by saving the whales, ridiculously fun!! :) It may not be the most serious Star Trek or be the one that makes you look into yourself and challenges you, but not all movies have to do that. I grew up watching this film with my family and I guess my dads love for the film rubbed off on me.","user":"mz-37866","rank":[8,8]},{"title":"Hugely enjoyable!","rating":10,"date":"21 February 2005","review":"First off, I'm not a big BIG 'Star Trek' fan. I've seen the first six films, and catch an episode of the TV series every now and then (I saw the whole first season recently, which made me re-visit the Shatner/Nimoy films). I did however, find this film extremely entertaining! In fact, it was about as much fun as I think you can have at home with a (tasteful) video! I found 'Star Trek: The Motion Picture' a tad dull, although I still enjoyed it. And II and III work well together, and are both enjoyable sci-fi action flicks ('Wrath of Khan' is another classic, but I feel IV pips it to the post). However, when 'The Voyage Home' was over, I had no idea that a film with a plot which involved two humpback whales and mid-1980s San Fransico could be so damn fun.<br><br>Shatner is on great form as the rogue Capt. Kirk, and Nimoy is brilliant in conveying Spocks absolute confusion at being stuck on a planet he partly understands, in a time he cannot comprehend. When Kirk explains Spocks oddness to the brilliant and frankly underused actress Catherine Hicks, Kirk says that Spock did a lot of \"LDS\" back in college.<br><br>Kelley, Takei and company are all on fine form, and the score, direction and script all work brilliantly. The fact that the 1980s now seems so long ago (it after all, did not age as well as some decades) only adds to the films premise.<br><br>I would thoroughly recommend this film to anyone - 'Star Trek' fan or not - as it is a wonderfully entertaining film for all ages. I'm sure wherever Gene Roddenberry is, he looks back on this film venture with a wry smile and a bag of popcorn.","user":"NiceGuyTommy","rank":[78,111]}]