[{"title":"Audaciously Wonderfully Bad!","rating":15,"date":"15 November 2003","review":"Probably made as a \"please God, let what happened to ROCKY HORROR <br><br>happen to us!\", project, THE APPLE is so audacious, so over the top, so<br><br>totally awful that it is simply wonderful.  The songs are cheesy, the<br><br>acting horrendous, the costumes nightmarish, the concept bizarre etc.,<br><br>etc., but when all those negatives are put together, the result is a<br><br>positively guilty pleasure to top all guilty pleasures. Please, someone,<br><br>release a letterboxed DVD of this film so that all its rocky horrors<br><br>squeezed onto the small screen can be seen in all their garish terrible/wonderfulness.......","user":"rube2424","rank":[34,36]},{"title":"\"Farenheit 451: the musical.","rating":10,"date":"17 December 2007","review":"Never released in Australia, and we get every terrible film, I am now, in 2007, quivering with delight. My new DVD copy of THE APPLE arrived today and I gleefully shoved it into the player.... and it did not disappoint. More ghastly than I could have wished for, THE APPLE made in 1979 as the monstrously mashed together mix of TOMMY and ROCKY HORROR and PHANTOM OF THE PARADISE and LOGANS RUN and FARENHEIT 451 and HAIR...with CANT STOP THE MUSIC campiness, the XANADU dancers, and ZIGGY STARDUST eyeshadow, frosted wavy hair and lyrics poached from the first 8 bars of quite a few Beatles songs as 'new' songs (as another comment noted: ended up sounding like jingles from deodorant commercials) THE APPLE is a film you must see, the make everyone you know see while you watch their reactions. It is more fantastic to own than ELECTRIC BOOGALOO or LAMBADA or SALSA put together! And I own all those too! THE APPLE is more berserk than all those film mentioned above, ground into fluorescent dust-chalk and blended with glitter and then swallowed... and the result the next day is what I saw on DVD. Made in an unfinished shopping mall in East Germany by mad Israeli mogul Mehaheim Golan from the famed Cannon Films shed, THE APPLE is c colossal collision of Eurovision and a projectile vomit. Read all the other comments, including the media ones... and then realize we are being kind to this film. It is deliciously worse than everything you will read. As Lina Lamont said in Singin in the rain:\" I liked it!\"... the irony in 2007 being that MGM sold that wonderful musical to Warners and now represent THE APPLE instead.","user":"ptb-8","rank":[39,42]},{"title":"Always bad but never boring.","rating":12,"date":"12 February 2003","review":"Here's a godawful \"futuristic\" musical from 1980 that takes place in 1994 (which gives you an idea of just how campy it is), about an evil record executive debauching a naive couple from (no kidding) Moose Jaw, Canada. There's some kind of religious allegory here and there throughout the murky plot, and the songs must be heard to be believed. (One is a basically unveiled ode to the orgasm, which makes me wonder how the movie got a PG rating.)<br><br>THE APPLE is CAN'T STOP THE MUSIC (the music-world milieu) meets ROCKY HORROR (innocent couple corrupted by bizarre characters), and it liberally \"borrows\" scenes from everything from BEYOND THE VALLEY OF THE DOLLS to HAIR. And, oh my, the costumes. I wouldn't know where to begin describing them, so all I'll say is that camel-toe was apparently stylish for both men and women at one time.<br><br>Which is all another way of saying that THE APPLE is the newest camp classic that I must add to my collection, and I thank Showtime Beyond for unearthing this craptastic pop masterpiece.  (A widescreen DVD would be nice, though.)","user":"FeverDog","rank":[30,32]}]