[{"title":"Hepburn's Ferocious Comeback.","rating":10,"date":"17 April 2005","review":"A movie custom-made to fit the personality of an arrogant but headstrong movie star, a play with dialog that sizzles with so much ferocity that it threatens to leap out the confines of its own frame, performances that could not have and have not have been excelled ever since, THE PHILADELPHIA STORY is one of the best screwball comedies ever made and the third to pair her with Cary Grant with whom she worked so completely well. Hepburn had asked that Tracy and Gable be her leading men but looking at this film, for all the chemistry that Tracy and Hepburn ever had and all the talent Gable had for acting in comedic farce, I can't imagine either of them playing any of the two leading males that are after Tracy Lord's love. That Grant plays C. K. Dexter \"Dex\" Haven so perfectly well, and his opening scene with Hepburn is the stuff of movie history, only rectifies that. That Stewart embodies the essence of MaCauley Connors as if he were in fact the character just proves how strong an actor he was, and one who didn't have to resort to extreme emoting to make his point. That the three make for the most memorable romantic triangle in film history is probably an understatement.<br><br>Of course the story is old. Of course the character motivations are dated. THE PHILADELPHIA STORY belongs perpetually in its own time, the late 1930s (when it was written and performed on stage), when sensibilities towards the rich were much different than they are today. The whole bit of the society princess being humbled to become a better person is really a thinly disguised fable that tells the story of how Hepburn, who had made such a powerful debut in film with her appearance in A BILL OF DIVORCEMENT, quickly established a personality so abrasive (she wouldn't do interviews or cheesecake, it is rare to find a Hepburn picture from the 30s where she is dolled up) that it translated into box-office bomb after bomb and by 1938 she was all but washed up. Tracy Lord's return to humankind is really the story of Hepburn's return to the world of acting even if she retained her abrasiveness to her last days. And of course, who better suited for this role than Hepburn herself, who had done the role on stage and by the time Hollywood came (reluctantly) calling -- they wanted Norma Shearer, who in my opinion could have carried it off but differently -- knew the part in and out (and owned the rights to the play in a shrewd move). We can't imagine anyone else playing this role, which is why when the inevitable musical remake was made in 1956 with Grace Kelly in the lead, it misfires, and no amount of Cole Porter could save it even if it was a commercial success.<br><br>But regardless being dated, maybe too talky for some, what a movie. To see the utter craziness of the plot which backfires at least twice and creates a sense of really not knowing what will happen next (even when we know on a certain level Hepburn and Grant will wind up in each other's arms) is the stuff romantic comedy is made of. Oscar nominated in almost every major category, it won two -- Best Actor, Best Adapted Screenplay -- but over the years it's grown beyond statuettes and remains as one of the greatest films of the 20th Century.","user":"nycritic","rank":[74,86]},{"title":"Dictating her own comeback","rating":9,"date":"12 November 2005","review":"After Katharine Hepburn was one of a group of stars dictated \"box office poison\" by the ruling moguls of Hollywood she went east and scored a complete triumph on stage with The Philadelphia Story. But our Kate was the shrewd one, she had the foresight to buy the film rights from author Philip Barry and peddle them to the studio that would guarantee her repeating her stage role and giving her creative control. <br><br>On stage she had co-starred with Joseph Cotten, Van Heflin, and Shirley Booth all of whom became movie names later on, but meant nothing to Hollywood in 1940. She had the choice of leading men and cast in their places, Cary Grant, James Stewart and Ruth Hussey. <br><br>This was Grant's fourth and final appearance on screen with Hepburn. It's a typical Cary Grant part, witty and urbane, with a touch of the rogue in him. He's Hepburn's ex-husband, still very much in love with his ex-wife, but she's marrying stuffed shirt John Howard.<br><br>Reporter James Stewart and photographer Ruth Hussey are covering Hepburn's wedding for Spy Magazine, the National Enquirer of the day. Through a little judicious blackmail they're invited to this premier society wedding, but both feel out of place and used.<br><br>After The Philadelphia Story, Katharine Hepburn was a movie name the rest of her long life. Even with an occasional clinker no one ever questioned her about being box office poison.<br><br>James Stewart won the Best Actor Oscar in probably the most romantic he was ever on the screen. A lot felt it was a consolation Oscar for not winning it for Mr. Smith Goes to Washington in 1939. Stewart himself proclaimed to all who'd listen that he voted for good friend Henry Fonda in the Academy Sweepstakes for The Grapes of Wrath. I've always felt that when Stewart talked about those hearth fires banked down low to Hepburn, he was really talking about himself. He's a cynical fellow at first and his romantic side comes as a surprise to him more than even the audience.<br><br>The Philadelphia Story has become such a classic that even the musical remake High Society doesn't try to copy it, it just presents a softer musical alternative. But I'd kind of liked to have seen Hepburn do this with her original cast as well. Oscars were in the future for Van Heflin and Shirley Booth and Joseph Cotten the following year made his debut in the biggest film of all.","user":"bkoganbing","rank":[43,53]},{"title":"Three legends in their prime","rating":10,"date":"20 May 2001","review":"This is a delightful romantic comedy about the life and loves of a high society girl.  Tracy Lord (Katharine Hepburn) is about to be married to George Kittredge (John Howard), a self made man who elevated himself from the lower class.  The wedding is supposed to be a private affair, but Tracy's ex-husband C.K. Dexter Haven (Cary Grant) blackmails her into letting two reporters, Macaulay Conner and Elizabeth Imbrie (James Stewart and Ruth Hussey) cover the event.  What ensues is a screwball courtship for the heart of Tracy as everyone falls in love with her at once.<br><br>Director David Cukor (`Little Women', `My Fair Lady') provides a fast paced comedy with rapid-fire repartee and fosters a bubbly chemistry between the cast members, which brims with laughs.  Cukor received one of his five Oscar nominations for this film and it was well deserved.<br><br>Katharine Hepburn is marvelous as the blueblood bride to be.  She is a well-grounded girl who is not beyond putting on airs for show.  She is simultaneously sassy and dreamy and her comic timing is superb earning her one of twelve nominations for best actress.  Despite a star's billing, Cary Grant plays a supporting role as the sarcastic Dexter Haven.  With his deadpan delivery, he provides the perfect foil to Hepburn and Stewart.<br><br>Even with the luminous cast, Jimmy Stewart steals the show with a comedic tour de force.  His inebriated scene with Cary Grant is uproariously funny and his puppy dog wooing of Katherine Hepburn is enchanting.  It is hard to believe that James Stewart only won one Oscar in his outstanding career. Though nominated five times, the only role for which he won the statue is this one, a performance that is unquestionably among his best.<br><br>This tremendous comedy brings together three screen legends at the peak of their careers.  It was nominated for six Academy Awards winning two, and it was rated #51 on AFI's top 100 of the century.  It is a timeless classic that is sure to please.  I rated it a 10/10.  See it and enjoy.","user":"FlickJunkie-2","rank":[48,61]}]