[{"title":"Having served on the Nimitz....","rating":8,"date":"24 November 2003","review":"I saw this film before I joined the Navy and again before I served on Nimitz (CVN 68). Kind of a nice feather in my cap experiencing the world's largest 'time machine' in person!<br><br> On to the movie... A very interesting premise which should have merited a more detailed analysis! Executed well enough for 1980, but could be remade into one hell of a motion picture today! I'd love to see it.<br><br> One thing the story does well is get one thinking about the 'what-if' scenario having the most modern carrier in the today's fleet taking on the Japanese Navy almost 40 years prior... Hmm. What a mismatch that would be in much the same way that **** SPOILER ALERT **** Combat Air Patrol (CAP) Tomcats rendered the 'Zeroes ' splashed handily! But, the very nature of Paradoxes would have rendered intervention potentially destructive to Nimitz and all aboard! (Which would have made profound changes to MY naval career as well.) And that was the dilemma faced; Do we change history because we feel a conscious duty to tilt the war in our favor (At least in the short term.)? Or do we choose to let nature take its course knowing full well the outcome if nothing is done? 4 more years of war and millions of lives? Or win a decisive victory and save all of the agony yet to come at the possible expense of destroying the fabric of space/time... or at the very least causing the U.S. and the Allies to lose in the long run because the U.S. would have delayed entering the war? Thorny, eh? As it turns out, history in this film was changed in a minor way but then again... was it? Possible predestination paradox, meaning events were supposed to happen the way they did.<br><br> ***SPOILER ALERT*** If the Nimitz had stayed to fight, logistically it would have been possible... for a short time. Without access to spare parts, jet fuel and other means of support, the ship would have been nearly useless. True, this vessel class can steam for over 20 years on a fresh set of plutonium rods, but jets can't fly without fuel or spare parts! And just imagine trying to provision that ship with its crew of 5000 plus with 1940's technology! This ignores what the U.S. Government would have done once they got their hands on Nimitz and her technology back then! The debriefing would never end for those people! And imagine the changes to history then! (Could be a whole other movie!)<br><br> All in all, I think it was a great piece of science fiction and a very enjoyable 'what if'... I recommend anyone see it who can! It has its flaws and is dated but the concept is still very valid. The movie's big strength is not so much what is said, but what is not. The important stuff is left to the viewer's imagination, and this is what makes it very entertaining and provocative!<br><br> This is the movie that made the USS Nimitz a household word and I am very proud to have served on a piece of science fiction history (no pun intended)! The ship is very distinguished and far more impressive 'in the steel' than she is on film.<br><br> I give this film a 7.9/10. Mostly for the powerful premise.","user":"gold5","rank":[59,60]},{"title":"I really enjoyed it","rating":8,"date":"8 January 2005","review":"This was a highly entertaining sleeper about a naval ship that happens to go through a time warp and end up at Pearl Harbor just hours before the attack in 1941. Realistic acting, special effects and air scenes really make this movie stand out from other similar movies. I'm really surprised that this film is not more popular, because this was a very unique and fascinating concept for a movie, especially back in 1980. I would recommend this movie to anyone who enjoys a good science-fiction film. I'm also surprised that it has such a low rating, I was expecting it to be rated at least a 7. Ill give it an 8 out of 10. Well worth viewing.","user":"Idocamstuf","rank":[100,108]},{"title":"A Guilty Pleasure","rating":5,"date":"5 December 2001","review":"There are great films (\"Citizen Kane,\" eg), and there are \"big films\", like \"ET\" or \"Star Wars.\"  Then there are absolute crap films (eg, WAY too-many to list!).  I propose another legitimate category: \"Guilty Pleasure Films.\" These are movies that one can see over and over, through countless repetitions on cable and broadcast channels, and enjoy the experience every time.<br><br>For example, I have probably seen \"Brighton Beach Memoirs\" 40 times.  I loved it during its first run, and I've loved it each of the 39 times I've seen it on the small screen.  No, it's not a great movie, but it's one that brings me pleasure when I watch it.  Same with (blush) \"Bill &amp; Ted's Excellent Adventure\": the movie's stupid, but it just always entertains me!<br><br>Similarly, nobody is going to compare \"The Final Countdown\" to \"2001: A Space Odyssey\" as far as absolute quality, but \"The Final Countdown\" is a classic example of an unabashed \"guilty pleasure\" movie.<br><br>The story is intriguing--what would YOU do if you were commanding a nuclear-powered aircraft carrier full of supersonic jets, etc, when you were transferred through a time-warp (ref: a CHEESY looking laser and smoke effect storm!) to December 6, 1941?? Would you alter history, just to win a battle against those attacking Pearl Harbor? Or would you hold back because you'd change history if you did anything?<br><br>Interesting point! Kirk Douglas, as the ship's captain, looks like he's having a ball acting in this, and Martin Sheen does a great job as the \"civilian consultant,\" Mr. Laskey.<br><br>No, this movie isn't an Oscar-winner, nor did it really deserve to be.  But I'll put it this way.  A local independant station showed \"The Final Countdown\" tonight at the same time TNN was showing \"The Godfather 2\" uncut.<br><br>I spent maybe five minutes on the Oscar-winning Godfather 2.  Yes, it is an empirically great film, but I've seen it once before.  But with American fighter jets dogfighting 1941 Japanese Zeros, I was FAR more entertained watching \"The Final Countdown\" for the 10th time!","user":"Tomzone","rank":[174,193]}]