[{"title":"Great cast in cheesy 70s action flick","rating":5,"date":"11 August 2005","review":"Medium budget action film thats not as bad as made out. But I'm not saying it's good either. But it does have something.<br><br>OK the premise is a bit naff. A unnamed wealthy small town in the South-West ( the film was filmed around Scottsdale and Mesa in Arizona) is terrorized by an American Indian with a crossbow who seeking to address the injustices of the past by extorting the town rich of $5 million. Add to that the fact that all of the roles are underwritten and there are many undeveloped plot lines. Without being too picky and in no order: is the Indian really an Indian, why all the Indian mysticism, why is he extorting money, what about his Olympius career, what about the lucrative land deal the big wigs are trying to put together, why does this small community have so many rich people ...<br><br>Also everyone seems to know each other very well after just meeting. Its as if the actors are anticipating the next scene. Oliver Reed's character abuses, woos, threatens and beds a reporter in about 2 minutes of screen time ! He also forms a friendship based on mutual respect with Jim Mitchum's character in their 4 scenes together.<br><br>To top this off a lot of the action is a bit lame.<br><br>So what does the film have? A great cast of familiar faces! I can sit through any tripe if you throw enough faces from years past at me. Stuart Whitman as the millionaire is good ( the best scene in the film is where he and the Indian are playing cat and mouse in his mansion), John Ireland does not have a lot to do but is always dependable, Robert Mitchum's son Jim is vastly underrated ( where is Tarantino to revive his career) and also doesn't have much to do but I suppose he was cast as a familiar face to the 70s action movie crowd ( check him out in \"Trackdown\"), Paul Koslo again plays the bad guy ( he was the bad guy in so many 70s films and was always excellent) and almost lifts the ridiculous role above what it is worth! Oliver Reed and Deborah Raffin are OK.<br><br>So if you get a buzz , as I do, watching films from the 70s and 80s with great actors of years past in small leads or supports then this is the ticket for you. For my money the action is fast paced and never boring ( its just not that good). The director, Richard Compton, also directed drive-in cult classic \" Macon County Line\".<br><br>By the way the theme song ( for Victor the Indian) , \"Shoot Him\", was co-written and performed by Roger McGuinn ( of the Byrds) and its lyric explains a lot of the motivations behind the Indian's character .... which the script writers had failed to do.","user":"FrankiePaddo","rank":[12,15]},{"title":"Great Cast Makes Up for Questionable Script","rating":20,"date":"20 December 2017","review":"Assault on Paradise (1977) <br><br>** 1/2 (out of 4)<br><br>A small town full of rich people find themselves being terrorized by an Indian who is shooting and killing people with a crossbow. He offers to stop the killing in exchange for one million dollars. The rich people decide to bring in Nick McCormick (Oliver Reed), an expert in tracking down people like the killer.<br><br>ASSAULT ON PARADISE was also released under the title MANIAC but no matter what you call it the film itself is fairly entertaining if a bit brain dead. I say that it's a bit brain dead because it's not quite clear what the killings are for and it's not quite clear what all the rich people are hiding. Everything is pretty much being done in secret yet there's really no explanation of what is happened and why.<br><br>The film's strongest point are the cast members who turn in very fun performances. Reed could play a role like this in his sleep and I'm sure this was just a paycheck to him but he still manages to turn in a good performance. I thought he was quite believable in the part and he made for a good lead. Veterans Stuart Whitman and John Ireland add some nice support as does James Mitchum in his role as a tracker. Deborah Raffin plays a somewhat love interest but her character and the motivations are about as strange as the killers. Paul Koslo plays the killer.<br><br>The film's biggest problem, other than the screenplay, is the fact that the direction by Richard Compton doesn't really get any suspense from the material. I would have liked a bit more tension but that's just not to be found anywhere. The film also shows some signs of tinkering as the opening sequence was thrown on for no real reason and it sticks out like a sore thumb. With all of that said, if you're a fan of the cast then there's some entertainment to be found here.","user":"Michael_Elliott","rank":[4,4]},{"title":"Ransom leaves a lot to be desired.","rating":4,"date":"23 August 2013","review":"Near Phoenix, Arizona, there's a small town with the highest concentration of millionaires living there. When a psychopath in full Native American regalia (Koslo) sets up shop there and begins killing people with his bow and arrow, the townspeople soon realize he's going to continue sniping people from long distances until he gets the millions of dollars he's requesting. So naturally Oliver Reed, Stuart Whitman and Jim Mitchum are called in to use their manliness to put an end to the madness. Will they succeed? \"Give me back my son!!!!!!\"...is what you won't be hearing in this tame, mediocre outing. Once again we've fallen prey to what we call \"Lone Tiger Syndrome\" - that being where we see a movie because of its stellar cast, and then are disappointed because many familiar B-movie names do not necessarily a good movie make. Fan favorite Jim Mitchum is decent as the cowboy Vietnam vet Tracker (great name) but he doesn't get enough screen time to develop his character, a common problem in these \"star-studded\" affairs. We also love Oliver Reed, but, inexplicably, he resembles Jerry Lewis in the scenes where he wears sunglasses. A lot of his dialogue concerns his drink orders. We'll leave it at that. Stuart Whitman is always a professional, and Deborah Raffin of Death Wish 3 (1985) fame is onboard as the classic (and pretty cliché) female reporter. The standout character, once again, is Paul Koslo as the baddie. He strongly resembles Kurt Russell, and does a great job (not quite as great as his turn in The Annihilators 1985, but once again, he actually had screen time in that one).<br><br>While there are a handful of okay kill scenes and maybe a few chases (and one exploding helicopter), this movie is filled with, well...filler, and the whole outing is stodgy, kind of like The Hit Team (1971). The movie doesn't fulfill the potential of the cast, and it's just not exciting enough. The killer Indian should have had some goons, but perhaps the budget couldn't allow for them because all the stars had to be paid first. Yet again we come back to the fact that there's no one, singular character we care about. It's all kind of a jumble with the multiple characters. Sure, Koslo tells his enemies they have to \"pay the wind\", which is a precursor to Red Scorpion 2 (1994), but sadly the proceedings are slow and yawn-inducing.<br><br>As for the tape itself...no one sings the praises of Vestron more than we do, but they botched this one. It's a horribly obvious pan-and-scan disgrace. They make it seem like the camera is resting on the seat of an exercise rowing machine that someone is tipping up, then tipping back. At least they used one of the more accurate of this movie's many titles. Most of the others make it seem like it's going to be a horror movie of some kind. If you do ever check this movie out, unfortunately we recommend NOT to view the Vestron tape.<br><br>Featuring the song \"Victor's Theme: Shoot Him\" by none other than Roger McGuinn and Patrick Ferrell, Ransom leaves a lot to be desired. We've certainly seen a lot worse, but we wish the powerhouse cast would have done something more worthy of their talents.","user":"tarbosh22000","rank":[3,3]}]