[{"title":"It made me feel","rating":10,"date":"3 September 2004","review":"I've seen this movie when I was young, and I remembered it as one of the first films I have truly liked that was not an action movie or a comedy. So, in my later years I decided to watch it again and see if it was just nostalgia or was there really something in that movie. To my surprise, the movie held to my every expectations. It's a great movie. Emotional in the right amount, some jokes, nice songs (not great though, and that actually explains why I did not remember it was a musical) and all in all a great use to my time. I was surprised because the last movies from my childhood that I have revisited did not even pass my minimal demands of a decent movie and yet this movie, which I first saw in the second grade, made me cry today just like it made me cry then. Maybe that's because my dog died recently and maybe not, but the important thing is that it made me feel, and that's why filmmakers make films (that and the money, of course). Yes, there are continuity glitches. Yes, the script has holes, but it doesn't matter. The movie itself is fun and smart. So don't be fooled by cynical people who always look for the bad things in life, because nothing is perfect, and this movie gets a 10 not because it is perfect. It gets 10 simply because it made me feel.","user":"IceMan-51","rank":[53,56]},{"title":"A Cute and Touching Animated Film From The Great Director Don Bluth.","rating":25,"date":"25 July 2001","review":"\"All Dogs Go to Heaven\" is a brillaint and cute animated film from the great director Don Bluth who directed the brillaint film \"The Secret of Nimh\". \"All dogs Go to Heaven\" is the one of cutest Metro-Goldwyn Mayer animated films. Don Bluth did a great job directing and I enjoyed the voices of Dom DeLueis and Burt Reynolds. This is a classic family film that is a Metro-Goldwyn Mayer Classic. I give this great film a 10 out of 10!!!!!!","user":"movies2u","rank":[20,21]},{"title":"Brings back memories","rating":10,"date":"9 April 2004","review":"All dogs go to Heaven is one of the best movies I've ever seen. I first saw it when I was like 3. Now I'm 12 and I rented it, it makes me think of things and it brings back so many memories, those were \"the days\". I love the music, I love when Charlie is arriving in Heaven, I love the song \"Let me be surprised\". I love how Charlie looks and his voice, Bert Reynolds could only play Charlie's voice this great. I love this movie, the 1st one is the best one because it's so original and great. It really does bring back memories that no one can describe, not even me. If only I could go back to those days. I love the characters. If this is the way the memories come back when I'm 12 imagine how I'll feel when I'm like 19, I hope I'll be able to watch this when I'm older. When I first seen this I never knew that I would really look back on it and feel this way , I hope it will be available to watch. I'm so happy that this movie was made and the amazing idea came to mind and heart. On a scale from 1-10 I'd give it a perfect 10. It's an amazing movie. It's so hard to explain the feeling, when I get older and if I have kids, I hope they can experience this feeling.","user":"laciefrazee","rank":[45,52]}]