[{"title":"Elementary slapstick","rating":5,"date":"22 March 2007","review":"Abbott: \"Miss McGillicuddy, you look charming today. Did you do something to your hair?\"<br><br>Costello: \"Yeah, she put it on her head\"!<br><br>\"Lost in Alaska\" does have some inspired moments, and most of them are in the first half, like the \"sleeping in 2-hour shifts\" routine, or Costello's response to a sign that says \"Use the axe only in case of fire\" (\"Got a match?\"). But when A&amp;C actually do get Lost in Alaska, the comedy gets largely reduced to elementary, childish slapstick (Costello falling down on the snow a lot, etc). I did laugh a couple of times, but overall the film is pretty tiresome, despite its short running time. (**)","user":"gridoon","rank":[7,7]},{"title":"A&C and the Sad Sack Sourdough","rating":4,"date":"17 September 2010","review":"The creative juices at Universal were grinding to a halt when Abbott and Costello made Lost In Alaska. The film is obviously taken from the classic Road To Utopia that Bing and Bob did at Paramount a few years back.<br><br>The Dottie Lamour role in this film went to Mitzi Green, but the boys aren't fighting over here. She's the squeeze of Tom Ewell a poor sad sack sourdough who wants to kill himself because she gave him in the air. Bud and Lou begin the film as volunteer firemen in San Francisco who save Ewell from drowning himself though Costello nearly goes down in the effort. Then they accompany Ewell to Alaska to maybe get a share of his gold if they can straighten his love life out.<br><br>Ewell's a popular guy in Skagway, everyone wants to see him dead because of his strike. Keeping him alive is a full time job for Bud and Lou.<br><br>The best routine in the film is Bud putting one over on Lou when they agree to take one hour shifts keeping tabs on Ewell. Bud sleeps for an hour then Lou wakes him, but Bud just puts the clock ahead an hour and then wakes Lou after about a few seconds. Poor Costello can't figure out why he's so drowsy. I wish the rest of the film were as good.<br><br>Universal no longer was being kept alive by Abbott&amp;Costello, their box office was assured by a crop of new leading men like Rock Hudson, Tony Curtis, and Jeff Chandler. The quality of their films declined in the Fifties and Lost In Alaska is an example of same.","user":"bkoganbing","rank":[5,5]},{"title":"Truth is, it's just poor fodder as their star begins to dim.","rating":5,"date":"4 March 2008","review":"Abbott and Costello's 50s offerings do nothing other than make you hanker for the halcyon days of the 40s where their best efforts are to be found. Sure there are a couple of decent films in the 50s such as Meet Jekyll/Hyde &amp; The Mummy, but in the main you sense the boys are tired, you sense that the once glowing genius is a shadow of its former self, we sense right because it's true, never more so proved than with this barely average piece.<br><br>There are a couple of decent scenes in here, and sure enough the pratfalling antics off Costello will raise a smile, but the writing doesn't give them much to work with, the co stars are suitably bored with the plot, and the biggest crime of all is that we don't get a remotely mirthful ending to save the picture.<br><br>5/10 out of loyalty to a couple of comic geniuses going thru the motions, oh and a crab that stole the film.","user":"hitchcockthelegend","rank":[9,11]}]