[{"title":"Underrated Bergman","rating":9,"date":"16 August 2002","review":"Bergman made this film in Germany, while in exile from Sweden for tax-related reasons. It's a dark and disturbing psychological portrait of a man, Peter, who murders a prostitute in the opening scene. The film moves back and forth in time, using title cards to establish the setting in time, trying to explain Peter's troubles. It's reminiscent of Scenes from a Marriage, as Peter has problems relating to his wife, Katarina. A few weeks before the murder, he started having fantasies and dreams about murdering her. The prologue, depicting the murder (or, more precisely, the moments before the murder) and the epilogue (Peter in prison) are filmed in color, but everything else is in black and white. The composition is generally not showy, but there is an amazingly filmed dream sequence, the film's centerpiece. The script is generally brilliant, very observant. The only thing I felt was a little underdeveloped was the homosexual character, Tim, and Peter's supposed latent homosexuality, which the psychoanalyst character describes near the end. I wasn't quite sure what to make of that material. 9/10.","user":"zetes","rank":[25,31]},{"title":"Peter's got this problem","rating":8,"date":"21 February 2004","review":"Bergman's working with a very restricted palette here, as he did with The Rite or Winter Light. The romantic, funny touches you expect from him are missing. Peter's mind is crumbling; he's a modern Othello obsessed with his wife's fidelity amid the tasteful furniture of their elegant home. All the action is seen through the distorting lens of Peter's madness. Why would his wife say, in front of strangers, that she has to get drunk to steady her nerves at her mother-in-law's place? This is the disturbed mind at work.<br><br>The acting is fine. Robert Atzorn and Walter Schmidinger do very well as, essentially, two sides of the same coin (the stodgy businessman and the gay fashion designer). Christina Buchegger is wonderful as Katharina, the wife; her attempts to win out over Peter's psychosis give the film what drama it has.","user":"bob998","rank":[11,14]},{"title":"Aus dem Leben der Marionetten: A Cornucopia of Pleasing Visuals","rating":9,"date":"8 January 2011","review":"Despite having seen the best part of Höstsonaten, Bergman's film immediately prior to Aus dem Leben der Marionetten, I never completed the viewing experience. Thus, this ranks itself as my very first Bergman, something I'd been rather looking forward to for quite some time.<br><br>Beginning with a surprising scene in which a well dressed man strangles a prostitute, Aus dem Leben der Marionetten follows this event up by examining the events before and after it, hopping through a time frame of two to three months. Through the conversations which precede and follow this catastrophe—as the film's intertitles elect to label it—we learn gradually more about the reasons and the people behind it.<br><br>I have a very deep proclivity toward non-English films playing late at night on television, particularly those in German—simply because I'm a student thereof. In the fleeting moments between realising such a film directed by the acclaimed Bergman—of whom I regrettably knew rather little—was about to grace my screen and its beginning, I was somewhat disenchanted to learn that this is not considered amongst his greatest. Nevertheless, I happily sat back to watch the potential magic unfold. The opening scene of murder is a strange one, the severity of the violence neither understood by its recipient or indeed by us; verily, it is suggested that not even the assailant understands what he is doing. Thereafter, an intriguing thing happens: the colour drains from the film, turning the previous rich reds to a dull monochrome. This effect is fascinating, inviting us to ruminate upon its purpose more than beginning in black and white would have done. The film follows this up with a non-chronological narrative progression, ducking from past to future—considering the murder the present, of course. Most of these scenes take the form of intimate conversations or extended monological musings, discussing in a vague manner many aspects of life. These are beautifully shot, a scene in which a homosexual man addressing the killer's wife slowly comes to regard himself in the mirror completely entrancing and surprisingly tender. Noteworthy too are the dream sequences—most rife in the film's middle section—dazzlingly bright and beautifully narrated. These exhibit a visual flair as inherently important to an understanding of the film as any dialogue. The film is both visually and thematically interesting, examining through both the factors that drive ordinary people to brutal actions. Somewhat of a recondite piece, it is the kind of film that lingers with you, returning to your mind a number of times after viewing. The performances, particularly that of Martin Benrath—in the role of the aforementioned gentleman—are nothing short of arresting.<br><br>Containing a cornucopia of pleasing visuals and highly effective metaphors—the importance of mirrors springs to mind—Aus dem Leben der Marionetten is a voluptuous treatise on life and love; repression and expression; individuality and relationships. Slow moving, but completely involving, if this is a lesser Bergman, I can't wait to see how he could improve upon it.","user":"imagiking","rank":[9,11]}]