[{"title":"the best","rating":10,"date":"19 January 2011","review":"As I wrote in Postava's review. Juracek decided to make more profound statement with this work,not a simple satire. The basic idea is that the time in the communist countries is going backwards. Peope are not granted the most basic rights e.g. the freedom of speech (yes, I know Juracek was allowed to make this film however it was rarely screened and after the year 1970,it was prohibited), because nobody owns anything (communism)people don't care about country and it is simply rotting away. Juracek studied all the civilizations in history who started to decline (Azteks).This was his main idea. (abodened factories, the commercial billboards are displayed as art in museums-Shell). And again as in Postava, nobody is responsible for anything. The people do not want to take responsibility, they rather want to be ruled by a monarch up in the sky.<br><br>He linked this with a personal experience of an individual. There is a dream house were you see your childhood, your first love, you are trapped perhaps in your subconsciousness. Many critics say that the film doesn't work all the time. It might be true (not for me though), however, it needs to be said, that Juracek was sick of the standard screenplay with the same dramatic patterns (he wrote many scripts just for money). So the things that some people consider to be flaws, are done on purpose. Everything is written to be open, the characters appear and disappear throughout the film, their episodes are very often not closed. It is his intention.","user":"vlanda","rank":[9,9]},{"title":"Swift hanging.","rating":7,"date":"21 November 2014","review":"With Christmas coming up,I started to look around for a Czech New- Wave (CNW) title that I could give a friend as a gift.Talking to a DVD seller,I was very happy to find out that he had recently tracked down a CNW title based on Gulliver's Travels,which led to me getting ready to witness a swift hanging.<br><br>The plot:<br><br>Watching his car roll down a hill, Lemuel Gulliver looks across the road,and notices a dead hare lying by the road,which along with having a watch, is also dressed in a human-style uniform.Picking up the watch,Gulliver takes a closer look at the hare,and spots a strange looking chapel near by.<br><br>Entering the chapel,Gulliver is met by the sight of his dead girlfriend Markéta.After having believed for years that Markéta had died,Gulliver begins searching round for her.Looking between the floorboards of the chapel,Gulliver discovers a group of people below.Falling to the group,Gulliver is told by the group that he has just landed on an island called Balnibarbi.Grabbing Gulliver,the residences begin to ask about his knowledge on an island called Laputa,which along with blocking the sun out,is also where Balnibarbi's king and government are based.Walking through a door, Gulliver goes to his doctor,to tell him about a strange dream,which began with him picking up a watch from a dead hare.Catching Gulliver completely by surprise,the doctor tells Gulliver that what he has experienced is not from a dream,but a doorway to a new reality.<br><br>View on the film:<br><br>Opening his last ever film (he would shortly spend the next few decades blacklisted,and die just before the fall of the Berlin Wall) with an apology to Jonathon Swift,writer/director Pavel Jurácek shows with his dazzling eye that he has nothing at all to apologise for his brave adaptation of Gulliver's Travels.Bouncing fantasy surrealism across the screen via giving the \"ghost\" of Markéta a flame like appearance and making buildings crumble across the screen, Jurácek and cinematographer Jan Kalis give the title a stark Film Noir atmosphere,thanks to Jurácek and Kalis using shadows as a backdrop to Gulliver's world.Along with the stylish use of shadows, Jurácek and Kalis give the worlds of Balnibarbi and Laputa contrasting appearances, with the residence of Laputa having large dining tables and elegant clothes,whilst the people on Balnibarbi are stuck in a nuclear wasteland,whose only hope comes from see Laputa up above.<br><br>Sliding smoothly across Swift,Lewis Carroll and Kafka,the screenplay by Jurácek smartly uses Gulliver's fantasy roots to deliver a harsh statement on the country's communist rule(which would lead to the film getting banned for decades),with Jurácek showing everyone on Balnibardi to hold a blindly-held idealise on their rulers in Laputa,who Jurácek shows are prepared to use any lies in order to give the people a false mythical image of their uncaring rulers.Along with the islanders fantasy, Jurácek also gives a strong suggestion that Gulliver's glimpses of Markéta are from a memory frozen in time,which has barely any connection to the romantically unsatisfying reality.<br><br>Whilst Pavel Jurácek packs the film with extremely intelligent,subtle criticism on the country's communist rule,Jurácek loosens his grip on the films fantasy elements,which leads to the movies plot feeling slightly disjointed,and not entirely built on even a basic foundation,as Gulliver sets off on his travels to make a case for a rookie hangman.","user":"morrison-dylan-fan","rank":[3,3]},{"title":"Lemuel Gulliver in Wonderland","rating":10,"date":"16 November 2014","review":"Case for a Rookie Hangman is a wondrous journey of Lemuel Gulliver to the lands of absurd. It's a brilliant adaptation of Jonathan Swift's classic in the form of postmodern comedy. \"Everyone knows how laborious the usual method is of attaining to arts and sciences; whereas by his contrivance, the most ignorant person at a reasonable charge, and with a little bodily labour, may write books in philosophy, poetry, politics, law, mathematics and theology, without the least assistance from genius or study. He then led me to the frame, about the sides whereof all his pupils stood in ranks. It was twenty foot square, placed in the middle of the room. The superficies was composed of several bits of wood, about the bigness of a die, but some larger than others. They were all linked together by slender wires. These bits of wood were covered on every square with papers pasted on them; and on these papers were written all the words of their language in their several moods, tenses, and declensions, but without any order. The professor then desired me to observe, for he was going to set his engine at work.\" Rejoice, Jonathan Swift was an inventor of a computer and the first programmer! The film is wittily hilarious.","user":"JustApt","rank":[2,2]}]