[{"title":"Round the houses the writers go.","rating":5,"date":"5 April 2014","review":"A film spin off from the hugely popular British situation comedy of the same name, it stars Richard O'Sullivan, Paula Wilcox, Sally Thomsett, Yootha Joyce and Brian Murphy. When a development company tries to buy all the houses in their street, flatmates Robin, Chrissy and Jo decide to help their landlords in staving off the buy out.<br><br>The material here is sadly too thin that it wastes what was always a damn fine cast. The sexy spark between Robin and the two girls is still there, and Mildred's (Joyce) sexual frustration with hubby George (Murphy) continues; with an interesting twist added a film's culmination, yet it's all very tired and short on laughs. You know you are trouble when you have to resort to a gastric stomach problem to hang your big laugh sequence on. Still, the cast are always watchable (I have been in love and lust with Wilcox since forever), while small appearances by Arthur Lowe and Spike Milligan are most welcome diversions from the poor screenplay. 5/10","user":"hitchcockthelegend","rank":[8,10]},{"title":"Flat","rating":6,"date":"22 April 2018","review":"I have always been a big fan of the TV series Man About the House, and have in recent years watched many episodes again on DVD. They are still funny, with many laugh out loud moments.<br><br>Well I have finally seen the movie version. <br><br>All the main cast and the semi regular Doug Fisher (Larry) appear. The chemistry between the characters largely remains, but the filmed format with muted colours, wider-framed shots and no studio audience, gives the film a less intimate feel. When compared to the original video of the series, much of the warmth and cosiness seems missing. <br><br>But the film's main problem is that the story is much too thin (much the same premise as the TV episode \"We Shall Not Be Moved\") for a feature film. There are no real sub-plots, just the one main story which occupies all the characters. Therefore there is much padding and repetition, and the jokes and situations are all drawn out, weakening their impact and slowing the pace of the film. With the meandering pace, none of the elements really work. The jokes, drawn out within the longer scenes of a feature film, mostly fall flat.<br><br>The film opens out the action, introducing some other residents of the row of houses, but these characters (the effeminate gay couple, the lusty nympho, the kept mistress) are such obvious stereotypes that they don't really work. Likewise the location shots like Larry's hazardous driving fail to add much.","user":"Rrrobert","rank":[3,3]},{"title":"Robin Tripp Vs. Captain Mainwaring","rating":3,"date":"29 July 2006","review":"One year after its launch, 'Man About The House' was filmed by Hammer. All the original cast were present and correct, and at least the characters stayed on home territory rather than flying off to Spain. But the 'opening out' of the format to encompass new characters such as the nymphomaniac Miss Bird ( Andrea Lawrence ) and the gay couple played by Michael Ward and Melvyn Hayes diluted the premise. The plot about the unscrupulous property developer was old hat even in 1974. The production designer seems not to have seen the show, as his sets don't resemble the television versions. The Ropers' sitting room is located on the left of the front door, not the right. The finale in the Thames Television building is silly and looks like an lame attempt to publicise the company's other shows. Nice cameo from Spike Milligan, though. The only redeeming features are Arthur Lowe as the tycoon and Peter Cellier as his slimy sidekick. Get a D.V.D. of the T.V. show instead.","user":"ShadeGrenade","rank":[10,15]}]