[{"title":"The Best Lookin' Street Machine on the West Coast!","rating":7,"date":"7 October 2002","review":"Yes, I grew up in the generation of original Star Wars fanatics. Yes, I only saw Corvette Summer because of Mark Hamill. Yes, it's a very cheesy &amp; kitschy film. On a lark, I recently picked it up on video at a supermarket for about $5. Having not seen it for many years, I gotta say, however, that it's a total riot! Without a doubt, this film is probably going to hold greater interest to those who either have fond memories of the 70s, or, at least, a passing interest in the decade when tacky was king. Those who have no understanding of the era will likely come away totally bewildered. Reasons you want? Well, please allow me...<br><br>1. I love Stingrays. Besides, it's great to see Hamill become obsessed about cars in a way only teenagers can (once girls enter the picture - for real - this love affair changes forever, as it does in the film).<br><br>\n2. As much as I share the love for Stingrays, I equally love 70s ideas of hipness. Hamill is given total freedom to build his \"dream car\" and what does he do? He cranks out a custom discomobile - a glitter vette that would make any purist cringe. Insane! Oh, and let's not forget Potts' customized van (with waterbed, natch). <br><br>3. Favorite moments:  a) Hamill briefly gets money &amp; therefore a HUGE head to go with it;  b) a guy who earlier attacks Hamill with a chain makes a hysterically insincere apology (\"hey man, I'm real sorry about that thing, you know, with the chain thing...I'm sorry about that.\");  c) Hamill kicks Danny Bonaduce's butt (and Cokes go flyin'!);   d) the leader to a convoy of Chicano low riders explains his notion of \"class\";  e) Bonaduce, again, goes for the 70s knockout punch with his limited, but memorable, dialogue (\"I know...let's do a dune buggy!!\" and, his personal best delivered over CB radio no less, \"Breaker, breaker, Shop Class One! Honk if you love Corvettes! This is the Top Hat in the Dragon Wagon. Dig it boys &amp; girls!\")<br><br>4. The great b-movie actor Dick Miller pops up with a two dollar bill (\"just call me Gladstone Duck!), as does a menacing Brion James. The film, therefore, can't be all THAT bad.  <br><br>5. Cornball aside, Potts and Hamill are extremely likable, have great chemistry together and do a lot with their stock character roles. For example, here's a twist: although Potts plays a hooker with a heart of gold (Yawn...), she's actually only a \"trainee\" with a heart of gold (Redemption!!). So she's can be kooky without being morally corrupt, and plays it with just the right amount of edge that makes it okay to like, and not pity, her (not that I condone hookers-in-training mind you). As for Hamill, we never question his loyalty to his car. Check out the glint in his eye when he talks shop with- who else? - his shop teacher, \"you're right. It IS perfect.\" <br><br>6. Even though there is plenty of unintended humor, which also adds to the fun, the movie IS actually pretty funny apart from that!","user":"billymac72","rank":[37,42]},{"title":"Summer Lovin","rating":7,"date":"26 February 2006","review":"I read several reviews about this movie before writing mine. I always do for some reason. The one common thread throughout a lot of the reviews is a point I definitely agree with. This movie oozes 70's cheese. Keep in mind, I happen to love the tackiness that only the 70's could offer.<br><br>Aside from that, this is a fairly simple, yet entertaining movie. Does it break any new ground? Certainly not. But how many movies do? Our main character, Kenny Dantley, builds and falls in love with a custom Corvette in his high school shop class. Not long after it is built the car is stolen. The cops tell Dantley and the rest of his shop class that the car most likely will never be recovered. Dantley refuses to accept this and heads to where he heard the car was last seen. Vegas. Along the way he falls in love with Vanessa, a wannabe hooker headed to Vegas to \"go pro\".<br><br>There is no doubt that this is a \"B\" grade drive in movie. That being said, if you are a \"car guy\" (as I am) this movie should prove to be worth watching. Anyone who has ever fallen in love with a car will understand Dantley's obsession. It's NOT \"just\" a car. Car guys know their obsessions are irrational, but that doesn't stop us. Call me crazy, but the attraction a car guy has to his favorite model isn't THAT much different than the one he feels to his dream girl.<br><br>Corvette Summer offers a few laughs and a return to a part of the 70's a lot would like to forget. The disco van scene. There are some familiar faces from the era and a great chase scene at the end of the movie. Not every movie is Oscar bound. Let's not forget a movies most important purpose is to entertain.","user":"Bandit1974","rank":[19,22]},{"title":"A Lost Drive-In Classic","rating":23,"date":"23 June 1999","review":"\"Corvette Summer\" might not be a perfect film, but it's a breezy, occasionally funny sleeper...the type of movie that used to pack them in at drive-ins all the time.  Today, there's the added value of seeing Mark \"Luke Skywalker\" Hamill and Annie \"Designing Women\" Potts in very early roles before they became big stars.  There's even an appearance by Danny (Partridge) Bonaduce.  Good summertime entertainment!","user":"G-Man-25","rank":[18,21]}]