[{"title":"Loved this movie as a child when I saw it in the theatre","rating":9,"date":"27 May 2004","review":"I had to beg my mom to take me to see it. Until then (in 1964), the only films I got to see in the theaters were Elvis movies and the occasional Rock Hudson/Doris Day flick. But I always had a penchant for films about space (some people say I have a head full of it). And this film represents much of what I like about a good space flick. Its all about the adventure of encountering truly daunting obstacles in the hostile environments we must face once we leave the sheltering atmosphere of mother earth. The struggle of an astronaut trying to keep his fragile human existence from being extinguished on a distant planet is the ultimate game of survival. And I think the first hour of this film, for its time, realistically tries to depict this. Probably the biggest risk the film takes is that for the first hour its a one man show, and actor Paul Mantee acquits himself well. (I remember all the talk about the movie Castaway , and how they were worried about Hanks on screen by himself for most of the movie...would people accept it? What a bunch of hooey!...if its a good story, of course they would). The second half turns into sort of a pulp sci-fi adventure , with Friday's arrival, and it does liven the film up a bit. Its almost as if you have two separate films....the fairly plausible, fight-for- survival first half, and the sci-fi fantasy second half. Somehow it still works. On repeated viewings, the things I admire most about the film (and what I think makes the film work so well) are the small touches that make the one-man show portion of the film work. The idea of having the unmanned, derelict mother ship periodically screaming across the martian night sky to haunt the astronaut is a master stroke. Not only is it a great taunt, since it has supplies but no fuel left to make a remote control landing. But it also serves as a great segue device between scenes, as are the imaginative aurora-borealis type lights that brings beauty to the nights of this hostile world. Its as if the filmmakers knew that the planet Mars had to be a costar in the film. Which brings me to probably the main reason the film has endured, and thats the brilliant cinematography by Oscar-winner Winton Hoch. A master of scenic shots (The Quiet Man, She Wore a Yellow Ribbon), Hoch makes a convincing martian landscape out of Death Valley. Almost every critique I've ever read of the film acknowledges the polished look of the martian scenes. Even recent, expensive films, like Red Planet, don't measure up (even though they may look closer to how the actual planet looks....ugly).....All in all, considering the paltry budget (just look at the old Destination Moon spacesuits used by the Alien slave masters), this is an intelligent space movie (and they are in short supply). Of course, to some extent, I realize that I still see this film through the eyes of the child I was, and I'm glad for that.","user":"jbrotychoorion","rank":[79,83]},{"title":"Easily rises above its flaws","rating":8,"date":"2 February 2005","review":"During an orbital exploratory mission to Mars, Commander Christopher Draper (Paul Mantee) and Colonel Dan McReady (Adam West) are forced to take evasive maneuvers to avoid a large meteor. They inadvertently put themselves in a position for Mars' gravitational pull to take over, and they're running out of fuel. Thus first Draper, then McReady eject. Draper finds himself alone, Robinson Crusoe style, and must figure out how to survive.<br><br>Director Byron Haskin and company spared no expense to make sure that all of the scientific elements of this film were accurate enough to function as a graduate level \"motion picture textbook\" for planetary sciences courses, and the special effects are so realistic that even Peter Jackson felt that his Lord of the Rings trilogy fell short of the technical wizardry on display here. Of course I'm joking. The truth is that while Robinson Crusoe on Mars is extremely cheesy in many respects, this is a very fun film, with a gripping, often-suspenseful story and a great sense of adventure. It rises above its flaws to merit an 8 out of 10 from me.<br><br>Actually, Robinson Crusoe on Mars is a great example of why science fiction is usually considered to belong to the genre umbrella of \"fantasy\" (and yes, that's even true of literary \"hard science fiction\"). Even though they often involve plot points based on technical aspects of the sciences--and believe it or not, this film is primarily focused on that--in their broader structures, the stories are usually fantasy tales, and reality is dispensed with as soon as either (1) it doesn't suit what the author considers to be a good story, (2) the author's scientific knowledge/research reaches its limit, or (3) the author engages in speculation (which is fundamental to the genre).<br><br>Despite scriptwriters John C. Higgins and Ib Melchior frequently engaging in (1) (and very likely (2) plus an added departure point for films--budgetary limitations), the suspense in the first half of the film is propelled by Draper's need for oxygen, water and food. These are basic concerns that many other \"shipwrecked on a planet\" films often bypass through some kind of deus ex machine. In Robinson Crusoe on Mars, they never stop being central to the plot. Admittedly, if every film merely dwelled on those issues, we'd quickly grow tired of it, but it works extremely well here.<br><br>Even more remarkable, for the majority of the film, Robinson Crusoe on Mars is a one-man show. Mantee must hold the audience's interest on his own for a good 70 or 80 minutes. He does so easily. He brings just the right mixture of tough-guy ingenuity and vulnerability to the part.<br><br>Of course, part of the enjoyment of watching the film at this point in time is that much of it is unintentionally funny. There are some strange editorial corrections, such as the overdubbed \"15 Days\" when Draper is making an accounting of his supplies. We are treated to ridiculously bad spaceship animation. There are odd floating fireballs when Draper first touches down. There isn't much effort in many shots to keep the settings looking like Mars. There is one scene with Ed Wood-style changes back and forth from night to day. And so on.<br><br>On the other hand, if we look at the film as residing more in a realm of surrealism, elements such as the floating fireballs are actually pretty cool, and much of the cinematography and settings are excellent. The exteriors were primarily shot in Death Valley National Park, and it is beautifully captivating here. Also, some of the attempts to make the exteriors look more Mars like are actually gorgeous. We get purple and blue rockscapes against smoky skies, and we often see nice nods to classic sci-fi illustrators such as Frank R. Paul (whose work often graced the covers of fiction magazines like Amazing Stories) in features such as bright red skies. Haskin also has a few moments of effective ingenuity, such as a crucial plot point appearing as video that Draper took and watched later. Plus, some of the film is intentionally funny--my favorite instance being the line, \"Mr. Echo, go to hell!\" <br><br>The biggest flaw in my eyes is that the ending seems a bit rushed. A lot happens in the last ten minutes or so of the film, without the suspense it could have had with a longer running time. Despite the flaws, however, this is worth a watch by serious fans of classic sci-fi, and it's interesting to note influences films like this have had on later-generation works in the same vein, such as Red Planet (2000).","user":"BrandtSponseller","rank":[65,74]},{"title":"Classic Science Fiction at its best","rating":30,"date":"30 January 2004","review":"There's not much more I can add to all the other positive comments made on this film other than to say that I agree with just about all of them.<br><br>This movie is a classic example of how good science fiction can be created from classic story material. The premise of a man trying to survive in unfamiliar surroundings is set on the then unfamiliar planet of Mars. USAF astronaut Paul Mantee goes through the rigors of trying to survive on an alien landscape, and is befriended by an escaped slave from an advanced, and hostile, civilization. The story isn't about war, \"beating the bad aliens\" or other story tripe that's so pervasive in today's science fiction films. The film is about friendship, trust, self sacrifice, and the willingness to help one's fellow man (or human like alien) survive in an inhospitable world.<br><br>Compared to other science fiction of the time, and even compared to contemporary sci-fi offerings, the acting and overall production values are top notch. The film is dated, so the viewer is advised to give it some leeway if he or she has never seen it before, but a strong story and presentation will keep your attention.<br><br>It's been a long time since I've seen this film, so perhaps I'm remembering it from a biased memory, but using that same memory to call up other films I saw back then I can truly say this one ranks up there with other good cinematic offerings; science fiction and non alike. The effects are passing, the backgrounds artificial at times (as was typical of 50's and 60's Hollywood), and the props are passable, but the acting, particularly how the friendship develops between the two leads, is what I'll always remember. The story is far fetched, but the actors pull it off by presenting sympathetic characters.<br><br>I for one am glad this has never been remade. I can see some snot-nosed hot-shot, low-I.Q. producer marketing a remake with lots of action, a pumped up soundtrack, action figures and a host of other spinoffs. To boot he'd probably cast some rap star in both lead roles, show the aliens with a ton of prosthetic makeup, and otherwise squeeze every last ounce of marketable dollar out of the thing.<br><br>We don't need a remake. We need a DVD release. The good kind with lots of extra goodies :-)<br><br>If you like sci-fi, heck if you just like good movies period, do yourself a favor and catch \"Robinson Crusoe on Mars.\"","user":"Blueghost","rank":[69,79]}]