[{"title":"Technicolor Psyche of a Woman at a Loss for Love","rating":9,"date":"15 May 2000","review":"I was 15 years old when I stumbled into a cinema and caught my first Fellini film -- Juliet of the Spirits.  I was so jazzed, wowed and bedazzled by it, I'm sure I went back a few more times.  It led me to other Fellini films and, since, he's become my favorite film director.<br><br>Though at age 15, I shouldn't have been able to relate very well with this story of an Italian middle-aged woman and her crumbling psyche (what with her failing marriage, her unsympathetic relatives and her repressive childhood), the movie made me care about this woman and showed me sights on film that I'd never seen before.<br><br>Masina (Fellini's wife), in her performance, has nearly everything to do with making Juliet's story meaningful, even to a teenaged boy in California. The character's thoughts flash, unspoken, across her face.  Her fear, her<br><br>bemusement, her insecurities--all are writ in italics and I had no trouble empathizing with Juliet.<br><br>Fellini, though, makes the film an occasion to witness how far the medium can go in bringing alive a person's inner life.  The weird and awful power of (subjective) memory, the dream state, the spectres of loneliness, betrayal and Catholic mythology:  all these and more overtake the screen, dominate the imagery and play the antagonists to Juliet who, as seen by the other \"real\" characters in the story, is just a simple, loving housewife and neighbor.  Juliet finally has to face her demons and either vanquish them or go mad.  By the end of the film, we know most of her demons, where they came from, whom they represent and what they mean.  What an accomplishment!<br><br>In a clinical setting, Fellini dropped LSD around the time he concocted this film.  That may be one reason the movie is so psychedelic.  This also was his first feature in color.  The music is unforgettable.  Costumes should have won the Oscar, but that honor went to \"Man for all Seasons\".<br><br>Incidentally, I've bought and viewed the DVD of this movie.  It's quite washed-out and not as good as an available VHS letterboxed version.<br><br>I'll always miss Fellini, but am so grateful that he was able to make this film and over a dozen others.","user":"cineaste-4","rank":[41,48]},{"title":"Unique to the medium","rating":8,"date":"6 April 2005","review":"This film by Fellini is basically the female version of 8 1/2. Instead of delving into the mind of a middle-aged Italian man dealing with problems with his wife and trying to figure out who he really is, it is about a middle-aged Italian woman dealing with problems with her cheating husband and trying to figure out who she really is. (I still can't decide who I like more as a lead in a Fellini film... Masina or Mastroianni.) The film is very enjoyable, and is definitely one of the films I would classify as a work of art. The one thing that really stands out to me, however, is this: It could only exist as a film. Most films are adapted from previously written novels, or at the very least can suffer the indignation of a \"novelization\" without losing the quality of the story. But I cannot fathom any way a writer could capture this film with words. It is very visual, but could not be painted or drawn either. I think this is one of the few films I've seen that is completely unique to the medium of film. Towards the end of the film, there is a scene where she is trying to avoid voices and images around her while hosting a party. It was at this point that I realized how perfectly every shot was set-up, and that there would be no way anyone could capture the feeling or the images with words.<br><br>I would be extremely fascinated to see what the shooting script to this film looked like. It's the fifth Fellini film I've seen, and I must say, I think I can call him my favorite director. He's the only director whom I've been enthralled by every single film I've seen of his. He has a perfect record, 1.000% batting average so far with me. I'm going to keep seeing more, and hopefully I won't ever be disappointed.","user":"CitizenDain","rank":[40,48]},{"title":"Fellini's deepest dreams","rating":10,"date":"17 January 2000","review":"Juliet of the Spirits has become one of my favorite Fellini films.  The story involves a woman who discovers that her husband is cheating on her. The forces of family, tradition, the church, and an immoral society all pull at her and force her to make a difficult decision.  These forces would be banal in a standard film but Fellini chooses to visualize them as images and dreams.  The dream sequences are nearly perfect and create a sharp sense of the hazy logic and unreality of dreams.  Other comments (as well as our friend Maltin) have noted that the symbolic nature of the film is a detriment.  This is true only if you are constrained by reality and demand that film adhere to the rules you have set down (or more likely had set down for you).  Taking the journey with this film is well worth the time and effort.  I hesitate to state that a male director has successfully penetrated the inner desires of a woman, but in this case I think Fellini has at least come close to the mark.  A film to be looked at, talked about, and enjoyed again and again.","user":"Dr.Mike","rank":[35,42]}]