[{"title":"Absolutely Priceless","rating":23,"date":"23 April 2004","review":"(Contains SPOILERS) I wish Stan &amp; Ollie could've lived to see how much their work is appreciated, even after all these years. I watched \"Towed In A Hole\" today with a Russian friend who'd (amazingly) never heard of L&amp;H - and she laughed her head off! The plot of this episode is devilishly simple, yet brilliantly executed as only Laurel &amp; Hardy could do it. They have a small (very small) business selling fish, until Stan suggests they could double their profits by catching the fish they sell. All they need to do is buy an old boat and 'do it up'. I guess anyone even vaguely familiar with the genius of Stan and Ollie can guess what happens :) There are 2 specific scenes which are SO outstanding they carry Towed In A Hole into the premier league of Laurel &amp; Hardy's output. The first is Oliver Hardy singing a public commercial for their 'business' in the old \"negro spiritual\" style. The second (and this is one of the finest things they ever did) involves Stan locked in the boat's cabin and trapping his head between the bottom of the mast and the hull. In panic he grabs a saw and starts sawing through it. meanwhile, Ollie is on a ladder at the top of the mast painting it. Hardy hears the sawing and his 'puzzled' expression, just before the inevitable \" Oh-Ooohh-CRASH!\" is the essence of what has made them icons of comedy for 3/4 of a century. Wonderful!","user":"RussianPantyHog","rank":[11,12]},{"title":"Very funny short  a favourite of mine","rating":8,"date":"8 July 2003","review":"Laurel and Hardy are travelling fishmongers, selling door to door on the street.  Laurel has the idea to cut out the middle man and catch the fish themselves  hence turning pure profit on every fish they sell.  They buy an old boat and begin to do it up  with predictable consequences.<br><br>From the opening conversation where Hardy asks Laurel to repeat his sensible and good idea and Laurel proceeds to muddle himself (`if we catch the fish, the people wouldn't have to pay and.') I was sold on this short film.  The action follows this banter with a fantastic mix of physical humour and the good old double take stuff they do so well.  Here the two (styles) really compliment each other  the highlight being when Laurel causes Hardy to become covered in paint and there is an eternity of looks, double takes and pauses before he asks `why did you put that stuff on your face'!<br><br>The stuff around the boat is all good and both men do really good work with their looks and their bodies.  Hardy shows his class while leaning on the mast of the boat, hears sawing, looks to camera, looks down towards the sound, looks to camera then goes!<br><br>Overall this short has everything in it that I love about Laurel and Hardy and should be immediately seen by anyone who is wondering what all the fuss is about!","user":"bob the moo","rank":[9,11]},{"title":"Silly but also very funny","rating":4,"date":"4 August 1999","review":"This is probably my all time fav. L&amp;H short. right from the start with the call of 'Fresh Fish' (toot), this is a 'hoot'. As always, Stan has an idea this time expressed as only Stan can. 'If we had a boat .....'. The bit that makes me howl is when Olly is painting the rudder and Stan is scrubbing the deck and finds the tiller in the way. The pause before 'what did you put that stuff on your face for' is agony!. As for Stan's method of getting his head out from behind the mast... See this one now.","user":"dwf","rank":[8,10]}]