[{"title":"I could've sworn I'd seen every bad, goofy comedy made....","rating":6,"date":"31 October 2000","review":"But this morning it was on cable and I was amazed how something this silly got past me.  Sure, if you watch it, don't expect any academy award nods... I think the makers of this film were looking to follow in the footsteps of airplane and other goofball flicks.  Every paradox for every situation was used in this.  And that's not bad...  Every once in a while we need these no brainers to make us watch like zombies, just so we can say \"Man this movie is so stupid, I can't wait to see what happens next\".  Remember, the 80's killed at flooding us with bad movies that we've seen 30 times (even if we don't admit it publicly).","user":"adle0103","rank":[13,15]},{"title":"Relentlessly silly comic horror","rating":6,"date":"2 May 2001","review":"Aiming at a blend of Airplane! style wackiness and Mel Brooks-a-like angsty spoof, this is almost good - the occasional inspired moment (Werewolf Annoys Community) keeps you watching through the massive swathes of so-so gags, occasional clunkers and habitual dragging out of jokes way beyond their peak. Part so-bad-it's-good, part nearly quite good, and with a typically intense, shouty performance from ace Alan Arkin, this just about scrapes into the Watchable category. Probably a gem to obscure B-horror fans.","user":"thehumanduvet","rank":[8,9]},{"title":"This Is The Funniest Movie I Have Ever Seen!!","rating":9,"date":"13 June 2005","review":"I'm not kidding about that summary and vote! The video distributors have packaged this as just another typical '80s werewolf movie, but it is in fact the greatest parody of the horror genre that you can imagine, having done for the horror movie what \"Blazing Saddles\" did for the western. I have seen plenty of comedies - good, bad, stupid, weird, etc. (usually walking away unimpressed), and I think that comedy must be the most difficult genre for filmmakers and actors to work in - it takes just the right kind of touch to make things successful, and part of that is having good ideas. \"Full Moon High\" is bulging with good ideas - so many, in fact, that it can easily put the Zucker/Abrams team of \"Airplane\" and \"Naked Gun\" to shame. One of the best of these is the very presence of Ed McMahon in a starring role as a John Birch-style right-wing crackpot. The jokes, non-sequiturs, wisecracks and word-play are literally non-stop and everything, including the kitchen sink, has been thrown in. The ironic tone is very similar to that of \"Back to the Future.\" <br><br>Some people (i.e. almost every reviewer here) must have been turned off by the spirit of anarchy here, but I almost died of laughter, and this is one of those movies in which you never know what kind of insane situation will transpire next. Since B-movie extraordinaire Larry Cohen had not made a straight comedy before this, one gets the sense that he was making up for lost time by including any joke he or his collaborators could think of. If Mel Brooks had made this, the critics would have labelled it a comic masterpiece, but because it was made by Cohen, it has been dismissed as schlock. Critical reviews have called this movie too \"silly.\" SILLY? What is a comedy supposed to be - serious?! Anyway, I laughed out loud more for this movie than any other I can think of. Cohen makes fun of everyone - himself included, with plenty of references to his usual brand of low-rent film-making; he and the actors must have had a complete blast making this.<br><br>The humor is very Mel Brooks-ish, and anyone who loves Jewish humor or watches a lot of B-movies (especially horror) will love this. Trust me: the movie isn't too hard to find, and as long as you accept it for what it is - a roller-coaster of belly laughs with no pretense of social value whatsoever - then you'll truly enjoy it!!<br><br>One sidenote: this movie should somehow go down in history as the one thing Bob Saget ever starred in (albeit briefly) that was actually funny.","user":"Sturgeon54","rank":[17,23]}]