[{"title":"The Film that Put \"Down Under\" on Top (10/10)","rating":10,"date":"17 September 2002","review":"One of the great things about movies is that every once in awhile the unexpected happens, something comes along that you know immediately is just a bit different and special somehow.  Usually it's the film itself, but on occasion-- and this is one of them-- a character will emerge who is not just a character in a movie, but IS the movie.  Here, it's the title character of `Crocodile Dundee,' directed by Peter Faiman, and starring Paul Hogan as the inimitable Mick Dundee, a rather unique individual hailing from the small hamlet of Walkabout Creek, Australia.  Mick hit the big screen in 1986, and from the first moment he appeared, right up through the end of the second sequel, it's been a `G'day' for audiences around the world.<br><br>In Australia on assignment for her New York newspaper, journalist Sue Charlton (Linda Kozlowski) runs across a story she just has to pursue.  It's about a legendary `local' from one of the small towns on the cusp of the bush, a crocodile hunter who, the story goes, had his leg bitten off by a croc, then managed to survive by crawling, alone, for days on end across the outback.  So it's off to the town of Walkabout Creek in search of this larger-than-life character, who it turns out is quite a `character' to say the least.  He is, in fact, one of a kind.  <br><br>After a memorable meeting in the town's only pub (one of about four buildings in the whole place), Michael J. `Mick' Dundee agrees to take her on a tour retracing his steps and reconstructing the famous event where it actually took place.  He promises a hard journey through some rugged terrain-- no place, in fact, for a `Sheila'-- but, like any good reporter, she's ready for anything; or so she thinks.  And it's the beginning of an adventure she, as well as the audience, will never forget.<br><br>Hogan concocted the story and created the character, then wrote the screenplay along with John Cornell and Ken Shadie, after which he turned it over to director Faiman, who did a worthy, if not exceptional, job of translating Hogan's vision to the screen.  Faiman, however, is destined to be the forgotten man with regards to this project, inasmuch as he was not only necessarily overshadowed by writer/star Hogan, but he presented the film in a fairly straightforward manner, without anything particularly noteworthy that `he' did that would put his `signature' on it.  Add to that the fact that this was the first of only two films Faiman ever directed (his second was the lackluster `Dutch' in 1991); simply not enough to reference him, nothing added to his resume afterwards to make you take notice and say, `Oh, yes, he directed Dundee,' too.'  Still, filmmaking is inherently a collaborative medium, and as they say, a film does not `direct' itself; so credit must be given where it is due, and considering how good this film is, and how well it did at the box office, it points up that whatever Faiman did, he did right.  And he deserves to be acknowledged for it.<br><br>It's no secret, of course, what really makes this film work.  Aside from the engaging story with it's romantic notions of adventure, from beginning to end it has the four `Big Cs' going for it:  Character, Charisma, Chemistry and Charm.  Let's face it, Paul Hogan is `The Man' as Mick Dundee; he's the guy other guys admire and want to be (whether or not they'll admit to it), and he has the kind of natural good looks, charisma and charm that is irresistible to the ladies (whether or not they'll admit to it).  And the chemistry between Hogan and Kozlowski is irrefutable; it's the kind that makes you want to put another shrimp on the barbie.  Besides all of which there is an innate honesty about Hogan's Mick that shines through like a 1st order Fresnel light in a London fog.  He's laid-back and grounded, with a refreshingly logical outlook on life-- this guy's never going to need a pill for hypertension-- and what adds even more to his appeal is that there's a touch of larceny in his make-up, hiding just beneath that twinkle in his eye and his obvious integrity.  You also know instinctively that this is the guy you want in your corner when the chips are down.  All of this and more is what Paul Hogan captures in his performance; this is the Mick `Crocodile' Dundee he brings to the screen.<br><br>In her motion picture debut, the lovely Linda Kozlowski brings some sizzle to the screen and proves to be the perfect counterpoint to co-star Hogan. Something of an `Ibsenesque' role model, she demonstrates that a woman can be strong and ultra feminine, capable yet vulnerable, and all at the same time.  It makes her portrayal of Sue Charlton convincing, well rounded and real; much more than just a cardboard cutout kind of a character that could have been used as nothing more than a vehicle to move the story along. Instead, though this is without question Mick Dundee's story, she makes it her story, too, and it gives the film an added perspective and considerably more depth than what is usually found in light comedy, which is essentially what this film is.  And there's a look in her eye and something in the way she smiles at Mick that has an absolute ring of truth to it.  You could say, in fact, that Hogan and Kozlowski are the Bogie and Bacall of the outback.<br><br>Another invaluable asset to the film is the performance of the likable John Meillon as Mick's friend, Walter Reilly.  The part is a true character actor's character, and Meillon does it beautifully.  The supporting cast includes Mark Blum (Richard), Michael Lombard (Sam), Steve Rackman (Donk) and Reginald VelJohnson (Gus).  A memorable film filled with unforgettable characters, `Crocodile Dundee' will take you to the top o'the world... `down under.'  10/10.","user":"jhclues","rank":[75,86]},{"title":"The Naive Crocodile Dundee Comes To New York","rating":24,"date":"24 June 2002","review":"Crocodile Dundee is a great comedy from 1986 which can be enjoyed after repeat viewings. Over the years I've heard a lot of criticism of this film and I cannot understand it. If you don't like this film, then something must be wrong.<br><br>It's great to see the tough but naive Crocodile Dundee-played excellently by Paul Hogan-come to New York and after a sequence of events meet up with journalist Sue Charlton played by Linda Koslowski. Koslowski and Hogan made a great team in this film.<br><br>Like all comedies I won't spoil the scenes for anyone who hasn't seen the film but there are some great scenes particularly one where two youngsters try to mug Dundee with a knife. You'll laugh at what happens next.<br><br>All in all, a great comedy. Ignore any criticism you've heard of this film and enjoy a great film.","user":"Big Movie Fan","rank":[68,80]},{"title":"A gem from the Eighties.","rating":9,"date":"9 August 2002","review":"Paul Hogan's original tailor-made 'fish out of water' flick became a massive hit in 1986 and still remains a warm, amusing and irresistibly enjoyable. In terms of plot, its simpler than simple - American reporter Linda Kozlowski is sent to Australia to investigate the legendary 'Crocodile' Dundee (Hogan) and ends up bringing the charming rogue back to the Big Apple.  It's a winner in every sense from Hogan's wonderfully laid-back performance to his own screenplay, featuring an array of classic quips and moments.  Peter Best's excellent musical score also deserves applause in helping to ensure that this film remains great, exciting and still novel entertainment almost two decades on.","user":"lawrence-14","rank":[42,48]}]