[{"title":"The Expropriated Consciousness","rating":10,"date":"10 April 2008","review":"\"Martha\" is part of a series of movies by Rainer Werner Fassbinder, in which he treated different kinds of decrease of mind. In \"Merchant of the four seasons\" (1972), Fassbinder portrayed the former police officer Hans Epp whose carrier is ruined by a prostitute, whose girl-friend is unreachable for him and whose wife shows no affection to him. After a long time in depression, interrupted by alcohol, he decides to kill himself. In \"Martha\" (1975), a young woman, hardly released out of the hands of her passed away father, marries a brutal and psychopathic engineer who isolates her from her family, forces her to quit her job, imprisons her in their apartment, cuts down the telephone connection and controls her money. He seems to have reached his goal when Martha, after trying to escape with one of her coworkers, has an accident that paralyzes her, letting her in a wheelchair. In \"Fear of Fear\" (1975), housewife Margot, pregnant with her second child, starts to suffer from hallucinations while neither her husband nor her mother- and sister-in-law are willing to listen to her. After a physician prescribes her Valium, she increases the dose. When she cannot get enough anymore, she helps herself with alcohol. After having been \"healed\" in a psychiatric clinic, from which she is released under the promise to take regularly her medication, she is typing addresses on envelopes, pretending to be happy.<br><br>All of these movies by Fassbinder to which also belong, for instance, \"Why does Herr R. run amok\" (1970), \"In a year with 13 moons\" (1978), \"Despair\" (1978), \"Veronika Voss\" (1982) and certain episodes of \"Berlin Alexanderplatz\" (1980), have in common that what turns a human insane is, according to Fassbinder, basically the society in which he or she lives. Neither Hans Epp, nor Martha nor Margot have an emotional support from their family. Let alone by their closest relatives, these individuals are inclined to make false decisions, that lead to decrease of mind and often to suicide. Although Fassbinder repeatedly pretended not to be an intellectual, it is important to point out that we know from the several interviews he gave as well as from his theoretic studies that he was well familiar with the works of the Frankfurt School around Adorno, Horkheimer and Habermas as well as with the psychiatry of Lacan. Therefore, I ask everybody who watches \"Martha\" to have a close look at the book she is reading in the scene where she sits on the balcony of the hotel in which she stays during her honeymoon. The title of this book is \"Das enteignete Bewusstsein\", written by Hans Kilian, a sociologists from the Frankfurt School, and appeared in 1971. It turns out that the \"expropriated consciousness\"  a process committed in society - is the real reason that is responsible for the decline of Hans Epp, Martha, Margot, Peter, Herr R., Erwin/Elvira, Hermann Hermann, Veronika Voss, Hans Biberkopf and many others whose fate has not been subject of any film.","user":"hasosch","rank":[20,22]},{"title":"no use for tears, darling","rating":5,"date":"5 May 2007","review":"Martha is disturbing yet very interesting. It's a psychological drama portraying a complex sadomasochistic relationship in which a man, Helmut (Karlheinz Böhm) slowly destroys his wife Martha (Margit Carstensen). There's no background music to underline the emotions of the characters and the camera concentrates on the people (the landscape - be it beach, sky, land, house - remains in the faraway background). As Helmut slowly shuts his wife out of the world outside, so as to have her solely for his own use, the claustrophobic feeling of the film grows in such a way as to become unbearable. There'a moment in which Martha realizes dimly what is being done to her, and there's the last flight to freedom, doomed to failure.<br><br>\"Martha\" doesn't explain everything - it gives hints and is open to interpretations. Many questions remain unanswered. I've surprised myself thinking about the film (Martha, oh why?) days after having seen it.<br><br>The interpretations are excellent (especially Margit Carstensen as Martha). This is not a comfortable film to watch but it's a memorable study of human relationships.","user":"andrabem","rank":[9,9]},{"title":"a study about how to make someone dependent (exaggerated)","rating":24,"date":"24 November 2002","review":"Two days ago I have seen this movie. Lead actor Karlheinz Boehm and famous filmmaker Volker Schloendorff were present in the audience, and then discussed it after the screening. This was part of (or spontaneously turned into) a fund-raising effort for the humanitarian organization that K.H. Boehm founded.<br><br>Boehm said that Fassbinder was an expert or at least naturally gifted in judging people. In the discussion it was also mentioned that in his theater group at that time he had also built a network of dependencies. Boehm was very impressed by a quote from Fassbinder, saying approximately: In general you have to exaggerate something to unleash the full power and achieve maximum artistic effect, however it is important to do it correctly (do not exaggerate too much). Here this principle has been applied to demonstrate the (one-sided) struggle for power and dominance in a marriage. At the beginning the husband is very male, that is outspoken, direct, almost blunt. Martha seems to be in love for quite a while. Later, the requests of the dominant, violent husband become increasingly over the top, so that watching the sadist makes you feel uneasy. The same holds for Marthas friends and relatives which are unable to help or, with the exception of Herr Kaiser, even realize the truth about Marthas personality being gradually ruined. This is criticism of an emotionally degraded society.<br><br>However, from a aesthetic standpoint, camera and light are marvelous. The set locations (typical for wealthy people) have also been carefully selected and are amazing in their false, pompous colorfulness. In places, there is also quite a bit of black humor mixed in, and at the beginning it seemed like a mystery story (the black guy chasing Martha)or a love story.<br><br>Aside from that , the movie also reminded me of a 1950s Bergman marriage movie. Worth seeing.","user":"knb","rank":[16,18]}]