[{"title":"Bleak, tear-stained turn-of-the-century drama focusing on the hard knocks of tenement living offset by brilliant direction and radiant performances; an absolute must.","rating":10,"date":"10 November 2001","review":"All one needs to view this 1945 near-masterpiece is an appreciation for brilliant film-making.  I assure you, you will lose yourself completely in the story of the Nolan family, a humble, impoverished Irish-American family holding on by mere threads in 1900 New York.  Director Elia Kazan's first film experience is often overlooked by his magnificent cinematic efforts in years to come (`A Streetcar Named Desire' and `East of Eden'), which is hardly fair.  So much heart has gone into this emotional piece of Americana - notably its flawless attention to detail and its ultra-sensitive, Oscar-nominated screenplay -- that it deserves equal attention.  Superb in every aspect.<br><br>`A Tree Grows in Brooklyn,' from Betty Smith's poignant novel, is able to capture the essence of the author's words not only because of its trenchant<br><br>writing, but because of three remarkable, beautifully-realized performances. Peggy Ann Garner offers one of the most astonishing child performances ever, finding the very spirit of this 12-year-old child going on 21. Blessed with one of the most expressive faces witnessed on camera, her eyes are sheer poetry and alone speak volumes as Francie, a young girl devoted to her ailing, debilitating father and brutally distant from an unnurturing mother she partially blames.  It is such a complete performance.  Her steadfast growth in this film is beautiful to observe as she begins to spread her branches and assume her rightful place in life sooner than expected. Garner is simply unforgettable.<br><br>James Dunn, as Jimmy Nolan, leaves an indelible impression as the amiably charming ne'er-do-well, a solitary dreamer who has frittered his life away, as well as his family's money.  Despite the cruelties of his actions, your heart aches for this man.  His touching scenes with daughter Francie reveal his innate goodness and its heart-wrenching to watch him dissolve before your very eyes.  Even a treasured bond with his idolizing daughter isn't enough for him to fight hard enough to forego the liquor bottle and regain his place at the head of the table.  It is an unbearably sad decline, one that haunts you long after the picture is over.  Both Dunn and little Peggy Ann would never find movie roles like these again, and earned well-deserved Oscars (Peggy actually copped a 'special juvenile' award) for their work here.<br><br>In an exceptionally careful and astute performance, Dorothy McGuire plays the necessary heavy here, the taciturn, seemingly cold-hearted matriarch Katie Nolan, who is also this family's hope and salvation.  Unable to trust her husband or afford him the time and patience he desperately needs, she has ultimately abandoned her love for him out of necessity, what with two children and a third on the way, and no viable means to support them.  Ms. McGuire, in a career best performance, serves up a somber, beautifully restrained portrait of a flawed, modest, uneducated, somewhat ignoble woman handling life the only way she knows how, and expecting little in return. McGuire, who was only 27 at the time this was filmed, easily nixes any comments that she is too young for the part by displaying a strong, careworn maturity well beyond her years.<br><br>Joan Blondell, as only Joan Blondell can, puts some oomph in the drab and dreary proceedings as Katie's gregarious sister, Sissy, who juggles husbands in her ever search for the right man, and earns the scorn of the town in her reckless, law-breaking pursuit.  Blondell manages to give the film a breath of fresh air everytime she appears, though her character's development is choppy in its transition.  Her story, unfortunately, gets lost midway and never truly kicks back in.  Little Ted Donaldson as younger brother Neeley contributes fine work also, but is another victim of the primary focus the film decides to takes -- Garner's Francie is rightfully the heart and soul of the piece and she is quite up to the task.<br><br>Despite being robbed of a best picture that year (I mean, really, \"Anchors Aweigh\" and \"Mildred Pierce\" were nominated over it??) and the fact that Ms. McGuire was overlooked completely, it is slowly earning the attention it deserves.  It should be in the top \"20\" of anybody's movie lists.  For me, this movie is most effective come the yuletide season.  It is that touching and meaningful.<br><br>The 1974 TV-remake of \"A Tree Grows in Brooklyn\" starring Cliff Robertson and Diane Baker is a mere sapling compared to this giant oak of a film.","user":"gbrumburgh-1","rank":[119,125]},{"title":"Brooklyn -- the way it was","rating":10,"date":"3 September 2001","review":"What a magnificent motion picture!  Dorothy McGuire and Peggy Ann Garner give the greatest mother-daughter performances of all time.  Betty Smith's book is a classic, and this film somehow manages to do it perfect justice in the first movie ever directed by Elia Kazan. <br><br>In many ways I feel privileged to be able to comment here because I may be the only \"reviewer\" in these pages to have been in Brooklyn very close to the time of this film (I was born in 1909).  The film recaptures the feel, the mores, the neighborhood so magnificently, it is incredible.  Every time I watch this movie, I feel as if I am revisiting my youth, albeit an idealized version.  <br><br>Everyone who watches this movie should share it with the next generation of moviegoers.  It truly is timeless.","user":"the_old_roman","rank":[62,65]},{"title":"Did not expect to be so moved by this movie","rating":9,"date":"13 March 2002","review":"I watched this movie for the first time on TNT last night and was totally blown away.  Peggy Ann Garner who plays Francie is a brilliant actress...and at such an early age.  I remember we had to read the book in school in the 1960's (!) but I never saw the movie until now.  The characters were so convincing, I was transported to Brooklyn, circa early 1900's and never left for 2 hours and 20 minutes.  I went to bed thinking about this movie and woke up this morning with it's after affect still lingering in my mind.  A \"must see\" for everyone of all ages.  This one's a gem.","user":"Scarlett O","rank":[67,71]}]