[{"title":"\"They may have gotten your legs, but they sure didn't get your balls\"","rating":5,"date":"10 May 2015","review":"At around the same time that Jean-Claude Van Damme was releasing LIONHEART, another European martial artist threw his hat into the ring of American action flicks. His name was Olivier Gruner, and his debut vehicle was ANGEL TOWN here. Though Gruner would be less content than many of his fellow action heroes with a simple \"karate man\" image and would quickly branch out to science fiction flicks, his debut film was a relatively typical martial arts flick, albeit with a surprising (but one-sided) emphasis on the ills of gangs in urban communities. It's not a great picture - I think Gruner's follow-up, NEMESIS, was superior - but certainly gave the former kickboxing champ a base to build on.<br><br>The story: A French graduate student and martial artist (Gruner) moves in with a family harassed by a local gang, and uses his physical skills to fight their oppression.<br><br>Thus far, Steven Seagal and Olivier Gruner are the only western action heroes I can think of whose first film was also a successful vehicle for them. Despite some difficulty with speaking English, Gruner is well-prepared for the part...but then again, it's not like he has many scenes that require strong acting. In general, everybody does alright, acting-wise, but there are no standout performances, including that of Golden Globe nominee Theresa Saldana as Gruner's landlord. More credit is to be given to one-time script writer S. Warren, who turns the fairly colorless Tony Valentino into one of the more despicable villains of my short-term memory. He also does a good job of showing the terrorist mentality of gangs and their intimidation tactics, but disappointingly doesn't examine the socio-political implications that cause their formation, making it alright for Olivier's character to nonchalantly transition from a position of anti-violence to pro-killing.<br><br>Of course, the killing allows him to show off his martial arts, so that makes it okay. Director Eric Karson doesn't have a particularly good eye for shooting or blocking action, but the fluidity of Olivier's many kicks and the occasional flair of the choreography helps make up for this. Gruner's style of on screen fighting is somewhat unique: though Van Damme was just as good at kicking, Gruner throws a greater variety of kicks, and while he routinely dominates his opponents, it's rare that he produces the typical one-hit knockouts. For the latter half of the picture, kung fu exponent and ally Peter Kwong occasionally gets in on the action, but both he and Olivier suffer from a lack of viable opponents they can fight one-on-one: though the cast also includes Mark Dacascos and kickboxer Stan Longinindis in bit parts, no one can hold a candle to Olivier, and the one-against-many fights eventually end up getting a bit boring.<br><br>Upon its release, the movie received some criticism for supposedly causing legitimate gang violence during a drive-in showing, but in retrospect, the film is so very cheesy in its exploitation antics that it's hard to take it seriously some of the time. Regardless, it's worth a look for general karate fans and definitely fans of Olivier Gruner who want to see more of him using his fists and feet at length. It's not quite as good as I had hoped for, but it's an entertaining enough time-waster.","user":"The_Phantom_Projectionist","rank":[5,5]},{"title":"Great low budget action from the guys who brought you Lionheart!","rating":9,"date":"9 September 2008","review":"Angel Town's DVD cover may be misleading....but martial artist Olivier Gruner is the star and central plot of the film. Gruner (who also starred in the excellent Nemesis) plays a foreign exchange student who has to protect a family from a nasty gang of hoodlums. Gruner shows off some excellent fighting skills and throws out some classic cheesy one-liners. But Gruner's acting is HORRIBLE! His English sounds like a drunk Van Damme. But you're not watching this for it's great acting and dialog...you're watching this for it's kick butt martial arts action....which it has plenty of. There is a great final fight scene and the gang violence scenes are pretty shocking and realistic. The soundtrack is early 90's gold and the film has a great 90's lowbudget vibe. Excellent rental for martial arts fans!","user":"ManBehindTheMask63","rank":[7,9]},{"title":"A low rent Jean-Claude wannabe takes on an East L.A. Streetgang!","rating":7,"date":"12 October 2003","review":"Angel Town (1990) stars Oliver Gruner who plays a Jean-Claude wannabe who's on a college scholarship to an L.A. University (does USC have a Savate Team?). He rents a room from a troubled single mother who's son is constantly threatened by a local street gang. They want him to join them but they do a very bad job trying to convince him (daily harassments and beatings). His troubles remind Oliver of his life back home (he too had a trouble past as a youth). When the gang starts to mess with him (they affectionately call him \"Frenchie\") Oliver goes \"Segal\" on those tough punks. The movie has a cheap, sleazy feel to it (but it was shot on film). The acting is either horrible (Gruner makes JCVD look like a world class actor) or over the top and the fight scenes are ho-hum at best. Surprisingly, this film is strangely enjoyable. It has an eeriness that compels viewers of bad videos to sit down and watch.<br><br>Recommended for bad movie lovers.","user":"Captain_Couth","rank":[6,8]}]