[{"title":"Brynner is irresistible and seductive, a towering figure as the king...","rating":10,"date":"17 August 2002","review":"In the Golden Age of musical movies, Rodgers and Hammerstein took three looks at the clashes of Eastern and Western cultures: Joshua Logan's \"South Pacific,\" Henry Koster's \"Flower Drum Song\" and \"The King and I.\"<br><br>'The King and I' derived from Margaret Landon's fascinating novel 'Anna and the King of Siam.' The film concerns a genteel British governess who, with a son of her own, journeys from England to 19th century Siam (now Thailand) to instruct the king's many children, in the ways of the West... <br><br>Upon her arrival in 1862, the uptight widow immediately clashes with the powerful ruler over his refusal to give her 'a brick residence' of her own outside the walls of the palace as had been promised... <br><br>As the film progresses, and in a world where women had basically no rights, the 'very difficult' governess learns to temper her outrage at the Siamese court and its treatment of women.. And while she was admiring the king's personality and brilliant mind, she quickly discovered that the major challenge facing her is much more in the education of the volatile king than of his cute family... <br><br>Despite his open-mindedness about other cultures, the proud bald king was besieged by both colonial powers and Siamese traditionalists... At least in private, he consults Anna on how to handle the threats against Siam from England, Burma, and France... He turns a deaf ear to her complaints about having to live in the royal palace, and fascinated by science and geography.. he gives 'a puzzlement,' the proper mixture of arrogance, wonder, and confusion...<br><br>In this historical account of conflicting cultures and sexual mores, we watch two people of very different backgrounds drawing apart and then together, culminating in that most moving and triumphant of moments, when they dance together for the first time... The image of Anna is swept 'high up' by the king as they whirl across the palace floor... His bare feet seductively touching lightly the edge of her satin gown... <br><br>When the king tells Anna that something is not correct with the way they are dancing, and extends his right hand to place it around her waist, it's the climax of a romantic love that never ignites...<br><br>This good-hearted story, enriched by some of Rodgers and Hammerstein's most enduring tunes, permits the meeting of two polar cultures explored with wit and humor... It permits us also to enter into the complex mind of a stubborn king, stern and imperious, whose words and whims become the law of Siam..). But the king is graceful, comic and virile... And into the feelings of an intelligent woman equally-stubborn, intrigued, and deeply irritated by a man, that quickly found she was also instructing him in the niceties of dancing and dining...<br><br>Brynner is irresistible and seductive, a towering figure as the king... He is blessed with a resonant baritone voice, both for speaking and singing... His stance, fierce, and magnetic eyes (denoting a royal leader who cannot be questioned or denied) have an optimum vision and an inquisitiveness that reflect an agile mind as well as a vulnerable heart... He is humorous without imagining it, particularly when receiving the bows of his adorable children... <br><br>Like Yul Brynner, Kerr radiates charisma, and the two work well together... From their first meeting to their last tearful parting, the give and take of their relationship provides the performance its emotional spark... <br><br>The supporting cast is also strong...<br><br>Rita Moreno is Tuptim's ill-fated lover who criticizes the system of slavery and concubinage and voices her desire to be free; Carlos Rivas carries his role comfortably as her Burmese beau, Lun Tha; Terry Saunders arouses Anna's sympathy for Tuptim by explaining that she and Lun Tha are deeply in love; Martin Benson plays Kralahome, the King's right hand man; Patrick Adiarte brings tears to our eyes and pride to our hearts in his far-seeing strength of character necessary to bring the film to a triumphant finish...<br><br>Graced with a rich and singularly beautiful score, and skillfully directed by Walter Lang, 'The King and I' was nominated for nine Academy Awards... It received five, including the Best Actor Award to Brynner... The sets and scenery are gorgeous, and Lang did everything to convey its grandeur... You'll certainly love the impressive procession (\"March of the Royal Siamese Children\") when the king summons his sixty-seven children to meet their delicate schoolteacher...<br><br>Under Lang's direction, 'The King and I' proves to be the best of the Rodgers and Hammerstein adaptations, for reasons that involve East-meets-West flirtation, racism and authoritarianism, pageantry and spectacle, female determination coming up against vanity, civilization against barbarism, et cetera, et cetera, et cetera...","user":"Nazi_Fighter_David","rank":[40,47]},{"title":"A Hollywood fairy tale","rating":10,"date":"25 June 2001","review":"Having read most of the comments on this picture, I was astonished to see how little understood this classic musical is.  Yes, it takes place in 19th century Siam, but it is a fairy tale Siam in the same sense as the fairy tale Paris in An American in Paris.  It is not supposed to be a true representation of Asian life.  Wake up, Folks!  Its a Hollywood adaptation of a Broadway musical!  Let's leave the realism to Phat and Foster.<br><br>This picture, with its infectious score and dynamic performances, is one of the best of its genre.  Who can fail to see the sexual tension between the two leads?  Who can not marvel at the entrance of the royal children (check out Brynner's different reaction to each child).  How can one not applaud the fantastic House of Uncle Thomas performance at the diplomatic dinner. How can your heart not reel to Shall We Dance?<br><br>This is old-line Hollywood at its very best, and may be the last truly great musical.  Check your historical, racial, and PC hats at the door and don't miss it!","user":"jlacerra","rank":[70,86]},{"title":"A magnificent, emotionally packed unusual love story","rating":10,"date":"29 October 2000","review":"I originally saw THE KING AND I at the Roxy Theatre in New York when I was ten years old.  My grandmother took me after a day trip to the Statue of Liberty, and I was expecting to see one of my favorites, Jan Clayton, the star of LASSIE, in the starring role.<br><br>When the movie unfolded I was enraptured by the beautiful redhead playing the lead and realized it wasn't Miss Clayton (whom I later learned had played in the road version of the show, and kids that age don't really know the difference).  I went out into the theatre lobby and looked at the ornate program, which listed Mrs. Anna as Deborah Kerr.<br><br>What an impression this woman has had on my life over the years from the retelling of the classic tale of the British woman who comes to Siam to teach the king's children.  It is superb, not only musically, but from a story standpoint holds up as the best of the Rodgers &amp; Hammerstein musicals. It is essentially a women's lib story, which makes it as relevant today as it was fifty years ago when it premiered on Broadway.<br><br>The fiery, but compassionate Mrs. Anna who is at first turned off by the king and then charmed by him, and who little by little changes him from a near-despot to a man who can grow.<br><br>The subplots are fanciful, but lovely and, in the ballet of Uncle Tom, as performed by Tuptim draw a direct analogy to the unpleasant lives endured by Siamese slaves, in particular women. It does so with majesty and intelligence, no less so than Arthur Miller did in \"The Crucible,\" contrasting the Salem Witch Trials with the awful McCarthy political witchhunts on Capitol Hill.<br><br>It is an extraordinary achievement, and it is shocking that it did not even make the top 100 AFI films a year ago.  It is continually fresh and alive, and every time there is a festival or re-release it does well.  Indeed, a few years ago it was shown on a huge screen at The Hollywood Bowl, with orchestral accompaniment, and it was a smash again.<br><br>My only regret is that Deborah Kerr (six times nominated for an Oscar) was not gifted with an Academy Award along with her co-star Yul Brynner.<br><br>It is a film that should be seen for generations to come.","user":"mrussnow","rank":[45,55]}]