[{"title":"A nightmare","rating":7,"date":"22 June 2005","review":"The \"help me, help meeeee\" scene revolted and scared me so much as a young child that it was years before I could see this movie again. Even now I cringe when I witness that nightmarish scene. As good as Cronenberg's movie is (and it is very good), there is nothing that surpasses the delirious horror of the man-fly in the spider's grasp.<br><br>Elsewhere, the movie is rather subdued. In some spots, almost too much so. Although the first revelation of The Fly's appearance is another classic spot...the multiple reflections was a great touch. Like all great monsters, the Fly has a very sympathetic edge to it. We are revolted by the horror of this monster but we feel overwhelming pity for him as well.<br><br>Vincent Price does a workman-like job in a rather blasé part. Usually he adds a special touch to a film, but really, any number of actors could have played his part here.<br><br>The scientific basis of this movie is pure rubbish, as there is no way that insect and human parts could biologically interact with each other. The result of such a mixture would be instantly dead in real life.<br><br>But that doesn't matter here. A nightmare has its own logic. And \"The Fly\" is a nightmare.","user":"drmality-1","rank":[62,67]},{"title":"Scenes engraved on the mind","rating":28,"date":"28 August 2000","review":"It's been said again and again that this is a good horror film. A Very Good film. But it is more than that.<br><br>I can still hear with my mind's ear (is that right?) the sound of the hydraulic press \"WHUMP\" and the echo. Then again that \"WHUMP\" ... is there another sound experience that reverberates through a movie like that?<br><br>Sure, surround sound, THX, all that tech stuff, but the sound as the manifestation of the crime that encircles this story, the horror as the mind tries to put together the images that (finally) is seen in a flashback as this scene bookends the start and \"finish\" of the plot.<br><br>The inner struggle of the scientist as he fights with his human hand to control the spasms of his \"fly\" arm is both horrible and heart-wrenching.<br><br>The shock as the cloth is torn away from the scientist's head... the fly's POV shot with facets and mirrors of the the screaming face of the scientist's poor wife! The scene at the spider's web as the shrill voice begs \"help me... help me\"<br><br>The horror of murder of a man/thing and a thing/man being shown and even compared in sharp (but obvious) dialogue.<br><br>You MUST see this and experience the earlier days of horror -when classics like this, like \"The Thing From Another World,\" like \"It, the Terror From Beyond Space\" (the original model of Alien) exhibit a freshness and a palpable terror that remakes cannot capture, whatever wonderful special effects are thrown in to add to the creepiness. Sure these later gorefest horror films are good. I buy them all the time. But they are a different genre. The Fly with Vincent Price is NOT the same story as The Fly with Jeff Goldblum. It's not really a remake as a retelling.<br><br>See the original. It is rich with emotion and intelligence, not to mention some pretty fine acting for what was really a \"B\" movie.","user":"existential","rank":[59,64]},{"title":"It's a bad day to be a fly","rating":8,"date":"15 April 2009","review":"The Fly is a movie I have just been dying to see, I have heard a lot about this movie, mainly the infamous \"Help me! Help me!\" scene. But of course the number one reason being that this is the original to the remake with Jeff Goldblum which is an incredible movie in itself, but I was curious what the original would be about. Honestly I was thinking that it was going to be very cheesy, it's a 1950's horror movie that would probably be over the top, but honestly, from the very beginning you get gore, which was odd, but sickly enough I love it! I am also a huge Vincent Price fan, this is the man of the classic B horror movies and his voice and presence make these movies worth the watch. So I finally got to see this on netflix, I absolutely loved The Fly. Is this better than the remake? Honestly, the remake is more realistic on what would happen if this really did occur, but don't overlook the original, as cheesy as a fly in a giant trench coat can be, it's all good and this story is tons of fun and really scary.<br><br>A woman named Helene Delembre phones her brother-in-law, Francois Delambre to tell him that she has just murdered her husband. Francois calls in the police and she admits killing him but refuses to say why. Later, Francois tricks her into telling the story to him and Police Inspector Charas. A scientist, Andre Delambre, has invented a teleportation device. After a few failed attempts, he succeeds with living organisms, deciding to go for the ultimate risk and transport himself. The first time works, but, unknown to him, a fly enters the cabin with him and the two are hopelessly scrambled together. The scientist emerges as a half-man, half-fly, a human with a fly's head, leg and arm/claw. His wife finds out something is wrong as she now sees him with a cloth over his head and a hidden arm. He eventually tells his wife what has happened and she first sees his claw and screams, then later sees his fly head and screams more. His wife, son and maid try to find the \"fly with a white head\" and fail. The son had caught it just after the accident but had been made to let it go, before any of them knew what it was. Andre attempts to reverse the process to return himself to normal, but fails and when he realizes that his mind is being overtaken by that of the fly he asks his wife to end his suffering by killing him with a heavy machine press.<br><br>The Fly is a fantastic and thrilling movie. I know that the ending sequence of \"Help me! Help me!\" was cheesy and over the top to some, but to me it was just plain creepy, it really scared me. The whole atmosphere of the film just felt uncomfortable and disturbing. Granted, I know these were not top of the line make up effects with the fly, I do have to laugh juts a little bit with seeing a fly in a trench coat. But still it was effective and made for a great sci-fi story. I love these old movies for a specific reason, this was the time when film meant something to the cast and crew making it and The Fly was made to give people the chills. It's just rare now-a-days, if this was made in today's world, it would be all gore and just stupid. So I do recommend that you see this film if you are looking for a good scare. Both this and the remake are terrific films and are a ton of fun to watch.<br><br>8/10","user":"Smells_Like_Cheese","rank":[38,42]}]