[{"title":"Great '70's creature feature!","rating":8,"date":"2 July 2006","review":"\"Squirm\" is set in rural Fly Creek, Georgia in the aftermath of a violent storm. Power lines are knocked down by the storm and are feeding electricity into the wet ground. This drives the worms crazy, and for some reason, to crave flesh. The day after the storm, a young man from NYC, Mick, arrives by bus to visit his new girlfriend, Gerry, a resident of Fly Creek. As strange events begin to unfold, the young couple turn detective and try to solve the mystery. They find a corpse, lose a corpse, frustrate Gerry's jealous neighbor, and try the patience of the local sheriff more than once. Will they be able to crack the case in time to save the town?! Tune in to see.<br><br>Director Jeff Lieberman did not direct many films , but he does a great job with this one. The pacing is great, and the cinematography is some of the best work done on a horror film during the 1970's. He includes plenty of humor and suspense, the required ingredients in these films. The lead actors also do a great job. Don Scardino, as Mick, looks like a young Horatio Caine trying figure out what is going on in this small town. He comes off as likable and heroic in an amateurish fashion. Patricia Pearcy plays Gerry, the perfect young southern belle. She's well mannered, attractive and has a subtle sexuality that you don't usually see in horror films. Though not a great acting performance, she seems comfortable in the role. She and Scardino seem to have real chemistry, which is refreshing to see in a low budget creature feature. The rest of the cast is hit and miss. Gerry's family, her love lorn neighbor, and the local sheriff are perfect. The rest of the cast seems to have no acting experience whatsoever.<br><br>This is a fun movie to watch late at night. The low budget limits this film's potential, but the cast, as well as the excellent direction, make this a must see.<br><br>The song that plays over the opening and closing credits is perfect. It sets exactly the right tone for the film.","user":"hammerfan1","rank":[30,34]},{"title":"Hey, there's a worm in my egg cream!","rating":12,"date":"12 May 1999","review":"You wouldn't know it from the description, but SQUIRM manages to be scary, fun, gross, and engaging all at once. Scare shots are timed to a tee and both the conflict of the film and the characters involved in it are executed with as much style and excellent timing as could be expected for a film about killer worms. The scene where worms burrow into Roger's face, and the one where the bathtub is quickly filling up with worms are really effective. Your local video store probably sold off this one years ago along with other slow-renting titles to make room for hundreds of copies of \"Sleepless in Seattle,\" though, so if you see a copy and are looking for a good scare, pick it up.","user":"Doug-48","rank":[20,23]},{"title":"Nature strikes back in a big way!","rating":10,"date":"16 June 2006","review":"The 1970's saw a number of nature-strikes-back horror films, like Frogs (1972), Grizzly (1976), Empire of the Ants (1977), Day of the Animals (1977), and Prophecy (1979), but none that were quite as well-made and effectively frightening as this low-budget horror masterpiece!<br><br>Freak storm blows down power lines in a small Georgia town, and the resulting surge of voltage through the soil drives hordes of sand worms into a flesh-eating frenzy!<br><br>The debut film of director Jeff Lieberman, who would go on to make other great B thrillers like Blue Sunshine (1977) and Just Before Dawn (1981), Squirm is still one of his best. Lieberman wrote the story, which is clever and suspenseful, as it seems to enjoy its campy elements. The plot builds from a mysterious nature to a dark, claustrophobic climax. There's a number of memorably tense moments, such as the shower sequence and the infamous row boat sequence. Lieberman well uses the backwoods and swamps of coastal Georgia to convey a realistic setting and feverish summer atmosphere. Robert Prince's musical score is excellent, with some truly eerie and haunting themes that are perfect in conjunction with some of the dark sequences. The film also contains some of the early creations of a young Rick Baker, who does some awesome makeup effects that provide for more than one memorably creepy moment.<br><br>The cast of unknowns is quite good. Scardino is perfect as the out-of-towner hero who comes to visit his lady friend. Pearcy is attractive and genuine in her role as Scardino's southern girlfriend. R.A. Dow, Jean Sullivian, and Fran Higgins all make for perfect small-town characters.<br><br>Squirm is an undervalued film indeed. It's simply an unforgettable skin-crawler that never fails to entertain and thrill. It's above-average on all levels for a B horror film and is truly one of the best low-budget flicks of its time!<br><br>**** out of ****","user":"Nightman85","rank":[24,29]}]