[{"title":"Vampire Hookers (1978)","rating":6,"date":"6 May 2009","review":"Rating3 / 5 GenreHorror, Vampires, Comedy, Filipino Cinema DirectorCirio H. Santiago StarsJohn Carradine, Bruce Fairbairn, Trey Wilson, Karen Stride, Lenka Novak, Katie Dolan, Lex Winter, Leo Martinez, Vic Diaz, Erna Martha Bauman SynopsisTwo sailors are on leave in a Filipino port well on their way to looking for love in all the wrong places. After a beer brawl separates them one finds himself in the clutches a bevy of fanged beauties. It seems that a poetry spouting vamp (poor John Carradine) has set up shop uses his Vampire Hookers to nab unsuspecting prey ala Dracula and his brides.<br><br>ThoughtsVampire Hookers is far from the worst thing I've ever seen it's silly as all hell but it still entertains none-the-less. The two bumbling sailors were obviously graduates with honors from the Bruce Campbell School of Cinematic Snickers with the screen shenanigans peaking with a stinky, flatulent vampire. You really have to feel for John Carradine who has horrible lines but at least he had most of his scenes with title bloodsuckers (\"'cause blood is not all they suck\").<br><br>In ConclusionIt's crude. It's silly. You know you want to see it.","user":"suspiria10","rank":[8,8]},{"title":"Best Worst Movie Ever!!","rating":11,"date":"11 September 2004","review":"Oh man, this movie is worth watching just for the theme song!! If you are a collector of B horror movies or like to pop 'em late at night you must see this movie. Most John Carradine movies are bad and this is for sure no exception! This gem is complete with bad voice overs, bad acting and a Super Awesomely Bad orgy scene. This movie is pee your pants funny and it's one of the worst movies your little peepers will ever view. Seriously, this needs to go in any B Horror movie collection. Jeese, I can't believe they made this movie, but I'm glad they did. It's just too funny.","user":"ncorsten","rank":[14,16]},{"title":"Vampire Hookers shouldn't have tanlines!","rating":16,"date":"16 May 2002","review":"Vampire Hookers shouldn't have tanlines...<br><br>should they?<br><br>They're VAMPIRES!<br><br>Vampires don't sunbathe!","user":"FieCrier","rank":[25,36]}]