[{"title":"\"Hard Ticket to Hawaii\" has become a Family Favorite","rating":10,"date":"18 October 2015","review":"You must know by now that \"Hard Ticket to Hawaii\" is filled with humorous violence and gorgeous women.The violence doesn't feel cruel or personal. It's more of a device for telling a real story. The Playboy models in scanty outfits are a celebration of the human form, not pornography.<br><br>My father and brother would watch this movie together. They knew the plot and lines well enough to recite them, along with the actors. The movie bled over into real life, and they would say the lines to each other when the moment felt right.<br><br>As my father descended into terminal Alzheimer's disease, this film was his one last link with reality. Watching this film would bring him out of his stupor, and he would become verbal again.<br><br>Now that Father is gone, the entire family watches this movie once a year,on Christmas Eve. We make eggnog, eat fruitcake, and wear sweaters. And cry some, too.","user":"starreythecat","rank":[41,44]},{"title":"God bless this horrible movie.","rating":10,"date":"3 May 2003","review":"If you liked The Remains Of The Day, Terms Of Endearment, or Steel Magnolias... avoid this movie at all costs.<br><br>How do you begin to describe a movie with gratuitous nudity, bad acting, an implausible plot, 2-dimensional characters, and bad fight scenes?  How do you describe the necessity for a mutant snake, an inflatable doll, skateboarding henchmen and razor-bladed frisbees in the same movie? Ofcourse, I COULD mention some of the greatest lines of our generation like,\"Life is a bitch and then you die.\"  Or maybe,\"Just when you thought it was safe to take a pee.\"  (I can't make that up.)<br><br>Why would I bother telling you that I searched for years to find this movie on DVD to watch over and over and over again?  I dare not watch another movie in this series for fear of besmearching the good name of this gem. Please, please, please, if have the opportunity, watch it at least once. <br><br>\nThis movie is like how Richard Gere describes the opera in Pretty Woman. Those that love it, will love it forever, and those that don't will learn to appreciate it, but it will never become a part of their soul. <br><br>\nEnjoi filmphiles<br><br>P.S. I take no blame for mental trauma suffered from watching this film.","user":"da_flipboy","rank":[62,69]},{"title":"An intellectual classic and a must see for all conspiracy theorists!","rating":10,"date":"23 March 1999","review":"This non-fiction masterpiece retells the riveting true story of two beautiful government super-agents, their pet snake &amp; a diabolical criminal plot, the implications of which will surely send chills down your spine.<br><br>The safety of the free world is at stake as the evil Dr. Chang and his wily henchmen plot to flood the Hawaiian economy with drugs and diamonds.  Only Donna &amp; Taryn, two of the greatest agents this government has ever known, stand in the way.  Armed only with nunchuks and throwing stars and with the help of their little reptile friend and his venom, specially engineered toxins derived from the diseased blood of cancerous rats, the two foxy ladies and the two secret super studs, Rowdie and Jade,  embark upon their dangerous mission.<br><br>Will our heroes be able to stop these nefarious villains and save the world? Only through hot tub strategy sessions and with the help of Rowdie &amp; Jade's \"Trunk of Toys\" will our heroes prevail.","user":"woodpile-2","rank":[62,69]}]