[{"title":"Fantastic, magical movie!!","rating":10,"date":"18 July 2003","review":"This is a classic fantasy film from Jim Henson, in collaboration with George Lucas. There really is a magic about the film and that has helped it last as a firm family favourite all these years. As with many films aimed at younger audiences there are messages that the writers, in this case Henson himself, have tried to convey, such as `be careful what you wish for (as in the heat of the moment we are not always sure what is best for us) and also about not taking things for granted. These lessons not only relate to the major target audience of young children but also teenagers and adults alike. The film also has values and attitudes about growing up, the central character Sarah is in the awkward stage between child and womanhood, the stage of adolescence. She acts like a child in her self importance and possessiveness but she is perhaps starting to grow out of her young imagination. She does not want to, her room full of inanimate companions, dreams and fantasies, she feels are slipping away.<br><br>Labyrinth is about Sarah keeping her imagination alive, her fantasies and dreams, and these help her figure out what she is doing wrong, it helps her realise how her attitude is wrong and causes her to be depressed. There is certainly intelligence to this film if analysed deeply. There is depth to the script, and clear attitudes and values that Jim Henson conveys. Henson is in a way telling not just kids, but also adults, that our subconscious, which includes our dreams and imaginative side (in terms of taking yourself to another place, more than imagination in creating something like a piece of music for instance.) can be as affective a guide to where and when your live is going wrong as your conscious. Sometimes we don't realise things we have said or done until we dream. How many times have you said something, that every teen must have to their parents, for instance `I wish you were dead', very cruel but it is said. I have in the past and realised the full implication in a bad dream, a dream is the most effective doorway to imagine something outside of it really happening. <br><br>What is fantastic about the way the film opens and closes as that it really hints to the fact that Sarah has been through the same dream before, and that she needs these imaginative friends, and dreams to help her see the light as it were. She says for instance at the close that every now and again she needs Hoggle and company. The opening of the film sees Sarah reciting from a book to herself, she is addressing the Goblin king and the characters of this book and her room are the cast of a play inside her mind, they are special to her and meaningful, in a way we might have a favourite song that speaks to us in some way. At the start of the film when we are first in her room there is clever use of visual hints that you wouldn't pick up on until watching a film the second time. Look around her room and you see the characters everywhere, Hoggle, Ludo even a little replica of a maze. There is also a clipping of Sarah's mother, who we do not know whether she is still alive, but in any case is not around, but she is with a man who is the likeness of the Goblin King. The man in the photo probably a figure of blame for the loss (however large) of Sarah's mother. What is also interesting is Sarah being a young girl at the start of puberty has a certain fascination and perhaps crush on the Goblin King, perhaps a combination of the character from the book and the likeness of which she has created this character in her head. Certainly on a visual and script basis there are some clever touches when you consider this is a kids film. <br><br>The film itself is much like the Wizard of Oz in terms of story (intentional maybe as it could represent something that Sarah finds special and perhaps inspirational). What I really love about the film is, that before the days of CGI, inside the Goblin world, which accounts for 90% of the film, everything is 100% set work, there must be well over a hundred sets and they are all imaginative an create the enchanting atmosphere of the film, these sets combined with some fantastic matte paintings from ILM that give even more of a scale to the film.<br><br>I do really like this film, the look, the cheesy feel good 80's music, the characters, it is all great. There is some good humour and of course the odd piece of very childish low brow humour but that is to be expected. It is movie magic no question. David Bowie is good as the Goblin King and all the puppeted characters are fantastically brought to life in there movements and voicing as you would expect from a Henson film. A very youthful Jennifer Connelly before the days when many a website was devoted to her ample bosom, has a charm to her, she has to hold the movie together and win the audience, especially after being very bratty and effectively wishing her baby brother into the clutches of Goblins. She does manage to win the audience though and enchant them with her green eyes and youthful innocence.<br><br>This film is great, it is what makes, or made fantasy films of this time really enchanting. Real artistry was involved, there was exuberance and charm to it and it has lasted a long time. It is a firm fans favourite and still gains new young fans. I can still to this day sit down and enjoy the film because I remember what Jim Henson tries to teach us. `Keep the inner child alive inside you sometimes he/she actually knows best'. Perhaps certain events in recent years may have panned out differently had this been heeded by more people, but that is all just hear say.<br><br>Overall this is a classic fantasy film with much artistry and charm to appreciate, certainly Henson had a skill in all his fields in the industry. ****","user":"supertom-3","rank":[173,199]},{"title":"It's starting to sound like a broken record, but you're going to love this movie!","rating":10,"date":"6 August 2000","review":"I recently had the pleasure of watching this movie with three kids who had (to my shock and dismay) never seen it before.  It turned out to be as good, if not better, as I remembered.  The story is reminescent of the original, printed page (very dark) Grimm fairy tales.  The special effects are still special, and the characters are unforgettable.  Seriously, don't miss it. <br><br>\nThis is one of the very few childrens' movies that is smarter and better than what has unfortunately become \"normal\" for the genera.  The reverse evolution in childrens' films is heartbreaking, as kids don't deserve to be talked down to so often in movies.  I grew up on films like \"Labyrinth\", \"the Neverending Story\", and \"the Secret of NIMH\", and I still count them among my favorites.  In the 80's they gave us cinematic filet mignon, and today's kids are getting Spam.","user":"La Gremlin","rank":[202,244]},{"title":"You have to admit it's magical!","rating":14,"date":"14 December 2002","review":"The first time I saw this movie was two years ago.  Don't ask me how I managed to miss it as a child but I did.<br><br>It is obvious that this movie was made for the kiddies but I don't think it can just be enjoyed by the younger crowd.  I think perhaps if I had seen this as a child instead of a teenager I would have enjoyed it more but I didn't and I still enjoyed never the less.  There is something magical about watching Labyrinth.  You just feel the happiness that rubs off from this movie.  It almost makes you wish you were a kid again.  I admit seeing it now I have to say some parts are beyond corny but I think that's just part of it, I mean that was the 80's right?  I am not even a David Bowie fan but I can't help but smile whenever he starts singing (which is quite often).  I recently showed this to my 4 year old cousin and he couldn't get enough of it.  It was so great to watch him turn his head back to look at me with a giant smile to make sure I saw the puppets doing whatever they were doing at that moment.  He really loved it so I bought him the dvd for X-mas this year along with myself a copy.  This is really just one of those movies you have to see at least once in your life, just because there isn't another like it. Sure the story isn't much when it comes to plot but try to watch this film all the way through without smiling once, I dare you!<br><br>A great movie for the kids or kids at heart! 8 out of 10 stars.","user":"gundamgirl2386","rank":[100,119]}]