[{"title":"Doris's Day","rating":8,"date":"18 May 2010","review":"This is the first time I write a comment about a film. Considering that my favorite films, since I discovered the movies, are by Scorsese, Gonzalez Inarritu, Polanski, etc. What am I doing selecting a Doris Day comedy for my first review. Okay, let me tell you. I was overwhelmed by the sheer brilliance of the lady. I've always heard about Doris Day but I had never seen her (The Man Who Knew Too Much is my next one). She is extraordinary because in the midst of all the zaniness there is an unquestionable truth. I believed completely in her character I never thought for a moment she was trying to sell me something. I recognized her, I knew who her character was and then, of course, I laughed, loud and hard. So the reason that I've selected \"The Thrill Of It All\" as my first review is because that's what cinema is all about. Surprises and discoveries. Thank you Doris Day, you've given me something new to look forward to.","user":"peterzullman","rank":[70,76]},{"title":"Doris Day's Best Comedy!","rating":14,"date":"14 August 2003","review":"If one of today's \"actresses\" gave half as good a performance as Doris Day gives in \"The Thrill of it All,\" they'd be nominated for an Oscar. Just look at what wins Academy Awards today!  Day's acting in \"Thrill\" is just as good, or better, than Helen Hunt in \"As Good As it Gets.\"<br><br>Hollywood seems to have \"had it in\" for Doris.  In this film, she was so natural, so damn good, and above all, FUNNY.  She and James Garner made a handsome couple and gave this film that extra sparkle.  Thanks to the clever script/screenplay by Carl Reiner, this comedy had lots to say.<br><br>I enjoyed all of the performers here.  Zazu Pitts was extremely funny as Olivia, the maid.  Doris has always had wonderful support in her films and this one was no exception.  Arlene Francis was great as the expectant older mother and Edward Andrews deserved a best supporting Oscar nod.  Why he didn't get one is beyond me.  It's similar to the way the Oscars ignored Tony Randall's superb work in all three Day/Hudson flicks.<br><br>Alice Pearce (\"Bewitched\") was a scream as the money hungry wife during the traffic jam. This is the scene where Andrews displayed his expertise in comedy (this should have been Oscar time for him).<br><br>One of my favorite scenes in the picture was when Beverly and her Dr. husband were besieged by Bev's fans in the restaurant. Very effective and not overdone.<br><br>Day was wonderful in most of her scenes and really broke me up when she first did her soap commercial.  The whole picture is a delight and director, Norman Jewison was right on target.  Boy, do I wish he'd directed \"Pillow Talk,\" for he would have kept a tight reign on Doris' tendency to get \"too cutesy.\"  Here, she was appropriately mature AND sexy.<br><br>Very touching was the scene after the baby was born in the back of the limo. Day is overwhelmed by the experience of assisting in the birth and just wants her Dr. husband to hold her.  Beautiful.  This one gets the highest rating in my book.","user":"algernon4","rank":[42,47]},{"title":"An Often Overlooked Gem from Doris Day...","rating":7,"date":"14 January 2006","review":"Doris Day made a lot of movies that were a lot better than people knew and so many of them went practically unnoticed. A prime example was the 1963 comedy THE THRILL OF IT ALL, which starred Doris as Beverly Boyer, the wife of a doctor (James Garner), who, quite accidentally, becomes a television spokesperson for a product called \"Happy Soap\" and becomes an overnight celebrity much to the consternation of her husband. Day is at the height of her charm here as she is completely winning as the housewife thrown into the celebrity spotlight and doesn't really know how to handle it. Garner matches her note for note as the slightly chauvinistic husband who would rather have his wife at home. There is also a lovely supporting turn by Arlene Francis as a friend of Doris' who Doris actually helps to give birth in a cab and Carl Reiner (who also co-wrote the screenplay) has an amusing set of cameos as the star of the show where Happy Soap is advertised. A warm family comedy that showcases brilliantly why the world loved Doris Day...and still does.","user":"Isaac5855","rank":[34,40]}]