[{"title":"Much better than I'd heard.","rating":8,"date":"6 March 2007","review":"For years, I've listened to horror fans talk trash about the 1979 \"Dracula.\" It's not faithful to the book, they'd complain, it's not scary, it's only made for the sake of middle-aged ladies who fancy Frank Langella, etc. etc.<br><br>Well, I'm happy to report that the horror fans are way off base this time. This \"Dracula\" is a classy, creepy, and sometimes downright exciting production. Sure, the script doesn't follow the events of the book exactly - the whole thing takes place in England! - but it makes the most of its limitations, so to speak.<br><br>Langella makes a very classy Dracula. He apparently refused to wear fangs or demon eyes for the role, focusing instead on making the count more \"human\" - not to mention arrogant, intelligent, and, I suppose, sexy (for me and other guy viewers, though, the eye candy in this movie is Kate Nelligan). Perhaps Langella is a little too \"normal,\" and his big hair is slightly amusing, but on the whole I think he plays the role with dignity, inhabiting Dracula in a far more convincing way than the likes of Gary Oldman.<br><br>The rest of the cast is pretty good, too. Nelligan makes a lovely, capable heroine, and Trevor Eve is an OK (if underused) Jonathan Harker. Laurence Olivier's Van Helsing is a lot better than most people say he is - he comes across as smart, brave and an overall worthy opponent for Dracula. Reviewers tend to mock his Dutch accent, but I don't get too wrapped up in stuff like that; it sounds fine to me. I certainly think the cast here is much better than the parade of wooden actors and crazy hams in the Coppola version.<br><br>I like the production values of this film, too. The special effects are mostly photographic tricks but they look cool, and they aren't overbearing like modern CGI effects. The sets and locations are attractive, though the designers went a bit overboard with the Gothic ruin of Carfax Abbey (probably because they wanted to make it a substitute for the absent Castle Dracula). And, of course, the eerie John Williams score is a treat, and rightly praised by most critics.<br><br>Another plus is that the movie features a number of very powerful scenes - I love Dracula's confrontation with Van Helsing in the study, and the terrifying moment when Van Helsing encounters his vampire daughter in the mine shaft. Creepy stuff; no wonder this movie freaked me out when I was a kid! <br><br>On the downside, I found Dr. Seward, as played by Donald Pleasence, slightly too grotesque and lame to be believed. And, as usual for these Dracula adaptations, Renfield seemed borderline extraneous. The plotting flakes apart a bit at the end, too, with the car chase scene coming across as silly - and what, exactly, does the final image in the film mean? It's slightly too enigmatic for my tastes. I am supposed to be rooting for Dracula to survive or something?<br><br>Still, this is one of the better Draculas. The 1977 BBC version is more faithful and probably better. But this is arguably the best adaptation of the story to come out of Hollywood.","user":"dr_foreman","rank":[56,67]},{"title":"Underrated adaptation of Stoker's classic","rating":6,"date":"16 February 2005","review":"\"Dracula\" <br><br>Aspect ratio: 2.39:1 (Panavision)<br><br>Sound format: Dolby Stereo<br><br>The vampire Count Dracula (Frank Langella) arrives in England from Transylvania and targets a wealthy middle-class family, including the daughter of arch-enemy Abraham Van Helsing (Laurence Olivier)...<br><br>John Badham's underrated adaptation of Bram Stoker's novel takes most of its cues from the stage play by Hamilton Deane and John L. Balderston (which had launched Bela Lugosi to stardom in 1927), and while it may not be entirely faithful to the book - events are compressed for reasons of timing - it adheres faithfully to the spirit of the thing. It's also an immensely CINEMATIC work which uses the wide Panavision frame in painterly fashion, creating a landscape of Gothic architecture and Victorian excess (note the breathtaking shot looking down from the ceiling inside Dracula's castle, where an ornate spider's web fills the entire screen). Badham and screenwriter W.D. Richter emphasize the film's Romantic elements - helped immeasurably by Langella's complex performance - though the corruption underlying Dracula's handsome exterior is often betrayed by certain details (the Count clawing at a windowpane, seeking entrance to his latest victim; the ghoulish vampiress who continues to rot even as she pursues her lust for human blood, etc.).<br><br>Olivier has been criticized in some quarters for his 'silly' European accent, and it's true that his performance lacks some of the dynamism Peter Cushing once brought to the role of Van Helsing, but Olivier comes into his own when confronting Dracula with evidence of his vampirism, and in the deeply moving moment when he drives a stake through his daughter's heart and cradles her corpse in his arms whilst sobbing uncontrollably. The fine supporting cast includes Trevor Eve, Donald Pleasence and a wealth of familiar British character actors (Tony Haygarth, Teddy Turner, Sylvester McCoy, etc.), alongside Canadian actress Kate Nelligan, giving a finely-tuned performance as a potential bride of Dracula. A beautiful film - romantic, tragic, Gothic and sinister, it satisfies in almost every respect, and is ripe for rediscovery. John Williams' glorious music score is the icing on the cake.","user":"Libretio","rank":[27,32]},{"title":"Underrated, classy take on the vampire legend","rating":8,"date":"14 September 2005","review":"It is surprising to me that, given the popular and critical praise so many mediocre vampire movies have received( this includes the badly dated Hammer flicks), this movie is often dismissed as minor and forgettable. While it is true that the definitive version is still Coppola's 1992 film, this overlooked gem deserves much more attention and praise than it currently gets.<br><br>It was possibly the first vampire movie to play up the romantic and sexual implications of the vampire legend, while at the same time remaining faithful to the underlying idea of Stoker's novel( that is, a fight between good and evil). It is worth pointing out that the film depicts count Dracula as a good looking, seductive and charming aristocrat, rather than an impulsive blood-thirsty creature. He is a broody, lonely character, seeking for a female partner with whom share his everlasting loneliness, something he seems to find in the form of Lucy Seward, an independent and strong-willed Victorian lady.<br><br>But the fact that this Dracula has a romantic strain to him does not conceal his ultimately evil nature. He consciously seduces and attacks ill, defenseless Mina just for the excitement of it. When Dr Van Helsing meets her at the graveyard galleries, she is no longer that frail but charming girl, but a deathly-pale,putrid, disgusting figure. That is what Dracula's hobby implies.<br><br>Badham does an excellent job. He effectively uses Gothic imagery and low key lightning to create an eerie and slightly surreal atmosphere.But what really stands out in this version is the cast. Everyone fits their role perfectly.Langella plays a seductive count. Olivier,inspired by Cushing's performance in 1958 Dracula, puts in a riveting performance as a frail, tortured Van Helsing, with an emotional stake in the story (pun intended). Kate Nelligan( a fine Canadian supporting actress,also starring in Eye of the Needle) delivers a fresh performance. Even Harker's character , which is usually the main casting weakness when it comes to Dracula movies, is quite well handled here, played by an actor with the right appearance.<br><br>There are minor flaws, the most important of them being a lack of screen time devoted to the romance and a muddled color scheme, but this film is nevertheless worth a look, an engaging retelling of the classic horror tale with a poetic, broody edge to it.","user":"ThomasHayden","rank":[59,75]}]