[{"title":"A Camp Classic...","rating":3,"date":"3 September 1998","review":"...that you'll want to watch over and over again.  A weird, psychedelic mixture of martial arts movies, Japanese giant monster movies, spy adventures, and just plain goofiness.  The plot makes no senses, the characters are thinnest cardboard, and the monsters are truly hilarious. If you wonder where they came up with Power Rangers, look no further than here.","user":"Gislef","rank":[19,21]},{"title":"Filled with rich, extra cheesy goodness!","rating":10,"date":"13 February 2004","review":"This is a hoot and a half; a Shaw Brothers' gem.  Add in a manga based story, the Shaw Bros. studio lot, sci-fi, and lots of amazing, kampy fighting surpassing even the staged corny fighting by the Bat in blue tights Adam West, and that's Super Inframan in a nutshell.  According to production notes, Danny Lee did don the Inframan suit on and I loved the transformation sequences with really 70ish sound effects!  There's 70s written throughout this one.  I never knew a Demon Princess could dress and look so funky psychedelic!  I thought she stopped by a Viking convention.  Plus, best use of motorcycle helmets goes to the numerous black-clad skull minions who take turns getting an  Inframan-ish beating and lots of well-timed body flips. This film is a very good homage to Japan's Kaiju. Please ignore the fact that the monsters are human-sized rather than several stories tall.  The Super Inframan and the Mighty Peking Man should be shown back-to-back at Subway Cinema 2004 at the Film Forum in NYC!","user":"InzyWimzy","rank":[19,23]},{"title":"Chinese Ultraman has some class","rating":6,"date":"15 October 2002","review":"Hard to rate a movie as bad as this that's so much fun!  The key to this one is kung-fu fighting monsters, \"thunderball fists\", and of course, Princess Dragon Mom!  Wielding a very long whip she plots to rule the earth  and unfortunately only Inframan tries to stop her.  Dig the fact that everybody in the film drives VWs.  Shaw Bros' do Ultraman, and it's a pretty bizarre affair.  Best scene -- Professor and the monsters on the motorboat going to monkey-skull island.  Truly strange.","user":"funkyfry","rank":[11,14]}]