[{"title":"The price of vanity...","rating":7,"date":"10 May 2006","review":"The story of Elizabeth Bathory is easily one of the most important for the horror genre, and there's no studio more qualified to tackle said story than the legendary Hammer studios...but unfortunately, the resulting film is not as great as it could have been. Hammer had their golden period from the late fifties until the end of the sixties, and I dare say that if this film was released during that period, it would have been one of their classics. By the seventies, the studio had began to take influence from the lurid Euro horror films that were gaining popularity, and this resulted in Hammer losing it's innocence; which if you ask me, was what made them great in the first place. However, Countess Dracula is still one of Hammer's most inspiring films and benefits from a typically ludicrous plot line. We follow the Countess who, by chance, discovers that the blood of virgins restores her youth. After becoming young again, she pretends to be her own daughter and begins courting the son of a soldier; much to the annoyance of her present lover. However, nothing lasts forever; and bathing in the blood of virgins is something the Countess must continue to do if she is to retain her vanity <br><br>As mentioned, the way that the plot is handled isn't very good. The film plays out like a drama rather than a horror movie and there is barely any tension or suspense to found throughout the whole picture. It seems that director Peter Sasdy (who also made the very decent Taste the Blood of Dracula for Hammer) thought that the implications of the plot would be enough to carry it; and while this is true to an extent, the film does become a little too dreary at times. Another disappointing element of the film is that, despite the fact that it's about a woman who bathes in blood; we never actually get to see this taking place. I was really hoping to see the beautiful Ingrid Pitt relaxing in a bath of blood, but no! I don't know, perhaps it would have been a little too graphic. The lead actress really does make the film her own, however and delivers a powerhouse performance that proves her worthy of the title of Hammer's best leading lady. The way that the film carries off the plot is really good, also, and we are allowed into the head of all three central figures. On the whole, I can't say that this is one of Hammer's best films, but despite its faults; I really enjoyed it.","user":"The_Void","rank":[22,24]},{"title":"Ingrid Pitt's signature role in atypical Hammer horror","rating":6,"date":"31 December 2004","review":"\"Countess Dracula\"<br><br>Aspect ratio: 1.85:1<br><br>Sound format: Mono<br><br>The title is a cheat (no fangs here, I'm afraid), but Peter Sasdy's atypical Hammer horror takes its cue from historical fact in an effort to distinguish itself from the studio's regular formula, casting Ingrid Pitt (only recently established as a horror icon at the time, through her appearances in THE VAMPIRE LOVERS and THE HOUSE THAT DRIPPED BLOOD) as an ageing Countess in 16th century Hungary who discovers that her youth is restored by the blood of virgin girls. She subsequently embarks on a reign of terror whilst pursuing a young Army officer (Sandor Elès) who is unaware of her murderous activities. Philip Harrison's low budget set designs are grim and evocative (Harrison later decamped to Hollywood, where he worked on the likes of NICK OF TIME, THE CORE and many others), and Pitt is astonishingly good in the role of a dissolute noblewoman who uses her voluptuous beauty as a weapon in her selfish pursuit of personal gratification. But Jeremy Paul's complex script makes an anti-hero of its central character, revelling in Pitt's villainy whilst petitioning audience sympathy for the consequences of her sickening deceit (she keeps reverting to old age, each time looking worse than before, requiring more victims, more blood), and the dichotomy is crudely resolved during a melodramatic climax in which Pitt's secret is revealed at the worst possible moment.<br><br>In key character roles, Nigel Green and Maurice Denham are every bit as good as Pitt, though Elès and Lesley-Anne Down (as the daughter whom the Countess impersonates whilst romancing the younger man) are pretty nondescript as the underwritten juvenile leads. Prudes may disapprove of Pitt's glorious nude scenes (drool! slobber!), and timid viewers may want to cover their eyes during some brief but potent episodes of violence, including an extraordinary moment involving a lethal hat-pin which somehow managed to scrape past the British censor unscathed in 1970! The film is based on the real-life crimes of Elisabeth Bathory, a villainess whose bloodthirsty escapades would seem a natural subject for cinematic exploitation, but \"Countess Dracula\" is one of only a handful of movies to take inspiration from her dreadful misdeeds, including IMMORAL TALES (1974) and EL RETORNO DEL HOMBRE LOBO (1980).","user":"Libretio","rank":[24,28]},{"title":"A Literal Blood Bath","rating":10,"date":"10 September 2000","review":"Shocking, poetic, well-done story loosely based on the legend of Countess Bathory of Hungary who, it is said, bathed in the blood of young virginal women for the purposes of rejuvenating her skin.  Ingrid Pitt plays the countess in all her ugly old age and her fresh nubile new skin.  Actually, Pitt does a very good job in a very difficult role of playing two women incredibly apart in age that are supposed to be the same woman.  The direction is done by Peter Sasdy,  probably the best of Hammer's latter directors, who did a very good job with Taste the Blood of Dracula and Hands of the Ripper.  Sasdy knows how to use his camera and can be quite lyrical with it.  Some of the scenes are very fresh and inventive.  One that stands out is where Pitt returns to her ugliness and all the action of her inner turmoil is seen through some broken lattice.  Quite good!  Too bad that Hammer had by this time gone to that inferior film stock.  This would have been simply gorgeous had it been done five years earlier.  Also, by this time, Hammer had to rely on more blood and violence and more exposed bosoms. Countess Dracula is at times quite bloody, with the pinnacle I think being the scene where Pitt is actually caught unawares bathing in blood and massaging her nude bodice with a blood-soaked sponge.  Nonetheless the violence really does not detract too much from a pretty good story and execution of it.  Nor does the nudity, albeit it rather unnecessary(Andrea Lawrence is quite \"charming\" in her role as a serving girl...no pun intended).  The rest of the cast is very good with Nigel Green really giving a nice performance as a jealous lover and Maurice Denham excelling as a dotty old man.  The film stands as a testament to the extremes some people will go through to recapture what was past, and their self-centered, self-serving drive to remain beautiful and young.  Is it topical today?  You bet ya!","user":"BaronBl00d","rank":[26,31]}]