[{"title":"Great! What are you all talking about?","rating":15,"date":"15 August 2001","review":"I'm wondering if everyone who reviewed this was watching the same film that I've seen because there is no way this movie can \"endanger your mental growth.\" This movie is great! It's got a funny script and an interesting storyline...I don't know if people were expecting some kind of \"Close Encounters of the Third Kind\" challenger, but you all need to see this movie for what it is...somehow I doubt it was meant to deliver some deep message about society or help you delve into your soul...it's a comedy that is meant to entertain! Lighten up, people....","user":"hlookie","rank":[57,65]},{"title":"Still delivers big laughs, one to watch when your world has some gray skies","rating":8,"date":"29 May 2008","review":"Widower Dr. Steve Mills (Dan Ackroyd) is a two-bit astronomer who wants desperately to send a light beam \"out of\" the solar system. He fervently believes there is life on other planets but his experiments have been known to damage expensive equipment. Therefore, his boss has told Steve that he will get the boot if he breaks anything else. Needing lightning to bolster his beam, Dr. Steve begins his next attempt at intergalactic communication in a thunderstorm when the system suddenly gets a \"superboost\" of power, which he can't explain. The result is that the radar shows his light went into another GALAXY, hurrah, but, soon after, the entire system goes south. Steve gets thrown out on his ear, of course. He goes home to his thirteen year old daughter, Jessie (Alyson Hannigan) and contemplates his next move. His womanizing brother, Ron (Jon Lovitz, absolutely hilarious) throws a party to cheer him up, too. But, crashing the get-together, is a beautiful blonde, Celeste (Kim Basinger) who flirts with Steve and wants to know his science secrets. That's because she is an alien whose planet was damaged by Dr. Mills' light beam. She has only a short time to get the good astronomer to send the jolt again so that her world will be saved. But, naturally, Steve must not know she is not an earthling. From alien \"eyes\" in handbags to drinking car batteries to convincing Steve to marry her, will Celeste succeed in her rescue attempts? If you are world weary, I heartily recommend this old charmer. It is very funny, probably Richard Benjamin's best effort, and it has a terrific cast, too. Ackroyd is wonderful but, then, so is Basinger in a role for which she has probably never garnered any praise, which is a big shame, for she is very funny and sweet. As for Lovitz, he could make a stone laugh and he is in excellent form in this one. All of the other cast members, including Hannigan, in her first big role, are fine. There is an abundance of terrific sight gags and special effects and the script is humorous, polished, and offbeat. As for the costumes, they are impressive, with Basinger looking like a dream. In short, do not be an alien to this film. There have been many films in cinematic history which have been praised high above this one but there are very few that actually deliver the laughs and enjoyment of this truly winning flick.","user":"inkblot11","rank":[24,28]},{"title":"Enjoyable light fluff","rating":7,"date":"18 August 2002","review":"Ok, I admit to a guilty pleasure at 1)enjoying and 2) recommending this movie.<br><br>The plot is weak, the situation implausible and the secondary characters are weak.  So why do I give this movie a 7/10?<br><br>Dan Aykroyd and Kim Basinger, who have some of the funniest lines in any movie.<br><br>They are both excellent as 'fish out of water' he as a nerdy social misfit and she as the space travelling investigator who has to find out how Dan Aykroyd's character was able to contact her planet from a primitive Earth.<br><br>It is a movie that definitely grows on you with repeated viewings.","user":"KevinBeckett","rank":[27,32]}]