[{"title":"Cops and Robbers is a steal.","rating":7,"date":"12 December 2010","review":"New York City cops Tom and Joe are in the mist of burn out. Why me syndrome eats at them in every way including getting in the wrong lane on the highway. They decide on a bold move to remove themselves from the relentless rat race by stealing and selling security bonds to the mob while remaining untraceable themselves.<br><br>Cops and Robbers is a very decent suspense comedy overachiever. Lack of star power works in its favor with Cliff Gorman and Joseph Bologna as the two rogue cops as non-descript everydays they ooze New York and are not required to perform acts of cool bravado to protect their careers. They are not master thieves, instead learning as they go along and it's this thin ice approach that gives the film it's well paced balance of humor and suspense. <br><br>Made during the Serpico era when the NYPD was swimming in corruption it's hard not to root for these dirty cops being squeezed on both sides. It may be a low rent sting but it does have the benefit of bluffing the audience deeper into the final moments than predictable outcomes reserved for superstars like Newman and Redford.","user":"st-shot","rank":[12,12]},{"title":"A GREAT hidden gem about the way NYC used to be!","rating":20,"date":"20 October 2012","review":"I'm Born, raised - and still live in NYC.<br><br>Seeing this movie made me (like a lot of my fellow NYC'ers) pine for those days.<br><br>It was a great place to grow up - made you 'get with it' really fast.<br><br>I'd never heard of this film (and I know Mr. Gorman!), so, when it appeared last night on TCM, I recorded it.<br><br>What a find!<br><br>The sights and sounds bring back a lot of memories, as does even the film's stock, and the look. All pitch-perfect.<br><br>The acting's superb. <br><br>Instead of the (misguided) idea of using 'star' names, the producers and the director went for ACTORS - New York actors. <br><br>ANd that makes all the difference.<br><br>The leads, Cliff Gorman and Joseph Bologna are 2 schlubs - cops, who know they're stuck ion a treadmill.<br><br>They want SOME way to get out - to 'go sit on a beach,' and enjoy their lives.<br><br>So, through a meeting by happenstance, with a well-known Mafioso figure 'Pasquale Aniello' aka Patsy O'Neill, they think they've found a way to meet their goal.<br><br>Everyone in the cast is so New York, the director - Aram Avakian - is a born New Yorker, and it really does help give this film that true feel.<br><br>You can see it in such things like the ways the cops slouch.<br><br>The little touches - such as the annoying Muzak that plays in a couple of scenes - gives the humor (this IS a comedy) a real NYC feel. It's dry, it's got a 'been there,' jaded quality that is so typical.<br><br>I join the chorus in praising this little gem.<br><br>If it shows up - WATCH IT.","user":"UNOhwen","rank":[10,10]},{"title":"Entertaining and More Entertaining","rating":9,"date":"30 January 2005","review":"Cops and Robbers is an enjoyable, entertaining, and well-acted film. Directed by Aram Avakian, and starring Cliff Gorman and Joseph Bologna as two cops who decided to pull-off the \"perfect crime\". <br><br>Filmed in 1973, it's a trip down memory lane, capturing the grit and grime of New York City before it's \"make-over\" some twenty years later. Gorman and Bologna give their career best performances. Their interactions and conversations seem as real as can be. At no time what-so-ever, do you feel like these fine actors are acting.<br><br>The movie however is stolen by character actor John P. Ryan as mob-fence \"Pastsy O'Neill\". Ryan gives an academy award winning performance(he was never nominated), and you truly have sympathy for his character in the end.<br><br>A really fine work of film-making.","user":"angelsunchained","rank":[18,21]}]