[{"title":"Love Chicago, love Patrick, love this movie!","rating":8,"date":"11 June 1999","review":"I have lived in Chicago all my long life, and I really appreciated the authenticity of the location scenes.  The area around Wilson and Broadway is exactly where the \"hillbillies\" (forgive the term), especially the single men, generally migrate.  The characters in the flophouse and bars must have been taken right from the street.   The \"project\" was recognizably Cabrini-Green, and Truman and Jesse's restored three-story house could almost be pinpointed to Lincoln Park (except that the \"bad guys\", and Truman, would never have found such open parking - they'd still be circling the block).<br><br>The cemetery where the final showdown occurred is Graceland on Clark Street, as everyone who has toured or visited this landmark would know.   It was an agony to watch these historic monuments being blown to bits - I had to keep chanting \"it's only a movie, it's only a movie\".<br><br>But the readiness of the Kentucky family to jump into the fray was very real.  That wonderful scene of the pickup truck on its northbound trek up Lake Shore Drive has its counterpart in everyday life, so I've been told.<br><br>Liam Neeson is a revelation.  It's hard to believe that the same actor who plays to perfection this tight lipped, lean and mean mountain man, will later be nominated for an Oscar for his heart-rending portrayal of a sophisticated German industrialist.<br><br>Truman Gates may be my favorite Patrick Swayze character.  There's plenty of blood-and-guts action, but it's easy to believe that a concert violinist would fall madly in love with this exciting, unusual cop.  Helen Hunt, as his wife, and Michael J. Pollard as a benighted flophouse manager, are excellent in their roles.<br><br>See this movie for a good story, authentic characterizations, and non-stop interest.","user":"Pat-118","rank":[24,25]},{"title":"It Is All About Kin and Clan","rating":10,"date":"10 December 2007","review":"What makes this action drama particularly moving is the comparison between the extended family of a Sicilian crime boss and the clannishness of the hillbillies. While Joey Rosellini insults the mountain folks as people \"who farm rocks\" his boss John Isabella sees the link -- \"that is what they said about our people back in the old country.\" It is not a matter of who wears the nicer suit; it is a matter of blood, of kinship, and of ensuring that the one with the greater grievance has justice is done for his family. This is a very old tradition, both in the Sicilian families and in those Celtic clans that moved into the hills of Appalachia. In this aspect \"Next of Kin\" reaches a level of art not usually found in action films. The scene of the women packing sandwiches for the big hunt shows a level of clan community not well understood by us city-folk.<br><br>Watch this film and enjoy.","user":"webmouse","rank":[29,33]},{"title":"predictable but enjoyable","rating":7,"date":"16 May 2003","review":"Patrick Swayze stars in this action crime drama as a Chicago cop from the south avenging the death of his brother.  So the plot is pretty basic, so what, it is still an enjoyable action/crime-drama.  The cast was very good in this film, which includes Liam Neeson, Bill Paxton, Helen Hunt, Adam Baldwin, and even Ben Stiller in a smaller role.  The action was pretty good too, especially the chase on top of the train.  The film also used its Chicago locations very well, which is something I like in movies.  The film has a few faults, including an extremely predictable ending.  But aside from that its a fun film for action fans. 3.5/5","user":"shakey_jake53","rank":[10,11]}]