[{"title":"You People Are Losin' It","rating":1,"date":"1 April 2003","review":"Lay off this movie, people.  It's a teen-age sex romp comedy.  It doesn't pretend to be anything more.  And as for teen sex-romp comedies, it's pretty entertaining.<br><br> Tom Cruise is in it.  Shelley Long has a good part.  And the guy from Breaking Away has the best character of all.  What I really liked about this movie was how it \"romanticized\" Tijuana.  It makes you want to take a trip down there and raise some hell yourself.<br><br> This movie is a good time on a Friday night.  If you're gonna rent a movie like this, rent this one.  You won't be disappointed.","user":"clockwatcher","rank":[24,34]},{"title":"I like this movie!","rating":1,"date":"1 July 2003","review":"I thought that this movie was very funny the first time I saw it ten years ago, and I still do today. This is a movie that is in the same genre as Porky's or Revenge of the Nerds. True fact, Tom Cruise said in a Playboy interview that he did this movie because of Jackie Earle Haley. Since Haley had been in Breaking Away, Cruise figured that this movie would be just as good. It didn't quite work out the way he expected, at least not right away. Cruise fan or not, it's worth a look. For me, Jackie pretty much steals every scene he's in. Anytime I watch this movie, I have to laugh at Tom Cruise because he ended up becoming one of the biggest stars in the movie world, and he started out in this. If you REALLY want to see Cruise in another light, check out Endless Love, with Brooke Shields. It's his first movie, and though he's in it for less than a minute, it's worth a look, just like Losin' It. Check it out!","user":"kman0072","rank":[10,14]},{"title":"Forget Tom Cruise. The whole movie is Jackie Earle Haley.","rating":5,"date":"5 May 2004","review":"Losin' It is a pretty funny roadtrip movie, thanks to the comedic antics of Jackie Earle Haley ('Breaking Away') who plays Dave, an oversexed kid desperate from some action during a weekend in Mexico. He and his buddies, Woody (Tom Cruise) clean cut shy kid, headlong Spider (the gorgeous John Stockwell) and Dave's clever brother Wendell (John P. Navin Jr.), embark on a wild roadtrip to lust after girls and underaged booze in 1965.<br><br>Each of the guys has their own experiences with love and mischief. Woody spends most of the time with Kathy (Shelly Long), a flamboyant older woman who hitched a ride with the boys to get a quickie divorce. Spider, the ego, abandons the group and frequently gets in trouble with a corrupt sheriff. Wendell, who came along for lots of black market goodies, spends the weekend trying to save his brother's ass, since Dave's misconception that the town is full of easy women gets him in heavy trouble with the locals.<br><br>It's a pretty funny movie that I'm surprised hasn't been given more notoriety among 80s fans. Tom Cruise and John Stockwell played their typical characters, but the stars of this movie, were really Jackie Earle Haley and John Navin. They were perfect.","user":"vertigo_14","rank":[11,16]}]