[{"title":"Facing life squarely","rating":10,"date":"11 August 2004","review":"\"Brink of Life\" was shown as part of the exhaustive Bergman retrospective organized by the National Gallery of Art, American Film Institute, and the National Museum of Women in the Arts. The film curator at the NMWA paired it insightfully with \"Karin's Face (1984),\" a film of stills about Bergman's mother. <br><br>As the two previous reviewers have observed, this little-mentioned film is a classic of its own, dealing with a most challenging and difficult phase of life undeservedly neglected by directors, male or female. Numerous thoughts passed through my mind while viewing it. For those who have experienced some of the events in the film, it rings true. Bergman, with the assistance of the excellent script by Ulla Isaksson, is able to penetrate female psychology about this very elemental subject and to elicit powerful and honest performances from all of his actors. To say that Bergman proves himself to be both psychologist and psychiatrist of the female psyche would not be an exaggeration. But here in 1958 he feels no need for the pathology of \"Cries and Whispers,\" or the sexual neuroses of \"Persona.\"<br><br>\nThe setting is \"given,\" almost like a stage play, as it takes place in mainly two rooms of a hospital, and the situation of each of the three women, while different, might even seem a tad \"set\" or \"canned.\" But as their situations unfold, and as we are drawn into each dilemma, we see how vital this inter-action is between them, between them and the head nurse, and between each of their spouses and lover. From the intensity of being alone (as we see in vivid closeups), their circle of life is gradually drawn wider, encompassing others and us in it. Ultimately, we see how this inter-action deeply affects each of them. <br><br>From the standpoint of film making, we can feel how much Bergman loved the archetype Woman, and felt compelled to present in as straightforward and sympathetic a way possible, without melodrama or sentimentality, her predicament as Child-bearer. We are given insight into her innermost fears (what woman has not feared pregnancy before marriage, or a miscarriage, or an abnormal or still birth, an indifferent lover or spouse?), and we are shown how some kind of closure or resolution might be offered through an honest reaching out and sharing of those fears with someone who listens and sympathizes without judgment. Bergman's genius was the ability to reach into the female psyche, to gain the trust of his actors, to allow them to reveal themselves in this most intimate and personal of human emotions and acts, and to make a statement about greeting and accepting life as well as death. He must have obtained this insight early on in life, and for that gift we must thank his mother Karin. <br><br>One final note about the men in these women's lives. Ingrid Thulin is matched with Erland Josephson, Eva Dahlbeck with Max von Sydow, and Bibi Andersson speaks on the phone with her lover. Both Josephson and Sydow look very young, much younger than the women appear. Josephson plays a role we seldom see him in, that of the rather unsympathetic spouse, a bit too caught up in himself and appearances.<br><br>His sister, interceding for him, is the beautiful and strong, but rarely seen Inga Landgré犴鸹. Max von Sydow plays a young, very young husband to Dahlbeck -- he seems almost like an adolescent here, even though he was in the \"Magician\" the same year and \"Seventh Seal\" the year before. Bibi's errant young man is suitably absent<br><br>If we are to read their roles as legitimately portrayed, then I wonder what Bergman was trying to say about Man vis a vis Woman during this phase of pregnancy and childbirth? I hesitate to speculate, but it is almost one of helplessness, even fecklessness, in the face of a life force that is greater than himself.<br><br>In all a film of **** well worth searching for and best seen in company with \"Karin's Face\" if at all possible. I would recommend that all medical students see it, and anyone contemplating childbirth.","user":"gleywong","rank":[19,21]},{"title":"Exceptional film from Bergman","rating":9,"date":"14 March 2004","review":"Undervalued Bergman film whose themes are pregnancy and birth. I've never seen these subjects discussed in a film with such lucidity. Three women in various states of pregnancy are in a hospital room together. We are first introduced to Ingrid Thulin, who is only a few months pregnant. She has come to the hospital because she has had a hemorrhage. She loses the fetus, which gives her a new view on her relationship with her husband (Erland Josephson). One of her roommates, played by Eva Dahlbeck, is nearing the end of her pregnancy. She has a loving relationship with her husband, and they cannot wait to have their child. The third roommate is Bibi Andersson, a young, single woman who has had an abortion before. She doesn't want this baby, either, but neither does she want to have another abortion. Childbirth really is a frightening thing. Even if the woman has a man, she is alone within herself when the event happens. I think this may be one of Bergman's best films, although the poor quality of the video harmed its effect quite a bit. It had white subtitles, and, since the entire film takes place in a hospital, you could imagine that the white hospital gowns and sheets and such really block the subtitles a good amount of the time. There were certainly some major bits of dialogue that I had no chance of understanding. I eagerly await a proper DVD release, although I'm not going to hold my breath. The three actresses are absolutely brilliant, especially Bibi Andersson, who definitely gives one of her best performances.","user":"zetes","rank":[22,26]},{"title":"a turning point in my film going life","rating":8,"date":"19 January 2013","review":"This film is one of the most important of all those that I have seen in my movie going, spanning fifty years, for it was the first Bergman film I saw in the early sixties at Auckland's only cinema for foreign films. I was struck by its humanity, by its clear eyed view of what it is to be human. Not only did it open up the whole body of Bergman's subsequent work, but I saw the themes first explored in this film deepened and enriched (with a few disappointments to be sure) throughout his career. I first learned here that more difficult and challenging films keep giving long after they have been first seen. Those who say Bergman is gloomy and depressing, all I can say is that the MOST depressing experience in the cinema EVER for me, was being persuaded to join a group of people \"just for a laugh\" to see the truly execrable \"Sex and the City 2\" Compare the insulting view of women in that piece of rubbish with this gem.","user":"himbletony","rank":[5,5]}]