[{"title":"you want to come back to my place for breakfast?","rating":8,"date":"22 August 2005","review":"This is a small English film from 1977 tells the story of a innocent African boy arriving straight from Africa to set up a new life for himself in the streets of London. Upon arrival things quickly go wrong from the intimate cavity search when he arrives in Heathrow to getting hustled of most of his money by a small child when he walks the streets. This is the theme of the comedy, the corruption of the innocent and how they survive. Although easily criticised for its apparent inability to tackle the political relationships between people in English Black sub-culture, the non-political approach ends up working in it's favour.<br><br>A problem with so called 'black films' is that they often act demeaningly towards it's subject, giving one-dimensional characters and clichéd plot devices somewhere to hide. This film however by taking a much more subtle approach towards the more obvious themes of other 'black films', the poverty and the contrasting cultures etc, allows itself to tell a lot more of a human story and therefore speak more to a multi-cultural audience.<br><br>This film although 30 years old almost now is still fast moving for it's time. It's one worth seeking out if you want to see a film that shows the black community beyond the gangstas and crack addicts so often demonstrated in todays cinema. The film is not just about the black community, it is about trying to fit in and adapt in to a foreign culture and finding humour in the situation and also about the corruption of an innocent.","user":"MrRisker","rank":[9,10]},{"title":"Coming-of-age for a Guyanese lad set in London's black community","rating":7,"date":"25 August 2012","review":"Guyanese-born writer Jamal Ali probably had a better appreciation than most of the difference a \"country boy\" from Guyana might face if he was sent off to London to find a distant relative without any support. Winding up in Brixton, a sneaky kid nicks his wallet and then unable to track down a scribbled address, the lad (Trevor Thomas) is befriended by wannabe hustler Dave King (Norman Beaton) - an encounter with much in common to Joe Buck &amp; Ratso's relationship in Midnight Cowboy. The cast do a great job, although a dialect coach might have helped some of them with the delivery of their Jamaican patois. Living near Brixton in the 70s, this occasionally stumbling delivery is the only thing that really jars. Dave King might idolise the hustlers from American films, but he's a pretty hopeless imitation. This film was a good effort at getting an enjoyable film made with a largely black cast. It needed more work in the cutting room to up the pace as it does get a bit too involved and a bit like an episode of Eastenders at times, but there's great music and appearances by the Real Thing and the Cimarons along the way. One thing I'm shocked I missed watching it in the 70s was the great Vivian Stanshall as warden of the mission, I'd love to know how that came about. It's brilliant that its now on DVD and well deserves a place in British film history.","user":"malcp","rank":[4,4]},{"title":"The Minstrel Show revival","rating":24,"date":"24 April 1999","review":"'Black Joy' the title should set one off, black life in London in the 1970's (according to whom?). As one of my mates said, it's the British 'birth of a nation'. Looking at the 'black experience' through the distorted eyes of a white man. This is 1977, when reggae, dub, other JA music was stepping up, by brothers for brothers, and this movie comes out of nowhere with a total different and warped perspective. Maybe the Brits were trying to copy the US Blaxploitation scene, maybe they still haven't got over their fetish/fascinationa for all things brown and black from the commonwealth, or maybe this was made in revenge for the the Black and White Minstrel Show being taken off the air a few (yes only a few) year earlier. Whatever, do see for the same reason one should see 'Birth of a Nation' in a historical and cultural context. This is how 'Great Britain' saw  black commonwealth members once they came to the mother country.<br><br>What makes it so disgusting, is that the voyeurism is so blatant. I mean a film called 'Sofia' made in the 1950's dealing with race etc in Britain has its own stereotypes but at least there was a sense at social reality, of social comment...kitchen sink drama if you will. This film has nothing but British equivalents to the images you find in Bogle's Toms, Coons, Mammies, Mulattoes, and Bucks all from a country that continually brags in its BBC accent that it knows better... Final point, is to compare it to Babylon which comes in the next decade, and see how the characters are now are all Youth, as in the young black male whose too cool to conform.","user":"Zeech","rank":[4,37]}]