[{"title":"My favorite culture clash comedy ever!","rating":9,"date":"12 January 2005","review":"I first saw one scene of this largely forgotten movie on TV in the early '80s. A white man told his white wife that the black teenage boy with them was his son. She became hysterical and told her husband that God would never forgive him. He responded by saying \"How do you know? Maybe he's pleased? Maybe God is black!\" As a white kid about 12 years old, somehow I found \"Maybe God is black\" to be one of the funniest things I'd ever heard! Over the years, I quoted that line many times, mostly in arguments with my mother and maternal grandmother about inter-racial marriage. I supported it and they opposed it, though their opposition was out of fear of the social stigma rather than hatred for other races.<br><br>That scene was all that I ever saw of \"Carbon Copy\" until I was 19, when I saw it in a video store and rented it. I loved it but didn't see it again until getting the newly released DVD for Christmas last month. Now 34 and in an inter-racial marriage, I find the movie funnier than ever!<br><br>Now for my synopsis of the movie! Walter Whitney (played by George Segal) is a wealthy businessman who lives a high society lifestyle with his snobbish wife Vivian (Susan St. James) and his equally snobbish step-daughter Mary Ann (Vicky Dawson). That changes one day when a 17-year old black boy named Roger Porter (Denzel Washington in his first movie) arrives at Walter's office and, after an extensive display of crude behavior, cheerfully says \"Hi, Daddy!\"<br><br>It turns out that Roger was the product of Walter's relationship with a black woman, now dead, who he loved. But he left her when his longtime employer and now father-in-law Nelson Longhurst (Jack Warden) advised him that it would be harmful to his career to be with a black woman. It's also revealed that Walter changed his last name from Weisenthal to hide his Jewish ethnicity.<br><br>Walter is shocked to learn that he has a son and nervous about the way it might disrupt his life. But he attempts to help Roger by telling Vivian that he wants to adopt a poor child for the Summer to show him a better way of life. Vivian reluctantly agrees, then changes her mind shortly after meeting Roger, which leads to the scene that I mentioned to start this review.<br><br>Vivian proceeds to kick out Walter and her father fires him, takes his company Rolls Royce and his many job benefits. Walter learns that his total worth is the $68 in his wallet.<br><br>So Walter and Roger, the day after meeting, seek shelter together. They first check into a cheap motel and later move into an apartment in Watts while Walter looks for a new job. But in the town of San Marino, his reputation turns out to be ruined and out of desperation to make some quick cash, he ends up shoveling horse manure.<br><br>As the movie progresses, it's obvious that Walter regrets leaving Roger's mother. And now he must decide whether to keep Roger at a distance for the sake of social acceptance or try to make up for the mistakes of his past by attempting to build a close relationship with his son.<br><br>Throughout the movie, the interaction between Walter and Roger is fabulous. Though they are father and son, their lives have been radically different. Their cultures often clash and this results in many hilarious situations. The movie does a great job striking the very difficult balance between having fun with racial stereotypes but still condemning racism.<br><br>And during the last 15 minutes, when the movie makes the transition from comedy to drama, it does so surprisingly smoothly.<br><br>In conclusion, \"Carbon Copy\" gets my vote as the best culture clash comedy ever. I also consider it to be one of the most underrated movies ever. It's a great movie to watch for lots of big laughs. 9/10.","user":"leczorn","rank":[32,37]},{"title":"One of the world's most underrated comedies!","rating":9,"date":"8 November 2006","review":"I saw this movie in the 1980s on German TV (in English). Fortunately, I taped it, because I never saw it again -- until 2006 on the MGM cable channel (and now I recorded it on DVD!). In the meantime, I wrote a thesis that dealt, among other things, with integration and denial issues (compare it to Woody Allen's \"Zelig\", for example!), and I found more quotable poignant and funny lines in this movie than in any other. On top of it, it has all those minor jokes that you probably won't catch the first time around and that make a comedy great. This movie is extremely funny, well written and has great actors, who should really be proud of it. The only thing that surprises me is that with all those big names attached the movie is so frequently overlooked and almost forgotten. If you haven't seen it and get a chance to, by all means, watch it and spread the word. By the way: I won't claim I saw Denzel's potential back then, but when I look back at this movie now, in hindsight, you can detect an Oscar winner in the making. Why didn't I give ten points? Well, I have to admit that the movie tapers off a bit at the end. If it had started more slowly, it would be OK, but the first half is just one funny line after another, and it just doesn't keep up its pace. And maybe the end is too unrealistic -- but then again, what do you expect from comedy? For me, it still works because it has a lot to say, and it does so in a brilliant way.","user":"TeeJayKay","rank":[15,17]},{"title":"Funny and poignant","rating":9,"date":"8 March 2006","review":"This was the first time I had seen Denzel Washington and our family really enjoyed the movie. We are a Black family, so the White dad buying into the stereotypes about Black people struck us as quite amusing and he deserved his comeuppance for his sorry thinking. The movie was funny and also touching. True, there was a lack of depth in some of the acting, but not all movies that are made contain a great amount of depth. For the most part, if you want to watch a movie that won't assault your eyes or ears, yet entertain you with some true and humorous depiction of slices of life, this is a good one to check out. I've been a Denzel fan ever since I saw \"Carbon Copy\" and it is a part of my \"favorites\" collection.","user":"tsarevich1","rank":[18,22]}]