[{"title":"The Ever Classic Crawford.","rating":7,"date":"7 May 2009","review":"POSSESSED (1947) is a somewhat underrated Warner Bros.noir. With an excellent central performance from its star Joan Crawford this highly charged drama should be better thought of than it is and deserving of much more exposure. It is one of Crawford's best pictures so this overdue release on DVD is something of an event!<br><br>Crawford, fresh from winning an Acadamy Award for \"Mildred Pierce\" looked as if she was trying for another one here with her well measured portrayal of a neurotic private nurse in the employ of Raymond Massey. But she is unable to deal with the intensity and frustration of her unrequited love for a young engineer (Van Heflin). It all gets too much for her and she finally snaps culminating in a tragic final reel!<br><br>Crawford gives one of her great wide-eyed antagonistic performances with fine support from Van Heflin, Raymond Massey (in one of his more amiable roles), the ill-fated Geraldine Brookes (whose previous film for Warners just before this was as Errol Flynn's younger sister in \"Cry Wolf\") and Stanley Ridges as Crawford's psychiatrist.<br><br>From a cracking screenplay by Silvia Richards and Ranald McDougall (who also wrote \"Mildred Pierce\") the picture turned out to be a splendidly absorbing drama thanks to the smooth and solid direction by Curtiz Bernhardt, the stylish and sharp monochrome cinematography of Joseph Valentine, an effective score by the great Franz Waxman (featuring Schumann's rhapsodic \"Carnaval - Opus 9\" \"played\" by Van Heflin) and most of all to the outstanding performance of Miss Joan Crawford.<br><br>A nice package - extras include a ten minute featurette on the noir aspects of \"Possessed\", a good commentary by film historian Drew Casper and an excellent trailer.","user":"jpdoherty","rank":[30,30]},{"title":"Joan at Warner's - she ROCKS","rating":8,"date":"5 December 2005","review":"For the young Joan Crawford, MGM was the perfect studio. All that gloss, rags to riches, Gable, and gowns. But MGM had a hard time with actresses as they aged and the old formulas weren't working anymore - Shearer, Garbo, and Crawford being three such examples. The other two quit, but Joan went over to Warner Brothers and revived her career.<br><br>It was a good move. I love the Crawford films at Warner's. They were grand potboilers enlivened by her presence.<br><br>Possessed is post-war, and after the war, the new rage was psychology. This movie is full of it. I'm not sure the diagnosis and terminology is correct in the film, but in layman's term, Crawford plays a total whack job. As her story unfolds to a doctor, she's a nurse taking care of Raymond Massey's wife, and she's seeing Van Heflin on a casual basis. When she falls in love with him, Heflin announces he's restless because of the war and is taking off. And that's when Joan takes off - emotionally. She becomes completely obsessed with him, and this leads to hallucinations, hysteria, and finally a psychotic break. She has able assistance by Heflin, who pops in and out and gets involved with Crawford's stepdaughter (Crawford is now married to the widower Massey). When the movie begins, she's wandering the street saying \"David,\" which is Heflin's name in the movie.<br><br>One of the posters suggested Tyrone Power for this role. I'm all for him in any movie, and it's true, the presence of a big star as David would have elevated the film to a grander status. As it is, it's an excellent vehicle for Crawford, who runs the gamut of emotions.<br><br>Raymond Massey is stoic and solid as Crawford's new husband, and the lovely Geraldine Brooks, who died too soon, plays the stepdaughter. Her youthful vivacity is in sharp contrast to Crawford's borderline insanity and makes for great watching. Heflin, as the object of all the possession obsession, is smooth and detached.<br><br>But make no mistake about it. This is Joan Crawford's show and she makes the most of it. The script will keep you interested, and you won't be able to take your eyes off of Joan descending into madness.","user":"blanche-2","rank":[26,30]},{"title":"Crawford excels in compelling drama","rating":9,"date":"10 February 2006","review":"Before \"Play Misty For Me\" (1971) and \"Fatal Attraction\" (1987), comes this story of a nurse (Joan Crawford) who's attached to a man (Van Heflin), who eventually finds her too possessive and breaks it off, but she can not let him go. When they meet again at her employer's (Raymond Massey) residence, she wants to resume the relationship, saying its awful for a woman to lie down at night and not be able to sleep, but he still won't take her back. She eventually accepts widower Massey's marriage proposal, explaining that it's terrible for a woman to be unwanted, although she's not in love with him. Eventually, Massey's daughter Geraldine Brooks starts to date Heflin, further complicating matters, and putting Crawford over the edge. Script, photography, direction, music are exemplary, the 4 leads are memorable, but Crawford is particularly riveting. Her first breakdown (at Massey's waterfront mansion) with Heflin might be considered over-the-top 40s style acting (pre-Method), but she delivers it beautifully, her face and expressions a towering display of emotion and angst. It's a performance that Crawford must have pulled from her own life experiences to achieve such rising momentum. No wonder actor Cliff Robertson (her co-star in \"Autumn Leaves - 1956) once stated in a documentary that she's \"a damned good actress.\"","user":"twanurit","rank":[24,28]}]