[{"title":"Enjoyable, watchable for adults as well as young people","rating":7,"date":"1 October 2000","review":"I remember seeing this as a kid in the theatre, and saw it again for the first time in many years on cable recently. I was surprised how much I enjoyed it after all this time. Russell's performance is quite believable, despite the fantastic story line. Really good entertainment, and blows away much of the modern Disney entertainment provided these days, which is pretty nauseating.","user":"agentr63","rank":[30,38]},{"title":"A Disney Date for Kurt Russell, Frank Webb and Jon Provost","rating":6,"date":"18 April 2010","review":"Squeaky-clean cut collegiate Kurt Russell (as Dexter Reilly) downloads data from his campus computer, and becomes a \"cause celebre\" by demonstrating his improved mental gymnastics. \"The Computer Wore Tennis Shoes\" continues the Disney studio's successful run of comedies featuring good-looking youngsters, great character actors, and a plot providing its star with a super-human strength. The first follow-up film had Mr. Russell discovering how to become invisible. Since it's a Disney film, the characters aren't too quick with the obvious (like the invisible hanging out in the girls' locker room), but everything is certainly likable.<br><br>The film is chock full of familiar favorites, like veteran Cesar Romero (as A.J. Arno), Joe Flynn (from \"McHale's Navy\"), and William Schallert (from \"The Patty Duke Show\"). Getting to play in roommate Russell's top bunk is handsome blond Frank Webb (as Pete Oaks), who also joined Russell and Medfield College co-star Jon Provost (as Bradley) in the pages of \"16\" and \"Tiger Beat\". The teen magazines duly noted the presence of three of their own in one film. Mr. Provost had background fame as the second kid to own TV's \"Lassie\" and Mr. Webb ended his career tragically. Both feature prominently in the film's relatively fun conclusion.<br><br>****** The Computer Wore Tennis Shoes (12/31/69) Robert Butler ~ Kurt Russell, Frank Webb, Cesar Romero, Jon Provost","user":"wes-connors","rank":[5,6]},{"title":"Good family fun","rating":8,"date":"10 December 2009","review":"This was the first movie I saw with Kurt Russell, and have been a fan of him ever since. His acting in this film, as well other Disney films he was in, shows young Kurt firmly grasping what it takes to be a good actor, and he continues to do so to this day.<br><br>I saw this again recently, and its such a relief from some of the crap that Disney puts out now. Its a good example of good, clean family fun without the added bathroom jokes, etc., and for that reason I can see this might not appeal to kids today. But still, its a good, light-hearted comedy that'll still get a few laughs even today. Joseph McEveety provides a good story, and director Robert Butler executes it nicely. Joe Flynn and Cesar Romeo delivered some great performances, as did all the supporting cast.","user":"gigaman1989","rank":[8,12]}]