[{"title":"Thoroughly Inept But Quite Watchable","rating":20,"date":"20 June 2001","review":"While it thoroughly deserves its reputation as a film only worth seeing so that you can enjoy its remarkably amateurish production, on the other hand it seems a bit unfair to label \"Plan 9 From Outer Space\" as the worst film ever made.  Most of it is quite watchable, it's not at all offensive, and the story - utterly ridiculous as it is - moves fairly quickly, and gives you some reasons to stick around to the end.  Those qualities put it well ahead of a great many movies that cost a lot more to make and that involved many more recognizable names than you'll find in this cast.<br><br>To be sure, almost everything about it is of amazingly poor quality, from the incompetent directing and acting to the slipshod special effects to the dialogue that produces countless unintentional laughs.  The story is goofy, and uses ideas and devices that lack credibility even by sci-fi standards. Everyone who watches it has their own list of favorite examples of this film's complete ineptitude.<br><br>If you have any interest in old movies, you should see this if you have the chance, as long as you can do so without paying for the privilege.  It says something that so many viewers are still talking about it over 40 years after it was made, which is a lot more than will ever be said about most of the movies you could see in a theater today.  Whether you will ever want to watch it again is an entirely different question, although there are those who have managed to enjoy watching this several times.  Take a look for yourself and see what you think about this classic example of inept film-making.","user":"Snow Leopard","rank":[184,200]},{"title":"A classic of the bad sci-fi genre","rating":10,"date":"25 May 2005","review":"This is one of the best of the worst films of all time. When viewed with the right mindset it never fails to entertain. Poor production values, terrible acting, worse directing, and dialog that has to be heard to be believed, combine to create a cinematic gem.<br><br>When speaking of bad movies, it is important to understand what is meant by \"bad\". There is good bad, and there is bad bad. Bad bad is a movie that combines all the elements listed above--bad acting, bad directing, etc.--to produce something that bores. Good bad combines the same elements in such a way that a highly entertaining movie is made, although not in the way the movie makers hope.<br><br>\"Plan 9\" is not just good bad, it is brilliant bad. It is unintentionally hilarious, and that's as funny as it gets. This is a movie that has absolutely no redeeming qualities. Everything about it is bad. When George Romero made \"Night of the Living Dead\" he did it on the cheap, but still produced a film that was intense, scary, and had a point. \"Plan 9\" is nothing but bad, albeit in a wonderful way.<br><br>As an example of bad production values, there is a scene where a police car is speeding away from headquarters. As the action begins it is broad daylight. The next scene is the car racing across the city. Now, however, it is night! Next is the car arriving at its destination, a cemetery, and again it is daylight. That is either one huge city, or somebody on the Plan 9 crew was asleep at the switch.<br><br>\"Plan 9\" is so full of great badness that to detail all the goofs, flubs, and cheesiness would require remaking the entire movie. The cemetery is a weed-infested lot; an airline cockpit set is a shower curtain, some plywood and a couple chairs; a cop scratches his head with the business end of a gun barrel; the outside of the space ship has a ladder that goes nowhere; the plan itself, that is, plan number 9, makes no sense at all. And on and on and on...<br><br>If you love movies, and want to consider yourself conversant in all genres of film, seeing at least one bad sci-fi movie is a must. \"Plan 9\" is the Hamlet of that genre. See it with a couple people who get it, and have a great time.","user":"rtim12","rank":[229,253]},{"title":"Deaf Person's Review","rating":19,"date":"19 February 2003","review":"OK, I'm Deaf. There are no subtitles in this movie. Usually, I would turn it off after five minutes because there was too much talking.<br><br>But this was different... it was hillarious even without dialogue. The hearing person I was watching it with told me that I could  make up my own dialogue and it would be better.  Now, I don't know how true that is, but any movie that I can watch without subtitles is a 10 in my book.<br><br>Hillarious. :)","user":"DeeJayPip","rank":[56,59]}]