[{"title":"Finding Humor in a Serious Places Makes for Interesting Film","rating":8,"date":"18 December 2013","review":"C. Thomas Howell comes from a rich family and has been accepted to Harvard, but, when his father expects him to pay for his own college education and won't finance it, Tom goes to drastic measures for a scholarship. It seems that Harvard has, in this movie anyway, a scholarship for the most qualified African-American that comes from a certain demographic. So, of course, he goes black face and gets some soul, brother. I said soul. What actually sounds like a pretty lame, almost offensive, and just plain stupid film turns out in fact to be one of the most thought-provoking 1980s comedies made. Granted, it might be biting off more than it can chew, but this film is genuinely funny and has characters that are three-dimensional due in part to good acting by Tom; Rae Dawn Chong, who plays a student he starts to care for; and teacher James Earl Jones. My two favorite moments in the film are when he tells his parents, \"Mom, Dad, I'm black!\" and when he tells teacher James Earl Jones, \"No sir, I didn't quite learn how it feels to be black, because I could at any time go back to being white.\" That moment really made the film for me, as it defines the difference between putting yourself in someone's place and actually being them. I see this film, from all the ratings, has a low mean, but I think it deserves better, as it's a very entertaining and funny film, while having moments that speak to the viewer in its indirect and subtle way without being preachy. I would definitely watch this again and would recommend it for those who like comedies with a little soul and substance to it.","user":"JLRMovieReviews","rank":[18,20]},{"title":"a awesome but misunderstood film","rating":30,"date":"30 April 2004","review":"In this day of PC rubbish this film probably would cop a lot of flak if it was re released. People actually picketed this film in its day  and it has been given the needle from Spike Lee and Eddie Murphy. Well, I am black and didnt find it offensive at all, in fact if people want to attack it and say it is they might want to look at more deserving features that are released nowadays . I personally find most of the stereotypes in the aforementioned directors films quite insulting but that doesnt mean I will hate their work. This movie, although a little awkward in its delievery is obviously made with good intention and should be commended for telling a story with very truthful elements to it. If you cannot see that then you are missing the point. The best and most significant scene is when Mark watson sits down with his rich white girlfriends family for dinner. the scenes they evision are absolutely hilarious and painfully real ...especially priceless is Leslie Nielsens thoughts. a very very funny  but misunderstood film (by the wowsers anyhow). relax and enjoy a great teen flick with a real message underlying, if nothing else enjoy the scenery chewing by James Earl Jones, Rae Dawn Chong , Leslie Nielsen and a early Julia Louis-Dreyfus. excellent fun.","user":"PeteStud","rank":[74,102]},{"title":"Soul Man Goes To College Of Hard Knocks","rating":6,"date":"19 October 2008","review":"When Soul Man first came out it got razzed terribly for joking about a sensitive topic. I think the critics didn't quite get the film, they thought it was a racist attack on minorities.<br><br>Set aside scholarships are private and what C. Thomas Howell does is attempt to defraud the givers of said scholarship by passing himself off as black. Picture if you will somebody like Fred Phelps endowing a scholarship to Bob Jones University, the only place I'm aware that would take his money, on someone that Phelps feels reflects his proper and God inspired outlook on the American scene.<br><br>But it would be legal because it's Phelps's money to do with as he wishes. Now the endowers of that scholarship to Harvard meant it for someone like Rae Dawn Chong. So when Howell grabs it because his parents decide to make him pay his own way and he's too lazy to do it or heaven forfend, go to another law school he is defrauding her.<br><br>That's the sum and substance of Soul Man. Of course in passing himself off as black, Howell makes a few unpleasant discoveries about himself and a lot of people around him. And of course there's that old Cupid thing with him and Chong.<br><br>James Earl Jones makes the most intimidating law professor this side of John Houseman. Arye Gross gets the role of best friend and confidante in Howell's scheme and Melora Hardin who now occasionally plays the ghost of Trudy Monk on Monk is the spoiled rich girl who gets back at her parents by sleeping with minorities.<br><br>Soul Man gets silly and a bit forced at times. But it's not deserving of all the knocks it's been given over the years.","user":"bkoganbing","rank":[16,19]}]