[{"title":"A New Path for Cinema","rating":8,"date":"21 June 2010","review":"How to portray the life of a poet on film without using traditional cinematic language? Armenian director Sergei Parajanov must have posed this question when he set out to adapt to the big screen the life of poet, national hero and martyr Sayat Nova. To say that The Colour of Pomegranates rejects linear storytelling would be an understatement. To say that it employs non-linear storytelling would be a compliment. I think it is more accurate to say this movie doesn't care about storytelling at all. Finding inspiration in the language of painting, Parajanov turns the life of one man into a series of tableaux vivants.<br><br>The movie covers the life of the poet from childhood to death in a monastery, but biographical information is irrelevant. This abstract movie shows his life through the things that surround him - clothes and rituals, the religion, the art, the literature of his country, his family, his poetic muse; the objects and colours and people that left an impression on his imagination. There is no conflict, no goal, no moral, just a life illustrated by symbolic living pictures, each one shot by a static camera.<br><br>Many good movies enthral audiences with greater-than-life characters, byzantine plots or catchy, quotable dialogues. But what is the beauty of The Colour of Pomegranates? The beauty of the movie lies in watching a boy lying surrounded by wet books as they dry on the sun, their pages fluttering with the wind. It's the beauty of highly-stylised human figures performing repetitive and hypnotic movements in strange rituals. It's the scenic beauty of how objects are placed in a landscape or in a room, how they move, how they interact with human figures; of how a costume looks on a human body or how colours are distributed across the screen to achieve harmony.<br><br>Movies like The Colour of Pomegranates are the reason mass audiences despise art movies: cryptic, frustrating, slow paced, boring. Why would anyone want to watch a movie that requires a reasonable knowledge of Armenian history to merely understand its basic premise? And why would anyone then care to enjoy what they've understood from it? And yet it is movies like this that push forward the art of cinema. Many movies exist that make little use of the possibilities of the film medium. So many use the same medium shots, the same dramatic use of music at the right moment, and nowadays the same teal and orange colours. Most movies at the end of the day aren't more than 19th century novels with movement (most are even adaptations). When cinema language, the language that makes cinema distinct from other art forms, is used, when long takes, wide takes or extreme close-ups are used, filmmakers are accused of pretentiousness. But why bother making a movie that doesn't do what only a movie can do? Well, The Colour of Pomegranates does what only a movie can do. It couldn't exist outside cinema. Released in 1968, in the same year 2001: A Space Odyssey blew the minds of mainstream audiences, Parajanov makes Kubrick's masterpiece look conventional. This movie should be studied the way Eisenstein and Hitchcock's movies are today. It should have changed cinema. Unfortunately, whereas Kubrick had the freedom to distribute his movie, Parajanov's movie was being re-cut, censored and banned by Soviet authorities, which contributed to making it practically unknown to many viewers who'd love watching it. Although an integral version has been available for some decades now, this movie is still looking for an audience. And when it finds one, cinema may change forever.","user":"Eumenides_0","rank":[18,20]},{"title":"Beauty, overcoming Time","rating":9,"date":"2 September 2007","review":"Almost everybody talks about the film's beauty and the difficulty of its understanding. It's true. But the difficulty is not from the director's pretension or other shortcomings. <br><br>When this film was first released in Soviet Union, it was shown in third-rated theaters and with limited number of prints. It was not an original version of Sergo Parajanov, because it was re-edited by another director(director's version is said to have been lost for ever, after frequent showing in professionals' circle). <br><br>The film's title was also changed--\"The Color of Pomegranates\" was the title which the administrators of USSR's cinema policy selected to deny \"biographical\" character of the film. In fact, we can see at the very first title that says \"This film is not a biographical film about Sayat Nova...\". In short, they didn't admit such an extraordinary approach in making a film about historical important persons. <br><br>Parajanov's artistic intention apparently went too far, ahead of his time. He wanted to identify the classic poet with himself through the magical play of cinematography, multi-layered mirror-like structure made of image and sound. \"Sayat Nova\"--it's me\", wrote the director in his screenplay by his own hand. <br><br>Soviet censorship may have cut some shots or shortened some episodes, to make meanings and intention,which originally were clear,remain ambiguous. For example, Sayat Nova's anxiety for his Christian homeland threatened by Islamic enemies(this theme is clearly developed in the film's scenario recently published in Russian).Parajanv, an artist indifferent to politic issues, didn't think that religious theme, as well as aesthetic \"anomaly\", might be very dangerous for Soviet directors after the end of \"time of thaw\". Thus the film could'n be a full realization of authors's original scenario.<br><br>Nevertheless,the difficult situation didn't distort the film's concept and vision as a whole. \"Sayat Nova\" is still brilliant art of work,and, as many masterpieces of Cinema, will overcome Time by its beauty.","user":"shusei","rank":[43,53]},{"title":"Fascinating and unusual film","rating":8,"date":"7 April 2007","review":"The Color of Pomegranates (made in 1968, and also released under the name Sayat Nova) is not really a conventional movie. It is more like a series of tableaux \"inspired\" by 18th century Armenian poet Nova. It is nonetheless fascinating, and should be required viewing for anybody interested not only in Armenian culture but in cinema in general (or, if you wish, the visual arts). This movie has inspired many artists, including some music videos (admittedly not among the arts' highest form), including REM's \"Losing my Religion\" and Deep Forest's \"Sweet Lullaby. There is a heavy homo erotic subtext to many of the tableaux, and as a matter of fact, Paradjanov would later spent several years in jail in the Soviet Union accused, among other things, of homosexuality. Though released under international pressure, it would take him another 16 years to make another movie, shortly before his untimely death in 1990.","user":"Andy-296","rank":[32,41]}]