[{"title":"Dietrich, A Devious & Dangerous Delight","rating":10,"date":"17 April 2002","review":"A young Spanish radical in old Sevilla learns that THE DEVIL IS A WOMAN, when he falls hopelessly in love with a mysterious female.<br><br>Mesmerizing &amp; hypnotic, this is a film which arouses all the senses. Dreamlike in its visuals &amp; nightmarish of plot, it presents imagery so persuasive as to be practically palpable. Director Josef von Sternberg &amp; writer John Dos Passos constructed a miniature madhouse for the mind, in which the viewer gladly finds himself consigned.<br><br>Fascinating, coy, deceptive, utterly alluring, Marlene Dietrich dominates the film as an icy-hearted harlot who strews her pathway with the broken bodies &amp; wasted lives of the men she's betrayed. With heavily lidded eyes peering out of her disturbingly beautiful face, she is the very picture of sardonic seduction. Wisely, the film allows her a moment of amusement (for the viewer), letting her perfectly sum up her philosophy in the comic song Three Sweethearts Have I.'<br><br>Dietrich's two leading men are both excellent. Lionel Atwill, sadly ignored today, once again exhibits the depth of his acting talent; Hollywood's propensity to place him in horror films often obscured his abilities. Here, he shows us a man fully aware of his complete degradation. Cesar Romero, in one of the finest roles of his early career, more than adequately carries on the tradition of the Latin Lover, but with a twist - here is a romantic hero who is not strong enough to escape from the web of the female spider.<br><br>Peevish &amp; pompous, Edward Everett Horton is thoroughly amusing as a flustered Spanish bureaucrat.<br><br>Two wonderful English character actresses enliven the proceedings in small roles: Alison Skipworth as Dietrich's disreputable matriarch and Tempe Pigott as an old one-eyed harridan.<br><br>Movie mavens will spot Edwin Maxwell as the manager of the cigarette factory and Charles Sellon as a professional letter writer, both uncredited.<br><br>Von Sternberg created a masterwork of cinematic symbolism, with innuendo so rife it is incredible it passed the Production Code. In every way, the film is a worthy follow-up to his previous collaboration with Dietrich, the orgiastic SCARLETT EMPRESS (1934).","user":"Ron Oliver","rank":[36,43]},{"title":"THE DEVIL IS A WOMAN (Josef von Sternberg, 1935) ***1/2","rating":8,"date":"2 June 2011","review":"This was the seventh and last (indeed, it had been announced as such from the outset by Paramount) of the celebrated cycle of cinematic collaborations between Sternberg and Marlene Dietrich and is said to have been both their own favorite – incidentally, with it, the two effectively came full-circle by making another film (as was their first joint venture, THE BLUE ANGEL {1930}) that revolves around a middle-aged man ruining himself for love of an ungrateful young woman. It was also the third adaptation of Pierre Louys' novel \"The Woman And The Puppet\" that had been much admired by the French Surrealist movement and, appropriately enough, was remade much later by Luis Bunuel in 1977 as THAT OBSCURE OBJECT OF DESIRE (which turned out to be his own swan-song).<br><br>Like that version, here we also have the long-suffering 'puppet' (Lionel Atwill in one of his best non-horror roles) narrating his misfortunes with the 'woman' – albeit to a best friend (a young Cesar Romero, replacing Joel McCrea who walked off the set after a single day's shooting!) in a Spanish cantina rather than to strangers on a train! Sill, like the earlier 1929 French version, the male lead (here renamed Pasquale) meets Conchita on a snow-derailed express where Dietrich (dressed as a nun!) takes on an unattractive gypsy female dancer and he intercedes to put an end to that struggle; incidentally, there had also been a nun passenger in the Baroncelli version but she was shown sleeping through the whole ordeal! Speaking of Atwill, he had previously acted opposite Dietrich in her first non-Sternberg Hollywood film, Rouben Mamoulian's THE SONG OF SONGS (1933) which I plan to catch up with presently; besides, Sternberg was summoned to give evidence at Atwill's 1942 trial (concerning an 'immoral' Christmas 1940 party) in which the actor infamously perjured himself and, consequently, was ostracized from Tinseltown's major league and forced to spend his last four years slumming it in third-rate (if not disagreeable) flicks! <br><br>This being an adaptation emanating from Hollywood's Golden Age, it is unsurprising to find the supporting roles filled by such amiable character actors as Edward Everett Horton and Alison Skipworth (in a bigger role – as Dietrich's mother – than her character gets in either of the other available versions) who are usually known for comedy and indeed supply some non-intrusive comic relief; equally par for the course is having Dietrich sing an amusingly suggestive number and don some of the kitschiest costumes – even if, ostensibly, she is playing a poor Spanish girl! The film is set during the carnival season and this grants Sternberg the opportunity to devise some remarkably atmospheric masks; indeed, the director must have known this was going to be his last film with Dietrich because he photographed the film himself (although the great Lucien Ballard gave uncredited support – or, rather, was learning the ropes – in his second of four consecutive films for Sternberg).<br><br>Having been made after the Hays Code came into force, the film fell victim to censorship (and even a ban threat from Spain!) but its impact still comes through; a notable change concerns the famous nude dance performed by Conchita and the humiliation endured by Pasquale at her house: celebrated novelist John Dos Passos, who adapted the Louys novel, still made Dietrich a tramp, while Sternberg displayed the power of the moment through camera-work, the décor and the elements (rain is pouring down throughout the scene! The film runs for just 80 minutes but feels somewhat longer – especially since the narrative goes on after the main story had ended in the other two versions I watched and includes exclusive incidents: a duel between the two men, a visit to a hospitalized Atwill, Conchita about to leave with Romero but deciding to stick with Atwill, etc.<br><br>I had watched THE DEVIL IS A WOMAN twice previously on Italian TV in an English-language print that was accompanied by Italian subtitles that were so large that they obscured a good part of the screen!; this new viewing came via Universal's 2-Disc Set \"Marlene Dietrich: The Glamour Collection\" which features two double-features on a double-sided disc (the film under review sharing disc space with Rene Clair's THE FLAME OF NEW ORLEANS {1941}) while, bafflingly, Mitchell Leisen's GOLDEN EARRINGS (1947) has a disc all to itself! Funnily enough, this being yet another case of those maligned DVD-18 discs, I was unable to start the feature by pressing the \"Play\" button and had to do so from the chapters menu! Incidentally, the later Julien Duvivier/Brigitte Bardot remake was alternatively known as A WOMAN LIKE Satan (while is, alas, currently available only in unsubtitled form!) and there are at least two more unrelated but notable films known as THE DEVIL IS A WOMAN: Stephanie Rothman's THE VELVET VAMPIRE (1971; which I have never seen) and Damiano Damiani's star-studded nunsploitation effort, IL SORRISO DEL GRANDE TENTATORE (1974)! Ironically enough, Sternberg had intended calling his film \"Capriccio Espagnole\" (which would actually be retained by the Italian release prints!) but was vetoed by Paramount's current Head Of Production, Ernst Lubitsch!","user":"Bunuel1976","rank":[17,19]},{"title":"Wise Up, You Fool!!!","rating":7,"date":"25 June 2006","review":"This is a strange movie, perhaps because there is so little of a story in it, and at the same time keeps your interest through different visuals and witnessing a woman in action who seems to lack any kind of conscience or morals (hence, the title).<br><br>By \"different\" visuals, I mean that many scenes are congested, if that's the right word. You have to look through streams of confetti, tree branches, vast crowds, or whatever on at least 33 percent of the movie. Few shots are clear ones, except closeups of the star, Marlene Dietrich, or the two men involved with her, Lionel Atwill and Caesar Romero. This is especially true in the first 10 minutes of this 80-minute film in which we view a chaotic carnival going on in the streets of Spain. The DVD picture, however, was sharp and overall this is a good visual film. Many scenes reminded me of shots you'd see in film noirs, a decade or more after this movie was made.<br><br>Much of the story is told in flashback as Atwill, an older man, sits down at a table and tries to talk young-stud Romero out of getting involved with the evil \"Concha\" (Dietrich), recounting the horror stories he endured while trying to woo that woman.<br><br>Dietrich plays one of the most shallow people you will ever see on film. She only uses the older man to get his money (gosh, do women do that in real life?) and discards other men like one would a chewing gum wrapper. She treats Atwill like dirt, cheating on him at every opportunity. She makes no secret of it, hurting him deeply each time, but the poor sap keeps coming back for more! In fact, he usually comes back begging!! From a man's point, it's almost maddening watching this movie. I wanted to reach into the screen, grab Atwill and slap him, saying, \"Wake up, you fool.\" His absolutely pathetic weakness with this woman was frustrating for me to watch.<br><br>Dietrich is so devoid of character, she's almost mesmerizing to watch. I can't believe some of the cold, callous remarks that slip off her tongue as if they meant nothing and she had said that a million times. Maybe she had. The film is aptly titled as the devil is described in the Bible as someone who can make harmful things look the most alluring to us. That seems to be the theme in this film: man is weak and a beautiful woman can make him do things he will regret. Atwill's \"Pasqualito\" (as Concha calls him when she wants something) is the supreme example.<br><br>Despite all the warnings, Romero's character chases after the woman, too.Atwill becomes instantly jealous when he hears about it (he can't quit her no matter what he promises) and a duel ensues. At the very end, we get another big surprise from Dietrich.","user":"ccthemovieman-1","rank":[22,28]}]