[{"title":"What memories this must have dredged up","rating":8,"date":"9 December 2004","review":"Having served in the US Army-Europe in Germany it was easy to see that this work was an accurate depiction of the world as Germans saw it in those years. Going to the IMDb database confirmed that it was filmed in Wurzberg, a city I visited many times. One can not help but wonder what memories and nightmares came back to life for the German people in this movie, or the ones who viewed it, or even witnessed the movie being made. The film is so very realistic in script, acting, and setting that some must have almost thought WWII was alive again. For those that lived through WWII in that country it must have seemed as if those days were repeating themselves. Every detail of this movie is accurate as far as I could tell. It does not employ overused stereotypes, no action heroes, no earth shaking grand and glorious finale, it simply depicts a period of time in all its' tragedy and irony in a most realistic manner. This work deserves more praise and exposure than it has received. A must see for every WWII researcher and historian.","user":"fmadams","rank":[78,81]},{"title":"Exceptionally realistic and well-acted anti-war film","rating":10,"date":"31 December 2000","review":"Decision Before Dawn, released in 1951--only 6 years after the end of WWII--is set in the final months of that war, and relates the story of three soldiers who go behind German lines as spies. Richard Basehart plays an American intelligence officer, with Oskar Werner and Hardy Kruger as two German POWs who have volunteered to accompany him for reasons of conscience. The protagonist is the Oskar Werner character, playing a young German Medical Corps Non-commissioned officer. In the course of his task, which is to locate a specific Panzer division and report its position back to Basehart, he undergoes a range of experiences that paint a realistic picture of the last days of wartime Germany. His pacifism and loyalty to his country and family (whom he visits) are challenged by his decision to help his American captors and the necessity to perform all that entails. Well acted, scripted and very realistically propped and photographed, Decision Before Dawn ranks very high on the list of thoughtfully made and thought provoking war films.","user":"zinkster","rank":[39,40]},{"title":"Well-written, well-acted. Great \"issue\" film","rating":8,"date":"8 December 2000","review":"A taut story, first-rate acting, and a compelling subject make this film worth seeing.<br><br>Espionage/spying is a tricky subject, but \"Decision Before Dawn\" handles it brilliantly. No flash, no Mata Haris, no absurd coincidences. Weaving human drama and the grim realism of war, this film is that rare gem that manages to teach without preaching.<br><br>Among the superb performances is our hero Happy, played with just the right blend of suspense and humanity by Oskar Werner. Happy (an ironic name given to him by his American overseers) is torn between love of his native land and his duty to what is right. Werner walks this tightrope better than most I've seen.<br><br>In the end, however, it's the script that is the true gem of the film. Peter Viertel is a master story teller, with such great screenplays as \"Saboteur\" and \"The Hard Way\" to his credit. Viertel, with a story by author George Howe, weaves an intricate, but not confusing, narrative of war and devotion and duty. He's one of the few _writers_ I look for when I check out \"On TV This Week\" on IMDB.","user":"JulieKelleher57","rank":[39,40]}]