[{"title":"Freda Goes Wild, Kinski Plays It Cool","rating":29,"date":"29 January 2003","review":"I fell in love with this movie from its first frame. Or, at any rate, the first BOOM-BANG-CRASH-WALLOP of its fabulously over-the-top piano soundtrack - as if Liberace were stationed just off camera, with blazing gold candelabra and rhinestone-studded Steinway grand. Its visuals are, if possible, lusher than its score. Crystal vases weep rose petals over the photo of a murdered woman. Venetian glass mirrors reflect the elegantly chiselled face of Klaus Kinski - glowering at us seductively over a polka-dotted silk cravat.<br><br>If you are used to Kinski hamming it up in a Herzog epic, his role here is a revelation. As a London millionaire who may or may not have murdered his lesbian wife, he is so subtle and ambiguous, so - dare I say it? - restrained that he keeps us guessing right up until the last few seconds. Seeing her 'come back to life' in a porno film (shot after her death) Kinski's face takes on a haunted look that outdoes all his raving, eye-rolling and tooth-gnashing in more famous roles.<br><br>Proof, if proof were needed, that director Riccardo Freda was not just a great unsung visual stylist, but a maestro of mood and suspense. Imagine a Chabrol or Hitchcock with the eye of a Renaissance painter, and you come close to the splendours of this film. So exquisite in its visual detail that its minor flaws - i.e. blatantly fake model car wrecks; continuity howlers such as Kinski walking bareheaded through Soho, then sitting in a nightclub with his hat on - simply evaporate before our eyes.<br><br>Oh, and I even like the tacky Italian pop ballad that keeps recurring as a 'clue' - to oddly chilling effect. So perhaps I'm just a sucker for this type of film.<br><br>David Melville","user":"dwingrove","rank":[13,18]},{"title":"KLASSIC KINSKI","rating":8,"date":"25 June 2019","review":"I've enjoyed the work of Klaus Kinski for years now. But until seeing this film, DOUBLE FACE, I'd never seen him play a good guy. He's played mad scientists, authors, serial killers and gunslingers but everything I can remember him in he's played a bad guy or someone insane. It was interesting to see him do something different, almost a romantic lead.<br><br>Kinski is narrating the tale at the start as John Alexander, a wealthy businessman who meets and rapidly marries Helen (Margaret Lee). At first happily married a few years pass and things begin to change. For one Helen's proclivity for women surfaces and she doesn't hide it, her lover going so far as to spend her time living with the couple. Helen is heading out for some time alone when her car explodes and runs off the road, killing her. We'd seen someone attach a bomb to the car, now we're left to wonder who the culprit was.<br><br>When suspicions arise and the fragments of bomb are found the immediate suspect is always the spouse. Even we the viewer aren't sure if John is innocent or not. One night he returns home to find a woman in his shower. Christine (Christiane Kruger) acts as if she's done nothing wrong breaking and entering into his home. Ordering her to leave his tone changes and he goes with her to a club nearby. At the height of the sexual revolution the place is filled with young people semi-clothed in some cases dancing and watching pornographic movies while getting stoned.<br><br>As John watches one such movie he sees Christine in bed with another woman wearing a mask. Recognizing the ring the woman is wearing as well as the scar on her neck, he knows the woman is Helen. Tracking down Helen he asks when the film was shot and she tells him a few weeks back. This means the film was shot after the accident. John now wonders if his wife is actually alive and if so why is she hiding?<br><br>If this sounds like a potential giallo film you aren't far off. It's an example of the German genre \"krimi\" which shares much in common with that genre. The mystery is set in motion and even as the police try and determine along a path different of the one John is on we the viewers attempt to combine the information both find and solve the question on our own. It makes for an interesting film that holds your interest start to finish.<br><br>While foreign films can often find themselves confusing and the acting loses something as they say in translation this one isn't the case. While the motives of various characters are in question their performances add to the story rather than detract. In particular is the performance of Kinski who more often than not is the most self-confident character in the roles he chooses. Here he's confused, angry, sad and more. And he does a great job conveying all emotions.<br><br>Arrow Video is releasing this film with their high standards still intact. It's one of the reasons they have quickly become one of my favorite companies when it comes to disc releases. The film looks fantastic since they have a brand new 2k restoration from an original 35mm negative. In addition to that are the extras we've come to expect from Arrow. This time those include a new audio commentary track by author and critic Tim Lucas, a new interview with composer Nora Orlandi, \"The Many Faces of Nora Orlandi\" a new appreciation of her career by musician and soundtrack collector Lovely Jon, \"The Terrifying Dr. Freda\" a new video essay on Riccardo Freda the director of the film by author and critic Amy Simmons, an extensive image gallery, the original Italian and English theatrical trailers, a reversible sleeve with original and newly commissioned artwork by Graham Humphreys and for the first pressing only an illustrated collectors booklet featuring new writing on the film by Neil Mitchell.<br><br>Arrow may be making other companies releasing material like this look bad but that's all to the good for fans of the films they've taken under their wing. Let's hope they continue to do so in the future.","user":"kirbylee70-599-526179","rank":[3,3]},{"title":"Kinski´s the Good Guy","rating":6,"date":"4 October 2000","review":"Surprise! Surprise! There are not many movies where Klaus Kinski doesn´t play a bad guy. This is one of them. And it´s rather twisted. He´s a prime crime suspect, and we follow him solving the case right to a surprise ending. It´s a German Edgar Wallace adaption directed by classic Italian director Riccardo Freda and , yes, it´s a typical Giallo. So I guess all the fans of those \"normal\" German Edgar-Wallace-Movies didn´t like it very much. It´s only for fans of the director and, of course, the brilliant, astonishing, unforgettable Klaus Kinski.","user":"matalo","rank":[8,13]}]