[{"title":"I love this movie!","rating":10,"date":"9 November 2004","review":"It's hard for me to believe that fourteen years have passed since I first saw this movie. I was only ten at the time, and this was the first movie I ever saw that was both an eye-filling and a mind-filling spectacle. <br><br>It was also one of only two theater-going experiences that I ever had with my late grandmother, and I always think of her when I watch this movie. It always takes me back to an earlier time in my life no matter how many times I see it.<br><br>This is one movie that could only have been made in the post-Vietnam era, when Americans began to question the moral integrity of their country. How else to explain, in the opening sequence depicting the Civil War, the utter cynicism of the soldier who speaks with Costner's Dunbar character? Or Dunbar's later observation that \"there was no dark political objective\" to the Sioux battling the Pawnee? <br><br>The scene in which Dunbar receives his orders from the mentally ill major also seems to speak of Vietnam, the point being I think that while an entire generation of young men was being cut down in the Civil War the West was being managed by those who were not fit for duty in the larger conflict. Maury Chaykin, in that one scene, gives one of the most memorable and haunting performances I've seen in any film.<br><br>This movie's depiction of Native Americans is not nearly as politically correct as it may seem to those who watch it only once or only at a superficial level. In the very first scene depicting Indians, in fact, a Pawnee brave shoots one of the white characters full of arrows and then scalps him. The unrepentant villainy of Wes Studi's character, in particular, recalls the moral simplicity of countless earlier Westerns.<br><br>Even the most sympathetic Indian character in the movie, Kicking Bird, is not kind to Dunbar merely to be friendly but because he believes he can get useful information out of the white soldier about the other whites who are encroaching on Sioux territory. The interaction between Dunbar and the Sioux is powerfully effective precisely because the Sioux remain true to themselves. They are not cartoonishly hostile like the Indians depicted in old Westerns, but they are not soft or naïve either. <br><br>While this movie draws its inspiration from American epics as diverse as The Birth of a Nation (1915) and The Searchers (1956), its originality lies not only in its respect for Native Americans but also in its intensely personal treatment of the main character. Few other three-hour epics (Lawrence of Arabia and Braveheart come to mind ) have developed their protagonists as fully and dynamically as this movie develops Costner's Dunbar character.<br><br>Even after fourteen years, the Dunbar character's arc, going from a suicidal soldier in the opening sequence to an adopted Sioux who in the final scenes puts the needs of his people ahead of his own, is still one of the most remarkable I've seen in any movie. Costner's performance won no awards that I know of, but it provides the movie's indispensably tight focus. He's completely convincing every step of the way, if a bit too clumsy and self-effacing at times, hitting his head in the dark and fainting after a confrontation in a heavy-handed attempt to demystify the West.<br><br>Another quality this movie shares with The Searchers is that it associates the physical challenges of the frontier with the testing of the soul. The Dunbar character cleans out the watering hole at the fort because he refuses to lose his humanity like the men before him who abandoned the fort. Later he cannot decide whether he feel more or less at home in the presence of the Sioux, because he is struggling to remain true to himself even as he remains unsure of who he is.<br><br>This movie probably disappoints viewers who are looking for sheer entertainment. It's a quiet, thoughtful story, and although there is action in it the focus is on how the action transforms the characters (particularly Dunbar) rather than on the action itself. You won't see any computer-generated comic-book characters in this movie, but you will see real people having real conversations, and you'll see Costner and costar Mary McDonnell engaging in such intimate and convincing love scenes that you'll forget they're acting!<br><br>If I could rate the musical score for this movie by itself I'd give it a perfect 10, because it's one of the best I've ever heard, able to stand on its own but fitting the movie like a glove. It is sentimental without being schmaltzy, noble without being pretentious. Best of all, it captures the hesitant emotions of the story, the sense of curiosity overcoming fear and becoming trust.<br><br>Only this movie's extreme length works against its total success, particularly in the special edition that runs nearly four hours. The three-hour theatrical version is still long, but it's difficult to say what should have been left out of it.<br><br>Some people still resent the fact that Costner won the Best Director Oscar over Scorcese's Goodfellas. There's no question that Scorcese is the better director, but I believe the direction of Dances With Wolves is better than that of Goodfellas. If you disagree with me try this test: imagine that Scorcese did this movie, and Costner directed Goodfellas. It's a question of which directing job is better, not which director is better.<br><br>Unlike most epics, this movie ends exactly as it should. The final images, such as the journal floating down the river, the white man and the Native American speaking English to each other, and the brave shouting his farewell from the top of a cliff, are so beautiful and dreamlike that they manage to be both joyful and sad. This is a movie that looks into the very fabric of this country's past, and asks us to do the same.<br><br>Rating: 10 (Good job, everybody.)","user":"PhilipJames1980","rank":[314,361]},{"title":"One of the great ones","rating":10,"date":"27 August 2003","review":"People who say this movie is long and boring have obviously never sat through, oh, \"Lawrence of Arabia,\" \"Patton,\" \"Doctor Zhivago,\" \"The Godfather,\" \"Ran,\" \"Seven Samurai,\" or probably even \"Braveheart.\" Thank God that not every filmmaker believes that a car must explode every 10 seconds in order for his movie to be a success. Kevin Costner is one of those directors who prefers the long format. David Lean, Francis Coppola and Mel Gibson, to name a very few, also worked in that format, and produced lasting works of art that also packed theaters. There are plenty of options for people who don't like movies that take the time to build character, drama and suspense, movies like \"Charlie's Angels: Full Throttle,\" \"Freddy Vs. Jason,\" and \"Weekend at Bernie's.\" I don't think any of those movies has ever been called \"boring,\" but they sure are crap cinema.<br><br>Onward. \"Dances With Wolves\" thrilled audiences way back in 1990 and made so darn much money precisely because people had forgotten the pleasures of the long narrative, the Western genre, and movies that weren't special effects schlock-fests. It remains an inspiring and moving experience, especially on DVD, which preserves the movie's theatrical sound and picture quality.<br><br>Costner's direction is first-rate. He's able to blend intimate drama with big, sprawling action that covers a huge canvas. I'm amazed at how smoothly the film segues from movement to movement -- action, alienation, suspense, social commentary, romance. Heck, Spielberg could take a lesson or two from this movie.<br><br>He also gets great performances out of his cast. I don't think of these people as actors, but as the characters they play. That's a compliment not just to the actors themselves, but their director. And, yes, Costner is terrific as John Dunbar.<br><br>Sure, it's easy to call \"Dances\" politically correct w/ reference to the Indians. But it also treats them as people and, better yet, as fictional characters whose lives are made part of a fascinating narrative. I just consider all the complaints about the politics of this movie as total hogwash.<br><br>Finally, the movie is beautifully shot, has an unforgettable score, and is very well-written. I've never thought of \"Dances\" as a Western, but a modern action picture/character study that avoids all the boring cliches of the Western genre. Here is a movie that stands for something, means something, and deserves at least as much respect as some of the overrated dreck we've gotten saddled with lately.","user":"reporterman2000","rank":[341,411]},{"title":"A story of a lost way of life.","rating":8,"date":"8 August 2002","review":"`Dances With Wolves'<br><br>When I first saw the movie Dances With Wolves several years ago the story affected me in a heavy way, so much so that I decided that it would be a long time before I watched it again.  The story is not entertainment.  It is a lesson.  Last week I watched the movie again with a new understanding. Many of the published reviews seem to dislike the movie for various reasons. They are the ones that missed the point of the story.<br><br>The story is, of course, fiction based on a novel by Michael Blake. Fortunately, Michael Blake also wrote the screenplay for the movie insuring fidelity with his vision.  To the credit of Kevin Costner, who was one of the producers and the director, he allowed the story to be what Michael Blake had originally created.  Costner showed great sensitivity in not only capturing the personalities of all the major characters, but making the land itself (in this case South Dakota) one of the major players.<br><br>\nThe land was not just a backdrop or playing field.  It was the main character and very much alive.  The cinematography was some of the best I've ever seen and in the tradition of the great movie director, John Ford. Ford had an ability to present the land in all its beauty, which also just happened to have a story occurring on it.<br><br>In Dances With Wolves, the land of South Dakota might initially appear to be a bleak place, but as Lieutenant Dunbar (Costner) spends more time at his isolated fort, he somehow slowly merges his soul with the surrounding territory.  The life on the land eventually stumbles onto his location, including a wolf and a tribe of Sioux.  The Sioux and Dunbar mistrust each other initially but through curiosity learn how to communicate with each other, however painfully slow. The wolf too was curious about the soldier, but kept his distance for a while.  Finally, the wolf trusts Dunbar enough to play with him on the prairie.  The Sioux see them playing.  Here was a white man not killing the animals.  He had earned a new name: Dances-With-Wolves.<br><br>The main difference between this movie and a John Ford movie was the way Costner humanized the Sioux characters.  In a John Ford movie, most Indians were the enemy.  The only 'good' Indians were the cavalry scouts, but we never really met these scouts as people.  John Ford hired Navaho people to play the parts of Indians in his cavalry trilogy, Fort Apache, She Wore a Yellow Ribbon and Rio Grande, which were filmed in Monument Valley on the Navaho Reservation. Years later, Ford attempted to humanize the Native Americans in a movie called Cheyenne Autumn, but by then Ford was an old man and had lost most of his creative genius.  It is a hard movie for me to watch.<br><br>Costner's movie takes great pains to allow us to know the Sioux characters. The story is about them as seen through the eyes of a perceptive white man, who had been given a new life by the gods when his attempt at suicide ended with his recognition as a war hero.<br><br>What I see when I watch the movie: I see ten thousand years of evolution and experience of a human tribe on the North American continent with the most recent characters at the leading edge of the current (1860) time. The character's lives are so well presented that I sense the history of their past  In other words, I understand why they do what they do.  What depresses me about the movie is that I know the ending but the characters don't.  I know that their natural way of life is coming to an end.  The characters don't know.  To me, the movie is a story of the 4 billion, six hundred million years of natural evolution which is about to meet technology. Technology will be as devastating to this tribe and the land as if an asteroid had hit the earth.<br><br>The beauty of the Sioux life is so precisely shown in this movie.  Their everyday routine of just living off the land is seen the same way as a buffalo eating the grass.  The Sioux adapted to the land the way it was. You see the grass move in waves like the ocean does when the invisible winds touch the surfaces.   You see the effects of the same winds that blow across the face and hair of Stands-With-a-Fist.  You hear the same winds.  The same winds take the smoke from the lodges away from the village. The land and air and life merge in a poetic movement.<br><br>The horses seem more natural and free in their herd next to the village. They are part of the tribe.  You can see the magnificence of the Sioux riders as they become one with the horse as they hunt the buffalo.  I suppose, in a way, the horse was a step in technology for the Sioux since they didn't have the horse until the Spanish Conquistadors brought them. But when they adapted their life to the horse, they became a great people. I look at it as a step in evolution, not a step in technology.<br><br>We find that the holy man, Kicking-Bird, played by Graham Green, was a hen-pecked husband, something we can all identify with no matter what race or ethnic group.  His wife saw more than he did, especially the budding love between Lieutenant Dunbar and Stands-With-a-Fist, who was played by the heavy-duty stage actress Mary McDonnell.  She is important to our story because we understand the Sioux from her translations.  As an actress, she was so convincing in her struggle to remember long forgotten English words from her childhood, from the time before she came to live with the Sioux. Kicking-Bird on the other hand represented the soul of the Sioux People. He was patient and was the type of person you would want as a friend.<br><br>We have Rodney Grant playing the part of Wind-in-His-Hair, the warrior who was quick to anger but was smart enough to listen to his elders and not kill the white soldier.  Rodney Grant represented the beauty and pride of the Sioux People.  He speaks the last relevant words in the story by proclaiming that he is the friend of Dances-With-Wolves.  Before Dunbar became Dances-With-Wolves, Wind-in-His-Hair would have been happy to kill him.<br><br>`Red Crow' Westerman played the part of the chief, Ten-Bears.  We've seen him play the part of a shaman in other movies.  He represented the wisdom and of the Sioux People and was also their prophet.<br><br>What movie about Native Americans could be told without Wes Studi?  In this movie he plays the enemy Pawnee so convincingly that you really hate him. Not only is he the enemy to the white man but the Sioux also.  Wes Studi can be very intense in his savagery, but in the eyes of the Pawnee, he was only protecting his tribal interests.<br><br>So we see the Sioux and, to a lessor degree, the Pawnee in their soon-to-end natural states.  We immediately feel at home with the Sioux.  The Pawnee aren't quite as lovable, especially when we see Wes Studi scalping the muleskinner.  The first disturbing scene is when the Pawnee attack the Sioux village and we see that to save themselves, the Sioux need the technology (the rifles) of the white soldier.  The Pawnee were so fierce looking (again convincingly by Wes Studi) that we fear for the Sioux tribe but see that the rifles are out of place in this natural world.  It is another technological step in the same magnitude as the horse.  But for all their beauty and greatness, we know they cannot win the final battles with the white civilization because they are so grossly outnumbered.<br><br>\nThere is the core of the problem.  The over-population of the modern civilization overruns their own land so they come to the land of the Sioux and destroy without asking.  You could see it in the face of every tribal member as they walked past dead and skinned buffalo which were left to rot in the sun after the buffalo hunters had skinned them for their hides. They were absolutely stunned and sick at the sight.  Whoever did this had no soul.  I extend the message of this movie to today and see population running amuck, stripping the land of resources and changing the atmosphere. It is too painful to contemplate.<br><br>To emphasize the loss and waste of the beautiful prairie life, near the end of the movie we see the soldiers shooting at the wolf for fun.  The wolf is confused and doesn't understand that bullets are hitting near him. Eventually a bullet strikes the wolf and we hear him cry out.  For me that was the most painful scene of all because I know that's what people do.  I see people kill a beast for the trophy.  They take it home and hang it on the wall.  The soul of that animal has been cast aside by a human, which has no soul.<br><br>The beauty is not in the trophy.  The beauty is in the life.  The ending for the wolf represents the ending for the Sioux and all the other tribes that lost the natural way of life.  Therefore I am just as disturbed for the Sioux as I am about the wolf.  I am disturbed for the future of the Earth.","user":"Craig-95","rank":[225,270]}]