[{"title":"The best bad film ever made.","rating":7,"date":"15 August 2004","review":"There are films out there that can be described as a guilty pleasure - you know they're quite bad, but somewhere deep down in your heart you can't bring yourself to admit it. Flash Gordon is, in my opinion, the guiltiest pleasure of them all. Cardboard characters, lunatic script, embarrassing dialogue, trashy performances (apart from Max Von Sydow), and hilarious special effects... yet the one thing that comes out in the film's favour is that, despite its seemingly countless faults, it is still irresistibly entertaining.<br><br>American football legend Flash Gordon (Sam J. Jones) and sexy babe Dale Arden (Melody Anderson) are aboard a private flight when a weird red-storm forces them to perform an emergency landing. They crash into the back garden of wacky ex-NASA scientist Hans Zarkov (Topol), an eccentric madman who believes the world is under attack from alien forces and who has built his own spaceship to do battle with the enemy. Astonishingly, it turns out that Zarkov was right - and pretty soon, Flash, Dale and Zarkov find themselves on the planet Mongo, battling against its tyrannical emperor Ming the Merciless (Max Von Sydow), with a little help from Ming's treacherous daughter (Ornella Muti), her lover Barin (Timothy Dalton), and the winged warrior Vultan (Brian Blessed).<br><br>Flash Gordon is an absolutely insane film. The set design is remarkable, as is the costume design, and a pounding rock soundtrack is provided by the group Queen. Performance-wise, everyone seems to be camping it up like an end-of-term pantomime, though Von Sydow somehow seems to give his villain a deliciously sinister edge. Some of the dialogue is so awful that it becomes eminently quotable by virtue of its badness (a few samples: \"This Ming is a psycho!\"; \"That must be some planet you come from!\"; and - my favourite - \"Freeze! You bloody bastards!\") Flash Gordon should be a total disaster - an awful shambles of a film with no redeeming qualities. It isn't. Perhaps we'll never know how or why it works, but it does. So let the dissection of Flash Gordon the movie end here - analyze it no more, just enjoy it!","user":"barnabyrudge","rank":[124,141]},{"title":"A 1930's Comic Strip Brought Perfectly To Life","rating":10,"date":"28 September 2004","review":"Flash Gordon is one of the most perfectly realized films De Laurentiis made, and it is disappointing that so few have recognized it for what it is; a 1930's comic strip brought perfectly to life. The fact that it is so accurate a realization of America's hopes and fears during the 1930's may help to explain why it has been dismissed so readily as, at best, mere camp, and at worst, a vulgar cinematic catastrophe: Today's audiences are too removed from that decade to catch the references. A classic example of America's view of Asia during the 1930's can be found in Dale Arden's confrontation with Princess Aura just prior to her wedding to Ming. Aura is trying to convince Dale to slip a poison into Ming's \"Power Potion\" but Dale tells Aura she can't because she's given Ming her word to \"try to be a good wife if [Ming] would spare Zarkov and Baron. He vowed he would.\" Aura, shocked at her naiveté, shouts, \"My father has never kept a vow in his life!\" To which Dale responds, \"I can't help that Aura. Keeping our word is one of the things that make us better than you.\" Flash Gordon is filled with this type of wonderful 1930's fun, and this fun is only enhanced by the decision to use bad actors in roles that would only benefit from the lack of skill, as well as Oscar-caliber actors in the most demanding roles. Max Von Sydow is an obvious example of the latter, but the hidden gems come in the form of Mariangela Melato, Brian Blessed, and Ornella Muti. Melato does an outstanding job as Klytus's reptilian, but beautiful, second in command when she flawlessly delivers lines like, \"Confess, and we won't hurt you anymore.<br><br>We don't like doing this at all!\" And Ornella Muti is simply unbelievable as Ming's gorgeous but deadly daughter. Replying to Flash's query as to whether he can use the telepathy machine to contact Dale with a perfectly candid, \"If I showed you how. But I'm not going to.\" Add to these amazing actors the costumes and sets that are obvious homages to the original comic's drawings and you have a movie that is as surprising as it is delightful. Enjoy!","user":"colleran-2","rank":[128,150]},{"title":"Cardboard, disposable and tremendous fun","rating":30,"date":"30 December 2002","review":"After a plane crash in extreme weather, Flash Gordon and his travelling companion Dale Arden after abducted by Dr Zarkov to help pilot his spaceship to confront what he believes is an attack from space.  Once in space Flash comes faces to face with the cause of the extreme weather, Ming the Merciless and is sentenced to death.  Saved from death by Ming's lustful daughter Flash sets out to save his friends and stop Ming with the help of the leaders of the kingdoms.<br><br>Even when this was brand new I suspect it looked out dated and a throwback kind of appeal.  More than 20 years later this definitely is appreciated as a laugh by about as many people who genuinely enjoy it on it's own merits. The plot is well known to most people I suspect  I know it from the 25 minute b/w `classic' series that BBC2 repeated in the mornings when I was only a lad in the 80's.  But it is easily nutshelled as above.  The story moves alone at a good pace despite the poor effects and is actually pretty exciting.<br><br>The effects are poor  even for 1980's the back projection is rubbish and the costumes are silly.  Compare it to the advances made in Star Wars and stuff years before and it looks weak.  However the vision is ambitious and it works well if you accept the weaknesses from the start.  Another weakness is the acting from ranges from wooden to just plain hammy.  Jones is perfect as Flash, despite being wooden as a tree.  He comes over like a 30's matinee idol type, which is just what the fun mood of the film needed.  Anderson is awful but again just accept the weaknesses.  Von Sydow is good as Ming and Topol is a little unhinged as Zarkov.  Blessed hams it up so much you could slice him and serve him with pineapple but he also suits the film well. Dalton, O'Brien, Blue Peter's Peter Duncan and Robbie Coltrane and several other unexpected Brits turn up which is nice.<br><br>If you're not sure if this film is for you then watch the first 20 minutes. By that time you'll have seen two key things that sum up the film.  Firstly you'll have sat through the extremely cool theme song from Queen.  That gets me in the mood every time I hear it!  Secondly you'll see a fight with Ming the Merciless' men where Flash takes them on in a form of American Football fighting!  Both this scene and the music are a little silly and quite camp but if you like these then the rest of the film will suit you fine.<br><br>Personally I love this movie and watch it every repeat I see.  It is silly and has plenty of weakness, but more than all these things it is incredibly fun to watch!  Sing it with me now  `FLASH! AH-AH! HE'LL SAVE EVERYONE OF US!'","user":"bob the moo","rank":[86,101]}]