[{"title":"An exciting colorful adventure, very entertaining...","rating":8,"date":"2 February 2000","review":"In old San Francisco, Marina Selanova (Ann Blyth) - a dark-haired Russian countess on the run from imminent union to the ambitious prince Semyon (Carl Esmond) - implores Captain Jonathan Clark (Gregory Peck) to take her to Alaska after been rejected by his eternal rival Portugee (Anthony Quinn).<br><br>Jonathan, an American seal pirate, falls for the diminutive, fresh-faced brunette, while giving her a midnight tour of San Franciscoan impressive similar situation to Peck-Audrey Hepburn in William Wyler's \"Roman Holiday.\"<br><br>On the eve of their wedding day, her odious Russian fiancé kidnaps her, and sails for Alaska taking her on his gunboat... He promises to kill her uncle unless she married him as it was originally planned...<br><br>The film's highlight is the outstanding windswept race between two boats led by Peck and Quinn from San Francisco harbor to the Fur Seal Islands off the coast of Alaska, with the winner acquiring the other's ship and crew to rescue the lovely heroine...<br><br>With her slightly oriental eyes and pleasant lyric soprano voice, Ann Blyth provides feminine decoration for this epic adventure... <br><br>Anthony Quinn gives a high-spirited performance as the cunning, sympathetic thief... Quinn is challenged in the film in a 'trial of strength,' an amusing drinking and wrestling bout..<br><br>Raoul Walsh's direction is simple, direct and muscular... As a popular entertainer he is confident with a sense of humor... His actions, fury, spirit, skill, ambition and unrestrained dreams remain his forte...","user":"Nazi_Fighter_David","rank":[24,25]},{"title":"434th Review: Great fun boys adventure - with some excellent sailing sequences","rating":8,"date":"21 June 2011","review":"Sometimes you just want to watch real adventure and romance and escape. TWWIHA is that and more, shot in Technicolor and full of character and characters this is escapist melodrama at its best.<br><br>Gregory Peck plays the Boston Man, a sailor and a sealer, who lands in port and finds love unexpectedly with a Russian countess. Set against the politics of the purchase of Alaska the film spends the first hour in port and then follows 20 minutes of the best sailing sequences caught on film: two tall masters sailing fullspeed and captured to great effect on film, with gaff sails, bumkins, and bowsprits furling this is one of my favorite sailing scenes from any film.<br><br>All in all, this is a wonderful romantic adventure film and a terrific way to spend a rainy afternoon.","user":"intelearts","rank":[9,9]},{"title":"I like it!","rating":10,"date":"28 September 2006","review":"Fascinating movie! I felt pleasure in this story. Though at first I did not want to watch it. I'm the Russian and I believe Hollywood makes fables about Russia as it had turned out with this movie. There were a trite Russian tavern, cossacks, balalaikas, the plaintive Russian songs, the funny Russian aristocracy. There were some Russian names sounding strange for the Americans. The Americans do not know that the Russians have a name and patronymic. The Russian countess is not too bad, even it was possible to keep noble pallor and some aristocratic manners. The countess' servant was speaking in Russian almost without accent. Though the countess' dresses were in a British manner. But above all it was LOVE. And Alaska, sold to the USA, played not such large role. Certainly, it was impossible for the Russian, Orthodox countess got married with the Catholic American in a church. And Marina Selanova and Prince Semyon wanted to get married into strange place that was absolutely not similar to an orthodox temple. But it did not irritate me. It would be better, if this movie was made in Russia. But sometimes I believed this movie was made in Russia. I believe Gregory Peck was the best choice for this role. The American steadfast captain and the Russian charming countess were beautiful couple. With what other American could the Russian countess fall in love? Jonathan Clark looked very well and manly. He was smart, just, thoughtful and slightly imprudent. The final scene was dazzling beautiful and it had no equal even DiCaprio's Titanic. I saw this scene at picture and decided to watch this movie and I did not regret. I'm so sorry it was not released on DVD. But in Russia it is easy to buy VHS. We like it!","user":"hbelova-1","rank":[15,18]}]