[{"title":"\"Go, kill, my baby toys!\"","rating":4,"date":"4 June 2011","review":"Well what can you say? It was silly. Unintentional of course. However this kitsch-like presentation works because of how cheap and ludicrous it is. Some things have got to be seen to be believed and this 80s take on \"Hercules\" has plenty in store. One sequence just sticks in mind, other than that meaninglessly grand opening. Hercules taking on a vicious bear. Cool! However how it's executed had me snickering. Actual bear footage spliced together with someone donning a very convincing bear suit. How to end it. The bear suit being flung into outer-space. It's just part of the tragedy that occurs you know for dramatic effect.<br><br>\"Hercules\" is a low-grade, straight-laced good vs. evil sword and sorcery epic mainly consisting of echoing voices, tacky optical FX, colourful decors (sometimes miniatures) with moody lighting and some atmospheric illustrations / confrontations. The production did drum up some striking images amongst it's cheap sets / effects, but despite that it wasn't principally all that creative in presenting the material. How it plays out, is like a cosmic chest game between the gods. Hercules (the champion of men) must rescue a princess from being sacrificed and encounters obstacles along the way. Some odd moments (like the tin-bot monsters) and lame dialogues. Lou Ferrigno as Hercules has the physic, constantly flexing and twitching his muscles. Wooden, but fitting. William Berger milks it up in the villain role and Sybil Danning looks fetching, but has bite with her villainous turn. Brad Harris and Mirella D'Angelo also appear. Pino Donaggio scores the bombastic soundtrack. Director Lugi Cozzi does a clunky job, but keeps it moving along at a smooth pace. Ham-fisted, but charming entertainment.","user":"lost-in-limbo","rank":[12,13]},{"title":"\"Could I just see it grow a little bit? It would mean a great deal to me.\"","rating":5,"date":"19 April 2014","review":"Cheesy greatness from Cannon and those geniuses Golan-Globus combines post-Star Wars science fantasy with 1960s Italian sword &amp; sandal movies. The pre-credits history of the universe is highly informative. I never realized that's how it all came to be. My teachers were liars. Lou Ferrigno is an impressive sight to behold, for sure. Each of his pecs is bigger than my head. Zeus looks like Jon Stewart with a crown and fake beard. Sexy Sybil Danning isn't in this nearly enough but is enjoyable when she is. Ingrid Anderson is gorgeous and her revealing outfit in the latter half of the movie made me drool.<br><br>The dubbing, special effects, sets, and costumes are all cheap but fun. The stop-motion mechanical monsters are beyond cute. The highlights of the movie are Hercules' many impressive feats of strength, such as hurling a bear into space and creating the constellation Ursa Major or pushing apart two bodies of land and creating the continents of Europe and Africa. Again, my teachers were liars. Watch baby Hercules kill the snakes -- that poor baby didn't understand what the heck they had him doing! <br><br>This is an entertaining movie. I really don't see how you cannot find it fun to watch. Granted, most of that fun comes from the unintentional comedy it produces but that's still something, right? If I have to watch a movie that is technically and artistically lacking in any kind of quality, I would rather it be a movie like this that has some comedic value than some boring A-list movie that has me sitting on my hands the whole time.","user":"utgard14","rank":[11,12]},{"title":"Bad in ways you cannot possibly imagine...","rating":5,"date":"26 December 2004","review":"This movie is bad...but not so bad that you don't enjoy it. In fact, your eyes are glued to the screen in anticipation of what bizarre twist they are going to perform next on Greek/Roman mythology. Robot hydra and robot centaurs that shoot lasers are simply too amazing to be missed. The writer of this film must've been autistic and simply wrote the first thing that came into his head. It is DELIGHTFUL! Certainly, if you cannot sit through a bad movie, you should avoid this one; however, as bad movies go, this is an epic...a mighty effort of special effects, bad writing, poor dialog and what looks like a single costume shared by every female member of the cast. No woman in this movie wears anything substantial below the belt...even Dedalus, who for reasons unknown, is a woman in this film.<br><br>If your children see this movie, please remember to tell them that the movie has absolutely NOTHING to do with the actual myth of Hercules, Minos, Circe or even Ursa Major (the great bear).<br><br>Use as directed...","user":"masercot","rank":[23,30]}]