[{"title":"My number 1 favorite Roger Moore's best James Bond 007 film","rating":10,"date":"5 November 2017","review":"The Spy Who Loved Me (1977) is Roger Moore's finest best action spy film. From James Bond it is my second favorite James Bond 007 film and first favorite Roger Moore film. I love this film to death do I love it equal as Moonraker it is my favorite James Bond film I grew up watching it and it is brilliant. I'm a hard-core James Bond fan. I make no apologies for believing that Roger Moore is the closest thing we've seen to IAN FLEMING's James Bond.<br><br>James Bond has a relationship with a resourceful and beautiful Russian agent Anya Amasova Agent Triple X is something new for the Bond films. Lewis Gilbert's film provides direct allusion to David Lean's epic movies, bringing back a Blofeld-type character... His name is Karl Stromberg, a shipping tycoon who despises every aspect of terrestrial civilization. The storyline involves a reclusive megalomaniac named Karl Stromberg, who plans to destroy the world and create a new civilization under the sea. Bond teams up with a Russian agent, Anya Amasova, to stop Stromberg.<br><br>I love the underwater world and Karl Stromberg's vision about destroying the civilization in which he wanted to fire a missiles on Moscow and New York City. He hijacked two submarines British and Soviet and the plan from Karl Stromberg was brilliant. Stromberg's aquarium, of sharks and other deadly fish, is his pride and passion... 'For me this is all the world', he declares, 'There is beauty. There is ugliness. And there is death.'<br><br>James Bond investigates the hijacking of British and Russian submarines carrying nuclear warheads, with the help of a K.G.B. Agent, whose lover he killed.<br><br>Roger Moore was the best James Bond 007 but so underrated he is my second favorite James Bond. R.I.P. he visit Slovenia many times he is really missed. He stated that this is his favorite James Bond film he made, his best one. I agree I also enjoy For Your Eyes Only the same way than this movie but is my second Roger Moore James Bond film. The Spy Who Loved Me is my number 1 favorite Roger Moore James Bond 007 film and my second best James Bond 007 film. GoldenEye is number 1. <br><br>Barbara Bach as Anya Amasova Russian spy was incredible hot sexy babe her performance was wonderful. I have enjoyed the girl so much she was terrific. Barbara Bach is attractive, classy, stylish, intelligent, confident, very sexy, and absolutely wonderful she had a great t**s I loved her. <br><br>Karl Stromberg (Curd Jürgens) R.I.P. was a really great Bond villain I really miss him he was brilliant and intelligent. I really loved his hideout, Atlantis. <br><br>Stromberg's three killers are Jaws, Sandor and Naomi<br><br>Jaws (Richard Kiel) R.I.P. he is really missed steals the show as the most menacing and fearsome henchman Bond has ever faced since the mute Korean assassin Oddjob in 'Goldfinger.' <br><br>Sandor (Milton Reid) is the bald, muscle-bound assassin who tries to kill Bond at Aziz Fekkesh's apartment in Cairo. <br><br>Naomi (Caroline Munro) is Stromberg's luscious assistant and helicopter pilot who shows her 'lovely lines,' giving Bond a lewd while trying to shoot him and Anya down from the air. Caroline Munro was extremely great babe as Stromberg's assassin she was terrific girl.<br><br>Lewis Gilbert directed wonderful this film on the train sequence and even on the Stromberg's ship Liparus. <br><br>Nobody Does it Better by Carly Simon was a great soundtrack and the music score by Marvin Hamlisch was wonderful. <br><br>This film has a lot of action hardcore action car chases, car that is under water in really beautiful performances by Roger Moore and Barbara Bach she was a sweetheart. <br><br>Great climatic fight on the ship between British, Russian and American sailors fighting against Liparus's crew. James Bond destroys those two submarines. Bond fights on the end Jaws and kills Stromberg by firing at his with his gun PPK - Walther and he saves Anya Amasova. <br><br>The Spy Who Loved Me is a 1977 British spy film and the tenth in the James Bond series to be produced by Eon Productions, and the third to star Roger Moore as the fictional secret agent James Bond. Barbara Bach and Curt Jürgens co-star. It was directed by Lewis Gilbert and the screenplay was written by Christopher Wood and Richard Maibaum.<br><br>10/10 It is my second favorite James Bond film and the first of Roger Moore's film. Roger Moore is in my opinion is so underrated James Bond I really enjoy this two film: The Spy Who Loved Me and For Your Eyes Only. They don't make em like this anymore they don't. I miss movies like this one. Why can't we get movies like are this one today? I want movies like this one today.","user":"ivo-cobra8","rank":[99,109]},{"title":"\"Nobody does it quite the way you do\"","rating":8,"date":"29 June 2006","review":"You don't review James Bond movies, you evaluate them, rate them according to how well they meet expectations. There are certain things one has come to expect, even demand of a Bond film and each individual effort either delivers or it doesn't. So, here are ten elements that make a Bond film a Bond film and how THE SPY WHO LOVED ME rates on a scale of 1 to 10:<br><br>Title: THE SPY WHO LOVED ME: The title seems more appropriate for a Harlequin Romance novel, and if suitable at all for a Bond film, it would have been a better title for ON HER MAJESTY'S SECRET SERVICE. Yet, it does finally work the word \"spy\" into the title of a Bond film. 7 points.<br><br>Pre-Credit Teaser: It's all very nicely done: Within a few minutes, we see a submarine stolen and its crew kidnapped; we meet the Soviet's top agent, who just happens to be -- surprise! -- a woman; and we get the added treat of one of Bond's greatest stunts, the great skiing-skydiving trick. A pretty cool way to kick off the film and set up the various story lines. 9 points.<br><br>Opening Credits: Arguably the silliest of all of Maurice Binder's efforts, the opening sequence finds 007 bouncing around on a trampoline while various miniature, and apparently naked, babes do gymnastics on the barrels of guns. (Pity he didn't come up with that idea for THE MAN WITH THE GOLDEN GUN.) Bordering on self-parody, it is nonetheless naughty and fun and colorful and oh-so very James Bond. 9 points.<br><br>Theme Song: No beating around the bush here, the song gets right to the point: \"Nobody does it half as good as you, Baby, you're the best.\" Just what Bond is best at is open to interpretation. The music by Marvin Hamlisch is swanky and matched by Carol Bayer Sager's dreamy and only slightly sarcastic lyrics. And Carly Simon's vocals bring it all home. Maybe not the best Bond song, but right up there. 9 points.<br><br>\"Bond, James Bond\": Moore finally makes the role his. The number of smug one-liners have been trimmed, yet he still invests the character with humor -- plus some warmth and charm, and unexpected sadness. And we get to see a bit of Bond's vanity as he matches wits with a female agent who is his equal and not impressed by his stock-and-trade flirtations. Moore's best appearance as Bond. 9 points.<br><br>Bond Babes: The prevailing notion has always been that \"Bond Girl\" equals \"Bimbo,\" which is only partly true. Most of the women Bond encounters are highly skilled professionals -- as well as being bimbos. But Soviet agent Major Anya Amasova, a.k.a. XXX, is the first Bond Girl to give James a run for his money. She's smart, sexy, capable, resourceful and it takes her almost the whole movie to actually fall in love with Bond. What will power! As played by Barbara Bach (a.k.a., soon-to-be Mrs. Ringo Starr), Anya ranks as one of the best Bond Girls, easily worthy of 9 points.<br><br>Bond Villain: Karl Stromberg (nice villainous name, by the way) is one of those mad billionaires who hopes to create a new world order by mass genocide and building a new society, this time underwater. It is pretty much a cliché character and unfortunately Curt Jurgen plays the part like a grumpy old man and can't seem to muster up even a maniacal laugh. 5 points.<br><br>Bond Baddies: Oddjob look-a-like Sandor, played by Milton Reid, puts in an appearance long enough to die a memorable death, but it is Richard Kiel who steps into the limelight as Jaws, one of the great Bond villains. If being a hulking, seven-foot tall muscle man weren't enough, he also has steel teeth and an amazingly obsessive desire to kill 007. Playing Wile E. Coyote to Bond's Road Runner, Jaws earns 9 points.<br><br>Sinister Plot: Stromberg steals a Russian and a U.S. sub, as well as a British one, with the hopes of starting World War III and destroying the civilization as we know it today. Been there, done that. 4 points.<br><br>Production values: Romantic imagery, clever lighting effects and intriguing camera angles make this the most visually appealing Bond film. In the past, the emphasis was always on the most effective way to film action sequences, but here director Gilbert Lewis strives for that little bit extra as far as mood and romance. 9 points.<br><br>Bonus Points: Connery had his Astin Martin and Moore gets a Lotus Esprit. It is not nearly as snazzy, but it does turn into a submarine and you never know when that will come in handy. 5 points.<br><br>Summary: It had been hinted at in the three previous Bond adventures, but a new sense of style is fully apparent here. The roughness and grit that many of the purists loved about Connery's films are pretty much gone in favor of a polish and panache. Whether that is being suave or merely superficial is open to interpretation, but it does set the tone and the expectations for all future Bond adventures.<br><br>Bond-o-meter Rating: 84 points out of 100.","user":"majikstl","rank":[63,79]},{"title":"Commander James Bond, recruited to the British Secret Service from the Royal Navy. License to kill and has done so on numerous occasions.","rating":9,"date":"2 June 2012","review":"The Spy Who Loved Me is directed by Lewis Gilbert and adapted to screenplay by Christopher Wood and Richard Maibaum from the novel written by Ian Fleming. It stars Roger Moore, Barbara Bach, Curt Jurgens, Richard Kiel and Walter Gotell. Music is scored by Marvin Hamlisch and cinematography by Claude Renoir.<br><br>Bond 10. Allied and Soviet nuclear submarines are mysteriously disappearing from the waters and causing friction between the nations. MI6 and the KGB have a notion that a third party is responsible and stirring up trouble for their own nefarious means. 007 is partnered with Soviet spy Major Anya Amasova (Agent XXX) and the pair are tasked with getting to the bottom of the plot before the crisis escalates.<br><br>During the whole run of the James Bond franchise there have been a few occasions when it was felt it had run out of steam. 1977 and on the back of the mediocre reception and by Bond standards the poor box office return of The Man with the Golden Gun, now was one such time. With producer Albert Broccoli striking out on his own, the stakes were high, but with a determined vision forming in his head and a near $14 million budget to work from courtesy of United Artists, Broccoli went big, and it worked magnificently. The Spy Who Loved Me is Moore's best Bond film, not necessarily his best Bond performance, but as a movie it's near faultless, it gets all the main ingredients right. Gadgets and humour were previously uneasy accompaniments to James Bond as a man, but here they serve to enhance his persona, never taking away his tough bastard edge. The suspense and high drama is back, for the first time in a Roger Moore Bond film things are played right, we don't think we are watching an action comedy, but an action adventure movie, what little lines of humour are here are subtle, not overt and taking away from the dramatic thrust.<br><br>For production value it's one of the best. Brocoli instructed the great Ken Adam to go build the 007 Stage at Pinewood so as to achieve their vision for The Spy Who Loved Me. At the time it became the biggest sound stage in the world. With such space to work from, Adam excels himself to produce the interior of the Liparus Supertanker, the home for a brilliant battle in the final quarter. Vehicles feature prominently, the amphibious Lotus Esprit moved quickly into Bond folklore, rocket firing bikes and mini-subs, helicopter, speedboat, escape pod, wet-bike and on it goes. Then there's Stromberg's Atlantis home, a wonderfully War of the Worlds type design for the outer, an underwater aquarium for the inner. Glorious locations are key, also, Egypt, Sardinia, Scotland and the Bahamas are colourful treats courtesy of Renoir's photography. Underwater scenes also grabbing the attention with some conviction.<br><br>The film also features a great cast that are led by a handsome, and in great shape, Moore. Barbara Bach (Triple X) is not only one of the most beautiful Bond girls ever, she's expertly portraying a femme of substance, intelligent, brave and committed to the cause, she is very much an equal to Bond, and we like that. The accent may be a shaky, but it's forgivable when judging Bach's impact on the picture. Jurgens as Stromberg is a witty villain, but he oozes despotic badness, sitting there in his underwater lair deliciously planning to start a new underwater world. Kiel as Jaws, the man with metal teeth, he too moved into Bond folklore, a scary creation clinically realised by the hulking Kiel. Gotell as Gogol is a presence and Caroline Munro as Naomi is memorable, while Bernard Lee's M and Desmond Llewelyn's Q get wonderful scenes of worth. They forgot to give poor Moneypenney something to chew on, but in the main it comes over that the makers were reawakened to what made Bond films great in the first place. There's even a candidate for best title song as well, Nobody Does it Better, delivered so magically by Carly Simon. <br><br>The grand vision paid off, handsomely. It raked in just over $185 million at the world box office, some $87 million more than The Man with the Golden Gun. Not bad considering it was up against a record breaking Star Wars. Critics and fans, too, were pleased. It's not perfect. It's ironic that director Lewis Gilbert returned for his second Bond assignment, because this does feel like a rehash of his first, You Only Live Twice, only bigger and better. Hamlisch underscores it at times and John Barry's absence is felt there. While if we are being particularly harsh? Then Stromberg could perhaps have been a more pro-active villain? He makes a telling mark, we know he's a mad dastard, but he only really sits around giving orders and pushing death dealing buttons. But small complaints that fail to stop this Bond from being one of the best. Hey, we even get an acknowledgement that Bond was once married, and the response from Bond is respectful to that dramatic part of his past. 9/10","user":"hitchcockthelegend","rank":[17,19]}]