[{"title":"MacArthur is much more interesting than your usual military hero and Gregory Peck played the part perfectly.","rating":14,"date":"14 April 2004","review":"Unlike Patton, Pershing, Grant or Eisenhower, MacArthur is a many sided character and Peck played the part as I believe MacArthur  really was. The positive PR version produced by the U.S. Army in the l940's or the negative liberal press version of the l950's are very limited in their understanding of this great man.    I have always believed that MacArthur was a turn of the century progressive much like Teddy Roosevelt, at the same time both imperial  and caring, who lived past his time into the l960's.  His tactical decisions were unmatched by any general in our history.  His speeches rival those of  William Jennings Bryan or Patrick Henry and I'm sure many wish we could send him  and his administrative skills to Iraq to put that mess back together.  In the years since his death  a small cult has grown up around his memory much like Robert E.Lee and to some his words are almost mystical. He was a major player in one way or another in WWI, the depression, WWII, Korea and if you count his death-bed plea to President Johnson to get our troops out of Vietnam, even the Vietnam War.  If you want to stretch things even farther, he can be tied to turn of the century imperialism and the Spanish-American War through his part in the Philippine Insurrection following the Spanish-American War and if you must, the Indian Wars which he experienced  as a small boy with his parents.    He has been described as a conservative, a liberal, a militant and a pacifist.  How could one man be so much a part of the 19th century and believe in war only between individuals(like Custer and Crazy Horse) or  as in feudal times yet advocate A-bombing China?  He is always described as arrogant and overly dramatic but like Grant he wore a simple 2nd Lieutenant's uniform with five stars on the shoulder minus all the medals that the \"G.I. generals\" wore.   I believe his love for the people of Asia was sincere and in this was he was like Alexander or Caesar.  We are fortunate Gregory Peck did play MacArthur as such a complex individual.  To focus only on the Five-Star General with the corn-cob pipe is to miss the the big picture.  No wonder Patton is so easy to watch compared to MacArthur.  I have seen the movie at least 15 times and am still moved by it.","user":"steve-1291","rank":[55,73]},{"title":"Solid biopic elevated by Gregory Peck's great performance","rating":6,"date":"6 November 2000","review":"It is inevitable that MACARTHUR will be compared to PATTON, the other military biopic produced by the late Frank McCarthy.  Such comparisons are unfortunate because their subjects are vastly different, albeit controversial figures, and each film takes a different approach in examining their impact on history.<br><br>George S. Patton commanded an Army formation in Europe while Douglas Macarthur commanded an entire theater of operation in the Pacific.  By his own admission, Patton never had any political ambitions, while MacArthur definitely had such aspirations.  Patton's political naivety made him ill-suited as the postwar occupation commander in Bavaria while MacArthur's political astuteness served him well during the occupation of Japan.<br><br>Yet both men were great, if iconoclastic military leaders.  Patton's brilliant northern pivot during the Battle of the Bulge is matched by the MacArthur's daring amphibious landing at Inchon.  And both men believed strongly in their destiny; Patton's belief was based on reincarnation while MacArthur was motivated by following in his illustrious father's footsteps.<br><br>Surprisingly, PATTON is the much more succinct, less ambitious film than MACARTHUR.  It concentrates on its colorful, mercurial main character during a comparatively brief two-year period between the American defeat at Kasserine Pass in early 1943 to Patton's dismissal prior to his death in late 1945.  Although we see Patton's conflict with Omar Bradley, Bernard Montgomery, and Bedell Smith, we never see his interaction with General Dwight Eisenhower, Prime Minister Winston Churchill, or General George Marshall, the U.S. Army's chief of staff.<br><br>MACARTHUR is a much more ambitious film, covering nearly a decade from the fall of Bataan in early 1942 to MacArthur's dismissal in 1951. Additionally, MACARTHUR shows a wider range of conflict between MacArthur and such individuals as Admiral Nimitz, General Marshall, ambassador William Averell Harriman, and Presidents Roosevelt and Harry S. Truman.<br><br>So, does MACARTHUR match PATTON as a groundbreaking biopic?  No, it doesn't.<br><br>MACARTHUR lacks the insightful, acerbic screenplay that Francis Ford Coppola and Edmund North supplied PATTON.  The direction by TV veteran Joseph Sargent is yeoman-like where the late Franklin J. Schaffner offers a more vigorous, hell-for-leather approach to PATTON.  Both films are handsomely mounted productions that serve as a tribute to acumen of the producer McCarthy.  Both movies benefit from film scores by the ever-reliable Jerry Goldsmith.<br><br>While PATTON has its main character departing in a Valhalla-like denouement, MACARTHUR is book-ended by the legendary speech that the old soldier delivered to the cadet corps at West Point in 1962 as a final valedictory.<br><br>At the heart of both films are the extraordinary performances of their lead actors.  The late George C. Scott's portrayal of Patton is justly remembered, but Gregory Peck delivers a performance that is both subtle and unapologetic and helps to elevate this often-pedestrian production to a higher level.  Peck's portrayal is reminiscent of his work in TWELVE O'CLOCK HIGH, but with the added weight of an additional thirty years of experience and craftsmanship that this great actor brings to bear to this role.  Peck is ably supported by Dan O'Herlihy as FDR and the late Ed Flanders as Harry S. Truman.<br><br>Finally, I must note the presence of Dr. D. Clayton James, the author of the standard multi-volume biography of MacArthur, who served as this film's technical advisor.","user":"marcd30319","rank":[54,73]},{"title":"One of the most impressive scenes was the accurate recreation of the Japanese surrender aboard the U.S.S. Missouri","rating":8,"date":"6 April 2007","review":"The film transported everyone back to October 20, 1944 where we seemed to be part of the great Philippine 'I Shall Return' landing scene It was on that Leyte shore where General MacArthur reaped his fame <br><br>Above all, Gregory Peck triumphed in his portrayal of the great general It is the stride, the set of the shoulders, the intensity It's what both men have had in common: intensity, total absorption, devotion With MacArthur it was for the military With Peck it was for the challenge of acting An Academy Award winner for \"To Kill a Mockinbird\", an Oscar nominee for \"Keys to the Kingdom\", \"The Yearling\", \"Gentleman's Agreement\", and \"Twelve O'Clock High\"he has played everything from an apparently homicidal amnesiac to a crusading journalist; from a troubled gunfighter to an obsessed attorney; from biblical David to Captain Horatio Hornblower He has brought to them all his own unique insight, his character, his sincerity, warmth and love, and especially, his humor <br><br>There is a scene where 'MacArthur' stands on deck with the 'President of the Philippines.' We can hear the dialogue: \"General, I hope the water isn't too deep,\" says the 'President,' \"because my people will find out I can't swim.\" Then come Peck's sonorous voice: \"And my people are going to find that I can't walk on water!\" <br><br>As \"MacArthur,\" Peck once again justified his reputation as a giant in the film industry Through him we felt MacArthur's emotions: we knew his anger, his happiness and we understood the relationship with his whole family","user":"Nazi_Fighter_David","rank":[24,32]}]