[{"title":"Unforgettable...!!!!","rating":10,"date":"24 February 2005","review":"I watch a lot of movies - DVD, features, and classics, you name it. The night I watched JERICHO MILE, my wife (who had ordered it on the internet) said she remembered it from when she was in high school, that it had stayed with her all of these years. Somewhat reluctantly I sat down (with our daughter &amp; son), and was riveted from the opening sequence to the end titles. We all were. <br><br>She, who remembered the original, and our kids (18 and 16) who had no idea what the movie was about couldn't believe it. Our favorite scene? Bar none, when peter Strauss so passionately bangs his fist down and says, \"i'd do it AGAIN!\". It didn't advocate violence because it was a defense crime, but evoked such intensity we couldn't believe it...when his fellow cell mates gave him their food in support of his efforts, there wasn't a dry eye in our house.<br><br>Someone please make more movies like this one. UNBELIEVABLE!!","user":"jackshawII","rank":[22,23]},{"title":"When they take away your dreams, take them back","rating":10,"date":"23 May 2003","review":"I watched the this the other night on a local station because I didn't feel like watching tripe like 'American Idol'. Peter Strauss gives a great performance as a convict named 'Rain' Murphy who keeps to himself. He admits to his crime and makes no bones that he feels no shame for it. His cell is bare of any comforts that other inmates have like books and pictures. The only time he feels in another zone is in running. He does it often and can run a mile in under four minutes. When a college coach hears about this, he wants to prime him for a shot at the Olympics. At first, 'Rain' wants no part of this, but when his best friend is killed, he shows interest.<br><br>This is a good movie, period. Strauss is very good (What did you expect, anything less?) and Michael Mann shows hints of greatness that would come full bloom years later. This movie had that bit of realism (probably because it was filmed among convicts). It almost feels like this was a true story. The additional casting is good. There is a lot of notable names like Brian Dennehy, Roger E. Mosley, and Richard Moll as well.<br><br>My heart sank when some pompous board of directors wouldn't let him run because he didn't feel bad for his crime. His final act made me stand up and cheer. When they took his dreams away, he took them back hard. This was back when TV movies were actually good. 'The Jericho Mile' is a gem of a film. ESPN Classic, PLEASE SHOW THIS FILM!!!","user":"MichaelMovieLoft","rank":[19,21]},{"title":"Powerful Film 24 years later","rating":25,"date":"25 April 2003","review":"The power of this film stuns me even today.  It has all the trademarks of a Michael Mann film, including the line that appears in all his works about the 'man' inventing a hard time that some character cannot handle. This may be the first time that line was used, and argueably, the most effective. Simple story of a simple man who made a decision, and had the guts to face the consequences. He never denies what he did, regrets that it happened, but would do nothing different, given the chance, nor does he try to escape the consequences. Rain Murphy is a man who denies himself all of the creature comforts of civilization. He has no TV or no photos in his cell, no books, only the essentials. He does not work as an inmate, because he denies himself the things he would use his meager pay to buy. He is punishing himself for his crime. He rejects the idea of running in the Olmypics, or even trying, because it would disrupt his new life. A life where he runs until he cannot walk, then zones out until he cannot talk stretching his muscles. A shock to Murphy's system changes all of this, he buys into the dream of competing, only to be cheated.  Murphy's final act of defiance is memorable. Mann might have gotten more polished over the years, this film shows talent always delivers","user":"dantorpk","rank":[10,11]}]