[{"title":"One of the great movies of my youth","rating":7,"date":"3 August 2002","review":"\"King Kong\" was one of my all-time favorite movies when I was a teenager. It was the big 'event' movie of 1976 and showed on two screens in most multiplexes. It might have been the first movie to get that treatment. With a production cost of $24 million it was the most expensive movie ever made at that time.<br><br>Promotional material offered for sale dwarfed anything that had been done in that area before. A fast-food joint offered King Kong collectible glasses (I still have a set). And you could find posters, T-shirts and a 'Making Of King Kong' book.<br><br>I very much enjoyed 'King Kong' as a 17-year-old high school senior, but not so much later as an adult. The romance between Dwan and Jack seemed contrived once I got older. Other aspects of the film struck me as just dumb. Like the ship's radar being able to pick up Kong when he was walking around the island. Or the SUNNY aerial shot of the people walking on the allegedly fog-shrouded island. Or Jack's theory that the fog was produced not by a huge supply of crude oil near the surface, but by 'animal respiration.' As if King Kong's breathing caused the fog bank. Give me a break!<br><br>Yet there's something about movies one enjoyed as a youth that makes them special for the rest of one's life, no matter how bad they really are.<br><br>But 'King Kong' had it's good points, too. First of all, it was funny. Charles Grodin's portrayal of the greedy, desperate oil company executive is scenery-chewing at its best. For years after, I watched in vain for Grodin to play a similar character, but everything else he has done is nothing like his work in 'King Kong.' (Nothing as good either, I might add.)<br><br>Speaking of singular performances, you won't recognize René Auberjonois if your frame of reference is his work on 'Benson' and 'Star Trek: Deep Space Nine.' The voice he uses in 'King Kong' is nothing like the gravely voice we're used to hearing.<br><br>Jeff Bridges is perfect in the role of Jack Prescott. His long hair is a nice touch, although it probably turned off some of the older people in the theater. Jeff has a way with a sarcastic line that few actors can equal.<br><br>Jessica Lange comes off worse than any other actor in the film. Not because of her performance, which is fine, but because her character is an airhead who is only there to be protected (and rescued when that doesn't work) from Kong. The fact that her costumes were chosen for their ability to showcase her body and that her breasts are briefly visible when Kong undresses her has got to make the actress cringe nowadays when she thinks about this movie.<br><br>I'll close by noting that John Barry's score of 'King Kong' was terrific. Twenty-six years after the movie debuted and I can still remember the title tune.","user":"Ralpho","rank":[84,108]},{"title":"Definately has its moments","rating":23,"date":"23 May 2003","review":"In an era when many hollywood blockbusters are criticised for an over-reliance on sophisticated special effects to the detriment of everything else, this poorly remembered remake stands as a cautionary example of what can happen when a basically decent film gets let down by low-tech back up.<br><br>Producer Dino De Laurentis both cheated and deceived his audience here; selling the film on the hype of a state of the art full-size hydraulic ape that would re-define the effects landscape. Instead, what we got was the tired old fallback of the man in a monkey suit waddling bow-legged around some highly unconvincing sets.<br><br>Its such a shame because this film actually has a lot going for it. The screenplay is sprightly, good-humoured and faithful to the original while updating it with some then topical issues like fuel crises, feminism and even pornography. The makers also have a whale of a time with endless phallic imagery and self-referential quips more common to movies of the 90s than 70s.<br><br>The characters are far more quirky and idiosynchratic than you normally get in this sort of fare; a hippie academic, a star-struck, dipsy blonde and a buttoned-up corporate shark. Lange has gone on to become one of the most honoured and respected actresses of her generation, yet her career almost died right here. She was actually so good at playing the shallow, D-list airhead that critics and public alike thought it a reflection of her real self and dismissed her out of hand. Yet looking at her performance in hindsight she just oozes skill and star quality.<br><br>The film hardly puts a foot wrong until Kong appears. The production is smooth, the photography impressive, the locations superb and the story and characters engaging. But a fantasy adventure stands and falls by the suspension of disbelief achieved at the crucial moment. The first act of the 1933 Kong drags interminably until the King himself appears - then it soars. The reverse happens here; Rick Baker turns up in his ape suit, knocking down plastic trees and fighting a big rubber snake and the spell is shattered - in fact it was never even cast. The problem is also compounded by the screenplay's only serious error; making Kong sympathetic and pitiable far too early. The original Kong was always awesome and scary, even when he began to become sympathetic. Here he is just a bit too likeable, to quickly.<br><br>That the film remains just about watchable after this point is a testament to the performers and the strength of the story, but ultimately this effort has to go down as a missed opportunity to make a quality remake of a legendary film. Lets hope Peter Jackson doesn't make the same mistake next time round. You can't imagine him getting the film visually wrong, but it would be ironic indeed if he fell into the modern malaise of neglecting other key elements like story and character. Indeed, he could do worse than give the first hour of this movie a peek before he puts pen to paper.","user":"oldreekie546","rank":[37,45]},{"title":"Guilty Pleasure","rating":7,"date":"11 August 2004","review":"I hate to admit this having read many of the reviews but I can't help but enjoy \"King Kong\". Yes I realize it is silly and yest I realize the special effects aren't.... well, special. But I was 11 years old when this came out at Christmas in 1976. The hype was huge. The posters screamed that it was \"The Motion Picutre Event of Our Time\". I was caught up in it all and the film has a lot of fond memories for me.<br><br>On the positive side I think John Barry's score is one of his best. The lack of an Oscar nomination was a crime. Jeff Bridges and Charles Grodin (playing a bad guy for a change) are acceptable in their roles. Jessica Lange didn't exactly hint there was a two time Oscar winner present but she looked awfully good. And the supporting cast featuring character actors (Ed Lauter, John Randolph, etc) we've seen over and over again.<br><br>It's no classic. It may not even be that good. But every time it's on I watch it and enjoy it despite its flaws. I guess that's what a guilty pleasure is all about. And this may be my guiltiest pleasure.","user":"jrs-8","rank":[75,98]}]