[{"title":"ZOTZ! William Castle's Unkept Promise of Fun","rating":7,"date":"2 November 2003","review":"\"The Magic Word for Fun...ZOTZ!\"<br><br>Thus reads Columbia Pictures' withering one-line ad campaign for William Castle's \"Zotz!\" (starring Tom Poston, Jim Backus, Margaret Dumont and Cecil Kellaway), an alleged comedy that debuted to no particular acclaim in 1962. Obviously the marketing department was slap out of lipstick for this pig.<br><br>What's regrettable is that \"ZOTZ!\" could have been a smart and even sexy flick if Castle had stuck to the premise of Admiral Walter Karig's novel of the same name.<br><br>For those scratching their heads, Karig's 1947 story was a fanciful metaphor for the dilemma of the Age of Nuclear Weapons... What do we do with a weapon capable of annihilating any thing, any enemy, any country, and with as little effort as pointing a finger?<br><br>What do we do? Well, for starters, we learn not to point fingers and threaten our neighbors, or we might very well destroy ourselves. A simplistic observation for those of us with nearly 60 years of Cold War hindsight; but it was a revelation to Walter Karig when he wrote \"Zotz!\" (just two years after the bombings of Hiroshima &amp; Nagasaki).<br><br>The plot of \"Zotz!\" was just as simple: Prof. Jonathan Jones (a professor of ancient Eastern languages) comes into possession of a cursed amulet; Jones deciphers the amulet's powers to cause pain, to retard motion, and to kill, and he immediately suffers the consequences of his discovery. This is where the book and the movie part company.<br><br>Karig's story went on to explore some of the dire (and truly comical) consequences of absolute power, including sexual dysfunction: Prof. Jones realizes to his horror that pointing ANY part of his body at another living creature will send the victim into spasms of debilitating pain. This is a lousy realization for him to make during an intimate encounter with a beautiful woman--that the erection in his pants is as dangerous to her as a red-hot poker!<br><br>Now, this shows comedic promise: Here is a man of unlimited power who must vigilantly remain flaccid, lest he inflict unspeakable physical agony on his love interest. That's the stuff of classic cinema!<br><br>Ah, but does William Castle even attempt what could be one of the most awkwardly comic sexual encounters ever put to film? He does not. Well, in truth, he cannot... remember, it was 1962. Sex in mainstream entertainment was barely out of the box at the time. And William Castle wasn't a terribly clever film maker.<br><br>Instead, Castle's movie offers up a series of dry, two-dimensional vignettes merely demonstrating the ZOTZ effect: Professor Jones kills a moth; Professor Jones kills a lizard; Professor Jones becomes drunk at a faculty dinner and utters the magic word ZOTZ...zany hijinx ensue.<br><br>Unlike Karig's book, the closest this film comes to making a political statement against weapons of mass destruction is when Professor Jones attempts to turn the terrible ZOTZ amulet over to the Department of Defense; but the Pentagon bigwigs are too dimwitted to hear him out.<br><br>Granted, William Castle's \"Zotz!\" did employ some unusual special effects for its day, including a rooftop \"slow bullet\" sequence: Intoning the mystic word ZOTZ, Prof. Jones freezes a .45 slug in mid-flight and steps easily out of its path; then Jones leaps from the rooftop and falls about twenty floors in slow motion, end-over-end, to the sidewalk, as normal-speed action continues in the background. I doubt that such a surreal sequence had been attempted in film before.<br><br>It's in the final moments of the film, however, that Castle finally admits to his audience that he doesn't understand or doesn't give a damn about Walter Karig's intended message. Under Castle's ham-handed direction, Ray Russel's screenplay inexplicably finds us on the steps of the Lincoln Memorial with Tom Poston mouthing patriotic platitudes--then fade to the fluttering American flag with churchbells ringing liberty across all the land. And roll credits...<br><br>What does it mean? Is this fun? It can't be humorous, because, hey, the flag, right? Almost as an afterthought, Castle attempts to turn Karig's thoughtful anti-nuke metaphor into a pathetic piece of flag-waving Cold War propaganda. And he fails even at that.<br><br>How and why Walter Karig's much more whimsical ending was omitted from the film is one of the great mysteries of William Castle lore. As Walter Karig penned it, Professor Jones--after a roller-coaster flirtation with godhood-- chooses to chuck it all and seek a thoroughly anonymous role in society... that of a pest exterminator, whistling as he works, zapping roaches and rats one \"ZOTZ\" at a time.<br><br>Alas, William Castle (in his questionable wisdom) chose not to end a comedy on a comedic note; even though Karig's ending would have been perfect for Tom Poston, and may have conceivably salvaged Castle's dismal, downward-spiraling romp.","user":"CAMiller","rank":[25,28]},{"title":"Loved it as a kid.","rating":10,"date":"23 January 2003","review":"My two older brothers and my younger sister and I saw this at the historic Paramount in Abilene.  I was 7, so this is a review written through my seven-year-old's memory.  I loved it, and thought Tom Poston was incredibly funny.  As a promotional item, we all got a bronze-looking metal Zotz! coin upon leaving the theatre.  I had mine for years until my mother, in a hissy fit, \"cleaned\" my room and closet and threw away the cigar box housing it and a neat little collection of valuable Cracker Jack prizes.  They were made of metal in those days, with wonderful craftsmanship and detail.  I'm still sore about that.  Anyway, we all loved the movie.  I'd like to see it again.","user":"NativeTexan","rank":[32,38]},{"title":"creative","rating":6,"date":"23 May 2005","review":"Here's something that you don't see every day. In \"Zotz!\", a college professor (Tom Poston) discovers an ancient coin which has three uses for whomever holds it: if you point to someone, the person feels a sharp pain; if you say \"zotz\" to someone, the person goes into slow motion; if you point to someone and say \"zotz\", it kills the person. Not only does he start using it throughout town - with some unintended consequences - but the Soviet Union gets wind of the story (so you know what that means).<br><br>Overall, the movie was pretty (seeing him make Jim Backus move in slow motion was something), but the part about the Russian agents trying to steal the coin was sort of silly.","user":"lee_eisenberg","rank":[19,23]}]