[{"title":"Excellent movie","rating":8,"date":"20 July 2006","review":"I saw this film on late-night TV in the 1970's, a few years after doing a tour in Vietnam as a 20-year-old GI in the US Army. Even though it's a different time and a different war, I really thought \"The Virgin Soldiers\" captured a lot of the feeling of a young, western soldier serving in a confusing, brutal, sometimes even humorous Asian war zone. One of the most realistic things was, these guys were young, like most soldiers in most wars, kind of scared, and having to face the reality of shooting the guy in the other uniform before he shoots you. And I definitely recognized a fair number of the characters, especially the sergeants. War movies often stereotype or simplify the NCO's. In reality, and in this movie, some of them are bullies, some are flat-out cowards, and some are competent, quietly heroic people who do their best to keep their troops alive in the combat zone. War is not a good thing, but how people cope (or don't cope) with it will always be a fascinating topic. I highly recommend this film...wish it was on tape or DVD.","user":"kyuujo","rank":[28,29]},{"title":"When coming of age seems to take ages to come","rating":8,"date":"30 September 2012","review":"As a piece of semi-biographical history of recent colonial history in Malaya soon after World War II, you could probably do much, much worse than to see this rollicking black comedy. But, this is not a war story to be compared with Platoon (1986) and such like: this a young man's story where war, although present, is something to be avoided, at all costs.<br><br>The film is distinctive for a number of reasons: it deals with a politically painful episode in British history – the communist insurgency in Malaya; it was shot on location – Singapore and Malaysia – barely ten years after the British departed en masse; it has a bevy of experienced actors who fill the roles of tight-lipped colonials with flair and even brilliance; it was fun to spot three bit players who went on to stardom later in life (read through the full cast list); and, above all, it's a very personal story about a young man (Hywel Bennett as Pvt. Brigg) and his coming of age while serving as a National Service conscript.<br><br>Having served, myself, in the Australian colonial administration in Papua-New Guinea in the early 1960s, I can assure viewers that much of what you see in this movie is more or less what I experienced and observed where I was. And, for what it's worth, I can also relate to Pvt. Brigg's story in many ways...<br><br>In a nutshell, Brigg is enamored by the daughter (Phillipa played by Lynn Redgrave) of RSM Raskin (Nigel Patrick, in a standout performance). But, Brigg is also very much interested in a local prostitute, Juicy Lucy (the sublimely effervescent Tsai Chin), mostly as a means to lose his virginity. Phillipa, for her part, is also determined to lose her virginity to whomever – largely as a response to her father's disparaging comments about her sexual orientation. In the wings, so to speak, there is Top Sergeant Driscoll (the ever-so-suave Nigel Davenport), always ready to come to the aid of a female in, er, distress. How the shenanigans of that quartet pan out forms the substance of Brigg's story – a deliciously ironic narrative that guarantees viewer satisfaction.<br><br>As a backdrop to that story, the gradual deterioration of British rule intrudes (riots, communist insurgents, a derailed train, attack and counter-attack) to show (mostly comedic) vignettes of many other characters who form the group of service men within which Brigg serves. For example, I was almost helpless with laughter as I watched the inevitable, drunken deterioration of the men and women at the local mess hall dance: déjà vu, and then some. Be sure to watch and listen carefully as officers carefully navigate the hall, ignoring and stepping over drunken, supine revelers with skill as they discuss coming action. And, quite daring for the times, the antics of two gay recruits throughout this film is a continual comedic delight.<br><br>The full color photography captures the tropics perfectly; the dialog is excellent; the action scenes and editing more than adequate; the acting is, for me, spot on – and redolent of real people I mixed with, long ago; and even the bold, loud marching sound track suited the story.<br><br>If you're getting on in years, like myself, then you'll relate to those times depicted with ease, I would think; if you're young and ready to change the world, see how these young men did it sixty years ago. Either way, this is a movie I recommend highly for young and old adults alike.<br><br>Give this one a good, solid eight, for sure.<br><br>September 30, 2012","user":"RJBurke1942","rank":[10,10]},{"title":"Decent Movie, Hilarious Books.","rating":7,"date":"10 May 2009","review":"The 'Virgin Soldiers' movie was quite a frank piece of theatre. It contained all of the usual pathos of the book, but seemed to go more for a 'straight' piece of entertainment rather than a comedy.<br><br>Nigel Davenport carries a very strong character, enduing his roles with genuine gravitas. Here, he brings a sense of military authority to the often chaotic incursions of the far-east. By the end of the second-world-war, Britain was a spent Imperial force. This was obvious to ordinary squaddies long before it dawned upon the high command. Daveport's jaded but determined character here is perfectly believable as the conscientious sergeant looking-out for his green recruits. In fact, I find the movie far more plausible than many of the American Vietnam war movies, but that may be just a cultural interpretation thing.<br><br>The original novels were a lot more bawdy and a great deal funnier than the events depicted in the movie. In fact, I think 'Onward Virgin Soldiers' is still one of the funniest books I have ever read. Some of the narrative had me in stitches.<br><br>Watch the movie, by all means. But read the books as well.","user":"screenman","rank":[5,5]}]