[{"title":"Shocker II","rating":7,"date":"25 March 2018","review":"When Detective Lucas McCarthy (Lance Henriksen) finally captures the notorious serial-killer Meat Clever Max Jenke (Brion James), he feels relieved when Max is executed by the electric chair. However the parapsychologist Dr. Tower (Matt Clark) warns McCarthy that Max will return, but he does not give attention to the doctor. McCarthy is a family man and lives with his wife Donna (Rita Taggart) and their daughter Bonnie (Dedee Pfeiffer) and son Scott (Aron Eisenberg) in a comfortable house. Soon McCarthy becomes delusional seeing Max everywhere. When Bonnie´s boyfriend Vinnie (David Oliver) is found dead in the house, his family believes McCarthy killed the teenager and he is arrested. But he knows that Max is the responsible for Vinnie´s murder and wants to destroy his family. <br><br>\"The Horror Show\" is a supernatural gore film with a rip-off Wes Craven´s \"Shocker\". Although entitled 'House III\" in Brazil, it might have been \"Shocker II\". Anyway, \"The Horror Show\" is underrated with good performances of Lance \"Alien\" Henriksen and Brion \"Blade Runner\" James. My vote is seven.<br><br>Title (Brazil): \"House III - A Casa do Espanto\" (\"House III - The Frightening House\")","user":"claudio_carvalho","rank":[6,7]},{"title":"No Spoilers- Just Kudos","rating":7,"date":"14 October 2008","review":"I just learned (reading these IMDb reviews) that this is a supposed \"House\" iteration... I never would have guessed it- In fact, I've been a fan of this film for years, and never even considered it had anything to do with the \"House\" films (I've only seen the US release, which is NOT titled 'House III', obviously)- Lance Henrickson is his usual, intense, (in my opinion, Excellent) self, we see a young Dedee Pfiefer being, well, herself- and Brion James at his most foreboding since 'Leon' in Bladerunner... (not going to talk about Tango &amp; Cash here...). As for the 'Shocker' similarities- check the dates... this one came out first- Because of this, (all deference to Mitch Pileggi, of whom I'm also a big fan) I've always felt that Shocker was the rip-off, of a MUCH more intense and, pardon the pun, Shocking film... (I was really surprised to see a \"Smithee\" attached to this film anywhere- my guess is... politics. But hey, that's Hollyweird for ya). Yup, there's gore, and oh yeah- swearing galore, but this movie is one I look forward to dusting off every October, as my \"must watch list\" approaches \"psycho-killer week\"... (quick plug here- if you haven't decided whether or not to watch \"Behind the Mask- The Rise of Leslie Vernon\"- do yourself a Big favor, and check it out- it defies classification; funny, sharp, and actually Scary!). <br><br>If you're looking for a horror movie that may make you wince (talking about Horror Show)- this one could be a winner for you- It certainly is for me.<br><br>TDB in Hollywood<br><br>Quick P.S.- Fans of Lance- If Vampire movies are more your speed, a MUST-See is \"Near Dark\"- Honestly one of the Coolest Fang-pics I've ever seen... Happy Haunting!","user":"servo555","rank":[8,11]},{"title":"Great Lead Characters Makes the Film","rating":6,"date":"6 September 2017","review":"The Horror Show (1989) <br><br>** 1/2 (out of 4)<br><br>Detective Lucas McCarthy (Lance Henriksen) finally manages to arrest the notorious serial killer known as Meat Cleaver Max (Brion James). However, at the electrocution, something goes wrong but finally Max is pronounced dead. This should be the end of Lucas but instead he becomes convinced that Max has somehow survived and is coming after his family.<br><br>THE HORROR SHOW, for some reason, got released in certain parts of the world as HOUSE III even though it has absolutely nothing to do with that series. I stayed away from this film for quite a while just thinking that it was some sort of cheap horror film but it actually turned out to be much better than I expected thanks to some good characters and some bloody effects.<br><br>I really thought the character development for the lead detective was quite good and Hendriksen is such a fine actor that even though this is a horror film you don't mind going along for the ride. I thought the screenplay was quite good, if cliché, and it managed to hold you attention through the various scenes where the lead character is basically questioning his own sanity. The detective character was a good one but so was the serial killer. He was certainly a demented character and after the opening sequence and a certain bit of violence, you know this guy is for real and a nut.<br><br>Both actors did a very good job with their roles and this certainly helps makes this a bit more than your average slasher. It also doesn't hurt that there are some very good special effects and especially if you're watching the uncut European version, which restores some of the gore that was cut out of the U.S. theatrical release. The film also offers up some nice cinematography and a good music score.<br><br>THE HORROR SHOW isn't a masterpiece but it's certainly much better than what you typically get with a film like this. The two lead performances really sell the story and this is very much worth watching.","user":"Michael_Elliott","rank":[2,2]}]