[{"title":"Grimly powerful King and Country unrelenting.","rating":9,"date":"19 August 2011","review":"Like the incessant rain King and Country mired in mud and military litigation is a non stop emotionally powerful film of human spirit crushed by mechanized war and the necessity to maintain order. It's a chaotic Paths of Glory closer to the front and just as unjust.<br><br>After repeated shellings and engagements with the enemy Pvt. Hamp (Tom Courtnay) is arrested trying to walk back to England from the battlefields of Europe. Put on trial for desertion he and his lawyer Captain Hargreaves (Dirk Borgarde) devise a plan to attempt to save him from the firing squad. With shelling in the distance court convenes.<br><br>A filmed play with much shot in close-up along with a smooth and unobtrusive camera movement within the claustrophobic confines of the trenches ( with some telling stills) King and Country is an unrelenting depiction of absurd sacrifice stopping only for a moment to exterminate one with those around him scheduled for the same per order to immediately move out.<br><br>Director Losey's anti war tract is one of the most sober and ultimately powerful of an era when anti-war films flourished with wild absurdities from King of Hearts to How I Won the War. His inquisitors drab bureaucrats instead of ogres his stage a rat infested quagmire instead of a chess board floor of a French Château the film resonates with a callous, hopeless and to add insult to injury clumsy rush to justice. <br><br>Bogarde's Hargreaves is measured and restrained, his pauses and glances masking incertitude brilliantly. Coutrtnay is outstanding as the born to lose Hamp. Both touching and frustrating he states his case with a warped benign logic. Leo Mc Kern's hostile doctor also register's in a gruff way.<br><br>King and Country may not match the scale of All Quiet on the Western Front or Paths of Glory but Losey's deft and tight handling within it's limited confine packs every bit as an emotional punch.","user":"st-shot","rank":[24,24]},{"title":"pretty devastating","rating":7,"date":"19 November 2010","review":"\"King &amp; Country,\" directed by Joseph Losey and released in 1964, is an unrelenting look at war. The World War I drama concerns a young soldier (Tom Courtenay) who is being tried for desertion. It's evident that, after his whole battalion was lost, that the boy was shell-shocked. A Captain Hargreaves (Dirk Bogarde) is brought in to defend him.<br><br>The film has actual photos of dead bodies from the London War Museum throughout the movie. The setting is freezing cold, wet bunkers with lots of mud. The men have been jaded to death and suffering and at times act brutally.<br><br>The end of the film is particularly awful, that's the only word I can think of. Not awful as in it's a bad movie, but awful in the situation.<br><br>Tom Courtenay does an excellent job as a wide-eyed young man who really doesn't realize what he did or what may happen to him as a result; Leo McKern turns in an excellent performance as a no-nonsense officer. Dirk Bogarde is wonderful as the captain who goes to the mat for his client and comes up against a cruel system that seems to have no understanding of or compassion for human frailty.<br><br>Lots of gross stuff in this movie - imagine actually having to endure it. Excellent directing job by Losey, and a thought-provoking film that you won't forget quickly, even though you want to.","user":"blanche-2","rank":[16,16]},{"title":"The deserter","rating":6,"date":"20 July 2014","review":"King &amp; Country is directed by the American Joseph Losey and stars Tom Courtenay as a young soldier in the Great War, shell shocked and facing a court martial for desertion.<br><br>Dirk Bogarde plays the officer whose duty is to defend him, at first he seems to be reluctant in his dealings with him, viewing him as a working class imbecile and cowardly to boot. However once he gets to know him a little, Bogarde discovers that many of Courtenay's friends and comrades in his battalion have died, he takes the case more seriously especially as he will be executed if found guilty.<br><br>The film is very much a stage play but is also arch as well as having a stylistic template with actual photos of dead bodies from the Imperial War Museum. The set tries to recreate the trenches with a cold, damp, dank setting.<br><br>The film has a grim atmosphere as displayed by the foot soldiers and Courtenay is one of them, a soldier who does not realise what he has done and the trouble he is in.<br><br>The film highlights the class aspect of the war as the officers have little compassion for the lower ranked soldiers and show no mercy for those driven to despair or madness.","user":"Prismark10","rank":[9,9]}]