[{"title":"A Good Movie Based On The Classic Cartoon Series","rating":7,"date":"17 April 2018","review":"I've been watching Jetsons The Movie for many years. It is one of my favorite movies. Out of all the movies that were based on Hanna-Barbera cartoons, I have to say that is one of the better ones. While it's not without it's problems/flaws, it's better than some of the animated films that are coming out today. I love The Jetsons. I love both the original Jetsons cartoon series and the movie. If it wasn't for the film, I wouldn't be The Jetsons fan that I am today. It's a very underrate film.\n \n The animation was good and very colorful. I loved that they mixed CGI with 2D Animation. The CGI may have not been the greatest but it was decent. I even loved the new characters like Judy's boyfriend, Apollo Blue, the Grungrees and the Robot Family. Plus this film has a great soundtrack. My favorite songs are You And Me, Staying Together and Home. The voice acting was good too and I even have to admit that Tiffany did a good job voicing Judy. She isn't much of an actress but she does ok. The story was good and decent but wasn't without it's flaws. Judy's subplot is one of the flaws in the story. I can understand her being upset about not going out on a date with Cosmic Cosmo but come on...she hardly knew him and he hardly knew her. It's stupid! I felt that Elroy's subplot with Teddy-2 (the robot boy) was done better. I don't hate Judy's subplot but I wish it was done a little better.<br><br>One of the things that the film did right was give The Jetsons friends. One of the things that The Jetsons television series lacked was friends for The Jetsons. Plus I wish that the film was longer so that The Jetsons could interact with their new friends/neighbors a bit longer and expand upon their new friendships (like Judy spending more time with Apollo and getting to know him better). <br><br>I still love this film even though it has it's problems and flaws. It's not the greatest animated film ever made but it's not horrible. There are worse movies out there and some movies deserve to be forgotten, but Jetsons The Movie (at least in my opinion) doesn't deserve to be forgotten. There are people who do love this film and I'm one of them. The film is still watchable, fun and enjoyable. The film has a good message about protecting the environment and actually does a better job with it's environmental message than some of the other environmental films that came after it. The film does stay true to the original television series and like the television series, the film does have it's warm and loving moments. It's a good film for the entire family and if you are an animation fan, I would give this a watch. <br><br>Plus I do know the story behind this film and how Judy's original voice actress Janet Waldo was replaced by Tiffany. While I said that I thought that Tiffany did a good job voicing Judy, I have to be fair to Janet Waldo since she voiced Judy for a long time and really loved doing The Jetsons. She was very hurt and heartbroken over the decision that Universal Studios made to replace her with Tiffany and I felt really sorry for her and half of me is mad at Universal for making that decision but I don't hate Tiffany or her performance as Judy Jetson. I still believe that Tiffany did do a good job. To be honest, I love both Janet Waldo and Tiffany as Judy Jetson. But one thing is for sure, Janet Waldo will always be Judy Jetson.","user":"saralenau","rank":[4,4]},{"title":"A cartoon movie well-made!","rating":8,"date":"9 April 2017","review":"This movie is actually great! I wasn't expecting it to be as good as it was! I didn't grow up watching the Jetsons at all. So I couldn't compare it to the actual cartoon but part of me wishes I did. The music was pretty catchy and it's heart felt moments made me wish I was a kid watching this! I love that cute little guy Elroy! He was my favorite!<br><br>Reminder, this was made in the 90's. Obviously flaws but that doesn't matter. This movie with it's flaws made it great! The message of the movie is that family comes first! That's what matters!","user":"rasheedthomas-68306","rank":[4,4]},{"title":"Great Memories","rating":8,"date":"28 November 2016","review":"This was one of my favorite cartoons in my childhood, and i must say i first watched movie and then TV show, i see many negative comments about this movie, why so many hate, okay it is more commercial than TV show, but i really enjoyed this one as a child, and i am enjoying it now as an adult, it is very positive movie and great finish for whole Jetsons serial. Only negative minus is maybe the voice acting of singer Tiffany as Judy, her voice just don't fit with Judy, that was a big minus and yes also i didn't like her space boyfriend, he looks like some alien/elf version of Peter Pan. But other things are great, i really love music you can really feel the mix between 80's and 90's decade, and the whole style of the movie is like that. I also like environmental issues, and how because of our greed we are destroying whole worlds and other cultures and societies. I will definitely love this movie and TV show and this memorable characters to the end of my life, and i hope i will play this to my children, to became better people in this dark world.","user":"aleksandarsarkic","rank":[3,3]}]