[{"title":"The British Rebel Without A Cause...","rating":8,"date":"4 October 2002","review":"A young man joins the British mod movement and gains a feeling of belonging and importance, but this makes him even more disenfranchised from his boring 9 to 5 life.<br><br>Britain's answer to Rebel Without A Cause is based around a fair-to-middling Who concept album (they financed the movie too) and was made on a modest budget, but has far too much going for it to be ignored. Especially if you are working class and come from the UK.<br><br>(How it is viewed elsewhere is beyond my telling, but reading reviews on this site I get the impression that people from all over the world can relate to its central themes - even if the locations and accents are alien.)<br><br>Director Franc Roddam was smart enough to cast a young Phil Daniels in the central role of Jimmy. Daniels is a good actor, but he is neither smooth or particularly good looking. This prevents him being accused of glamorising some of the things that he gets up to.<br><br>Jimmy is, indeed, also a bit naive. He has a boring job in the post room of an advertising agency (note the satire about pushing smoking - this is the \"no health warning\" 60's!) and rides around on a scooter with lots of lights on the front.<br><br>Life, for him, is about getting through the day and partying at night/weekends to the hip sounds of the day - the non-Who soundtrack album is a taster to mid 60's Brit Pop.<br><br>(His parents don't understand him either - but this could be taken as read in this style of movie!)<br><br>As most of us know, and a few even tell Jimmy in the movie proper: Life cannot be all parties, cheap thrills and gang fights, but he doesn't seem to want to listen. He is one of the world's great \"there must be more to life than this\" merchants - in this he is right, but you need to be brighter, better educated or better looking to have it. <br><br>There is a good cast of British new wavers on show here: Leslie Ash plays Jimmy's love interest and Sting gets to be the \"Ace Face\" - the good looking top dog mod that Jimmy wants to be. The home truth about this character leaves Jimmy even more exposed.<br><br>Quadrophenia is one of the greatest films about being a teenager ever made and thank god we have video cassettes, DVDs and cable/sat TV so people can actually see it. A low budget classic that deserves to seen at least once by all film buffs and several times if it reflects your life in any way.","user":"Pedro_H","rank":[54,62]},{"title":"Excellent","rating":10,"date":"29 June 2001","review":"I hated this film when I saw it as a teenager back in 1979.  The reason was the movie was realistic--too realistic!  I identified (in some respects) with the main character Jimmy, and his life was bleak and depressing. Seeing it over 20 years later, I love it!  It's a superb mix of the 1960s British \"Angry Young Men\" films, the Who's great album and 1979 sensibilities.  It's about Jimmy (excellent performance by Phil Daniels) and his friends.  It takes place in 1964 London and there are constant battles between the Mods (Jimmy and friends) and the Rockers.  The film is full of violence, sex, VERY strong language (good luck with the accents), anger, alienation...the works.  However, there is a strong sense of humor (a break in at a drug store is hilarious) and it does have a (sort of) happy ending. But it is very dark and depressing.  <br><br>The music score is excellent.  It's not just the Who, but other 1960s groups are used also.  The direction by Franc Roddam is wonderful--it perfectly merges the music, imagery and story (especially with \"Love, Reign Over Me\"). My only real complaint--why not use the whole album \"Quadrophenia\"?  Only about 1/8 of the two record set is used!  Also interesting to see Sting in his first movie.  Don't miss this one!","user":"preppy-3","rank":[46,54]},{"title":"life's core brutally and artfully revealed - 10+++","rating":10,"date":"12 August 2002","review":"What a wonderful film. If you ever thought you were safe, or that your world was impregnable, then you must see this film. Watch as every important elements of a young man's (Jimmy's) life is stripped away, piece by piece, until he has no anchor, no magnet, and no direction in life.<br><br>Without his familiar crutches (hooliganism, drugs, girlfriends, Mod clansmen, job, parents, home and 'scooter'), Jimmy is faced with a terrifying realization that he - alone - must completely rebuild and reinvent himself.<br><br>In a way that is hard to describe in words, director Franc Roddam exposes the raw core of life, unadorned by all the temporal things by which we measure success, worth and happiness. Better still, he forces the viewer to examine the very definition of 'a life'.<br><br>The movie generates ever increasing momentum, culminating in one of the most intensely disturbing realizations ever captured on film, with the white cliffs of Dover as the foreground, and the The Who's equally monumental and haunting \"Love Reign O'er Me\" in the background.<br><br>With the possible exception of Bill Murray's version of \"The Razor's Edge\", this is about as perfect a chance as we are ever afforded to examine the foundations of our own lives (...what more can you ask of a film?). Though this is not an uncommon cinematic theme, it has never been so brilliantly achieved.<br><br>An emotional and spiritual tour de force, and simply one of the best films ever made.","user":"delphivagi","rank":[70,85]}]