[{"title":"Terms Of Endearment 2018","rating":8,"date":"29 May 2018","review":"It's often a strange experience to revisit a film that made a big splash decades earlier. I remember enjoying it enormously and enjoyed it enormously again last night but the reasons for the enjoyment have changed. The film as a film has remained solidly planted in 1983, specially the score but what will lead this film into the forever ever are the writing of course and the performances. Shirley MacLaine's truthfulness warts an all is a work of art. She is present one hundred per cent of the time and let's remember, Shirley MacLaine didn't start as an actress, she was a dancer who became a star thanks to a twist of fate and she has remained there as an example of honesty and courage ever since. Her Aurora in Terms Of Endearment is a monumental treat. Debra Winger's performance is a revolution of sorts. Every detail confirms and/or challenges our feelings for her but she's never less that one hundred per cent truthful. It's impossible not to love her even if she doesn't make it easy for you. Jack Nicholson is a terrific interference and every one of his moments have a pleasure of their own. So, a 35 year old movie with a teenager's heart.","user":"johngiovannicorda","rank":[53,57]},{"title":"Stop Trying To Pretend Like You Hate Me","rating":6,"date":"6 March 2012","review":"I've heard many good things about James L. Brooks's 'Terms of Endearment' and finally I decided to give it ago. Honestly speaking I was expecting a typical melodramatic tearjerker that's sole aim is to emotionally manipulate the viewer. I was wrong. 'Terms of Endearment' is a slice of life that centres around a mother, her daughter and their respective lives. The film looks very authentic. The sets, makeup, costumes and art direction look genuine.<br><br>This is very much a character driven film. The dialogues are full of humour and wit but what's also striking is how deeply layered the words are. While the visuals are quite simplistic it's the characters that shine especially through the actors' natural performances. Their excellent non-verbal gestures, spot on line delivery and restrained performances are superb.<br><br>A sassy Shirley Maclaine and bubbly Debra Winger are spellbinding. Both actresses beautifully carry the film and they are brilliantly supported by fine actors like Danny DeVito, Jack Nicholson, John Lithgow and Jeff Daniels.<br><br>What particularly appealed to me about 'Terms of Endearment' is the depiction of the mother-daughter relationship and the dynamic of it. It definitely has its ups and downs and it does not involve the use of clichéd lines like 'I love you' etc but at the same time the unconditional love between them is wonderfully conveyed.","user":"Chrysanthepop","rank":[42,48]},{"title":"Wow","rating":8,"date":"8 October 2004","review":"Wow was my first reaction to seeing the film back in February 2003. I had bought it on a whim and watched it one night when I was bored. The rest is history. Terms remains one of my favorite films and I really can't say why. Reputation has made this out to be \"the ultimate chick flick\" upon which every other tear-jerker is judged. But it's definitely more of a character study than a weepy mushy movie. In fact, it's anything but mushy. Where it could of been over-sentimental, it was poignant. Where it could of been boring, it was insightful. And where it could of been corny, it was tongue-in-cheek.<br><br>Shirley MacLaine and Debra Winger give career performances as mother and daughter. Both characters are polar opposites and in real life the actresses despised each other, but on screen their chemistry sizzles. Jack Nicholson is his usual suave self and John Lithgow is perfect as the wimpy banker. Danny Devito also has a quirky cameo.<br><br>James L. Brooks is definitely an \"actor's director\". To him, the performances are clearly more important than set pieces or flashy camera work. Each of the three main performances are brilliant (especially MacLaine's). It has been decades since a movie about illness has been made like this that is so achingly real. Two scenes to look for: Aurora walking across a seedy hotel (heat-breaking) and Emma telling her mother that she's pregnant (hilarious).<br><br>Terms of Endearment is a triumph!","user":"MJJLWolf72","rank":[74,95]}]