[{"title":"More than a movie","rating":8,"date":"5 July 2008","review":"This is a superbly crafted film that transcends mere entertainment and becomes an experience much greater than the sum of its parts. When you watch this movie, you are unleashing a very powerful force that short-circuits your natural ability to remain in control. It is like hypnotism, you have no choice...you are unable to think, act, or even believe apart from the intense feelings Jacob's Ladder inspires.<br><br>Tim Robbins is Jacob Singer, a warm and genuinely likable Vietnam veteran who, in spite of earning a doctoral degree, chooses to find employment working for the U.S. Postal Service. We learn in bits and pieces as the plot unfolds that his service in Vietnam included a very frightening battle, and the events set in motion on that fateful day parallel what could be his descent into madness.<br><br>Jacob's life suddenly begins to resemble Hell. He is literally chased by confusion, fear, and death, he sees unbelievably terrifying images, has horrific experiences that whether real or imagined are too frightening to bear alone. His only comfort comes in the form of the woman he lives with, Jezzie (Elizabeth Pena), and his chiropractor, Louis (Danny Aiello). Each of these people's relationships with Jacob represent more than just the roles they fulfill in his life, they are absolute forces at battle for his sanity, and possibly even his soul.<br><br>His torment begins to include the past as well, the undeniable love he still has for his ex-wife and painful memories of his son Gabe, who died tragically in an accident (played by a young and virtually undiscovered Macauley Culkin). As all these elements of the past, present and future collide in shocking hallucinations, Jacob slowly begins to suspect he could be the victim of a secret Army drug experiment gone terribly wrong.<br><br>With a haunted desperation, he embarks on a journey to find out what on earth happened to him - only his visions / flashbacks / flashforwards have become so delusional that reality and fantasy are hopelessly interwoven and nothing is as it seems. All that is decipherable is good and evil, life and death. And at the end of his nightmare, all he has to do is choose.<br><br>That's all I will share of the story. I'm not going to do you the disservice of spoiling the experience this movie is. Suffice it to say, there is much more to know, and nothing left to tell.<br><br>Meanwhile, there is not enough that can be said of Robbins' performance...although he has had better roles, never before or since has he portrayed his own emotions so nakedly. This is director Adrian Lyne's best by far, and by the way he's no slouch (Fatal Attraction, 9 1/2 Weeks).<br><br>This is not a horror movie as some may think, it is human drama masterfully disguised as a supernatural thriller. The basic elements of Jacob's Ladder have been plundered several times in recent years. We have been suckered by flashy films with clever plot twists that cheat us on story, characters, and technical excellence. This film delivers all that and more. Movies like this are set apart from the rest of the pack because you don't just watch stuff like this, you feel it too.","user":"travisyoung","rank":[134,146]},{"title":"More to be felt through than thought through.","rating":13,"date":"13 October 2001","review":"After reading several reviews on this film I thought I would add my two cents. This remains one of my favorite movies and I never hesitate to take in another viewing. A lot of people seem to be noting the loose script and story elements as the film's weaknesses, going so far as to call it messy and incoherent. The fact that even after seeing it several times there's still some mystery in it, still some ambiguity as to the possible meanings to all of the things that go on with Jacob, is what I find most appealing. It's not a film like the Sixth Sense where all of the pieces fall into place at just the right time and you know exactly where you stand. It's something rather that is left to the imagination of the viewer, a rare thing when audiences en mass want clear cut explanations and easy answers (hence the success of Sixth Sense, a great film in it's own right, but the complete opposite of this one).<br><br> The visuals are incredible and highly influential. The techniques used in this film have since been overused and distilled throughout various horror movies and music videos, but without ever coming close to the power of the original, which presents some of the most psychologically terrifying images ever to appear on screen. I think it's hard to come to this movie for the first time today and experience it the way you could have eleven years ago, when these type of images had yet to be seen and were exposed to completely unsuspecting audiences. The best way to see this movie is with absolutely no knowledge of it beforehand.<br><br> The mood is perfect. The acting is great, the dialogue is outstanding. Danny Aielo explaining to Jacob about angels and demons still moves me to this date and the two simple words suddenly spoken to a disbelieving Jacob from some unseen source while in the Asylum scene still terrify like no other movie can. Also this may be the Home Alone kid's best film.<br><br>The extra scenes on the DVD range from average to terrifying, including the omitted \"antidote\" scene, something I'm glad I didn't see when I was younger because it might have scarred me for life :). Also there is a perplexing and scary scene omitted at the end where Jacob confronts Jezebel. There is alot of digital grain in some of the shots. I would like to see a better quality DVD put out for this one, but I'll take what I can get with the added scenes.<br><br> See this movie then see it again and then see it three years later. Don't over-analyze and worry if some of it doesn't make sense, after all it's not all supposed to.","user":"travisgentry","rank":[167,193]},{"title":"The grandfather of \"rubber reality\" films","rating":10,"date":"1 March 2005","review":"The film begins with Jacob Singer (Tim Robbins) and his platoon in Vietnam. When they're suddenly attacked, it's chaos, and the platoon appear to be the victims of some kind of chemical warfare. Jacob is stabbed in the stomach with a bayonet. Suddenly, without explanation, we see Jacob back in New York City. He's returned home from the war and he's trying to get his life back on track, but he keeps having odd experiences, seeing odd, frightening people, and having close calls with death. He cannot tell \"dreams\" from reality. What happened to him in Vietnam? <br><br>Jacob's Ladder is the grandfather of the \"rubber reality\" films that became so popular throughout the 1990s and into the 2000s. The films with the most direct influence from Jacob's Ladder have appeared more recently-- Memento (2000), Mulholland Dr. (2001), The I Inside (2003), and The Butterfly Effect (2004). Less obvious, but also strongly influenced are films such as Abre los ojos (1997)/Vanilla Sky (2001), eXistenZ (1999), The Thirteenth Floor (1999) and The Matrix (1999), as well as films where the \"rubber reality\" is usually played more straight, such as The Sixth Sense (1999) and The Others (2001).<br><br>Of course, like any artwork, Jacob's Ladder has its precursors, too, such as the short story by Ambrose Bierce called \"An Occurrence at Owl Creek Bridge\", which was originally published in 1891 and later used as a basis of a silent film called The Spy (1929), and then a French short entitled La Riviere du hibou (literally \"The River of the Owl\"), the latter also airing as an episode of \"The Twilight Zone\" (1959). There is a very strong religious/mythical allegory running throughout the film--seen in everything from the Judeo/Christian nature of the character's names and the title of the film itself to character interests, as Jacob begins extensively studying demonology, the occult and so forth in an attempt to figure out what is happening to him. We are also treated to subtle connections with other works, such as philosopher Albert Camus' novel L'Etranger (\"The Stranger\"), which Jacob is reading in the film when we first see him on the subway, and there are many at least subtle stylistic and content precursors, such as Altered States (1980).<br><br>In light of the subsequent instantiations of the film's brand of rubberizing reality, as well as the more purely stylistic elements that have been used to often excellent effect in later films, such as the hyper kinetic figural motion that found its way into William Malone's films House on Haunted Hill (1999) and Fear dot Com (2002), Jacob's Ladder may seem relatively transparent or even tame. It's certainly easier to reach an interpretation for this than for a film like Mulholland Dr., where director David Lynch is purposefully obfuscatory. Still, Jacob's Ladder is one of the better films of its kind. Director Adrian Lyne achieved a continually offsetting creepiness that is rarely matched, and some scenes--such as the gurney journey through the increasingly dilapidated hospital corridors, could not possibly be topped.<br><br>Seen in the context of Lyne's other films Jacob's Ladder is all the more surprising, as the bulk of his career has been focused on hyper sensual and sexy dramas and thrillers--such as 9 1/2 Weeks (1986), Fatal Attraction (1987), Indecent Proposal (1993), Lolita (1997) and Unfaithful (2002). Jacob's Ladder has its share of eroticism, however, mostly through the gorgeous and impassioned Jezebel (Elizabeth Pena), even though her most heated moment has her appropriately fraternizing with a demon.<br><br>Lyne's relatively straightforward approach to the film's elastic ontology, especially in conjunction with his tendency to be forthcoming and thorough in explaining his view of the plot (a predilection shared by scriptwriter Bruce Joel Rubin) may be unfortunate in that there is an interpretation of Jacob's Ladder accepted by a vast majority as the \"right answer\". That's a shame because there are countless possible readings of this material; differing views on everything from the general crux to the smallest minutiae. Part of the inherent beauty of the film is that any scene or set of scenes may equally be taken as the \"real events\", and any of the dialogue may be taken as providing clues to your preferred interpretation.<br><br>Robbins' performance is important to the film in that he is the focal point of almost every scene and has to convincingly play a vast range of emotions; he does so with finesse. The rest of the cast is noteworthy, even though their questionable nature gives them a lot of leeway in terms of verisimilitude and consistency.<br><br>But the real driving force that makes Jacob's Ladder such a success is its eeriness. This is a horror film after all, both on psychological and more apparent supernatural levels. Lyne continually and disconcertingly pulls the rug from beneath not only Jacob, but the audience as well, yet manages to never make a viewer feel lost, instead producing an eagerness to solve the \"mystery\" while you root for Jacob.","user":"BrandtSponseller","rank":[239,287]}]