[{"title":"Comparison of scenes from \"Tess\" & \"The Third Man\"","rating":8,"date":"12 January 2006","review":"This is a delicious film - a cinematic strawberry-sundae - with entrancing Nastassja Kinski as the succulent cherry on top.<br><br>Don't miss the opening scene, in which the village maidens, all dressed in white with flowers in hair, skip along behind musicians as they slowly make their way up an old farming roadway towards camera &amp; then past... In my opinion, this scene is as subtly magnificent as that classic scene from \"The Third Man\": 'Anna', coming from the grave site, making that seeming-to-take-forever walk along the road towards where 'Holly Martin' stands awaiting her, &amp; then, she walks straight past, ignoring him...and from a pocket of his rumpled overcoat, he digs-out a pack of ciggies &amp; lights one up...The End.<br><br>Both are magical, time-suspending scenes, created by visual virtuosos who also knew that sometimes a modicum of music can be far more effective than a deluge of dialog.<br><br>TB - a staff member of Prospect Point Productions, Inc","user":"prospectpt","rank":[48,57]},{"title":"Why dont they make them like this anymore?","rating":17,"date":"17 July 2001","review":"I saw Tess as a teenager and the images and emotions have lingered with me ever since.   I remembered Natasia Kinski as Tess being tempted with a strawberry by her cad of a cousin, the subtlety of showing a murder by just having the tiniest spot of blood appear on the ceiling below, the powerful poetry of the final scene at Stonehenge...   I have just watched the film again and it was even better than I remembered.  I will go to my grave being in love with Kinski in this role!   I had forgotten also what a perfect performance Peter Firth gives as Angel Clair, and the apparent authenticity of life in rural Victorian England.   Perhaps what is most extraordinary is the leisurely pace at which the story is told.     Shots linger on the countryside after characters have said their lines and moved off.  many sequences exist entirely to build up to a single glance or gesture.   Altogether Tess is a superb lesson in story telling and one of the truly great movies of all","user":"Adampreston","rank":[56,69]},{"title":"Perfect homage to Hardy's novel","rating":9,"date":"30 November 2004","review":"This film was an almost exact replication of Thomas Hardy's novel \"Tess of the d'Urbervilles\". It's so rare to watch a film after reading the novel and not be disappointed by it, but this film didn't disappoint in any way.<br><br>Details, such as the whiteness of the maids' dresses, the sound of milk squirting into a bucket, the sloshing mud of a wet English turnip field, and the glint of adoration in the eyes of the young lovers -- all came gloriously to life as if fresh off the pages of the book.<br><br>I highly recommend this film for anyone who enjoys a good old fashioned Victorian love story.","user":"modern_maiden","rank":[49,61]}]