[{"title":"Why hasn't anybody ever heard of this movie?","rating":9,"date":"17 September 1999","review":"I stumbled across MORITURI in a Virginia Blockbuster; I've never seen it for rent anywhere else. I noticed that it had Marlon Brando and Yul Brynner, so I thought it had to be worth a try. And so I saw what turned out to be one of the top 20 World War II movies I've ever seen. That's right, up there with PATTON, THE YOUNG LIONS, and the like.<br><br>Brando plays Robert Crain, who is assigned to go undercover on board a German freighter transporting a cargo of rubber to the war zone. He must impersonate a Nazi to do this, and must face some hard choices as to how cruel he can be to appear realistic. Brynner is Muller, the captain of the freighter who has accepted the job as his last chance to save his career in the German merchant marine. He is fair and compassionate and must rein in the fanatical Nazi second-in-command that his superiors have appointed for him. En route, the freighter picks up the survivors of a U-boat, including Esther (Janet Margolin) a beautiful young concentration camp survivor who is so brimming with hatred and vengefulness that she can no longer even accept human compassion.<br><br>Brando is very good in his role, but he is completely upstaged by Brynner, who gives the performance of a lifetime. His conflict, between his patriotism and self-preservation on the one side and the vileness of what the Nazis are doing to him and to his country on the other, is marvelously realized. The movie also features a beautiful exchange between Brando and one of the passengers - \"I was a political prisoner.\" \"Falsely accused, of course.\" \"No. Not falsely accused.\" (smiles). I have a soft spot for movies where adversaries come to respect each other, and MORITURI is one of the best of that type.<br><br>Good luck finding this movie. It's a true diamond in the rough.<br><br>Rating: ***1/2 out of ****.","user":"Danimal-7","rank":[65,68]},{"title":"Great overlooked film","rating":17,"date":"17 February 2002","review":"Back in April 2001, I saw Last Tango In Paris and I've been on a Marlon Brando kick ever since. I read Peter Manso's Brando biography, which states that the film was panned and I really don't understand why.<br><br> The film boasts two commanding performances by Brando and Yul Brynner.<br><br> Brando plays a German man who's blackmailed by British Intelligence to pose as a NAZI officer on a German ship commanded by Brynner. Brando's German accent was full on the whole way through. And after seeing various Brando films, it was really cool to see Brando play a double agent that was light on his feet, sneaking in and out of rooms on a German ship, in an attempt to sabatoge the ship. The supporting performances are solid all the way around. Trevor Howard has a nice cameo at the beginning of the film as a British Intelligence man.<br><br> I've always known about Yul Brynner, but this is the first time I see one of his performances. I can see why he's a legendary actor. The guy has tons of personality and has the acting ability to go with his charisma. And watching him work with Brando was an absolute pleasure. Now I definitely have to go and rent more of Brynner's stuff.<br><br> Brando's career presumably took a dive in the 60s, but Morituri is definitely a good movie with excellent performances by its two leads and it boasts some of the best camera work I've ever seen.<br><br> On a scale from 1-10, I'd give the film at least an 8.","user":"konover","rank":[42,44]},{"title":"Bleak, fascinating war pic","rating":28,"date":"28 August 2001","review":"An interesting and rather dark war story that takes place aboard a German merchant vessel during WWII. The black and white filming adds to the generally drab and realistic ambiance of the ocean crossing. Marlon Brando's expatriate is trapped into a scheme of espionage/sabotage, and his grim, softly sneering coolness gives the character of Robert Crain an added dimension. Yul Brynner plays the captain of the ship, out of favor with the Nazi party and under surveillance, yet still \"pragmatically patriotic\" to the Fatherland. Brynner is an oft-underrated actor because of the larger-than-life roles he played, but this film better showcases the subtlety he was capable of, and at times his performance excels. This is a complex and tense war movie that views both sides through a curtain of ugliness, yet captures moments of honor and loyalty and even kindness, a facet that other war movies in this genre often lack. The realism of the shipboard action is crucial--you could get a flutter of seasickness just watching--and all of the characters show depth and detail. No spoilers here; try to find this flick at the video store and watch it a couple of times. It's worth the search.","user":"sam66","rank":[33,36]}]