[{"title":"You will lose your mind, and possibly your lunch...","rating":20,"date":"20 March 2001","review":"Some say the Wizard of Gore is one of HG Lewis' weaker flicks, but I must disagree. Blood Feast may have been more ground-breaking and unintentionally hilarious, but W.O.G. stands up fine against that movie and any of his other gore films. There is a certain cheesy charm to Lewis movies, no matter if they are skin flicks, gore flicks, or even kiddie flicks. In this movie, the wonderfully hammy Ray Sager plays the Wizard and his main occupation seems to be delivering quasi-fascistic prattle to audiences with mutton chop sideburns, interspersed with running his fingers through the tomato-sauce covered animal organs that erupt from his victims, all to the audience's delight. There is some weak storyline involving an independent woman reporter and her well-tanned boyfriend, who try to solve the mystery of the Wizard, the fools. However, this is pretty much just window dressing for the 5-6 gory scenes of the Wizard doing his thing. In particular, there is an eyeball poking and manipulating scene that would have done Lucio Fulci proud. And please don't forget the awesome furniture and late 60's bourgeois home furnishings and polyester pantsuits that make all of these late 60's films look like \"Barbarella\" by todays standards. If anything, you have to love the fact that there was actually a time in this country where you could make a movie like this and it would be distributed. Thinking about the time period when Lewis was doing his thing and the way he was doing it is enough to blow your mind even more than his movies. If you haven't checked them out, you are doing yourself a disservice!","user":"jtk57","rank":[18,25]},{"title":"HEADS off to see the wizard...the nauseating Wizard of Gore!","rating":7,"date":"20 April 2006","review":"Another sensationally over-the-top splatter party directed by everyone's favorite horror lunatic; THE Hershell Gordon Lewis! \"The Wizard of Gore\" might not be his 'best' film, but it's definitely a fun experience and actually one of Lewis' most ambitiously plotted films, since he toys with subjects like hypnotism and optical illusions. None of the magical tricks are properly explained, as Lewis' sneakily avoids that in the dumb finale, but at least he tried to do something extra and ingenious with this film. Ray Sager, some sort of crossover between Vincent Price and porn actor Harry Reems, plays Montag The Magnificent; a self-acclaimed illusionist genius who butchers girls from the audience live on stage but has them return to their seats again in one piece. A young reporter, who's always dragged along by his girlfriend to see Montag's shows, discovers that the girls turn up dead after all and their corpses are damaged exactly like they appeared to be on stage. It's rather curious how you never grow tired of the way Lewis displays the gore in his movies! The sequences here in which female bodies are disemboweled, impaled or even crushed with an industrial punch press are overlong, monotonous and completely implausible, yet you stare at the screen with a gigantic smile on your face. Of course, these are the only significant scenes in \"The Wizard of Gore\" as the rest of the film hangs together by lousy acting, embarrassing dialogues and a shortage of decors. By the year 1970 and after having unleashed a handful of similar horror movies already, Lewis still couldn't care less about building up tension or continuity and went straight for exploitative grossness. The least you can say is that his work is an acquired taste, but he shall be forever worshiped by drive-in fanatics and other sick puppies, like myself. Amen, Mr. Lewis","user":"Coventry","rank":[19,27]},{"title":"A really strange and disturbing masterpiece of hilarious nonsense","rating":7,"date":"1 February 2005","review":"Though this is one of my all time favorite movies, I would still have to give it 7 out of ten because it has too many flaws for me to rate it as a perfect film. For one, the plot does meander and great deal. Also, the characters for the most part are pointless and annoying. Still, this does not matter in the world of Herschell Gordon Lewis. This is easily one of the stupidest, most unbelievable, disturbing and hilarious movies that I have ever seen in my entire life. You'll find yourself laughing out loud as you vomit at the sight of people having swords shoved down their throats, being done in with punch presses, being chainsawed in half and every other disgusting thing you can possibly imagine. Only in the world of cinema can things this ridiculous happen. That's what I love about movies, they take you into a different world, and this movie does just that. Aside from the gore, what really makes this movie stand out is it's evil villain 'MONTAG THE MAGNIFICENT'. After watching this movie, my friend Jason and I decided to start worshipping him and revelling in his badassness. Also, what totally rules about this movie is just how terrible the acting is. Ray Sager is actually the worst actor of all time. It made me laugh the entire time I watched it, yet at the same time his presence has an unnatural creepiness to it. The ending has to be seen to be believed.<br><br>Truly a unique horror film that should be seen by fans of bad cinema or just anyone who wants to be totally grossed out and given nightmares.<br><br>(My personal rating is 10/10)","user":"dataclast","rank":[15,21]}]