[{"title":"Classic Japanese monster film","rating":7,"date":"9 January 2002","review":"The Two pilots Kobayashi and Tsukioka must land on a remote Pacific Island and become witnesses of the fight between two giant monsters. After the battle, they both disappear into the ocean. Tsukioka informs scientists (including Dr. Yamane from the first \"Godzilla\" film) and the army about Godzilla and an unknown monster that looks like a prehistoric Ankylosaurus. The new monster therefor is named Angilas. Meanwhile, some bandits escape near Osaka and cause a car crash that is followed by large explosions. The fire attracts Godzilla to Osaka. The Japanese army tries to stop the monster using tanks, missiles and the air force. Then Angilas shows up too! The two monsters fight each other in the middle of the city in a brutal battle which is won by Godzilla. In order to stop him, the Osaka Defense Corps (and the two friends Kobayashi and Tsukioka) follow Godzilla to a snowy island near Hokkaido in northern Japan. Many pilots die in the final battle against the monster, as the army tries to cause an avalanche to bury Godzilla...<br><br>This is the little-known second film of the legendary Japanese Godzilla series, and the last that was filmed in black &amp; white. It lacks, of course, most of the metaphoric meaning the first film had and is just a very entertaining, classic monster movie. The beautiful music score was composed by Masaru Satô, the favourite composer of Akira Kurosawa. It sounds a bit like a softer version of Akira Ifukube's great theme music for the first film. Like in the first \"Godzilla\", the black &amp; white photography adds to the plausibility of the special effects, therefor they work really good most of the time. Probably the biggest problem with the effects is that the monsters move by far too fast in their fight scenes. But fortunately \"Gojira no gyakushû\" was the only Japanese monster movie ever to use this technique. Please note that this commentary is based on the original, uncut Japanese version of the film which really is the ONLY way to see it!! The American version is badly dubbed, has half of the movie cut out, inserts new scenes that don't make ANY sense, and has special effects footage stolen from other movies... it's just total crap. Everybody who is interested in seeing this film should look for the Japanese version, it's definitely worth the effort. Unfortunately, it is probably very hard to find. Despite the success of the film in Japan, the next \"Godzilla\" movie was not made for seven years.","user":"Splatterdome-AMH","rank":[20,20]},{"title":"Forget the American Version, the Japanese one is so much better","rating":7,"date":"18 August 2007","review":"Picked up the remastered version recently released. It has the Japanese and American versions of the film. I watched the longer Japanese version which is oh so much better. Gone is the stupid narration. The voices actually match the characters and don't come off dopey. There are also scenes with silences, something the American version seemed afraid to have. I used to think this was a dull and boring film, but it actually held my attention this time out, even when my brother was kibitzing to get me to go shopping with him. If you like these sort of movies and get the chance watch this in Japanese and see it for the first time. (FYI- the new remasters do not allow toggling between versions because the Japanese versions are usually longer, even by a minute or two than the Americans so you can only see the differences by watching the versions back to back.)","user":"dbborroughs","rank":[19,20]},{"title":"the English language version is a catastrophe, but the original uncut Japanese print has something more","rating":7,"date":"9 July 2007","review":"Perhaps the real reason why \"Godzilla Raids Again\" is not as popular as the first film of the series is because most people are more familiar with the butchered and dubbed English version titled \"Gigantis the Fire Monster\". However, when you look at that disaster of a film and compare it to Toho's original Japanese version, with no dubbing, no narration, no music or sound effect changes, you have one of the best 1950s monster movies. \"Godzilla Raids Again\", or \"Godzilla's Counterattack\" as its original title literally translates, is a flawed film. But like the first Godzilla, it's an allegorical classic. It symbolizes a different kind of horror that wasn't expressed in the first film.<br><br>The original 1954 classic \"Godzilla\" symbolized the horrors of nuclear war and the way that it can ultimately change the lives of people forever. \"Godzilla Raids Again\" focuses on a different perspective. It symbolizes the struggles of people still trying to adapt to life after a war and recover and try to resume their normal lives again. Godzilla and his very first opponent, Anguirus, are like weapons of war. They strike, cause enormous damage, leave ruins, and the people have to rebuild and try to get back on line again, until the weapons of war come back to attack them again. And the people still live in fear of the atomic bombs and other nuclear weapons, for they have brought back more horrors from the past and continue to bring them upon the world. While \"Godzilla Raids Again\" is nowhere near as powerful and allegorical as the first film, it is still one of my favorite Godzilla films. But once again, only in its uncut and undubbed print.<br><br>The English language version of the film is just another example of why you should never tamper with somebody else's film. It is an example among other Godzilla films and also Sergio Leone's \"Once Upon a Time in the West\", in which the American distributors cut the film down until it wasn't as compelling. When \"Godzilla Raids Again\" was distributed, they tore the film apart and changed it all. The most horrendous dubbing of any Godzilla film was put in, there was a lot of narration that ruined the original feeling of the film's atmosphere. But what was worst of all, they changed the monsters themselves. Godzilla's name was changed to Gigantis, his dark, chilling roar was changed to Anguirus' roar most of the time. A lot of the great sound effects of the monsters as they fought in Osaka were replaced, as was Masaru Sato's original music score. It was replaced with stock B-music and for what reason, I do not know why. A lot of other sound effects were changed as well. In the original print, Godzilla's death ray creates a loud, destructive kind of sound. But in the dubbed version, for reasons unknown, it was replaced with a wispy sound effect, like a leak in a hose.<br><br>Ignoring the existence of \"Gigantis the Fire Monster\", the special effects used in \"Godzilla Raids Again\" are very fine for the age. Unfortunately, they weren't as good as the Japanese Academy Award-winning effects presented in the first Godzilla film. At times, Godzilla's head and neck seemed too slender and the hand-operated puppet used in the close ups is just plain not good-looking. However, the suits used for Godzilla and Anguirus in their epic, realistic battle in Osaka looked fantastic! And what I loved most about this battle, is that it was a traditional, physical fight. The monsters bite, claw, and slam each other like real animals. Unlike in the future, when the monsters would mostly just bump into each other and fight with \"beam wars\". Godzilla's death ray is more like a last resort kind of weapon, something he uses when he's got a sense of victory, and spends the rest of his time biting and clawing at Anguirus, who performs the same actions. And unlike in the English version, the monsters don't continuously roar at each other, they mostly growl and snarl when fighting and roar once they have a brief stand-off every now and again.<br><br>But still, \"Godzilla Raids Again\", while it's an amazing monster film, has its flaws. Mostly, it's the fact that the monsters of the film do not have a whole lot to do with the story. In fact, Anguirus screen time ends after the first third of the movie is over. Maybe, he could have been used a bit longer for a more effective first appearance into the series. Godzilla himself, while the main plot point of the story, doesn't get as much screen time and scenes as he should get. The storyline just strays from him after the battle for too long and he doesn't really get anything else until the ending of the film.<br><br>But that doesn't mean a whole lot. Yes, \"Godzilla Raids Again\" is not the most action-packed Godzilla film there is. But it is, in its original version, one of the best monster movies there is. It presents a great symbolic message and should be examined by everybody for this reason. It is a dark compelling film, not as great as the first Godzilla film, but definitely one of the best.","user":"TheUnknown837-1","rank":[15,16]}]