[{"title":"Scary when I was 10; scary now!","rating":9,"date":"29 September 2002","review":"Few people remember that Jack Palance--better known as a rough Western character and elderly machismo cologne huckster--played Dracula. For any 10-11-year-olds in 1973, who saw this TV movie, however, his performance will never be forgotten!<br><br>I got a chance to see this version of the classic tale as adult a few years ago and found that it is still a fine film. Palance brings something unique to the vampire role. Somewhere between Max Schreck's hideous rat-like Count Orlok and the debonair Lugosi/Lee/Langela Dracula, Palance may well exude some sort of animal magnetism to women, but is still a hideous fanged beast on the prowl. The scene of him trying to get into the locked hotel room of the two women still gives me shivers. Few Draculas ever barred their fangs and hissed as Palance did--although this has seemed to be a popular move for female vampires.<br><br>Jack Palance will never be the first or second (or third) name associated with film vampires. For those who saw him in the role, though, it is hard to ever forget his Dracula. Watch it if you get the chance!","user":"mlevans","rank":[30,32]},{"title":"Great Adaptation of Bram Stocker's Novel","rating":8,"date":"28 July 2005","review":"I am a great fan of vampire movies, and was really surprised how good this classic version of Bram Stocker's novel is. I am not fan of Jack Palance, but he is amazing in the role of Dracula, maybe better than Christopher Lee or Bela Lugosi. He looks like a kind of \"human animal\", while Christopher Lee is a sort of gentleman vampire. Good direction, great performances of the cast, excellent locations and very few special effects make this film a worthwhile vampire movie. I noted a great flaw in the shooting, almost in the end of the story, when Jonathan Harker is thrown in a hole in the count's property in Transilvania: Arthur and Dr. Van Helsing are alone in the place and when they approach to see Jonathan's body, a third person can be seen in the back of Van Helsing. However, this mistake is irrelevant and does not decrease my rating of this movie. In the DVD released in Brazil, there are some problems with the colors along the first third of the film, with the black turning into green. My vote is eight.<br><br>Title (Brazil): \"Drácula  O Demônio das Trevas\" (\"Dracula  The Demon of the Shadows\")","user":"claudio_carvalho","rank":[23,26]},{"title":"Jack Palance excels in a respectable made-for-TV version of Bram Stoker's classic novel","rating":8,"date":"28 March 2010","review":"Jack Palance brings a brooding intensity and snarling animal ferocity to the role of Dracula that totally works; Palance's fierce and intimidating vampire is both quite forceful and genuinely frightening (the scenes with Dracula using his superhuman strength against fragile mortals are especially potent and unsettling). Director Dan Curtis, working from an intelligent and absorbing script by Richard Matheson, relates the involving story at a steady pace, vividly evokes the flavorsome 19th century Victorian period setting, and stages the exciting climax with real flair. Moreover, the tip-top cast all contribute fine performances: Nigel Davenport makes for a restrained, believable, and authoritative Van Helsing, the ravishing Fiona Lewis impresses as the frail, doomed Lucy (in a surprisingly moving and inspired touch, she's the reincarnation of Dracula's past lover), plus there are sound turns by Simon Ward as the concerned Arthur, Penelope Horner as the sweet, vulnerable Mina, and Murray Brown as the likable, ill-fated Jonathan Harker. Virginia Wetherell, Barbara Lindley, and Sarah Douglas are pretty sexy and scary as Dracula's deadly, yet delectable vampire brides. Oswald Morris' lush cinematography boasts several graceful fades and a few nifty tilted camera angles. Bob Cobert's spirited shuddery score hits the spine-tingling spot. While not exactly a definitive adaptation of Stoker's book (the gloriously unhinged Renfield alas is nowhere to be seen), but still worth watching all the same.","user":"Woodyanders","rank":[7,7]}]