[{"title":"A Hitchcockian Billy Wilder","rating":10,"date":"30 December 2007","review":"At the end of the day the films you give top marks are those films that become constant companions. You can see them again at the drop of a hat, you show them to people who have never see them and it's always a triumph. \"Witness For The Prosecution\" is one of those wonders. Suspend your disbelief for a couple of hours and enjoy this banquet of a romp. Charles Laughton showed here what he was made of better, more clearly and more loudly than in any other film and all of his films, at least the moments with him in it, are unforgettable - Captain Blight or Henry VIII, Quasimodo or that malefic Senator from South Carolina. Here the severity of his lawyer by vocation takes your senses away with his masterful judicial way to see logic and it's such an incredible fun to watch him do it. Tyrone Power is a toy in his hands but not Marlene Dietrich who stands her ground, not merely as a character but as a presence on the screen. Billy Wilder visits early Hitchcock territory with wit and fun. Elsa Lanchester's nurse is the cherry on top of this delightful film.","user":"littlemartinarocena","rank":[112,123]},{"title":"Love That Laughton","rating":8,"date":"29 August 2004","review":"Charlie Chaplin was funny. Charles Laughton was witty. As good as 'Witness For The Prosecution' is---Agatha Christie's story, the other actors, the technical expertise---the Oscar-nominated Laughton is THE reason to see this film. What he brings to Billy Wilder's 1957 courtroom thriller is his tremendous wit and intellect. It's a serious story, but the dark-comic tag team of Wilder/Laughton upgraded the film from \"a good courtroom mystery\" to \"a classic of the courtroom genre\".<br><br>The headlining star, Tyrone Power, sure doesn't help them very much. He plays anguish about as smoothly as ripped sandpaper...and anguish is the unfortunate emotion he's got to play for most of the picture. Power has been accused of murdering a wealthy older woman. His wife (Marlene Dietrich) seems to be doing all she can to sell him out, appearing as...drum roll, please, drummer man...the star witness for the prosecution. Laughton is the brilliant (and ailing) English barrister defending Power. The plot twists 'n' turns a dozen ways from Sunday, just as it always does in Christie's best work.<br><br>Amongst all the talk of bloody murder, there are running gags about cigars and alcohol. More dark wit---Laughton's character's poor health might cause him to drop dead at any moment. Wilder weaved thrills and smiles as well as any director. In this, he was wise to anchor the supporting cast with mainstays of the stiff upper lip. John Williams and Ian Wolfe (Hirsch from \"WKRP\"), not to mention Laughton's control-freak assistant Elsa Lanchester (who was also CL's real-life wife), are bloody good.<br><br>Movies of this type have been ripped off so often that students of the \"don't give away the ending\" class are bound to figure it out. I did. That hardly mattered because there were STILL more surprises to come. Through all that plot, Dietrich winds up being the most fascinating character. Project back and you'll realize how well her performance works. But she &amp; Power are merely the star attractions in 'Witness For The Prosecution'. The main dish is Charles Laughton. Considering how ironic and cynical our society has become, it's stunning that brilliant old pros like Wilder and Laughton aren't more popular today. After this movie, they've become personal heroes of mine.","user":"flickershows","rank":[150,174]},{"title":"Another triumph for cinematic genius Billy Wilder!","rating":8,"date":"3 February 2005","review":"Billy Wilder is a director with an understanding of cinema that is almost unmatched throughout the medium's entire history - that's why his films are always so good. Witness for the Prosecution is yet another highlight in the great director's history, and it proves that courtroom dramas can be both riveting and a great opportunity for some first rate comedy. Wilder's film features one of the most well paced plots I've ever seen in a film, and it's a plot that includes some very finely tuned twists. Towards the end, Wilder bombards us with twist after twist, each one both making sense and topping the one before it. In a time when people are impressed by films such as 'The Sixth Sense', Billy Wilder still shows us how to skilfully attribute a twist into a film's plot. The plot itself follows the story of Sir Wilfrid Robarts; an ace defence lawyer that has been told that his health won't allow him to tackle anything more than mundane cases, but is brought back into the fray when a case involving the murder of an elderly woman comes into his hands. Wilfrid must now juggle the case and his health as he attempts to keep the young man from being sent down.<br><br>Like all Wilder films, this one is a very pleasurable viewing. Wilder manages to find a middle ground between substance and entertainment, and so this is a film that will please fans of both aspects. The film is deliriously entertaining throughout, with some truly great lines of dialogue (most of which is very quotable) and every twist adds a new level to the story. The substance comes from a multitude of angles, and themes of love, health, sacrifice and most notably, justice, are all more than prevalent. The acting is certainly of note in Witness for the Prosecution. Charles Laughton is absolutely sublime as the undermining and stubborn Wilfrid Robarts; his performance is very strong, and makes up the backbone of the film. The main supporting performance comes from Marlene Dietrich. I'm not a big fan of hers; despite having a great pair of legs, she just doesn't do anything for me, but in this film she brings sufficient coldness to her character and really makes it her own. The final main performance comes from Tyrone Power; he isn't as great as the other two, but does enough with his character to ensure he's believable. Highly recommended viewing!","user":"The_Void","rank":[86,99]}]