[{"title":"A Film Noir Masterwork - Breathtaking to the Eye and the Ear","rating":10,"date":"29 August 2005","review":"\"Elevator to the Gallows (Ascenseur pour l'échafaud)\" is a master work, so it's startling to learn that it was Louis Malle's first feature. It's a mother lode textbook of how-to for noir genre filmmakers as he creates his own style from what he's learned from other masters.<br><br>Malle pays tribute to the tense murder style of Hitchcock with Billy Wilder's cynicism of selfishness a la \"Double Indemnity\" plus Graham Greene-like, post-war politics from \"The Third Man\"-- and arms and oil dealers with military pasts in the Middle East are not outdated let alone adulterous lovers and rebellious teenagers. <br><br>The film drips with sex and violence without actually showing either -- sensuous Jeanne Moreau walking through a long, rainy Paris night is enough to incite both. <br><br>The black and white cinematography by Henri Decaë is breathtakingly beautiful in this newly struck 35 mm print, from smokey cafés with ever watchful eyes like ours to the titular, ironic alibi's long shafts (which surely must have inspired a key, far paler scene in \"Speed\") to highway lights, to a spare interrogation box, but particularly in the street scenes. The coincidences and clues are built up, step by step, visually, including the final damning evidence. <br><br>Miles Davis's improvisations gloriously and agitatedly burst forth as if pouring from the cafés and radios, but the bulk of the film is startlingly silent, except for ambient sounds like rain that adds to the tension in the plot.<br><br>The characters are archetypes -- the steely ex-Legonnaire, the James Dean and Natalie Wood imitators, the preening prosecutor -- that fit together in a marvelous puzzle. But all are cool besides Moreau's fire, as she dominates the look of the film, just wandering around Paris. <br><br>There is some dialog that doesn't quite make sense at the end, but, heck, neither does \"The Big Sleep\" and this is at least in that league, if not higher in the pantheon.","user":"noralee","rank":[85,100]},{"title":"The black cat has it...","rating":9,"date":"1 March 2014","review":"Ascenseur pour l'échafaud (AKA: Elevator to the Gallows/Lift to the Scaffold) is directed by Louis Malle and co-written by Malle, Roger Nimier and Noël Calef (novel). It stars Jeanne Moreau, Maurice Ronet, Georges Poujouly, Yori Bertin and Jean Wall. Music is by Miles Davis and cinematography by Henri Decaë. <br><br>A little ole devil this one, a sly slow pacer that itches away at your skin. Rightly seen as a bridging movie between the classic film noir cycle and the nouvelle vague, Malle's movie is in truth straightforward on narrative terms. Julien Tavernier (Ronet) is going to kill husband of his lover, Florence Carala (Moreau), who also happens to be his boss, but upon executing the perfect murder, he, through his own absent mindedness, winds up stuck in a lift close to the crime scene. Outside Florence is frantically awaiting his arrival so as to begin their life together in earnest, but when a couple of young lovers steal Julien's car, Florence gets the wrong end of the stick and a sequence of events lead to Julien and Florence hitching that ride to the gallows. <br><br>Simplicity of narrative be damned, Malle's movie is a classic case of that mattering not one jot. There is style to burn here, with bleak atmospherics dripping from every frame, and Miles Davis' sultry jazz music hovers over proceedings like a sleazy grim reaper. The ironic twists in the writing come straight off the bus to noirville, putting stings in the tale, the smart reverse of the norm finding Moreau (sensual) wandering the streets looking for her male lover, while elsewhere he's in isolation and a doppleganger murder scenario is cunningly being played out. Decaë's photography has a moody desperation about it that so fits the story, the use of natural light making fellow French film makers sit up and take notice. While the dialogue, and the caustic aside to arms dealings, ensures we know that Malle can be a sly old fox. He really should have done more noir like pictures. <br><br>A film that convinces us that Julien and Florence are deeply in love and passionate about each other, and yet they never are once together in the whole movie! It's just one of the many wonderful things about Louis Malle's excellent picture. <br><br>Remember folks, the camera never lies... 9/10","user":"hitchcockthelegend","rank":[44,50]},{"title":"This film should be widely available on DVD","rating":10,"date":"3 June 2004","review":"This film is a master piece. Miles Davis's music is superb. It is an object lesson on the art of combining sound and vision. The tension and the brooding Parisian atmosphere are heightened with cool and poignant playing. It is surprising (to the best of my knowledge) that this is the only complete original film score he produced. <br><br>The story of the crime is clever. It has reasonable human motivation and plot, and is steadily revealed. But, it is the study of 'being in the wrong place at the wrong time' that makes this film a classic. The series of chance events that will dramatically effect the characters' lives, give this film a similar feel to 'Run Lola Run' or 'Irreversible', dispute this film's linear structure and age. The dark cinematography is excellent.<br><br>I have only had an opportunity to see it once (I only just caught it because BBC4 listed it under its English title), but I would like to see it again.<br><br>The soundtrack is widely available, but I can not find the film on DVD or PAL VHS. This film should be available to a wider audience, for me, preferably in French with English subtitles.<br><br>P.S. This wonderful film is now available on DVD as part of the Louis Malle Collection: Volume 1. (Updated 11/10/2006.)","user":"jbinfo","rank":[71,86]}]