[{"title":"Chilling Atmospheric Espionage Thriller","rating":1,"date":"1 November 2004","review":"Clint Eastwood plays Michael Gant, a burnt out veteran sent into the Soviet Union on a desperate mission to steal the greatest warplane ever built.<br><br>Minimal training, mental problems, murderous allies, constant danger. His only qualification - he speaks Russian, he knows how to fly and he fits the flight suit. <br><br>What I like most about Firefox is how it really puts you in Clint Eastwood's shoes. His character Gant is no super spy - he's a war veteran suffering severe mental problems as a result of his POW experiences. At every twist and turn of the plot the movie captures his tension and fear. His inexperience and mistakes endanger him repeatedly. His only protection - a thin, unravelling web of deception and a fickle KGB desire to observe a little before pouncing.<br><br>A must see for fans of atmospheric espionage films and Clint Eastwood.","user":"eworrall","rank":[81,95]},{"title":"Something different for Eastwood","rating":7,"date":"4 September 2006","review":"Firefox isn't your usual Eastwood film, he's almost branching out into Star Wars territory here with this Sci-Fi heavy Cold War Spy thriller. The effects like every 80's film have dated badly but for a movie made in 1982 they are rather good. Eastwood directs himself in what is a pretty average performance by his own high standards. The majority of the cast is made up by British character actors. Warren Clarke is really good but Freddie Jones and Nigel Hawthorne are pretty hammy. Also Raiders of the Lost Ark fans can spot Ronald Lacey playing Semelovsky a Jewish scientist. The first half of the film is a spy thriller and can be pretty nail biting at times as Clint gets his papers checked at regular intervals. Also he's suffering from the same post Vietnam War disorder that John Rambo had in First Blood and that really adds to the tension. The second half is more like Star Wars and is really great stuff. So better ice up at a cold one and enjoy Firefox for what it is, Cold War entertainment at it's best.","user":"LuboLarsson","rank":[44,50]},{"title":"Clint flies a really cool plane","rating":7,"date":"15 February 2006","review":"During the height of the Cold War, the Soviet military develops a super high-tech fighter aircraft - it flies fast, has deadly weapons, and has technology that allows the pilot to control guided missiles with his mind. Basically any army with this baby in its arsenal will have air superiority. Clint is assigned to steal it from the heart of Soviet territory for the USA.<br><br>The plot is fairly generic and in this day and age most Cold War thrillers have seem to have lost much of their edge, but this is nonetheless an entertaining film from Eastwood. It is not one of his best and not one that he will be remembered for, but no one can deny the slickness of the plane of the title. The final section of the film, which admittedly does take a while to get to, has Clint flying around and raising hell is a fun ride and on par with the final chase in \"Where Eagles Dare\" in terms of entertainment. However, the buildup has enough suspense to make the whole movie worth a watch. 7/10<br><br>Rated PG: violence","user":"BroadswordCallinDannyBoy","rank":[19,25]}]