[{"title":"Bizarre, Bad, Badly Bizarre, Bizarrely Fascinating!","rating":25,"date":"25 October 2004","review":"Stuart Rosenberg's \"The Amityville Horror\" should have catapulted him to the throne of the King of the Surreal, because this disjointed, shrill, and inexplicable flick is just as weird, if not weirder than, the oddest work of current King David Lynch. I'm not sure what the hell was going on in Rosenberg's life at the time, but this same year he directed another weird, cartoonish-yet-lethargic genre film, the Charles Bronson revenge vehicle, \"Love and Bullets.\" Also both \"Horror\" and \"Bullets\" share totally inappropriate and WAY over the top performances by the great &amp; unique Rod Steiger. <br><br>VERY MINOR POSSIBLE SPOILERS AHEAD(if such is possible with a movie that makes no sense)<br><br>Nothing much happens in \"Amityville Horror\" until the climax, just a lot of odd little things. But when that climax comes, and the movie suddenly ends, you realize that it answered no questions and, more importantly, made no sense at all! The film has no logic but dream logic--perfect surrealism. Characters float about aimlessly in search of some kind of coherent story, crying, screaming, chopping wood. The secondary characters appear and disappear without having any impact on the plot and without really doing anything, much the way characters in a dream come and go, shift and change for no reason. A psychic has visions--nothing comes of it. A cop has suspicions--he does nothing with them. a child has an imaginary ghost friend who may be at the root of it all--or not. A priest's life is ruined--because there were flies on the window! And--there's an evil pig in the window! I'll repeat myself--There's AN EVIL PIG IN THE WINDOW!! An EVIL PIG THAT DOES NOTHING! Really, the film is fascinating--all the more so since it is obvious that its fascinating qualities are entirely unintentional. A CLASSIC!","user":"curtis-8","rank":[36,43]},{"title":"S10 Reviews: The Amityville Horror (1979)","rating":18,"date":"18 April 2005","review":"George and Kathy Lutz are looking for a place to anchor down and raise a family. The Lutz's and their children (Kathy's from a previous marriage) settle on an impossibly cheap, large and beautiful shore house. But 28 days later the macabre and scary happenings force them to leaveleaving all their earthly possession behind. During the course of those 28 days, the family goes through all kinds of hell a room full of flies, demonic voices and a pig with glowing red eyes. What kind of past does that house have that would make everything horribly wrong. Based on a true story.<br><br>Real or hoax, you decide but \"The Amityville Horror\" has all the trappings of an excellent haunted house story. Too bad that the filmmakers falter a bit with a lack of character development that also ends up stifling the actors in the film, that would have helped out immensely. A creepy music score (the one rejected for \"The Exorcist\") and several good set-pieces help out but the end of the second act kind of gets stale. A good supernatural thriller.","user":"suspiria10","rank":[49,61]},{"title":"Yeah, it has problems, but I still love it","rating":8,"date":"7 April 2005","review":"George (James Brolin) and Kathleen Lutz (Margot Kidder) buy a \"dream house\" in Amityville, New York for a \"dream price\". Unfortunately, the price was low because just a year before, the house was the location of the Ronald DeFeo Jr. murders--he killed his entire family while they were sleeping. As a priest, Father Delaney (Rod Steiger), blesses the home, he realizes with horror that something evil is lingering there. The dream house is turning into a nightmare.<br><br>Sometimes our affection for or aversion to an artwork that we've been exposed to a number of times over the years is inextricably enmeshed with our historical, emotional experiences, whether we admit this or not. For example, I strongly dislike soap operas, or indeed any dramas that resemble soap operas. This is probably due to the fact that for years my only exposure to soap operas was when I was home sick from school as a kid. These were the days before cable television and home video. In the middle of a weekday afternoon, you either watched soap operas or you didn't watch television. Subconsciously, I associate soap operas with a feeling of illness.<br><br>Likewise, Jay Anson's Amityville Horror novel appeared when I was still a teen. I loved it. I can still remember reading it in one long sitting--something I rarely did--in the family car as we drove from Florida to Ohio to visit relatives. I was excited when the film appeared, and liked it a lot at the time.<br><br>So although I can see many faults with Amityville Horror now, I still have a deep affection for it that triggers my brain to go into an apologetic mode and defend the film. I just can't bring myself to give it lower than an 8 out of 10, and even that seems low to me. But I can easily see how audiences lacking a history with the film might dislike it. It is relatively slow, uneventful and meandering--with a modern perspective, the pacing and \"subtlety\" are reminiscent of some recent Asian horror. At the same time, maybe paradoxically, scenery chewing has only rarely had a greater ally.<br><br>Just a couple days ago MGM released newly remastered widescreen versions of Amityville 1, 2 and 3. I haven't seen the film look this good since seeing it in the theater in 1979, and it probably didn't even look this good then. The first thing that struck me was how incredible much of the cinematography is. Director Stuart Rosenberg had an amazing knack for finding intriguing angles for shots and imbuing them with beautiful colors.<br><br>Unlike recent trends, Rosenberg's colors are not narrowed down to a single scheme. For example, in some shots, such as some of the interiors of the famed Amityville house, we get fabulous combinations of pale greens and yellows. In others, such as many exterior shots near the house, we get intense combinations of fall foliage colors. There are also a number of beautiful shots of the famed \"eye window\" exterior of the house in differently tinted \"negative\" colors.<br><br>Rosenberg evidences a great eye for placing his cast in the frame and shooting scenes to create depth and symbolism via objects that partially block or surround the frame. He also has a knack for creating winding, receding patterns of objects that enhance depth through perspective. My affection for this aspect of the film has little nostalgic attachment, as I didn't pay attention to such things as a kid (I didn't start noticing them more until I started painting, far into my adult years), and the positive aspects of the cinematography were hardly discernible on the previous, ridiculously bad pan &amp; scan VHS release.<br><br>Of course, most people aren't watching a film like this for the aesthetics of the visual composition. This is one of the most famous haunted house films, after all. The horror is handled somewhat awkwardly, occasionally absurdly, but it still works well enough for me, as understated as it is (I'm not referring to the acting, just the horror \"objects\"). Aspects such as the ubiquitous flies reminded me of similar motifs, such as water, in Hideo Nakata's horror films (such as Ringu, 1998 and Dark Water, 2002). The beginning of the film, showing the Defeo murders, still has a lot of shock value, despite its relative post-Tarantino tameness. Most of the horror elements are more portentous, but they're regular and interesting enough to hold your attention, as long as you don't mind subtlety.<br><br>Subtlety, however, was the furthest thing from the cast's minds. Brolin, Kidder and especially Steiger shout their lines more often than they speak them. \"Overacting\" is not in their vocabularies. Kidder comments on an accompanying documentary that the horror genre walks a fine line between intensity and camp. That may or may not be true in general, but in Amityville Horror, camp is frequently broached. For me, it has a certain charm. I'm a fan of camp and \"so bad it's good\"; Amityville's performances often attain both.<br><br>The commentary on the new DVD is amusing given the 1970s publicity that the book and film depicted a true haunting and the subsequent, thorough debunking by persons such as Stephen Kaplan. Hans Holzer, a parapsychologist who has been involved with the story since the early days, and the author of a book upon which Amityville II was based, provides the commentary. He presents himself as an academic, but he obviously seems to have little concern for \"objectivity\" or skepticism. He not only still talks about the story as true, he invents supernatural excuses for the DeFeo murders and then some, barely mentioning detractors such as Kaplan.<br><br>If you haven't seen the film yet, you should base your viewing decision on whether you have a taste for deliberately paced horror as well as a tolerance for extremely over-the-top performances. The film is historically important in the genre, as well.","user":"BrandtSponseller","rank":[84,109]}]