[{"title":"Recipe for Revenge.","rating":10,"date":"5 November 2005","review":"Peter Greenaway brought to the screen this visually striking tale of revenge centered on its four characters and in its 124 minutes he pulls out all the stops to make sure he not only dances over the edge of the cliff, but jumps right over and shows us the belly of the beast.<br><br>At a symbolic level, this may very well be the \"thinly veiled parable against Thatcherism\" that many critics have pointed at, and it's not hard to see. Taking place at a restaurant in which Albert and Georgina Spica (expertly played by Michael Gambon and Helen Mirren) dine day in, day out, always accompanied by Spica's entourage of yes-men (among them a young Tim Roth), Albert indulges in the excesses of food and berates everyone around him, including his mutely suffering wife.<br><br>The first scene -- as a matter of fact -- establishes the entire mood of the film. Albert Spica is seen outrageously humiliating a naked man outside the restaurant as the overwhelming stench of decay and the presence of wild dogs linger on. Employees from the restaurant shortly come and hose the man from the excrement he has been slathered in. What it is saying is, we are entering a world of moral and spiritual decay in which Those In Power abuse their positions to the extreme, as the observers only stand by and go on with their business.<br><br>These bystanders are the people who work at the restaurant. Among them is the Cook, played by Richard Bohringer, who faithfully serves Spica and his yes-men meal after meal and makes no opinion as they loudly banter about the difference between this dish and that dish -- essentially saying nothing worthwhile --, while all the time Georgina silently eats on, almost like a non-entity. That is, until she notices a quiet, intellectual-looking man, reading a book. This man is Michael, the Lover, played by Alan Howard, a man who does not talk but oozes intelligence. And it's this element which attracts Georgina's eye... and then more.<br><br>It's clear where Peter Greenaway is going to take us, the viewer. The scenes involving the urgent, dangerous lovemaking between Michael and Georgina are unspeakably intense, even in later scenes when they meet in the kitchen among the ever-present cooks and are getting more comfortable with themselves. Greenway's Spica becomes so completely menacing his presence overflows the screen. He commits acts of intolerable cruelty against anyone who stands in his way -- he is the Terror during the French Revolution, the Dictator from every country who has had one who will torture those who give of even a slight resistance. And once Georgina's and Michael's clandestine affair is brought to light, needless to say, all hell breaks loose and Greenway sets the stage for his horrific, stomach-turning denouement.<br><br>In Georgina, Helen Mirren has created a character that is deeply suffering, infinitely patient... and that makes her the more dangerous. That she has to go through so much pain and humiliation to make a 180 degree turn to cold, ruthless avenger makes her the ultimate heroine. Her foil to Albert -- an essentially one-note role -- also serves his undoing. Alan Howard communicates so much as well in his almost silent role, and in a revelatory note, I'll say this: their nude scene is one that is rife in sensuality and proves that one doesn't need Hollywood hard-bodies to make an erotic scene work.<br><br>THE COOK, THE THIEF, HIS WIFE AND HER LOVER is not a movie for all tastes -- pun intended. However, it's one of the most avant-garde, intelligent stories that demands to be seen numerous times. I admire the lavish scenery Greenaway created for each area of the restaurant because it gives this extremely modern film a Renaissance feel and elevates its inherent symbolism. Grotesque but beautiful at the same time, it has a powerful cinematic language that has a style all its own.","user":"nycritic","rank":[102,121]},{"title":"Color changes everything!","rating":10,"date":"5 May 1999","review":"The \"inside story\" of this film is color. Most professional reviewers, with nation-wide media exposure, missed this underlying story element entirely, as did I, until half way through my first viewing. Once I realized the colors of the costumes changed, as the characters passed from room to room, I had to go back and see it again. That's how I got hooked.<br><br>During the next viewing, I took note of the creativity and effort that went into the design and construction of the costumes, several times, as each one had to be rendered in several colors. The next time through, I noticed how the color of each room related to the activity that normally took place there, even in the outdoor sequences. With the subsequent viewing, I concentrated on the soundtrack.<br><br>From that point on, my awareness of all these elements, served to enhance my appreciation of each character and his or her contribution to the story line. That's when the much talked about \"gross-out\" aspects of the film seemed to diminish in their ability to shock. In fact, by that point, they seemed to fit much more naturally, although the \"NC-17\" rating is absolutely appropriate.<br><br>This is a sumptuous feast for the eyes and ears of intelligent \"adult\" viewers. Not to be missed.","user":"Maurice_Rodney","rank":[103,129]},{"title":"The Divine Comedy","rating":10,"date":"22 March 2001","review":"Imagine the universe as a restaurant. The parking lot is the world. The kitchen is purgatory. The ladies's room is heaven. The dining room is hell. Hell is ruled over by Albert Spica, (Satan) excellently played by Michael Gobon. Dante is Michael (Alan Howard) a cataloger of French books. Beatrice, Dante's perfect woman, Georgina Spica (Helen Mirren) who is married to the devil.<br><br>In the beginning, the cook (God) in the real world is seen kicked and smeared and fed dog feces by Gabon. He is humiliated and in tears, but He endures and eventually helps to further the love between Howard and MIrren. Sex, in its pure form, is looked at as something sacred. Gabon lords over everyone in his realm with a tyrant's fist, caring nothing about anyone or anything. He wants two three things out of lifesuperiority to all other being, food and sex, while Mirren, as a reluctant Persephone, sneaks off to be with Howard. A couple of times Gabon even finds his way into the sanctity of heaven, but this is only short-lived.<br><br>The mood of the film is dark-black, heralded by brilliant reds or greens, and the tenor of an angelic child throughout. Every image is like a painting. Emotions creep in from all directions.<br><br>This is a film that would never, no matter what year it was produced, have won an Academy Award. It is too refined, to subtle, too sensual, too intelligent.<br><br>Watch it, rent it, buy it. It must be seen.","user":"Minerva_Meybridge","rank":[192,253]}]