[{"title":"Not Only a Great Sports Film, A Great Film Period","rating":13,"date":"13 April 2003","review":"I remember the first time I saw this film.  I had won tickets from a local radio station and I saw it at a private screening at the Academy of Motion Picture Arts and Sciences.  I remember as I was watching it that it was one of the greatest experiences I had in a movie in a long time.  This film is not only a great sports film, but it is one of the great all around films I have ever seen.  This film has it all from romance to comedy to witty dialogue.  Susan Sarandon, Kevin Costner and Tim Robbins all brought Ron Shelton's script to life and the three of them displayed some of the greatest chemistry ever captured on film.  This film is a timeless classic.","user":"Sargebri","rank":[41,50]},{"title":"A Comedy with much more to offer","rating":8,"date":"22 April 2005","review":"It is nice to see a movie that attracts more than one kind of audience. This is a comedy, then again a love story. This can be placed in the baseball genre as well as a coming of age drama. Most movies claim to be one or the other and sometimes fail to be. Then again, when a good movie hits a homerun it can not only become a money maker and a box office smash, it can also become timeless. Before they became giants of Hollywood, Kevin Costner, Susan Sarandon and Tim Robbins stars in this great movie as some of the most interesting, yet simple characters. Costner plays an aging baseball player who meets with rookie, soon to be great major league pitcher Tim Robbins. Out of the rafters comes Susan Surandon who, in her own may, is a Muse of the religion of baseball. Together, the three introduce three different worlds upon the audience. Each are believable characters even though they are in a way, fantasy like. A great story with a perfect ending, Bull Durham is one of those hard to find movies that is a crowd pleaser with just about every audience out there.","user":"caspian1978","rank":[31,39]},{"title":"The movie about the love of Baseball","rating":9,"date":"10 October 2001","review":"Crash Davis loves baseball more than it loves him. He believes in the game. He deserves to be in the show, but he isn't and never will be. But still he plays on, dutifully and to a certain extent, joyfully. Better to play crappy A-ball than sell shoes.<br><br>That for me is the central theme of this film. It is all summed up when Crash tells Nuke, the wild young star pitcher \"You don't respect yourself. That's your problem. You don't respect the game. That's my problem.\"<br><br>Take a player that passionate, and a youngster that annoying, add in a sexy yet maternal fan and you have great comedy. Bull Durham works scene after scene, because the film never forgets that baseball is what binds all the characters together.<br><br>Tim Robbins is nothing short of brilliant and Nuke Laloosh, the rising star youngster who walks 18 batters and strikes out 18 batters in his first minor league appearance - both league records. But Nuke is caught up in his fat contract, his Porsche, and his endless parade of women. Baseball is a sideline. Eventually, Crash's mentoring begins to pay off until he finally realizes that winning is \"like, you know, better than losing!\"<br><br>The love triangle between Annie (Susan Sarandon), Crash and Nuke is wonderful and funny, but it mainly provides us with set up for the baseball scenes, like when Sarandon convinces Nuke to wear women's underwear while he pitches. Or my favourite scene, when Annie and Crash take batting practise together, Annie dressed like she is ready for a wedding, but determined to correct Crash's swing. Crash is determined to take Annie home. They flirt and practice batting in one of the best prolonged foreplay scenes ever filmed.<br><br>The ending is satisfying but the real depth of this film is harmony that the game brings to the characters. **** out of ****.","user":"DanB-4","rank":[27,37]}]