[{"title":"Sweeping Fifties Epic.","rating":8,"date":"18 November 2013","review":"United Artists THE VIKINGS (1958) is one of the great epics of the fifties. Based on the book \"The Vikings\" by Edison Marshall it was produced by Jerry Brasler for Bryna Productions (Kirk Douglas' own company which he named after his mother).Beautifully photographed in Technirama and Technicolor by ace British cinematographer Jack Cardiff more than 4000 multinational performers and technicians worked on the giant production. Filmed on actual locations in the mountains and fjords of Norway the picture is well remembered for its scenic beauty and authentic sets. The splendid screenplay was put together by Dale Wasserman and Calder Willingham and Richard Fleischer directed with a deft hand an all star cast. The picture is also notable for the fine polished narration spoken by an uncredited Orson Welles. <br><br>Ragnar (Ernest Borgnine) is the savage Viking chieftain who with his Viking horde rape and pillage along the English coast. On one such raid he rapes an English Queen who later gives birth to a boy they call Eric (Tony Curtis). But his existing son Einar (Kirk Douglas) is unaware he has a half brother and grows to hate Eric especially after the Vikings attack an English ship and abduct the princess Morgana (Janet Leigh) whom both sons desire. Sometime later Eric rescues the princess from the Viking camp and in a small boat makes a dash for England with Ragnar and Einar in hot pursuit. During the chase Ragnar's ship goes aground in the fog but Eric saves him, pulls him aboard and takes him to England as well where the treacherous king Aella sentences Ragnar to die in the dog pit. Later Eric returns to Norway to muster Einer and his men to attack the English castle where Morgana is being held and to avenge Ragnar's death. The picture ends in a marvellous set piece as the Vikings take the castle after a blistering well staged battle and Eric and Einar battle it out to the death in a terrific sword duel atop the dizzying castle parapets.<br><br>Performances are superb from the entire cast. Douglas himself is a standout in his own production. His facility for knockabout action is a joy to behold. His prowess and unerring skill at stunts is well revealed in THE VIKINGS exemplified in the taking of the castle sequence. Here Douglas, under fire from rocks and arrows, charges and leaps across the open moat grabbing onto the axe handles which his men had already thrown and embedded in the underside of the raised drawbridge. Then using the axes to grip he clambers up and over to let the bridge down. It is a stunning and spectacular piece of stunt work! Again in an earlier scene Douglas can clearly be seen doing what is known as Dancing The Oars whereby he hops from oar to oar outside the ship for the amusement of the camp. Excellent too was Tony Curtis! Here was the emergence of Tony Curtis the ACTOR which manifested itself in Burt Lancaster's \"Trapeze\" (1956), with Lancaster again in \"Sweet Smell of Success\" (1957) and then in \"The Defiant Ones\"(1958). Gone were his pretty boy days at Universal International the studio he started with and where he would become their top pinup male star alongside a young Rock Hudson and Jeff Chandler. Also a standout in THE VIKINGS is Ernest Borgnine giving a powerful portrayal of the Viking leader Ragnar - a part he was born to play. Others in smaller roles are good too such as Alexander Knox as the Friar, Frank Thring as the sly and dubious Aella, James Donald as Egbert the English traitor and Janet Leigh (Mrs. Curtis at the time) as the princess.<br><br>My only problem with the movie is the staid and laboured music score by Italian composer Mario Nascimbene a composer who never really distinguished himself in anything he did. Despite the haunting and echoing motif that sings out the two words of the film's title on a giant elephant tusk the colourless tinny sounding score is quite insipid and uninspired. It is surprising that a composer the calibre of Miklos Rozsa or Dimitri Tiomkin - two men who could score such epics in their sleep - were not approached to work on Douglas' picture. Their involvement would have added immeasurably to the film giving it a greater buoyancy and density. However, the score not withstanding THE VIKINGS is still a great movie and remains one of cinema's finest blockbuster epics.","user":"jpdoherty","rank":[39,44]},{"title":"Memories from Childhood","rating":9,"date":"30 January 2000","review":"When I was a boy of 11 years, I admired the reconstructed Viking ships near our cottage at the Hardanger fjord. It was the year 1957, when Kirk, Tony and Borgnine visited our country and participated in this beautiful movie... In a funny sort of way, the picture makes us Norwegians proud of that brutal past... I have seen it many times, and am struck by the surprisingly \"right\" atmosphere, touched by the landscape that I know so very well, and fascinated by the action. OK, so it's Hollywood, but somehow, I have the feeling they don't make movies like this any more. Pity! Well, maybe I'm getting old.","user":"audunka","rank":[73,94]},{"title":"My kingdom for a Norse","rating":6,"date":"26 June 2015","review":"Big budget, starry-cast, historical, make that almost pre-historical, action movie where a one-eyed Kirk Douglas plays a rumbustious (that's putting it mildly) Viking prince and his unwitting half-brother Tony Curtis (the offspring of Douglas's dad, King Ragnar's, rape of the British queen on a previous raid, years before) a soon-to-be one-handed British slave who are both vying for the love of Welsh princess Janet Leigh, whilst Ernest Borgnine as Ragnar eggs his boy on from the sidelines. There's also a minor sub-plot about the Vikings crossing the water to remove from power the new, cruel, usurping English king who's tricked Curtis's Eric out of his birthright to be king himself and who to seal the deal just happens to get himself betrothed to the young Leigh.<br><br>The movie is beautifully shot in natural light in and around actual Norwegian fjords which look superb in big-screen colour and the recreation of the Viking long-boats by the film's carpenters is also remarkable, but if I'm starting a review by praising the backgrounds, it probably means there's a want in the foreground, and so it proves.<br><br>Douglas's boorish Einar looks old enough to be Eric's half-father and his usually drunken behaviour hardly endears him to the viewer. At one point he is determined to rape Leigh's Princess Morgana and is only stopped by Curtis's timely intervention. Curtis's character, unusually, is a man of few words but even with a beard, the young Tony doesn't completely convince playing it strong and silent. The object of their affections, Janet Leigh, appears able to bewitch these two the minute they clap eyes on her, which I suppose is fair enough as she does look lovely in her robes, but she's not really required to do much between simpering and occasionally seething.<br><br>There are some odd scenes of I presume authentic old Viking customs, if you exclude feasting, drinking and womanising on a Henry VIII scale that is, like \"walking the oars\" and strangest of all the method of proving a wife's infidelity which involves putting her in a set of stocks, then nailing up her outstretched hair plaits and inviting her allegedly cuckolded husband to free her by throwing axes to sever her plaits. Talk about being saved by a hair's breadth. Elswhere there's no stinting on the crowd scenes and the battle scenes are reasonably exciting if not wholly convincing. <br><br>This film was reasonably entertaining as a spectacle but for me was let down by the hackneyed plotting, use of extreme coincidence and shallow characterisation. Douglas and Curtis of course would get back into tunics and sandals a few years later, but this time with a better tale to tell and under a master director in Stanley Kubrick. To paraphrase a famous line from that movie however, this film here isn't \"Spartacus\".","user":"Lejink","rank":[7,7]}]