[{"title":"Totally completely insane (100%)","rating":9,"date":"4 November 2002","review":"This movie is completely wacky. Completely. Wacky. It concerns the story of a poor water seller in Baghdad who stumbles his way through ali baba and his 40 thieves, the tower of Babel, sinbad the sailor, the island of the sirens and many others stories that either i didn't recognise from the 1001 nights stories or were just made up by the animation team on one of what must have been many acid binges. The film was made in 1969 with a crew of about 15 animators and others (the same names pop up in multiple roles) and is thus forced to employ a number of techniques to cheapen the animation, using still frames incorporating live action shots (for such hard to animate things as the ocean) and shooting live action footage of miniature models for the landscape shots. Despite this there is a great deal of skill in the animation, especially in the number of things the morph into other things. Some scenes in this film are intensely erotic blending abstract and direct representations of sex scenes and orgies. The abstract sex scenes was some of the weirdest animation i've ever scene, essentially an undulating mass of pink springing forth the occasional phallus or feminine curve. It is interesting that although this movie does not conform to the styles and convention of Japanese anime there is visible in some characters prototypes of what would become staple anime genre identities. The mecha/ monster, the naive Kawaii girl, the gritty needs-no-man woman. However all in all this film is totally totally one hundred percent wacky. If a festival near you has got its hands on the only surviving print in the world, take advantage of the opportunity, go see it and take a tape recorder in with you and record the soundtrack, some classic psychedelic sixties music is attached to this movie.","user":"padington","rank":[22,24]},{"title":"Totally mind blowing experience!","rating":10,"date":"13 December 2012","review":"I have to say this movie really impressed me, it surpassed my expectations by quite a bit. For those of you who don't know 1001 nights is the first movie in the Animerama trilogy which were the first anime films aimed towards adults. Now I don't know how successful this was in Japan (I've heard both it was a hit and it was a flop) But I know it did poorly in America which is a shame. Oh and this film was made by master of manga Osamu Tezuka<br><br>Anyway this is of course this is a twist on the tale of Alladdin. It mixes the story of Alladin with other tails such as Sinbad the Sailor plus the Tower of Babel. Also like I said this movie is aimed at adults and so it has lots of nudity and much of the plot involves sex, of course their is no genitalia shown plus most of the sex scenes are depicted with surrealistic imagery which is quite beautiful. Their is also violence most of which is comical though sometimes you see graphic and bloody war scenes plus much of the main cast is killed off. The thing I like about this movie is how deep and complex it is. At over two hours it's one of the longest anime movies'and it makes good use of it's time. There's a lot of crazy stuff happening throughout the film and it's always interesting. At times it seems like it's just staying away from the plot but in the end everything becomes resolved and you see the reasoning behind everything that happens. It does a really good job of getting it's messages through some moments are quite powerful I think.<br><br>In the end I consider this a masterpiece that has sadly been ignored through time. This is a far better film in all aspects than most anything Disney was spoon-feeding children at the time. With lot's of great action, fantastic animation for its time, and a well told storyline Osamu Tezuka has blessed us with a truly magnificent work of art.","user":"Blacksabbathhm","rank":[9,10]},{"title":"Aladdin on acid","rating":8,"date":"27 August 2012","review":"One Thousand and One Nights belongs to the early era of anime, and broke ground in two directions, establishing animation as a possible medium for both mature content (there's a lot of sex) and serious artistic expression. It may be a bit of a leap to attribute all of the great animated films that rise above meaningless kiddie fare to this weird counterculture mash-up, but it certainly suggests that the idea of animation for adults is nothing new. But maybe all of this is expected in a film that Osamu Tezuka, who did the work of several lesser geniuses in his lifetime, had a large hand in creating.<br><br>One Thousand and One Nights is a largely impressionistic film -- there is a plot, but it's meandering and kind of meaningless, a very loose adaptation of the Arabian Nights. The animation frequently veers into the experimental, such as incorporating live-action shots of the ocean, or the downright non-representational, such as a polygonal love sequence. Other sequences are just delightful off-kilter cartoon mayhem, like a ridiculously involved duel between wizards. The influence of 60s counterculture is obvious, but I think New Wave cinema is also an inspiration here.<br><br>The most obvious flaw is one that will make a lot of people turn away instantly, which is the rather blatant racism and sexism, best exemplified in the crude Arab caricatures. (On the other hand, Disney's Aladdin was pretty racist too, and everyone loved that.) It's also a baggy film, with its 2+-hour running time unheard of for anime, and there are undeniably some parts where it drags. But for the most part it's easy to get caught up in the groove of the film, driven by psychedelic music and images as well as an irrepressible sense of play. And that groove is a very fun place to be. On top of that, any fan of animation owes it to themselves to track down this strange and forgotten gem.","user":"wandereramor","rank":[7,8]}]