[{"title":"The American Western Coming Of age!","rating":8,"date":"8 September 2010","review":"Alongside Fox's \"The Gunfighter\" (1950) Universal International's WINCHESTER '73 - made the same year - is generally held to be the first of the more mature and adult type westerns that began to emerge from Hollywood in the fifties. Here was the template for the style and approach the studios would now adapt from then on when producing westerns. Produced for the studio by Aaron Rosenberg WINCHESTER '73, from a story by Stuart N.Lake, was beautifully written for the screen by Robert L.Richards and Borden Chase. Genius cinematographer William Daniels shot the picture in luminous Black &amp; White and the masterful direction was by Anthony Mann. Although MGM's \"Devil's Doorway\" (1950) was Mann's first western WINCHESTER '73 is regarded as his masterpiece. It was also his first picture with James Stewart with whom he would have a very fruitful working relationship throughout the fifties. They made eight films together of which six were westerns including the brilliant \"Naked Spur\" (1953) and \"The Far Country\" (1955).<br><br>In WINCHESTER '73 Stewart plays Lyn McAdam who arrives in Dodge City hot on the trail of one Dutch Henry Brown - the man who shot and killed his father. Taking place in the town is a sharp shooting contest which McAdam knows Brown will be present to compete in. They both enter the competition and in an exciting finale McAdam wins the top prize of a spanking new Winchester rifle - the \"one in a thousand\". Brown, the bitter runner-up snarls \"That's too much gun for a man to win just for shootin' rabbits\" Later Brown with his two cohorts (Steve Brodie and James Milican) waylay McAdam in his hotel room and steal the rifle. On his trail again the notorious gun goes from Brown to unscrupulous Indian trader (John McIntire), to an Indian chief on the warpath (Rock Hudson), to a cut-throat outlaw (Dan Duryea) and finally back to Dutch Henry who, as it turns out, is McAdam's wayward brother Matthew. The picture ends in a terrific chase sequence culminating in a well staged shootout between the two siblings in a rocky terrain ( The bullets ricocheting off the rocks in this sequence is a brilliant special effect and is quite extraordinary!). Finally McAdam kills Matthew and regains possession of the prized rifle.<br><br>With an excellent cast - performances are outstanding. Stewart of course is great! That gangly ah shucks persona is as ever appealing. An engaging characterization the actor would maintain and reuse in all of his westerns along with the same sweat stained Stetson. With WINCHESTER '73 he would join the pantheon of iconic western heroes alongside Wayne, Cooper, Scott, McCrea, Fonda and Ford. Stephen McNally too is exceptional as the evil brother and Shelly Winters was never better in the female lead. But a revelation is Dan Duryea as a wild and slightly loony killer with the cracker of a name - Waco Johnnie Dean. Affecting a creepy effeminate snigger and demeanour he steals every scene he's in as the sly and giggling gunman. The supporting cast are also wonderful - character actors such as J.C. Flippen (a Mann favourite), Charles Drake as a coward, Will Geer as an aging Wyatt Earp and watch out for a young Tony Curtis as a cavalry trooper.<br><br>The picture also has a terrific score but there is no composer credit. The soundtrack, supervised and directed by Universal's head of music Joseph Gerhenson, was made up of stock music from a plethora of composers including Frank Skinner, Hans Salter, Julius Styne and a host of others.<br><br>WINCHESTER '73 is one of the finest westerns ever made. It is arguably Anthony Mann's greatest achievement and stands proudly with other great fifties westerns that never wane in their appeal. WINCHESTER '73 - the coming of age of the American western!","user":"jpdoherty","rank":[42,43]},{"title":"First Stewart/Mann Teaming a CLASSIC!","rating":15,"date":"15 June 2003","review":"Winchester '73 is one of the most enduring and popular films of James Stewart's career, for several reasons; it was the first of five teamings with brilliant, underrated director Anthony Mann, who retooled Stewart's drawling, 'aw-shucks' persona into a laconic, edgier, more flawed hero; it featured a brilliant cast, including Shelley Winters, Dan Duryea, Stephen McNally, John McIntyre, and, in VERY early appearances, Rock Hudson and Tony Curtis; visually, it is spectacular, one of the most beautiful Black and White films ever made, with deep-focus photography highlighting rugged Arizona settings that literally leap from the screen; and, most of all, it is a terrific variation of 'Cain and Abel', told through the premise of the search for a 'one-of-a-kind' rifle Stewart wins in a competition, then loses through treachery. It's the kind of film that offers new insights each time you view it, as the actions and motivations of 'good' brother Stewart and 'bad' brother McNally become better understood.<br><br>What truly makes this DVD an 'essential', though, is the bonus track...Described as an 'interview' with Stewart, it is actually an audio commentary that runs through the film, offering not only his reflections about the making of Winchester '73, but insights about his career, working with John Ford, Alfred Hitchcock, and his great friends Henry Fonda and John Wayne, even a nice story about his long-time mount, Pie. Recorded several years ago for the laserdisc edition of Winchester '73, it provides a rare opportunity to hear a screen legend reminisce (and makes you wish Wayne and Fonda had lived long enough to have offered personal observations about THEIR classic films!)<br><br>This is a DVD NOT to be missed!","user":"cariart","rank":[42,53]},{"title":"lonesome cowboy (James Stewart) tracks the evil brother who stole his beloved rifle.","rating":9,"date":"18 March 2006","review":"Buffs of the adult western that flourished in the 1950s try and trace its origins to the film that kicked off the syndrome. Of course, we can go back to Howard Hawks's Red River (1948) or further still to John Ford's My Darling Clementine (1946), but if we want to stick with this single decade, then it has to be one of a couple of films made in that era's initial year. One is \"The Gunfighter,\" an exquisitely grim tale of a famed gunslinger (Ringo) facing his last shootout. Another from that same year is \"Winchester '73,\" and it's worth noting that Millard Mitchell appears in both as grim, mustached, highly realistic range riders. In The Gunfighter, he's the town marshal expected to arrest Ringo but once rode with him in an outlaw gang. In Winchester, he's the sidekick to Jimmy Stewart, a kind of Horatio to Stewart's Hamlet in this epic/tragic tale. The plot is simple enough: Stewart's lonesome cowpoke wins a remarkable Winchester in a shooting match, beating the meanest man in the west (Stephen McNally), who is actually his own brother and caused the death of their father. When the brother steals the gun, Stewart and Mitchell go after him in a cowboy odyssey that takes them all across the frontier, meeting up with both outlaws and Indians. (In one wonderful bit, two future stars - Rock Hudson and Tony Curtis - play an Indian chief and a U.S. cavalry soldier - during a well staged pitched-battle. Dan Duryea steals the whole show as a giggling outlaw leader, while Shelly Winters, just before she began to gain weight, is fine as the shady lady who ties all the plots together. Today, filmmakers would go on for about four hours to bring such an ambitious idea to the screen, but Anthony Mann does so in an extremely economical amount of time, with not a minute wasted. Such western legends as Bat Masterson and Wyatt Earp (terrifically played by Will Geer) make brief appearances, adding to the historicity as well as the epic nature. The final battle between good and bad brothers, high atop a series of jutting rock canyons, is now legendary among western buffs. It's also worth noting that Stewart, however much associated he became with western films, does what is actually his first western leading man role here - yes, he was in Destry Rides Again eleven years earlier, but was cast in that comedy spoof because he seemed so WRONG for westerns!","user":"dougbrode","rank":[25,31]}]