[{"title":"A masterpiece!","rating":10,"date":"21 November 2000","review":"The first time I saw Fists in the Pocket, I was 7 or 8 years old and I thought the film was a horror movie because of its gruesome subject matter. It had freaked me a lot then. Today, after viewing it for the first time in its entirety, and though I don't think the film can be considered to be an all and out horror flick, I still think there's enough gruesome and eerie qualities to this drama to call it an authentic neo-horror film. A horror film with intelligence. Unlike Hitchcock (no, I'm not saying his films aren't intelligent) or the plethora of other less subtle horror films, where the horror or terror is mostly obvious and played for thrills to manipulate an audience, in Fists the disturbing aspects aren't played out for thrills. They're there to show the sad situation in which the characters exist. Because of this, the film has a true morbid atmosphere, quasi-Gothic in nature, that permeates it from beginning to end. The characters inability to see the horrifying things they do or think (for most part of the narrative) makes this film absolutely unique in film history. It's a vivid \"intimate\" portrait of a dysfunctional family that's almost a cerebral horror film.<br><br>Simply put, it's brilliant!<br><br>The actors are all excellent but Lou Castel's performance as the frustrated, crazed, death obsessed brother is mesmerizing. You can't take your eyes off him. And even though it was made in 1965, the film feels contemporary, mainly because of its refusal to amplify and exploit it shocking aspects or the characters' foibles to heights of schlock or melodrama. Plus, the fluid direction gives this morbid drama (which could have easily been heavy and static) a deceptively \"normal\" quality which works perfectly and adds even more to all of the characters' sad state of mind. The film is equally claustrophobic and expansive; claustrophobic with the (very) tight interiors and the family drama that (like one of the characters of the film wants to do) makes you want to break free and escape at all cost; and expansive because of the Italian countryside that surrounds these doomed characters. The scenery, natural and man-made, is a character of its own, seemingly symbolizing the characters precipitous existence but also overwhelmingly vast, stark and crushing, dwarfing the already tightly-knit family down to minuscule size, which then heightens their already claustrophobic existence that much more. Ennio Morricone's score is characteristically moody &amp; chilling and complements the film perfectly.<br><br>Fists in the Pocket is a very earthy, grounded, morbid &amp; blunt portrait of a doomed family! A must-see for those who love \"pure\" cinema.","user":"Maciste_Brother","rank":[70,79]},{"title":"One Fist in his Pocket, the Other in Your Stomach","rating":10,"date":"10 September 2007","review":"There had never been a film quite like 'Fist\" before. Marco Bellocchio's exasperating, ground-breaking, virtuoso family drama/existential tragedy/black comedy/ horror film is unclassifiable and brilliant -- an artistic and technical triumph. It's a corrosive depiction of a rotting, dysfunctional family being literally led to extinction (or rather to deaths by coups de grace) like a deteriorating, cancerous organism. Bellocchio grabs you by the collar to make you watch the agonizing putrefaction of a formerly well-off but now impoverished, demented, degenerated clan along with the fossilized Catholic rural bourgeoisie values they stand for. <br><br>Thus, we meet the doomed family -- the blind, powerless, quasi-mummified Mother (the Father is never mentioned, we assume he's dead) and her four children with Imperial names: there's Augusto, the eldest, tyrannical, insensitive, pathologically selfish, now the patriarch of the family, who plans to get away from their decadent house (Bellocchio's real family house near Piacenza) by taking whatever's left of the family money, marrying socialite Lucia and moving into town. There's Leone, the youngest, a harmless, dependent, mentally impaired epileptic who's rejected by everyone in the family but utters the sanest line in the movie (\"What torture, living in this house!\"). There's Giulia, the beautiful, narcissistic, inconsequential, prank-loving ragazza who just can't get enough love from her brothers. And there's Alessandro, the central character, an epileptic, tormented, anguished, angry young man who's so bipolar he's alternately called Ale and Sandro, torn apart by hatred and self-hatred, insecurity, sense of uselessness, sloth and an incestuous fixation on sister Giulia. Ale finally concludes that the best way to end all this mess is killing off all the family members (including himself), with the exception of Augusto, the only one in their degenerate caste with apparent \"normality\" and sufficiently \"elastic\" morality to join (i.e., become a parasite in) another caste by marrying modern, urban petty bourgeois Lucia.<br><br>Though \"Fist\" still stands very tall 4 decades later, it's makes one wonder what a revolutionary shocker it must have been when it first came out. Alessandro turns upside down the quintessential principles of European Catholic civilization: family love and unity (Alessandro hates and plans to kill his family); respect for the saintly Mother (he simulates slapping her and punching her in the face until he finally murders her, which is more like euthanasia); respect for the ancestors (he literally stomps on a family portrait): the Catholic sacraments (check the startling wake scene, where Alessandro nonchalantly rests his feet on the coffin with his mother's corpse, which certainly inspired the unforgettable Brando wake scene in Bertolucci's \"Last Tango in Paris\"); the respect for \"La Patria\" (Alessandro carelessly tosses away the Italian flag like useless garbage); the respect for property (after Mother's death, Ale and Giulia burn all her furniture and belongings in celebration!); the inviolability of the incest taboo (though it's never clear whether Ale and Giulia have actual intercourse, he aches with love and sexual desire for her).<br><br>Bellocchio uses Alessandro's bipolar disorder to make a film of moods and sharp contrasts. Amazingly, it was the work of beginners: it was not only Bellocchio's feature debut (he was barely 25), but also the debut of D.P. Alberto Marrama, whose chiaroscuro cinematography alternates blazing clarity and claustrophobic darkness; of cameraman Giuseppe Lanci (he would become Bellocchio's D.P. in the 80s), who juxtaposes shots of beautiful classical inspiration (Giulia sunbathing in the large veranda) and unsettling modernism (the unforgettable last sequence); of editor Aurelio Mangiarotti (a.k.a. Silvano Agosti), who translates the highs and lows of Ale's moods into contrasting rhythms (the electrifying \"Sorpasso\" scene vs. the delicate bathtub murder scene); and of art director Gisella Longo, who opposes the signals of old Catholic rural bourgeoisie (family daguerreotypes, old-style furniture and Catholic symbols) with the adapted-to-new-times pop bourgeoisie of Lucia's (Augusto's fiancée) world, especially in the beautiful, Zurliniesque night-club sequence.<br><br>Bellocchio's assuredness in exploring images, structure, music (a surprisingly succinct score by the great Ennio Morricone) and dialog is astounding, but the film wouldn't be quite as impressive without the powerhouse performance by Lou Castel. With his tormented looks -- a cross between the sensitivity and danger of a young Brando (whose photograph in \"The WIld One\" we see many times by Giulia's bed) and the scary madness of a Klaus Kinski -- emotional unpredictability and borderline intensity, Castel's Alessandro is one of the greatest young male roles/performances in film history, a \"jeune maudit\" perfectly worthy of Dostoevsky.<br><br>\"Fists\" reminds us of the creative freedom of the provocative, rebel cinema of a Buñuel. Bellocchio joins other early 60s greats (Pasolini, Bertolucci, Zurlini, Karel Reisz, Lindsay Anderson) in the examination of the deterioration of the \"sacred family\" and the struggling-for-survival anti-conformism of the younger generation: families were never the same again after this film (think of Pasolini's \"Teorema\", Visconti's \"Conversation Piece\", Fassbinder, Ozon, Garrel, Scorsese). **SPOILER** All is crowned by the last scene, where Bellocchio gives Alessandro's final epileptic seizure such orgasmic climax -- to the sound of Violetta's hysterical anthem to hedonism, the aria \"Sempre Libera\" from Verdi's \"La Traviata\" -- that we have to stop breathing during that last endless high note of agony and ecstasy; how many finales were ever this cathartic? When was a scene of death so powerfully liberating?<br><br>\"Fist\" is one of the greatest anti-conformist manifestos and one of the most stunning directorial debuts in movie history. Unlike some revolutionary masterpieces, its impact and power remain to this day alive, unsettling, unforgettable.","user":"debblyst","rank":[37,42]},{"title":"What torture, living in this house!","rating":8,"date":"6 December 2008","review":"This first effort by writer/director Marco Bellocchio has been called a drama by some, and a horror film by others. It is both. It is neither.<br><br>It is a view of a dysfunctional family. I almost had the impression they cam from a long line of incest like The People Under the Stairs. One wants to get away, another has epilepsy, the mother is blind, one seems to be developmentally disabled, and the last, Giulia (Paola Pitagora)is really not classifiable, but she sure seems to spend a lot of time very close to her brother Ale (Lou Castel).<br><br>Ale feels sorry for his older brother, Augusto (Marino Masé) and hatches a plan to drive the rest of the family, including himself off a cliff so his brother can get on with his life.<br><br>His plan fails, so he starts doing them in one by one.<br><br>Watching him is mesmerizing. You just have to see what he is going to try next. In the meantime, the family just acts as crazy as you would expect.<br><br>Bellocchio went on to direct many more great films including A Leap in the Dark, The Prince of Homburg, and The Religion Hour. It is amazing his first was so good.","user":"lastliberal","rank":[16,19]}]