[{"title":"Let it stand on its own","rating":10,"date":"7 November 2003","review":"I grew up with both of the Grease films but I must say, Grease 2 is my favourite and there are many reasons.  It does have the same kind of formula as the orginal Grease but is dealt with in a completely different way. Danny faniced Sandy back, but Stephanie (played by the young Michelle Pfhieffer) doesn't even give Michael (Caulfield) a second glance.  Also, instead of cars, a motorbike is the new 'thing' to have.<br><br>Michael Carrington, a straight A student from England, transfers to Rydell High and is immediately put into the 'nerd' category and the T-Birds brand him 'Shakesphere'.  He is smart, extremely uncool and very shy.<br><br>Stephenie, the leader of the Pink ladies has come back from the summer holidays having broke up with Johnny, the T-Birds leader, having grown out of him.  Johnny is clearly still interested in Stephanie but she doesn't want to know.  Her loyalty to the Birds has faltered as she wants someone even cooler.<br><br>First day back Stephanie sees the Birds picking on Michael and defends him, from that moment on Michael vows to become a T-Bird and win her heart.<br><br>So there is the story, but what Grease is famous for is the memorable songs, and this film has them!  There are 12 songs on the soundtrack and there isn't one that I really skip.  The music has changed since the first Grease as it was made in the decade of the 80's.  Its early 80's rock that you are getting yourself into for the most part.  You have the romanitc songs (Turn Back The Hands Of Time, We'll Be Together, Charades), the heavy rock songs (Cool Rider, Who's That Guy), the happy-go-dancing songs (Score Tonight, Back To School), the sweet songs (Love For All Seasons) and the down right silly songs (Reproduction, Prowlin').  These are all songs that stick in your mind and just can't stop singing them to yourself.  All the songs are quality and stand on their own.  Absolutely brilliant soundtrack.<br><br>What would Grease be without the classic characters?  We have the T-Birds who are actually not cool in any way or form, its only the leader (Johnny) who is 'cool', the others just follow his lead.  Johnny is a classic character who makes you laugh over and over again, its hilarious whenever he loses his cool.  Frenchy unfortunately doesn't have a big part in the film but nethertheless she is there.  The coach is back but you only see him twice if that.  Mrs Mcgee and Blanche are also back making quite a funny duo as they did last time.  Two new teachers; a very sexy female who always has low cut tops on and pays $500 for her hair (according to the cheer leading twins).  She falls for the unlikely nerdy substitute teacher, Mr Stewart, who teaches the immortal 'Reproduction' lesson.  The new Pink ladies have very distinctive characters, one of them is obsessed with her nose and doesnt come into it much (Rhonda), Paulette is somewhat the second leader in my view who has a crush on Johnny, she does have her own intentions but she does care for her friends; nothing like Riz.  Sharon is a bubbly flirty character who is the prey of one of the T-Birds (Louis) to get into bed. Then there is Dolores, Paulettes little sister who isn't a Pink lady but a pink lady mascot, she looks about 12, mouthy and carries a skate board everywhere.<br><br>The performances were actually very good in my humble opinion, especially Max Caulfield who seemed very uncomfortable... and that is the way Michael is supposed to be!  He wins me over with those puppy innocent eyes, then when he is the mysterious guy he acts completely cool.  Max was a triumph. His voice isn't the best thing in the world but he didn't sing that much anyway.  Michelle Pfhieffer was wonderful as an actress and singer.  When you hear her sing you won't need to wonder why Andrew Lloyd Webber wanted her as Evita in his film musical and NOT Madonna.  She shines in 'Cool Rider'.  The whole cast was believable.  I normally sit back in films and watch peoples performances and dig at them but I didnt do that at all in this movie.<br><br>This film has a lot of negative feedback as every one compares it to the Original Grease.  My opinion isnt common, preferring this one to the original, therefore my advice to you is to forget the first movie when watching this one.  It needs a chance!","user":"CareALotsClouds","rank":[72,86]},{"title":"Back to School","rating":13,"date":"13 August 2002","review":"You know, Grease 2 has taken a lot of flack &amp; extensive bad reviews for not living up to the original. I really don't think that is to fair considering the cast was totally different. Granted there was no super-star-pop-icon like Olivia Newton-John. There wasn't the hot-70's &amp; 80's actor John Travolta. However, there were some great stars in this film. The writing may have been a little less than perfect...the direction might not have been up to par. But for me, being EXTREMLY young when both Grease 1 &amp; 2 came out, I never compared the two. I think they are two different films with the same \"type\" of concept. The music was good. The dance scenes are good. &amp; yes, even the story is okay. Grease mania is about being a devoted fan... that is something I am. I liked both of these films on two different levels. Grease without a doubt is the better of the two. But this one is not as bad as the negativity everyone feeds into it. If see one, see the other. Just note that they are both FUN movies! Nothing more. The sequel centers around Sandy's cousin Michael. He is in love with Stephanie, &amp; trys EVERYTHING possible to win her over. The Pink Ladies are still cooler than ever. The T-Birds are not as tuff, but are sexy! 1-10 Grease(10) Grease2(8) Z.","user":"AppleAsylum","rank":[58,72]},{"title":"Very enjoyable and funny","rating":8,"date":"8 November 1999","review":"I dont understand why this movie is being slammed so much. The first Grease is a classic and its always impossible to follow a classic with an equal sequel. I happened to enjoy this sequel better than the original. I thought it was funnier and I enjoyed the music in this movie better than the first. Especially the \"Reproduction\"scene...you can't watch that and not agree that that is one funny part of the movie. I also thought Maxwell Caulfield was GORGEOUS as Michael. I overall give this movie 7/10.","user":"kbouck","rank":[73,107]}]