[{"title":"A Disney film with a lot of heart","rating":8,"date":"21 September 2004","review":"If you talk to anyone about what film messed them up mentally as a child, Bambi is a guarantee to be in that list. Who hasn't named this film as one of the saddest movies of all time? The funny thing is, this is a children's movie! It's made by Disney! I'm convinced that Disney had to tear us down just so they could build us back up, my goodness, we are Disney Marines! Bambi is one of the training videos to make us tough, because if you can make it through this film without crying that proves that you have no heart and are dead inside. Bambi despite being one of the saddest movies of all time still has a lot of heart and is one of the best in the Disney classics. With it's beautiful animation, charming characters and breathtaking story this is a movie that no one should miss.<br><br>In a forest thicket, a doe gives birth to a fawn whom she names Bambi. After he learns to walk, Bambi befriends Thumper, a young rabbit; then, while learning to talk, Bambi meets a young skunk whom he calls \"Flower\". After Bambi has completely learned how to talk, his mother takes him to the meadow, a place that is both wonderful and frightening. Bambi's mother warns him that deer are unprotected in the meadow as there are no trees or bushes to hide them, so they must take great care for their own safety. Bambi and his mother go to the meadow and discover a patch of new grass, as they eat, his mother senses a hunter and orders Bambi to flee. As they run, gun shots ring out. When Bambi arrives at their thicket, he discovers his mother is no longer with him. He grows up and learns the way of surviving being an adult deer.<br><br>I do have one small problem with the film, after the tragic scene where Bambi's father tells him that his mother can no longer be with him indicating that she's dead, you're tearing up painfully and then all of a sudden it cuts to this wonderful magical music with birds and flowers! What kind of a mind screw is that?! \"Be sad, be painfully sad, you are so sad that you want to fill an ocean with your tears of sadnessNOW BE HAPPY\", I just don't get that part. However all that aside, Bambi is still a good Disney film, but it is a hard one to watch. I still think kids are a lot stronger than adults give them credit for, like I said, this movie may be a tear jerker, but it's a wonderful story of friendship and coming of age. Disney doesn't hold back when it comes to delivering a good message, bad things do happen, but we can still be a good person and live life like it was meant too. I recommend Bambi to anyone, it's a good movie with a lot of heart, just have a box of tissues ready when you watch it.<br><br>8/10","user":"Smells_Like_Cheese","rank":[48,52]},{"title":"The last of its kind","rating":10,"date":"18 July 1999","review":"Walt Disney didn't make another full-length animated film until 1950, by which time his golden age had well and truly passed.  Was `Bambi' a quiet, gentle farewell, then?  If you haven't seen it you could be forgiven for thinking so; and the slightly over-sugared opening scenes might confirm this view.  But prepare to be jolted out of your seat.  The forest contains darkness as well as light.  The gunshots that ring out across the silences are truly alarming (and there are many ways Disney and Hand make them more alarming: consider the scene where a flock of birds are cowering in the grass, until one decides to fly into the air and risk death rather than put up with the suspense).  Also worth noting about `Bambi' is its use of psychological colour.  In at least three key scenes, the colour scheme shifts wildly, not because the sun has set or anything of that kind, but in order to illustrate Bambi's psychological state.  Particularly fine is the scene where he is running away from the clearing in fear and the world turns into just a few pale and dirty shades of yellow.<br><br>The greatest thing is the way Disney manages to convince us that there is nothing else in the world, outside the forest.  Not once do we see a horizon.  Nor do we sense one.  By some standards not much happens in the forest - a few deaths, a few births, what else is new?  But when the forest is the whole world they matter a good deal.","user":"Spleen","rank":[96,108]},{"title":"What animation can evoke when it's done just right","rating":8,"date":"24 November 2002","review":"Blissful, playful, moving and inspiring, Walt Disney's \"Bambi\" is a precious jewel that will last longer than most of us will. Indeed, it has a timeless quality, matched with a charming music score and wonderful character voices. Pauline Kael of The New Yorker poked fun at the voice-changes when the infant animals grow up over winter (sort of a puberty-in-the-thicket), but what other way was there to show the passage of time and how it changes everything, even the woodland creatures we take for granted? It's an amazing achievement. The song score never elicited a hit the size of, say, \"When You Wish Upon a Star\", but it does feature the sprightly \"Little April Showers\", which underscores the very best sequence. ***1/2 from ****","user":"moonspinner55","rank":[40,44]}]