[{"title":"Schepisi's First and Perhaps Best - He Really Knew His Material","rating":10,"date":"18 February 2014","review":"One of my best friends at university had attended a Catholic brothers' seminary and like Fitz in \"The Devil's Playground\" had been dismissed from it due to his increasing interest in the opposite sex. Like Tom, he was confronted with letters sent to him from a girl he had met on a camp that the brothers had read and found disturbing. When my friend saw \"The Devil's Playground\" back in 1976, he commented that the film was realistic except for the fact that many of the lines spoken in the film would have remained in the minds of the brothers and the boys but never spoken. <br><br>The film itself is a masterpiece. The casting is perfection from that of the brothers down to the most minor characters. Watch for Danee Lindsay as Lynette. She has very few minutes on screen but her charm and warmth jumps off the screen at you. When she steals a kiss from Tom, she steals one from the audience. This is no sexually precocious 13 year old. This is a genuine 1950's Australian lass right down to her crooked front tooth that somehow adds to her appeal. How sad when Tom's innocently affectionate letters to her are used as evidence of something almost distasteful and to be discontinued lest Tom jeopardize his vocation. Tom Keneally as Father Marshall is equally effective. Again a small role that hits a home run. He is a cheerful and good man but this only makes his terrifying speech prior to the three day retreat even more disturbing. His depiction of hell, its terrors and its time span have remained with me – an atheist – throughout my life. If it remains with me, I can only guess at the effect it had on boys like those in the film. <br><br>The cinematography and the score add to the pervasiveness of the unease. There are very few shocks – just a sense of something being off kilter. Here is a struggle against an inexorable psychological enemy not some visible monster that jumps out of the shadows. Tom Allen, the young protagonist, struggles to remain positive about becoming a brother in the face of fanaticism, sadism, overly strict prohibitions and the onset of puberty with its embarrassments and confusion. When he finally runs away, there is a true sense of relief for him and for us as we have become involved in his struggle. What a wonderful performance by the young Simon Burke.<br><br>The struggles of all the brothers are presented in a balanced manner. Each of them is likably human and each, with the exception of Brother Francine, struggles with their belief in the rules and regulations they enforce. Even Brother Francine, as played by Arthur Dignam, plays a beautifully solemn piano piece which seems to reflect a sensitive side to an ostensibly repellent character. His fanaticism is indicative of his fear that any doubt might bring about a complete breakdown of his beliefs. And once he does doubt, the floodgates do open and all is lost. <br><br>Having taught teenagers for over 30 years, I have come to understand how much childhood stays with us throughout the rest of our lives. It makes me wonder whether Tom would ever be truly free from guilt. \"Give me a boy until he is seven, and he is mine for life.\" What a terrible boast to make but an accurate observation of how enduring is childhood indoctrination.","user":"campbell-russell-a","rank":[13,13]},{"title":"A good lesson.","rating":10,"date":"19 March 2005","review":"I have this film as part of my home video collection and have not seen it in awhile. However, I can remember the feeling of misgiving I felt for these young men who were entering puberty. It brought back memories of my entrance into the same. It brought to mind that those things for which we are regularly exposed to do not cause so much curiosity. These young boys were required to remain sexless without feelings or hormones, just when their bodies were beginning to take off. I kept thinking that it could have helped them if they were taught about the normal body development they could expect, the urges and ideas which may spring to mind. The allowance of the natural arrangement of public showering, with the nudity exposure indicated, but allowance for one's privacy and dignity as the person is comfortable, could also have helped in their adjustment to puberty. Of course, this was a movie, but it is a good lesson to anyone dealing with pubescent kids. Simon Burke was excellent in his portrayal of his character.","user":"foxman2004","rank":[18,22]},{"title":"Interesting depiction of an unnatural life style","rating":7,"date":"9 June 2003","review":"A titillating title like \"The Devil's Playground\" suggests some very wicked scenes and lustful action to follow.  Fred Schepisi goes about as far as the censor permits in revealing life among boys and staff of a highly disciplined Catholic College.  The atmosphere of the College is well captured in the classrooms, the noisy refectory during mealtimes, the playing fields and private lake.<br><br>\nThe Devil it seems likes to act at night or in dark shadows where boys in the throes of puberty discuss the mysterious happenings of wet dreams and contemplate the best ways of masturbating.  When seeking advice from the brothers, the students are told to exert more self-discipline and say more prayers to overcome such sinful acts.<br><br>While the problems of puberty are laid bare in this film. the group of frustrated brothers with their difficult vows of celibacy are not overlooked.  One gets the feeling that the strict code of discipline at all levels is far from the perfect system.<br><br>In one way or another, there is a lot of exposure of flesh whether it be in the College shower room, swimming in the lake or peeking at full-bodied girls in the nearby recreational area.  This heightens the idea of the sins of the flesh.<br><br>Some of the brothers like to dress in civilian clothes when released from duty and become part of the outside world.  Drinking beer at the local tavern and even chatting with the girls!  Yes, temptation abounds in every corner of the Devil's Playground.<br><br>The film with its many players and short scenes is almost a documentation of the strengths and frailties of life in the Catholic education system.  Fred Schepisi gives us a broad statement of the problems of the era but no real answers.  He does however hint that, as a basis for a future life there is much lacking in the system.<br><br>On the whole, interesting...and a great basis for further discussion.","user":"raymond-15","rank":[18,22]}]