[{"title":"\"Have a Potato.....Have a Potato\"","rating":4,"date":"4 July 2002","review":"Truly one of Universal greatest unsung horror films, The Old Dark House is a unique blend of gothic setting, quirky characterizations, wicked black and dry humour, a great ensemble cast, and the workings of the mind of James Whale.  Whale made the film the year after Frankenstein.  He was again paired with Karloff.  But unlike their first association, Karloff's star is far less brighter in this film as his performance, although good and servicable, is over-shadowed by atmosphere, Whale's direction, witty dialogue, and a cast of scene stealers such as Melvyn Douglas, Charles Laughton, Eva Moore, and Ernest Thesiger.  Others in the notable cast include lovely Gloria Stuart, Lillian Bond, and Raymond Massey.  Thesiger and Moore, as the brother and sister imposed upon by travellers in the stormy night, are fantastic as they interact and play out their eccentricities to perfection.  Thesiger has the choice lines in the film as the effeminate Horace Femm, a cowardly man that cowers to his deaf sister. He is a joy to watch and each of his lines oozes with oil.  Moore is also very good as she bellows repeatedly, \"N beds!  No beds!  They can have no beds!\"  The story is based on a novel by J. B. Priestly.  The plot is somewhat antiquated now, but Whale's direction puts a lot of life into it. And let's not forget Karloff, however small his part, still turns in a great menacing performance as a lecherous, drunken servant named Morgan ogling Gloria Stuart from the moment he sees her.  The Old Dark House is a great film, and it should be more highly touted by Universal!","user":"BaronBl00d","rank":[96,104]},{"title":"From Almost Lost to Classic","rating":7,"date":"16 October 2017","review":"Seeking shelter from a storm, five travelers are in for a bizarre and terrifying night when they stumble upon the Femm family estate.<br><br>The film is based on the novel \"Benighted\" (1927) by J. B. Priestley, who saw the \"queer inmates\" of the house as symbols of post-war pessimism. He was quite reluctant to sell the rights, thinking his characters would not adapt well to the screen. However, in January 1932, he changed his mind when Universal offered him $12,500 (roughly $215,000 in 2017 money). <br><br>The novel was adapted for the screen by R. C. Sheriff (\"The Invisible Man\") and Benn Levy (Hitchcock's \"Blackmail\"). Universal Studios producer Carl Laemmle invited Levy from England to Universal City after being impressed with Levy's screenplay for \"Waterloo Bridge\" (1931), which was also directed by James Whale. Sheriff and Levy were able to have a script fleshed out by March 1932, a mere two months.<br><br>James Whale worked with many collaborators from his previous films including Arthur Edeson, who was the cinematographer for \"Frankenstein\" (1931) and \"Waterloo Bridge\" (1931) and set designer Charles D. Hall, who also worked on \"Frankenstein\". Edeson went on to help create the American Society of Cinematographers (ASC) and become its president. Hall kept \"Old Dark House\" very scaled back; a viewer could easily mistake the film for a stage production. Ultimately, Hall would work on 11 of Whale's 20 films.<br><br>For genre fans, the most obvious repeat collaborator is Boris Karloff, who plays the supporting role of a mute butler. Interestingly, though Karloff's best-known role is Frankenstein's Monster (under Whale's direction), and Whale's best-known film (also \"Frankenstein\") starred Karloff, the two were not necessarily friends. Cordial, yes, but never close, and yet their names are linked for all eternity.<br><br>The cast is all-star by anyone's standards. Whale chose newcomer Gloria Stuart for the glamour role, and this lead to her wider success and her helping found the Screen Actors Guild (SAG). She would soon work with Whale again on both \"The Kiss Before the Mirror\" and \"The Invisible Man\", both released in 1933. This was Charles Laughton's first Hollywood film, which came shortly after Laughton had worked with Whale on the English stage. <br><br>Laughton was married to Elsa Lanchester, who played the title role in Whale's \"Bride of Frankenstein\" (1935). \"Old Dark House\" also started Ernest Thesiger's Hollywood career, and he would go on to work on Whale's \"Bride\" as Dr. Septimus Pretorius, a role that the studio wanted Claude Rains to have. Of course, Thesiger embodies that role and is as memorable as the bride herself. At the time of casting \"Old Dark House\", Thesiger had already known Whale and was appearing in one of Benn Levy's plays.<br><br>According to Stuart, Whale was a very hands-on director, deciding line delivery, walking, costumes and more. She saw him as an \"artist\" with his background in both acting and set design, and was \"fussy\" about makeup, jewelry and props. Because of his rapport with Thesiger, Whale allowed for the most deviations from the script (and book) for his old friend.<br><br>\"The Old Dark House\" was largely ignored at the American box office, although it was a huge hit in Whale's native England. Variety and the Hollywood Filmograph gave the film negative reviews, with Variety calling it a \"somewhat inane picture\". Other reviews were more positive, but on the whole it was not seen as an instant classic, much to the astonishment of modern audiences.<br><br>For many years, the original version was considered a lost film and gained a tremendous reputation as one of the pre-eminent Gothic horror films. Whale's fellow director and friend Curtis Harrington (\"Night Tide\") helped to prevent \"The Old Dark House\" from becoming a lost film. Harrington met Whale and Whale's partner David Lewis in 1948, at a time when (according to Harrington) \"Whale had no critical reputation at all\", unlike how film historians view him today.<br><br>When Harrington was signed to Universal in 1967 to direct \"Games\" with James Caan, he repeatedly asked Universal to locate the film negative of \"Old Dark House\", although it was Harrington himself who discovered a print of the film in the vaults of Universal Studios in 1968. He persuaded James Card the George Eastman House film archive to finance a new duplicate negative of the poorly-kept first reel, and restore the rest of the film. The original nitrate negative had survived, though the first reel only existed as a lavender protection print. <br><br>Harrington further was the one responsible for getting the film legally released. Because Universal had not pursued the copyright, the rights to the story reverted to the Priestley estate and were bought up by Columbia, who released an inferior remake by acclaimed director William Castle in 1963. Harrington was able to convince Columbia to allow copies of the Universal film to be made, though it would be years before distribution and re-screenings were legally cleared.<br><br>In 2017, the Cohen Film Collection released a brand new Blu-ray featuring a 4K restoration that brings this classic back to life. They also packed the disc with two different commentaries (one with actress Gloria Stuart, the other with James Whale biographer James Curtis). There is a featurette on how Curtis Harrington saved the film from obscurity, and a completely new 15-minute interview with Sara Karloff.","user":"gavin6942","rank":[15,15]},{"title":"The Best of the Golden Oldies of Horror","rating":10,"date":"28 July 2004","review":"I have to say that I have loved this movie since I saw it Fifty years ago, and it was a revival, even then.   It is certainly, in my book, the best film James Whale ever made, and if you see it on a good print, it stands up very well.  The setting of the Old House on a dark rainy night is brilliantly done and the mood is held all the way through.  The cast is excellent headed By Boris Karloff as the sometimes out-of-control Morgan, and Charles Laughton is a delight in his very off-beat role.  Raymond Massey and Melvyn Douglas both contribute to the fun as does Gloria Stuart, but the creme-de-la-creme comes from Emma Dunn and Ernest Thesiger as the Femms - who can ever forget Mrs. Femm saying \"No beds, you can't have beds!\", or Mr. Femm offering the guests at meal time \"Have a Potato\".  The remake many years later is an insult to this film, and should not be shown anywhere. Look everywhere you can to try and get a copy of this 1932 masterpiece.","user":"dougandwin","rank":[69,78]}]