[{"title":"This film is an animation classic","rating":17,"date":"17 August 1998","review":"Not only is An American Tail easily one of the best animated features ever made, but it proves to be leaps beyond the efforts of recent Disney movies by refusing to be constricted to an all-too-familiar formula. This movie does not stay within the cozy, comfortable guidelines that Disney adheres to in order to make money. Instead, it tells a truly unique tale, one not borrowed from any other source, and one overflowing with artistic wonder and originality.<br><br>The characters you will see here are not stock, not pulled from the typical Disney hat. The story is not a chuckle-a-minute, lowbrow attempt to take the easy way out in pandering to children. The main character, Fievel, suffers real hardships and tragedy, and stares into the despair of his own soul before the movie is finished. This, of course, makes the ending that much more satisfying, an infinitely more significant and authentic moment than any cardboard cut-out Disney plot.<br><br>If you want to see what animation was meant to be as an art form, if you want to feel the power and emotion that can truly be reaped from this under-appreciated and over-commercialized medium, look no further than An American Tail.","user":"Rodimus-2","rank":[42,48]},{"title":"Still a classic masterpiece","rating":6,"date":"6 July 2000","review":"I remember seeing American Tail when I was very little, and I loved it. I always felt sad for Fievel when he was away from his parents, and at the time, I never knew that they were always very near him. I thought that they were always far away from him like he thought. Not too long ago, I bought this movie and watched it again...for the first time in years. I'm 17 and I still love the movie. It's the ultimate animated movie when it comes to being gentle, heart warming, and full of good heart. And the film is such a wonder to behold, even after all these years. Despite another sequel and one (or was that 2?) (one was made in 1999 and it's coming soon to video?) direct to video movies. Out of the three I've seen, this one is still the best, and it's among my favorite animated movies of all time","user":"GoodWillHunting","rank":[23,26]},{"title":"Excellent movie for all ages that will warm your heart!","rating":9,"date":"26 July 2006","review":"In my opinion, this is an excellent movie for all ages that will warm your heart! When Fievel (voice of Phillip Glasser) got lost, I wanted to cry. Although some of the characters were diabolical, I liked everybody. Well, it's hard to say which character was my favorite. The music was good, especially \"Somewhere Out There, \"A Duo,\" and \"No Cats In America.\" In addition to the music being good everyone was cast perfectly, and the direction was flawless. In conclusion, I highly recommend this very touching movie for all ages that will warm your heart to anyone who hasn't seen it. You're in for a real treat and a good time, so go to the video store, rent it or buy it, kick back with someone close to you, and watch it.","user":"Catherine_Grace_Zeh","rank":[15,17]}]