[{"title":"The Stuff Of Nightmares","rating":29,"date":"29 May 2005","review":"This is a film about witches, ancient alchemy, and death. The atmosphere is Gothic and medieval. But the setting is modern. Most scenes take place in small, stylish interior spaces. For lighting, Argento uses the glow from indirect sources (mostly blue, red, and orange hues), and alternates this with darkness. In combination with the lighting, the film's sound effects, which alternate with silence, are appropriately spooky. And Keith Emerson's soundtrack, with all that organ music, contributes to the Gothic tone. One of the best parts of the entire film is the rock-opera opus from the chorus at the film's end, with that great beat, and lyrics that are indecipherable.<br><br>The nightmarish atmosphere, while maybe not quite as stunning as in \"Suspiria\", is more than adequate to induce suspense, anticipation, and a sense of danger. From out of the darkness and stillness comes \"death\", in all its horrific cruelty. As a \"horror\" film, \"Inferno\" is fairly pure, in that the plot is more or less self-contained. There are only brief references to the \"real\" world, outside the confines of the story.<br><br>The film's plot is indeed thin, and functions really as an excuse for the actors to move from one atmospheric set to the next. The script does not require great acting skills, mercifully, since great acting is nowhere to be found.<br><br>Of the various Argento films I have seen, \"Inferno\" is perhaps my least favorite. It does not have the conviction of Argento's other works. It seems more like a half-hearted sequel, an afterthought, to \"Suspiria\". Like most sequels, I find it less satisfying than the original, the soundtrack notwithstanding. Still, for Argento fans, \"Inferno\" is a must-see, if for no other reason than for purposes of comparison.","user":"Lechuguilla","rank":[44,53]},{"title":"The most beautiful of horror movies","rating":10,"date":"12 February 2001","review":"Inferno is Dario Argento's masterpiece. For once, he abandoned the idea of a coherent storyline altogether and made a movie that is simply a series of beautifully made setpieces. Many people have criticized Inferno's plot; such people are completely missing the point. Inferno is no more concerned with plot than Luis Bunuel was with movies such as The Phantom of Liberty; where Bunuel was concentrating on images and ideas, Argento is concentrating on images and emotion, specifically fear.<br><br>Each scene features a character or characters running afoul of the Three Mothers, entities introduced obliquely in Argento's previous movie, Suspiria, and developed considerably here. The third movie in the Three Mothers trilogy remains unmade. Each scene is carefully coded by judicious use of colour and sound. All the best setpieces in the movie feature no dialogue whatsoever (most notably the scenes in the underwater chamber and the lecture theatre). Much of the most significant dialogue is whispered offscreen by unseen persons.<br><br>Inferno is that rarest of breeds: pure cinema. Not only could it not have succeeded in any other medium, it cannot be adequately described in words. Anyone who is seriously concerned with artistic cinema must see this movie, as should most horror fans. Anyone who has trouble getting their head around movies that push beyond the conventional three-act storyline will almost certainly hate it.","user":"pearceduncan","rank":[98,129]},{"title":"One of My Favorite Dario Argento's Movies, With an Intriguing and Frightening Story and Great Atmosphere","rating":8,"date":"5 April 2005","review":"In New York, the poetess Rose Elliot (Irene Miracle) reads an ancient book called \"The Three Mothers\" that she bought in the bookseller and antique Kazanian close to her building. The architect and alchemist E. Varelli, who tells that had designed and built three buildings for three mothers,in Rome, New York and Freiburg, wrote an impressive story in London. These threes wicked mothers, called Mater Suspiriorum (the oldest one), Mater Lachrymarum (the most beautiful) and Mater Tenebrarum (the youngest and cruelest), intended to rule the world with sorrow, tears and darkness. In accordance with the book, there are three keys, each one of them hidden in one building. Rose realizes that she lives in one of the buildings, and decides to look for the second hidden key in the cellar. From this moment on, weird things happen to her and she decides to write a letter to her brother Mark Elliot (Leigh McCloskey), a student of musicology in Rome, and asks him to visit her in New York. Mark never meets his sister and finds who the three mothers are indeed. <br><br>This is the beginning of \"Inferno\", one of my favorite Dario Argento's movies, with an intriguing and frightening story and great atmosphere. There are many flaws in the screenplay; the characters are not well developed, so their motives are not clear; and there are lacks of explanations for many events, so the viewer does not understand why the evil mothers attack the characters of the story, but anyway it is a cult Gothic movie. With some improvements in the screenplay, this movie would be a masterpiece classic. I have already seen this scary movie four times in a VHS I have recorded a couple of years ago from cable TV, and unfortunately it has not been released on VHS or DVD in Brazil. My vote is eight.<br><br>Title (Brazil): \"A Mansão do Inferno\" (\"The Mansion of the Hell\")<br><br>Note: On June 23rd, 2009, I saw this movie for the fifth time in an imported DVD.<br><br>On June, 4th 2015, I saw this movie again.","user":"claudio_carvalho","rank":[51,65]}]