[{"title":"Snail-paced poetic erotic French horror","rating":6,"date":"16 March 2001","review":"Director Rollin once again plays out his obsessions in this tale of a secret society of women who lure men to their castle for blood ceremonies at midnight.  Beautiful French countrysides, gorgeous (frequently nude) women, old castles and erotic horror are what to expect from this exploitation film with aspirations of art.  The pace is slow and deliberate with no real escalation of tension as midnight comes and all is revealed.  Brigitte Lahaie has real screen presence and is memorable as she stalks a victim carrying a huge scythe.  Definitely worth a look as are all of Rollin's films.","user":"Eegah Guy","rank":[20,24]},{"title":"Excellent film with unusual imagery and a sense of mystery.","rating":8,"date":"27 July 1999","review":"I'm an admirer of Jean Rollins work, and this film is the one which to me best represents his style. It succeeds in blending the sexual predator images of the more successful Hammer vampire movies, with the doomed romanticism of French cinema. The production values are low, presumably they operated on a very small budget, but as I was starting to experiment with my own super8 films, I was inspired by how much it achieves in spite of its limitations. The film is driven by a series of powerful images, notably the semi-naked girl wielding a scythe, and the odd bit of lesbian love action. As with all of Rollins best films, you get the feeling of getting a glimpse of, and being allowed to share, a very personal obsession.","user":"ldk-2","rank":[18,24]},{"title":"Rollin's best","rating":8,"date":"27 July 2005","review":"A thief who is fleeing the partners that he double-crossed comes across a mansion with only two beautiful (and odd) occupants. His plan to stay until nightfall seems to be easily achievable when he finds out the home owners have no desire for him to leave.<br><br>From this simple premise Rollin creates his most engrossing work with the thief coming to realize that his greatest threat may not be the crooks outside the house but the ladies within. Though slow moving this film ratchets up the tension as midnight approaches and a mysterious ceremony is soon to begin.<br><br>Strong performances abound with special mention to frequent Rollin star Brigitte Lahaie who has never looked (or acted) better. The women in this film are all incredible and like in all of his films, Rollin shows a photographer's eye for beauty. Once again Rollin indulges in his fondness for lesbian sex scenes but they don't overpower the film like they do in some of his other works.<br><br>For anyone who has not yet seen a Rollin film, either this one or 'Grapes of death' would make excellent starters although, obviously, keep the kids away.","user":"deheor","rank":[19,27]}]