[{"title":"Altman's lost dream sonata","rating":16,"date":"16 September 1999","review":"I have spent a grown lifetime seeking this 1972 Altman dreamscape, and lost all hope when a friend reported that the director told a Q-and-A audience that Columbia had mistakenly destroyed the negative. A specialty store in Santa Monica somehow found a video copy, and it was worth fifteen years' wait. <br><br>Suggestive of the tinkling, misted-over fugue states of QUINTET and THREE WOMEN, IMAGES riffs lyrically off Polanski's REPULSION. Where Polanski's film is pitched somewhere between sixties horror and the dry joke-telling of Bunuel, Altman's version is lush, druglike, sensuously baroque. Susannah York plays a children's writer in a remote Irish cottage who seems to be spending too much time indoors. (Were the movie not lost in obscurity, you might think her an antecedent for Jack Torrance and Barton Fink.) As she copes with the would-be-regular-guy puttering of her schmucky husband (Rene Auberjonois, in a role rightly intended for Michael Murphy), two other loathsome men flit into her life--the husband's buddy, an Irish lecher played by Hugh Millais, and a seemingly dead ex-lover, played by Marcel Bozzufi. As these men appear to bleed into one another in York's mind, so do they soon start bleeding into the cottage's Persian rugs.<br><br>IMAGES defines Altman as the freest and most fearless of all American moviemakers. Most critics only stand behind Altman's we-are-the-people movies--his community mosaics. But he clearly is as passionate about mapping inner worlds as outer ones, and these Expressionist chamber pieces are his most feckless works. The movie is also a reminder of what Altman lost when he stopped hiring Vilmos Zsigmond to shoot his movies. Almost no one on the planet has such an intuitively graceful and expressive shooting style, but Zsigmond's stunning work here--among his finest--reveals that it's a long walk downstairs from Zsigmond to the likes of Jean Lapine. And note should be made of the work of the youngish composer who wrote the elegant, sinewy, restrained score--a decidedly non-bombastic, anti-symphonic fellow whom we now know as John Williams.","user":"nunculus","rank":[48,53]},{"title":"IMAGES (Robert Altman, 1972) ***","rating":7,"date":"23 August 2006","review":"An arty horror movie is the last thing one expects from Robert Altman - although, apparently, he had already tried it out with his earlier, little-seen THAT COLD DAY IN THE PARK (1969). The writer/director (itself an unusual combination for Altman, but it shows how strongly he felt about the project) himself does not think of it as such and, in any case, reviews at the time were decidedly mixed.<br><br>Even if he was \"inspired\" by Ingmar Bergman's PERSONA (1966), the film actually feels closer plot-wise to Roman Polanski's REPULSION (1965). Originally intended to be shot in Milan with Sophia Loren, the film definitely benefits from its picturesque Irish locations and Susannah York's fragile performance (which eventually earned her the Best Actress Award at Cannes) as a schizophrenic; she, too, was unusually committed and actually allowed a story for kids she had written - called \"In Search Of Unicorns\" - to be incorporated into the narrative!<br><br>The film features only five major characters and, interestingly, these are named after each of the actors themselves: so Susannah York plays Cathryn just as Cathryn Harrison (Rex's daughter, a very natural performer who later featured in another strange film - Louis Malle's BLACK MOON [1975]) plays Susannah; Marcel Bozzuffi's character is named Rene', Rene' Auberjonois is Hugh and Hugh Millais is Marcel! Of course, all this fits perfectly well with the film's theme and the characters' penchant to exchange 'faces' with each other in the mind of the disturbed protagonist; actually, this concept is pretty frightening because the lead character at one point decides to get rid of her 'ghosts' - but, not having a complete grasp on reality, one is never sure whether the victims are mere figments of her imagination or else real people! <br><br>Also essential to establishing the film's unique mood is Vilmos Zsigmond's stylish cinematography and John Williams' stark yet evocative score (interspersed with eerie sounds provided by Stomu Yamash'ta, a Japanese sound designer); even though his work here is galaxies away from Williams' renowned anthemic scores for the likes of Steven Spielberg and George Lucas, he still managed to earn an Oscar nomination for it!","user":"Bunuel1976","rank":[15,15]},{"title":"Brilliant, Chilling, Lost Treasure.","rating":10,"date":"9 October 2003","review":"Under the assumption that Altman was creatively peaking between the years 1970 and 1975, (I realize this is debatable) I sought out every film that was made during that period. Surprisingly, I could not locate the brilliant, chilling lost treasure that is the film \"Images\" it seemed to have simply vanished into history. Although Susannah York deservedly earned best actress at Cannes for her performance, and it was sandwiched between \"The Long Goodbye\" and \"Mccabe and Mrs. Miller\" this film, like \"3 women\" and \"California Split\", remain mysteries. Luckily, \"Images\" was released on DVD this past September. I immediately bought it without a second thought. I am very thankful that I did.<br><br>Images is one of those gems that make you appreciate cinema, directors and the creative process in general, because of the exploritive potential within the medium. Dredging up the inner fears and archetypes of the subconscious and weaving together what comes to the surface synergistically is Altmans vision in this film. Sadly, lately, film is about loud bangs and shiny things and very few adroitly capture the lost art of character development. <br><br>\"Images\" seems to be one of those films that could only have taken place in the early seventies. During the era of psychedelic drugs, the film indubitably feels as though it is on some kind of mind altering substance. It is completely trippy and unnerving. Logic seems to have flown out the window from the onset of the story. I won't give anything away, because you need to go into this film knowing nothing, or little to nothing about it, and just enjoy the ride.","user":"TheTwistedLiver","rank":[31,37]}]