[{"title":"Beautiful film","rating":10,"date":"26 May 2005","review":"Wonderful movie. First I have seen from this time period (aside from \"The Incredible Shrinking Man\") that actually scared me. <br><br>A psychiatrist gets addicted to an alternate reality that can be entered by putting on an ancient mask. Trouble is it slowly renders the wearer insane. <br><br>I wholeheartedly disagree with the majority of viewers here who say the non-3-d sequences are dull. I found them entertaining and well acted. The whole thing can certainly be read as a metaphor for drug use. <br><br>The actual 3-D isn't that great (it isn't like things are thrust out at the viewer). It looks more vaguely 3-D. But the sequences themselves are fascinating and weird and demand repeated viewings. <br><br>I think the really striking aspect of this film is the sound design. It truly was ahead of its time. I can't think of another film that makes such mesmerizing, hypnotic use of sound design. I'd be curious to know how they did it.<br><br>Sounds are slowed down to a throbbing groan, echoes reverberate in and out and a sonic thumping pounds every time someone gets ready to put on the mask. Just listen to the voice-over when the suicide note is read (doctor's patient). <br><br>I love it. Watch it. I watched scenes again and again after my first viewing.","user":"tristanb-1","rank":[13,14]},{"title":"Absurd but Lovable Schlock","rating":8,"date":"8 July 2004","review":"This early 60's horror film is one of the slowest moving ones ever. The film begins with an awesome title sequence...some flickering abstract lines, mixed with some deliciously eerie music. Following that (and before the story actually starts), we have one of the most dreadfully boring narrators ever in the history of film, explaining to us what a mask is, and that when the characters in the film put on the mask of the title, we are to do the same with our 3-D specs.<br><br>The story itself is a bore, painfully written and with some ludicrous, laughable acting (my favorite was the grumpy landlady). The 3-D sequences are something else entirely from the rest of this film. You'd think they came from a different movie. They are moody, eerie, well thought out and put together. Some of the in-your-face effects still don't work well (even in a theatre) but they are hokey good fun. However, once the non-stereo scenes come back on...they are redundant and increasingly annoying. Still, this is a cult classic by any standards, and you can't help but love it. Understandably, it has quite a following.","user":"laffinsal","rank":[7,8]},{"title":"Scared me to DEATH!!!","rating":8,"date":"23 August 2009","review":"I was 8 years old when I saw this movie. My friend and I went ALONE!!!! They actually let us into a matinée! ALONE! We got sooooo scared, we hid behind the seats. Popping-up to see when it was OK to watch. Skulls coming at you. Flames shooting at you...right out of the screen! Arms reaching out for you! All in 3D!! Glad it was not in COLOR!!!<br><br>It was more than our little minds could stand, we wanted to run and leave sooo bad, but we had paid our money, and we talked about it all the way home, and then the next day it was as if we had not seen it!!!! I forgot it for about 20 years (1980'ish), when it was shone, in 3d I might add, on TV for Halloween!!!! I guess that is what you call traumatized! WE WERE! They should never have let 8 year old's in to see this movie, ALONE!!!! Now I have the Elvira VHS tape of it.<br><br>We thought it was coooooool, and we did enjoy it, but we were SCARED TO DEATH!!!!<br><br>SO, on a spooky night, watch it.....but watch out!","user":"gmda","rank":[11,14]}]