[{"title":"It's for all time; a baseball mythos","rating":9,"date":"23 March 2006","review":"Whenever \"The Natural\" is on TV, I stop what I'm doing and watch it. I don't know why, exactly. I have been a baseball fan since I was a little kid and love the tradition. There is no other sport that has as much history. It's because one can isolate moments in time. Situations develop. Every announcer says things like, \"Bottom of the third, men on first and third, Turley on the mound, Simpson is up, he's two for four today. The wind is blowing out to right field, etc.\" We can make words visual. In this wonderful movie, a man wants a piece of that tradition. He makes a horrible mistake along the way to the big leagues, and now is given one last chance. This is mythical. This is not realistic. To criticize it on the basis of its credibility is unfair. Even to compare it to the book is unfair. They are totally different. What one does with a camera should not be compared to the printed page. Malamud did his thing and now Barry Levinson is doing his. The cinematography is without peer. It is magical all the way through. The lighting as Glenn Close stands up in the stands is mesmerizing. This is more Greek myth than baseball story, but it is a baseball story, with the Ruth like gods and the day-to-day players. Roy Hobbs is like all of us in some ways and we love him for his endurance, patience, and drive. Redford brings him to life with that rugged face moving away from lost youth. It's a fine film.","user":"Hitchcoc","rank":[78,87]},{"title":"My favorite baseball movie. Truly magical.","rating":9,"date":"27 April 2004","review":"A wonderful, magical fairy tale, and morality play.  This is the type of movie that as a new father, I cannot wait until my son is old enough to watch this with me.<br><br>I know much has been made about Redford being too old to play Roy Hobbs. But much of the story asks you to believe in incredible things, so to me, this is a minor issue.<br><br>Everything about this movie is first rate. The cast which includes Redford, Glenn Close, Kim Basinger, Wilford Brimley and a pair of terrific performances turned in by Robert Duval and Darren McGavin.<br><br>It is easy to see that all of the actors trust the material and believe in their characters.<br><br>Barry Levinson tells the story in a straight forward style, he doesn't try to build any false suspense or surprise twists.  When you watch this movie you know exactly what is going to happen long before it does, but you don't care, because it unfolds intelligently and without pretense.<br><br>My two favorite components of this movie are the cinematography by Caleb Deschanel and the beautiful, moving score composed by Randy Newman.  I first enjoyed Mr. Deschanel's work on \"Being There\", and felt Mr. Newman's score for \"Ragtime\" was the best score of 1981. <br><br>\"The Natural\" is so much more than a baseball movie. It is a story about faith, good and evil, right and wrong, fathers and sons. It is about all that is good in baseball and in life. <br><br>10 out of 10","user":"alfiefamily","rank":[79,90]},{"title":"The Ultimate Sports Fantasy Movie","rating":10,"date":"25 October 2005","review":"This is THE classic sports-Walter Mitty-fantasy movie, with an ending that may seem corny to cynical critics or those who prefer the book, but was perfect for me and a lot of other people.<br><br>Granted, I am a little biased in my review since the movie was made in the area in which grew up. Having made many trips to the ballpark in which the movie was filmed, and to the old-fashioned soda shoppe where Robert Redford and Glenn Close re-unite, this movie was special to all of us in Western New York. It always a kick, too, (and a bit odd) to watch the final scene since the opposing pitcher is a personal friend.<br><br>I think I would have loved this movie regardless of the \"home-field advantage.\" It's an interesting, involving story that has you really rooting for Redford's character. To have actors like Close, Robert Duvall, Richard Farnsworth, Kim Basinger, Wilfred Brimley, Darren McGavin, Barabara Hershey, Robert Prosky, Joe Don Baker and others in the \"lineup\" doesn't hurt, either!<br><br>The cinematography is beautiful, too. That was something I never really appreciated until after several viewings. There are some wonderfully subdued brown and golden hues in here. This is very pretty motion picture.<br><br>All the characters - the good and the bad, and there are plenty of both - are fascinating. It's also nice to see an actor in a baseball film that actually knows how to throw, hit and field a baseball. This is a great, old-fashioned storytelling.","user":"ccthemovieman-1","rank":[82,99]}]