[{"title":"Fighting on San Francisco Bay","rating":6,"date":"28 September 2005","review":"In Hell on Frisco Bay Alan Ladd who also produced this film plays an ex-cop who's served five years on a manslaughter rap for which he was wrongly convicted. Of course as in the case of noir films he's on a mission to find the real killer and clear himself.<br><br>It doesn't take him long to sniff out a trail that leads to San Francisco underworld boss Edward G. Robinson. Robinson is easily the best in the cast. He's as malevolent as he was in Little Caesar or at least in Key Largo. <br><br>It's not that Hell on Frisco Bay is a bad film, but it's all so routine for Alan Ladd. He would not transition into character roles as he hit his forties. His legion fans which were gradually dwindling by this time still wanted their guy in action hero parts.<br><br>He's not terribly animated here. I wouldn't have been surprised if he was ill during the making of this. In a way that might have helped the believability factor. Five years in jail would have given him a certain prison pallor to his complexion.<br><br>Alan Ladd liked having friends around and the cast here is filled with players who were close personal friends and/or co-workers from his Paramount days. They include, Anthony Caruso, George J. Lewis, Peter Hansen, Perry Lopez, William Demarest. Look for young Rod Taylor as a contract killer and Jayne Mansfield in her screen debut as a bimbo.<br><br>Joanne Dru plays the estranged Mrs. Ladd and was probably grateful to be in a modern setting. Paul Stewart gives a memorable performance as Robinson's chief henchman along with his lady love Fay Wray who played a former movie star who was keeping company with Stewart. Their relationship with Robinson is the key to the story.<br><br>Cinemascope and noir usually don't mix, but in this case with the final scene being a police chase and fight with speedboats across San Francisco bay, cinemascope helped greatly.<br><br>Fans of both Alan Ladd and Edward G. Robinson will enjoy this film.","user":"bkoganbing","rank":[23,23]},{"title":"excellent later Ladd picture","rating":7,"date":"20 February 2006","review":"While most of the territory covered in this film has been covered before in countless movies, still this story of organized crime is very watchable and packed with great dialog and lots of action. In fact, this is very much a Film Noir piece, despite its having been filmed in color. Ladd is great as the angry guy seeking out justice (yes, I know it isn't very much of a stretch) and Edward G. Robinson turns in exactly the type of performance that made him famous (once again, not much of a stretch I know). And, overall, the film is very gritty, entertaining as well as great fun to watch. It does lose a couple points for the lack of originality, but considering how well it is put together, it certainly makes up for much of this.","user":"MartinHafer","rank":[22,24]},{"title":"\"Hell on the Docks\" original title of \"Hell on Frisco Bay\"","rating":10,"date":"9 January 2012","review":"The original title for \"Hell on Frisco Bay\" was \"Hell on the Docks.\" Apparently, either Warner Bros. or Alan Ladd, whose company, Jaguar, produced the film, thought the title wasn't colorful enough or specific enough about its location, so \"Frisco Bay\" was substituted just prior to the film's release. I have a few stills with the original title printed on them.<br><br>This film, like others produced by Ladd in the 1950s, including Delmer Daves' Western, \"Drum Beat,\" has not appeared on DVD because, according to a Warner Bros Archives Edition executive, the Ladd estate has not permitted its release.<br><br>\"Drum Beat\" just appeared on Turner Classic Movies in its original CinemaScope format, but it was shorter than its published length of 111 minutes by at least four minutes. No US DVD release is imminent.","user":"akunert","rank":[10,11]}]