[{"title":"A lesser entry in the Edgar Wallace series","rating":3,"date":"1 February 2005","review":"Edgar Wallace was a popular British author of crime thrillers during the 1920s. Though Wallace himself died in 1932 ( while working on the screenplay for King Kong ) the popularity of his work spawned a number of films based on his novels. Of particular note is a series of German adaptations by Rialto Films, beginning in 1959 and continuing until 1971, that presented the material with a stylish mix of humor and thrills. While this approach led to some very entertaining films, such as DER HEXER, ZIMMER 13, or ROOM 13, is unfortunately one of the poorer entries, being a very predictable and pedestrian affair.<br><br>The disappointment begins almost immediately. While the ominous sounding title suggests some significant mystery, ( What, Where, is Room 13? ) it is very quickly revealed that room 13 is about as mysterious as room 222. Ten minutes into the film we learn that room 13 is simply the number of a room in the Highlow nightclub where gangster Joe Legge is planning his next heist. The film attempts to present this theft, a train robbery, as a minutely planned Mission: Impossible style caper, but in fact the whole business essentially consists of pulling the train onto a siding and unloading it.<br><br>On the side of the angels is Johnny Gray, played by Wallace series regular Joachim Fuchsberger. Gray is supposedly the greatest private detective in London, which would suggest a marked drop in standards since Sherlock Holmes' day. Gray is brought into the affair by Sir Robert Marney. Legge is threatening that unpleasant things will happen to Marney's daughter, Denise, unless Sir Robert provides some unspecified assistance with his planned robbery, and Gray is hired to protect her. What follows is rather uninspired business with Johnny Gray doing much running around but not much detecting. Often it seems the only progress that Gray actually makes toward solving the case, is when the heavy handed ineptitude of the thieves pushes him toward the solution.<br><br>The only actual mystery in the film, is the hidden identity of a maniac who likes to slice women's throats with a straight razor. This subplot seems almost like an afterthought, tacked loosely to the main narrative. Actually it isn't even really much of a mystery, as the film's complete lack of subtlety makes the identity of the killer blatantly obvious very early in the film.<br><br>The only real bright spot in the entire production is Eddi Aren't. Aren't is usually on hand in the Rialto Wallace films to provide comedy relief and in ZIMMER 13, he has his work cut out for him. As Higgins, a brilliant, if somewhat odd, police scientist, who is madly in love with his lab mannequin, Emily, Aren't is by far the most interesting thing in the movie. Unfortunately, Aren't alone simply isn't enough, and in the end ZIMMER 13, with its night club setting and hip private detective, feels very much like a less than inspired episode of PETER GUNN.<br><br>For fans of the Edgar Wallace mystery thrillers, ZIMMER 13 is available on DVD as part of the Edgar Wallace Collection from Tobis Home Entertainment. This impressive series presents pristine copies of all thirty-three of the Rialto Wallace films in 16:9 anamorphic widescreen. Happily, the majority of the DVDs releases in this series feature both German and English audio and subtitle options.","user":"k_t_t2001","rank":[5,5]},{"title":"Lucky 13","rating":9,"date":"9 November 2013","review":"Wealthy nobleman,Sir Robert Marney, receives an unwelcome visit from notorious criminal, Joe Legge, who seeks his assistance, by way of a veiled threat, in secreting the proceeds of his planned heist; meanwhile, somebody is killing dancers at a sleazy night-club.<br><br>One of my favourites of the eight or so of the Edgar Wallace 'krimis' that I've seen to date, although opinions are divided on its merits. I think the more preposterous plot elements, and the prominence given to comic Eddie Aren't's police doctor, enhances, rather than detracts, from it's appeal.<br><br>Given that the constituent plots are usually enough to sustain two films, part of the fun is waiting to see how the scriptwriters will join up the dots. In my case I wasn't overly concerned at how logical the resolution would be, as I was just enjoying the telling of it. Previously, I had begun to question the inclusion of Eddi Aren't's comic interludes - largely because of the absence of slapstick humour in Wallace crime novels - but I think here I finally 'got it': whether it was watching him cavort with his laboratory 'mannequin', his exaggerated 'Q' style experiments, or watching him getting up close and personal - mostly to their bemusement - with the nightclub dancers, this is where I officially became a fan; almost to the extent that my enjoyment of these films is almost directly proportional to the extent of his involvement.<br><br>The heist itself put me in mind of the contemporary British 'Great Train Robbery' - which itself was separately re-enacted by a West German production company - but despite the occasionally ludicrous characterisations and actions, it was excitingly staged.<br><br>The parallel plot line of the murders was somewhat implausibly resolved, though not wholly unpredictably, but it all combined to add to the general enjoyment.<br><br>Although there were a number of standout performances - notably Aren't - the entire ensemble , including the suitably ugly gang members, worked a treat together. Although later films were made in colour, I think black and white was more effective, not least in some nice moody landscape shots, and in the nocturnal outdoor sequences. The plots moved at a brisk pace, but not so fast that you couldn't make sense - or 'non-sense' -of what was unfolding<br><br>Ably directed by Harald Reinl, who had already proved himself a quality director of genre films","user":"Joseph_Gillis","rank":[2,2]},{"title":"One of the better Edgar Wallace films I've run seen","rating":8,"date":"14 January 2009","review":"After 20 years, when the statute of limitations has run Joe Leg turns up on the door of Lord Ambrose. Threatening the Lord that he will reveal past misdeeds and harm his daughter, Leg tells the Lord to meet him at the High Low club in the titled room. The Lord hires a detective named Gray (a reoccurring character in the Wallace series) to protect his daughter. From there the story spins out as a past robbery, an upcoming train robbery and straight razor wielding maniac all come into play. This is a very good Wallace adaptation that moves along at a good clip and doesn't get distract with extraneous stuff, such as humor. Indeed the comic relief Scotland yard assistant isn't as intrusive as he would be in some of the other Wallace films. As with the best or better Wallace films they transcend their narrow niche and become a solid crime film on its own terms. Worth a look with a bog of popcorn and a soda.","user":"dbborroughs","rank":[2,2]}]