[{"title":"Simple SF Tale with Profound Message...","rating":13,"date":"13 January 2004","review":"THE DAY THE EARTH STOOD STILL is such a basic Science Fiction story that many first-time viewers have been stunned by the reverence in which it is held. An alien arrives on earth, is misunderstood and is nearly killed, passes a warning to mankind to not carry the weapons of potential nuclear war into space, or face annihilation, then leaves. The FX are minimal, there are no 'space battles' or 'monsters', even the score, by the legendary composer Bernard Herrmann, is simple, lacking the bombast of later 'epics'. Yet in it's very simplicity, director Robert Wise has created a tale more timeless and relevant than many other 'message'-driven SF blockbusters that followed.<br><br>Based on Harry Bates' short story, \"Farewell to the Master\", which paints a far less friendly view of our galactic community (Gort, the enforcer robot, is revealed to be the true 'Master' of the story, not Klaatu, thus revealing that machines are controlling the Universe), 20th Century Fox and director Wise quickly butted heads on how the film should be presented. Fox envisioned Spencer Tracy as Klaatu, believing that the legendary star's well-established persona would make the SF elements more 'understandable' to audiences. Wise scoffed at the notion, arguing that no one would ever believe Tracy was an alien, and searched until he found relative newcomer Michael Rennie, a gaunt, sensitive British actor, whom he felt best suited the Christ-like quality Klaatu had to possess (even the name Klaatu adopted to mingle with humans was 'Carpenter'). For earth's greatest scientist (a thinly-disguised Albert Einstein), Wise cast screen veteran Sam Jaffe, which also brought a howl from the studio, as the actor was being investigated by the House Un-American Activities Committee, in the midst of their infamous 'witch hunt' and blacklisting of Hollywood's supposed Communist sympathizers. Jaffe proved a perfect choice, however, displaying many of the qualities he would later bring to 'Dr. Zorba' on \"Ben Casey\".<br><br>\nRounding out the cast were popular actress Patricia Neal (still recovering from her failed relationship with Gary Cooper), Hugh Marlowe (fresh from the success of ALL ABOUT EVE), and Billy Gray (who would go on to great success in \"Father Knows Best\"). <br><br>The true casting coup, however, was finding 7-foot Hollywood doorman Lock Martin to portray the robot, Gort. Encased in foam rubber 'armor' and 'lifts', to bring his height to nearly eight feet (he actually wore two different outfits, as the seam was impossible to hide, and would always have to be on the opposite side to the camera), Martin, who, Wise acknowledged, was not a physically strong man, would occasionally faint from heat exhaustion (if you watch him carefully, during the film, you can actually see moments when he would start to tilt over). The scene where he carries Neal on board the spacecraft was a major achievement for the easily tired giant, and the actress, who was afraid, justifiably, that she might be dropped!<br><br>The filming was, by and large, an enjoyable experience for the cast and crew (although Patricia Neal, in later interviews, said that it was nearly impossible for her to say the film's famous 'tag' phrase, \"Klaatu Barrada Nikto\", without breaking into giggles). Everyone knew the end result would be special; Michael Rennie, ten years later, would call the role the most \"important\" of his career (NBC would even bring him in to host the network premiere of the film, on \"Saturday Night at the Movies\").<br><br>With it's anti-war stand, the film was the direct counterpart of the year's other 'classic' SF production, THE THING FROM ANOTHER WORLD, the first of Hollywood's 'alien invasion' films. In THE DAY THE EARTH STOOD STILL, 'Mankind' is the true monster, toying with nuclear weapons, constantly fighting, and willing to kill a peaceful emissary, without allowing him to deliver his message or offer his gifts to the world. \"Man must grow up, or be destroyed\" was a powerful message, in 1951, particularly when Wise panned his camera over Arlington Cemetery, with it's thousands of headstones, as Klaatu/Carpenter viewed, sadly, the end result of our fixation with warfare.<br><br>The message is even more relevant, today, which is why THE DAY THE EARTH STOOD STILL remains a classic.","user":"cariart","rank":[129,146]},{"title":"My FIRST sci-fi movie!","rating":5,"date":"5 March 2003","review":"When I first saw this movie (on television circa 1957)I was just a young child four years of age.  I remember sitting on my father's lap and watched the whole thing through my fingers as I held my hands over my eyes for protection (yeah...right!).  Gort and Klaatu were magnificent space travelers...and with a message of peace during a time that the Soviets and U.S. were deep into the 'cold war'.  Very timely!  Very scary!  It spooked me then and I still get a chill watching the movie today.  But, it's one of the classics that will live on forever!  It's message is as meaningful today as it was back in the 50's.  Maybe we should all watch it again and take notes.........","user":"ErnestPWorrell","rank":[77,87]},{"title":"A science fiction classic that beautifully melds the ordinary and the fantastic","rating":17,"date":"17 March 2005","review":"This science fiction classic is more relevant than ever, and I don't mean its silly message about peace. Yes, yes, we're all violent, silly, war-like humans, and we should all throw away our guns and atomic bombs posthaste if we know what's good for us. Thanks, Klaatu. We'll get right on that. Meanwhile, we'll enjoy the chance to watch your story on DVD because we live in an age  yes, of war and cruelty and weapons of mass destruction  but also of Jar Jar Binks and \"Alien vs. Predator.\"<br><br>Klaatu (Michael Rennie) is a gentlemanly outer-space alien who comes to earth in his flying saucer to send us Earthlings a very important message. Sadly, we shoot him on arrival and try to imprison him in a hospital room. He escapes, however, and goes out among us to find the basis for our \"strange, unreasoning attitudes.\" He takes a room in a boarding house, where he meets the widowed Mrs. Benson (Patricia Neal) and her young son (Billy Gray). The widow is being romanced by an insurance salesman (Hugh Marlowe), who later displays a lust for glory that endangers Klaatu  and thus the rest of the world. Klaatu is in better hands when he reveals himself to Professor Barnhardt (Sam Jaffe), a brilliant scientist and the best hope for the survival of Earth.<br><br>It's funny, but I never think about this movie in terms of that plot outline. To me, this film is composed of small moments about people  especially Mrs. Benson. Mention \"The Day the Earth Stood Still\" to me, and the first thing I think about is that moment where the strange new boarder tells her that he'd like to spend the day with her son. She hesitates a moment and says in a lowered voice, \"Well, that's awfully nice of you to suggest it.\" It's a tiny moment about her concern for her son, her good manners and her intelligent ability to reply quickly and diplomatically. Patricia Neal, not Gort the robot, makes this movie come alive for me.<br><br>The real reason this story is so fresh is because  it's a good story. It's not an excuse to slap us senseless with fast-paced cutting or drown us in great globs of special effects. It has an engaging plot with warm, interesting characters. If we stupidly (and as you know, Klaatu, we humans can be so very stupid) limit ourselves to the New Releases section of the video store, we forget that some sci-fi thrillers put story before special effects.<br><br>The trick work in this movie is excellent, though. I think the robot looks silly, but when Gort opens its visor and we hear that unnerving theremin music, we don't care that this supposedly metallic creature bends like Styrofoam at the knees. We know those laser beams eyes are about to scorch everything in their sight.<br><br>Michael Rennie makes up for Gort's deficiencies. He gives what easily could have been a humorless, sanctimonious character a quiet, graceful authority. His slightly otherworldly looks add to the illusion; and Neal as Mrs. Benson completes it by reacting to him with obvious respect  even when she fears him.<br><br>Under Robert Wise's direction, every shot is strikingly composed and brings out the maximum dramatic potential of the story. The sense of rhythm and pacing is beautifully suspenseful. Bernard Herrmann, with the theremin as one of his instruments, gives the movie both a nervous tension and a sense of wonder. And the story is so perfectly constructed that it even gets away with a big speech for a climax.<br><br>What's the heart of this movie? There's a bravura sequence where Billy Gray secretly follows Rennie from the boarding house to his spaceship. It's a simple, wordless scene where the entire team of filmmakers  and that goes double for Herrmann  meld the ordinary and the fantastic. You want a special effect? That's it.","user":"J. Spurlin","rank":[192,225]}]