[{"title":"Two men, caught in the conflict of WWII, engage in a hunt-and-seek situation that has only one final outcome.","rating":8,"date":"28 December 2004","review":"\"The Enemy Below\" released in 1957, was one of those films directed by Dick Powell, and starring Robert Mitchum, that sparked with genuine realism and utmost attention to detail. This film also showed the harsh realities in war, and the dedication that men on both sides of the conflict can give to the task appointed. Mitchum plays the commander of a US Naval vessel that has the task of seeking out and destroying enemy submarines; having just recently lost one command, he is going to make sure such doesn't happen twice. The renowned German actor, Curt Jurgens, portrays the submarine commander whose presence has been detected by Mitchum's destroyer, and the chase is on.<br><br>Both commanders, Mitchum and Jurgens, in their characters, reveal that each was firm in their beliefs toward their respective countries. While Jurgens is not a gung-ho Nazi, he does have a firm dedication to his fatherland, and what it was before the war. Mitchum has the same firm devotion to his country, and what he is doing is the right course to bring a successful ending to the war, ultimately. There is a lot of verbal discussion during the course of the film, who is right, why are we engaged in this action, etc., but both commanders are desperately trying to out think and outmaneuver the other.<br><br>There were several good movies made during the 50s, this film, \"The Enemy Below\",and \"Run Silent, Run Deep\" come to mind, and are certainly worth a view. This film does give a look at both sides involved in the type of chase done here. An 8/10","user":"Mickey-2","rank":[47,51]},{"title":"Respect for One's Enemies","rating":9,"date":"6 February 2006","review":"Robert Mitchum is the new Captain of a destroyer on patrol in an area of the South Atlantic where there will be little chance for any action, or so the crew thinks. This is a new command for him, he lost his last vessel and was 21 days on life raft. Mitchum though he was in the merchant marine before World War II is as new to the navy as most of his crew.<br><br>Lurking beneath is Curt Jurgens in command of a U-Boat. Jurgens is a career navy man who's already given much for the fatherland, two sons lost. His submarine is on courier duty, not looking in fact for any combat.<br><br>But they find each other and The Enemy Below is about the cat and mouse game each of them play in trying to destroy the other.<br><br>With twelve years in between the end of World War II and the present it was now possible to portray Germans as three dimensional people, something rarely done during the war years. Jurgens at this time was a very big star on the European continent and was now getting roles that would introduce him to American audiences. He's very good as the professional, but tired U-Boat captain who just wants to get home.<br><br>He's matched all the way by Mitchum who's got a lot of doubts now having lost one ship already. The crew has some doubts too, but Mitchum proves worthy of the command he's been given.<br><br>The Enemy Below won the Academy Award that year for special effects. No ships in a tank, these are real vessels being used for this film. <br><br>Look for good performances by supporting players Theodore Bikel as the Executive Officer of the submarine, David Hedison as the Executive Officer of the destroyer and Russell Collins as the ship's doctor on the destroyer. You might note a small role for Doug McClure at the beginning of his career.","user":"bkoganbing","rank":[45,50]},{"title":"A classic!","rating":8,"date":"8 September 2004","review":"Have to agree with \"bob the moo\" on this one. I've seen it probably two dozen times, and will see it many more, I'm sure. One of my favorite \"war\" movies (w/Robert Mitchum and Curt Jurgens as destroyer and submarine captains, respectively). My other faves are \"Platoon,\" \"Full Metal Jacket,\" \"Decision Before Dawn,\" (w/Oskar Werner and Richard Basehart--most excellent!), and of course, Kubrick's \"Paths of Glory,\" w/Kirk Douglas, Adoph Menjou and George MacReady.<br><br>More than a blood-and-guts war movie (though it has plenty of terrific action scenes), it's more of a man-vs-man \"cat and mouse\" story. Absolutely excellent direction (by Dick Powell) and some terrific cinematography. Terrific scene between Jurgens and Theodore Bikel (who plays his Exec. Officer), that is nothing but facial gestures and eyebrows.<br><br>A very \"moral\" tale, it shows that even sworn enemies serving their countries in wartime can show respect and compassion toward each other, especially since they're all men-of-the-sea: sailors. Conversations between Mitchum and his ship's doctor and between Jurgens and his exec officer mirror each other. Note the scene of the American sailors pulling the German sailors aboard their lifeboats near the end; Mitchum helping rescue the U-boat captain and his exec after ramming them.<br><br>Great tale, well-scripted, acted, directed and shot. An model of how to make a terrific story into a movie.","user":"kalex","rank":[46,52]}]