[{"title":"Golden Gem From Hollywood's Golden Past!","rating":8,"date":"2 December 2010","review":"JEZEBEL (1938) is one of the great and enduring Warner Bros. Bette Davis classics, and alongside \"The Old Maid\" - made the following year - is my own favourite Davis movie. From a flopped play by Owen Davis Snr. It was produced for the studio by Henry Blanke and beautifully written for the screen by Clements Ripley, Abem Finkel and - feeling his way along in the business - a young John Huston. Genius cinematographer Ernest Haller was behind the camera bringing the vivid Art Direction of Robert Hass to life and the masterful direction was in the safe hands of William Wyler.<br><br>A splendid sense of time and place is immediately established at the very beginning with the 1852 setting in antebellum Louisanna. Bette Davis is Julie Marsden the high spirited southern socialite who toys playfully with the feelings of her male suitors especially her young banker fiancé Preston Dillard (Henry Fonda). But he tires of her controlling personality and her irritating misdeeds such as storming into his bank demanding to see him on a trivial matter as he attends an important board meeting and then her insistence on wearing a RED dress to the Olympus Ball much to the chagrin of those who adhere to the strict tradition to only wear white (\"You can't wear red to the Olympus Ball\"! asserts an astonished Pres)). But wear it she does in defiance! However the Ball is a sensational sequence as Julie and Pres become a spectacle when all in attendance stand around and stare in disbelief as they waltz alone in the middle of the floor. Later during their uneven relationship Pres has to go North on business. He returns after about a year but he is not alone. He is now accompanied by a new woman in his life....... his wife. Counting the days for Pres's return Julie is in utter shock when he introduces Amy (Margret Lindsay) to her as his wife.(\"You're funnin'!\" A horrified Julie exclaims - \"Hardly!\" responds a sheepish Pres). The picture climaxes with the dreaded Yellow Jack fever breaking out across the South and Pres being struck down with the deadly disease. In a brilliant confrontation with Amy Julie manages to convince her that it must be her, and not his wife, who should accompany Pres to the fever death camp. The picture ends in an extraordinary and harrowing final scene as Julie comforts the dying Pres on one of the many wagons in the caravan heading out of the city to the fever camp.<br><br>The acting throughout is superb from all concerned topped with a blistering Acadamy Award winning performance from Davis (she was assigned the role so as to allay any disappointment she might harbour with Warners for not loaning her out to play Scarlet O'Hara - a part she dearly wanted to play). Excellent too is the young Henry Fonda, Fay Bainter in her best supporting Award winning role as the gentle and anxious Aunt Belle and George Brent is impressive (as always) as the ill-fated rival Buck Cantrell. The movie's atmosphere is quite stunning with the stark black &amp; white cinematography, the vibrant looking sets and the supreme nominated score by Max Steiner. The composer's main theme is beautifully arranged as a beguiling waltz for the infamous ballroom scene. And in the final sequence his prowess as film's great dramatist is powerfully demonstrated in the chilling dirge-like march he wrote (complete with spirited female chorus) for the fever wagons, with their cargo of dead and dying, as they struggle through the streets of New Orleans on their way to their grisly destination. JEZEBEL was one of 18 scores the great composer wrote for Bette Davis' films which included \"The Old Maid\"(1939), \"Dark Victory\" (1939), \"The Letter\"(1940) and most memorably \"Now Voyager\" (1942) which brought the composer the second of his three Acadamy Awards. The great actress once remarked of the composer \"At Warner Bros. Max knew more about drama than any of us\".<br><br>Max Steiner's music, William Wyler's adroit direction, Ernest Haller's stunning cinematography and of course Bette Davis's riveting performance all jell to make JEZEBEL one of Hollywood's outstanding and unforgettable motion pictures of all time.","user":"jpdoherty","rank":[43,45]},{"title":"Excellent Davis","rating":8,"date":"21 November 2006","review":"Bette Davis dominates the whole movie with a mesmerizing performance,which earned her a second Oscar. As the love of her life we find a young and handsome Henry Fonda.Davis,who sometimes overacted gloriously, is kept more subdued by master director William Wyler. Her performance is the better for it.George Brent,playing the other male lead, has rarely been better.As the southerner unable to change his obsolete ways,he's a marvel.The musical score by Max Steiner is one of his best and adds to the brilliant depiction of a bygone era. Depiction of African-Americans in movies from this era are often very racist, but I found some scenes were they were portrayed more sympathetic than in other movies of the thirties. Jezebel is one of the best movies I have seen with Bette Davis.","user":"nnnn45089191","rank":[12,12]},{"title":"Bette Davis-Legend","rating":10,"date":"11 February 2010","review":"Bette Davis is a legend. I'd always heard that growing up, but felt some disconnect from it . When I became aware of her it was late in her career after she had developed into a boozy, smoke belching, caricature of her on screen persona's. So, if the \"Bette Davis/Legend\" concept rings a little hollow with you as it did me, watch this film. I just saw \"Jezebel\" for the first time on DVD. Wow! I haven't seen a lot of movies from the 1930's but I'm pretty sure that no one else was doing then what Bette Davis was doing. It is an acting style, and skill level, that isn't seen often. <br><br>She is brilliant throughout but one scene in particular made the hair stand up on the back of my neck. It happens in the scene where Henry Fonda escorts Jezebel home after the ball and breaks off their engagement. When he tells her, \"goodbye\" and not \"goodnight\", a look of puzzlement and humiliation comes over her face. She starts to turn away to leave, but decides instead to extend her hand in Southern feminine cordiality to wish him well. As she does this something inside her wells up. Her expression changes, and as they say, if looks could kill... With the speed of a cobra, and unable to restrain herself, she slaps him in the face. Unlike a cobra however, which recoils after it strikes, she lurches slightly closer and you think she might just rip his throat out. William Wyler lets the camera linger on her and it's a powerful, and slightly disturbing, moment. I don't think anyone else could have pulled it off like Davis did. <br><br>The film is great although the depictions of slavery as a genteel Southern quirk are more than a little cringe worthy. To see this movie though is to understand how Bette Davis became a legend. And to see this movie is to see one of the most powerful screen performances ever. Who knew... After all 1938 was a long time ago and I've been busy with other stuff.","user":"hughman55","rank":[25,29]}]