[{"title":"Funny yet poignant","rating":20,"date":"20 January 2000","review":"Based on a popular UK comedy series, this film concerns two men, former schoolboy friends now approaching middle age, living in the industrial North-East of England.  One has \"got on\" and runs a small building firm, the other is a dissolute drifter.  Though often extremely funny, the film, shot in wintry North-East landscapes, also conveys a sense of wasted lives and unfulfilled hopes.","user":"heedarmy","rank":[17,20]},{"title":"30 years have passed and no sequel - Unbelievable !","rating":10,"date":"4 September 2006","review":"These two actors were so good together and the script equally top notch - why oh why in these days of poor sequels and the flogging to death of anything half-decent must we be deprived of this fantastic idea / partnership. The main players are still alive - so too the writers - what is the problem BBC ?? If it is still Bewes &amp; Bolam's dislike of each other that is simply not an excuse - many actors have turned out memorable roles opposite people they detested. Common sense and professionalism should enter the scenario here as future generations will not thank us for allowing this wonderful pairing to die off - DO IT NOW. You did it with 'Only Fools....' Whether they like it or not these two characters/actors are a NATIONAL INSTITUTION and they achieved legendary status in their own lifetimes - something very rare indeed - this should simply NOT BE ALLOWED to wither on the vine. If you are reading this Messrs. Bolam and Bewes...please bury the hatchet (if that is indeed the problem). Even if only for the sake of posterity...Delboy has gone, so too Victor Meldrew.....Blair's Britain must have something to look forward to.....your nation expects.<br><br>Must more licence-payers money be thrown at a seamless line of Antique / Boot Sale / Move to the country / Flog it / DIY / Cookery programmes? To say nothing of those awfully bad sensationalist fly-on-the-wall 'Reality' programmes which only serve to provide a stage for and inevitably generate yet more moronic and talentless 'wannabes'.<br><br>I recently met up with an old work colleague after 30 years and it's been great - please let Bob Ferris and Terry Collier do the same.<br><br>As both would now be heading down the retirement road, a nice twist would be Terry having finally turned out to be the more successful of the two whilst Bob (&amp; Thelma's) fortunes have stagnated on the Elm Lodge Housing Estate courtesy of occupational pensions that didn't live up to their expectations.<br><br>They could meet at an airport ......having recently sold his string of Costa Del Sol bars, a flush, sun-tanned Terry returns and literally bumps into Bob re-stocking vending machines in the airport lounge \"I do this part-time purely to keep active, you understand, kidder\" Come on..MAKE IT HAPPEN FOR A NATION CRYING OUT FOR A DECENT SIT-COM....I've started it off, all you've got to do is carry it on.","user":"anne-bolger","rank":[15,22]},{"title":"Whatever happened to subtle comedy?","rating":3,"date":"25 March 2013","review":"Whatever happened to the Likely Lads is one of the best remembered British sit-coms of the 70s delighting in strong characterization between two friends, one a somewhat nostalgic but still feral working class man Terry, the other a domesticated and married aspiring middle class man, Bob. Alas, this dynamic is all but abandoned for this spin-off, one of the poorest of the 70s. The spin-off genre itself is notoriously bad, but there really was no excuse for this. The writing duo had 'taken advantage' of the cinematic version to insert crudities which would never have been allowed on TV. So many punch lines end with \"I couldn't give a s**t\" or \"b*****cks\", yes the script really is this witty, Elsewhere the usual interplay between Bob and Terry is allowed to flourish only infrequently, crammed into a plot which forces them both to act out of character through out. One really wonders what the writers were thinking of.","user":"son_of_cheese_messiah","rank":[9,12]}]