[{"title":"A gem that needs to be preserved and should be remembered","rating":8,"date":"13 April 2011","review":"Me and my partner were some of the few people fortunate enough to see this film as part of the Bird's Eye Film festival 2011 in London. The film isn't available to purchase on DVD with subtitles, so it is really just German speaking people who have access to it. This is a real shame as Rosa Luxemburg is a cinematic and historical gem.<br><br>Rosa Luxemburg is a true hero and a great thinker, who deserves a spotlight in the history of the early 20th century. Unfortunately she is too often forgotten and only the likes of Ernst and Marx are remembered. Here is someone who is really trying to change her fate and the fate of her sisters and brothers. All of this is beautifully brought to life by von Trotta in this film and many of Luxemburgs writings and speeches are used throughout. The performance by Barbara Sukowa as Rosa is amazing and she really merges with the character she portrays. I think this is a beautiful film and I would wish someone would give it a good makeover and preserve it for future generations. This is a film, which should not get lost - rather it should be remembered.<br><br>Unlike her male contemporaries, von Trotta's films are often hard to find and virtually unknown to most people - even those who have heard of her contemporaries like Schlöndorff, Fassbinder and Herzog. This is a mystery to me, as I have seen a number of her films and she manages time and time again to make raw, challenging and emotional films about history. At the end of the screening there was also an interview with von Trotta in which one could see her intelligence and passion for film. I am really looking forward to see her next film - a project on the philosopher Hannah Arendt.","user":"stamper","rank":[18,24]},{"title":"Von Trotta did justice to Rosa Luxemburg","rating":8,"date":"19 August 2010","review":"The lives of famous politicians are rarely the subject of a film, even though their decisions may have had a large influence on daily life, and in the case of wars even on death. Left-wing politicians are the favorites of film directors, not only because of their often interesting (creative and emotional) characters, but also in order to moderate and sometimes destroy the myth. Margarethe von Trotta has done justice to Rosa Luxemburg (1871-1919) in this film about her last twenty years. As a director she thank God refuses to take sides. Some knowledge concerning the historical backgrounds of the story will add to your enjoyment of the film. You might consider reading the friendly book \"Gedenksteen voor Rosa\" by the Flemish writer Achilles Mussche. Luxemburg was a legendary socialist leader with a revolutionary inclination. Just to give you a taste of the themes that await you: she recommends the political mass strike, an interesting idea which unfortunately can rarely be realized since the people themselves are the first victims. Although she originated from Poland, where she belonged to the upper middle class, she became a distinguished member of the powerful and massive German SPD workers-party. Later the Bolsheviks have presented her as one of their forerunners, but her ideas remain appreciated by social-democrats, since she never embraced dictatorship, and kept a critical distance towards Lenin. The film shows her life in the little biotope of all the contemporary party bosses and their families, among others Bebel, Kautsky, Karl Liebknecht, and Clara Zetkin, discussing society over a glass of good wine. Sometimes we see her association with the working class, during lectures and agitations. The film hints at her job as a productive journalist, and (being a versatile woman) her scientific ambitions. We get a taste of the puffed up ideological utopianism, which was so typical of a part of the intellectual middle-class social-democrats. Such extremist ideas blossomed naturally as a result of their permanent predicament of intimidation, persecution, imprisonment, and (for Luxemburg) exile, that was imposed by the corrupted state. unfulfilled personal ambitions are an additional cause. On the private level her intimate relationship with a Polish revolutionary is represented, as well as her final romance with a barely grown-up. In many ways her last final years lead to a climax. It was the period of the First World War, which in Germany had extreme consequences. During the war she was once again imprisoned for political reasons. Freedom has its limits even in capitalism. Then in 1918 after the defeat of Germany a proletarian revolution changed the empire into a republic. The socialist SPD played an eminent role in the upsurge, together with the left-wing secession USPD (a few years later they merged). Luxemburg (together with Liebknecht) had shifted to the extreme left-wing, into the sectarian Spartakus movement, with high ambitions. In word and deed she advocated that the social-democrats should cling to their newly conquered rule. In my opinion, and I am pretty knowledgeable on the subject, her plan would have created a civil war, which would have further aggravated the situation of the people. I would say that her final actions were highly questionable and perhaps irresponsible, however, some think otherwise, so judge for yourself. Anyway, she was freed, and in those first months of 1919 supported the armed resistance of workers, even when it continued after the successful proletarian revolution, mainly in Berlin. Finally she was arrested and shot on the spot by a Prussian Officer, together with Karl Liebknecht. On a higher level the social-democrat Noske, then minister in the social-democrat interim government, is commonly held accountable for these murders. The film gives an impressive overall description of the period, but you must appreciate the revolutionary atmosphere, caused by the persecutions and finally the horrid and superfluous war, otherwise the fierce dialogs and debates may deter you. Her premature death made her into a martyr, in the same league as Che Guevara. Like him, she must have been rather good-looking, more than the actress Barbara Sukowa, which also helps.","user":"eabakkum","rank":[11,14]},{"title":"Tough and uncompromising, like Rosa.","rating":9,"date":"23 November 1999","review":"\"Rosa Luxemburg\" is an inspiring and powerful portrait of Luxemburg, a Polish-German activist and Socialist/Communist who lived from 1872-1919. She was murdered during the unsuccessful Spartacist rebellion in Germany, right after Germany's defeat in World War I.<br><br>I don't know much about Luxemburg, but as the film portrays her, she was a very forceful, compassionate, and strident devotee of peace and justice for the working class.  She was a member of the Socialist Democratic Party in Germany, and she also spent some time in her native Poland.  Apparently she was also Jewish.  Her longtime lover and working companion was also a Socialist writer who was Polish.<br><br>\"Rosa Luxemburg\" follows many of the major events in Rosa's life.  We see her giving speeches, writing articles, and pressing the Socialist Democratic party elders for quicker movements toward \"revolution.\"  Ultimately, Rosa wanted an overthrow of the \"old order,\" meaning the monarchic/industrial/fascist forces, and direct control of the political system by the workers themselves.  She did not advocate violent means to do this, but nevertheless was painted as a dangerous radical and was thrown in jail nine times.<br><br>I enjoyed this film immensely and found it sad but extremely important. Viewers who enjoy this film might also check out \"The Burning Season,\" \"Entertaining Angels,\" and \"Daens.\"","user":"James B.","rank":[21,34]}]