[{"title":"On Earth, everyone can hear you yawn.","rating":4,"date":"12 January 2015","review":"They've got some nerve calling this film Alien 2: although certain elements have clearly been inspired by Ridley Scott's 1979 sci-fi horror classic, the film as a whole couldn't be more different<br><br>Want tense, claustrophobic, space-bound, futuristic action? Not a chance. Sulla Terra, the film's subtitle, translates as On Earth, meaning that the film takes place on (present day) Earth, and under its surface in an admittedly impressive looking cavern. Unfortunately, this means we get endless tedious footage of the characters wandering around the cave, the director so preoccupied by the wonderful rock formations that he forgets all about telling a coherent story, throwing in such random nonsense as a telepathic speleologist just for the hell of it.<br><br>Looking forward to seeing a cool alien creature? Sorry. This film's extraterrestrial starts off as a blue rock, turns into a red hand puppet in a moment that rips off Alien's chest-burster (although I admit that the face-burster scene is pretty cool), and finally becomes a mass of indistinguishable and very unconvincing tentacle thingies.<br><br>Expecting ground-breaking special effects? No dice. This is a low-budget Italian production, so all we get is some grainy stock footage for scenes involving a space mission returning to Earth, and some cheap gore. Thankfully, the latter is pretty juicy: the aforementioned face-burster sees the victim's eyeball pushed from its socket before the creature erupts; one of the cavers has his head chewed off, the severed noggin (complete with assorted giblets) falling onto the rocks below with a satisfying 'thud'; and another guy's head explodes to reveal thrashing tentacles.<br><br>What about a thrilling finalé? I don't think so! After a couple of encounters with the creature, the last pair of survivors emerge from the cave to discover that the planet is totally deserted, with the exception of the alien, which chases them around for a while, director Ciro Ippolito employing dreadful alien POV shots. Eventually, Ippolito becomes as bored with proceedings as his viewers undoubtedly are, abruptly ending his film with a caption warning the audience \"You may be next!\". It's a lousy way to wrap up a fairly dismal film which is barely worth enduring for the gore (and a bit of gratuitous topless nudity from star Belinda Mayne).","user":"BA_Harrison","rank":[11,12]},{"title":"Alien 2: Much mirth","rating":7,"date":"25 March 2014","review":"I'd heard bad things about this, like it was too slow, confusing, had too much potholing in it, but after finally watching this I feel the bad dubbing and general stupidity of the script (not to mention the great soundtrack by Oliver Onions) carried everything through. Sure, the ending was a bit of a let down, but still, where else do you have a guy explaining his wife's meltdown on live television as \"It's okay- she's just telepathic\".<br><br>A spaceship is due to land in the sea and while waiting for that, a TV show interviews a potholer on live television for some reason. She breaks down as she has a vision of sorts about something bad happening. When the spaceship lands, they find the pod empty, even though the astronauts reported that everything was okay. Meanwhile, our potholers go bowling for some reason, probably to introduce our characters. There's our telepathic lady, her boyfriend, another guy, yet another guy (dubbed by Nick Alexander), another guy played by Michele Soavi, a chick, and another chick (not dubbed by Nick Alexander.<br><br>As our bunch of victims prepare to go potholing, the telepathic spots a girl picking up a pulsating blue rock but is taken away by the boyfriend. Lucky for her, as the blue rock has torn off the face of the little girl! You know your watching an Italian film when a small kid is graphically mauled by an alien creature. Also, you know your watching an Italian film when Michele Soavi finds a similar blue rock on the ground while he's having a pee up against a building.<br><br>And now it's time for potholing! Our bunch of fuds head into the ground for a while, eventually settling down for the night so Michele Soavi can talk b*ll*cks about writing with candles. The next day, everyone rather stupidly splits up (and not for the last time), resulted in the blue rock bursting open, tearing a girls face off, and sending her down a ravine, where our numpties find her, face intact! After a long, long sequence getting this girl back up the ravine, one guy goes back up with her and we have the longest tracking shot in film history, as the camera pans from the guys shoes up the entire length of this girl's body (it takes ages). This pays off, however. You know how in alien they've got a chest burster? How about a face burster? You get that here as our alien makes an appearance, bursts out the girls face, and attacks the other guy causing his head to fall off onto the rest of our idiots.<br><br>From then on out it's alien (or aliens, it's quite confusing) versus potholers as they get lost in the dark, split up (again), and run around trying to find a way out – There's some gore, exploding heads, aliens bursting from bodies, people being killed and a bit of a psychic battle that's not even remotely explained. Needless to say a couple of people escape back to the world, which is strangely empty (save for one shot where there's people walking down the street and traffic and what not).<br><br>While strangely focusing on things ignored in other films (cars driving down the street for ages, bowling alleys, potholing) and kind of fizzling out towards the end there (although I loved the POV shot through the alien's mouth!), Alien 2 (which I'm sure is an official sequel) has enough extreme gore, bad dubbing and stupid characters to entertain a jaded Italian splatter fan. I will say that the soundtrack is great, as you would expect from Oliver Onions.","user":"Bezenby","rank":[7,8]},{"title":"The first hour is rough!","rating":3,"date":"14 July 2007","review":"The first hour of this film is so painfully slow that it took me over 10 years to finish it. I'm not kidding. I've had this on VHS since the mid-90s and every time I tried to watch it, I would give up. 1980 was a banner year for Italians doing ripoffs as the film world received ZOMBI 2 (aka ZOMBIE) and this \"sequel\" to ALIEN. Of course, the Italians wisely set it on earth, something the ALIEN series has been trying to do for almost 30 years now.<br><br>Three astronauts return to earth in a space capsule, but are all mysteriously missing when the device is recovered at sea. For some reason, this doesn't sit well with psychic Thelma (Belinda Mayne) but it doesn't prevent her from going spelunking with her friends. Along the way to the caves, Burt (Michele Soavi) picks up a curious looking rock which is actually an alien lifeform that spread over the desert upon the astronauts' re-entry. The group heads into the caves and, before you can scream THE DESCENT, find themselves getting bloodied up by our rock monster.<br><br>The last half hour or so is decent when the space monster finally attacks. Director Ciro Ippolito is someone whose work I am unfamiliar with. He certainly throws the gore around in parts but I can only imagine what a seasoned Italian exploiter would have done with this in the first hour. For some reason, Ippolito is intent on trying to make a bowling alley the scariest place on earth in the finale. He fails. The film does end on a grim note and the scenes of the lead actress running around a deserted San Diego, CA are pretty effective. The film concludes with the on screen line \"...you may be next!\" Gutterball.","user":"udar55","rank":[11,14]}]