[{"title":"\"Stupid punters. Telly all the week, screw the wife Saturday\"","rating":30,"date":"30 March 2006","review":"I've watched 'Villain' innumerable times since I taped it off a late night Channel 4 screening in 1999. Why? Because it's truly excellent.<br><br>Atmosphere, plot, quirky characterisations, violent action, dialogue, squalid sex - brother, it's got the lot. A far, far more interesting film than the same period's 'Get Carter'.<br><br>Scripted by venerable British comedy maestros Clement and Le Frenais from an initial novel adaptation by the simian faced American character actor Al Lettieri (and I'm sure there's an interesting story behind that process), 'Villain' is remarkably modern in its tone. We aren't presented with goodies or baddies, simply players of the never-ending game:<br><br>Vic Dakin (a darkly humorous Richard Burton) is the good old traditional mother-loving gay psychopath who enjoys slicing up informers with a cut-throat razor; <br><br>Wolfie Lissner (a superb Ian McShane, playing probably the most interesting character in the piece) is a survivor who'll do what ever it takes to survive, be it pimping unsuspecting lovelies to the elite, selling pills to late night ravers or taking the brunt of Dakin's sadisitic sexual urges;<br><br>Bob Matthews (a wry Nigel Davenport) is the disillusioned copper dedicated purely to bringing Daykin down - \"I don't want a fertile imagination, I don't want to know if society's to blame, I just want to catch criminals\".<br><br>And Gerald Draycott (an eternally eyebrow-cocking, seedily lecherous Donald Sinden) is a charmingly corrupt politician with a weakness for the kind of nubile young girls Wolfie supplies.<br><br>The script traces the intertwining fates of these characters after a bungled wages heist with terse, witty precision. Oddball subsidiary figures like Joss Ackland's ulcer-ridden crook (who gobbles pain-relieving hard boiled eggs during a getaway) and James Cossins' bitter, wife-hating clerk garnish the proceedings like tangily flavorous seasoning. The backdrop of grubby and grim seventies Britain is so well sketched that you can almost smell it. Jonathan Hodge's musical score is both percussively minimalist and hauntingly lyrical - very powerful. And its a rare triumph for the otherwise hack-like Michael Tuchner, who directs superlatively here with vigorous assurance.<br><br>Look out for stalwarts like Tony Selby, Tim Barlow and an uncredited Johnny Shannon ('Performance's Harry Flowers) as a copper coshing con.<br><br>\"Got a hard-oh, have ya? DRIVE!!\"","user":"LewisJForce","rank":[28,31]},{"title":"Villain. Better Than Get Carter Shock?!!","rating":9,"date":"3 September 2002","review":"Villain was one of those films I vaguely remember seeing as a youngster in the Seventies. An 'after News At Ten' film on my very first black and white portable, knowing that it was just the sort of film a ten year old should not be watching. What I always remembered was the powerful ending with Burton screaming into the camera 'Who are you looking at?' Catching up with the film in later years I found that it was the very atmosphere that made it so memorable. Always compared with Get Carter (another favourite) I found that Villain seemed to enjoy higher production values whilst still maintaining the seedy underbelly of Seventies London life. I have often read that this 'seedy' tag has proved to be a turn off for some reviewers, but if you read the excellent James Barlow novel that the film was adapted from, you would see that Villain, the actors and in particular, Burton are very faithful to the text. Vic Dakin is a terrifying monster and although the cockney accent does seem strange at first, repeat viewings reveal a truly compelling character study. OK, so he was supposed to be on two bottles of vodka a day back then, but by God does he look like a real hard bastard?! The use of the grim locations, the lavish but contemporary score, the supporting cast and the realism of such scenes as the powerful wages snatch (still bloody violent by today's standards!) and the final confrontation, all combine to make a totally compelling film. Personally, it is a real favourite and for anyone in their thirties, it is also a slice of Seventies social comment stuffed full of great British character turns and a tough, realistic gangster thriller. Criminally underrated, hard to find on video and no DVD as such. Try to catch it one night, just after News At Ten!","user":"allthecurrans","rank":[21,25]},{"title":"Underrated, violent London gangster film with almost comic overtones","rating":27,"date":"27 June 1999","review":"Perhaps a poor relation to \"Get Carter,\" (they were made around the same time as each other), this is nonetheless an underrated, interesting gangster film. Richard Burton is strangely cast as the violent East End villain, Vic Dakin. You can see that his character is obviously based on Ronnie Kray, and Burton has difficulty pulling off a cockney accent. He is often seen fumbling through his lines. With lots of London location filming and cockney banter, Americans will love this film. There is even a brilliant car chase during the violent wages snatch. Donald Sinden is brilliant as the sleazy, blackmailed MP who frequents high society sex parties. In this respect, the film is very satirical, the characters are stereotypical of an era where scandal amongst the English establishment and local \"businessmen\" was (and still is) rife.","user":"foz-3","rank":[16,19]}]