[{"title":"A Prince among films","rating":10,"date":"21 June 2004","review":"I had longed to see this film for years, having only seen b/w stills and brief clips. Finally, Glasgow Film Theatre got a new print in their Visconti retrospective in 2003, and it was certainly worth the wait!<br><br>'Il Gattopardo' is a marvellous film, a magnificently realised slice of 19C history presented through the lives of engaging but humanly fallible characters. Don Fabrizio, Prince of Salina, is a shrewd, benevolent man of 45, trying to navigate a passage for his family through the social and political turmoil of the Risorgimento in Sicily. (I was stunned that some reviewers thought there was too much discussion of politics in the film - it is essential to the story and its context!) Burt Lancaster gives surely his greatest performance as Don Fabrizio, coming to terms with the fact that he is among the last of a dying breed: born too late to dwell in an unchanging aristocratic world, but too early to adapt fully to the modern world, unlike his nephew Tancredi Falconeri (Alain Delon). As he tells the royal envoy from the mainland: \"We are the leopards, the lions; after us will come the jackals and hyenas\".<br><br>Tancredi embodies the best and worst of the rising generation: he is dashing and full of vitality, but he breaks the heart of his shy, sensitive cousin Concetta (Lucilla Morlacchi), and is just as fickle in his political loyalties - although this ensures he will survive in the new Italy. His engagement to Angelica Sedara (Claudia Cardinale), daughter of the nouveau-riche mayor, secures the family's future. Angelica is a fine example of how well the characters are drawn: no idealised romantic heroine, but a vital, beautiful girl with a vulgar streak. She laughs interminably and loudly at Tancredi's coarse jokes at the table - not how a 19C young lady was expected to behave: you sense the cringes this induces in the rest of the family, despite the fact she is 'a good catch' in material terms, and is basically good.<br><br>The other supporting characters are worth attention, delineated with affectionate humour: Angelica's social-climbing father; Princess Maria Stella (Rina Morelli), with her glum piety and fits of the vapours (one can easily believe her husband's quip, \"We have seven children, but I've never even seen her navel!\"); the family chaplain, Father Pirrone (Romolo Valli), with whom Don Fabrizio has amusing bouts of verbal sparring.<br><br>But it is as much the look of this film, besides the intelligent script and excellent characterisations, which makes it so special. The costumes are among the best I have ever seen in a 19C-set film. The landscape and architecture of Sicily are shown to tremendous effect: you can feel the heat, the dust. Dust? Yes - and that is one of the best things about the film: its physical realism. When the characters go on long carriage journeys, they get visibly dusty; their palaces have shabby, disused rooms and semi-derelict wings, as well as majolica floors; the all-night ball - a tour-de-force of colour and spectacle - results in a retiring-room full of used chamber-pots; the rural villages are as dilapidated as picturesque. Too many costume dramas present perpetually well-groomed characters in immaculate environments, no dirt or untidiness: 'Il Gattopardo' does not.<br><br>The film ends with Don Fabrizio walking home after the ball, having come to terms with his mortality and seen the younger generation preparing to take centre stage. If you want to meet him again in his final years, and see what becomes of Concetta and Angelica as the 20C dawns, then read Giuseppe Tomasi di Lampedusa's original novel, of which this exquisite film is a faithful and sensitive adaptation.<br><br>And to see the characters now? About the same time I first saw this film, I got a picture-book of the mummies of Palermo: fragile parchment-skin and bone in fraying 18-19C finery. The same sense of the transience of beauty, of change and mortality, pervades the mummies and the film alike: one auburn-haired youth even resembles Francesco Paolo, the Salinas' young son. \"Dust and ashes!\" writes Browning; \"Mais où sont les neiges d'antan?\" says Villon. But thanks to Visconti's masterpiece, we can still see 'the snows of last year' at the point of their dissolution.","user":"DrMMGilchrist","rank":[119,136]},{"title":"A extraordinary masterpiece: see the UNCUT version.","rating":1,"date":"1 February 2000","review":"If you ever have the chance to see this magnificent film in an uncut, fully restored version, with good subtitles...DO IT. This is a film of astonishing beauty, bristling with ideas and magnificent performances.Like all truly great films it is full of sublime SCENES: Prince Tancredi riding off to war in his carriage., the astonishing ball sequence, when Prince Salina gazes at the painting and comes to grips with his own mortality,and the unforgettable end, when Salina kneels on the ground and speaks to the stars.Coppola, Cimino, and Scorsese all saw this film and learned from it..the Godfather echoes it repeatedly( in fact all THREE Godfathers echo it repeatedly). Scorsese once ranked it with The Red Shoes, Citizen Kane, Otto e Mezzo and The Searchers as one of the films he \"lives by.\" Seeing it, one understands.","user":"coop-16","rank":[82,103]},{"title":"Portrait of powerful yet reflective man, who doesn't abuse his power","rating":10,"date":"13 September 2000","review":"This beautiful film, which I saw some time ago, remains in my memory as a profound study of a man in a position of power who thinks, reflects on important values, as well as his own aging process...and yet the film is never static.  Burt Lancaster gave a brilliant performance...which I read was his favorite role.  Visually, it is stunning.  The long dance scene with Claudia Cardinale is justifiably famous...one of the sexiest scenes on film, in my opinion.  To anyone interested in serious concerns, cinematically expressed with grace and intelligence, I would urge you to see this splendid film.","user":"Peegee-3","rank":[70,89]}]