[{"title":"Turned Me Into a Pacifist","rating":10,"date":"2 May 2005","review":"I became an instant pacifist when I saw this movie at the age of 16. Prior to this, I had been a supporter of the war in Vietnam, and had fully intended to enlist when I was old enough. My father, a veteran of WW2 and Korea, took me to see this movie when it was first released, to help cure me of my delusion about the glory of war. He was very successful in that undertaking. While I haven't seen the movie in 34 years, I cannot deny it had a major influence on my life. I'll never forget the horror I felt in seeing that poor soldier trapped in his mind. I would strongly recommend telling anyone who is pro-war to see this movie. You may help turn on others to the horrors of war.","user":"jdadmun","rank":[213,245]},{"title":"Maybe the most effective movie I've ever seen","rating":10,"date":"13 July 2007","review":"Let me say that I would NOT recommend this to anyone lightly. I feel quite confident saying that there are very few people I know who I think should see it.<br><br>It's all about the horror of war. The setting is WWI and involves a very young man, boy really, who has no appendages because of a grenade. The rest of the moving cuts between his horrific vegetative physical state with voice-overs of his thoughts and flashbacks to his rather limited life experiences and a few fantasies or inner monologues.<br><br>This was really a soul-shattering movie in a lot of ways. After watching it I couldn't get it out of my head for hours after hours. I couldn't' get to sleep until mid way through the next day. It is just relentlessly brutal in giving detail of true internal psychological torture, seeing a wasted life sacrificed.<br><br>I didn't read the book, which I've been told is even more dramatic than the film. I honestly can't imagine that. I don't think I could read the book. Parts of it make me think of \"All Quiet on the Western Front\" but in far more isolated ways. There's no glory here.<br><br>Donald Sutherland's Christ is a fascinating character and compelling. Joe's flashbacks are all meaningful and relate to the \"big questions\" he's trying to sort out that only seem to provide answer that torture him even more. The scene with his girlfriend early in the movie when the old man says \"don't make a whore out of her\" is profound in its delivery.<br><br>It is fairly artistic in a very dark sense. It's too heavy for some people. They will claim it was boring but that is only for those who have no understanding of the weight of the matters because it doesn't involve them. Make no mistake, this sort of thing goes on every day as there are wars every day.<br><br>I'm all about defending and fighting for personal rights, but if this movie were shown in every public school in the world there would be far fewer people willing to fight for the causes of others and the promise of a few more dollars.<br><br>I've never seen a movie that moved me so much but in such a sad way. It was perfect in its execution, but then again some lessons are better left unlearned.","user":"sideburnmikeguitar","rank":[77,87]},{"title":"when the script takes the movie up there.","rating":8,"date":"2 August 2005","review":"I saw this movie on public Greek TV (original version with subtitles), and was glued to the screen until the very end. I would say that it develops in three modes. One is the horrible black and white present, one is the colorful past (memory) and one is the surreal world of Johnny's dreams where he is conscious of his injury! I haven't understood how the scenes with his father in the past add up to the movie very well. The acting isn't superb and some lines could have been different. The black and white cinematography is very convincing and the scenes with the last nurse are tremendous! Aside from the downsides of war which are evident, the movie also deals with how the system is willing to suppress its own fabricated heroes when they fall short of its ideology. One of the best Hollywood movies ever made, chiefly due to its powerful script. 8/10","user":"aristofanis","rank":[44,49]}]