[{"title":"Splendor in the Grace","rating":19,"date":"19 March 1999","review":"\"Hawaii,\" based on about one-third of the Michener novel, is one of those big, old-fashioned epics, full of wistful vistas, compelling performances, and casts of thousands.<br><br>Julie Andrews' acting abilities shine as bright as the tropical sun in this story of a New England woman who accompanies her stodgy husband to the islands on a mission to convert the heathens. Andrews' buoyant on-screen persona is held in check here (as it is in the overly criticized \"Darling Lili\"), making her Jerusha a quiet heroine. Her childbirth scene is effective for the visceral reaction it creates, and she's got one whopping good speech toward the end, where she finally gives her stick-in-the-mud hubby what-for.<br><br>Von Sydow, who would work with Andrews again later in \"Duet for One,\" is all bluster and bellowing, condemning just about everyone he comes in contact with. I find the performance rather one-note; however, the opening scenes in which Hale tries to woo the lovely Jerusha are sweetly awkward.<br><br>Richard Harris shows up as a long-lost sea captain in one of moviedom's most impossible coincidences. Harris is all fire and passion, exactly the kind of third-party that a juicy love triangle needs.<br><br>George Roy Hill's direction keeps things moving at a brisk pace, despite the lengthy running time. He had a gorgeous palette to paint with, and he takes full advantage. The sea trek--complete with storms--suffers from some very obvious blue-screening, but Hill manages to build an appropriate sense of excitement.<br><br>I'm also going to carp with costumer Dorothy Jeakins. Andrews costumes are lovely (but consider what Jeakins had to work with), but Von Sydow goes running throughout the movie with his stove-pipe hat cemented onto his head. Works okay for the New England settings, but once the cast hits the beach, he ends up looking like some kind of absurd Dr. Doolittle (Hugh Lofting's, creation, not Eddie Murphy's).<br><br>Jeakins also makes a very brief appearance (her role was trimmed mightily) as Hale's mother.<br><br>While on the subject of the supporting players, LaGarde had no acting experience whatsoever (and, hence, drove the production schedule and budget way off base), but she's utterly charming. She more than earned her Oscar nomination.<br><br>Funny to see a pre-Archie Carroll O'Connor in the New England sequences. Also watch for Heather Menzies as one of Jerusha's younger sisters. Two years earlier, she had played Louisa von Trapp to Andrews' Maria. Gene Hackman's here, too, as a put-upon doctor.<br><br>One last note: If you're going to seek out this treasure, please, please, please opt for the widescreen version. The rocking of the boat sickened many of the passengers on their way to paradise, and likewise, the pan-and-scan version will sicken viewers of this terrific epic.","user":"dweck","rank":[22,25]},{"title":"Where Is The Rest......","rating":6,"date":"6 April 2003","review":"After seeing the movie on cable a few months ago, I decided to read the book.  <br><br>The movie is only about one-fifth of the whole book.  Too bad.  The movie leaves a lot of unresolved plot threads which are resolved later in the book.  Subplots which seem inconsequential turn out to have major implications to the plot of the novel.  Minor characters from the movie become more important as the story progresses.  For example, Gene Hackman's Dr. John Whipple and Richard Harris' Raefer Hoxworth have only a few scenes in Hawaii, but their characters are perhaps the two most important characters in the book.  Whipple and Hoxworth are the ones who challenge the authority of the missionaries and, in a sense, are the true foils to Abner Hale.  They also are the ones who go into business.  <br><br>As a result, the movie, standing by itself, tends to introduce characters and subplots with no relevancy to the main Abner-Jerusha-Malama-Keolo story line.  Perhaps a sequel was planned?  In short, Hawaii would have worked better as a mini-series.<br><br>\n********************* How the Novel Ends:<br><br>Abner Hale's son, Micah, who was last seen getting a boat to the mainland to attend Yale University, becomes a minister like his father.  The sea captain, Raefer Hoxworth, marries Noelini, the daughter of the Alii Nui. Micah then meets and falls in love with Raefer's and Noelini's daughter. They get married.  Abner Hale scorns Micha; claiming the Micah has gone \"whoring with the heathens.\"  Micah quits the ministry and becomes a partner in Raefer Hoxworth's shipping company - now called Hoxworth and Hale.<br><br>John Whipple and Retire Janders (the captain of the ship that brought the missionaries to Hawaii) are partners in Janders &amp; Whipple.  Initially a trading company, general store, and ship chandler, they start acquiring land and growing sugar.  J&amp;W eventually becomes a plantation company and needs cheap labor to work their fields.  John Whipple imports Chinese workers. <br><br>\nA generation after the movie ends, the descendants of Hale, Whipple, Janders, Hewlett (the man who was kicked out of the church for marrying a Hawaiian woman) and the Hoxworth are the commercial, social, and political elite of Hawaii.  Micah Hale leads the movement to have the United States annex Hawaii and serves as the first governor of the Territory of Hawaii.<br><br>The descendants of these families continue to build their businsses and develop the islands.  In an ironic twist, the families, refusing to marry Hawaiians or Chinese, intermarry.  Eventually cousins marry cousins - the very practices Abner Hale condemned from his puplit.  You eventually get characters named: Whipple Hoxworth; Hoxworth Hale; Hewlett Janders; Bromley Hoxworth.  <br><br>Finally, at the end of the novel the rich, post-WW II descendants of the missionaries talk about their \"distinguished ancestors.\"  Their descriptions and interpretation of events, differs from what it portrayed in the earlier chapters.","user":"tmsindc-2","rank":[28,33]},{"title":"What do Hawaii and Poland have in common?","rating":7,"date":"18 June 2006","review":"From the day Captain Cook arrived on those beautiful islands, Hawaii like Poland was cursed because of geography. Poland situated between two gigantic European powers just became a pawn in the eternal military and diplomatic chess game.<br><br>Hawaii located where it is between North America and the Orient, when sea travel improved it was only a matter of time before the big powers came a-callin'. And they came from both directions. Not shown in the time frame this film covers, but soon after, waves of Japanese and Chinese immigrants landed on the shore. Hawaii was coveted by all and America got it.<br><br>Max Von Sydow plays a young New England minister out to bring the gospel to the heathen as he sees them and has been taught to see them. His church won't send him out to the south seas without a wife, lest he be tempted by sins of the flesh, so on a short acquaintance he marries Julie Andrews. She in turn has been home pining away for whaling captain Richard Harris. When Von Sydow and Andrews get to Hawaii over the course of their story Harris would reappear.<br><br>Naturally its quite a culture shock for the New Englanders when they get to Hawaii. The film's story covers about a quarter of a century of Hawaiian history and the history of the changing attitudes of Andrews and Von Sydow. <br><br>James Michener's original novel was of War and Peace duration and I suppose the final script was as best they could get it and cover what he was trying to convey. Despite the obvious racist feelings that Von Sydow has, he's a basically decent man who does do some positive good.<br><br>His problem is that everything with him has to be filtered through the Bible. There's a lot of incest going on in Hawaii when he lands there. Reason being is that these are islands with a limited number of mating partners. Now incest is bad as we know because it does eventually weaken the gene pool. But Von Sydow hardly takes a scientific approach, how could he, he doesn't know it, he hasn't been taught it.<br><br>Julie Andrews is a far cry from the perky Mary Poppins. She develops quite an attachment to Hawaii and its people and her approach with them is fundamentally different than her husband's. It's not a bad performance.<br><br>Richard Harris is the lusty whaling captain of Andrews previous affections. I tend to think his part might have been edited down. In a recent biography of Harris, it was stated he and Andrews did not get along at all on the set. Harris in those days was a whole lot like the characters he played like this one in Hawaii.<br><br>Of course when you've got Hawaii as a subject for a camera, the photography could not be anything but gorgeous.<br><br>Hawaii covers a period not well known to most Americans except Hawaiians. And indeed they are Americans and have been since 1959. I think people could learn something from this film even with the script flaws.","user":"bkoganbing","rank":[29,37]}]