[{"title":"A Golden Ending","rating":8,"date":"26 August 2008","review":"For the first 102 minutes, I saw this film much as MATTHEWSCOTT8: a pleasant movie that was charming and colorful, but otherwise ordinary. The final minute, however, is transcendent and elevates the entire work to something else. (The only other example of this I can think of is John Huston's \"The Dead\" where the final voice over forces you to reevaluate everything that have come before in a new light).<br><br>Here is one interpretation of the the events of the last minute and their meaning:A player steps to the edge of the stage, beyond the curtain. He reveals the cosmological structure of this play within a play within a film. The first play is the \"real world\" where ordinary events occur and characters interact. Most pursue some narrow selfish objective, but on rare occasions one overcomes their greed and achieves a degree of liberation and fulfillment (in this case Camilla).<br><br>The second play is the stage on which the our narrator stands; a kind of Bardo between the fist play and our audience. The audience is a sea of human souls - all those who have passed away as their personal play has ended.<br><br>The narrator tells us that Camilla is missing. In the background we see her pale ghostly image as she bids farewell to remaining cast members.<br><br>The narrator then gives us his philosophy of life, \"Don't waste your time on the so called real life. You belong to us\"...\" the only way to find happiness is on any stage\"... \"during those two little hours when you become another person; your true self.\" Thus, even a fairly standard story offers the potential to transcend our plight and experience something eternal. Renoir is describing the essence of pure eastern mysticism, here in a deeply western European context.<br><br>\"Filipe, Ramon and the Viscount have disappeared. Gone.\" says Camilla, \"Don't they exist anymore?\".<br><br>\"Now they are part of the audience. Do you miss them ?\" asks our narrator.<br><br>Overall, this ending is so quick and unexpected that is feels like a rabbit punch to awaken the spirit. We are left, like Camilla, to contemplate the play, the nature of all plays and our own existence.","user":"rserrano","rank":[14,14]},{"title":"A masterpiece of universal truths","rating":10,"date":"22 March 2008","review":"I saw the Italian version in Bologna in 2006, and have just seen the American DVD. The latter seems to be missing some footage at the end, does anyone know? I seemed to remember a more elegant ending, when Anna Magnani steps back on stage. <br><br>The genius of this moment is that it is in fact the stage that is the real world, and all that she has been participating in with the three men she has dallied with is the illusion. I take this as a metaphor for the play of creation as described in the Bhagavad-Gita, Chapter 2, when Krishna says to Arjuna, \"Be without the three gunas.\" So Camilla has come to understand this, has given up her attachment to material things, symbolized by the coach, and even to the whole rigmarole of worldly life, and goes back to her true essence, which is to be the witness to all this churning activity. By stepping out onto the proscenium, leaving all the muddle of the gunas behind, she becomes enlightened and can continue as she chooses, playing other roles if she likes, but with the knowledge she has gained in this past existence.","user":"farmhouse41","rank":[13,13]},{"title":"Namesake of François Truffaut's film company","rating":10,"date":"25 February 2005","review":"This film is really a masterpiece. This was also French director François Truffaut's opinion, and he named his film company \"Les Films du Carrosse\" as a tribute to it. I once read a review in which the critic expressed the opinion that Anna Magnani's looks couldn't make it likely that the male characters of the plot fell in love with her. But this is a complete misunderstanding of the story, it is not because of her beauty they love her, but because she makes them laugh, she brings them to that other world which theater creates. For aren't we all made of the same stuff dreams are made of, as the great Will once wrote?... If you haven't seen this film, don't wait if you get a chance to watch it. In France, where I live, it's not available in DVD yet, but since it recently came out in the US, and in Japan, I am looking forward to soon finding it here.","user":"citykid","rank":[28,31]}]