[{"title":"Don't believe the hype!","rating":18,"date":"18 August 2000","review":"I saw \"Comin' At Ya!\" when it was released in 1981. Remembering that it was highly entertaining, if cheesy, I happily threw down my 14 bucks for the DVD re-release. If you're thinking about buying it, three words: Don't do it.<br><br>Rhino has converted the film to the red/blue 3D process (as opposed to the polarization process--if you've seen the 3D movies at Disneyland or Universal Studios, you know what I mean), and the results are horrible. Not only does the 3D not work, the red and blue lenses ruin the color (red/blue 3D is better suited to black and white movies or monochromatic comic books). I gave up the glasses after ten minutes, muted the colors on my TV, and fast-forwarded to the fight scenes. It wasn't even worth the 14 dollars I paid for the DVD, and I'm taking it back.<br><br>I'm very disappointed with Rhino for even releasing the DVD with the shoddy 3D. It's as if someone said, \"Yeah, the 3D doesn't work, but who cares? They'll buy it for the gimmick.\" If you absolutely must see it again, rent it or con a friend into buying it. Because it is absolutely not worth the money.<br><br>As for the movie itself--c'mon, rubber bats on wires; flaming arrows; spears bouncing along on half-taut wires as they come \"right at you\"? That's what 3D was made for. The director uses every excuse to throw things at the camera, and then some. Most of them defy logic. But it might make a good party game to predict what object on screen is going to come at you next.<br><br>\"Comin' At Ya!\" is pure 3D cheese, and I loved it. Just don't expect good 3D.","user":"Curtis G.","rank":[13,15]},{"title":"A Fistful Of \"Wo-o-o-o-oa-hhhhhhhhh\"","rating":11,"date":"11 May 2006","review":"By 1981, the heyday of the Spaghetti Western was over..that golden era finished..played out...&amp; pretty much left for dead. A few interesting stragglers trickled out...\"Mannaja\" in '77..Lucio Fulci delivered \"Silver Saddle\" in '78.. &amp; Michele Lupo's \"Buddy Goes West\" in '81. The previously bustling sets in Almeria &amp; other Spanish locations were abandoned...&amp; allowed to fall into disrepair. Director Ferdinando Baldi &amp; Producer/Actor Tony Anthony, who ten years earlier had collaborated on adapting &amp; bringing the blind swordsman \"Zatoichi\" to the Spaghetti West..resulting in the entertaining ........\"Blindman\",.............decided to do it again.......... filming a loose remake of Blindman in Spain.<br><br>Producer Tony Anthony decided to film it in 3-D...to give it life... to make it stand out...&amp; that's precisely what it did. Originally called YENDO HACIA TI (GOING TOWARDS YOU) ,... Filmways picked up the film for North American distribution, re-named it COMIN' AT YA! ...it wound up making a bundle at the box office...grossing $12,000,000 in the USA...becoming the 23rd highest grossing Western ever among all post 1980-present Westerns... &amp; sparking a modest 3D revival.<br><br>Anthony stars as H.H. Hart...who's not given any backstory but I'd project him as a former gunslinger. His wife, Abilene, is played by the gorgeous Victoria (TIE ME UP! TIE ME DOWN!) Abril. Gene (TREASURE OF THE FOUR CROWNS) Quintano plays the sleazy leader of the bad guys, Pike...unfortunately he plays it badly, in a terrible performance.. Quintano also had a hand in the script. Pike's fat, disgusting brother, Polk, is played by Ricardo (ARK OF THE SUN GOD) Palacios.<br><br>After an opening credits sequence in which beans spill all over the camera, bullets fire at the audience, a snake slithers out of a basket.., and hands reach out for the viewer's face... this recycled, slightly fiddled &amp; diddled with clone of \"Blindman\"....... ....gets going as Hart embarks on a rescue mission after his wife is kidnapped, he lies shot &amp; left for dead......the priest shot &amp; killed... by the Thompson brothers (Gene Quintano, Ricardo Palacios)...in the little border chapel...as they exchange their vows...anticipating and influencing the chapel massacre in \"Kill Bill\". <br><br>We discover that the Thompsons &amp; their gang have been kidnapping women all over the territory in order to sell them to Mexican brothels... taking them all down to Mexico to be sold to the highest bidder. Hart follows, carrying a pump shotgun , blasting his way through the bad guys, getting beaten up several times (an Anthony trademark...he always gets pummeled a lot). After capturing one of the brothers and giving him a beating. ..he then tracks down the other brother/rest of the gang, hoping to release the captive women...&amp; save his wife. Release...escape..recapture..&amp; murder ensue.<br><br>As Hart continues on his quest, we're treated to guys falling downstairs (in slooooow motion), spinning fiery pinwheels (for the five minute recap at the end), an attack of bats, spiders, scurrying (and hungry) rats, flaming arrows (the best part...&amp; the 3D works), and even a baby's bare bottom.<br><br>As the gang kills time in a windswept ghost town waiting for Hart to show up ...it's an excuse for more gimmicks....yo-yos...paddleballs... playing cards flipped at you....as Hart, despite being greatly outnumbered... rides into town to save his wife....&amp; exact his revenge. The explosive finale works well in 3D...or maybe I was just sufficiently cross eyed by that time. <br><br>The old, abandoned, crumbling, delapidated sets work well.......conveying an air of desolation &amp; desperation.<br><br>Carlo Savina scored a lot of Spaghetti Westerns...all low budget \"B\" stuff. Here he contributes a spare, elegiac score......using ambient voices pleasingly. His best moments are during a 5 minute replay of its best 3D moments after the movie.....which I'm guessing was probably the original opening credits title tune.<br><br>I've always liked Anthony...although he never achieved the status of a Nero, Eastwood or a Garko ... he always gave a good performance...was one of the most likable SW \"heroes\"..as well as being a talented writer &amp; producer.....&amp; Baldi...never accorded the reverence of a Leone, a Corbucci.. always delivered the goods.......never afraid to take chances.<br><br>When presented in the theater...........viewers used polarized (gray lenses) to gain the 3-D experience. The DVD utilizes Anaglyph 3-D, centering around the wearing of glasses with red and blue lenses...to effect the illusion of depth. It's best to view the movie in a fully darkened room with the red lens over the right eye...as it appears to be Reverse Anaglyph. The close, foreground shots don't work too well...........the foreground objects that are supposed to loom out at you are always breaking up &amp; tend to produce a \"ghosting\" effect, which ruins the overall illusion. ..The 3-D actually works best............producing pretty good depth effects, in the regular shots...the medium &amp; background shots.<br><br>Could it stand on its own...w/out the 3d...something to be watched &amp; watched again? No. The story...pretty much paint by numbers, point a--&gt; point b--&gt; point c.............doesn't warrant repeated viewings. That being said...I'll watch it again........not for the story..but for the 3D.<br><br>In 1983...Baldi &amp; Anthony collaborated on another 3D movie..\"Treasure of the Four Crowns \"....which marked the final on-screen performance by Tony Anthony, though he continued working for a time as a television producer. From his experience working on the 3D film techniques for this movie, Tony Anthony now manufactures specialized lenses for the medical industry.<br><br>Grab some buttered popcorn......a Giant Coca-Cola...an x-large box of Junior Mints...&amp; check it out.","user":"boardwalk_angel","rank":[7,9]},{"title":"Good stuff","rating":6,"date":"18 November 1999","review":"The DVD edition in 3D, widescreen 2:35 and dolby surround is a must and gives credit to this good western.<br><br>A so-so screenplay with a hero exploring his dark side while he seeks revenge...but describing a bunch of helpless women screaming at the view of some poorly animated bats. A bit macho stuff, but quite professionally handled.<br><br>The essential is in the cinematography : not much dialogue but everything is on the screen, the images speak for themselves. They don't need dialogue to explain what's going on. In that way, Ferdinando BALDI is a great director: not many are capable of this.<br><br>As for the 3D, some actions are quite powerful (the explosions, the fire...) some others especially shot for the 3D experience then not necessary.<br><br> Victoria ABRIL brings a feminine touch which was really needed.<br><br>But a good entertainment indeed.","user":"Superwonderscope","rank":[4,5]}]