[{"title":"Great Movie","rating":8,"date":"16 August 2006","review":"Don Ameche plays a wonderful portrayal of an Italian Shoe repair man thrown into a world of mobsters. Somehow this has very little effect on his spirit or mood, and at the same time driving his caretaker(Joe Mantegna)absolutely insane. By the end of it's whirlwind tour you realize that the old man is very wise in taking it all in stride.It's especially good if you are a fan of Mafia movies like The Godfather and such because it shows a lot of really typical mob types to keep you interested.<br><br>This movie is a very laid back comedy that would entertain people from many different walks of life. I just told someone the other day that it's the best movie I know of that no one has heard of. If you get a chance see it!","user":"luisfam","rank":[15,19]},{"title":"Great Entertainment","rating":7,"date":"11 January 2001","review":"I loved this picture. Mantegna and Ameche are so opposite and I really can't share the view of other people that Ameche is performing a \"Being There.\" Ameche is much smarter, he realizes from the start something is wrong. First he declines the offer but he knows perfectly well these people will shoot him (remember the scene with the smoking lady). Then, the movie starts, and he's in charge, and he keeps in charge, he accepts a luncheon with a Don in LA., he finds money to get back to Chicago, he uses his coin to call the Las Vegas mob.<br><br>Nice, entertaining, two and a half stars. I laughed quite a bit. Must be my Italian roots.","user":"Joyce Hauchart","rank":[10,12]},{"title":"Mamet's playwriting skills lift up the film","rating":7,"date":"11 August 2005","review":"Mamet is intrinsically the classical playwright. Things may change in life but the classical playwright begins the story with a shoe shine setting up his corner in the cobbler's shop and ends the story with a shoe shine. Even the mid-point of the film, when the 3 day dream is about to end, there is the short lecture on how to shine shoes.<br><br>Though all the actors provide commendable performances, the flow of the story is absorbing. There is a layer of human values and honesty that permeates the world of murders and mafia thugs. Mamet is able to use such contradictions to great effect--threats stated with considerable politeness, women who are apparently in charge (the woman overseeing the arrangements for the meal at the house, the mafia wife/moll in blue) and yet play no significant role, teasing the viewer as it were, use of hats and newspapers to cover faces that seem ridiculous as the story unfolds..<br><br>The epilogue makes you wonder if things do change. Change for one may not be change for another. Change for one may come in economic terms, for another in friendship.<br><br>Early Mamet's work seems to neglect women characters. I wonder why this is so evident.","user":"JuguAbraham","rank":[9,11]}]