[{"title":"An intriguing and highly evocative film that defies easy categorization","rating":9,"date":"19 February 2001","review":"Although the story could have easily been adapted into a gritty film noir, director Frank Borzage turns it into a dreamlike, and even romantic, saga of guilt and expiation. The plot is simple and uncomplicated. No cynical, wisecracking dialogue; no hard-boiled detectives or double-crossing femme fatales. The small town setting with frequent rural scenes creates a world far removed from the unusual noir cityscape. The love story unfolds with both strong sexual attraction and delicacy. Imbued with a strong atmosphere and vision all its own, MOONRISE resists easy classification. Like THE NIGHT OF THE HUNTER, it succeeds in creating a drama of mythic resonance in an American rural setting.","user":"gross-6","rank":[50,54]},{"title":"Southern Gothic Noir about the persistence of hate andthis is Borzagethe redemptive power of love","rating":8,"date":"17 July 2006","review":"Of all the directors who made both silent and sound films, Frank Borzage may have been the most successful at carrying over the silent style: he never abandoned his sublime romanticism, and he continued to tell stories visually. Moonrise is not just beautifully filmed, not just atmospheric, it actually uses imagery with the expressive and communicative power I associate with late silent movies. A hand pursues a fly across a tablecloth as a sheriff questions a suspect; a knife whittles a stick almost to the breaking point; goldfish swim in a bowl behind the head of a man who feels trapped in a conversation. Such obvious symbolism may sound hokey, but Borzage knows how to use it to create a heightened, evocative film that makes us feel we are inside the characters' heads. Other Borzage talkies that I've seen have been flawed, and I thought his style didn't translate very well from the silent era, but despite several over-the-top moments, everything in Moonrise works. The love story is as touching and convincing as those in his great silents, and even the comedy relief from a jive-talking soda jerk and an ancient Civil War vet succeeds.<br><br>The movie opens with an expressionistic sequence, using only shadows and striking visual details, that lays out the story's premise: a man is hanged for murder, and his son is tormented and bullied throughout his childhood because of his \"shameful\" parentage. Danny Hawkins (Dane Clark) grows into a tortured adult, lonely and gentle, but also prey to uncontrollable rage and the fear that his \"bad blood\" destines him to repeat his father's crime. The first scene, set at an outdoor dance held near the swamps, introduces a nasty Southern small town community in which young people laughingly taunt a retarded deaf-mute. Danny gets in a fight in the woods with his lifelong nemesis, and in an ambiguous combination of self-defense and revenge, crushes his skull with a rock. The remainder of the film follows the gradual unraveling of this crime, and Danny's growing relationship with Gilly Johnson (Gail Russell), a beautiful and civilized schoolteacher who is initially put off by, then irresistibly drawn to, this rough and troubled man.<br><br>Dane Clark never quite made it out of the B-list, but in Moonrise he got the role of a lifetime, and no one could have played it better. He has a fist-clenched fighter's stance and dark wounded-animal eyes, a rugged face softened by long, thick eyelashes, and a deep, husky, sorrowful voice. Though we identify with him completely, Danny often behaves irrationally and badly; in one wrenching scene, he nearly strangles the deaf man he has always protected, and is horrified at himself. Gail Russell, an actress famously crippled by stage-fright and dependent on alcohol, makes the loveliest of Noir's \"good angels,\" her dark beauty lit by an intense, melancholy stillness. In the latter part of the film she looks like a heavenly messenger of mercy in her white trench coat, but she is also a believable and fully-rounded character, especially charming in the exquisite scene where the lovers meet in a derelict plantation mansion. Gilly pretends they are attending an old Southern soiree, and they waltz without music in the dark, cobwebbed parlor.<br><br>Danny's only friend is Mose, one of those saintly African American characters who often turn up in films of the forties. Rex Ingram's strong performance transcends stereotype; though all-wise, he is also a lonely, somewhat embittered character, who says he has \"resigned from the human race,\" and who addresses his hunting dogs as \"Mister,\" because, \"There's not enough dignity in the world.\" Harry Morgan is flawless in the mute role of another outcast, the retarded man who looks up to Danny. And Lloyd Bridges, though he is only on screen for about five minutes, makes an indelible addition to his collection of loathsome, cowardly bullies.<br><br>Did Borzage ever make a film that wasn't about the redemptive power of love? If so, I haven't seen it. But Moonrise is also about the persistence of hate and the way people can be robbed of their humanity by degrading treatment. It demonstrates as well as any film Borzage's two great gifts: his expressive and dynamic visual sense, and his ability to draw intensely heartfelt performances from his actors. In a love scene shot in silhouette against lace-curtained windows, Borzage proves that the transcendent romanticism of the silent screen isn't incompatible with sound. And with help from Dane Clark, he creates a portrait of a mind haunted by the past and at war with itself, the essential Noir predicament.","user":"imogensara_smith","rank":[33,36]},{"title":"Borzage's last great masterpiece","rating":15,"date":"15 November 2002","review":"\"Moonrise\" is director Frank Borzage's most astonishingly beautiful films; his best known work, his last great film, and yet it is also very atypical of his work. The story is film noirish and deliberately departs from the kind of soft-focus, tender love stories Borzage specialized in (e.g. \"Man's Castle\", \"Little Man,What Now?\"). As some critics have pointed out, the film's formal, experimental blend of neo-Expressionism and rural lyricism anticipates Charles Laughton's \"The Night of the Hunter\", but unlike Laughton's film, \"Moonrise\" strangely retains Borzage's sense of romanticism and transcendence. \"Moonrise\" concerns Danny Hawkins (Dane Clark), the son of a convicted murderer, who unexpectedly kills one of his tormenters (Lloyd Bridges). Not wanting to relive his father's fate, he has to confront the consequences of his crime as he is chased by the authority. He flees from the police and falls in love with Gilly Johnson (the beautiful Gail Russell) and their love both relieves and transcends the problems that are keeping them apart.","user":"Kalaman","rank":[37,43]}]