[{"title":"Excellent Wartime Comedy","rating":24,"date":"24 December 2001","review":"I have seen only a few of the Abbott and Costello films, and find in most of them that the films themselves are but an excuse for them to do their (hilarious) routines, with some uninteresting story added in for padding. Since they made no bones about this, and it generally worked, because they did not disguise it (unlike Laurel and Hardy).  With many of A&amp;C's pictures, their scenes are always great.  I find their TV show to be the purest representation of their humor. BUCK PRIVATES must surely rank not only as the best Abbott and Costello movie, but also as one of the best comedy films of all time.  On top of this, it is like an 84-minute slice of American history.  The romantic sub-plot in this film is very relevant to audiences of the day and is not trivial or silly (like those in the films of the Marx Bros. and Laurel and Hardy).  Lou Costello is hilarious as ever here. Abbott is in full form too. The supporting cast is perfect, especially Nat Pendleton, not to mention a brilliant series of music numbers by the great Andrews Sisters. Their main number, \"Boogie Woogie Bugle Boy,\" is truly a historical moment, and it's a great performance to boot.  It's easy to see how this was the most popular comedy of it's day. All in all, I was very impressed by this film.  I hope it gets shown more often on TV so new audiences can enjoy this rousing and hilarious movie.","user":"CHARLIE-89","rank":[23,25]},{"title":"You're In The Army Now","rating":9,"date":"7 December 2005","review":"My uncle who later served in France during the second World War was one of those whose lives was interrupted by the peace time draft before the USA entered World War II. It was with some touch of irony that he will mention to this day he never saw any camp hostesses like Jane Frazee or the Andrews Sisters. <br><br>But Buck Privates is an Abbott and Costello film, not a serious drama about the first peace time draft in American history. Bud and Lou got in the short run of this film several of their classic routines.<br><br>When Universal signed Abbott and Costello on the strength of their running appearances on Kate Smith's Radio Show, they were expecting to do a series of B programmers with them. They never dreamed that these two burlesque comedians would become the national icons that they did.<br><br>Shot on a shoestring the film made an exponential profit for Universal studios. Without the usual Hollywood ballyhoo that would have accompanied a major Hollywood production, Buck Privates returned many times the cost of production.<br><br>And through the serendipitous casting angel, Buck Privates also included the Andrews Sisters who got to sing three of their standards in this, I'll Be With You In Apple Blossom Time, You're A Lucky Fellow, Mr. Smith, and the immortal Boogie Woogie Bugle Boy from Company B. <br><br>There are in fact so many musical numbers and so many A&amp;C routines in this short film, there's barely room enough for a plot which involves a playboy Lee Bowman, his former chauffeur AlanCurtis, and Jane Frazee the camp hostess they both want to get better acquainted with. But because of that the film doesn't drag for a second.<br><br>Buck Privates set the standard for the films that Bud and Lou did for Universal. No doubt about it, their best work was in the early Forties and Buck Privates is the best of all.","user":"bkoganbing","rank":[22,24]},{"title":"An Optimistic Take of a Troubled Time","rating":8,"date":"28 March 2004","review":"Abbott and Costello's second feature, \"Buck Privates,\" opened in January 1941.  Peacetime conscription was in effect, voted by Congress in late 1940, and only planned to last for one year.  Europe was at war, China was being raped (literally) by the Japanese.  Americans were torn about the prospect of war-Lindbergh, a hero and a Nazi admirer, together with his America First movement urged isolationism.<br><br>\"Buck Privates\" walks a cautious line.  No mention of the raging European war, the bombing of London, the success of German U-boats.  No discussion of America's entering a war which, anyway, isn't even directly mentioned.  The theme was high-spirited patriotism and preparation.  With the Andrew Sisters, Abbott and Costello provide a light-hearted view of conscription and basic training.  It almost seems like a Boy Scout experience. (I don't recall Basic Training at Fort Dix in 1965 as being any fun.)<br><br>Petty con artists, the duo mistakenly join the Army while trying to evade local police.  The cop chasing them winds up as their company noncom.  A rich young man and his former and now very resentful working class chauffeur are not only in the same company with the comedians, they're vying for a pretty girl who seems attracted to both.  A common formula for movies.<br><br>The film tracks the transformation of average young American men from all over the country who share two qualities: they're happy to serve and they're all Caucasian.<br><br>With some film from the Louisiana maneuvers, at the time the largest combat training exercise in Army history, the thin and predictable plot develops to the singing/marching end as the now ready recruits prepare to take their places in line units.<br><br>Propaganda?  Well, Hollywood was starting to get on the patriotic bandwagon but cautiously.  No one gets hurt in this film worse than receiving a punch in a barracks brawl or during a prize fight.<br><br>Abbott and Costello became picture palace luminaries with this still funny but unsophisticated look at Army life.  With tickets costing, usually, two bits \"Buck Privates\" grossed $4 million, a remarkable box office take for the time.  The film drew an Oscar nomination for the Andrews Sisters and their \"Boogie Woogie Bugle Boy\" number, a huge hit.<br><br>\"Buck Privates\" is an interesting look at Hollywood's careful treatment of a politically sensitive issue, conscription and the path to war.  It showcases two of America's funniest comedians in a series of give-and-take dialogues that became the hallmark of their collaboration. Their routines remain very funny more than six decades later.<br><br>8/10 (for its type and time).","user":"lawprof","rank":[32,37]}]