[{"title":"One of the All-Time Greats","rating":3,"date":"3 April 2003","review":"This film is not only a great science fiction film, but it is also one of the most influential as well.  Within a few years of its release, giant monster films began to pop up from every major studio.  Everything from giant ants, tarantulas, praying mantises and gila monsters began to pop up all over the place.  But, perhaps its biggest influence was felt in Japan. This film is often sighted as being the main inspiration for Gojira (Godzilla).  This film is defintely a classic.","user":"Sargebri","rank":[34,34]},{"title":"50's monster action at its best.","rating":31,"date":"31 January 2002","review":"Ray Harryhausen's first solo effort at stop-motion resulted in one of the best monster movies of the 1950's.<br><br>This was the first of the many rampage films of the 1950's and was a great success at the box office.  Ray's stop-motion Redosaurus is magnificent, considering the low budget.<br><br>One of the best scenes in this movie is where the Rhedosaurus eats the policeman.  The acting is rather good and the cast includes Kenneth Tobey (The Thing From Another World) and an early appearance from Lee Van Cleef before he stared with the 'carrot' in It Conquered the World.<br><br>I enjoyed this movie and rate it 5 stars out of 5.  Great stuff.","user":"chris_gaskin123","rank":[25,25]},{"title":"Lee Van Cleef saves the world!","rating":11,"date":"11 February 2002","review":"This is the movie that introduced me to monster-on-the-loose pictures. Warner Brothers did not pioneer the genre; RKO started it off in 1951 with THE THING FROM ANOTHER WORLD.  But it WAS Warner Brothers who began both the \"radiation releases monster\" and \"radiation creates mutant monster\" genre's with this film and THEM! two years later. I had never heard of Ray Harryhausen when I saw this for the first time at the tender age of 7 but I knew a scary monster when I saw it and this movie became an instant fave.  Later I discovered Godzilla and could not figure out why that film had so much destruction and this one had so little. Later I learned about stop motion vs man-in-suit special effects.  I also learned that Inoshiro Honda was using this film as a blueprint. Fantastic film!  The first glimpse of the Beast is terrific!  The destruction of the first ship is spellbinding!  (That is Jack Pennick from many John Ford westerns as the shocked helmsman.) and the rampaging of The Beast through the streets of New York panicked me as a child.  The only scene I did not (and still don't) care for is where the helpless blind man is knocked down and trampled by the fear crazed mob.  The climax at Coney Island was amazing.  I later found out the marksman in the end scenes is Lee Van Cleef who starred in so many spaghetti westerns.  He actually saves the world in this movie.  Well, maybe not the world, but New York anyway. I still watch this movie whenever I get a chance.  When the film was new they tinted the underwater scenes where Cecil Kellaway is in the diving bell green.  They did not restore the tinting to the video print and I think that was a mistake.  Maybe when the movie gets to DVD they will do so. Don't miss your chance to discover this film.  You will enjoy it.","user":"Nozze-Foto","rank":[36,37]}]