[{"title":"The best of the whole series","rating":10,"date":"3 February 2004","review":"The third installment of the Zatoichi series is the best one I have ever seen. While not as exciting as some of the other action packed entries (Chest of Gold, Zatoichi's Revenge) in terms of character development this film had the most impact on me. The stakes just seem to be higher in this entry than in most. Make no mistake, Ichi's life is on the line in EVERY other installment, but this centers on how Ichi really wants to quit his swordsman lifestyle and take a wife. To live the rest of his days in peace is all he wants and that is taken away from him. Ichi is forced to not only see how terrible the people he trusts can be, but how much he brings upon himself. This film really drives home how much Ichi loses each time he takes a life. A new friend, a new aquaintence or a new lover is almost always instantly taken away from him, either by an enemies hands or by his own. But the single greatest scene in this film is not any of the sword fights, like in other entries, the best scene is the evens/odds scene in this film. If you're a fan of this series at all please see this entry.","user":"R0BTRAIN","rank":[31,33]},{"title":"Great drama and a lightning sword!","rating":8,"date":"3 January 2005","review":"ROBTRAIN is telling the truth about this entry in the Zatoichi series. Zatoichi has to contend with the brother of Kanbei from film 2, a criminal gang, and most shockingly, his former sensei!<br><br>Everyone (except Ichi's love interest) is basically a bastard. Zatoichi shows regret in the choices which have brought him into the yakuza world. And yet, Ichi always tries to do the right thing, showing respect for his sensei, refusing to believe that a young women from a samurai family could fall for him, and saving a kidnap victim. The drama builds and builds in this action-drama and leads to a great climatic scene involving Ichi and his sensei.<br><br>It is obvious that Katsu Shintaro has worked on his sword technique and shows amazing speed and increasing agility in his moves. This is a great film and one of the best in the Zatoichi series.","user":"bighouseaz","rank":[10,11]},{"title":"Good entry in the series","rating":7,"date":"19 November 2001","review":"This is the third entry in the popular Zatoichi series, and as usual it features an outstanding performance from Shintaro Katsu as the blind masseur who is also a master of sword play. This time he takes on a gang of thieves who are marauding the countryside. Of particular note is Akira Ifubuke's brilliant and evocative score, reminiscent of his best work from kaiju.","user":"JohnSeal","rank":[13,18]}]