[{"title":"One of the most kickass horror films of the '80's","rating":25,"date":"25 June 2001","review":"Thus far and no further is how I view this film - while 'Hellraiser' was a smooth and well-handled interpretation of 'The Hellbound Heart', this serves as an interesting extension to that story. OK, the acting is largly dire -  but is this not a horror movie tradition? The film excels in its MENTAL imagery, not physical: Tiffany's disturbing visions of babies with their mouth's sewn shut as Leviathan plays with her fears; Channards violent, acid flashback-style memories... they are all insightful and well-thought out as they deal with that which cannot be tamed easily - the human psyche. Director Tony Randall has a lot to live up to following  Clive Barker's '87 epic, but he takes the reigns of the story with good grace and presents a slick and progressive tale - although I do agree with the general consensus that the Cenobites should NOT have been humanised.  <br><br>All in all though a great film, fantastic visuals - the fall of Leviathan at the climax has to be one of the most gripping and explosive deaths of a movie monster in horror film history - and one which should have ended the tale.","user":"firefrost79","rank":[41,50]},{"title":"All time fav. Beautiful, visceral, multi-layered and vaguely erotic.","rating":10,"date":"10 October 2004","review":"Clive Barker is still the king. He brings us to a world where monsters have politics, the 5 senses rule, and we sometimes question whether our pre-notions of pain are as accurate as we think. The Hellraiser series is a lush, nightmarish, subliminal journey into human desire, masochism, mythos and madness. Pinhead is not so much the generic, evil antagtonist as he is a source of comfort and logic sometimes. Clive Barker has often toyed with our preconceptions that all \"monsters\" must be blindly destructive brutes, as opposed to the endearingly rational and decidedly intelligent Cenobites. Perhaps the fact that I have Cenobites tattooed makes me biased;) But it's still a unique piece with gorgeous imagery (to some.) Angels to some, demons to others... If you haven't seen Hellraiser 1 and 2 (the rest are not so great IMHO)...you must!","user":"Naturezrevenge","rank":[67,86]},{"title":"A roller coaster ride of violence and sheer terror!","rating":6,"date":"6 July 2001","review":"After the strange events of the first movie,Kirsty is sent to a Institution for the Mentally Sick, commanded by the mysterious Dr. Channard,a crazed psychologist who is willing to open the doors of hell by manipulating the Puzzle Box.In doing so,Channard brings Kirsty's  perverse stepmother Julia back to life,and consequently he provokes the rage of the dreadful cenobites,the cruel and evil creatures that give pleasure and pain in the same measure.Hellbound Hellraiser 2 is an extremely well-done film,thanks to the generous budget given to newcomer filmmaker Tony Randel and a first-rate production.The special effects are simply terrific (specially considering the time in which the movie was done,1988) and they create a bombastic,scary visual.I never saw a movie with such an incredible scenery and imagery,except maybe for Dark City.Clive Barker's vision of hell is brought to life with mastery through the work of Randel and Director of Photography Robin Vidgeon. The plot sustains the tension and keeps you on the edge of your seat from start to finish,though the first half hour of Hellbound: Hellraiser II is a little bit slow and descriptive (but never boring); a great portion of the action and the terror is concentrated in the last minutes. The last thirty ones are a realistic and gutsy \"tour de force\" through fear,violence and suffering.This is definitively a masterpiece, but not for the squeamish.Hellbound: Hellraiser II is rated R for extreme violence and sex scenes,it runs 99 minutes(uncut version released by Anchor Bay).It stars Clare Higgins as Julia, Ashley Laurence as Kirsty, Imogen Boorman as Tiffany,William Hope as Kyle McRae and Kenneth Cranham as Dr. Channard.If you like this movie, you might also enjoy Phenomena and Suspiria.","user":"roger-dalazen","rank":[38,47]}]