[{"title":"Just enough good elements to take it seriously...","rating":5,"date":"30 January 2019","review":"...for example, Bea Arthur as Vera Charles has one solo and parts of three duets--she steals the film easily, no contest. Robert Preston has one solo &amp; is part of two other numbers, in limited screen time--he does his best to make Lucy look good in the title song and dance and succeeds. The instrumental music is so loud during Lucy's numbers it almost drowns her out, along with other cast members who can't sing.<br><br>Now for the bad - Lucy didn't have the range to sing the title part and shouldn't have been cast. She ruins her first two songs, then she and the kid cast ruin song number three. From then on she alternates between a very limited tenor range and talk-singing her songs, like Rex Harrison in My Fair Lady (1964). Also, all of the choreography seems slowed down--there is so much blurring of the camera lens one can barely see the pearls Lucy is wearing--they look to be dots. In the end the film just barely avoids disaster and today is considered a bit of a camp classic.","user":"AlsExGal","rank":[11,12]},{"title":"A view of the admirability that used to be","rating":6,"date":"6 February 2002","review":"For those who enjoyed seeing this lively piece in the 1960s, or who liked the novel thirty years ago, Mame could be not only an entertaining sentimental journey, but an interesting view of how times have changed.<br><br>Lucille Ball is an interesting if not entirely right choice for the main role.  She shows Mame Dennis's vivacious personality beautifully, accenting - naturally - the comic aspects of the character.  It is a demanding role, covering eleven years from the heyday of the twenties until the start of the forties.  Among the character developments are a period of job-hunting, the Southern-belle wooing of a second husband, and the growth involved in raising a child.  Her acting is ideal.  However, the role asks for a singer equal to the actor, and Ball is not up to it.  Her low, aging voice has some depth, especially in the elegiac \"Boy with the Bugle,\" but not the force and clarity of a good singer.  The music and lyrics give her a hand, however, with an especial highlight in \"Bosom Buddies,\" the scathing and hilarious duet with Bea Arthur as Vera Charles, \"the first lady of American theater.\" Other catchy tunes you might remember are the title song (\"You coax the blues right out of the horn,) Mame,\"  and the romantic, \"My Best Girl.\"<br><br>Beware of what you may get into as you watch it though: Mame is a piece whose message has become dated.  Mame Dennis was a hero to a generation of young novel readers some forty years ago, and those who saw her character on the original musical stage were struck by her energy and her view of the world.  \"Live!\"  she says.  \"Life is a banquet, and most poor sons-of-bitches are starving to death!\"  But those viewers were from a different era, when women did not work, were expected to be domestic, and her world-hopping would have been seen as radical:  an early expression of women's spirit.  She was inspirational in her context.<br><br>Today, though, she represents a different notion.  Coming from a vantage point of extreme wealth, her admonition, \"Live!\" is easy for her to say. She did not create her wealth, but inherited it from her first and second husbands.  On her own, Mame cannot provide for herself.  When her first inheritance is wiped out in the Great Crash of 1929, Mame gets fired from job after job, relying on her former butler and nanny to pay the bills, until she fortuitously manages to marry into wealth again.<br><br>So in a modern context, we see Mame not as a freedom-loving feminist expressing herself against the prevailing social constraints, but as a woman who must depend on men to provide her with the necessary element of her freedom:  money.  In the depression, she could afford to fly around the world and spoil her children on her inherited money, while those who may have wished to be inspired by this spirit could not.<br><br>Her heroism was not in how she gained her money, but in what she did with it.  Even so, taking a two-year honeymoon and holding thirteen parties in two weeks (\"She had to cancel one,\" the butler explains) is hardly politically correct, today.  Even her altruistic gesture at the end, when she buys a plot of land for a home for single mothers, is as much a jab at her nephew's future in-laws as pure philanthropy, and the plight of her beneficiaries is only brought home to her when her secretary becomes one of them.<br><br>It is therefore difficult today, to find Mame unambiguously admirable or inspiring.  Her spirit comes from wealth; her wealth is unearned; and is used primarily to pump her own spirit.  Her charm notwithstanding, the view of her lifestyle has taken a turn in an age when the wealthy can know how to live, while most poor sons-of-bitches are starving to death.<br><br>Mame, therefore, is worth a second glance, not only for its tuneful exuberance and wonderful comic moments, not only as a vehicle for a sentimental review of an old favorite, but as a historical piece:  a view of the admirability that was.","user":"sashajunk","rank":[12,15]},{"title":"Absolutely one of my favourite movies","rating":9,"date":"15 October 2000","review":"Yes, Lucille was filmed in soft focus.  No, Lucille did not play Mame exactly like Rosalind Russell.  Yes, Warner Brothers was foolish in rejecting Angela Lansbury.  But if you are willing to look past that, you will find a WONDERFUL motion picture.<br><br>Although Paul Zindel perhaps changed more than necessary in his script rewrite, this is still some GREAT material.  And one could not have asked for better direction or supporting cast.  Gene Saks did a wonderful job on all counts...the cinematography is marvellous (if you can find the wide-screen version) and the whole film is delightfully theatrical.  The art direction is to die for; Ball's singing notwithstanding, the musical arrangement is superior to the Broadway recording (possibly excepting \"It's Today\" and the title number [although it's still very much enjoyable]); and Wayne Fitzgerald's title sequence is one of the best in film history. Although there are a few notes here and there that may make one wince, Ball's singing is really NOT THAT BAD.<br><br>Folks expecting a musical duplicate of AUNTIE MAME, however, are in for a surprise.  Rosalind Russell's performance, which I love, was outrageously campy; Ball interprets Mame quite differently, and plays her much less flamboyantly.  Her portrayal is not as inherently funny as Russell's, but Ball is still a grand actress, and she shows real human emotions very well in MAME.  Did Angela Lansbury deserve the film role?  Most definitely. Lansbury, of whom I am an enormous fan, devoted years of her life to perfecting the role on Broadway (and she DID perfect the role), and she was more than willing to do the film.  It is indeed a tragedy that we have no film record of her performance, but that should not be a factor in judging the quality of this film.  Ball was perhaps older than the role called for, but she was an able Mame.  Everyone around her, especially the great Bea Arthur and the superb Jane Connell (undoubtedly one of the most underappreciated comic actresses alive), is brilliant.<br><br>What was Ball doing in this picture in the first place?  Although she had wanted the part badly ever since AUNTIE MAME was released, it was NOT her financial backing that took this part away from Lansbury.  Initially she avidly pursued the role (not even her confidante Desi Arnaz could talk her out of it), but after she broke her leg in 1973 she had a sort of reality check.  Realising that she was not in any kind of shape for the part, she told the producers that she was backing out of the movie.  Warner Brothers promptly flew a representative out to see her and insist on delaying production for her, saying that she was the only reason the picture was being made in the first place.  Lucy was a somewhat insecure person, as well as a person always concerned about others' jobs; feeling that dropping out of the picture would leave everyone else working on it out of a job, she acquiesced.  Even when the director begged for Angela Lansbury, Warner Brothers refused on the basis of \"star power.\"  It was balderdash, of course, but the business side of show business unfortunately is always in the way of the artistic side.","user":"Comrade Genghis","rank":[42,63]}]