[{"title":"Completely Unexpected","rating":8,"date":"30 May 2005","review":"Humphrey Bogart heads a superior cast in this tale of a gang of swindlers who seek to covertly purchase African lands rich in uranium--but this is not the tough film noir you might expect: the script by director John Huston and Truman Capote upends the tale to create one of the most wry and wicked comedies going, and a remarkably fine cast follows suit with a host of eccentric performances.<br><br>Although Bogart does not look his best (this film was made toward the end of his life), he offers an understated yet very witty performance as Billy Dannreuther, the man the crooks hire to make the land purchase. His leading ladies, bombshell Gina Lollobrigida and an unexpectedly blonde Jennifer Jones, are equally effective in the roles of Bogart's cheerfully pragmatic wife and the pathological liar with whom Bogart becomes romantically entangled. But the big news in this film is the supporting cast. Robert Morley, Peter Lorre, Ivor Barnard, and Marco Tulli give drop-dead-funny performances as the largely incompetent foursome behind the landsnatch scheme; Edward Underdown (as Jones' long suffering husband) is simply the most completely ludicrous Brit to hit the screen since 1930s screwball comedy; and all the cameo players nail their roles to perfection.<br><br>It would be unforgivable to give away too much of the story, but suffice to say that one wrong turn leads to another. The film never overplays its hand, maintaining a low key tone that sets off the wickedly funny script to delightful effect. Some viewers may not get the joke--much of BEAT THE DEVIL requires the ability to appreciate covert humor--but those who do will find the movie bears repeat viewing. Recommended.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[114,134]},{"title":"A Spoof That Works After a Half Century","rating":7,"date":"7 February 2002","review":"Hadn't seen this film in a long time and I'm glad to have caught it again. It's at the apex of black-and-white barely tongue-in-cheek comedies with a stellar cast that had a blast making the film.<br><br>Jennifer Jones, beautiful as always, seems barely able to stay inside her role, laughter threatening to break out at any moment.  Humphrey Bogart has a recurrent quizzical \"Am I really doing this?\" expression.<br><br>Tied in with a gang of bumbling crooks seeking a fortune in uranium in Africa, illicitly of course, Bogart, married to a cute Gina Lollabrigida, falls in love with a faux English gentleman's wife as fast as his spouse goes for the supposed representative of the landed gentry. Of course cuddling and sweet words substitute for sex.<br><br>Robert Morley, always funny, is the putative leader of a gang that can't get their act together with Peter Lorre shedding his customary menacing stare for a busman's holiday as a gangster with a sense of humor.<br><br>The action ranges from beautiful Italy to a placid sea voyage aboard a rickety tub commanded by a rum-soaked moron whose Italian expletives are not understandable but who cares?  The main characters, shipwrecked, wind up on an African shore where they're greeted by what today are embarrassingly stereotyped Arabs (I cringed at one of the European's comic invocation of Islam but then the movie has to be taken on its own terms and time, right?).<br><br>The resolution is lame - the characters all look ready to leave the set and get drunk before undertaking a new film.  But this is one of the best spoofs of the noir genre and what makes it fly is the ensemble of first-rate actors in roles neatly the opposite of those they were usually seen performing.<br><br>Rent it! (Please)","user":"lawprof","rank":[58,70]},{"title":"Brilliant Dry Humor","rating":10,"date":"12 July 2005","review":"Most of the reviews of 1953's \"Beat the Devil\" regard it as a Humphrey Bogart picture. Certainly his company produced it, but it is truly a John Huston film. Huston's legendary dry wit suffuses the whole enterprise from start to finish. Essentially, a comedy of errors, Huston's script, co-authored by Truman Capote, also serves up wry social commentary on a range of subjects from social position to the industrial world's exploitation of Africa, a place near and dear to Huston's heart. Jennifer Jones' prophecy that Africa will become an ugly place with \"all those holes,\" has long since become a reality. A brilliant cast, with Bogie playing his typical world-weary existentialist, spiral avarice and misconception into hilarity; a comic exposition of the proverb, \"What a tangled web we weave . . .\" Often criticized for being unrealistic, Huston's and Capote's comic script has none-to-funny real parallels in the present day debacles of Enron and WorldCom. In \"Beat the Devil,\" greed and deceit are brilliantly juxtaposed to reveal the ultimate folly of even the most devious criminal enterprise. This is a superior black comedy that plays even better today than it did 52 years ago.","user":"jim_altman","rank":[67,83]}]