[{"title":"Lost and found!","rating":5,"date":"5 January 2004","review":"Well, this movie is one of those half-forgotten gems of this cool decade. As a child I use to rent this movie over and over again but then I forgot it's name when I grew older. Recently, when I started to look for old cult 80s, I stumbled upon this little nice saga. The story is ridiculous but quite entertaining (I love revenge ;)) and there are many strange plot-holes through the whole movie. So why bother renting or buying this old s*** you may ask? Well if you are a child of the 80s and saw it back then, it can bring back some nice memories. If you are from that time but have not seen it, you MUST see it. Everyone else, just see it and enjoy a movie with one of the greatest cars ever on screen. For those who have seen it I just must make some statements of some of the major flaws in the film. How come that the police just let the thugs steal all the nerds cars in a small town like this? (very strange) And why don't the stupid morons see that they're next to die on the list when their buddies fall off one buy one. No fear at all...=) Well... all and all a funny flash-back. You know from like ten minutes into the movie how the end will be, but you'll KEEP on looking...","user":"Lovechild_77","rank":[48,54]},{"title":"Great action, good characterisation, superb soundtrack","rating":10,"date":"29 July 1999","review":"One of my all-time favourites. A nice idea in the spirit of \"The Car\" or \"Christine\" with great action (mostly of well-show car chases in Tucson, Arizona). The characters were well constructed and (on the whole) well implemented by the actors, with Nick Cassavetes stealing the show as nutter, Packard Walsh.<br><br>It also launched the careers of Charlie Sheen and Sherilyn Fenn (Fenn's fans will be happy to see \"more\" of her in this one).<br><br>The rock soundtrack is superb and a real collectors' item nowadays.<br><br>The original video cover was nice in that it was a holographic cover. Subsequent sell-thrus resorted to a standard litho-printed cover.<br><br>For a night in with a pizza and a few mates round, this is a great film.","user":"Mark-192","rank":[64,79]},{"title":"A Bit of 80's Fun!","rating":7,"date":"27 January 2007","review":"My brothers and I used to watch this movie all the time, probably when it was on HBO back in the day. It was a nice piece of nostalgia. Since I had viewed it so much as a kid, it was like going back and watching a movie you almost know by heart but at the same time weren't really sure what was going to happen next.<br><br>The soundtrack was great, with the likes of Ozzy, Billy Idol, Robert Palmer and others. Looking at all that 80's \"fashion\" was fun too. The DVD box didn't say the year but I had determined it to be about '86 or '87.<br><br>I couldn't help but draw a comparison to this storyline and that of \"The Crow\". \"The Crow\" is definitely a darker piece of fun but the same \"guy done wrong takes revenge and finds his girl\" wasn't hard to miss.<br><br>All in all, if you're looking for something fun, with a great soundtrack, cool cars and fast car races, check it out!","user":"metallikat74","rank":[14,15]}]