[{"title":"The Past Is A Foreign Country","rating":10,"date":"29 April 2018","review":"To sit through \"The Go-Between\" again, after years - maybe 20 - since the first time I saw it, turned out to be an almost religious experience. Harold Pinter adapted L P Hartley's novel and Joseph Losey directed - Lose, a blacklisted American who became one of the pillars of British Cinema in the 60's - think \"The Servant\" or \"Accident\" - Then, of course, Julie Christie, sublime. Alan Bates at his pick and the spectacular Margaret Leighton ensure that \"The Go Between\" will always be alive and relevant. Dominic Guard is wonderful in the title role as well as Michael Gough and Edward Fox. Michel Legrand and his score are the only elements who seem rooted in 1971. The film opens with the line \"The past is a foreign Country....\" Yes indeed, I believe that that applies to film too because in the past, even a recent past, is like a foreign Country, even a close and friendly Country, people behave differently there, then.","user":"littlemartinarocena","rank":[35,38]},{"title":"THE GO-BETWEEN (Joseph Losey, 1970) ***1/2","rating":8,"date":"24 August 2006","review":"Richly-detailed period romantic drama, told more or less from a child's viewpoint but treated with the maturity one has come to expect from a Losey film (the main plot is interspersed with fragmented clips of the boy as an old man - played by Sir Michael Redgrave - revisiting the aristocratic country estate where the majority of the narrative takes place).<br><br>Though the characters are rather swamped by their surroundings (the two leads are particularly subdued) - as captured by the gleaming cinematography of Gerry Fisher and the elegant décor of Carmen Dillon - the film allows for several good performances from a sturdy cast, including Dominic Guard (as the boy Leo who acts as messenger in the impossible love between upper-class Julie Christie and commoner Alan Bates, both of whom he idolizes), Edward Fox (as Christie's intended, a war-hero), as well as Margaret Leighton and Michael Gough (as her parents); Leighton's role remains in the background for most of the time but, then, she asserts herself during the last third to bring down the couple's relationship - with the unwilling assistance of the bewildered Guard. Besides, Michel Legrand contributes an atypically ominous yet haunting score.<br><br>This was the third and last time Losey and screenwriter Harold Pinter worked together, constituting a very fruitful and quite extraordinary collaboration; for about two-thirds of its length, the film finds Losey somewhere near his best - the contemporary subplot where Leo reprises his 'services' for an older Christie works less well, in my opinion (and is too sketchily presented anyway), rendering an already deliberately-paced film somewhat overlong! <br><br>THE GO-BETWEEN won the Golden Palm at the Cannes Film Festival, was nominated for an impressive 12 BAFTA awards (winning 4) but received only 1 Oscar nomination (for Leighton as Best Supporting Actress).","user":"Bunuel1976","rank":[35,38]},{"title":"Another Pinter-Losey Masterpiece","rating":8,"date":"13 November 2016","review":"This movie is the third joint venture paring writer Harold Pinter and director Joseph Losey. The other two are The Servant (1963), and Accident (1967). This venture, combined with a top-notch cast, makes for a great film: No. 56 of the BFI's Top 100. Yet sadly, the movie has not been restored, in its original aspect ratio for DVD, and I had to see it on VHS in the full screen pan-and scan version. <br><br>I've a feeling that this is one of those films that MUST be seen in its original wide screen format, since the photography of the English countryside setting is crucial to the movie, and anything less does not tell the movie's whole story!<br><br>Michael Redgrave tells the story, in retrospect. It begins as a 12-year- old boy, Leo (Dominic Guard), comes to spend the summer of 1900 at a large English country estate. He is a guest there, and his relationship to the family is never made clear. We don't learn much about his background except what we overhear: that his mother is a widow from the city. As he is introduced at the family dinner table, he tells them that he knows magic and has conjured up curses on people, but this seems a game between him and the other boy his age on the estate, Marcus. <br><br>As the two boys play, the rest of Marcus' family starts to emerge as Marcus tells Leo about them while pointing them out. We view their lazy hot summer's life as they attempt to occupy themselves with conversation, nature, art, culture, and games. Leo attempts to fit in with the family led by its matriarch, Mrs. Maudsley (Margaret Leighton). Leo also becomes attracted to Marus' older sister, Marian (Julie Christie), and develops a puppy love for her. (At one point he proclaims that he would do almost anything for her.) She, in turn, shows an admiration for him.<br><br>One day as the family goes out for a swim, they encounter their lower- class neighbor, Ted Burgess (Alan Bates), who is trespassing on their property by swimming in their lake. Leo later meets Ted and is gradually taken into his confidence. At Ted's coaxing, he starts to secretly deliver notes to Marian, and she, in turn, returns notes to Ted, through Leo. <br><br>Feeling 'out of the loop,' Leo wants to know more. He eventually asks Ted to tell him about sex ('spooning'). At almost thirteen and with no father to guide him, Leo has never been told the facts of life. Yet, he senses that he should know more and that Ted will explain it to him-- though he never really does. When Marian becomes engaged to an upper- class gentleman, Ted seems displeased. However, after a brief break off in communications; Ted and Marian begin their secret exchanges again with Leo still acting as their dutiful Mercury-like 'go-between.' Then, on Leo's thirteenth birthday, he suddenly learns the shocking nature of his carried missives.<br><br>This film, accented by Michel Legrand's score, has a mysterious, almost Gothic, feel about it. There seems to be something always missing, just out of view, waiting to be discovered. But, just as Leo is never made part of the secret, neither is the audience--until the surprising ending.","user":"kijii","rank":[18,19]}]