[{"title":"Excellent director, immaculate film.","rating":10,"date":"19 April 2003","review":"Peter Weir is a master of taking the mysteries of human nature, combining them with the essence of humanity, then distilling those aspects through the inexplicable itself. This has been an earmark of his films \"Dead Poets Society,\" \"Fearless\" and even \"The Truman Show\" but nowhere is this more apparent than with \"Picnic At Hanging Rock.\"<br><br>Beautifully filmed in rural Australia, the plot of \"Picnic At Hanging Rock\" is deceptively simple: students at an upper crust Victorian-era girls' school go on a field trip to Hanging Rock --an unusual geographic site miles away from civilization. On the trip, three of the girls and one of the teachers go missing. A simple plot, right? Well, on the surface it is indeed simple, but the way Peter Weir deals with the subject matter will keep the viewer absolutely enthralled and at a loss as to the cause of the girls' inexplicable disappearance. What has frustrated many viewers is that the responsibility of the hypothesis lies solely on them: there are no conclusive answers, but rather a number of theories as seen through the eyes of second and third parties.<br><br>Additionally, Weir spices up the overall feeling of uncertainty with repeated images seemingly unrelated to the flow of the movie. Swans, ants, flowers, flies and poetry all appear repeatedly throughout the film, indicating that there is some deeper significance to the nature of the disappearance. Something that is just out of the viewer's grasp. In truth, Weir's direction in this film is akin to a more accessible and humanistic David Lynch. Much of the same thematic ground is covered, and the pronounced sense of uncertainty is a trademark of many Lynch films, especially his recent masterwork, \"Mulholland Drive.\"<br><br>Finally, what makes \"Picnic At Hanging Rock\" a true marvel of filmmaking is the complete integration of all elements in the support of the ephemeral theme. The pan-flute of Zamfir adds an otherworldly element to the score; the cinematography makes Hanging Rock look alternately commonplace, and enigmatic, depending on the scene. This collusion of all elements makes \"Picnic At Hanging Rock\" essential viewing for anyone interested in immaculate emotive filmmaking. -E. Shaun Russell","user":"eshaun","rank":[135,155]},{"title":"the unspeakable takes control","rating":9,"date":"28 May 2000","review":"This is mesmerizing film with a cipher at its center. Less is more. I am amused at some of the comments. There seem to be two types: those which depict the movie as \"beautiful, ethereal and subtle\" and those which depict the film as \"too symbolic, too slow, boring, too 70's.\"<br><br>The point is, there is no point. The central vision of the film is enigma, the void, mystery. This seems to make a lot of explainers uncomfortable, but the use of emptiness at the core of a work of art is nothing new. \"The hand that erases writes the true thing\" Faulkner's masterpiece \"The Sound and the Fury\" is about a character who is absent. The characters that surround her, and who actually people the novel? Not all there, lacking, disintegrating, unknown, unwanted, unloved.<br><br>If there must be a meaning, it is that nothingness is the biggest threat of all. \"I will show you fear in a handful of dust\" We fear our disappearance. We'd like to believe that our little lives, our little comments, our little film lists will endure forever. But they won't. Nothing will.<br><br>what is existence? a random ever-changing collection of energized particles.<br><br>At any point, we can cross the line into nothingness. Nature will subsume us.<br><br>The film \"A Passage to India\" had the same theme. It was NOT essentially a movie about rape or sex scandal. It was about the yawning pitch-black eternal emptiness of the caves. It drove two women mad. Nature as an amoral uncaring unmoveable eternal reality.<br><br>Just as Picnic was NOT about repressed Victorian sexuality. These were pretexts, and were utilized because the fear of sex is the fear of letting go. The fear of sexuality leads irrestibly to our main fear: that darkness, emptiness, and the powers of nature will overwhelm us and erase us.<br><br>In Picnic, there was no villain, no enemy, no fall guy, no perpetrator, process or predicament that we could blame for the girls' disappearance. They simply disappeared. And that is the scariest nightmare of all.","user":"MissRosa","rank":[224,276]},{"title":"Death and the Maidens","rating":8,"date":"8 May 2005","review":"Even though this has been described as a film about sexual repression (and Peter Weir may have thought he was making such a film), I don't think it is--rather, it is a celebration of the dreamy, self contained sexuality (or rather pre-sexuality) of young adolescent girls just before they seriously turn their attention to men. Sure, they may be living in a society straitjacketed by Victorian mores, but the girls really don't seem to be the unhappier for this, non withstanding the earthy maid's comments that she feels sorry for them. Miranda and her friends seem completely content and at ease in their languid, hothousey world of poetry, pink and white bedrooms, and mutual crushes (I was reminded of the similarly dreamy, self contained little universe of the sisters in \"The Virgin Suicides--another film that is supposedly about repression). During the noon day nap at Hanging Rock, the girls, heads resting in one another's laps, are in a state very much resembling post coital bliss--far from seeming repressed, they are among the most content women I've ever seen on screen. It is quite arguable that Victorian morality had something to do with their sexuality turning inward like this, but all this does is lend credence to the truism that repression intensifies sexuality--which may explain the lingering fascination the Victorian era has for the modern age, and why one of its most striking symbols of its oppressiveness--the corset--is also very erotically charged. The girls' disappearance into the eerie black land form (that seems to have faces at times, bringing to mind fairy tales about trolls who steal golden haired children) suggests that at in their present state they are so contented that anything else life might hold for them could only be a letdown, that only whatever dark force (death? nothingness?) is haunting Hanging Rock could possibly be a worthy enough lover for these girls who are already so supremely self fulfilled. <br><br>There are, unfortunately, aspects of this film that don't work, or rather jar with the elements discussed above, the most prominent of these being the Dickensian subplot of the persecuted orphaned pupil Sarah. The actress herself is affecting in her part and her boyish beauty contrasts well with Miranda's ethereal femininity (she looks like a young Renaissance prince at times), but her story really belongs in another movie because at heart \"Picnic at Hanging Rock\" is more Gothic than socially conscious.<br><br>Maybe Weir really was aiming to make a movie about the evils of sexual repression, class inequality or even colonization, but such possible themes are blown away by the languid, ethereal images of the young adolescent girls at the beginning of the film, floating contentedly through their hours like clusters of Monet lilies.","user":"pocca","rank":[114,137]}]