[{"title":"I cant understand why this movie is so reviled...","rating":29,"date":"29 June 2005","review":"1941 is considered to be Steven Spileberg's folly, a screwball farce about the Japanese invading America after pearl harbour, starring some of the greatest actors and comedians that ever lived. Some people hate it, I love it. Sorry for all you haters, but I guess the things I like are the things you dislike, but for the life of me, I can't understand why this movie is considered Spielberg's worst movie. For one, it's watchable, and for another, it's not full of Spielberg Schmaltz, (the thing i hate most about Senior Speilbergo's later movies, i.e Hook, Always, AI).<br><br>Treat Williams is an a$$hole but no-one plays a$$holes better (see; things to do in Denver when your dead), Robert Stack crying while watching Dumbo when a full scale dogfight rages outside the theatre, Ned Beatty destroying his house in an attempt to fight the Japanese, Slim Pickens faking doing a sh!t while Toshiro Mifune and Christopher Lee wait to find out if he's passed a compass. I'm sorry but but those are all comedic gems. Okay, so Belushi is wasted and is seemingly in this move for no reason, but Belushi in a cockpit without a bottle opener is funnier than anything with Sean William Scott in it. For me this movie hits all the right notes, and on reflection makes some very good points (the two numbskull's who mistakenly think Belushi's plane is a German fighter...the paranoia of anyone living in a coastal town after pearl harbour).<br><br>Give it another chance, then watch Jaws if you still don't like it.","user":"goatboy500","rank":[77,106]},{"title":"This film was made for 1% of the population. Happily, I'm in that 1%.","rating":23,"date":"23 April 2001","review":"Steven Speilberg once asked a friend of mine, \"Why didn't anyone like this movie?\" Well, I think that I can answer that - \"1941\" is a gigantic in-joke. The people who are in on the joke are people who, like myself, have an oversized love and knowledge of the city of Los Angeles and it's history. I think that in the vast, world-wide movie-going public, this group probably comprises 1%. For that group, \"1941\" has a wonderful nostalgia value. And for the people in that 1% that have a twisted sense of humor and enjoy seeing nostalgic L.A. blown to bits, this movie really delivers. By the way, the folks with that twisted sense of humor probably account for about 1% of the original 1%.<br><br>I don't know why, but having grown up in L.A. and being an aficionado of it's history, I find it funny to see planes in a dogfight over Hollywood Blvd, the ferris wheel rolling off the end of Santa Monica Pier, and aircraft crashing into the La Brea Tarpits. But for non-locals and people unfamiliar with the paranoia that gripped Southern California in the wake of Pearl Harbor, this movie will likely seem confusing and silly. To the history buff with a twisted sense of humor (like me, proud member of the 1% of the 1%), the movie is not only amusing, but sometimes surprisingly accurate, historically. Robert Stack plays General Joseph Stillwell - a very real historical figure in L.A. history. Stack even bears a striking resemblance to the real General Stillwell. The whole movie is based upon a few real-life incidents of panicky anti-aircraft fire that occurred over L.A. in 1941/1942, as well as a Japanese sub that actually shelled an oil refinery near Santa Barbara. Like \"Chinatown\" (a film mistakenly thought to be an accurate account of L.A. water politics in the 1930s), \"1941\" borrows from real-life history and distorts it into pure fabrication. The difference is that while \"Chinatown\" is a noir drama,  \"1941\" is an over-the-top comedy. Both films appeal to the historian, but as it is often said, comedy is much harder to pull off than drama. You either love \"1941\", or sit though it, saying, \"huh?\".","user":"imddaveh","rank":[97,136]},{"title":"It's gonna be a long war....","rating":9,"date":"15 September 1999","review":"You can't have lofty aspirations all the time.<br><br>Even the director of such powerful films as \"Jaws\", \"Close Encounters of the Third Kind\", \"ET\" and \"Schindler's List\" has to take a break from all the serious issues in his films and play dumb at least once. <br><br>\nJust look at \"1941\".<br><br>With a plotline straight out of The Three Stooges and special effects befitting a WWII epic, \"1941\" abandons all pretense by parodying the opening of \"Jaws\" right off the bat and hitting every slapstick point from there on in.  Spielberg knew that even if this turned out be a flop, it would be a good-natured one.<br><br>Just look at this cast!  Not only are Aykroyd and Belushi at the helm, but there's talent like Matheson, Allen, Oates, Williams, Beatty, Gary (Roy Scheider's wife from the \"Jaws\" films), Candy, Flaherty, Stack (in his first comedic turn before \"Airplane!\"), Lee, Pickens, Deezen (a comic genius if ever there was one), Sperber and a whole herd of other I probably missed. All of them in the midst of the hugest battlefield of comic carnage ever seen.<br><br>And no wonder.  \"1941\" was co-written by Robert Zemeckis and Bob Gale, Spielberg protogees who went on to further success with the \"Back to the Future\" films, \"Who Framed Roger Rabbit\", \"Used Cars\", (all with climaxes as wild as the entire running time of \"1941\") and the vastly under-appreciated \"Death Becomes Her\".  Even John Milius (director/co-writer of \"Conan the Barbarian\") lends his pen hand.  <br><br>In the end, you'll be dazzled, breathless, stunned and amazed, but by no means bored.  And, with any luck, amused.<br><br>\"1941\" - it was a very good year.<br><br>Nine stars.  And don't worry: it's all for the good of the war effort.","user":"Mister-6","rank":[94,138]}]