[{"title":"baked Alaska","rating":29,"date":"29 March 2001","review":"An over excited critic once wrote that seeing Monroe in Cinemascope was like being smothered in baked Alaska, and seeing this movie, you know exactly what he (I assume he was a he) was on about. The movie opens on the extreme verticals of New York skyscrapers and narrow city streets, then cuts to a wonderfully elongated horizontal Monroe streeeeeeeetched across the scene in an increasingly empty apartment (the girls sell their furniture to be able to pay the rent). This movie is dated and fluffy, but has several interesting elements that make it worth a look for anyone interested in movie history, any of the leads, or in passing a wet Sunday afternoon in a pleasant way. This was Grable's last performance. She knew Monroe was about to usurp her, but the two women both dealt with an uncomfortable situation in a professional way. There is a great narrative twist in the film too - Monroe plays a short sighted girl who finally meets the man to marry her when he tells her he likes her in her glasses. Unlike the usual cliched plot line, it is when Monroe keeps her glasses on that she is revealed to be beautiful. Her acting is this film is among her best, especially her vulnerable scene in the gold aeroplane, and the moment in the powder room when she looks at herself in the mirrors and explodes into five, raspberry satin dress covered Marilyn's is a visual pleasure the film and the viewer revel in (Monroe can't, not wearing her glasses at that point). This film is creamy, smooth, warm - just liked baked Alaska!!","user":"Fiona-39","rank":[23,26]},{"title":"a piece of fun ....","rating":17,"date":"17 April 2004","review":"The film, the first filmed in CinemaScope, although the second to be released, remains as slick and witty as ever. While the three girls chase rich husbands they somehow end up marrying for love. <br><br>Personally for me it is Lauren Bacall and William Powell that standout...their witty knowing conversations are a true delight. Mr Powell shows just why he was so highly regarded. He has a magnificent calm and dignified presence beautifully complimented by Mrs Bogart's cool chic.<br><br>The film shows all the problems of early CinemaScope of course ...the lack of closeups because of optical distortions that would occur and enough light to sunbake under being necessary on the sets and a sound scheme with the stereophonic image shifting from side to side as characters moves across the screen. <br><br>The film is beautifully restored on the DVD with fine colour and sound.<br><br>The use of a 1:2.55 ratio means a truly WIDE screen ....which is shown off by the location shots of New York and the girls apartment which seems enormous!<br><br>The opening sequence/overture of course was designed to show off both the brand new wide screen and stereo sound. It seems slightly redundant now but is still a fabulous piece of music by Alfred Newman.<br><br>So turn the lights down, turn up the stereo and step back to 1953 and watch a consumate piece of entertainment","user":"hamlet-16","rank":[48,62]},{"title":"What a wonderfully, delightful movie!","rating":27,"date":"27 April 2005","review":"I just had a wonderful opportunity to catch a screening of this film on a wide screen. What a treat! <br><br>Unfortunately, it wasn't the best print; lots of dust and scratches on reel changes, and the colors were quite faded, but these films simply must be seen on a wide screen with an audience to be truly appreciated. Of course, almost any movie is improved by seeing it at the Castro Theatre in San Francisco, and I consider myself fortunate to have had the opportunity.<br><br>Lauren Bacall has always been one of my favorite actors, and she and Powell do work wonderfully together. Monroe is also, always a delight - I think that she was a much better actress than she is generally given credit for. However, though I've seen this movie close to a dozen times before, I was really struck at the wonderful performance that Grable turned in. She was perfect! I haven't seen much of her other work, but in HTMAM, she shows herself to be a wonderful comedic actress, playing a \"dim blonde\" who really isn't that dim. What a revelation and what a delight.<br><br>I would definitely recommend this movie to anyone who likes old movies, but if you have a chance to catch it on a real movie screen - DO SO! You won't be disappointed.","user":"praxagora","rank":[32,44]}]