[{"title":"A diagnosis","rating":10,"date":"8 April 2000","review":"The greatest fault of The Thin Red Line was its timing - it was released at around the same time as Spielberg's Saving Private Ryan.  While most people dismissed The Thin Red Line as the `other' World War II movie of 1998, it's actually a very different kind of film - the film itself is not hurt by similarity to Ryan but was hurt commercially due to the misconception. It's easy to forget that Red was nominated for seven Oscars.  This is an extraordinary film that can stand well on its own next to Ryan.<br><br>Saving Private Ryan was significant in that it visually depicted war in a realistic, gritty way.  The Thin Red Line's focus is more philosophical. It is about the contradiction between the beauty of nature and the destructive nature of men.  The movie cuts continuously between the external struggle of American GIs fighting to take a crucial hill from Japanese occupation on Guadalcanal - and more importantly, the internal chaos of war as every man tries to come to his own terms about matters such as morals, death, God, and love.<br><br>Unlike in Saving Private Ryan, there is nothing patriotic about this movie. In fact, there probably has never been a more anti-war film.  The fighting men here are disillusioned, lost, and frightened.  They don't fight for their country or \"democracy\" - they fight because they have to.  The only priorities are survival, and - for the more humane - caring for their comrades.  Renowned composer Hans Zimmer - who won an Oscar nomination for his work-captures the grim mood perfectly and allows us to hear the men's thoughts.<br><br>The characters are portrayed by a strong ensemble cast.  Acting is uniformly excellent, especially Nick Nolte as Colonel Tall, who is the unfeeling commander of the ground offensive on Guadalcanal. Thoroughly unlikable, he is the closest thing to a villain in the movie.  After studying war for an untold number of years, Tall sees Guadalcanal as his chance to prove himself and move up in the ranks - the men are only a tool to accomplish this goal and expendable.  In one crucial scene, he orders a captain (played by Elias Koteas, in another outstanding role) to lead his men to a frontal assault against a Japanese controlled hill.  When the captain suggests a more logical alternative, the colonel screams: \"You are not gonna take your men around in the jungle to avoid a goddamn fight!\"  To this, the captain replies, `I've lived with these men, sir, for two and a half years and I will not order them all to their deaths.'  Later, when the hill is taken, he is dismissed of his duties as Tall sees him as a threat to the successful achievement of his goal.  Certainly, not every commander must have been that coldhearted and selfish, but surely some were, though not necessarily to that extreme.<br><br>While the acting is very good, much of the cast is relatively unknown and it can initially be hard to distinguish the characters from each other as they may appear to be very similar.  They are all about the same age, have dirt smeared over their faces, and wear helmets and the same military garb. Also, the stars in this movie have very small roles.  George Clooney and John Travolta are credited with starring roles while really little more than extras - clearly for marketing purposes.  You will not see more than two minutes of each.<br><br>One of the main themes of the movie is the contrast between nature and men's destructiveness in war.  The director, Terrence Malick, hired cinematographer John Toll to capture this on camera, and towards achieving that goal they couldn't have been more successful.  The almost surreal scenery is nothing short of stunning and has the same visual impact as any special effect.  The beauty of nature is always present, even when it is a setting for battle of destruction, and death.<br><br>Though the battle scenes fall short of the frightening realism in Saving Private Ryan, they are heads and soldiers above every previous attempt. One truly gets the sense that war is a chaotic, often hopeless environment where it is only a matter of luck whether you survive or get killed.<br><br>\n`How did we lose the good that was given us? Or let it slip away? Scatter it carelessly ... trade it for what has no worth?'  The film is filled with such poetic questions as to which there are no real answers.  This is definitely not a party movie.  There isn't anything uplifting about it - it is downright depressing.  Asides from entertainment value, however, this is a film that makes you think.","user":"gabbagabbahey","rank":[530,603]},{"title":"Every movie-goer sees his own film...","rating":10,"date":"1 May 1999","review":"Having taken the time to read scores of reviews for TTRL (including IMDb ones here), I'm reminded of the movie subscript for this most controversial film:  \"Every man fights his own war.\"  What a polarization exists amongst its viewers, and a lot of emotion both ways.<br><br>I was stunned, moved, transfixed and totally absorbed by this film, even more so on subsequent viewings.  I was one of the considerable number of people who, as the credits appear, sit quietly till one has to leave -- still stuck in the film's experience.  I'm not angry at others who merely fell asleep.  It's odd how some of the film's harsher critics seem compelled to vent their anger in disparaging comments against those who loved it -- most of those who liked the film were gentler in commenting on its critics.<br><br>In contrast to what some have written, \"The thin red line\" has nothing to do with the British infantry in its imperial past.  Jones referred to two related quotes in his excellent book, both having to do with a thin line between sanity and insanity.  Whether \"justified\" or not, necessary or not, there is a lot of insanity in the war experience by anyone's definition of insanity.<br><br>War exists and seems to recreate itself -- I never got the idea from Malick's film that he was preaching that we should just stop having wars. On the contrary, he takes war as a given in the human part of nature, and shows how individual human beings variously adapted (or mal-adapted!) in order to be able to keep eating, breathing and, yes, killing.  The war experience is not primarily about shooting and blowing things up -- as Jones described from his own experience, it's largely about what happens between skirmishes -- strife and comradeship, fear and bravado, homesickness and freedom from past constraints, and waiting to die or to see a buddy die. People came, died, and were replaced -- much as portrayed by the cameo appearances in the film that confused or upset some viewers.  Veterans always talk about how hard it is when you have to rely on your buddies (and feel for them) even though odds are most of them will die.<br><br>What is most important to me (and it doesn't have to be for anyone else, I know that) is how the eternal themes of humanity are affected and expressed in such circumstances.  All great works of art have something to do with the themes of beauty, pain, triumph, despair, good and evil.  There's nothing wrong with entertainment as a diversion (The Matrix was fine fun); there's room both for film for fun and for film as art.  Saving Ryan's Privates was mostly good entertainment (although I found it terribly manipulative and jingoistic), while TTRL explores the themes I mentioned above, never with easy answers.  If you found the voice-overs heavy-handed, maybe it's because you're used to Hollywood telling us what to think and feel and thought Malick was doing the same.  Watch again and see if he's not just giving us access to various individuals' often conflicting perspectives.<br><br>As for those who think the film portrays \"our soldiers\" in a bad light, my family members who fought in WWII described their experiences and their reactions much as those shown in TTRL -- they were ordinary men, decent enough people, not heroes though sometimes unpredictably capable of the heroic, and devastated by their experiences.  I'm proud of them for having done all they could to do what they felt was their responsibility, and to keep some humanity intact in spite of the horror.  None of them told me they felt \"ennobled\" by war; they endured it and were badly hurt by it but didn't feel sorry for themselves, either.<br><br>In TTRL I got to see this portrayed with such compassion I wept.  Even the guy (Dale) who ripped gold teeth out of the mouths of dying Japanese soldiers was no stereotypical villain -- he has his moment of grace as do they all.  No one's defenses are portrayed as impregnable, not even Witt's. No stereotype himself, we see him kill over a dozen soldiers in battle, while still trying to see God in the midst of the chaos. And what a powerful scene at his life's end, fulfilling his own striving for self-sacrifice, and recognizing in a moment of epiphany where his own immortality lie.  Those who couldn't find a plot line in the film must have missed the first ten minutes...<br><br>Maybe it's because of my own experience in life that I respond to this film so strongly.  I endured and survived ten years of intense, inescapable unrelenting abuse as a child.  I remember even as a small child trying to make sense of it all -- looking for the good, the reasons, God's plan, my purpose.  Others who've survived trauma (in the Holocaust camps, on the cancer wards) often describe how such experiences focussed their attention on things that matter, beyond the physical realities they could not control. Ever since my childhood I've moved through life with a second awareness -- that examination and self-examination while \"real time\" goes on.<br><br>That's what Malick portrayed, for me, in this film.  Maybe you think that's \"sophomoric\" or \"pretentious\".  It may not seem so when you're in the midst of a struggle, or on your death bed...<br><br>DGH<br><br>P. S.  I organized a special screening of this film locally for a few friends -- 400 others paid to come, by word of mouth. Over a hundred sat spell-bound as the credits scrolled by -- hushed and not wanting to leave. Fellow wounded souls, some of them, I'll bet.","user":"Dr. Don-2","rank":[419,496]},{"title":"A haunting exploration of the meanings of life, death and war through the eyes of a group of disenchanted soldiers","rating":10,"date":"2 November 2001","review":"This is one of the most beautifully crafted and haunting films that I have ever seen. Not only is the amazing ensemble cast give truly beautiful, effective performances, but the direction and cinematography combines to create a magnificent visual and mental feast.<br><br> This story about the Guadalcanal campaign during WW2, based on the James Jones novel, weaves the lives of many characters together seemlessly, creating a philosophical/emotional experience of war. It's not just about war. It's about love, faith in yourself and others, friendship, humanity, morality and also works as a startling indictment of man's conflict with nature. The amazing opening sequence, sets up a tranquility as the character Witt, finds peace on a secluded island among the natives, a peace which is shattered by the war.<br><br> What follows is not a mindless battle-after-battle onslaught of pyrotechnics, smoke, dust and blood, but a thought-provoking, visually and verbally poetic analysis of war and humanity. In my opinion it is the greatest war film since Apocalypse now, which I believe bears more flaws than this. It's not an Us-and-Them war story about the glory of the USA defeating the evil Japs. It sticks close with the characters, as we hear the thoughts, their hopes, their fears, leading to a moving experience.<br><br> This film was released a few months after Saving Private Ryan and unfortunately did not experience the same attention that the latter film did. Ryan was an excellent film, but to offer a comparison, The Thin Red LIne treads where Ryan didn't dare. Ryan sat in the safe territory of Good vs Evil with a bit of Futility of War and a lot of American Patriotism. It seemed to be more about America at some points than about war. The Thin Red Line is about war, the people involved and the destruction it creates for the mind, the soul and for nature. It does not deviate from this to make simple contrasts and offer easy binary oppositions.<br><br> In fact, TTRL is not an easy film. Gasp, it even tries to make you think. Though the title is not really explained in the film, I believe it is implied, and could have many meanings - the line between sanity and insanity, morality and immorality, love and hate, companionship and loneliness, nature and man, war and peace. While the characters share their thoughts, deeply poetic as they are, the meaning is not thrown in your face and neither is the answer to the questions raised. In this way it is the most thought-provoking war film I've ever seen and one of the best films of all time in my book. Top ten easily.<br><br> Now to my whinge. I think TTRL was shunned unmercifully at the 1999 Oscars. Shakespeare in Love beat two brilliant films - TTRL and Elizabeth - to get that oscar, and don't get me started on Gwyneth's award. This is the best film of 1998/9, in line with Elizabeth. It's unfortunate that the two, thoug h greatly revered, did not achieve the success and attention they deserved.<br><br> Don't be afraid by its length, it's a beautiful journey, full of rich colour, sound and the reward is a deeply moving human experience, unlike any other that the past decade has offered.","user":"ephor","rank":[226,279]}]