[{"title":"Great way to close out the renaissance.","rating":10,"date":"21 February 2020","review":"Tarzan (1999) - is the final movie in the Disney Renaissance and it certainly was a great note to leave on. The story is very basic and easy to follow but they allow so much to happen when it comes to character development and showing off the incredible surroundings of the jungle. All the characters are very memorable and I especially love the way they work Tarzan and Jane's relationship. I love how each of them work of each other and how Jane helps Tarzan understand the ways of the human life. The gorillas also have their moments of tenderness and I do like how each of their views of Tarzan are well understandable. I kinda will admit that the villain is sort of weak but he still acts as a major threat to Tarzan even though it's kinda obvious how Disney is hiding the fact that he's really a villain and not a good guy. The way they work the animation is absolutely incredible. it is just mind blowing and how they manage to combine hand-drawn animation with CGI effects. It makes the look of the jungle feel so immersive and lifelike. The action scenes definitely are proof of how great the animation is and it moves at such a fast and steady pace. it's probably some of the most action pack stuff I've ever seen in a hand drawn film. The overall music score is great for setting the mood and any type of scene. Whether there's a heartfelt scene or an action-packed sequence, the music is always there to accompany whatever is happening on screen. Phil Collins wrote and performed a few songs for the movie and I think all of them are heartfelt and catchy. They are all greatly separated from one another and they play their part whenever the moment is right. I love this movie for a lot of reasons but overall, it's just an outstanding piece of magic to behold.","user":"MR_Heraclius","rank":[36,37]},{"title":"The final movie in the Disney renaissance","rating":9,"date":"24 June 2015","review":"From 1989 to 1999, Walt Disney studios created some of the most amazing, mind-blowing animated movies of all time. From the little mermaid to beauty and the beast, from Aladdin to the lion king, from Pocahontas to Hercules, and finally, Mulan to Tarzan, these movies still hold their staying power to today. However, Tarzan was the last of these films, from the period known as the Disney Renaissance. Disney remains a popular animation studio in the public eye, but no one could deny how popular they were throughout the 1990s.<br><br>Tarzan itself is based upon the novels by Edgar Rice Burroughs and the movies from the 1930s. Tarzan is a baby who loses his parents, and is adopted by a family of gorillas, who raise him up as their own.<br><br>For a Disney film, this one is one of the best. For a renaissance film, It's not the best of them. I still like to say that the first 2 (The Little Mermaid &amp; Beauty and the Beast) were the best. I know that some Disney fans would chew on me for not saying The Lion King, but that's just my personal preference.<br><br>I still think it's a great movie, worthy of being part of the collection of Disney's best.<br><br>9/10","user":"The_Light_Triton","rank":[14,14]},{"title":"Wow!! An 11 out of 10, if possible...","rating":10,"date":"5 July 1999","review":"... or no, a 15, maybe.<br><br>This is right up there with 'The Lion King' and 'Mulan'.  I had the treat to see this last night, and through it all, even the toddlers in the theater loved it!  People have said this is a breakthrough animation-wise, but story-wise, this is like mind-blowing.  Tarzan himself is the first truly deep Disney male character since ... I can't think of a really deep Disney male character, except perhaps Simba from The Lion King.  Tarzan has everything that makes you realize that, though he's raised by apes, he's truly human, and even his upbringing can't hide that (C'mon, if you were raised your whole life thinking you were an ape, and then suddenly find out you're really something else, wouldn't you also be disturbed?)<br><br>From the first to the last scene was awesome.  Tarzan and the ape Kala's backgrounds were told briefly, poignantly, and emotionfully.  There's (intelligent) humor and love, which only add to the film, and there's an obvious love between Tarzan and Jane.  Someone here said they're not in love, that it's obvious, but I have to strongly disagree.  The scenes between them are funny and give you a feeling that there's a strong attraction (and not just because Jane's interested in studying apes).  And even Jane's father, though he's a small background character, he helps the plot along, and while you'd describe him as \"dithering\", he has his own funny bone (When Jane is describing Tarzan to him by drawing a picture on a blackboard, she starts to go on about his 'wonderful eyes', and in the midst of her daydream, her father comments, \"Would you like me to give you and the blackboard some private time?\" Riot!).<br><br>No, Clayton's not a Jafar or a Gaston, but he's not really the enemy here; he's just an antagonist to help along Tarzan's inner conflict.  The real enemy would be Tarzan's battling against his 'true' world (the one with humans) and the one he's grown up with (the one with apes).  Clayton just resembles a threat to Tarzan's ape family.  In the past, villains were a direct challenge to the hero; here, he is a threat, sure, but he's not the whole movie here.  I like it better this way.  In real life, there's rarely a big evil soul against you, and Clayton seems like a realistic greedy, nasty guy, rather than the cliche megolamincal weirdos of most animated features.<br><br>I loved Phil Collins.  And while it's great hearing Ariel sing, I think background music was better for this particular movie.  I couldn't see Jane or Tarzan singing; it makes the whole thing almost unrealistic.<br><br>Tarzan himself was wonderful!  Charismatic, emotional, outgoing, and at the same time, goofy and boyish.  The scenes between him and his ape mother, Kala, were so tender.  I haven't seen such wonderful emotions in live-action movies.  And even Kerchak ... let me tell you something about him.  Even my mom said he was real.  I don't think he was too mean.  He felt threatened by Tarzan's presence.  It wasn't out of superiority.  When Kala first shows baby Tarzan to him, Kerchak is worried about the existence of other humans in the jungle, which might endanger his family of apes.  He only worries about his family, too, and I suspect that, while he keeps a stoic face over the death of his own baby ape in the beginning of the movie, he's not ready to adopt another baby (if one of your kids died, would you be so willing to adopt another right away?  I know I wouldn't).<br><br>The Lion King, Mulan, and Tarzan all have the same thing in common; they all show true emotion and character, unlike the basic fairy tale fluff like Cinderella and Bambi (nothing against fairy tales, but I like to see true-to-life stuff, you know?).<br><br>This is a must-see.  If Disney keeps this up, adults may start to change their views of animated stuff.  It ain't just for lil' kids anymore! :)","user":"Aerie-2","rank":[79,100]}]