[{"title":"Funny Enough","rating":14,"date":"14 February 2014","review":"This was bottom of the barrel cinema when it came out. Its not anything you should really have high expectations for when you start into it. That being said, compared to the bottom of the comedy barrel these days this movie is a worthwhile and entertaining entry. <br><br>The supporting cast actually isn't too bad. Other reviewers have questioned the appearance of Alan Arkin in this film, and maybe it is weird, but whatever he's in it. So is Vincent Pastore (\"Big Pussy\" Bonpensiero from \"The Sopranos\") and cameos from Tom Jones and Ozzy Osbourne (a particularly rare depiction of him when he still had some vital essence left and decked out in appropriate mid-90's high fashion.)<br><br>Speaking of the the mid-90's, there's a lot of great footage of New York City in the years right before Giulianni started cleaning the place up. <br><br>Anyways, the movie is funny. Its not the funniest movie ever, but the ad hominem attacks, creative profanity, and silly voices will make you laugh. Its nice to see their skits made into live action, even though the real genius of their humor on their tapes was that the calls were real and the calls in the movie are scripted. <br><br>Its a solid B-grade comedy. If you're expecting more, you have the wrong idea.","user":"weetsy","rank":[3,3]},{"title":"disappointing if you've heard their albums.","rating":5,"date":"23 September 2007","review":"This movie could have been a lot funnier if only they didn't use almost the exact same dialogue from their prank calls. Seriously some of the scenes from the movie are almost word-for-word with the calls. If you haven't heard their \"jerky-isms\" (rubberbeck, sizzle-chest) then this might be funny to you. Anyway the movie is about two \"low-lifes from Queens\", two late-20's guys who can't get a job who still live at home. They end up calling a random number which just happens to be a local mob boss. Johnny Brennan does his hilarious Frank Rizzo voice claiming to be childhood friends with the guy who becomes infuriated after being called \"fruity-a$$\". (the only really funny scene.) Once they meet the boys in person, an arrogant local boy Brett Weir sees them at the same restaurant and clues the mafia in as to who the Jerky Boys really are. So the rest of the movie is basically them trying to outrun the mob. Some scenes following were okay, with a cameo by Ozzy Ozbourne and the NY hardcore band Helmet. In the end when the gang kidnaps Johnny's mom and fits her for a pair of cement shoes, Johnny and Kamal call the newspapers up to expose the mob. The end. A lot of people said the plot was clichéd. Not really, I thought it worked good, it just wasn't EXECUTED properly. And by properly, I mean humorously. The first time I heard the call about the old man with the Mexican immigrant worker it was funny. \"I kicked him in his little hiney\" The second time it seemed rushed, like they had to create a scene where the actions would fit perfectly with the call. This one happens to be made over a call box on a warehouse where the bad guys are standing near, to distract them while the boys escape. Some of the actors, who have played distinguished, critically-acclaimed roles in other movies (Alan Arkin, Vincent Pastore, William Hickey) seem like they're having a REAL hard time saying their lines. They must have needed money. I won't tell you not to see it, because as far as i know it has not been released on DVD. And I can guarantee you can find it for a buck or two at almost ANY movie store. So if you have or haven't heard the prank call albums but you still want to see it, you'll only be a few bucks short if you don't like it.","user":"leathaface","rank":[4,5]},{"title":"A very funny comedy with an actual plot!","rating":10,"date":"16 February 2001","review":"I enjoy a good comedy, but it must have a good plot.  Dumb and Dumber and Road Trip are my two other favorite comedies.  This film is not only damn hilarious, but it provides an awesome story.  The mob elements arent cheesy either, they are actually pretty good.","user":"GCardieri","rank":[10,17]}]