[{"title":"Another good \"kid-in-the-big-leagues\" movie","rating":7,"date":"3 June 2002","review":"For some reason, I get a kick out of movies like \"Rookie of the Year.\" I guess the fact that so many young boys, myself included, fantasize about playing professional sports contributes to the popularity of this genre. I think Daniel Stern did a good job directing this movie because he doesn't ever let it become too kiddy and childish. Sure there are a lot of funny moments, but they can be funny to adults as well as children. The setting of this movie cannot be beat: Wrigley Field. It doesn't get any better than that. \"Rookie of the Year\" is a fun movie to watch with the family.","user":"nucksfan4life","rank":[14,18]},{"title":"Very funny baseball comedy","rating":9,"date":"4 December 2000","review":"\"Rookie of the Year\" is one of my favorite baseball movies. One of the things I liked the most about this movie is that it's set in Chicago, my hometown. Most of the action in the film takes place at Wrigley Field, home of the long suffering Chicago Cubs. It's about a clumsy 12-year-old boy named Henry Rowengartner, who loves to play baseball. However, the kid can't do anything right on the field. One day, trying to impress a girl, he tries to catch a fly ball. But ends up slipping on a baseball lying on the ground and in the process breaks his right arm. After four months of recouperation, the cast comes off. Afterwards Henry's mother gives him and his two best friends tickets to the latest Cubs game. The three boys are sitting in the bleachers when a home run is hit. The ball lands close to where they're sitting and one of Henry's friends recovers the ball. The fans sitting nearby yell at the kid to throw it back on to the field. The kid doesn't want to do it and gives the ball to Henry's other friend who ends up giving the ball to Henry. He agrees to do it. Then an amazing thing happens. Henry not only throws the ball back on to the field, he throws the ball all the way to home plate! The crowd is in stunned silence after seeing this. Who threw that ball? is the question on everyone's mind. When the owners find out it's Henry, they ask him if he would like to pitch for the Cubs. Henry goes bonkers and agrees to pitch. After throwing some practice pitches, the owners and managers discover that he has a 100 m.p.h. fastball. They think this could be the perscription the Cubs need since they're already going through another disasterous season (which is all too familiar in real life). Henry becomes the star rookie of the team as the closer. And the Cubs start winning and begin to turn their season around. \"Rookie of the Year\" has alot of big laughs and a terrific cast. There are four memorable performances in this film. Thomas Ian Nicholas is wonderful as Henry. This actor has grown up since this film (he was most recently seen in the hit film \"American Pie\"), but he's in a role to remember; Gary Busey is also very good as the aging star pitcher known as 'The Rocket' who helps out Henry in certain spots; Albert Hall as the Cubs manager who repeatedly keeps mispronouncing Henry's last name in different formats; and Amy Morton, a Chicago stage actress, as Henry's mother Mary. Some of the most effective moments in the film are with the boy and his mom. Also there are hilarious smaller performances by Eddie Bracken as the Cubs owner; John Candy as the Cubs broadcast announcer; and Daniel Stern (who also directed) in the film's goofiest role as the dim-witted pitching coach. \"Rookie of the Year\" has the usual predictable sports ending, but since this film is so much fun, who cares. There is one obvious continuity error in the film. When they fly to L.A. to play the Los Angeles Dodgers at Dodger Stadium, you can tell they're really playing at Comiskey Park, home of Chicago's other baseball team, the White Sox. You can tell just by that, that this film was shot entirely in Chicago. \"Rookie of the Year\" is a baseball winner in my book.<br><br>***1/2 (out of four)","user":"jhaggardjr","rank":[12,17]},{"title":"Bringing the fun back to baseball","rating":20,"date":"20 November 2004","review":"This movie asks the question: \"What if pro baseball was fun again, like in little league, and not so taken so seriously?\" The device of Henry's miraculous arm allows the story to inject a kid's eye view into a somewhat cynical world. Juxtaposing the sleazy Dan Hedaya's attempted $25 million trade of Henry to the Yankees with the Henry and his buddies taking a day trip on a boat, as well as Henry's adolescent antics on the field, director Daniel Stern is trying to get us to look at baseball, and maybe sports, maybe life, like we did when we were ten. <br><br>I think Roger Ebert, although I agree with his review, took pretty poor notes while reviewing this film. From his article: \"When the cast comes off, his dad takes him to Wrigley Field, and he catches a home run ball while he's out in the bleachers, and then he throws it back - all the way to the catcher behind the plate.\" Actually, he went with his friends, he doesn't even know his dad. And he didn't catch it, his friends pick it up from nearby, and hand it to him because they're scared to throw it on TV and embarrass themselves. Doesn't he have a fact-checker to proof his reviews?<br><br>Second, he writes: \"Henry becomes an overnight celebrity, and is signed to the Cubs by the team's genial owner.\" This ignores the desperation of Dan Hedaya, the would-be owner of the team, who sees the publicity and marketing windfall in having a kid on the team. The sell-out crowd is an important story element, as it reinforces the idea that we are all hungry for baseball to be fun again. <br><br>There's are lots of laughs to be had in this film, although Stern seems to want to indulge in over-the-top hysterics from time to time, such as with the character he was playing. Also, the bilious \"Jack\" who gets Henry's mom to sign a contract without telling her it's a trade to NY, is downright spastic in his final scene. Stern shows a lot of promise as a comedy director if he could tone it down just a touch with the tangential characters. Understatement can be funny, as Busey shows with a few choice glares at the right moments. I loved Stern's allusion to the Wizard of Oz, likening the Emerald City gates to the Wrigley stadium gates, when Henry first arrives to play. <br><br>The Cubs haven't won a Series since 1909. \"And a little child shall lead them...\" Every kid should see this movie.","user":"brian-crouch-1","rank":[7,9]}]