[{"title":"Winona's finest hour","rating":25,"date":"25 May 2000","review":"Winona Ryder is fantastic in this movie - its a helluva part and she plays it for all it is worth.  Whether she is worshipping Joe (the local hunk-deluxe), or watching 'The Singing Nun' on television, she is completely believable. Her relationship with her less-than-perfect Mother (Cher) is also believable. As a bonus, you get Christina Ricci and Bob Hoskins and some beautiful cinematography.  It also has a real feel for the 60's.<br><br>Downsides are one cliche too many (WHY does every movie that takes place in the 60's have to feature JFK's assassination?) and it goes on a tad too long, but its worth watching for sure.","user":"Boyo-2","rank":[23,23]},{"title":"A magic potion!","rating":10,"date":"27 March 2001","review":"A delightful period piece set appropriately in 1963.  Appropriate because Charlotte (Wynona Ryder), like the nation, is about to shed a little of her innocence and face some difficult realities.  Cher, Ryder and an adorably young Christina Ricci are perfect as a single parent family.  Cher, in her best work ever, including Moonstruck, is a free-spirited mom who only cooks finger food because anything else is too much of a commitment.  Ryder, who narrates the film from her character's perspective, is a high school student who, despite her fervent wish to lead a devout life, falls in love with the local handyman.  Ricci is the youngest, a champion swimmer who steals the whole movie with scenes like her pumpkin scene. (Watch it and you'll know what I'm talking about.  It's unforgettable.) Bob Hoskins is hilarious as the shoe salesman who falls head over heels for Cher, family and all.<br><br>Set in coastal Massachusetts, the scenery is breathtaking, and the idyllic depiction of life in a small town in the last days of American innocence is dead on.  Director Richard Benjamin, who also gave us such charming films as Milk Money and My Stepmother is an Alien, rivals Penny Marshall and Rob Reiner with this gem.<br><br>This film is perfection, an absolute 10.  It's a magic potion that can make me laugh and feel good even on the worst day.  I sometimes wish I could step inside a la Pleasantville and stay there.","user":"budmassey","rank":[55,60]},{"title":"A Delightful Little Film","rating":7,"date":"17 May 2010","review":"I've seen this film a number of times, and I always enjoy it. What stands out most about this film is the acting, and the overall feel of the film. It feels tremendously authentic to it's time and subjects. The acting is very good throughout, and the movie is just a very fun, and very human story. One that is easy for almost anyone to relate to in some way.<br><br>There are a number of great performances in this film. Winona Ryder plays one of her most interesting characters, and she pulls it off very well. Bob Hoskins is very strong and enjoyable as usual. Personally I have always loved Cher's acting. I can't say I'm a huge fan of her music, but I've always had some respect for her there too. However her acting has always been very strong in my opinion. I know she has been nominated for multiple Oscars and even won one for Moonstruck. However I still think her acting is somewhat underrated by most people. (And she also gave Nick Cage his first huge break after demanding that the studios cast Cage opposite her in Moonstruck. Cage was thought to be somewhat of a risky bet back in those days, and Cher basically made the major studios take the chance with him. Which I find somewhat funny, and also very Cher like.). Cher also had the original director of this film, and the girl who was originally cast in Winona's part fired. So Winona fans also have Cher to thank for her even being in this film. It's hard to criticize Cher for getting rid of these originals either, seeing as how well the film turned out with the people she approved. She is a very strong minded and hearted woman in my view, and if you take a look at Silkwood, Mask, Moonstruck, and this nice little film. You will undoubtedly also see that this woman can flat out act. She has some other decent films as well.<br><br>Anyway, all in all, I highly recommend Mermaids to anyone that likes character driven film. And basically to any teen, male or female. It is basically a coming of age story in terms of Winona's character, and even for Cher and Hoskins characters to some degree too. :) And there is a lot to relate to in terms of the parent/child relationship, especially the single parent. Those with Attention Deficit Disorder , or those who get bored easy may not get into it however. :) I gave this film a 7, but I'm a pretty strict rater, and this film is a very solid 7 in my opinion. In fact, I'd give it a 7.5 if I could.<br><br>7.5/10","user":"TheAnimalMother","rank":[30,32]}]