[{"title":"Very funny if you live in Smith's world","rating":27,"date":"27 September 2001","review":"I guess that people can be split in two ways - those that like Kevin Smith's films and those that don't.  From watching his films, he seems to like his characters to exist in his strange world where things are exaggerated and ridiculous characters do unrealistic things.<br><br>That sums up Mallrats - it's the story of two friends who both lose their girlfriends and then spend the rest of the day hanging around in the local mall.  Whilst hanging around they meet friends and get into scrapes as they strive to get their girlfriends back.<br><br>I suppose if you looked at it coolly it's all a bit silly - fully of ridiculous situations and scrapes that are resolved in unbelievable ways. But then if you accept Smith's world of comic book style adventures and cartoon film making then this is great.  Whereas his later Chasing Amy brings adult subjects into the comedy - this is pure cartoon comedy, although understand it's not dumb like slapstick - but crazy, clever humour with plenty of jokes occuring all around the main action.<br><br>OK the overall plot is weak at best, but the story is more about the characters and the situations along the journey to the end of the film and here is where Smith wins.  He has created crazy characters that are funny and often exaggerated versions of people or of people's reactions to situations (witness the magic-eye poster guy for an example of exaggerated humour).<br><br>Lee is fantastic, this is the role he was made for - he reacts in an exaggerated way to everything and really hams it up.  I suppose he's a comic-book reading loser but in this world he is funny and in control.  He is loud and abusive to others and it's great!  Jeremy London is a weak straight man and doesn't really convince.<br><br>Jay &amp; Silent Bob are good as always - although for most of the movie they exist in their own little subplot of taking on the mall police.  Again their adventures are exaggerated for humour.<br><br>If you hated Clerks and Smith's other movies then you'll hate this. However if this world is one that appeals to you then you'll love this movie's reckless abandonment of reality and enjoy the adventures involved in a trip to the mall.","user":"bob the moo","rank":[63,82]},{"title":"Best watched with eyes closed?","rating":6,"date":"6 July 2003","review":"As most Smith fanboys know, Mallrats has been trashed critically, financially (bad box-office) and by a lot of Smith's own fan-base.<br><br>\nPersonally I like it. Even without watching the DVD with commentary by Smith its obvious that this outing was backed by Hollywood, emitting a polish and lack of gloom that his other films don't have and thus gaining flack over its lack of \"Indie\" look and feel and hammy storyline. Had this film been in black in white, shot using a cheaper production method, or had a less happier ending, it possibly would have fared better with the fans than it did.<br><br>Listen to the dialogue though and its soon apparent this is indeed pure Smith. And it shines. The long diatribes about seemingly nothing, the anti-establishment rumblings of Brody (who ironically spends a lot of the film clarifying escalator ettiquite and other mall law), and a bigger involvement of Jay and Bob (but not too much) make this as good, if not better than the other Kevin Smith films and quite possibly my favourite of his.<br><br>Its hard to rate this film, you'll either really like it and give it a 10 or tuck into another chocolate pretzel after giving it a 1.","user":"bradc-2","rank":[57,74]},{"title":"Excellent satire","rating":10,"date":"12 April 1999","review":"This movie is really extremely funny.<br><br>That is, if you are into either Comics, Science Fiction or Shopping Malls.<br><br>The basic idea is simple: Two dumped guys try to win their girl-friends back, and their brilliant strategy is to hang around in the local shopping mall.<br><br>What makes the movie work is the wonderful mix of slap stick humor, intelligent puns and gross sexual innuendos. The actors are excellent in their roles, and I was surprised to see Ben Affleck and Claire Forlani, two coming actors, credited for supporting roles.<br><br>For a comic fan this movie is a awfully funny experience. But I can imagine that the film looses some of its appeal when you are not familiar with the Marvel and DC comic heroes and the strange passion (and science) of collecting comic books.<br><br>And to everybody who has also failed in seeing a sailboat in those dumb 3-D-pictures, this movie provides some comfort...","user":"Starbuck-13","rank":[44,63]}]