[{"title":"Unsung little gem","rating":7,"date":"4 November 2002","review":"I only caught the last half of this on cable yesterday but I was able to figure out quickly what was going on.  I didn't intend to watch it, but I couldn't stop!  It's a weird little tale filled with pitch black humor (that's probably why it barely got released), some neat twists and turns and the cast giving it their all (especially Anthony Michael Hall and cutie Craig Sheffer).  I didn't quite understand the identity of the narrator at the end (I'm assuming it was the girl) but, that aside, it really works. I'm not sure where this was shot but it gives you a real feeling for the Deep South.  <br><br>A sick, funny little movie.  Worth catching.","user":"preppy-3","rank":[10,13]},{"title":"classic trash.","rating":27,"date":"27 July 2001","review":"I really hate to use the term \"guilty pleasure\" but here, it seems to be fitting.  I caught it late one night on HBO or something like that.  Anyway, I got into it and missed the ending so I had to order a copy.  I'm glad I did.  The movie hits that \"Tales From the Crypt\"  feel right on the head. There is not one likeable character in the whole thing.  All of the jokes come on time and the black humor is right on target.  The Southern atmosphere does its work, giving everything a creepy atmosphere.  I enjoyed all of the performances. Anything with Keith David involved usually has it's rewards.  His performance in this was fairly brief, but enjoyable.  In fact the whole thing was enjoyable and highly entertaining.  There is not a dull moment in the whole thing and the plot twists come at a rapid pace.  Just be on your toes to catch all of the references and jokes.  I's full of 'em.","user":"billybrown41","rank":[10,14]},{"title":"More to this movie than meets the eye...","rating":9,"date":"18 December 1999","review":"I casually watched this one night on cable and giggled at the small details such as the Southern vernacular and wise sayings, the classic Rush t-shirt on Mr. Hall, the pot smoking Cletus, etc...  Since then I've seen this 6 times and love this movie now!  It's a bit of a classic to me.  It has a great ending that will make anyone smile and the intricacies of the movie come out if you really pay attention.  This gets **** from me.","user":"athanaric","rank":[10,14]}]