[{"title":"A \"feel-bad\" roughie porno movie","rating":31,"date":"31 July 2007","review":"This is one of those 1970's porno films that achieves a level of nihilistic misanthropy and general malaise rarely seen outside of an Italian cannibal film (which is actually why I watched it--it sure wasn't for the thoroughly unattractive performers and unappealing sex scenes). It's kind of hardcore version of the ultra-depressing sexploitation film \"Toys Are Not for Children\". They should show it to sex offenders because it will make them want to castrate themselves with a rusty kitchen knife (or at the very least put them off sex for awhile).<br><br>As in \"Toys\" the movie is about a young woman who is obsessed with the father who abandoned her to a brutal orphanage. This leads her as an adult to seek out sexually abusive relationships with men including an associate of her father's who violently rapes her the first time they meet. Meanwhile, she neglects her nice guy boyfriend, who takes up with a skanky prostitute and turns into quite a misogynist himself. But this film isn't only about misogyny, it's also about necrophilia, including, not just one, but two orgies set in a funeral home. The ending is not as much of a surprise, but is every bit the brutal punch-to-the-gut of \"Toys\" or its most famous hardcore contemporary \"The Devil in Miss Jones\". The violence towards women is pretty disturbing frankly, but it's obviously meant to be disturbing, which actually makes it LESS disturbing than true sicko porn films like those of Sean Costello or Zebedy Colt. And the audience sympathy here is always with the woman rather than the abusive males.<br><br>If you're like me and you really hate \"feel-good\" romantic comedies, you should seek this out as it is the EXACT opposite--a \"feel-bad\" roughie hardcore porno movie. God knows, the world needs that sometimes too.","user":"lazarillo","rank":[17,23]},{"title":"A Great! Porn Movie","rating":10,"date":"20 May 2011","review":"I think it was an excellent movie for the time that was made and the characters have some depth,I don't know why some of the reviews on this movie were so harsh, I think the main female character has love and trust issues because of having been abandoned by here father,so she will not connect with her boy friend,but it is easy for her to connect with someone who doesn't love her,and her boy friend loves her so much, even after he is rejected by her through the years ,that he uses a lady of the evening as a substitute for her.And I will admit I did not understand the ending,but this movie is what a porn movies should be,good acting,and a storyline and sex.","user":"idenn3","rank":[6,8]},{"title":"A Bizarre and Dark Story","rating":3,"date":"3 June 2017","review":"Baby Rosemary (1976) <br><br>*** (out of 4) <br><br>After her mother died, Rosemary (Sharon Thorpe) had to grow up in an orphanage. Years later she has many mental and sexual issues related to her father. When she goes to pay him a visit she is violently raped by a man and another woman, which sets her mind off yet again. A few years later she returns and learns that her father and now died and this begins more trauma.<br><br>BABY ROSEMARY is not a porn take-off on the Roman Polanski film, although the title certainly suggests that. If you're into fun porno movies or adult movies that are basically meant to have your shorts around your knees then it's probably best that you stay away from this John Hayes film. This here is more like a psychological drama that uses sex as something extremely ugly and vile. This is a very downbeat film so it's appeal is going to be limited but it's certainly an interesting film.<br><br>I had never really heard of this film, although I knew its director from his horror films GRAVE OF THE VAMPIRE and GARDEN OF THE DEAD. Those two films look like a cheerful Sunday morning compared to this one. I'm not going to sit here and say that the story itself was ground-breaking because it really wasn't. At the same time you have to give the writer-director credit for even attempting to use sex in such a dirty and negative light. There have been porno movies that took on dark themes but this one here is pretty darn grim from start to finish.<br><br>To me the most impressive moment of the film happens at the very end when there's a bizarre orgy set around Rosemary's father's casket. This entire sequence was rather creepy on a number of levels but the dark atmosphere that hands over it just has you walking away from the film feeling quite dirty for even watching it. I also thought Thorpe was interesting in the lead role. In reality, whenever she had to deliver lines I thought the performance was at its weakest but outside of the line reading I thought she was very good. Especially during the quiet moments where her character is in fear, the actress really brought these to life.<br><br>Again, porno films have a very limited appeal to begin with. Add in such a dark subject matter and the bizarre story structure and it's doubtful BABY ROSEMARY is going to be a film that most will be attracted to. With that said, the film is certainly a good one and it's bizarre atmosphere makes it stand out from the crowd.","user":"Michael_Elliott","rank":[4,6]}]