[{"title":"Perfectly tolerable...even enjoyable!","rating":19,"date":"19 November 2003","review":"No one in today's Hollywood is going to truly outshine past pairings such as Clark Gable and Joan Crawford, Cary Grant and Grace Kelly or even Rock Hudson and Doris Day.  They simply had too much mystique and showbiz magic behind them for the tabloid-ridden stars of today to compete with.  However, based on what's out there today, Clooney and Jones make a delicious, gorgeous pair.  In this frothy, sometimes manic production, Clooney stars as an ace divorce attorney.  So successful is he that he can turn around even the most airtight cases.  Yet he has it all and is bored.  After he pulls the rug out from under one of his clients' wives (Jones), she sets out to exact revenge upon him.  The two play a cat and mouse game of I-got-you and you-got-me, with their actual feelings occasionally rising to the surface. Clooney is charm epitomized.  His jaw-dropping good looks are actually beginning to show minor signs of wear (check out his cheek pores in that opening teeth cleaning sequence and note the onset of wrinkles and rasp in the voice -- though he still looks like a god in kind lighting), but thankfully, he's become such a decent actor that he should have no problem continuing a strong career.  In this, he is comparable to Cary Grant, who remained attractive right up until his death.  Unfortunately, he doesn't have QUITE the skill that Grant had, but he'll do.  (Some of the lingo and jargon that Clooney has to emit looks and sounds like it's over his head.) Jones is astonishing.  She has, without question, that old time glamour and the finely honed talent to carry her roles.  Her face, clothes, hair...everything is stunning.  Together, the two are blisteringly attractive and charismatic.  The supporting cast is great here with Rush (in a surprisingly tiny role) hamming it up well and Thornton presenting another one of his oddball characterizations.  Also of note are Cedric the Entertainer who is less annoying than expected and especially Adelstein as Clooney's adoring, sentimental cohort.  (And it's fun to see Duffy get a big screen role which beautifully utilizes her brittle, nose-in-the-air persona.)  One of the funniest and most shocking moments in the film comes courtesy of Keyes who plays an asthmatic hit man.  The whole film is peppered with odd little characterizations, some funny, some intriguing, some just bizarre.  (The diner waitress is hysterical.  The hunky pool man is perfect.  Clooney's boss is unintelligible and just plain weird.)  The film seems to take place in it's own little world, which can sometimes be quite different from the one the rest of the audience lives in.  The quirkiness and farcical nature of the film occasionally threaten to cross it over into Zucker brothers territory, but ultimately it keeps it's feet on the ground.  A couple of familiar or dull moments can't dampen the spirit of the whole.  The stars are deliriously attractive, the story has a few surprises along the way and the film is very easy on the eyes and often entertaining to the ear.  There's also a delightful title sequence inspired by vintage Valentine cards.","user":"Poseidon-3","rank":[58,79]},{"title":"Not intolerable, but","rating":29,"date":"29 October 2004","review":"George Clooney stars as a self-loving whiter than white toothed lawyer who is becoming bored with his never-ending success. A challenge comes in the shapely form of Marilyn Rexroth (Catherine Zeta Jones) who wants to marry (or preferably divorce) her way to riches. With Clooney hired to represent her soon to be ex husband, he inevitably falls for the gold diggers charms.<br><br>Directed by the Coen brothers, a directorial team who have helmed oddball comedies such as 'Fargo' and 'O Brother, Where Art Thou?' this is the team's first branch in to a high profile Hollywood film. Clooney, as the sharp suited lawyer, is excellent. Like Cary Grant or David Niven, Clooney is able to mock himself without compensating his screen appeal. Catherine Zeta Jones as the money hungry Marilyn is as sexy as her character demands from the scripted page. However, despite the quick fire dialogue, Intolerable Cruelty is simply not as funny as it thinks, it's cynical message of love and money taking away the romantic push it needs to place it in the league of the Tracy/Hepburn films the movie aspires to. Clooney's character also suffers from an over enthusiastic plot that later drives his character to attempt to commit a crime that totally contradicts the audiences perception of him. A battle of the sexes comedy that has sex appeal but no romance, Intolerable Cruelty is a film that reaches for the golden age of Hollywood but only touches the bronze.","user":"warnerclassic","rank":[94,134]},{"title":"Quite Tolerable After the Second Viewing:","rating":7,"date":"7 February 2005","review":"I saw it recently for the second time, and even though the huge holes in the plot are still there, I liked it much more than the first time. Thinking of the holes, Coens are very talented artists - perhaps we, the audiences are supposed to be smarter than Miles Massey (George Clooney - perfectly cast) - the very successful, always victorious divorce attorney for the rich and famous? Massey is the author of unbreakable \"Massey's Pre - Nup\" but he is so bored and restless than maybe he is waiting for someone who would be able to break it? Enters cool and sensual Marylin Rexroth (who looks exactly like Catherine Zeta-Jones), the woman who is after \"wealth, independence, and freedom\" and who \"eats the men like Massey for breakfast\" with the glass of French red wine Château Margot, 1954. Thus starts the game of wills, wits and desires with twists in every turn. Some of them are surprising and clever, some - predictable. \"Intolerable Cruelty\" may not be the best Coens' film but it is enjoyable, stylish, and funny. At least two scenes closer to the end of the movie are absolutely hilarious.","user":"Galina_movie_fan","rank":[31,42]}]