[{"title":"Extremeley Powerful, With Superb Performances","rating":10,"date":"2 September 2005","review":"A film fully deserving to be in IMDb's top 250, Jim Sheridan's \"In The Name of the Father\" is an excellent piece of work. Based on a true and very touching story, the film recounts the story of Gerry Conlon (Day-Lewis) who is wrongly accused as an IRA terrorist. Not only are the police bending the facts to prove their case, but in the process they also implicate members of his friends and family, including his father Giuseppe (Postlethwaithe) whose health condition is rather frail. Gerry is a rebellious and mildly delinquent boy who does not seem to have grown up, and his attitude toward his father is not the appropriate one; however, as they start to go through the ordeal together, Gerry gradually matures, and starts feeling a deep affection and respect for Giuseppe.<br><br>The story is heart-breaking and shocking at the same time, all the more so when one realizes that these things actually DID happen. Although there have been some minor modifications for the purpose of the film, the backbone of the story is left completely intact.<br><br>The two protagonists, Daniel Day-Liewis and Pete Postlethwaithe are delivering powerful performances, and they both deserved the Oscar hands-down. However, it would be unfair not to mention that virtually everyone in the film is great in his/her role.<br><br>Jim Sheridan's direction is also very good, giving the plot a fair and balanced perspective; although the film might initially appear as pro-Irish / anti-English, in fact I consider it as quite objective. Granted, it vividly shows that some key figures in the London police were profoundly biased and manipulated maliciously the case against the Conlons; yet, it also shows that English public attitudes turned highly supportive for the Conlons' freedom when it started to become clear that they were not the culprits for the atrocities they had been charged with. We have always to remember that the film depicts a period of big tensions, with emotions running high to levels of hysteria, so we have to understand the events within this context.<br><br>Of course, what happened to the Conlons is totally deplorable and unjustifiable; and it is real shame that the people who conspired against them have not been punished yet for their crimes. Still, one should understand the hostile attitude shown by those who were not part of this conspiracy (such as the judge, for example), who were influenced by the climate of terror and the outrage of the public. The Conlons had the terribly bad luck to be at the wrong place, in the wrong time, and with the wrong nationality; the also have the great misfortune to be captured by people who in their quest to show results were shamelessly willing to risk indicting people who could possibly be innocent.<br><br>\"In the Name of the Father\" is a fantastic film, which one should not miss. 10/10.","user":"jcanettis","rank":[113,122]},{"title":"Ignores major facts to make its case but is still a good film and an effective piece about injustice","rating":23,"date":"23 August 2004","review":"Gerry Conlon is a small time Belfast thief who gets excluded from Northern Ireland by the IRA for anti-social behaviour and goes to live in England with his old school friend Paul Hill. They are in London when the mainland bombing campaign becomes more intense and they are both picked up for the bombing despite their claims of innocence. After more than week of beatings, abuse and threats, the two men break and sign confessions, longing for the beatings to stop and hoping the courts would see through the lies. However they are found guilty and, along with other relatives, sentenced to time ranging from 14 years to life. As time goes on Gerry and his father campaign for their case to be reopened until, eventually, the lawyer Gareth Pierce takes up the case.<br><br>I came to this film having not seen it since its release in the early 90's, at which time I was still living in Northern Ireland in a mostly Protestant area. Given the subject matter the film was well received in this area. I decided to rewatch the film last night so that I could review it for this site and, since first seeing it, I have actually more of an insight on the subject matter since I had been held without charge under the same legislation that held the Guildford Four and had been taken to court twice before the charges were entirely dropped. I say this not as some claim to having a more valid opinion than anyone else but simply as a counter to those who will accuse me of being biased on the basis of being a Protestant.<br><br>While I can see myself that the majority of reviews here for this film are slanted and full of political bias I will attempt to keep my review as free of this as I can (either one way or another).<br><br>Despite the fact that the film leaves out glaring facts, none of these facts actually affect the film's main thrust  that these men were (for this crime) unjustly accused, tried and convicted. The facts that are ignored are those which would have made the film a bit more complex (eg Hill's membership of the IRA) and I can understand why the makers decided to just make the subject as clean cut as they could and not present the audience with anything that may cause them to be in any doubt about what they are meant to be feeling. I can understand why they did it  but that does not make it right and I would have welcomed a more complex film because those of us from Northern Ireland know that nothing is ever as simply as right/wrong, black/white  but Hollywood is not there to inform but to entertain and hence the facts get lost on the road to a good film. And it is a good film.<br><br>It is frustrating that people take what it tells them as fact but this doesn't take away from the fact that this is a well made, engaging and quite moving film. Regardless of political beliefs, the idea of a justice system that would do this is interesting and worrying to me, and the film does a good job (albeit it overegged) of letting us see the extent that the police went to to get, if not 'their man', then at least 'a man'. The film does well to deliver characters (although simplified) that are easy to get behind and they helped me get involved in a story that was already pretty involving in its own right. The direction feels professional and injects enough emotion and sense of anger into the film to give it a solid sense of pace without it ever really tipping over into sentimentality or out and out preaching/ranting. Of course the material also helps from a great cast that deliver well and do their bit to keep it edgy and not sentimental.<br><br>Day-Lewis is a very good actor and he does well here making his Gerry go through the stages of being a cheeky young man, frightened, shell-shocked, defeated, angry and then driven without us ever thinking he is a different character. If anything it is a shame that the film did paint his character so clean because I think Day-Lewis could have easily handled the moral complexities that would have come with that territory. Postlewaite is the real emotional heart of the film in many ways and he does very well with a role that could easily have been cloying and sentimental  but Postlewaite plays it straight till the end. Thompson is all too simple and upright and her performance is little more than a cameo; this is made worse by the fact that the vast majority of English people are biased and corrupt according to the film  again, like leaving facts out, just an attempt by the film to simplify things to make the audiences' emotions clearer and stronger.<br><br>Overall I like this film but it is not a perfect piece of cinema nor should it be taken as the whole story. The film has dropped facts and directed its presentation to ensure that we, the audience, are in no doubt over what we should be feeling and thinking throughout. This does not change the message of the film or the injustice of the things that happened but it doesn't do justice to the always-complicated situation that is my country. The film as a film is very good  well acted, well paced, well directed and engaging from the early realistic shots of Belfast in the 1970's through to the 'I'm going out the front door' finale that is no less impacting for us knowing it is coming.","user":"bob the moo","rank":[174,203]},{"title":"Stunning.","rating":10,"date":"29 March 2001","review":"Words cannot accurately describe how affecting this movie is.<br><br>   The story itself is harrowing, but the way in which Day Lewis portrays Gerry Conlon is heartbreaking at times.  Several scenes in the film may be hard to take for those with a sensitive nature.<br><br>   Captures the mood and the time perfectly for someone like me, who is not Irish, lives nowhere near Guildford and wasn't even alive at the time of the pub bombings.<br><br>   I really wasn't expecting anything special when I sat down to watch this. I could not have been more wrong.<br><br>   The soundtrack is great without exception too!<br><br>   A total and utter classic.","user":"Howlin Wolf","rank":[122,145]}]