[{"title":"Charming period drama, beautifully played.","rating":2,"date":"2 May 2002","review":"I had wanted to see this film for some time and when the opportunity finally materialised I was enthralled. It is probably the best performance I have seen by Maggie Smith, who often seems to be playing the same character actually. But this is her best since Miss Jean Brodie, and Joan Plowright, Judi Dench, Lily Tomlin and Cher are all equally impressive.<br><br>The settings are skilfully designed to draw the viewer in, and when you are setting your movie in Florence and its environs you can't go wrong anyway. The ongoing clash between two worlds i.e. Lady Hester Random (Maggie Smith) versus Elsa (Cher) reaches a satisfying resolution which it would be unfair to reveal.<br><br>There are splendid comic vignettes mixed into the overall drama. Judi Dench and her dog being thrown out of the cathedral, sharply contrasts with the chilling moment when the Jewish arts professor is taken away by the Gestapo. Understated but none the less effective, probably more so, because of it.<br><br>If you haven't seen this film, see it as soon as you can.","user":"rondav","rank":[33,34]},{"title":"Simply Wonderful","rating":4,"date":"4 February 2004","review":"This film is one of the most touching and lovely films that I have seen in many years. Its gaggle of actresses are second to none and turn out excellant performance, Joan Plowright in particular brings an irresistable sweetness to the role. People who have commented on the film so far seem to have neglected to mention the soundtrack which is beautiful and inspiring with a wonderful piano piece. Criticism that the film is too old fashioned or that the characters are unappealing and pompous seems to miss the point, the very charm of Hester (Maggie Smith in particular)is how she overcomes her snobbery at the end and realises how much Elsa (Cher, who in any other film would doubtless be misplaced but in this case fits the role like a glove) has done for the Scorpioni. In short the film is a relic of a gentler age and is simultaniously uplifting, upsetting and relaxing. I implore everyone to hunt down the soundtrack on CD to the ends of the earth if necissary.","user":"spanishflea50","rank":[50,55]},{"title":"Un tè con mussolini é bello!","rating":9,"date":"15 May 1999","review":"This film could have been titled 'four crazy grannies' for the marvelous portrayal of little old ladies, each more eccentric than the next.  Like the comedy team of Matthau and Lemon, Dench, Smith and Plowright have a chemistry that is explosive.<br><br>Maggie Smith played a role that she has spent a lifetime perfecting.  She captivates us as a snobbish dowager, tantalizes us with her improbable tea party and brings us to tears when she demonstrates her capacity to grow.<br><br>Although she may not have wowed us with her Shakespeare, Joan Plowright's compassion for her sudden charge made me wish (that at age 32) she would adopt me.  Her love of the classics, remind us that art, literature and friends can help us transcend life's constant miseries.<br><br>Cher demonstrated that she could act in any time period.  While Dame Judi Dench (not allowing herself to be typecast as a Queen) portrays a particularly pitiful creature as an aging artist with more passion than talent.<br><br>This film sends a clear message to Hollywood: experience and talent win out over T&amp;A.<br><br>Applause at the end of this movie is to be expected.<br><br>Brava!","user":"WillieC3","rank":[33,37]}]