[{"title":"Well worth a look! Both Jolie and Washington are on form","rating":8,"date":"9 March 2005","review":"I've read quite a few comments on this movie and some of them I disagree with and others I don't. Sure, it may be a little predictable and a bit 'all been done before' but there is a certain level of originality and uniqueness to it also.<br><br>For starters it has a fantastic cast and both lead actors (Jolie and Washington)have won Oscars and thats says something. It can't be easy playing a paralysed man and remaining so still and wooden and he plays the frustrations and emotions so realistically that I would imagine a person actually would be like in real life. Jolie is charming, composed and works well with the camera. Her character is convincing enough and this goes for her performance.The support cast is fantastic too, especially Queen Latifa.<br><br>The film may have the usual iconographic elements found in the psychological thriller genre but they are necessary for it to firstly conform and also progress. 'The Bone Collector' introduces new techniques and a slightly different angle for the viewer. there has to be a certain amount of repetition with this genre for it to work and this is the case for many others, such as romantic comedies and a couple falling in love or teen flicks with a football jock character.<br><br>I am currently writing my degree dissertation on sexual subjectivity in psychological thrillers and this film is perfect for that. The changing levels of gendered representations is very interesting and both supports and detracts away from the current representations in society.<br><br>I say, give it a go! Don't listen to people who have already seen it and didn't like it. If I'd have done that then I wouldn't have given it a go and my dissertation would have been short of argument!","user":"denise_kate","rank":[71,88]},{"title":"Dark, suspenseful thriller worth seeing","rating":7,"date":"7 July 2001","review":"Denzel Washington plays a former cop who is injured in the line of duty and becomes a crime scene investigator and expert witness in the service of law firms.  Angelina Jolie plays a cop who is struggling to find a place within a male-dominated police culture, and shows a talent for crime scene investigation, which Denzel's character immediately recognizes and appreciates, since he is bedridden and physically unable to go to most crime scenes.  She is reluctant to get involved, but does wind up grudgingly serving as his eyes and ears as they try to follow clues left by a serial killer who gives clues about his next victims and taunts them and the police.<br><br>While Denzel's character is almost too brilliant to be believable, if you can overlook that you should thoroughly enjoy this movie.  Denzel and Angelina, together with cops of varying competence, try to follow the clues given to them by the serial killer, who gives them clues before the killing actually occurs.<br><br>Most people who enjoy a dark, suspenseful movie (such as Silence of the Lambs) should thoroughly enjoy this movie.","user":"jimjba","rank":[77,100]},{"title":"my opinion may not be shared with most critics, but I liked this movie","rating":7,"date":"18 October 2008","review":"I am fully aware of the fact that most film critics here in the United States did not approve very highly of the 1999 Denzel Washington film \"The Bone Collector\". But despite the fact that only twenty-eight percent of them would agree with me, I think that \"The Bone Collector\" is a well-made mystery thriller with solid performances, especially toward Denzel Washington and Angelina Jolie, a good plot, great tension, and a well-executed story.<br><br>Academy Award-winner Denzel Washington plays a quadriplegic detective who is asked to help with an investigation dealing with a serial killer operating in New York. He appoints a rather reluctant female detective played by Angelina Jolie to lead the investigation outside his hospital room since he cannot walk himself. He communicates with her through radio, giving her hints and tactics as they try to figure out who the killer is, who he will strike next, and how they can stop him.<br><br>Yes, this plot is one that has been reused many times and this yet another case. But just because you reuse a plot does not mean the end product is going to be horrible and not entertaining. I myself enjoyed \"The Bone Collector\" and did not find one scene where I was bored, even though I had a pretty good idea on what was going to happen next. It gets a strong rating for its performances, action scenes, and good general entertainment value.","user":"TheUnknown837-1","rank":[11,12]}]