[{"title":"A Real Gem","rating":10,"date":"3 August 2001","review":"A terrifically good little film with a slick and funny script, consummate actors allowed to strut their stuff, a tight edit, and a wonderful sort of black humour that had me laughing out loud.  Yes, it's fairly predictable, but I didn't mind knowing where it was heading because it was so much fun getting there.  <br><br>That said, it's not a film for everyone.  It's sort of a \"Pretty Woman\" meets \"Fargo\".  If that combination doesn't appeal, then this film probably won't either.  But I thought it was a real gem.  Two big thumbs up.","user":"Kiwi-7","rank":[50,58]},{"title":"Surprising casting, great acting, ambiguous message (and that's a good thing).","rating":8,"date":"18 July 2006","review":"If you don't like movies that are adequately summarized in a 20 second spot, if you do like to see actors work against stereotypical expectations and do it well, if you don't believe people or endings are all good or all bad and you're OK with that, this might be a movie you will want to add to your collection. DeNiro is doing the expected only in that he is practicing his patented shape shifting technique -- I found his characterization both believable and involving. Murray gives his first great serious performance -- who knew he could be menacing? Uma is hard to figure, in the way conflicted people often really are. David Caruso gives the most out-there performance I have seen from him, and in this movie it works. (I didn't know him in his first TV cop series, but this character is nothing like the one he plays in CSI Miami.) You might even find yourself rethinking what really happened, and liking that, too.","user":"freesharon","rank":[27,32]},{"title":"Unusual and Outstanding","rating":10,"date":"9 January 1999","review":"A rare film that is as unusual as the acting performances are strong! The movie is funny, exciting, and serious content all wrapped into one. This one is really worth renting or adding to your personal video collection. Robert De Niro, Bill Murray, Uma Thurman, and David Caruso provide superb performances. The story is hard to pin down, but it seems to really be about friendship, love, and unspoken desire of all men to become brave heroes. You will need to watch this one a couple of times before you can figure out what happens. Does the main character overcome the villain, or is the villain purposely providing the means to make the main character's dreams come true out of friendship? You will have to be the judge.","user":"Clarke-2","rank":[10,11]}]