[{"title":"Anaconda (1997)","rating":6,"date":"22 January 2012","review":"It's a stupid B-Movie with enough quality to fly by, and enough camp charm to get away with such cinematic crimes. The cast play it straight, apart from Voight. I'm pretty sure he was drunk during the shooting, coming out with an inexplicable accent and a look reminiscent of Hannibal Lecter. It's ridiculous fun, with hokey CGI and animatronics. The animatronics are great and make me miss the 90s. It's a big snake shaped tube and goes from slow robotic motions, to super fast CGI. Cube and Hyde manage some, at times, adorable dialogue. Voight's presence also unites the rest of the cast, and each character gets their own heroic captain moment. Fun filled and just plain bad. I loved it.","user":"SnakesOnAnAfricanPlain","rank":[41,43]},{"title":"An entertaining creature feature","rating":8,"date":"15 June 2015","review":"Heading into the Amazon, a documentary team studying a long-lost tribe runs afoul of a hunter searching for a legendary anaconda and are forced to help him track the deadly creature.<br><br>This was a decent and quite enjoyable creature feature. One of the better features here is the rather impressive pace that runs throughout here, as this one runs along pretty quickly with the introduction getting started immediately, picking up the hunter is right after that and the snake attacks carry the action throughout the rest of the film. Those action scenes are all quite fun, from the opening poacher attack, the search on the abandoned boat and the first battle with the creature as they try to wrangle the water-bound snake from their boat only for the resulting chaos it it's escape to set the stage for its' later scenes. That is the film's best part which is the final half hour as there's a large amount of ambushes and attacks here, from the trap at the waterfall where there's the fun water-chase with the creature coming after the swimmers in the water trying to dislodge the boat before finally getting to the spectacular waterfall confrontation catching the fleeing victim in mid-air before crashing into the boat below to the greater fun of the big chase through the abandoned warehouse. From the hunter's trap and eventual escape to running through the different levels with the creature continually crashing through the surroundings and finally getting rid of the massive snake in a fiery blast, this packs a large amount of action, suspense and rather impressive moments into it. Along with the enjoyable animatronic special effects for the snake, these are more than enough to hold off the few flaws in here. One of the bigger flaws is the fact that the first half here plays off as more of an adventure film about the exploration of the Amazon who stumbles upon a suspicious snake-hunter who alters their course for his own needs. None of this is handled with the sense of urgency in getting the snake out in a film about a giant killer snake as it moves the film along the needles detours simply to get the point across aren't all that tied into the exploits of a creature feature. There's also the films' tendency to go a little overboard with the special effects here as the use of the CGI snake isn't nearly as convincing as the puppets, act way too slick and have very little depth to it as the performed actions during these scenes give away its' origins. It's not enough to hold this one down, but the other problems here is where the flaws are.<br><br>Rated PG-13: Violence, Graphic Language and some mild animal deaths.","user":"kannibalcorpsegrinder","rank":[23,25]},{"title":"Simply dumb fun, as only 1997 could have delivered.","rating":6,"date":"29 July 2009","review":"Before there was \"Snakes on a Plane,\" there was \"Anaconda,\" a Hollywood B-movie from the late 90's that is as notorious for its mixed bag of actors as it is for the gruesome snakes that populate its plot. In the film, a group of documentary film-makers traveling through the Amazon jungle picks up a mysterious man who inadvertently becomes their tour-guide on an unexpected detour. It seems the man is totally crazy and intends to capture one of the Amazon's most notorious and deadliest inhabitants: The Anaconda.<br><br>Despite some bad looking CGI-snakes (not bad in a good way) and a horribly mis-matched cast (J-Lo and Eric Stolz? Really?) \"Anaconda\" is simply a good, dumb time. Without a doubt, it's an utterly ridiculous film that can be insulting to your intelligence, but thankfully it knows not to overstay its welcome and the 90 minutes it takes up makes for a harmless and amusing ride. Ice Cube plays Ice Cube as he always does, while J-Lo turns in one of her more likable roles. You'll also catch Owen Wilson in one of his earliest roles, and John Voight is a pleasure to watch as he eats up the scenery. But face it, this movie is about snakes, and the titular character is the true star here. Surely, the actors on hand have done much worse, and as far as horror/b-movies about snakes, you could pick up much worse yourself. If you enjoy watching giant snakes (who inexplicably scream) stalk rappers, pop-stars and Angelina Jolie's dad, this is the flick for you. Those seeking genuine thrills, however, may find the film coming up a bit short.","user":"Mr_Censored","rank":[28,32]}]