[{"title":"Bring me the heads of Hitler, Himmler, Eichmann n Mengele.","rating":10,"date":"9 September 2013","review":"Schindler's List is undoubtedly the best Holocaust film ever made. There just isn't anything like this film. Various other films have tried to show the true horrors of the Holocaust, but none of them succeeded the way that Schindler's List did. Schindler's List is a difficult film to watch. When you see the true atrocities of the Holocaust, your jaw drops. When you see the pain that all of the innocent people were going through, the only thing you can do is cry. The true goal of all Holocaust films is to make you feel sorrowful, and Schindler's List did that to me. If you want to see the best depiction of the Holocaust, make your way towards Schindler's List.\nMe n my kids cried during the pit scene.","user":"Fella_shibby","rank":[217,265]},{"title":"A SINGULAR ACHIEVEMENT","rating":11,"date":"11 December 2000","review":"I have only ever seen this film once, I only ever want to see this film once and I will only ever need to see this film once. It is etched on my mind. I, like many others, left in silence.  I could not imagine inventing a critical analysis of this film, picking small points of detail or of style, or even scoring points off the Director. It stands alone as a monumental piece of cinema, a magnificent accomplishment.","user":"vtburns","rank":[108,131]},{"title":"Schindler's List Is The Greatest Film About The Holocaust","rating":10,"date":"25 October 2011","review":"Schindler's List is a film about Oskar Schindler, a German businessman who saved the lives of more than a thousand mostly Polish-Jewish refugees during the Holocaust by employing them in his factories.It stars Liam Neeson as Schindler,Ralph Fiennes as German officer Amon Göth,and Ben Kingsley as Schindler's Jewish accountant Itzhak Stern.The film was directed by Steven Spielberg which was based on the novel, Schindler's Ark by Thomas Keneally. <br><br>In the movie,Schindler is a greedy German businessman.Then he becomes unlikely humanitarian amid his exposure of the barbaric Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story,he managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp.<br><br>Steven Spielberg rose to the occasion of directing the material by making sure that people do realize the horrors that the Jews have gone through during the Holocaust.It was simply a masterpiece.The use of black and white simply with simply touches of color like the girl in dress and the light of the candle provided what powerful emotions to the viewer.<br><br>Evidently,the screenplay was sharply written for the movie was authentic and sincere in its presentation.The story was simply moving and uplifting when the goodness of men were shown just as it was disturbing and horrifying when graphic violence and cruelties of men towards others were displayed. <br><br>The performances of the actors/actresses were simply fantastic.Neeson was excellent as Schindler,Kingsley was fantastic as Stern and most of all,Fiennes was real and horrifying like Goethe.The cast weren't over- the-top nor were they created like movie characters,but they were treated in the film like human beings with both positive and negative traits. <br><br>Finally,I could honestly say that this is one of the greatest films ever made that could rival The Godfather.This is truly a masterpiece.","user":"Desertman84","rank":[54,66]}]