[{"title":"More Wannabe than Warrior","rating":4,"date":"6 June 2004","review":"This one tries its best to tie a story together.  Does it work?  Not really and our so called hero spends most of his time as a human punching bag. Also, a reclusive monk who ponders tranquility in a forest(?) is one that I've never seen in any Shaw Bros. film.  The training scenes with casio background music are a highlight and yes, livestock will be harmed!  A karate tournament is held in a boxing ring and it looked that the public was really getting into the movie.  Honestly, it's hard to side with our \"hero\" and you can't blame Quino for blowing up after taking a foot to the groin. OUCH!!  Unintentionally, the logic withing the dialogue seems flawed or maybe something is missing in translation.  Otherwise, you're going to laugh at this low blow, B-grade karate romp.","user":"InzyWimzy","rank":[3,3]},{"title":"Crappy but entertaining","rating":14,"date":"14 October 2003","review":"I found Karate Warrior at my video store for $.99. It's a poorly made \"young guy learns karate from old Asian master in order fight his arch  nemesis over a girl\" type movie. The plot is lifted from The Karate Kid 2, but Karate Warrior expands on this by adding magic to the mix. Really, really stupid magic.<br><br>The funniest thing about this movie is the acting. It seems like the sound was recorded in a studio after filming had taken place, because all the performances are extremely stiff, and the characters all have rubber lips. They also all repeat the same words or phrases over again constantly.<br><br>All in all, this film is a piece of crap. But when you buy a movie called \"Karate Warrior\" you're probably not expecting Citizen Kane anyway.<br><br>3/10","user":"Sortyxt","rank":[5,11]},{"title":"Our main character Anthony, is very whiny and not too likable.","rating":4,"date":"8 December 2015","review":"Anthony Scott (Stuart) is an American teen who goes to the Philippines to visit his father, Paul (Martin) (credited, in classic 'lost in translation' style, as \"Anthony father\"), a journalist currently living there. After a lot of bonding time with Anthony father, Anthony runs afoul of local gangster Quino (Enrico Torralba), who also happens to be a Karate master. Quino and his thugs are even involved in a protection racket with the store owned by the father of Anthony's love interest, Maria (Jannelle Barretto). Eventually, Quino beats up Anthony and leaves him in the forest. He is then found, and nursed back to health, by reclusive monk Kimura (Watanabe). Master Kimura also goes through great pains to teach Anthony Martial Arts (mainly because Anthony complains and resists most of the time) - but will he learn the \"Dragon Blow\" in time for the big tournament - the face-off with Quino? Find out, at some point...<br><br>Karate Warrior is a very earnest and straight-ahead film that seems like it's simultaneously trying to be like the Karate Kid movies and at the same time trying NOT to be like them. One of the main problems is that our hero (?), Anthony, is very whiny and not too likable. Only the gaffes provided by the unintentionally funny dubbing give him any likability. He does have a classic 80's \"Cool\" look, but that's about it. (Maybe it was the \"hair stilist\", another misspelled credit, who helped him look so cool).<br><br>When Anthony arrives in Manila, after getting a ride from the time-honored Wacky Taxi Driver, a bunch of punks beat him up and steal his Walkman. Not a good start. He was only asking around trying to find where his dad lives, a town apparently called Los Banos (if my high school Spanish is correct, doesn't that mean \"The Bathrooms\"?), but he quickly runs into arch-baddie Quino, not to be confused with Kimo or Beano. Why his dad didn't pick him up at the airport, like he did when his mom Julia (Agren) arrived, we don't know. Maybe that's why they were estranged from each other.<br><br>After a motorbike chase and Anthony gets beat up by Quino, we go into the extensive forest training sequence we've seen many, many times before. Master Kimura yells at Anthony to RELAX NOW! That seems kind of counterintuitive, but maybe it's all part of Kimura's plan to deal with this whiny brat. There is no pounding, inspirational song during the training, which would have helped a lot, but the Simon Boswell music overall is catchy and stands out as being good. Also, we should mention that at this point Anthony hasn't been wearing a shirt for a decent chunk of the movie's running time. How can you have a protracted, shirtless training program and no song? That being said, the \"Ha-do-ken\"-type move, the Dragon Blow, is very cool and the movie should have gone more in that direction. Presumably the audience hopes Anthony will figure out how to use said blow at The Battle of the Karate Champions, the big tournament in town, which does look very well-attended. They also have fireworks after people get beat to a pulp.<br><br>Director Fabrizio De Angelis, AKA our good old pal Larry Ludman, turns in a kind of workmanlike product here. It could have used more action and less whining - the whole thing is so darn slow. Sidestepping some of the clichés might have been nice too, but we can't ask for a miracle. Released on Imperial Video back in the VHS days, this does seem to fit with a lot of their other output. But they did not release Karate Warrior 2, or any of the many other Karate Warrior sequels...we wonder why","user":"tarbosh22000","rank":[1,1]}]