[{"title":"Chris Tucker's best R rated performance","rating":10,"date":"14 January 2002","review":"When I was 14, I first saw Friday and almost choked from laughter. The script by Ice Cube and DJ Pooh is right on target with it's ghetto humor. Another plus point for the film is it doesn't stereotype. But it's Chris Tucker as Smokey who makes this film. His high pitched voice and mannerisms are classic.Hard-core rapper Ice Cube, after appearing in such hard-hitting films as Boyz 'N the Hood and Higher Learning, played his first comic role in this picture he co-wrote with frequent musical collaborator DJ Pooh. Craig (Ice Cube) manages to get fired on his day off (though he claims it's through no fault of his own) and spends the day hanging out with his buddy Smokey (Chris Tucker) and trying to avoid his father (John Witherspoon), who wants him to find another job immediately. Smokey (whose name might have something to do with his tremendous fondness for marijuana) has even more serious problems; he was given $200 worth of weed to sell by Big Worm (Faizon Love), but he ended up smoking it instead, and if he can't come up with the money by the end of the day, he'll be in a world of hurt (and will put Craig in the same place just for being his friend). And Deebo (Tom \"Tiny\" Lister, Jr.), a gargantuan bully who roams the neighborhood on his bicycle, has it in for Craig, while Craig tries his best just to stay out of his way. As one would expect, Friday features a strong hip-hop soundtrack, featuring tracks by such artists as Dr. Dre, Cypress Hill, Mack 10, and Funkdoobiest, as well as old-school R&amp;B selections from The Isley Brothers, Roger, and Rose Royce","user":"DunnDeeDaGreat","rank":[62,70]},{"title":"I still pop this baby in the VCR","rating":1,"date":"1 May 2005","review":"Eleven years ago (one year before this movie debuted), if you'd have told me you can get an entire movie from two guys sitting on their porch on a hot Friday afternoon, I'd have said you were nuts.<br><br>I first saw this movie on a date with my girlfriend as a teenager way back in 1995 (it's hard to believe that was 10 years ago, I laughed through it then and I laugh through it now.<br><br>It's also the movie that made me a Chris Tucker mark.<br><br>I see everything that guy is in.<br><br>The same goes for Cube.<br><br>I love this movie's ability to show that ghettos aren't all like the 'Good Times' TV series.<br><br>This movie keeps it's lightheartedness throughout especially with funny characters to support Cube and Tucker like DJ Pooh, A.J. Johnson and Tiny Lister.<br><br>It also doesn't hurt to have Nia Long with her fine self in it either.<br><br>But as I stated this movie is very lighthearted and doesn't begin to get serious at all until the end where Craig tears Smokey a new one for getting him involved in the mess, Big Worm's assassination attempt on Craig and Smokey and Craig coming to the aid of Debbie (Nia) when D-bo (Lister) is beating her up.<br><br>It's at those two points you almost forget this is supposed to be a comedy movie.<br><br>The most important message in this movie actually came from Johnny Witherspoon who portrayed Craig's father.<br><br>He gave his son some very fatherly advise...which I hope to follow with my own son one day.<br><br>Although I can't say I'd have been that calm if I walked into my son's room and saw him holding a semi-aotumatic 9mm pistol.<br><br>But I did like his advice....as I believe it was meant to be a message to the audience.<br><br>\"You kids today are nothing but punks, so quick to pick up a gun. You scared to take an ass-whipping!\" (referring to his fists) \"These are all the protection you need. You win some, you lose some, but you live!\"","user":"Unbreakable27","rank":[48,56]},{"title":"A movie everyone should give it try.","rating":10,"date":"22 December 2018","review":"I am only writing this because 7.3 rating is to low for this movie and just to say that you do not have to be black or live in the \"hood\" to like it. Not only is it very funny movie but it has a good message with a very good cast and still holds up 23 years after it came out.","user":"tonysobon","rank":[11,11]}]