[{"title":"Genuinely Creepy","rating":30,"date":"30 November 2003","review":"This is not an easy movie to track down, but if you can find it, grab it.<br><br>Dark Waters (aka Dead Waters) is a great example of how atmosphere alone can make a movie work.  The plot is a little confusing but trust me, you will not care.  This movie is a nightmare to rival any that H.P. Lovecraft wrote down.<br><br>On a remote island in the Black Sea, there is a convent, a primitive stone fortress without electricity, virtually cut off from the rest of the world. The island is a grim, unlovely place, seemingly made up of stones and dead fish with nary a palm tree in sight.  Our young heroine Elizabeth arrives on this island alone.  Elizabeth is an orphan; her mother died in childbirth and her father has recently passed away. Elizabeth now wants to know why he had spent his life secretly sending good amounts of money to the convent. The nuns, a grim and sour looking lot, (not so very different from most Catholic nuns I have known) led by a blind and gravel-voiced Mother Superior, give her no straight answers, but allow Elizabeth to stay with them for the time being.  Elizabeth begins having horrific nightmares, and this is where the movie really succeeds in frightening its viewers.  The nightmares are truly terrifying, particularly the one in which a crucified SOMETHING approaches the camera as though on a track, opens its mouth and simply emits the most hideous, inhuman howl ever heard.  It sounds like a long lost beast stuck in a tar pit, and gave me the creeped out shivers for days afterwards.<br><br>Elizabeth is befriended by a young, sweet tempered nun named Sarah, who tries to help her escape from the island.  But of course, there is no escape.  The answers she came looking for at the convent are all there, and too late, she learns that some things are better unknown.  The truth about her birth, her mother and her identity come out in a shocking (and, unfortunately, somewhat rushed) finale with a twist that I truly had not seen coming...and I thought I'd seen them all.  The only complaint I had?  I wanted to see more of the monster.  The glimpse I got of it showed me a bug eyed, razor mouthed THING straight out of a Lovecraftian primordial soup. But it didn't last nearly long enough.     <br><br>This is a good, creepy film to watch with all the lights off, if you dare. It may move too slow for some, but if you like genuinely spooky films, lots of dark, rainy atmosphere and the cold, slimy unknown, you'll like this one.","user":"Gafke","rank":[35,38]},{"title":"Effectively atmospheric, an homage to earlier Italian-style horror","rating":10,"date":"30 July 2002","review":"Ah, no wonder I had trouble finding this little gem -- when films are retitled depending on which company handles it, it's a wonder anyone will find them at all. I luckily stumbled across it as DEAD WATERS on a very no-frills DVD from York Entertainment. At that time I had wished that a company like Anchor Bay would have acquired this wonderful film and given it a decent treatment, I'm at least grateful that I found it at all even in this form. UPDATE: Thankfully due to the folks at No Shame Films, it's now available on DVD in widescreen and full of extras. UPDATE: May 1, 2016. The No Shame Films DVD releases are now out of print, but accessible (at higher prices, of course).<br><br>For those looking for fast and cheap thrills, they will be sorely disappointed by Dark Waters/Dead Waters. For those with a true sense of appreciation for something more akin to art, then this film is a dream come true. Rich in style and atmosphere it has the look and feel of an early 1970s Italian horror film, yet unlike many of those kind that offered style over substance, it has an eerie story to support the murky atmosphere that will draw you in.<br><br>After the death of her father, Elizabeth (Louise Salter) travels to a Crimean island to find out why her father had been sending funds to a \"convent\" of sorts. There she befriends one (who could easily be mistaken for Meg and Jennifer Tilly's lost sister) who guides her around and shows her secrets. This leads to a shocking discovery of her past and heritage. All this is conveyed in an amazingly sparse amount of dialogue, so it really shows this film's power and presence that it tells the story so minimally, letting the viewer absorb the visuals and sounds and letting those elements fill in the blanks.<br><br>The nuns are creepy, it's always raining and murky, and inside the catacombs of the main setting there's always water leaking and trickling. This effectively evokes a feeling of discomfort for the viewer. Even when the weather is clear there's a surreal atmosphere as best shown by the local shop and its shopkeeper, a strange man that seems to be feeding a corpse in a coffin to the birds piece by piece instead of the expected burial. I have a suspicion that the \"townspeople\" don't know he's doing this. I found that part of the story deliciously creepy and brilliant. <br><br>Some may find the \"monster\" climax to be somewhat low budget -- very minor, though (didn't the \"being\" have an Xtro quality to it?), but frankly that didn't bother me since the whole film was so wonderfully downright bizarre to begin with. There was so much more going on if you look past the flaws, you'd see that this is a real piece of art for those of us that sometimes like a bit of beauty and substance to absorb. This is classic Gothic horror and gives the brain a bit of a challenge as well. One film critic went so far as to say it was \"an unholy hybrid of Bergman and Argento.\" Could be, to an extent. Nonetheless, Dark Waters is thoroughly absorbing visually as well as in its storytelling. Mariano Baino should be quite proud of this little known gem and I cherish it. Discovering this film is a satisfying experience indeed. By the way, Mr. Baino is a really great guy -- he read this review and contacted me about it. That shows some real class, and I'm glad to have made him happy about my support for this film!<br><br>According to the information on the DVD's cover, it won the Special Vincent Price Award at the Rome Fantafestival. I confess I'm not sure how prestigious that is, but I am happy that Dark Waters has gained appreciation and recognition!","user":"hippiedj","rank":[23,29]},{"title":"Surreal n atmospheric but a bad n confusing film.","rating":6,"date":"23 August 2017","review":"I saw this first on a VHS in the mid 90s. I never understood the film then. Found it to be one helluva weird stuff. Revisited it recently on a pirated DVD after reading many glowing reviews n the cult following. Honestly, now i found it to be meh. As i mentioned in my review of the movie A cure for wellness that cinematography n atmosphere ain't enough to save a bad film. Apart from the imagery like the cathedral's location, the village, the atmosphere of constant raining n murky weather, the weird characters, the leaking cathedral with its dripping water, the cliff n the setting sun, the catacombs with their candles n the enigmatic passageways, there ain't anything good about this film. In fact, there is no music, very few dialogues n the story is really confusing. Strange things seems to happen for no reason. The actress was attractive though.","user":"Fella_shibby","rank":[27,35]}]