[{"title":"I laughed till I cried (really)","rating":10,"date":"15 January 2005","review":"I always thought the phrase, \"I laughed until I cried,\" was just an oxymoron. Until it happened to me. I watched Dogma: the funniest movie I have ever seen. The movie seemed designed specifically for my warped sense of humor. It was an incredible mesh of the high-brow and the low-brow.<br><br>It had one character who was extremely foul-mouthed, and kept making up hilarious obscene phrases. It also had a lot of perceptive, biting (and very funny) theological and social commentary.<br><br>For me, it was sort of like being tickled hard in the ribs for about an hour. When I reached the breath-taking climax of the film, the resolution was such a shock and was so unexpectedly emotional and I was so sore from all the laughing, I actually burst into tears. Now, dammit I am a grown man. I never do that. Not even for anything real, much less a movie. But it happened.","user":"Zorro-3","rank":[170,253]},{"title":"Smart, Funny, Intriguing........","rating":10,"date":"20 January 2000","review":"I have always loved Kevin Smith's style of directing and this film has re-affirmed my belief that he is one of the top directors in the film industry at the moment. Dogma's topic was a very sensitive one and could have been misused but Kevin Smith has dealt with the subject perfectly. Anyone who has critisized Dogma for being offensive has really not understood the film. Dogma is full of excellent moments, not least Alanis Morissette who I thought was fabulous in her small but important role as 'God'. All the performances were excellent and the actors complimented each other superbly. Overall this film has a mixture of everything and its underlying message is one which should reach everyone.","user":"fostex300","rank":[97,145]},{"title":"simply fabulous--kevin smith rocks!","rating":9,"date":"15 May 2001","review":"While both funny and frightening, this film is more than just a comedy with gratuitous violence and (bad)-language.  It's a theological reflection...and a call to the Church to focus on things that matter (like living life to the fullest, helping those in need, honoring and respecting all, expecting respect in return) rather than those that don't (like...well, dogma [doctrines/church laws] or any belief that causes us to \"draw a line in the sand,\" condemning to hell or perdition any who disagree with us).  As I watched it (the first and all subsequent times), I felt sure that the movie was written by someone who really loves his church -- but is smart and aware enough to recognize its shortcomings, its blindspots, even its failures and hypocrisies.  Rather than simply leaving or ignoring or dismissing it, Smith chooses to enter into dialogue with it, using the potent medium of film to do so.  One can only hope that the church--not just Roman Catholic but all branches of it-- takes him up on his call to conversation.<br><br>\nNot to be missed in the film, on a lighter note, are the introductory disclaimer and the \"Thank Yous\" at the end.  Smith thanks Elaine Pagels, for God's sake -- who knew anyone in Hollywood read contemporary, feminist theology?  What a welcome revelation....","user":"revsonya","rank":[132,204]}]