[{"title":"A thoughtful film for thoughtful viewers.","rating":10,"date":"25 November 2004","review":"Perhaps more than many films, this one is not for everyone. For some folks the idea of slowing down, reflecting and allowing things to happen in their own time is a good description of their personal hell. For others an approach like this speaks to some deep part of themselves they know exists, some part they long for contact with.<br><br>I suppose it's a function of where I am in my own life these days, but I count myself in the camp of the latter group. I found the meditative pace of this film almost hypnotic, gently guiding me into some realm almost mythological. This is indeed a journey story, a rich portrayal of the distance many of us must travel if we are to come full circle at the end of our days.<br><br>Much as been written of Mr Farnsworth's presentation of Alvin Straight, though I'm not sure there are words to express the exquisite balance of bemused sadness and wise innocence he conjured for us. Knowing now that he was indeed coming to terms with his own mortality as he sat on that tractor seat makes me wish I had had the opportunity to spend time with him before his departure. I hope he had a small glimmer of the satisfaction and truth he had brought to so many people, not just for \"acting\" but for sharing his absolute humanity with such brutal honesty.<br><br>Given the realities of production economics, I'm not sure full credit has been given Mr Lynch for the courage he showed in allowing the story to develop so slowly. An outsider to film production, I nonetheless understand there are few areas of modern life where the expression \"time is money\" is so accurately descriptive. Going deep into our hearts is not an adventure that can be rushed, and to his credit Mr Lynch seems to have understood that he was not simply telling a story--he was inviting his viewers to spend some time with their own mortality. No simple task, that.<br><br>If you'd like to experience the power of film to take introduce you to some precious part of yourself, you could do worse than spending a couple of hours with The Straight Story. And then giving yourself some time for the next little while simply listening to its echoes in the small hours of the night.","user":"WLFBoulder","rank":[242,264]},{"title":"Surprisingly deep","rating":7,"date":"1 December 2000","review":"I went into The Straight Story expecting a sad/happy type drama with nice direction and some good acting.  These I got.  What I wasn't expecting was an allegory for the trials of human existence.  Leave it to Lynch to take a simple story about a 300 mile trip on a lawnmower and turn it into a microcosm for the human condition.<br><br>If you didn't notice, watch it again, paying attention to the ages of the people Alvin meets, the terrain he's driving through, the reactions people give him, the kinds of discussions he has (one of the first is about pregnancy and children, one of the last is outside of a cemetery).  The last road he drives down is particulary haunting in this context, as it narrows and his fear and nervousness mount.  The last mechanical failure could be seen as a death, and the miraculous rebirth of his engine relating to an afterlife, in which he achieves the desired reunion.<br><br>I only hope some of the people who branded this as a slow sappy melodrama take the time to watch with a more holistic attention.","user":"munchtipq","rank":[212,234]},{"title":"Nothing Runs Likes a Deere.","rating":12,"date":"12 May 2004","review":"A beautiful and very emotional \"Harry and Tonto\"-styled movie experience as Oscar-nominee Richard Farnsworth (playing the real-life Alvin Straight) decides to travel on his old riding John Deere mower from Iowa to Wisconsin to see his ailing brother (Harry Dean Stanton) because his driver's license has been revoked, he doesn't like public transportation and he has no one else to drive him. The two brothers have not been on speaking terms for many years and now the clock is literally ticking on one last chance for them to see one another and hopefully make amends for past mistakes. Sissy Spacek gives one of her finest performances as Farnsworth's slightly mentally retarded daughter and the supporting players are all real and heartfelt caricatures of America's heartland. Outstanding film-maker David Lynch (to me the finest living American director, along with Martin Scorsese) goes totally out-of-character with a 180-degree turn from whacked triumphs like \"The Elephant Man\", \"Blue Velvet\", \"Twin Peaks: Fire Walk With Me\" and \"Mulholland Dr.\". He quietly and methodically creates a G-rated family film that has deep messages for people of all ages and backgrounds. He paints a picture of America where the old ways of life are still the most important. Farnsworth (who is a total revelation) was in excruciating pain throughout filming due to terminal cancer and terrible arthritis. Notice he stands very little in the movie and he is almost always filmed from the waist up. Sadly this would be his final performance as he committed suicide shortly after his Oscar nod. He did become the oldest nominee ever in the Best Actor category, but really that will become trivial as time passes and his role will be the thing that shines brightly forever. Truly a legacy production for all involved. 5 stars out of 5.","user":"tfrizzell","rank":[112,126]}]