[{"title":"Interesting art-house horror with plenty of WTF moments.","rating":5,"date":"6 April 2007","review":"A gory, low budget, art-house horror with scenes of extreme nastiness, Subconscious Cruelty is not an easy film to watch for several reasons: it is extremely 'symbolic' (some might say pretentious); it has no standard narrative; and it features very unsettling imagery. It is, however, well directed and edited, and features some amazingly realistic effects and a pretty decent score.<br><br>Subconscious Cruelty starts as it means to go on, with a bizarre short segment entitled Ovarian Eyeball in which a naked woman on a table is sliced open; from her wound, an eyeball on an optic nerve is produced. It makes no sense (to me at least), but is certainly visually arresting.<br><br>And so the weirdness continues, with a second 'story', Human Larvae, about a guy who wishes to make a mockery of the miracle of birth by killing his sister's newborn child as it is leaving the womb. This one is without a doubt the vilest story I have ever seen committed to celluloid and should be seen only by those with a very strong stomach.<br><br>Part three, Rebirth, is less intense, with a bunch of naked people rolling around in mud, fellating tree branches and shagging pools of blood! I quite enjoyed this bit after the gruelling nature of Human Larvae. <br><br>The final segment, Right Brain/Martyrdom, fuses religious symbolism with female nekkidness and gore, and is a shocking slice of sacrilegious depravity guaranteed to upset Christians everywhere.<br><br>I can't say that I enjoyed director Karim Hussain's debut, and would hesitate recommending it to pretty much everyone I know, but I imagine that it will definitely have a cult following amongst those people who prefer to delve into cinema's weirder output, such as the films of Lynch, Jodorowsky or Miike.","user":"BA_Harrison","rank":[28,35]},{"title":"Shocking, yes, but what else?","rating":5,"date":"20 November 2000","review":"This was definitely the most graphically disturbing film I've ever seen. Apparently, the sole purpose of the film is to shock and outrage people (according to the Stockholm Film Festival booklet), and I guess it does, but it doesn't really go any further than that. Or does it? I get the feeling that Karim Hussain has something to tell us, but it doesn't get through very well. I understand the reason for showing the things no-one dares to show, and I think that's good. But it is not presented very well, so people will not get the picture. The last section of the film is clearly a statement against American double standard of morality, and the modern mans loss of spirituality, and it is also the most intentionally apparent section.<br><br>The 'sound design' is great, very reminiscent to Lynch's Eraserhead. The music on the other hand, is most of the time inappropriate. The middle part of the film where people are indulging in an orgy with Mother Earth, is so badly scored the scene becomes silly, which is a shame. Hussain should have chosen music in the vein of Ligeti and Penderecki for a film like this (like Kubrick did).<br><br>If you want to see a shocking film that is dead serious all of the time, go for this one. Not for everyone, though. Or maybe it is?","user":"marcopop","rank":[17,21]},{"title":"Boring... self-indulgent crap","rating":1,"date":"18 January 2009","review":"Looking for something shocking? Okay fine... the imagery is that. That's about it. This film attempts to make deep connections with the audience through various symbolism and just ends up being annoying. I am not quite sure if the director's purpose was to truly portray some sort of deep message to his audience, or if he just sought to shock the hell out of them with gore, sex and violence. I am thinking that it was probably the first...but in the failed attempt..it simply ended up to be a piece of artsy garbage with lots of blood, some obnoxious characters, and an over reliance on religious symbolism. If you're looking for some independent film to critique for its attempted use of metaphor...have at it. If you are looking for a gore flick that will make you queasy and uncomfortable... here you go... If you are looking for a film that will irritate you to no end because you realize that in the end, the message was stupid...the movie was stupid... and you will never get those minutes of your life back..this is surely the film for you!","user":"cmorris21","rank":[14,19]}]