[{"title":"The Battle for Equality.","rating":9,"date":"15 December 2005","review":"Imagine that the woman you love has successfully filed a claim against you, and that this claim has become so nasty the courts have awarded her all her freedom. In turn, however, all which you have worked for so hard has gone down the drain and a pair of scissors snip your access to monetary freedom, effectively making you a homeless person who can't even go back home.<br><br>Much more vicious than its predecessor, THREE COLORS: WHITE introduces us to this story of a marriage gone sour. Karol Karol (Zbigniew Zamachowski), named so for his clear link to the Everyman we all know as Charlie Chaplin (the actor has a passing resemblance to the character) is the man in question, who has lost everything and in turn is marinating in two very different emotions: the desire to get even, but the need to get his wife Dominique (Julie Delpy) back.<br><br>The tone established in WHITE is fate. Even in its darker moments there is an element that something beyond the characters' control is making its way to an uncertain conclusion. I can see that in the scene when Karol meets Mikolaj (Janusz Gajos), an enigmatic man who passes him by and recognizes a song he is playing on a comb: their interaction under the streets of Paris feels almost preordained and it's not surprising when soon Mikolaj, a man with a secret, is helping Karol get back to Poland.<br><br>What is surprising is the way these events happen, but I will not reveal them because of two things: one of them has to do with a test of friendship that suddenly swings the film into high gear and liberates it from its moral heaviness seen in the first third of the film, and secondly, because Kieszlowski connects several disjointed scenes involving Dominique and Karol that will eventually reveal themselves not to be out of time or imagined but very real.<br><br>THREE COLORS: WHITE is all about the symbolic nature of the color inasmuch as 'equality'. At the beginning Karol is 'erased' from society. He has been whited out because he could not consummate his marriage. There is a gun fired, but it only has blanks. Dominique is a woman with a white-hot, destructive personality. White doves come into a scene where Mikolaj, an angel of sorts, saves Karol from a grim destiny, and the angelic face of love is the white bust that survives most of the film as Karol begins his plans to move against Dominique.<br><br>At the same time we have two moments of its position in the French flag that also come into play when seen as a trilogy. At the beginning, Karol's freedom (blue) is destroyed as his bank card is repossessed. Equality (white) shimmers in one particular scene in which Dominique achieves orgasm. In the closing, irony-filled sequences, Dominique is seen enveloped in lush red tones, which will establish the tone of the next film RED, fraternity.","user":"nycritic","rank":[66,70]},{"title":"White as a wedding gown, as a dove...","rating":8,"date":"2 August 2002","review":"Ostensibly Kieslowski chose white of the French flag to make a movie on equality. Equality if it can be reached in marriage, makes it work. Marriage is rocked when an equilibrium is not reached. A dove can be caressed and be a symbol of peace and purity; a dove can defecate and dirty as well<br><br>White in the movie is used as an epiphany of the joyous moments in marriage. The doves are weaved in Kieslowski visually and aurally to accentuate the marriage as a rite of passage in life. He brings in the phrase \"light at the end of the tunnel\" towards the end of the film. There is another marriage, that of Mikolaj in the subplot that also survives in a strange way.<br><br>The film begins with divorce proceedings and ends with the wife signalling the reinstatement of the wedding ring on her finger. The film begins with husband recalling the wedding that has failed. The doves flying overhead unload excreta on him. Towards the end of the film, the husband again recalls the wedding as he sets off for the wife's prison.<br><br>Kieslowski's treatise on equality is based on marriage as a great leveller with the doves flutter captured on the soundtrack appearing as a frequent reminder of marital bonds. It even appears in the underground metro, an unlikely place if you have a logical mind. You have to throw away logic if you need to enjoy this film.<br><br>There are aspects of the film that are obviously unrealistic. Putting a grown man in a suitcase and letting the suitcase go through airport security is not feasible. Moreover, the director shows the heavy suitcase perched precariously on a luggage cart. Impossible to believe all these details.<br><br>But the deeper question is whether Kieslowski was using marriage as a metaphor for politics? There is the mention of the Russian corpse with the head crushed for sale, there is a mention of the neon sign that sputters...The name Karol Karol seems reminiscent of Kafka.<br><br>Sex in this film is not to be taken at face value. Impotence of Karol Karol at strategic points of the film is deceptive. He apparently does more than hair care for women clients at his hair care parlor in Poland (suggested, not shown). I have a great admiration for Polish cinema, having gown up watching works of Wajda and Zanussi. I met Kieslowski in 1982 when he attended an international film festival in Bangalore, India, promoting his film \"Camera Buff,\" another film with Jerzy Stuhr, who plays Jurek in \"White\". I took note of \"Camera Buff\" but I could not imagine the director of \"Camera Buff\" would evolve into a perfectionist a decade later. Stuhr has been metamorphosed from a live wire in \"Camera Buff\" to an effeminate colleague of Karol Karol in \"White\". \"White\" is a carefully made work with support of other top Polish directors in the wings--Zanussi and Agniezka Holland.<br><br>Although the film is heavy in symbolism, it is also a parody. Karol Karol comes to kill with a blank bullet and a real one. Did he plan that out, when he did not know who he was going to shoot?<br><br>The performances are all brilliant--the good Polish, Hungarian, and Czech filmmakers extract performances from their actors that could humble Hollywood directors, because the stars are not the actors but the directors. Great music. Great photography. And a very intelligent script.<br><br>This is a major film of the nineties--providing superb wholesome entertainment and food for thought. The film deservedly won Kieslowski the \"best director\" award at the Berlin Film festival in 1994. It is sad for the world of cinema that Kieslowski is no longer with us.","user":"JuguAbraham","rank":[101,115]},{"title":"my favorite of the trilogy","rating":10,"date":"6 July 2004","review":"I love the entire Three Colors trilogy, but \"White\" is my sentimental favorite because I sympathize so deeply with the hero.  I've experienced the same kind of competitive, destructive love that drives Karol throughout this movie, and I'm also a nerdy schmuck like he is, so I found myself really commiserating with him.  <br><br>Unfortunately, \"White\" has acquired a reputation as the weakest entry in the series.  I think it's the odd one out, but certainly not the worst.  It's the only one of the three that regularly stretches credibility (the plot twists are really wild), and the only one with a male protagonist, but it's also the most exciting of the films and, ultimately, the most disturbing. The ending in particular is a killer.<br><br>\"Red\" tinkers a bit with \"White\"; in fact, if I'm not mistaken, it entirely changes the resolution of this film for the worse.  That's too bad.  \"White\" works best on its own, as a pessimistic movie, without the more optimistic outlook of \"Red\" grafted on in retrospect.  But since both films are so great on their own, I'm not too bothered by their failure to gel properly.","user":"dr_foreman","rank":[60,74]}]