[{"title":"Mixed bag","rating":6,"date":"1 July 2005","review":"Three stories courtesy of John Carpenter and Tobe Hooper, sounds like it can't miss, right? The results are mixed, but pretty interesting all the same.<br><br>The Gas Station is vintage Carpenter. Here he maximizes the effect from a truly simple premise and creates a genuinely scary story. It's simple, but the final minutes are riddled with tension and general uneasiness. The best of the bunch.<br><br>Hair is a truly funny story with a terrific performance by Stacy Keach. It goes way over the top towards the end, but still, it's highly amusing for the most part.<br><br>Eye, the weakest of the three, due to it's complete and utter predictability and complete failure of generating any real chills. It's fun to see Hamill and it's pretty gory but that's about it.<br><br>One terrific story, one pretty good and one pretty bad, all in all, it's worth watching but it's nothing spectacular.","user":"ODDBear","rank":[26,28]},{"title":"\"I think we got time for one more body bag\"","rating":7,"date":"10 September 2010","review":"John Carpenter presents \"Body Bags\", in which it reads true as he plays very-well looking coroner (well he might not be as what he seems) late at night fooling around in a morgue, while spitting out macabre jokes (visual and verbal) and then introducing us to three buoyant little stories. They range from horrific, humorous and simply bizarre with a \"Tales from the Crypt\" spin to them. In this low-budget TV production Carpenter would direct the first two; \"The Gas Station\" and \"Hair\", but the third story \"The Eye\" would be fronted by director Tobe Hopper. Carpenter and Hooper wouldn't be the only recognizable names, as the cast line-up is rather mouth-watering. You got Stacy Keach, David Warner, Mark Hamill, David Naughton, Robert Carradine, Deborah Harry, Twiggy, George Buck Flower, Charles Napier, John Agar, Roger Corman and a minor cameo from Tom Arnold. Also some horror participants have tiny parts; Sam Ramini, Wes Craven, Tobe Hooper and make-up/special effects maestro Gregory Nicotero.<br><br>The first story; \"The Gas Station\" starring Alex Datcher, Robert Carrdine and David Naughton is probably my favourite of the lot. It's the most straight-forward, but effectively atmospheric (very well photographed with its encroaching angles) and suspenseful, which sees a lady on her first day of the job looking over an isolated gas station late one-night night, where she becomes a target of a satanic serial killer. Quite high-tempo with its grounded cat-and-mouse layout. You really do feel the growing unease displayed by Datcher's character and the tension that unfolds from its eerily forlorn backdrop, but this exercise into familiarity just works. Some fruity characters also helps, and it's not without its parodying humour either to balance it out.<br><br>\"Hair\" the second story, starts off with a natural fear before becoming quite an offbeat and quirky entry which sees Stacy Keach being plagued by the fear of losing his hair. After trying everything to combat it, he seeks treatment from a specialist doctor. It works --- lovely long hair, but at what cost. Keach is a blast in the lead and he shares terrific on-screen chemistry with the likes of Sheena Easton, David Warner and a colourful Debbie Harry. Witty dialogues and a nice sense of wicked cruelty in a revelation that's just plain crazy.<br><br>Finally we end off with Hooper's \"The Eye\". A brooding supernatural tale that has Mark Hamill an up-and coming baseball player in a terrible car accident, where he loses his right eye. However a doctor offers him the chance to get that sight back in an eye transplant but there's no guarantee it will work. However it does, but soon he's plagued by headaches and visions --- dark and disturbing ones. This one takes on a more serious approach compared with the previous outings with an excellently confident Mark Hamill with good support by Twiggy. The story might be predictable, but it's well-paced where the inflicted transformation of our edgy central character is suitably pitched. Some ghastly shocks moments show up too.<br><br>Joining it up is the enjoyably warped wrap-around segment with Carpenter (where Rick Baker did the make-up for) and this sees the cameo turns of Hooper and Arnold at the end. The dialogues might be what you most remember, but some of the decors on show in this segment are amusingly executed.<br><br>As a whole it's a complete package with the stories perfectly complementing each other. They might not be spectacular, but I liked the three. <br><br>Good, fun comic horror anthology opus by Carpenter and co.","user":"lost-in-limbo","rank":[11,12]},{"title":"Cool, Solid Horror Anthology With EC Overtones","rating":10,"date":"10 September 2004","review":"BODY BAGS is a lot of fun until the unrelentingly grim final segment directed by Tobe Hooper, which is the best thing Hooper has done since Texas CHAINSAW MASSACRE 2. The other two segments are directed by John Carpenter, who also appears as a Crypt-Keeper-like character, and demonstrates why he has spent most of his time behind the camera.<br><br>Overall, I like the movie very much. The first segment is good, but also the weakest of the three. It also feels oddly out of place, as the next two stories both deal with medical horror, while it is simply a 50's style slasher-on-the-loose yarn. Despite the slight subject matter (and a poor performance by Alex Datcher in the lead role), it's a solid chiller with some good scares. David Naughton, Robert Carradine and Peter Jason are all good in supporting roles, while fellow horror directors Sam Raimi and Wes Craven have creepy cameos.<br><br>The second segment is great, and, unlike the other two, is an out-out comedy. Stacey Keach turns in one of his very best performances as a middle-aged man who dreads the prospect of going bald, and decides to try out a new experimental technique developed by scientist David Warner. It leads up to a great finale that is as disturbing as it is funny. Singers Deborah Harry and Sheena Easton have supporting parts.<br><br>The final segment is the polar opposite of the second. As stated earlier, it's directed by Tobe Hooper, and he shows a sense of the macabre here that he hasn't displayed since his CHAINSAW/FUNHOUSE days. A veteran baseball player is in a car accident which results in his eye being poked out. A surgeon suggests an experimental eye transplant. Unfortunately, the donor eye belonged to a homicidal maniac, and Hammill begins having nightmarish hallucinations and bouts of uncontrollable rage. The climax of the segment is unbelievably cruel and grim, recalling Hooper's early work. It's a genuinely unsettling and horrific little flick. Twiggy, Charles Napier, as well as horror icons John Agar and Roger Corman appear.<br><br>Carpenter's antics as the narrator are uncomfortably flat, and things don't get any better when an irritating Tom Arnold and a clueless Hooper show up in cameo roles as well. Despite the weak wraparound, I recommend this anthology to horror fans, particularly fans of the two directors' work.","user":"squeezebox","rank":[13,15]}]