[{"title":"Bravo! to Snipes, Swayze and Leguizamo","rating":7,"date":"22 October 2005","review":"The main reason I liked this movie is because of the trios' performance. I think they did an excellent job. How could a man that did \"Roadhouse\" be in this movie? That's what makes it so appealing. And not only be in it, but do an amazing job. Snipes made me laugh my heart out, and Leguizamo had a dark undertone to his performance that reflects the hopes and dreams of many Latinas living in poverty. I also admire the intentions of this movie. It wants to bring a message without offending or turn off the audience it intends to deliver it to. Not an easy task, but at least it's an admirable attempt. I think some of the reviewers on this site are a bit too harsh on this film. It is a fun bubble gum of a movie. Watch it and enjoy it, and in the process if you come away from it with a little more of an open mind, I think it has done its job.","user":"blueleo65","rank":[86,100]},{"title":"Not what it seems at first.","rating":9,"date":"21 July 2005","review":"This movie about three drag queens, two of whom win a trip to Hollywood, is kind of the ultimate road picture. But the three male stars look better in drag than Bing and Bob ever did. I've seen it a couple of times, and never fail to wonder at the transformation of Patrick Swayze, Wesley Snipes and John Leguizamo into...well, drag queens. One of the best shots in this movie is at the beginning, when Wesley Snipes' character is walking AWAY from the camera. I wish *I* looked that good.<br><br>I suppose there was a kind of freedom in making this movie, for them, because they were not playing a character that looks like them in *real life*. I started out watching because if the novelty, ended up being invested in the characters and liking the movie.<br><br>And Blythe Danner is always good, in anything she does.","user":"anyone-11","rank":[29,32]},{"title":"And Wheeeeeere is tha bodaaay???","rating":10,"date":"31 January 2003","review":"This movie was HILARIOUS. Every time I'm sad or down in the dumps, I pop in this film to cheer me up. I thought Ru Paul and even Julie Newmar made excellent cameos. Patrick Swayze, Wesley Snipes, and John Leguizamo played believable drag queens, and they all did great jobs trying not to trip in their stiletto heels. Stockhard Channing was great too, as the abused wife who never gets to have any fun. The movie has a happy ending, and after the movie you find yourself accepting others for who they are.","user":"edhomie22","rank":[43,49]}]