[{"title":"A Stunning Law Breaker","rating":10,"date":"7 January 2005","review":"I saw \"The Aviator\" a couple of days ago and while I still have Howard Hughes flying through my brain I felt the need to see again another Scorsese. I have all of his films in my collection. I closed my eyes and picked one, just like that, at random. \"The Age Of Innocence\" This is what happens with great artists, you can always re visit them and you'll come out of the experience with something new, something valuable. Transported by the sublime voice of Joanne Woodward I took the trip again to discover that everything in this extraordinary universe that Martin Scorsese, based on Edith Wharton work, is not what it appears. Conventions out of the window, breaking every imaginable rule. Just as the characters get off their trucks, swimming against the tide of the times. Scorsese breaks cinematic rules with such artistry that we're allow to inspect, re live and enjoy a story as old as the world from a completely new perspective. Is as if Luchino Visconti had suddenly woken up with a new contemporary sight to look back with. Daniel Day Lewis is so marvelous that the pain of his predicament becomes more than visual, becomes visceral. For Michelle Pfeiffer and Winona Ryder this was the zenith of their careers. They are sensational. The casting, as usual in a Scorsese film, is superb even in the smallest roles. Glimpses of Sian Phillips, Alexis Smith and Geraldine Chaplin add to the pleasures, making this overwhelming banquet of a film one of the most rewarding film experiences I've ever had.","user":"marcosaguado","rank":[225,248]},{"title":"Scorsese's Ignored Masterpiece","rating":10,"date":"14 November 2003","review":"I actually saw this movie when it was released in 1993, and honestly it was pretty dull then. Of course I was 22, and the workings of that late-1800's New York society really didn't make much sense or have much relevance.<br><br>I think the film may have been ignored at its release because of the slew of other \"period pieces\" which were so popular (an eventually common) in the late 80's/early 90's... But watching it again 10 years later, this film is anything but common.<br><br>The true intensity is Scorcese's detached presentation of a hypocritical &amp; hateful society which holds its members as prisoners.<br><br>Not to mention impeccable art direction &amp; beautiful cinematography by the legendary Michael Ballhaus. The film looks as impressionistic as the paintings that line the walls of the characters' homes.<br><br>Scorsese is always acute in his casting decisions, and this is one of the films many virtues:<br><br>Lewis is perfect as a man who's struggle between his passion &amp; his duty are constantly on the verge of devouring him  (yet somehow he thrives on his torture).<br><br>Ryder is the seemingly innocent &amp; naive girl who is completely manipulative &amp; cunning underneath her exterior (gee, who would have thought?!) -- notice the arching scene.<br><br>In a sense, this was one of Pfeiffer's defining roles. Pfeiffer herself (in a sense) is an \"outcast\" who has never truly been accepted as a \"serious\" actress by her peers in the acting community. Watching this film again, it amazes me how this role somehow reflects her personal position in the current social structure of Hollywood, similar to her character existing in 1800's New York society.<br><br>Wow...<br><br>What an amazing pic. I completely \"missed it\" the first time around. Great observance of \"high society.\" Many of those codes are strangely applicable today.<br><br>Not recommended for those who like fast paced movies, or those who are looking for the \"usual Scorcese.\"  I would couple this with \"Last Temptation of Christ\" as Scorsese's most brave, artistic, demanding &amp; abstract films to date.","user":"sundog1","rank":[181,202]},{"title":"A Splendid Look Back At Luchino Visconti","rating":10,"date":"1 October 2012","review":"Exquisite and yet dark, pungent, unforgiving. The best, the most cinematic kind of period drama since Visconti's \"Senso'. Martin Scorsese is, without question, the master of his generation. After his dark paintings of New York, the New York of \"Taxi Driver\" or \"The King Of Comedy\" this look back at a time when not just New York, but America was defining its identity. Daniel Day Lewis is sublime and Michelle Pfeiffer gives the performance of her life. I was also profoundly moved for that glimpse of Alexis Smith in her last film appearance and the wonderful voice of Joanne Woodward narrating Edith Wharton's words. Thank you!","user":"melissacasting-org","rank":[54,58]}]