[{"title":"Individuals Win","rating":21,"date":"21 December 2005","review":"Interesting. This is a good documentary about a great documentarian.<br><br>I guess the normal form for commenting on this is to take a side on the art/politics controversy. Or perhaps to note film as propaganda tool today. <br><br>I think I would rather simply remark that you just cannot watch movies as a lucid viewer without understanding something about who you are in the things. And that means wondering about who the filmmaker thinks you are. And that in turn means considering what it means when a camera is placed or moves in a certain way. <br><br>If you do, you will find yourself wondering about the camera of Hitchcock and Welles. Surely that is at least as fundamental as you need to go. But you can go a half step further back and you will find yourself here, with this woman and her dancing eye.<br><br>Yes, her personality at 90 is still German, which means she is a romantic idealist and an apologist for her generation. Annoying, but typical. And does it matter? Does it matter if, say, van Gogh was an anti-Semite? You decide. For me, I assume the artist is often the dumbest person involved in the process and the last person to ask. So the art is the thing.<br><br>There are three great things she did, and these are apart from the idealization of the body, a constant theme. <br><br>She advanced the art of filters to create abstract frames. In this, she was merely one in a line of talents. She was an innovator in creating a new philosophy of the camera. In this, she was a genius. But that wouldn't have mattered if she wasn't also a genius innovator in the art of editing.<br><br>She understood that in addition to the story, the images themselves have a rhythm and song apart from the thing depicted. I think she really means it when she says her great propaganda film could have been of any choreographed event. She was a master of exploiting the movement of the eye as well as the movement of the subject, even the rhythm of the greyscales and depths. You need to watch \"Triumph\" and \"Olympia\" ignoring the subject, perhaps upside down as I did to see the music.<br><br>Having said that, the effect of these two films undeniably altered life. The Nazi film was the single greatest influence in convincing the rural German public to support Hitler. That's huge. But perhaps a larger impact was on sports. Until that point, sports were something you did or read about. You might go to a contest purely for the association of the thing.<br><br>What her art did, incidentally, was she made sports cinematic. And we may all be the worse for it.<br><br>Ted's Evaluation -- 3 of 3: Worth watching.","user":"tedg","rank":[31,35]},{"title":"A glimpse of the German soul as well as a documentary","rating":10,"date":"4 April 2003","review":"In this year that Bowling For Columbine -- an unapologetically political and controversial film -- has won the Oscar for best documentary, the story of Leni Riefenstahl and her work seems very timely indeed. This engaging montage of primary and contemporary interviews with her, together with samples of her oeuvre beginning in the era of silent film, accomplish precisely what a documentary is designed to do.  Director Mueller spares no effort to uncover his subject's motivation, even as he focusses on the history and nature of her art.<br><br>There is some irony at work here.  We see a very German director attempting to dissect thoroughly the life and craft of another very German director. Not that there is any comparison to be made between the subject matter of one to the other, but when Riefenstahl takes Mueller to task for his filmmaking style in drawing her out, we cannot help but find delight in it. And his bit of eavesdropping on her between takes is priceless.<br><br>Far from the perennial films about the Holocaust that portray Germans as something less than human, this documentary offers ample evidence that genius and human frailty are universal and far from mutually exclusive attributes in all sorts of people.  But if one may deduce anything at all about the nature of the German soul in contrast to that of, say, a typical American, the life of Leni Riefenstahl as offered here stands out vividly by example of first one and then the other seemingly contradictory characteristic.  She was after all the \"nice\" girl who stayed home and played patriot while Marlene Dietrich was the \"bad\" girl who betrayed her country.  One can almost smell the cordite in the air during their related encounters.<br><br>Much is made of the fact that Ms. Riefenstahl protests too much.  Indeed that is a complaint one hears often about Germans who lived through the Hitler epoch seeing nothing, hearing nothing.  But that surely begs the question, considering that it was and is a nation of eighty million descended from a vast cross section of central European races, including uncounted geniuses, saints, and criminals alike. If there is anything uniquely German about such a pose, it is only that they tend to be meticulously accurate in everything they do, whether for good or evil.  The most annoying thing about Germans is their uncanny zeal in trying to find exact words that reflect logical and complicated reasons for everything -- including their own behavior.  Under that circumstance, it is but a short step to denial once no easy answers appear.<br><br>As a bilingual viewer of this documentary, I had the benefit of second-guessing the subtitles as well.  Some were wildly wrong, and none could capture the tonal nuances, the careful phrasing, and the subtle interplay between Mueller and Riefenstahl as they parried one another's verbal thrusts.  While far less original and profound than the master's work being discussed, Mueller did a very creditable job here.","user":"B24","rank":[24,28]},{"title":"Beautifully-done documentary, long but thought-provoking.","rating":19,"date":"19 November 1999","review":"This film explores the boundaries between the artistic and the political (or, when does fiction have to pay for the reality it may help to create?).<br><br>Why is Leni Riefenstahl, who created propaganda for the murderous Hitler (\"Olympia\" -- which pioneered many of the techniques now cliche in sports camerawork and editing, and the notorious \"Triumph of the Will\"), despised and reviled while the work of Eisenstein and others who created propaganda for the murderous Stalin is lovingly taught in film schools? Well, maybe it was because Stalin was on the winning side of the war, according to Ms. Riefenstahl, a tough old broad who was apparently ecstatic about being interviewed. Up to a point.<br><br>This is a top-notch documentary. The cinematography is gorgeous. The probing questions are important. Riefenstahl is alternately combative, charming, evasive . . . and a whole lot of other things.<br><br>I give it a 9 of 10.","user":"mpenman","rank":[16,18]}]