[{"title":"Good Movie","rating":7,"date":"10 July 1999","review":"I had never heard of this film before I saw it on television one night. Luckily I saw it in Australia and it wasn't edited for content. I found it refreshing and intelligent. Set in the 1920's, it's about a reverend and his wife who travel to the Outback of Australia to \"tame down\" an artist (played well by Sam Neil) who has been creating \"lewd\" paintings. In the end, the film successfully criticizes religion's hang ups about sex. The reverend, of course, plays the part of conservative who is against these paintings that he deems are pornographic. During the course of the film he has several opportunities to explain his objections. While the film ultimately suggests that he is wrong, it still allows us to understand the reverend's point-of-view and perhaps even sympathize with it. The most remarkable thing about this character was his \"some things are best left untold\" stance concerning his wife's misbehaviors. This was a brilliant unexpected twist for me. At no point in the movie is the reverend made out to be a villain. Rather, he is presented as an intelligent and forgiving man, who just happens to be conservative about sex. With that said, I do not believe criticizing religion's view of sex was the main purpose of this film. The true story -- related but not the same -- was about the reverend's wife finding her own repressed sexuality while also well-aware of her husband's views which she initially shared. She is the heroine of the film. She makes a journey, encounters inner conflict, and returns changed by her experiences for the better (or we are led to believe). Any review of Sirens would be incomplete if it failed to comment on the sex scenes. They are explicit but nothing to be alarmed about especially considering this film targets a purely adult audience. The sex scenes are tastefully done even if they are built on lust instead of love. If I may venture an opinion, I think most women will find this movie very erotic. Take for instance, the perpetually bare-chested muscular blind guy. This character fulfills no other purpose than to incarnate female sexual desires. Men however will not find this film very arousing. It explores the sexual desires of women not men. But there are plenty of beautiful naked women to kept them interested even if the story doesn't. But as a man, I enjoyed the movie too. (I can't even recall any film attempting to explore men's sexual desires artfully at this moment...) In summery, a very good film that is thought-provoking and well-done. 7/10","user":"MyOpinionIsFact","rank":[44,50]},{"title":"A Provocative Moral Statement","rating":20,"date":"20 April 1999","review":"While this film is often not taken seriously because of its explicit nudity, it is in fact one of the most thought-provoking commentaries on religious values I have ever seen on the screen.  This film provides us with the stark contrast of the repressed preacher from London and the artist's three models in rural Australia, a throwback to Shakespeare's \"Green World.\" The fulcrum of this contrast is the preacher's wife, being pulled in both the oppressive, \"moral\" direction by her upbringing and her husband and the free and expressive direction of the artist.  The breathtaking cinematography and stunning visual symbolism of this film contribute to make it into a powerful attack on the Christian moral code that dominates western thinking. I have been scoffed at on more than one occasion for praising Sirens, but I left the theater questioning my own views about what is and is not moral. The fact that this film's sexual content seems to invalidate it as art in many people's eyes merely underscores the value of its message.  Along with Sling Blade, Sirens to me stands as the most provocative film about morality made in the 1990's.  A solid 8 on a scale of 1 to 10.","user":"Todd M","rank":[58,70]},{"title":"An erotic little romp","rating":8,"date":"18 March 2004","review":"\"Sirens\" seems to have touched a nerve here.  Some reviewers dismiss it as derivative soft-core drivel.  Others love it.  It probably helps to know that there's little derivative about the story-it's based on real people and a real incident. Sam Neill's character--Norman Lindsay--was real.  Lindsay, a prolific artist and novelist, was also a libertine living a Hugh Hefner lifestyle when the rest of the world was awakening from the Victorian Age. \"Sirens\" was filmed at the Lindsay home and gallery, a 40-acre estate now run by the Australian National Trust.  The artworks are all Lindsay's.  And the storyline is based on an incident in which the Anglican Church dispatched a cleric to convey concerns about \"The Crucifixion of Venus.\" As for the plot, it's simply a humorous retelling of what might have been--with lots of voluptuous nudes and erotic symbolism tossed in for good measure.  Yes, it's all quite predictable.  You know five minutes into the film that the Converters will become the Converted. But it's a fun ride getting to that inevitable destination.    `Sirens' is not for everyone.  If full-frontal male and female nudity offends, you will be offended.  If ridiculing the Church or its values offends, you will be offended.  And if the notion that the cure for a boring marriage is a little extra-marital dalliance offends, you will truly be offended. Otherwise, it's a little erotic gem and a great way to start an even better evening. :)","user":"hannahchow","rank":[44,53]}]