[{"title":"Some bad decisions ruin what would have been an excellent adaptation","rating":6,"date":"22 June 2001","review":"I love the story of Jane Eyre so much, to insult anything that has to do with this beloved character is not easy to say. But I must say how disappointed I was with this adaptation. William Hurt was a poor Rochester indeed. He had a very wooden and unemotional presence throughout the film. His scenes with the Jane Eyre character had no fire or emotion at all. He seemed very detached and aloof. If William Hurt was younger he would have played a better St. John. However, I must say Charlotte Gainsborough was a pretty good Jane Eyre. She looked the part and added very charming persona to the character. But she even, at times seemed cool and unattatched to me too. The worst element to this film was casting Elle McPherson as the role of Blanche. Why? Blanche Ingram was beautiful, true, but she was beautiful in the Victorian sense of the word, not a 90's waif snatched from a Parisian runway. Sheesh. The best element to this film, however was the sequences of young Jane and Helen at Lowood. Anna Paquin was amazing as she embodied the young Jane to near perfection. These early, well done scenes where the best in the entire movie but I regret to say they lead me down the primrose path to disappointment.","user":"Thornfield2","rank":[59,73]},{"title":"The worst adaptation, in my opinion","rating":1,"date":"1 March 2008","review":"Since I have commented on every version of Jane Eyre, these last sorry laurels for worst adaptation go to this version. The screenplay is not good, condensing or altogether dispensing with what I feel are vital portions of the story. One commenter remarked that it was Zefferelli's vision taking precedence over the book. Is that a good thing? I feel not - if one is going to adapt a literary classic, one should make SOME attempt to hew closely to THAT classic. The biggest weakness in this version, sadly, is Hurt himself. Jane Eyres live or die according to their Rochesters, and this one is NOT worthy of the source material. I generally like Hurt, but he could not be more wrong for this role. It requires a non-Method heroic hamminess of which he is simply not capable. As a result, Hurt's Rochester is weak, nice, and definitely not dangerous in any way. He's simply a needy guy. One nice point - Charlotte Gainsborough makes a superb Jane. Her plain looks and subdued manner with sparks of the free spirit underneath do the role justice. I enjoy watching all versions of this work, but this one is by far the worst all-around.","user":"aernest","rank":[9,9]},{"title":"Great story, great actors, mismatched.","rating":19,"date":"19 October 2004","review":"I've seen 3 versions of this movie after having read Charlotte Bronte's book. The first was with Orson Wells as Mr. Rochester, the second with Ciaran Hinds, followed by William Hurt's version. Hurt's Rochester is the only one who didn't bring tears to my eyes. He is a wonderful actor, but it's as if this part was not suited to him. Mr. Rochester is a man of passion, pain, and jealousy; none of which were reflected in this story. The story is great, the actors are great, but story and actors are mismatched in this film. Another disservice is the failure of the movie to maintain the integrity of the book. Jane leaves Thornefield twice; once on the death of her aunt, and once again when left at the alter. In Bronte's book, Jane's travels and subsequent proposal of marriage after being left at the alter are somewhat cumbersome, but necessary to support her final return to Rochester, being willing to be with him under any terms. Unfortunately, these adventures are apparently difficult to incorporate into a film. Charlotte Gainsbourg's performance is the only one I've seen, and I'm anxious to follow her career. She seems to have the ability to well play suppressed emotion.","user":"klmillscats","rank":[33,41]}]