[{"title":"This whole courtroom's out of order.","rating":7,"date":"4 April 2004","review":"I can't understand why there are so many poor reviews of this movie. And some to say that this is the worst movie Pauley Shore has ever done. I've seen it about a million times, and I think it is just as hilariois nearly every time I see it. And, sure Pauley Shore's most classic movie may forever be Son in Law, but com'mon, I do not think this is the worse thing he's ever done.<br><br>Jury Duty is largely a parody of Twelve Angry Men, and ...And Justice for All. Tommy Collin's (Shore) mom and her soon-to-be husband take their trailor and head off to Vegas for a quickie marriage. So, unemployed Tommy, in need of a place to stay, finds an opportunity for an extended stay at a luxury suite while serving jury duty on a high profile murder trial. The suspect is \"Drive Thru Killer,\" Carl Wayne Bishop (Whalen), and now his fate is to be determined by eleven jurors who just want to vote him guilty and go home, and one juror (Tommy) who wants to prolong the jury sequestering as long as he can. Eventually, it turns into a parody of Twelve Angry Men when Tommy, trying to prove Carl Wayne Bishop's innocence, must find a way to prove to the other jurors that reasonable doubt exists.<br><br>\nIf you know Pauley Shore, you know that going to be no easy task, but it is also going to be a hilarious endeavor. And the supporting cast of jurors are just as funny as they become ever more irritable as it seems like a verdict is never going to be reached, especially Richard Edson and Sean Whalen.<br><br>So why all the negative reviews? It is such a stupid story, so stupid that it is funny. And it is Pauley Shore, doing what Pauley Shore does best, acting like a total nut and having a blast doing it. For a load of laughs and a waste of some time, Jury Duty is not a bad choice.","user":"vertigo_14","rank":[14,19]},{"title":"Guilty As Charged.","rating":30,"date":"30 October 2002","review":"Typical Pauly Shore fare that has him stalling the verdict on a murder trial so he can stay in a plush hotel longer. Naturally he has cut a deal to be in the President's suite of a different inn than the other jurors. Anyway as time progresses, it appears that Shore might be on to something when he tries to convince the others that the case is not as cut-and-dried as it appears. Some outstanding performers (most notably Shelley Winters, Charles Napier, Tia Carrere and Stanley Tucci) somehow found their way on this downer. 2 stars out of 5.","user":"tfrizzell","rank":[8,11]},{"title":"Bad movie","rating":2,"date":"18 October 1998","review":"This is one of the worst movies I think I've ever seen in my life.  Who on earth spent money on this piece of junk.  Whoever they are I am sure they are regretting it.  I am not a Pauly Shore basher, I really liked Son In Law, but this movie is worthless.  Do not see it, I'd say burn it and put it out of its misery.","user":"buttons-3","rank":[13,20]}]