[{"title":"For Horror fans and film buffs only...","rating":7,"date":"1 April 1999","review":"A great film if you fall into one of three catagories: a) Horror movie fan, b) more specifically, a George Romero fan, or c) a film student. Basically what this movie boils down to is a look into the world of horror film production. It follows the development of the movie Dawn of the Dead from pre- to post-production. Provides a fascinating look into how exactly a film is shot and put together into its final form. I had heard of this film's existence shortly after I became a rabid Romero fan, and when I bought I was expecting a great supplement to the classic film. I have to admit I was a little disappointed after first viewing. While the movie concentrates on Dawn out of all of Romero's movies, I was left wanting more.","user":"felixmic","rank":[7,7]},{"title":"An historically important documentary with some insights into the struggles faced by independent filmmakers","rating":8,"date":"17 February 1999","review":"Given the avowed intentions of George Romero as an independent filmmaker, we can see his zombie epics as no mere tilting at windmills. Rather, Romero can be seen as a reflexive artist: his metaphorical depiction in these films of the constraints on attaining a fulfilling life run parallel to the difficulties he faced in the production process. This documentary charts the trajectory of Romero's career through a period in which access to the means of film production, he acknowledges, has become less possible for like minded independents trying to get a start in the film industry. These struggles are symptomatic of how globalisation has helped foster the libertarian survivalist mentality of \"the player\", dependent upon multi-skilling, movement and market \"freedom\" from government regulation and civility/citizenship (or loyalty to and/or lifetime employment by one studio/company). \"Day of the Dead\" depicts the destructive restlessness of soldiers and 1 mad scientist trapped in a bunker. With no government to sanction their role, they become increasingly mercenary/asocial. Rebellion against regulation is celebrated in the caricatures of BIG GOVERNMENT as Nazis or \"the Evil Empire\" in 2 of the biggest flagships for these changes; the Indiana Jones and \"Star Wars\" films produced by major studios. Their return of the \"hero\" cultivates reliance upon adaptive individual resources (\"Han SOLO\" indeed!) and changes in consciousness rather than social structures...the teachings of Anthony Robbins echo Yoda. Since the period in which this documentary was made, changes in media cross- ownership have led to films of popular computer and video games. It seems Romero has finally had to follow the trends by making \"Resident Evil\", if only to finance the concluding installment of his zombie series.","user":"lefty-11","rank":[5,6]},{"title":"The D(ead)-Files.","rating":28,"date":"28 September 2006","review":"Well, the one thing I learned from this documentary is that George A. Romero smokes a lot and that he apparently can't give an interview without holding a cigarette in his fingers, whether it's lit or not. Apart from that, this documentary doesn't feature any groundbreaking news or memorable information. I guess that, as usually the case with footage like this, it's a lot more fun to make it than to actually watch it as an extra feature on the DVD. Roy Frumkes probably had the time of his life following and interviewing horror idols like George Romero, Ken Foree and Tom Savini (especially since he was still a student at the time) but for other viewers it's not that interesting. The introduction is rather ingenious, as it shows a comical sketch of the Marx-brothers mocking Pittsburgh (the place where all Romero's movies are set) and than it's just a whole lot of interviews and sequences from \"Night\", \"Dawn\" and the modern vampire movie \"Martin\". The documentary explains how Romero was influenced by the news events of that time and that he's a truly gifted filmmaker with a sixth sense for imaginative camera angles. Stuff we all knew already, in other words. There's some nice trivia about the mall where \"Dawn of the Dead\" was shot, like for instance, filming was interrupted during the month of December because of the Christmas decoration that couldn't feature in the film. The parts with Tom Savini are also a lot of fun to watch, because he clearly loves his job and was offered a lot of creative freedom by Romero for his zombie make-up in \"Dawn\". There surely are worse ways to spend 60 minutes of your life, but overall this documentary is not really worth bothering for.","user":"Coventry","rank":[8,13]}]