[{"title":"A sequel worth seeing","rating":24,"date":"24 August 2003","review":"No matter what people say, I think this sequel is very well written and scored.  It may not be the best movie ever created, but some of the events that occurred in the sequel are fact based. i.e. the Bob Ollinger shotgun incident, Billy actually busted out the window and yelled a \"Hello Bob!\" before he emptied both barrels into Ollinger's head and chest.<br><br>There are the Hollywood add-in's as in most movie production, but i thought it was worthy of praise.  There will be people who say that sequels shouldn't be made, but everyone is entitled to their own opinion.  I believe that as long as the sequel provides ample entertainment and you don't have 50 sequels on the same subject that sequels are fine.<br><br>NOTE:  For the last commenter, they didn't \"kill\" Billy in the first Young Guns, they stated that he was caught in the Old Fort Sumter by Sheriff Pat Garrett and killed, but we never actually see him die and according to the sequel and different accounts of what occurred over 100 years ago, we may never know exactly who is buried in William Bonney's grave except for the individual that is entombed there.","user":"burgh66","rank":[23,24]},{"title":"Ah, good times, good times","rating":7,"date":"23 November 2003","review":"Well, I have to say I loved this movie when it first came out.  It has a beautiful desert set, a wonderful array of actor driven characters, and the kind of gun fighting you could only imagine from a movie about Billy the Kid.  But now that I've watched it more recently, it's highly amusing.  To watch current stars like CSI's William Peterson and The Lord of the Rings' Viggo Mortensen at the dawn of their careers is something that can't be missed.  Along with them are a flock of excellent 80's actors who will have you loving them all over again.  Emelio Eztevez provides what is probably the best performance in his career along with the likes of Christian Slater, Kiefer Sutherland, and Lou Diamond Phillips.  I recommend this as one of the best good time westerns that recent years have to offer, though the first movie of the series is a bit better.  7/10","user":"jonothanwarriorpoet","rank":[14,14]},{"title":"I'll Make Ya Famous...","rating":21,"date":"21 June 2003","review":"YOUNG GUNS 2 was a stunning achievement, a sequel that managed to surpass its brilliant predecessor, 1988's YOUNG GUNS.  YOUNG GUNS 2 follows the story of Billy the Kid, already an outlaw and now riding with the cow thief Pat Garrett.  Garrett is offered the position of Sheriff by the Governor, who finds himself constantly cowed in his efforts to catch Billy the Kid.  In the Governor's mind, you must hire a thief to catch one, hence Garrett is the perfect choice.  Pat Garrett, who has long planned to go respectable, siezes the opportunity and turns on his friend and partner.  What follows is a great western adventure, rich with themes of sin and redemption and the tragedy of brother against brother.  That alone makes a great flick.  But then YOUNG GUNS 2 offers the question... what if Pat Garrett was conflicted about his choice?  What if he still had feelings for the Kid?  What if he let him go?  This is good stuff, folks.  The leads do the material justice, with Estevez jumping back into the role of Billy like an old and comfortable suit that still fits perfectly.  William Petersen gives a nuanced performance as Pat Garrett, a man driven by both loyalty and selfishness.  Of course no review of this film should fail to herald the talents of Lou Diamond Phillips.  Phillips is an actor who constantly seems to raise the bar for himself, and YOUNG GUNS 2 is no exception.  His Chavez is MORE spiritual, MORE effortlessly wise... dare I say MORE Indian than he was even in the first installment.  Hopefully, Phillips will be with us for a very long time.  Kiefer Sutherland, Christian Slater, Balthazar Getty, and Alan Ruck round out the talented cast.  So finally, do yourself a favor with this one, YOUNG GUNS 2 is an amazing film experience.","user":"GradyQ","rank":[36,42]}]