[{"title":"Surprisingly Dark","rating":8,"date":"21 January 2005","review":"What sets out to be a comedy movie with ghosts, (and anyone could be forgiven for thinking this is what it would be given that Michael J Fox has the lead) rapidly becomes a very dark supernatural thriller.<br><br>The special effects still look good even by todays standards, and the story is solidly written, good characters and good direction, there is not much to criticise in this movie.<br><br>The film itself is one that you should not miss, and certainly not because you think its something that it isn't.<br><br>8/10 A surprising film, that has probably been overlooked by too many movie lovers.","user":"mjw2305","rank":[125,145]},{"title":"Expertly Crafter","rating":10,"date":"27 December 1998","review":"The Frighteners is an excellent horror-comedy-drama in which Michael J. Fox plays ex-architect and now psychic scamster Frank Bannister. The film revolves around the premise that Frank, after being involved in an accident which resulted in the death of his wife, can now see disembodied spirits and runs a scam in which the ghouls haunt houses under the order of Frank and then he 'exorcises' them for a fee. However, a series of murders begin in Frank's town and it becomes achingly clear that these murders have something to do with his wife's death. The romantic involvement comes in the form of Trini Alvarado (Little Women) who plays a doctor who's husband was killed by the evil forces at work. This film achieves many things, it manages to create a comic atmosphere at times whilst being able to make us feel real sympathy for the character of Frank and his tragic circumstances. This is a truly under-rated film and it is well worth watching.","user":"DaveKerr","rank":[77,95]},{"title":"The best Horror Comedy movie ever","rating":10,"date":"16 September 2013","review":"I remember my older brother showing me this movie when it first came out. I was younger and had a very vivid imagination so it scared the hell out of me. Today I went back and re-watched this movie I have not seen since then and while my imagination is still vivid, I respect the movie now because of it.<br><br>The movie starts off I would say 80/20 Comedy/Horror. You get to see the shenanigans that MJF and his two ghost cohorts pull off. Watching the transformation of his character as he slowly realizes that he's up against more then he thought. <br><br>The story develops unbelievably well. The characters (living and dead)are well thought out and brought to life, with such great enthusiasm it's amazing. The story evolves slowly and dramatically, each minute bringing more and more to the story.<br><br>The acting is amazing. MJF, awesome. Playing both the con artist, and then the hero. Jake Busey pulls of crazy well, but then again he is his fathers son. <br><br>The CGI I think is pretty awesome for the time. The grim reaper shots, still give me the creeps.<br><br>Over all I have a love for this movie that makes me want to keep watching it again and again.","user":"JontheLobsterLover","rank":[14,16]}]