[{"title":"Revenge Of The Cajun Nerd","rating":9,"date":"27 February 2006","review":"I have to admit: this Adam Sandler no-brainer is hilarious, just had me laughing right from the start. I'd rank it in my top ten funny movies of my collection and it features one of my favorite characters in film: Bobby Boucher Jr., a heckuva lot nicer guy than Sandler's \"Happy Gilmore.\" <br><br>\"Bobby\" is about as innocent and a gentle-natured a guy as you'll find this side of Forrest Gump. You can't help but root for him, and that's the idea. What the film basically involves is another \"Revenge Of The Nerds\" theme except it's \"nerd \"- singular - as the picked-on waterboy turning the tables on the football jocks. Interesting to once again see Jerry Reed, whom I haven't seen much of since his days in \"Smokey And The Bandit.\" He has much fatter face but everything else looked the same. Then there is Henry Winkler, \"The Fonz\" who now is the opposite: a guy with a terrible inferiority complex. All the characters in here are wildly exaggerated.<br><br>This cartoon-like comedy may not be high-brow, but so what? It's not totally low- brow either, but I do wonder why modern filmmakers cannot seem to make a comedy without all the sex references and the profanity. Nonetheless, Sandler's Cajun accent, his strange-looking-but pretty girlfriend (Fairuza Balk) and crazy mother (Kathy Bates, in the funniest role she's ever played) are all great fun to watch.<br><br>It's silly, particularly the ridiculous climactic football game, but then this movie is hardly to be taken seriously. It's all absurd humor, and 90 minutes was just right amount of time for it.","user":"ccthemovieman-1","rank":[58,74]},{"title":"Oh Come ON!! This was not meant to be high art..just great fun","rating":9,"date":"26 August 2005","review":"All of the characters were well developed and entertaining. This movie never pretended to be anything more than it was..a fun, wacky comedy with a bizarre plot. Anyone who beats this up for being dumb should be taken out back and paddled. It is obvious THEY are too dumb to realize that this was DESIGNED to be dumb. Anyway..there are too many scenes that I STILL laugh at today, even though I have seen this 1/2 dozen times. So, if you are looking for the greatest film ever made on all levels..give this a pass..if you can relate to the humor, it's a wonderful hoot! I am not a die hard Adam Sandler fan, but I think he scored a 10 in this one for likability and laughs.","user":"rdambroso","rank":[31,41]},{"title":"Criminally Underrated","rating":10,"date":"22 July 2019","review":"This has to be one of the most underrated films on IMDB. A timeless, hilarious film.<br><br>Compared to the modern PC drivel being released today, this film is phenomenal.<br><br>In fact, I'd rather watch The Waterboy for the umpteenth time than ANY of the films released in the last 5-10 years... except maybe the John Wick series.<br><br>I don't think Adam Sandler has made a more funny production to date. This film deserves more than a 6.1 star rating... at least worthy of 8 stars.","user":"MellowStello","rank":[9,10]}]