[{"title":"Mike and the Mirthmobile","rating":8,"date":"29 April 2004","review":"The cultural references of Wayne's World may date it a bit, but the nature and personality of its humor set it apart. There is a kind of naive benevolence and boundless joy which makes this movie so lovable. Its aimless plot and exaggerated humor are cute, without ever transcending that barrier into maudlin sentiment. This is a difficult mix to achieve, especially when so many comedians go out of their way to achieve \"street credibility\" through as much forced vulgarity and stereotypical humor as possible. Campbell and Carvey's characters were the ultimate comedic anti-heroes for generation X, even more so than Jay and Silent Bob, Bill and Ted, or Beavis and Butthead. They championed amateurism, paraded self-affecting humor, and became worshiped for telling everyone they weren't worthy. If '60s pop culture encouraged people to \"do your own thing,\" Wayne and Garth were the genuine article in the '90s. Two complete geeks had fun acting as themselves, and became celebrated in the process. One of the true comedy classics of our time. 8.5/10","user":"epophimous","rank":[37,41]},{"title":"Time capsule material proves need for \"best scene\" Oscar","rating":10,"date":"13 October 2006","review":"Ask most men within a decade of my age in either direction to list the 100 best movie scenes of all time, and the scene from \"Wayne's World\" where they sing/lip sync Bohemian Rhapsody in the car will be on more lists than not. It might even make every list. Not designed for the \"critically acclaimed\" snob set, Wayne's World, the film adaptation of the extremely popular Saturday Night Live skit by the same name, targets its audience perfectly and never even enters the water, let alone jumps any sharks. The movie is true to itself from start to finish.<br><br>The bedrock of the film, as well as the skit, is the unbending friendship of Wayne and Garth. Most children have one best friend who stands out above all others, and there's no mistaking that Wayne (SNL alum Mike Myers) and Garth (SNL alum Dana Carvey) have that type of friendship. The best friends host a cable access show in Aurora, Illinois, also sharing the skit's title. Other SNL alums, such as Brian Doyle-Murray (Noah) and Chris Farley (a concert security guard), round out the cast.<br><br>The plot centers around an opportunistic television producer named Benjamin Kane (Rob Lowe), who, with funding from an arcade owner, turns Wayne's World into a slickly produced national show, causing it to lose touch with its audience, and causing friction between Wayne and Garth, who feel they have sold out their fans and their roots. A love interest is tossed to Wayne in the form of Cassandra (Tia Carerre), in triangular form due to the attention paid to her by Kane as well as Wayne.<br><br>The pop-culture cuisinart responsible for most of the SNL skits was working in overdrive in this film, and that's a good thing. Everything from product placements, to gratuitous sex, to lame plot devices were lampooned. Rob Lowe was excellent as the sleazeball junior television executive, while cameos abound from the rock world, including Alice Cooper and Meat Loaf. Though not publicized as much as the other quotables from the movie, my personal favorite scene was when Wayne and Garth were each laying on parked cars, and Garth starts whistling the closing theme from Star Trek.<br><br>SNL-based movies have been hit-or-miss since their inception, but this was unquestionably a hit.","user":"ray-280","rank":[45,53]},{"title":"Schwing!","rating":7,"date":"26 August 2006","review":"Remember how wildly popular this one was when it came out? \"Wayne's World\" didn't completely live up to all of the hype, but it's not a bad little comedy. Mike Myers and Dana Carvey are great as Wayne Campbell and Garth Algar, co-hosts of a basement-based cable access show. The duo seem to have it made when their show hits the commercial airwaves, but there might just be something sinister behind it all with executive Benjamin Kane (Rob Lowe) in charge.<br><br>\"Wayne's World\" is not generally uproarious, but it certainly has its moments (the backstage scene with Alice Cooper, portraying the leather-clad rocker and his bandmates as political sophisticates, is hilarious). Myers' act wears a bit thin as the film proceeds, and the \"serious\" stretch in which Wayne seemingly loses his girlfriend and best friend just doesn't fit. But even when it's not funny, \"Wayne's World\" is usually reasonably entertaining and charming. Carvey's bizarre Garth is one of the highlights, along with some memorable parodies and writing.<br><br>Based on the popular \"Saturday Night Live\" sketch, \"Wayne's World\" is definite period piece of the early 1990s. Its catchphrases (\"... not!\" and \"Schwing!\" among them) were repeated millions of times over by teenagers. It spawned a less-successful sequel, and although there was talk of a third installment, it's almost a certainty we've seen the last of Wayne and Garth. Nevertheless, party on!","user":"ReelCheese","rank":[24,31]}]