[{"title":"worthwhile","rating":6,"date":"2 November 2003","review":"It impressed me as slightly above-average because it's a bit different than the standard World-War-era, black-and-white, mass-produced western.  Much of this film occurs at a trial, and, the bang-bangin', therefore, is more sparse.  The \"courtroom\" is \"ruled\" by cantankerous old (and often humorous) fire-and-brimstone Judge Plunkett (although it's obvious that he's slightly less caustic to Bill).  Dub Taylor, too, is the refreshingly-less-familiar but capable singing sidekick named Cannonball, who enlists Bill to travel with him to Independence, where Cannonball's father was killed by Jessup - witnessed by only Marsha.  So, Jessup wants to marry Marsha because \"a wife can't testify against her husband.\"  Marsha's guardian is her niece-beating uncle, Rufe, who Jessup will pay to allow Marsha to become Jessup's bride. But Marsha is in love with Johnny, and, it's at Johnny's trial (for running away with/kidnapping Marsha) where Defense Attorney Bill states his suspicions regarding Jessup.  An hour of time adequately spent.","user":"KDWms","rank":[3,3]},{"title":"Wild Bill Makes A Wild Prosecutor","rating":7,"date":"25 June 2011","review":"In Hands Across The Rockies Wild Bill Elliott as Wild Bill Hickok handles one of the more unusual problems he ever encountered in a western. He and sidekick Dub Taylor hear about the murder of Taylor's father and they journey to the town it occurred in. On the way almost by accident they capture a wanted criminal.<br><br>But when they get to where they're going they run into another interesting problem. No mystery as to who the killer is for the audience, it's Kenneth MacDonald who is the local saloon owner. When we meet him he's negotiating a marriage deal for Mary Daily who happened to witness the murder so she can never testify against her husband. And her bottom feeding family is ready to go along with it.<br><br>That's not sitting well with Daily or her boyfriend Stanley Brown with whom Daily flees. But they're caught and Brown is charged with kidnapping. So Elliott acts as his attorney to get him off before he can proceed with the homicide he's come to get justice on.<br><br>Hands Across The Rockies is one of the best of the Bill Elliott B westerns I've seen so far. It has a very original plot and might even belong in the legal cinema genre as well as a western. The irascible judge and the self righteous prosecutor are played by Eddy Waller and Harrison Greene. Waller runs his courtroom like Judge Roy Bean with a rifle across his bench and Greene keeps irritating him so. This role of Judge Plunkett just might have been Eddy Waller's career role.<br><br>Definitely a must for fans of Wild Bill Elliott and those who haven't heard of him will become fans upon seeing this one.","user":"bkoganbing","rank":[2,2]},{"title":"The only bad thing about this Wild Bill western is the title","rating":6,"date":"2 May 2005","review":"Bill Elliott got his \"Wild Bill\" from playing Wild Bill Hickok in an above average series of westerns for Columbia that began with a serial. This is one in the series which featured Cannonball Taylor as his sidekick. Bill Elliott was not a singing cowboy. So Cannonball, a very talented comedian and musician, added the musical entertainment by singing and playing his squeeze-box accordion. Although the title of Saturday matinée cowboy films seldom matched anything remotely related to the script, the title of this entry is almost surrealistic. The acting is good with standout performances by the two Crawley sons and my Eddie Waller (later Nugget Clark in the Rocky Lane westerns of the early 50's) as Judge Plunkett. If we had more Judges like Plunkett today, our criminal justice system would not be in such judicial chaos. I especially like the line he uses when summoning the first two rows of men as jurors, \"Come forth and be the jury if you're not drunk or half-witted,\" or some words to that effect. Tom Moray, who played Hi Crawley, only made a few movies. Do any readers know why this was? Ditto for Mary Daily, who played Marsha Crowley. This was one of two movies she made in 1941, the only two movies she ever made. If you're a fan of the Saturday matinée cowboy genre, you should enjoy this movie.","user":"krorie","rank":[2,2]}]