[{"title":"Another Good Japanese Torture Film","rating":8,"date":"2 April 2006","review":"YAKUZA LAW: LYNCHING! is one of the latter films in Teruo Ishii's JOYS OF TORTURE series, and is honestly the only one I've had the chance to see as of this writing. It is a strong entry that deals with the subject of Yakuza principles, and the penalties for not abiding by their codes.<br><br>The film is divided into three parts - the first two taking place in feudal Japan, the last segment being more \"modern\" and set in the late 1960's. All three deal with those that have broken the Yakuza code, and their subsequent torture and dispatch. The last part is played more like a 70's style crime film, and feels somewhat mis-matched against the other two segments - but is still an enjoyable addition to the film.<br><br>There's plenty of violence in this one for those that are looking for that - a good bit happening before the opening credits are over. I think that this one will be of interest to most who enjoy the 60's/70's era samurai/pinky films. Strangely enough - there's no actual lynching taking place. There is a scene where a guy is hung (by his torso) from a helicopter and dragged around a beach - but I don't think that really qualifies as \"lynching\". Not as strong as the \"unofficial sequel\" to Ishii's first JOYS OF TORTURE film - SHOGUN'S SADISM (aka OXEN SPLIT TORTURE) - but definitely in the same vain. LYNCHING! is definitely worth a look to Japanese exploit fans. 8/10","user":"EVOL666","rank":[5,7]},{"title":"tedious anthology film devoted to gruesome torture","rating":3,"date":"6 January 2005","review":"Didn't like this one very much. It's an anthology film, with three chapters, progressing from what appeared to be the Tokugawa Shogunate, to Meiji era, to the 60's (can't be positive about any of the time periods).<br><br>Basically the flimsy plots are just an excuse to have Yakuza commit brutal acts on each other and throw lots of fake blood around. I can see how this may have been shocking or trail-blazing at the time of release, but I found it quite boring now. Without the shock value, the movie really has no center. The stories get progressively better - the first (amazingly, starring Bunta Sugawara, who usually improves anything he's in) is terrible, the second and third are slightly better.<br><br>Sidenote - the actor who plays the alien in Goke has a small role in the final piece as a weird yo-yo obsessed Yakuza.","user":"daustin","rank":[5,10]},{"title":"The Roots Of Yakuza Law","rating":9,"date":"6 May 2005","review":"An awesome film for the most part. Reminiscent of 'Casino' and 'Zatoichi' in its nature. Necessarily Violent as it depicts Yakuza law of an old-school variety.<br><br>This film is a great watch for those interested in old and new Yakuza films! This film is violent, i say this comparing it to newer Yakuza films &amp; also the films in general circulation. This may look a bit out of date because it was the 70's but it's still pretty grim. Those bored by this should definitely be ashamed to write such off the ball reviews. I found the earlier eras covered to be more entertaining as i have not seen much of this before &amp; i enjoy Gordon Liu and Zatoichi films too. I would say it is a must see Japanese Yakuza film along with 'Street Mobster' and 'The Yakuza Papers: Battles Without Honour Or Humanity'.<br><br>Relentless in places, baring likeness to old martial arts films ('Zatoichi' for the swords)... Good for people who don't mind the 70's style of film and even if you don't but like newer Yakuza films - watch it - it's a bit of history in Yakuza ways &amp; law.","user":"D00003385","rank":[3,5]}]