[{"title":"A fascinating, hilarious and insightful little film","rating":9,"date":"3 October 2001","review":"Made during the time when Steven Soderbergh was in the process of reinventing himself (see also \"Schizopolis,\" made the same year), this is a wonderfully inventive film with a kinetic visual style to match Spalding Gray's verbal gymnastics.  This is the kind of film that stays with you long after you've finished watching it, thanks to Gray's performance -- he is a terrific storyteller -- and Soderbergh's imaginative staging.<br><br>Caveat:  If you're at all squeamish when it comes to graphic descriptions of eye injuries, this film may not be your cup of tea.","user":"craigjclark","rank":[9,9]},{"title":"As good a way to remember him as any","rating":10,"date":"10 April 2004","review":"When Spalding Gray is diagnosed as having an eye condition, he goes to a doctor to discuss a course of action.  When the issue of surgery comes up it launches Gray on a journey to get a cure that sees him reconnecting with his Christian Scientology roots before other treatments including a physic surgeon, cutting out some foods and a Native American sweat lodge.<br><br>Spalding Gray's monologues are very much a matter of taste -many audiences do not like spoken word shows or films and even those that do may not like Gray.  I am of the mind that any story teller than can hold my interest for 80 minutes is worth listening to.  As an ex-cleaner I have listened to many of my older colleagues talk ad infinitium about their medical problems but none did so with the wit and invention of Gray.  He tells a simple story of alternative treatments and such but every little detail is painted with great words.  He also manages to inject wit into it - the funniest moment being where he is told that he cannot eat fish (cause they eat certain sea cucumbers in the wild that have chemicals) and he cannot eat chicken because they feed fish to chicken; he finds a farmer's market selling fish bred in captivity (hence, he reckons, unlikely to have eat the sea cucumbers), buys it but then is told that they feed the fish ground up chicken!.<br><br>Gray is captivating.  At times he is a bit too hyper and his mannerisms are a little irritating in a spoilt Western-hypochondriac type of way, but this is just my prejudice getting in the way.  He is a very good story teller and he makes for a good focus.  The talking heads add value but really were unnecessary to carry the film.  As director, Soderbergh finds himself with a difficult task: does he just point the camera and let the words do the work or does he try to mix it up? He goes for adding to the words and, in some cases he does (The Elvis of surgeons for example) but too often he just blurs the camera behind colours and rippled images.  It still works but the words don't need help and often Soderbergh's influence is unnecessary even if it isn't unwelcome.<br><br>Overall this is an enjoyable story that is very well told with words that do not only inform but paint and expand on the basic tales.  Soderbergh feels that he must do something to justify the difference between film and stage and some of his influence works - but happily even when it doesn't it can be ignored.  One of the more accessible and enjoyable of Gray's monologues, this film is a perfect way to reflect upon the man in the shadow of his untimely death.","user":"bob the moo","rank":[9,11]},{"title":"I Love a Good Storyteller","rating":9,"date":"28 May 2002","review":"There is not much that beats a well told tale. If it is told through television or film, a good storyteller is worth more than a billion dollars of special effects. This little film tickles and delights and causes us to ponder the wonders of medicine and the human psyche.<br><br>Spalding Gray has a \"photographic memory\" which allows him to describe things in fascinating detail. He also has a rather neurotic take on the world, just slightly askew from the norm...which allows us to enjoy a more entertaining vantage point. Above all, Mr. Gray loves to spin a tale. He delights in sharing stories and tying them all together in one general rant.<br><br>\nThis particular one-man-rant appealed to me even more than his others. Perhaps I liked it because I sought alternatives cures to my own illness and know all the crazies out there. Perhaps I liked it because I was raised by an optometrist and worked in his office a few summers...just enough to appreciate his eye condition (macular pucker) and his fear. Whatever the reason, I really enjoyed this and want to share it with all my friends now.","user":"Mscellany","rank":[8,10]}]