[{"title":"You guys are taking this movie too seriously!","rating":9,"date":"9 August 2003","review":"It's a teen movie. It's not meant to be analized.<br><br>The concept was fairly original. Scheming Teen Socialite plots to get a dream date for the school Centennial Dance (NOT the prom, as most descriptions say) and it falls through at the last minute. Her next door neighbor and childhood former best friend is dumped by his girlfriend. The two of them pretend to be a couple to make their former significant others jealous and ward off the scorn of their friends. She makes him over in her immage (of course: \"If you want to get results, you have to go to extremes!\").In the process she learns a little from him as well and they fall in love. The movie also has a cast of secondary characters who are interesting.<br><br>This isn't Shakespare, folks! It shouldn't be analized to death. It's fun and entertaining. Sit down and watch it and leave the cliff's notes at school.<br><br>The actors were great (It's nice to see that Melissa can play something besides Sabrina). Adrian Greere and the rest of the cast were great too.<br><br>The soundtrack was great as well. Get the CD: (You Drive Me) Crazy, Unforgetful You, I Want It That Way, It's All Been Done, Stranded, Faith in You, Is This Really Happening To Me, Steps, Hammer To The Heart, One For Sorrow, Sugar, Regret, Original, Help Me Save The Youth of America from Exploding, and  we can't forget \"Keep on Loving You\" by the teen girl rocker group \"The Donnas\".<br><br>You can get this movie for $5.88 at Wal-Mart!","user":"brianbrady","rank":[38,47]},{"title":"A film with heart and wit","rating":10,"date":"2 April 2004","review":"This film seems to have provoked a lot of irritation. Personally, I can't see why. I feel it's a classic teen drama with a lot of heart and some very fleshed-out performances. Another poster got it right when they compared it to Sixteen Candles, Breakfast Club and other teen dramas.<br><br>To criticise the norms of the genre is pointless: it's like complaining that a slasher pic has too much blood and gore. It's a teen high-school drama, *of course* it's going to have jocks vs. geeks, pivotal parties and the leads getting together in the final fade. We all know the destination, it's the journey that counts.<br><br>And I'd say that journey is pretty wonderful. The film gripped me in the first few minutes. I expected Melissa Joan Hart to turn in a mannered, 'Clueless'-type performance, a pastiche of popular girl gets a heart. But in fact, there was a lot more light and shade to her character, she didn't just flip from one stereotype to another. I thought the whole cast turned in sterling performances. Perhaps they were too good and the naysayers have forgotten these people aren't actually jocks and geeks?<br><br>Whatever - I'm an old bloke who was touched by this film. It brought back memories of the hell / heaven of secondary school, of how important and fleeting those relationships are. It connected with me.<br><br>Not every film has to be 'Un Chien Andalou', you know...","user":"Jyoti_Mishra","rank":[40,51]},{"title":"Surprisingly entertaining!","rating":8,"date":"8 May 2002","review":"Well, the plotline was predictable, however, Drive me Crazy is a highly entertaining teenage romp. The dialogue is witty, the theme is good-spirited, and, as in every teen movie, the soundtrack is great.<br><br>The film has its flaws, however, particularly in Melissa Joan Hart, one of the worst actresses of our time. Thanks to her, an almost entirely likeable character is ruined. Her cute lines are recited flatly, and she adds no wit or life to the film. However, I was very impressed with the actor portraying Nicole's project, Adrian Grenier. His looks and intelligent delivery make the entire film worth seeing.<br><br>Overall, a cute and cheery romance that does not feature the head cheerleader nor the lowest of the low geek- it presents it's characters and storyline in a fun, believable way, and it'll leave you loving every minute of it.","user":"chandlercanfly","rank":[23,30]}]