[{"title":"Twisted, but exceptionally crafted.","rating":9,"date":"4 January 1999","review":"This is not the film to see if you're looking for a feel-good Hollywood anesthetic to cope with the end of the holiday season. If, however, you wish to experience a great film, then I highly recommend *A Simple Plan*. Its disturbing twist on the American dream may be too difficult for some--especially the very dark ending--but that is part of what makes the film such quality fare. Scott B. Smith's screenplay is tight and flawless. Sam Raimi's inspired direction may finally reveal to the rest of the film industry what fans of the Evil Dead trilogy have known for years: that, though his tongue is often firmly in his cheek, Raimi is a fine and grossly underrated filmmaker. Especially impressive is the way he and cinematographer Alar Kivilo approach the snow-covered landscapes. There is an immensity to the frozen wastelands of the film's crucial scenes that is almost worthy of David Lean. Also commendable is Raimi's skillful use of animals (among them crows and foxes) for symbolic purposes.<br><br>But the cast, not to be outdone by their crew, is equally notable. Billy Bob Thornton gives his best performance to date, surpassing even his award-winning role in *Sling Blade*. Bill Paxton is phenomenal as a straight-laced-family-man- turned sociopath, and Bridget Fonda's convincing portrayal of Paxton's determined wife complements him well.<br><br>Audiences at the screening I saw were commenting on the film's similarities to *Fargo* as they exited the theater, and seemed to belittle *A Simple Plan* for its lack of \"originality.\" Granted, *A Simple Plan* is not entirely original. There are indeed vague shadows of *Fargo*, as well as *Macbeth* and Robert Frost, among others. But there is no such thing as an entirely original work, as great art is made by standing on the shoulders of giants. Make no mistake, this is NOT a cheap replay of *Fargo*. The differences are too numerous to note here, but suffice it to say that *A Simple Plan* is a great work in its own right, and deserves to be appreciated as such.","user":"lordrob","rank":[118,129]},{"title":"A study in desperation","rating":17,"date":"17 July 2000","review":"A Simple Plan is certainly not a simple film, as some reviewers here had hoped it would be.  The point is not how simple life is, but how horribly wrong and out of control things can get.  This film takes you to the absolute depths of human greed, desperation, and frailty.  It is amazing how many evil deeds one can rationalize by believing \"and then it will all be over.\"  A Simple Plan is a great character study which makes you think of what you would do in the same situation.  At what point would you draw the line?  How far would you go to keep millions of dollars all to yourself? The excellent photography adds to the sense of desperation that permeates the whole film.  The vast, snowbound landscape is the perfect image for the feelings the main characters have for their station in life: cold, silent, lifeless, unending, and unrelenting.<br><br>Don't watch this movie unless you are prepared to see a group of people reach the end of their rope and make a series of life-changing decisions.","user":"bandguy","rank":[84,94]},{"title":"This movie really makes you examine your own motives.","rating":7,"date":"7 September 1999","review":"\"A Simple Plan\" immediately reminds you of \"Fargo\". A dull, snowy winter. Men beginning to cheat on a small scale, which then begins to escalate until it becomes out of control. And no one will *like* the ending, but it is the only ending that could make this fine film complete.<br><br>It is set in the wintertime. Two brothers come upon a small plane that has crashed. Since there have been no news reports, they rightly assume no one knows about it. There's money inside, lots of money. Everyone knows what the 'right' thing to do is. But what will they do? What would most people do?<br><br>The acting, especially Billy Bob Thornton, is excellent. You will watch the film without blinking. You will ask yourself, \"what would I do in a similar situation?\" Unless you only like light entertainment, you really need to see this film.","user":"TxMike","rank":[70,82]}]