[{"title":"This movie will probably always be in my top 5!","rating":6,"date":"6 February 2003","review":"This movie has it all. I loved it the first time I saw it and still do every time I see it.  The casting was perfect and the actors all have a wonderful chemistry together. I will never get tired of watching certain scenes, like the (last) stamp scene with Milo, when Penny realizes who the cop is and when Thomas hugs the cop (hilarious!!),  when Thomas sings finally, when Milo has to say goodbye, there are just so many great scenes in this movie. And Robert Downey, Jr. just does a tremendous job - he is so talented. When the four spirits enter his body (at different times), it's amazing how well he portrays each one with such accuracy (especially as Penny), like he's really that person. The humor never misses a beat.  This movie will probably always be in my top 5!!","user":"malibu-7","rank":[45,46]},{"title":"Nice Combination!","rating":8,"date":"1 October 2006","review":"This was another winner in a fantastic year for movies: 1993. In fact, there were so many good movies in this year that films like this were buried.<br><br>If you can just ignore the typically off-the-wall Hollywood version of death and heaven and just enjoy the wonderfully-sentimental and humorous fantasy- romance-drama story, you'll be very entertained.<br><br>The story is nicely told, entertaining start-to-finish in its 103 minutes. It really takes off after Robert Downey Jr. has become an adult and the \"spirits\" return to him.<br><br>As much humor as in here, in addition to fantasy and drama, the final 15-20 minutes are tear-jerking.","user":"ccthemovieman-1","rank":[37,38]},{"title":"My all-time favorite","rating":27,"date":"27 February 2002","review":"Heart and Souls would have to be the most heart-warming, funny, tear-jerking, feel-good movie of all time. I can't understand why no-one I know has heard of it till I rave about it and insist they watch it. After several viewings I feel that Julia, Harrison, Penny and Milo are people I know and care about, and as for Robert Downey Jr, every time I watch it I pray that he straightens out his own life, such a waste of talent to be in and out of jail. Heart and Souls ranks up there, for me, with Baghdad Cafe, Five Easy Pieces and Wings of Desire.","user":"nancy-46","rank":[35,37]}]