[{"title":"the best out of all the sequels","rating":7,"date":"24 November 2007","review":"After the original classic animated film \"The Last Before Time\", there came many direct-to-video release sequels with which the original director and animation crew had no relation with. A lot of the sequels, and there are many of them, are not all that good, especially not when compared to the original. The original \"Land Before Time\" showed the dinosaur world as being tough and frightening even to viewers. The sequels are not so frightening or tough, less violent, and are notorious for their reaching out to really young children audiences with their singalong songs. And the first of the sequels, being this film, is a bit like that.<br><br>I have only recently seen this film for the first time in years. I had seen a few of the later sequels before this and was very unimpressed. But the first sequels is by far, much better than those that followed. It sticks the closest to the original film's style and although nowhere near as good, is still a fine family film. This is the one sequel in the series I think the whole family will enjoy.<br><br>This one also has the best peril in it, making the tyrannosauruses (called sharp teeth) a lot more frightening and compelling villains than those that followed. And unlike the later sharp teeth, who mostly just growled, these ones roar like the original Sharptooth, the antagonist from the first film. And they are more violent and frightening and thus, more convincing. The other villains are a pair of egg-stealing struthiomimuses named Ozzy and Strut who are bumbling villains just trying to find lunch, but keep missing their meals. Ozzy and Strut are actually very comical and somewhat likable villains, even though they aren't nice guys. And in fact, their song \"Eggs\" is the only song in the entire series that I find catchy.<br><br>The film also retains the qualities and characteristics of the character the best. They are more serious in the first sequel than the later ones. True, they do sing annoying songs, but are still shown struggling to grow up and mature in life and prove that they believe they can take care of themselves, very much like the audience members who primarily watch movies like this. But Littlefoot is still the most cautious, Cera the strongest, and so on and so forth. The character of Chomper was a fine addition to the cast and thankfully, he doesn't talk like he would in later sequels.<br><br>Bottom line, out of all the notoriously bad sequels that followed the original \"Land Before Time\", the second one \"The Great Valley Adventure\" is by far, the best out of them all. And it's not all that bad really. I actually found it to be quite entertaining in its own way. So this one I can recommend. But those that followed after this one, I can't really speak as highly of.","user":"TheUnknown837-1","rank":[17,20]},{"title":"A solid takeoff to bringing a saga to life","rating":7,"date":"24 July 2013","review":"\"The Land Before Time\". What can you say about it? It's a classic film with glorious animation, relatable characters, groundbreaking music, and a compelling, heart-wrenching story. There's no denying it had a huge impact on me as a three or four-year-old. It will remain a favorite of mine until the day I die.<br><br>Now imagine my surprise as a kid to find out that there had already been five sequels made. I wasn't too picky, so I gave them a watch. Back then, seeing more adventures of Littlefoot and his friends was pretty much all I cared about. Now, as a critic, I must see them with a more analytic and observant eye.<br><br>Some fans of the original have disregarded these sequels. The general reason for this is that they have a somewhat softer tone and never strike as much emotion as the original. Therefore, I agree, none are as good.<br><br>The questions you have to ask with a sequel are \"Are the characters continued well? Do they become more developed? Does the movie follow the logic of the original?\" In the case of the Land Before Time sequels, the answer is yes on all accounts. Because the characters are so close to me, watching them mature as the series progresses is like seeing a friend or sibling grow morally or spiritually. Case in point, \"The Land Before Time II: The Great Valley Adventure\".<br><br>In 1994, six years after the original was released, this movie, as well as its successors, was brought out straight to video. But there's so much effort put into elements that kids wouldn't care about that it easily could have been theatrical material. For direct-to-video fare, the animation is surprisingly first-rate. It's not quite as stunning as Bluth's animation, but great all the same. The score by Michael Tavera almost matches the brilliance of James Horner's phenomenal score from the first movie. There's good money in this.<br><br>As the opening song suggests, this movie takes place very shortly after the end of the first movie. Littlefoot the apatosaurus, Cera the triceratops, Petrie the pteranodon, Ducky the saurolophus, and Spike the stegosaurus have made it to the Great Valley, and are living a peaceful and playful life under the watch of their families.<br><br>We have mostly new voice actors, the only exception being Candace Hutson reprising her role as Cera. Veteran voice actor Jeff Bennett voices Petrie with the nasal consonance that Will Ryan had. Kenneth Mars, who is most famous for his voicing role as King Triton, is likable and solemn as Littlefoot's grandfather. Heather Hogan is cute as Ducky, but doesn't quite have the innocence that Judith Barsi so rightfully put into the character. Scott McAfee voices Littlefoot in the RAS trilogy (movies 2, 3, and 4), and out of all the voice actors for him in the entire series, McAfee is my favorite, sounding masculine enough in the high voice Littlefoot is known to have.<br><br>We're then introduced to the villains Ozzy and Strut. They are struthiomimus brothers, as verified in a lyric of their song \"Eggs\", which is the catchiest song in the movie. Strut loves to graze on plants much to the annoyance of Ozzy, who is most fond of eggs.<br><br>During a night that Ozzy and Strut go out to steal an egg, Cera wakes up Littlefoot, Ducky, Spike, and Petrie and tells them that she's sick of being treated like a hatchling, and tries to work out a plan to go on strike. Littlefoot is tired of being a kid, but is still somewhat opposed to the plan. But when they notice Ozzy and Strut walking away from Ducky's nest with an egg, they all see their chance to prove themselves independent. They chase them into the Mysterious Beyond, the land outside of the Great Valley, and straight into a cave where the darkness causes everyone to panic and run amok, resulting in a landslide. The egg coincidentally rolls safely back into Ducky's nest. The gang lands in the Mysterious Beyond relatively unharmed, and come across a large egg that they mistake for the one Ozzy and Strut stole. The five work together to bring it home again, only to find Ducky's egg there.<br><br>Believing that Ducky's egg was there all along, they come to the conclusion that Ozzy and Strut stole this one from a different nest. They start to think it might be fun to raise the hatchling as their own, so they stand around the egg waiting for it to hatch. When it does, they realize that the egg contained a baby tyrannosaurus. But Littlefoot shows the rest of the gang that he's harmless and they welcome him into the valley, which starts the song \"You're One of Us Now\". I like the spirit of this song, but the lyrics aren't a lot. There's even a part where Littlefoot seems to cram too many words into one line.<br><br>We also get the best fight scene in the series, complete with dutch angles, when a local battle breaks out between two tyrannosaurs and the adult dinosaurs, with the kids participating somewhat. One of the most memorable scenes is when Littlefoot's grandpa fights off one of the sharpteeth in a lake.<br><br>The film delivers a good message on making the most of your young years and how fun it is to be a kid. Yes, that isn't the strongest message when you compare it with that of the original, but here's how I see it: The first movie tells the story of these characters' greatest redemption. They will continue to learn throughout the series. And if you ask me, this is a good place to start. It's certainly not as good as the original, but it, and (most of) its successors, are good sequels in their own rights.<br><br>7/10 for \"The Land Before Time II: The Great Valley Adventure\".","user":"popp-culture","rank":[6,6]},{"title":"A great sequel!","rating":10,"date":"3 August 2009","review":"I'm a big fan of The Land Before Time Series. I think they're better sequels than the All Dogs Go to Heaven sequels even though I'm kind of upset that Don Bluth didn't have any involvement in them because I think he's a wonderful animator and storyteller. In this sequel Littlefoot and his friends after reaching the Great Valley sneak off one night because they're upset of their parents treating them like babies. While they're talking about their parents they witness two egg thieves named Ozzy and Strut steal an egg from Ducky and Spike's nest and chase them into the Mysterious Beyond but when they get the egg they realize that it's not theirs and wait for it to hatch. The egg hatches into a baby sharptooth in which Littlefoot names Chomper and he and his friends raise Chomper but soon Chomper's Parents arrive in the Great Valley and Littlefoot and his friends must return him to them before their parents close the opening to the Mysterious Beyond! Filled with wonderful characters, animation, and songs (My favorite being Peaceful Valley) Land Before Time 2 Great Valley Adventure is a great sequel any of the Land Before Time fans can enjoy! 10 out of 10!","user":"jvfunn1","rank":[4,4]}]