[{"title":"A Character Study Illustrating How Nazi's Were Able to Assert Their Power","rating":9,"date":"16 April 1999","review":"The only thing more frightening that having the Holocaust as part of our world's long history is to know that are human minds capable of creating and sustaining such an oppression. The real horror of Bryan Singer's adaptation of Stephen King's novella \"Apt Pupil\" lies in that we have this knowledge. We know that Adolf Hitler possessed the powers of immense manipulation and charisma. This has been so ingrained into our heads that I remember as a child knowing that Hitler was charismatic before I really knew what the term meant. This film is an exploration into the mind of a person who conceivably has many of the same manipulative characteristics. In the progression of the film, we slowly learn why.<br><br>Before any images actually come on screen, we hear the voice of someone asking if the Holocaust occurred as a result of economic or social cultural reasons. Or was it in fact, human nature? We then realize that the monologue is being given by a school teacher in a social studies class. The principle character, Todd Bowden (Brad Renfro), a member of this class and is fascinated with studying the Holocaust. He spends much time in the library reading books and newspaper articles on the subject. Just as the opening credits finish, the camera zooms in slowly to the eyes of a concentration camp leader. This is the first of many extreme close-up shots of eyes. This distance motif is incredibly effective. The eyes are the window to a man's soul and the psyche that \"Apt Pupil\" explores.<br><br>One rainy night, while Todd is riding the bus, he sees a mysterious man, who he realizes is Kurt Dussander (Ian McKellan), a Nazi war criminal and concentration camp leader who managed to escape from Germany years before. This is when we really begin to see Todd's disturbed mind. He is the kind of person who is so meticulous that he finds fourteen finger print matches of Dussander and builds a file that will be sent to the Israeli government if he doesn't agree to tell stories about the Holocaust that \"they are too afraid to tell in school\". It is now clear that Todd is not so fascinated with the Holocaust because he's racist (the film makes no reference to him being racist). He admires the power, dedication and will behind the driving force of the Holocaust.  He mimics this power in his blackmailing of Dussander.<br><br>The scenes with Dussander explaining in explicit detail the acts that he performed in concentration camps are quite disturbing in themselves, but what is more disturbing is that Todd seems more detached than Kurt. Most of us would cringe in disgust if we were to sit and listen to the stories that Kurt tells. We get the impression that Todd is thrilled with the fact that he is able to control this man and make him relive his past.<br><br>In the film's most harrowing scene, Todd brings Kurt an officer's uniform, similar to what he would have worn during the War years, and makes him march. Up until this point, we are led to believe that perhaps Kurt has had some time to develop remorse over the years for his haneous acts of brutality, but when Todd begins commanding him, Kurt fades to the same state of mind of his Nazi persona from the past and we see the man capable of ordering concentration camp personnel to gas hundreds of Jews. The scene is truly chilling and stands out as the most memorable in the film.<br><br>\"Apt Pupil\" is occasionally slow, but never boring. I, for one could not take my eyes off the screen for a second. The power struggles between Todd and Kurt are always intense. The sequence of events leads up to a horrifying scene with Todd and his guidance counselor (David Schwimmer). Here, we learn of the lengths that Todd will take his manipulation. \"You can't do that,\" the guidance counselor says. \"You have no idea what I am capable of doing,\" replies Todd. This line of dialogue is very effective. We know from having seen the rest of the film that Todd is capable of quite a lot. While not as powerful or intense as Stephen King's novella, the film \"Apt Pupil\" gives us a creepy insight to the corruption of power and manipulation.<br><br>**** out of ****","user":"Doc-134","rank":[115,131]},{"title":"Flawed but has great direction and good performances in an uneasy story","rating":13,"date":"13 August 2002","review":"Young high school student Todd Bowden uncovers that an old man in his neighbourhood is really Nazi war criminal Kurt Dussander under the name of Arthur Denker.  Bowden offers not to turn Dussander in if he agrees to tell him what it was like to carry out the crimes he did during the war.  However the relationship changes both Dussander and Bowden, bringing evil to the surface in both of them.<br><br>Having read the short story prior to the film being made I knew that this was going to be a difficult subject to bring to the screen.  The film does a good job but makes many changes that will disappoint those who know the book.  Treating the film as a separate entity it isn't bad but it happens too quickly and doesn't go deep enough.  The plot is interesting but the depth Todd sinks to isn't convincing as half of it is forced on him and the other half he seems to embrace it.  Dussander himself is well crafted but his descent into evil doesn't go far enough to be truly captivating.  The ending is different from the book but I'm in two minds if it works better or not.<br><br>Brad Renfro is good but I can't help but compare him to the character in the book and see his short fallings.  However he does manage to keep his changes semi-realistic without descending into being OTT or turning into a cartoon character.  McKellen is perfect in the lead role and he manages to be larger than life.  An actor of Koteas shouldn't have done such a minor role but Schwimmer gives a good performance that isn't his usual `Ross' thing again.<br><br>It's hard not to compare this to the book and beside that it pales slightly. As a film in it's own right it's OK but it doesn't quite convince and has an uneasy tone to it.  Singer was always going to have a tough time following the amazing Suspects, but here he does pretty well.  The direction is great and features plenty of great shots throughout the film.<br><br>Overall it is a flawed film because it doesn't go as far as it should nor does it manage to totally sell the characters to us.  However it's worth a watch for great direction by Singer and a good lead by McKellen.","user":"bob the moo","rank":[47,54]},{"title":"A psychological thriller","rating":8,"date":"22 November 2004","review":"Directed by Bryan Singer (The Usual Suspects and both X-Men features), Apt Pupil is a story of adolescent curiosity and evil intentions. Ian McKellen (X-Men) plays the role of an aged, former Nazi soldier living alone in a quiet town with Brad Renfro (Sleepers) as a young, high school teenager in the search of finding the truth about Nazi life in wartime Germany.<br><br>Adapted from the Stephen King novella of the same name, Apt Pupil is a psychological thriller with an Alfred Hitchcock-like presence, leaving quite a bit to the viewer's imagination. Much like a game of cards, the action moves back and forth between characters, each trying to take control of one another. While Kurt Dussander (McKellen) wants to keep his past in the past, Todd Bowden (Renfro) keeps probing (and sometimes threatening) to unleash the stories of the reign of Hitler and the torture of the Jews.<br><br>While this movie is much like other Stephen King-adapted novels in the sense that it doesn't always translate well to the big screen (with all of the little nuances that made King famous), the superb acting and directing makes Apt Pupil a worthwhile venture into the nature of mental wickedness. Both Singer's vision and McKellen's portrayal of Nazi war criminal bring excitement and intrigue to this movie making it a must-see.","user":"djtonyprep","rank":[47,56]}]