[{"title":"Good fun","rating":7,"date":"9 September 1999","review":"I didn't notice that this movie was directed by Francis Veber when I rent it.  Veber was a director and screenwriter of a lot of very good comedies from the 1980's and 1970's, most of them featuring comic Pierre Richard.  Veber also directed the hilarious Le dîner de cons, in 1998.  So, Le Jaguar had all the elements of Veber movies.  It's not genious, but it had imagination in situations where a man (Bruel) had trouble because he's at a place or in a situation where he's not suppose to be, and he's got help from a man (Reno) who is at the right place.  For good smiles, see this movie, or any of the Veber films.  Reno is very good, as always.","user":"MarioB","rank":[12,18]},{"title":"Very amusing (and good for training your french)","rating":8,"date":"9 December 2003","review":"Very easy-going ander rather sweet movie, with some very funny elements. Nice acting from singer Patrick Bruel and of course from Jean Reno. Special effects are mediocre, and some goofs can be easily found but don't let that spoil your fun :-)","user":"wouter-j","rank":[6,10]},{"title":"It's really not a comedy....but it's worth a look","rating":6,"date":"27 January 2009","review":"I love French films, but the main reason I watched this film is because it was directed by Francis Veber--a man who has made some wonderful comedies (THE GOAT, THE DINNER GAME, THE CLOSET and my favorite, THE VALET). So I went into this film assuming it was a comedy--heck, the box even said it was a comedy. However, there really aren't that many funny moments and I don't really think Veber intended it to be a comedy. Instead, it's a rather unusual yet still formulaic story about the Amazon and a shaman who has apparently lost his soul.<br><br>The story begins with Jean Reno coming to Paris with this shaman for a press conference about saving the rain forest. However, shortly after arriving, the shaman announces that some guy he saw in the elevator (Patrick Bruel) is \"the chosen one\" and this chosen one must return to the Amazon to retrieve the shaman's lost soul. However, Bruel hardly seems like the hero type, as he's a gambler and is more interested in finding $100,000 to pay off his debts before the mob kills him. When he can't figure any way out of his predicament, the guy finally agrees to go to the Amazon.<br><br>There's a lot more to it than that, but despite the strangeness of the setting and characters, the story is amazingly formulaic--very predictable, as you KNOW exactly what will ultimately happen in this charming but not especially well written film. You KNOW that the gambler will ultimately show depth and courage and save the day--so all the stuff leading up to this is rather bland since you KNOW what must occur. Had there been a few twists, the film would have been much better. Perhaps the film makers were afraid to do anything about the rain forest that did not end in a 100% happy ending--which is sad, because so often French films avoid these Hollywood-like clichés.<br><br>Despite a story that is only adequate, the characters (especially Reno) are fun to watch and I must say that Veber sure made the Amazon gorgeous--with exquisite cinematography and music. A lovely but very predictable film that is well worth watching, just don't expect this to be among the director's best.","user":"MartinHafer","rank":[4,7]}]