[{"title":"Give It A Chance","rating":7,"date":"21 June 2001","review":"I'd be lying if I didn't admit this is yet another patterned Bruce Willis flick. The kind where he plays the hard boiled cop with a colorful past, but I gave it a chance. This one finds Willis as Tom Hardy. A cop from a family of cops and things aren't going too well. First off, he's just ratted out his violent partner (Robert Pastorelli) at an official police inquiry and that doesn't win him any fans in the department. Then his depressed former partner jumps off a bridge killing himself. What a load to carry. All of the while there's this killer on the loose and when his father is murdered by him, he lets it be known he thinks the killer is a cop and suddenly he's reassigned to River Patrol.<br><br>This movie succeeds on a basic level -- it's entertaining. Sure the story is loose and the film's surprises are somewhat stale, but it's all in good fun. Willis gets to look aptly serious and hunt for the killer on the waters and there's just enough suspense to sustain interest and the minor twists of the story keep things at a good pace. Meanwhile the rounded supporting cast keeps things lively and keeps the viewer going, \"Where have I seen him before?\" or \"Hey that's such and such\".<br><br>I've read on here how people think this is stupid, dumb and lacks any suspense or thrills. Like any of the Die Hard movies had exceptionally smart stories, you didn't know what was gonna happen next or how it would all end. Of course not. For a entry level Bruce Willis flick, this one satisfies. Now if only I could get the Little Red Riding Hood Song out of my mind...!","user":"refinedsugar","rank":[59,70]},{"title":"Not Your Ordinary Action Film, Very Underrated","rating":8,"date":"20 February 2000","review":"More than any film I can remember in a long time, I have never understood why this film hasn't gotten higher ratings than it has. The plot, while not ingenious (and even somewhat predictable) is still exciting and will keep you engrossed.<br><br>The film's creators get a lot of points in my book for locale creativity. Instead of setting the film in some predictable location such as New York, Los Angeles, Miami or San Francisco they set it in Pittsburgh, PA, definitely not your ordinary movie location. It's one that adds a wonderful freshness to the movie however.<br><br>The location shooting is outstanding. The scenery is different and excellent, the photography is great, even spectacular in places and the action is on a par with some of the best action films ever, including Bullitt. Who would normally think to expect extensive boating and water action in a state as synonymous with mountains as Pennsylvania is? That alone is worth taking a look at this movie.<br><br>I do not usually care much for Bruce Willis. I thought he was very well cast in this movie however and Sara Jessica Parker added extra special chemistry. The cast is much better than average overall and includes such outstanding actors as Andre Braugher, of the outstanding tv series \"Homicide\". I thought that the casting in general, as well as the photography, location and action very adequately made up for any possible deficiencies in the plot itself.<br><br>I would warn that there is extensive foul language in this film, more than is necessary even for a film of this genre in my opinion and probably it's biggest drawback. I would still say that the film is well worth watching when your in the mood for some escapist fun and action fare. As I said earlier, I think the film deserves higher ratings than it's gotten so far. I've watched it twice now (it was just as good the second time, in fact even better) and that definitely won't be the last time I watch it.","user":"Scot6","rank":[46,62]},{"title":"A good Bruce Willis movie","rating":8,"date":"1 June 2004","review":"I don't understand why this film is so over-looked. It has pretty everything fans of Bruce Willis would want. He is a cop, not liked by his fellow officers, and he is on a murder case where no one believes what he has to say. There is action, swearing, one liners, and even some sex. Bruce doesn't usually have that in his films, maybe that is what threw people off. Just Kidding.<br><br>By all means, this is no masterpiece, but it is an entertaining mystery with an AWESOME car chase. One of the best. Bruce Willis fans should definitely check this movie out. It is pure Bruce and without him the \"lone cop\" story wouldn't work as well nor be as credible as it is because of him. 8/10<br><br>Rated R: violence and profanity","user":"BroadswordCallinDannyBoy","rank":[41,59]}]