[{"title":"Strangely satisfying","rating":9,"date":"12 October 2018","review":"One of the weirdest movies I've seen. Saw on video tape when it came out then recently watched it again 18 years later. Forgot how fun it is to watch. The absurdity of Bale's character Patrick Bateman's shallowness and preoccupation with superficial things like how upset he gets over a colleague having a better business card than him makes this movie comedic while he's slicing up victims. Still not sure about whether or not all of the things happening were all in his head. I guess that's up for anyone's interpretation of the story. Very well done and one of Bale's best performances as if he's ever performed badly.","user":"nph19","rank":[104,108]},{"title":"Very good","rating":9,"date":"1 July 2005","review":"In 1991, Bret Easton Ellis' controversial novel \"American Psycho\" took the world by storm  women accused it of being misogynist, sexist filth and others were understandably shaken by its brutal and graphic depictions of unprovoked violence and torture.<br><br>Set in the 1980s, the book follows the story of a 27-year-old Harvard graduate named Patrick Bateman, who goes on a killing spree and murders \"twenty, maybe forty people.\" It was originally slated for circulation in 1990, but Random House pulled out of distribution, fearing backlash. It was later released as part of a Vintage Series, and quickly sold over 250,000 copies, becoming one of the most popular (and, to some, important) literary works of our time.<br><br>In the movie, Welsh actor Christian Bale portrays Bateman gleefully tongue-in-cheek, whether it's confessing to manslaughter over the phone (\"I just had to kill a lot of people!\") or dancing to Huey Lewis and the News' \"Fore\" album before hitting an associate over the head with an axe.<br><br>Patrick is a troubled guy. On the surface, he appears to be normal  he's a Wall Street broker with a secretary, an expensive apartment suite, his own limo and a fancy business card. But on the inside, he's a monster  complete with an insatiable blood lust and lack of empathy for fellow human beings. (If he can indeed be classified as one.) As a film and a novel, \"American Psycho\" is an attack on the absurdities of the '80s yuppie era  sometimes the satire isn't very subtle, in fact it's often made very clear, but I liked it. Because the movie is so eccentric and over-the-top, and Bale is so loony and maniacal, the satire needs to be equally strong  and it is. Whether it's business men drooling over each other's fetishistic business cards or Patrick discussing the nuances of modern pop music before killing more victims, \"American Psycho\" hits strong and hard  this is a great, overwhelming cinematic and visual experience. It cannot be condemned for being unsubtle  it never was.<br><br>The performances are wonderful. Bale is superb as Bateman, totally embodying the character. As a man bewildered by his environment, and wanting only desperately to fit in, Bateman listens to Genesis and \"Hip to Be Square\"; finally we have proof that too much Phil Collins and Huey Lewis will turn you into the next Ed Gein.<br><br>Perhaps some fans of the novel will dislike Bale's performance (at times, it almost seems comical, such as when he murders his coworker Paul Allen, played by Jared Leto). But I thought it was the perfect mix of introspection, self-hatred, outer-loathing, lust, conformity and schizophrenia. Bale manages to capture all of this perfectly, and by the end of the film, I could not imagine anyone else in the role.<br><br>Willem Dafoe, Chloe Sevigny and Reese Witherspoon all have co-starring roles, but at the end of the day it is Bale who really drives this film home  he's the reason it's worth seeing, and in part the reason it exceeds beyond the typical restraints of its genre.<br><br>Since its release, many critics have accused \"American Psycho\" of being a watered-down version of the book, being both \"politically correct\" and \"lacking satire.\" However, I don't recall the last time I saw a man beat a dog to death with the heel of his shoe in a mainstream motion picture. Or chase after a prostitute completely naked, wielding a bloodied chainsaw. Or hold a gun to a cat's head and threaten to feed it to an ATM machine.<br><br>In fact, when \"American Psycho\" was previewed before the Motion Picture Association of America, they gave it an NC-17 rating  not for its violence, as one might expect, but rather for its threesome scene between Patrick and two prostitutes.<br><br>Director Mary Harron cut footage from the film and finally managed to achieve an R-rating, but on a new \"Uncut Killer Collector's Edition\" DVD, you can see the film as it was intended to be seen  and it's a real fine treat. Now excuse me, I have to go return some videotapes.","user":"MovieAddict2016","rank":[667,802]},{"title":"A film that teeters between Miracles and Mania","rating":9,"date":"13 October 2001","review":"Having just finished American Psycho, I came to IMDB to get some clarification on the ending. And it seems I'm not the only one left vaguely adrift by the ambiguous ending.<br><br>I've browsed some of your comments, not all 400+ to be sure. But some of them. A good sampling I think, and this movie has three distinct cheering sections.<br><br>Those who consider it a masterpiece, those who consider it unredeemable, boring trash, and by far the largest segment, those who see it as a flawed masterpiece.<br><br>I fall into the latter category. And no, I did not read the book. But as others have stated any movie that requires you to read the book, to \"get\" the movie, is ultimately a failure as a movie.<br><br>So my review is based solely on the merits of the film. And contrary to what some have said, the film does have many merits. I found it brilliantly directed, and a superbly acted examination of excess, and boredom, and evil. An examination, satire, critique of a time, and type of thinking.<br><br>\nEven before seeing the ending, I thought how much bateman lives in people. Found myself thinking, an examination of bateman is an examination of men by the name of Reagan and Bush. How American Psycho is an examination of our times, and our modern theologies.<br><br>I found the movie as a whole riveting, loved the restraint shown (and disagree with those calling for more gore, I think Mary should be applauded for her deft hand, the scenes have more power for what is not shown), and was captivated by nearly every scene, by scenes others have called boring, but I found profound.<br><br>Bateman putting on his makeup, or simply trying to get a restaurant, and the near apocalyptic importance, such minutiae makes in the lives of empty men. The right card, or the right cloth, or the right table, or the right watch, how these are the signposts of an empty age and an empty soul, and how these things have more value than your fellow man... or woman.<br><br>Bateman attains everything the materialistic times tells him he should want, but once he gets it he feels nothing. Emptier than before, less than before. It's only in the extremes of his addictions he begins to feel something, anything. He feeds to fill the emptiness, but the more he feeds the emptier he gets. He eats at his fellowman (woman) but in his bloodlust he eats at himself.<br><br>He is the American dream, taken to its cannibalistic extremes.<br><br><br><br>And never before has makeup, played such a mesmerizing part in a movie. Bateman's(Chris Bale's) face at times when he is under stress, takes on a plastic look, a glossy, sweaty sheen, and for all the world it looks like he's wearing a mask... and the mask, his mask of sanity, is beginning to run.<br><br>Simply amazing use of makeup. And incredible performance by the lead actor. I wasn't familiar with him before this, but everyone will be after this.<br><br>Upon first hearing about this movie, I had no desire to see it. I've grown up since the age of Hills Have Eyes and trash like The Beyond, watching people suffer no longer seems significant. I guess as we get older we ask more of our art than springer, or the WWF, or slasher flicks. We ask of our art to tell us something true. Something of ourselves, and our world.<br><br>I think American Psycho under the deft hand of Mary Harron becomes more than my prejudices, and exceeds my expectations. Rises at times to dizzying heights not unlike art.<br><br>Mary's restraint makes this movie. But I fear her restraint nearly sinks it as well. The ending is too ambiguous. Who is Bateman in the end. Is there a Bateman? And what did he do or did not do?<br><br>In the end,the movie will nag at you. Did he or didn't he? And in the end, now that I write this I'm thinking maybe the answer doesn't really matter, maybe in the end the answer is the same. In the end a sin of thought, or a sin of action, is still a sin. In the end we are left with a man, and a nation... whose mask is slipping.<br><br>\nI think like the first Psycho, time will prove this one.... worthy. I now add Mary Harron to the small selection of modern directors I will tiptoe through broken glass to see. Directors like Dave Fincher(Seven, Fight Club), Carl Franklin(Devil in a Blue Dress), Johnny To(Expect the Unexpected), Ringo Lam(Full Alert, Victim), M. Night Shyamalan(Sixth Sense, Unbreakable), and Peter Weir(Fearless).<br><br>Recommended.","user":"grendel-37","rank":[774,972]}]