[{"title":"A quality b-movie","rating":9,"date":"6 January 2004","review":"Everything about this movie screams B-grade. From the dodgy name to the questionable cast to the dubious premise. The only thing that stops this from being a B-movie, is that it's actually really, really good.<br><br>When \"The Syndicate\", represented by Ice-T, gathers together it's less reliable members in an empty prison for a little game, the probability of violence was always going to be a definite.<br><br>What makes this movie different is in large part due to the choice of music. The utterly inappropriate Mambo soundtrack clashes with the violence, giving the movie a sort of trite, macabre humour. This humour gives a consistent feel throughout the movie, backed up by violence that while brutal is strangely un-graphic.<br><br>Mean Guns is an action movie with a quirky sense of humour and a brain. It won't be everyone's cup of tea, but it's an entertaining trip.","user":"whitegold76","rank":[36,41]},{"title":"Better than expected.","rating":7,"date":"21 January 2012","review":"I can agree with other sentiments here: \"Mean Guns\" is more than just the standard B movie. I was lured to this thing by the names involved, but what we get here is not relentlessly predictable stuff. A crime boss named Vincent Moon (Ice-T) gathers a large group of lowlifes together, people who've \"betrayed\" their organization basically by being screw-ups. Moon's idea is to put all of them into a \"kill or be killed\" situation, providing them with various weapons, and the last three standing will supposedly walk away with the sum of $10 million. In addition to The T, we get other B movie perennials doing their thing; Christopher Lambert brings his own brand of acting to a more jovial - and unhinged - character than usual. Also appearing are Deborah Van Valkenburgh (\"The Warriors\"), Thom Mathews (\"The Return of the Living Dead\"), Yuji Okumoto (\"The Karate Kid, Part II\"), Tina Cote (\"Omega Doom\"), Kimberly Warren (\"Blast\"), and Michael Halsey (\"Dollman\"). Hoke Howell of such classics as \"Kingdom of the Spiders\" and \"Humanoids from the Deep\" has a cameo at the outset. As one will notice, the cast is largely made up of regulars in the films of the prolific Albert Pyun, and it don't matter if the acting ain't ever gonna win any awards; it still gets the job done. The T is amusing in the lead, and Lambert is actually a hoot, although it's veteran Halsey that really stands out, playing one of the most interesting characters in the whole thing. Van Valkenburgh is likable enough as the most sympathetic of them all. Mathews and Okumoto have their moments as a consistently bantering pair of buddies. It's hard to knock a movie that immediately goes for the approach of underscoring the fast and furious action with mambo music, which adds to the humour. Of course, when one sees the ridiculous fate of one of the characters, they'll see this is never meant to be taken too seriously. At an hour and 50 minutes it IS awfully long for this sort of thing, but that kooky charm still pervades the proceedings. And, despite all the violence, there's really no gore at all. Fans of low budget escapist fare should find this reasonably interesting and diverting, all the way to its unexpected ending. Seven out of 10.","user":"Hey_Sweden","rank":[9,9]},{"title":"Mambo and violence, blood and rhythm, a brilliant B movie.","rating":10,"date":"2 May 2003","review":"Yeah, the acting is bad. So was the acting in Evil Dead, but it's a B movie - the bad acting is what makes it so good. And I don't know who thought of using a mambo sound track in an action movie, but it's PERFECT! Mambo is a very passionate form of music normally associated with lust or love, but in this movie it compliments the brutality flawlessly. All the characters in the movie have unique, slightly exaggerated personalities (remember, it's a B movie)... Watching them interact and form shaky alliances while trying to survive the situation is interesting.","user":"evanstucker","rank":[27,32]}]