[{"title":"A very under-rated movie","rating":10,"date":"31 October 2001","review":"This is one of those movies that I still pull out every once in a while and just pop in.  It's absolutely entertaining, with great performances from pretty much everybody, but especially Andy Garcia and Lance Henrikson.<br><br>It plays out like a good mystery/thriller should: Frustrating twists and turns, brooding atmosphere and music, and layer after layer of clues that you know are building to a big time climax.  I really can't find anything to criticize about this film and I'm surprised it's IMDB rating isn't higher. <br><br>\nIf you haven't seen it, you'll be doing yourself a favor by bypassing the new releases for just one night at blockbuster, and picking this one up.","user":"thirdi","rank":[74,90]},{"title":"A beautiful, haunting movie","rating":10,"date":"25 March 1999","review":"I like a good suspense story as much as anyone else, but this one really stands out. If it doesn't get the recognition it deserves, maybe because it's a \"quiet\" thriller, without shocking or gross-out scenes ; it relies mainly on characters and atmosphere - very moody and autumnal. For once, the killer's identity is logical and honest, but there is so much more to this, especially a graceful photography. Okay : I love this one. This is no brain candy or beer-and-popcorn, just honest, straightforward stuff, which reminded me very much of literary thriller writers like Ed Gorman or T. Jefferson","user":"Phroggy","rank":[54,68]},{"title":"rent first, ask questions later.","rating":9,"date":"25 December 2000","review":"This is easily one of the most underrated Hollywood films of the nineties - it's got a compelling script, beautiful performances (particularly from Andy Garcia, Uma Thurman, and John Malkovitch in a short but unforgettable cameo.), some of the best cinematography ever set on film (director of photography Conrad Hall later went on to shoot 'American Beauty'.), and one of the greatest scores ever written by underrated composer Christopher Young. As it is, this film is heaven from a filmmaker's perspective and a pretty damn good drama to boot. Highly recommended.","user":"snorklewacker-2","rank":[53,68]}]