[{"title":"Standard story but great martial arts action","rating":15,"date":"15 February 2002","review":"Jake Lo lives in America having seen his father killed in Tiananmen Square during protests.  He is embittered about taking a stand for anything and believes his father died for nothing.  However while at a fund raiser he sees mobster Serrano kill a Chinese drug dealer and finds himself in the witness protection programme with the FBI.  However when `FBI' agents try to kill him he finds himself on the run not knowing who to trust.  He eventually finds himself with a Chicago cop Ryan who will do anything to get to Serrano's boss Tau.<br><br>This is an excellent little martial arts film mainly due to the involvement of the late Brandon Lee.  The story never really gets above the usual B-movie fare of guns and gangsters.  There is some clever stuff with occasions where we and Lee never know who to trust, but for most of the way the story is simply an excuse for a huge amount of fight scenes.  Lee has plenty of skills, he doesn't rely on wire work for spectacle but here he has a mix of his father's style and Chan's ability to use everyday items.  The fights are well handled and all his moves are clear to see, making it all the more interesting to watch.<br><br>Lee is excellent here, he's really fit and has movie star looks.  His performance is perhaps more thoughtful than you'd expect, but the real skill is his fight scenes which he handles well.  Of the rest of the cast Powers Booth and Tzi Ma stand out.<br><br>A great little martial arts film.  Not a fantastic story but the fight scenes are really well handled.","user":"bob the moo","rank":[24,24]},{"title":"Brandon's star rises","rating":9,"date":"22 May 2000","review":"This was Brandon Lee's second american made movie (Showdown In Little Tokyo was the first) and the film where you could see Brandon was starting his ascent up the action hero ladder. With each film Brandon's martial arts skills improved and in this movie he really shines. Not to mention his acting ability as well. He proved in this movie that he had what it takes to be a star. He incorporated some Hong Kong style action similar to Jackie Chan's films into this movie. An example is a terrific sequence in a small apartment where Lee takes on several bad guys armed with guns and he takes them out with his hands, feet, kitchen utensils, refrigerator doors, etc. Powers Boothe also does a great job as tired cop and Nick Mancuso plays the main villain very superb. The Crow was Brandon Lee's best movie but Rapid Fire displays his fighting skills the best. Definitely a must for action fans!","user":"Neo-212","rank":[18,18]},{"title":"An Example Of Lee's Potential Exemplified Here","rating":8,"date":"21 January 2008","review":"It was a huge blow when the news of Brandon Lee's death made headlines in the mid 1990s. The fact that the guy never managed to fulfil his opportunities as a successful action movie star and follow in the footsteps of his dad in that particular sense was tragic, considering just how good he was on screen. Showdown In Little Tokyo was a C-list martial arts epic, whilst The Crow- Brandon's very last movie he had starred in, was a horror movie, which whilst his martial arts skills were relatively limited, he still manage to display his acting graft as well as to show that he can act, in addition to kicking arse.<br><br>Rapid Fire came out in 1992 amidst his previous effort, his collaboration with Dolph Lundgren entitled: 'Showdown in Little Tokyo', which was released the year before. In this movie, Brandon plays art student Jake Lo, who witnesses a murder and afterwards, finds himself on the run from a gang of evil drug lords, as well as a bunch of two-faced, backstabbing cops, of whom are enlisted and supposed to protect Jake but who turn out to be doing the dirty work for the bad guys. Thankfully, he has a good cop on his side and together, the pair, despite their dislike for one another, work together to bring them to justice.<br><br>American martial arts films tend to be rather forgettable, run-of-the mill type of movies compared to the Hong Kong, Kung Fu-based flicks, but Rapid Fire in contrast is one of the much better efforts. It is action-packed, explosive and Brandon is not that bad of a fighter. He is exceedingly good and manages to combine his late father's trademark moves and aggression with Jackie Chan's athleticism, and his fast and frenetic movements. Another leaf he has taken out of his text book is when he takes an object and smashes it on his opponents head, for example.<br><br>This is a good martial arts movie; alas, it is a glimpse of how great Brandon was and how great could have been and how far his career might have gone- had he still been alive today","user":"wchngliu","rank":[10,10]}]