[{"title":"oedipus at Taiwan","rating":6,"date":"6 April 2006","review":"From the beginning of the film we are aware of the conflict between father and son. When the handsome motorcyclist breaks his father's taxi mirror Hsiao Kang (Kang-sheng Lee) is fascinated by him in a love/hate way. His overwhelming mother who conceives of him as a reincarnation of the God Norcha drives him out of the house by her ranting and effects the necessary break with his father. He redeems his school tuition dives into the nightlife of the luminous,illusionary city.. He follows Ah Tze (Chao-jung Chen) and his brother Ah Bing (Chang-bin Jen) in their nightly decadent rounds and plans revenge. When he finally achieves this revenge, by trashing Ah Tze's motorcycle he is not quite satisfied. Ah Tze and his brother are beaten up. They are plunged into misery and despair. Hsiao Kang goes to a brothel but cannot bring himself to meet with a prostitute. The castration resulting from his break with his father is at least temporarily in effect.<br><br>What is so great about this film is precisely its rich imagery and the fascinating performances. It is mesmeric and moving. In the later films many of the actors/characters will have further more developed existences, but in Rebel of the Neon Gods we are introduced to a trope on the James Dean \"Rebel Without a Cause\" film in a compelling series of images. A fine, perhaps a great film.","user":"gyges03","rank":[16,17]},{"title":"Taipei -- through a glass darkly","rating":7,"date":"21 December 1998","review":"Tsai Ming-Liang doesn't make movies per se.  He takes slices out of people's lives and puts them up on the screen for people to see.<br><br>This movie is an example of this style of film-making seen through the eyes of a group of teens in the city.<br><br>The meaning of the movie is open to discussion.  My take is that the dark tone of this movie reflects the dark tone of its characters lives.  For them Taipei is the beginning and the end.  Where else have they ever seen, where else would they go?  No careers, no connections, no future, no love, no hope.  Nothing but work, study, drinking, failed relationships and ennui.<br><br>I don't share Tsai's bleak appraisal of the city.  It is every bit as bad and grungy as he paints it (I _lived_ in the apartment with sandals floating across the floor!) but it is also much brighter, much better, and much more hopeful at the same time.<br><br>The most powerful thing about this movie is the extent to which it draws you in.  I first saw this at the Seattle film festival.  I was pulled in to the movie so completely I expected to smell Chinese sausages and _chou dofu_ when I left the theatre.","user":"jeremy23","rank":[26,30]},{"title":"an atmospheric masterpiece","rating":10,"date":"30 June 2008","review":"Having lived in Taiwan from the mid eighties to the late nineties, this film showed how Taipei was like during the early nineties. That was when the MRT was still under construction, and everything looks a little bit old, filthy, run down, and crowded. This film accurately portrayed the lives of the youth living at that time, such as hanging out all day in the arcade, obsession with motorbike racing, and for some going to the after school tutor seminars. when watching this film a wave of nostalgia hit me as I realized that Taiwan now is a lot more polished and modernized, and not as gritty as before, which I have dearly missed.<br><br>The film showed the \"little people\" of a big city. They are often ignored, alienated, and living day by day in the fringe of a faceless and monolithic society.","user":"vince4953529","rank":[17,19]}]