[{"title":"Mildly entertaining - An improvement over II","rating":4,"date":"4 December 2005","review":"Just to be up-front about this - I enjoy these films. The original - Highlander - was the only one in the series which really stands the test of time (Endgame has now joined it in this), and stands head and shoulders above the others for artistic merit and originality, but still, I liked the others well enough. <br><br>I also like the much maligned Christopher Lambert. He's an odd actor to be sure - far from the Hollywood norm in appearance, style and accent, but he's nothing if not original and once you understand his understated style, you might just see that the guy has some serious talent. Read on if these statements resonate with you. Otherwise, feel free to move on without reading or rating this review.<br><br>Lambert is good, Unger is good, Van Peebles is campy as hell, alternating between absurdist humor and menacing poseur-ship.<br><br>The script is OK, certainly less grandiose and more mindless than II (and closer to the original in feeling, pace and plot), but not particularly original.<br><br>The production values are a slight step up from II, about as good as Endgame, and almost up to the original's standards.<br><br>Conor McLeod has reclaimed something of his humanity - imagining himself to be the last immortal on earth, but of course, he is wrong. Sorcerer Kane, who has stolen the magic of one of McLeod's former teachers, is hunting his head. McLeod has adopted a child and is about to fall in love again, the last thing he needs is an attack by an enemy who has no corporeal body.<br><br>The film is entirely predictable, and is nothing more than a fan film. So what? It's harmless entertainment with some very pretty scenes from Scotland and some other gorgeous landscapes, and, if you don't expect much, you might just have a good time with it.","user":"mstomaso","rank":[26,34]},{"title":"The best sequel yet, but it still can't hold a candle to the original","rating":4,"date":"20 June 2005","review":"In 1995, with the enormous international success of the \"Highlander\" TV series, producers Bill Panzer and Pete Davis once again teamed up to unleash another \"Highlander\" sequel upon us. This time, it's \"Highlander III: The Sorcerer\" or, as it was known in the U.S., \"Highlander: The Final Dimension\". (Don't ask me where the hell that came from) The film finds Connor MacLeod (Christopher Lambert) enjoying a peaceful life with his adopted son, deceived that he has won the Prize. However, the evil sorcerer Kane (Mario Van Peebles) has broken free from the Japanese mountain he was entombed in, and now he wants the Highlander's head.<br><br>One of the parts of the film I enjoyed the most was Christopher Lambert's portrayal of Connor. For once the character isn't a severely depressed maniac, and in fact, he's better in this film than any other. Mario Van Peebles makes a good, if not unbelievable villain, with Deborah Unger as the sexy Highlander girl.<br><br>Andy Morahan's direction is good. The script is good and very entertaining, but the film's problem is this: although it has all the right materials to make a good film, they are either wasted, put in the wrong place or dropped quickly. It makes you wonder if the franchise is cursed.<br><br>The film's score, by J. Peter Robinson, was very nice as well. Loreena McKennit's \"Bonny Portmore\", featured twice in the film, is a beautiful and outstanding song that has now become the theme for the series.<br><br>All in all, while \"Highlander III\" (Sorcerer/Final Dimension) is an entertaining film, it can't come anywhere near comparing to the original film, although it is a major improvement over \"Highlander II\".","user":"KnightLander","rank":[9,10]},{"title":"Several good elements come together here!","rating":28,"date":"28 July 2004","review":"A good revenge plot drives this third Highlander installment. An old enemy similar to the Kurgan of the first film, escapes an entombment after 400 years and begins a quest for the head of McLeod. Kane- the Sorceror -makes a great villain and blends into modern America easily with his tattoos and piercings. The film also boasts some Conan elements with Mako again playing a wizard named Nagano and there also some f/x similar to T-2 as the sorceror's power is made apparent. Debra Unger is also a plus as a smokin' leading lady who provides the best and sweatiest sex scene of the \"Highlander\" cycle. There are also some great locales used in the film. From snowy Japan to African deserts to the Scottish Highlands, the film features all three beautifully. McLeod also has an adopted son and is hounded by a new NYC detective who is wise to his immortal habits. But through it all, he keeps his cool demeanor. However, the soundtrack leaves much to be desired. 7/10. Check out the DVD!","user":"jexlin01","rank":[5,5]}]