[{"title":"Underrated gem from Spike Lee","rating":8,"date":"16 September 2003","review":"CROOKLYN isn't Spike Lee's greatest, but it comes very close. Parts of the film hit so close to home with me - the sense of community so vividly depicted, and the 70s soul music (which is nearly ubiquitous through CROOKLYN) makes this film something much like a musical, with the grit and intimacy of Lee's visual realism constantly balanced against the idealism and romanticism of the music. As slice-of-life Americana, this is about as good as it gets. I disliked the scenes with the Aunt &amp; Uncle - I felt that they were being ridiculed mercilessly, for no good reason (they are the living embodiment of the idealism contained in at least some of the music heard at other times in the film, whether they know it or not), and I wished those scenes were handled with more subtlety - Lee, like his NYC bretheren Martin Scorsese and Woody Allen has major issues with suburban types (this hits a peak in Lee's later BAMBOOZLED - an almost brilliant, but also almost cruel expression of rage at the excesses of the entertainment industry that also aimed merciless fury at uncritical audiences - audiences of any and every race and class).<br><br>But this scene aside, the remainder of CROOKLYN is so strong, and very well-made - I'd still offer a recommendation.","user":"davidals","rank":[21,23]},{"title":"On the verge of classic","rating":7,"date":"1 May 1999","review":"This was the first movie done by Spike Lee that I have ever seen, and I saw this movie by accident.  Out of all of his films, why is this one of the least known?  It is worth seeing, because so many things work.  It's definitely one of the most thematic movies I have ever seen, and I can definitely relate to many of Spike Lee's memories.  It is sad, but it is also hopeful.  Alfre Woodard was awesome, and I definitely think that she is one of the best unrecognized actresses in the US today.  Delroy Lindo played his character well too.  The relationship between Troy and her brothers was especially memorable and so universal!  The best scenes in the movie showcase the children in front of the television.  This movie was on the verge of greatness but it didn't capture it just because some parts of the movie were melodramatic and drawn out.  The movie itself was about 15 minutes too long.","user":"karma185","rank":[20,23]},{"title":"Personal, Endearing, Comical","rating":10,"date":"17 August 2002","review":"I thought this was a very personal, heartwarming and funny movie that also touched on very real social issues.  It deals with the complications involved in family life like love, break up, sibling rivalry and making ends meet while also trying to lead a happy fulfilling life.  It deals with the pains of loss and of struggle, the issues facing urban communities....self-perceptions and growing.  Spike does all of this while giving a light and loving perspective to some hard issues.  It is comical and endearing as you see all of these situations played out through the eyes of a young girl, trying to grow up.  The odd struggle and perceptions of reality that we all face coming up...the embarrassment of a family, the neighborhood bully, etc....all gets played out in this summer classic.<br><br>--Not to mention the cinematography is wonderful and interesting.","user":"Monet11744","rank":[11,12]}]