[{"title":"Sorely underrated, and a personal favourite.","rating":6,"date":"6 July 2003","review":"This review is not coming from someone whose top ten films consist primarily of Farrelly Bros. films, nor do I have a particular liking for anyone involved in the film.<br><br>First of all, hats off to Jim Carrey. I read under the trivia section that his role wasn't originally intended for him, but be honest; can you see anyone else playing the cable guy? He was brilliant. He takes the film from what would have been a run-of-the-mill comedy, to levels of greatness, and anyone that thinks I'm being too kind either doesn't like Carrey (it was the film that made me do a complete turn around), or needs to see the film again.<br><br>The overall tone of the film is a bit of a mix, it gets darker as the story goes along, but the jokes never mollify. I mean, it's a stalker story with clever film and television references... It's really hard to pin down the identity of this film.<br><br>This ranks as Stiller's best directorial performance to date. Reality Bites and Zoolander are good, but not great. This film expresses a lot more of his prowess. I see him as a very capable film maker, he is just yet to make his mark with something more widely appreciated.<br><br>The Cable Guy is by no means a classic film, and admittedly, you wont see it on any AFI lists anytime soon, but there is no denying the quality effort that was put into this film by all of it's contributors. And there are many of them -- check out all of those cameos! Chip Douglas' (Carrey) contrived relationship with his customer Steven (Broderick) ranks as one of the most memorable in recent history. It has set a precedent in black comedies that has scarcely been touched since.<br><br>I would have seen this film at least 30 times by now and it still seems fresh, and this has lead me to believe that the film probably needs to be viewed more than once for it to completely appreciated. I only wish that there were more people out there that 'get' this gem.<br><br>This concludes our broadcast day. Click.","user":"The-Gent","rank":[220,244]},{"title":"watch it again. highly underrated","rating":10,"date":"2 October 2004","review":"the most astonishing thing about the cable guy is that it simply wasn't liked by critics! however, this was to be expected given the way it was promoted. Not just another Jim Carrey \"stupid humour\" movie as it was unfortuanately promoted as, the cable guy was an entirely different genre; a comedy so dark it bordered on horror/thriller. and it is utterly brilliant.<br><br>to watch this movie a second time is highly recommended, as is an open mind to the dark web that Ben Stiller weaves masterfully. The actors fill their roles extremely well; Broderick perhaps a little underwhelming, but Carrey's astonishingly dark and eerie portrayal of his character carries the film. the cameos are brilliant, and show the respect the movie received by those who read the script, with many top actors willing to appear for only short roles. in the vein of other Stiller comedies that must not be taken at face value, such as the classic Zoolander, this film genuinely needs a repeat viewing. and try to forget Carrey was ever Ace Ventura before you watch the movie. naysayers will be converted! <br><br>full marks!","user":"mr_maximus-1","rank":[200,229]},{"title":"Hidden Comedy","rating":19,"date":"19 November 2004","review":"Regardless of what people say, this movie has some very funny moments scattered throughout. When I first saw this movie, I will admit I didn't find it that funny. But it's one of those movies that grows on you with time. Even if you don't like it at first, give it some time. You have to accept this movie for what it is. A dark comedy aimed at poking fun of the lighter things in life. Jim Carrey obviously carries the movie with his infamous quirkiness, but Matthew Broderick holds his own as the anal retentive guy which he is great at playing. Whether you are talking about the Midevil Times restaurant scene or the karaoke scene, this movie is a gem. Highly recommended.","user":"baehr76","rank":[86,96]}]