[{"title":"Solid rainforest drama","rating":7,"date":"9 December 2001","review":"When this movie came out in 1992, many critics seemed to feel that it was mediocre, or average at best. Even as a hardcore Connery fan I avoided the film simply based on a handful of reviews I had read in the media at the time.<br><br>Fast forward nearly ten years and the mixed reviews here on imdb reinforced my apathy towards the film. It wasn't until I borrowed a copy through a local library that I finally watched the movie just now, and I fail to see why it's supposedly not up to par. I thought it was a fine film in most respects: the storytelling was good, the dialogue was snappy, the cinematography was wonderful, and it had a positive message. It's not an action movie, but I never felt bored at all...if anything, it was a refreshing change of pace and scenery, and Sean Connery continues to astound me with his versatility. His acting was superb, which is not really a big suprise, but he seemed more into this role than some others I've seen him in. Even the wig and ponytail looked real!<br><br>Like a lot of other people, I found Lorraine Bracco's character quite annoying, almost insufferable at certain points, but that's the whole point: her character is supposed to be like that, and the truth is that if she didn't come across as so irritating then that would have been failed acting skills on her part. I think she did a great job at being annoying, which is what she was supposed to do. I imagine that if you took some ivy league lab rat scholar and dumped them right in the middle of a situation and place that's totally foreign to them, you'd probably get a reaction like the one she portrayed. I found the two leads had a good chemistry, and the constant tension and conflict between them was very convincing and helped to propel the story along.<br><br>All in all an enjoyable film, but some of the other aspects could have and should have been expanded. I felt that they spent too much time searching the trees for the plant they needed, and the whole conflict with the developers was thrown in at too late a juncture. These aren't major failings however, so I'd recommend the film to anyone looking for something a bit different, and it's a must for any Connery fan. Don't wait ten years to see it simply because some critics didn't think it was a masterpiece. Screw the critics!","user":"discogoth","rank":[61,66]},{"title":"Superb Score, Superb Movie","rating":10,"date":"29 August 2004","review":"I've never understood why this movie is so poorly received. Sure, Lorraine Bracco is a bit shrill. No one said she came from a \"high class\" family, just that she was marrying well. My sister-in-law is a scientist with NIH and she came from humble roots. That Bracco got through to the tribe's medicine man when Connery had failed was the contrast between the two approaches the \"white man\" could make toward the natives. Bracco's negotiating skills and stubborn common sense contrasted nicely with Connery's unintentionally patronizing approach. Who COULD have been cast who would have been more convincing as the \"civilized\" woman \"going native\". Lauren Hutton, maybe. The solution to the mystery of \"compound 37\" was a genuine surprise, even though it was partially revealed on two separate occasions. The climax was intensely dramatic, ironic and sad; though, it too helped usher in the satisfying conclusion.  Jerry Goldsmith's superb score raises what is already an outstanding movie. I don't care about anyone else's opinion. For me, \"Medicine Man\" is a \"10\".","user":"Bob-45","rank":[54,62]},{"title":"McTiernan excellently weaves science, ethics and humor in this story about the search for a cancer cure in the jungle","rating":10,"date":"19 December 2003","review":"A fine movie, not to be judged on the basis of Hollywood's usual recipe for storytelling. The eccentric scientist Robert Campbell (Connery) who has found a cure for cancer out in the jungle, is not able to reproduce its exact composition. Biologist Rae Crane (Bracco) biologist has dropped in from academia to be his judge and jury and decide on Campbell's continued funding.<br><br>The film pays a fair amount of attention to scientific detail (such as \"running baselines\" and using \"experimental controls\") interspersing it throughout with lively and shrewd exchanges between Campbell and Crane. To that they add mildly sarcastic observations on field work and fund-raising committees. Whilst this scientific sub-story line runs along, we are shown glimpses of life in a sympathetic tribe for which Campbell has become a sort of sugar daddy. Ethics and personal choice confront both scientists as they struggle with the decision to reserve the last bit of serum either for the good of humanity or the life of one of the tribe's children.<br><br>McTiernan has weaved all these elements excellently and Connery and Bracco play their roles so convincingly that you could be excused for thinking they may have scientific backgrounds in real life.<br><br>The film is a feast for educated people - which is probably the reason why many of the critics have missed the fine points and proceeded to rattle off some vitriolic commentary more aimed, in my view, at self-aggrandizement than constructive film criticism. One even complained that Medicine Man didn't quite match up to Die Hard. Now there is a proper comparison for you.","user":"rmiranda-1","rank":[54,62]}]