[{"title":"conventional romance with a surprise brave ending","rating":22,"date":"22 February 2000","review":"In \"Forces of Nature,\" Ben Affleck stars as Ben, a repressed, buttoned-up stuffed shirt writer who, through a series of natural and manmade mishaps, ends up spending the several days before his impending marriage in the company of a freespirited, totally spontaneous and liberated young woman named Sarah, played by Sandra Bullock.  <br><br>For the vast majority of the film's running time, the screenplay follows the conventions of the opposites-attract scenario almost slavishly.  The script even provides Ben's fiancee with an overly-convenient replacement in the form of a now-hunky childhood friend she has not seen in years who rekindles sparks with her on the eve of the wedding.<br><br>Thus, the stage is set for the predictable true love romantic finale.  But, damn, if the writers don't pull the rug out from under us and shatter the time-honored cliche.  This is particularly surprising because, up to now, the film has exhibited no trace of iconoclasm in either its plot or character development.  In fact, the screenplay is less a full-fledged narrative than a series of photographic montage sequences strung lazily together as Ben and Sarah engage in one cutesy situation and encounter after another.  Thus, the unconventionality of the resolution comes as an even more stunning surprise than it otherwise might.<br><br>Affleck and Bullock are very appealing as two young people who complement each other's strengths and weaknesses and who learn to offer one another valuable life lessons.  \"Forces of Nature\" emerges as one of those rare films that is, perhaps bizarrely, actually better in retrospect than in the watching.","user":"Buddy-51","rank":[53,67]},{"title":"I'm sorry, I liked it","rating":10,"date":"16 November 2005","review":"I read the user comments and was reluctant to view this movie. Well I'm sure glad I went against the crowd. This is a good movie! What more could you ask for. (Sandy is great) The scene I adored is when Sarah is beckoning Ben to come and dance. If a women ever did that to me I would run to her. I really enjoyed the ending but I won't discuss that. There were enough laughs to keep it lite and enjoyable. The gay bar was a real hoot. Ben did a superb acting job doing his dance all be it Sandy does'st hurt the eyes. The one thing I liked is this movie is not a tear jerker. Most of Sandy's movies have me shedding tears like a water works. The story line surely shows that people live their lives in very different ways and that gives the movie credence. What's to not like? Easy to follow has Sandy in it what more could you want? One criticism, what did they use to put on sandy's eye makeup on a putty knife?","user":"csauer","rank":[14,16]},{"title":"This movie is so quirky and offbeat that it's really good!","rating":10,"date":"11 January 2004","review":"I don't know why many people diss this movie because it's actually really good.  Who better to have than Ben Affleck and Sandra Bullock?  They are perfect in their roles as \"Ben\" and \"Sarah\".  But I have to say if Sandra Bullock wasn't in this movie, it wouldn't be as enjoyable as it is.  There are a lot of laughs but not so much that it goes over the top and there is a lot of drama in it too.  It's a perfect mix.  The camera angles make this movie very unique too.<br><br>So the next time you're in blockbuster and you're contemplating on what to rent, you should rent \"Forces of Nature\" because it's the kind of film that will literally make you smile the whole way through.  <br><br>4 Stars out of 5","user":"liannesang","rank":[13,16]}]