[{"title":"Its greatest asset is also its greatest drawback.","rating":8,"date":"15 June 1999","review":"Yes, you read that right.<br><br>Emily Bergl is this films greatest asset. She can actually act and looks sincere. The only problem is that she's far too good looking for the role. That may sound shallow, but throughout the movie, we're supposed to get the impression that she's \"ugly\" and because of that, she's an outcast. Contrast this to Sissy Spacek in the original who looked plain enough to carry out the role of \"ugly duckling\". It was only her talent that let Bergl carry (pun not intended) out the role convincingly.<br><br>The antoganists are unusually shallow, especially when presented against the more modern bad guys in horror films, at least where you can see the bad guy. Though at least one of the bad girls is convincing as Rachel's new friend.<br><br>Jason Landon does an amiable job as Rachel's boyfriend and lends a lot of credibility to the final scene which, I must say, is a refreshing change from the hand coming out of the ground scenes popularized by the original Carrie.<br><br>All in all, a refreshingly entertaining and, dare I say, well done show.","user":"bkosse","rank":[22,26]},{"title":"This movie is very, very, very, very, very, very, very underrated!","rating":10,"date":"1 May 2005","review":"I watched this late last night on Channel 7. I first noticed that that was this hot goth-like chick playing the title role and there were people I'd seen before like Jason London, that idiot form Home Improvement Zachary Ty Bryan and Mena Suvari who had a busy year in 1999 with American Pie and American Beauty.<br><br>I think critics had a go at this film, but in my opinion this was a very worthy sequel to the original. For starters, it stayed true to the idea of having actors who are in their 20s playing teenagers (that was a joke) because Sizzy Spacek was 26 when she played Carrie in the original and we've got a 24 year old playing Rachel Long in this film here as well as a few 27 year old people playing some of the jocks.<br><br>I just loved seeing those jocks and back-stabbers getting what they deserved. They acted so well to get you to hate them. You could feel Rachel's pain and the evil within her and what she was doing... although it was so brutal and Satan-like... it was something you could somewhat cheer for. It's an amazing scene with all the glass shattering. Incredible!<br><br>But never mind that - the acting is very good in this film. The storyline is a little bit thin at times but on top of all of that it still is rather original. Some good special effects, some pretty good comedy from that American Pie nerd guy (you know who I am talking about) and it's a lot better than most modern day teen horror schlock! I put this film alongside Freddy vs. Jason as one of the most surprisingly good teen horror films of the last decade. All those Halloween sequels, and Scream if you know what I did last summer crap as well as those films that try to take the mickey out of teen horror films are worthy of more than enough Razzies when compared to this film. <br><br>I'm so glad this film wasn't nominated for Razzies.<br><br>I can't believe Emily Bergl is 30 now! She deserves more roles in movies because she is a bloody good actress with an original and unique look about her.<br><br>The Rage: Carrie 2 deserves so much more respect than it has been given.","user":"redmondrobert","rank":[24,29]},{"title":"\"Carrie\" forth the good and so-so news","rating":7,"date":"4 March 2007","review":"Admittedly, \"The Rage: Carrie 2\" can't equal the quality established by its predecessor. But it's better than I expected it to be. Portraying an outcast high school student (Emily Bergl) discovering that she has telekinetic powers - don't worry; it gets explained - and using them to get revenge on her tormentors, it mostly repeats everything from the original. But the good aspect comes from how they set up some scenes and shock you (I really liked the shattering ball). Finally, the party at the end just might make your blood freeze.<br><br>Overall, this is a movie worth seeing, if only once. Of course, you'll have to see the original first, so as to understand everything that happens in this one. Also starring Amy Irving and Mena Suvari (right before she played Kevin Spacey's sexual fantasy in \"American Beauty\").","user":"lee_eisenberg","rank":[12,14]}]