[{"title":"It wasn't that bad!","rating":7,"date":"14 November 2005","review":"I can't believe how many people pick on this movie! It's a movie...and movies are meant to entertain. I thought it was a good story line, very suspenseful &amp; emotional. Yes, there was a lot of unbelievable problems that arose, and maybe the acting wasn't all that great. Chris O'Donnell is very cute to look at, but I have to admit he's not the best actor out there. Scott Glenn is great in every movie he is in. The rest of the actors were OK. I just don't see why this movie was picked on so much. I don't watch movies so I can pick on them, I watch them for entertainment..and I was entertained by this movie. I would recommend it to anyone who is wanting to see an edge-of-your seat, emotional movie.","user":"helenaspelena","rank":[27,31]},{"title":"There's no limit to mountaineering melodramatics","rating":16,"date":"16 June 2002","review":"While mountaineering is one of the most exhilarating of sports it has produced little good fiction, and few good fictional movies, though there have been some excellent documentaries ('The Man who Skied Down Everest', the Imax 'Everest' film, for example). Somehow, when it comes to fiction, the clichés take over, and this film, with some genuinely gorgeous camera-work and impressive stunts, is full of them. The wealthy megalomaniac determined to conquer K2 at any cost, the climber who lost his nerve when his father was killed who pushes himself into action to save his sister, stuck in a crevass high up the mountain with the moneyed one, the bitter old man of the mountains who is essential to the rescue, the guide who has sold out, It's all there. One does expect some improbability of plot in a film like this, but the thought that someone might cart Pakistani Army liquid nitro-glycerine in back packs to the top of K2 to blast a crevasse open really was a bit much.<br><br>Apart from a very attractive opening sequence in Utah (Monument Valley, I think) the film was shot in the New Zealand Alps, with a few clips of the genuine Karkoram Himalaya spliced in. For this viewer, it brought back pleasant memories of climbing in the University holidays around the Southern Alps. But climbing is a dangerous sport; on one trip I was accompanied by four people, all of whom subsequently died in separate climbing accidents (one on Makalu, next to Everest). There is a fair amount of special effects malarky (no-one, not even Temuera Morrison pretending to be Pakistani, would fly an old military helicopter so close to a mountain wall at 21,000 feet), but there are also some genuinely stirring shots. <br><br>Unfortunately, the acting for the most part matches the script. Chris Connelly, good at sensitive young men, is wrong for the brother bent on rescue (it's more of a part for Bruce Willis), and Bill Paxton is only moderately menacing as the ruthless Richard Branson-style billionaire. In fact the only decent piece of acting is Scott Glenn's Wick, the veteran with attitude. The'comic' Australian climbing brothers, Ces and Cyril, or whatever their names were, were profoundly embarrassing  I guess Ben Mendelsohn will be hoping no-one will recognise him with a balaclava on his head. There were also lackluster performances from the two female leads, Robin Tunney and Izabella Scorupco. One of them, Scorupco, is an ex-Bond girl ('Goldeneye')  the casting people obviously didn't realise she was going to be spending the entire movie wrapped up in Gore-Tex. There's no sex at high altitude  it's too damned cold and anyway survival takes precedence over procreation.<br><br>I think Roger Ebert got it right on this one  a 'B' movie with an 'A' movie budget. There are all sorts of anomalies  the lack of visible water vapour issuing from the climbers, their sprightly behaviour even after hours at 26,000 feet, the use of north wall hammers to attack a rock/ice pitch, the miraculous helicopter piloting  but somehow the magnificence of those great peaks comes through. The worst thing about a movie like this is that it portrays the mountains as hellish, which is far from the truth. What is it the psalm says 'I will lift up mine eyes to the hills, from whence cometh my strength'? Climbing is one thing I have never regretted doing, and it would be a pity if people were put off the sport by stuff like this. Actually I think the people who do attempt peaks like K2 would see this film as preposterous, overblown Hollywood brown smelly stuff, and they'd be right. But there is some nice scenery.","user":"Philby-3","rank":[90,119]},{"title":"Typical Hollywood action film: no respect for reality.","rating":3,"date":"30 January 2001","review":"This movie is a so-typical Hollywood action-flick you almost can't believe it. It seems like the producers looked up this bunch of cool gadgets mountain climbers use (many of which are sharp or have pointy ends) and tried to portray some of the most irresponsible climbing you could think of.<br><br>Sure, it's hell if your sis is stuck in an avalanche on K-2 but, as some climber already pointed out in basecamp, you don't go risking another six people to 'possibly' get two down. Besides, there are better ways to do this than by strapping a can of nitroglycerine to your back.(small note: dynamite is essentially chalk soaked in nitro which stabilizes it. Guess they hadn't thought of that?)<br><br>Furthermore, you never climb beneath another group's ropes (lest they fall and drag you with them...), you do not sprint across a ridge wearing glacier-irons, you do not sit on a 5cm ledge without a safety rope attached, you do jump out of a helicopter trying to fall down unless you intend to end up spaghetti.<br><br>In short, this movie severely damages the image of the real mountain climbers, who consider safety and precaution a way of life and not something to disregard to look cool.","user":"malthus","rank":[23,29]}]