[{"title":"What A Film!","rating":9,"date":"18 September 2001","review":"This is one of my favorite films, even though it has some problems.<br><br>The film caused controversy with some of the gay crowd (who didn't like the negative press) and for the graphic sex (with bedroom violence). It became a box office winner, that made Sharon Stone a star, and yet was basically p****d on by the critics! The word is the film is better than your average B movie skin flick, only by the quality of the actors, and Verhoeven's ability. I feel the film is still not given the respect it's  due.<br><br> I first saw the R-rated version, which is very good, but now you can get the even better Unrated Director's Cut, which has even more graphic content! If you don't like erotic-thrillers, then don't see it. But anyone with taste will enjoy the thrill ride of events that take place in Basic Instinct. The script by Joe Eszterhas was highly thought of in Hollywood, and if not for the graphic nudity, a top star like Michelle Pfeiffer would have taken the role made famous by Sharon stone.<br><br>Does the script go too far at times? Yes, but that's part of the films charm, and after all, the now 'classic film moment' of Sharon Stone's leg spread interrogation, likely would have been dropped in a conventional film. Still though, I wouldn't have minded seeing a few less people getting killed off, to keep even more suspense and realism.<br><br> The score is also beautiful, and fans of Hitchcock's great \"Vertigo\" can appreciate the homage that Paul Verhoeven has included. The film has a lot of eye candy, but Jeanne Tripplehorn deserves special mention for her impressive supporting role (sadly she hasn't done much of note since). Michael Douglas does a solid job also, but I can't help wondering if a better actor like Clint Eastwood could have brought more to the table. The dialogue is not up to the level of \"Pulp Fiction\", but it's still interesting and fun.<br><br> I highly recommend this film for fans of adult mystery.","user":"btbshining","rank":[170,225]},{"title":"A fun but very muddled, illogical thriller.","rating":3,"date":"3 January 2007","review":"Mad Magazine named it \"Basically Stinks\". A bit harsh perhaps.<br><br>This is not so much about Stone playing mind-games on the perpetually-horny Douglas so much as it is about Esterhaz's script playing mind-games with the viewer. <br><br>An extremely convoluted plot; this level of complexity is more often found in political thrillers than in regular cops'n'robbers ones. I'll give credit to Esterhaz for creating a very interesting, original story, but the man isn't undeservedly known for writing illogical scripts. Clearly, his priority is to generate suspense and as many plot twists as possible - no complaints there; those things are always welcome. <br><br>However, he does this at the expense of the logic; there are so many coincidences, contradictions, and just general far-fetchedness that even a hairless 14mm kangaroo fetus can figure out that various facts do not add up. By the last quarter of the movie all the (more relevant) evidence points to Tripplehorn as the killer. But, Esterhaz being a thrills-at-the-expense-of-logic seeker that he is, made that predictable last-minute thriller-movie twist: Stone has an ice pick lying beneath her bed, while she has sex with Douglas in the movie's last scene. What does this mean? It implies that Stone is the killer. (Unless that was a complete coincidence; the ice-pick somehow slid from the kitchen and landed under the bed. Or, perhaps, she placed the ice-pick there knowing that she can play mind-games with the audience as well. Am I being stupid? Not any more than this plot.) <br><br>However, Tripplehorny had too many motives, too dubious a past, was too emotionally involved - in short: far too suspicious - not to be the killer. And the very coincidence of her being in the building when Douglas killed her shakes away the last iota of doubt about her guilt. Yet, Tripplehorny and Stone cannot both be killers. Or can they...? Esterhaz never suggests this, but the only \"logical\" explanation, one which would at least tie up some loose ends, would be the following: Tripplehorn and Stone were in it together from the very beginning, just for kicks. I know; it sounds ridiculous, and entails additional illogicalities. But it would at least explain how the hell Stone had all that information about Douglas which he himself at one point said only Tripplehorny had knowledge of, or access to. This is never explained. Since the bald, I.A. dead cop wasn't the one who sold the info to Stone (nor could he have - he didn't know the intimate details which only Tripplehorn knew) it must have been Tripplehorn; this is a fact. But if she interacted with Stone then nothing makes any sense. It's a no-win (no-logic) situation. There is also the \"minor\" detail of both Stone and Tripplehorn having extremely questionable pasts, with dead bodies lying all around them; this would implicate both.<br><br>There is absolutely no point in going further into the complexity of illogical errors which Esterhaz undoubtedly commits. He wanted to entertain, and succeeded. His past scripts have shown him that you can have success with illogic, so he bravely marched on with yet more absurd material - right into the offices of Hollywood bosses. And they took it. <br><br>The film is without a doubt very interesting, at times suspenseful, and there are plenty of twists and revelations to avoid any boredom. That way the viewer is happy, Esterhaz is rich, the studio has a success on its hands, Stone finally makes it big, and Douglas gets to yet again have sex with attractive women all over the furniture. Everyone's happy.","user":"fedor8","rank":[44,54]},{"title":"Finding the identity of a killer is always fascinating, no matter what you're watching...","rating":8,"date":"18 July 2005","review":"Everyone who has seen the film, discover that the story runs into an intense sexual chess game between a San Francisco detective ('But you said you liked men to use their hands.') and a vivid writer ('No. I said I liked Johnny to use his hands.') <br><br>Catherine (Sharon Stone) loves coke and Jack Daniel's... She is enigmatic ('How does it feel to kill someone?'), cool ('I like men who give me pleasure.'), frank (\"What are you going to do? Charge me with smoking?\") penetrating (\"I've always had a fondness for white silk scarves\"'), in complete command of herself... Her character holds men in her grip... To each uncrossing of legs, she masters every type of attraction...<br><br>Catherine is a bisexual heiress, who teases, tempts and commands She refuses to let us know that she's a true threat... She creates one of the classic Femme Fatale by leading us up to twist after twist, weaving outcomes of situations to her advantage...<br><br>Nick (Michael Douglas) is the vice cop who drinks, and does a little cocaine He accidentally shot two tourists in the line of duty... He is a troubled policeman who knows all about homicidal impulse... He is torn between two skilled women at psychology... One of the women is an evil manipulator... We can sense that Nick knows which one is the supposed killer... Nick insists he will be strong enough to take her down... <br><br>The third intriguing character of Verhoeven's \"Basic Instinct\" is Roxy (Leilani Sarell). She is Catherine's lesbian lover... Roxy is the menacing blonde of the black Ferrari, who seems not to get jealous, but to get excited... We see her wearing pants and a jacket, and dancing with another woman... Roxy let Nick sees Catherine with two men, one of them is a big, body-built black guy...<br><br>And there is another interesting character who deserves wide attention: the police psychologist who helps Catherine understand homicidal impulse... Dr. Beth Garner (Jeanne Tripplehorn) is a very good-looking, dark-haired woman, who has been involved in a love affair with a policeman... <br><br>Basic Instinct's photography borrows a range of angles from Hitchcock... The score, by Jerry Goldsmith, is wonderful... The film is wildly considered a controversial and popular erotic thriller...","user":"Nazi_Fighter_David","rank":[105,137]}]