[{"title":"Eggselant","rating":9,"date":"12 December 2000","review":"Hailing from the animation house that brought us such jems as Morph, the Wallace and Gromit series and Rex the Runt, Chicken Run is the first ever feature length claymation ever attempted.<br><br>Set on a chicken farm in Yorkshire some time in the middle of the century, our plucky (sorry) heroines face a lifetime of hard labor laying for the farmers, and if their performance is not up to par they quite literally face the chop.  Ginger, making her way to the top of the pecking order (sorry again) attempts jailbreak after farcical jailbreak, but success is less than forthcoming.<br><br>Enter Rocky The Rhode Island Red, (Rocky Rhodes for short, and you can't blame me for that one, the writers came up with it) apparently able to fly, the chickens look to him to help them bust this chicken coup, but Rocky is not what he may appear to be.<br><br>That's the plot in a nut (egg?) shell, and as you can imagine the subject matter made for perfect \"salutes\" to the classic world war 2 escape movies, references to which abound throughout.  From Ginger tossing a baseball (actually a sprout) in the \"cooler\" (coal bunker), to Fowler's incessant ramblings about his old RAF days.<br><br>The lead characters are deep and endearing enough for you to care about what happens to them, if a little stereotypical at times.  The interaction between them is fluid and believable, all the more amazing considering that Mel Gibson never even set foot in the same recording studio as the other actors, reading his lines in a studio in America instead.  The supporting cast provide plenty of humour and Mrs. Tweedy substitutes quite nicely for the Nazi camp commandant.<br><br>The animation is lively and colourful the characters wonderfully expressive in that unmistakable style developed in the Wallace and Gromit shorts, and thanks to the fact the sets are real models there is plenty of scope for dramatic lighting effects.<br><br>The only real fault I could find in the film was that it just seemed a little too... American at times.  Hollywood's involvement showed through the English setting to some degree, especially as you get to the movie's climax which seems to go a bit overboard, especially compared to the utterly hysterical ending to The Wrong Trousers.  But all in all I have to say I really enjoyed this movie.  Now all we need is a Wallace and Gromit movie.","user":"Gordon McVey","rank":[51,55]},{"title":"Son of a gun, \"Chicken Run\" is pure fun!","rating":10,"date":"22 August 2000","review":"After watching \"Chicken Run,\" you will become a believer of many things.<br><br>You will believe that a bunch of talking hens wearing beads and bandanas can speak with British and Scottish accents, practice martial arts, escape from inside a pie machine and secretly plot their getaway from an egg farm in 1955 England. You will believe that chickens can knit, dance, wear glasses and play the harmonica.  You will believe that rats can wear bad suits and have an obsession for eggs. You will believe that roosters can fly airplanes, ride a tricycle and sing  \"The Wanderer.\"<br><br>Most importantly, you will believe that the otherwise Disney-choked world of animated films has life again, and that a tiny British studio can top the big boys from Japan and the U.S. and turn out the smartest, possibly best work of this genre ever.  The one point of light in an otherwise lousy summer movie season, \"Chicken Run\" is something you'll want to watch over and over again. You could sit through it 31 times (like yours truly) and it never gets boring. The audienced applauded at the end during my first 13 viewings.<br><br>Aardman Studios has concocted a recipe consisting of a wonderful (albeit portly and feathered) cast, a funny, intelligent script, a gripping score, excellent cinematography and production design, plus great voice work, all mixed with years of labor and love, and the result is what is easily the best film of 2000. When was the last time you saw a movie with a cast  nearly all-female, no less  so determined and believable in their mission for freedom, and whom you cared so strongly about that you were actually cheering for them to be successful?<br><br>\"Chicken Run\" may be the first animated film that is an absolute joy for both children and adults. Children will be tickled by the jocularity of these hens, while adults will find pleasure in discovering homages to classic prison films  \"The Great Escape,\" \"Stalag 17\" and even \"The Shawshank Redemption,\" among others.<br><br>Screenwriter Karey Kirkpatrick has come up with a sharp script, which has all but become a lost art in the movie world these days.  The dialogue is loaded with puns that work so well.  The British slang is a delight, and makes the chickens' personalities more endearing and  dare I say it  human.<br><br>One of the best lines comes from Mrs. Tweedy talking lovingly about her soon-to-be chicken pie enterprise. When Mr. Tweedy asks why she only will be included in the brand name, her reply is: \"Woman's touch. Makes the public feel more comfortable.\"  The other is Fowler's immortal \"Pushy Americans, always showing up late for every war.\" That's simply brilliant writing.<br><br>The flawless (yes, flawless) voice cast is the heart of this movie. This is one of those rare films in which both the heroes and the villains are fun to watch. You'll find yourself thinking during the end credits, \"I liked this character the bestno, wait a minute, I think I like this one moreno, no, I like that one.\"<br><br>Leading the way is Julia Sawalha, playing another character with a spicy name (from \"AbFab's\" Saffy to CR's Ginger), and providing the ideal heroine we moviegoers have yearned for so long. She's so convincing in this role; you're deeply immensed in Ginger's quest for free range living that you forget she's a Plasticine chicken.<br><br>It's safe to say that 2000 has been the summer of one Melvin Gibson. He doesn't disappoint with \"The Patriot\" or with his role as Rocky, the vagabond flying rooster (listen to his hysterical rendition of Dion's \"The Wanderer\"), who easily bested his squirrel namesake at the box office. The film pokes fun at him in a good-natured way, from his opening \"Braveheart\" gag to his nationality.<br><br>Rounding out the supporting cast is Lynn Ferguson as the genius Mac, she of the wild hen's comb and odd spectacles.  Jane Horrocks is a show-stopper as the innocent yetwell, bubbleheaded, knitter Babs.  She doesn't have much dialogue, but definitely does the most with the least as she delivers the funniest lines in the movie with aplomb.  Perhaps the film's most famous line is when she bawls \"I don't want to be a pie!\" Why? \"I don't like gravy.\"<br><br>Ben Whitrow's Fowler, the old military rooster, had me in stitches with his constant rambling about his glory days in the Royal Air Force.  Seriously, wouldn't we all want to be awakened by a rooster who hollers, \"Cock-a-doodle-doo, what what\"?<br><br>Timothy Spall and Phil Daniels are a hoot as Nick and Fetcher, the Laurel &amp; Hardy-style farm rats. Tony Haygarth and Miranda Richardson (not straying very far from her \"evil wife\" role in \"Sleepy Hollow\") are perfect as Willard and Melisha Tweedy, the cruel owners of the prison camper, egg farm. The loving couple is an evil version of American Gothic rendered in clay. Mrs. Tweedy is the best animated villain since Maleficent from \"Sleeping Beauty.\"<br><br>But my favorite (and this was a tough choice) was Imelda Staunton as the brusque, oversized and argumentative, yet lovable, Bunty. She was the character I related to most because my personality is sometimes like hersI think I may have finally found my role model! My favorite part in the film was watching Bunty getting down to \"Flip Flop and Fly.\"<br><br>The ending contains the most thrilling action sequence I've seen all year. I won't dare describe it herego and experience the magic for yourself.  What I will say is that I haven't had this much side-splitting fun with an ending since \"Mrs. Doubtfire.\"<br><br>I haven't enjoyed a film like this since \"Sleepy Hollow\" was released 7 months earlierneedless to say, this has been a period of movie ecstasy that is as rare as hens' teeth, so to speak.  I'm sure nobody will care, but what I found interesting about \"Chicken Run\" was that it bore a striking resemblance to SH in terms of the plot: a small citizenry, kept prisoner by a villain who has a fetish for decapitation, pins their hopes of freedom on an outsider who is brash and sure of himself on the outside, yet soft and bewildered on the inside.  Both movies are in my personal top 10 of all time.<br><br>After watching this, I dare anyone to find another movie that is as heartwarming, witty, suspenseful and funny as \"Chicken Run.\" To those who feel the need to criticize this film for any reasonI deeply sympathize with your lack of soul. 10/10","user":"SwingBatta","rank":[68,78]},{"title":"Something for everyone","rating":10,"date":"20 June 2000","review":"Chicken Run is a wonderfully entertaining movie for EVERYONE!  Kids will love the eye-candy of chickens doing absurd things and tossing off silly one-liners.  Adults will enjoy the brilliantly funny dialogue and the sweet, engaging story.  Parents will enjoy taking their kids to a movie that does not have the Disneyesque product tie-ins and must-buy soundtrack.   Movie buffs can try to count the references to The Great Escape, Stalg 17, Star Trek and Braveheart and may be pleasantly surprised at the quality of the camera work.<br><br>Nick Park, Peter Lord &amp; Co. succeeded (where so many other have failed recently) in making an animated movie whose story, plot and dialogue are equal to the brilliant animation.  In the wordless opening minutes we are engaged and in invited to care about these silly chickens.  By the time the snappy dialogue gets rolling we've already identified with the chickens' plight.  It may be a bit slow through the middle for the younger moviegoers. But the sound of laughter, cheers and applause from the whole audience as the chickens make their final bid for freedom is well worth the wait.  The only sad part is we may have to wait another five years for another Aardman Animations to produce another picture of the quality.","user":"AdRager","rank":[53,60]}]