[{"title":"The most enjoyment you'll have seeing a movie for the *second* time","rating":10,"date":"8 September 2004","review":"Ah, the Usual Suspects. My personal favorite movie of all time. Don't let my bias be a fool. Perhaps it's not THE best movie ever, but it's one that I never get tired of.<br><br>If you like flash and bikinis and breath-taking camera angles, you won't find them here. Usual Suspects is not an \"epic,\" and it doesn't pretend to be. It's a modestly-budgeted piece by a fresh director (who later went on to do the X-Men movies, a FAR departure).<br><br>A great, gritty script, beautifully-acted characters, and what many have called the greatest movie ending of all time, are some of the shining qualities that make the Usual Suspects an object worthy of praise above its humble-looking shell.<br><br>The casting is very unusual but somehow fits perfectly. Gabriel Byrne is convincing as the ex-con trying to build a new life when he gets drawn back into his old life. Stephen Baldwin has the role of his career as the smart-mouthed and cocky professional. Kevin Pollak takes a big departure from his usual good comedy self to take a more dramatic role. Benicio del Toro literally takes a one-dimensional character with absolutely nothing in the script to give him character, and he fleshes it out with brilliant mannerisms and memorable mumbling to show incredible acting creativity. Kevin Spacey as we know him was born from this movie. His manners and fast-talking yet shy gimp nature are a treat to listen to throughout the flick.<br><br>Without giving away the plot, the best and most genius parts of the movie are the subtleties. After you see the ending, and the truth hits you like a ton of bricks, you have to watch it again. On the second time through, you'll jump up and point at the screen whenever you spot a clue you missed the first time. It's even possible to watch the movie multiple times and see something new with every viewing. It's that attention to detail that make the deceptively innocent-looking Usual Suspects one of the greatest movies of all time.","user":"TIDQ","rank":[667,742]},{"title":"A Modern Masterpiece...","rating":24,"date":"24 September 2001","review":"DISCLAIMER: Not seen 'The Usual Suspects' yet? Then don't waste any time reading this! Rent it, buy it, borrow it, I don't mind, but watch it before you bother reading any further.<br><br>One of the main reasons that 'The Usual Suspects' leaves such a long-lasting impression on the viewer is that it takes advantage of the gullibility of the audience. For the first 100 minutes we are delivered an intriguing and complex story to which there seems no easy answer. When the final piece of the puzzle seems to be in place the entire film is turned on its head. This final revelation initially leaves you speechless and then shortly after the audience realises that they have fallen for a brilliantly inspired trick. The second great trick that this film plays on its audience is making us think that by watching it again we'll be able to understand slightly better what was really going on. The truth is that the more you try to make sense of it, the more confusing it becomes. It's probably best not to try to look for any concrete answers and just accept that we fell for the filmmaker's tricks. The success of the film is mainly thanks to the sense of satisfaction the audience is left with at the end of the film. I think that people love the idea of a story when you're not sure who you can really trust, along with the realisation that the film's most shady characters are the filmmakers themselves.<br><br>Aside from the twist the film is also unique in the way the narrative is presented. The majority of the story is told as a series of flashbacks by crippled con artist Verbal Kint (a performance which deservedly won Kevin Spacey his first Oscar). The film's other Oscar went to screenwriter Christopher McQuarrie (who also directed 'The Way of the Gun' (2000)) for his brilliantly constructed screenplay. It's a testament to the director, Bryan Singer that he was able to combine all these elements and turn them into something which is nothing short of a modern masterpiece. His moody and stylish direction help to bring the film together and perfectly complement the film's dark tone. A mention should also go to John Ottman for his skilful editing and amazing score.<br><br>The Usual Suspects is more than just a film with a clever ending. It revealed an awful lot about film audiences and showed us that their expectations can be used against them. It is also a film about story telling and the importance of myth. I think that one of the most valuable lessons that filmmakers can learn from The Usual Suspects' is that the more interesting and intriguing your story is the more your audience will believe.<br><br>The Usual Suspects was certainly not the first film to contain twist ending (the twist ending became one of Alfred Hitchcock's trademarks) and was certainly not the last ('The Sixth Sense' (1999) also used this technique effectively but left more subtle clues for the audience to pick up on their repeated viewings). Despite this 'The Usual Suspects' remains one of the most innovative and memorable crime thrillers of the nineties.","user":"TheShape_UK","rank":[212,252]},{"title":"A stone cold CLASSIC!","rating":13,"date":"13 December 2001","review":"'The Usual Suspects' has received a lot of comment for its killer twist ending, which while by no means the first in movie history, has proved to be enormously influential (stand up Messrs. Fincher and Shyamalan...). But this movie is so much more than a surprise ending! It is a meticulously scripted, faultlessly acted masterpiece that stands up to repeated viewings. Every single time I watch it I notice some new detail, or get more enjoyment out of a performance or scene.<br><br> This movie really put  Kevin Spacey on the map, but everyone in the ensemble cast is outstanding, even Stephen Baldwin(!), who has never appeared in a movie this good before, or since.  I also got a kick out of the Paul Bartel ( 'Death Race 2000', 'Eating Raoul') cameo, and the ultra-cool Peter Greene's ('Laws Of Gravity', 'Pulp Fiction') all too brief appearance. Bartel is sorely missed, and Greene one day (mark my words!) will become the star he deserves to be.<br><br>Director Bryan Singer has yet to live up to the promise shown here with his subsequent movies, the average 'Apt Pupil' and the disappointing 'X-Men'. For all the acclaim he and the (admittedly superb) cast have received, the real star of 'The Usual Suspects' is Christopher McQuarrie's sensational script, one of the finest of the modern era, and one that genuinely deserved it's Oscar.<br><br>It really doesn't get any better than this!! One of the greatest movies ever made, any time, any where. A truly unforgettable experience.","user":"Infofreak","rank":[337,416]}]