[{"title":"As wonderful as the book!","rating":10,"date":"15 December 1999","review":"\"The Green Mile\" is one of my favorite Stephen King books and I have read it several times.  I was anxiously anticipating the film version, but was concerned that the emotional impact of the book could not be replicated on screen.  Fortunately this wonderful story was adapted by Frank Darabont, who did such a magnificent job bringing King's \"Shawshank Redemption\" to the screen.  He does the same high quality work with \"The Green Mile\".  The story is faithful to the book, only losing details that were not important to the story anyway.  The casting is superb - every actor is perfectly suited for his role and does an excellent job, although I would like to single out Doug Hutchison.  His portrayal of the detestable Percy is right on the mark and suggests complexities in this character I had not discovered in the book.  The length is about three hours and it seems that critics are complaining about that.  I can't understand the complaints.  The film never drags and is never dull, and it certainly didn't feel three hours long.  The length is needed to tell this story the way it should be told, and the story is so very engrossing.  Best of all, Darabont and the actors bring so much emotion ot the screen, that I cried like a baby through several scenes. \"The Green Mile\" will haunt you.","user":"KathyT","rank":[541,587]},{"title":"this movie can tear emotions out of anyone.","rating":10,"date":"2 December 2009","review":"i expected this movie to be a normal and i just want to see it for Tom Hanks but as movie goes through i cry,i laugh and there comes a feeling which can't be described in words. i rate this movie as the best i have ever seen. some moments in the movie makes me hold my bed pillow in the tightest ever grip. i can guarantee that this movie will leave an impression in your mind for a long time. i even say that this movie is better than shawshank redemption.fantastic story, brilliant acting,mind boggling feelings and overall an unforgettable drama. if you have watched 1000 movies and not this then your movie watching journey is incomplete.i will also make sure that even my next generation should watch this one.","user":"deepaknarwal88","rank":[113,120]},{"title":"Film was invented for creations like this.","rating":10,"date":"9 January 2000","review":"The Green Mile is a masterwork. This is film as art, at it's very best. The depth of the cast is extraordinary, with all of the players delivering excellent performances. There is a clear sense here that all involved in the production knew that this was something special, and gave it their all. See this film if you truly enjoy actors giving everything to their craft. Watch for the countless subtleties of expression, and the great power that the cast creates with silence. This is evident in the opening sequence and remains throughout. Above all, Michael Duncan as John Coffey is exceptional. He brings gripping emotion to a unique, fascinating character.<br><br>The Green Mile should bring you joy, laughter, and if you are like most in the theater this night, tears.<br><br>BRAVO!","user":"alan photog","rank":[633,713]}]