[{"title":"Understated film; terrific chemistry between Willis and Hughes","rating":28,"date":"28 March 2002","review":"Mercury Rising received a poor reception, a fate that movies of mixed genre's often received.  Audiences came in expecting an action movie, and what they found was a heartwarming film about autism.<br><br>The plot of Mercury Rising is almost laughably thin.  An autistic child sees through a top secret code, and the government decides to kill him.  Enter the rogue FBI agent(Bruce Willis) with the heart of gold, and watch the testosterone take over.  A plot like this is something usually associated with Steven Seagal.<br><br>The salvation to this movie is the relationship between Simon Lynch(Miko Hughes), the autistic child, and Willis redeems the movie.  Without falling prey to the temptation to preach on autism, it sketchs an accurate picture of the illness.  Hughes' performance is heartbreaking and accurate.<br><br>Alec Baldwin maintains the movies tension with a chilling performance as an NSA agent who makes the decision to kill Simon.  Baldwin revels in the role of villain, pulling out every acting chop he has to make this role believable.<br><br>Director Harold Becker manages to propel this movie beyond its thin plot, riding on the backs of the incredible talent within the movie.","user":"witheld","rank":[77,92]},{"title":"Flawed, but it definitely surpassed my expectations","rating":7,"date":"29 June 2008","review":"Nearly six years ago, in the summer, I was camping and visiting some relatives at their vacation trailer, and happened to walk in one day while \"Mercury Rising\" was being watched. By that time, they were well into the film, perhaps more than half way through, but I watched the rest. I'm not exactly sure how much I liked it at the time, but didn't see anything severely wrong with it. Last night, I watched the whole movie for the first time. Knowing it wasn't the most widely praised film, and that I have higher standards than I did six years ago, I had fairly low expectations, but after that, I can't say I dislike it.<br><br>A very complex code called \"Mercury\" has been created by the NSA, one which is believed to be impossible to break. However, the code has been put in a puzzle magazine as a test to see if this is true, and a nine year old autistic boy in Chicago named Simon Lynch, who likes to solve puzzles, manages to break it. The NSA receives a call from this boy, and the two agents who have received the call inform their boss, Nicholas Kudrow. Kudrow is afraid of the code being spread around, so he sends an assassin to kill the boy! The assassin comes to Simon's house and kills his parents, but cannot find the boy himself, and flees when he hears the police coming! An FBI agent named Art Jeffries is sent to investigate, and he finds Simon hiding in a closet. After taking the boy away, Art must protect him and try to keep him from the assassins, which will be difficult, as he doesn't have too many people on his side, and keeping Simon in one place in sometimes a challenge! <br><br>I'm not sure exactly how to explain my feelings about this movie. Around the beginning, it seemed pretty much average, but it gradually got better. I was pretty shocked at the scene where Simon's parents are killed, and not in a good way. Some (probably many) people have criticised \"Mercury Rising\" for being so unrealistic and clichéd, and I'm not going to argue with that, but I can't say I think it's a bad movie. As usual, Bruce Willis puts on a memorable performance, this time as FBI agent Art Jeffries, a likable character, and then-child actor Miko Hughes is also impressive as Simon. Playing the role of an autistic character probably wasn't easy, but it seems Hughes managed to pull it off. For me, it was reasonably suspenseful seeing the two characters on the run together. The film has very memorable and touching ending as well, one which I remembered from the first time.<br><br>No, this certainly isn't the most popular action thriller ever made, nor does it deserve to be, but worse has been done. I honestly thought I would have more critical things to say about \"Mercury Rising\", but I don't, and it seems many of those who don't like it have given good reasons why they don't, probably better reasons than I can give for praising it. Since this 1998 action thriller is so polarizing, I guess there's no guarantee whether you'll like it or not, unless you don't like action thrillers in general, then you obviously wouldn't like it. However, if you're a fan of this genre, (you like good, though maybe mindless action), there's a chance \"Mercury Rising\" will do, as long as you're not expecting a masterpiece.","user":"Electrified_Voltage","rank":[29,35]},{"title":"Better Circa 2004","rating":7,"date":"30 August 2004","review":"I just watcehd this on DVD, loved it and was literally stunned to find that most people, in particular those that write movie reviews for a living slated this. <br><br>Maybe its because in 2004, some six years after its original release we are seeing a revival of the action/thriller (Bourne Supremacy etc).<br><br>So, what didn't I like, not much. I would like to have seen more made of the kids codebreaking, they could really have milked that and didn't, the opening scene was just to cliché in setting up Willis's character as were the characters of his big black boss and hard nosed chief. The very last scene was typical US syrup but was thankfully very short.<br><br>What was good? everything else, I loved the idea behind the story, Miko Hughes is totally amazing to the point I had to check the next day to find out how the hell they managed to get a autistic kid to act (is isn't autistic but is a damn fine actor), Willis really does add vulnerability to a role that he has played many times before, with the movie underpinned fantastically with a John Barry soundscore and Harold Becker carefully crafts what for me was a very enjoyable movie watching experience and stands head and shoulders above many I have seen recently. 3/5 for me","user":"johniebegood","rank":[44,59]}]