[{"title":"This movie didn't deserve the IMDb vote it got.","rating":8,"date":"10 February 2014","review":"The score that everyone gave this movie does not give this movie justice. Sure, it's not a ten but it isn't a 5.1! Everyone is saying how the Mighty Duck movies were great for the first and second, but honestly I liked this one just as much! I don't care about budget! It had a great story line and a good lesson learned. It's all the same character actors and it's more relatable since it is high school. You literally got to see the ducks grow up, and I think that's why I thought the movie wasn't as bad as everyone says. Like I said, it had a good plot and a little bit of everything. Drama, humor, action, romance. It was great. Covers all the fields that any person can appreciate! All I'm saying is that you shouldn't judge a movie based on it's prequels. Give this movie a try, believe me. It's pretty great.","user":"mystic_moonlight14","rank":[8,9]},{"title":"A Great End To A Great Disney Sports Series","rating":10,"date":"10 June 2000","review":"This Disney film made me much happier than D2 did. I really enjoyed the way it was much more true to the first film than D2 was. This movie used examples from the first film (\"He's been the captain since they played in District 5,\" the announcer utters during the first game.) This time, the team is shy one member (Jesse) but it really seems no different. I do still wonder what happened to all those people who played in the first movie and were never heard from again. Oh well.<br><br>In this film, it's almost a rehash of the first film. A team who cannot get it together, get a washed up hockey player who they hate to coach them and they love him...your basic family fun, Disney flick.<br><br>All in all this was a great movie, but hopefully Disney realizes that we've had enough.<br><br>*** out of ****","user":"MarkyIce","rank":[14,22]},{"title":"Uplifting","rating":7,"date":"8 September 2002","review":"I'm not sure exactly why so many people think of the Mighty Ducks movies as silly and pointless. I was never good at sports, but I have always believed that, with proper coaching, any sport could teach children and teenagers about life. The third installment of this series, directed more toward teenagers than anyone else, really shows how teamwork and positive thinking can overcome obstacles and help them grow. I have seen D3 many times and yet as I recently bought the DVD and watched it again, I couldn't help but cheer for the Ducks.","user":"jhazelett72","rank":[10,15]}]