[{"title":"A wonderful film for a rainy Sunday","rating":7,"date":"27 September 2005","review":"In an obvious homage to the wacky films of the '40's and '50's, year of the Comet is very good at being what it is - a fluffy film to be enjoyed lightly. It won't cure cancer, it won't change your political ideology, but it will make you smile, laugh, and have a nice 2 hours.<br><br>Tim Daly is effortlessly charming and Miss Miller is properly wholesome, as the role demands. Nice one-liners and recurring jokes, a frothy but well-paced plot, and some excellent performances by character actors in supporting roles (I especially love the Scottish mother) make it easy to watch and enjoy.<br><br>Well, unless you want explosions and political subtext.","user":"otherRic","rank":[19,21]},{"title":"A jug of wine...a monkey gland or two...and Louis Jourdan. At 73 he still has what it takes to murder with mannerly amusement","rating":7,"date":"16 March 2009","review":"\"They were your friends!\" cries Maggie Harwood when she walks in on the pistol-holding, aged but well preserved Philippe. Lying on the rug behind him are his two, now dead, associates. \"Well,' says Philippe, \"we weren't that close.\" <br><br>Maggie (Penelope Ann Miller) is the heroine in this romantic comedy thriller. While the hero is the overly handsome, strong-jawed and mustachioed Oliver Plexico (Tim Daly), the real sex appeal comes from Philippe as played by 73-year-old Louis Jourdan. This was his last film. While many may remember him as the dashing and love-struck Gaston Lachaille in Gigi, he remains more fondly in my heart as Dr. Arcane in Swamp Thing. Like Dr. Arcane, Philippe is an incorrigibly well-mannered, egocentric and murderous creep. I suspect there are few actors as good as Jourdan who would be willing to semi-sing, while smacking his lips, leering and snapping his fingers, \"There are chicks just ripe for some kissin' / And I mean to kiss me a few! / Then those chicks don't know what they're missin' / I got a lot of livin' to do!\" <br><br>Jourdan does it. It's grotesquely funny. <br><br>The Year of the Comet is all about wine, and especially about an extraordinarily rare bottle of wine, an 1811 Lafite, that was once part of Bonaparte's cellar. In auction it could bring at least a million dollars. Maggie, who works for her father, the wine merchant Sir Mason Harwood (Ian Richardson), is sent to Scotland to appraise an extensive wine collection that Harwood and Company may be commissioned to place in auction. Maggie, who knows almost as much about wine as her father, may be \"a funny, over-worked ragamuffin\" but she got the assignment from her father by telling him he either gives her this chance to show just how good she is or she's quitting. Now she's knocking on the great oaken door of an isolated Scottish castle to appraise the wine. Unknown to Maggie, she's interrupting the torture of the owner by Philippe and his men. Philippe assures his victim that shoving the hypodermic needle with a certain drug right in the eyeball won't interfere with the man's vision...although it will cause exquisite pain later with each blink. All that we know is that there is a formula Philippe is determined to have. Maggie is taken to the cellar and this is when, brushing off centuries of cobwebs and grime while she looks at these hundreds of encrusted wine bottles, she makes her discovery...the 1811 Lafite. And it's just a short while later that Maggie makes more discoveries. First, she finds Oliver looking for her, the man who prefers beer and calls wine a beverage. She met him at a wine tasting at Harwoods. She and Oliver discover the body of the owner in the wine cellar and they discover Philippe and his crew absconding with the bottle of Lafite. <br><br>The chase is on! Sometimes Maggie and Oliver chase Philippe. Sometimes he's chasing them. They chase around with cars, motorbikes, helicopters, airplanes and rowboats. They chase scenically through the cold, rocky mountains of Scotland and the warm slopes of the French Rivera. Maggie and Oliver bicker, kiss, bicker, fall in love and bicker. And then they wind up having to listen to Philippe sing \"Gotta lotta livin' to do.\" By now we've realized (this is no spoiler) that this adventure has as much to do with the secret formula and glands as it has to do with wine. <br><br>Year of the Comet strains to be a Hitchcock romantic thriller. While it doesn't come close it's an engaging, undemanding romp. The script is by William Goldman, a man who knows what he's doing with this sort of thing. Try Butch Cassidy and the Sundance Kid or The Princess Bride. He works wonders with the clichés he deliberately uses. The direction, however, is a letdown. It's clunky and never lets the script build much steam, either in the chases or in the romance department. I don't know what happened to Peter Yates, but the director of Bullitt, Breaking Away and Eyewitness just doesn't seem engaged. Miller and Daly are attractive enough, although Daly is better at being handsome than at being an amusing speaker of clever lines. Cary Grant needn't worry. The real pleasures of the movie, other than the plot, are Louis Jourdan (now nearly 90 and living in France) and Ian Richardson, such a sly actor. Ian McNeice as one of Philippe's men holds his own. <br><br>Year of the Comet is amusing fluff, undemanding and a pleasant adventure. I liked it enough to have watched it twice in four years.","user":"Terrell-4","rank":[8,8]},{"title":"A film not to be taken seriously and for those with a good sense of humour","rating":8,"date":"9 January 2006","review":"I thought it was a light hearted comedy, made me laugh.<br><br>It was just full of fun and entertainment.<br><br>The actors roles also poked a little fun at the nationality of all involved in this escapade as well as trying their hand at a Scottish or English accent was amusing.<br><br>It did show just how beautiful Scotland can be even when a helicopter lands on a croft scaring the poor farmers sheep! Taking us on a tour trying to catch up with the crooks who were always bungling everything they tried to was also funny.<br><br>Its a film that if you need to laugh or feel good, its one that will work for most people.","user":"jac_mc","rank":[9,10]}]