[{"title":"Got all the basics of some challenging material right","rating":6,"date":"9 June 2005","review":"This film, and its generally poor reception is a good example of what happens when huge marketing mistakes are made. Take a look at the cover of the DVD package: \"Stallone: Judge Dredd\". The film should have been titled \"Judge Dredd\" - even in the packaging - and the emphasis for the marketing of this film should have been less Stallone, more content. On the flip-side, when the most consistent complaint you can find among IMDb psychofants is \"HE TOOK OFF HIS HELMET!\", you really have to wonder if the film is quite as bad as so many believe. <br><br>Eagle Comics 2000 AD character Judge Dredd was one of the most original, entertaining and intelligently written and interestingly drawn sci-fi comics of recent times. With story arcs varying from 2 pages worth of panels to 4 or 5 episodes, and sometimes multi-threaded plots, this violent, political and tough cyberpunk version of Dirty Harry set some pretty high standards for adult comic authorship both in its native UK and in the USA, once the imports started flowing in. It freely traversed from film noir to flat-out wild sci-fi action to nihilistic hard justice, and did so with style and originality rarely seen in the comic medium. Hence, although I like Stallone in this film, it's not only misleading but a little insulting to call this 'a Stallone film'. The producers had very big shoes to fill, and though I am in the minority here, I believe they did well.<br><br>The production team chose a story arc which I was never very fond of, but one of the more do-able ones to be sure. Any Dredd-based film would necessitate a huge special effects budget, and most of them, even with the best special effects available, would likely be nearly impossible to pull off and might look ridiculous. To their credit, the Return of Rico story arc was rightfully recognized as good film material - it involves more emotional content than the usual Dredd fare, and actually required fewer outrageous special effects, than, say, the many Judge Death arcs might have.<br><br>Dredd is a \"street judge\" - and the judges are the closest thing to a government in a post-apocalyptic future where nuclear war has concentrated all of the world's population into mega-cities - hotbeds of crime and chaos, surrounded by mutagenic wastelands called The Cursed Earth. Dredd is the best of the best, a very tough cop who knows method, theory, and has an incorrigible sense of ethics and dedication to the law. Dredd is also mentor to an entire generation of judges, including the brilliant Hershey (Lane). Rico, Dredd's former best friend, and a psychotic murderer escapes from a high security prison with some help from a fascistic leader of the judges who is bent on securing power and a new world order with himself in charge. Soon, Dredd is framed for murder and exiled to the wastelands, and judges start to die all over the city. About midway through the film, Dredd learns the truth of his relationship to Rico and begins to figure out the sinister plot. Of course, there is only one thing for him to do - return to Megalopolis to stop the conspiracy before it plays out.<br><br>The film features good performances by a really nice cast. Armand Assante brings the character of Rico to life better than the comic book ever did. Diane Lane, Jurgen Prochnow and Max Von Sydow are always good, and though I had my doubts to begin with, Stallone pulls off Dredd very well. While some folks complain about Rob Schneider's irritating behavior, I found that his goofy character took a little of the edge off of Stallone's depressive performance of the most stoic law enforcement officer on planet earth. This is not one of Joan Chen's better roles. If you're a big Chen fan, you might think twice about seeing this.<br><br>All considered, I see Judge Dredd as a under-rated and mis-marketed film, which, through its fast pace, sophisticated sci-fi plot, Excellent special effects and very good cast, took all of the screenable elements of the comic book and made them accessible to an audience a bit wider than its original fan-base. If this review peaks your interest, see it!","user":"mstomaso","rank":[91,117]},{"title":"I liked it..","rating":7,"date":"4 January 2014","review":"JUDGE DREDD<br><br>Now the thing about this movie is everyone hates it except me.<br><br>The movie is about a law enforcer set in the future that gets falsely accused of murder and is sentenced to life imprisonment. He escapes and is on a mission to try and find the person who set him up.<br><br>Anyone that has read the comics hated this film due to the fact that is apparently so different to the comics. From what I have been told, Dredd never takes off his helmet and reveals his face. Not in this film. His helmet is taken off within 15 minutes of the movies start. I never read the comic so I don't know any other differences, but that is probably why I enjoyed it.<br><br>This film has a very 90s feel to it. It reminds me in a way to Demolition Man. They are both set in the future and are both really good action movies, although Demolition Man is better. I do love the action films from the 90s. They have a good over the top feel to them.<br><br>The acting is alright in it considering it is a cheesy action movie. The movie stars Sylvester Stallone as Dredd. He looks uncomfortable in this role some of the time, but then Stallone does not suit some roles. A young Diane Lane plays his partner. She does a pretty good job. I was very surprised to see a cameo from one of my favourite singers the legendary Ian Dury. He only had a very small part, but he was really good.<br><br>The effects and explosions were really good and well done. But that is what was expected from the action films of that era. The gun fights were completely over the top too in a good way. I also loved the giant robot in the film. It was one of my favourite characters.<br><br>If you like cheese, Sly Stallone, futuristic films and never read the Dredd comics then I can't see why you would hate this.<br><br>I will give it 7 out of 10.<br><br>\"I am the law!\"<br><br>For more reviews, please like my Facebook page:<br><br>https://www.facebook.com/pages/Ordinary-Person-Movie- Reviews/456572047728204?ref=hl","user":"richieandsam","rank":[22,26]},{"title":"A damn good time at the movies!","rating":8,"date":"24 April 2001","review":"It's unfortunate that \"Judge Dredd\" wasn't accepted by mainstream viewers or even received a cult following.  I found it to be very entertaining.  I don't see too many movies based on comic book superheroes that I honestly enjoyed.  \"X Men\" for example went on too long, moved very slowly and took itself too seriously.  \"Judge Dredd\" is a fast-paced sci-fi-action thrill ride that delivers from start to finish and has help in the comic relief department by Rob Schneider.  Sylvester Stallone overacts throughout, but that's part of the fun.  Watching him scream out \"I AM THE LAW!!\" makes you want to scream it out along with him, which is what I do whenever I view this movie.  There are many quotable lines, which I enjoy reciting.  \"Judge Dredd\" is not a deeply intelligent, insightful film.  But it makes a great popcorn flick!  This upbeat, funny, nonstop entertainment is a real treat for me to watch over and over again.  <br><br>My score:  8 (out of 10)","user":"mattymatt4ever","rank":[149,212]}]