[{"title":"\"Let Me Ruin Your Evening,\" The Movie Said To Me....","rating":8,"date":"24 March 2004","review":"As bad films go, this one's pretty enjoyable.<br><br>Anchor Bay, not long ago, released a wonderful widescreen DVD of NEON MANIACS. But you can also enjoy this on tape, because VHS copies are still floating around at used video stores. And perhaps an old VHS tape might be better for generating that 80's feeling... <br><br>This is the infamous low-budget horror flick from 1985 that boasts a gaggle of weird, oozing monsters--each with a different look and method of killing--who come out at night, ready for action. The movie takes place in San Francisco--and the monsters actually make their home under the Golden Gate Bridge (!). Sure, why not? It could happen. <br><br>The title monsters are NEVER referred to as \"Neon Maniacs\" by any of the characters. A narrator has a brief speech early on in the film and says something like \"The children's path shall be darkened...by the SHADOWS of the...NEON MANIACS.\" (Yeah. Whatever.) But that's the only time you hear the term, and as a justification for the title, it's flimsy at best. AND, as noted by many, the monsters are NEVER explained in any way. At all! <br><br>Near the end of the film there is a climactic scene at a high school costume dance featuring an astounding \"Battle of the 80's Bands\" (one a Rick Springfield knockoff, the other a lame heavy metal group) that will have you squirming and your face contorting into various peculiar grimaces and scowls. Yow! <br><br>This is a time capsule film. You watch it to see what things looked like, what was going on twenty-odd (very odd) years ago. But please take care: What you see, you may find upsetting.<br><br>80's horror had its own very unique and pointless stamp, and this is one of the best examples of an endearingly BAD 80's horror film--just as THE BREAKFAST CLUB is one of the best examples of an endearingly good 80's teen film. That is to say, NEON MANIACS, despite how awful it is, is memorable. It gives you a strange warm happy feeling inside when you watch it. And when it's over, you think about it--chortle to yourself over it. You might even recommend it to your friends. And you know perfectly well that it's not a good movie at all! That it's one of the worst movies you've ever seen!! See it tonight! Yes, it's crap. Yes, it's fun.","user":"roddmatsui","rank":[28,35]},{"title":"A campy puzzle that doesn't what to be solved.","rating":6,"date":"19 May 2007","review":"In San Francisco, Natalie is celebrating her birthday one night in the park with a couple of friends, when suddenly a large group of nasty looking monsters gatecrash it. She's the only survivor, and the police don't buy her story, because of what she supposedly saw and her friend's bodies have vanished. These mutants only come out at night, from their home under the Golden Gate Bridge and seek possible victims to take back with them. Now their eyes are set on Natalie, and with the help of her lovelorn friend Steven and a plucky, horror enthusiast Paula. They set out to stop these monstrous mutants.<br><br>It doesn't get anymore ultra-bizarre, gloriously tacky and super-dumb, than the film known as \"Neon Maniacs\". Actually what mindlessly juicy fun, even though you'll be at a lost! Yep, it's one of those deliciously sweet and trashy horror oddities that only the 80's horror scene could possibly dream up! This low-budget item doesn't want to go into any sort of reasoning, or development to what's actually happening, so you just have to go with the flow and cop the threadbare screenplay for what it is. There's some imagination behind all of this kitsch, and what they mustered up with the wicked make-up effects for these cheesy looking nocturnal mutants are vividly creative with a whole variety to look at. Hey they even got their own collectible cards (don't ask me why), which we see at the beginning. The thing is they could've done far more with the unusual idea than what we got in the end. It was quickly thought-up and easily penned by Mark Patrick Carducci, and the results end up showing the shambles. Too many plot holes to poke a stick at and it might slow up in the latter half, but the cartoonish nature brings some nicely chiselled humorous touches and wacky situations of junky entertainment. It does have that childish feel to it, but the nasty side and gruesome effects make sure that it stays far from that crowd. The handling of it on the other hand came off looking more competent than you'll expect, but director Joseph Mangine (who's more often behind the lens), execution feels cramped and overwhelmed by the simple novelty. It's sloppy, but he keeps a steady momentum and spins out some atmospheric highlights (like a dream sequence). Shadowy camera-work is reasonably positioned, with moody lighting and there's a chewy bubblegum soundtrack with the familiar eerie electronic score finding its way in. The sound performances are pretty basic, but Leilani Sarelle, Allan Hayes and an animated Donna Locke are acceptable. Also popping up as one of the ghouls is Andrew Divoff, which was his first film appearance.<br><br>This preposterous clunker is pretty much a low-end horror delight that lazily amuses. Remember logic has no say here, but goofiness and unpleasantness does.","user":"lost-in-limbo","rank":[10,11]},{"title":"Cheesy 80s horror personified!","rating":6,"date":"3 November 2009","review":"See, there are these twelve Neon Maniacs who live under the Golden Gate bridge and come out at night to kill people. No reason really, they just do. Natalie (Leilani Sarelle) sees all of her partying friends offed by this gnarly group but no one will believe her because the only thing left at the scene of the crime is some neon goo. Insert Steven (Alan Hayes), a fellow high school student who has the hots for Natalie, and Paula (Donna Locke), a young horror obsessed tomboy, to form a trio of folks who the cops won't listen to. <br><br>This NEON MANIACS madness is really something and plays with the same logic of the home movies I made when I was a 12-year-old. Sad when you realize director Joseph Mangine was in his 50s when he made this. We never get any history on the titular creatures or learn why they are so intent on tracking our leads. But we do know they melt when water gets on them (you listening M. Night?). I guess you could get away with stuff like this in the 80s if you throw some slime around, which this film does plenty of. Probably the only film in the history of cinema to have the heroes discussing ways to off the monsters and one says, \"Hey, isn't the battle of the bands tonight? We can do it there!\" Insert two dueling bands (new wave vs. heavy metal) duking it out while the Maniacs converge on the school. The film ends with the hope of a NEON MANIACS II and I'm still, like, totally waiting.","user":"udar55","rank":[9,11]}]