[{"title":"Simply put, this movie is FUN!!!","rating":9,"date":"28 October 1998","review":"I really believe that they billed this movie wrong.  Many folks came in expecting the next Star Wars and were disappointed, to say the least.  It's not like Star Wars.  It's kinda like a live action comic book.  Visually stunning, awesome use of color that just jumps out at you, and non-stop action, lots of it done with tongue firmly in cheek. Plot?  Well forget the plot, it's the weak point of the film.  But hey who ever said comic books had to have strong plots? Willis, Jovovich, and the rest do a fine job.  I especially like the casting of Jovovich, she exudes innocence, vulnerability, sex, exotica, intelligence, and kung fu machismo all at the same time. So turn off the cynicism sign as you watch and just enjoy the ride.  Great stuff!","user":"Penfold-6","rank":[328,371]},{"title":"Multi Pass.","rating":23,"date":"23 January 2005","review":"Bruce Willis and Milla Jovovich star in this wonderful sci-fi tale. Chock full of killer performances and excellent effects.<br><br>Korben Dallas is your average ordinary New York taxi driver. Fresh out of the military, unlucky in love and this close to losing his job. One day the ultimate fare literally falls into his lap as Leeloo enters his life via the roof of his cab. Leeloo it seems was genetically manipulated to be the ultimate weapon against pure evil but her beauty and butt-kicking hide a more fragile nature that Dallas and a host of others will have to step up and help her save humanity.<br><br>This amazing sci-fi adventure from Luc (Leon) Besson has a little something for everyone. Beauty (the gorgeous Jovovich with orange hair even), action and gun-play, excellent acting, amazing visual effects, romance, creative sets and costume design, dynamic and interesting music and a mildly annoying but funny Chris Tucker. You name itthis film has it in spades. 5th Element is hands down one of the best science fiction films ever.<br><br>I've seen it many times and always want more. I highly recommended it.","user":"suspiria10","rank":[381,451]},{"title":"A wonderful action movie to see over and over again","rating":10,"date":"12 September 2001","review":"I think The Fifth Element is the movie I have seen the most... It is a perfect mixture of action and comedy, science-fiction, suspense and romance. Set in a not so far future, the eternal battle between good and evil is shown to us in an extravagant setting. Flying cars, aeroplanes that go at the speed of light, weird creatures and ugly aliens are only a few things that are present during this film. The story has never been seen before : Good has only one weapon to defeat evil; it is composed of four stones representing the four element (water, earth, fire and air) and a perfect creature. These five elements have to be united before the forces of evil arrive to earth. But evil has found help and the stones have disappeared. Bruce Willis (one of the best action actors of our time), Milla Jovovich, Ian Holm and Gary Oldman make the suspense even more intense. Chris Tucker is incredibly funny and ads a lot to the comic side of the film. The story is extremely imaginative and is, in my opinion, one of Luc Besson's best. I have never seen anything else like it. The costumes, designed by Jean-Paul Gaultier, are unbelievably imaginative and fun. They are a big part of the extravagance and originality of the movie. The score, by Eric Serra (one of my favourites) is simply a work of art. And last but not least, the special effects are absolutely excellent, adding to the quality of the movie. If you are looking for action and a good laugh, this is the film to see. But the actors are not the only things that make this film worth seeing. Click here","user":"lparedero","rank":[335,414]}]