[{"title":"This movie is precious. It grows on you and won't go away.","rating":9,"date":"10 January 2007","review":"I admit it -- I'm a total sucker for this movie for all of the right reasons, and some of the wrong ones (like, it's very touching to me that Bruce Paltrow made this movie with his daughter Gwyneth and died a year or so later). Having Huey Lewis in the movie and singing a few of his monster hits is a plus all by itself, and it turns out he can actually act decently. The Paul Giamatti - Andre Braugher duo, both in terms of plot, their excellent acting, and their blow-you-away singing performance, is something I never tire of seeing, and I've watched this movie five times and have it on disk. The plot is superficially pedestrian but actually very engaging and psychologically legitimate despite the displays of craziness by the characters. People do get crazy and do that kind of stuff. As for Gwyneth Paltrow, there seems to be no role she can't get into and occupy with beautiful effect.<br><br>This was never intended to be a Great Movie. It was a nice little story, made into a very fine, charming, stick-to-your memory movie with talent oozing out the corners. People who rate it mediocre are just not seeing the pearl for the oyster.","user":"douglaswilson","rank":[20,20]},{"title":"\"I'm different now... I sing--\"","rating":9,"date":"4 March 2002","review":"Director Bruce Paltrow assembled an impressive ensemble cast to deliver this story about a diverse group of people with many things in common-- more than they would probably ever realize or admit to, in fact.  On the surface, the tie that binds is music; specifically that cultural phenomenon known as Karaoke, a world in which for three minutes or so, no matter who or what they are, the individual at stage center is a star.  Underneath that particular aspect, however, the common thread runs much deeper.  Because these are people who, in their own way, are all seeking to connect with something, even though they don't know what it is or even consciously know they're pursuing it.  They're looking for their personal metaphor-- that one special thing, or someone, that will give meaning and purpose to their life. It's a road we all go down at one time or another, in one way or another, and it's that road that is explored by Paltrow in `Duets,' an affecting film that illustrates how universally elusive the answers we're all seeking in life are, and for the most part because we simply don't know the questions in the first place.<br><br>\tRicky Dean (Huey Lewis) is a singer/hustler on the Karaoke circuit; In Tulsa, on his way to a big competition in Omaha, he gets a call and detours through Las Vegas for the funeral of an old friend.  While he's there, he meets up with someone with whom he has a special relationship, Liv (Gwyneth Paltrow), who decides she wants to join him on the road.  Meanwhile, a salesman named Todd Woods (Paul Giamatti) suddenly realizes he's so burned out from being on the road that he doesn't even know what city he's in, making a pitch to a hotel conference room full of corporate types in Houston, thinking all the while he's actually in Orlando, Florida.  When he finally gets home, his wife, Candy (Kiersten Warren), and his two kids are too self-absorbed to even say hello to him, so he goes out for a pack of cigarettes (even though he doesn't smoke), discovers Karaoke and makes a new friend, Reggie Kane (Andre Braugher).  Then there's Billy (Scott Speedman), a young man who drives a cab (of which he is half owner), who due to a particular set of circumstances finds himself involved with one Suzi Loomis (Maria Bello), who is on her way to California, by way of the karaoke competition in Omaha.  And, ultimately, Karaoke becomes the vehicle through which this eclectic bunch of individuals begin to discover just what it is they're looking for; and who among them ever would've thought it would be in Omaha, Nebraska?<br><br>\tWorking from an intricate and insightful screenplay by John Byrum, Paltrow has crafted an engrossing comedy/drama that is entertaining and poignant. There's a lot going on in this film, but Paltrow sets a pace that keeps it moving right along, and uses transitions that effectively eliminate any confusion that could easily have resulted from having so many storylines unfolding at once.  The characters are well drawn, and Paltrow establishes exactly who they are and where they fit in almost as soon as they are introduced, which enables the viewer to concentrate on the story without having to figure out who fits where and why.  After all, this is not a mystery; and Paltrow uses the screen time of his characters wisely to develop the drama that is being played out in their respective lives, rather than by throwing in unnecessary twists and turns just to maintain interest. It works, because the story is interesting enough, without the aid of any superficial enhancements, and Paltrow does an excellent job of blending it all together to deliver a satisfying and emotionally involving film.<br><br>\tThere are a number of outstanding and noteworthy performances in this film, but the most memorable is turned in by Paul Giamatti, who so successfully conveys the emptiness of this middle-aged man who has always played by the rules, and who now finds himself at a very real crossroads in his life.  The fact that Todd has accrued 800,000 frequent flyer miles that he can't use, effectively puts his whole life into perspective; and Giamatti sells it with a portrayal that is affecting and incisive.  And, as Reggie, the guy Todd takes up with on the road, Braugher hits just the right note, as well, and their scenes together provide some of the highlights of the film, as when they perform their duet of `Try A Little Tenderness'-- this is Karaoke at it's best.<br><br>\tGwyneth Paltrow provides a few highlights here, as well; besides creating a very real, believable character in Liv, it's worth watching the film just to see her sing `Bette Davis Eyes.'  But there's also an exquisite gentleness in her nature she so ably expresses that makes her decidedly easy to watch, and there's an engaging duet she delivers with Huey Lewis on `Cruisin' that's a real showstopper.  It's quite interesting, in fact, to note just how well the actors in this film deliver their songs (and, yes, they all did their own singing).  Other musical highlights include Braugher's `Free Bird' and Bello's rendition of `Sweet Dreams.'  This entire film, in fact, just may be the best thing that ever happened to Karaoke; it definitely raises the bar and gives it some mainstream credibility.<br><br>\tThe supporting cast includes Angie Dickinson (Blair), Lochlyn Munro (Ronny), Amanda Kravat (Redhead), Erika von Tagen (Julie) and Marian Seldes (Harriet).  Early in the film, a truck driver asks a hitchhiker-- a guy just out of prison-- `What were you in for?'  The guy replies, `An error in judgment.'  And, in the final analysis, that's what `Duets' is really all about; the flaws, imperfections and `errors in judgment' that make up the music of life.  It's about finding that right note and being able to share it with someone-- being able to perform a duet to the score of life.  9/10.","user":"jhclues","rank":[29,31]},{"title":"Wonderful! Charming, uplifting, and real. The beautiful music is a bonus...","rating":8,"date":"21 September 2000","review":"\"Duets\" is definitely outside of what I had expected it to be... it is outside of the only-on-it-for-the-money, watch-the-weekend-grosses Hollywood sell-out that everyone complains about. It is a wonderful story, full of surprises and charm. The characters are 3-dimensional, to be sure. Their stories are not always pretty, and certainly not predictable. I was always entertained, engrossed, and ultimately very uplifted. Huey lewis could make it as an actor, and Gwyneth Paltrow could make it as a singer, both without any gimmicky \"pr\" work to present them as a stunt. They, and the entire cast of unknown actors were top-notch here. The music is real, and means something to the movie, and it all meant a lot to me. Go see it-- it has tons of heart, and soul. You'll like it. I gave it an 8 out of 10.","user":"bopdog","rank":[27,30]}]