[{"title":"Church Bells Take Their Toll","rating":5,"date":"23 December 2008","review":"New York electrician Matt Dillon (as Gus DeMarco) wants to buy a bowling alley in Brooklyn, with his buddies from work; but, he doesn't have the money. To get his share of the bucks, Mr. Dillon must either sell his beloved Corvette, or marry off his alimony-collecting wife. If Dillon can find \"Mr. Wonderful\" for ex-wife Annabella Sciorra (as Leonora \"Lee\" DeMarco), he can stop payments. Making her ex-husband's job more challenging, Ms. Sciorra has hooked up with married college Professor William Hurt (as Tom). Sciorra has returned to school, and is learning Latin. Meanwhile, Dillon is dating sexy nurse Mary-Louise Parker (as Rita).<br><br>This Anthony Minghella film will be very disappointing if you're looking for anything approaching the caliber of \"The English Patient\" or \"The Talented Mr. Ripley\". As good as they are, director Minghella and his bickering leads, do simply nothing with this ordinary, predictable story.<br><br>There are a few nice moments, like a young downs syndrome couple sneaking a kiss as NYC subway light flicker. But, It's difficult to believe Sciorra suddenly dating the series of men recommended by Dillon. And, it's hard to fathom Dillon giving up a woman as desirable and intelligent as the gainfully employed Nurse Parker (a part filmmakers should have considered making an \"airhead\"). Second-stringers, like Parker and Con Edison worker David Barry Gray (as Pope), are more interesting to watch than the stars.<br><br>***** Mr. Wonderful (10/15/93) Anthony Minghella ~ Matt Dillon, Annabella Sciorra, Mary-Louise Parker, William Hurt","user":"wes-connors","rank":[8,8]},{"title":"I thought any minute you'd walk in the door...Oh, I waited and waited for the phone to ring...one of Mr Minghella's finest, definitely","rating":9,"date":"30 June 2007","review":"Perhaps I am a little late with my writeup of this, a favoured movie in my specially selected permanent collection. I have read the other reviews, however I cannot agree, because this is a BIG hearted not light hearted comedy drama, and there is PLENTY of chemistry between the stars Annabella Sciorra and Matt Dillon. She is just lovely to look at, beautiful and totally believable. Mary Louise Parker is also delicious, the acting is great, the storyline very likable, timeless, then and now. Mr Minghella became famous with the recent Breaking and Entering, The English Patient, The Talented Mr Ripley but I like this one very much. Others in the cast warmly supportive, include William Hurt and Dan Hedaya. James Gandolfini has a simple non violent role, Vincent D'Onofrio is absolutely wonderful in his adoring song to Ms Sciorra. His performance jumps out at you, Oh Vincent... your eyes will water. You have the price of the movie in that one scene. If you are into relationships, you will appreciate it... falling in love, being in love, two people living together, then drifting apart, you just want them to get back together again. It's a romantic fantasy for adults. Take my advice, rent it, buy it. Comment from Malcolm in Toronto 30th June 2007","user":"malcotoro","rank":[14,16]},{"title":"Enjoyable film with surprise cast.","rating":14,"date":"14 February 2007","review":"I just watched this on TV and enjoyed it as much for the cast as well as the light hearted story.<br><br>Seeing a thinner younger James Gandolfini with Annabelle Sciorra years prior to the Sopranos was a surprise as well as seeing Vincent D'Onofrio as a shy singing druggist instead of an intense detective or someone on the edge of sanity.<br><br>The rest of the supporting players are a tribute to the talent pool available to producers who need to fill background roles with actors with as much talent as the leads.<br><br>Luis Guzman does a great job as always along with Dan Hedaya, Bruce Kirby and William Hurt. There is even a too brief appearance by Saverio Guerra as the landscaper driving the truck. If you wondered where you saw him before it was as the laughable Bob character on Ted Danson's enjoyable series Becker.","user":"hankmcn","rank":[5,5]}]