[{"title":"Whoever said this was the worst Star Trek film is so wrong!","rating":8,"date":"30 September 2006","review":"In my personal opinion, and as an avid Next Generation fan, without a doubt \"Insurrection\" is one of the best Star Trek films, and the third outing for Picard, Riker, Deanna and the rest of the Next Generation crew stays most true to their esteemed television series. This time round, the crew are faced with a violation of the Prime Directive and whether or not the 600 people who live on a literal planet-of-youth are more important than the millions of other people that could benefit from the planet's regenerative powers. Action, drama, comedy and romance follow in true Star Trek spectacular.<br><br>As always Patrick Stewart is in top form as Captain Picard who leads the Star Trek resistance to save the innocents from one of his own corrupt superiors Vice Admiral Dougherty (played terrifically by Anthony Zerbe) who are involved with some aliens (including F. Murray Abraham's Ad'har). Along the way Picard finds a new friend in Anij (played by the lovely Donna Murphy), one of the Ba'ku, and a little romance follows.<br><br>Jonathan Frakes once again directs and does an outstanding job, though it does mean his character Commander Riker gets a bit less screen time, though he is always a pleasure to watch. Riker's relationship with Commander / Counsellor Deanna Troi heats up in this film (and it's about time too!) Marina Sirtis of course returns as the lovely Troi and gets a fairly good amount of screen time this time round, and certainly most of the comical moments. Frakes and Sirtis have great chemistry together.<br><br>Brent Spinter's Data gets (as usual) too much screen time, again his story consists of his quest to become more human and the like, though he does befriend a Ba'ku child which was done quite well. As usual Gates McFadden (Dr. Beverly Crusher), Michael Dorn (Lt. Commander Worf) and LeVar Burton (Lt. Commander LaForge) are given very little to do in the Star Trek films, and this one is no exception, though at least Worf and LaForge got their own small story lines - Worf had to go through puberty again and LaForge found himself with the ability to see. Beverly however only gets a \"storyline\" involving her boobs firming up. Terrific. Poor Gates must be the most under-appreciated actress in all of Star Trek, but also the most gracious for returning each time.<br><br>The special effects of \"Star Trek: Insurrection\" are above average, and the music score is really well done. Often its the small moments in the Next Generation films that are the best, and this one is no different, but at least the big moments are good too. I think the \"Star Trek the Next Generation\" films are probably the only action-type films in which the heroes are all (with the exception of Marina Sirtis) in their 50's and people still want to watch them. Quite interesting too that a main theme of the movie was the eternal youth. At least when the sad time comes that the Next Generation cast are no longer alive, they will be immortalised in history by their much loved characters and beautiful stories, just like \"Insurrection\".","user":"boyinflares","rank":[114,157]},{"title":"Star surprise","rating":9,"date":"13 June 2000","review":"Let me say this: I loved this movie. I'm not one of those unconditional trekkies, but I liked this movie a lot.<br><br>And this one, by actor/director Jonathan Frakes, is a good piece of entertainment. It's intelligent, sometimes surprising, has good action (albeit the tactics and manoeuvres  of Star Trek ships are quite ridiculous - whatever the movie) and the actors chosen for this one are good performers.<br><br>The Star Trek Universe is complex, rich, but not my favourite. There seem to be holes in its consistency - technology seems to be less advanced in fields where it should have been far ahead, politics seems too much like politics on any country on Earth, and society a replica of USA's, Europe's or Japan's society, military tactics seem no different of manouvering battleships like Submarines, Frigates, Air Carriers, etc. At least, there is some effort to put some science into Star Trek - even if we do not know what metaphase is or why the explosion of metronium gas is so destructive in space.<br><br>The script is too simple, I grant that. But the way Insurrection was shot, the special moments achieved, a couple of twists in the plot, a reasonable dose of uncertainty and humour, leads me to say we are in the presence of a Star Trek masterpiece.<br><br>It's a pity that the main motor of events isn't some larger than life quest or fight (or is it?). Those of us who grew up familiar with the grand scale of events of the Star Wars saga, the details and realism of Blade Runner and Twelve Monkeys, the ingenuity of Batman, Dark City, The Matrix, expect of movies like Insurrection something that tops or equals these other masterpieces, and when that doesn't happen, something seems to fail.<br><br>But Insurrection ends up being a good work by someone that had only directed some episodes of Star Trek - The next Generation.<br><br>Well, the special effects are good, the acting is good (Patrick Stewart, Donna Murphy, Zerbe, Murray Abraham, Frakes, Levar Burton, Brent Spinner - they know exactly what to do and give this movie the extra-consistency), the soundtrack is ok.<br><br>If mr. Jonathan Frakes read this, I would advise him to continue his good work but to seek more complex and elaborated scripts for Star Trek. If he chooses to direct other types of movies, he does have the talent.<br><br>I hope you all enjoy this.","user":"Chronus","rank":[17,20]},{"title":"Its not as bad as some say.","rating":8,"date":"3 June 2001","review":"Don't let some of the bad reviews for this film put you off watching it. I finally got around to watching it last week and I must say that It was no where near as bad as what some people have said about it. In-fact I thought it was pretty good. It's not the best Star Trek film but it's not the worst either. Some people have criticized it by saying that it looks like an extended television episode- All the films except 'the motion picture' have - what's the point of changing the television look and feel when it is so good? The one time they did try to change it from the episode feel (the motion picture) it was crap. Come on people, this is Star Trek - what were you expecting - this was not meant to be another Shawshank Redemption. I like this film so I'm going to give it 8 out of 10 because I don't care what other people say.","user":"DanPacino","rank":[80,119]}]