[{"title":"My analysis *spoilers* Don't read this unless you've seen the movie (this contains little in the way of an actual review)","rating":6,"date":"5 July 2006","review":"I write this for people who've seen the movie, and don't understand it. First of all, you have to understand that Sarah suffered from multi-personality disorder from a long time before the movie started; most likely since she was a child. She didn't know this herself, because it's like that with MPD's. The regular personality doesn't know what the other(s) are doing. They are simply unaware. And her other personality hated men, while her regular just didn't trust them. That's why she thought her old boyfriend Benny left \"without a note or anything\". Her other personality reacted aggressively against a man that her regular personality loved; it killed him, and made it seem to her and her close friends, that he just left suddenly. She didn't know he was dead. However, although her other personality usually hates men, it falls in love with Tony, as well as Sarah herself. This is obvious in the scene where Sarah appears in Tony's home, slaps him, and has sex with him. Her regular personality wasn't ready for that kind of commitment yet; also, her other personality's way of having sex is very aggressive. Everything weird, bizarre, or directly threatening that happens towards Sarah, is caused by her other personality, because it's jealous. It wants Tony for itself. It starts out threatening her(the paper, the flowers), and ends with trying to kill her(with the heater in the bathtub). Sarah, who doesn't know that it's her other personality, and isn't good at trusting men, especially men who are close to her, blames Tony, because she doesn't feel safe when he's around. However, at the end, she is told the truth by Tony: He is investigating her, in order to find out what happened to Benny. In the beginning, Sarah doesn't believe that she's \"been stalking herself\". However, when her father enters, he triggers some memories, that awakes her other personality. She reacts aggressively to both, because she feels, as usual, that men are the root of all evil. She starts by killing Tony, because she was, in fact, in love with him, and it seems(to her, at least) like he isn't in love with her. After killing him, her father, not knowing she is not \"herself\" at the moment, tries to calm her down; this triggers more unwanted memories; she feels like she's back at the top of those stairs, her father making her cover his crime. She reacts very aggressively, as that memory is one part of the origin of her hate against men(the other being sexual abuse by her father). After killing him, she destroys the tape, which is the only devastating proof toward her suffering from multi-personality disorder. At that point she's still not \"herself\", but her other personality. She then covers her own crime, as she feels that it was her father's fault, just like back when she was little. After covering up her crime, she sits down by the body of Tony, and her other personality subsides. Sarah is herself again; thereby, she doesn't know what happened, but guess/thinks that Tony killed her father(which would seem logical to her, as she was certain that Tony was insane) and she shot him in self-defense. We hear that the police aren't going to file charges, since it seems like an obvious case of self-defense. She then gives us a definition on a multi-personality disorder(which fits perfectly on herself) and goes out with Cliff. She doesn't know that she is guilty of killing two people close to her, and the movie ends with the disturbing conclusion, that unless something hinders her from killing more, her other personality can keep killing men, while her regular personality can have a clean consciousness, as she doesn't know the truth.<br><br>Review:<br><br>While watching this movie, I thought that it was just the regular thriller. I was very surprised at the ending, which tries to turn it into more... I'm not quite sure it succeeds, but it made everything that preceded it easier to forgive. The movie has a very Hitchcock feel to it; suspense, shocks, atmosphere... It felt like it could have been the work of the late Hitchcock himself(save for the sex scene, which I'm not quite sure was so much necessary as an easy device to attract those on the look-out for such a thing). I recommend this to fans of thrillers(just don't expect a masterpiece... but hey, it's got Rebecca De Mornay, does anyone actually see her name on the cast list of anything and think \"oh, quality cinema lies ahead!\"?), particularly those who like them with a \"twist\". Yes, I actually just made that pun. 6/10.","user":"TBJCSKCNRRQTreviews","rank":[23,26]},{"title":"Terrific De Mornay","rating":8,"date":"6 April 2006","review":"A more or less typical thriller made special by Rebecca De Mornay's awesome performance. She is the executive producer of this picture and must have badly wanted to do this role -- I'm glad she did.<br><br>She plays a psychiatrist evaluating whether an accused serial killer is competent to stand trial. It becomes obvious early on that she was drawn to psychiatry because of her own severe emotional problems and difficult past. In the meantime, we are shown troubling relationships with men appearing in her personal life. An upstairs neighbor badly wants her, but she wants only to be friends. Her father shows up out of the blue seeking affection and assistance, but she resists him, and it is obvious that their relationship and her childhood were deeply troubled. A stranger (Banderas) she meets in a store ardently pursues her, and they begin an affair, but she has difficulty trusting him, both because he is something of a suspicious character and because, as she tells him, she has difficulty trusting anybody. Their relationship becomes volatile and angry, tinged with violent overtones. Then there is the issue of her ex-fiancé, who vanished abruptly and without explanation just before the scheduled wedding.<br><br>As happens in these kinds of films, she is sent a series of mysterious messages and packages with no return addresses. Then violent things start to occur. Someone is clearly trying to terrorize her, but who? So many suspects -- Banderas? The upstairs neighbor (who is of course jealous of Banderas)? The serial killer, acting through friends outside of prison? Her father? The ex-fiancée? I did not anticipate the answer to this question, revealed of course at the film's end, but it was not an especially unusual conclusion for films of this kind. What made this picture worthwhile was De Mornay's utterly believable portrayal of, let us say, a difficult character, reminiscent of what she did in \"The Hand That Rocks The Cradle\". She is simply great at this kind of thing, besides being classically gorgeous.<br><br>The other acting is fine, but no one stands out. Banderas is always good, but in this one he is mostly eye candy for the ladies. Harry Dean Stanton as the serial killer is suitably menacing and crazed, but this picture is really all De Mornay. I found it a bit slow at times, but the last 20 minutes or so made up for the weak spots. Definitely worth watching.","user":"lawfella","rank":[25,30]},{"title":"Hitchcockian Thriller with many twists and turns","rating":22,"date":"22 February 2002","review":"I never expected to be so positively impressed by this universally panned thriller.  Did all the other reviewers see the same movie I did?  I just shake my head, and marvel at the brilliance of all these people who found the ending so predictable.  <br><br>I daresay I'm older and have seen more classic thrillers than most of the imdb audience, but this movie kept me on the edge of my seat.  And Banderas has never looked better.  I thought both lead characters were interesting and deep.  Harry Dean Stanton is marvelous, as usual, as the serial killer against whom De Mornay has to testify, and Len Cariou does a nice turn as her estranged father trying to make final peace with her. <br><br>\nDe Mornay actually produced this, and the daring sex scene could not have happened without her enthusiasm.  Okay, I agree the dead cat was too much of a cliche, but the detective?  Banderas' true identity?  Miller's real character?  The twists and turns certainly had me going.  Although I wanted to off De Mornay myself to take her place in the chain-wire fence scene. And, yes, this old gal certainly found it erotic, despite what I have read above.  I think this is her best performance to-date.<br><br>I give this 10/10.","user":"aromatic-2","rank":[14,17]}]