[{"title":"A bit above average for a Van Dien movie","rating":14,"date":"14 December 2009","review":"Having sat through several Casper Van Dien movies in the past, and not being very impressed by them (except for STARSHIP TROOPERS) from both Van Dien's acting style to the quality of the rest of the movies, I put off seeing this movie. The only reason why I watched it was that I bought this movie as part of a double feature DVD (with the other movie being the excellent Dolph Lundgren actioner THE PEACEKEEPER).<br><br>There are a few positive things I found in this movie. The movie has good production values, a trademark of Millennium Films/Nu Image film companies. The cinematography is good, and the movie doesn't look really cheap at any moment. (And it was nice to see a movie from these guys that wasn't shot in Bulgaria.) There is some nice gratuitous nudity, and the story has multiple plot threads that get you curious as to how they will all be resolved at the end.<br><br>But I didn't think that the movie worked overall for several reasons. There is a lack of sympathetic characters, for one thing - you'll wish they will all end up dead. The script also moves very slowly after a while - there should have been more action or big plot turns throughout the narrative. You have to wait for the last twenty minutes before things start to seriously move and things start resolving themselves.<br><br>Still, it could have been worse. I've seen worse Van Dien movies (and worse Van Dien performances.) If you are pressed to watch a Van Dien movie that's not STARSHIP TROOPERS, this is probably the one to watch.","user":"Wizard-8","rank":[7,7]},{"title":"The sum is much, much less than the total of its parts.","rating":4,"date":"14 July 2008","review":"My tolerance for shlocky direction was overwhelmed by some of the choices in this could-be-really-good time-waster.<br><br>When the \"romantic\" intervals were of a nature to take me out of the story and into \"How-and-why-did-the-movie-maker-do-/that/?\" mode, you got to figure something is missing in there; restraint and tastefulness, I think.<br><br>Brian Brown is a capable, empathetic actor - usually. I think he didn't like the project or the people, and it shows. I don't remember anything the other guy did. Can't even picture his face.<br><br>On the other hand, it doesn't have to be any good to be entertaining; some of the vignettes and twists are fun and even ingenious.<br><br>I watched this movie ($2.00 purchase at the vid rental place) against the advice of the screenwriter; I understand he was tempted to remove his name from the credits. Matter of pride, I bet.","user":"frank-1132","rank":[4,5]},{"title":"Mixed feelings","rating":5,"date":"22 January 2000","review":"I had mixed feelings about this movie. It started off slowly and I almost quit watching. But after the first 30 minutes, the plot became a little more clear and the movie improved. Still, the acting was not very good. I had some trouble making out the dialogue. And the \"love scenes\" bordered on porn. Interesting ending. Men will like this movie better than women. It's definitely a guys' flick.","user":"tpendleton","rank":[5,7]}]