[{"title":"Poignant and Sweet","rating":8,"date":"15 November 2000","review":"Another film that I liked a lot more than I thought I would. Drew Barrymore was as adorable as ever, even though she was playing a ditzy blonde. Mary-Louise Parker really made this film. Her frail cuteness with the edge of toughness when necessary was perfect. And Whoopi Goldberg played it in an understated way that shows her talent, that she can handle a lot more than the over-the-top comedic roles that she is so famous for. Matthew McConaughey plays a caricature, so there is really no indication of talent there. The ending swims in poignancy, without getting (too) cloying. This film is definitely worth a look.","user":"smatysia","rank":[23,29]},{"title":"A motion picture that celebrates the art of survival, the gift of laughter and the miracle of friendship.","rating":19,"date":"19 May 2003","review":"'Boys on the side' is a very touching movie that looks essentially at what it means to be a woman, trapped inside a man's world. It also shows that friends really do stick together, through thick and thin. With the three leading ladies in roles that are really well written, here is a classy 'chick flick', that one guy really likes. It also looks into what it means to be sick, which I have been no stranger too, either....<br><br>Three women sharing a car going west, team up in this winning celebration of camaraderie, caring and friendship which quickly becomes a family, in 'Boys on the Side'. One is a wisecracking club singer, one is a finicky real-estate agent and one is a free spirit. Each has secrets to reveal, strengths to impart and vital moments of self-discovery awaiting. Now is their time.<br><br>What a fine cast for such a dramatic movie. The three main girls in 'Boys on the side' include the 'lesbo' Jane (Whoppi Goldberg), Robin (well acted by the talented Mary-Louise Parker), who is being helped to drive across America by Jane, and the fun loving and partly liberated Holly (Drew Barrymore). All these women are amazing in their roles.<br><br>I love how Jane stands up for herself and her sexuality, in addition to the fine music she can sing. Robin is a girl hiding a big secret, but we are aware that her life has not been an easy ride, which seems ironic, because of what the movie shows. Then what Holly is enduring, is quite staggering, being involved with a brutal man, Nick (Billy Wirth), that no woman should have to put up with. It is Holly's great personality and character that turn these best friends into a very close-nit family. Her situation is not as easy as it seems either.<br><br>While men are not talked about in a very good light in the film, we do see some men that are decent to these women. Robin admits to having a thing for barman, and on the road trip she meets up with Alex (James Remar) a caring barman, who is really hooked on Robin. The way their relationship goes is an interesting aspect of the movie. James had an interesting character in HBO's 'Sex and the city'. Holly, with such a bubbly personality meets a cop cutely named Abe Lincoln (Matthew McConaughey). He dearly loves Holly, wants her as his wife, so she can live a life that can be happy and trouble-free. I am interested in seeing McConaughey's latest film, titled 'How to lose a guy in 10 days'.<br><br>The director of BOTS was Hebert Ross (from the brilliant 80's movie, Steel Magnolias). He is a very game sort of director, and does not shrug away from any of the important issues within the film. I love how he brought out the movie's main themes of sex and sexuality (gay and straight), the empowerment of women, friendship, sickness, humour and what it means to be a family.<br><br>But the movie's story was also a highlight from where I viewed it. Written by Don Roos, it was very touching and emotional, but also holds a large amount of subtle, clever humour. The way he wrote the three main characters was terrific, with them all having very different situations for us to learn about. This I believe allows us to fall in love with each one of them. The use of quick flashbacks is another aspect that was well written into the screenplay by Roo's as were some of the lines in BOTS, which are unforgettable. Lines like when Holly asks Robin at the dinner table, `We're you?' in reference to her and Jane having a sexual relationship, the next few lines are great. The title of the film was well thought up, considering the line that Robin's mother says to her daughter, `You can't fight nature, God knows you women keep trying, treating your men like side dishes, stick a fork in when needed, just like men used to treat us.' That line is basically what the film is all about.<br><br>Another great part to this film was its soundtrack. It was not only clever to incorporate it via one of the movie's characters, that of Jane, it makes the whole movie all the more compelling. Whoppi Goldberg and Mary Louise Parker sing a fine solo of the Roy Orbison classic, 'You got it'. Then for the movie to have another performer actually sing the song, I found to be just original, as some films would just throw in the old song, but not here. Another ironic part of the soundtrack is a song written and sung by known lesbian Melissa Etheridge, titled 'I take you with me'. I am sure that the powers behind this movie wanted such a performer, considering one of the main characters in the film was also gay.<br><br>I watched this film, just a few weeks after seeing a movie that I am sure inspired the writer of the script, that being 'Thelma and Louise'. Parts of 'Boys on the side' has a similar feel to 'Thelma and Louise' - that of women on a road trip, trying to break free of men's hold on them. While a lot of the film is original, it has a very touching ending, to what can only be described as a very emotional movie. I also feel that director Herbert Ross, allows us to experience what each character is going through in life and does not shrug away from any issues that other movies might simply try and avoid. With a cleverly incorporated soundtrack, 'Boys on the side', is a movie that we can all learn from, to try and improve not only our friendships that we have, but how we live our lives in a world that can be cruel, harsh and unfair.<br><br>CMRS gives 'Boys on the side': 4 (Very Good Film)","user":"Old Joe","rank":[23,30]},{"title":"Surprisingly sensitive","rating":9,"date":"25 July 2001","review":"Absorbing, funny and incredibly aware comedy-drama about three ladies on a road trip: Whoopi Goldberg as a lesbian lounge singer, Drew Barrymore as a pregnant, unmarried waif, and Mary-Louise Parker as an uptight woman trying to loosen up (and suffering from HIV). Plot is contrived, but the interaction between the characters is definitely not. Screenwriter Don Roos writes vivid dialogue and touching scenes, and the cast plays it to the hilt. Barrymore is at her best here, Goldberg is outstanding, and Parker--while not a varied actress--does solid work. Nice direction by Herbert Ross, who hasn't been this focused in years. ***1/2 from ****","user":"moonspinner55","rank":[15,19]}]