[{"title":"Very Romantic ... Very Good ...","rating":20,"date":"20 February 2000","review":"I thought City Of Angels was very good. I'm usually very critical towards movies, but City Of Angels got to me. Meg Ryan usually plays in Romantic Comedy's (Sleepless in seatle, You've got mail) but this time, City Of Angels, admittedly a Romantic film, but it isn't a comedy. Far from it, it's a drama in all of its aspects. And Meg Ryan converts to that change very well. She acts great in this movie. It wasn't an easy part for her, there is a lot of crying involved, and a lot of dramatic moments in her characters life.<br><br>As goes for Nicolas Cage's character. Oh my god, he plays Seth with such excellence. Really, i don't think that anyone else could play the part as great as he did. The way he looks, the way he moves .. so cool.<br><br>Ok the storyline is a little unbeleivable, but you musn't be held back by that fact. Just beleive the unbeleivable. Just go with the plot, and follow the movie closely.<br><br>I'm not suggesting that City Of Angels is the best in it's sort. It won't win any oscars, but what i am saying, is that it's a nice movie, with great actors, great music and a good storyline which rolls towards very emotional ending.<br><br>You won't be dissapointed.","user":"Michiel Waaijer","rank":[93,125]},{"title":"Unbelievably underrated","rating":7,"date":"15 September 1999","review":"I just watched this movie again for about the 3rd time. People say the movie is depressing, unoriginal, and boring. I'll bend on the depressing part, but the other 2 are completely un-true. <br><br>Nicholas Cage and Meg Ryan give pretty good performances, nothing oscar-worthy, but it's not the acting that makes this movie great. It's beautiful. Pure heaven to the eyes and ears. While you see the wonderful scenes, and backgrounds, with wonderful color and beautiful art direction, and hear the perefectly performed and selected score in the background (with contributions from U2, Sarah McLachlan, and the surprise hit \"Iris\" from the Goo Goo Dolls) it doesn't really matter what kind of acting is happening. The screenplay is pretty good, but somewhat lacking, which is why I give it an 8.25 on a scale from 1-10. Its a love story, yes, and can get cheesy at points, but none the less, it's still worth seeing once or twice.","user":"Andrew-162","rank":[84,122]},{"title":"*soul toucher*","rating":10,"date":"3 April 2004","review":"Good heavens, this is by far the best lovestory I've ever seen. A perfectly carried out movie about this angel (Nicolas) that gives up eternity in Heaven to be with a woman (Meg) on Earth. This movie really touches your soul, so don't go destroy it by watching it with a bunch of friends. As a matter of fact, It made me cry like a baby... City of Angels actually makes you reflect about life/death and you'll know it touches your soul. I've never before been so affected (in a good way though =) by a lovestory, but this one; it's hard to describe you have to see it! // a gracefulness","user":"sami_almehdi","rank":[77,116]}]