[{"title":"'Rocker' Keaton...","rating":10,"date":"5 September 2000","review":"What I thought was essentially a kids' movie turned out to be a much more pleasurable experience. I know, I may be biased a bit towards anything MK-related, however even my best friend (who was with me at the time when we saw it) liked it a lot, even if we saw it closer to Summer rather than Christmas (it came out in Malta, Europe - where I was still living at the time - like some 6 months after it came out in the US!). Anyway, Michael Keaton yet again gives a great performance as a 'snow'man trying quite desperately to make up for lost time. Kelly Preston is good too as his wife and the kid is ok-ish (we've seen much better kid actors, in my opinion). It's only Mark Addy who seems like a fish out of water and looks like he's only in it either because he's a friend of the director or something! He just doesn't seem to gel! All in all, a very cute and neat movie, with good work from Keaton and a rocking good soundtrack, with tracks from the boys Hanson, among others, and Keaton himself raunchily singing a couple of tracks penned by someone from Yes. Great for a night in with the family.","user":"paul_muscat","rank":[30,41]},{"title":"CUTENESS! all the way","rating":9,"date":"26 November 2001","review":"This movie is a really cute movie and a great one to watch around the holidays with your family.  It's not too cute though so that it becomes unlikable.  It was interesting to see Michael Keaton in the Dad role (I've never him as anything besides Batman) and I think he made a really good Dad. I liked the way they dealt with death, it had a very real sense about it. Which is strange, because you have the Dad come back as a SNOWMAN (hah) but once you get over that (it does take a little while, don't give up) it becomes really nice.  I like the ending - I guess I shouldn't give it away, but it was sweet without being corny.  There is a really thin line between cuteness and overkill, but this movie is still on the cute side.  (I gave it 9/10.)","user":"janelglin","rank":[30,42]},{"title":"Extremely underrated","rating":7,"date":"23 February 2000","review":"I have been resenting this movie for the longest time.  But I should have seen it before today...but I shouldn't trash what I haven't seen, right? Because it was a good movie.  I happened to catch it on HBO Plus today...it kind of dragged on a little bit, but other than that...ok, I have to admit it, it was kind of touching.  I think I saw one review trashing the special effects...come on, how low can you go?  I think the people that hate this movie had to have seen a LITTLE bit of something that they liked...it's a family movie that appeals to kids and adults, and that's what I think it did.  I will leave it as that.  A great Christmas movie. 7.5/10","user":"RunningFromSatan","rank":[20,27]}]