[{"title":"Good film I enjoyed!","rating":7,"date":"22 February 2020","review":"Bad Boys II doesn't reinvent the wheel, it just makes it bigger, faster, and more attractive. The film is little more than a collection of high intensity action scenes with a tons of irreverent humor and mild characterization tossed in between. It's slick, high energy fun and a huge success for what it is and wants to be, which is, essentially, the quintessential Michael Bay experience.","user":"MR_Heraclius","rank":[38,40]},{"title":"Bad Boys is Bad Ass (Retort to \"bad is the right word for title\")","rating":7,"date":"22 February 2005","review":"I think us movie buffs sometimes forget that not all movies are made to have some sort of under lying message that can or will change our lives. That's why it pains me to see some users give this film a bad review because \"the dialog is weak\" or \"the scenery isn't vibrant\" or something along those lines. This is not a stab or an insult to you, but what I'm saying is; sometimes movies are made with one intended purpose... ENTERTAINMENT! I could careless if this film had poor actors, poor script, poor lighting, that doesn't matter when you watch an action film. This movie delivers your monies worth too, in my opinion Will Smith and Martin Larwence make such a great team that part of the fun is just watching these two get into it from time to time. And with Michael Bay directing, you know you're going to get some good action scenes. Let's face it, Bad Boys II has one of the best car chase scenes ion recent history, it dominates the dismal over played chase in Matrix Reloaded which was the other big summer sequel of that year. I think all that needs to be said here in a retort is the movie is an action movie ans needs to be looked at as an action movie. To hell with the elements that the Academy looks at, appreciate the film for all the stuff that blows up and the laughs the cast can bring you to.","user":"braindog","rank":[140,196]},{"title":"What do you expect?!?!?!!!!","rating":10,"date":"20 July 2003","review":"I hate reading these reviews putting this movie down.  This movie kicked ass plain and simple.  It's a fun movie to watch and enjoy!!! Sure, there's not much of a plot but if you wanted that why would you go to see this film?? The only reason to see this film is because you want 2 1/2 hours of entertainment!!!   That's what this is, pure fun.","user":"Jester69","rank":[181,264]}]