[{"title":"Dodging the biopic bullet","rating":15,"date":"15 March 2001","review":"Films like \"Pollock\" always leave me at a loss when I have to describe them to others.  For one thing, it's long been a labor of love for director / star Ed Harris, which maybe causes me to have more sympathy for the picture than I should -- after all, I'd hate to ream a project that he's spent so much time and energy developing.  For another thing, I usually find biopics a bit crippled because, in most cases (\"Pollock\" included), I already know the plot, and without the plot to get lost in, I'm left to look at little things like, you know, the acting, writing and directing.  Lucky for Harris (and my conscience), then, that the acting is uniformly great, the direction is mostly seamless (and downright kinetic at times), and the writing, while not being great in the \"Casablanca\" sense of the word, serves the story well.  \"Pollock\" dodges all the pitfalls that often turn biopics into boring history lessons.<br><br>The film picks up with Jackson Pollock the Unsuccessful Drunk (Harris), dabbling in surrealist painting and proclaiming Picasso to be a fraud.  There's enough promise in his work, though, for him to gain a girlfriend, Lee Krasner (Marcia Gay Harden); a benefactor, Peggy Guggenheim (Amy Madigan); and a professional critic, Clement Greenberg (Jeffrey Tambor), who champions his work in print.  From there we watch Pollock take the express train to art world superstardom, becoming one of the world's foremost abstract painters.<br><br>The fly in the ointment, though, is Pollock's notorious temper, aided and abetted by his equally notorious alcoholism.  Life in New York City is doing his personal life no favors, so he and Krasner move to the countryside, and it's here that he stumbles upon his \"drip method\" of painting, granting him another wave of fame and recognition.  It is this sequence, in which Pollock makes his pivotal discovery, where Harris's talent as a director comes to the fore.  Although we're aware that we're watching an actor perform a discovery that was made by someone else more than fifty years ago, it's an exciting, dynamic moment as Harris dances around his canvas, flicking paint from his brush in a blur of motion. It doesn't come off as staged or phony, but as a moment of genuine discovery, and for those moments we might as well actually be watching Jackson Pollock revolutionize the art world.<br><br>From there, though, ego, alcohol, and the mechanics of change all prove to be Pollock's undoing, leading, of course, to his untimely demise.  Through it all, Harris seethes with a feral intensity, giving a performance that should rightfully win him an Oscar (and check out the dramatic weight gain at the end.  Tom who?).  Harden, his co-nominee, is also excellent (although she's stuck uttering lines like, \"You've done it, Pollock.  You've cracked it wide open.\").  In lesser hands, Krasner could be just another version of the screeching, wailing, put-upon wife, but Harden bolsters the anguish with a fine layer of anger; the torment of a woman who loves the person causing her misery, but who is unwilling to let go of the principles which led her to enter and maintain the relationship on her own terms.<br><br>\"Pollock\" ultimately succeeds because we know how it will end, we clearly see how unpleasant and deluded the artist had become, and still we can't look away.  Harris's labor of love serves as an auspicious debut for someone who, at this stage, seems just as skilled behind the camera as he is in front of it.","user":"Alvy_Singer73","rank":[33,36]},{"title":"In The Abstract","rating":10,"date":"15 April 2001","review":"The romantic notion of suffering for one's art has been cinematically rendered in countless films, depicting the lives of real life artists ranging from Van Gogh to Camille Claudel to Beethoven to Jim Morrison to Rimbaud; but rarely has a film penetrated as deeply as `Pollock,' directed by and starring Ed Harris as the abstract painter Jackson Pollock.  The story begins in 1941 and chronicles Pollock's life until the early 50s. It's a vivid, and at times grim portrait of a true artist struggling for recognition, as well as with the inner demons that plague his soul and are reflected in his art and the way he lives his life.  It is said that the artist `sees' the world differently than the average person, which may be true; and it is that unique `vision' that sets the artist apart.  And Pollock was no exception to the rule.<br><br>\tAs romantic as it may sound, the reality of suffering for one's art is just that:  Suffering.  For realizing that vision and bringing it to fruition is more often than not an arduous and tortuous path to tread.  Coalescing the fragments of that vision and transferring that information into reality can be a painful process, and one of the strengths of this film is that it so succinctly conveys that sense of desperation and frustration that are seemingly an intrinsic part of `creating.'  There's a scene in which Pollock, after having been commissioned to do a mural, sits on the floor of his studio with his back against the wall staring for days on end at the blank canvas stretched across the room, waiting for that spark of inspiration, that sudden moment when what he must do will crystallize in his mind's eye.  It's a powerful, intense scene that allows you to share that creative process with the artist and experience the emotional turmoil of it, as well as the exhilaration of the moment when it all suddenly becomes clear, when the vision is realized.  It's a stunning moment; Pollock's face fills the screen and you actually see it in his eyes, the exact moment of discovery.  And it's absolute magic.<br><br>\tAs Pollock, Ed Harris gives arguably the best performance of his career; he perfectly captures every emotional level of this complex individual, from the manic highs and lows (exacerbated by alcohol consumption) to the neutral moments in between.  He totally immerses himself in the character, and what surfaces is a thorough and memorable picture of a tortured genius and flawed human being.  It's an astounding piece of work, for which he most certainly should have taken home the Oscar for Best Actor.<br><br>\tMarcia Gay Harden received the Academy Award for Best Supporting Actress for her portrayal of Lee Krasner, the woman who loved Pollock and devoted herself (even at the expense of her own career as an artist) to the man and his art.  It's a terrific performance, through which Harden brings Lee to life, physically and emotionally.  Her amount of screen time seemingly should have qualified her for a Best Actress nomination, but regardless, her work here is unquestionably deserving of the Oscar.<br><br>\tThe supporting cast includes Amy Madigan (Peggy Guggenheim), Jennifer Connelly (Ruth), Jeffrey Tambor (Clement), Bud Cort (Howard), John Heard (Tony), Sada Thompson (Stella Pollock) and Val Kilmer (Willem de Kooning). Harris' triumph with `Pollock' does not begin and end with his extraordinary performance, however; though his acting is so exceptional it would be easy to overlook the brilliant job of directing he did with this film.  And it is brilliant.  The way this film is presented is the work of not only a seasoned professional, but of a professional artist with a unique vision of his own.  One of the best films of the year (2000), hopefully it will in the future receive the acclaim of which it is so richly deserving.  Hopefully, as well, Harris will direct again; for it is talent like his, and films like this one, that expand the Cinematic Universe as we know it.  I rate this one 10/10.","user":"jhclues","rank":[53,63]},{"title":"Jackson Pollock: An illustrated study on how to really paint oneself into a corner","rating":8,"date":"17 February 2001","review":"As heavy and darkly textured a film as any one of his masterpieces, director and star Ed Harris takes us into the tortured, inebriated world of abstract painter Jackson Pollock (1912-1956)and leaves us assured that Pollock is a certifiable candidate for the Hall of Fame \"self-destructive genius\" award, joining the illustrious, besotted ranks of Ernest Hemingway, Hank Williams, John Barrymore, Helen Morgan, et al. True, when has Hollywood ever bothered to put on cinematic display a gifted artist who wasn't a poster child for Betty Ford?  We usually reserve well-adjusted geniuses for quieter, more tasteful retrospectives on cable TV.<br><br>Harris spares no time in letting us know that Pollock is a crude, mindless, gifted mess veering toward unmitigated disaster, taking everything and everyone down with him as he does.  Amazingly, in his brutally brief 44 years, Pollock manages to find, with a man-child brilliance, his life's destiny as a master of artistic expression and interpretation and the accidental inventor of the drip-action technique.  Harris painstakingly chronicles the little known details of this wretched genius who somehow learned how to free up his own artistic mind while confine the rest of his world to an absolute hell.<br><br>The actor/director wisely manages to avoid most of the pitfalls characteristic of these grand bios of agony and angst.  In a stark, no-holds-barred performance, he lays the character out like it is -- unredeeming, hopeless, desperate, supremely gifted, yet intriguing.  Its a daunting, fully etched performance that, in lesser hands, could have been one long cliche.  He doesn't toy with the audience by thinking had the right circumstances come along for Pollock (and they DID come along with wife and caretaker, Lee Krasner) he could have somehow prevailed.  Harris is quite believable, losing himself in the painter while showing off his researched skills with a brush.  It's a true labor of love and it shows.<br><br>Marcia Gay Harden's self-sacrificing Krasner breathes life not only into Pollock but the film itself.  Harden, in a rich, flashy portrayal, is mesmerizing as one artist compelled to save another, giving interesting dimension to a woman whose reasons are not totally pure and selfless.  Amy Madigan (Harris' wife in real life) makes the most of her few scenes as the eccentric museum maven Peggy Guggenheim, while Val Kilmer appears in an odd, thankless cameo.  Harris and Harden were both deservedly Oscar-nominated for their work here.<br><br>Yet, problems do creep into the film.  While Harris pours his heart and soul into this show (a ten-year pet project, so they say), Pollock's \"before life\" is never set up to demonstrate why Pollock became such an inveterate drunk and monster.  As such, little sympathy can be mustered, holding viewers at bay.  Moreover, a couple of manipulative scenes also seem to be thrown in merely to punctuate the already well-worn theme of Pollock's misery and desolation.  Less is more in this case. For the most parts, however, this little film succeeds.<br><br>Until now, little attention has been paid to the artist Jackson Pollock. Harris rectifies this injustice, as reprehensible as some of it is, with unsparing honesty, dedication and precision.","user":"gbrumburgh","rank":[32,38]}]