[{"title":"Amaze your friends","rating":10,"date":"26 February 2005","review":"Get hold of this film, any way you can (not illegally, of course). Scream its name from the rooftops of buildings everywhere, high or small, and offer prayers to your God for a fully-featured special edition DVD release. There is no film like Sonny Boy: even Leonard Maltin was moved to call it (I quote verbatim) \"A repulsive, socially irredeemable waste of celluloid ... filmed for no apparent reason other to offend and appal\", and if that isn't a recommendation for a cult movie, I don't know what is. Critics said similar things about Peeping Tom, A Clockwork Orange, Reservoir Dogs, and so many more ... those films are amazing and entirely individual, and so is this. It's pitiful that Sonny Boy has so little recognition apart from a few right-thinking die hards - you don't have to like it, just admit you've never seen its like before or since. Get on the bandwagon speedily, because if I am human this film will, in the near future, be recognised for the angry, iconoclastic, unclassifiable explosion it really is. And you can be among those who educated the world. Feel the adrenaline. There.","user":"nixed","rank":[30,37]},{"title":"Tongueless in the desert","rating":5,"date":"5 August 2010","review":"Terminally weird indie film with Paul L. Smith playing Slue, a small town crime boss. David Carradine plays his transvestite (I think) squeeze, Pearl, while Brad Dourif and Sydney Lassick are his two henchmen, Weasel and Charlie P. Weasel kills a couple and steals their car, which he brings to Slue. He didn't realize, however, that the couple's baby was asleep in the back. Slue wants to feed the kid to the hogs, but Pearl sees him as the son he could never have. They raise him as a killer to be used against Slue's enemies. They also cut out his tongue as a birthday present?! When Sonny Boy gets loose, his actions threaten to turn the town against Slue.<br><br>I had wanted to see this one after reading about it in \"Terror on Tape\", and TCM gave me the chance when they aired it as part of their Underground lineup. As you can plainly see from the plot description, it's certainly offbeat. Sort of an allegory in disguise for the effects of child abuse, you might expect this to be a disturbing film. Not even close. Instead, it's just strange. Slue has an old canon, and in a wicked scene, he uses it to blow apart a nosy deputy. There are also some obvious parallels to Frankenstein towards the end. Had I not known it beforehand, I would have been shocked to see that this was released in '89. It felt like something straight out of the 70's. The main giveaway was the computer font which tells how much time had passed. <br><br>While I would hesitate to call \"Sonny Boy\" a good film, it's worth a look if only to say that you've seen it. For fans of bizarre cinema, there's enough of a novelty present to warrant at least one viewing. Personally, I'm still not 100% sure if Carradine was supposed to be playing a guy in drag or an actual woman.","user":"Cujo108","rank":[15,17]},{"title":"Uniquely bizarre black comedy.","rating":30,"date":"30 June 2001","review":"Sonny Boy is a one of a kind horror/comedy with an exceptional cast. Paul L. Smith (Midnight Express, Crimewave) plays his usual over-the-top man/monster role, David Carradine his transvestite wife, Brad Dourif (legend!) the aptly named Weasel, and Dourif's Cuckoo's Nest co-star Sydney Lassick, the slimy Charlie P. Michael Griffin is exceptional in the title role. Pity he didn't go on to do anything else. Maybe making Sonny Boy scarred him for life?! I also liked veteran Conrad Janis as one of the few non-repulsive characters in this, an alcoholic doctor with a liking for surgery involving monkey parts(!) Janis has had one eclectic career, working with everyone from Shirley Temple and Ronald Reagan to African bushman N!xau, from Mork And Mindy to The Cable Guy, but surely he must rate this as the weirdest project he's ever been involved in! And Brad Dourif has made more than his fair share of strange movies,not least of which Blue Velvet, but none as demented as this crazy mutha!<br><br>I recommend Sonny Boy to bizarre movie lovers everywhere, and fans of Garth Ennis comics will find much to enjoy here, as it shares a similar gonzo humour to Preacher et al.","user":"Infofreak","rank":[19,23]}]