[{"title":"Needed More... Though, Not A Bad Film...","rating":7,"date":"7 March 2018","review":"Here's part three of the Hellraiser Saga... Once again this continues from where the last film ended, though it's a looser connection. The battle between Pinhead (Bradley) and his original human self, Captain Elliott Spencer, allowed him to break free of hells shackles. Entrapped in a monolith, he is awoken by Sandy (Leigh), when an accidental cut splashes blood on his stone features. Revealing himself to JP Monroe (Bernhardt), an unscrupulous womanising club owner, Pinhead makes a deal to free himself from his confines and to help JP to achieve his dreams...<br><br>This leads to lots of twists and turns in the storyline as you know you can't trust a daemon. The only thing which stands in his way is an aspiring investigative reporter, Joanne \"Joey\" Summerskill (Farrell), who's investigating the gory and violent murders which are appearing in the city.<br><br>The first thing that becomes evident is the amount of budget available for this film. Instead of being kept within the confines of a house or a hospital, now we're out in New York City. Penthouses, apartments, clubs, restaurants, ally's and streets. The locations are so much bigger. This is good, as it gives scope for a larger story with more hellish violence and gore... and it nearly delivers. Nearly, because the scene where the Cenobites finally take to the streets is actually underwhelming. What was required were a few more Cenobites and quite a few more victims, both pedestrians and police. It's nice to have explosions... I just wanted more.<br><br>The acting is okay, Bradley still stands out and is excellent as Pinhead. Farrell does a good job as the reporter. However, it's Bernhardt and Marshall, who plays Terri, who have their bouts of woodenness. The direction too is quite different from the first two, gone are the artistic and atmospheric lighting for a more natural feel. This is okay, but the film does lose a little of its mood and spirit, which added strength to the first two movies. I can understand the need for doing this. If you expand the daemons universe to include a lot more of reality then it stands to reason to get that feeling across would be to lose the more imaginative aspects of the filmmaking. That said there are still quite a few iconic shots, such as the entrance of Pinhead at the club and later in the church, and nicely thought out camera shots and angles.<br><br>Though I didn't find it as good as the first films it's still as enjoyable, though for different reasons... and as Pinhead would attain, variety is the spice of life.<br><br>Another good thing is that this film actually works as a stand-alone, you only need a vague idea about the previous stories; whereas, Hellbound actually made you feel as though you should have watched the first film before viewing. So for that reason, I would recommend this to all horror fans and newbies alike. This is a well written, structured, and acted film... which has its fair share of tension, fear, and suspense.","user":"stephenabell","rank":[6,6]},{"title":"What happened?","rating":8,"date":"8 October 2001","review":"I'm not quite sure what happened to poor ol' Pinhead, but his character sure got an overhaul for this misfire of a film.  He is transformed from his more mysterious visage into a gimmicky Freddy Krueger-type mass-murderer.<br><br>Once upon a time in the series, you had to open a puzzlebox searching for the secrets of pain and pleasure to be attacked by the Cenobites.  But no more.  Hell, all you have to do now is go to a nightclub and you're on the victims list.  Sillyness abounds as the DJ becomes a CD throwing cenobite and a cameraman launches missiles (yes, missiles) from the lens buried in his head.  Stupid.<br><br>Way off base when compared with the rest of the series, and not worth your time.","user":"Jawn138","rank":[49,68]},{"title":"'Hellraiser' without the suspense, tension, or intelligence","rating":6,"date":"2 August 2008","review":"In a city without pain, a reporter, Joey (Terry Farrell), discovers a man being attacked by seemingly alive chains. Before she can get her scoop, the man explodes into a shower of meaty chunks. Hearing the story of a mysterious box, Joey tracks it down to an embarrassingly 90s club called The Boiler Room. There, she finds out that clubgoers are being fed into a pillar by some rich prick (Kevin Bernhardt) to sustain Pinhead (Doug Bradley) in an attempt to bring him and his legion of Cenobites back to the world. It's up to Joey to defeat the Cenobites and send them back to hell where they belong. . . or bring Hell on Earth.<br><br>In what's obviously the most action-packed of the first three films of the Hellraiser series, Hell on Earth seems to take a turn more for the style of the stalk-and-kill-type slashers, regardless of 1992 being a dead year for the slasher subgenre. All four of the major slasher series (Freddy, Jason, Michael, Chucky) had already reached their break by this point, so it seems that Hellraiser was either too late on becoming a 'slasher'-type film. . . or they just wanted to become a way to fill the void. Either way, while it made for a faster-paced Hellraiser, it did not make for a better one. Now, I'm not saying it's a bad film, because it's not. . . just very mediocre (which is the worst type of film to me). It's an interesting film just to see a new look at the franchise and there's a nice amount of the classic Hellraiser violence, gore, &amp; horror. . . but the painfully good tension of the first two Hellraiser is greatly lost in exchange for all of the action. I would suggest this to fans of the franchise as there's a good amount of Cenobite action and all. . . even though some of the Cenobites are ridiculously dumb (I'm sorry, but CD-head? Gasoline-martini man? C'mon now). But, it's definitely the worst of the first three (the only ones I've seen thus far, but I have IV sitting in front of me ready to be watched &amp; reviewed). . . but it did keep me entertained and that at least allows it to have an average rating.<br><br>Final verdict: 5.5/10.","user":"Shattered_Wake","rank":[7,8]}]