[{"title":"An Underrated Gem","rating":30,"date":"30 May 2003","review":"I have always found this film an enjoyable and fun movie that uses satire to deliver some profound insights into modern American blended families. The film focuses on Laura Chartoff (Hillary Wolf), a delightfully sarcastic and self aware preteen and her dysfunctional family. Laura hates the family situation she has been forced into, but also finds she doesn't know how to convey this to either of her divorced parents, self absorbed and materialistic Melinda (Margaret Whitton) and well meaning but inarticulate David (Griffin Dunne).<br><br>After a particularly nasty fight with her mom and stepdad,Keith(David Strathairn) Laura runs away with her stepbrother Josh (Dan Futterman),who is estranged from the family. Soon all of Laura's family arrive at the lake house where she and Josh have been staying, and she takes off again, believing Josh has betrayed her trust.<br><br>In the days that follow, Laura will discover some fundamental truths about family as she makes her way alone in the world. Meanwhile,back at the lake, Laura's various family members-parents, stepparents,and siblings all come to realizations about their relationships that are alternately funny, touching, and poignant.<br><br>This is truly a great film which few people even know about-an underrated gem. Filled with vibrant performances-especially by the wonderful Dan Futterman, by Patricia Kalembar as Laura's beloved stepmother, Barbara, and by a pre-\"Boy Meets World\" Ben Savage as Laura's know-it-all half brother, Sam. Do yourself a favor and watch this movie. You won't be disappointed.","user":"luke-31","rank":[19,21]},{"title":"Taking a breather from an unconventional family.","rating":6,"date":"6 April 2004","review":"This movie is perfect for a lazy weekend afternoon. Laura Chartoff (Hilary Wolf) narrates this story about her experiences in a suffocating family setting where she just can't seem to get the affection and sense of control that she'd like to have. <br><br>For one thing, the family situation is all screwy. Her mom, who seems to make a hobby out of marriage as Chartoff explains in her quick video history introduction, marries Kieth, a very wealthy guy who appears to be a work-a-holic who treats his kids more like playful accessories than members of the family (notice how he reacts to his youngest son, Sam, who explains that he is writing a thesis about cartoon voilence and the socialization process). Laura's mom is similarly distracted by the luxuries of a being a rich man's wife, though she seems to take a liking to Laura's materialistic step-sister, Corrine. Likewise, Laura has a difficult relating to Kurt, who's father treats him like a house servant rather than a son.<br><br>\nLikewise, even Luara's father, flaky artist (Griffin Dunne) seemed to get stuck in a rather complicated situation, having one child with a nice woman named Barbara, but then wound up with a half-gassed new age artist named Stephanie who is pregnant with his twins.<br><br>But Laura finds an opportunity to escape when her stepbrother Josh, Kieth's oldest son who gave up years ago, stops in for a quick visit. Josh promises not to tell Lauara's parents where she is, but worried about her being on her own and the potential undetermined length of her visit, calls on some of the family for help. Laura takes off by then and the whole family gets word and comes looking for Laura. And that's where the story begins. The weekend together forces the family to work out their differences and for the parents to bond with their children, even Laura, who spends most of the time off on adventures while trying to figure things out for herself and wonders if her situation is really all that bad. <br><br>It's a funny little movie, but one that is probably best enjoyed on a lazy day.","user":"vertigo_14","rank":[9,10]},{"title":"Enjoyable","rating":8,"date":"3 June 2003","review":"I watched this movie with my two daughters which are thirteen and eleven years old. They both really liked the movie (so did I). I have never even heard of this movie till I seen it on starz family channel. I would give it a 8/10","user":"robbytara","rank":[8,13]}]