[{"title":"What on earth did I just watch???","rating":3,"date":"18 February 2017","review":"I was in my 20's in the 1980's and there just wasn't too much to worry about during most of the decade, so films often drifted into sci-fi fantasy territory, just like they did during the 1950's, an also relatively carefree decade.<br><br>This is a sci-fi musical about an all-girl group named the Vicious Lips that lands a gig at an interstellar concert event. On their way to the venue, their spaceship crashes on a desert planet, and they bicker and fight with each other in the dark ship wreckage. There's also a monster of some sort lurking around, and the girl's sleazy manager is wandering around the desert looking for help with two mostly-naked blondes.<br><br>The girls look like a live-action Jem and the Holograms, and their New Wave rock music is awful. They're shown on stage using fictional musical instruments, kind of partially disassembled guitars with blue bug zappers on the end. Starring no one you've ever heard of, and they are uniformly terrible actors. Written and directed by Z-movie auteur Albert Pyun. Empire Pictures produced it, but from what I read, this wasn't released in the U.S. until the DVD in 2011. Some people seem to have elevated it to cult status, and it is actually on a \"Cult Movie Marathon\" DVD set, which seems to get pretty good reviews on the world's largest website, probably owing to the viewers' collective nostalgia, not the quality of the film.<br><br>I give it 3/10 for originality.","user":"AlsExGal","rank":[8,9]},{"title":"ST:TOS with Big-haired Beauties and Better Sound?","rating":9,"date":"19 August 1999","review":"\"Vicious Lips\" is set in the far future, where a band finally gets the opportunity for That Breakthrough Gig -- if they can make it to an \"in\" club on another planet in time...<br><br>Given that the plot features no major twists, turns or surprises, given that the set is extremely trashy, the number of locations limited and the choice of them not overly inspired, Vicious Lips seems like a longish episode of the original Star Trek sans the familiarity with the characters we all know and love -- so whatever persuaded me to rate it \"excellent\"?<br><br>I'm a sucker for Big Hair, and The Music of the Eighties, both of which the movie has plenty of, since the all-girl band's guitar-and-synth sound is vaguely reminiscent of the early Kim Wilde's, if both \"rockier\" and catchier (and a lot like that of \"Radioactive Dreams\", another Albert Pyun-movie of that era with a more coherent plot, but no big hair). Last but not least, the general air of ultra-trash somehow utterly fails to be annoying, lending a certain charm to the movie instead, soon turning the initial impression (\"Hey, I could do that!\") into a burning desire to phone up all your friends:<br><br>\"Let's make a movie!\"","user":"Azundris","rank":[20,27]},{"title":"Not one of Pyuns' best.","rating":5,"date":"8 March 2015","review":"This is essentially a rock 'n' roll fable set in a sci-fi environment, as the title band vies for fame and fortune. A gig on a distant planet could be their ticket to the big time, but first they have to get there. Next, they have to learn to start getting along. Judy (Dru-Anne Perry) is brought in to replace the original singer, and Judy has to struggle to be accepted. The balance of director Albert Pyuns' script deals with the girls' being marooned on a desert planet after a near accident in space.<br><br>The problem for this viewer was that there really wasn't a strong enough story, or characterization, to latch onto and draw him into the movie. The movie is a curio, to be sure, but for too much of the running time, things are rather dull. Most of the gals in the band are interchangeable, although they are indeed a good looking bunch (gotta love that huge 80s hair!). Perry does her best to create a somewhat engaging character. The best value in \"Vicious Lips\" comes from the look of the movie, with appropriately trashy and colourful production and costume design. The songs are certainly catchy. There are some fun makeup effects courtesy of Greg Cannom, and John Carl Buechler and his team, and one major creature role, \"Milo\", played by Christian Andrews. Milo creeps on board the ladies' spaceship and sneaks around, but it takes too long for him to actually interact with any of them. The names of these people are fun; lovely Pyun regular Linda Kerridge (\"Fade to Black\") plays a band member named \"Wynzi Krodo\". Mary- Anne Graves seems to be having a good time as rock promoter Maxine Mortogo, but Anthony Kentz is simply annoying as Vicious Lips manager Matty Asher.<br><br>A late-in-the-game plot twist is groan inducing, but the resolution creates some good vibes as Vicious Lips rock the joint with a ditty dubbed \"Lunar Madness\".<br><br>Five out of 10.","user":"Hey_Sweden","rank":[8,10]}]