[{"title":"Great Movie For Kids","rating":10,"date":"30 January 2011","review":"Forget reviews saying this is not as good as the book. No films are are a good as the book! Watch this movie with an 8 year old child and you will see how good the film is.<br><br>Thank you Frank Oz for a wonderful film. The acting from the young children is above average and the tearful ending just right for a young audience. Interesting to note Steve Coogan plays a miniature model come to life - something he repeats later in his career in A Night At The Museum. Typecasting?<br><br>The effects are also very good. Remember this is 1995 when CGI was in it's infancy - but the miniaturisation of the cast is flawless.","user":"k-english","rank":[15,16]},{"title":"A warm, excellent family film","rating":10,"date":"10 May 2004","review":"Why this movie doesn't have an average of around 9 eludes me.  It is a wondeful film.  So well acted and with a very engaging story.  This is a great film for the whole family.  You'll love it. The lead actor - Hal Scardino - is such a natural.  He's completely believable, as is his friend. The Indian is also wonderfully brought to life.  How they made the special effects work so well back in 1995 (well... that was a while back for film special effects anyway...) I don't know.  I wish we could see more warm hearted films like this today.","user":"mbritt1216","rank":[37,47]},{"title":"A very moving, lovely tale of a young boy growing up","rating":10,"date":"7 January 2005","review":"I must first say I was shocked to see that the average rating given this film was below 6 (when I checked it in Jan of '05). While I gave it a 10, I fully expected at least a mid 7 from the IMDb audience. It is a wonderful film that I love to show to my children. What's not to like? It has a unique plot - that of an Indian coming to life in a young boy's cupboard, and wonderful acting and music. Through the boy's experiences with the Indian (wonderfully played by Litefoot) he comes to a new level of maturity. Hal Scardino's acting is natural and totally believable. If you are tired of the cut-out child actors that Hollywood gives us too often, then you'll love Hal. What a fabulously underplayed performance. The ending always makes me and my wife cry. There are so few really good films for children. I hate to suffer through other films I bought for the kids (like \"Inspector Gadget\" - a truly awful film) and I wish that there were more films like this one. This is a wonderful film and I heartily recommend it.","user":"mbritt1216","rank":[41,53]}]