[{"title":"Too much ambition","rating":6,"date":"5 April 2001","review":"A film producer who escapes death by murder and chooses to lead a simple life afterwards, a group of good Mexican gardeners, a second-rate movie actress who becomes jobless, a police officer who is not happy with the filing of his case, a Salvadoran maid whose family has been shot by death squads, a NASA employee who knows too much and his old father who doesn't want to exchange his old typewriter by a computer, a mysterious project of ending up violence in the world by putting everyone under surveillance, with all those ingredients what could a movie director have made? Surely an excellent movie. This one however is too much ambitious and produces rather poor results in comparison with that ambition. Where the contrast between dream and reality, love and greed, poetry and vulgarity could have been explored we are left with a story not bad in itself but not very deep and not especially moving.","user":"valadas","rank":[24,28]},{"title":"Slow, slack, but still satisfying","rating":7,"date":"23 June 2001","review":"You don't turn to Wim Wenders when you're looking for nerve-tightening suspense. Though written (by Nicholas Klein, with Wenders) in paranoid-thriller form, the script lacks even a nubbin of McGuffin to anchor the narrative. Two stories run in parallel: Bill Pullman's an action-film producer gone missing after an attempt on his life; Gabriel Byrne's a  NASA computer jock on loan to a mysterious satellite surveillance project. Just as yuppie cop Loren Dean is on the point of tying the two tales together, the movie's over, the plot unresolved.<br><br>Oh, well: Los Angeles (mainly Malibu, Santa Monica, and Griffith Park) looks great (cinematography Peter Przgoda), and Wenders has an uncanny ability to get actors to feel comfortable in their skins. The most notable skin in question is Traci Lind's: her role as a stunt-woman turned aspiring actress would have made her a star in a more mainstream movie.<br><br>\nIf you're a Wenders fan, don't let the commercial failure of this film put you off: Compared to, say, 'Far Away, So Close' it's as electrifying as 'The 39 Steps.' And somehow, as usual, Wenders's almost childlike intensity of gaze makes you look harder, too. The aroma of the film lingers, even as its substance slides through your fingers like sand.","user":"castipiani","rank":[30,39]},{"title":"The State of Control","rating":9,"date":"25 April 1999","review":"I watched this movie a few times, and I have met very few people who liked it as much as I did. I see it as an artful expression of all the critical thoughts in philosophy, sociology etc. that show how genocide, ultra-violence and fascist methods of population-control can develop out of all the promises of order, justice and peace the the modern state makes to its citizens. Also, the dialogue has absolutely superb moments, as when Mike the fugitive of the state says to his wife confronts his ex-wife with the words \"Who can I turn myself into? Well I see who you turned yourself into...\". A lot of people seem to dislike the loose ends and unexplained shifts that the characters make - but I say, in that very absence of rigid structure the film makes a parallel to the manifest ambivalence of modern life as a citizen: Our greatest protector is also our greatest threat.","user":"Tanikjo","rank":[31,41]}]