[{"title":"Powerful Film About Loneliness And Acceptance","rating":15,"date":"15 May 2005","review":"Remarkable. Touching. Riveting. Leaving Las Vegas is all of these and then some. I have not seen a film of this magnitude about loneliness and acceptance in such a while that I was in tears for much of the run time.<br><br>Nicholas Cage is Ben, a man who has lost his wife and child, throws his job away, and takes all of his remaining money to buy as much liquor as possible and \"drink himself to death\" in the city of Las Vegas. He has given up all hope, with no wish to live, but for one reason or another, wants a companion to share in his misery, but not try to save him. He finds this companion in a hooker, Sera, played by Elizabeth Shue. They immediately form a strong relationship based on one night of talking about their lives. Sera in particular quickly grows attached to Ben, for no other reason than she has been alone her whole life and wants nothing more than to feel that want and need by someone.<br><br>Cage won his first Oscar for his role as Ben, and how deserved it was. He was astounding, perfection, down to every single tick, the volume of his voice, the pain and tragedy buried in his eyes. I could not believe the extent of his role, the dedication and time he invested in bringing this character to life. Same goes for Elizabeth Shue, who with a simple glance at a person, she reveals her entire self, and no one even dares to notice except for Ben. This neediness is apparent, she wants to hold onto this relationship so badly, yet what makes their relationship work is total and complete acceptance of their respective decisions. He will not tell her to stop being a hooker, and she in return can never ask him to stop drinking. And it is in that factor that makes this film worth watching. To be totally accepted by those around them, to open themselves up to such an extreme.<br><br>Leaving Las Vegas is a sobering film about connections, loneliness, acceptance, and a small little island of hope that is Ben and Sera. They are two good people, depicted in a world full of sorrows and misdeeds, who latch onto each other and never let go. They were nothing but ghosts, till that chance encounter, and became each others worlds. Cage and Shue bring these good people to life in such an extraordinary way, making Leaving Las Vegas a film to be treasured and remembered for years to come. I highly recommend this film.","user":"flipgirl38","rank":[190,222]},{"title":"The dignity of love and the depths of despair","rating":9,"date":"3 June 2005","review":"If Mike Figgis never made another film, and Nick Cage and Elizabeth Shue retired after making Leaving Las Vegas, they would have done so with impunity. Both actors are superb, and bring the excellent screenplay to life with the help of some masterful dramatic cinematography.<br><br>Cage plays a suicidal alcoholic who has come to Las Vegas to drink himself to death, and Shue plays the unexpected problem - a prostitute who falls in love with him. The only reason this film did not receive a ten from me is the voice-over technique which was tastefully minimal, but, in my opinion, the only mistake the director made. It does help to provide closure, but I felt that closure was an unnecessary compromise here.<br><br>This is not an entertaining film, and in truth, I am surprised by its popularity among typical audiences. It is a serious film, and a work of art, but fun is not to be found here. DO NOT see this film if you dislike feeling emotionally drained and ethically challenged, and DO NOT see it if you are very prone to boredom, or easily offended by sexual violence, substance abuse and the horror of daily life on the street. <br><br>This is an intensely sad film about love shared by people who are caught in the gravity of their lives and can not escape. It is also a story of redemption and respect, found in improbable places. It is NOT a fun-filled frolicking romantic comedy, but rather, the opposite, and it achieves a beauty, dignity and power almost unique among films treating such starkly real and disturbing subjects.","user":"mstomaso","rank":[190,229]},{"title":"Amazing, and gritty performances","rating":9,"date":"3 May 2003","review":"It's not a movie I could bear to watch very often, because it's sad to see people destroy themselves. But Nicolas Cage and Elisabeth Shue are riveting to watch here. As a person who has a past involvement in alcohol and substance abuse, I found Cage's performance especially compelling, and after watching him in this one, I am sure glad that lifestyle is behind me!<br><br>The chemistry between these two is really great, two people that need each other in different ways, trying to cope with how screwed up their lives have become. Very real performances, if you're faint-of-heart be ready for some strong words, and not just obscenities. Wow! They really lay it on the line. Great performances by two of my favorites.","user":"jguz58","rank":[110,132]}]