[{"title":"Justin Kerrigan hits gold.","rating":8,"date":"8 June 1999","review":"Director: Justin Kerrigan.<br><br>Justin Kerrigan - this time you've really done it. Human Traffic is going to upset the majority of film critics who will view the lack of plot, the drug induced dialogue and the futile outlook on Nineties Youth culture as a miserable and desperate view of how weekends are spent by ravers and clubheads across the UK. Moreover, they will spot camera work borrowed from Boogie Nights and even try and associate the whole film with 'Trainspotting' theme (because, lets face it, a Scottish Heroin addict trying to clean up his act and a Welsh clubber looking for a good time with his mates is pretty much the same thing, right?)<br><br>Well wrong. Human Traffic has landed - along with one and a half quality hours of clubs, drugs, pubs and parties - and its time to leave behind your preconceptions of what a film should be like (where's the plot? I want a plot!) and instead delve into the lives of Jip (John Simm) and his mates, Nina (Nicola Reynolds), Koop (Shaun Parkes), Lulu (Lorraine Pilkington) and Moff (Danny Dyer). There's nothing special about these five friends; they're just hanging out together and showing you the way they lead their lives. They are not Burger King. They certainly don't do it your way. And you don't like it - well, tough.<br><br>Because essentially this period piece has captured everything that Nineties youth culture is revolving around. There are no clear solutions, in fact very few problems in the first place. At the end of the day, what Jip and his friends are doing is living and who are we to know or comment on anything different? They drink, smoke dope, pop pills and party; they know the risks and they're prepared to take them and moralists will just have to sit back and (try to) enjoy the ride.<br><br>The sound track is terrific and accompanies the highs and lows of the 48 hour weekend and the events that take place in it. But within this, what first appears to be social unity, we see traces of individual isolation that are easy to bypass in a culture of hedonism. Jips paranoia of sex, Koops jealous possession of Nina and Moff as his drug habit digs him deeper into his own hole and further away from his family, asks the question 'are things really this good?' However they will not be exaggerated to the extent that they are conspicuous, giving the film a controversial stance on drugs and the role in social integration. Kerrigan is pulling no punches. And why should he? This isn't GO! or any other such American rave film with clear cut margins and please-the-crowd conclusions - it is one that forces us to question whilst at the same time enjoy the at times hilarious, touching and other times exciting events of 48 hours with a group of five 'friends'.<br><br>And for the die-hard British youth among you, this might not be reality - but it's a bloody brave effort at depicting it.","user":"warne","rank":[60,71]},{"title":"Get me a real doctor! This movie rocks!","rating":9,"date":"8 January 2001","review":"This film was hilarious.  It provided a somewhat comical view of the British club scene, which, if you really look at it, is a funny thing.  The characters in this flick were so realistic to those of us who watched here at my place that it was like watching a movie about ourselves.<br><br>There were a few pivotal scenes which really made this movie work: the getting ready scenes; the \"Get me a real doctor\" scene; the white background scene showing each character in a total state of being wrecked, ending with the infamous line \"what was i saying?\" and the comedown-sunup scenes.  I have lived these moments myself and found myself laughing hysterically at my own ridiculous behaviour.<br><br>I can't give this movie a 10 because it doesn't measure up to Groove, which I thought was out of this world, but it certainly has its moments.  The mise-en-scene and the camera work is superb, the special effects are well worth mentioning, and the acting is fantastic.<br><br>After waiting a long time to see this film, I am glad to say that I was not disappointed.  I hope to see more from the writer/director in the future.","user":"e-girl","rank":[52,61]},{"title":"Accurate portrayal of club culture, the highs and the lows","rating":4,"date":"4 October 2004","review":"Making a film about the 'chemical generation', those who live for the weekend, must have been a very hard enterprise. It would have to accurately reflect the lives and experiences of 'clubbers' and also appeal to a wider audience. Human Traffic just about achieves that.<br><br>It is certainly spot on in with it's observations and in it's accuracy. It's obvious the filmmakers have 'been there and done it'. If you are or were once like the people in this film, than there is so much to relate it. It's all there, often depicted humorously but not condescendingly. The fake euphoria of being on 'E'[\"in the end ,I just want to be happy, yeah ,that's it.....hang on, what the **** was I talking about?\"]. The monged conversation at 4 am which seems deep and meaningful but is basically rubbish [ Star Wars being about drugs!]and gets more and more incoherent. Exchanging pleasantries with someone you only see in pubs and clubs and really can't stand. 'Coming up' suddenly at the same time as someone else and mumbling to each other what you're 'on' at the speed of light. Reminiscing how it was better in the 'old days' and is now too commercial and widespread. Doing it all for the first time and going off with a bunch of dodgy geezers who are suddenly your best mates. The thrill of finding the after party. The depressing, inexorable sense of returning to the reality.<br><br>The film's attitude to drugs is commendable, drug taking is simply something the characters do, and that's all. Nobody dies or is seriously ill ,and yet there is a sense that it doesn't really lead anywhere. \"After all ,we'll not going to be doing this for ever, are we\" says one character at the end.<br><br>The film falters a little when depicting the lives of it's protagonists. For many scenes, director Justin Kerrigan uses a kind of 'heightened reality', for instance in a scene when a character comments on how the workers in a fast food place are like robots and for a moment they 'become' actual robots. This approach does not always work, and it's a shame since the characters are all the sort you could expect to run into on a Friday night. We do care a bit about their respective lives and problems, but we don't really get to know the female characters properly, and what is really the main thrust of the plot, the blossoming romance between two of the main protagonists, is dwelled on too much and is somehow unconvincing,if sometimes quite sweet. The acting is generally OK if not great.<br><br>Human Traffic is not as important a film as, say, Trainspotting, which despite being about heroin addicts seemed to speak to a generation. Nonetheless, it's a truthful depiction of an element of society which films and TV either ignore or condescend to. Incidentally ,there are two versions, the director's edit and the later producer's edit. The latter, which cuts some footage, changes some music and adds some silly CGI, is inferior to the former.","user":"DrLenera","rank":[46,54]}]