[{"title":"On The Resilience Of The Human Spirit","rating":9,"date":"12 February 2001","review":"A reclusive author, whose only published novel won the Pulitzer Prize, becomes the mentor of an underprivileged and talented sixteen-year-old in `Finding Forrester,' directed by Gus Van Sant and starring Sean Connery and newcomer Rob Brown.  Young Jamal Wallace (Brown) is a star basketball player in his neighborhood, and-- unbeknownst to his peers-- also has a gift for writing.  The acceptance he needs from his friends, however, that need to `fit in,' is derived from playing ball; yet his heart is in his writing. But he knows that within the limited confines of his environs his skill with the written word means next to nothing in regards to his future, and he sees basketball as the only viable means of doing anything worthwhile with his life.  That is, until one day circumstances bring him into contact with William Forrester (Connery); and it's an encounter that ultimately changes the direction of his life forever. \tWorking from an intelligent, well crafted screenplay by Mike Rich, Van Sant establishes the milieu within which the story will unfold with his opening shot:  A black youth setting the stage in rap.  It's clever and effective, and the contrast between the rap at the beginning and the song at the end not only frames the film but underscores the impact of the story, as it succinctly encapsulates the changes in Jamal's life.  As he did with `Drugstore Cowboy' and `Good Will Hunting,' Van Sant successfully captures the essence of a particular culture and how those living within it relate to those apart from it.  It's a study of human nature and the levels of diversity of which our society is comprised, and Van Sant does it exceedingly well. \tAs far as performances go, Connery makes the most of one of his best roles in years.  Perfectly cast as Forrester, he lends an adamant toughness to the character initially, then slowly and subtly allows the vulnerability that lies beneath the gruff exterior to surface.  It makes for a well-rounded, complete portrayal, as we see not only his iconoclastic leanings, but the very human and caring side of the man as well.  And it's Connery's superlative performance, through which he conveys the complexities of the character so well, that illuminates the true depth and multi-faceted dimensions of Forrester; it is not only memorable, but worthy of an Oscar. In his motion picture debut, Brown takes the screen by storm; a storm that is at once gentle and discerning, yet endowed with a strength born of it's own momentum.  With a manner reminiscent of Cuba Gooding Jr. in `Boyz N the Hood,' he has a natural acting ability that commands attention, and if his performance here is any indication of his talents (which obviously it must be), then it is safe to say that the cinematic world has certainly just been enriched by his presence. \tThe supporting cast includes F. Murray Abraham (Professor Robert Crawford), Anna Paquin (Claire), Busta Rhymes (Terrell), April Grace (Ms. Joyce), Michael Pitt (Coleridge) and Michael Nouri (Dr. Spence).  An uplifting example of deriving hope from hopelessness, `Finding Forrester' is an entertaining and moving testimony to the resilience and depth of the human spirit.  It's a film that will stay with you long after the screen has gone dark, for there is much here to be savored and embraced; a film too good to be allowed to let pass you by.  I rate this one 9/10.","user":"jhclues","rank":[73,77]},{"title":"Great Film","rating":10,"date":"10 February 2001","review":"As a person who enjoys good movies, as well as reading and writing, I loved this film, and would see it again. Some may accuse it of being formulaic, but I feel that there is just enough unexpected-ness in it to keep the audience interested.  I would hope that the apparent similarities to the director, Gus Van Sant's earlier work, Good Will Hunting, do not dissuade anyone from seeing the film.  Any similarities are unimportant and do not take away from the fact that this is a good movie which stands alone as a deep film with an good plot. The script is very well written and all of the dialog appears real and natural.  It is a thought provoking drama, but it is not depressing or sappy, as all too many dramas are.  At the same time, it does not give the impression of simply being a feel-good movie. Also, although there are several humorous lines in the movie, they do not rely on cheap puns or slap stick humor.<br><br>William Forester once wrote a Pulitzer Prize winning book, but now is a recluse, hiding from his fame, who never leaves his book-filled apartment in the Bronx, but spends his time reading and bird watching, as well as watching the teenagers of the neighborhood play basketball in the park outside his window.  Jamal Wallace is one of these teenagers.  He hides his love of reading, and his brilliant writing skills, and chooses instead to gain the acceptance of his peers through his skill at basketball. A prep school has offered Jamal a scholarship because of his high test scores, and their need to win a basketball championship.  The two characters meet, and Forester becomes a sort of teacher/mentor, but both learn many things from each other.  Symbolism is important in this film, and it makes many good points about people, how we relate to each other, and how we deal with the difficulties of life.<br><br>The movie stays away from any violence and sex.  It is rated PG-13 because of brief strong language and sexual references, but even these are few, and not over done, using only what is necessary to create real characters and setting -- a refreshing difference from many films that are now being made. The message of the film is good and moral, but it was wonderful to see a serious film staring a young black person that does not hit you over the head with messages of racial tolerance.<br><br>One of the surprises in the film is the great soundtrack.  It is mostly Jazz songs from Miles Davis and others, which seems well suited to the mood of the movie and to the setting, another well done part of the film.  The final song, a medley of \"Somewhere Over the Rainbow\" and \"What a Wonderful World\" is great.  I was happy that this movie had refused to do what many recent movies have done in capitalizing on a soundtrack and trying to use or create hit pop songs in a movie.  It also stays away from sappy and unnecessary orchestra music that is often used to try to create emotion in the audience. This movie does not need to resort to tricks like this in order to make you feel for the characters.  Another happy surprise is a cameo from Matt Damon.<br><br>\nThe acting is wonderful, particularly from the experienced Sean Connery, playing the title character, and from newcomer Robert Brown, as Jamal. Even the more minor parts in the film, such as Jamal's older brother, played by Busta Rhymes, and Jamal's friends and teachers are well-acted.  Anna Paquin is well suited for her role as Claire, a rich girl from the prep school that Jamal transfers to.  The two seem to make a connection, but a romantic subplot is not pursued very far in the film.  I found this a refreshing change, and one of the factors that kept the movie from being too predictable, as well as much more realistic.  Real life romances do not usually happen the way they often do in films.  A disappointment was the character played by F. Murray Abraham.  Although well acted, there is a complete lack of character development, and the teacher-that-gives-the-brilliant-student-a-hard-time stereotype is hard to ignore.  Despite this one shortcoming, this is an excellent film.<br><br>As the film ended and the credits began to roll, I noticed that no one in the theater got up to leave, as is usually the case in theaters.  The audience remained seated until the credits and music had finished, and the lights came back on.  It is just that kind of a movie.  I would defiantly recommend it to anyone wishing to see a mature and thought-provoking film that is entertaining and enjoyable to watch, and will leave you feeling inspired.","user":"kate987","rank":[108,118]},{"title":"Wonderful movie with a stunning performance from Connery","rating":10,"date":"26 December 2004","review":"I'd heard a little about this movie before and entered into watching it merely expecting to see another of Sean Connery's typical Connery performances. Don't get me wrong, there's nothing wrong with that, he is a very good actor, but he always plays himself. Other than that, I had no inclination what the story was about so there was surprise from the outset seeing that the movie was starring Busta Rhymes and was set in the Bronx.<br><br>How surprised I was as this gentle and perfectly paced tale brings together two people who share a common love for writing, one is a faded writer who once had success, and the other is a new talent who faces so many obstacles in his path to let his talent shine.<br><br>There are similarities to other films such as Dead Poets Society, but what captures the viewer and their imagination is the restraint and the simplicity. There are no great acts or contrived emotionally charged plot twists, this is real and it's character driven. You believe in the characters, the acting is so natural and understated you are easily drawn into the movie and the characters lives, and it's hard to break free. Choices and actions are small, compassionate, and you can relate them to real life.<br><br>The relationship between Forrester (Connery) and Jamal (Rob Brown) is superbly played with Brown holding back perfectly until the scene where his restraint fails, and Connery giving one of the most emotive and complex performances I have ever seen. His performance is simply stunning and totally off of the Connery mould. Watching his face as he struggles with demons long past was extraordinary.<br><br>Overall the story is very well written, and doesn't fail to pull you along with the emotional journey and yet never hit the twee button. You can feel the passion that Connery has for writing, and see the complexity of emotions as he wants to help the boy but gets pulled back by hidden problems. Problems which slowly reveal themselves and get shared and dealt with in the most natural of ways, again never falling foul of an emotion overload.<br><br>It's warm, uplifting and an inspiring story and I recommend it to anyone. I really can't be vocal enough about the stunning performance by Connery, and the matching performance by Brown. Even Rhymes shows that he has talent.","user":"Rich B","rank":[57,61]}]