[{"title":"A gentle and moving bittersweet comedy","rating":9,"date":"10 November 1999","review":"A beautifully understated story of ordinary people living their everyday lives through the trying times of Christmas '67 and the Prague Spring during the run up to the Soviet invasion. While the setting has be caught with stark and depressing realism, the film is perfectly balanced with a gently comic and bittersweet observation of the families and their relationships as they struggle through events from the mundane to the tragic. Personal loss, both of freedom and of loved ones, and the way life still manages to go on has been captured with deceptive ease and without resorting to the usual cliches and predictable attempts at closure that so often seem to pollute western cinema of this type.","user":"andyruff","rank":[22,24]},{"title":"Powerful and human drama","rating":10,"date":"25 September 2000","review":"Watching this movie at the Wellington International Film Festival, surrounded by emotional ex-patriot Czechs is an experience I will always remember and treasure.<br><br>The film details life during the Prague Spring, leading up to the Russian invasion. The humor is very Czech, and splendidly so. The ending reminded me of exactly why the Politician is the lowest form of life on the planet.<br><br>Go see this movie wherever and whenever you can.","user":"Olhado","rank":[43,50]},{"title":"Very Czech film","rating":10,"date":"18 February 2006","review":"Now THAT is a Czech film. While Kolja, a 1996 Czech film was specifically edited by the British co-producers to strip it of some very Czech elements which were culturally hard to understand for foreign audiences, this one is the real thing. Figures that while Kolja was showered with foreign prizes incl. the Oscar, this one got nothing significant abroad as far as I am aware. No matter, this is a seriously funny and sad film which will tell you a lot about the Czech sense of humour. Many passages sadly won't be that accessible without knowing the culture and history well, and inevitably, lots gets lost in translation, but you may still find it satisfying.","user":"lk1918","rank":[23,26]}]