[{"title":"When Babies Grow Up To Be Cowboys","rating":6,"date":"15 November 2008","review":"As a native New Yorker I always look askance at The Cowboy Way because that last chase scene involving our heroes Kiefer Sutherland and Woody Harrelson is geographically impossible. Anyone who has some knowledge of the New York City Subway System can tell you that. Still The Cowboy Way is rollicking good entertainment.<br><br>The rollicking part is courtesy of its two leads. They play a pair of feuding rodeo cowboys. Sutherland is mad at Harrelson because of his general irresponsibility. But a good friend of their's is in trouble and Sutherland's got to put aside his attitude about Harrelson in order to help out. Harrelson of course doesn't make it easy.<br><br>Tomas Millian has paid money to smuggle his daughter Cara Buono from Cuba and now the coyotes are holding him up for more. He goes to New York and gets killed for his trouble. When Harrelson and Sutherland discover that, they're not about to wait for regular law enforcement to do its thing. That's just not The Cowboy Way.<br><br>As a sideline fashion designer Marg Helgenberger thinks Harrelson has possibilities as an underwear model and maybe she'd like to explore that with him. They also have a wonderful scene at the Waldorf Astoria hotel and restaurant where these two think its just your basic motel, a little upscale. <br><br>The guy who carries the serious part of the film is villain Dylan McDermott and he's as serious as a crutch. But apparently he's starting to listen to his crotch before his head where Buono is concerned. It's a weakness of the film, because when the good guys are closing in, McDermott probably could get away if he wasn't dragging Buono along with him. <br><br>Of course the highlight for me is that wonderful scene at the Central Park Petting Zoo where Sutherland and Harrelson teach McDermott henchman Luis Guzman the way Pancho Villa used to get information from people not willing to give it up. It involves a weaning calf and it's hilarious and a little frightening to the male of the species.<br><br>Despite its story weaknesses, The Cowboy Way is one hysterical film and you'll have a good time seeing it. And since this film is about rodeo cowboys, this review is dedicated to the recently retired Justin McBride of the Professional Bullriders. A man definitely dedicated to The Cowboy Way in his sport and in life.","user":"bkoganbing","rank":[9,9]},{"title":"Great fun!","rating":7,"date":"7 April 2000","review":"This movie is great for a fun night in if you want some light-hearted entertainment. The actors do they job well, they are believable as Sonny and Pepper. They make a good acting team and the storyline is entertaining, but not great and you don't have to solve any difficult plots, which i like to do. Despite this, it is worth watching,it has lots of fun moments, but really it is only for cowboy and western fans.","user":"young gun","rank":[17,20]},{"title":"Keifer & Woody romp","rating":7,"date":"24 September 2002","review":"Catching up on Keifer Sutherland films since being mesmerized by his \"24\" series.  This one is lots of fun, as the two cowboys head from New Mexico to New York City to see what happened to their friend, who came from Cuba and is trying to get his daughter to the states.  He does but there are complications.  The boys are drawn into the sweatshop force labor problem and other unsavory doings.  But their bravado and guts save the day. Nothing earth shattering here, but a good ole boy buddy film with two likable guys.","user":"Ishallwearpurple","rank":[12,14]}]