[{"title":"An interesting sequel to \"Sister Street Fighter\" (1974)","rating":8,"date":"26 January 2011","review":"With its funky 1970s music score and outrageous fighting sequences, 1974's \"Sister Street Fighter: Hanging by a Thread,\" a sequel to \"Sister Street Fighter\" which had been released earlier that same year, is an interesting if not entirely successful follow-up to the previous film. It is worth noting that the sequel concerns the return of Koryu Lee (Etsuko \"Sue\" Shihomi), a half-Japanese/half-Chinese Karate powerhouse who travels from Hong Kong to Japan to investigate the disappearance of a wealthy man's young daughter. As she digs deeper into the mystery, she uncovers a deadly diamond smuggling ring and the powerful gangsters behind it. Directed by Kazuhiko Yamaguchi (who also directed the first film), the fights are fast, furious, and bloody - everything a good Karate film from Japan should be. One of the reasons the film works so well is because of the performance and fighting prowess of Etsuko Shihomi. A student of Japanese martial arts sensation Sonny Chiba's action school, Shihomi more than holds her own against the numerous baddies standing against her. She's also very easy on the eyes - yes, she is quite a cutie! But don't let that fool you: she can kill you twice before you knew what hit you. It's interesting to note that some bad guys make the mistake that just because she's a girl, she can't fight, or she's weak, or both. Well, as \"Sister Street Fighter\" and this film prove, anyone who makes that assumption is sorely mistaken, and you'll wind up on your back on the floor unconscious for making such an arrogant assumption.<br><br>8/10","user":"dee.reid","rank":[3,3]},{"title":"Etsuko Shihomi returnswithout Sonny Chibain SISTER STREETFIGHTER 2","rating":28,"date":"28 January 2008","review":"SISTER STREETFIGHTER: HANGING BY A THREAD (1974, aka SISTER STREETFIGHTER 2) is a follow-up to SISTER STREETFIGHTER and has Hong Kong resident and martial artist Koryu Lee (Etsuko Shihomi) coming back to Tokyo to track down a female friend, Birei, who's been kidnapped by diamond smugglers. It's an early '70s Japanese martial arts crime film with abundant nudity, bloodshed, torture, outlandish fashions and a peculiar criminal-dominated alternate universe where there are no cops and the gangsters avoid guns but hire martial artists--the more exotic the better--to do their fighting for them. It's all beautifully photographed on dramatic locations and garish sets. One fight takes place amidst empty racetrack stands and another takes place in a railroad yard and has the heroine battle an opponent atop a moving boxcar. There's even a fight among logs floating in the water at one point. As over-the-top as Japanese films sometimes got in the 1970s, they were generally well-produced. My only complaint on that end here is the over-reliance on hand-held cameras in many of the fight scenes.<br><br>The plot doesn't bear up well under scrutiny. There are far too many convenient coincidences and the heroine, Koryu, finds her way to the villains' various lairs way too easily. There are some off-putting moments detailing the surgical removal of diamonds from nude women's rear ends, as well as a brutal torture session directed at Koryu's sister, who just happens to be involved with the diamond gang. <br><br>The real reason for martial fans to watch this, of course, is to see star Etsuko Shihomi giving Hong Kong kung fu divas Angela Mao and Chia Ling (Judy Lee) a run for their money as the most dynamic female martial arts stars of the era. The protégé of Sonny Chiba, who popped up in several of her films, Shihomi fights with similar intensity, concentrating on survival and hitting her targets with damaging blows rather than engaging in the more showy, performance-oriented fighting styles of Hong Kong's female stars. (Granted, Shihomi's best films don't hold a candle to Angela Mao's best films, but that was never exactly Shihomi's fault.) There are some far-fetched moments here, including a fight in mid-air that causes the eyes to roll (literally!), but for the most part, Shihomi takes on all manner of formidable opponents with plausible ferocity. <br><br>Shihomi (who was sometimes billed in American release versions as Sue Shiomi) is aided in the action by Yasuaki Kurata, who takes on the Chiba role here and lends key male support. Kurata made a name for himself in Hong Kong kung fu films, including HEROES OF THE EAST, LEGEND OF A FIGHTER and FIST OF LEGEND, and it's nice to actually see him wreaking havoc in a Japanese martial arts film for a change.<br><br>The film follows the formulaic structure of the first film, changing the endangered sibling from a brother there to a sister here who wasn't even mentioned in the first film. The fights were more frequent and more imaginatively staged in the first film, which also benefited from the presence of Chiba himself in some key fighting sequences. (Chiba, of course, began this whole cycle with his own run of STREETFIGHTER films.) Etsuko and Kurata returned for RETURN OF THE SISTER STREETFIGHTER, which suffered from a lower budget and shorter shooting schedule, resulting in hastily shot action scenes and an even more ludicrous plot.","user":"BrianDanaCamp","rank":[3,4]},{"title":"Follows the formula","rating":6,"date":"11 January 2020","review":"It starts when our girl takes pause from eating her apple to interfere in a gang killing. The guy she saves dies anyway. He was a police officer who gave her evidence. It all leads to diamond smugglers and other stuff so she is off on her mission.<br><br>From the start the bad guys are trying to kill her. Nothing is realistic about that goal. All of the attacks against her are showcased as demonstrations of various martial styles. The fights are even labeled by style. Nevertheless, all the styles look the same. Many weapons are also used. There is also the expected acrobatics and trampoline stunts.<br><br>Our girl, Etsuko Shihomi, as Koryu, fights without Sonny Chiba's help in this movie. Kurata does have a big fight scene though.<br><br>Overall, the movie follows the formula of taking the first movie and doing the same things a bit bigger and better. I rate it a tad above average for the year and genre.","user":"ckormos1","rank":[0,0]}]