[{"title":"Fascinating, but heavy going for those not inclined towards philosophy.","rating":24,"date":"24 September 2002","review":"'The Addiction' is one of the most original vampire movies ever made. In fact, I can't think of another one quite like it. Abel Ferrara has made some strange and disturbing movies in his time, and this one is as strange and disturbing as any. Lili Taylor ('I Shot Andy Warhol') is brilliant as a troubled, soul searching philosophy student who has an unexpected and life-changing encounter with a mysterious stranger ('Cop Land's Annabella Sciorra). Dark, deep, sometimes blackly humorous, and frequently too obscure for its own good, this can be heavy going at times, but is never less than interesting. Christopher Walken, who did some superb work for Ferrara in his classic 'The King Of New York', has only a cameo here, but what a cameo! Walken is terrific and unforgettable. The rest of the supporting cast includes 'The Sopranos' Edie Falco and (briefly) Michael Imperioli, Paul Calderon ('Girlfight'), and Kathryn Erbe ('Stir Of Echoes'). This is a unique movie that will be appreciated by those with an open mind and preference for \"difficult\" viewing. Recommended.","user":"Infofreak","rank":[40,43]},{"title":"Exceptional low-budget philosophical horror film.","rating":9,"date":"22 August 2002","review":"Abel Ferrara's moody, allegorical vampire tale makes fascinating and pointed statements on sin and redemption, spirituality and the nature of good (there's precious little of it) and evil (no one is safe from it). And unfortunately, but not surprisingly, it was relatively ignored in America.<br><br>Lili Taylor gives a brooding, glib and haunting central performance as Kathleen Conklin, a New York University grad student who is pulled into an alley and bitten by a seductive female vampire (Annabella Sciorra), from which she emerges uncontrollably drawn into a world of violence and insatiable cravings for human blood. Ferrara's irredeemable urban hell landscape is more immediate and frightening than a million Transylvanias and by contrasting Taylor's \"addiction\" to the horrors of the past (war atrocities, the Holocaust) and present (heroine, AIDS), the film has more bite and impact than any fang-bearing, gore or special effects could even attempt to muster up. Nicolas St. John's intriguing philosophical screenplay and Ken Kelsch's gorgeous black and white photography (creating a world solely of light and dark, which is a key element in the plot), are not to be overlooked either.<br><br>Call it pretentious for the philosophy references (Sarte, Nietzche...) if you want, but this highly intelligent and disturbing low-budgeter is one of the most accomplished and well-thought out horror films I've ever seen. Don't let over-hyped, attention hogging Hollywood productions like BRAM STOKER'S Dracula or INTERVIEW WITH A VAMPIRE keep you from seeing it.","user":"capkronos","rank":[51,56]},{"title":"Am I the only one?","rating":9,"date":"24 November 2000","review":"SPOILER ALERT Am I the only one who \"got\" this film?  I don't usually enjoy movies shot in black and white, nor \"artsy fartsy\" movies, but this one really had something to say of great significance (stated explicitly in the final words of the film), and it was also entertaining (at least I found it to be).<br><br>I don't agree with the general reviewer's attitude toward the holocaust scenes.  The central message of the film does NOT deny reality to suffering, but explicitly acknowledges it (the fact that the holocaust was \"real\" and vampires are \"not real\" is entirely beside the point).  Suffering IS real, and is the common thread linking the vampire/addict and the holocaust victim.<br><br>Has anyone else noticed that the central philosophy of the movie is not nihilism, but nondualism?  How the endless cycle of pain/pleasure (also known as \"addiction\") controls all of us to one extent or another, and how all pleasure takes place against a background of pain -- an endless cycle of suffering for most of humanity?  The film also examines the notion of \"free will\" in detail, and ultimately concludes that \"my will against yours\" is the cause of much \"evil.\"  Nondualism concludes that \"free will\" is an oxymoron, and denies reality to the concept of personal volition.  This movie reaches much the same conclusion.<br><br>Ultimately, the main character's spiritual redemption at the end of the movie demonstrates nondualism, not nihilism (a nihilistic ending would be the suicide or death of the main character in a particular violent fashion). Yet she is redeemed, and realizes that annihilation of \"self\" (the ego, will, conflict, separation, addiction, the cause of suffering) is the only true path of redemption.  This is a spiritual, non-dual message.<br><br>If anyone who hasn't heard of the perspective of nondualism is curious, try your favorite search engine and searching on \"nonduality\" and/or \"advaita.\"<br><br>Rating: 9/10","user":"The_Core","rank":[20,21]}]