[{"title":"\"I was born to murder the world.\"","rating":6,"date":"6 September 2002","review":"\"There are two worlds of magic.  One is the glittering domain of the illusionist.  The other is a secret place, where magic is a terrifying reality.  Here, men have the power of demons.  And Death itself is an illusion.\"<br><br>Clive Barker's Lord of Illusions is a terrifying glimpse into another world in which few have traveled.  Those who have been there, didn't like what Barker had to show them.  I wasn't even impressed with it upon my first viewing.  I simply forgot it, lumped it in with the other, countless horror films I've seen and will never see again.  However, I recently rediscovered it...and was completely awestruck.  The theatrical release did not do the film justice.  It dropped priceless minutes of film and much need footage. I strongly urge you to seek out the uncut director's version on DVD format. This is a very big horror movie, and a hidden treasure at that; hidden under a brilliant detective story and surrounded by film noir.  But I promise you there is a horror spectacle buried under there.  It may be a little slow going at times...but all that build-up makes whatever happens all the more effective.  Lord of Illusions is an unbelievably awesome, genre-twisting experience (and was never bastardized by a sequel).  Everyone needs to take this journey again.  Please Mr. Barker...make another film.<br><br>Dorothea:  \"What the f**k are you?\"<br><br>Nix:  \"A man who wanted to be a God...and changed his mind.\"","user":"Backlash007","rank":[49,57]},{"title":"Director's Edition is the best (Spoilers)","rating":10,"date":"15 March 2004","review":"For those who haven't seen the original theatrical version of \"Lord of Illusions\", you might want to check out the extended version. <br><br>Harry D'Amour (Scott Bakula) is a private detective with a problem: He has a dark side. It seems that a lot of cases turn ugly (One involving an exorcism). Offered an opportunity to get away from the insanity, he's offered a job tailing someone involved in insurance fraud. However, things REALLY turn ugly when he stumbles upon a guy being used as a pincushion. What's the reason behind this?<br><br>Seems that years ago, a cult leader called Nix (Daniel Von Bargen) had very spooky powers and was just about nuts. After kidnapping a young girl, some of his followers including Mr. Pincushion and Swann (The very underrated Kevin J. O'Connor)put Nix out of his misery, binding him and burying him deep in the earth. Now most of those that killed him are winding up dead. Swann, who is now a popular illusionist, winds up dead in a horrific accident during one of his shows, with his wife Dorothea (Famke Janssen) in attendance. D'Amour is soon drawn into a mystery in which things are not what they appear and people may or may not be dead.<br><br>In the Director's Cut of the film,You have a better understanding of D'amour's dark side, plus you get to see a little more into the cultists, how their devotion to Nix is without question (You actually see them headed to Nix's resurrection after they killed members of their family!). The deleted scenes are o.k. and you could sort of understand why they were deleted. Barker's commentary is a plus (Actually, I like when director's put their 2 cents on the makings of a movie.)<br><br>The part when Nix returns STILL creeps me out. Not in the manner of his return, but the blind devotion that his followers show him.<br><br>Anyway, rent this, or at least buy it. For Clive Barker fans, horror buffs, or just to have a good time on Saturday night.","user":"domino1003","rank":[34,39]},{"title":"Barkers Best","rating":10,"date":"17 November 2005","review":"Title: Lord of Illusions (1995) <br><br>Director: Clive Barker <br><br>Cast: Scot Bakula, Franke Jensen, Kevin J. Oconnor <br><br>Review: <br><br>Clive Barkers takes us in deep into the world of magic and horror with what in my opinion is his best film...Lord of Illusions.<br><br>The story is about this religious cult whos leader Nix promises his followers eternal life. Swann, an ex member of the cult, gets cold feet and decides he wants out of the cult of freaky people and decides to eliminate the cult and its leader Nix. He manages to stop Nix and bury him....but is he dead? Many years later after these events Swann has become a David Copperfield type of magician winning big money. But suddenly some people are after him and there's rumors that Nix...the cult leader he laid to sleep might be returning for revenge on those who restrained him. Swann included.<br><br>The good thing about this movie for me is that it takes us into this world of magic, demons and religion in a very credible way. Barker handles things properly in this film by taking us into fantastic territory but with a touch of realism. As if it all could in fact be true. Thats the feeling I got while watching this film. And ultimately thats what makes the film so effectively creepy.<br><br>Nix is a great villain and I never for once felt I was watching some actor playing a by the numbers villain just for the kicks of it. Daniel Von Bergen as Nix delivers a great and evil performance. He uses anyone and everyone, he is selfish in his quest for ultimate knowledge and power over the supernatural and will do anything to have it. The guy is pure evil...and when he is about to be re awakened you almost feel sorry for the poor dopes who are doing it.<br><br>Another one of the movies assets is that it is done in the fashion of an old detective flick, with Scott Bakulas character Harry D Amour as the grounded on reality Detective who is constantly being confronted with the fact that this world is filled with things that we know nothing about. We see the film through Harrys eyes as he plunges himself deeper into the world of magic and Illusion. This is a smart lead character and cool thing about it is that you don't feel like its a bunch of teenagers making mistake after mistake, this guy knows what he is doing, he is a detective taking a full plunge into the dark world of Nix's religious cult.<br><br>But by far the coolest thing about this movie is its story. Barker carved up a fine spooky tale. Something to really scare you. The story is complex, and keeps you interested all through out, like a good mystery should. Not only that, but he directed the film with some real style. The movie just looks beautiful in everyway. A really good example of this is Swanns Illussion show in which he performs his \"Last Illusion\". Great sets and music in those sequences. Speaking of the music, as is the case in most of Barkers films, the music elevates everything to another level of grandiosity. You get this feeling that you are watching something epic and forbidden.<br><br>All in all, I would say that no doubt this is Barkers finest film to date. Its got a great involving story, good performances a great and memorable villain and a feeling of realism even though we are dealing with magic and Illusions. Barker is a master at weaving fantastic and dark fantasies, this my friends is his best one, go check it out! Rating: 5 out of 5","user":"spacemonkey_fg","rank":[45,58]}]