[{"title":"Underrated post-modern take on action movies","rating":7,"date":"29 June 2002","review":"Highly underrated Arnie movie. <br><br>Is it a comedy? An action movie? A spoof of the entire action movie genre? Well, it might be all of them, and more.<br><br>This movie could be interpreted in several ways. In it, Arnold is spoofing himself (or his on-screen persona, anyway) and the genre of action movies in general. <br><br>What's more, it's a story within a story, making an audience member part of the story, giving the whole thing a post-modern twist. The movie is full of genre in-jokes and self-references, making fun of many of the clichés - while at the same time referring to other films, actors, and even other genres, making this sort of a celebration of the entire film business.<br><br>\nOn the other hand - in case you don't care about all of this - as an action movie in itself, it's still very entertaining. If you like Schwarzenegger action movies, you'll like this one as well.<br><br>Don't let anyone tell you this is a \"bad movie\". See it for yourself, and make up your own mind.","user":"Sentinel-15","rank":[274,297]},{"title":"quick reviews!","rating":8,"date":"23 May 2004","review":"Another underrated movie, and one which few people understand, or try to. This is a spoof of action movies, primarily those starring Arnie and Stallone, ones which director McTiernen has made a living from. That said, the action, stunts, effects are good, the cast, especially Arnie, ham it up as much as possible, and the plot is pretty clever. Tons of in-jokes make this an entertaining film, and I'll admit that's all it is. But that's all it is trying to be. Don't whine to me about artistic merit, character development, internal meditations on life and all that crap-I have those movies on my list too. It's an action movie, where the bad guys are supposed to die, cars are meant to explode when scratched, the good guy is untouchable, and it knows it. 8 out of 10","user":"malkane316","rank":[227,249]},{"title":"An Unappreciated Gem","rating":10,"date":"20 August 2006","review":"We all have that one movie we absolutely love but of which no one else seems to think very highly. My 10/10 rating for LAST ACTION HERO signals that this is mine. But before you laugh me out of IMDb, allow me to explain why I think this notorious bomb is in actuality an unappreciated gem.<br><br>The central highlight of LAST ACTION HERO is the plot. I've seen this film three times, and in each instance I've been completely drawn into the notion that there exists a magical Movieland where we too could travel if only we had a magic ticket. It's sort of every film buff's fantasy, one that we get to enjoy through young Danny Madigan(Austin O'Brien) as he meets up with clichéd action hero Jack Slater (Arnold Schwarzenegger, of course). It's priceless to see the real-world youth interact with the silver screen community and its cartoon cats, 555 phone numbers, and impossibly perfect women. It's equally entertaining when Slater comes into our world, discovering that he can't effortlessly smash his fist through a vehicle window or blow up his enemies with ease. Love it or hate it, you have to admit the story gets high marks for originality.<br><br>The writing is another highpoint, convincingly mixing so many great elements. Those behind the script nicely exploited the vast potential within the storyline. LAST ACTION HERO is on the one hand a satire of so many action films in which the likes of Schwarzenegger have straightfacedly starred. The oft-sequelized Slater chomps a cigar and wields bullets like confetti at a wedding, effortlessly taking out the bad guys and spewing witty quips. At another angle, the movie is a lighthearted romp, with one-liners and plenty of pokes at Hollywood. From another viewpoint, it's a dramatic piece, with Danny struggling to make it through an awkward age and Slater coming to grips with his unreeled existence -- and that in the real world, the bad guys can and do win. Nowhere along the line is it Oscar-caliber stuff, but it is entertaining.<br><br>There are other things to like about LAST ACTION HERO. The action is well-paced and well-placed. The acting is more than up to par, with O'Brien and Schwarzenegger great individually and as a tandem. The humor is sharp and effective, with Arnie often hilarious in his self-deprecating ways.<br><br>Perhaps much of the negative criticism directed LAST ACTION HERO came from those who didn't understand what it was trying to do. This was never meant to be another one of Arnie's shoot-'em-ups, lame attempts at comedy or even a family film. It was just meant to be fun to watch. And that's what matters most in any film. There are things about the film that don't work, but there are things about THE MANCHURIAN CANDIDATE that don't work, either. All that really matters is, Are we entertained? On that note, LAST ACTION HERO delivers.","user":"ReelCheese","rank":[188,207]}]