[{"title":"Not a knee slapper but fun to watch","rating":28,"date":"28 June 2003","review":"If you like Kirstie Ally you will enjoy this movie. You wont go away any smarter than you were before, but that isn't what I watch movies for. It is about a repressed wife (Kirstie) of a doctor who is more married to his family than to her. Her irrepressible sister (Jamie Gurtz) convinces her that she should have an affair to spice up her life. When she follows that advice it sets off a chain of events that, if you have any sense of humor at all, will bring on the chuckles. I would recommend this picture to anyone wanting to fill in an hour and a half with some light and uncomplicated entertainment. 6/10 would be about right for the genre.","user":"DPerson626","rank":[8,9]},{"title":"I liked it.","rating":14,"date":"14 February 2004","review":"Sibling Rivalry is one of those typical late 80´s early 90´s movie that came along. Some people saw it in the theater and some people rented it but never came a cult hit or a box-office smash and has now been forgotten.<br><br>\nThis does not mean that this movie is bad or movies of this sort are bad. On the contorary these films are actually quite entertaining and help you to get into good mood and this film falls into that category.<br><br>It is short, funny, exciting and has some great acting. Jamie Gertz and Kirstie Alley are great as the sisters and the supporting actors and actresses to a good job.<br><br>One of the things that bothers me is that they don´t show the cover that was used on the tape where I live where you see Kirstie Alley covering up her face with a blanket or a sheet. It is one of the all time greatest movie posters I have seen.","user":"boggajons","rank":[4,4]},{"title":"It's a chick flick!","rating":8,"date":"8 March 2011","review":"There are times when I just need mental popcorn, so If you are looking for a silly movie, this is it. I love this movie - it's got some great lines and Sam Elliott. This amazing cast is a trivia lover's dream: Rebecca from Cheers, Princess Leia, Beckett from Quantum Leap, Al Bundy, Muffy from Square Pegs, the husband from Maude and more. Bill Pullman is a great supporting actor.<br><br>I want Sam Elliott's voice to make love to me. To this day, there are times I remember that line \"It wasn't sex, it was GOOD!\"<br><br>I give it 8 out of 10 stars for it's genre: chick flick romantic comedy.","user":"whitneywilde","rank":[5,6]}]