[{"title":"\"Roy of the Rovers\", the movie","rating":7,"date":"28 April 2011","review":"Sean Bean stars as equally Sheffield United-mad brewery worker Jimmy Muir, a talented footballer who was let down by authority figures as a young man. After ten years working a dead-end job the frustrated Muir meets Annie Doherty, a pretty Irish love interest played by English actress Emily Lloyd, and soon after gets the second chance at his dream that such people always seem to get in these modern fairy tales. Yes, the formulaic plot is predictable and clichéd, but it is still enjoyable to watch and there are quite a few touching moments.<br><br>Funnily enough, although this is a football film I felt one of the strongest aspects of the film was the way it dealt with the personal relationships between Jimmy and his family members and friends: Pete Postlethwaite, for example, playing Jimmy's mentor Ken Jackson, puts in a strong, convincing performance, as well as John McEnery as Jimmy's abusive father Joe. A subtle side-track detailing Joe's past and its relevance to Jimmy's present is cleverly done and is to me an important part of the film's overall message.<br><br>Unusually for a sports film, the actual football is very well done. Director Maria Giese manages to do what so few directors have before or since in getting both the match itself and the atmosphere right. Every game portrayed is totally believable, from the park football at the beginning to the climactic final match at the end. Giese should really be commended here; each match is very different and she gets the overall feel of each one at least very close to spot on.<br><br>One criticism I will give the film, however, is its ending, which seems incredibly rushed and not really believable -- I know I said before that this is a fairy tale but watch the film and I'm sure you will see what I mean. I think that if you cut out ten minutes from earlier in the film and add a few more minutes of action just before the film's climax, the movie would work a lot better. It just seems very sudden to me, that's all.<br><br>Nevertheless, \"When Saturday Comes\" is an enjoyable watch, especially if you're a football fan. By no means brilliant, but still well worth the night in. 7/10.","user":"JP_Asher","rank":[7,9]},{"title":"Touching and poignant","rating":8,"date":"7 March 2002","review":"\"When saturday comes\" is a movie i wont forget easily.Its about courage and choices you take that affect your life.Its incredibly touching in some moments and makes you feel compassion for Jimmy Muir.He is a guy who wanted to play football,but was refused the chance as a teenager and instead has to go the grey worker road to support himself.Then suddenly the chance he wanted 10 years ago is right there ahead of him.But he feels what most of us felt when we first got our career breaks-he's afraid and unsecure.So he drowns himself in drinking and other excesses to try and make the fear go away.But it doesnt work that way.Instead he loses the chance he so much wanted and is back on the grey dirty road again.<br><br>The football field here has a symbolic meaning.Its the way out of his grey everyday,a bright road that leads away from it to a better life.Thats what makes this movie so poignant.For Jimmy Muir there is no other way to have a happy life.After losing both his brother and his girl,he is desperate and thinks life has no meaning anymore.But then he remembers what his brother said that symbolises the true spirit.That you have to give your best in order to succeed in life and never give in for your fear.<br><br>Sean Bean was great in this film.The recent years i have been admiring him more and more and this film is a good reason to do it.Pete Postlethwaite and Emily Loyd make a great supporting cast.This is a movie to remember.8 out of 10.","user":"akhilles84","rank":[7,9]},{"title":"Boys own wish fulfilment from the grim North of England.","rating":7,"date":"26 January 2012","review":"When Saturday Comes is directed by Maria Giese who also adapts the screenplay from a story by James Daly. It stars Sean Bean, Emily Lloyd, Craig Kelly, Pete Postlethwaite, John McEnery and Melanie Hill. Music is by Anne Dudley and Joe Elliott of Def Leopard fame, and cinematography is by Grant Cameron and Gerry Fisher.<br><br>Jimmy Muir (Bean) loves football, beer and women, his lads life is fun but certainly it could be better. Perhaps now that he is dating sexy wages clerk Annie Doherty (Lloyd) things are starting to settle in his life? More reason for optimism is that his football prowess has been noticed by Ken Jackson (Postlethwaite), the coach of Hallam FC, a man with friendly links to the manager of Jimmy's beloved Sheffield United. The world, it seems, is Jimmy's oyster, but problems at home, of the heart and socially, could scupper Jimmy's last chance for glory and life fulfilment.<br><br>Completely fantastical rags to riches sports movie with a keen eye for working class based social realism, When Saturday Comes is one of the better football based movies out there. But it is in a genre splinter that's hardly brimming with quality anyway. True enough to say it's treading familiar turf, and the ending holds absolutely no surprises at all. While the last quarter of film badly rushes to get to the \"punch the air moment\", to leave the picture with a whiff of emptiness. But it's the off field aspects of the tale that strike the better chords.<br><br>Jimmy Muir is basically a good guy, he's just caught in the vortex of a blokey lifestyle. Themes of a parental stymie and peer pressure add a bite to the screenplay, especially since the backdrop is one of a working class place that offers only the mine and the brewery for employment. Football is Jimmy's beacon of hope, it keeps him sane, but can he be all he can be? As a character study, with Bean adding grit and emotional guts, Giese's film is assuredly a winner, if only the football aspects weren't so choppy and amateurish, then the film would be better thought of in the sports movie sphere.<br><br>Led by Bean, the performances are up to a good standard, even Lloyd, who manages to get away with an iffy Irish accent because her portrayal of Annie is so spunky and grounded. The photography suitably paints it as \"Grim Up North\", and Dudley's score is melodic and sits nicely with the various emotive turns in the narrative. There's issues and goofs within, especially obvious to those who know about British football, like how old is Bean? Mel Sterland playing for Sheffield United? A home semi-final in the FA Cup? And there's that annoying rush in the last quarter, where everything is condensed without thought to building up expectation. But it shoots and scores most of the time, particularly when away from the football pitch. 6.5/10","user":"hitchcockthelegend","rank":[3,3]}]