[{"title":"fascinating slice of history","rating":10,"date":"10 July 2000","review":"Although ultraconservatives will undoubtedly dismiss `The Cradle Will Rock' as blatant leftwing propaganda, the rest of us will see it as a fascinating rumination on the intricate relationship that has always existed between politics and art.  Writer/director Tim Robbins, whose left-leaning sympathies are common knowledge in the film industry, has managed to create a screenplay of amazing complexity and depth, functioning on an enormous number of levels - political, historical, aesthetic, personal - without ever losing clarity and focus.  He has set up a dizzying array of characters, yet each one is fleshed out with enough depth and particularity to make him or her a vital part of the overall tapestry.<br><br>Set in the turbulent 1930's, Robbins' tale focuses on the National Theatre Company, an organization set up by Roosevelt during the Depression to provide out-of-work artists a vehicle through which to ply their trade and culture-starved audiences a chance to revel in the glories of live theatrical performances.  Unfortunately, it was also a time of great civil and political upheaval, with Communism and Fascism battling for supremacy abroad and many Americans divided along similar lines in their loyalties. With passions running deep, it was only a matter of time before many in the United States Congress began suspecting the NTC of Communist sympathizing - and it was a short road from there to the eventual dismemberment of the organization.  The film centers on the production of a controversial musical play called `The Cradle Will Rock' that portrays the glorious coming of unionism to a steel factory, a scenario that parallels the events in the lives of several of the characters in the film.<br><br>Given this fascinating historical background, Robbins has filled his film with a rich assortment of characters, from Orson Welles, as a fledgling young actor who sees unions as the ruination of artistic purity, to Nelson Rockefeller, as a well-meaning art patron who balks at the mural Diego Rivera has painted for him only after Rivera refuses to remove the image of Lenin from Rockefeller's monument-to-capitalism lobby.  In fact, the cast of characters is so enormous, with each one taking a crucial part in the narrative proceedings, that it is quite impossible to mention them all here. Suffice it to say that Robbins covers the social spectrum from industrialists and capitalists to union workers and the unemployed, from sympathetic patrons and patronesses to the little people eager to root out the seeds of Communism even at the expense of their own ostracism.  And not a one is uninteresting.<br><br>Robbins has assembled an all-star cast that reads like a who's who of contemporary movie acting (albeit of a non-blockbuster variety). Although at the beginning of the film, the casting of such familiar faces seems a bit disconcerting - leading to what critic Judith Crist refers to as the `hey there' syndrome, i.e. destroying the verisimilitude of a work by parading too many recognizable people before the camera - this technique actually helps the audience to differentiate the many characters who might otherwise pass by in a confusing and disorienting blur.  Hank Azaria, Ruben Blades, John Cusack, Joan Cusack, Cary Elwes, Bill Murray, Vanessa Redgrave, Susan Sarandon, John Turturro and Emily Watson comprise this truly fine cast.<br><br>Liberal as his leanings might be, Robbins is able to focus on the bitter ironies that abound on both sides of the political spectrum.  For instance, while Susan Sarandon portrays a Jewish ally of Mussolini, abandoning her pro-worker principles to act as his capitalist representative in the States, Ruben Blades plays a Diego Rivera who has subordinated - if only temporarily - his own revolutionary ethos to the power of the almighty buck.  Also, there is a certain paradox to the fact that, when the government has decreed the theater closed and thereby forbidden the premiere performance of the play, it is the actors' UNION that threatens the performers with firing if they carry out their plan to stage it furtively.  Robbins is even somewhat evenhanded in his treatment of the `enemy' - the rich capitalists and the anti-communist members of the theatre organization - portraying them with good-natured humor and pathos.  Joan Cusack, as a clerk at the employment office and Bill Murray, as a vaudeville ventriloquist, seem like decent people, only hopelessly misguided and lonely.  (Unfortunately, Murray's sudden change of heart at the end seems inexplicable and unmotivated).  As for the elite in the story, Robbins does a lovely job of spoofery at the end of the film; as the play is finally being performed at a nearby theatre - representing the triumph both on stage and in the world at large of the common man over the oppressive tyrants of industry - the tycoons, dressed in masquerade ball costumes of the 18th Century aristocracy and Catholic hierarchy, mull over their plans to retain control of the art world by bankrolling only those paintings depicting the scenes of utmost blandness and banality.  Thus, these men of corporate power are portrayed more as amusingly quaint pests than malevolent or malicious despots.<br><br>There is certainly no denying that `The Cradle Will Rock' is, at heart, a bit of a leftwing diatribe.  However, it is not a cruel or unreasonable one. And Tim Robbins' extraordinary skills as both a storyteller and filmmaker make this clearly one of the most interesting and impressive films of 1999.","user":"Buddy-51","rank":[55,64]},{"title":"Deserves more praise than it gets","rating":8,"date":"29 January 2004","review":"This may suffer from having a few too many plot lines and characters (Emily Watson, for example, is a role too far), but most of what's there is excellent. Bill Murray is as good as he has been recently in Rushmore and Lost in Translation, and the Cusacks are at their best. This is a film that lingers with you after you've seen it, and gives a fascinating insight into a turbulent time.","user":"heleno84","rank":[30,36]},{"title":"This Rocks","rating":5,"date":"5 November 2000","review":"Tim Robbins is a good actor. Not great, but it is clear in his acting that he has a passion for the theater. Now he has written and directed something that elevates him to world class.<br><br>The simple first: Tim has learned from Altman how to make a camera move in such a way that the viewer becomes part of the action. Some of his long, multithreaded action shots are breathtaking. More, this is used to tie together dual threads and multiple stories. Altman again, but even Altman is inconsistent in this.<br><br>But Tim can do something Altman cannot. He tunes this ensemble so tightly it seems that they are siblings. Many individual performances deeply charm, reach high.<br><br>That alone makes this a must see. But there's more. This is yet another play about a play, a common enough genre that has a very specific set of pitfalls. Robbins the writer cleverly avoids this with a facile trick. Uncareful viewers will see this as a simple, left-leaning story about artistic McCarthyism (Jesse Helms anyone?). But that is a ruse. The story is just the excuse.<br><br>Watch it again and look for why the play couldn't be put on. It was the unions, as much coopted by the system as Rockefeller that was the real threat and who the players defy at the end. This ahistorical fact was inserted for a reason. <br><br>Also watch for how the whole thing is nested in Faust, with a deeper recursive level with the players as the puppets in Faust. The puppet thing is worked a few other ways with Murray of course, but also so many others until we feel that the only non-puppets are the actors.<br><br>I think this is one of those cases where Robbins exceeded his own intellect, but it still works as a deeply recursive self examination, even of itself, because he trusted his instincts as dramatist (and presumably the actors' instincts as well).<br><br>I rate this high for intelligence. It achieves what Altman has not. Some seem to object that some of the characters are silly: Wells and Houseman and the Countess. But this is deliberate. They are playing players IN A PLAY. That's the point. Perhaps it would have been better to not use historical names since it confuses people who might look for accuracy.<br><br>Some misgivings though. Sarandon's performance was the weakest. Cinematically, the crushing of the mural during the performance was blunt editing. The pacing was off -- it should have been better integrated with the pacing of the play's action. The transposition of the dummy to modern Broadway was radically less subtle than the dummy theme's life in the rest of the play. If you didn't tease it out early, you'd be confused.","user":"tedg","rank":[38,50]}]