[{"title":"(7/10) Midler shines in epic tearjerker","rating":7,"date":"23 April 2000","review":"\"For The Boys\" is the story of two people - the irrepressible Dixie Leonard (Bette Midler) and the instantly dislikable but ever popular Eddie Sparks (James Caan).  Set against the backdrop of wars in which the United States has been involved, the film moves from station to station as the pair entertain the boys while they bicker and fight amongst themselves.<br><br>The film starts with an aged Midler telling a studio assistant (Arye Gross) her tale, starting in the forties with World War II, moving through the was in Korea and climaxing in Vietnam.  Along the way, she gets to sing a few classic tunes, including \"Stuff Like That There\" and \"P.S. I Love You, as part of the stage act of comedian Eddie Sparks.<br><br>Bette Midler delivers a fine performance as the embittered Dixie Leonard who has seen it all in fifty odd years in the business.  She layers her performance with emotion after emotion and has the gift of bringing out that quality in her fellow actors.  The highlight of this film is her understated performance of \"In My Life\" at the small Vietnamese camp - truly a moment when the world stops turning and we are graced with a glimpse of heaven. James Caan, playing a quintessential son of a bitch, is less comfortable in his role but has some fine moments opposite his dynamic co-star.<br><br>The purpose of this film is not to document the wars which form such an integral backdrop to the plot. It succeeds primarily as a story of people - their suffering and their joy is real and it affects the audience in no uncertain terms.  You will either love or hate this movie. Either way, take the time to decide - its worth the screening even if only for the divine Miss M.","user":"David Fick","rank":[20,23]},{"title":"POIGNANT AND ENTERTAINING","rating":12,"date":"12 November 2004","review":"A wonderful epic on war, modern American history, entertainment, and music. There is hardly a subject it doesn't touch on, from the 1950s Blacklist, to the antiwar movement in the 1960s, to the exploitation of talent, and to betrayal of friendship in politics and in marriage. All the performances are superb: Midler is extraordinary--her singing, acting, dancing and characterization are peerless; James Caan in one of the finest roles in his post-Godfather career, conveys the talented smarmy-but-sentimental Eddie Sparks; George Segal in a finely nuanced role as Caan's writer, and Arye Gross, who sets the entire backdrop for the story, all are excellent. On top of a plot-line that never sags, we are treated to a musical feast: Many old standards and obscure songs with orchestrations and vocal arrangements that are all first-rate, and the performances are flawless. The dramatization and attention to detail in the various historical periods is accurate and fascinating. Some may find the film too sentimental or simplistic: but it is a film, not an historical study, and sentimentality is different from sentiment. And finally, a movie that not only offers great music, great comedy, a story on an epic scale with characters that are realistic and has you crying in three or four magnificently poignant scenes is truly rare.","user":"aroth15","rank":[12,13]},{"title":"Flawed masterpiece","rating":9,"date":"5 August 1999","review":"Every so often a film comes along that is misunderstood by critics and ignored by the public, but is subsequently rediscovered and reappraised. I sincerely hope that \"For the Boys\" will join those ranks. It is an uncommonly sincere, insightful and touching film, and the only things to be held against it amount to quibbles. True, the old age make up is dreadful, and the last five minutes seriously weaken the impact of the film, but the sum total is moving and perceptive.<br><br>Bette Midler, giving the performance of her career to date, was robbed of the Oscar in my opinion. It is a brave and sincere effort on her part, and such a pity that it was not met with greater recognition. James Caan plays the shallow, slightly dim Eddie Sparks almost too well. There are times when he truly frightened me. The performances on the whole are restrained; when the occasion for histrionics comes, both stars rise to it.<br><br>Thoroughly recommended. I sincerely hope this film finds its audience one day.","user":"Jamie-58","rank":[30,38]}]