[{"title":"Spacey Good, DeVito Great","rating":7,"date":"29 July 2004","review":"Some movies are little more than photographed stage plays. 'The Big Kahuna' is like that. Most of the scenes are set in one hotel room and only 4 people have any lines. It could be said that all they do is talk, philosophize, and soul-search in this film. So if what they talk about is interesting and moves you, then the movie works. With subject matter such as religion, friendship, finding a meaning in life, and even the art of salesmanship, the characters definitely have a lot to say. And they're pretty funny, even if the film is too tragic to be called a comedy. Bottom line is, I'll long remember Danny DeVito's touching, understated performance.<br><br>He and Kevin Spacey (Phil and Larry, respectively) play experienced industrial lubricant salesman who've been sent to a convention in Wichita. Accompanying the two longtime friends and colleagues is a young co-worker, Bob (Peter Facinelli). They're hosting a small party in their hospitality suite for the elusive Dick Fuller. This is a client who could conceivably make or break their careers, but might not even show up to talk biz. Fuller represents the title character, although you could also say the kahuna is God. The final third of the picture delves deeply into spiritual belief and the search for the man above. Facinelli is devout, Spacey is not, DeVito rides in the middle lane and tries to keep the peace.<br><br>Whether or not they actually make the big deal plays second fiddle to the give-and-take relationship of the 3 very different men. Spacey is as witty and smart as usual, but DeVito is the soul of 'The Big Kahuna'. He's been good before, but he's generally a comic actor. Here, he's the straight man. The writer and director (Roger Rueff and John Swanbeck, who've never made another film) know how to give Spacey his big scenes and they REALLY know how to let DeVito play everything in expressions and tone. The filmmakers aren't breaking new turf, but they let their excellent actors act. Even if this is just another verse in the 'Death Of A Salesman' song, DeVito's got the goods on Willy Loman.","user":"flickershows","rank":[44,48]},{"title":"Well done, great acting","rating":8,"date":"28 November 2000","review":"Would you sell your soul to sell industrial lubricants?  Based on a stage play called 'Hospitality suite', The Big Kahuna contains only 3 main actors in this movie who all give powerful performances.<br><br>Spacey as the no nonsense take no prisoners step on em when he's down salesman, DeVito as his colleague who's had enough and thinks he's wasted his life going from nameless towns, and boring hotel rooms, and the young up and coming Peter Facinelli as the 6 month newcomer who is like a babe in the woods, but has a strong spiritual side and stronger convictions than anyone else.<br><br>Spacey is great as always, and Facinelli is very believable as the devout Baptist.  But it is DeVito who steals this movie in what has to be the best role I have ever seen him portray.  A funny expose and what it means to be truly successful and happy in career and life.  Kahuna scores high!<br><br>This movie has just great dialogue, and some incredibly memorable lines most of it coming from Spacey who keeps hitting Facinelli over his head with his sharp brute and dirty yet smart mouth.  <br><br>A definite must see for 2000.<br><br>Rating 8 out of 10.","user":"smakawhat","rank":[26,28]},{"title":"A refreshingly intelligent film","rating":9,"date":"18 October 2000","review":"This refreshingly intelligent film delivers raw intellectual power by retaining the look and feel of the play from which it was adapted.  The use of a single set and just three actors throws the emphasis entirely upon the in-depth character studies, the incisive dialogue and the actors' outstanding performances.  It draws us into the lives of three seemingly ordinary guys at a convention whose interaction broaches questions that are nothing short of an examination of the meaning of life.  The dialogue unabashedly strips the characters naked to show the ironies and hypocrisies inherent in their strategies for establishing meaning in the machinations of mundane lives.  The laser sharp exchanges slash relentlessly at the souls of each, leaving none of the characters intact by the end of the film.  And with each thrust, they drive another introspective probe deep into the psyche of the viewer.<br><br>The presentation reminded me a little of `Glengarry Glen Ross' with its theatrical feel and deep reflective tone, although this film was more confronting and less darkly despondent.  Roger Roeff's penetrating script approaches the meaninglessness of life from three unique perspectives.  We have Larry (Kevin Spacey) the seemingly superficial cynic who has far greater depth than he lets on and who uses his sardonic persona as a defense mechanism to hide his own fears.  Phil (Danny DeVito) is the pragmatic but jaded salesman who is great at putting things in perspective for everyone but himself.  Bob is the naïve young Christian zealot whose antidote for the futility of life is a strong dose of Jesus.<br><br>The juxtaposition of Larry the cynic and Bob the idealist makes for numerous thought provoking exchanges, especially when we learn that Phil (our mediator and voice of reason) is drowning in his own soul-searching quest for meaning.  The story poses more questions than it does answers, and sputters a bit at the end, but overall it accomplishes its purpose of making the viewer ponder profundities easily ignored while in the pursuit of everyday priorities.<br><br>The acting was brilliant.  Kevin Spacey gave what I thought was the best performance of his career.  This was so much more interesting and meaty a character than he played in `American Beauty' that Spacey easily eclipsed even that outstanding performance.  Larry was such a dynamic and complex character, that Spacey was able to open up the throttle and show us the full measure of his considerable talents.  Likewise, Danny DeVito delivered a personal best in a serious dramatic role.  His portrayal of the mediator who was trying to keep the peace while he was disintegrating inside was subtle and powerful.  Peter Facinelli was also near perfect with an utterly believable and sincere performance as the pure hearted whelp whose heart was suffused with the Lord.<br><br>I rated this film a 9/10, but it requires a certain type of viewer to enjoy it.  It is a very intellectual film, which precludes it from having much mass appeal.  Action junkies will be bored to tears.  However, for those who have a philosophical bent, this film will be highly satisfying.","user":"FlickJunkie-2","rank":[57,66]}]