[{"title":"\"Like father, like daughter\"","rating":7,"date":"2 March 2013","review":"Bronson copped it by the critics during the 80s for his work with cannon, but his fans stuck with him and while I wouldn't call them masterpieces they were still entertaining. Then into the nineties he was mainly involved in TV productions, but again these were a lot better than I expected. And I mean a lot. For a standard made-for-TV presentation; \"Relative Danger\" was an engrossingly glum crime drama, even with the routine scenarios and blaring stereotypes. This can be attributed to Charles Bronson's steadfast performance, along with his convincing chemistry alongside a hearty Dana Delany (playing his on- screen daughter). <br><br>In Los Angeles nuns are being brutally raped and murdered. This sees the pairing up of father and daughter, Mike and Dina Donato. Meaning they must work pass their past differences and frosty relationship, as they plan to tempt the killer out of hiding and into an elaborate trap they've set. However this killer goes about trying to twist it back onto the detectives, while getting somewhat personal.<br><br>Adapted off the novel of Jack Early, the script is heavy on family drama (giving it much needed weight) while at the same time balancing the disquieting serial killer framework with the investigative groundwork. What makes it work is because everything is kept grounded and the toying cat-and-mouse element between the Donatos and the serial killer (a perfectly neurotic Xander Berkeley) thrillingly punches away. You do get to see Bronson hand out some psychical punishment vintage Bronson too. Rod Holcomb is competent in his direction letting the action and drama smoothly unfold with some sweeping camera-work capping it off. There's quite solid cast in support; Jenette Goldstein, Marc Alaimo, Tom Verica, Robert Gossett, Michael Cavanaugh and Bonnie Bartlett.<br><br>\"Where was her god when this happened?!\"","user":"lost-in-limbo","rank":[7,9]},{"title":"Hey Charlie's still got it.","rating":10,"date":"24 February 2003","review":"CONTAINS SPOILERS!!! Does Bronson pack a punch in this. Throwing that guy down the stairs, i don't know how any one can say he can't act. Morons who say that don't know he was once the post important action and film star in the world at the same time as Clint. Highest paid star, and even in the 80's he's film was still making money, books and magazines i see from the 80's still have his name on them. Well anyway Bronson really shows he can act in this one, at the end is cool. He comes slamming down the door with that great action tone he as, Pointing the gun at the mad man who as he's daughter. \"Hey, take it easy no, don't do anything stupid\". It's just great, this should have been a proper film, but who cares it still work for me. Well the story line is about a cop (Mike Donato, Bronson, the father) and daughter (Dana Delana) not getting along since he's son died. Because he doesn't want her to end up dead. Put she don't care what he thinks. So when they have to team together to stop a nun murderer, yeah i know nuns. This is especially why i like it when Bronson nails him, Taking things out on nuns.  Saw anyway Bronson and his daughter look for clues get into some action, and go to a mans apartment room where he decides to run,(Idiot). He kills one of the cop woman, and Bronson cathes him and shucks him all the way down the steps. After this they go to the right aprtment getting closer to the Murderer, they even meet him as a suspect but not sure if it's him, but the murderer takes a liking to Bronson's daughter. Then after this she starts getting horrible calls from the murderer and Bronson's getting worried for her safety,(This is where u'd think he'll take to law into his own hands. Wrong). He goes by the books, things are happening, He's daughter want to know what really happened to her brother and towards the end he finely tells her the punk he pulled in after he's death is becuse this punk was selling his son drugs, whicj killed him. And Bronson didn't just want him in jail. so he rearanged he's face. After all this they get close together and then back together as a team on the case honding the man they suspect as the killer. The killer goes home fnding he's wife looking at his gear he used to kill the nuns with. So he killers her. Bronson's daughter comes round trying to pretend they have catched the killer, so he the idiot tries to come on the her while he just stabbed his wife, then she hears his wife scream, pulls out a gun. But he put a knife to her throat. This is where Bronson come in slamming the door down. Things go up stairs on top of the roof, Bronson goes to he's wife and calls for back up,(This woman that's laying the floor at the end is Bronson real life wife.) but always say \"Here's what i want you to do\". He goes on top the roof with he's gun facing the floor. Then as he gets up he's sees he's daughter with a knife to her throat. Face to face they are looking at each other as he's daughter and the murderer are close to the edge Bronson as that look on he's face. Then suddenly an helicopter comes up, she's wacks him in the stomach and he's knifes her arm and bronson just shoots him, \"With a BANG BANG look on he's face\". He's runs to he's daughter and always well ends well. As they walk the credits just come roaling on. This was an absulutely great film for me as i am an absolute Bronson fan.<br><br>10/10","user":"loulou1992","rank":[9,13]},{"title":"'When I get older I wanna be a cop, not a...piano player!'","rating":3,"date":"22 June 2001","review":"The title of my comments is a phrase that I have heard in the movie, coming from the mouth of little Cal. And I think that is an awful phrase to come from a little kid... It reflects perfectly the quality of the present movie, which can not decide if it wants to be a police adventure or a family drama. The fact is that it does not work as either of them. I have not read the book, but the script is really terrible, full of stereotypes and vacuums. In my opinion Charles Bronson's movies are getting worse and worse as he gets older.","user":"darth76","rank":[15,29]}]