[{"title":"Best laugh in years","rating":15,"date":"15 May 2003","review":"Albert Brooks at his best. Very very funny. The short appearances of James Cameron and Martin Scorcese are hilarious, but the best laugh I had in years was the short conversation of Albert Brooks (Steven) with Mario Opinato (European man) at the party. Although it already passed 30 minutes from that scene I was still laughing, and still do whenever I think of it. Despite Brooks latter works, The Muse is somewhat inferior, but still hilarious... and what´s the point in a comedy? To make people laugh, and I sure did laugh with this one.","user":"lamara_andre","rank":[15,20]},{"title":"Amusing for movie buffs","rating":7,"date":"30 April 2000","review":"Albert Brooks's The Muse may be under-rated, but I found it OK.  Brooks has always made movies that are good for a feel-food time, and this is a good example.  Brooks plays a troubled writer who needs help to get his edge, so he gets a Muse (Sharon Stone is not her best, but good at being annoying) who inspires to do things.  Cute comedy has many cameos some movie buffs might find hilarious.  I find it entertaining.  Cameos include James F. Cameron, Jennifer Tilly, Rob Reiner, Steven Wright (not as himself but he gives the funniest part as Stan Spielberg) and in the best cameo of the year, Martin Scorsese as himself, who interests Brooks in a remake of Raging Bull \"Thin and Angry.\"  Worth a gander, but not as many laughs as Bowfinger. A","user":"Quinoa1984","rank":[16,22]},{"title":"Gets funnier every time I watch it","rating":8,"date":"10 July 2009","review":"Brooks is the West-Coast doppelganger of Woody Allen, despite the fact that he's about twenty years younger &amp; takes on characters decidedly white-bread Middle American Gentile. All of Brooks' movies are about him entering a critical transition period of life (or death). Like Allen's films, his variations on this familiar theme range in quality. 'The Muse' is a solid effort. Most Brooks films have funny zingers; this one has a whole filmful plus a clever story to boot, and a big-budget cast. The more you know about Hollywood and the motion picture industry (I recommend 'The Big Picture' by Epstein), the more true-to-life you understand the film to be, and thus the funnier the jokes become.<br><br>I'm not sure why it did poorly, and reading others' comments yields little insight. All I can say is that Brooks is never a fully sympathetic character--he is always at least partly to blame for his predicament--never quite the \"aw-shucks\" underdog. At least this time he and Johnson introduce other characters who are even more sympathetic to generate audience goodwill. Not to mention that the two leading ladies are both stunningly good-looking. Plus the whole Hollywood self-referencing is a lot of fun. Bottom line is, I believe that this is among the best of Albert Brooks' films. It has many winning qualities which permit it to transcend the Brooks formula. It shares a certain affinity with another wry comedy, \"Being There\"; both are stories about people being drawn in by the mysterious among us.","user":"soccin","rank":[4,4]}]