[{"title":"Natasha Henstridge Was Perfectly Cast","rating":7,"date":"28 April 2015","review":"Using information received from an extra-terrestrial radio transmission, scientists on earth are able to reconstruct alien DNA and then inject it into a human egg in accordance with the instructions from their source. The scientists are then shocked by the rapid rate of growth from the humanoid creature and fearing that they may have rushed too quickly into this experiment decide to destroy the young female before it can mature. Unfortunately, she escapes and within just a matter of days has attained full adulthood. It is at this point that the scientists realize that they have created a true monster with little concern about destroying anyone who gets in her way. They also discover that she wants to mate. Now rather than reveal any more of this movie and risk spoiling it for those who haven't seen it I will just say that Natasha Henstridge was perfectly cast as the beautiful but psychopathic creature named \"Sil\". I also liked the performance of Forest Whitaker (who played the empath by the name of \"Dan Smithson\") and Marg Helgenberger (as the micro-biologist named \"Dr. Laura Baker\"). In any case, I thought this was a pretty good Sci-Fi/Horror film and I have rated it accordingly. Above average.","user":"Uriah43","rank":[17,17]},{"title":"Kind of fun","rating":8,"date":"9 January 2005","review":"Some scientists working for the government tamper with a DNA sequence they got from a message from outer space. The subject turns into a little girl with amazing superhuman powers. She escapes and turns into a beautiful woman (Natasha Herstridge) who wants to mate and produce others like her. A team led by a head scientist (Ben Kingsley!) try to track her down.<br><br>OK--it's kind of silly but this moves quickly and is well-done. There are many excellent, if gruesome, special effects and the SIL creature at the end is truly astounding. The script is good (considering) and it actually makes sense...if you don't think about it too much.<br><br>Acting varies--Kingsley is TERRIBLE in his role. Michael Madsen is pretty good as part of the team as are Marg Helgenberger and (especially) Forest Whitaker. Herstridge is certainly beautiful but can't act--but the role doesn't call for acting.<br><br>I'm giving it an 8. It's no classic but it moves quickly and I was never bored.","user":"preppy-3","rank":[40,47]},{"title":"Kind of cool and pleasant.....","rating":6,"date":"29 September 2001","review":"\"Species\" has a hopelessly derivative premise that makes it a completely unnecessary view for anyone who has ever seen \"Alien\" or \"The Predator\" (or their sequels), but it does have some things going for it. To be short and specific: Natasha Henstridge is dreamily, extraordinarily beautiful; the rest of the cast is distinguished, with a very cool Michael Madsen stealing the show; the special effects are convincingly yucky; and the pacing is fast and unrelenting, with the \"search-and-destroy\" team being always only one step behind the pursued alien \"monster\". A forgettable film, but not nearly as bad as many reviews have suggested.      (**)","user":"gridoon","rank":[58,75]}]