[{"title":"A fun little adventure for children and their parents.","rating":10,"date":"16 May 2005","review":"This is a great movie that both my children watched extensively as toddlers. It has good messages for kids, as all Winnie the Pooh cartoons do, and the animation and voice acting are top quality. It's also got some great lines that make me laugh no matter how many times I hear them.<br><br>\"Look at the biceps on that bear! I'm not worthy to dangle from the same precipice.\" - Tigger.<br><br>\"Never trust that thing between your ears. Haven't had a need for mine in years.\" - Rabbit.<br><br>\"What's up, buddy bear?\" \"Piglet is up, Tigger.\" - Pooh, pointing a Piglet in the top of a tree.<br><br>\"Jump down, Piglet! We'll catch you, likely as not!\" - Tigger.<br><br>\"End of the line. Nothing to do, and no hope of things getting better. Sounds like Saturday night at my house.\" - Eeyore.<br><br>\"There's no difference between falling ten-thousand feet to the jagged rocks below, and tumbling out of bed. Except for the splat at the end, they're practically similar.\" - Tigger.<br><br>I find it hard to believe that people would actually criticize this movie negatively. It's a kids' movie for crying out loud. If you've got nothing better to do than watch and criticize kids' movies, you really need to get a life.<br><br>I gave it a ten. I can't think of anything that could have made it better.","user":"kevnar","rank":[17,18]},{"title":"By far the most theater worthy made for video Disney flick.","rating":9,"date":"20 June 2006","review":"I found this movie to be really charming. The plot is that one day Christopher Robin goes missing, and a note is left. Owl translates his note to say that he is in the Skull, and Pooh, Piglet, Tigger, Rabbit and Eeyore all go on an adventure to find him. Most notable about this movie are its songs. The songs in here are worthy of classic Disney musicals. The characters really do have a lot of development over the course of the movie, especially Piglet overcoming his fears. The only problem with this is the animation, which isn't bad, it just isn't great. I highly recommend this charming adventure, and personally think it's only second best to the original 1977 Pooh film.<br><br>My rating: ****1/2 out of *****. 71 mins. Rated G.","user":"TOMNEL","rank":[10,11]},{"title":"A different Winnie the Pooh movie","rating":9,"date":"25 August 2012","review":"Well, from all the Winnie the Pooh animations that I've seen (so far) this has to be the \"darkest\" one (At least, for the usual Winnie the Pooh standards) However, I don't consider that to be a bad thing, in fact, it was one of the main reasons of why this little film kept my interest from beginning to end, being a bit (just a bit) more serious than the other films based on the same character, but it does still have the charming quality that the Winnie the Pooh have.<br><br>Even when this isn't a masterpiece, or a life-changing experience, I consider \"Pooh's Grand Adventure: The Search for Christopher Robin\" to be a pretty good film, being very well animated (With beautiful sceneries and very appealing designs) and being also very enjoyable to watch.<br><br>This was a cute film, with a good message. Like I said before, even when this could be considered as a bit \"darker\" (Not very much, actually) than the other animations based on the same characters, it is still something pleasant, tender and good-spirited, appropriate for the whole family.<br><br>8.5/10","user":"Rectangular_businessman","rank":[6,6]}]