[{"title":"The greatest and most realistic of the 50s creature features.","rating":8,"date":"31 August 2011","review":"Godzilla is truly a legendary icon who has really stood the test of time for more than fifty years. His first film back in 1954 was very serious compared to most monster movies at the time. Most agree that it's a typical story of a prehistoric creature mutated by radiation rising up to challenge the world with his newfound power, but it's a little more than that. How so? Everything seems to be taken seriously by both filmmakers and the characters in the story. In this U.S. version, dubbing is kept to a very minimum by the lead characters while everyone else is speaking Japanese, which brings a small sense of realism. Godzilla himself is taken seriously by the filmmakers because while the primitive effects are obvious, his actions are like how a real animal reacts to a certain situation like when he approaches the electrical barrier and pauses to look at it curiously or when he snarls at a ringing clock tower because he thinks it might be another animal. He doesn't \"attack\" Tokyo just for the hell of it, he's just lashing out at whatever attacked him. After Tokyo is destroyed, the scene where the people mourn for the dead and dying truly moved me because the \"attack\" was treated like an actual disaster. I truly respect that.<br><br>Tomoyuki Tanaka really knew how to tell a war related story (war films in Japan were illegal at the time) and make his dinosaur the biggest star (literally) in the world. Steve Martin(Raymond Burr) and Dr. Serizawa are among the best known human characters in the entire series. I give this movie little more credit than before because of how it was made and the angle it was going for. Long live the King!","user":"kevinxirau","rank":[18,23]},{"title":"Americanized Version of a Japanese Master piece","rating":5,"date":"8 September 2006","review":"Godzilla: King of the Monsters starring Raymond Burr is a completely different work than the original Gojira. In the American version many references of the Nuclear Test have been muted and almost non-exsitent. While the Japanese version has many cautions about the plight of Nuclear war. Perhaps that decision was politically manipulated for the American Audience or it could be for the fact that the American producers wanted bottom-line cash and hook even if it meant making Godzilla: King of the Monsters no deeper than the flying saucer. All in all This movie is good for a laugh, but if your looking for a deep and haunting tale then opt for the original Gojira which has just recently been released of DVD by Classic Media.","user":"calabloc","rank":[23,31]},{"title":"Japanese Version Far Superior!","rating":5,"date":"14 May 2014","review":"Having not seen all the \"Godzilla\" movies, I don't know if this is the best one. But, I'm guessing that it does have the best story and characters. There are two versions of this: The original Japanese version (\"Gojira\"), and the \"Americanized\" version, where Raymond Burr is inserted into the story, and other cuts are made.<br><br>I've seen both versions (available from Criterion, by the way). As you'd expect, the original version is better. In this case, however, the Japanese version (which has a separate IMDb page), is far superior. This is because we get to know the characters much better. There is a lot more human emotion in the original. Also, the cutaways to Raymond Burr (shot separately, two years later in the U.S.) don't distract from the story. The cuts from the original are critical, since they are about the characters.<br><br>A thematic difference is that there is the angle of Godzilla being the product of American Hydrogen Bomb testing. Definitely guessing that Americans didn't want to hear that part, which is why those comments are deleted from the Americanized version.<br><br>Of course, the 1950's American monster movies blame their monsters on radioactivity, so in that way, there isn't too much of a difference!<br><br>The original version also has a bit more Godzilla smashy-smashy action! If you are in a hurry to see it, you are in for a wait. 'Zilla doesn't show up (except for a quick head shot) until about the 42-minute mark in both versions.<br><br>I definitely recommend the Japanese version. Yes, there are subtitles, but it's worth it! The American version runs 1:20 and the Japanese version runs 1:36.<br><br>Japanese version: ******* (7 Out of 10 Stars) / American version: ***** (5 Out of 10 Stars)","user":"jmillerdp","rank":[5,5]}]