[{"title":"Best of both worlds.","rating":10,"date":"3 March 2001","review":"This film represents the best of both worlds in two sets of sometimes opposing criteria.<br><br>First, in terms of movies overall, I'd say this is one of my favorites technically/artistically.  The sets were great, the acting was great (especially Leigh and Scott, one of my favorite on-screen Romance-That-Never-Was duos, like Fiennes and Blanchett in \"Oscar And Lucinda.\").<br><br>But this is also one of my favorites in terms of enjoyment.  I watch it for the scenes I love, and the mood it sets.  I will probably not tire of watching and rewatching this film for a long time to come.<br><br>Second, in terms of Biopics, this also rates highly.  It had enough accuracy/realism to make it a good bio, and enough drama and flare to make it a good pic.  A rare combination.  I'd say \"13 Days\" also did that feat well.","user":"lonecap-2","rank":[25,30]},{"title":"Mrs. Parker's isn't the ONLY side of this story","rating":28,"date":"28 November 2001","review":"While watching this film last night on IFC, I found myself appreciating the social, historical and artistic subject matter.  Despite Mrs. Parker's obvious and overwhelming psychological dysfunctions, I felt this was a genuine \"true to life\" expression of one participant's subjective experiences.  This was a unique, if not quite legendary, circle of literary talent -- certainly deserving of serious cinematic treatment such as this.<br><br>BUT....<br><br>There was another side to the story -- a healthier, less appalling, less depressing side.  To discover \"the rest of the story\", I highly recommend Harpo Marx' autobiography \"Harpo Speaks\".  Although Harpo also recalls the scathing insults and practical jokes that were a central part of the story of this Round Table group, his book relates a number of hugely funny and sometimes heart-warming scenes that indicate that at least some of these people truly cared for each other and expressed strong positive feelings in many different settings.  In short, Harpo's stories (e.g. several \"croquet fanatic\" episodes) offer a telling comedic counterpoint to Mrs. Parker's almost continually cynical and self-pitying pathos.  Read Harpo's book to balance out the negative. You'll be glad you did.","user":"enigmann","rank":[30,37]},{"title":"A closer look at the world of the 1920's through the cynical eyes of writer Dorothy Parker.","rating":11,"date":"11 September 1998","review":"Since watching this film I have picked up a biography of Dorothy Parker as well as a book of her verse, that is how fascinating I find her to be. Not only her, but the performance of Jennifer Jason Leigh as well, though many have criticized her voice, I didn't find it out of place at all. The film involves us in her life in the 20's, when she was a theater critic for Vanity Fair. Throughout the film are celebrities of the time, Robert Benchley, Alexander Woolcott, Howard Ross, Charles McArthur. The cast is first-rate, particularly Campbell Scott. It is a very quotable movie, full of venomous one-liners, most courtesy of Mrs. Parker. One can certainly admire her spirit to persevere and excel in a world dominated by men. It is helpful to know the members of the Round Table, but isn't necessary in order to enjoy the movie.","user":"Vampire","rank":[22,27]}]