[{"title":"Total fun","rating":12,"date":"12 April 2004","review":"This comedy is fun. It's not meant to education; it's meant to entertain. Mark Paul Gosselaar shines as a comedic actor, and his talents were further evidenced after he was an NYPD Blue addition (a HUGE contrast from DMOC, obviously.) The premise is unique, and the acting was good. Yes, it may lag a bit in the 2nd act and the writing can become a tad labored, but nonetheless, this is a totally fun movie with great performances and hijinx. If you have not seen it, get a group of friends together who actually have a sense of humor, get some good eats, and have a blast.","user":"Eireann","rank":[23,27]},{"title":"Great Stress Relief","rating":31,"date":"31 October 2004","review":"I own this movie and watch it several times a year. Why? Because when you are studying for exams you wish your school had a policy like this (and you could fake a death because who really wants a roommate to die?)<br><br>I find people are over-analyzing, and you have to take any movie with a grain of salt. All movies require a suspension of disbelief, as much of this is unbelievable, but it's a freakin' comedy! Not a statement on life. It pokes fun at a situation where many of us have been: most of us go through a slacker phase where the world is just too tough and you have to forget, just relax a little... still don't get how if we all need this there are still so many consequences but I digress.<br><br>Most of the intelligent stuff has been said already so I won't bore you by repeating the same sentiments. However, I do recommend this movie for when you can't get papers/exams out of your mind but you still need a break (or if you just feel like reliving that part of your life). It's better than \"The Perfect Score\" but that movie is also good for study breaks.","user":"blondbomb","rank":[21,25]},{"title":"Animal House for the 90's","rating":10,"date":"30 May 2004","review":"This film is one of the most underrated films i have ever seen. The film follows 2 roommates Coop and Josh and there plan to have a roommate kill himself so they can achieve straight A's. Although that storyline only comes in the second half of the film for the first half we just spend the time in college with the boys. The chemistry between the 2 leads is great and Mark Paul Gosselar sort of plays his role as Zack from SBTB for a more adult audience ( which i thought was genius), his charisma meant that I was never bored.why he never broke into the A list I don't know. but its all politics. It is one of the most quotable films i have ever seen,with so many great characters The comedy here is not for everyone but if you like films which don't take themselves seriously then this is for you. The soundtrack is also great and has Dust Brother as executive producers would you believe it (they did the soundtrack for fight club among others) The icing on the cake though is Cliff O Malley the insane party Animal who really should have got more screen time, he makes every scene he is in and I was just crying with laughter, he really is a match for Bluto. This film is great to watch with a bunch of mates I give it 9/10","user":"MongrelMob","rank":[26,34]}]