[{"title":"It was pretty cool...","rating":8,"date":"8 August 1999","review":"The first two best of the best films, I feel, were the most entertaining but this fourth addition with Ernie Hudson was watchable and contained 2 really good fight scenes and one amazing shootouts!  In general with it's low budget the film made due very well and I was glad I had watched it.  If you liked the first two or three you will certainly enjoy the fourth.","user":"Jackson-12","rank":[8,8]},{"title":"Tommy Lee + kidnapped child = loads of dead bad guys","rating":6,"date":"5 October 2015","review":"Is there a Best of the Best 3.5? I'm just asking because in this film Tommy is a widower with a six year old kid and last time we saw Tommy he was young free and single. He's also got his Tae Kwon Do school back after telling folk in the last film he gave it up. Hey-ho. Let's not over think things.<br><br>Who's gonna mess with Tommy's family this time and then act all surprised when his cheesy feet start zooming towards their faces, knocking their teeth out and stuff? This time you've got the bad guy from Saw, some other guy, and Killian's henchman from The Running Man out to get a disc from Tommy that he didn't even know he had, as some girl slipped it into his pocket shortly before being machine gunned to death by a bad guy from some counterfeiting gang.<br><br>This gang steal and entire truck at the start of the film and waste loads of cops so we know they mean business. They also prove to be the biggest bunch of morons Tommy's had to face, as they do the one thing that Tommy hates the most – That's right, they target his family.<br><br>Blah blah fight scenes, blah blah threats. Tommy kicks his way through a lot of bad guys in this one, but I reckon we spend a bit too much time with the bad guys in-fighting rather that Tommy jumping all over their heads. He's also managed to go up against bad guys that take themselves out! Not only are they all threatening and shooting each other, one of them manages to kill more bad guys than Tommy.<br><br>Seriously, there's loads of bad guys chasing Tommy at one end of a tunnel on motorbikes, and this one guy at the other end of the tunnel grabs a truck and speeds towards them, then misses Tommy, then hits the rest of the bad guys causing a huge explosion that takes out a helicopter too. All Tommy had to do was get out of the way.<br><br>Phillip Rhee also directs this one too, and it'll do for a quick action fix. The second film's the best one in the series by my reckoning. I think there was plans for a fifth one where Tommy didn't even bother getting out of bed while the bad guys just took care of themselves.","user":"Bezenby","rank":[4,4]},{"title":"You should see this one if you love that implausibly-plotted-but-who-cares-let's-have-fun action style pioneered in the 80's.","rating":6,"date":"24 February 2012","review":"Tommy Lee is back! Not the Motley Crue drummer of course (in the press he's always Rocker Tommy Lee, and he's called that so often he should just legally change his first name to Rocker) - It's Phillip Rhee, and this time he teaches martial arts to police officers. He has a young daughter, Stephanie (Jessica Huang), and life seems good. All this ends when a gang of Russian-type mobsters, working out of an abandoned warehouse (where else?), begins a large counterfeiting operation. The details of this illegal activity are on a disc, and Tommy inadvertently ends up with it.<br><br>Now on the bad side of criminal mastermind Slava (Bell), as well as his many goons, including Boris (Thorsen), he entrusts Stephanie to a priest (Gleason), so he can go off on his own and fight the baddies. But while he has some friends on the force, notably Jarvis (Lemmon), he also butts heads with the hard-line Detective Gresko (Hudson). Can Tommy Lee stop the counterfeiting agents, rescue his friends and daughter from imminent doom, and clear his own name in the process? Some people might think about the Best of the Best series, \"there are FOUR of them?\" While it may seem puzzling and hard to justify, this fourth entry in the series was solid fun and worth seeing. Phillip Rhee is a very talented guy - he stars in the film, he directed it, co-wrote it, and he's a gifted martial artist and worked on the choreography. He's also likable. Rhee does seem to have well-rounded skills, and because of this, his name should be more well-known outside of die-hard action circles. He's so badass, he doesn't turn off his lights at night using a lightswitch like a sucker, he JUMPKICKS his lights off.<br><br>Supporting him is an impressive array of B-movie names. Tobin Bell puts in an understated, low-key villain performance, which was a welcome change from the frothing-at-the-mouth baddies we usually see. He pulls off a tricky balance - be subtle but not be boring. He does a great job, and, interestingly, there's some pre-Saw torture he's involved with. Coincidence? Or did the makers of the unending Saw franchise see this movie and picture him as the ultimate torturer? And speaking of people who probably saw this movie, there's an American Beauty (1999)-like fantasy sequence one year before that film. Is it possible the American Beauty people saw this movie and thought, \"If we rip this off, no one will know, because we don't share any of the same audience\"? Hudson plays the BYD (instead of Black Yelling Chief, here he's a detective) and there's even a fight scene between him and Rhee where Hudson attempts some Hudson-Fu on him. Chris Lemmon's not in it that much and resembles Joe Piscopo. It's no Firehead (1991) for him. Paul Gleason, Art LaFleur and Sven-Ole Thorsen round out the cast of familiar faces, and someone who's been turning up a lot lately, David \"Shark\" Fralick (Deadly Reckoning, 1998, Executive Target, 1997 Inside Edge, 1992) is on board as well.<br><br>A highlight of the movie is a combination stickfighting/fencing fight scene. We don't believe we've ever seen that before. While the movie falls prey to a cliché we see often \"We've got to get the disc!\" - a movie about a disc - Best of the Best 4 has a lot to offer in the pure entertainment department. Regardless of how you feel about the other Best of the Best movies, you should see this one if you love that implausibly-plotted-but-who-cares-let's-have-fun action style pioneered in the 80's.<br><br>For more action insanity, please visit: comeuppancereviews.com","user":"tarbosh22000","rank":[4,4]}]