[{"title":"Girls in charge","rating":13,"date":"13 July 2001","review":"Just don't be taken in by beautiful women.  Security guards, computer programmers and the villain's henchmen all make this mistake and endure unpleasant repercussions.  This is an action movie where the girls rule, with Kinmont impressing as a beautiful and resourceful undercover agent, while ex-hubby Lamas takes a back seat.<br><br>The plot is the usual sub-Bondian nonsense, with John Savage phoning in his performance as a routine bad guy, but the budget seems higher than average and the result is some well-staged mayhem.  Alexa's first fight in a grocery store is a standout action sequence.","user":"heedarmy","rank":[9,11]},{"title":"Ultimate chick fight","rating":3,"date":"11 November 2014","review":"For reasons that I still can't figure out Kathleen Kinmont was absolutely essential to getting back a stolen microchip that if it fell into the wrong hands could lead to the downfall of the USA. She wants out of the terrorism game, but her real life husband Lorenzo Lamas of the CIA wants to drag her back in.<br><br>All Kinmont wants to do is raise her daughter, her daughter whose father is John Savage the terrorist who they think has the chip. He doesn't have it, but he sure wants it. Another group beat him to it.<br><br>For those who like their action films without too much strain on the brain this successor CIA II: Target Alexa is definitely for you. Lorenzo Lamas's fans will see him do his martial arts thing and Kinmont is pretty good herself. The one thing that this film really has going for it is female bodybuilder Lori Fetrick and Kinmont going at it. It's the ultimate in chick fighting.<br><br>But it ain't enough.","user":"bkoganbing","rank":[2,2]},{"title":"Kathleen Kinmont vs. Lori Fetrick","rating":5,"date":"11 July 2006","review":"\"CIA II: Target Alexa\" is a typical low-grade action film with medium-grade fights, stunts and explosions. Which is about what you'd expect when the name Lorenzo Lamas (here as director AND star) is involved. Thankfully, Lamas is kind enough in this case to share the spotlight with two women, Kathleen Kinmont (the heroine) and Lori Fetrick (the villainess), who both have superb bodies: sweaty, muscular and fit. They even have two fights against each other, and even though Fetrick has an obvious strength advantage, Kinmont holds her own pretty well. If any of this sounds like your cup of tea (and it certainly is mine!), then you should check this film out. If not, then there is not much else to see here. (**)","user":"gridoon","rank":[2,2]}]