[{"title":"Softcore faux-Sci Fi Ozploitation masterpiece","rating":6,"date":"2 April 2014","review":"When I was younger I read a book about the history of cinematic Sci-Fi by the late John Brosnan. He spent some time discerning between \"classical sci-fi\" which deals with the implications of future technology or circumstances (such as 2001, Mad Max II or Bladerunner); \"space opera\" fare (which are \"universal myth\"-type films adapted to a sci-fi setting; Star Wars is the obvious example); and finally - films/story lines which could just as easily be set in the current day and have nothing to do at all with sci-fi beyond using its trappings as a marketing hook (Outland might be an example). Naturally an aficionado of sci-fi like Brosnan was contemptuous of the last category. <br><br>Some time later I saw Centrespread on late-night TV and I immediately thought \"Wow! This is exactly what he was talking about in his book!\" The premise of the plot as I understand it (from memory; this was about 1994) is that in the dystopian future, the powers-that-be published a porn mag to keep the rebellious masses docile; the protagonist is a photographer working for that publication. Beyond the costumes, sets and occasional references to the \"badlands of Sector G\", it's a soap opera about the photographer, his model and his boss. Other than that, it looks and sounds like it's set in late-'70s Adelaide and the surrounding environs like Maslin Beach (conveniently clothing-optional for the location shots); which as a native of the locale is fascinating to me. The only thing dystopian about it is the grim and shocking vision of cameras that were apparently going to get encumberingly larger rather than smart-phone sized. We dodged a bullet there, kids!<br><br>The stilted acting, uninspired dialogue and crummy effects are naturally awesome, but I'll second everybody else and suggest that it could have used more nudity. I'll also assume that the budget could have stretched further if they'd just set it in the Adelaide of the day rather than the vaguely Mad Max-ian future - the story wouldn't have suffered.<br><br>One of those fascinating films which purport to say something about the future they're set in but end up saying more about the past they were produced in. I'd watch it again - hopefully next time accompanied.","user":"duncamax","rank":[9,11]},{"title":"Incompetent sexploitation in the guise of a corny sci-fi yarn.","rating":10,"date":"10 January 2000","review":"There's precious little to like in this dumb flick. The female lead is a centrefold model who shows no evidence of having been to acting school and thankfully hasn't been heard of since. The male leads plays his camp character as dislikable, pretentious and effete.<br><br>There is a vague sci-fi plot supported by some truly ridiculous futuristic camera gear.<br><br>As an exploitation flick it doesn't get off the ground because the heroine can't project any erotic heat and simpering innocence won't carry the day. And contrary to expectations she doesn't disrobe much. As a sci-fi yarn it sinks without trace because of the low budget sets and props.<br><br>It was made at a time when tax breaks were the main motive for much film financing in Australia. The quality of the product was secondary, as in second rate. Just like here.","user":"CraigA23","rank":[8,12]},{"title":"Silly but quite enjoyable","rating":7,"date":"6 October 2001","review":"Agreed, the acting in this film is truly awful. But there's enough nudity and some lovely images (I particularly enjoyed the early scene where there is paint smeared over naked bodies during a weird photo shoot) to hold the interest. And, as a former resident of Adelaide, I was pleased to see a film which used the famous Maslin Beach (first legal nude beach in Aus) as a location.<br><br>The tone is surreal throughout, and the awful acting and weak story seem only to add to that effect. Worth a look, especially if you can lay your hands on the video version which includes a \"the making of\" special, which includes some extra nude scenes.","user":"sharptongue","rank":[7,11]}]