[{"title":"Oh for the love of crumbcake...","rating":6,"date":"6 December 2001","review":"So many people have complained about the Gertrude Lang character (Alicia Witt), Holland's interaction with her, and the purpose of the character, and I am simply amazed at the hostility.<br><br>1) \"Playing the sunset\" was Holland's way of getting Gertrude to relax so she could play the notes fluidly. They both knew that she didn't sound professional, and wasn't going to. The idea was to get her just above the level of making a fool of herself as she did the first time he called on her in class. Then she could, and did, perform in the band without dragging down the whole ensemble.<br><br>2) Her goal was not to be a professional musician. Did no one else hear her speech about \"I just wanted to be good at *something*\"? She listed all the fabulous achievements of her parents and siblings, and concluded, \"I'm the only one who's...\" The missing word would have been \"useless\" or \"worthless\". Or \"a failure\". Thirty years later she's the governor (not the mayor!), because in 1966, Holland helped her gain confidence for the first time.<br><br>3) She wasn't \"wasting\" Holland's efforts by going into politics. Art, music and theater education don't exist solely to create professional artists, musicians and actors. They also exist to give young people an opportunity for change and growth, even if they never use a paintbrush again.<br><br>I liked that plot twist. Almost every high school has an alumnus who has achieved something in art or entertainment, but a lot of people sell one painting or appear in one film and become a hero to their home town. But there are only fifty states, and it takes an extraordinary amount of drive to become governor of one of them. It's unlikely that she would have taken that first step towards empowerment without Holland.","user":"Rilchiam-1","rank":[129,138]},{"title":"A beautiful film...","rating":23,"date":"23 April 2003","review":"The first time I saw this film was in the movie theater with one of my best friends--both of us musicians. By the time we left, both of us were bawling our eyes out. This film is very touching and well done. Granted, there are accuracy errors (every film has those) and I've noticed several complaints about the music in the final scene (why are people so nitpicky?). I had a band director much like Mr. Holland when I was in middle school, a man who struggled at first as a teacher but soon became a beloved and inspiring director. Every time I watch this film I think of that man, and how he changed my life for the better. It's a movie I can truly relate to.<br><br>Okay, enough reminiscing. :P If you want a film that will tug your heartstrings, this is it. Rating 9 out of 10.","user":"lady_colubris","rank":[72,80]},{"title":"Great story with challenges and rewards","rating":1,"date":"1 August 2004","review":"I remember seeing \"Mr. Holland's Opus\" for the first time in high school. I liked it then, and still do. Films about teaching often involve tough kids and less than ideal teachers, among other things.  I have to say this film is an exception. Mr. Holland is an inspiration in so many ways that he does not realize or even want to acknowledge. It is also a story that could have taken place and that some people can relate to.  This is why I enjoyed it so much.<br><br>Mr. Holland has a dream of composing a very memorable and moving symphony, and to ultimately be \"rich and famous.\" But working odd jobs in pursuit of his dream doesn't appeal to him. Reluctantly, he takes a day job as a high school music teacher to support the family and at first hates it. His students are not motivated to learn through readings and tests, and do not respond well to the music of Bach. When he finds they love rock and roll, he integrates this into the curriculum, much of the disapproval of the administration, who believe \"rock and roll by its very nature leads to a breakdown in discipline.\" He teaches and mentors many students over the years, from a clarinet student who doubts her talent and feels inferior to her musically talented family, to a wrestler who becomes a drummer, and a talented singer with her eye on him who wants to go to Broadway despite any barriers. Whether or not he knows it, Mr. Holland inspires them to do something worthwhile.<br><br>Despite his love and talent for teaching, Mr. Holland cannot develop this same level of rapport and love with his wife Iris and son Cole, who is deaf. His desire for Cole to appreciate music is outweighed by Cole's inability to hear and his father's reluctance to help him. Cole learns sign language from his teachers and mother predominantly. Mr. Holland appears to be the kind of person who detests imperfection of any kind, and this strains his familial relationships. Gradually, though, he learns to accept and deal with these challenges, and becomes more loving and appreciative. <br><br>I recommend \"Mr. Holland's Opus\" for musicians, singers, music teachers, and really everyone. Enjoy the show!","user":"bppihl","rank":[32,35]}]