[{"title":"Not as bad as some say!","rating":16,"date":"16 September 2000","review":"I actually enjoyed this movie, despite the terrible reviews and the terrible user ratings. Its plot is fair, it's effects are great, even for now, and the acting, although certainly not brilliant, is fair enough to work with the plot. I'd give it a 7/10.","user":"gasgano","rank":[22,23]},{"title":"it's hard to deny that the film is so bizarre, it was primed for cult status from the get-go.","rating":10,"date":"28 January 2016","review":"it's hard to deny that the film is so bizarre, it was primed for cult status from the get-go. The new Blu-ray is one of the best releases from 2014 by Second sight, featuring a stunning new transfer (better than a depressing number of all- time classics), and a hugely enjoyable new making-of documentary. Fans in the US may be disappointed the disc is locked to Region B, but anyone with a compatible player who enjoys the movie should not hesitate to pick up a copy. Highly recommended.<br><br>Rocky Morton and Annabelle Jankel's Dinohattan doesn't stray too far from dystopias like Blade Runner (in fact, production designer David L. Snyder worked on both films), but there's something infectious about seeing filmmakers allowed to reinvent source material with such wild abandon. The Goombas are no longer mushrooms but gigantic lizard men decked out in burgundy war regalia. Snyder embraces the industrial look of the film's real-life shooting locale with metal walkways, dangling power cords, and neon lighting curling around gray concrete pillars. Even the Koopahari desert is filled with strange, anonymous men in hazmat-style suits driving \"sludge tankers\" filled with garbage bags. All of these settings are also draped in the fungus, a string-cheese-like substance that occasionally offers power-ups to the heroes, including the iconic Bob-omb. A fun score by Alan Silvestri adds another layer of cohesion. The Super Mario Bros. movie is a good adaptation of the video game, it has a darker grittier slant than the game which.works better, good movie, it's certainly a memorable one, an ambitious failure that's far more inventive and interesting than 10 more faithful failed video game adaptation.","user":"searching-91484","rank":[34,41]},{"title":"Super Mario Bros.: A film that is so bad, it's good.","rating":10,"date":"29 October 2019","review":"I have a soft spot for this movie. It ain't a good movie, like, at all. It's a Hollywood Trainwreck, but it's a trainwreck I'd watch over and over. I personally like Bob Hoskins as Mario, even if he thinks it was his worst part. The film is terrible, but in a very entertaining and delightful way. I recommend this film to anyone who gets a kick out of bad movies. If not, just stick to the NES classic.","user":"hybridfuryx","rank":[8,8]}]