[{"title":"You will BELIEVE a centipede can somersault sideways!!","rating":8,"date":"5 January 2005","review":"My introduction to kung fu movies was Jet Li's \"Fong Sai Yuk\", which blew me away, and I'm happy to say that \"The Last Hero In China\" is every bit as great as the former. Lots of good jokes (incl. bad guys with infectious fits of hysterical laughter), lots of impressive fighting - even if it's wire-aided -, lots of enjoyable acting, and an uproarious climactic fight scene at the end; rooster vs. centipede!<br><br>The story, starring the legendary kung fu doctor, Wong Fei-Hung, is an old-fashioned romp which is perfectly suited to Jet Li's acting talent and charisma. The rooster costume he dons at the end, and the fighting style he invents, are hilariously entertaining, and he pulls it off with flying colors. This is the sort of thing Jet Li does best.<br><br>8 out of 10.","user":"sarastro7","rank":[13,16]},{"title":"Very very funny!!","rating":10,"date":"2 July 2002","review":"Man, this has to be up there with Kung Fu Cult Master...<br><br>It's Jet Li as Wong Fei Hung with a twist....it's got a lot of laughs. There are a lot of characters in this one and with a guy named \"Mr. Pimp\", you can't help laughing!  The overcrowded training scene in Po Chi Lam is so funny when this poor guy keeps getting accidentally knocked out of the dojo. Wong's students Fu and So (who really earns the name Bucktooth in this one) add levity and do some decent fighting too.  The villain is hilarious with that classic evil laugh.  Not to be missed, do not forget to see Jet's rooster style.  C'mon, you know Jet Li is the man if he can do that scene and still looks hardcore.<br><br>Did I forget about the great fight scenes? (thanks to Yuen Woo Ping)  See Jet take out a guy while seated in a chair!!  Who else can take down three guys at once on only ONE jump??  Definitely watch the battle between Jet and kung fu great Gordon Liu (a passing of the torch). Cheung Man fights as well and is just great to look at. <br><br>\nDirector Jing Wong knew what he was doing and this film definitely doesn't take itself too seriously.  Add Jet Li, fights done by Yuen Woo Ping, Anita Yuen (whatta babe!), Cheung Man, and a lot of humor and you have one heck of a movie!!","user":"InzyWimzy","rank":[12,15]},{"title":"New entry of ¨Last hero in China¨ with the mythical figure ¨ Wong Fei-hung¨, well performed by Jet Li","rating":6,"date":"30 October 2007","review":"This film produced by mythic Golden Harvest is based on a legendary Chinese character : Wong Fei-hung, basic figure in the Chinese folklore. He was a famous practicing of ¨Hung gar Kung Fu¨and ¨Tai Chi¨ and his character served as starring in various film from art martial history. Here is well played by Jet Li, Wong has changed his art- martial school in Canton but results he has just moved near a brothel. Wong is worried and a prostitutes attempt to lure him. Soon he's fighting exaggerated nasties, corrupts authorities, judge and a monks from a weird temple dedicated to slave-trading where are kidnapped beautiful girls for human traffic. Meanwhile, Wong is poisoned and turned deaf but is healed by acupuncture by a traveling artists. Ultimately, there take place the parade the lion against centipede dance-fight with a spectacular and breathtaking struggle with hyperbolic Kung Fu, plenty of kicks, bounds and leaps.<br><br>The Wong character, both a doctor and professor of martial art, served as starring in various movies from arts-martial cinema history. Wong figure reflects the Chinese cultural identity facing foreigner invasion that submitted China, especially during XIX century (Boxers war, Opium war). Wong was played by Jet Li in six occasions, and appears in the Jackie Chan's ¨Drunken master¨films, besides appears as secondary character in the new version of ¨Iron Monkey¨ also titled ¨Wong Fei Hung¨ with Donnie Yen. Here, Jet Li reprise splendidly his role who became him as a real star in Asian markets . Li is the biggest Asian movie star after Jackie Chan, he won Chinese national championship in the acrobatic martial art, Wushu. Jet Li, lights in his fighting , using Kung Fu special slicks : drunken boxing, tiger or crane technical though many confronting are filmed with goofy humor and silly comedy. The fights are choreographed by means of cables by Woo- Yuen Ping, author of choreography of hits as Fearless, Kunfu hustle, Danny the dog, Kill Bill and Matrix, among others.","user":"ma-cortes","rank":[10,13]}]