[{"title":"A very nice Sci-Fi / Thriller / Comedy / TV film.","rating":10,"date":"29 July 2006","review":"A very nice Sci-Fi / Thriller / Comedy / TV film. It is a pity there is no DVD released so far. A time traveling extraterrestrial scientist, Travis Beck, from the future is sent back in time to put a quarter in a meter located in a small town on the edge of the Nevada desert to save the world. What looks like a simple job becomes very complicated. Right from the start things go wrong. Travis Beck materialize naked in front of June Kelly in the desert, twenty miles from the town where he has to be. And he gets unexpected protection by his ex-partner Bill Thermot for such a simple job. Of course there are some romantic / comedy moments between the time traveler and June Kelly and some over the top scenes between Travis Beck and the assassins. In the end, 'When Time Expires' is a very nice Sci-Fi comedy film worth at least a rent.","user":"stuffers","rank":[19,21]},{"title":"Nice film for a rainy afternoon","rating":10,"date":"5 November 2005","review":"Well i was just rooting through a box of videos from a few years ago and came across this film. its raining like hell today and freezing cold, so staying in is the best option with a mug of chocolate! :) The plot is involving and gets you trying to guess whats going on. a few twists here and there. couple of fights with your A-typical redneck town idiots too! it was a nice plain and very watchable film. nothing over complicated and dumbed down, relying on CGI or over editing to keep you entertained. just a film as it should be. After it ended i was left feeling it could have ended a little more slowly, not so abrupt. But still an overall nice film.","user":"phill_xmadman","rank":[16,20]},{"title":"probably not enough of a budget but very enjoyable","rating":8,"date":"5 March 2008","review":"good scifi. i enjoyed the concept, sure it could have been better, but ... it's not bad, yes, it is no 'alien' or 'starwars', but within its limitations, it was well done.<br><br>i tend to suspend reality a little when watching a movie, i am someone who really enjoys movie, so .. i might not be as critical as the next person.<br><br>i have been wanting a copy, in DVD, for years now, i caught this on a late nite program, and really enjoyed it. unless one is overly 'picky' i am sure that they will enjoy it, too.<br><br>whenever it comes out in DVD, i will get a copy, i enjoyed it that much.","user":"nitewinds","rank":[9,13]}]