[{"title":"one line summary","rating":18,"date":"18 March 2003","review":"I think there's a deeper level of comedy in this movie than the simple dumb jokes and pranks. Things like Junior's deadpan delivery of \"these people are dicks\" after meeting his new neighbours, his facial expressions and fist clenching whenever someone p***es him off, and his deadpan fake laughter when he gets his revenge. You never really know whether these kind of things are meant to convey the kid's evilness and be taken seriously within the context of the movie, or are just supposed to be completely ridiculous, which just makes them all the more hilarious, moreso than the more obvious actual jokes.","user":"pancake_repairman","rank":[15,18]},{"title":"This made the bottom 100?","rating":9,"date":"14 December 2003","review":"This may not be the best movie ever made, but I wouldn't consider it one of the worst.It's actually one of my favorites. It's a fun movie that's not meant to be taken seriously, and it has a happy ending.<br><br>9/10 stars- a nice way to kill two hours. If you want a bad movie, watch the 3rd Problem Child.","user":"muppetlass87","rank":[11,14]},{"title":"I like this film","rating":10,"date":"1 February 2006","review":"I think this is good, but the first one is best. This one had no need to be a 2nd movie they could have been fine with just Problem child i think, but it was funny. The first one had meaning and feeling, to know what orphans go through and how they're treated, this one i don't feel very much, except an evil woman who is taking away the only person that ever loved him and he only married Lawanda because he thought she loved children and he found out she doesn't so he married Annie because she understands what he's going through and she will cope with him and plus Junior and Trixie were friends. Junior finds a friend someone who can actually relate to him, so i think it's a nice message that you can always find somebody who can relate to you and make you feel special. I find it's funny and good and doesn't deserve a vote of 3.1","user":"hakyhiqz","rank":[19,28]}]