[{"title":"This one will stay with you a little bit","rating":9,"date":"4 August 1999","review":"Clever story with more depth that appears at first blush, directed with irony and a sardonic sense of humor by Gus Van Sant. Nicole Kidman plays an especially shallow TV weather person who gets some grunge kids to kill her husband for her. Her motive is, as Illeana Douglas, who plays the sister-in-law, says, \"he got in her way.\" This is a nice study of narcissism metastasized into psychopathology. She is headstrong, motivated and rather stupid. She thinks only of herself and would do anything for herself and would do anything to anybody who got in her way. And amazingly, she does.<br><br>Matt Dillon is wasted as the husband (in more ways than one). I'm surprised he agreed to do the part. Kidman is mesmerizing and makes us believe in a slightly unbelievable character. We've all known narcissistic little darlings who would kill you for the right shade of eye shadow, but to see it acted out so coldly and with such appalling stupidity, yet with a psychology so bizarre that it has to be real, fairly takes your breath away. It was especially apt that she had him killed so that her pointless little docu-drama \"Teens Speak Out\" could become newsworthy enough for national exposure. Consicously she doesn't realize this: she has no introspection; she just acts.<br><br>Also cute is the way the picture is framed: a pseudo-documentary within a pseudo-documentary. Everything is so well orchestrated that when Kidman gets her surprising, but entirely appropriate comeuppance at the end, we are quite pleased.<br><br>(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)","user":"DeeNine-2","rank":[96,110]},{"title":"A great performance by Nicole Kidman","rating":9,"date":"15 May 2005","review":"If you would like to see a really great performance by Nicole Kidman, pick up a copy of \"To Die For\" at your local video store. Directed by Gus Van Sant, screenplay by Buck Henry from the book by Joyce Maynard (both Henry and Maynard have bit parts in the film), \"To Die For\" is a wicked little gem of a film.<br><br>Kidman won the Golden Globe award for Best Actress for her performance, and frankly I thought she should have gotten the Academy Award (unless I remember incorrectly, I don't think she was even nominated for an Academy Award for it). But she is absolutely brilliant in it: chilling, funny, scary, sexy, and horrifically evil.<br><br>Kidman portrays Suzanne Stone-Maretto: a devious, calculating, self-centered woman who manipulates Larry Maretto (a very sympathetic performance by Matt Dillon) into marrying her, quickly tires of him when he tries to stand in her way of her greatest ambition in life, which is to be the next Diane Sawyer, and soon convinces her teenage lover to kill him for her. Sound familiar? \"To Die For\" was loosely based on the real-life story of Pamela Smart, who seduced her 15-year old lover into murdering her husband.<br><br>Joaquin Phoenix is Jimmy Emmett, the hapless student who becomes Suzanne's lover; Lydia Mertz is Alison Follard, a young girl who idolizes her; and Casey Affleck is Russel Hines, another student who gets caught up in the scheme. Illeana Douglas is great as Larry's acidic, loving sister Janice, who also gets one of the best lines in the film, and at the very beginning, no less; and Dan Hedaya is Larry's father, Joe Maretto. Dan Hedaya is a master of the \"Believe me, you don't want to see me mad\" performance, with obvious menace just under a calm surface. The casting is great, and the performances are all right on target.<br><br>Look for uncredited cameos by George Segal as a conference speaker, and David Cronenberg as...you'll just have to go see it.","user":"ClassicAndCampFilmReviews","rank":[42,46]},{"title":"One of the most underrated films of the 1990's","rating":8,"date":"29 March 2003","review":"A lot of people dislike To Die For.  The film's detractors largely find fault with its tone and subject matter.  It is really the epitome of black comedy, and anyone expecting either pure comedy or pure suspense will be very disappointed.<br><br>That said, To Die For deserves a place in film history as one of the sharpest satires of television and fame, ranking alongside films such as Network.  Forgive the cliche, but Nicole Kidman's performance is truly a revelation -- she shows talents that were clearly invisible in earlier travesties such as Far &amp; Away and are only now beginning to resurface. But the real discovery in this film is the magnificent Illeana Douglass.  It is scandalous that few people mention her amazing work when discussing To Die For.  If for nothing else, the film should be seen for the work of Kidman and Douglass.  (Note also that To Die For has one of Joaquin Phoenix's earliest roles.)<br><br>As other commentators here have suggested, you are not guaranteed to love this film.  Nonetheless, as far as I'm concerned, it's required viewing if you're a film fan.","user":"atlasfalcon","rank":[87,103]}]