[{"title":"Solid, well-executed anime","rating":20,"date":"20 March 2001","review":"Perfect Blue is a very strange film.  It's anime, but it's set in circa-1995 modern Tokyo, with a story in which everything could be explained in terms of natural phenomena and present-day technology.  Furthermore, it's a psychological thriller, a genre which probably hasn't ever been done with animation before.  <br><br>But even if Japan's animators dabbled in this genre more often, Perfect Blue would still be a bizarre film.  It starts off as a fairly conventional thriller about a teen pop singer who may be the target of a stalker, but then the movie goes completely insane, assaulting the viewer with rapid changes of scene, perspective, and context until we simply don't know what to believe anymore.  This is done so subtly and gradually that we become completely trapped in the movie's spell, and we end up just staring at the screen in horror, helpless to stop the nightmarish events from unfolding. Rarely has any movie so effectively conveyed the lunatic terror of a character who has lost touch with reality, and once the movie is over, all you can do is just sit there and try to figure everything out.  Have fun with it.  It's a good head scratch.<br><br>Unfortunately, the last minute or so of the movie is much too sappy and uplifting (especially the music on the end credits), cheapening the significance of everything that has gone before.  But as a whole, Perfect Blue is an incredibly haunting thriller, a scathing look at the world of showbusiness, and a very worthwhile film.","user":"Speechless","rank":[111,121]},{"title":"Intense thrill ride","rating":10,"date":"23 August 2002","review":"OK, this is definitely one anime movie that really has this creepy feel that clings to you as you watch.  The animation is really good as characters and movements appear so life-like, it seems like reality.  There's definitely the theme of 'identity' and Mima's difficulty distinguishing reality from illusion.  Her paranoia and fear tends to grab your attention and as she asks questions, you ask the same ones.  I thought the film also played well with celebrity infatuation and the price of fame.  It really had a lot going for it and the different camera angles give a very dreamy, mysterious atmosphere.  One great shot is the zoom out from Mima's apartment. I could've sworn that was a real city.  <br><br>\"Who are you?\" sums up this movie.  What a film.  By the way, CHAM's song is really catchy.","user":"InzyWimzy","rank":[85,94]},{"title":"A delusion within a nightmare...","rating":9,"date":"7 April 2003","review":"Perfect Blue takes many levels of reality, fiction, dream, and delusion, and merges them into an occasionally baffling but overall thrilling and satisfying film.<br><br>Mima is a rising pop star, not yet in the big time, but certainly on the way.  She and her management team decide that it is time for her to try something new, so she leaves her pop group to become an actress, and that is when the problems start.<br><br>Is there another Mima out there?  She is ghost-like, still a pop star, denying this new acting career, ever-smiling... but if she is real, she may be a brutal killer.  What of the stalker with the creepy face and violent temper?  Is he the one running the website which describes Mima's daily routine in obsessively minute detail?  If so, how does he know all these things?<br><br>Madness and nightmares blend with the scripts of the increasingly bizarre role Mima plays in her debut acting job.  Days repeat, life imitates script, and script imitates life.  Are the boundaries between reality and dreams breaking down? ...and who is killing those who Mima is closest to?<br><br>Perfect Blue will probably confuse you, and the ending will leave you thinking, but in these days of neat, clean-edged storytelling, a little confusion is good for the soul.<br><br>I highly recommend this to fans of thrillers and anime alike, plus it is a great introduction to the world of Japanese animation for those just getting their toes wet.  There are no giant robots or sex-crazed demons here, just a tight, clever psychological thriller with one hell of an ending.<br><br>Make sure you see it with Japanese dialogue and English subtitles.  That done, turn off the lights and prepare to be entertained.","user":"DexX","rank":[46,50]}]