[{"title":"Strong crime thriller / drama","rating":8,"date":"1 September 2019","review":"If you go into this expecting a $100 million action blockbuster you will be dissapointed. What this film delivers is a solid crime drama with some gritty and tense action scenes.\nA strong lead performance by Joel Kinnaman holds the story together and the film moves swiftly at a pace that never drags.\nIf you want a film that gives you actual story over mindless hollywood CGI action, then give this one a chance.","user":"jeff-1794","rank":[76,94]},{"title":"I loved this most critics disliked it.","rating":8,"date":"4 September 2019","review":"If I had read the critics I would have ignored this film.<br><br>I read a good review in The Sunday Express and went to see the film and liked it a lot.<br><br>I will give no plot spoilers but if you like tough but not dumb crime films you will like this one.\nIt does not have the biggest budget or the biggest action sequences but it is a good film.<br><br>The plot is fine but the film also benefits from good locations and a talented cast.<br><br>See this if you get the chance I think you will be glad you did.","user":"ib011f9545i","rank":[52,69]},{"title":"One of the best B-grade films I've seen!","rating":9,"date":"25 December 2019","review":"I've never heard of this film, nor seen any trailers, so I wasn't expecting much and decided to give it a go since there wasn't anything I haven't already seen to watch. Well, wow!<br><br>I'm shocked at some of the negative reviews so far. It goes to show you that you can't please everyone. It's either too Hollywood-ish or not Hollywood enough lol.<br><br>Here's why I REALLY liked it; For starters, this is actor Andrea Di Stefano second ever attempt at directing and writing, and compared to some of the films that have come out lately - and from seasoned writer and directors, he nailed it. Was it flawless? No. But considering is wasn't a big budget Hollywood production with seasoned filmmakers and with all lead cast being A-listers, but instead a British-made B-grade film with newb filmmakers, this was produced exceptionally well and is a winner imo.<br><br>I found the story very realistic and un-Hollywood-ish, which is refreshing for a change. Sure this story has been done many times before, but this one felt authentic. The last time I saw this type of genre movie that surprised and impressed me, was Shot Caller.<br><br>Casting was perfect, with all leads playing their respective roles on point, especially Joel Kinnaman who nailed his character.<br><br>Cinematography was great, the score/sound was fitting, and the production/location sets authentic. My only critique would be the pacing needed picking up in some parts, and/or the 113 min run-time trimmed down at least 10-15 mins.<br><br>Aside from that, this was one of the best B-grade films I've seen, with its unpredictable plot turn at every corner, excellent central performances, all packaged really well by an newbie filmmaker. It's a solid 9/10 from me!<br><br>To see any of my 1000+ ratings and 700+ reviews, click on my username.","user":"TheTopDawgCritic","rank":[40,53]}]