[{"title":"Suspend reality! Fun! Fun! Fun!","rating":10,"date":"10 August 1999","review":"The Real McCoy has one of the most impossible storylines around. But how can you not love a movie which contains the line, \"What's not normal about getting on a plane with your mom and going down to Rio with 3 million dollars?\" Some parts, especially the set-up, are slow, but on the whole it's a great, implausible romp. It's also a must for Kilmer and Basinger fans.","user":"bianca-13","rank":[20,24]},{"title":"Average heist movie","rating":5,"date":"25 April 2002","review":"This is the sort of film that will do if nothing else is on but not much else. Its a heist film with Kim Basinger and Val Kilmer and everything in it has been done before and done better. The bank robbery at the end is a bit of a let down because it just seems too easy. It was directed by the man who brought us the fabulous Highlander, but sadly also the truly awful Highlander 2, this film is somewhere in between. The only plus points are the always great to look at Kim Basinger, and Val Kilmer in a different sort of role to his usual stuff. I think Kim Basinger is a great actress but like most females in Hollywood seems to struggle to get decent films to star in, not counting the awesome LA Confidential of course. All in all a very average film ***5/10***","user":"LuboLarsson","rank":[17,21]},{"title":"Pleasantly Surprising","rating":7,"date":"4 July 2007","review":"I'm just a hair or two from labeling the effort above average, though this movie can still supply sufficient entertainment. Were this film to be remade today it would not need much to attain the status of Above Average. I would however abstain from casting the lead with anyone with similar physical attributes as Ms.Basinger only because to date who robs banks and looks like that!! Very \"clean\" by todays standards for most genre. Terry Stamp plays the villain with just a tad less venom than IS required for his role, he fall short of making me hate him enough, and Val Kilmer does a superb job with portraying his character. All in all absolutely worth the 1 hour &amp; 45 minutes.","user":"rpm216","rank":[10,12]}]