[{"title":"Read between the lines!","rating":14,"date":"14 November 2001","review":"I read through a few of these reviews and the general analysis seemed to be that this movie sucks more than the lead character does in the back room of the Cheetah Club. Well, I guess if you take it at face value, it does.<br><br>\nHowever, it's not meant to be taken that way (internally, with a glass of water?), and it's a shame that so many people did. Really, 'Showgirls' is a campy, funny movie. It's a riot. And it's supposed to be.<br><br>Elizabeth Berkley, in the lead role, plays her part like an actress on one of those day-time soaps - which is probably exactly what Verhoeven wanted. She does everything dramatically. She sits down, dramatically; she takes off her jacket, dramatically; and if you watch closely enough you'll even see her eating fries dramatically.<br><br>Gina Gershon as femme fatale/lead dancer Cristal gives the best performance of the film. She obviously is in sync with the director and has a lot of fun with the part, and if you only watch it for one reason, watch it for her. Because, in the words of L'Oreal, she's worth it. She's a great talent and it's a shame she's not recognised more widely.<br><br>Would I recommend it? I don't know. It depends on your taste. If you're looking for a drama, go elsewhere. If you're looking for a quirky, funny movie, and you don't mind lots of naked ladies running around all over the place (yes, even if you're female - I am, and I liked it), go rent it. It might surprise you.","user":"candigrrl","rank":[230,277]},{"title":"A Misunderstood Classic","rating":10,"date":"9 August 2000","review":"Calling Showgirls \"poorly acted\" or \"sexist\" completely misses the point; it's like accusing Britney Spears of not being a \"real musician,\" as though you've discovered something.<br><br>Of *course* Showgirls is exploitative and demeaning to women. Almost all Hollywood movies are demeaning to women.  Almost all of them are male-written, male-directed male fantasies. But most of them cover this fact with a thin veneer of \"empowerment\" and \"sensitivity,\" making perfunctory, surface concessions to political correctness. It's hypocritical, dishonest and has horrible long-term effects on the psyches of young impressionable girls (and boys).  The brilliance of Showgirls is that it gathers all of the worst Hollywood masculine excess and throws it unapologetically in our faces. The movie is straight-from-the-id, primal, brutish male fantasy.  Every woman in the movie is a laughable caricature who advances, if at all, by deceiving other women and becoming a sexual object for men.  The \"heroine,\" Nomi, crosses every line, sells every shred of dignity, physically assaults her female competitors, sleeps with her boss (in the most over-the-top sex scene in cinematic history), gets her best friend raped... and at the end of the film, claims that she has gambled and won \"herself.\" This tragi-comic nod to empowerment is a slap to the face of anyone who's been paying attention.<br><br>Whether Esterhauz and Verhoeven intended it as such, Showgirls is at once a camp classic and a sly satire, an example of everything our culture at once wallows in and disavows.  Sure, you can react with righteous indignation, waggle your finger at the movie, and pat yourself on the back for being so enlightened.  But maybe you should take a look around, at the billboards, the commercials, the sitcoms, the movies, the music videos, your own prejudices... and think about whether you can't find a better target.","user":"droberts@imdb","rank":[368,458]},{"title":"Beyond the Valley of the Showgirls","rating":9,"date":"2 May 2003","review":"Every once in a while, a film comes along that strikes a chord with audiences in such a way that they react strongly; sometimes, because of this, the film can become a hit. The opposite can happen as well. \"Showgirls\" drew some venomous reviews from both critics and audiences, and it quickly gained a reputation as a bad movie--it became a buzzword and a joke immediately. An entire generation of filmgoers who were too young to see \"Showgirls\" (or else uninterested in it) were instructed that it was a bad movie when it was mentioned as such in the all-ages trailer for the big hit \"Scream 2\". More recently, people like Tarantino and a few respected film critics began to admit that they loved the film, and while it's never going to gain acceptance as a serious film, at least people are able to see \"Showgirls\" for what it is instead an opinion based on legend.<br><br>Yes, \"Showgirls\" is trashy and absurd, but we do enjoy those kinds of films. Are we saying that it's wrong to make them? I think the main problem with \"Showgirls\" is that it's a great looking, big budget film that is a pastiche at heart. Whatever people were expecting at the time of its release, they were definitely not expecting a new \"Beyond the Vally of the Dolls\" (which, like \"Showgirls\", got the strongest possible rating at the time of its release). Also similar to Russ Meyer, Verhoeven takes Joe Esztherhas's crazy script and directs his actors to be straight faced at all times, saying these lines as if they mean it. Just like in 1970, this defied the expectations of the audience, and it got the movie panned. <br><br>Whatever Paul Verhoeven intended with this film, it's hard to imagine that this happened accidentally, and even the people who claim to like \"Showgirls\" because it's \"so bad\" are missing the point just a little. I think the bizarre qualities of the film are mostly intentional, and it doesn't stray too far in style from successful films Verhoeven made before this, mostly \"Basic Instinct\". In fact, it seems to me that the only true bungling has been MGM's marketing. Even now, as they reap the benefits of it being a cult classic that has sold extremely well on home video, their idea of how to round out the DVD edition is to get somebody totally uninvolved with the film to deliver a sometimes amusing but otherwise unnecessary commentary about the obvious instead of paying Elizabeth Berkley a couple thousand dollars to offer her own commentary on the film, which would have been a couple thousand times better.<br><br>Eszterhas writes trashy movies intended to be a good time, and \"Showgirls\" is certainly that. But I can't imagine Verhoeven thinking that this movie would connect with audiences on a large scale basis; the trailers implied that \"Showgirls\" would be similar to \"Basic Instinct\", which it is not. Maybe if this movie had come later, after another failed attempt to recreate \"Basic Instinct\", people might have accepted it as its own type of film. The dialog is way over the top, and how utterly boring would the movie have been otherwise? Other parts of the film are marvelously conceived, and Verhoeven keeps the film in motion at all times. The only thing that truly spoils the fun is a violent rape scene, although it does fit with the reptilian tone of the movie, full of victims and victimizers; it is the one thing that grounds the film in the real world with real violence. It may not have been intentional, but it presents an interesting concept: if the rape had happened to any other character, it would not have been the same. Because it happens to the film's only sympathetic character, it carries a great impact. The cinematography is flawless, and the sets are always interesting and sometimes funny (like the bizarre stage numbers). Pay attention to the soundtrack as well, Verhoeven has an excellent collection of songs, many of them written specifically for the film.<br><br>Watching Elizabeth Berkley's career self-destruct on camera is one of the film's most morbidly fascinating pleasures. I beg to differ with people who call her performance \"bad\"; what actress could have played this part and made it anything other than what Berkley did? The truth is, she worked wonders with a character that was impossible to play. Her dancing is both ridiculous and a marvel. How she can bend herself into those positions and hit those marks, not to mention her famous lap dance gyrations, must be seen to be believed. Gina Gershon is great too, a leering predator who manages to be both vulnerable and invincible at the same time, and only because she seems to be the only actor in the troupe that's in on the joke. Kyle McLachlan is skeezy, with a haircut and a smile that make him resemble the creature from the \"ALIEN\" franchise more than a human being. You expect an inner jaw to emerge from his mouth at any moment.<br><br>\"Showgirls\" is ridiculous, but to me it's also multifaceted and fascinating, appealing to the cynic in all of us. It fails as an engaging story, but the film itself doesn't fail to engage the viewer at all; you can laugh at it (or with it), and it accomplishes something subversive in the way it makes you consider the filmmakers and actors involved. I think most people just say \"Showgirls\" is a bad movie because they've already been told it's a bad movie. I revisit it more often than some of the other films in my collection, and it gets more absurd, funny, gross, and sometimes even beautiful, every time I watch it. Bad movies are boring movies. \"Showgirls\" is not.","user":"GroovyDoom","rank":[80,101]}]