[{"title":"The Women of Spring Break k Welcome to Paradise","rating":10,"date":"17 July 2006","review":"I enjoyed watching this movie!! In fact i watched it twice. The actors and actresses in this movie were excellent. Shelley Long is a favorite actress of mine as is Mel Harris. I can't remember seeing a better family movie. I feel youngsters could watch this without any problems. Is this movie available for sale. I have been looking for a long time for a copy of this movie. Will it ever come out on a DVD? Our satellite dish server showed this movie twice one time about one and one half years ago. I don't remember the channel it was on. I now wish that I would of wrote down which channel it was. Is this movie going to run again on any networks? Once again is it possible to purchase this movie. Does any place carry it?","user":"msfrisco","rank":[1,1]},{"title":"A REALLY LOVELY FUN MOVIE","rating":10,"date":"31 August 2004","review":"A film with Shelley Long is usually a fun film and this certainly is. Two excellent female co stars one with a beautiful Southern accent Two very good mature male actors one French and another one with a lovely Southern accent make up the romance interest. The icing on the cake is seeing Miss Long with her lovely smile, beautiful wide open eyes and a voice that sounds like she is sucking a plum time and time again. And the end of the film is when Shelley is reunited with her husband who she has missed soo much even though she enjoyed her holiday. This film is so easy and soo enjoyable to watch that I am amazed it isn't seen on television more. The location of the film is a lovely beach called Paradise and it is soo enjoyable that you can forsake your holiday and sit an watch this film instead and loads an loads of 20 year olds thoroughly enjoying themselves too.","user":"dkrob","rank":[2,4]},{"title":"Welcome to Paradise","rating":25,"date":"25 October 2002","review":"Three friends from Columbus, Ohio go to Paradise Beach, Florida during Spring Break week to revisit the vacation spot of their youth 20 years ago. Mel Harris is Claire Denowski, an advertising executive who goes on assignment, Shelley Long is housewife and mother Anne Winger, and Delane Matthews is sales woman and recently divorced Denise Discotis. Claire's company has hired French Olympic skier Jean-Luc Perron (Francois-Eric Gendron) as a spokesperson, and Claire finds herself attracted to him, Denise meets her lifeguard first love Matt Sheridan (Michael McGrady), and Anne is bothered by the attentions of their hotel desk manager George Peck (Ian Ziering), in spite of Anne being the one of the three who is married.<br><br>\nThe teleplay by Bart Baker places `the fearless three' in an adolescent environment of buffed bodies, hi-jinks, alcohol and sex, where they are so conscious of the age difference that they wear make-up on the beach, and each has a turn in being humiliated. The worst is Anne, since the only time Long is shown to be desirable is when she is alone, painting her toenails with a leg outstretched. Her situation with George, who knows she is married but pursues her anyway, allows him to scold her for her justifiable rejection. (That Ziering acts as narcissistically as on his TV series Beverly Hills 90210 makes us pity Anne even more). There is also an odd use of cross-dressing, where the threesome are shown to be most ungenerous.<br><br>\nHarris uses eye mugging, gives Anne a long look of comic anger when she learns of Anne roping Claire into shared accomodation at their frat hotel, and is funny when yelling at someone who crashes into her on the street with `I'm walking here'. The treatment interestingly plays off Harris' mannish body language, though Jean-Luc's first view of Claire has Harris lit beautifully, and she is reduced to jumping into a pool in bra and panties. Jean-Luc surprises Claire eating seafood wearing a bib, and drinking beer in a six-pak as she sits in a masculine pose, and when she is forced into modelling with Jean-Luc for the campaign, her protestations are ironic in light of Harris' initial modelling days.<br><br>Director Bill Norton uses slow motion when all the women dive into the pool, and various other sporting activities, but his use of extras for flesh quotant borders on sleaze.","user":"petershelleyau","rank":[1,2]}]