[{"title":"Interesting & Nostalgic...","rating":8,"date":"26 April 2003","review":"\"Grace Of My Heart\" is similar to \"Valley Of The Dolls\" because the characters, in both films, are \"loosely based\" on actual people showing their rise &amp; fall in show business. Illeana Douglas plays singer/songwriter Edna Buxton who becomes Denise Waverly. She's based on Carol Klein who became Carole King. A New Yorker who churned out hit after hit in the famous Brill Building. Where some of the action in \"Grace Of My Heart\" also takes place. John Turturro is based on record producer Phil Spector (complete with bad toupee &amp; the wearing of sunglasses indoors). Matt Dillon fronts \"The Riptides\" (The Beach Boys). \"The Luminaires\" are based on girl groups like The Shirelles &amp; The Chiffons. Bridget Fonda portrays \"teenaged\" angst-ridden, big-haired, bubblegum idol &amp; lesbian Kelly Porter. There's no question that she's based on Lesley Gore. Interestingly, Lesley Gore wrote the tune Bridget lip synch's in the film, \"My Secret Love\" (which is a homage to Lesley's \"You Don't Own Me\"). The music in this movie is very good &amp; has that 60's, 70's feel to it. I just wish the soundtrack album had included the tunes \"Hey There\" &amp; \"Grace Of My Heart\" by Kristen Vigard who did the vocals for Illeana Douglas. If you like nostalgic movies about pop music like \"The Idolmaker\", \"Grease\", \"That Thing You Do\" &amp; \"Hairspray\" you'll like this too.","user":"Blooeyz2001","rank":[35,36]},{"title":"\"Grace of My Heart\" is a wonderful movie","rating":10,"date":"22 December 2005","review":"I was reminded of how really good this movie is today when I saw it on T.V. (with commercials ugh) I've seen it a few times before and every time I watch it, I bawl like a baby and I'm a guy. A really tough guy. But this movie goes straight to my heart and puts a squeeze on it through the wonderful music, the sweet nostalgia and what a cast!<br><br>Illeana Douglas is beautiful and she really plays her character with great talent. She's supported by a strong cast and how can you go wrong with Turturro playing Phil Specter? The first time I saw this there was something familiar about the music; the songs, like \"God give me Strength\". As much as I like Elvis Costello, that scene of Illeana performing it for Matt (Brian Wilson) Dillon was such a unique delivery of a pure and powerful vocal. I later found that the 'familiarity' is Burt Bacharach and the 'voice' is Kristin Vigard: Wow! <br><br>Back in those days there was such an explosion of music and creativity and Burt Bacharach was truly a pop force.<br><br>I loved the Brill Building scenes, especially when they were working on the songs. I thought the movie lost something when it moved west to California but was deeply moved by Douglas and Turturro 'having it out' at the empty poolside. The final song with the flashbacks and her crowning achievement of recording that \"one great album\" had me weeping again. I really like this movie so I ordered the DVD online.","user":"mk_c2002","rank":[29,31]},{"title":"I can't believe more people don't know about this great movie!","rating":10,"date":"24 February 2002","review":"I rented this movie a couple years ago because I like Illeana Douglas.  I ended up buying 20 copies of it to give to friends as gifts for Christmas that year.  The story is compelling, the cast is amazing...I can't believe more people don't know about this movie.  The original music is great, too. The film moves seamlessly from the fifties through the seventies due in part to the talent of the actors, but also due to the impressive costume and makeup work and the wonderful original music written for each period. Y'know how people often say of good movies, \"You'll laugh/You'll cry\"? Well this is one of those.","user":"porterkelly","rank":[23,26]}]