[{"title":"This Brought me back","rating":5,"date":"6 February 2005","review":"When I was a kid, I loved dinosaurs. Jurrasic Park, The Land Before Time, (the original, not the crappy umpteen sequels), and We're Back especially were my favorite movies.<br><br>Now when I look at it again, I see that the movie's plot made no sense, the characters were stereotypical, and that it was sappy at the end.<br><br>But as a kid, I didn't care. What could be cooler than a singing tyrannosaurus(with the exception of Barney)? I didn't care if the plot made no sense to an adult because it made perfect sense to me. I never wondered why Rex didn't know what lunch was but instantly knew the tune of \"Row your boat\". I didn't see the average example of \"unhappy\" children and a villain that was one sided and overly symbolic. I saw some cool kids and a crazy scary guy with a screw for an eyeball that somehow had magical powers.<br><br>Because that's what this movie was and is: a children's movie. And somehow in all the critic reviews and hype and over analyzation of movies in general, I forgot what it was like to watch a movie as a kid and to just enjoy it regardless of plot and characters.<br><br>I get the same feeling from watching old Saturday morning cartoons. They were stupid, and the plots were ridiculous, but I loved them. Bring on the genetic mutants who know kung-fu and fight crime! Throw in a few aliens and you've got a good thing to eat sugary cereal to! Anyway, I guess the real reason I wrote this review was to perhaps remind people to simplify their lives from time to time, and quit over-analyzing. You enjoy more that way.","user":"Watcher_of_u","rank":[25,31]},{"title":"Kids, Dinosaurs, a Parade...It just can't lose!","rating":23,"date":"23 July 1999","review":"The basic plot: Four dinosaurs (made more intelligent by a kindly scientist) are given the chance to delight children by coming into the future to live with Dr. Bleeb at the Museum of Natural History.<br><br>Why it works: Kids love dinosaurs (especially big cuddly talking ones that sound like John Goodman), kindly scientists, time travel, and (when given the chance) Natural History.<br><br>The animation is good quality, the basic premise is fun, the music (with a surprise by Thomas Dolby) is good and well placed (no one bursting into an annoying song every 30 seconds) and the voice talents are wonderful, featuring well known actors such as Martin Short and Rhea Perlman, voices we know from elsewhere--Walter Cronkite and Julia Child, and veteran Voicers Yeardley Smith (the unsinkable Lisa Simpson) and the remarkable Charles Fleischer (Roger Rabbit).<br><br>Some characters needed a little more character...a little more explanation (such as Professor Screweyes--who went mad and turned evil because he lost his eye--??).  But hey, this is a kids' movie, right?  Let it slide.<br><br>Will kids' like it? Absolutely.  And the adults?  Relax and have a good time, and try not to think too much.","user":"Cari-8","rank":[19,23]},{"title":"Silly and cute, but nothing else.","rating":6,"date":"5 January 2007","review":"How ironic it is that in 1993, two dinosaur pictures courtesy of Steven Spielberg would hit the theaters. One of them was a runaway box-office hit, the live-action spectacular JURASSIC PARK; the other was WE'RE BACK! A DINOSAUR'S STORY, which came and went without much fanfare. An animated film from Spielberg's London-based Amblimation Studios (AN American TAIL: FIEVEL GOES WEST and the underrated BALTO), WE'RE BACK has been dubbed as a sort of \"Jurassic Park, Jr.\" Actually, that might be a bit inaccurate, for while there is one not so subtle reference to the Spielberg monster hit (a marquee theater advertising the movie), this film has none of the visceral, nail-biting scares of JURASSIC PARK. As it is a kid's movie, one shouldn't expect too much.<br><br>Even so, this \"dinosaur's story\" is a bit of a curious creation. Based on a children's book by author Hudson Talbott, the movie involves a quartet of prehistoric giants who are taken aboard the spaceship of an elderly time-traveler, Captain NewEyes. The foursome is treated to some sort of cereal that transforms them from vicious but dumb monsters into talking creatures with human qualities (think Barney and his friends). Before long, the four dinosaurs--with the names of Rex, Elsa, Dweeb, and Woog--are whisked to modern day New York City where they meet two children: tough-talking (but secretly soft-hearted) Louie and a neglected cutie named Cecilia, both of who are running away from home. Together with their new pals, the dinosaurs crash the Thanksgiving Parade (which involves a very silly song-and-dance number), escape the police, and get sidetracked by the evil owner of a fright-show circus (NewEyes' brother ScrewEyes)... all before arriving at their destination, the Museum of Natural History, where the dinosaurs are to become real-life talking exhibits for many children.<br><br>The plot, such as it is, is pretty wishy-washy, and the routine execution barely elevates WE'RE BACK above anything but your typical, average kids animated fare. The animation itself is mostly serviceable and includes some interesting computer-generated effects, but it's not up to Disney quality... and at times I felt that there were some frames stolen from a more superior animated film about dinosaurs, Don Bluth's THE LAND BEFORE TIME. John Patrick Shanley's screenplay has few lines to appeal to older viewers, much less a plethora of characters one are likely to remember. The four dinosaurs, for instance, are your typical talking animals that, while cuddly and likable, never develop into fully realized personalities, and their supporting co-stars don't get much to do either.<br><br>Probably the only character who does show any depth is Louie, the freckle-faced street kid. When we first meet Louie he acts pretty fresh and self-centered; but as the movie develops, his more soft qualities shine through, whether he saves Rex from drowning or befriending Cecilia to cheer her up. He even admits, in a tearful sequence, how he uses his tough demeanor to hide his own fear. If anything, it's really Louie who steals the movie and makes it worthwhile. His relationship with Cecilia (who is less well-defined than Louie, but that's irrelevant) although more romantic than it has to be, is very nicely handled and is the highest point of the film. (The moments where Cecilia flirts with Louie are quite funny.) Equally pleasing is the characterization of Professor ScrewEyes, the villain of the piece. He only shows up in the second half of the picture, but commands his screen-time with devious manipulation and pure nastiness. In addition, his demeanor of tapping into people's nightmares and a hypnotic stare render him a menace to be feared. ScrewEyes may be a bizarre baddie, but he works all the same.<br><br>That leads to another problem of WE'RE BACK. The first half is lighthearted (and outrageously unbelievable) silliness, but midway through the picture becomes dark--particularly the scenes involving ScrewEyes' fright-show circus, which are executed in a way that may be too intense for small fry. This unbalanced shift in tone calls the film's target audience into question. Kids in the 5-12 age group should be fine, but older viewers expecting more may find it to be too silly and uninspired. And the very young, too, could be traumatized by the aforementioned scary scenes.<br><br>And yet, in spite of saying all this, there is something rather likable about WE'RE BACK--A DINOSAUR'S STORY. Its plot is outrageous, sure, and the movie is little more than just a cute, forgettable time-passer. But it has its heart in the right place, and there are some tender moments--one sequence, in which Rex and company make the ultimate sacrifice to save Louie and Cecilia from eternal life as chimps in ScrewEyes' circus, is genuinely moving, especially when Rex's gentle touch reverts the kids to normal. This is done in a very subtle, effective way that stayed with me for a long while. The voice cast includes some solid performances, too, notably John Goodman as the gruff yet gentle Rex, Walter Cronkite as Captain NewEyes (and yes, he says his trademark \"that's the way it is\" toward the end), and Martin Short in a cameo as a comic clown. The standouts are Joey Shea, who sizzles with attitude and likability as Louie, and Kenneth Mars (Triton in THE LITTLE MERMAID and Grandpa Longneck in the LAND BEFORE TIME sequels), chewing the scenery as the fearsome ScrewEyes. Yeardley Smith's Cecilia is the one voice I take issue with--she doesn't exactly sound like a young girl, and most of the other voices--Jay Leno, Rhea Perlman, Charles Fleischer, and Julia Child--all seem to be just in the movie for the sake of, well, being there. The musical score by James Horner is beautiful, although at times it does sound like a rehash of many of his other scores (a trait not uncommon with most of the composer's work, it seems).<br><br>In short, WE'RE BACK is passable fare as a family animated film; it's cute and funny, but that's about it.","user":"JTurner82","rank":[10,11]}]