[{"title":"Surprisingly Good","rating":7,"date":"8 September 2006","review":"An eccentric funeral director shares four tales of horror from an African American perspective with three young thugs. The first involves a man who exacts his revenge from beyond the grave after being murdered by crooked cops. The next tells of a boy alleged torment at the hands of a monster may not be tall tales. A white supremacist politician haunted by forces of injustices past highlights the third story, while the fourth focuses on a gangbanger undergoing frightening behavior modification.<br><br>TALES FROM THE HOOD benefits enormously from solid writing and an entertaining pace. With a running time of under 100 minutes, director Rusty Cundieff does an admirable job of cramming everything he's got into each vignette. Few of us have the stomach for a horror movie with a message, but this is one that succeeds. It has things to say about racism in our society and says them in ways in which they've never been said before. Though definitely not for all tastes, TALES FROM THE HOOD is a surprisingly solid horror anthology.<br><br>* *Cast Note: Clarence Williams III, who plays the funeral director, is best known as Linc from THE MOD SQUAD television series.","user":"ReelCheese","rank":[29,33]},{"title":"Mediocre horror anthology film with one excellent tale","rating":28,"date":"28 June 1999","review":"Tales From the Hood, another horror anthology film dripping with EC comics-style ghoulishness, strings together four stories told by a wild-haired, macabre funeral director (Clarence Williams III) to a trio of gangbangers seeking their missing drug stash in a mortuary.  Virtually all of the tales are familiar -- walking corpses and voodoo dolls are staples of the format -- but director Rusty Cundieff makes every effort to inject the proceedings with social morality.  Child abuse, racism, and police brutality each get a pretty heavy-handed treatment, but the last story, involving a voluntary \"behavior modification\" technique for an unrepentant killer (ala A Clockwork Orange) explodes off the screen.  In the film's most powerful sequence, Cundieff serves up a quickly cut montage of unsettling images culled from a number of state historical archives depicting vicious, stomach-churning lynchings meant to deter the rapacious young killer from wanting to harm any more people.  It's potent stuff, and makes one wish the rest of the film had this kind of intensity.","user":"pooch-8","rank":[22,28]},{"title":"\"Horror\" is not the right word here folks","rating":8,"date":"7 April 2002","review":"\"Tales from the Hood\" centers around three drug-dealing youths. The movie opens up with the three of them walking up to a funeral home run by a creepy mortician named Simms(Clarence Williams III). They are at the funeral home to pick up a stash of drugs. Instead of getting right down to business, Simms entertains the three men with some rather grisly stories. <br><br>In the first story, \"Rogue Cop Revelation\", three white, racist cops murder a black politician; all the while a black police officer is watching the entire thing. The black officer is then told that if he opens his mouth, he will join the politician. A year later, the politician from beyond the grave contacts the officer so he can get revenge on the cops who killed him.<br><br>In the second story, \"Boys Do Get Bruised\", as some people have claimed, is an interesting twist right out of \"The Twilight Zone\". A new boy at a school shows up the first day with a bunch of bruises on his arm. His teacher begins to get very concerned about this. The boy tells the teacher he got the bruises from the \"monster\" that lives in his house.<br><br>In the third story, \"KKK Comeuppance\", a former Ku Klux Klansman-turned-politician moves into a mansion that was once the sight of a horrible slave massacre that occurred around the end of the Civil War. There is a lot of distrust towards him, because of his shady history. He is told by many of the protesters that a bunch of voodoo dolls, which are inhabited by the souls of the murdered slaves, are still on the mansion grounds. The politician shrugs all of this off as just local superstition, until his assistant (who might I add is black) dies mysteriously. Soon it becomes clear that the politician is not alone in his brand new house.<br><br>In the fourth story, \"Hard Core Convert\", a gangster is arrested and sentenced to life imprisonment for murder. Some years after being sent to prison, he's offered a chance to be released, if he agrees to be a participant in a brand new experiment. It is here that elements of \"A Clockwork Orange\" begin to come into play.<br><br>Being African-American myself I feel \"Tales from the Hood\" is one of the most important \"horror\" films to come out of the nineties. I really like the fact that all though most of these stories are fiction, they all are based on reality and have many issues surrounding the African-American community that need to be addressed. Issues such as police brutality, child abuse, racism, and black-on-black crime are all brought to light here. I admit that although the horror elements of the movie are a bit cheesy, it does get its message across without much trouble. The stories themselves, while they aren't too original, are very well written. <br><br>The first segment, which may be the weakest of the four stories, has one of the more important issues, which is police brutality. The idea is sooner or later, the cops would get their comeuppance. You see the three white officers probably still would not have been proved guilty, even if the black officer had said something. Surprisingly, the black officer is not spared from the dead politician's wrath.<br><br>The second story is probably the one that I find the most ironic. This story proves that monsters do exist in real life, although they may not always be in the form of what we've come to expect.<br><br>The third story is probably the mediocre of the bunch. This story gives a new meaning \"reparations\". It also shows us that racism really is ugly and that sooner or later, somebody in the present is going to pay for someone else's past evil deeds.<br><br>The fourth story will prove to be the most important as it revolves around the topic of black-on-black crime. The main character of this story is an uncaring and unsympathetic young man who would kill everyone on Earth given the chance. The best example of this is during the sensory deprivation scene where he begins seeing hallucinations of all the people he's killed. It also shows when innocent people are caught in the crossfire. The scariest part of this whole movie takes place during this segment of the film. It is in the part where the main character is sitting in the cage before his treatment and he starts a conversation with the man sitting beside him. The man as we quickly see, is a white supremacist. The man then begins talking about how the gangbangers are always killing each other off, thus helping along his theory of \"cleansing\". What makes this so scary is that it is true and that nothing is being done about it. The issue of gang violence is something that really needs to be addressed.<br><br>\"Tales from the Hood\" is a very good movie no doubt, despite its flaws. But you need to watch this movie, not expecting a horror film, but a very important social studies lesson.","user":"dee.reid","rank":[41,58]}]