[{"title":"Science buffs beware!!!","rating":6,"date":"13 December 2006","review":"This movie is self-contradicting. It takes an absurd plot and tries to pass it off as good science fiction. Yet not all parts of the film were so totally \"out there\" as to make it unwatchable as a whole. A great chase scene in the desert is an example of this. Add to this an element of sabotage, and the film is saved from itself.<br><br>The year is 2050, and the sun is threatening a \"megalo flare\" that will destroy the earth if it reaches us. Now, flares happen all the time on the sun. You only have to look at close-up photos of the sun to know this. Most last several hours and shoot 100,000 miles off the solar surface in an arc that's really quite impressive to see. But a flare that shoots out and spans the 93 million miles between Earth and sun? Not only that, but to find the earth in its orbit around the sun and strike right there? That's a little too convenient, at least for the plot's sake. Let's face it. If there were no emergency, there'd be no need for the mission to avert it.<br><br>The plot to save Earth is to send a talking anti-matter bomb into the sun and make the flare point somewhere else. And here's where the plot thickens, so to speak. Forget for a moment that it's over a million degrees in the corona, the part of the sun you can see in a total eclipse. It's going to get hot as you approach the sun. Yet the mission proceeds as if they have some super cooling process that will save them. And don't get me started on the bomb itself. Anti-matter is unstable by nature. So you're going to put enough of it to theoretically disrupt the sun's energy flow, all the while knowing that the sun itself is enough vaporize anything solid that approaches it? That's a suicide mission in itself.<br><br>As if all this weren't enough, now you have a saboteur on board that threatens the mission at various stages. A corporation on Earth doesn't believe the flare will happen, and is buying up resources while cheap and the scare lasts. So you have that element of competition. Will the mission succeed or won't it? Will the Helios (the vessel) escape the sun's gravitational pull and be able to return home?<br><br>Solar Crisis is fun to watch, if you can get past the absurdity. Just don't take it seriously, or you'll get burned.","user":"SmgBag1","rank":[13,16]},{"title":"Crisis is right","rating":21,"date":"21 July 1999","review":"What was Charlton Heston thinking when he signed up for this disaster?? Alright, I'll be fair.  I rented Solar Crisis (translation: wasted a buck) with an open mind.  It had an interesting plot, so it seemed, and some famous guys.  So there must be something there.  Man oh man was I wrong.  I realized that with the opening scene in which cheap subtitles scrolled across the screen, describing the Impeding Doom of Earth.  To make matters worse, a voice-over further insulted my intelligence by reading the words too.  Gee, since I was dumb enough to rent the film, they must figure I can't read either.  Then came the real blow: The weak, weak acting (usually showcased by laughably over-dramatic monologues) coupled with the bland, bland writing, strewn together with the lousy, lousy soundtrack make for one nose-wrinkling mess.  Dr. Haas was especially bad, as was the ship's commander whose name escapes me.  We are treated to such memorable lines as: \"Our only security blanket out there is ourselves\" and the immortal \"I'm the only one who can ever free you!\" Please.  Free me, for the love of God.","user":"Altaira","rank":[20,27]},{"title":"An Alan Smithee Directed Film-You know it's got to be good","rating":5,"date":"12 February 2007","review":"Alright first off: this is not a great film, it is not even a particularly good film, but I have seen many that were much worse. I am curious as to who the director was who ducked out on this one and turned it over to Alan Smithee (for those not in the know: Alan Smithee is a name that the DGA assigns to films who's directors do not want to admit a connection to for some reason, artistic of otherwise.)<br><br>Some of the performances were a little flat, although Jack Palance was as eccentrically off beat as usual. That alone always gives any film a one point boost. Peter Boyle was just as underplayed a villain as usual, not getting his hands dirty. But there was a lot of real tension in the film. In anyone was over the top it was Dorian Harewood, and I suspect that was because of bad direction. I suspect with a better director, budget and script this could have been a much better film. I still enjoyed it though. Just one of my little quirks I guess.","user":"ozthegreatat42330","rank":[7,8]}]