[{"title":"Peculiar but enjoyable early 80's film","rating":8,"date":"13 August 2018","review":"Watched this when it was released on the excellent BFI Flipside range and a worthy addition to the range it is. \nSome of the early scenes in an idyllic village have an almost ethereal quality to them. \nIt's really good to see Tracey Hyde again as not seen her anything other than Melody, albeit a very different role. \nThings quickly change from an English village cricket match to a brutal murder. Some of the scenes with Tracey are quite disturbing. It is low budget, has some clunky dialogue and farcical policemen, I actually thought it had the look and feel of a CFF (Children's Film Foundation) film up until the first scene with Clive Mantle. After that it's clear it isn't suitable for children! \nI read it was Rik Mayalls first film but I didn't spot him. \nThe BFI release comes with a nice recent interview with Tracey Hyde.","user":"saintetiennelee","rank":[5,5]},{"title":"lost gem","rating":7,"date":"25 April 2011","review":"If you can track this down it's worth a watch. A young couple take a trip to the country for a cricket match he's playing in. She goes off exploring during the match and meets a peculiar character who invites her in for a cup of tea. Lesson learned - always be suspicious of a man who collects gnomes. It's quite well made. The acting is okay. Plenty of laughs - some intentional and some not - and the scene in which the murder victim is buried in a huge pile of rotting apples is really striking. There's another scene in which a body is discovered in a shallow grave with just the bum sticking out of the ground which is hilarious.","user":"milkandpebbles","rank":[7,8]},{"title":"Pretty dire, altogether.","rating":3,"date":"31 January 2006","review":"It's a number of years since I saw this film. It was aired one day by the BBC, in the early hours, as filling between two equally dreadful chat programs.<br><br>Think of Macbeth made by Ed Wood, a la Plan 9 from Outer Space, and you'll get the picture. It packs a lot in, what with the carefully-posed nude body of the murder victim being carried through the woods to the hut, some dreadful but unintentionally funny dialogue and stumbling acting and photography. For bad film buffs there is much to enjoy.<br><br>If you can get hold of a VHS copy of this, please burn it, unless your love of the macabre is matched by your love of poor film.","user":"wertperch","rank":[10,29]}]