[{"title":"Good example of Lorenzo's films.","rating":10,"date":"10 July 2002","review":"Lorenzo Lamas' wife (at the time of this movie!) Kathleen Kinmont does a better job of co-starring with Lorenzo here than she did in Renegade (TV series) and gets quite a lot of screen time. She plays an East European spy/assassin and actually suits the brown hair. Fans of Lamas will not be put out as there is his usual martial arts action on show. Kathleen also strikes out in this film more than all her fights in Renegade combined. The plot is perhaps a little more complex than other Lorenzo offerings due to the \"Thriller\" aspect of the spy plot - but it is still basically an action film. A sequel was released 2 years later \"CIA II Target: Alexa\", but i liked this original one for the action sequences and storyline. A good entry in Lorenzo's B-movie action flicks.","user":"ali6969uk","rank":[8,12]},{"title":"Kathleen Kinmont kicks you-know-what","rating":5,"date":"14 October 2006","review":"The first of the two \"Alexa\" movies that Lorenzo Lamas and Kathleen Kinmont made in the mid-90s is thoroughly routine in all aspects, except one: the exemplary handling of Kinmont's action role. As a former terrorist recruited by the CIA to help them retrieve a micro-chip with nuclear capabilities, Alexa is tough, no-nonsense and efficient but hasn't completely lost her humanity, and Kinmont has the right body, moves and attitude for the role. This film has a few of the best female action scenes I've ever seen in a low-budget American film. Other than that, there is nothing here that you haven't seen before: Lamas' most notable acting effort is to whisper ALL of his lines, O. J. Simpson plays a cop whose partner got killed in the line of duty, and the villain has (wouldn't you know it?) a foreign accent. See it for Kinmont or don't see it at all. (**)","user":"gridoon","rank":[2,2]},{"title":"La Femme Nikita Rip Off","rating":3,"date":"5 June 2006","review":"\"CIA Codename:Alexa\" is an absolute horrible rip off of Luc Besson's classic film \"La Femme Nikita\"(1990). The film is basically about a woman who is taken in and trained by the CIA and is forced to do a secret mission for them. (Pretty much the same story structure of La Femme Nikita) The acting combo of Lorenzo Lamas and O.J. Simpson is perhaps the worst in cinema history. Lamas' \"acting\" is simply a bad Steven Segal impersonation. Watching Orenthal act in this film is an excruciating experience.<br><br>The writing and acting is so poor in this film at times it is laughable. There are so many action movie \"conventions\" in the film it is ridiculous: unnecessary car explosions, people flying thru glass windows, terrorists, bad ponytails, etc. The musical score resembles David Michael Frank's score for \"Hard to Kill\" (1990), which furthers the Steven Segal theme of this movie. There is plenty of martial arts in the film, and it is pretty well done for a low budget American production. The mindless action and over the top acting never lets up, and I have to admit I was mildly entertained. <br><br>Lorenzo Lamas had the look of an action star back in the early 90's but he is certainly no action star, that is why he is doing soap operas and not action blockbusters. My recommendation is that you skip \"CIA Codename:Alexa\" and check out \"La Femme Nikita\" instead.","user":"kwhuneycutt","rank":[5,8]}]