[{"title":"Great movie action","rating":9,"date":"22 February 2020","review":"What makes this film stand out, aside from its superb effects, humor and script, is the contrast between Tommy Lee Jones and Will Smith. While Jones is the emotionless, smarter and wiser one out of the two, Smith is the younger and more enthusiastic. These 'Men In Black' are on a mission to save Earth from a really, really nasty bug infestation. This is one Sci-Fi film that shouldn't be missed.","user":"MR_Heraclius","rank":[38,39]},{"title":"Smart, funny spoof that is impossible not to like!","rating":8,"date":"11 December 2004","review":"\"Men in Black\" and \"Galaxy Quest\" are in my mind the best sci-fi comedies ever made, because they are both hilarious parodies of two different cultures. Whereas the latter spoofed obsessed fans who take sci-fi entertainment WAY too seriously, this one spoofs the paranoid, tin-foil-hat brand of conspiracy theorists. It has funny characters, witty lines, and does not at all take itself seriously.<br><br>There are a lot of small details that can take multiple viewings to catch. One thing I found funnier the second time I watched it is the scene where Will Smith has just been severely lectured by his boss in the interrogation room when Tommy Lee Jones enters, asks a few questions, and tells Smith to come with him. Smith: \"I can't, there's still a lot of paperwork to fill out.\" Jones: \"No, the paperwork is all taken care of.\" Smith's boss (walking by): \"Hey, nice work, Edwards!\" This is one of many quick, funny scenes that you only really get if you're paying attention.<br><br>All the actors do a good job, too. I thought Rip Torn was the funniest character, and Edgar the bug was hilariously gross. Linda Fiorentino was one of the coolest female characters ever. She put Ripley to shame. Every time I watch this, I want to marry her.<br><br>Overall, it's a great comedy that is clever and fun all the way through. 8/10 stars.","user":"Chromium_5","rank":[97,113]},{"title":"Men in Black: The Galaxy Defenders","rating":7,"date":"29 November 2003","review":"God, do I remember when this movie came out in the summer of '97. This movie brought aliens back in the strongest way possible, everyone was singing Will Smith's catchy song of the same title. But I remember seeing this movie and just wearing out the VHS when we got it. As a 12 year old kid, I just adored this movie and so badly wanted to be apart of the Men in Black. I thought they were so cool. Years later, I got the DVD because I wanted to go for a trip down memory lane, this may not be as cool as when I was a kid but this is still a very fun sci-fi flick that makes you laugh, squirm and also has some good scares. There is a reason why Will Smith is a star, he made this movie a riot to watch and has every star quality you could imagine. He and Tommy Lee Jones take us on an incredible ride through our world where the person that lives next door to you just might be an alien.<br><br>Agent K is a member of the Men in Black, a secret agency without ties to any government, whose goal is to maintain Earth as a \"neutral zone\" for aliens seeking refuge. K's former partner, D, has just retired, but identifies New York City detective James Edwards as a potential replacement, due to his agility to follow a disguised alien. After putting Edwards through several tests, K offers him the chance to join the MIB, which Edwards accepts. Edwards' past identity is erased, and he becomes Agent J, assigned to K by the agency director, Zed. The fleet warns that a \"Bug,\" a member of a giant cockroach-like alien species that are currently at war with another alien race, has crashed down to Earth and is seeking an object known as the Galaxy that would turn the tide in favor of the Bugs. To prevent this, they are willing to destroy the Earth unless the MIB can secure the Galaxy before their deadline within a day.<br><br>The make up effects in this movie are just incredible. The main villain that was the bug was one of the creepiest looking things you've ever seen. Vincent D'Onofrio who is one of those great secrets of Hollywood always delivers an outstanding performance makes the villain even more creepier because of his jerks and twitches. The CGI effects are very noticeable but I don't think they could have gone any other way since the aliens are over the top. The humor is on key, one of my favorite scenes is when Tommy Lee Jones is trying to find out information and you see Will Smith in the background who is helping a lady give birth to an alien and the tentacles come out and start carrying him around everywhere and even slam him on the car. Men in Black is the definition of a summer blockbuster, it's funny, action packed, had the great actors and a very catchy song that is now stuck in my head thanks to this review. I still like Men in Black, I think anyone who just lets go and watches this film is guaranteed to have a good time too.<br><br>7/10","user":"Smells_Like_Cheese","rank":[39,44]}]