[{"title":"Not that good, not that bad","rating":5,"date":"23 September 2002","review":"Pushing Tin is somewhat of an odd movie.  It's not really funny enough to be considered a comedy, and it's not really compelling/dramatic enough to be considered a good drama.  It attempts to pull off both at once, but never really succeeds.<br><br>The pacing seems a little \"off\".  You always expect the movie to pick-up at some point but it never really does.  It does manage to move along quick enough that it keeps you awake (barely), but I always found myself wanting the story to move someplace / anyplace to keep me more interested than I was.<br><br>The story itself primarily centers around the antics of Nick Falzone (John Cusack) and Russell Bell (Billy Bob Thornton), both of whom are air traffic controllers.  To it's credit, I've never seen a movie about ATC's, but at the same time Nick and Russell could have been in any other profession and the story would have held up.  I sometimes think the writer chose ATC's simply because no one else had done it.<br><br>The main conflict centers around Nick's desire to out-do Russell.  Why he feels the need to do this is never adequately explained.  It's also somewhat of a mystery as to what Nick is hoping to accomplish by out-doing Russell. Most of their competitions are basically irrelevant and don't prove much anyway: holding onto a match the longest, shooting freethrows, stacking as many planes into a queue as possible, etc, etc.  Their \"battle of wits\", as it were, eventually begins to involve their significant others. Unfortunately the respective wives (Blanchett and Jolie) are seemingly little better than pawns in Nick and Russell's bizarre and meaningless mind game.  They don't have much depth of character, nor any wants/desires of their own (beyond the superficial), and, as a result, you don't really care what happens to them.<br><br>So, in short, Pushing Tin isn't that funny (though I seem to remember it being billed as a comedy) nor is the story engaging enough to be considered a good drama.  As noted in my header, it's not a bad movie, but it isn't that good either.  Worth a rental if you've seen everything else.<br><br>I rate it 5/10.","user":"Volstag","rank":[38,46]},{"title":"More real than you may think...","rating":19,"date":"19 November 2004","review":"Okay, several parts of this movie were a bit far-fetched; (the wake turbulence from a heavy jet being one of them)but from a technical standpoint I can say that the phraseology, hazing, harassment, and ego trips are very accurate. Why? In a word, pride. Perhaps false pride at times, but pride nonetheless. The U.S. air traffic control system handles more traffic in a single day than any other country does in a week. Check the numbers, kids. It's true. The training is rigorous and relentless, and, at the risk of sounding like a commercial for the Marines, if you happen to be the one out of about a thousand who makes it through training to become a full performance level controller, it becomes a badge of honor. Very few people can do it. It is a close-knit family, which was also displayed in the film. If you'll notice the scene where a particular departure didn't \"tag up\" and one controller didn't notice it, several others jumped in to help out, and all joking and hazing stopped. Forgive my preaching, but this is the first movie that actually gave a somewhat accurate view of my profession, so hopefully I can be forgiven for being protective. (By the way, if I was married to someone who looked like Angelina Jolie, I'd keep her in the woods away from the slugs I work with, too.)","user":"tinpusher91","rank":[21,25]},{"title":"Waste of talented actors and interesting subject matter.","rating":26,"date":"26 April 1999","review":"Pushing Tin takes a unique subject matter, a job that affects almost everyone in America, and compelling lead character in the midst of a moving internal struggle and absolutely ruins it.  Why did the director and/or producer have to try and make Top Gun for Air Traffic Controllers?  The first scene of this movie was so laughable I almost walked out.  These filmmakers adapted this movie from an article, as the opening credits state. Too bad they used the Hollywood cookie cutter to do it.  Mr. Cusack and Mr. Thornton are enjoyable as usual and so was Ms Blanchett, unfortunately that is not enough.","user":"RickJaso","rank":[17,21]}]