[{"title":"Crushed the favorite romance of my childhood","rating":1,"date":"2 May 2009","review":"Pocahontas 1 was and still is my very favorite Disney cartoon and one of my favorite movies ever - a bit more adult than other Disney works, especially due to its most beautiful love story - Pocahontas and John Smith. <br><br>For those who know the real story of Pocahontas it is clear that the cartoon was simply inspired by the real story: it has never been proved she had any romantic involvement with John Smith, John Smith did have to leave the land due to an injury, then she thought he was dead, married John Rolfe, had a son with him and only THEN went to England, where she fell ill with smallpox and died, never seeing her home again. So Disney decided not to make speculations on the story but make it more or less how it really was.. omitting the marrying and having a child part..<br><br>So here is what I can tell you Disney: I do not CARE how it was in reality. I wanted to see how John Smith and Pocahontas get together again.<br><br>No.. They decided to follow reality. So their task was to make Pocahontas' choice for a new boyfriend justified. So they decided to show off Smith as a complete moron, a terribly selfish Narcissus, who does not approve of her ideas, does not understand and does not support her. The epic moment was the last part when he says \"I got a ship\" and then corrects I to we - and this is the moment when Pocahontas realizes that John Rolfe is better: he was the one who always believed in her. Just discard the \"love you forever\" part from the ORIGINAL movie. Well, thank you Disney for killing the best fictional couple for the sake of making it look historical.<br><br>I wish I never watched it. I will try to erase this heresy from my memory.","user":"irahru","rank":[57,63]},{"title":"Don't watch it. Just don't.","rating":1,"date":"8 February 2008","review":"I wish I'd never watched the Pocahontas sequel. Seriously. I've watched most of the Disney sequels, and while, yes, most of them are awful (though there are some rare exceptions - Bambi II is adorable), but that movie is just...beyond awful.<br><br>You can't mess with history in the original movie and then change your mind and try to set it right in a direct-to-video sequel.<br><br>Yes, in reality she ended up with John Rolfe, but -bleep- reality. I don't want reality. When I sit down to watch a Disney movie I want to get lost in a world where every princess gets her (ORIGINAL) Disney hero. I REALLY don't like new dudes with ZERO personality coming in and nabbing the princess just because \"that's how it REALLY happened\".<br><br>Likewise, when I read the original \"The Little Mermaid\" by the great Hans Christan Anderson I adore the tragic ending, but when I'm watching Disney I wouldn't want to see Ariel go ahead and toy with the idea of making a Prince-Kebab out of Eric. Do you follow? Yes, John Smith was far older and Pocahontas was years shy of puberty. I know in reality their relationship was platonic, but dude, making Disney!Smith out to be a complete arse just so that they could justify her waltzing off with Rolfe was a crappy move.<br><br>Who have we to thank for this? The history buffs who -beeped- and moaned when the original was released. I wonder if the same history buffs -beeped- and moaned when Ariel didn't die at the end of \"The Little Mermaid\".<br><br>I digress.<br><br>What happened to \"I'd rather die tomorrow than live a hundred years without knowing you\"? What happened to \"no matter what happens, I'll always be with you, forever\"? <br><br>\"We walked the same path once. Now I know where I belong.\" <br><br>Just stamp on my childhood a little more, Disney. :(<br><br>There are enough horrendously complex and painful things in the real world without kids movies (yes, I do know that's what they are) getting corrupted by \"how things REALLY are\". Little girls will soon realise that not everybody gets their prince charming. Do we really have to let them in on this early? <br><br>Thank goodness \"The Little Mermaid III\" is going to be the last direct-to-vid sequel.","user":"dreams_break_like_glass","rank":[55,61]},{"title":"Erase this movie from your mind","rating":1,"date":"22 August 2007","review":"My sister and I deny the existence of this movie.<br><br>Please do not watch it, it'll only ruin your memory of the original Pocahontas. The animation is sub-par and the musical numbers are dreadful. I sat there asking myself why characters in the movie suddenly burst into song, which is not something that you are supposed to do while watching a musical. It's supposed to be a seamless transition which in this movie, it definitely is not. The dialogue is silly and the movie contains absolutely none of the magic and romance found in the first movie. I wish I could unwatch this movie, so if you have not yet seen it, count your blessings and forget it exists. <br><br>A 0 out of 10.","user":"cey_2525","rank":[71,83]}]