[{"title":"A Disney Classic!","rating":5,"date":"9 August 2010","review":"This movie doesn't quite have the awesome start the first one did – but I'll take a few decomposing Gatlin residents over nothing.<br><br>It's the aftermath of the downfall of the creepy munchkin Isaac, the Ginger Ninja Malachi, and He Who Walks Behind the Rows. And reporters and residents from Hemingford the neighbouring town have descended upon Gatlin, with the surviving Gatlin kids being farmed off to new families so the carnage can start again.<br><br>Coming to join the corn party is a teenage boy with a horrible haircut, Danny, his daddy issues and his daddy. They stay with 'attractive hostess with no real story' who has taken in a Gatlin kid called Micah, who also has daddy issues, so of course a friendship springs up between Danny and Micah that eventually leads to sacrificing people, as is the natural course of things.<br><br>Nothing much really happens after that. The Gatlin kids shuffle around town in a group staring at stuff. I've decided that Micah is the best starer – he really tries at it. And blah blah blah – people start dying. I'm bored already.<br><br>My favourite death (so few times you get to start a sentence that way) would be the old lady under the house, with all her howling and honking and crappy acting I was hoping one of the five year olds would just run up and start kicking her in the stomach – alas not to be, but she was crushed and the kids stood in their group and stared. Followed closely by the man who just started haemorrhaging blood all over the church. (Micah did some of his best staring in this scene – watch out for it) During this time, Danny has found love with a pretty young girl called Needy McNeederson. His daddy starts making sweet sweet love to 'attractive hostess with no real story' and there's some weird back story stuff thrown in about the corn and poisons and old Indian legends etched into rocks. None of it really makes any sense – doesn't fit in with the story in any way but it is told by a wise old American Indian man – so that lends some serious weight to what is being said.<br><br>It all ends where it should – in the corn. Attempted sacrifices are abound, professions of love and apologies are made. Micah's yelling all over the place and doesn't seem to be staring as much which makes me sad. He Who Walks Behind the Rows turns up briefly and does his thing. It's just another day with the Children of the Corn.<br><br>All in all, a pretty crappy sequel – but if you watch one, you gotta watch em all. Next up; Children of the Corn 3 –Gangsta Corn.","user":"I_can_get_you_a_toe","rank":[15,22]},{"title":"Children of the Corn II The Final Sacrifice: On par with the original, but thats not saying much","rating":4,"date":"13 June 2018","review":"I was underwhelmed by the original Children of the Corn (1984) film, I expected something a lot more impressive and walked away very dissapointed.<br><br>It took 8yrs before it got a sequel and the movie more or less picks up from the last. All the corpses of the residents have been found but the psychotic religious fanatic children haven't changed at all and once again set about purging the adults.<br><br>It comes down to a reporter and his son to stop them, but though it makes for an interesting follow up the movie itself isn't very interesting.<br><br>A couple of decent deaths and a passable premise don't make up for just how generic it feels. Nothing stands out, everything feels rather copy and pasted.<br><br>The Final Sacrifice tries to flesh out the mythology and background of \"He who walks behind the rows\" but in doing so kind of damages what they'd already built. Sometimes simplicity is the key.<br><br>If you liked the first I'd say this is essential viewing, if you didn't then take into consideration that this is more of the same.<br><br>The Good:<br><br>One death scene was great<br><br>Follows on nicely<br><br>The Bad:<br><br>Simply fails to entertain<br><br>Squanders potential<br><br>Things I Learnt From This Movie:<br><br>Rifling through a persons belongings left in a car is suitable small town etiquette<br><br>BINGO!","user":"Platypuschow","rank":[7,9]},{"title":"A decent enough sequel if only for a few mild flaws","rating":7,"date":"27 August 2016","review":"Arriving in Gatlin, Nebraska, a news-reporter and his son get wind of a story about the youth in the town murdering their parents finds that a series of brutal murders are revealed to be worshipers of the corn-stalks and try to stop them before they carry out their plans.<br><br>While not a completely worthless sequel, it does have enough to make it interesting without being all that terrible. One thing it does do right is play around with the supernatural better than expected and did have some good moments to it featuring this. The very first attack in the cornfield is really fun as the howling wind and strange lightning blasts befalling the reporters while they're in the corn rows before the huge tree falls into the area, while other really good action moments are packed in amongst the other supernatural occurrences here as house-falling sequence and the scene in the church provide some fun since they involve a great amount of suspense. There's even a few other really good scenes that come from the different meetings held among the corn-stalks, and a really tense moment later on where a couple make a particularly gruesome discovery among the corn that provides a good shock that comes out of nowhere. Even better than that is where the remaining adults are trapped inside a burning building, which is one of the better scenes in the film with the fire and the panic providing plenty to like.The last big plus is the finale, which is just all sorts of good cheesy action-packed fun, some wonderful ideas and an overall really great way to end the film. All-in-all, this is just cheesy good fun. This one wasn't that bad, but there were a few problems. The most obvious one is the flaw concerning the back- story. It's implied to be a continuation of the first one, where the survivors are bused into foster homes of a neighboring town, yet that raises a few problems. Firstly, it's never stated whether or not this was true despite giving plenty of evidence that this was the case. The events of what happened there were well-known, yet the children here are allowed to go away without being questioned, as well as having a method of still getting in touch with each other quite easily which simply makes their rampage later on seem all the more out-of-place when it echoes what happened before in the the other town. Those doesn't make any sense at all and are quite annoying. There's also the fact that the pacing is a little off, as the romance angles cut into the middle of the film when the mysterious stuff starts happening, and way too much times goes by before anyone thinks anything is going wrong. The biggest one, though, is that it's way too cheesy. The film's concept and several of it's big action scenes do reek of cheese, and the film as a whole does reflect this. These really keep the film down somewhat.<br><br>Rated R: Graphic Violence, Graphic Language, Brief Nudity and mild sex scenes.","user":"kannibalcorpsegrinder","rank":[3,3]}]