[{"title":"Disappointing effort from master of sports movies","rating":6,"date":"27 January 2000","review":"The story goes that Ron Shelton wanted to make a biopic of Bob Marley, but the financing fell through, and in a few weeks time, he wrote this boxing film.  \"That's okay,\" you think.  \"This is Ron Shelton.  Sure, he co-wrote THE GREAT WHITE HYPE, which was disappointing, but he didn't direct that one.  He did write and direct BULL DURHAM, WHITE MEN CAN'T JUMP, COBB, and TIN CUP(well, he co-wrote the last one, but let's not split hairs), all great sports movies, so he could probably do a boxing movie in his sleep.\" Well, unfortunately, that's what he seems to have done in this disappointing movie.<br><br>Shelton was reportedly inspired by a true-life fight where the preliminary match also turned out to be much more compelling than the featured attraction, which would seem tailor-made for him.  And like the other Shelton heroes, the characters of Vince(Harrelson) and Cesar(Banderas) aren't among the great ones, though they've flirted with greatness. Finally, certainly the idea is right in place, that the point is not who of these best friends wins the fight(without revealing the ending, I will say it's not only logical, but feels right), but the fact they each got this last shot and put on a good show.  The problem, until the fight scenes, is the execution.<br><br>Shelton usually has a gift for dialogue and character, especially when romantic comedy is concerned, but he seems to have mislaid it here.  Vince and Cesar are pretty much ciphers from the beginning, despite the obvious chemistry Harrelson and Banderas have between them.  There are traits which are mildly funny(like the fact that a boxer would watch soaps), but nothing that adds up.  Even the fact that Vince is a \"Jesus\" freak seems incoherent rather than part of the character.  And the dialogue between them, except in the scenes when they're talking at the same time, seems lame, relying on easy homophobia and vulgarity rather than being funny(compare that to the clever trash talk in WHITE MEN CAN'T JUMP).  And even when Davidovich enters the picture, though she gamely tries, she's got nothing to work with, and seems oddly mismatched with Banderas.  Harrelson at least she seems comfortable with, but they don't have enough scenes together.<br><br>The fight scenes are where Shelton finally comes alive.  The behind-the-scenes details of how the fight gets into place and such are familiar, but well-handled.  And the fight is compelling to us, so it's believable that the rest of the arena would find it so as well.  We see the fighters being given advice, but since they think they know each other, they sometimes ignore it to do their own thing.  And you really believe at the end they're both fighting on pure adrenaline.  Even Davidovich becomes believable here as she realizes she loves both of them, and while she understands they need this, can't bear to watch them hurt each other.  Yet even here, Shelton messes up.  There are too many T&amp;A shots, which are supposed to reflect how the fighters' minds are fogged up, but are more likely there to get people to hoot.  Ultimately, I hope this is a blip on Shelton's career, rather than a sign he's losing it.","user":"SKG-2","rank":[9,10]},{"title":"Good boxing, weak characters","rating":6,"date":"20 June 2000","review":"Play It To The Bone' is really two movies.  One is a movie about boxing and the other is a comedic character study of the boxers.  As a boxing film it succeeds nicely.  As a comedy it has its moments.  As a character study it hits the canvas hard.<br><br>The storyline was sort of Rocky' times two.  Two washed up middleweight boxers Vince and Cesar (Woody Harrelson and Antonio Banderas), who are also best friends, get a last minute chance to fight in Las Vegas on the undercard of a Mike Tyson heavyweight bout when the two scheduled fighters are unable to fight.  They are promised that the winner will get a chance to fight for the championship, but they have to be in Las Vegas tonight.  The trouble is, they have to fight each other.<br><br>So they climb into a car with Cesar's girlfriend (and Vince's ex-girlfriend) Grace (Lolita Davidovich) and drive from L.A. to Las Vegas.  Most of the rest of the movie is about the drive followed by the fight.<br><br>Director Ron Shelton has had quite a few sports oriented success stories to his credit (Bull Durham, White Men Can't Jump and Tin Cup).  The best part of the film was the boxing.  The boxing was well choreographed and both actors were athletic and fought like real boxers.  Shelton was also excellent at creating the feel of a boxing match.  Anyone who has ever watched an HBO bout will recognize ring announcers Jim Lampley, Larry Merchant and George Foreman.  Mike Tyson made a cameo as well as numerous celebrity boxing fans (Kevin Costner, Rod Stewart, Wesley Snipes and a host of others).  The makeup for the cuts and puffiness was also very realistic.<br><br>Unfortunately, the rest of the film was not as good as the fight.  Shelton spends a good deal of time developing the characters, but it is all for naught because they have no substance.  They are two hapless jocks, obvious mental lightweights, who spend most of the trip to Las Vegas fighting over Grace, cutting up and strutting around like peacocks.  Shelton takes great pains to try to make us love these characters equally by making them equally pathetic.  But that doesn't work because it leaves the audience without anyone to pull for in the fight.  The ending is utterly predictable and the film whimpers off into the sunset with no more than a stagger.<br><br>Banderas and Harrelson both gave journeyman performances.  They had good chemistry and some decent comedy between them, but there was nothing special here.  The best performance by far was by Davidovich who transcended her normal sex kitten role and took command of the entire film with a character that was a flaming bitch on wheels.  She was smart, tough sexy and manipulative and dominated every scene.  Once again she shows that she is talented as well as attractive, which makes me wonder why she has never gotten more substantial roles.<br><br>This is a tough one to rate because it does some things very well and other things poorly.  I gave it a 6/10.  It had some good comedic moments, but not enough of them.  It had some excellent boxing scenes, but a disappointing outcome.  And the character study simply failed due to vacant characters. If you like boxing, Harrelson, Banderas or especially Davidovich, you will enjoy this film.  Otherwise, enter at your own risk.","user":"FlickJunkie-2","rank":[15,19]},{"title":"even a weak Ron Shelton film is worth watching","rating":5,"date":"11 July 2000","review":"When you think of sports films, one name comes to mind: Ron Shelton. Five of his last six directorial efforts, not to mention writing efforts like \"Blue Chips,\" have been about sports. \"Bull Durham,\" of course, is his touchstone film, but \"White Men Can't Jump\" and \"Tin Cup\" are both excellent. Baseball, basketball, golf, and now with \"Play It to the Bone,\" boxing. But are they really sports films or are they simply character-driven comedies that use the sports world as a backdrop?<br><br>Only Shelton knows if it's intentional, but almost all of these stories follow a similar formula: he takes three characters, two men, one woman, who are all different things to each other. Sometimes it's a love triangle, sometimes it's not-but the woman always has a lot to teach one of the men in particular (Susan Sarandon's character in \"Bull Durham\" to Tim Robbins', Rosie Perez's character in \"WMCJ\" to Woody Harrelson's, etc.).<br><br>One of the men is a washed up has-been or never-was and the other is the egomaniacal flavor-of-the-month (Kevin Costner and Don Johnson in \"Tin Cup\"; Costner and Robbins in \"Bull Durham\"). The lone woman always uses psychology to enlighten the men on how to play the Game better, both of sports and of love (Rene Russo's character in \"Tin Cup\" is a psychiatrist). The entire story is about the contrast between the men's and the woman's view of life. Somehow, the woman always ends up the wisest of the three, while the men are allowed to behave irrationally because that's what men do. In the end, she finds that one of them is hopeless, and chooses him because of it. A woman never met a man she couldn't fix, at least not in a Ron Shelton film (the exception being \"WMCJ\": Rosie Perez' character does actually leave Harrelson's).<br><br>\"Play It to the Bone\" is more of the same. This time, however, both men are washed-up has-beens--boxers--Vince and Cesar (Harrelson and Antonio Banderas). They both have a lot of kinks to work out in their lives. The only issue either of them acknowledges at first is money--they have none and are offered fifty grand apiece to fight as replacements on a Mike Tyson undercard. The two are best friends, both have been ranked as middleweight or super middleweight boxers, but they've never met in the ring. Instead of flying to Las Vegas, they drive from Los Angeles in Cesar's girlfriend's (Lolita Davidovich) car.<br><br>Davidovich plays Grace, the aforementioned all-knowing woman, a Ron Shelton staple. She's dated both Vince and Cesar and knows exactly what buttons to push. She knows what makes each man fight better and, over the course of the road trip that eats up the film's first two acts, brings each to the proper mental state.<br><br>\"Play It\" is like a rubber band: you keep pulling it back farther and farther, building up the tension until it's ready to break, then release. When the opening bell of Vince and Cesar's bout rings, Shelton's rubber band snaps. Grace's intention was for the two to fight each other and for both to do well, allowing each to unleash some of the frustrations they have in their lives. Her mistake was thinking that either man would hold back. By the fifth round, when they've beaten each other's faces bloody, we see the two aren't fighting each other any more: they're fighting themselves. Every woman knows that men don't talk about what's really on their minds. I admit it: We men generally deny what is true about ourselves until we're ready to explode. Shelton has a way of hitting the bullseye when it comes to human interaction, and does so again here.<br><br>The film's centerpiece, the final fight, is exciting and entertaining. It's more visual than anything Shelton has tried. As the men fight, they have visions that represent their respective life struggles. I found myself missing the Shelton of old, the one that just told it straight. Everything just felt more free and fun; loose. The story was always a free-for-all, a game with no rules, where absolutely anything can happen. With \"Play It,\" he seems too intent on making a point and becomes (gasp) a filmmaker. The story actually has (gulp) structure, whereas his others were directionless, but in a good way. For once, Shelton wrote the characters rather than letting the characters write themselves.<br><br>Mr. Shelton, leave structure to the hacks and keep making great films.<br><br>Grade: C","user":"mercury-26","rank":[6,7]}]