[{"title":"One of the must-see holiday classics","rating":13,"date":"13 December 2002","review":"While the 1951 Alistair Sim version of A Christmas Carol is the most faithful to the original Dickens story, A Muppet Christmas Carol possesses heart, whimsey, and a joy that is so very much lacking in our evermore commercialized holiday season.  Michael Caine's performance as Scrooge easily surpasses those of Reginald Owen (1938), George C. Scott (1984) and Patrick Stewart (2001).  There is a more genuine degree of transformation and redemption in his characterization than has often been portrayed. This makes the story a truly wonderful experience both for adults as well as for children.<br><br>The use of the Muppets in the various roles makes for a lively film experience.  Statler and Waldorf as Jacob &amp; Robert Marley are appropriately heckling as they seek to convince Scrooge to change his ways.  Kermit the Frog is a wonderfully sympathetic Bob Crachit just as Miss Piggy is appropriately and aggressively belligerent Mrs. Crachit.  Perhaps one of the better-inspired comedy bits comes with the arrival of Scrooge and the Ghost of Christmas Past at Scrooge's former workplace, described as \"Fozziwig's Rubber Chicken Factory.\"  Such bits are frequent and help to keep the story fun.  Paul Williams' music score and songs are eminently singable and leave the viewer with a lasting memory.<br><br>A Muppet Christmas Carol has joined the pantheon of classic holiday films, easily ranking alongside Holiday Inn, White Christmas and A Christmas Story. It is the opinion of this reviewer that for those whom holiday films have become a part of holiday celebration should make this a part of their seasonal experience.  One might even complete the film humming the tunes and thinking better of themselves as well as of their fellow humans.  In other words, Henson and company have made Dickens story as memorable as Dickens himself wished it to be.","user":"The Don-3","rank":[74,79]},{"title":"Not just for kids!","rating":5,"date":"5 December 2001","review":"I recently rented this movie for my young son.  I never imagined that I'd end up liking it more than he does.  If you can get past the fact that most of the cast are muppets, this is actually a terrific version of A Christmas Carol.  Michael Caine makes a fine Scrooge, one of the best I've ever seen in fact.  I usually hate musicals, but all of the songs in this film are great (and the girl who plays Belle - this girl can SING!)  The comedy is mostly provided by Gonzo, narrating as Charles Dickens, and his sidekick Rizzo the Rat.  The humor is truly funny and appropriately placed (notice how a very good reason is created for Gonzo and Rizzo to exit during the serious Christmas Yet to Come portion .)  This is truly one of those movies \"for young and old alike\", though it will probably go over the heads of very young children.   But anyone who generally likes A Christmas Carol should like this version of it.","user":"jann-6","rank":[21,21]},{"title":"Does the word \"brilliant\" mean anything?","rating":26,"date":"26 December 2000","review":"That question pretty much sums up my reaction to \"The Muppet Christmas Carol\", a hilarious, yet touching film.<br><br>What did I like about the movie?  Just about everything!  Michael Caine made a great Scrooge, and this film showed us, possibly better than just about any other version I've seen, just how Scrooge came to be such a miser (although that could partly be because the versions I saw which really go into Scrooge's childhood were clearly adult versions, which meant they could be more subtle in their explanations).  To Caine's eternal credit, he made Scrooge very believable, which is no small feat considering most of his fellow cast members were puppets.<br><br>And what about the Muppets?  They were also brilliant!  Kermit made an excellent Bob Cratchit, loyal and humble, and he had a wonderful tribute to Tiny Tim which also served as a brilliant tribute to Jim Henson.  Miss Piggy was a great Mrs. Cratchit, feisty yet very loving toward Bob (the worst of her temper was thankfully muted by the story).  Fozzie the Bear was a hilarious Fozziwig, and The Great Gonzo and Rizzo the Rat made a great team, having some of the best lines out there (my favorite is Rizzo's \"Light the lamp, not the rat!  Light the lamp, not the rat!\").  The ghosts were definitely believable (and in the case of the two Marley Brothers, hilarious as well).  Incidentally, the original text had only one Marley -- Jacob, but to get the two comedians from the balcony in the story, Robert Marley was added.<br><br>Finally, the songs were rather good, with the best one (in my humble opinion) being \"When Love is Gone\".<br><br>So, I firmly recommend \"The Muppet Christmas Carol\" to one and all.<br><br>Belle Book","user":"bellebook","rank":[51,56]}]