[{"title":"A vastly underrated movie","rating":7,"date":"11 February 2005","review":"I've never understood why this film is regarded so poorly, even to the point of being dissed on \"Martin.\" While it doesn't measure up to the first two \"House Party\" films, it's certainly better than most people give it credit for.<br><br>Both Reid and Martin deliver excellent performances, but Martin really shines as Blade Brown, the hood with a well-hidden heart of gold. Lamont Johnson, Thomas Mikal Ford, Karyn Parsons, and Alysia Rogers provide solid supporting roles.<br><br>What impressed me most about this film was the obvious chemistry between the cast members. While I expected it between Reid and Martin, I was pleasantly surprised to see it between Johnson and Ford, Reid and Rogers, and Martin and Parsons.<br><br>I'd say that this is a must-see for Kid 'N' Play fans. For non Kid 'N' Play fans, it can be a fun diversion with some wonderfully funny scenes.","user":"Brad_Will","rank":[20,20]},{"title":"Excellent!!","rating":10,"date":"10 June 2007","review":"A Very Funny Movie!..with an excellent soundtrack, and remind me the good times with Kid N Play!...<br><br>This Movie should have better rank, i recommended this movie to see with all the family and have about 1 hour and a half of fun...<br><br>If you want a trip down memory lane to the flamboyant culture of the early 90's, and a reminder of how it was at school during those terrible teens, then this comedy with Kid n Play and a few other familiar faces ('Doug. E Doug' who went on to do Cool Runnings) ('Karyn Parsons' - Hilary in Fresh Prince Of Bell Air) (Pauly Shore who plays the unforgettable role of the hippy) this film is a good watch.<br><br>Excellent Movie!...","user":"Ghostface26","rank":[14,15]},{"title":"Funny comedy","rating":24,"date":"24 October 2002","review":"Class Act was a funny comedy when released in 1992. Kid &amp; Play conuntied to make good comedy and are good comedic team. Doug E. Doug in an early sidekick role was alos very funny. My favorite scene in the movie is where Duncan is confused about slang and Blade has to explain it to him. I personally feel the filmmakers should have maybe gave Kid the Blade role and Play the Duncan but all in all still a funny movie.","user":"DunnDeeDaGreat","rank":[14,15]}]