[{"title":"You've tried the rest, now have the best of the best.... three!","rating":4,"date":"5 January 2008","review":"Best of the best 3: No Turning Back is a movie with a strong social and political message. Our hero Tommy Lee, as portrayed by Phillip Rhee, encounters and overcomes a myriad set of common problems in the deep south. From strange cuisine to white power groups who value an idea of might makes right. I'd like to digress here to applaud Mr. Rhee, not only did he star as Tommy Lee but also directed and produced. It can been seen that Mr. Lee applied his own experiences as a minority in America to his magnum opus.<br><br>Strong political message aside, the inner workings of the film, the basic craft if you will is on point throughout. From inspired lighting and set design to insightful scene transitions, a spinning chain gun into a spinning plastic flower. We can see a juxtaposition of spinning things one on the side of whimsy the other cold raw steel crafted for killing.<br><br>Every one understands that no thing, be it movie or sandwich, can be perfect. Thus I must concede that Best of the Best 3: Cool Runnings does have its faults. One half hour is spent before a showcase of Mr. Rhee's fistic acumen. In fact Lee, Rhee's character, seems to have no real competition in the film. Nearly every skinhead he fights falls with little effort, this is strange due to the basic toughness and fighting skill attributed to the skinhead stereotype. Particularly with the basic para military training they are given.<br><br>As the plot reaches its climax, beginning with a dirt bike chase no less, and ramps up to a full on assault. We learn here that Lee can outrun an explosion. In a dizzying display of action and full on violence Tommy and his partner, the local sheriff and his bother in law, take out the skin head compound. Of course in the end Tommy proves he is indeed the best of the best. Then again this really never became an issue in the movie.<br><br>All in all Best of the Best 3: the lion the witch and the wardrobe does a fine job of telling a complex story in simple terms that can be appreciated by young and old alike. 4 giant clown shoe beat downs out of a possible 10.","user":"inquisitor_milk","rank":[4,4]},{"title":"what happened ?","rating":30,"date":"30 March 2002","review":"what happened to the great martial arts action of: best of the best? yes, this movie has a good storyline, and phillip rhee is great in this film... but why name it after a great movie when it has nothing to do with the series? Oh yeah, and check out the final fight, it's a thrill (stupid-wise). I rank this movie a **** out of ********** !!!","user":"the_last_shadow_2000","rank":[6,8]},{"title":"Overworked plot, but good lesson.","rating":9,"date":"9 August 1999","review":"This was a movie that had an overused plot.  The martial arts expert who comes in and single handedly saves a town.  If the movie were to be rated just by the plot, I would give it a 1, but I do believe that a movie is more than just the surface appearance.  This movie also had a strong anti-racism message behind it.  It showed the affects of racism and the sheer hate and terror that go with it.  Watching it is enough to make you want to do something about the problem of racism yourself.  So on moral grounds, I would give this movie a 10.  However, the plot was inconsistent at times, the acting was cheesy, and this type of movie has been made so many times that you get tired of just hearing about it.  Overall, I can only give this movie a 4.","user":"ace531","rank":[5,8]}]