[{"title":"A fairly decent Crichton flick!","rating":8,"date":"11 October 2002","review":"After reading many users' mixed comments on the movie..i can't help but feel that a majority have underrated the film. True it could have been better, especially in the latter half, but having read the book first, i did not feel it actually falling off midway like the way other viewers have described it. People who have read the novel will acknowledge that the movie does follow the novel fairly closely. Thus comments about Hoffman's role and the ending are unfair, since i feel they are the closest big-screen reproductions of one of Crichton's best works. I feel Stone's character was the role followed the weakest.<br><br>Definitely the giant squid thrills are insufficient (note that Crichton devoted a good part of his novel describing encounters with 'the monster'). I guess animation artists were short budgeted...though the film as a whole still is a visual treat...and the atmosphere is rightly captured, with nice music.<br><br>Overall, I think the movie is worth watching and is definitely of a much higher caliber than 'The Lost World'. It follows a psychological-cum-sci-fi thriller theme and i feel is better than the similar flick 'Abyss'. As from the novel's point-of-view...it could have been done better though. 8/10 stars!","user":"farhan_qu","rank":[94,126]},{"title":"A strangely disappointing adaptation of a Michael Crichton novel that comes off to a smashing good start but very quickly approaches a precipitous downhill.","rating":5,"date":"6 August 2002","review":"Sphere is a science fiction film that starts off with a tremendously fascinating story and ignores all of the possibilities that it entails. Four people (you know the drill  a psychologist (Dustin Hoffman), a mathematician (Samuel L. Jackson), a biochemist (Sharon Stone) and an astrophysicist (Liev Schreiber)) are flown out to the middle of the ocean on a top-secret missions (even they don't know where they're going). We would be just as confused as they were about the details of their mission if we had never seen the previews, but even though we already know what they're going to find out there, it's just as interesting to learn about the details of this ship that has been found on the bottom of the ocean, and that appears to have been sitting there for 300 years (well, okay, 288). The story keeps getting better and better as we learn that there is a hum coming from the ship, indicating that there is still something running inside it, and then even more fascinating revelations once we are taken inside the ship. <br><br>There can be no doubt that Sphere contains some truly interesting and entertaining elements, and that things like the acting are just as superb as we would expect from such a spectacular cast, but as the movie progresses, we begin to realize how little the film is going to reveal. I can't say that I wasn't completely enraptured for at the least the first hour of the film, but there were just as many bitterly disappointing things about it as there were good things. Dustin Hoffman and Samuel L. Jackson, in particular, delivered absolutely brilliant performances in this film, delivering some of the best entertainment in the entire film by themselves. There is a mildly interesting but completely unconvincing ex-romantic tension between Sharon Stone's character, Dr. Beth Halperin, and Dustin Hoffman's character, Dr. Norman Goodman, that is there for little other reason than to complicate the lives of the characters as they try to solve the mystery of this undersea ship. <br><br>(spoilers) It's really too bad that the movie completely falls on its face in the second half, because the first half of the film is excellent and undeniably entertaining. There's nothing like a bit of time travel and the suggestion of extraterrestrial life to keep you entertained, and it is definitely a great scene when we find out that the ship is a human ship. This is one of the many things in the film that really makes you think. The thing that makes a great film is that it inspires thought. This is probably the one thing that all of the great films have in common with each other. There are surely a lot of things about Sphere that really make you think, which is another reason that the first half of the film is so good. We see that it's a human ship, which opens a whole new area of possibilities for the film. Harry (Samuel L. Jackson) speculates on the fact that the last entry in the ship's log is an entry into an `Unknown entry event,' indicating that they will never reach the surface to reveal what they've found. <br><br>\nThere is also a possibly over-extensive excursion into the realm of the psychological element in the film, as the characters are all made to face their fears, some of which are not just your average fears, such as Harry's strange fear of finishing 20,000 Leagues Under The Sea. The special effects are definitely nothing to brag about, but there are some interesting scenes that take place in the deep ocean, such as the death of Teeny Fletcher (hey, she's black, she had it coming, right?) in the midst of a mass of strange sea creatures, as well as the scene with the thousands of squid eggs. Weird looking things, I've wondered since I saw the film what kind of props they used for that scene. The conversation with `Jerry' is unfittingly childish, but there is definitely a significant element of tension introduced when Jerry gets mad, as well as the scene where Norman contemplated the implications of Jerry's expression of emotions, indicating his ability to get mad.  <br><br>There are undeniably a lot of interesting things about Sphere, and it surely has the power to entertain, but it goes off the track later in the film, maybe because it tried to answer too many of its questions. There are some unanswerable things in the film, and the movie deals with them by having the characters have a weakly-written discussion about their fears and questions, and their ultimate decision to `forget' what they know using the power that they seem to have gained from the sphere. While this answers the question of how it could have been an unknown entry event when they all made it to the surface, it's probably the weakest ending that the film could possibly have had. <br><br>As a strange twist on the science fiction genre, Sphere succeeds, although only in the first half. Like Hollow Man, Sphere could have and should have been a much better film. The unfortunate fact about the film is that it contains a lot of very interesting and very entertaining things that are surely worth watching, but the disappointing ending almost makes them not even worth seeing.","user":"Anonymous_Maxine","rank":[57,76]},{"title":"It will have your attention but it's too psychological for its own good","rating":6,"date":"4 June 2015","review":"Michael Crichton, a science-fiction novelist and screenplay writer for several of his own adaptations has had many of his ideas become successful and iconic pieces in cinema. The best of Mr. Crichton's work is by far everyone's favorite prehistoric predator film, Jurassic Park (1993). That and Westworld (1973) twenty years before. There's something about Crichton's work that has many of the same motifs that show up in a lot of his other written works. One of the most notable elements is the discovery of a new science by humans and it ends up becoming more than humanity can handle. Re-emphasizing this again is in this Crichton adaptation that went largely unnoticed. Was it because it was bad? No but as a final product, there's a lot left to be desired with this sci- fi thriller.<br><br>The story to this movie is about a group of doctors in different fields that travel to the bottom of the ocean to analyze a UFO that has something mysterious inside. The mysterious plot device that's inside the ship is a giant perfectly shaped golden sphere. After visiting it, strange things begin occurring on the ship and it's up to the small crew to figure it out. Directed by Barry Levinson (who has produced other Crichton adaptations) shows that he has competent direction in how he wanted the story to play out. Yet his pair of writers didn't seem to know how to make it work to the fullest extent. The writers on board for this production were Stephen Hauser (which was his only credit) and Paul Attanasio. Both of which flesh out the characters and do create some high-strung tension scenes with minor psychological elements but when it comes to explaining the orb, they miss it almost entirely.<br><br>The underwater crew is made up of Dustin Hoffman (a psychiatrist), Sharon Stone (a biochemist), Samuel L. Jackson (a mathematician) and Liev Schreiber (a doctor in physics) and two operators; Peter Coyote and Queen Latifah. Of these characters, only Latifah (who has a minor role) seemed slightly out of place; all the rest act fine in their roles. That means distinctive personalities and charms. The actor who viewers would probably find the most likable is Hoffman who has a knack for being mostly nonchalant through each situation he's put into. I guess shrinks are supposed to be this calm? Not sure, but it gives him the right amount of charm. The connection these characters have is that they were all associated with Hoffman's role. Funny how popular 80s singer Huey Lewis even had a small scene stealing moment at the beginning of the movie. Random but a treat.<br><br>The sphere plot device is also a treat when things start rolling (pardon the pun). However, this is exactly when the problems begin to arise. In order for strange events to happen, there's got to be reasons to back up and justify these moments. For this case, there is only one explanation given amongst a slew of other questions that go unanswered. One thing that really threw me off was when Hoffman's character discovers a cabinet worth of a specific item. Who stocked that thing? I could see if it was a mind game or hallucination but it was for real. Tell me who had the time to do that? I have to admit, moments like those will keep its audience guessing and with Hoffman's character being a shrink, the psychological aspect to the film does help make the tenseness quite intellectual. The only problem is that parts of it only theorized possible reasons but never gave definitive solutions. These of which were all based on observation.<br><br>The only other negative part to the presentation of this movie is how it deliberately splits up its acts into chapters. There is no need, for two reasons. One being that, the audience will figure out when the next act is because each \"chapter\" if you want to call it that fades out to black. The other reason is that giving a title for the next sequence can somewhat spoil the upcoming surprising scene that audiences may not see coming. Instead, audiences are presented with giant bold print stating exactly what's headed their way. Why go through the trouble of shooting yourself in the foot like that? But enough on that, the last bits of the film still work in its favor. This belongs to the cinematography shot by Adam Greenberg (The Terminator (1984) and Rush Hour (1998)) and the music composed by Elliot Goldenthal. Since Greenberg has been the director of photography before for bigger projects, he shows that can effectively conceal the illusion during the underwater scenes. As for music, Goldenthal who isn't always the most memorable actually surprises this time. That means creating themes for certain aspects of the film, which includes creepy piano keys and quite wondrous sounding strings. It really stuck.<br><br>The film has competent acting, cinematography, music, interesting psychological elements thrown in and some tense thrills. However, the writing sorely lacks in clearing up much of the plot device that is directly involved in the story other than giving a small assumption only based on observation. That and the chapter segments are a bit unnecessary.","user":"breakdownthatfilm-blogspot-com","rank":[10,11]}]