[{"title":"Entertaining and fun!","rating":10,"date":"2 July 2002","review":"After seeing this, I realized Tsui Hark really has a knack for period films. Jet Li is Master Wong in this third part of OUATIC series.  Honestly, I really enjoyed the scenes with Wong and Aunt Yee (played by always lovely Rosamund Kwan).  The way they play off each other is so innocent that you can't help have a smile on your face.  It's also a chance to see a jealous Jet Li which adds to the humor.  You really root for him to get the girl (lucky Jet).<br><br>The action is on point as Jet Li displays his martial arts prowess as he battles a lot of enemies.  Great use of a jacket to ward off a street battle and the restaurant fight scene is classic Jet Li (you gotta love that shadowless kick).  The Lion dance ceremony was interesting and I enjoyed how chaotic it was as all the dragons battled to get the bait.  Foon adds comic relief and Club Foot was a cool character who knows how to get his \"kicks\".<br><br>Overall, I had to see this one after watching part one and two.  Even though I expected to see superb fighting, I really enjoyed the romance  in the film as well.","user":"InzyWimzy","rank":[8,8]},{"title":"Jet returns as Wong in a lion dance extravaganza","rating":14,"date":"14 April 2002","review":"Though nowhere near as good as its predecessors, episode three of the legendary series does have some memorable moments, though they may appear few and far between. On this occasion, Empress Dowager tries to cause hostility between foreign powers settling in China by holding the ultimate Lion Dance competition set to restore Chinese pride and heritage, only to have it quashed by martial madman Chiu Tin Bai who's intent is to annihilate the competition and win the Lion Dance himself. Wong Fei-hung steps in after his father is beaten down by Chiu's crazy henchman Clubfoot, and the stage is set for Wong's single-handed onslaught of all evildoers and the restoration of some kind of sanity in this crazy town. There's plenty of colourful lion dances to please the eye and Jet is still the most exciting thing around, yet what it really lacks in is purpose, setting no real moral high ground and merely acting as a relentless cash-in on its previous successes.","user":"abentenjo","rank":[6,7]},{"title":"A very good film, highly enjoyable.","rating":10,"date":"3 February 1999","review":"An extremely enjoyable and fun film. Xin Xin Xiong, Jet Lee and the other actors perform incredible martial arts stunts, including the obligatory fighting scenes with Lee looking startled at his weapon's rapid disintegration.<br><br>Overall, a reasonably good plot and a very interesting and fun film to watch.","user":"Grahame-2","rank":[6,8]}]