[{"title":"Far from great, but not as bad as its reputation....","rating":5,"date":"17 April 2015","review":"I lap up anything with Emilio Estevez. I've always thought he was extremely underrated. Sometimes, he picks the silliest scripts. I did have some fun with this movie, but It's far from a good movie. The futuristic storyline has been done to death, and nothing really stands out about it. It has some entertaining action, good humor, and a great cast to keep you watching. As much as I love Emilio, he's not really the action star type. That being said, he managed to pull it off with his natural charisma. He borders on cockiness at times, but his charisma manages to keep him likable and easy to root for. Mick Jagger is terrible as the villain. He should have kept his day job, in lieu of dabbling into acting. Anthony Hopkins is here for a paycheck, nothing more. Rene Russo is classy as usual. She takes a one-dimensional part and makes it worthwhile. That's what genuine talent is able to do. <br><br>I enjoy it for what it is! Then again, I dig anything that is enjoyably cheesy. This movie falls under that category. They were obviously aiming for much more, but they weren't able to pull it off. Keep your expectations low, and you'll have a decent time<br><br>5.5/10","user":"callanvass","rank":[10,10]},{"title":"Comparative values","rating":10,"date":"29 August 2005","review":"It may well be that this movie deserves the low praise it got from the IMDb voters, but then how many newer sci-fi movies getting higher scores have really done better? This 1992 flick has been sitting on my DVD shelf for some time now and I've decided to re-watch it after seeing the new sci-fi blockbuster \"The Island\" (I've seen some parallels between the two that brought \"Freejack\" back to my mind). Special effects notwithstanding, I still believe that the older movie comes out a winner. There is just that much of a better story telling, coherence, actor play and a general ambiance that makes \"Freejack\" a movie one would want to watch over and over again. The movie is WELL-DONE. It's driven by a simple plot yet its imagery is clear and consistent and the characters have enough development for the audience to care for. A definite must for any sci-fi movie collection.","user":"DeepGrey","rank":[47,62]},{"title":"Relaax","rating":8,"date":"22 February 2003","review":"You know, one thing that really bothers me is the amount of people who just refuse to relax and watch a move without having to consider whether it should win an Oscar.  I don't think Freejack was ever intended to be made for serious viewing - I think every actor in it at one time during the movie has got their tongue in their cheek.<br><br>What you do get in this movie are some spectacular effects, and I'm not talking about the end when you could just as soon go get a sandwich rather than watch the 2001-type slideshow.<br><br>It's just downright funny.  Mick Jagger as the villain giving Emilio Estevez a \"headstart\" by counting 1-Mississippi, 2-Mississippi is priceless. David Johanson shines as the shyster in any timeframe.  Rene Russo gives us an early indication of screen presence.  So just relax and have fun with it.","user":"bdx2005","rank":[55,77]}]