[{"title":"For all I know you are the rat; and this might be the best heist homage movie ever?","rating":9,"date":"26 August 2010","review":"Reservoir Dogs is the debut of director and writer Quentin Tarantino. It stars Harvey Keitel, Steve Buscemi, Tim Roth, Michael Madsen, Chris Penn, and Lawrence Tierney. Tarantino has a minor role, as does criminal-turned-author Eddie Bunker.<br><br>It feels a bit silly to write it now, but there was a time when Reservoir Dogs barely made a ripple in the cinema loving world; in America that is. Upon its release in the States it was moderately successful and comfortably made back its $1.2 million budget. However, upon hitting the British shores it was a big hit and grossed nearly £6.5 million and then Pulp Fiction exploded on the world in 94 and Reservoir Dogs got reappraised in its home country. The rest as they say is history.<br><br>Tarantino, the most enthusiastic of film fans, was once a video store clerk in Redondo Beach. There he dreamed of making his own movies and planned to make Reservoir Dogs with his friends on a relatively small budget. As luck would have it, Keitel got hold of the script and wanted in. With his name attached, and using his contacts, a serious budget was raised and so the Dogs were set loose. At the time of its popularity, Tarantino had to guardedly fend off accusations of plagiarism and a charge of just hacking from older classic heist movies. His argument was that he was making his own homage to the heist caper, but even so, the fact remains that Reservoir Dogs is spliced from The Killing, Kansas City Confidential, The Big Combo, The Taking Of Pelham One Two Three and we can definitely throw in The Asphalt Jungle as well.<br><br>Yet Reservoir Dogs is still extraordinarily fresh and vibrant, raising the bar for crime movies in the modern era. Tarantino of course has since gone on to prove his worth with other projects, so in truth his homage movie was merely the foot in the door for the talented son of Knoxville, Tennessee. In terms of its dialogue, tho, and its gleeful use of \"ultra-violence,\" it has few peers. From any decade. It also helps considerably that Tarantino has assembled a quality cast to make his non-linear classic shine. Keitel is a given, but Roth is exceptional, as too is Buscemi, while Madsen is frighteningly convincing as psycho for hire Mr. Blonde. Then there's the 70s soundtrack, a vital part of the narrative as we hear the dulcet tones of Steven Wright Djing on K-Billy's Super Sounds of the Seventies. If you have not seen the film yet? Then I promise you will remember Stealers Wheel-Stuck in the Middle for the rest of your cinema loving days.<br><br>And that's the thing with Reservoir Dogs, it's crammed packed full of memorable things. A quip, a bang, a song or the WTF ending, as homages go; it's one of the very best. 9/10","user":"hitchcockthelegend","rank":[43,46]},{"title":"You shoot me in a dream, you better wake up and apologize!","rating":10,"date":"3 March 2017","review":"Tarantino's brutal debut film. From the original initial dialogue, to the final outcome, the director astonishes everyone and makes clear his style: anthological dialogues (pay attention to the discussion in the distribution of colors that will identify each gangster, hilarious) a breakthrough structure, very good soundtrack (as in all his films), great doses of violence (although not at all gratuitous, but rather ironic) and, above all, a lot of black humor. In addition to superb performances by Harvey Keitel, Tim Roth, Michael Madsen, Steve Buscemi and Chris Penn. In short, a great example of good noir cinema (with all its ingredients: shootings, violence, betrayal, suspense, etc.), but with the innovative and very personal touch of the brilliant director, who would later continue to dazzle with the wonderful \"Pulp Fiction\". Oh, and the scene from the beginning with \"Little Green Bag\" is legendary. 10/10","user":"Tomas_buffay","rank":[92,105]},{"title":"Quentin Tarantino begins his directing career with the first of several chronologically mixed, disturbingly violent, and incredibly powerful films.","rating":10,"date":"18 August 2000","review":"Reservoir Dogs is a testament to the idea that \"less is more.\" This doesn't apply to the violence, the film is extremely violent from beginning to end, but the details of the botched diamond heist, which the entire film is based on, are conveyed only in the dialogue, except for one scene where Mr. Pink (Steve Buscemi) recalls his escape. The whole film takes place after the failed robbery is over, and the mystery that unfolds among the criminal participants is amazing to watch. <br><br>This is not a normal crime film. The thing that really sets Reservoir Dogs apart from all of the others is that it is PURE. When you look at the screen, you're looking at reality. There are no Hollywood actors, there's no make-up to make them look pretty, there's little to no comic relief, and most important of all, there's no goofy romantic subplot clumsily thrown in, a detrimental trademark of so many action films, as well as  virtually all Jerry Bruckheimer films. Instead of all of that garbage, Tarantino decided to just present the film as simply and straightforwardly as possible, and by doing that he makes it seem that you're really looking at a bunch of criminals trying to figure out what to do after a suspiciously failed robbery. <br><br>Even though most of the actors were known at the time this film was made, the film was delivered in such a way that you don't see the actors at all, you only see the brutal characters that they portray. It is genuinely frightening to imagine being in the same room with any of them, and this is a quality that is rarely achieved in any kind of film.<br><br>\nMake no mistake, Reservoir Dogs is among the most violent films ever made, and some scenes are really painful to watch, but the way that reality is captured is something that justifies the violent excesses in this film. The violence is never glorified, nor is the criminal lifestyle. When films are overly violent, they usually get branded as such, but despite the extreme violence, Reservoir Dogs still manages to deliver an important overall message about the consequences of your actions. It remains high on the growing list of Tarantino's classic films, and it will not be soon forgotten.","user":"Anonymous_Maxine","rank":[435,546]}]