[{"title":"Respectful to the the genre.","rating":22,"date":"22 August 2004","review":"FREAKING LOVED IT!<br><br>This (to me) is a perfect flick for what it's aiming at. Seven people and a drifter named Braker are trapped inside a old church/ new motel while the super cool COLLECTER (Billy Zane, in a role that was meant for him) and his group of nipple pierced, glow in the dark green eyes, cloven hooved, goatee sporting, slimy demons trick and mangle the cast in order to get a \"relic\" key that hold the power of darkness from taking over the world.<br><br>Ernest Dickerson does well in the directing seat. The horror,comedy, and drama all combined nicely and never went over with the drama or comedy. None of it felt forced. As for the characters, I really warmed up to them (even the asshole Roach), all of the actors brought a little something special to their rather thin roles. I'll always remember the sad prostitute Cordelia, the no bulls*** Irene, or the funny \"need a drink\" hobo Uncle Willie. THE COLLECTOR is the main highlight of this movie. Excellent delivery by Zane. The man is too cool for TITANIC. I loved the way he persuaded some of the residents into selling there soul, it was more then just having the demons come in. The idea of the blood in the key and being able to make barriers of not letting in the demons was pretty slick too. William Sadler and Jada Pinkett brought a lot of drama and humanity to the movie, they served their characters well. The gore is also kick ass and works well (all about that arm getting ripped off, and hand punching through a face) and the demons looked pretty sick<br><br>My only complaint is the whole shooting the demons in the eyes to kill them was kinda blah, but Billy Zane has fun with even that (\"I SHOULD KNOW, WHO MAKES UP ALL THESE RULES\"). This is one cool movie, stands on its own two feet and pays respect to a lot of past horror movies, any true HORROR fan will appreciate THIS. ROCK ON CRYPT KEEPER!!!... thanx for all those hot babes that flash their stuff, it went well with the movie and never felt sleazy.<br><br>DEMON KNIGHT ***1/2 out of ****","user":"Dellamorte_Dellamore07","rank":[46,51]},{"title":"It has some good gore, some cool creature effects but a bit slow n tried hard to cash in on the success of the tv series.","rating":7,"date":"9 January 2020","review":"I first saw this in the mid 90s on a vhs.\nRevisited it yesterday.\nThe film has some very known faces.\nIt is about a 'chosen' man (William Sadler) who has stopped aging n is on the run for 90 years. He possesses an artefact n a demon (Billy Zane) wants to get hold of that artefact without touching it.\nSadler takes refuge in a hotel with a bunch of characters we dont care for while the demons r trying to get inside.\nThe film has lots of gore, some nudity but it is a bit slow n the tension is lacking.\nThe effects r cool though. Watch out for the girl's face transformation scene.","user":"Fella_shibby","rank":[19,20]},{"title":"Billy Zane steals the show","rating":8,"date":"11 July 2004","review":"Billy Zane raises what would be a decent horror/action movie to a higher plane. His deadpan delivery and funny quips are surprising in a character that is supposed to be the quintessential evil demon. If there was any justice in the world Zane would've been considered for an award. His performance is that good. The special effects look dated now, but that doesn't hurt the movie significantly. The characters are sufficiently fleshed out (pun intended) making them a little more than meat for the rampaging demons. The story, while interesting, doesn't make a lot of sense, at least not the back story. God created the Earth but the demons were already there and had 7 keys which gave them power over the cosmos? Huh? That aside, the movie is well done and Zane's performance is not to be missed.","user":"bourenst","rank":[37,42]}]