[{"title":"Actually, I quite liked it...","rating":5,"date":"17 November 2010","review":"I have to admit, the only reason is an interview Courtney Thorne-Smith gave back in '98 on the Conan show (plugging this film) during which she had the misfortune to have Norm MacDonald as the preceding guest. He proceeded to excoriate this film, Carrot Top, and, by implication, the film industry, modern civilization, and the nature of existence itself with admirable aplomb. See here: http://www.youtube.com/watch?v=lL0WayC7jW0<br><br>It's funnier than the film. MacDonald is incredible. He actually got me to watch a Carrot Top movie based on his sight-unseen opinion of the film. <br><br>Courtney: \"It's like 9 1/2 Weeks, but Carrot Top.\" <br><br>Norm: \"So, it's like 9 1/2 Seconds?\" (long pause) \"'Cause he prematurely ejaculated.\"<br><br>Seriously, watch the interview.","user":"RamblerReb","rank":[27,28]},{"title":"The truth about \"The Carrot Top Project\"","rating":12,"date":"12 February 2003","review":"This might cost me my life, but I'm willing to let the world know about the evil that goes on in this country. Five years ago, unnamed officials in this government decided upon the answer to the upcoming overpopulation problems that plague the future. They needed to get rid of the lowest levels, the poor, stupid, and scared. Essentially the same idea Hitler had. But this Holocaust wasn't as obvious as the one the Germany perpetrated generations ago. They decided to draw all of the unneeded masses to one place where they would be gassed. They would set one of these areas up in every town in the ghettos. To draw only the stupid and deranged, they would offer free passes to the worst film ever made.<br><br>This is where Carrot Top comes in to the picture. They gave him his own film. Purchased a trained monkey from the circus named \"Alex Zamm\" to direct it. Spent as much as it took to make it as bad as possible. Ruined the reputation of decent actors like Courtney Thorne Smith, Larry Miller, and Jack Warden (previously punished by being in the Problem Child series) who opposed the governments agendas for years. They just wrote a sequence of horribly clichéd scenes that allowed Carrot Top to improvise (I hope?) his sterilizingly bad comedy.<br><br>Then they would pump in the gas. It was going to be a simple and quick executions. The bodies buried in Greenland. Thousands flocked, thousands died, no one knows. Fear them, they show us Carrot Top everyday on TV to numb us, to stupefy us, to keep us dumb and easy to oppress. I must go, the government has probably traced my wearabouts through my IP address by now, I must flee Berlin! Down with the regime!","user":"Danny-30","rank":[90,108]},{"title":"So bad I can't watch it all the way through","rating":2,"date":"9 September 2001","review":"There are many mysteries in life.  For example:  Why did any of the people other than Carrot Top agree to appear in this movie?  Why did anyone distribute this movie?  Why did anyone pay money to see it?  I guess none of these questions will ever be answered, but one thing I know for sure, this movie is one of the worst ever made with a budget this big.  It would already be bad, but the addition of Carrot Top's \"humor\" makes it even worse.  The only entertainment one could possibly get from this movie is to burn it, smash it, or otherwise destroy it in an amusing fashion.  If you were to rank it against every movie ever made, it would be right between \"Problem Child\" and \"Biodome\".  Nuff said.","user":"culwin","rank":[26,29]}]