[{"title":"Better than the Original","rating":12,"date":"12 April 2004","review":"While most people claim that this belated sequel suffers in comparison to the overrated original, I really have to disagree. While the first half hour of the original was great, it was done in by an ill-conceived second act which introduced the creepy voice on the phone as a pathetic schlub, and thus greatly deflated the third act where the psycho comes after Carol Kane's own children. The first half a hour of this sequel was as good as the original, but Fred Walton seemed to have learned his lesson and kept his psychopath creepy and mysterious in the last two acts. The only serious misstep this movie makes is trying to shoe-horn the original Carol Kane and Charles Durning characters into the plot. (What are the chances that Carol Kane's Jill would become a counselor at a college where she would encounter someone who had been through almost the exact same ordeal that she had?) And, by the way, whatever happened to Jill Schoelen, the actress who plays Julie? She was the true heir to Jamie Lee Curtis's \"scream queen\" title, not Linnea Quigley or some other untalented, serial bra-popper, yet this is the last horror movie I remember her appearing in.","user":"lazarillo","rank":[17,17]},{"title":"Good Thriller","rating":8,"date":"19 September 2004","review":"I really enjoyed this film. It was was really suspenseful and scary, especially when he is bothering her through the front door...you never know where he is! I recommend this movie to everyone who likes thrillers. Not a horror movie, but scary none the less. The acting is very good..and with big stars..the film is hardly a flop. When the film starts it gets right to the point..starts right off with the babysitter going into the house where she is to watch the children for the night. as soon as the door closes you know something isn't right. You know this babysitter is NOT alone. A couple words of advice for babysitters...always check every lock in the house!","user":"ohnospeed","rank":[12,12]},{"title":"Not if you have a weak heart !","rating":4,"date":"4 February 2003","review":"I managed to get a DVD of this from the USA - it's not available anywhere else. Picture and sound quality are superb - put on the DVD and play sound through the hi-fi or home cinema at high volume !! Every sound will scare you out of your wits. Continuous tension is maintained from beginning to end and there are alternating periods of silence and violent sounds ( even a door closing is frightening ). This means that throughout the film you are in a state of continuous nervous tension, for this reason I don't think it is recommended for those who have a weak heart!<br><br>My logical mind discerned a few holes in the plot and several things unexplained - what happened to the 2 children - why was this man persecuting her - how did Charles Durning manage to find the culprit so quickly - why did the baby sitter shoot herself of was it someone else etc etc........ This said, these considerations are secondary when you consider the principal aim of the film is to provide undiluted suspense to the viewer and to have him or her feeling edgy throughout !!  <br><br>Also the ending is superb as is the disguise of the culprit. Ideally, one would have wished a slightly longer film which explained the character of the culprit a bit more and provided a clue to some of the \"open\" points listed above, but despite this, the film rates very highly with me. I have not yet seen the original film but after seeing this one, I'm going to doubtless enjoy that too.......in fact come to think of it I'm quite a fan of those films featuring burly American actors such as Charles Durning and Brian Dennehy ..............","user":"nicholas.rhodes","rank":[12,12]}]