[{"title":"Stylish addition to the teen-horror cycle","rating":6,"date":"25 February 2005","review":"URBAN LEGEND <br><br>Aspect ratio: 2.39:1<br><br>Sound formats: Dolby Digital / SDDS<br><br>A serial killer descends on a New Hampshire college where he/she kills a number of students in the manner of various urban legends.<br><br>History has a habit of repeating itself. In the early 1980's, a series of low budget 'slasher' movies emerged in the wake of HALLOWEEN (1978) and \"Friday the 13th\" (1980), most of which were condemned as substandard imitators by critics and horror fans alike. The same thing happened in 1996, following the success of Wes Craven's SCREAM, a smug reworking of genre clichés which allowed 'sophisticated' multiplex audiences to indulge an attitude of superiority over those 'crappy' old horror flicks and the 'unsophisticated' viewers who once supported them. The subsequent wave of teenage horror pics were flashy, sexy and ramped to the max, and - true to form - virtually all of them were (ho hum) trashed by critics and horror fans alike. And yet, most of them made a profit, perhaps BECAUSE they were flashier and sexier than those earlier pictures, and because they were designed for a wider demographic than 'mere' horror fans.<br><br>Jamie Blanks' URBAN LEGEND is a case in point: Most reviews ran the gamut from harsh dismissal to faint praise, yet the movie is a visual treat, as creepy and atmospheric as any of the films which inspired it. Furthermore, Silvio Horta's unassuming screenplay confounds expectations with its solid narrative arc, recognizable characters and dynamic set-pieces, not to mention a climactic 'reveal' which offers a robust motive for the killer's devastating onslaught. There are a few embarrassing lapses along the way (such as the murder which takes place in full view of heroine Alicia Witt, which she ignores because she thinks it's a couple having sex!), and Horta can't resist a handful of cop-out contrivances (eg. the killer slashes the wrists of a girl known for her depressive tendencies, causing authorities to dismiss her death as suicide, though a routine forensic examination would have revealed the cuts were administered post mortem, AFTER she was strangled to death!), but these occasional blunders are redeemed by the movie's fast-paced editing, neo-Gothic visual scheme and clever plot developments. Blanks orchestrates proceedings with consummate skill, but he refuses to indulge the kind of transgressive gore that once distinguished this downmarket subgenre (where's Tom Savini when you really need him?!).<br><br>As expected, the talented young cast - including Jared Leto, Rebecca Gayheart and Tara Reid - is pleasingly photogenic, and there are lengthy appearances by TV favorites Michael Rosenbaum (\"Smallville\") and Joshua Jackson (watch out for the terrific \"Dawson's Creek\" gag!). Major co-stars include Robert Englund (Freddy Krueger himself!), John Neville and an uncredited Brad Dourif, who features heavily in a powerful opening sequence where Blanks and Horta pull a major switcheroo on the audience (I'll say no more). Loretta Devine is amusing as the campus security guard who views herself as a modern-day Coffy/Pam Grier (her fantasy is rudely curtailed by a climactic encounter with the rampaging maniac), and there's a brief appearance by Danielle Harris, the former child star of HALLOWEEN 4: THE RETURN OF MICHAEL MYERS (1988) and HALLOWEEN 5 (1989), playing an adult character FAR removed from the angelic poppet of those earlier pictures! Beautiful, fairy-tale score by Christopher Young. Followed by the largely unrelated URBAN LEGENDS: FINAL CUT (2000).","user":"Libretio","rank":[47,64]},{"title":"i loooovvve this movie!!","rating":10,"date":"28 September 2005","review":"omg, this movie is one of my faves... a lot of people think it is just another slasher flick, but i think the plot is really intriguing and keeps you guessing until the end. i had no idea who the killer was, and once i found out, i was totally surprised! although it is a bit scary at times, \"urban legend\" can also be humorous. i love the soundtrack too, and the cast is awesome. Alicia Witt was excellent as the heroine of the story, and Rebbecca gayheart gave a stunning performance as the psycho killer Brenda. she really knows how to act CRAZY (even if her motives are a little odd)!! and Jared leto is hot (i just had to add that). so if you love murder, humor, romance, and legends, \"urban legend\" is the movie for you. trust me, i've seen it about 500 times to date (and i first watched it last summer!).<br><br>and FYI, it's on abc family for the \"13 nights of Halloween\" thing next month! i'll be watching it... will you??","user":"SherryandGiggles","rank":[20,28]},{"title":"Full of clichés...","rating":5,"date":"29 June 2019","review":"I definitely feel that this film gave me nothing. Really nothing. It was full of clichés, as I've mentioned, and there wasn't a plot twist (at least to me).<br><br>Firstly, the clichés. I felt that I was watching a film, that desperately wanted to be better than \"Scream\" and to get all of its cult following. The concept, although it was about urban legends, something that I appreciated, it had many vibes from other slasher films, so I think that it lacks of authenticity.<br><br>Second, I knew who was going to die, and I could tell easily, during the film, which deaths were \"fake\", the ones that wanted to shock you a little bit.<br><br>Third, the characters. I mean, they managed to make even the characters to act in a cliché way. There was the serious final girl, the one whom they try to mislead you that he or she is the killer, but he's or she's not. The over the top excited person, the idiot prank boy, the blonde bimbo, the goth, and the a*****e! Nothing new, nothing creative.<br><br>As I've said, I knew 90% of what was going to be happen, so I haven't felt any thrilling moment. Except one scene.<br><br>Let's say the things that I liked about this film. First of all, the concept of the urban legends it was cool, and maybe the only prototypical. I also liked the first scene. It was actually very thrilling and gave me a very good first impression. The person who played the killer was cool and had good acting skills.<br><br>To conclude this review, I want to mention that this film is not necessarily bad, but to me it wasn't good either. It was something between \"Scream\" and \"I Know what you did Last Summer\". Plus urban legends. As a person that have seen many many similar Films, I have to say that I kind of knew the flow of the plot, so I did not found it thrilling. If you've never seen similar Films, maybe you'll like it. It's a fun film to watch, if you don't have anything to do.","user":"helencmm","rank":[4,4]}]