[{"title":"Old Men Won't Cry- Scent of A Woman","rating":10,"date":"26 November 2007","review":"Why is Pacino such a beast acting? I'll tell you why. His passion. Passion that overwhelms all surrounding him. His voice starts roaring and he forgets that he is Al Pacino. He suddenly becomes his character, he stops seeing around him and he is now a prisoner in his role.<br><br>The movie is about Pacino. His acting is grand, superb, majestic, heart-wrenching, deep, emotional, so forth. His portrayal of a blind man dangling in the rope of his life, is not only credible but immensely touching. We see directly, through his crystalline performance all of the pain that griefs on his character. Any other actor would have given a corny, over the top performance. Pacino is the Ace.<br><br>Chris O' Donnell gives also a fantastic performance, shy and unsure will start to understand Colonel Frank Slade in a short trip that will change their future lives. This movie is not Hollywood Rubish. Martin Brest directs a movie that hits no cheap feelings and floods on great emotions that immediately contact the viewer. You have to be rock solid to not be touched.<br><br>A masterpiece, one of the best studies on man's desperation, helped by wonderful performances and and a stirring, poignant script, with no wasted lines. You will raise goosebumps with scenes like the tango scene, you will laugh, you will cry, you will feel empathy, sorrow, anger. Isn't this movie the Holy Grail of Emotions.<br><br>Don't miss it. One of a kind.","user":"billion_mucks","rank":[228,239]},{"title":"Modern classic","rating":9,"date":"9 July 1999","review":"One of the most overall pleasing movies I've seen, Scent of a Woman wins on all levels--emotional and intellectual.  Of course the primary reason it succeeds is Al Pacino, whose Oscar was well-deserved, needless to say. Chris O'Donnell doesn't overplay his part, and in doing so is realistic and natural. The tango scene, the Ferrari scene, the pseudo-courtroom scene are excellent.  Pacino is wholly believable, and although at first he seems overly gruff and nasty, we grow to sympathize with him--especially when that twerp Randy insults him cutthroat-style at Thanksgiving.  It's obvious that while Slade acts like he doesn't care, his repetitious \"hoo-ha\" response makes it obvious he does. My favorite line comes during the Ferrari scene (I was laughing so hard when the cop left, failing to realize Slade is blind.) As Slade careens down the street at 70 mph, Charlie yells, \"You're going to get us killed!\" Slade answers, \"Can you blame me? I'm blind!\" On that note, Pacino succeeds marvellously in portraying a blind man.  We never doubt for a second that he does, in fact, live in total darkness. Yet others, like the cop, probably the spectators in the restaurant in the tango scene, don't realize it.  Ironically enough, Slade acts as though he doesn't want to be treated as the proverbial blind man who needs a cane and a guiding arm.  However, in the final scene, he emerges with a never-before-seen pair of dark glasses (after which follows the charismatic speech.)  I wonder, was this to throw them off guard??<br><br>This movie is a modern classic.  Some find it too long, but I enjoyed every minute and didn't acutely notice the 2 1/2 hrs gone by.  A wonderful film that I recommend to all.","user":"Altaira","rank":[157,172]},{"title":"Character over glamour","rating":22,"date":"22 December 2003","review":"The Scent of a Woman is the kind of film that many would think belongs to a bygone era.  While it is frank and contemporary without sugar coating it illustrates the value of character over glitz and how small acts can have long lasting consequences.<br><br>The film pits two characters who are diametrical opposites.  Al Pacino plays the world weary retired Army Lt. Colonel who through a stupid accident looses his sight and his way of life.  Chris Donnelly is a young prep school kid on a scholarship whose way of life may be coming to an end owing to the acts of richer kids at the exclusive prep school who pull a stupid stunt.<br><br>The blind Lt. Colonel needs an escort so that he can go to NYC and have a rip roaring time before he makes a fateful decision.  The poor preppy needs to earn a few bucks to travel and is in desperate need of some advice on how to get through his crisis at school.<br><br>The interplay between the two characters is mind boggling.  It is more riveting than the best Grisham novel.<br><br>Both characters are asked to make life and death decisions that call for them to reach deep into their inner core.  The right decision is unhappily the tougher decision to make.<br><br>Two terrific scenes that are not to be missed.  The first is in the New York ballroom where the blind Lt. Colonel teaches the actress Miss Anwar to dance the tango.  It is so smooth and dramatic that even a couch potato is tempted to reach for the Yellow Pages in search of dance lessons. The second and most profound is the speech that Al Pacino makes in defense of Chris Donnelly at the prep school disciplinary hearing.  It has to go down as one of the great orations of all times.<br><br>The Scent of a Woman is very satisfying on many levels.  The character development is superb, dialogue terrific, glamorous locations and a story line that requires the characters to show themselves to be the people they really are.  The film has a lot of funny lines and great drama.  This film is almost a 10 out of 10.","user":"RickJones-1","rank":[173,195]}]