[{"title":"A flawless thriller that would've made Hitchcock proud","rating":9,"date":"1 August 2005","review":"Nattevagten (1994) (aka Nightwatch) is a stylish thriller/horror from Denmark. I just finished watching it and I was blown away. It's the most edge-of-your-seat thriller I've seen since A Tale of Two Sisters. This guy, Ole Bornedal, plots like a devil! The way he sets everything up is masterful. The script is so tight, practically every element that's established is later on used. Reminded me of early Coen brothers scripts. It also provides the viewer with sufficient food for thought, what with its underlying themes about the connection between sex and death, man's self-destructive tendencies versus his instincts for survival and self-preservation, and more.<br><br>There are a lot of creepy sequences, and one or two boo moments. The soundtrack is excellent. There's one unforgettable scene where something hideous happens to the sounds of this cheery, boppin' Danish song that seems to repeat the same verse over and over again. The result is very disturbing.<br><br>The style contains a lot of Hitchcockian characteristics, and the movie is done so well that it would have made Hitchcock proud. Everything is pulled off perfectly, and not once do we hear the gears of the plot grinding.<br><br>Considering how little known this movie is, I was very pleasantly surprised. I highly recommend it.<br><br>P.S. The main actor has a striking resemblance to Ewan McGregor, who reprised the role in the American remake three years later.","user":"Potty-Man","rank":[64,81]},{"title":"Superior thriller, consistent sense of dread keeps you on edge","rating":9,"date":"9 October 2001","review":"Miramax made a huge mistake keeping this film from distribution in order to make an American version. Though I can only imagine how much more horrible the situation would have been if Nattevagten would have been dubbed in English!<br><br>This is a thriller that has it all: tense atmosphere guaranteed to give you the creeps, characters with believable quirks (though I doubt a prostitute would actually try to bury her face in a guy's lap in a crowded restaurant), and twists that were not actually expected or used as a weak plot point (Malice was a film that tried to throw the audience off and just wasted our time).<br><br>Martin (Nikolaj Waldau) takes on a night watchman job at a morgue to help pay for his law education, doesn't fully appreciate his relationship with his girlfriend (Sofie Graaboel) thanks in part to his jerky friend (Kim Bodnia) who keeps pulling Martin into silly bets.  The loser has to get married, a rather interesting comment on the worth of relationships (something I believe the doomed moths trapped in a light fixture represent, along with other obvious meanings).  Once at work, immediately things take on an eerie bent with Martin staring at himself in a glass window and out into the dark halls, his apprehension at having to use a key that's on the other end of a room full of corpses (that's one question I had, would they REALLY put that key there? Oh well, it DID make it more creepy!), and a body that tends to move around.<br><br>Turns out much of this is because of part of a bet gone basically wrong, but figuring out the complexities of the name switch pot point and the prostitute's connection to the killer makes for fun sorting! The climax tends to fall into some minor cliche with the heros being hogtied (with the time it took to do that the killer could have easily killed them), but the snappy pace keeps you from picking it apart as you are watching.<br><br>I was also impressed by the fact that not the entire cast was made up of youthful characters, and even reversed the sex appeal factor by not having a usual love scene--this time you basically get to see a rather naked Martin instead of the typical \"let's try to find a way to get some breasts in here and there\" scheme.<br><br>I was very impressed that Anchor Bay has released Nightwatch/Nattevagten in Danish with English subtitles, giving the film the respect it deserves. For those who gripe that subtitles are annoying, all I can say to you is that you are either lazy or need to brush up on your reading skills.  I find that if I am absorbed in a good film I don't even realize I'm reading subtitles, it just works naturally.  I was still engrossed in this film and was affected by its scary nature. It is quite astounding how superior and effective this film is when compared to 1998's remake, which director Ole Bornedal must have done with some hesitance.<br><br>At the time of writing these comments I haven't heard the DVD's audio commentary by Ole Bornedal (and I hear it's a rather honest commentary from him too), so I don't know if this matter is dealt with, but I noticed at one point the subtitles for Martin say \"If this were a movie it would be called 'The Nightguard'....\"  So, then why is the English title Nightwatch?<br><br>Anyway, this is one thriller that succeeds practically on every level and people need to seek this one out!  With all the processed Hollywood drek being pumped out every week in theatres and video, you owe it to yourself to go out and look for something NOT on the top hits list.  Most likely this original Danish filming of Nightwatch won't easily be found as a rental, but I can assure you it's worth the purchase!<br><br>When you hear a foreign film is being remade for American audiences, see that foreign version first!  It's amazing how many Americanized versions have fallen flat and yet Hollywood still chucks 'em out.  So, while you can, for instance, see the foreign version of Insomnia before the American one surfaces....","user":"hippiedj","rank":[50,67]},{"title":"Excellent Danish thriller","rating":24,"date":"24 October 2006","review":"NIGHTWATCH (Ole Bornedal - Denmark 1994).<br><br>Danish writer-director Bornedal made an extremely suspenseful film about young law student Martin (Nikolaj Coaster Waldau) in Copenhagen who takes a job as the nightwatchman at a mortuary. A serial killer is lose on the streets, leaving behind a string of scalped female victims. Soon after Martin started his new job, one of the victims is brought in. That's when Martin meets homicide detective Peter Wörmer (Ulf Pilgaard). When one night one of the victims in the morgue is molested, Martin being the nightwatchman is suspected and soon finds himself trapped in a carefully planned frame-up.<br><br>Suspenseful, black humour, some necrophilia, this is superior genre movie-making. Bornedal goes for an ultra-realistic style and certainly employs some very skillfull set-ups that will have you on the edge of your seat. The performances are all-round perfect. In fact, I cannot recall a genre film of this kind with so many impressive performances. Superior scripting and character development by Bornedal helps this, but exceptional nevertheless. Kim Bodnia's role as Martin best friend Jens Arkiel got him noticed and he would later star in an equally impressive role in PUSHER (1996). Bornedal also directed an inferior American remake in 1997 starring Ewan McGregor.<br><br>Camera Obscura --- 9/10","user":"Camera-Obscura","rank":[24,30]}]