[{"title":"Not just the best Star Trek film","rating":10,"date":"23 February 2005","review":"Probably my favourite film of all time. The thing about First Contact is that it's not just about Star Trek. If you don't like Star Trek but can live through the first 20 minutes you'll find a gem of a movie which is as much about the future of humanity &amp; an invention so wonderful as it is about Yet More Star Trek Plot.<br><br>Warp Speed - they've been saying that since Captain Kirk. But how did it happen? and why might it all not happen, our future could be in ruins and one flight of one makeshift spacecraft some time after world war III will make all the difference.<br><br>The on-screen relationship between Picard &amp; Lily is totally magic, as is the relationship between the Enterprise crew members - you get a sense of team, of family.<br><br>First Contact is one film I enjoy watching again &amp; again. The flight of the Phoenix is one scene I totally love, along with the end scenes.<br><br>The only sad thing about the movie is that you come away and deep down you know there is no Cochrain, no FTL engine around the corner. Well, not yet!<br><br>\"I envy you, the world you're going to\" \"I envy you, taking these first steps\"","user":"ashley-120","rank":[166,207]},{"title":"Perhaps the best Star Trek film to date","rating":29,"date":"29 January 2003","review":"Star Trek: First Contact represents, at least to me, the pinnacle of the Star Trek movie franchise.  This film was, in my opinion, -by far- the best of the \"next generation\" outings, and perhaps the finest from the entire collection of silver-screen Treks.<br><br>The Borg, a futuristic race of half-man, half-machine cyborgs from the other side of the galaxy, try once again to conquer the Federation, by attacking it at it's very core, our beloved Earth.  This time, however, the Borg have a \"plan B\" up their sleeve.  After the destruction of their main vessel, they send a small group of Borg back in time to 2063, a time when Earth is vulnerable after suffering massive casualties due to World War III.  Once there they intend to prevent \"first contact\", an event that dramatically changes the course of human history, when friendly aliens discover humankind has learned how to travel faster-than-light, and make contact with the inventor of the warp drive, Dr Zefram Cochrane.<br><br>Of course the Enterprise crew must once again save humanity from certain destruction, by \"following them back and repairing whatever damage they've done\".  When they reach the 21st century, however, the Borg find resistance is not so futile, and begin to take over the crippled Enterprise, deck by deck.  Directing every move is the evil Borg Queen, played excellently by Alice Krige.<br><br>Patrick Stewart is, as always, fantastic as Captain Jean-Luc Picard. Stewart's background in the dramatic arts shines as he convincingly portrays a somewhat troubled and vengeful Picard, determined to destroy the insidious Borg once and for all.<br><br>The direction of Jonathan Frakes is flawless considering this film was his first attempt at directing on the big screen.  In a few scenes I get the feeling that Frakes was committed to squeezing the absolute best out of Stewart, and this he did, apparently with ease (earning him the nickname \"Two-Takes Frakes\" from production members).<br><br>This film has it all.  A well-conceived, intricate and dramatic plot, excellent acting, fantastic special effects, and real emotion on-screen. Picard's chilling \"the line must be drawn here\" monologue to Lily represents a scene with such dramatic quality that is rarely seen in science-fiction films. You can completely suspend disbelief and feel the anger, the pain, the sheer hunger for revenge in this broken man.  You are there with him, the future of humanity is on the line, and not for a second will you think otherwise.<br><br>Whether you are a \"Trekkie\" or not, this is a film you will enjoy, and while there are references to previous Trek happenings in the film (such as when Picard was captured and assimilated by the Borg several years earlier), non-Trekkie's should definitely be able to follow what's going on.<br><br>All-in-all this is one of my favourite films of all time, and one that I can watch over and over and never get tired of.  If you haven't seen it, why not grab a copy and check it out?  I give it a well-deserved 9 out of 10.","user":"rainmaker_au","rank":[130,163]},{"title":"One of the best sci-fi movies ever!","rating":10,"date":"15 November 1999","review":"This is one of the two best Star Trek movies ever made (the other being \"Wrath of Khan\"). Everything about this film is superb.... acting, set design, special effects, plot, and action. The story progresses at a breathtaking pace, and from the first 10 minutes when the Enterprise is locked in a life-and-death struggle with one of the best villains in all of sci-fi history (the Borg), to a perfect ending; there isn't a wasted or redundant moment. This is a film that both trekkers and non-trekkers can enjoy because the film explains enough about the back-story to get non-fans up to speed, and does it in a way that will keep the fans interest (check out the excellent opening sequence that introduces Picard's first encounter with the Borg and explains much of his implacable and obsessive attitude towards them throughout the film).<br><br>In addition to fine performances from the crew (highlighted as always by Patrick Stewart as Captain Picard), the supporting cast is more than equal to the task. Its too bad that the crew didn't bring Alfre Woodward back home with them........ she's one of the very few actors/actresses in Star Trek history who have been able to match Patrick Stewart's personality, acting skills, and histrionics. Also, I thought I detected a touch of romance between the two that could have been further developed at another time.<br><br>James Cromwell makes a perfect Zefrem Cochrane. It was a humorous touch to portray him as somewhat of an anti-hero, in contrast to the god-like reverence with which the characters in the film viewed him from a distance of 300 years.<br><br>The protagonists in the film, the Borg, have never looked more dangerous. I'm glad that this film returned them to their \"roots\", unlike their last few appearances in the television series in which they were becoming a little too domesticated.<br><br>This is a film to savor for any science fiction fan. 9.5/10.0 !","user":"rghawki","rank":[142,183]}]