[{"title":"Lighten Up, Will Ya!","rating":20,"date":"20 November 2006","review":"After reading several negative reviews analyzing this and other stoner movies as being stupid, mindless and lacking in plot. HELLO!!! This is a stoner movie about stoners getting stoned. Who cares about plot or social messages or that other deep crap. You want depth go see a Bergman or a Fellini film, lighten up and smoke a joint. I'm glad to see stoner comedies back in fashion after suffering through pretentious, preachy, boring 80s anti-drug dramas that are never truly grounded in reality and where the characters always either predictably OD or just simplistically kick their addiction. So rent this movie (or watch it currently on cable), fire up one and enjoy","user":"OldeSkool","rank":[60,69]},{"title":"You don't have to be under 25 nor a pothead to enjoy this movie. Maybe having familiarity with drug culture would help though.","rating":8,"date":"10 May 2005","review":"I had never heard of this movie 'Half Baked' until I was channel surfing cable this afternoon and came across it. While I had heard the name Dave Chapelle because of the television show recently airing, I was not familiar with two of the other three main characters. The guy playing the character in jail I have seen before. In other words, I am not up on who these people are/were. I am of the Chech and Chong 'Up in Smoke' generation of drug themed flicks. Saw them all back in the day. However, I found this movie much funnier than those ever were. Much funnier. The Scarface character was hilarious, but I found the Brian and Thurgood parts funnier and quite believable in an over-abundant way. I have read here many stating the cameo parts were the film's highlight. Not in my opinion. The main characters owned this one. As an aside from a 40 something, it is nice to see that this country(USA)has come along the road far enough whereby having a couple white guys, a black dude and a Cuban sharing a habitat together doesn't come across as contrived. The stoner parts all looked familiar to me. Funny movie.","user":"slate_77","rank":[37,44]},{"title":"A great comedy, Chapelle is hilarious","rating":9,"date":"5 January 2006","review":"Half baked is hilarious movie to me. Its a pothead manifestation film that doesn't take it self seriously and is pretty hilarious throughout. Dave Chapelle is very funny in the lead and to me is a better lead comedy actor than the likes of Martin Lawrence and even Chris Rock. Guillermo Diaz is also very good as Scarface. Rachel True provides good eye candy and decent performance as the female lead. This is not an Oscar film, but hilarious to watch with buddies and after watching it 3 times it doesn't get old. Its a funny screenplay, decent comedic direction and good performances, worth a look for any fan of comedy, pot or cinema.. 9/10","user":"PersianPlaya408","rank":[52,64]}]