[{"title":"Just as good as the first!","rating":6,"date":"3 March 2011","review":"Okay I know a lot of people don't like this movie, but I don't see what is wrong with it. The Newmans this time decide to take a family vacation and of course bring Beethoven along. Although this time he has had puppies. The puppies mother is after them and tries to steal them. But the family sticks together to try and save the puppies.<br><br>If you enjoy the first one then you will love this one. It is the same great cast and family setting. It is a non stop laughing fest just like the first.<br><br>Most of the time sequels aren't as good, not in this case. There are some great scenes involving Beethoven and his puppies. Children of all ages will love this along with their parents!","user":"ashleyparsons115","rank":[6,6]},{"title":"Actually quite good!","rating":10,"date":"4 February 2003","review":"I don't understand the trashing comments I just read.  This film is very, very good.  I've seen it at least 5 or 6 times and it was enjoyable the first and last time I saw it.  The film making was superb.  I actually did some research to see where that cottage was located and see if there were any rentals.<br><br>I saw no character flaws in anyone.  Each character was precise and very believable.  Continuity errors were at a minimum.  I also don't understand the rating this movie got.  It was NOT THAT BAD!  If there was poor acting, or plots, or errors then I could see trashing the movie.  But really!<br><br>Even the musical score was perfect for each scene.  A mixture of real classical and real rock.  The music score designer deserves an 'A'.<br><br>Best parts: 1) Beethoven's nose in the beginning, followed by his dream sequence. 2) Anything Regina did.  She was perfect! 3) Grodin trying to explain where babies come from. 3) The bully sequence at the fair (bite this guy in the weiner!) 4) The hamburger eating contest. 5) The tree stump scene with Penn. 6) Finally, all of the grunting noises Beethoven made.  I can actually imitate each one.  My kids love it when I do that.<br><br>Come on people.  The movie was really enjoyable with quality Hollywood direction and design.  Please stop knocking it.  Give it another try.  Or next time, try watching it with a child.  You'll see.","user":"cohru01","rank":[16,20]},{"title":"Cuter than the first","rating":9,"date":"17 November 2005","review":"BEETHOVEN'S 2ND, in my opinion, is even cuter than the first BEETHOVEN. I laughed really hard when George (Charles Grodin) first discovered the puppies in the basement of his house and said, \"Oh, no!\" Those puppies were absolutely adorable! In my opinion, Regina (Debi Mazar) and Floyd (Chris Penn) were like Cruella and her henchmen, Horace and Jasper! I was so glad when the puppies got them all dirty. I mean, what human being would want to drown five sweet, cute, innocent puppies? When Beethoven caused the deck of Taylor's (Ashley Hamilton) lake house to collapse, I was relieved. This was because he saved Ryce (Nicholle Tom) from being raped. In conclusion, I highly recommend this cute movie to all you dog lovers or Charles Grodin fans who have not seen it.","user":"Catherine_Grace_Zeh","rank":[6,10]}]