[{"title":"Sexy, funny, smart, sad, EXCELLENT.","rating":10,"date":"22 May 1999","review":"Unlike Scoopy, I say this movie is WELL worth the effort and time, especially if you're familiar with the French New Wave.  Jean-Pierre Leaud, one of the biggest stars of the period (he was the little boy in Francois Truffaut's seminal \"The 400 Blows\" [no pun intended]) is hilarious as a caricature of Godard in particular and French filmmakers in general, and the rooftop interview with (the stunning) Maggie Cheung refers to both Godard's \"Breathless\" and, indirectly, Fellini's \"8 1/2.\"  Though it pokes good fun at the pretentiousness of the French New Wave, \"Irma Vep\" is also a tender elegy to a time in which movies were actually viewed as art, as something that really MATTERED.  Add to the humor and intelligence some really witty direction, superstylish cinematography, and a slew of beautiful people, and you got yerself a postmodern masterpiece and just maybe one last, great film of the New Wave.","user":"Will-84","rank":[22,26]},{"title":"A well-constructed, pleasant surprise.","rating":8,"date":"22 May 2001","review":"Maggie Cheung or not, I didn't expect much out of this film. But I was quite pleasantly surprised by how much I enjoyed it. For one, to get someone to play themselves in a lead role in a fictional film (Jackie Chan films and Roy Rogers aside;) is usually a risky thing to do. But Cheung fits in beautifully, and is so charming that she is obviously perfectly cast.<br><br>The film is in English and French, and even though the French is subtitled, I think it's easier to get caught up in the flow of the film if you understand both (I'm fluent in French and didn't have a problem, but I can see where it might be overly distracting). Some scenes seemed particularly important for one to be constantly looking away from the action, so to speak.<br><br>The film was a little long, and some scenes probably could have been cut down or cut altogether, but it gives a good view into French film-making, especially the snobbish elitism that is apparently common in more intellectual/artistic film circles. It's hysterically funny at some points, and the characterization of the different crew members is brilliantly portrayed.<br><br>I especially loved the scene where Maggie Cheung gets into characters by actually prowling around as a cat burglar (though she throws away her booty;)<br><br>Overall: a tight, well done film. It drags just a bit at points, but strong acting and strong writing help to overcome such lags. A pleasant surprise and a fun film! 8/10.","user":"kergillian","rank":[18,22]},{"title":"Maggie Cheung and the embers of the French Avant-Garde","rating":8,"date":"8 October 2004","review":"Irma Vep is a film about film-making, an insightful and disturbing film which delivers some beautiful voyeuristic glimpses of vampirism, realist cinema, gritty black-and-white cine-retro and the old men who were once the chic of the French avant-garde film clique.<br><br>IMDb says: \"Rene Vidal, a director in decline, decides to remake Louis Feuillade's silent serial Les Vampires\" but this summary does not mention the real star of the film - Hong Kong kung-fu actress Maggie Cheung, playing herself. She is perfect as the exotic object, the ephemeral other, the object of desire who finds herself at the centre of the film's obsessive and sexually driven visual vortex.<br><br>In the privacy of her hotel room, Maggie Cheung zips herself into a full-body black latex catsuit which is going to be her vampire costume on the film set the next day. Maybe she is just getting into character, or maybe she shares something of the director's fascination with nocturnal life... predatory sexuality... visual fixation... the bound female form... anyway, the film really comes to life as she creeps through the hotel, her haunting feline eyes piercing through the spooky-sexy costume... the suspense here is that she is enacting her own vampire fantasy, of her own accord, not under the director's gaze. Maggie Cheung, all alone, on the roof, in the rain, exploring her own version of a male fantasy sequence. This is an unforgettable moment in art-house cinema.<br><br>The film really does justice to its themes, with the male characters degenerating from visionaries into voyeurs, and the female characters showing real depth in their willingness to accommodate the male gaze without losing their savvy post-fem powers. If you are a predictable guy like me, you will love the French-Asian grrrl power, which gives the film a pulse.<br><br>The theme of visual obsession is presented very well: the director is shouting, the cameras are rolling, and Maggie Cheung, in her catsuit, is ready to suck blood. In these moments she is bound but free, powerless but in control, objectified but liberated. I suppose this makes the film contentious and provocative, but I thought the message was very clear.<br><br>Without spoiling the end of the film: the last five minutes of Irma Vep is totally unique. You will never see another film which ends like this one. I can only describe it as a profoundly futile gesture, an act of great passion and impotence, and a brilliant moment in Lettrist art. It is Rene Vidal's last stand, a terrible but beautiful moment caught on celluloid: the work of a madman? a savant? a genius? you can decide, but I am sure you will agree that Irma Vep does a lot more than just scratch the surface of modern film art.<br><br>If you like Irma Vep, check out Shadow Of The Vampire as well.","user":"jdm101","rank":[27,35]}]