[{"title":"Another Burt Reynolds Potboiler with Soft-Core Sex","rating":4,"date":"27 September 2014","review":"Burt Reynolds goes slumming in this mediocre straight-to-video espionage thriller with Matt Battaglia as CIA mercenaries who are sent into Bosnia to steal a decoding machine. Everything about this potboiler is forgettable except for Burt—hamming it up and having fun the whole time—and the various soft-core sex scenes between \"Emmanuelle\" actress Krista Allen and Battaglia and a steamy scene in the back of a limo between a horny senator and a call girl. Veteran stunt coordinator Russell Solberg keeps it trim and slim at 93 merciful minutes with Reynolds playing a quasi-villain and Battaglia as a straight-up hero. The big Bosnia battle scene is as good as this minor action thriller gets and then everybody circles everybody else and blurt dialogue that drives the narrative rather than develop the characters. Nobody but Burt displays an ounce of charisma. Don't worry about Burt; he survives this stinker, but you may not like the time squandered on something as generic and predictable. Nothing but Burt stands out.","user":"zardoz-13","rank":[4,4]},{"title":"A shameless misfire...","rating":29,"date":"29 March 1999","review":"Disjointed action film features an unfunny Burt Reynolds as Raven (hence, the title character), the leader of a team of hotshot mercenaries. This specialized team of hardcore mercenaries serve as government operatives to the United States. On a routine mission in Bosnia, the mercenary fighters must retrieve a \"decoder\" device which will render the U.S. the most powerful nation in the world. However, when the going gets the tough, the tough turn into a state of foolishness. Each squad member becomes systematically eliminated...and the mission was deemed...a fiasco...<br><br>Raven, left for dead due to a helicopter crash...has turned out to be very much alive...and boy...is he having fun eliminating the competition... Raven, after taking a one year hiatus from his enjoyable job as a professional killer, is now self-employed.  He feels a necessity to eradicate the \"Four Stars,\" a group comprising of corrupt U.S. Senators who were responsible for selling Raven out during the disastrous mission at Bosnia. One by one, the members of the Four Stars succumb to Raven's various booby traps, and the remaining few must join forces with several ex-mercenaries for Raven is capable of undermining an esoteric government conspiracy.  When the odds turn substantially difficult, the hardened feel compelled...to spout out stupid wisecracks!<br><br>RAVEN was a bomb of titanic proportions. The film's premise was one extended cliché with every stereotypical characters (i.e. Corrupt government officials, lonesome mercenary, damsel-in-distress, etc.) imaginable. The pyrotechnics were plentiful, and the body count was surprising high, but RAVEN lacked pizzazz and both a credible cast and plot. The humor in RAVEN, granted, was hysterical at times.  Still, the humor in RAVEN was undeniably sophomoric...<br><br>RAVEN was a numbing experience. The film tried to be a mixture of both a comedy and an action/adventure film.  However, this film manages to FAIL on both accounts. The motion picture, RAVEN, like a nomad, wanders around aimlessly with nowhere to go and no direction to seek.  This movie had absolutely no ambitions and the ineptitude cages the entire film in, being viewed as no more than a low-rent actioner.  Burt Reynolds certainly has done better films in his life...and he definitely has had better experiences.<br><br>RAVEN is simply a pitiful,  trite, as low    as  they     can    get thriller with no suspense that can't be predicted a million miles away. SMOKEY AND THE BANDIT this is not!  The only justifiable reason to watch this movie is to check out the fine actress, Krista Allen, who shows plenty of promise.  Her dynamic appeal and wonderful personality make this film barely palatable.<br><br>RATING: *1/2 out of ****.","user":"ChoiBaby","rank":[10,13]},{"title":"what is it all about?","rating":3,"date":"3 March 2002","review":"what should we do with a movie like this? suspense? no. good acting? no. funny? no. a beautiful supporting actress? ahhh. there we are. krista allen is definitely an eye candy. but if you really wanna see her nude, then check out the \"emmanuelle in space\"-series. if you don´t care about her at all, then there´s no real reason to watch this. I mean, it´s not that bad. pyrotechnics, guns, muscles, sweat and a twist at the end - but everything´s quite ordinary. \"raven team\" (german TV title) is entertaining - nothing more, nothing less. you won´t remember that much after you watched it.","user":"oddinary","rank":[8,10]}]