[{"title":"Absorbing, Shocking Movie","rating":8,"date":"19 July 2002","review":"A highly disturbing film about the violent relationship between a disturbed man, and his adolescent step-son. Remarkable performances from Robert DeNiro and Leonardo DiCaprio. The desperation and hatred is clearly conveyed by both of them; to the point that it's downright scary. <br><br>Deniro's character is so seemingly normal, and yet so menacing and terrifying. Another remarkable acting performance from him.<br><br>The taunting of the step-son, and the violent confrontations between the two are ugly, yet mesmerizing. You feel the claustrophobic feeling the boy must have had living in this small town, trapped into this relationship. Some of this is very tough to watch.","user":"jmorrison-2","rank":[64,70]},{"title":"A remarkably compelling piece of work, with groundbreaking performances by DeNiro and DiCaprio","rating":9,"date":"9 February 2002","review":"I heard of this movie before, but I had no knowledge of what it was about, and basically rented it because it looked good and Robert DeNiro is the star--my Number One favorite actor.  <br><br>Well, DeNiro's performance is one of the high points of the film, and he is extraordinary as the abusive father who seems pleasant and jovial at times, but can turn violent when you push his buttons.  Leonardo DiCaprio is also great, in one of the best performances of his career.  Over the years, he's been gaining a reputation as a glamour guy.  And that he is, but you must see his performance in this movie before regarding him as \"just another pretty face.\"  He was still in his early teens (I'm guessing) when he made this film, so this was a long time before he hit it big with \"Titanic.\" Ellen Barkin is also good, but I wish her character could've been developed a little more.  I kept wondering, during the course of the film, why she felt like withstanding Dwight's abuse for such a long period of time.  In the beginning of the film, she's established as a free spirit--the kind of woman that romances a man, then drives off to another state to find her next man.  Well, why didn't she do the same thing with this jerk?  The film is based on a true story, so I'm sure she really did stay with him that long, but I just wanted to know her motives.  <br><br>\"This Boy's Life\" is a solid, beautifully made slice-of-life that kept me glued to the screen from start to finish.  The climax is an emotional powerhouse that made me want to stand up and cheer.  Please check out this underrated masterpiece!  <br><br>My score:  9 (out of 10)","user":"mattymatt4ever","rank":[69,76]},{"title":"A terrific introduction of Leo's talents","rating":9,"date":"22 February 2006","review":"Robert DeNiro is one of the finest living actors of Hollywood, most of his movies are pure gold, not to mention this fine film \"The Boy's Life\". He and not too well known at the time Leonardo made a wonderful coming of age story. Toby is a boy who is constantly on the move with his mother. He gets into trouble at school, smokes, and swears, not your straight arrow kid. But when his mother's new boyfriend, Dwight, offers to take him and turn him into a \"straight arrow\" boy with a good future, he does so. When he and the mother finally marry, Dwight's true colors start to show and not for the good. He's an alcoholic and abusive drunk who will not rest until everyone goes into his ways of thinking. With some other little unknowns like Eliza Dushku and Tobey Maguire, this is a terrific film.<br><br>The acting is just incredible. The chemistry that feeds off of Robert and Leo going back and forth of their fights and anger, it's incredible. Leo's talents just shine and I would highly recommend this film if you enjoyed \"Stand By Me\". What a great movie! <br><br>9/10","user":"Smells_Like_Cheese","rank":[43,48]}]