[{"title":"I positively adore this movie","rating":12,"date":"12 June 2002","review":"Sometimes when you watch a movie you get the feeling that the cast and crew had a fantastic time making it, which makes the movie even better.  I got that feeling during Muppet Treasure Island, and as a result it is one of my favorite movies.<br><br> I thoroughly enjoyed Kevin Bishop's (Jim Hawkins) performance: since I usually find young/child actors to be very grating, that's saying something. The Muppets were, as usual, all very funny.  The jokes and asides were too, too funny (like Gonzo finding Henry Kissinger's book Diplomacy' in Captain Billy Bones' trunk), the songs were fun and catchy, and the pace was brisk and exciting.  Tim Curry looked like he was having the time of his life playing Long John Silver amidst a sea of Muppets.  I had great fun watching his performance.<br><br> Go watch this movie if there's even a spark of kid in you.  You won't regret it.","user":"jerizda","rank":[23,26]},{"title":"Yo ho ho and a bottle of...fun!","rating":10,"date":"14 February 2004","review":"Although this film has taken quite a beating since its release, I fail to understand why.  The songs are catchy, the script is hilarious, and the performances are stellar.<br><br>Let's start with the music.  Whether it's the wonderfully fun \"Cabin Fever,\" the touching \"Love Led Us Here,\" or another one of the wide array of tunes, nobody can say that they are inferior to any other Muppets melodies.<br><br>The script is full of one liners and clever dialogue that never grows old, delivered by a cast and vocal talents who are incredibly talented.  Tim Curry, sinister and wonderful as ever, plays Long John Silver to perfection. Billy Connolly is also worth mentioning, despite his brief appearance in the film.  And young Jim Hawkins is just as he should be, albeit surrounded by a crew of muppet pirates.<br><br>This is my favorite Muppet film, and I think everybody should give it a try and embrace a different sort of humor-filled extravaganza.","user":"BroadwayBaby76","rank":[27,33]},{"title":"CABIN FEVER! AHHHHH!","rating":23,"date":"23 January 2003","review":"Awsome Muppet Adventure. I don't care how many people hate this movie, I still think it's smart, funny, and amazing. The muppets still have it. Though I agree by most by saying it's not the best Muppet movie, it sure beats the hell outta \"The great muppet caper\" (How slow was that movie?!). Tim Curry, the greatest and most under rated musical preformer alive, is at his element here. The music is awsome and his one song (\"Upstage Lads, this is me only number!\") is awsome. This is a good movie. For a pirate movie, and a muppet movie.","user":"CaptainChunk","rank":[24,29]}]