[{"title":"Generation X Heist Movie","rating":9,"date":"15 December 2003","review":"Killing Zoe played in Seattle theaters for exactly one week in August of 1994 and I managed to see it twice.Everything about this movie worked for me: the writing, the cinematography,the acting, the editing and the music. From the first images rushing through the streets of Paris until the blood-soaked climax, I was mesmerized. I consider myself lucky to have seen it in theaters with a good sound system becauseI have queried friends who have seen it on video and they had a completely different opinion of the film because they had missed key lines of dialog that really go a long way towards investing Killing Zoe with a certain quintessentially 90s vibe of doomed heroin-soaked romanticism, giving it deeper levels than most people are willing to admit.","user":"raegan_butcher","rank":[60,81]},{"title":"Underrated caper flick. Not a great movie, sure, but still a very good one.","rating":12,"date":"12 May 2003","review":"'Killing Zoe' is a movie that has grown on me over the years. When I first watched it I didn't think all that much of it, but each time I've seen it since I've liked it a little more, and I'm at the point now where I like it a lot. I don't think it's a GREAT movie, but it's a very good one, and extremely underrated. Roger Avary's connection with Quentin Tarantino has turned out to be more of a hindrance than a help to him. 'Killing Zoe' was frequently dismissed as just another Tarantino clone, which to me is unfair, because a) Avery actually wrote some of 'Reservoir Dogs', 'Pulp Fiction' and 'True Romance' (usually uncredited), and b) though the subject matter of 'Killing Zoe' is similar to say 'Reservoir Dogs', the approach is very different. And let's face it the heist-gone-wrong flick has a long history (the influence of 1950s crime classics 'Rififi', 'Bob Le Flambeur' and/or 'The Killing' on all subsequent variations of it cannot be underestimated), and Tarantino was building on an already established tradition. As well as that the hostage aspect of 'Killing Zoe' brings to mind 'Dog Day Afternoon' more than anything by QT. Anyway, I think this is an interesting movie. The violence is pretty blatant, but apart from that it is a subtle, character driven movie. Eric Stoltz ('Pulp Fiction') and Julie Delpy ('Before Sunrise') are both very good, especially in their first scene together, but the real stand out performance is by Jean-Hughes Anglade ('Betty Blue') who is outstanding. Anglade really makes the movie for me. 'Killing Zoe's reputation seems to be growing as the years go by, and now that the mid-90s Tarantino hype has died down it's about time it was judged on its own merits.","user":"Infofreak","rank":[51,68]},{"title":"An overlooked bloody gem.","rating":10,"date":"6 March 2001","review":"I love this movie.  I just rented it again,  and was not disappointed. Sure,  it's bloody  (Tarantino produced it)  and nihilistic and all that, but it's also got a wonderful sense of anarchy that most films are afraid to commit too.  As Emanuel Levy says in his book about independent cinema (\"Cinema of Outsiders),  \"it promises to take off in unexpected directions but it's major distinction is it's gift for hysteria and pompous existentialism.\"  It's all flash and blood and Julie Delphys breasts and guns and just a helluva lot of fun.  Great out there performance by Jean-Hugues Anglade as the insane French bank robber and Eric Stoltz as the moral center (!?) of the madness.  This film is even more fun when you've had a pint or two beforehand.","user":"suzy q123","rank":[40,53]}]