[{"title":"Colorful, Charming, Nice Story Most People Should Like","rating":8,"date":"16 August 2006","review":"Wow, there are lots of name actors are either in front of the camera or being used as voices in this unique animated-real life film. They use real people and animals (except for fake mouths when the animals \"talk\") and an animated mouse (Stuart, voiced by animation favorite Michael J. Fox.) who looks incredibly life-like.<br><br>The colors in this movie are terrific, especially with the house that the Little family lives in. The story has some clever stuff in it but it strictly played for laughs and reactions since credibility is about zero in many parts of this story. However, it's supposed to be outrageous. I don't think Geena Davis has ever played a nicer role than this. It was good to see. The husband was just as nice, played affably by Hugh Laurie.<br><br>The jokes are good for the kids and adults. I know a couple of parents who liked this movie even better than their kids, so don't believe it when someone writes that this is a film strictly for kids. That is not so. I did object to some profanity in here at the end, which seemed so out of place, but it's hard to expect Hollywood to get everything right. <br><br>The sequel to this film is even better!","user":"ccthemovieman-1","rank":[43,48]},{"title":"Sweet and memorable movie.","rating":8,"date":"14 May 2009","review":"This movie is really sweet, and I enjoyed it enormously. Sometimes it is a bit overly sentimental, and the human characters aren't as charming as the animal characters. Jonathan Lipnicki was sweet as George, but doesn't quite have the charm he brought to the The Little Vampire. Geena Davis and Hugh Laurie do amiably as the parents, but both seem subdued. Luckily, the human characters don't interfere too much with the animals, and still bring a certain charm to the screen. Stuart is wonderfully voiced by Michael J.Fox, and he joined by a hilarious Nathan Lane as Snowbell and a villainous Chazz Palminteri as Smoky. The script is intelligent and sweet, and there are plenty of charming scenes with Stuart and George. All in all, really sweet, fun and memorable. 8/10 Bethany Cox.","user":"TheLittleSongbird","rank":[19,20]},{"title":"Think Big","rating":7,"date":"16 August 2000","review":"Truly a family movie, especially made for kids. That explains all; the absurdity, the irrational acts, the incredible story and yet the finale.<br><br>Don't mess the story by thinking how can it happen in real life, because it won't.<br><br>The casts are well chosen, unfortunately Jonathan Lipnicki is less adorable than his appearance in Jerry MacGuire. Geena Davis is very standard as well as the other casts. But look at that little mouse! He's so adorable indeed, very sweet and beautifully made to make you fall in love with him from the first sight.<br><br>Well, it worked well, at least from the ratings and the gross income.<br><br>A family classic movie. Watch it on a Sunday morning. It will lift your spirit up.","user":"albechri","rank":[22,25]}]