[{"title":"A few hours...spent","rating":5,"date":"8 August 2004","review":"I didn't come out of watching this movie very satisfied. Nor did I feel I wasted time. It was an interesting few hours spent looking into the lives of these characters. They were not well-developed, or necessarily consistent. Personally, I think the story would have been better off starting where the movie ended. There were late night chats that seemed to be thrown in for effect, but did not necessarily have continuity with the day's events. All-in-all, if you're a fan of Sandra Bullock or Fischer Stevens and like seeing actors early in their careers (or in some cases, the height) it's a relaxing, non-challenging way to spend time. Worth a watch if nothing else on and you don't want to clean the house or think too hard.","user":"Mitiori","rank":[8,11]},{"title":"See below!","rating":26,"date":"26 February 1999","review":"This medium depth examination of the lives and inter-relationships of a group of upwardly mobile young friends sharing a house will be of most interest to fans of Rae Dawn Chong and Sandra Bullock although the unattractive Alexander Midnight (played with flair and verve by Fisher Stevens) is by far the scene stealer and a very interesting and complex character.<br><br>A worth while watch with a timely message\\moral.","user":"sshreck","rank":[9,13]},{"title":"Forgettable","rating":4,"date":"27 January 2005","review":"Other than seeing a young Sandra Bullock looking cute in a film that was made before she was a star, there is not a lot of positive things I can say. Several young people share an apartment, joined together by Rae Dawn Chong's character, MJ (that in itself should be a tipoff because I cannot remember a Chong movie post-Commando). Tensions mount at the big party and MJ's self-destructive personality causes the friends to break up when the party ends including a couple that just got engaged during the party.<br><br>There are some uncomfortable scenes such as when Bullock's 16 year old brother jumps into bed with MJ and says that she will be the one to \"deflower\" him and then immediately falls asleep. Basically, the movie had the same effect on me!","user":"miken-3","rank":[4,8]}]