[{"title":"A story about hope.","rating":9,"date":"2 February 2004","review":"Lorenzo's oil<br><br>A true story about a battle for the life of Lorenzo who suffers from ALD. A rare disease which destroys all basic functions like speech and movement and in the end takes the life of the person. In this movie the parents fight the clock by doing their own research and investigation.<br><br>This is a true masterpiece, about hope.  Acting and directing are fabulous. You can feel the cast being involved. I have seen a a lot of movies of Nick Nolte , but this must be one of his better ones. Here he proves he can do more than \"another 48 hours\". Nick is convincing in every way  in this movie, even though he has a very hard part playing an Italian(Augusto Odone).<br><br>Susan Sarandon plays the mother of Lorenzo. It's incredible how she plays the part of a mother near the end of her powers pushing away everybody that does not share the same faith in saving the life of her son.<br><br>This movie is underrated, and should be given a chance.  I seen a lot of movies and normally i do not watch this kind of movies, they cannot hold m y attention for long. But this one is different and really heartbreaking.<br><br>I had never heard about ALD. So today i did some investigation, and found out that Lorenzo still lives and you can write him if you want","user":"schauw","rank":[53,54]},{"title":"Painful, Yet Moving True Story....","rating":1,"date":"1 November 2002","review":"Definetly one of the most inspiring movies ever made. <br><br>\nAs individuals, it would be quite easy to feel helpless while up against a disease such as ALD and a medical establishment that has agendas other than the life of a small child.  But Augusto and Michaela Odone refused to just stand idly by and while there son's life slipped away from them.  Instead, they made the unprecedented decision to learn as much as they could about their son's devastating illness and then set about to find a cure.  Because of their efforts, thousands of boys will now be able to enjoy a life their child will not.  Had they not been the exceptionally educated and intelligent people that they were I don't know if they would have been able to accomplish such an unbelievable feat.  Who knows?  What's important to remember, and what I think is the moral of the story is that great things can be accomplished when people become determined to make a difference.<br><br>\nThough Lorenzo regained his sight, some motor skills, and the ability to swallow, his condition hasn't improved to a large degree over the years, and will not until science is able to regenerate the myelin sheath covering his brain that was all but destroyed by the ALD.  At the end of the movie, Augusto was involved with a group of scientists who were about to begin trials that would put the myelin back into some puppies who were born with this defect.  I, along with others pray for those suffering from this disorder, as well as for people with other diseases such as Multiple Schlerosis that this therapy could help, that they will be successful.      <br><br>\nSadly, Michaela passed away not too long ago.  Being from Virginia the Odone's are considered heros in this state, so her death made the papers here.  I cried when I thought of how difficult it must have been for her to have to leave the child she'd spent so many years giving hours upon hours of endless care and attention.  I'm sure it never crossed her mind that he would outlive her.  <br><br>If you've never seen this movie, be sure not to miss it.  It's a stellar 10!!  But be sure to bring a whole box of tissues, you're going to need it!","user":"alexandraslate","rank":[24,24]},{"title":"Turning misfortune into miracles; turning tragedy into triumph","rating":1,"date":"1 March 2004","review":"This is the true story of Lorenzo Michael Murphy Odone, who, at the age of seven, suffered from a rare, incurable brain disease called ALD. The doctors said there was nothing they could do and that he would die within 24 months of diagnosis. Lorenzo's parents, Augusto Odone (Nick Nolte) and Michaela Odone (Susan Sarandon) decided to gather all the information they could find on their own. Day by day, night by night, from laymen to dedicated researchers, they discovered an awful lot more about the disorder than doctors and scientists. As Lorenzo's condition deteriorated, they never ceased to soldier on. Eventually, Augusto Odone solved the mystery and invented a prescription- a special form of olive oil which could help boys (the disease is passed on by the mothers to their sons, not their daughters) with ALD. Because of his contribution, Odone received an honorary medical degree. And at the age of fourteen, Lorenzo could make some movements and began trying to communicate with the outside world with a computer...<br><br>I wept several times when watching this film. Notwithstanding all the odds, the Odones struggled and conquered their misfortune, and their achievement was outstanding. This is an intense drama with fine acting and something to think about deeply.","user":"RachelLone","rank":[48,53]}]