[{"title":"Unscrupulous maid of honour produces neither comedy nor romance","rating":3,"date":"27 May 2006","review":"This is a popcorn movie, a chick flick, that leaves a lot to be desired all around in the ethics department. Normally I am a huge fan of Julia Roberts but in this woeful tale, she fails to come across as her typical vulnerable and endearing self.<br><br>The improbable plot revolves around a food critic, Julianne, who learns just days before the wedding that her long time best friend (and former lover), Michael, is about to be married to a lovely rich, blonde girl named Kimberly. In fact Michael invites Jules to be...no, not his best man...but the maid of honour. Jules flies from her home in New York to Chicago for the wedding, not to wish the newlyweds well, but instead to steal Michael away from Kimmy and make sure the wedding never comes off at all. She has four days in which to convince the unsuspecting groom that she herself, not Kimmy, is the bride for him.<br><br>My first of many problems with this unlikely tale is that former lovers do not tend to make ideal best friends for all the reasons revealed in this movie, namely lingering passionate feelings and issues of jealousy. Furthermore, Jules's second best friend (as it were) is also a man...her editor, George, who conveniently happens to be gay. Does this girl not have any female friends at all, like most young women? <br><br>Actually, George comes off as the character in the movie with probably the most integrity, which isn't saying a lot in this tale of immoral fluff. He's a true friend to Julianne, flying from afar to be with her and offer comfort. He indeed gives Jules sound advice, namely to just tell the guy she loves him, and later when it's obviously not working out, to graciously let Michael go. However, George is cast as the stereotypical homosexual friend, which has all been done to death by Hollywood. Jules pretends to be engaged to George in order to elicit jealousy from Michael (just one of her countless lies), but this fabrication doesn't seem to go anywhere. They never really officially undo the ruse. By the way, I love Dionne Warwick's singing but found the entire singalong at the rehearsal dinner just too silly.<br><br>Jules is a stellar example of the old expression...With friends like her, who needs enemies? She's no friend at all to Michael (much less a BEST one), having no concern whatsoever for HIS happiness, until possibly the very end. Instead she's essentially nothing more than a jealous ex lover who lies, manipulates, and connives. Jules uses every trick in the book to split up Michael and his fiancée, including attempting to get Michael fired, allegedly at the behest of Kimmy and her dad. True, she repents of this horrendous deed, but it's hard to cheer for a \"heroine\" this unscrupulous. She doesn't get Michael in the end, nor does she deserve him. One gets the impression that this is not true love, but more a case of wanting what she cannot have. For some reason, Scarlett O'Hara came to mind while I was watching this.<br><br>Michael is indeed handsome, but the description that comes to mind here is \"jerk\". Frankly, Kimmy can have him! I wouldn't want to marry a man that reminisced ad nauseum about old memories with a former girlfriend right in front of me four days before our wedding. Is he too clueless here to perceive how left out and potentially jealous Kimmy feels? I was practically waiting for him to bring up past sexual escapades with Jules and expect Kimmy to politely listen! Michael is surely one of the most insensitive grooms ever to grace the big screen. Also, he sort of leads Jules on, dancing rather romantically with her while they recall their old song. Not to mention jocular references to her about having seen her naked in the past. Not my idea of a nice platonic friendship for a man about to marry another woman.<br><br>Personally, I was cheering for the loving bride to be, played to perfection by Cameron Diaz. Except that it's a little hard to buy her passive tolerance of her fiancé's rather unusual close friendship with his ex girlfriend or her colossal stupidity in not seeing through Jules's motivations from the start. Otherwise, she's definitely the sympathetic character of the piece, as when Jules sets out to humiliate her rival by insisting Kimmy sing at the karaoke bar, despite her vehement protests. Of course poor Kimmy is made to look like a female needing liberation when she announces that she's quitting college in the interests of her future husband and his career. Oh dear me no, it would never do for anyone entering a marriage to contemplate any sort of personal sacrifice! I found the whole ladies washroom scene near the end tasteless and ridiculous, when all the women are cheering on the potential verbal cat fight between Jules and Kimmy. Surely the screenwriters could have come up with better than this.<br><br>Just an aside, what is the point of the pathetic ice sculpture joke other than to be crude? I normally love the romantic comedy genre, but the quality seems to be sadly deteriorating these days. This isn't the absolute worst movie I've ever seen but really, it isn't that amusing a comedy nor is it much of a romance. Hopefully Jules experiences a bit of personal growth, but that's about all that can be said for this story.","user":"roghache","rank":[74,105]},{"title":"Yes Rupert !!!","rating":8,"date":"11 May 2006","review":"I think I like the movie most for Rupert Everett. His walk (which he describes as panther like) was amazing. he sticks to his friend, giving the only sensible advice possible. Say a little prayer for you was amazing, his story of his engagement with Julia was so delicious.<br><br>Julia's mean streak was magnificent.. also her eyes when she sees her best friend being carried away.<br><br>I enjoy this movie every time, and cannot miss the Rupert parts at all !<br><br>Although if you look closely, the sudden love for Dermot Mulroney is not natural. Not for a minute would a character like Julianne be happy with someone like him. She could rough it in seedy hotels, but not be tied down to someone's schedules. <br><br>So you are kind of relieved that Julianne walks free in the end. And she does have this magnificent friend like Rupert who drops everything and comes to her rescue. If he hadn't been gay, he would have been besotted with her and that is the kind of a man Julianne really needs<br><br>I like it that Julianne remains single in the end. That is what life is like, sometimes you have to hand over your loved ones and deal with life on its own. There is no magic guy who appears the minute you are single.","user":"avafive","rank":[22,28]},{"title":"A Frightening Comedy","rating":5,"date":"5 January 2008","review":"It was difficult to root for Julia Roberts. It would have been like rooting for Joan Crawford in \"Queen Bee\" or Gene Tirney in \"Leave Her To Heaven\" She's a latent nasty piece of work. A woman, we're told, intelligent, successful, but her feelings are of the lowest most ignorant kind. I didn't believe it, sorry. Not believing spoiled the whole fun for me. I though the premise was tapping into the worst in us and that in a comedy is really frightening. I'm sure the director, producers etc didn't do it on purpose but they obviously didn't think the whole thing through. The success of the film is another frightening aspect. Frightening on two counts - or audiences are blind and unaffected by the potential evil here or I'm raving mad and I'm seeing things. Whatever the case, I saw it and it frightened me. Two major saving graces, maybe three. The cuteness of Cameron Diaz's performance, the beauty of Dermot Mulroney and a smashing Cary Grantish turn by Ruperet Everrett. Go at your own peril.","user":"casamartinez01","rank":[52,73]}]