[{"title":"Easy to like","rating":8,"date":"11 February 2001","review":"Director Amy Heckerling knows a thing or two about high school flicks, having directed the highly successful `Fast Times at Ridgemont High'. Heckerling put her talents to work thirteen years later for the next generation of high schoolers, writing and directing this hilarious satire of life at Beverly Hills H.S.  Heckerling takes a different approach from `Fast Times', which found its comedy in the absurdity of reality, depicting situations into which teenagers really get themselves.  Here Heckerling's comedy mostly comes from mocking the superficiality of the high school `in-crowd'.  While this is not the first time this has been done, few have ever done it with such blistering wit.  This film became the standard for a spate of 1990's high school flicks set on the west coast that borrowed many of its elements.<br><br>The story focuses on Cher Horowitz (Alicia Silverstone), who is the most popular girl at Beverly Hills H.S.  Cher seems to be a superficial airhead, but this belies her conniving and manipulative skills at getting what she wants.   Superficial yes, airhead no!  In a plot derived in part from Jane Austen's `Emma', Cher works behind the scenes to arrange love matches between various students.  She even orchestrates a relationship between two teachers to improve their moods so they don't grade so harshly.  Like Emma, she is a master of love for everyone but herself.<br><br>Heckerling does a fantastic job of presenting what seems on the surface to be a cotton candy story with lightweight characters, but really runs much deeper revealing subtle truths about human nature.  Her direction of the fledgling cast is superb, milking every ounce of comedy out of each scene.<br><br>Silverstone sparkles in the role, which is probably not far from a reality with which she is very familiar.  She actually attended Beverly Hills H.S. with co-star Breckin Meyer, although she didn't graduate due to career commitments (she received a G.E.D.).  This film catapulted her to teen prominence with two MTV movie awards and an American Comedy Award as funniest actress in a leading role.  She plays Cher with both arrogance and vulnerability, and her comic timing is impeccable.  She also has a knack for physical comedy, with a broad range of contorted facial expressions and amusing use of body language.  The rest of the teen cast is also great, especially Brittany Murphy as Tai and Breckin Meyer as Travis.  Dan Hedaya is also priceless as Cher's work obsessed attorney father.<br><br>This film is easy to like.  It is a light and funny spoof, but it still has nuance.  I rated it an 8/10.  For those who enjoy high school comedies, this is required viewing.","user":"FlickJunkie-2","rank":[81,88]},{"title":"Clueless: An near-perfectly updated classic","rating":9,"date":"17 August 2006","review":"\"Isn't my house classic? The columns date all the way back to 1972.\"<br><br>When romantic high-school comedy Clueless (1995) was released, it was immediately vaulted into cult-status and firmly stapled as one of the most original teen-flicks of the 1990s. 'Original' is perhaps a term wrongly applied since it is based on the queen of romance Jane Austen's Emma (1815) . But what Clueless did was update the classic story by coating it with high school drama, teenage girls and shopping and sprinkle it with heavy doses of humour.<br><br>Emma is no longer Emma; she is Cher (Alicia Silverstone), a spoiled rich girl walking around in her Beverly Hills mansion in a bubble of stereotypes and teen-clichés -- but with a great big heart. So big-hearted, in fact, that she takes on the lost goofy new girl in her school to find her love and popularity, knowing full-well that it could destroy her own reputation. Clueless thus sees Cher and her best friend Dionne (Stacey Dash) on a mission to do good. Real good.<br><br>All the detours this mission entail are captured brilliantly in the film, taking the form of love-interests, parties, shopping and misunderstandings. From Cher's grumpy lawyer-father (an hilarious Dan Hedaya) and her nerdy step-brother (a likable Paul Rudd) to her eccentric group of friends at school, Clueless is a superb ride of teenage comedy camp. Only just over 10 years old, it is still extremely dated today. But no matter, because the 90s clichés like skateboarding, Marky Mark and the catch-phrase \"As if\" just make it so much more contemporary and fun to watch. <br><br>What elevates Clueless (1995) above generic high school comedy is its use of stereotypes. In most films they are unintentionally there to create a subconscious effect, but in Clueless they are made fun of to a much higher degree -- they are overblown and glorious. It brutally satirizes rich kids and their 'problems' and juxtaposes them with a classic, heart-felt love-story. The kind that only Jane Austen can write.<br><br>9/10","user":"Flagrant-Baronessa","rank":[89,101]},{"title":"Joyous and sparkling teen comedy","rating":8,"date":"8 May 2005","review":"This movie is way above so many of the others of its' kind. It's consumately likable, funny, sweet and sharp- the script is a killer, and the acting is fun and enjoyable.<br><br>Part of the success of the film is due to the fact that it appeals to several different audiences, and on multiple levels. <br><br>I first watched this movie with my mom, who loved the link it has to Jane Austen's Emma- all the main characters and the plot are direct modern equivalents to the novel. For instance, the famous passage in Emma inwhich Harriet burns all her \"mementos\" of Mr. Elton becomes the scene where Tai does so infront of Cher's gasfire. From this perspective alone, the movie is so fun and sharp to watch- even if your forte isn't usually American Teen High School comedy!<br><br>But this movie works on a really dumbed down scale too- let's face it, not everyone is big on English literature. The movie has an awesome soundtrack, Paul Rudd is unbelievably cute as \"Mr Knightly\" or rather Josh- and my boyfriend leads me to believe that the same is true of Alicia Silverstone- who still sparkles 10 years later as a mid-nineties teen queen with good intentions, Cher. Her performance here is impossible not to warm too, unless you have some sort of grudge against Valley girls, inwhich case you might not like it so much. Seriously though, this film is a must see for anyone who likes some real quality comedy- I'm so fond of this film personally that I would suspect basically everyone would enjoy it.","user":"Catscanfly","rank":[47,54]}]