[{"title":"A shadow of the original and a mockery of the book","rating":2,"date":"21 July 2000","review":"Michael Ende's lovely book is in two parts; Petersen's 1984 film is really just the story of Part I.  It's very good all the same.  Admittedly it would have been nicer if Petersen had made a four-hour film covering the entire book, but Part I's story is complete enough and works on the screen. Besides, there's always the possibility of a sequel.<br><br>Which makes it all the odder that the sequel, when it came, did NOT continue the story in the way that Ende had.  Oh, Miller and his writers mine what's left of the novel for ideas; what emerges is a gross caricature of Ende's work, a hideous, twisted, traducement.  Making the witch Xayide into too big a villain is the central mistake.  In the book Bastian's problem is a deep one: wishes take away his memories not because of the contrived plotting of some super-villain, but because of the very nature of the world Bastian finds himself in; because of the nature of wishing, really.  Xayide EXPLOITS this fact; she does not create it.  (Note that in Petersen's film the central villain also exploits rather than creates strife.)  Quite apart from this Xayide is much more chilling in the book.  In the film she's a cackling, cretinous vamp who wears ludicrous bird-of-paradise gowns.  She's a stage villain of the flattest kind.<br><br>One small change is more damaging than you might at first think: in Ende's book, Bastian doesn't leave Fantasia (\"Fantastica\" in the translation I read) until the very end.  This makes more credible his chances of being trapped there.  Bringing him back to our world for the start of the next film is enough to make the entire subsequent story silly and enervating.  It feels as if we have entered a sitcom: at the start of the next episode, everything is as it was before.  In today's episode Bastian must learn a Valuable Lesson About Life - coincidentally, the same one he learned yesterday (and will probably have to learn again in the next sequel, the dullard).  The first scenes of Part II are almost unbelievably bad.  I almost admire Miller's willingness to ADVERTISE how bad his film will be. We open with one of the cheesiest sequence of allegedly humorous pratfalls I think I've ever seen; in a matter of MINUTES, I lost faith in the film, as had everyone I was watching it with.<br><br>And so much of the original talent is missing as to make the whole exercise pointless.  The crew is almost entirely different; the cast - apart from Thomas Hill as Cornelius, who puts in an appearance even though he now has no role to play in the story - is different and vastly inferior, and all the beauty and fantasy that infused Petersen's production design is missing. It's not that the special effects are TECHNICALLY deficient, although they may be.  It's just that there's no vision to give them life.  When I see the turrets and drawbridges I find myself think of garage roll-a-doors and hydraulic lifts, for that is what they look like here.  The script is full of such clunkers you'll be unable to avoid wincing ... unless you treat it all as a joke, which, luckily, is my siblings and I decided to do.  Treat it as a kind of \"Plan 9\" experience and it may be worth watching.","user":"Spleen","rank":[61,76]},{"title":"That's another story... a poor one","rating":5,"date":"20 January 2019","review":"The original 1984 film is a little cinematic miracle, a neat adaptation which mostly captures the spirit of the rich, imaginative fantasy novel by Michael Ende. The NeverEnding Story featured excellent direction, lovely practical effects and sets and an effective script, but famously covered only about the first half of the book.<br><br>A few years later came The NeverEnding Story II to finish the job... badly.<br><br>Positives first. If we forget this is an adaptation, it's a run-on-the-mill but watchable fantasy yarn. Visuals are competent; they lack the beauty of the original but a few sets (like the Silver City) look nice.<br><br>Script-wise, however, this is a misguided adaptation.<br><br>Ende's novel is more sophisticated than it's usually given credit for. While the whole book is a love-letter to fantasy and creativity, and in the first half the looming threat of the Nothing is a metaphor for loss of imagination in our society, the last act takes a darker turn: it's a cautionary tale against going too deep down the rabbit hole.<br><br>Fantasy worlds and imagination are wonderful gifts to enjoy, argues the novel, but losing yourself in them to the point of neglecting your real life is a tragic mistake. This is thorny stuff which mainstream fantasy gleefully shies away from.<br><br>(Incidentally, one of my few beefs with the first movie is the very ending. Yeah, it's a crowd-pleaser which I loved as a kid, but in retrospect it doesn't really work thematically).<br><br>This second film glosses over any complex theme. Bastian's (Jonathan Brandis) rejection of reality, memory loss and power trip here are instigated by evil sorceress Xayide (Clarissa Burt). In the book Xayide had a less significant role, as she simply exploited a situation she did not create. Here Bastian's arc becomes about \"overcoming his fears\", a bargain bin character goal which doesn't fit the story.<br><br>This is a staggering (and possibly intentional) failure to convey one of the main themes of the novel. I've always argued good adaptations can safely ignore minor subplots and characters but should be very faithful as far as themes go. I don't care if you cut Tom Bombadil from the Lord of the Rings, but you cannot have Frodo use the Ring to defeat Sauron.<br><br>That's more or less what happens here though. It seems the late Michael Ende was unhappy with the first movie; I shudder to imagine what he thought of this one.<br><br>And no, I haven't seen the third film, although I hear it makes this second chapter look so much better by comparison. I remember watching the trailer as a kid and going \"Nope!\" - possibly the first time in my life I chose to avoid the sequel of a franchise I liked because it looked terrible.<br><br>Maybe one day someone will make a worthy sequel to the first film and a good adaptation of the second part of Ende's novel. But that's another story and shall be told another time.<br><br>5/10","user":"petra_ste","rank":[7,7]},{"title":"The Neverending Mess: First Chapter","rating":3,"date":"4 November 2008","review":"Just take a look at my summary and you'll get a great idea about what I think of this movie. I wasn't originally planning to watch this, but I decided to because it was in a day I had not much to do and so I did, if only to see how weak this would be. I wasn't really expecting much from it, but it turned out to be even weaker than I imagined.<br><br>But let's go by parts. \"The Neverending Story II: The Next Chapter\" is a sequel to the original and much beloved 1984 film. Unlike the original, this wasn't directed by Wolfgang Petersen, but by George T. Miller. About the cast, with the exception of Thomas Hill as Mr. Koreander, the whole cast is completely different. This already says a lot. The original one has a cast you just gotta appreciate, but I can't say the same about this one.<br><br>Bastian is now played by Jonathan Brandis, Atreyu by Kenny Morrison and the Childlike Empress by Alexandra Johnes. Jonathan Brandis had a tragic ending in real life. In the role of Bastian, he wasn't all that bad, but we cannot compare him to Barret Oliver, the one and only Bastian. Kenny Morrison is good as a Atreyu, but naturally not as much as \"the real Atreyu\" - Noah Hathaway. Nevertheless, Kenny Morrison looks a bit like Noah Hathaway, but with a stronger Indian-like appearance. Alexandra Johnes really doesn't fit at all as the Childlike Empress, unlike Tami Stronach.<br><br>The characters from the first movie we all love so much are not as appealing here. Bastian has nothing to do with the loving Bastian from the original and here he proves not to be very smart - including whenever Atreyu warns him to be careful about what he's doing. Atreyu is cool here, but not as much as the Atreyu from the earlier film. As for the Childlike Empress, they really managed to ruin her image. Here, she's just an ordinary-looking girl with freezy hair - she has nothing to do with the angelical and innocent-looking Childlike Empress of the original.<br><br>Falkor is not the same here. He looks quite artificial and ugly here, while in the first movie he looks so real and perfect. Besides, is it just me or did he become smaller in this film? Another equally bad thing is his voice here. Golly, his voice here sounds awful! It's as if he was talking with his mouth full all the time. And the same can be said about the Rockbiter's voice here. Speaking of Rockbiter, now he has a son? That Junior is a little annoying, isn't he? Mr. Koreander is nowhere near as amusing here as he is in the first movie, despite being portrayed by the same actor. Bastian's father is now younger? And how come Bastian has a mother now, considering she's not alive in the original film?<br><br>As for the visuals, only a few are still good, but aside that Fantasia is simply not the same Fantasia I love so much from the 1st movie. The gorgeous and fantastic landscapes seem to be gone. The magic and special effects that give the 1st movie a feeling of something out-of-this-world are missing. Besides, Fantasia is now a silver city, which just doesn't please me.<br><br>The soundtrack is nothing special. Nothing to do with the wonderful and inspiring soundtrack of the original movie.<br><br>Very little in this movie resembles \"The Neverending Story\". In fact, this seems more like a mix of \"The Lord of the Rings\", \"Star Wars\" and a Power Rangers episode, with its extreme darkness and mostly because of all those horrible mechanical giants. I hate creatures like those. I also hate the new villain, the sorceress Xayide. And that ridiculous big bird...<br><br>As for the humor, nothing worthy to mention. Aside one or two very small things, there's nothing to laugh in this movie. The original has classic and funny humor.<br><br>So many things just don't fit in this sequel. Conclusion: this is a shadow of the original and a mockery on the original. It is an easily forgettable movie. Maybe kids will enjoy this, so I'd only recommend this for them.<br><br>Just to finish, did anyone else notice that some scenes with Atreyu riding Artax during the quest were literally taken from the first film? I noticed that.","user":"Atreyu_II","rank":[15,18]}]