[{"title":"The war without & the war within...","rating":8,"date":"26 January 1999","review":"It has been said that Vietnam is America's most unpopular war, but in light of both popular opinion and critical oversight, the namesake film may just inch Vietnam out of that role.<br><br>The title not only refers to the Vietnam War, which has an appropriate albeit very limited place in the film, but it also refers to the literal war that the children continuously wage with one another and the figurative war that rages within each of them...for identity and purpose.<br><br>Personally, I don't feel that \"The War\" deserves the press it received (or the lack thereof). It is a beautifully crafted film from its intricate, multi-layered story to its moving, realistic performances to its homestyle, nostalgic cinematography.<br><br>\"The War\" combines some of the best elements of \"Forrest Gump\" and \"Fried Green Tomatoes.\" It captures the nostalgia of its timeframe, the innocence and naivete of youth, the situational humor of the moment, the consequences one's decisions and actions bring, and the tragedy of life. It even contains a couple of \"musical\" period moments.<br><br>Its structure harkens very closely to that of \"To Kill a Mockingbird\" (my favorite film). Both de-emphasize the star talent (Gregory Peck/Kevin Costner), who still performs remarkably and effectively in a supporting role. Both also utilize a (female) narrator who \"bookends\" the story in a quasi-flashback style, as well as plays a pivotal (if not the starring) role in the story. Each narrator tells the story of her brother and her father: their growth and what has been learned from and about them.<br><br>\"Sometimes all it takes is a split second to do something you regret the whole rest of your life.\" What a great and appropriate theme for a film that few went to see. No wonder so many problems still exist in the world.","user":"Morlock","rank":[35,36]},{"title":"The simple, unappealing name does not do justice to this fine film.","rating":1,"date":"1 June 2000","review":"Who would want to see a movie called \"The War?\" Not, me, and that's why I only saw this 1994 movie tonight, on TV. And I was pleasantly amazed at how good it is. Costner turns out to have a very strong \"supporting\" role because the movie really is about Elijah Woods' character and the other kids who find out about the real war we human beings seem to fight daily. Excellent mix of humor, action, drama, sadness, and triumph. The \"dare\" scene inside the water tank was one of the more gripping I've seen in any film. I rate it \"8\" but almost feel it deserves a \"9\".<br><br>Feb 2006 update. I saw it again, on DVD, and most of the movie was fresh again. After Costner's character was faced with killing people in the Vietnam war, he fully understood that love was the only thing fighting for. This is what he was able to pass down to his son and daughter. As they say, in any 'war', even the ones we may fight with our neighbors, we always lose track of the real reason we are fighting and destroy the things we value.","user":"TxMike","rank":[35,37]},{"title":"It says a lot without actually preaching.","rating":9,"date":"18 September 2001","review":"This movie was wrongly overlooked when it came out. It has a lot to say and says it well, leaving the viewer with much to think about. It tells about poor country life in the early '70's from the view point of pre-teens. It touches on the Vietnam War through flashbacks and uses this as a study for the conflicts the children are facing. Their father is their link to the war. It deals with several kinds of hatred and its effects on the kids' lives. It also contrasts the kids' reactions to the father's.<br><br>Everything is done well. The children actors, led by Elijah Wood, do a really good job. Elijah was especially wonderful with the emotional out bursts he has to produce. Kevin Costner was surprisingly understated as the father and Mare Winningham is very good as the mother. I wish it was a bigger part. The part of the school teacher comes off a bit stereotypical but it works okay. Again, the kids carry the scene with their show of pride and willingness to stand by each other in adversity.<br><br>All in all, it's a good movie and good for older children to watch even though there is some strong language and violence. Actually, I think it's a bit mild for its PG-13 rating.<br><br><br><br>***1/2 out of ****","user":"callaspadeaspade","rank":[26,28]}]