[{"title":"I loved it","rating":8,"date":"25 December 2009","review":"A very long time ago I happened on \"The Bishop's Wife\" and really liked it, but it wasn't a Christmas classic and I never saw it again. So when I realized there was a \"re-make\" I was excited. I liked this story even better! I thought Whitney Houston was terrific and the rest of the characters (especially her mother) were also very enjoyable. Sometimes I just need a break from the mayhem and violence and this is a sweet, uplifting, old-fashioned Christmas pleasure I try to watch every year. If you like Denzel, if you like Lionel Ritchie, if you like Gregory Hines, and especially if you like gospel music, please give this movie a try.","user":"carolynspringmorrison","rank":[13,14]},{"title":"Pretty good, enjoyable","rating":8,"date":"27 June 2009","review":"There is no reason to be hard on this film. An overall rating of 5.2 is very low, in my opinion, and there is little to dislike about \"The Preacher's Wife.\" It's a fairly simple story involving Dudley (Denzel Washington), an angel sent to earth to assist a pastor's marriage during Christmas time. One reason I liked this film is because few romantic comedies in recent years have been clean enough to watch with the entire family. There is almost nothing objectionable here, just a few brief, very mild swear words that have no bearing on the film. It's a decently funny film as well. I had to laugh at Dudley finding an image of a Windows computer screen in his angel handbook. The wisecracking grandmother was also a beneficial addition to the movie. Take her comment \"We're gonna play Monopoly, with real money.\" There are still a few things that could have been improved on. The plot twist involving Dudley falling in love with Whitney Houston could have been played up more and was not nearly as funny as it had the potential to be. Also, the chemistry between the main couple is not super good, and the film lacks the romance necessary to make this a great rom-com. Nevertheless, it's enjoyable and doesn't deserve any harsh comments.<br><br>Note: Because of the abundance of Christmas-related content, it's best to watch this around Christmas time, or you may feel slightly embarrassed.<br><br>*** out of ****","user":"kyle-cruse","rank":[16,18]},{"title":"Romantic winner","rating":9,"date":"25 December 2008","review":"This is a wonderful piece of work that should not be compared with any other in the genre of the Christmas/angel type or the so often mentioned Bishop's Wife. Its not the first film to use an old story and alter it and should be looked at as an original piece of work which is what it is. It simply works well mainly because it is perfectly cast, any romantic will be drawn in, willing the beautiful people in this case Whitney Houston and Dezel Washington together. Washington is pure magic on the screen, playing the inoffensive angel who ignores the ignorance and rudeness thrown at him by thoughtless people who should know better, he pulls off some great moments in the story. Unusually too the children are well cast, not too sugary or given scene stealing lines, they complement the adults rather than displace or ridicule them. This is a specialist type of film, a romantic, unrealistic dreamy story, and must be judged in that light.","user":"cg-cgeorge","rank":[18,22]}]