[{"title":"Funny, lively and enjoyable despite being a little predictable","rating":13,"date":"13 October 2002","review":"On his first day at a new school, Cameron falls for Bianca Stratford. However not only is she popular and beautiful but her father has forbidden her to date until her older sister does too.  The problem is her sister, Kat, is negative, bad tempered and unfriendly and certainly undateable. Cameron seeks the services of school bad boy Pat who he arranges to be paid to date Kat and thus allow him to go out with Bianca - but things never go smoothly when it comes to love.<br><br>I'm not a big fan of teen comedies.  They mostly are lame, trading on the same old plots and clichés that have been around since Animal House and Porkies.  The recent trend has just seen classical texts adapted giving rise to some poor films like `She's all that'.  The plot for this is basically `The Taming of the Shrew' updated - most of it bares little resemblance to the play but that doesn't matter - the core is interesting enough to stand on it's own.  It may not surprise you in terms of who gets which girl and it's fairly predictable in a romantic comedy type way but that's not it.<br><br>No - the film is funny, lively and pretty enjoyable.  The comedy is built around the central plot with lots of nice touches and characters that are genuinely funny, such Mr Morgan and the erotic drama writing headmistress. The jokes happily never stoop to the gross-out type and this helps it feel fresh and lively, rather than just scrapping the bottom of the barrel.<br><br>Another strength is that the cast are all very likeable and give good performances all round.  Compared to the horror or Prince and Lillard in `She's all that' this was a dream cast.  Ledger is a real up and comer and he does well here - he doesn't over-egg his bad boy cake and his fall into love is believable.  Stiles is very cool and better than the teen roles she has had of late.  Here she rises above the `outsider' cliché given to her and does good work - again being a likeable and believable character.. Gordon-Levitt is OK but quite characterless compared to the main two roles, likewise Oleynik.  The bets roles are those on the edges and the three adult support roles really do well and are very funny -  Janney, Mitchell and especially Miller on good form.  Gabrielle Union is once again given a side role that doesn't play to her strength.  I like her and want to see her in bigger roles but here she is a `minority face' in a predominately white film, just as she was in She's All That - maybe I'm being a little paranoid but that's what it feels like.<br><br>Overall I was taken by surprise as to how funny and lively this film was. It didn't sink to the gross out comedy of so many teen movies and had characters and actors who brought spark and energy to the screen.  It may be predictable but it works and the jokes and side characters just add to the sense of fun.  Not brilliant but compared to the mediocre bunch of teen comedies you COULD watch, this is fantastic!","user":"bob the moo","rank":[104,119]},{"title":"I can't stop watching this movie!","rating":10,"date":"27 November 2004","review":"I wanted to see this movie when it first came out but never did. I didn't get a copy until a week ago and finally watched it with my girlfriend. I have to admit, I've seen it five times in the past week. A lot of teen movies have very basic or clichéd plots, but not this one. It's based on \"The Taming of the Shrew\" and it has a lot of interesting twists. The music is awesome, every song actually fits the moment, and the two love stories are actually interesting to watch. Even all the actors did a really great job. The only bad thing is the occasional dirty jokes. If you don't care for teen movies, don't worry, you are just like me, this movie is still worth watching. I'm giving it a 10 to bring those ratings up!","user":"sirokai","rank":[182,216]},{"title":"Sweet *teenage love, lies, & consequences* flick!","rating":9,"date":"5 April 1999","review":"I have to say, I thoroughly enjoyed this movie.  Granted I'm just 15 years old, and also a huge fan of Shakespeare, but it was really a great film. I would have to say it's definitely more directed towards the teenage/GenX generations, but it was awesome.  The tongue-and-cheek Shakespeare references were great (the \"Stratford\" girls, etc.) Julia Stiles &amp; Larisa Oleynik were convincing in their roles, and not to be shallow but the guys of the movie just all looked really good. =) I recommend this to most teenage girls, although it's not totally a \"chick flick\" because my brother enjoyed it too.  In any case, the scene with the \"Can't Take My Eyes Off You\" ballad at the soccer practice is a can't-miss for all you love saps. =) I will tell you right now, the ending IS predictable, but not hackneyed. It leaves you with a happy bubbly feeling about teenage love.  Excellent movie, that is.  (P.S. When watching this in the theaters-- DON'T leave as soon as the credits roll.  There are some hilarious out-takes afterwards.)","user":"ILoveDMB","rank":[146,173]}]