[{"title":"To Hell with all the negative reviews!","rating":7,"date":"4 March 2006","review":"Wow, talk about a pleasant surprise! I was expecting to see a terrible, bottom-of-the-barrel exploitation fodder from the seventies, but I ended up seeing a spirited cult gem that really makes the most of its minimal budget. The story introduces Howard Martin; an introvert and rather nerdy young man who lives alone with his mother since his sister ran away from home. This event somewhat messed up Howard's brain, since he now picks up hitch-hikers in his laundry van and savagely strangles them if it turns out they're runaways from their moms. The subject matter certainly isn't original, since it's an ordinary serial killer on the road premise and the culprit is once again an oppressed mommy's boy (\"Psycho\", anyone?). Still, the screenplay of \"Hitch Hike to Hell\" is well thought out and features some really clever ideas that immediately gained my respect. The setting, for example, is a middle-sized town that serves as a junction for the state's most important highways, which makes it extra difficult for the police to keep an eye on all the hitch-hikers. The drama-element of the story surprisingly isn't an obstacle and actually rather captivating. This is all very nice so far, but what REALLY sold me to this movie is the dared ending that you can't possibly see coming! The image of what might happen will briefly cross your mind, probably, but there's no way you expect the film to actually execute it! Watch and see! There are some some dull moments and odd padding scenes to struggle yourself through, but the acting performances are quite good and the music is adorably kitschy. I really don't understand why some people write such harsh things about \"Hitch Hike to Hell\"...Definitely recommended if you're into rare cult stuff.","user":"Coventry","rank":[12,15]},{"title":"Beware the deadly dweeb in the delivery van!","rating":8,"date":"26 March 2006","review":"I absolutely love this delectably cheap'n'cheesy late 60's exploitation trash psycho howler. Hopelessly geeky bespectacled dweeb Howard (a hilariously histrionic performance by Robert Gribbin, who overemotes to the point where you swear he's going to give himself a nosebleed) drives a delivery van for the local laundromat service. Howard has gone murderously around the bend ever since his beloved sister ran away from home six years ago. While making his daily rounds Howard picks up stray runaway teenage lady hitch-hikers and brutally butchers them. Among Howard's victims are a token gay guy, a little girl whose bloodied corpse Howard leaves in a dumpster, and one luckless lass Howard strangles in the back of his van with a wire coat hanger (I'm sure Joan Crawford would have approved of this last one). Earnest, but ineffectual police captain Shaw (well essayed by Russell Johnson; the Professor on \"Gilligan's Island\"!) tries to catch Howard, but thanks to indifferent and negligent parents finds this to be a most difficult task to accomplish (nice pointed social commentary here). Not released for ten years until it was picked up by legendary soft-core flick king Harry Novak's Box Office International Pictures for theatrical distribution in the 70's, sporting suitably shoddy production values, largely atrocious acting (the scenes where Howard either experiences painful seizures or erupts into a wildly raving psychotic frenzy while killing folks are especially sidesplitting), and a gloriously ghastly country-and-western theme song (\"Danger on the road/Danger on the road/There's no way you can tell/When you hitch-hike to hell/Danger on the road tonight\"), this grubby grindhouse gem is well worth picking up if you're a fan of deliciously down'n'dirty drive-in dreck.","user":"Woodyanders","rank":[9,12]},{"title":"It's a true grade b classic ...","rating":1,"date":"10 September 2005","review":"LOL I'm watching this movie right now; I think it's a perfect time waster.<br><br>Being a true B movie fan, this movie meets all the requirements of B movie fans. It requires no concentration becuz it has no story line, and watching that Gribbin guy have seizures over memories of the rapes and murders he commits is hilarious. Also hilarious is his mother. No wonder he kills women.<br><br>It's great when he has murder flashbacks and freaks out.<br><br>Russell Johnson is prime in the role of Chief Investigating officer.<br><br>You should definitely watch it if you wanna kill some worthless time.","user":"mannorama","rank":[7,9]}]