[{"title":"Frustratingly Unbelievable! Dreadful Film..","rating":30,"date":"30 May 2000","review":"I didn't like this film one bit. I actually think that it was worse than \"Deep Blue Sea\" in terms of the stupidity portrayed by the characters. Its one if those films where you sit on the edge of your seat shouting \"Shoot him, shoot him now, hurry up and shoot him or he will take the gun of you\" and \"Don't do ____ \"<br><br>Anyway, the whole thing is one frustratingly unbelievable event after another.<br><br>SPOILERS: As if you could spoil this!<br><br>Here is my list- I suppose these count as SPOILERS of a kind so be warned!<br><br>0) (forgot this one) Just watch them deal with the mine! Look out for gems like \"walk where I walk\", yeah, so how do we get back then when we haven't marked anything?<br><br>1) When attacked by the helicopter, Dolph has a hunting rifle, which easily outranges the assault rifle in the helicopter. Dolph fires one shot, killing the rifleman, but then throws his gun away, and drives off- doesn't he carry ammunition? Doesn't he pay for his guns?<br><br>2) Then 2 helicopters attack. Dolph has no rifle, and can't hit anything with about 70 shots from his pistols (he has about 50 magazines for each [all different]), but brings it down with a flare pistol.<br><br>3) Why does the girl reverse off a mountain? Why don't they drive back? The Landrover looks perfectly drivable to me.<br><br>4) In the bad guys bedroom, Dolph is going to shoot a naughty man with his combat shotgun, but it gets kicked out of his hands easily (what would have happened if he had fired it? He would have dropped it if he was holding it that loosely), so he has to hit and kick and bite and gouge, with me saying \"shoot him Dolph, you have a gun stuck in your trousers\" about 50 times.<br><br>5) The naughty people kidnap the girl and fly her by helicopter to the secret mine, arriving AT THE SAME TIME as Dolph, who has walked it!<br><br>6) In the mine, many chances to shout \"shoot him\" etc, until the implausible ending, when Dolph is able to shoot about 30 people straight off.<br><br>7) You won't believe what happens on the train. Is abject incompetence a pre-requisite of being a bad guy? (As well as a huge cargo of exploding oil drums)<br><br>8) Dolph's flesh wound seems much better after his little swim.<br><br>Note to foreign powers. Don't buy those landmines- they are much too unstable! (and anybody can just turn them off in the 15 second delay time)","user":"Facade","rank":[10,14]},{"title":"African outing for Dolph Lundgren delivers the action goods","rating":6,"date":"4 January 2017","review":"More straight-to-video nonsense from action man Lundgren, here ripping off everything from COMMANDO to INDIANA JONES. Still, despite being clichéd and ripping off loads of great movies, SWEEPERS is a low-budget, violent action flick that actually manages to be pretty entertaining and, for once, delivers in the action stakes! The first half is pretty slow, with Lundgren losing his son in a sickening sentimental scene and then becoming an alcoholic. Meanwhile, we're introduced to Clare Stansfield who plays the thankfully tough and unglamorous female lead and love interest. After much to-ing and fro-ing in the outback of Angola (a fresh setting which makes a change from the tired bustling streets of America which figure predominantly in these action flicks), Stansfield persuades Lundgren to team up with her to battle some evil terrorist chaps.<br><br>The second half is basically one long string of action scenes, with Lundgren battling people in a house, street, in a mine and finally on a speeding train (yep, John Woo's BROKEN ARROW seems to have been a strong inspiration, although this is equally good). The body count is high and the amount of shooting is enough to satisfy any red-blooded male. There are also a requisite number of hand-to-hand combat situations and explosions to enjoy. Lundgren here is pretty good and seems to be enjoying himself; his character goes from being a drunk to an Indiana Jones look alike explorer complete with leather jacket, hat and shotgun! Finally he strips to the waist and becomes Rambo, killing off dozens of bad guys in bursts of violence.<br><br>The chief villain is the ever-smarmy Bruce Payne; at first his character seems to be on the side of good, but anybody who's ever seen any of his other movies will inevitably guess that he turns out to be the main bad guy at the end. Stansfield is good, the supporting bad guys deserve to die, and the African extras acquit themselves well with their mainly sympathetic turns. Although a cheap, uninvolving action film, this is still highly entertaining if cheesy stuff, surprisingly good for Lundgren.","user":"Leofwine_draca","rank":[3,3]},{"title":"Standard Lundgren.","rating":5,"date":"4 June 1999","review":"Dolph Lundgren in a Ken Loach drama about a group of male council flat floor sweepers facing prejudice and taunts off the sexist,narrow minded women employees on the estate.Something sound wrong here? It should do. No,old Dolph once again reprises his everyday,tearandwear action man role,this time as a former landmines specialist turned down-and-out fist fighter,whose services are called on to sort out a major new killer mine,being deactivated ,in his place of spiritual demotivation,along the way bumping into his old doctor buddy,Passenger 57 baddie Bruce Payne. There's some added British metaphors (mention of Princess Diana,local lads playing football)and midway through,Dolph makes a bizarre change from an Indiana Jones alike adventurer into an Arnie-Commando esque train dweller.At one stage,he even has to swim under a small wad of water,just like a Dolph-in. Tee hee hee.","user":"davideo-2","rank":[6,9]}]