[{"title":"Mindless","rating":1,"date":"2 August 2002","review":"This is vindictive Master P at his ugliest (and that's bad). The main hero we are led to believe is a HORRIBLY, HORRIBLY acted black man, aspiring to do good, and knows kung-fu, living in a life of white oppression (you know, like all cops are crooked and idiots and all gangstas living the real life... whatever). Eventually, the good man is pushed to his limits because his girlfriend is framed for murder for no explicable reason. Seriously, this sort of plot is getting old and extremely TIRING. Countless rappers appear along the way in cameos contributing nothing except a possible song in the soundtrack, and eventually everything is resolved in a less than thrilling shoot-out between cops, crooked cops, good black guy, and gangstas.<br><br>2/10","user":"bullions27","rank":[11,16]},{"title":"A Big Disappointment","rating":1,"date":"11 November 2003","review":"With such names as Gary Busey, C. Thomas Howell &amp; Jeff Speakman you would think that it would be a halfway decent movie, with at least interesting characters &amp; a lot of action, but NO--not by a long shot.  If you're a Jeff Speakman fan, don't rent this movie - he isn't in it very much.  I found myself fast forwarding to the scenes with him, &amp; once I passed the last one, I didn't care how the movie ended, I just wanted it to be over! :-(","user":"Jynne","rank":[7,10]},{"title":"Very, very bad","rating":3,"date":"17 February 2002","review":"This was one of the worst movies I have ever seen. Don't be wrong, I'm a great fan of Snoop Dogg and most of the other rappers that appear in the movie, but the simple fact is just that THE CAN'T ACT. on top of that is that the story and whole plotline sucks major. the acting is bad and the story is bad + it's very unrealistic. this movies makes it look like it is very easy to get in the drug game and everybody can become a gangster. don't spoil your money on this movie.","user":"Alkoholiks","rank":[7,10]}]