[{"title":"In Roxy's eyes","rating":9,"date":"30 October 2004","review":"'Welcome Home, Roxy Carmichael\", is an endearing, and utterly underrated picture, with more heart and intelligence than it is given credit for. Winona Ryder's portrayal of a sexually confused, socially dysfunctional, and emotionally reserved character, is charming and convincing, bringing truth and credibility to the film. Set over a week dedicated to the return of obscure legend, \"Roxy Carmichael\", whose most famous contribution to society was having her name in a song, in the small town of Clyde, Dinky Bosseti (Winona Ryder), feels a connection for the first time in her life. The film focuses on the need for mother/ daughter relationships through adolescence, and the sexual development of a young woman through self-discovery and fascination. Relationships between her guidance councillor, her adopted father, and a young town's boy, contrast the romantic appeal of celebrity to highlight the importance of human interaction, allowing for Ryder's character to re-assess her life. If you pass this film in the \"comedy\" section of your video store, as it is so wrongly placed, pick it up. You will be surprised. If you have ever felt detached from society, or inadequate (particularly during your teenage years), this film is something you will certainly relate to.","user":"reality_bites70","rank":[34,38]},{"title":"another hidden treasure","rating":9,"date":"4 September 1999","review":"Winona Ryder has a big collection of forgotten but first-rate movies, and this is no exception.  The acting was really good, and the music on the soundtrack made it memorable.  Well worth a look, and a second, and a third...","user":"Julien-11","rank":[17,19]},{"title":"Beautiful, funny & touching - one in a million.","rating":10,"date":"6 May 2006","review":"Stunningly beautiful in places, surprisingly funny, often deeply touching. At just 19, Winona Ryder had already scored two massive hits with Beetlejuice and Heathers, but this performance eclipses them easily - and is possibly one of her best ever. She is hugely talented, and I can't get enough of her when she's on this kind of form - which sadly isn't often enough in recent years. Jeff Daniels' performance is spot-on, and together on screen these two stars shine brightly - not to take anything away from the superb supporting cast.<br><br>One of my all-time favourite movies, and one that still looks as fresh today as it did 16 years ago - testament to the people who made it. Quite under-stated, almost apologetic, but it will delight you. Someone else here described it as a 'hidden treasure' and I agree - it is hugely underrated and is a must-see for anyone who loves movies, Winona Ryder, Jeff Daniels, or has ever felt something was missing, confused or that they didn't belong. If I had to choose one movie to rescue from my burning house, this would certainly be the one.","user":"Cedric_Catsuits","rank":[21,25]}]