[{"title":"One of my families favorite kid movies....","rating":28,"date":"28 June 2004","review":"It's a FUN movie! As college educated parents of a 12 year old and a 5 year old, this is one of our favorites and I registered with IMDb just to comment on this movie since everyone else seems to be slamming it. Loads of fun but not for anyone looking for \"good theater\". It's pure silliness for kids; with bad logic and improbable plot lines, and the kids are of course the heroes. So if you are just looking for some plain clean fun to watch with your kids, I suggest this one! And there's no dancing bears or singing furniture (but, there are flying, talking hamburgers...) So here's the scoop, if you want an educational show for your kids, go elsewhere. But if you want to sit down, eat popcorn and laugh, get this one.","user":"bakat-1","rank":[48,58]},{"title":"Good Burger: 7/10","rating":7,"date":"4 June 2004","review":"Movies from TV shows almost always never work. It's even worse when a movie is based off of a skit from Saturday Night Live. So it's no wonder people were less than inviting when Good Burger came about, a movie based off of a skit from a kids version of SNL that airs on Nickelodeon. Seeing as I used to be a big fan of All That, I decided to give Good Burger another go-round, to see if its juvenile humor still stood up throughout the years. And it did.<br><br>Ed (Kel Mitchell) is a man of indeterminable age who works at a local dining establishment, Good Burger. He's basically a stoner that doesn't use drugs (at least in the movie). When a customer asks for a burger with nothing on it, he just gives him a bun. Ed'd rather play miniature golf then spend time \"alone\" with Roxanne (Carmen Electra). After crashing his mother's car, Dexter (Kenan Thompson) needs a job, so first he tries the new Mondo Burger, opening across the street from Good Burger. But then he gets a job with Good Burger, and Mondo Burger opens, which threatens to put Good Burger out of business. What are Ed and Dexter to do?<br><br>As Leonard Maltin puts it, \"Like fast food itself, this film offers no real nourishment, but will appeal to kids just the same.\" Perhaps the first statement is true, but is there anything wrong with that? Sometimes a brainless, fun time at the movies is all one desires. And although it's based off of a kids show, anyone of any age can enjoy it. Even if its juvenile humor doesn't strike you as particularly hilarious, it's entertaining, and more importantly, its heart is in the right place. Most of the humor isn't mean-spirited, the main character of Ed is just too likeable to do anything mean. In fact, Ed makes the movie. With his wacky brand of living, he's a hilarious character, and a nice guy at that.<br><br>So don't let the light-hearted nature of this movie stop you from seeing it. You'll get some laughs out of it, like I did, but you'll find that it's a fun movie. I guarantee it.<br><br>My rating: 7/10<br><br>Rated PG for language, some comic violence and mild sex-related humor.","user":"movieguy1021","rank":[44,55]},{"title":"Cinematography in its finest hour","rating":17,"date":"17 June 2000","review":"It is such a rare occasion that a film in this day and age can touch the viewer in only the way that a masterpiece like Good Burger can. When I sit back in my chair and reminisce about cinema at its best I think of Casablanca, Lawrence of Arabia, The Godfather, Citizen Cane, and Gone With the Wind. These films all speak to the viewer in a way that most other films can only dream of. They reach out to you touch you deep down in your heart... and in you soul. It's a feeling that transcends all the cultural norms and traditions of today, a feeling that is so much more lasting and fulfilling, one that is undeniable to even the most critical of movie-goers. Good Burger does this and so much more. Not since Weekend At Bernie's has a movie stirred up such strong emotions, such feelings, ones that speak to me on a level of truth that is hard to find in society today.<br><br>Brian Robbins ability to direct is nothing short of stunning. His wide angle slow panning techniques from the street to inside the Good Burger fast food facility puts most director's attempts to shame. This is cinematography at it's finest.<br><br>Steward Copeland delivers a gripping original musical score for Good Burger that rivals anything John Williams ever could hope to achieve. Steward Copeland's talent has to be heard to be believed and even then it's difficult to take it all in at once. His ability and foresight is truly a breathe of fresh air in an age where most scores have become old and stale.<br><br>And last but certainly not least, how can we forget the true stars of Good Burger, Kel Mitchell and Kenan Thompson? This talented acting duo bring to the film nothing but pure and unadulterated performances from a time long forgotten. Not since the early 1900's during plays on Vaudeville, has acting triumphed and reigned supreme over all else. Kenana and Kel bring something to the screen that even the likes of Deniro and Nickleson can only begin to aspire to. Their presence out shines all that approach the screen and this film is surely destined for greatness in not just Hollywood, but the very threads of American History as we know it.<br><br>So to you Kel and Kenan, I salute you. Bravo! May the goodest burger in your blossoming acting careers be yet to come. To everyone else, do yourself, and more importantly your country, a favor and go see Good Burger today.","user":"i.like.midgets","rank":[32,41]}]