[{"title":"Disappointing crime drama, despite its large-scale ambition","rating":3,"date":"19 February 2005","review":"ISLAND OF GREED (Hei Jin)<br><br>Aspect ratio: 2.39:1 (Anamorphic)<br><br>Sound format: Dolby Digital<br><br>A Taiwanese special agent (Andy Lau) goes on the trail of a Triad gang leader (Tony Leung) who attempts to bribe his way into political office.<br><br>Large-scale blockbuster from director Michael Mak, unusual for its up-front exploration of Triad involvement in Taiwanese politics. Stand-out action set-pieces include a chaotic shoot-out in a crowded marketplace between Lau's men and a group of would-be assassins, and a large-scale riot on the streets of Taipei as taxi drivers stage a huge strike commissioned by Leung for nefarious purposes. Look out, too, for an audacious sequence in which Lau and his cohorts struggle to prevent a character from being attacked by snapping Alsatians, though this scene is compromised by images of horrific animal cruelty (chickens are dragged behind speeding vehicles and savaged by the rampaging dogs, for real), resulting in this scene being completely removed from British prints.<br><br>The narrative unfolds at such a breakneck pace, it's often difficult to keep tabs on proceedings, and the film will leave some viewers trailing in its headlong wake. Leung is terrific as the vicious gangster stifled by circumstances beyond his control, and weary of his arrogant superiors, and Pauline Suen (\"Love and Sex of the Eastern Hollywood\") is equally strong as his sexy but ill-bred wife, all too aware of her intellectual limitations but desperate to support her husband's political ambitions. Sadly, Lau is rather anonymous in a role which gives him virtually nothing to do, and his character barely registers as a presence. Given its setting, the film was recorded in sync-sound Mandarin and dubbed into Cantonese for its Hong Kong theatrical release - stick with the original.<br><br>(Mandarin dialogue)","user":"Libretio","rank":[6,10]},{"title":"interesting portrayal of Taiwanese corruption","rating":9,"date":"9 September 2000","review":"Black Gold is a good portrayal of corruption in Taiwanese democratic politics, but is also packed with action, romance and all of the other trademark Hong Kong stuff.  Yes, Hong Kong!  I watched this movie not knowing what it was about, and was shocked to see two Hong Kong actors speaking terrible Mandarin in a movie set and filmed in Taiwan!  Anyways, Black Gold is about a former mobster (Tony Leung Ka Fai) who tries to run for election in the Taiwanese Legislative Assembly and the cop who is out to stop him (Andy Lau Tak Wah)<br><br>One thing I disliked Black Gold is how Andy Lau's cop character is the protagonist, while Tony Leung's to-be politician is the antagonist; Tony faced way more obstacles (enemy mobsters, police investigation) than Andy did.  Honestly, Andy really had no reason to hate Tony.  On another note, I found there were many unnecessary characters, such as a Buddhist cult minister and a few extra mob bosses.  Also, I also found that the action scenes were unclear and and the camera often seemed too close.  There may also have been continuity problems, but this may be due to TV censorship.<br><br>Though not a great movie, it was nice to see rare shots of Taipei.  And of course, viewers must remember that Hong Kong movies are cheesy, and it's important to overlook some minor errors.","user":"hokenyu","rank":[5,12]},{"title":"One of the worst films I've ever seen","rating":1,"date":"30 December 2000","review":"Don't even bother watching this movie.  I watched it at a theatre and wanted to leave half way through it but decided against it since I'd already spent my money on this worthless movie anyway.  The plot is predictable, the action scenes worse than a home-made movie, and even a film school freshman could have done a better job on the editing.","user":"ganbare1","rank":[2,10]}]