[{"title":"A potent translation","rating":10,"date":"15 May 2000","review":"With his stunning new vision of the most revered of Shakespeare's plays, director Michael Almereyda has effectively transposed many of the enduring themes of that classic work to our contemporary hi-tech era. Even if you are not very familiar with Shakespeare's plays or have always been confounded by his verse, one can still appreciate this film for the tremendously inventive ways by which Almereyda has interpreted the core scenes of Hamlet in the context of corporate America. His visually striking translation of scenes like Ophelia's drowning and Hamlet's famous `to be or not to be' soliloquy are a delight and true brain candy. The cast is all around superb, with the classically delivered lines from actors Liev Schreiber (Laertes) and Sam Shepard (Ghost) nicely counterbalancing the very contemporary style of delivery from Ethan Hawk (Hamlet), Bill Murray (Polonius), and Julia Stiles (Ophelia).<br><br>There will no doubt be much comparison between this film and Baz Luhrmann's flashy modern remake of Romeo and Juliet. However, whereas Luhrmann's film ultimately fails in going beyond the boundaries of its visually striking presentation, Almereyda's Hamlet proves to be far more than a mere spectacle for the senses. In fact, this is the serious flaw that plagues most of the films coming from young, talented independent filmmakers these days: all style, no substance. Well, this Hamlet has both. By setting the film deep in the heart of a very real and very modern steel and concrete American jungle like New York City, which is infused with the relics of the mass media and cold capitalistic consumerism, Almereyda powerfully enhances for the audience the sense of the desolation of his characters that results from urban isolation. This is a theme that Hong Kong director Wong Kar-Wai has so masterfully examined with his films Fallen Angels and Chungking Express. In Hamlet, we get a powerful dose of both Kar-Wai's visual flair and the sensitive, crumbling heart that it sheathes.","user":"jchong","rank":[44,58]},{"title":"Bravo!","rating":8,"date":"28 April 2001","review":"Nearly four hundred years after his death, Shakespeare continues to be the best screenwriter in the English language.  This beautiful, moody, stylish adaptation of his greatest play is no exception.  Another wonderful thing about the Bard is how his drama seems to elevate any actor willing to take on the challenge.  I especially enjoyed Bill Murray as Polonius: his performance was all the more delightful because of the necessity of restraining his comic genius here; he appears always on the edge of cracking a joke, and of course doesn't, adding even more tension to an already extremely taught production.<br><br>But what I loved most about this movie was how it departed from the usual staging conventions (medieval costume, stone castles) to get at the heart of what the play is really about: a kid coming home on a college break and discovering that his uncle has murdered his father and is having sex with his mother.  Ethan Hawke does a fantastic job in the role, giving us the brooding, confused, lovesick, and ultimately self-destructive adolescent that Shakespeare intended.  <br><br>If I were a high-school English teacher, this is the Hamlet that I would want to show my students.","user":"sdl-2","rank":[29,39]},{"title":"The Film's the Thing","rating":3,"date":"3 July 2000","review":"Is this Hamlet? Depends on who you ask I suppose.<br><br>There are some who would require the plot and drama: a son whose inheritance is interrupted, so who may be imagining the murder of his father; a vapid, doting, hedonistic mother; a loyal, by the book counselor, his earnest son and brilliant daughter, she smitten by the prince. A scheming king -- wheels turn and everyone dies.<br><br>Some would consider the language the essential element. This is the poet's most convoluted, and heavily annotated metaphoric fabric. Shakespeare is most often celebrated for his layering and interelating of mental images, and certainly this work is his most globally elaborate (sorry).<br><br>But just as the language rides on the drama, the ideas of the play ride on the metaphors. These ideas are life-altering in their starkness: Reality, thought, creation, intent, the cause and validity of unnatural action, relationships among cocreated internal worlds. Much of this is developed in frightening and challenging terms. To my tastes, the ideas are what is important. Too many Hamlets (notably Olivier's)faithfully include the first two and never touch the third. I'd buy a complete abandonment of the first, but cannot see how one could get to the third without most of the second.<br><br>Now. This film. They have preserved the plot well enough for a film, I suppose. And they have kept the language, about one third of it anyway.<br><br>The bad:<br><br>Bill Murray is lost in Polonius, utterly lost. The production quality is poor -- that fits the film school motif (see below), but there is no excuse for the many boom mikes sticking down. They repurposed so much to fit the new setting, so why stick with swords at the end?<br><br>The biggest complaint is that they missed all the ideas, the big ones. The central example is at the end of the first act, where Hamlet says: `there are more things in heaven and earth, Horatio, than are dreamt of in your philosophy.' Hamlet, and Horatio are students of Wittenburg philosophy, which audiences would have understood as that of the magi Giordano Bruno, martyred by the Pope. (His book is the one Hamlet quotes when asked `what is the matter?,' and Bruno is also quoted in the northnorthwest and hawk from a handsaw lines.) The play has much to do with understanding Bruno's questions of thought and action. When Hamlet differentiates himself from Horatio, the play really starts. In this film, though, the `your' becomes `our.' Why?<br><br>The Good:<br><br>This Ophelia is wonderful. I don't know her other work yet, but it includes two other Shakespeare adaptations. She certainly was helped by the woman director, who amplifies the female roles in emotion if not screentime. She even transforms Marcello into a Marcella, Horatio's girlfriend. Rather nice. Also well done is the staging of the Rosenkrantz and Guilderstern dialog.<br><br>The central device of the film is rather clever, if not original. The play is deeply self-referential. All the rich text about introspection is what is usually cut in the name of modern impatience, and that is the case here. Also gone here is the sharply self-referential scenes of Hamlet lecturing the players. What we have in its place is self-reference about film, and filming. Hamlet and Horatio, indeed R&amp;G and Marcella are all film students. He thinks in film (actually video), and all his ruminations are cast in visual terms, often in the context of video, even a Blockbuster store. The final chorus is in video, and much of the action is seen through surveillance cameras. The play-within-the-play is a homemade video, with clear film-school effects.<br><br>This is not as clever as it could have been in the hands of a master. (Or when the goals are exceedingly simple as in `American Beauty.') But it is an honest attempt to cast the reflexive depth of the play in cinematic terms.<br><br>Sam Shepard is the best King Hamlet's ghost I have ever seen. He is a solid blessing.<br><br>This is a respectable effort, and deserves to be viewed if not celebrated.","user":"tedg","rank":[44,67]}]