[{"title":"A sequel that lacks new ideas","rating":8,"date":"8 February 2009","review":"Of course, killing the alien was no reason to stop the producers from making a sequel. The cliffhanger from the end of part one (a rat with alien DNA might spread it like a disease) was completely ignored though. Although we were told in the original movie, the alien DNA came from light years away, it is now found on Mars (just around the corner in astronomical terms), and astronauts take it home to Earth. Since there was a bit of gore and sex in the first movie, there is a lot more gore and sex in the second one, as if that could improve the quality in any way. We get a lot of cliché characters, from the corrupt senator to the uncompromising general, and the survivors of part one are treated carelessly by the screenplay: Helgenberger lends a willing hand to cruel experiments, Natasha Henstridge returns as the alien's latest clone, but during the whole first hour of the movie, she has nothing to do except sit around in a glass cage. Madsen just needs to run around armed and look cool - he understandably gives a lackluster performance. The sequel was definitely not as intelligent as the original and tries to hide the lack of ideas with gallons of blood. I voted 8/5/6/7 for the 4 parts of the series.","user":"unbrokenmetal","rank":[11,12]},{"title":"A couple of hours of entertainment, no more no less","rating":16,"date":"16 October 1998","review":"This was not a great movie. I mean for example, Even NASA (Never A Straight Answer) wouldn't make a six month one way voyage to Mars to spend less than two hours on the planet surface. The premise is hard to buy, but hey, it is science FICTION. The effects are not bad, and the acting is fair. There is a lot of gratuitous sex. Michael Marsden may be the bright spot in this average sci-fi flick. I wouldn't pay to see this in the theatre, but on video.... There are probably worse ways to spend an hour and forty-two minutes.","user":"mike-381","rank":[25,31]},{"title":"Enjoyable trash.","rating":6,"date":"29 September 2001","review":"The people who are stating that this movie is the worst sequel they've ever seen obviously never saw \"Hercules II\" or \"Jaws 3-D\" or \"Hellraiser II\". Now, I am not about to tell you that this is a great film, but if you set your expectations low, you are likely to have fun. Despite the icky (and variable in quality, though impressive in the last 10 minutes) special effects and the large amounts of blood and t&amp;a, the film never becomes truly disturbing, because you're never meant to take it 100% seriously. Michael Madsen understood that, to be sure, and thanks to his trademarked coolness, he walks away with the picture. As for Natasha Henstridge, she has more or less a supporting part, but one that is rather imaginatively linked to the central story line. <br><br>Overall, a movie with no artistic pretensions and, undoubtedly, many flaws (someone else already mentioned this; why didn't her head explode when she escaped from the lab?), but watch it in the right frame of mind and it's quite enjoyable. Do you know any other movie that features sex between slimy aliens?!?    (**1/2)","user":"gridoon","rank":[44,64]}]