[{"title":"A movie so real you forget it's a movie.","rating":12,"date":"12 March 1999","review":"Every so often you come across a film that is so accurate in it's depiction of life and the character of the people you forget it's a movie and it takes you to that place in time and you become one of the people, Mister Johnson is that film plus 100. Mister Johnson is an accurate look into the life of a man who is torn between the color of his heritage and his longing to be an English gentleman. Mister Johnson is a man who forgets his ethnic heritage and calls his own people ''ignorant'' and ''savage'' but holds the people who treat his with the lowest respect, namely the British officials and colonists in the highest honor. He is an example of the brainwashing given to many many people of color over the centuries by the Whites, making them forget who they are, where they came from, and making them have an alien thirst for white culture. But Mister Johnson is more than that..oh yes indeed. He is a crafty little man who's high intelligence gets him into trouble with the British offocials. He has a thirst for english traditions and a longing for the white man's riches and acceptance but I do not believe he even knows why. This is a great film depicting the harsh life of a man too smart for his own good in a time where his skin color and an intellect that large was the biggest threat in the mind of white colonists. Sadly this film leaves you wanting more, wanting a deeper look into how Mister Johnson came to be they way he is.","user":"GAMERA95","rank":[17,18]},{"title":"A superb yet overlooked film.","rating":17,"date":"17 July 1999","review":"Every so often you come acrooss a movie that at first you have no intention of watching and at a glance it seems as though it couldn't possibly interest you but it just pulls you in, takes you to another time and your hooked, Mister Johnson is one such film. The story takes place in West Africa 1920 while the british empire is still in partial control of the land and it's survival of the fittest so to speak. Native men work all day virtually as slaves for pennies and a select few that were lucky enough to be educated and get a good start in life treat the rest worse than the white colonists in an attempt to gain favor with the British. Mister Johnson is a movie about a fluke of a man, educated, sly, cunningly crafty, sharp as a tack and a black man living in a hard time and place. Mister Johnson is a movie about a man who tries so hard to be British he forgets who his people really are, he breaks his back time and time again bending over backwards for the British but ultimately gets no real reward except his satisfaction in believing he's one step closer to being and englishman. This movie looks so real and the characters are so vivid and realistic you sometimes ahve to close your eyes for a second or so to remember your not there with them. In my view Mister Johnson is someone we can ALL relate to, a man obsessed with being a bigshot in a town of nobody's and he will do anything to achieve it.","user":"A-KO-2","rank":[15,16]},{"title":"Drama used in real-life setting","rating":8,"date":"9 February 2005","review":"Mister Johnson tells the tale of a young Nigerian man whose dishonesty and desire to please others lead to his downfall. He's lost--thinking he must be British to be a real man, for that is what he hears the British imperialists say. He doesn't understand the intrinsic worth of his African identity, and in his attempt to become more and more British, he loses everything he loves. The plot itself is sad but not entirely original. The movie's charm is in its setting--central Nigeria--and its use of the Pidgin and Hausa from that region. As one who grew up there, I was thrilled with their correct usage of terms and expressions. The cinematography is excellent, and I appreciate the genuineness of the movie itself. Sad but worth watching.","user":"saralynnNG","rank":[14,15]}]