[{"title":"The Jewel of the Coen Crown","rating":10,"date":"8 July 1999","review":"One of the great undiscovered gems of recent movie history.  In my opinion, Miller's crossing is easily the best of the Coen brothers' films, and one of the true classics of American cinema.<br><br>On the surface, the story of warring gangsters in 1920's America is one that has been told many times before.  But never before has it been handled with such artistry and precision.  The (rather violent) action scenes keep the movie going along at a brisk pace, and the camera work is every bit the equal of \"Fargo\".<br><br>I became a lifelong Gabriel Byrne fan as a result of this movie, despite his best efforts to disappoint me since.  Byrne's Tom Reagan is a compellingly amoral character, who takes more unchallenged beatings than perhaps anyone in film history.  Men beat him up.  Women beat him up.  Collection men, bookies, gangsters, and even his boss gives him a terrible thrashing, and he hardly lifts a finger in opposition (with one notably humorous exception).<br><br>Albert Finney is tremendous as Leo, the local crime boss.  His \"Danny Boy\" scene should go down in film history as one of the greatest pieces ever filmed.  Jon Polito is at once absurdly funny and threateningly psychotic as Johnny Caspar, Leo's rival in the turf war.  J.E. Freeman, John Turturro, and Marcia Gay Harden all lend strong support in a cast that was assembled and performs to near perfection.<br><br>I will never understand why this film has not received more recognition and acclaim.  As an example of the modern style of Film Noir, it has no equals (\"The Usual Suspects\" would rate a close second).  Among gangster films, only \"The Godfather\" can compete, and \"Miller's Crossing\" features superior pacing and dialog, although it lacks \"The Godfather's\" epic proportions. Perhaps someday this film will receive, like \"The Manchurian Candidate\" and \"Touch of Evil\", the belated accolades it so richly deserves.","user":"PClark","rank":[223,264]},{"title":"Awesome","rating":10,"date":"13 November 2005","review":"I was blown away by this film the first time I saw it. After giving myself a couple hours to shake off my dumbfounding amazement, I became addicted. This film has everything. It's witty in its dialogue, suspenseful in its action and violence, beautiful in its cinematography, and (being so like the Coen brothers) it can make you laugh and cringe in the same scene.<br><br>The script is superb. The characters are absorbing and the dialogue (as some reviewers have already observed) flows like words in a book. You have to watch some scenes more than once to totally get what's going on, and even then you still might miss something.<br><br>The acting is top-notch, even down to the lowest thug. Gabriel Byrne plays the antihero Tom to lonely perfection and Marcia Gay Harden's hooker without a golden heart is excellent. The rest of the cast is great as well, including good mobster Albert Finney and a funny cameo by Steven Buscemi. However, the show is stolen threefold by Jon Polito as the erratic Italian underboss Johnny Caspar, John Tuturro as the slimy \"schmatta\" Bernie Bernbaum and J.E. Freeman as Caspar's dark, vicious adviser/thug Eddie Dane. Jon Polito's monologue in the very beginning on ethics and Tuturro's desperate pleas at Miller's Crossing are both powerful scenes, and Freeman commands the screen whenever he is on.<br><br>My rating is a 10/10. The best part about this movie is that it gets better and better every time you watch it. Oh yeah...the Danny Boy scene is reason enough to watch this movie anyway.","user":"teigeng","rank":[88,104]},{"title":"The Intellectual's Gangster Film","rating":10,"date":"24 May 2003","review":"\"I'm talkin' about friendship. I'm talkin' about character. I'm talkin' about--hell Leo, I ain't embarrassed to use the word--ethics.\" So Jon Polito, as crime-boss Johnny \"Caspar,\" describes to his overlord, Albert Finney as \"Leo,\" his point of view while seeking permission to kill a double-crossing underling (played by John Turturro) in the opening lines of __Miller's Crossing__. Had the script sought only to explore the power relationship between the two chief mobsters (one the rising Italian, the other the diminishing Irishman), this would have been a very good gangster film. It portrays an earlier era in the nation's history of organized crime (perhaps Chicago in the late '20s), and one can imagine Leo as the Irish predecessor of __The Godfather__'s Don Vito Corleone (Marlon Brando).<br><br>Just as __The Godfather__ was really about family relationships and the ethical complexities arising when familial loyalty collides with the business of violence, however, __Miller's Crossing__ is actually about, as Caspar tells us, friendship and character put under the enormous strain of that same business of violence. The film, therefore, centers on Leo's trusted adviser Tom (played flawlessly by the Irish actor Gabriel Byrne). Tom is not a gunsel, but the brain behind Leo's muscle. His decisions carry life and death consequences, however, and we watch him try to live with himself, to preserve his character, as he works out a code that will help him and his friends survive brutally violent upheavals. Critics of the film have cited its graphic cruelty and the seeming coldness of its characters, yet these are essential features in developing the film's theme.<br><br>Sentimentality might get any of the major characters killed, and one notes the pathos and dark humor that underline an ironic distance that each character, especially Tom, cultivates as a tool for survival.<br><br>Clues abound as we wonder what Tom will do next. Follow, for example, the men's hats over the course of the film. Who \"keeps his lid on,\" so to speak, and who loses his? Note the number of times characters exclaim \"Jesus!\" or \"Damn!\" when saying the name \"Tom.\" What has he sacrificed? Has he damned himself?<br><br>Spectacular action sequences, beautiful production values, top-notch camera work by Barry Sonnenfeld, a haunting musical score, and the best dialogue ever written by the Coen brothers make this a great gangster film. The fascinating and complex theme of friendship, character, and ethics make it one of the great films from any genre.","user":"ams13","rank":[199,244]}]