[{"title":"Brilliant movie for anyone who understands South African humour and culture.","rating":8,"date":"30 September 2005","review":"I agree with many of the people who posted comments here that are from SA. This movie is based on South African Humour, the acting isn't as bad as most people say, many people just doesn't understand this type of humour.<br><br>The movie was released in 1993, people must understand this was a really volatile difficult time in SA, and to have such a movie released, that clearly stretches racial barriers was a great risk, but it was worth it. Both Black and White South Africans found this extremely funny, and in a way it was able to overcome most racial barriers of the time.<br><br>I have asked many of my black friends if they weren't offended when they watched it the first time and most said that they weren't, simply because it poked fun at all races. It was hilarious, and I have to agree, the best work of both actors' careers.<br><br>I can't see many people in other countries truly enjoying this if they don't understand South African Culture, but if you did enjoy it I'm really glad! Again, this was made for a South African Audience on a small budget, that said, it still stays one of my favourite movies!","user":"snippie","rank":[14,15]},{"title":"this move was so well made, and the actors so good, that it has let a lasting impression","rating":10,"date":"28 November 2005","review":"this movie is a hilarious and side splitting humorous comedy that our whole family has enjoyed for many years. we have seen this spectacular movie time and time again and seem to cant get enough of yankee zulu. my all time favourite scene in yankee zulu is when the poacher is buried to his knees and wakes up to find a lion eating, a gazelle leg which he thought was his own leg because of the blood spread on his knees. this is such a spectacular master piece and a must to everyone who enjoys a good side splitting comedy. it is a very immature movie but it brings out the child in everyone. if u disagree with this comment you have lost your inner child. from the pryor family","user":"pepsiwet1","rank":[10,11]},{"title":"Not to be compared to Hollywood movies...","rating":10,"date":"18 October 2001","review":"Everything is relative. This film may not be a million-dollar budget blockbuster, but it is still very funny. Former reviews say that you need to live in South Africa to understand the movie. I say that it not needed. I live in Sweden, and I still laughed until my stomach ached! However, this is not really a family movie. Younger kids may not understand the racism-related jokes...<br><br>I say that it's worth checking out. It's one and a half hour of cheap entertainment. Give it a shot. You might actually like it... =)","user":"Lagoona","rank":[9,10]}]