[{"title":"More Nays than Yays","rating":2,"date":"13 April 2004","review":"People who experienced this intimate musical off-Broadway, and in local community theater productions around the country, will rightly be disappointed and even horrified by this film effort.<br><br>Gone is the magic, the delight, and the imagination of a creation designed for small spaces, interaction with audiences, scant scenery and loads of beautiful melodies and poetic charm.<br><br>They've taken a concept geared for a cabaret and ballooned into a huge overblown, literate production that comes off as strange and even weird. They've juxtaposed and cut great songs, and tried to make a small ensemble effort into a large Hollywood extravaganza.  <br><br>I agree this is one misfire that simply should have stayed on the shelf and not released--just written off as a tax loss.","user":"harry-76","rank":[26,31]},{"title":"The Impossible Film","rating":5,"date":"5 May 2001","review":"I think the defining moment of \"The Fantasticks\" is the presentation of the song, \"It Depends on What You Pay.\"  In this film, that title is the only line from the original song that makes it into the film.  That's because an alternate title of the original song is \"Rape,\" the word being defined in the musical as \"abduction,\" not the darker meaning.  That explanation, curiously, remains in the film, but the other lyrics, describing different kinds of \"rapes\" are excluded.  The exclusion of those lyrics is not surprising--what seemed only risque in 1960 now seems not only politically incorrect but surprisingly callous and insensitive.  The fact, however, that one song from a 1960 Off-Broadway musical cannot fit into a 1995 movie, doesn't necessary mean the rest of the musical can.<br><br>Much of what was classic in the past no longer fits into contemporary thought.  Updating, however, cannot necessarily preserve what made it into a classic in the first place, and it is not just \"It Depends on What You Pay\" that's been updated.<br><br>Speaking of the original \"Fantasticks\" as a whole, the score is something I fell in love with 34 years ago.  The simplicity of it--scored basically for harp and piano--was a revelation compared to overscored Broadway shows.  It also accentuated the music's occasional harmonic surprises, which seem to look forward to Stephen Sondheim.  More than this, the minimalist staging--no real sets or props--also was very foward-looking, and assisted in making more timeless what might now seem like a very timebound story.  I think the fact the original play has run non-stop for 41 years verifies this.<br><br>All this is lacking in the film.  Jonathan Tunick's updated orchestrations are good, but they blunt the impact of the score.  In place of a bare bones stage, we now see location shooting and a huge carnival set.  Other songs are abridged, and dialogue omitted.  Maybe this had to be done to adapt the musical into something that didn't seem just a filmed stage event and adapt it for modern audiences, but it isn't really \"The Fantasticks\" anymore, and it shows on the screen.  The film comes off hopelessly hokey and contrived. Worse, it comes off as the very thing I believe I remember Luisa asks God not to make her in the play's introduction to \"Just Once\": ordinary.<br><br>Perhaps this is a film that should never have been attempted.  And perhaps someone will have the foresight to release the 1960's TV version on video soon.","user":"hlightstone","rank":[13,15]},{"title":"Very disappointing","rating":4,"date":"24 June 2003","review":"I am a big musical fan. As a high school choir teacher, I require my students to watch them. I won't be requiring them to watch this.<br><br>Another comment on this forum said that the negatively opinionated people should cut the movie version some slack as there are always differences with a screenplay. True, but most of the screenplay versions have become classics in their own right--and for good reason. That reason being that the screenplay itself is an excellent adaptation and it is quality work. Not so with this disappointing movie.<br><br>This movie had great potential with a good cast. I think that Jean Louisa Kelly was the bright spot, quite good actually, and the actor who portrayed El Gallo was the low spot.<br><br>Ironically, the movie was like the story. Once Matt and Louisa had the freedom to see each other and empowered to make their relationship and fantasies materialize from abstract to concrete, the magic was gone. I felt the magic of the play was gone because much of what was the magic of our imagination and imagery gave way to too many concrete images on screen via sets, props, and what not. It simply didn't work.<br><br>I remember the intimacy of doing this play in high school. I was not on stage, but I was one of the \"pit\" musicians. We did it in 3/4 in the round. The theater seated 70 people. The cast interacted with the pit and the audience. It was simply charming. It was magical. Not so with this movie.<br><br>Like others, big question marks entered my head with the script. I kept saying to myself several times during the viewing, \"I don't remember this,\" or \"I thought something else happened (or was said).\"<br><br>No, I'm not going to cut this some slack just because a movie version is going to differ from the staged version. We own most of the movie versions of various musicals and we watch them and re-watch them and re-watch them again and again. Why? Because they're great. This one?....Well, I'm glad we rented it.<br><br>Go see the real thing. On a stage.","user":"redvette_ragtop","rank":[11,13]}]