[{"title":"Accept no substitutes","rating":8,"date":"9 July 2000","review":"This, the French La Femme Nikita, directed by Luc Besson, is one of the strangest, most bizarre, yet psychologically truest movies ever made. The story on the surface is absurd and something you'd expect from a grade 'B' international intrigue thriller. Anne Parillaud plays Nikita, a bitter, drug-dependent, unsocialized child of the streets who is faster than a kung fu fighter and packs more punch than a Mike Tyson bite. She's killed some people and is given a choice between death and becoming an assassin for the French government.<br><br>This premise should lead to the usual action/adventure yarn, with lots of fists flying, guns going off, people jumping off of buildings, roaring through the streets in souped up vehicles, spraying bullets, etc., as blood flows and bones shatter. And something like that does happen. However there is a second level in which Nitika becomes the embodiment of something beyond an action adventure heroine. She is coerced and managed by society. Her individuality is beaten out of her so that she can be molded into what the society demands. She comes out of her 'training' with her individuality compromised, her free and natural spirit cowed, but undefeated and alive, and she sets out to do what she has been taught to do. And then she falls in love. And she notices, somewhere along the way, amid the murder and the mayhem, that there is something better than and more important than, and closer to her soul in this world than killing and being killed. She finds that she prefers love to hate, tenderness to brutality. She sees herself and who she is for the first time, but it is too late. She cannot escape. Or can she?<br><br>Parillaud brings a wild animal persona tinged with beauty and unself-conscious grace to the role of Nikita. Marc Duret plays Rico, the tender man she loves, and Tchéky Karyo is her mentor, Bob, whom she also loves. Jeanne Moreau, the legend, has a small part as Amande, who teaches Nikita lipstick application and how to be attractive.<br><br>Now compare this to the US remake called Point of No Return (1993), starring Bridget Fonda. (Please, do not even consider the vapid TV Nikita.) What's the difference? Well, Fonda's flashier, I suppose, but nowhere is there anything like the psychological depth and raw animal magnetism found in the original. The Fonda vehicle is simply a one-dimensional action flick stylishly done in a predictable manner. Besson's Nikita is a work of art that explores the human predicament and even suggests something close to salvation.<br><br>As always with a French film, get the subtitled version. The dubbing is always atrocious, and anyway there's really not that much dialogue.<br><br>(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)","user":"DeeNine-2","rank":[145,163]},{"title":"Exciting, romantic, and stylish!","rating":8,"date":"27 September 2005","review":"I fell in love with this film from the moment I first saw a brief clip of it on an entertainment program. At first I was drawn to the action elements (being young and somewhat immature in my dramatic tastes), but I was blown away by the romance and character interplay. I loved the composition of the scenes, the noirish lighting, and the quirky humor. This movie, along with Pedro Almodovar's films, really opened my eyes to European films, particularly those with a signature style.<br><br>The performances are great across the board. Anne Parillaud plays all facets of Nikita well, from her rebellious, drug-hazed beginning, to her growing confidence, and her near breakdown as her mission falls apart. Tcheky Karyo made a huge impression, mostly through his body language and his eyes. He says more with an expression than most actors do with dialogue. Jeanne Moraeu is a treasure, a truly beautiful woman in appearance and spirit. Jean-Hughues Anglade has the harder part, the \"normal\" guy who Nikita falls for. He is adept at comedy, but is tender in the love scenes. He carries himself well in his face-off with Bob. Finally, the actor who really stands out in memory, Jean Reno. Reno oozes charisma and talent, even in bad films. He steals the film the moment he enters.<br><br>Luc Besson is a tremendous stylist. His films are beautiful, even when the story is a bit obtuse. He is adept at using light to portray and enhance emotion and his compositions are stunning. His main fault is that he lets style overtake story, but he gets away with it because the style is always interesting. He is a fine writer, although more care seems to go into the scripts he directs than those he has written for others.<br><br>Finally, one can't discuss the films of Besson without discussing the music of Eric Serra. Serra creates an atmosphere that is much a part of the setting as the lighting or set decoration. His compositions convey mood and emotion, adding another layer to the story. His signature bass and percussion gets your heart pumping during action sequences, while the melodies bring a softness to intimate moments. He demonstrates the proper way to use synthesizers, to transform the music, rather than make up for lack of an orchestra (or talent). Serra's soundtracks were the first that I bought for instrumental music, rather than for pop songs used in the film. <br><br>This is a film that appeals to many audiences. There is plenty of action and intrigue for thrillseekers, unique character studies, quirky humor, and above all, romance. It has spawned many imitations (Point of No Return, Black Cat, Nikita TV series) but has never been equaled. If you are a fan of film noir, action/espionage, character drama, or romance, you should see this film; then you should own this film. You'll want to watch it again and again.","user":"grendelkhan","rank":[53,58]},{"title":"plenty of verve and style, and a (rightfully) perennial favorite of French spy thrillers","rating":9,"date":"31 January 2008","review":"Luc Besson was on a hot streak in the late 80s/early 90s, and La Femme Nikita (or just Nikita for short) is almost as good as he got at putting his own distinctive stamp on a genre that many auteurs have trouble molding. The spy thriller is great for blockbuster audiences, but to make it into a strong romantic drama is always tricky, as there's the chance for too much one-dimensional theatrics or more attention paid to the plot convolutions than actual human emotions. Nikita squares this problem away just with the protagonist: a young punk (Anne Parillaud, in her most recognizable, near star-making performance) who kills a cop in the midst of a shoot-out is sentenced to life, but then sort of resurrected following the lead of a member of a covert spy organization, and given an ultimatum: become a spy/assassin, or die. She complies, and in a few years time turns into Josephine, who gets orders on the outside from time to time to do tasks like dress up in a maid's outfit to serve potential targets, or to ready herself to kill someone long-range at a moment's notice.<br><br>Besson crafts his main story by creating a sort of love triangle between Nikita/Josephine/Marie, her boss Bob, and her conventional lover Marco, a grocery store cashier who doesn't know what she really does. Besson tools with the elements for a much more conventional thriller, and from time to time it could appear like La Femme Nikita will veer into that realm and not return. But Besson is smart; he crafts the first hour like a kind of 'Taming of the Shrew' saga (or 'Taming of a Shrill Bad-ass'), filled with juicy, dark humor ranging from the ultra-violent (pencil in the hand anyone?) to the silly and playful (training with karate instructors). And as pure director of action sequences Besson shows himself as one of the more distinct masters; it's succinctly fresh and tense while holding the ingredients for what mainstream audiences crave, chiefly in that centerpiece as she is told to kill someone on the night of a seemingly hot date with Bob. Even in the little things, like the scene where she watches the spy put together the concoction for the target in the hotel, works on the purest technical terms.<br><br>But La Femme Nikita, for the most part, also works on emotional levels too. Besson won't be above throwing in a hard-boiled killer in the midst (Jean Reno's Victor, my favorite supporting character if only for a few pivotal scenes, and a precursor to Leon), but he'll also subvert it just a tinge for good measure. I loved seeing when Josephine has to take out the woman in Venice, her shot in sight, and is moved to tears through the words that Marco speaks to her, truthfully, not in any terms that deem him as the boring \"safe\" character, but as her kind of salvation from a life that she's been forced into as a final alternative. As happens often in Besson's work, in fact, the female character is put into a realm of personal chaos that is created by or leads to murder and, at the least, harrowing times with the one she cares for or about (i.e. Portman in Leon, Leeloo in Fifth Element, Joan of Arc, even Angela in Angel-A). It's not simply a gimmick in having the character be a woman- it's essential to Besson's track as a filmmaker, and Praillaud is excellent for the sort of ups and downs the character goes through, sometimes in the same scene! <br><br>This isn't to say there are a few minor liabilities, if only from my perspective: the music is usually effective in that early electronic-techno beat style for a modern thriller, yet sometimes it's also a cross between a soft-core porn and Weather channel muzak; the ending felt abrupt, or at least on a first viewing (albeit it's hard to top the scene at the ambassador's HQ); and, as a minor criticism, what happened to showing how Nikita learns how to smile? (Seems a little crucial as something of her personality that's skipped over, when made to seem like a big stepping stone by Jeanne Moreau's enigmatic character.) Otherwise, a must-see, and one of Besson's best films.","user":"Quinoa1984","rank":[37,40]}]