[{"title":"MUCH better than the box says","rating":10,"date":"17 November 2001","review":"If you pick this up at the video store, you'll probably expect the wrong thing: kind of a goofy, teen-oriented, mock angst trip by a couple of overdone punks through Salt Lake City's holy land. That's not even close to the heart of this film, which is smarter and more vital than most.<br><br>Essentially a monologue by the main character, Steve or Steve-o, SLC Punk starts, ends, and runs with energy and insight, all without the ponderous pronouncements you'll find in most films focused on one character. The central character and his interesting entourage are not the caricatures you see on the box, they're the genuine, multi-dimensional people you went to school with if you were lucky.<br><br>The visuals are savvy and professional, opening up what could be a stage show to the wider world. A classic experimental 3-D pan shot done with over a hundred one-shot cameras would be hailed as groundbreaking, had this film not been released concurrently with The Matrix.<br><br>Film hounds will catch the theme and scene parallels with Easy Rider, particularly a drug trip much richer than the exaggerated freak out in that film.<br><br>Funny, smart, immediately engaging, dangerous, and often more textured and subtle than it appears at first glance, you will understand why SLC Punk (released by Sony Pictures Classics) has such a loyal following.<br><br>This is the film I wish Kevin Smith had made instead of Clerks. Yes, that's a compliment for Smith, who admits he has grown a lot as a filmmaker, and a mild slam on Clerks, which was what it was -- interesting characters wrapped in a poorly done film.","user":"votequentin","rank":[65,82]},{"title":"Incredible!","rating":10,"date":"10 November 2001","review":"I saw this movie for the first time tonight and I must admit, I wasn't expecting much but it left me almost crying in the end, and recommending it to all of my family and friends. I don't claim to know what the 80s punk scene was like, especially in Utah, but regardless of whether punk life was portrayed correctly or not in this movie (I think most of you who bitch about that aspect wouldn't know anyway), it was written extremely well and the acting was just incredible.","user":"tcbaker","rank":[75,97]},{"title":"Excellent quirky slice o life","rating":8,"date":"27 January 2001","review":"I did not expect much from this movie and was pleasantly surprised, and having been to Salt Lake City a few times, I was particularly amused. I was there in 1980, at the outset of the decade in which the movie takes place. That visit turned out to be the one and only time I set foot in a disco club. It is a good thing I didn't run into Stevo and Bob, the twin protagonists of \"SLC Punk!\" They would have kicked my butt because they hate mods, hippies and rednecks. Whether or not to pound on a disco-goer wouldn't even be a question. At one point, Bob asks a British punk band's lead singer why he would never come back to SLC. \"Too bleeding violent,\" says the bruised singer. \"Thank you!\" says Bob.<br><br>Stevo and Bob are anarchists. Not philosophical anarchists like Kropotkin, Goodman and Goldman (Peter, Paul and Emma), but more like Leon Czolgosz, the guy who assassinated President William McKinley. Except Czolgosz had more direction in his life. Aside from throwing darts at pictures of President Ronald Reagan, Stevo and Bob just get drunk and high. Correction, only Stevo smokes grass while \"Heroin\" Bob is ironically nicknamed because he is afraid of needles and anything stronger than booze.<br><br>The story is picaresque in both senses of the term: it is about a couple of semi-likeable rogues, and it is less a story than a series of vignettes. I thought that each vignette more or less stood on its own, but there is something of an overarching theme, too. These young men grow up physically if not emotionally. Though angry and feeling not a little betrayed by society, they can't be Salt Lake City punks for the rest of their lives, or can they? The narrator, Stevo, is haunted by the fear that he or Bob or both of them might be the worst thing there is: a poser, a phony punk.<br><br>This movie also features one of my favorite under-rated actresses, Annabeth Gish, as Trish who runs a head shop. Bob sells himself to her for thirty-six dollars. As decadent as that might seem, there turns out to be something sweet about it, much to Stevo's disgust!<br><br>Like wearing a blue-green mohawk, \"SLC Punk!\" might not be for everyone, but I mainly enjoyed it. My favorite scene is the one in which Stevo's parents sit him down and try to get him to go to Harvard. What a scathing satire on my self-righteous and self-satisfied boomer generation!","user":"Miles-10","rank":[24,32]}]