[{"title":"This film brought back memories.","rating":27,"date":"27 June 2003","review":"We lived through the depression and related to some of the conditions portrayed. We have watched it perhaps a dozen times. Each time we see it we pick up on something we had missed because we were still laughing at, or discussing, an earlier scene or line. The entire film was a collection of photographically great faces. We are still asking ourselves whether the entire cast were professionals or whether some were individuals found on location. The film was rich with subtle tie-ins like the children tied together with twine, as the prisoners were connected by chains. We still think the cow may have been hit unintentionally. Fords of that era had mechanical brakes. The driver of the car may not have been accustomed the longer stopping distances required. The many allusions to Ulysses Odyssey inspired us to do an inter-net search. We found a modern text version and discovered more sly references. We appreciate blue grass and country music as originally American and found it thoroughly enjoyable, along with the authentic \"Go To Sleep Little Baby\" and \"Down from the Mountain.\" We were emotionally touched by this film because of our age, and find it totally entertaining every time we view it. We are still amazed that someone not of our generation could have captured the essence of that period of United States history.","user":"wilma1913","rank":[332,365]},{"title":"A Serious Comedy with wonderful characters","rating":10,"date":"28 February 2001","review":"The Coen Brothers have truly outdone themselves in this wonderful saga of three escaped convicts. Though it is based on \"The Odyssey,\" the ancient work of Homer, you do not have to have read \"The Odyssey\" to be able to follow the story. The brothers Coen have woven a tapestry of celluloid and aural delights! The soundtrack is intrinsic to the film, indeed it is as though the soundtrack is the product and the film is wrapping paper. Each character is wonderfully exploited and harkens back to the days of old when films were rich with character actors whose very appearance in the film adds richness, texture and authenticity. George Clooney is magnificent as the grease haired Everett Ulysses McGill, a honest con on the run whose pompous linguistics and vocabulary are comical and endearing. O Brother, Where Art Thou is easily the best Coen film to date as well as Clooney's best effort. Clooney is good enough to warrant a best actor nomination as is Tim Blake Nelson's portrayal of the dimwitted friend Delmar, while the film itself is deserving of a Best film nod.","user":"chucho_wig","rank":[161,188]},{"title":"surprising, refreshing and hilarious","rating":10,"date":"19 February 2001","review":"Thank goodness for the Coen Brothers. Their success has brought them bigger budgets,but hasn't rid them of their creativity. I had planned on seeing another movie, but it was sold out so I went to this one instead. By the time it began, I had forgotten what movie I was there to see. I was surprised in more ways than one. This movie is hilarious, but they don't make any cheap jokes just to get the laughs. The writing is brilliant, and delivered with great skill by George Clooney (after this, nobody can say he's just a pretty face) and the rest of the cast. It can be appreciated on many levels, whether you remember the Odyssey or not. I can't remember the last time I saw a movie that was this clever. I've seen others I would describe as beautiful, intriguing, funny and charming, all of which also describe \"Oh Brother,\" but this movie reminded me of older seinfeld episodes where all the subplots came together in the end. You can feel that their journey is building up to something, but you can't tell what. And the Coen brothers do not fail us, the end is certainly not disappointing. It's surprising, and ties up all the loose ends neatly, without wearing the story out.","user":"zebra83","rank":[199,235]}]