[{"title":"Campy entertaining third and last entry","rating":25,"date":"25 June 2002","review":"The third entry in this bizzare series sees the usual cast return, namely Annie Ross as Granny Ruth and Kevin VanHentenryck as Duane Bradley. This third and last installment in the series has more gore than BC2, is campier and more entertaining than BC2, has some memorable characters and lovable cops, and you get to see 12 of Belial's kids, or his \"progeny\"....It's also got an ending to remember. Highly recommended, this flick rests easy in my collection. 9/10<br><br>Rated 18s for strong horror violence and gore, language, sensuality and nudity","user":"michaeldaly99","rank":[7,7]},{"title":"Oh my God...","rating":3,"date":"3 October 2002","review":"Wow. Just when you thought they couldn't possibly twist BASKET CASE's bizarre concept into more of a surreally grotesque hodgepodge of blood, guts, playfulness, insanity, and 'unique individuals' than the first sequel already has-- they do. And boy do they do it with flair! In THE PROGENY, the premise of the first two movies have been taken to every single wacky extreme imaginable. If you thought BASKET CASE 2 was weird, then the final entry in Frank Henenlotter's cult trilogy will no doubt make you faint with confusion and utter disbelief.<br><br>Trying to explain the plot would be like trying to rationalize a horrific, fast-paced, 90-minute acid trip so I'm not even going to bother. In BASKET CASE 3, you'll witness the silver screen's most unusual musical number, the birth of a dozen monsters, a beautiful dominatrix with multiple personalities, a killer robot-machine, and an overweight genius with several arms. Yet, somehow within the film's warped universe, it all makes perfect sense. I highly recommend the entire series.","user":"Cowman","rank":[17,20]},{"title":"It's Campy and it's Good!","rating":9,"date":"30 April 1999","review":"I love this movie. I nearly wet myself laughing it was so hysterical. I wish they had made more than 3 of these films, because each one just keeps getting campier and funnier.","user":"Huntress-2","rank":[11,13]}]