[{"title":"Not to be missed","rating":10,"date":"26 February 2003","review":"Part of the genius of Branagh's interpretation of Hamlet is in the use of the techniques of the cinema to enhance the production. Branagh has not condensed the acts like some mass market soup, as was done in Olivier's 1948 Oscar-winning production, or in, say, Zeffirelli's 1989 Hamlet lite starring Mel Gibson (both excellent, though, within their scope), but has kept every word while directing our understanding so that even those only casually familiar with the play might follow the intent and purpose with discernment. Recall that for Shakespeare--the ultimate actor's playwright who wrote with precious few stage directions--interpretation was left to the direction and the actors, an open invitation that Branagh rightly accepts.<br><br>The use of flashback scenes of things implied, such as the amorous union of Ophelia and her Lord Hamlet abed, or of a vast expanse of snow darkened with distant soldiers to represent the threat of Fortinbras' army from without, and especially the vivid remembrance in the mind's eye of the new king's dastardly deed of murder most foul, helps us all to more keenly appreciate just what it is that torments Hamlet's soul. I also liked the intense closeups. How they would have bemused and delighted an Elizabethan audience.<br><br>Branagh's ambitious Hamlet is also one of the most accessible and entertaining, yet without the faintest hint of any dumbing down or abbreviation. A play is to divert, to entertain, to allow us to identify with others who trials and tribulations are so like our own. And so first the playwright seeks to engage his audience, and only then, by happenstance and indirection, to inspire and to inform. Shakespeare did this unconsciously, we might say. He wrote for the popular audience of his time, a broad audience, it should be noted, that included kings and queens as well as knaves and beggars, and he reached them, one and all. We are much removed from those times, and yet, this play, this singular achievement in theatre, still has the power to transcend mere entertainment, to fuse poetry and story, as well as the high and the low, and speak once again to a new audience twenty generations removed.<br><br>Branagh himself is a wonderful Hamlet, perhaps a bit of a ham at times (as I think was Shakespeare's intent), a prince who is the friend of itinerant players. He also lacks somewhat in statute (as we conceive our great heroes); nonetheless his interpretation of the great prince's torment and his singular obsession to avenge his father's murder speaks strongly to us all. Branagh, more than any other Hamlet, makes us understand the distracted, anguished and tortured prince, and guides us to not only an appreciation of his actions, wild and crazy as they sometimes are, but to an identification and an understanding of why (the eternal query) Hamlet is so long in assuming the name of action. In Branagh's production, this old quibble with Hamlet's character dissolves itself into a dew, and we realize that he was acting strongly, purposely all the while. He had to know the truth without doubt so that he might act in concert with it.<br><br>I was also very much impressed with Derek Jacobi's Claudius. One recalls that Jacobi played Hamlet in the only other full cinematic production of the play that I know of, produced in 1980 by the BBC with Claire Bloom as Gertrude; and he was an excellent Hamlet, although perhaps like Branagh something less than a massive presence. His Claudius combines second son ambition with a Machiavellian heart, whose words go up but whose thoughts remind below, as is the way of villains everywhere.<br><br>Kate Winslet is a remarkable Ophelia, lending an unusual strength to the role (strength of character is part of what Kate Winslet brings to any role), but with the poor, sweet girl's vulnerability intact. She does the mad scene with Claudius as well as I have seen it done, and of course her personal charisma and beauty embellish the production.<br><br>Richard Briers as Polonius, proves that that officious fool is indeed that, and yet something more so that we can see why he was a counselor to the king. The famous speech he gives to Laertes as his son departs for France, is really ancient wisdom even though it comes from a fool.<br><br>Julie Christie was a delight as the besmirched and wretched queen. In the bedroom scene with Hamlet she becomes transparent to not only her son, but to us all, and we feel that the camera is reaching into her soul. She is outstanding.<br><br>The bit players had their time upon the stage and did middling well to very good. I liked Charlton Heston's player king (although I think he and John Gielgud might have switched roles to good effect) and Billy Crystal's gravedigger was finely etched. Only Jack Lemon's Marcellus really disappointed, but I think that was mainly because he was so poorly cast in such a role. Not once was he able to flash the Jack Lemon grin that we have come to know so well.<br><br>The idea of doing a Shakespearean play with nineteenth century dress in the late twentieth century worked wonderfully well, but I know not why. Perhaps the place and dress are just enough removed from our lives that they are somewhat strange but recognizable in a pleasing way. And perhaps it is just another tribute to the timeless nature of Shakespeare's play.<br><br>There is so much more to say about this wonderful cinematic production. It is, all things considered, one of the best Hamlets ever done. Perhaps it is the best. See it, by all means, see it for yourself.<br><br>(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)","user":"DeeNine-2","rank":[116,137]},{"title":"Brilliant version","rating":10,"date":"5 February 2005","review":"I must say that, looking at Hamlet from the perspective of a student, Brannagh's version of Hamlet is by far the best. His dedication to stay true to the original text should be applauded. It helps the play come to life on screen, and makes it easier for people holding the text while watching, as we did while studying it, to follow and analyze the text.<br><br>One of the things I have heard criticized many times is the casting of major Hollywood names in the play. I find that this helps viewers recognize the characters easier, as opposed to having actors that all look and sound the same that aid in the confusion normally associated with Shakespeare.<br><br>Also, his flashbacks help to clear up many ambiguities in the text. Such as how far the relationship between Hamlet and Ophelia really went and why Fortinbras just happened to be at the castle at the end. All in all, not only does this version contain some brilliant performances by actors both familiar and not familiar with Shakespeare. It is presented in a way that one does not have to be an English Literature Ph.D to understand and enjoy it.","user":"tbone_4ever","rank":[83,101]},{"title":"moderately cloying","rating":16,"date":"16 March 1999","review":"I enjoyed this film immensely when it came out, going to it five times while it was still in theatres. A much better way to spend an evening than watching the retread scifi thriller material out at the time.<br><br>I have to admit though that after seeing it again a few times on video it doesn't have the same attraction for me that it originally did. As film, it's solid. The settings are wonderful, and I admire the desire to produce the entire play unedited.<br><br>I don't enjoy the acting as much as I first did. In the case of Branagh, that may be merely a matter of personal taste. I would prefer a less garrulous Hamlet. Obviously, since all actors of Hamlet are working from the same script, unless edited, this is dependent entirely on the manner in which they portray the character. I find Branagh's performance a bit cloying, and far too over the top in some cases.<br><br>In addition, some of the cameos are distracting. Heston and Crystal I enjoy, but Williams, and particularly Lemmon, are annoying. The others, Attenborough et al, are fine.<br><br>While I can't give Hamlet a whole-hearted recommendation, I have to say that it far surpasses the trite commercialism of all the new \"greatest films of all time\" which have come out over the last few years. That's a phrase being used far too often now, revealing a lack of familiarity with the great films of the past. In that sense, I admire Mr. Branagh's desire to bring great drama to the screen, and hope that he meets with continued success in the future.","user":"MrsRainbow","rank":[16,17]}]