[{"title":"The more I watch it --- the funnier it gets!!","rating":9,"date":"26 August 2005","review":"Definitely one of my all-time favorite comedies. Well directed, well acted -- priceless comic performances by Pesci, Tomei, Gwynne &amp; Austin Pendleton. And more than comedy -- there's also a lot of genuine pathos and real tension and drama, especially in the final courtroom scene. And I really don't understand the \"controversy\" or brouhaha over Marisa Tomei receiving the Best Supporting Actress Oscar for her role in this movie. It's a crackerjack gem of a performance and a stellar comic portrayal. The only thing I can figure is that a lot of snobbery about serious dramatic portrayals somehow being more worthy of honor than great comic performances still very much lives on in much of the film community.","user":"linoochie","rank":[106,109]},{"title":"Brooklyn lawyer Pesci tries to save the \"two yutes\" from frying in the electric chair. Classic!","rating":8,"date":"16 May 2001","review":"\"My Cousin Vinny,\" along with the megahit \"Goodfellas,\" put Pesci on the map.  Of course, he's been in the Scorcese's previous hit \"Raging Bull,\" but didn't get a hell of a lot of recognition at the time.  Joe Pesci's character of Vincent LaGuardia Gambini is a landmark character in comedy history.  When his New Yauker street smarts collide with Southern hospitality--brilliant fish-out-of-water humor ensues! <br><br>\nOf course, Pesci should've be given all the credit.  Marisa Tomei, who RIGHTFULLY won the Supporting Oscar for her excellent performance (please don't believe that urban myth about Jack Palance calling out the wrong name!!), is hilarious as Pesci's fiance with a foul mouth, a smart a**, the heaviest Brooklyn accent and an incredible expertise in automobiles.  This was also the movie that made Marisa a star, and a performance I commend to this day.<br><br>What can I say?  This movie has some of the most priceless bits of comedy. One, of course, involves Pesci's pronunciation of the word \"youth\" which sounds like \"yute.\"  One underrated bit is the one where Pesci first meets his cousin's friend (Mitchell Whitfield) in the jail cell.  His cousin (Ralph Macchio) is asleep and Pesci suddenly pays the friend a visit.  He doesn't know Pesci is the lawyer, and assumes he's some guy who...wants to make him his b**ch.  The comic dialogue in that scene is so perfectly executed and I feel it's one of the funniest in the movie.  I'm not going to give away any more of the film's slick, intelligent humor--You have to see it for yourself!!!<br><br>If you're in the mood for a smart, well-written, well-acted comedy that will have you on the floor--look no further!  \"My Cousin Vinny\" doesn't disappoint in any of those aspects.  This is a truly memorable piece of comedy, and though it was released in 1992, I'm sure comedy lovers will pay homage to this movie in the present day.<br><br>My score:  8 (out of 10)","user":"mattymatt4ever","rank":[141,150]},{"title":"Brilliant Film!","rating":10,"date":"17 September 2005","review":"My Cousin Vinny is one of the most brilliant comedies ever produced. There is simply so much to love about this movie.<br><br>First, this is not simply a slapstick comedy. Sure, there is some of that, including a few hilarious moments in the Alabama mud. But the dialogue in this film is terrifically funny. The writers were able to turn a courtroom script into an incredibly funny exchange of dialogue between lawyers, judges and witnesses. And the whole idea of an out-of-work hairdresser knowing about Positraction is simply brilliant.<br><br>This dialogue is brilliant because of excellent performances by both Marisa Tomei and Joe Pesci. These two sell this whole load of nonsense so beautifully it should be mandatory viewing for first-year drama students. These two actors show how talented people can read practically anything and make it not only funny but wholly believable.<br><br>Even all the side characters, from the judge to the D.A. to the defendants to the jury and witnesses are brilliantly played. Some of the exchanges between a local Alabama judge and a NYC poser lawyer would be completely ridiculous in anyone else's hands, but these people make it so real and so funny it's truly a thing of beauty.<br><br>This is one of those rare films that I can watch over and over again for hours and not tire of it.<br><br>10 out of 10 Barky","user":"Barky44","rank":[184,198]}]