[{"title":"Spellbinding","rating":10,"date":"13 August 2004","review":"One of my least favorite experiences is to find a movie I loved in my single-digits, rewatch it in wonder, then wait half an hour (at most) and finally concede that it was a real stinker. I may sentimentalize movies from my youth, but not the ones that really don't deserve my affection.<br><br>This one does.<br><br>Crysta, a simple, innocent, and at times flippant fairy, is an imperfect but funny heroine, and as genuine as they come. Batty gives Robin Williams another character perfectly suited to his talent -- I watched this movie at a party with highschoolers and he went down great (everyone liked the movie overall, but Batty stole my friends' hearts). He has the genie sassy-but-kind vibe going, and it's hard not to think of him as just as much a main character as Crysta (or more). Zach... well, okay, Zach was unforgivably dumb for awhile, but it was gratifying to see him finally get it. Magi Lune's character was fascinating, a powerful sorceress with just a hint of weakness and sadness (as when she admits of the coming darkness that she \"cannot heal it\" and \"cannot stop it\"). She delivers sappy lines and instead of losing the audience emotionally, they resonate deeply. I think this is because the usual sentimentality and condescension you see in kids' movie whenever there's a \"message\" is totally absent -- Magi speaks her lines with total respect and love for Crysta. It is a deeply spiritual moment.<br><br>The animation is beautiful, visual joy; the script is full of entertaining flourishes, and Crysta's father is the most humorous roly-poly befuddled dad since the Sultan in Aladdin. I'm a huge Tim Curry fan, and he doesn't disappoint. But what makes this film stand out for me is how it handles its message.<br><br>The entire film is built around it, but it doesn't seem heavy-handed at all. As a kid, I was inspired by Crysta's comeback, and the idea of there being \"magic\" in all of us. As a teenager, it reached me even more: Crysta learns that, despite her youthful curiosity, real understanding and real power can come when she applies herself, and takes responsibility. In the beginning of the film, Crysta takes Magi for granted (and not too seriously), and there is a hint of rowdy teenager in the way she sneaks off to hang with a boy she likes. But she comes to understand that Magi is not infallible, and will not always be there to take care of her. She realizes that she loves Magi even though the woman can't always make everything alright, and eventually, Crysta learns that she, too, can take care of others. In short, Crysta matures, and it is insightfully handled and beautiful and affecting for me to watch. this, even more than the idea of conservation, is its message: the inspiration to learn that others cannot always help you, and that sometimes other people even *need* you -- the rainforest is really just another charge, desperately in need of help.","user":"soymaid327","rank":[56,71]},{"title":"One of my favorites","rating":8,"date":"15 November 2004","review":"When I was a kid I loved this movie, and I still enjoy it to this day. The colors and animation are wonderful. Anybody could enjoy this movie. I don't get the low rating. Robin Williams and Tim Curry have the greatest voices for the film. They both add a lot to the film. I would highly recommend this for a family film. Also just for the kids as well. It has catchy toons, nice animation, and a fun story to tell. Also, another addition is that it does have great morals. So, parents don't have to worry. Whenever I babysit my little cousins, this is a movie I'd let them watch on any day. I wish there was a possibility to get a higher rating. But sometimes you just have to deal with it. I feel like this movie deserves at least a 7.0. We can only hope, right?<br><br>8/10","user":"Smells_Like_Cheese","rank":[40,50]},{"title":"A delightful little animated adventure that takes us into the realm nature in a way we don't normally imagine.","rating":10,"date":"23 April 2005","review":"This movie will always hold a special place in my heart. In my younger days, this is the movie that my sister and I watched over and over and over and over. We thought, and still think, it's a fantastic movie.<br><br>So, the plot goes something like this. Deep in the heart of the last rainforest in the world, Fern Gully, live a society of fairies. Peaceful little creatures that spend all day helping things grow and protecting nature. Long ago, an evil force known as Hexxus tried to destroy Fern Gully. But the fairies sealed him in a tree for eternity. At least they thought it was for eternity.<br><br>Humans have come back to Fern Gully, and they brought a huge machine with them known as the leveler. The leveler has one purpose. Chop down and process trees. Go figure, this doesn't bode well with the fairies who are trying to protect nature.<br><br>Zak is a kid likely in his late teens working for this tree felling company as a summer job. And what a hard job. He walks around spray painting trees so the guys running the leveler know which ones to chop down. Really mentally pressing. Then he goes for a little stroll, and comes across a really eerie looking tree. The tree that, unknown to him, contains Hexxus. An insect starts buzzing around Zak, and he has the brilliant idea that he'll kill it with spray paint. Only in the process, he also paints a nice big red X across the Hexxus tree. In a little while, the leveler gets to the tree, chops it down, and Hexxus oozes out from the wood.<br><br>Around this time, while Zak is walking around, he sees some little blue spark flying around. It's Crysta, his soon to be fairy friend. He catches her in his hands, and as a tree starts falling towards him, Crysta yells look out. He doesn't hear, so she says, \"Bless your heart with magic might I give the gift of fairy size! Er, sight!\" Apparently the first word spoken for a spell is the one that takes, and Zak is three inches tall, just like the fairies.<br><br>Zak befriends Crysta, along with her bat friend, Batty (voiced by Robin Williams). The main focus of the movie is the relationship between Zak and Crysta, but also on the potential destruction of Fern Gully as per the wishes of Hexxus.<br><br>It's a cartoon, so obviously the fairies are going to stop Hexxus. But it's still a fun little movie filled with some very funny lines, brightly colored animation, and great voice acting.<br><br>Bottom Line: 4 out of 4 (own this movie)","user":"schmimic","rank":[38,52]}]