[{"title":"painfully true examination of the horror that is childhood","rating":7,"date":"30 July 2005","review":"Grimly convincing portrayal of life in junior high school for the unpopular. If you aren't blown away by how realistic this is then you weren't unpopular enough: this is the real deal. <br><br>This movie strips away the rosy patina of nostalgia that covers most other films that portray the grim nature of childhood. I admire the film for avoiding the common trap of making the lead an innocent victim. Heather is, when the opportunity arises, just as cruel as anyone else in the film. The movie doesn't make Heather a child, but instead makes her a confused human being full of conflicting emotions such as hatred, lust, anguish and guilt.<br><br>I think to understand this movie though, you need to realize that you are viewing everything from Heather's point of view. Teachers and parents are ridiculously unfair, classmates are alarmingly sadistic, and you could point at some action and say, oh, I doubt that would happen, but there's a strong emotional truth; this is what it feels like to be an unhappy child. <br><br>When I watch movies about unpopular kids, I am always disappointed because their lives are better than mine was, and this is the first movie I could point to and say, if you want to see what I was dealing with in Junior High, watch Dollhouse. But while I always wanted a movie that shows the unvarnished truth, it is really difficult to watch. Although if you can make it through the first half hour it gets just a shade less horrific. And it does have a quirky sense of humor that lightens it some. I avoided this movie for years because I was afraid it would be too painful, and a friend said no, it's not that painful, and she was sort of right and sort of wrong. But it's definitely worth seeing.","user":"cherold","rank":[103,111]},{"title":"Cruelty","rating":10,"date":"3 May 2005","review":"\"Welcome to the Dollhouse\" was the introduction of an important voice in the American cinema. Todd Solondz's incisive study of a suburban family is one of the best indie films of the last decade. Having seen it in its theatrical release, we had the opportunity recently to take a new look at it. Mr. Solondz has created a picture of what cruelty does to a child, and how prevalent it is everywhere.<br><br>When we first meet the Wieners, living in suburban New Jersey, they appear to be the ideal family. Both parents, on the surface, look normal, but in watching them closely we come to the conclusion they are not. Some couples are not meant to be parents and the Wieners, obviously, while supportive of the older son, Mark, and the cute younger daughter, Missy, turn a blind eye toward Dawn, their middle daughter who is going through a hard time as she starts junior high school.<br><br>Not only is Dawn an unhappy girl, but she is the object of cruelty in the hands of the other students, both in her class, and in her school, in general. We watch as Brandon, the punkish boy, begins to taunt Dawn in his own sadistic way. Other girls come right out and ask Dawn whether she is a lesbian. There's also another girl that terrorizes her when both meet in the school bathroom. Every time Dawn tries to rebel, it turns out in disaster. Her school teacher doesn't even see anything wrong with Dawn, who is obviously affected by all she is experiencing at this crucial moment.<br><br>Dawn hits a nerve with Brandon when she calls him a retard. Little does she know his own brother is mentally challenged. Usually in the case of bullies like Brandon, they are acting up their frustrations by taking it on others they perceive as weaker, which is why he thinks he can do anything to Dawn because she will never do anything to him.<br><br>In a scene that gives cruelty a new name, we watch as the Wieners are having dinner one night. When Dawn contradicts something her mother has said, she is punished by not getting her dessert. We watch in total disbelief as the other Wieners begin to eat and Dawn's slice of chocolate cake remains near her mother until Missy asks to share that piece with Mark.<br><br>Dawn only has a friend. The young boy who shares her interests in hanging out in the dollhouse in the Wiener's backyard. When the hunky Steve Rogers joins Mark's band, Dawn discovers an irresistible attraction toward this loser. Dawn turns against her only friend and will call him names that we all realize is her own way to deal with emotions she has no control on. Instead of finding happiness among her peers, Dawn only encounters scorn and ridicule.<br><br>In Heather Matarazzo, the director found a young talent to give life to Dawn Wiener. Ms. Matarazzo has a peculiar kind of beauty, but she is made to wear horrible clothes to capture the essence of this sad young teen. Ms. Matarazzo under the guidance of Mr. Solondz makes an appealing Dawn. This young actress gave her character a range of emotions that even older, and more accomplished, actress wouldn't have given to this lost soul.<br><br>The rest of the cast is perfect. Brendan Sexton plays Brendan, the boy from a poor and broken home that has to deal with the blow life has given him. Angela Pietropinto as Mrs. Wiener is seen as the mother from hell. Mattew Faber and Daria Kalinina play Dawn's siblings.<br><br>This was a film that put Todd Solondz on the map. As he has shown with later films, he is a voice to be reckoned with in the independent cinema.","user":"jotix100","rank":[75,84]},{"title":"Painful... but crucial","rating":10,"date":"14 August 2005","review":"This is a shining example of the potential of independent cinema. More specifically, American independent cinema. If you put together nearly every Hollywood movie dealing with early adolescence, their combined weight in truth would not equal what we see in this one film. For some reason, it seems that most screenwriters and directors seem to look back on their youth with blinding nostalgia - painting the whole experience like it was some kind of carefree paradise. One full of prank playing, football games, pep rallies, getting laid, wild parties and having an all-around great time. What makes this movie so powerful and so unique is that it never shies away from being honest, even when it gets really nasty. As you are reading this, kids all over world are being ignored, taunted, degraded, pushed around, abused... And they are doing anything to try escape it. Running away, turning to drugs, committing suicide...<br><br>WELCOME TO THE DOLLHOUSE basically details the life of a tween social outcast and middle child named Dawn Weiner (Heather Matazzaro). For Dawn, every day is a struggle for both survival and distraction from her 'real life'... She is degraded on a daily basis by her peers at school who refer to her as either \"lesbo\" or \"weiner dog,\" is receiving sexual threats from fellow outcast Brandon (Brendan Sexton III) and has to deal with a complete lack of love and nurturing from her frustratingly inept parents, who don't try to hide the fact that they prefer her brainy older brother and ballerina younger sister to her.<br><br>Part of the genius of this film is that, despite the extremely grim subject matter, it is also blisteringly funny. You will laugh and you will wince... and often at the same time. The acting (largely from a group of unknowns) is spot-on, the writing is excellent and the suburban sets are appropriately gaudy.<br><br>Interestingly, I've noticed skimming through other reviews and on the message board, that those who are/were near the bottom social ring in middle and high school seem to find more to grab on to here and much more emotional impact. Many of the haters seem to think this is wholly fabricated... possibly because they didn't have to deal with the the abuse, the whispering, the everyday torment that many others have to endure. Or possibly because they put someone else through it.","user":"capkronos","rank":[38,41]}]