[{"title":"This movie rocks!!","rating":8,"date":"15 January 2006","review":"I have no idea why this flick is getting such a bad rap by so many IMDb users (Some are saying it's his 'worst movie ever.' What?? Haven't any of you seen Cradle 2 The Grave?) My favorite criticism is that the plot is totally stupid, and just an excuse to hang all of the action sequences on. Duh! What the crap were you expecting from a Jet Li movie? Did you honestly believe that someone thought up the story, then just loaded it up with action? Of course not! Black Mask is awesome, wall-to-wall action throughout nearly it's entire running time. It's also deliciously gruesome, and we get plenty of severed limbs, decapitations, and creative ways of watching the bad guys (and quite a few innocent people, too!) get slaughtered. Most of Li's other martial arts films are nursery-school when compared to Black Mask; there is no holding back on the gratuitous violence, bloodshed, or action sequences whatsoever! And that made me a happy camper. Again: if you go into a Jet Li movie expecting magnificent dialog and an intriguing plot, you are going for the wrong reasons. Black Mask is probably my favorite of his movies (though, beware of the horrendous dubbing).","user":"coldstick","rank":[24,29]},{"title":"Love or hate","rating":8,"date":"23 July 2006","review":"This film appears to draw a borderline - on one side, those who love it, on the other, those who find it unbearable.<br><br>To begin with, there is an awful lot of comedy in this film that many viewers are not \"getting\". Of course jet Li's Mask looks like Bruce Lee's Kato - he's supposed to, it's a joke. The guy who has a time-bomb sewn to his heart - outrageous? of course, it's a joke! Some readers will probably ask, if this film is supposed to be so funny, why all the excessive and gory violence? well, for one thing the tolerance for this level of violence is actually different, from culture to culture; and while Hong Kong audiences would recognize this violence is extreme, it's certainly only slightly more than average for a HK action film.<br><br>Also, Black Mask is really the kind of film that takes a genre's conventions and pushes them to extremes, simply because the conventions themselves are wholly unrealistic. After decades of watching people get shot without any noticeable open wounds, many people were horrified to see Bonnie and Clyde and the outlaws of the Wild Bunch spurting blood all over the place. But the fact is, when you're shot with rapid metal projectile, it's almost certain that blood will spurt, especially from an artery.<br><br>This film is a Chinese comic book movie. It is true that the Spiderman films never get this gory - but if they were faithful to reality, they would be! Well, despite its comic-book origins, this film is faithful to reality.<br><br>The only complaint I have is the flashy, over-stylized filming and editing. If the makers of this film had shot it with an eye to Hollywood-style nostalgia (as, e.g., The Rocketeer, or the recent Sky captain film), I doubt anyone would have found it offensive.<br><br>But as it stands, I still had a lotta fun watching this movie.","user":"winner55","rank":[11,12]},{"title":"Seriously awesome fight sequences!","rating":7,"date":"2 April 2002","review":"The story would never win awards, but that's not what it's about... the script was just entertaining and suspenseful enough to make room for the incredibly choreographed fight scenes. Who needs a story with fighting like that? Really, it's worth watching for that reason alone. IF you can handle the gore, of which there is a LOT... none of it done realistically enough to be tough to look at. I gave it a 7.","user":"WritelySo","rank":[11,12]}]