[{"title":"Worth it if only for one scene","rating":7,"date":"29 January 2011","review":"As a modern romantic drama/comedy, there is nothing particularly unique about this one although it has some very witty dialogue. The thing that made it worth it for me was one scene set at a party one of the characters was having to celebrate the sale of one of his movie scripts. At this party one fellow is telling some other fellows how Top Gun is nothing more than \"a man's struggle with his own latent homosexuality\". He then proceeds to analyze all of the characters in terms of Maverick's sexual orientation. I always felt robbed of time, money, and I.Q. points for having sat through Top Gun in the theater back in 1986 but that one comic scene made it all worth it.","user":"AlsExGal","rank":[7,8]},{"title":"A great independent film","rating":8,"date":"3 December 2006","review":"I must admit that I do not know whether the film's success is due to, or in spite of, the multiple writers. When one is aware that several writers, including the director, wrote different scenes, it is a challenge to find just what the cohesive factor is that makes the film so engaging. Admittedly, some scenes are ineffective (the initial poker scene), while some are wildly successful (the poker scene invaded by the characters played by Joey Lauren Adams and Parker Posey). It is one of those films that is MORE than the sum of its parts.<br><br>After several viewings on DVD (I wish I had seen it in the theater), I realized that many details, at first insignificant, contribute to its impact. The film begins broadly, simply and beautifully -- Stolz, Tilly, and Scheffer are on the highway coming home from a road trip. The open western landscape is practically a metaphor for their friendship. However, the film slowly narrows in, and as the love triangle develops,the view gets less broad. A beautifully conceived and shot example of this is the poolside party scene that begins as a B&amp;W camcorder viewfinder \"point of view\", then cuts to full color at a particular point of introspection. It sent chills up my spine.<br><br>The visual details in the location designs and cinematography are rich and revealing, and seem more considered and professional than one finds in most low budget independent films. However, this strong consistency in production values neither spotlights nor hides the writing dissimilarities.<br><br>I strongly recommend this film.","user":"OperaLA","rank":[12,16]},{"title":"review","rating":3,"date":"3 November 1998","review":"This is one of those charming little character study pieces heavily influenced by The Big Chill - not so much in plot or mood, but in casting. The viewer is not so much engaged by the plot or the camera angles but rather by the knowledge that all the actors involved are serious about independent film, have worked together before,  and are enjoying the part, the process and the pay-off of being able to work on a small film with similarly-minded indie actors.<br><br>If you're looking for a solidly brilliant film on relationships, this is probably not what you need (try Manhattan or Annie Hall). But if you're in mood for the following qualifications in a rainy day rental, check it out: 1. A typically scene-stealing turn from Parker Posey. 2. The presence of attractive male leads Eric Stoltz and Craig Scheffer. 3. A storyline involving a sensitive male in love with his best friend's girlfriend. 4. An extremely amusing cameo and monologue from Quentin Tarantino.<br><br>It's fun, it's light and there are moments of truly clever writing. You may take a few valuable one-liners away from the experience.","user":"K8-2","rank":[10,14]}]