[{"title":"I was surprised this movie was this good after reading the book.","rating":8,"date":"30 August 2000","review":"I was very much drawn into the book, and thought that it would be hard to get the same feeling out in a movie.<br><br>At the beginning I thought I was right. From the beginning I was thinking \"they left out a whole mess of details.\" I was irritated that they did not develop the characters better like in the book.<br><br>But by the 3rd quarter of the movie this was the last thought in my mind. And by the end I understood that the screenwriter had very skillfully budgeted his (limited) screen time for the most important parts of the movie, where it is well spent.<br><br>I think the acting of the principals was very good, and I found especially for Sandra Bullock as Ellen Roark - who was the most believable character. Although the rest of the acting was very good, I felt she was the most believable.<br><br>Which raises the main weakness of the movie, as good as it was, having read the book, I could not help being reminded that most of the characters were in fact, actors in a movie. Except for Ms. Bullock, there was a bit of woodeness to the \"folk\" in this small southern town. Also the plot is a bit contrived (but true to the novel). Most important is that (for me) it worked. I was moved. Its a very good movie.","user":"lspaiser","rank":[83,106]},{"title":"Pretty Strong.","rating":6,"date":"6 July 2002","review":"A truly tense film that takes place in present-day Mississippi. A young African-American girl has been raped by two backwoods white men. Her father (Samuel L. Jackson) takes the law into his own hands and kills the two. Now the small town becomes a hot-bed of controversy as a murder trial starts that gets national attention. There is the defense attorney (Matthew McConaughey) and his bright-eyed assistant (Sandra Bullock) against prosecutor supreme Kevin Spacey. A really solid film that works because of a screenplay that pulls no punches and revolutionary direction by Joel Schumacher. A great ensemble cast all excel here and the film captures a place that has turned into a media circus very well. A film that you will watch with clenched fists. An intense experience. 4 stars out of 5.","user":"tfrizzell","rank":[116,151]},{"title":"..most people missed the point the movie is not present-day..","rating":10,"date":"1 May 2006","review":"I had to stop reading the commentaries, because some people thought they were attorneys and rambled-on about injustice. My Friends, in the era this film is about, none of the story would be unusual. There are prejudices much worse even now - I was amazed that one person actually compared this wonderful film to \"Crash\": give the world a break!! If \"Crash\"...Ugh!...proved anything, is was to reassure EVERYONE racism is still America's cancer.<br><br>I am from Biloxi, Mississippi - along the Gulf Coast. That city has always been a melting-pot, so many different races live together. In my youth, it was Czechs and other European races. Today, can you believe, it is Vietnamese ! The city has also always been a tourist-area, and always had some form of gambling before it became The Las Vegas of the South - perhaps that has tempered the people there from the state's interior's citizens. Canton - during the '60s - would have been just as it is portrayed in this film.<br><br>Because of the many TV-courtroom sitcoms, etc., today's population would wonder why there was no strongly-worded assurance the district attorney planned \"to appeal\". What? We are not talking about modern-day justice in this film - Shamefully, this is Mississippi at its worst, and I know about that. We didn't have this kind of racism in Biloxi then, perhaps because African-Americans \"stayed in their place\", a shameful statement if there ever were one. All the foreigners and citizens of other states who are not aware of those days - how can you comment on the film, except to give a critique ? Like many of the people who wrote commentaries, I can watch this film once-a-month. ALL of the cast gave a superb performance; the story did not drag; the places that were filmed were true-to-life; to some folk's surprise, there ARE people who live in the state who do not speak like idiots: people think I'm English!; Mathew Mc was astounding and Sandra Bullock's performance was exactly as it should have been, as an activist \"little rich girl\"; Southern gave a true performance of a alcoholic lawyer; Sam Jackson was masterful and expressed the difference in being \"white\" and \"black\"; Kevin Stacy's portrayal of a Southern lawyer with all the connections, right on; I can think of no one who wasn't brilliantly cast.<br><br>Missed by many people who made comments, this film is a statement that today we are brutally MEAN to one another: \"Crash\" re-states this fact, although it is not nearly as poetic. Do I own this film? You betcha!! I'll most likely have to buy another, and it will be money well-spent. Grishom knows how to get our attention, and \"A Time to Kill\" clearly demonstrates all who were involved in its making were determined to keep his story pure. Wake-up, People - many parts of our world are not pretty today......","user":"fimimix","rank":[168,229]}]