[{"title":"intriguing, thoughtful sci-fi thriller","rating":21,"date":"21 February 2000","review":"As the last millennium comes to a close and a new one opens, the science fiction genre seems to have latched onto a brand new narrative format - the cyber/techno thriller, wherein characters are free to wander in and out of virtual reality worlds and are even forced to call into question the validity of the world we have hitherto smugly referred to as \"reality.\"<br><br>In 1999 alone, this theme has been explored in \"The Matrix\",  \"eXistenZ\" and \"The Thirteenth Floor.\"  Actually, of the three, this is probably the most intriguing, intelligent and involving, successfully combining the elements of a whodunit with a clever sci-fi tale of a group of characters who drift in and out of a simulated version of Los Angeles in 1937.  The plot, though complex, is spun out with coherence and ever-increasing clarity as the layers of information are slowly peeled back to reveal the larger picture. The filmmakers manage to create a sense of unbalance in the audience as we and the characters become more and more unclear as to what is reality and what is a simulation.  Because the writers never lose their way, the result is a work of considerable mystery and intrigue.<br><br>In terms of art direction and cinematography, the film is a total triumph. The Los Angeles of 1937 the moviemakers have visualized on screen actually has a slight studio backlot, artificial feel to it - perfectly befitting just the kind of world a simulator would create.  The photography in these sections also utilizes a slightly off color cast, nicely reflecting the tone found in color pictures of that era.<br><br>\"The Thirteenth Floor\" may not be a very \"deep\" movie, but it is an honorable addition to a newly formed genre that has not yet had time to ossify in its own conventions.  Time alone will tell if filmmakers will be able to expand on this theme or whether, as with most genres, it will fall victim to its own inevitable cliches.","user":"Buddy-51","rank":[137,145]},{"title":"Underrated Sc Fi Classic","rating":9,"date":"13 September 2006","review":"The Thirteenth Floor,in my opinion,is an underrated SCI FI classic. It ranks with Blade Runner, The Matrix &amp; Dark City as Science Fiction with a brain. Not only does it raise philosophical questions around technology , reality and existence it is also an entertaining noir-thriller with a few twists. Visually it is similar to the films mentioned above (dark neon-soaked landscapes) however the contrast between the modern and the 1930's adds another level to the films beauty. The film is well cast (Gretchen Mol looks stunning)and Craig Bierko carries the film well. It's one of those rare films that crosses quite a few genres - intelligent sci fi - murder mystery - film noir - thriller - love story.If you enjoyed Blade Runner and The Matrix you will certainly like this film.","user":"natesh-singh","rank":[206,221]},{"title":"Solid Science-Fiction.","rating":8,"date":"9 September 2000","review":"This movie was both critically and financially panned. Why?<br><br>Two words. The Matrix.<br><br>The Thirteenth Floor is a good movie. No, it's not \"The Matrix\" all over again, but it wasn't trying to be. Comparing these two movies is like comparing Star Trek with Star Wars. Similar in aspects, but very different in others.<br><br>This is what happens when two movies of similar type are released in close proximity. The first one always has a jump-start on the second by means of box office success and pleasant reviews. That's why I think \"The Thirteenth Floor\" was branded as a bad movie. People had already seen \"The Matrix\" with it's knock-out special effects, cast and weren't open-minded for a movie on the same genre branch. So The 13th Floor was said to be 'a bland, pale imitation of the Matrix'.<br><br>Maybe \"The Thirteenth Floor\" doesn't have a star-studded cast - yes, it's cast is mostly regular supporting players, but they work well with the material. So there's no kung-fu ass kicking scenes, so what!<br><br>There's great atmosphere, a intriguing story and a real nice plot twist. To me that makes up a very fine movie. So I ask what was so very wrong with \"The Thirteenth Floor\" that made critics turn away and made it tank at the box office? Really it's people's unwillingness to give a similar movie a chance and instead opting to take the easy route and branding it as a \"rip-off\". Which is their loss unfortunately.","user":"refinedsugar","rank":[304,343]}]