[{"title":"Great then, still great now!","rating":30,"date":"30 December 2017","review":"First watched Dante's Peak when it was released in 1997 and as a kid thought it was brilliant. Just watched it again and I have to say, wow. It is a great film, full of entertainment and action. Yes it is cheesy at times and bits are a bit far fetched e.g. driving over lava, but putting that a side it is a fantastic film.","user":"egg_egan","rank":[25,25]},{"title":"should have a way better rating then 5.9","rating":10,"date":"12 January 2019","review":"Great entertaining movie! Pretty much tells the tell of Mt St. Helens. I saw it in the theatre. Since then I have owned the VHS,DVD,Blu Ray versions on the movie. I watch it 2-3 Time's a year and it never gets old. Watch this over the Tommy Lee Jones disaster Volcano","user":"falconaviat","rank":[17,17]},{"title":"special effects that hold up today","rating":7,"date":"10 May 2012","review":"There is a formula for disaster movies and books. An insightful scientist sees The Bad Thing is going to happen, various foils keep him from warning people (often with sillier motivation than in this film), we get to know a bunch of average Joe characters who survive or do not survive the disaster. Earthquake movies, movies about made-up natural disasters that cannot happen, asteroid movies, even some nuclear holocaust films (like The Day After, unique in how many survive). It's a hackneyed formula, but it also works, and nothing else really does work as well for disaster plots. It was followed here.<br><br>The special effects were terrific in the day, and they still hold up very very well in 2012.<br><br>For a Hollywood film, the science was pretty good. I actually cringed back at the shots of Hawaii type basalt floes (just...no), and the ashfall cleared up nicely whenever they wanted a wide shot, which anyone in Yakima could tell you it really doesn't do, and the boat and drive-over-lava scenes were silly, and if you paddle a boat (through acid or not) with one hand, it's not going to go straight, and our heroes didn't need to cover their mouths in ashfall (meaning, IRL, the ash would turn to concrete in their lungs and they'd suffocate). However, all that having been complained about, much else was very accurate: what gets tested for by volcanologists, what monitoring stations of the day looked like, what some of the warning signs of a coming eruption might be. Most Hollywood film reviews by me on science-based movies are nothing but a list of what they did wrong, with no \"however\" of accurate bits to follow that list, so kudos for doing it more than half right.<br><br>A pleasant diversion, very pretty to look at.","user":"grnhair2001","rank":[16,16]}]