[{"title":"It's a COMEDY folks","rating":8,"date":"15 February 2005","review":"I love watching this movie. I love this dialog in a \"horror\" film. I got myself a copy on DVD and watch it at least a few times a year. There are some classic lines between the city folk vs. the bumpkins. Fonda's line about the sarcasm being too subtle is great (while spraying RAID in the middle of Maine). Betty White is building her career these days being the tart-mouthed old broad (see \"Boston Legal\" - another David Kelley production). Also, the interplay between Oliver Platt and the actor playing the sheriff are priceless.<br><br>Contrary to what others have written - I think the special effects go just fine with the overall campy and comedy feel of the movie and the amount of gore is also appropriate. More would change the tone of the film from the comedy which I enjoy, to one more of a gross-out nature.<br><br>Just a favorite of mine. Try it if you, for example, liked \"Love at First Bite\" - you will probably like this too.","user":"elsie1888","rank":[114,127]},{"title":"Fun, tongue in cheek monster B-movie","rating":3,"date":"3 August 2003","review":"When a diver is cut in half by something under the water of a quiet lake in Maine, Sheriff Keough calls in the Rangers, Jack Wells and a New York palaeontologist, Kelly Scott to investigate a tooth found.  Wealthy crocodile hunter Hector Cyr swoops in to insist that the creature is a crocodile.  A claim that looks increasingly likely when the body count begins to rise.<br><br>You really need to be in the mood for a film like this or else you will likely hate it.  If you love Tremors then you might be the sort of person that lake Placid is aimed at.  The film's strength is that it is a big silly B-movie and it knows it. The film lets us know very early on that it is not 100% serious and this then frees us up to enjoy it rather than moaning about the sheer unlikelyness of the whole affair.<br><br>The plot is daft of course, a Jaws rip off from opening sequence to final attack.  The fact that the script has a great sense of humour makes this OK  so when an old woman feeds a cow to the croc then it's fine because that's just what you'd expect in this film.  Likewise the humour gives rise to plenty of funny lines which add to the feeling that the film is about fun more than scares.  `Is this the man who was attacked?' says Cyr, holding a toe found by the water `he seemed taller' replies the sheriff.  Of course at some point the ending must come and it is as overblown as you'd expect, but even then it has it's tongue in it's cheek (fishing with a cow!?).<br><br>The crocodile effect is a mixed bag.  In some instances it is good while in others it is over animated and not realistic.  For the most part though it works well enough.  The cast are not that good but deliver wooden performances in a good way (if that's possible).  Platt steals every scene he is in by getting all the funny lines (`yeah well they conceal that sort of information in books' being a put down I fully intend to use given the chance).  Pullman is given a less glamorous task of being the leading man while Fonda is like Ally McBeal in the woods!  Gleeson is great fun bouncing off Platt and Betty White is so crazy that it's hard not to laugh!<br><br>Overall this is a big budget silly B-movie that laughs at itself.  If you are not in the mood for that, or can't accept it for what it is then you'd do well to avoid this film.  For all others there is enough good lines and silly fun to be had here to help you enjoy it, even if you do forget it shortly after watching it.","user":"bob the moo","rank":[75,85]},{"title":"A really good trashy movie","rating":7,"date":"13 November 2000","review":"I loved this dopey movie. Funny,with an absolutely hilarious performance by Betty White, an appealing Bridget Fonda (for the first time in memory), and very likeable Brendan Gleeson and Oliver Platt. Bill Pullman was fine but the least of it. What's not to like? I mean, who wouldn't want to save an alligator that's biting people in half in an unspoiled lake 25 miles from anywhere in the middle of Maine? There are so many BAD time wasting movies out there, so much violent, or inane, or vulgar, or sadistic junk that this tongue-in-cheek tale with its dotty characters and clever ending just has to be viewed as one of those times to sit back and smile broadly without guilt. This is hard to pull off, and not to be minimized.","user":"cwpnewpaltz","rank":[54,62]}]