[{"title":"*NOT A SLASHER FILM-VERY ATMOSPHERIC*","rating":30,"date":"30 August 2001","review":"I expected STAR TIME to be yet another \"expired\" early nineties horror film. And the box cover and tagline suggests that too, unfortunately.  BUT I WAS VERY WRONG!  STAR TIME is a perfect example of what a lot of eighties slashers wanted to be.  It's more of an adult slasher, as it really wouldn't appeal to a teenage audience.  This film, most of all, is very atmospheric. I agree.  A lot of it is boring.  But the whole idea behind it is ingenious. ***out of****STAR TIME is a pretty good horror film that I think horror fans, even casual ones, should see.","user":"horror7777","rank":[4,4]},{"title":"Interesting concept ..... not fully developed .....","rating":6,"date":"8 August 2016","review":"\"Star Time\" has an interesting concept, going inside the mind of a depressed young man who's delusions result in serial killings. Unfortunately the small budget does not allow the idea to be fully developed. This is really just a three character play, stretched into 84 minutes running time. John P. Ryan as \"Sam Bones\", the devil inside the mind of the \"Baby Face Killer\" is excellent. He is always an intimidating presence, and here Ryan does his thing, pushing the right buttons to turn an already disturbed man into a hatchet wielding killer. There is very little blood, some nudity, and even a taste of \"black comedy\". More a psychological drama than a slasher, fans of John P. Ryan should see this. - MERK","user":"merklekranz","rank":[6,7]},{"title":"Underrated Gem","rating":8,"date":"7 November 2014","review":"This movie was one I ran across via an old video store going out of business. Michael St. Gerard plays a guy who gets upset because his favorite TV show has been taken off the air and he gets a little homicidal. John P. Ryan gives a stunning performance as a mysterious character on TV who is giving our main character some interesting direction. You won't see another movie quite like this one. I also wish I knew how to get a copy of the song at the end of the movie, also titled \"Star Time\". Overall, it is worth a look indeed if you can actually find it. I was lucky enough to. It is a tense film with a little satire, a little disturbing commentary and a little mystery- all accentuated by some good performances.","user":"wheresjoeysmovie","rank":[4,6]}]