[{"title":"The ultimate Kungfu movie has arrived !","rating":8,"date":"12 October 1998","review":"(***1/2 out of ****)After first seeing still shots from this in an article in Bey Logans' wonderful Impact magazine, I was really looking forward to the day when I could see this film. I was disheartened to hear that it did very bad box office in Hong Kong. Especially considering it was Donnie Yens' directorial debut. Donnie set out to make a kung fu film. That it certainly is. Not in the traditional sense though with crane and snake stances, but in a Bruce Lee kind of way. If Bruce had been born 2 decades later and approved of a lot of under-cranking, then I can fully imagine him doing this type of film.<br><br>So, what is it really like? Well, very good actually. The film is told in flashback. Many people have criticised the film for having flashbacks with flashbacks. I disagree with this. Why is it wrong? After all it only shows what the character is thinking. I did not find it confusing, and it bent the rules of film making quite well in my opinion. Anyway, on with the review! The film tells the story of a legendary character called the Wolf (Yen) and his sidekick. In the beginning we are introduced to an un-named character who is looking for the Wolf in the present day. He is brought to the Wolfs' 'office' where we see him as an old man sleeping. Donnies' sidekick starts to tell the stranger the story of how they met and the legend was born. To give too much of the plot away would be silly considering how sparsely told it is. Nothing about the way the story is told is 'in your face'. Everything is very subtle. Again, something I disagree with that most people have said about the film! Yen has certainly mastered the art of cinematography. The camera angles, colour and editing is very well done. As far as the fighting is concerned, could we expect anything less than brilliant from the Yenster? He seems to be paying homage to kung fu stars past and present. He tips his hat to Tan Tao Liang by putting hopping kicks into modern fight choreography, he moves around and side kicks like Bruce Lee, does his trademark multi-kick jumps and then puts in what seems to be a new type of choreographic brilliance. This involves some quite close in shots of the two opponents arms flailing as they block and parry. So blurred are the movements that only the sound effects give us clues as to the blocking and hitting. It works very well. Donnie shows that he can take choreographing of the martial arts another step towards, and beyond an artform. A few reviews I have seen on this film have said that there isn't much fighting. If ever there was a totally false statement, that is it. Much like Mr Nice Guy, Legend has action by the bucket load. All of it hand to hand fighting. There is one forest fight about a third of the way in to the film that could easily be a prelude to Yen facing up to the main fighting villain of the film at the end. Another fight not long afterwards could very easily be an end fight on its own! A few more fights are just as big. This film has no less than 3 big fights at the end. One against multiple opponents in a village and a forest, then there is the fight against a man known as Monkey which is probably one of the best screen fights I have seen. The last fight is very brutal.<br><br>For people who hate wires (me included), this film stays well away from them. Extreme under-cranking is used only on occasion rather than all of the time. This lets in more traditional choreography. Its surreal and uses dialogue sparingly. I think that this is one film that although people are criticising the hell out of it at the moment. In the future it will get its due.","user":"Riche-3","rank":[7,8]},{"title":"Given a chance, an entertaining film not without its flaws","rating":23,"date":"23 October 2000","review":"Donnie Yen's debut as a director has taken a lot of criticism and was a fairly big flop upon its initial release. Is it a flawed film? Sure. But, is it worth spending an hour and a half watching? Yes.<br><br>\nLegend of the Wolf tells the tale, all in flashback (one of its unfair criticisms) of a how a mythic killer came to be who he is. The film belongs in the classification of 90's arty-swordplay dramas, like Ashes of Time or The Blade, heavy on atmosphere, style, lightweight philosophical musings, and blurry combat. One of the reasons, no doubt, that it was a flop was due to this particular Hong Kong genre already being tired by the time Legend came out. It looks great and has some fantastic cinematography. Although I am not a fan of the close-up, hyper paced fight scenes, Donnie directs them well and with more clarity than most directors of this style. There are two great fights, one inside a hut with a guy who has a huge length of chain wrapped around his arm, and another with a monkey or tiger claw fighter in the woods, the latter being one of the better duels I've seen. Based on those two fights and the cinematography alone, I can recommend Hong Kong action fans seeing this.<br><br>Where Legend of the Wolf fails is in its story. Unfortunately, like other films in the modern swordplay genre, it tries so hard to be dramatic, with overemphasized music, crazy camera work (though some very stunning), and ponderous plotline, it falls deeply into muddled characters and weepy melodrama. Donnie Yen should be commended for being as bold and as skilled as he is. Instead of making his debut with a straightforward no-brain action flick, he tries to tackle something of more weight.  It is less than perfect, but it is admirable, just the same.","user":"iaido","rank":[7,9]},{"title":"Donnie Yen's Masterpiece","rating":10,"date":"30 October 2005","review":"I have seen thousands of martial arts films, ranging from the Hong Kong classics of the 70's to the mixed genre, CGI works of the present day.<br><br>This is my favorite one.<br><br>The fight scenes are the single most beautiful, incredible spectacles I've seen in any action film. <br><br>When two combatants trade blows, the encounter is more a battle between two Gods than mere flesh and blood. In \"The Matrix 3\", the directors' efforts to achieve this failed miserably. Not so in this film.<br><br>When Donnie Yen glares at his opponent(s),one feels that the fate of the world depends upon the clash. Accompanied by a tremendous musical score, the effect is enhanced even further.<br><br>And Yen's character takes on everyone; a vicious gang of fifty men armed with machetes, an entire army of 100+ toughs, gunslingers, iron chain-wielding assassins, and many others.<br><br>One reason is that \"Legend of the Wolf\" represents a historic step forward in martial artsfilm-making; modern action films are shot at 18 fps (frames per second)while being played at 24 fps (\"under-cranking\"), which accelerates the action, but loses the sensation of power from the blows.<br><br>While LOTW utilizes under-cranking,it also features bone-crunching, vicious blows the likes of which I had never seen before in any action film.<br><br>The blows from a punch or the slash of a sword make the viewer cringe from their sheer power and might.<br><br>As excellent as the fight scenes are, it wouldn't be the greatest action film ever were it not for the tragic, depressing storyline. <br><br>It is told through flashback, describing how a dying gangster used to be a young, ruthless, and completely invincible warrior. <br><br>Yet, in the end, despite ultimately triumphing over his hundreds of opponents, the young warrior loses what is most dear to him in all the world, and is never able to win it back. <br><br>This harsh view of the \"unbeatable young fighter\", so common throughout martial arts films, is both realistic and deeply touching. <br><br>One of the few perfect films ever made.","user":"KIMaster2002","rank":[4,5]}]