[{"title":"\"They've been doing this act for over a hundred years.\"","rating":2,"date":"16 December 2001","review":"What is it that's so resolutely unfunny about Mission to Moscow? Is it the lifeless direction? The disinterested performances? The lack of atmosphere? The joke-free script? It's all of these things, of course, but there's also something inexplicably poor about it that you just can't quite put your finger on.<br><br>The regulars are the major weak point. While the guest cast have the misjudged enthusiasm to irksomely overact, all the usual culprits seem embarrassed by the whole thing. None of them sell their underwritten, reheated lines, and the fact that Bubba Smith and Marion Ramsey failed to sign up is a damning indictment. What comes through the screen, from George Gaynes to David Graf, is the sense of souls bleeding. \"Please get me a proper job, there must be a better way to pay my mortgage\" these actors scream with every fibre of their being. Leslie Easterbrook gets her usual single \"my character's got big breasts\" joke - why does she even bother to sign up for this crap? Michael Winslow looks old, tired, and frankly bored with the whole thing. Was his involvement only confirmed at the last minute? Because while he gives a curiously muted performance throughout, the script also fails to accommodate his talents in almost any way. Note that this is the ONLY Police Academy sequel in which he doesn't do his (admittedly run into the ground) \"Bruce Lee\" schtick.<br><br>Police Academy managed to keep up the same level of quality between films three to six - they were all rubbish. But even by their low standards Mission to Moscow plumbs the depths, making Citizens on Patrol look like Annie Hall. New recruit Charlie Schlatter, there for the completely incongruous love interest theme, is never funny and the Russian characters are the crass stereotypes you'd expect. Any film that promises \"we're going to kick buttski\" is clearly dumber than is tolerable, and a tasteless reference to Chernobyl doesn't help matters.<br><br>The only Police Academy film made outside the 80s, it was produced five years after the last one - why?!!?? Was there a big demand in the market for sh*te? Some cartoon sound effects (whistles, birdcall, etc.) are added to the action to try and pep things up, but this really is a DOA of a movie. True to form (or should that be formula?) it ends with an extended chase sequence that is neither suspenseful nor convincing.<br><br>Just look at scenes like the one where G.W. Bailey gets hit in the face with stew. The stew is clearly missing his face and just lands on his chin, so Bailey (the only regular who tries) moves his face so that the full brunt of the stew will land on it. This dedication to duty is admirable, but also perfectly highlights the sloppy desperation of the whole thing.<br><br>\nThe series' move from the teen fodder of the first two, 15 certificate, movies had been subverted into the last five, PG cert entries. This is at its lowest ebb here; a comedy that seems wholly aimed at the under-5s and doesn't know what to do with its characters. Russian acrobats entertain the kiddies while its ... er... \"stars\"... are left to stand around like second bananas, giving unfunny reaction shots.<br><br>Maybe it's the \"fish out of water\" feel of it all, with the somewhat flat Russian espionage themes failing to ignite. But whatever it is, Mission to Moscow feels like a TV sitcom with the canned laughter track removed. In any other franchise this would be described as an \"unfortunate, sad end\" to the series. With Police Academy however, finishing with one of the unfunniest comedies of all time seems strangely apt. 2/10.","user":"The_Movie_Cat","rank":[58,68]},{"title":"A serious drama about mental illness","rating":17,"date":"17 December 2001","review":"Imagine having your testicles ripped off by a Grizzly and you're half way to appreciating how painful an experience this movie is. Whatever you thought about the previous Police Academy movies (and I'm not particularly fond of any of them) they at least fitted in to the genre of comedy. This one creates it's own sub-genre: the anti-comedy. There's not a single joke in the entire film that makes any sense, and this is partly due to the fact that the script reads as though it was translated from English into Russian and then back again. And I'm not trying to insult the Russians. They get a hard enough time in the movie. If the makers of this film are to be believed, the Russian people are a humourless bunch, and so you imagine that the producers thought that a film with absolutely no humour in it would go down a storm with Moscow audiences. Now, I've never seen a Russian comedy, but I think it's safe to bet that they're better than this.<br><br>In one scene, a character batters a hole in a hotel room door using an ice bucket stuck to his head. I don't know why, and it's typical of this film that you're never quite sure what it is you're supposed to be laughing at. The jokes just rattle on and on like this making no sense whatsoever.<br><br>If you were to convince yourself that what you were actually watching was a serious drama about the mental illness of a high-ranking police officer lost in Moscow, you might get some perverse pleasure out of this. On the video packet, though, the distributors assure us that it's a comedy, so you can't even give the film the benefit of the doubt.<br><br>It's interesting to note that after the Police Academy team's adventure in Moscow, the authorities saw fit to let them back into their own country, where they went on to make Police Academy : The Series which is, believe it or not, even worse than this.<br><br>Best to watch this drunk. And with the television switched off.","user":"adrian_knott","rank":[57,71]},{"title":"Moronic piece of retarded trash","rating":1,"date":"25 January 2007","review":"\"Kicking buttski. Making you laughski. The Academy is backski!\" <br><br>What the hell is that even meant to mean!!?? I cannot think of a single Russian word (apart from the obvious \"Russki\") that ends with \"ski\". This is just one of the many idiotic retarded things in this movie. The story makes no sense. Why would Russians want to hire a bunch of American loudmouths to hunt down some supposed \"Russian\" gangster who doesn't look, sound, or talk like a Russian. What kind of a Russian surname is \"Konali\" anyway? And he's planning to take over the world with a stupid video game about a bear who runs around punching people? WHAT THE HELL!? The jokes aren't funny and the acting is crap. Whoever made this movie should be dragged through their own vomit.<br><br>This movie a dumbski piece of crapski.","user":"assassin007","rank":[62,86]}]