[{"title":"The Ring goes sci-fi","rating":8,"date":"17 March 2005","review":"Set almost immediately after the events of Ringu (1998), Rasen/Spiral tells us the story of Mitsuo Ando (Koichi Sato), a forensics doctor who gets wrapped up with the \"Ring curse\" when his the body of an old friend, Ryuji Takayama (Hiroyuki Sanada, reprising his character from Ringu), makes its way onto his autopsy table. Will the curse continue? <br><br>Series Note: There are many different films, television series, books, comic books, etc. based on the \"Ring Universe\", and it's very complicated trying to sort them out. Rasen/Spiral was the original \"Ringu 2\". As such, it should be watched after Ringu (1998) (which you can choose to watch after Ringu 0: Basudei (2000), which is a prequel) and before or after the now official Ringu 2, made in 1999, which was made when audience reaction to Rasen/Spiral was less than favorable.<br><br>Like the other Japanese Ring films, Rasen/Spiral is a mixed bag. For much of its length it is a relatively slow moving drama, with only subtle horror elements. Yet, much of it is very atmospheric and when the horror material arrives, it is as effective as anything else in the series. In fact, if the film had continued with the tone of the first ten minutes, this would easily be my favorite Japanese Ring film--a far cry from the travesty that many claim. As it turned out, writer/director Joji Iida doesn't sustain that level of excellence, but he periodically returns to it. Rasen/The Spiral is also notable for the bizarre sci-fi turns it takes, which gradually become more absurdist (a good quality in my book) until the climax. If you're a fan of that kind of material, and you do not mind sequels with vastly different tones and foci, you should like this film a lot. For some others, the attempted scientific explanations of the \"Ring curse\" are a turn-off that saps some of the supernatural creepiness out of the rest of the series.<br><br>At the end of Ringu, scripter Hiroshi Takahashi and director Hideo Nakata suggested that the Ring curse operated something like a paranormal, deadly chain letter. In one of the better moves of Rasen/Spiral, Iida quickly trashes that idea. He pulls the rug out from our expectations and dispatches characters who were the focus in the previous film. On Iida's account, and possibly in the Koji Suzuki novel (also called Spiral) upon which Rasen/Spiral's script is based, The Ring curse is much less benign than such an easy solution would have it. Of course, audiences often feel alienated when their former heroes are so wantonly disposed in a sequel (and I'm guessing that's part of the reason for making an alternate reality Ringu 2 where the characters Reiko (Nanako Matsushima) and Yoichi Asakawa (Rikiya Otaka) return), but it's a move I love. I'm definitely a fan of nihilism in films, especially in light of its relative rarity. An American film that alienated audiences in a similar way, and which I also loved, is Alien 3 (1992).<br><br>Suzuki and Iida make Rasen/Spiral nicely parallel symbolically to the overall metaphors of the series. \"Ring\" is called ring for many reasons. The ring of the phone, the circle of the well, the moon, the shape of the mirror, the chain letter aspect, Sadako's eye, the circuitous route the curse takes via its video instantiations, and even the temporal period between encountering the video and the curse coming to its resolution, if one takes a cyclical view of time (as is more the case in many Asian cultures). Spiral is an extension of a Ring, figuratively and literally. The sci-fi aspect of the story this time around has the curse as more of a virus, which under the microscope looks ring-shaped with a \"bruised\" side, corresponding to the crack in the well. The path of the curse is more complex and spiraling this time around. And of course, a strand of DNA is a spiral.<br><br>DNA is important in this film. Ryuji first gives Ando an indirect clue to DNA via a piece of paper that Ando finds in Ryuji's stomach, and which he translates as \"dada\" (or \"father\", or \"parent/parentage\"), then \"DNA\". This thread of the plot eventually supplies the outrageously strange climax, which is just as much in the genre of \"rubber reality\" films as sci-fi, and keeps with the admirable nihilism evidenced earlier on.<br><br>Except for one small episode, and a few flashbacks or expository \"fill-ins\" to get new viewers up to speed, Sadako (Ringu's villain) is barely present in this film in her \"normal\" instantiation (she also happens to be portrayed by a different actress--Hinako Saeki, rather than Ringu's Rie Inou or Ringu 0's Yukie Nakama). The nature of the curse has changed. The subtext of the film makes Rasen/Spiral easily interpretable as an allegorical doom-harbinger for eugenics. Past evils have produced a quick, contagious and deadly mutated virus, only conquerable by genetic manipulation, which could just result in a new species supplanting Homo sapiens. The scientists--all doctors in this case--are both the saviors and the villains. Appropriately, Iida has physician supporting characters mysteriously vacillating from helpers/heroes to the infected/untrustworthy.<br><br>Unfortunately, some of this heady nightmare and ghost-fueled reality twisting is dampened by extended forays into \"serious drama-land\", and even a touch of an obligatory romance, ala Ringu 0. But it's never too long before the next supernatural occurrence, and to keep you entertained on the way, Rasen/Spiral has some of the better cinematography of the series.<br><br>I'm not someone who finds any films scary (even as a kid I never did) so I can't compare Rasen/Spiral to the rest of the series in that respect, but as a quality artwork touching on serious, important themes, this film deserves to not be missed, especially if you're at all a fan of the Ring series.","user":"BrandtSponseller","rank":[33,41]},{"title":"Rasen (1998)","rating":6,"date":"2 March 2005","review":"I just want to start by saying I don't find this film anywhere near as bad as most seem to. The mistake is viewing this as a direct sequel to \"Ringu\", made at the same time by a different director it of course does not have the same feel, or menace as its predecessor. Since most people will watch the original first the change in tone is hard to accept. A lot of people also declare this to detach itself too far from the original and explain too much of the mystery with science. When in fact the first two Ring novels have a firm root in science. I also found \"Ringu 2\" to be just as guilty at favouring science over the unknown, the difference being \"Rasen\" does explain things thoroughly. The major disappointment here is that I never really felt anything close to fear, or even uneasiness. However in terms of drama, and expanding on the first this film succeeds. The cinematography is just stunning, and the final scene is a scene I find just as disturbing as the ending of \"Ringu\", not in a fear inducing way, but in a contemplative sort of way. It is also a beautiful scene, and the whole film is well shot. Unlike \"Ringu\" the acting is a mixed bag, Koichi Sato just about holds up, but as the lead he seems to struggle with acting with emotion, which is a minus considering his character deals with suicide. Overall I think the film should be watched, as a side-note to \"Ringu\" but judged on its own merits, as it certainly surpasses many scientific thrillers around.","user":"SnakesOnAnAfricanPlain","rank":[14,16]},{"title":"Rasen (1998): A very poor sequel.","rating":5,"date":"2 October 2013","review":"If you loved Ringu(1998), I suggest do not go for this movie. It will spoil all the entertainment you had on Ringu. Rather than terror and horror, this movie contain scientific views. Trying to explain everything with a proof. And which I believe has not succeeded. Also sex came into scene, in this movie which spoiled the horror effect.<br><br>This movie was from the author of book of \"Ringu\". But failed to interpret the novel completely. <br><br>Watch Ringu, Ringu2 and Ringu 0. After that if you still want to watch a Ring movie, watch Rasen. Before watch erase all theories you learned from other Ringu movies","user":"PentagonDark","rank":[6,6]}]