[{"title":"The Best Movie I've seen for a long long time","rating":10,"date":"6 December 1999","review":"I am surprised about the negative comments that some people made on this web-page.  I can see how some people might not experience the same kind of uplift or joy that most of us lived through when seeing the movie.  But that some viewers felt insulted and betrayed because the movie did not depict \"reality\" as it really was or is, is not fair.<br><br>I must concur with my fellow proponents of the movie -- it was a great and very satisfying movie.  It provided me with something that everyone in one or another shape or form needs -- Hope.  The movie showed the cruelty of life and yet managed to shed some light and insight into the beauty of love and life in general.<br><br>I urge anyone who has not seen La Vita è bella to go out there and watch it. If we all take with us just little bit of that hope and love that this movie is trying to convey; this world would be a much better place.<br><br>\nThank you for reading this and I hope you enjoyed or will enjoy the movie as much as I did.","user":"kvonarx","rank":[634,749]},{"title":"One of the best movies ever.","rating":9,"date":"29 August 2000","review":"This is one of those movies that have a lasting effect on you.   After watching it, I found that it has less to do with the Holocaust and more to do with the human feelings and the beautiful relationship of a father and his son.  The holocaust provides the ultimate context, that brings and highlights the story and adds yet another deep dimension to the movie.  No such piece of art has ever before combined laughter and tears of sadness in me before and that is the miracle of the movie.  The realism of the movie is not its strong point, but then again it is  not supposed to be; this helps in bringing the audiences to a state of mind away from reality, focusing on the feelings generated by forgetting about all external events and developments of the war.  Despite that, the movie does not fail to point out an element of the nazi psychology demonstrated by the doctor who was obsessed with riddles.  This portrayed the nazi 'state of mind' (if ever such an expression existed) as a sick mentally disturbed state.  Life is really beautiful as you watch Guido's relentless efforts to make a lovely exciting experience of the concentration camp to his son.  You get exhausted just watching him going through his painful day and yet you smile as he speaks to his son and makes him laugh.  One can go on forever  describing the creativity of this movie, but one will not be able to capture all its beauty in writing.","user":"amira_berzi","rank":[401,502]},{"title":"Courage Personified...10/10","rating":23,"date":"23 October 2004","review":"I can't understand how other reviewers see this as a film about the Nazis or the Holocaust. It's not!!! \"Life is Beautiful\" is a film about love, optimism, courage and inner strength.<br><br>To be honest I can't get this film out of my thoughts and decided to write this brief review in the hope that I could move on.<br><br>\"Life is Beautiful\" is an unforgettable film. You go through emotions you were surprised could have for a fictional film. The story, although totally implausible, is uplifting and depressing at the same time.<br><br>Please see it for yourself. Have a box of tissues handy.<br><br>Best film ever seen!!!","user":"Conservative-SNAG","rank":[456,579]}]