[{"title":"Very underrated movie, this is one of Dreamworks' best","rating":8,"date":"27 June 2011","review":"Antz is an animated movie that wasn't appreciated upon its initial release. After the family friendly movie Toy Story, I feel like people weren't ready for something a little bit darker, and more intense. This movie has death (and a lot of it at that), it has violence, it has gore, it has humor, it has swearing, and it has alcohol in it... pretty epic huh (granted, just being edgy doesn't necessarily equal good). The movie Antz which actually came out before A Bug's Life by about a month takes the role of what ants do a lot more seriously and better captures an ant like atmosphere. The movie A Bug's Life really doesn't seem to understand what ants do or how their colonies work, but the movie Antz does it all. There are the miners, the warriors, the drones (the ones with wings) the queen and others. The voice acting itself is also pretty good and Woody Allen fits the role of Z perfectly. The animation was also pretty advanced for its time, because it did many things that were hard for that time: Water, large amounts of moving objects, realistic face movement, realistic body movement, lighting, and many others.<br><br>The nice thing about this movie is that it doesn't pretend to be a kids movie. Ants swear in it (the word b****in is used once) and as mentioned there is a lot of violence. Like a very intense scene where the ants are trying to fight a termite colony and the ants are getting attacked by acid, are getting decapitated, and dying in other various barbaric ways. The thing is that this movie doesn't cover up death. When someone dies, the movie won't hide it.<br><br>The other cool thing in Antz is that the rest of the insects in the movie are as hideous and monstrous as they should be. Praying Mantis? It is infinitely larger than an Ant. Wasps? Like giants. It gives this overwhelming sense that Z is not only small in the ant world but also small in the insect world as well. There is nothing that can't kill him (even the princess could if she wanted).<br><br>Honestly this movie was really good, it has a good story, it has good characters, it is realistic, and has nice action. One of Dreamkworks' best.","user":"FairlyAnonymous","rank":[27,31]},{"title":"Watch this and enjoy it. Kids optional.","rating":17,"date":"17 February 1999","review":"The trouble with making a children's film has always been to keep the kids happy but avoid making Mum and Dad fall asleep. Disney have always stuck to a solid \"one cute song for every acidic aside\" ratio which meant that the over-15's got Robin Williams and Eddie Murphy doing a stripped down routine whilst the 10 year olds got pretty pictures, cute animals and plenty of slapstick. This is what has made the House of Mouse the dominant toon makers but their mastery is under attack from Dreamworks SKG. While Walt &amp; Co. delivered Mulan, Mr. Spielberg gave us Prince of Egypt and though Disney won, narrowly, the next round isn't going to be so easy.<br><br>Antz is brilliant. Don't let anybody tell you differently. We've got stunning visuals, great jokes, some brilliant scenes and some very likeable characters. What we have is a very smart film. Maybe too smart. The jokes are funny if you're old enough to get them. The sight of a neurotic ant lying on a therapist's leaf complaining about his anxious childhood is hilarious. Especially when the biggest neurotic in the world, Woody Allen, is delivering the lines. His timing, throughout the entire film, is exquisite and the script takes advantage of this at every opportunity i.e.:<br><br>Mandible: I like an ant that laughs in the face of death.<br><br>Z: Actually I stand behind Death and make belittling comments at its back.<br><br>It reads like one of Woody's early, funny films (sorry, but I couldn't resist it) and the rest of the cast are good too but that's because the script takes advantage of their history. Weaver acts like Stallone, Cutter acts like Walken and Barbatus acts like Glover. Anybody that's seen one of their films instantly recognises the voice behind the ant because of how they speak and act. They also bypass the sing-along route and insert a grisly battle sequence similar to Starship Troopers. The adults in the audience will love it. Children may be a little underwhelmed.<br><br>How many kids have seen an Allen, Stallone or Walken film? Not many I expect. How many kids have seen Troopers or Metropolis, (which is a big inspiration for the visuals)? Very few. There are a lot of jokes they just won't get. They may enjoy the pretty pictures but there's a distinct lack of cuddly animals, obvious slapstick or happy tunes. Boredom may set in and there may be a few cries during the battle sequence so be ready. Another downside is a slightly weak villain. Hackman does well with what he has but it's not much and truly cool bad guys like James Woods' Hades run circles round him.<br><br>Despite that Antz is a blast. As funny and enjoyable for adults as a child-orientated flick could be. It's not the best toon but it's a definite step forward. Maybe Disney have finally met their match.","user":"Motoko","rank":[48,60]},{"title":"so lifelike, so didactic","rating":8,"date":"18 December 1998","review":"It's probably the first time Woody Allen is so much like himself when he isn't at all. Ant Z, a neurotic, fatalistic, depressive, sorry ant with a record low level of self-esteem transforms into a (part-time) content, revolutionary hero of his utterly totalitarian and fascistic colony ever imaginable. Apart from the incredibly precise animation and \"logical\" fantasy, one feels a bit distracted with the subliminal messages the picture tries to impose. While it would be easy to reduce the moral to the frequently recited motto: \"think for yourself once!\", there are too many of them to ignore. This definitely is not a kid's flick, it is meant for and appreciated by adults, with many philosophical, psychological and social references and conflicts. One big \"bravo!\" to Dreamworks. I think they have achieved the point where adults can actually enjoy animation movies while believing the whole stuff. These insects are surely going to bite some Disney bugs.","user":"leandros","rank":[33,44]}]