[{"title":"\"Witchboard 2: The Devil's Doorway\"- 8/10. Not scary but entertaining nonetheless.","rating":11,"date":"11 February 2004","review":"Witchboard 2<br><br>This movie has plenty of entertainment stuffed into it's 90 minute running time, but it isn't too scary. Witchboard 2 is about Paige, who moves into an artist loft apartment after leaving her boyfriend. While moving in, she finds a Oujia board inside a closet, and just for fun, begins to play around with it. But you can't play with a Witchboard as Paige soon learns, when she contacts the spirit who claims to be a former tennant of the apartment complex who was murdered. Then, people in the complex begin dying in weird ways, and Paige must uncover the spirit's true identity before it destroys her.<br><br>The actors here aren't too bad, and Laraine Newman is hilarious as the eccentric landlord. This film has some 'jump' sequences that jolt you, but no real horror to scare you with. The movie also has a good mystery to it. Good for horror fans, and not cheesy at all. Don't expect a super-cheapy movie, it isn't that bad. 8/10.","user":"movies2u","rank":[11,12]},{"title":"I love this movie!","rating":10,"date":"2 October 2006","review":"This movie is wonderful, I saw it when it first came out on video, and I was 10 years old. My grandmother just could not understand why I liked horror movies, especially how young I was, but that is just with my genre.I love all sorts of horror movies, and this one is rated on my top list! I agree with the first person who wrote comments. But if I could I would score it much higher than a 13! I would give it a 20, but I love that kind of movie, I suppose that it all just depends on your taste. I have seen all of the witchboard movies, and anything and everything about the Craft and Ouija boards, and trust me, this movie is tons of fun! Enjoy!","user":"princessaalayna","rank":[5,5]},{"title":"This movie rocks!!!!","rating":29,"date":"29 April 2001","review":"This is surely the best of the Witchboard trilogy.  Ami Dolenz is a hotty and played a good role.  John Gatins from \"Leprechaun 3\" starred in this movie.  For his first movie he did a great job.  I loved the story line and how the whole movie just blew me away.  No it isn't the best ghost movie ever made but it is sure one of them.  But overall the movie is great, if you see it rent it.  Be sure not to miss the basement scene.  I gave this movie over a 10.  I say about a 13.","user":"demonictoys55","rank":[5,6]}]