[{"title":"While the best of the sequels, it doesn't come close to the superb quality of the original.","rating":6,"date":"23 June 2009","review":"First of all, I do think it is an improvement on Land Before Time 2, which was passable, but lacked heart, which was what made the original so poignant. The Time of the Great Giving is probably the best of the countless sequels that border from good to unwatchable, but suffers from being too preachy at times. The animation is surprisingly good, but isn't quite true to the style of animation in the original. In most scenes it had some lovely colours, but had some flat backgrounds in others. The incidental music by Michael Tavera was excellent, especially the Firebird-like music in the fire scene. It was nice to hear the heart-rending main theme from the original, but whereas in the original it made me weep buckets, it didn't have an effect on me here. The songs are okay, Kids Like Us being the best one, and Littlefoot's singing voice is for once pretty decent, but the other two songs When You're Big and When You're Standing Tough came across as rather unmelodious. The story is a very nice idea, about the values of friendship, survival and sticking together. There is also some nice dialogue, but the film further suffers from being too short and being devoid of any real emotion. I will say that the voice talents were very impressive. Ducky is still funny, with similar dialogue we associate her with from the original, though it doesn't quite feel the same without the sweetness and vulnerability of the original voice actress, the late Judith Barsi. Scott McAfee is decent as Littlefoot, and I liked Linda Gary and Kenneth Mars as the grandparents. However, in correlation to the original, John Ingle's narration, as nice as it was, was somewhat unnecessary, but I was more impressed with his gruff characterisation of Cera's father. All in all, a surprisingly good sequel, though it doesn't surpass the first and the finest. 6/10 Bethany Cox.","user":"TheLittleSongbird","rank":[7,8]},{"title":"A great addition to The Land Before Time canon","rating":8,"date":"24 July 2013","review":"Winning Best Home Video Presentation of the 1995 Annies, \"The Time of the Great Giving\" is the third installment of the Land Before Time series. For some reason, it was originally supposed to be #4, but was pushed forward one year. Maybe Roy Allen Smith just wanted to save best for last. One way or another, this is still a great addition to the franchise.<br><br>The film begins in a similar way to the opening of the first movie, with the same sweeping score and the same calm note, underwater. The animation's cool wavy effects and the silent ancient creatures give a great feel for the setting to those who are starting the series with this installment.<br><br>In the Great Valley, Littlefoot, Cera, Petrie, Ducky, and Spike have constantly been getting bullied by a trio of adolescent dinosaurs: a hypsilophodon named Hyp, a nodosaurus named Nod, and a muttaburrasaurus named Mutt.<br><br>So on this evening, a meteor shower impacts near the Great Valley and causes an explosion in the Mysterious Beyond. Fortunately, no one is injured severely. But the next day, the Great Valley dinosaurs wake up to find the Thundering Falls, their main supply of water, drying up. The increasing lack of water causes conflicts between the adults. Considering his species the wisest (even singing a whole song about it), Cera's dad is insistent that he make the drinking arrangements. He becomes so conceited that he gets unreasonable. In fact, he accuses Littlefoot of wasting water when he gets sprayed by a splash caused by the bullies, who hightail it out of there to not be noticed. Despite the fact that the gang had no knowledge of the water problem, Cera's dad cites Littlefoot as a bad influence and forbids Cera to be around him. To bring an end to all the bickering, Cera sneaks out with the others to set out on a water hunt of their own.<br><br>One of the most graphically stunning sequences in the movie, the animation of this wildfire fire that spreads through the Great Valley is dazzling and the score is appropriately alarming for the situation, sounding much like that of the Firebird stage from Fantasia 2000.<br><br>\"Kids Like Us\", is the best song in the movie. While the other two have great instrumentals, their lyrics aren't very top notch. This one is very meaningful, if somewhat preachy, and hopefully will show children how to deal with bullying.<br><br>The only real issue with this movie is that it kind of makes it seem like children are always the ones with the solution to a problem while the adults are just helpless and argumentative. This movie could have benefited more by encouraging children to always seek adults' help. Even so, it's better than \"The Great Valley Adventure\", as it deals with the grown ups as much as the kids, and it offers great messages for both children and parents of cooperation and preventing bullying.<br><br>The storyline, though formulaic, is pretty well-developed, and though the kids' dialogue is juvenile, that isn't so much a bad thing when working with characters who are still very young. Kids will be kids. The action scenes are sufficiently entertaining, the animation is outstanding, and Michael Tavera's score is most beautiful here, making for a fine addition to the Land Before Time canon.<br><br>8/10 for \"The Land Before Time III: The Time of the Great Giving\".","user":"popp-culture","rank":[4,4]},{"title":"Preachy but fun","rating":5,"date":"11 June 2001","review":"This film's main fault is that the share and care theme is laid on rather thick. When the Valley's water supply is blocked, our young heroes search for a new source. They are hindered by a trio of bullies and a pack of hungry raptors, as well as the unreasonableness of parents. The songs are okay, if forgettable. The raptors are well worth seeing. In spite of the preachy tone of some dialogue and narration, regular fans will not be disappointed.","user":"Cylex","rank":[6,7]}]