[{"title":"Fairly authentic and very much like Fort Polk in the early 70s.","rating":9,"date":"29 July 2007","review":"While it was filmed at a Florida National Guard site, \"Tigerland\" totally reminded me of Fort Polk, LA., firing ranges, maneuver areas, waist-deep water and all. The movie was fairly authentic and the characters similar to those same ones at my AIT in 1974. The difference between the Tigerland year, 1971, and mine of 1974 is all the drill sergeants and instructors knew they weren't going back to Vietnam, as it was pretty much all over, so training was very relaxed - not a challenge at all. That was the precursor to all our troubles in the 70s and 80s, which I know for a fact as I stayed in until 2004. I never heard anyone mention \"Tigerland\" but the Army did have realistic Vietnam training villages at different bases across the U.S. Vietnam Vets tell me that up to 1972 Basic &amp; AIT could be pretty rough and rugged, because the trainers had been there and were mandated to train Vietnam-bound men those skills to make it, although that was not always the case. Both a drill sergeant at Polk and later one of my Vietnam Vet NCOs, when we had become instructors at a basic training brigade at Fort Bliss, told me there was nothing they could do to get anyone ready and people just had to find out and figure out for themselves. This movie rates high.","user":"mbbilbo","rank":[38,40]},{"title":"Rebel With A Cause","rating":8,"date":"21 January 2010","review":"American military authority is the enemy for Pvt. Roland Bozz (Colin Farrell), a nonconformist trainee who, along with other infantry trainees, endures brutal, sadistic treatment in preparation for combat in Vietnam. Tigerland is a swampy, steamy camp near Fort Polk, Louisiana that is supposed to simulate conditions in Vietnam. The story is set in 1971.<br><br>The amount and severity of physical and verbal aggression displayed in this film may be a tad overstated. But the point the film is making is that many, if not most, of the young guys drafted into the army in the late 60s and early 70s absolutely did not want, or deserve, to be there.<br><br>Roland Bozz is one of those young men. He's angry at the war, angry at the army. The army won't release him because they know that's what he wants. If Bozz can't get himself out, the next best thing is to try and get other recruits out. That will be his revenge, his way to fight the system.<br><br>A fellow trainee shares his background with Bozz, who then tells the trainee: \"I know army regulations the way prisoners know the law. You're a hardship discharge, man, if ever I saw one. Okay. I'll get you out of the army\". Bravo for Roland Bozz, a young rebel with a mission, a cause, trapped like the others by an oppressive, controlling institution.<br><br>Acting is very, very good. Colin Farrell is terrific, at a time when he, and the rest of the cast, was largely unknown. No need for overpaid A-list actors. The film's acting style trends naturalistic, spontaneous, and emotionally intense. None of the acting seems forced.<br><br>With a hand-held camera, combined with grainy film stock, and using quick zooms and unexpected cuts, the cinematography and editing convey a documentary look and feel, which results in sequences that are quite realistic. Lighting is mostly natural. Sets are plain and unadorned. Background music is minimal.<br><br>Much better than I ever expected, \"Tigerland\" is a well-made film with an intense, anti-war theme. It's about putting others ahead of one's own selfish interest. That Hollywood largely shunned this low-budget film is all the more reason to see it.","user":"Lechuguilla","rank":[24,26]},{"title":"Not exactly original but an engaging drama based on real life experience, gritty atmosphere and some good performances","rating":13,"date":"13 March 2004","review":"Tiger Land is a tough training camp for the US military.  In 1971 it is the final step before the squads go to the war in Vietnam.  In training before Tiger Land, one squad of young men is joined by troublemaker Roland Bozz, who continues his military trend of dissention and insubordination. However, his actions do not just affect him and he starts to change his ways slightly, but the stresses and the potential for death in Vietnam push all the men to breaking point.<br><br>Sold as a war movie, this film is more like the first half of Full Metal Jacket than a full on war movie set in a combat zone.  As such it plays more like a drama than any sort of antiwar movie or outright thriller.  The focus of the film is the character of Bozz as told from the biographical point of view of Paxton.  The events of the film are pretty predictable for anyone who has seen this type of film before - the internal fights, the crazy soldiers, the domineering sergeant majors etc.  However it still manages to be enjoyable and entertaining even if it never really feels original or new. It is a pretty nondescript film with no specific edge on it - and that is part of the reason I think it really didn't do that good business when it was released here in the UK.  It relies very heavily on the characters to keep the audience involved in the story and preventing it being seen as just a collection of old ideas; this aspect is helped by the fact that it is drawing on original material, experiences and people.<br><br>A much bigger part of the characters being engaging is the playing of them by the cast.  Farrell is the lead actor and is miles ahead of everyone else. This film is one of many that made him the star he now is, and he does deserve it off the back of this and he is really good here - coming across as likeable and difficult.  Outside of him, everyone plays well but are generally in their various stereotypes; aside from Farrell, Collins is the standout role - too often seen playing gang bangers and such on TV cops shows, he delivers a solid character and presents a believable breakdown over the course of the film.<br><br>Keeping my habit of never paying to see an Schumacher film since Batman &amp; Robin took the last faith in his talent, I waited for this to come onto TV. I was surprised however to see that Schumacher managed to do the film without spoiling it - in fact he came across as rather able!  He uses mainly handheld cameras and delivers a gritty feel to the whole film that is fitting to the material.  I hate to admit it, but he actually did a reasonable job here and he has now done a couple of films that he hasn't ruined in one way or another!  I may have to change my mind about not paying for his films - well, maybe not.<br><br>Overall this is a rather undistinguished film but one that is enjoyable as a character driven drama, trading on the usual clichés of the genre.  It goes where you more or less expect it to but it goes there and takes you with it. Farrell makes a good leading man and on this evidence he is worthy of leading man status where he has good support.","user":"bob the moo","rank":[37,44]}]