[{"title":"Totally unexpected, this was a great movie!","rating":9,"date":"5 May 2008","review":"Don't believe the negative reviews on this one. Its easily the most underrated movie I have come across, and can best be described as a hidden gem for the ones who like historical adventure/action-movies (Braveheart/Gladiator/Kingdom of Heaven/Robin Hood) and fantasy-movies. <br><br>Others have described it better here on IMDb, so I am just going to say this: It is not a historical correct piece, and do not try to be. It should be viewed as a fantasy, even though the vikings portrayed and their buildings/settlement is the most realistic I have seen in any movie to date.<br><br>Btw: To all you who like the above-mentioned movies for the big battle-scenes and sword-fighting, don't expect this one to have its major impact in that area (even though it got them). On the other hand this movie portrays a much more realistic take on fighting in pre-medieval times. Instead of having the one super-hero defying all logic, you get a band of fighting comrades which together becomes a fierce force. There is a fantastic cast in this movie, with Banderas, Storhøi and Kulich making their characters come truly alive.<br><br>This is a great adventure of a movie, which should be regarded alongside the other movies I mentioned above.<br><br>9/10 - Must see for all who like adventure/fantasy","user":"rklok","rank":[95,100]},{"title":"Good enough for what it is, fascinating for what it could have been.","rating":8,"date":"8 February 2006","review":"This is an extremely well crafted film, but a poorly edited one. Much like The Ghost and the Darkness it has such a winning historical concept that it is easy to forgive a little narrative incoherency from time to time. This film is a bit muddled when it comes to plot and characterization but hits all the right notes in terms of creating an adventurous spirit and thrilling action sequences. Jerry Goldsmith's score is a real high point, as is the cinematography. This is an absolutely wonderful film to get all caught up in on a lonely night because it makes you feel as if you are on the journey with Banderas' character. It is an action thriller that is actually...thrilling. In particular the scene with the \"fire dragon\" is one of the more memorable battle sequences I have seen in any movie, and I really mean that. The only negative aspects of the film are the feeling that a lot of scenes were left on the editing room floor, which is true, and if there was ever a film that really deserved a director's cut this is certainly one of them so long as Jerry Goldsmith's music (the soul of the picture) remains in. (Greame Revell composed a score for the unreleased longer version, which I have heard and in no way compares to Goldsmith's thunderous adventure music). The lavish costumes, set designs, memorable characters, and brilliant camera work somehow allow this film to overcome its editorial handicaps. All being said, this is a film well worth watching.","user":"LordBlacklist","rank":[128,141]},{"title":"I loved this movie!","rating":19,"date":"19 April 2000","review":"Action! Adventure! Incredible scenery and cinematography!  But best of all a wonderfully powerful cast!  As the deep and thoughtful chieftain Buliwyf, Vladimir Kulich was splendid.  He played his part with dignity, power and intelligence.  Another stand-out performance was that of Dennis Storhoi who played Herger the Joyous.  Perfect timing and temperament.  Really fun to watch.  Antonio Banderas as the narrator of the piece and, incidentally, the 13th warrior was also fun to watch.  He has a knack for humor and uses it well.  The whole ensemble cast was a joy to watch as they moved through-out the film as a team of men who valued each others strengths and talents.<br><br>\nThe camera work in this film is dangerous and thrilling.  Our perspective is intimate and that lends a great deal of excitement to the movie experience. Thank you Mr. Menzes!<br><br>The 13th Warrior is for anyone who believes in honor, valor and courage. Also, for anyone who likes Vikings, horses, battles, blood and gore or men. Women who like men will like this movie!","user":"pharalinga","rank":[203,243]}]