[{"title":"\"Cheek chillers. You likes?\"","rating":7,"date":"12 December 2006","review":"Despite myself, I really kinda like this movie. Pauley Shore is invariably laugh-out-loud funny, and here is no exception. He is just excellent at playing the weirdo with a heart of gold.<br><br>His performance in this, although nothing out of the ordinary for him, is so good, it seems to lift other cast members' performances. Perhaps this is because he's the kind of guy it's easy to bounce off of.<br><br>The clichés about country life in this movie are hilarious and the way Shore's \"city boy\", Crawl is so at odds with the way of life, is funny too, but it's not only he who's a fish out of water; comedy also comes from the fact, that to any \"ordinary\" person or people, Crawl is a freakish nightmare of a person. That's why this movie works in such a great way: we love Crawl, he's a breath of fresh air, but we can also sympathise with the Warners. He is one hell of a culture shock.<br><br>Although this movie is classic Pauley Shore, so there's no great brain power needed to enjoy the movie, enjoy it you do, and there's even a \"never judge a book by it's cover\" type moral here somewhere. Not bad, not bad at all.","user":"john-mitchell77","rank":[9,10]},{"title":"Green Acres Goes Grunge","rating":31,"date":"31 December 2003","review":"People rag on Pauley Shore for being a bad actor. On the contrary, he wasn't an actor at all, but a swell entertainer. You could stick him in a dumb situation and he could just jump in, act naturally, and have a whole lot of fun doing lots of stupid things. That's what makes his movies so damned funny.<br><br>The story isn't anything new. A city boy is planted in a rural South Dakota farm town. He's an outcast at first (and likewise they're alien to him), but eventually they mesh and he rubs off a bit on them and vice versa. But, here, Pauley (as Crawl) follows his college friend to her home in the boonies for Thanksgiving break. Trying to avoid her boyfriend who just insists on getting married, she comes up with some story that they're actually engaged. Her parents are blown away by it because obviously they'd rather see her settle down with the townie than with the very strange Crawl. In the end, everything works out fine, obviously. <br><br>The actors are swell. I particularly enjoyed Patrick Renna as the once-obnoxious little brother with a rad sense of humor. And of course, Pauley Shore was good at what he does: making people laugh.<br><br>\nThumbs up.","user":"vertigo_14","rank":[14,17]},{"title":"It will keep you laughing!","rating":10,"date":"4 September 2005","review":"One of our all time family favorites. When we need a laugh...we just put this one in and laugh all way thru like it is the first time we've seen it. This film has good, clean family humor. Pauly Shore is brilliant! With no plans for the thanksgiving holiday, Crawl (Shore) is invited to spend the holiday with a conservative coed, Becca. Crawl, being a big city boy, must adjust to the farm life if he is to fall in love with Becca. But, Crawl isn't the only one who is learning new things. Crawl teaches Becca and her parents how to be more open about their feelings and accepting others. This is fun for viewers of all ages.","user":"deidrevest","rank":[10,12]}]