[{"title":"Silly but Fun","rating":8,"date":"9 July 2002","review":"The Duke is a very silly film--a dog becoming a duke! But it's a very fun movie. It has some of those corny pranks that many kids movies have, but (thankfully!) no bodily function jokes, as so many animal movies feel compelled to have! Mostly, it's just dogs being dogs and people being. . . well, people. The 'good guys' are likeable and appealing. The 'bad guys' are ridiculous, and of course, the pun of many jokes. But there is something dignified about this movie, for even though it is silly, it's not out for every cheap laugh like \"Home Alone\" and others.<br><br>Crocket, Simon and Copper do an excellent job playing Black and Tan Coonhound \"Hubert\" who becomes the Duke after his beloved owner, a real Duke, dies. For the most part, they just act like dogs, no 'talking,' or human-like emotions and attitudes. However, they do stereotype poodles, and Hubert does fall for her, just because she's a poodle. Come on! These are dogs--they have a different view of beauty!!!<br><br>Overall, charming, fun and enjoyable.","user":"remobec","rank":[12,15]},{"title":"A little on the corny side, but endearing...","rating":16,"date":"16 February 2001","review":"In case anyone was wondering what kind of dog Hubert is, he is a Black &amp; Tan Coonhound; the only one of six subspecies of coonhound recognized by the American Kennel Club.  Although they were bred to hunt racoons, they are also used for hunting bear and cougar.  They have a sweet disposition and make excellent family pets.","user":"IRD","rank":[8,11]},{"title":"Not recommended for mature movie fans","rating":4,"date":"13 July 2008","review":"\"The Duke\" is a film based in the heart of the British aristocracy where an old Duke (John Neville) dies and to avoid his large property and the vast riches to be taken from him after death by 2 devious aristocrats (Oliver Muirhead and Sophie Heyman); he passes his Dukeship down to his dog. The dog's \"best friend\", an American girl named Charlotte (played by Courtnee Draper) whose parents die becomes orphaned by the former Duke due to him being her great uncle. A young chef named Florian arrives, with him and Charlotte instantly connecting creating a romantic sub-plot which in its own way, acts as the under tone for the main plot line being the activities of Hubert, The 'Duke' and his many activities and love interests with other dogs. All this is watched over by James Doohan who plays a Butler who is determined to try and serve his old Duke by doing his best to serve his new master, Hubert. Doohan acts as the older character there to comfort and advise the younger ones whilst he over looks and performs various ridiculous tasks under his new master. A fine comedic performance mixed with elements of drama to end the career of a fine and influential actor.<br><br>Though from the technical viewpoint, I dislike this film as I only watched upon discovering James Doohan's role. Though the plot is good, elements of the writing and directing have to be obscured. Ignoring the absurdity of a \"Doggie Duke\", I personally dislike the over use of comedic and outrageous jokes upon the 'bad' characters due to their ludicrousness. The dependence on hygiene related humour as you like is much too apparent and general silliness of many characters doesn't appeal to me. The director, Phillip Spink uses mid-long shots too often with either an overdubbed voice or affecting the overall sound quality. Plus, the acting of Muirhead and Heyman, whilst good at the dramatic and romantic sequences, fall drastically short fulfilling the wholesale requirements regarding the role.<br><br>But, as a mature movie fan, I find it easy to be over critical of a simple family film designed to make you laugh. I can admit I found certain bits funny and other bits touching along with a plot that may be far-fetched, but has definite connections. I do not recommend this film to mature movie fans but I do highly recommend it to Dog lovers, families who wish to enjoy a funny film for their child and James Doohan fans who wish to see 'Scotty' in his final role.","user":"PrivateBits","rank":[6,8]}]