[{"title":"Whoever tells the best story wins","rating":8,"date":"4 May 2006","review":"Amistad is a very well crafted, well acted, and well told story. It is also mostly true to the history of events surrounding the Amistad 'mutiny', and the defense of the Africans responsible for it by John Quincy Adams and a young lawyer named Baldwin. I put the word mutiny in quotes because it is absurd to think of people fighting against murder, enslavement and rape as any form of crime. The film is unabashed about showing us the brutality and outrageousness of the covertly institutionalized slave trade that haunted one of America's darkest, most retrograde periods, and pulls no punches about the cultural differences between its victims, its culprits, and those who felt that it was not their problem.<br><br>Amistad ranks as one of McConaughey's finest performances, perhaps his best. But nearly the entire cast is blown off the screen by the passionate, sensitive and profound performance of Djimon Hounsou. Hopkins is good as Adams, but what else is new? Though the film does not have a literary feel - it is pure cinema - it is a truly great story featuring bold characters and a deep and simple emotionality which draws its audience in. Alistad has a spirit that can only be described as truthfulness. <br><br>Despite his detractors, Spielburg proves again and again that morally decent films with positive messages can be entertaining and artfully crafted.<br><br>Highly recommended.","user":"mstomaso","rank":[58,65]},{"title":"The glossy horrors of Amistad","rating":7,"date":"24 July 2018","review":"Beautifully told, it also made me go back to History books to double check or to confirm. That's what good movies also do, they provoke you into wanting to know more. I loved Djimon Hounsou - a sensational film presence and his soulfulness permeates the whole journey. Anthony Hopkins is a remarkable John Quincy Adams. The great Steven Spielberg doesn't shy away from the horrors and some of it is truly harrowing but even then the preciousness of the image protects you from excesses. I don't know if that is a flaw or just a grand commercial concession. I couldn't help trying to imagine, this story even the same script in the hands of an Arthur Penn for instance. After all of that, let me say I enjoyed it, I was moved and I will see it again.","user":"excalibur107","rank":[27,30]},{"title":"The most un-Spielberg film of his oeuvre.","rating":10,"date":"22 April 2003","review":"Dismissed on its release as a dry civics lesson or as \"Schindler's List with slaves\", which is a shame, because there is so much intricate stuff going on here that fans of Spielberg and his normally in-your-face approach might not grasp the moral ambiguity and more subtle touches that roam beneath the surface. In a year dominated by Titanic this was publicly dismissed as too serious or arty...<br><br>Why is it un-Spielberg? Ponderous pacing replaces storytelling fluidity and speed, his normally active camera is replaced by more painterly compositions.. Instead of having stuff jump at you, you have to search for it or feel it without truly realizing it: touches of genius are very present, but differ from the original style (like the brutal insurrection scenes, cargo dumping scene, etc).<br><br>The story itself focuses on a mutiny aboard a transatlantic slave ship, led by Cinque. The ship is intercepted by the American navy and a messy trial ensues to see who has rights regarding the cargo, Spain, America... or are the slaves not \"legal\" slaves after all? Cue abolitionists hiring young property lawyer Baldwin. These events, based on facts, occur before the Civil War.<br><br>I can feel people sighing from here. \"Oh, no: not a courtroom drama...\". Labelling it as such would be missing the point by a mile. It is so much about context and moral ambiguity, and ultimately the tragic ridicule of the situation. Amistad is also a technical marvel. Janusz Kaminski's (SPR, Schindler's List, AI, Minority Report...) photography is superb, a dark study in sepia browns. The acting is magnificent, mainly two amazing performances. One by Anthony Hopkins as former president John Quincy Adams (an unusual turn for him, where he really soars), and the other by Djimon Hounsou (later cast as Juba in Gladiator) as Cinque being the true gem.<br><br>Ultimately, Amistad's greatest strength is that it avoids offering any easy answers and in that sense, does to subconscious issues about race and slavery what Kubrick's 2001 did to space travel and progress, albeit with more humanity and more accessible drama. It's a shame this film is never talked about.","user":"OttoVonB","rank":[84,103]}]