[{"title":"Bean","rating":7,"date":"21 February 2020","review":"When they let Bean be Bean, it's entertaining, because Rowan Atkinson is one of those performers that can't NOT be funny, no matter what he's doing. He's always good for a laugh, even if the film isn't so great. Not the ideal vehicle for showcasing his talents, but it has enough funny moments to overcome the weaknesses.","user":"MR_Heraclius","rank":[37,38]},{"title":"You won't be able to stop laughing","rating":8,"date":"8 August 2003","review":"Mr. Bean (Rowan Atkinson) is a London museum guard who is about to be fired by middle management.  The big boss, however, won't hear of it; instead, he sends Mr. Bean to America.  Once there, Mr. Bean is to pose as an art critic and give a rousing speech about Whistler's mother for a California art museum. Well, the museum director picks Mr. Bean up at the airport and pandemonium is the name of the game after that.  Mr. Bean upsets the director's household, creates havoc at a local amusement park, blows up dinner and more.  On top of that, he rarely speaks so everyone is certain he is an idiot.  Can this man transform himself into an art critic and will he be able to present a speech on the museum's big day?<br><br>This movie is just flat-out fun.  Although he has very little dialogue, Mr. Bean's expressions and antics are priceless.  The supporting cast does a reasonably good job but Mr. Bean towers over everybody.  This movie should be required viewing for anyone in a depressed state of mind; it can lift the spirits of even the saddest beings on earth.  Recommended for a fine family evening of giggles and leg-slapping.","user":"inkblot11","rank":[70,85]},{"title":"Highly Underrated Classic","rating":3,"date":"3 May 2003","review":"For those of you who loved watching Mr Bean, this movie doesn't fail to disappoint you. I saw this last night and laughed my head off, in fact, I think I was laughing more than when I was seeing Johnny English(also starring Atkinson).<br><br>For those who really love the TV series, a few of the gags have been redone, including the vomit bag joke, the turkey head and the fast ride (the latter is so damn funny).<br><br>So if you love Rowan Atkinson or love Mr Bean, go see this film!","user":"Darth_Homer","rank":[61,78]}]