[{"title":"Good psychological drama","rating":9,"date":"20 July 1999","review":"I've heard people who say this movie is dull dull dull. I don't think they were watching the right movie. This isn't the prototypical action movie, thank God.<br><br>This is a psychological drama about the rookie and his mentor that just happens to be about killing people. In this way it works extremely well, with terrific performances from Berenger and Zane (who doesn't sleepwalk through the movie like he has in other roles - he actually looks like he's acting).<br><br>I was disappointed with the action towards the end - a lot of it didn't make much sense and was unsatisfying given the buildup from the rest of the movie. But watch Zane's face as he panics, alone, while Berenger does the dirty work.","user":"stills-6","rank":[37,47]},{"title":"Shoot to kill","rating":7,"date":"14 November 2005","review":"Despite some negative comments this film has garnered in the IMDb pages, it's still worth a look as this is a story about survival and camaraderie between two different men with different mentalities while in a difficult mission in the Panamanian jungle.<br><br>Peruvian director Luis Llosa takes us along to watch this thriller set in Panama. The film has some good moments as Beckett, the veteran marine, takes a newly arrived man, recently sent to try to eliminate a notorious drug cartel head and the corrupt army general who might be the next president of the country. The only problem, Miller, has no experience in what he has been entrusted to achieve.<br><br>Miller, the arrogant newly arrived man to the jungle and to the guerrilla warfare between the military and drug lords against the infiltrated American intelligence men, learns a valuable lesson from Beckett. What looks good in theory, is irrelevant in the jungle.<br><br>Tom Berenger, is an actor who doesn't register much, as he proves in this movie, but in the context of the movie, he is right as a man of a few words. Billy Zane playing Miller does what he can with a role that doesn't afford him any glory until the crucial end.<br><br>For lovers of action film, \"Sniper\" offers an 112 minutes of action that with a bit of trimming would have made a more satisfying movie.","user":"jotix100","rank":[26,33]},{"title":"Nice idea, shame about the ending.","rating":6,"date":"29 October 2001","review":"Though the plot may be familiar (mistrustful pair teamed together to go on a dangerous assignment), the premise of having two snipers as the protagonists is interesting. The film builds on this by offering an insight into the psychological effects of this kind of warfare, but ultimately this degenerates into a yarn. One with a particularly limp ending at that.<br><br>Berenger is convincing in his portrayal of a hardened, veteran sniper, completely impassive in what he does. Zane, however, doesn't really pull off his role as an Olympic medal winning shooter who has to face his first live kill. The pairing never truly gels, which is a shame as it's their relationship that's important over the actual plot.<br><br>The film looks great, largely set deep in the Panamanian jungle. There are some exciting moments, cool camera tricks and even some genuine tension. It's just a pity it didn't hold together better.","user":"Mike Astill","rank":[34,45]}]