[{"title":"Masterpiece!","rating":10,"date":"23 October 2003","review":"I've been a Miike fan for quite some time, and truly love his wild and crazy approach to film making. But this movie proves that he can also do serious films, and better than many serious directors. It is part 2 of his Triad society trilogy, and once again his themes of outsiders and innocence vs. violence is very obvious. The story is about a japanese hitman (beautifully down-played by Sho Aikawa) who has immigrated to taiwan. At the beginning a woman shows up at his doorstep and leaves a boy, whom she claims is his. The hitman doesn't really acknowledge the boy, and simply goes about his business (which mainly consists of killing people). But the boy follows him everywhere, and when the hitman later develops a sort of relationship with a prostitute, the three slowly grows closer, and become like a sort of family. The movie is very melancholic and has a tremendously moving atmosphere. It is completely rinsed of the usual Miike insanity and it actually works really well. It reminded me very much of Jarmusch, right down to the Neil Young-like slide guitar that makes up the soundtrack. If you've only seen his \"crazy\"-films you should really give this one a chance, since it really proves what an absolutely brilliant director this man is. \"Rainy Dog\" is with out doubt a masterpiece in modern cinema, and is even more impressive coming from the hands of the guy who brought us Ichi the Killer, Fudoh, Happiness of the Katakuris etc. etc. Takashi Miike continues to impress!<br><br>10/10","user":"jtourbro","rank":[18,19]},{"title":"Miike goes noir","rating":8,"date":"7 December 2005","review":"Miike strays off the beaten path to do his own take on 'film-noir' (a tribute to Melville?): limited dialog, moody settings, and deliberately slow development all make for a unique movie in Miike's immense filmography. <br><br>As surprising for its subtlety, pace, and precision as for its lack of the standard Miike moments, it is definitely not the director's best (for that see \"The Bird People of China\", \"Ichi the Killer\" or \"Gozu\"), but a great movie for a rainy Sunday afternoon, naturally if you don't mind the occasional yakuza violence.<br><br>Could be read as the director's attempt at a character study (usually absent from his work) or an exercise in cinematic economy - in either case it is a movie well-above mediocrity, yet not quite reaching the level of masterpiece.","user":"djores","rank":[8,8]},{"title":"Was it the Everly Brothers who were crying in the rain?","rating":9,"date":"2 June 2004","review":"Rainy Dog, part of Miike's Triad Society is a truly beautiful film. A lot of people are going to notice, and quite rightly, that it does not conform to the traditional Miike template. Instead it moves at a slow pace with long lingering shots of the rainy streets of Taipei. The action is restrained to only a few brief gun \"battles\" and a stabbing, but the film is not about violence. It is about the aftermath of violence. As one character says towards the end, it is about life, death and hate. There are no opportunities to glorify the violence and every murder carries with it intense and very real consequences.<br><br>The sound track flitters between Shinjuku Triad style electronic drum effects and keyboards and country style slide guitar which really hints at the films Western roots. Essentially it is a film about an outsider used to fending for himself who is forced to care about another person and in doing so realize the value of his own life. This is not a new format and is a storyline you can find in variation in many John Wayne movies, the difference here is that I bet you won't be expecting it in a film by the man who brought the world Fudoh or Ichi the Killer. <br><br>Before his turn in Dead or Alive, Sho Aikawa turns up here as ultra cool ex-Yakuza, Yuuji, who has retired to the back alleys of Taipei to earn money as a hit-man. Early on in the film a young child is left in his house by an unknown woman. At the heart of the film, and it is a genuine heart, is the relationship between Aikawa's character and his supposed son. Without wanting to give anything anyway, it is the developments between the two which make the final scene one of the most tense scenes I have seen in film for a long time. Rarely is an audience allowed to sympathies and care for characters in a film like Rainy Dog yet it is as if Miike deliberately wants to alter our expectations. It is through caring about the characters that you realize you want them to live happily ever after.<br><br>Tomorowo Taguchi, returning from his role as the psychotic Wang in Shinjuku Triad Society has a minor but important role in Rainy Dog. His obsessive pursuit of Sho Aikawa which we see has destroyed his life mirrors intelligently Aikawa's character who is also letting his obsessions drive him to ruin. Taguchi I consider to be one of the best Japanese actors in the last decade, he is certainly one of the most prolific, and here his meagre five or six scenes are infused with an energy which helps motivate the rest of the film. I am looking forward to the next film I see with him in.<br><br>I believe that Miike had to produce this film with a largely non-Japanese crew, it is a testament to his bravery as a film maker (I dare say few directors would risk such a venture) that Rainy Dog looks and feels as it does. There are a few moments when the sound does not quite match the action (check out Aikawa beating up Taguchi early in the film for some of the most bizarre punching sound effects) but the film as a whole does not suffer. I do not know whether it was a lack of Japanese crew and skills that led Miike to make a slower movie, if so, his ability to compensate is second-to none. Instead of trying to make viewers vomit (no sick bags dispensed at viewings of this film) Miike has done something that only Japanese directors seem willing to do (Takeshi Kitano or Takashi Ishii are prone to this) and that is to promote thought and feeling during a film that is essentially a \"mobster\" movie. There are few forgettable scenes and some are utterly heart wrenching (Aikawa sleeping indoors with a prostitute whilst his son sleeps under a blanket with a dog in the rain).<br><br>In honesty there is little I can say against Rainy Dog. It is a superb film, a moving film and one which will make you think long and hard. Above all else it will, like most Miike films, reinforce your sense of relief that somewhere there is someone with a brain making films with a brain. And a hell of a lot of style too.","user":"Nyagtha","rank":[16,18]}]