[{"title":"powerfully good","rating":28,"date":"28 September 2002","review":"Extremely brutal, but gripping and compelling story of a volatile, alienated young teenager (Turner) growing up in the violent atmosphere of the L.A. Watts District and—against the advice of family and friends—makes no effort to transcend the harshness and ignorance of his surroundings, instead choosing to head down a dead-end path. Violent, almost unbearable at times, but faultlessly acted by the cast, and filled with powerful, authentic scenes. Tate is an absolute powerhouse as Turner's younger, impulsive, and extremely cold-blooded pal. Obviously not for all tastes, but a monumental achievement regardless, thanks to a superior cast of actors. ***½","user":"Special-K88","rank":[66,73]},{"title":"9 out of 10","rating":9,"date":"3 August 1999","review":"Ok let me be honest.  When I saw this in the theatre I wasn't impressed. But I couldn't stop going back to see it.  And then it dawned on me that this movie is indeed a great movie.<br><br>Compared to all of the other \"hood\" movies this is the best.  It contains a message that indeed hits home.  Your actions will come back to haunt you. Tyrin Turner and Larenze Tate played great and believable roles.<br><br>Of course everyone won't get this movie.  But for those who do watch it I hope you get the message.","user":"KJMill25","rank":[8,8]},{"title":"Brilliant movie","rating":16,"date":"16 March 2000","review":"Menace was a brilliant film. There are many reasons to it, but I think what makes it so special is it's sense of style. It proves effectively that a gritty street-drama doesn't have to look bad in order to be realistic. Instead of using hand held cams and grainy film the Hughes' shoot their film with style, influenced by John Woo, and action-comics.<br><br>The violence used is also excessive and very graphic. There are brutal beatings as well as bloody shootings, all shot much better than your average action-movie. Like as in Dead Presidents, the directors aren't afraid of over-doing anything. Through slow-motion and impressive camera manoeuvering they're making great, exhilarating action.<br><br>Well, besides the violence the movie is great in many other ways. The shootings and bloodlettings are just to make it more realistic, which is pretty much the goal of the movie. In heartbreaking detail the main characters narrate us through youth criminality, drug-dealing, racism and a lot of other nasty stuff. The voice-over works really well, making Menace a sort of black \"Goodfellas\".<br><br>The story is great, in some points resembling some greek tragedy, with a storyline used successfully in other movies like Carlito's Way, Goodfellas, American History X and many others. It's about changing your life in time, before it's too late. If you don't change in time, all your past sins will come back to you. The movie is hilarious, sad, suspenseful and very educational for those who think there is racial equality in USA.<br><br>The Hughes' are young, aggressive and  untouchable film-makers who intend to show you the real world, and do it with style.","user":"Oliver1984","rank":[47,61]}]