[{"title":"Rich In Story and Characters","rating":9,"date":"29 December 2001","review":"The effects of personal want, need, love and desire on the friendships of a circle of eclectic individuals is examined with a spot of humor in the witty, clever and oh-so-British comedy of love, romance and finding that special someone, `Four Weddings and a Funeral,' directed by Mike Newell. Hugh Grant and Andie MacDowell head a delightful ensemble cast in this story of a group of long-time friends, all single, who watch and participate over a period of months as one by one those amongst them step up at last to the altar.  Of them all, Charles (Grant) seems the most likely-- and at the same time the least likely-- to be next.  Young, handsome and charismatic, Charles has no problem developing a relationship (he's had a number, in fact, as we learn in one particularly hilarious scene), but sustaining one is seemingly beyond his grasp.  Until, at the wedding of one of his friends, he meets Carrie (MacDowell), an American, and she quickly enchants him.  It is not the end of the story, however; for Charles, Carrie and the audience, it's only-- as they say-- the beginning.<br><br>\tSet in contemporary England, one of the aspects of this film that makes it so engaging is the propriety with which the humor is presented. Refreshingly subtle, there's more of Noel Coward than Tom Green or Rob Schneider to it; a matter of manners, mores and innuendo taking precedence over gross-out, in-your-face, shock schlock humor.  And though Grant and MacDowell are at the forefront of the piece, Newell does an excellent job of developing all of the characters, succinctly supplying enough detail to each individual to give the film some depth and dimension, without having to actually go too deep.  He never lets you forget that first and foremost, this is a comedy.  There's some insight provided, but this is not an in-depth commentary on human nature, though there are some overtones and implications in that direction (Charles is always late to the weddings, for example; perhaps a subconscious denial of the impending nuptials?).  Most importantly, the characterizations are rich, and the story is involving and presented with an even flow that allows you to effortlessly be swept away with it.  <br><br>\tCertain actors make a career out of playing a variation of the same character in film after film, striving for that definitive portrayal.  W.C. Fields played the hen-pecked husband in a number of films, finally perfecting that particular character in the person of Harold Bissonette in `It's A Gift.'  For Hugh Grant, it's the retiring, somewhat self-conscious and stammering, eyelid fluttering charmer, of which he's done a variation in such films as `Sense and Sensibility,' `The Englishman Who Went Up A Hill, But Came Down A Mountain,' Notting Hill' and `Mickey Blue Eyes.'  But Charles is his definitive portrayal of that character, the one in which he achieves the balance and honesty that makes the character so believable. It's a good bit of work by Grant, and definitely one of his most memorable performances.<br><br>\tAndie MacDowell, meanwhile, gives a rather composed performance as Carrie, the quiet American with a reserved bluntness who captivates Charles. MacDowell brings a sense of quietude to the role that is sensuously seductive, which lends credibility to Charles' infatuation with her.  It's a role for which MacDowell is perfectly suited, as it allows her to play effectively to her naturally calm demeanor and exquisite beauty and femininity.<br><br>\tIn a part that has to be an actor's dream, Simon Callow is absolutely exuberant as Gareth, one of the fixtures of Charles' circle of friends. More than just an effervescent character, Gareth is something of the conscience of the film, laughing away and laying bare any and all pretense or hypocrisy like a modern day flesh-and-blood Spirit of Christmas Present. It's a character that gives needed balance and perspective to the film, and he's wonderfully played by Callow.<br><br>\tAlso turning in especially noteworthy performances are John Hannah as Matthew; Kristin Scott Thomas, who is quite alluring as Fiona; James Fleet as Tom, a character very reminiscent of his Hugo in the TV series `The Vicar of Dibley,' (and very effective here); Charlotte Coleman, memorable in the role of Scarlett; and Rowan Atkinson as the hapless Father Gerald.<br><br>\tRounding out the supporting cast are David Bower (David), Timothy Walker (Angus), Sara Crowe (Laura), Anna Chancellor (Henrietta), Simon Kunz (John), David Haig (Bernard), Sophie Thompson (Lydia Jane) and Corin Redgrave (Hamish).  There's enough twists and turns along the way to keep this film unpredictable, including one scene near the end that initially seems so mean-spirited that it may have you biting your fist and crying, `Oh, NO!' But, not to worry, Newell provides an instant resolution consistent with the rest of the film, and it not only works but gets a good laugh to boot. Entertaining, pleasant and funny, `Four Weddings and a Funeral' makes for a satisfying, feel-good cinematic experience that just seems so wonderfully civilized amid the seemingly endless rancor abounding in our world today. It's what's known as the magic of the movies.  I rate this one 9/10.","user":"jhclues","rank":[61,70]},{"title":"Droll romantic comedy showcases Hugh Grant in his best role.","rating":9,"date":"28 February 2002","review":"Richard Curtis, author of Rowan Atkinson's sublime Blackadder TV series, here contributes a romantic comedy screenplay which is actually romantic AND actually funny.  American hacks should take note:  it's possible to write comedy based on the battle of the sexes that doesn't rely on misogyny and gross-out humor.<br><br>Hugh Grant at his most charming leads a talented ensemble cast in this warm-hearted tale of unrequited and requited love that so impressed stodgy Academy voters it actually got a Best Picture nomination.  I won't quibble with those who say it was undeserving -- although some of the other user comments are ridiculously hostile to such a lightweight romp -- but I will defend its makers for crafting a genuine crowd-pleaser that relies on story, character and witty dialogue for its appeal. <br><br>The essence of good romantic comedy is what Curtis and director Mike Newell capture particularly well in this film (more effectively than Curtis' other Grant hit, NOTTING HILL) and it's this:  love makes us do stupid things.  We err in choice, we blunder in execution, we make utter fools of ourselves, and yet we don't give up.  We still strive.  We still search for that perfect someone.  And the glory is -- sometimes we get lucky.<br><br>Going along on this quest with Grant and friends is as enjoyable an entertainment as you're lucky to find in your local DVD section.","user":"jckruize","rank":[73,85]},{"title":"Mostly enjoyable - needs a different ending","rating":17,"date":"17 August 2011","review":"I really enjoyed most of this movie - the funeral was devastating. And unlike many, I really do enjoy the standard Hugh Grant (which, in fairness, was not yet \"standard\" when this movie was new).<br><br>BUT (and I'm agreeing with everyone else here) Carrie, the Andie MacDowell character, has nothing going for her. She is not appealing in any way, and she's a slag.<br><br>Additionally, the wedding to Duckface is totally unmotivated, and only contrived so that he can leave her at the altar without us hating him.<br><br>Here is how it should have gone. The fourth wedding should have been between Charles and Carrie - once she's divorced, there is no impediment after all. Carrie - true to character - will be getting it on with someone else by the night before the wedding. Meanwhile, Charles discovers that he is really in love with Fiona (wasn't that the point of the movie? it's what I expected to happen). The deaf character discovers both these facts and the wedding can now be played as originally scripted.","user":"elspeth-11","rank":[18,19]}]