[{"title":"Underrated Star Wars Adventure, Full of Intrigue, Drama, and Jaw-Dropping Fun","rating":9,"date":"2 December 2015","review":"Much like its predecessor, Star Wars - Episode II: Attack of the Clones has gained a rather sour reputation on the internet. Fortunately, many of the popular complaints about this film are either highly exaggerated or downright wrong. Chapter two of the Star Wars Saga is an energized and highly enjoyable two hours at the movies.<br><br>Attack of the Clones follows Anakin Skywalker ten years after his exploits in The Phantom Menace. An older Anakin, played surprisingly well by Hayden Christiansen, is now training under the watchful eye of Ewan McGregor's Obi-Wan Kenobi. Searching the Internet, you won't find many fans who praise Christiansen's performance, but I found him to be very effective in the young, arrogant hotshot role he'd been given. McGregor does similarly well in the older brother, mentor role. <br><br>I enjoyed Episode I a lot, but the story is much more focused this time, with major events happening for Anakin, and an actual political conflict engulfing the Republic. The two major story lines in the film are, one, the political underpinnings that eventually lead to the start of the infamous Clone Wars, and two, the personal story of Anakin Skywalker, including the romance between him and the former Queen, Padme Amidala. The first of these story lines is wildly interesting, following the two opposing forces of the Clone Wars, The Republic and their clone army, and the Seperatists and their droid battalion, as they prepare for an imminent war. After an assassination attempt on Senetor Amidala, Obi-Wan embarks on a detective mission to a track down the people behind the plot. The political espionage and behind-the-scenes dealings make for a fascinating and focused story. The other major storyline is not as focused, but still works as a chapter in Anakin Skywalker's overall story. Anakin and Padme's love story works as a throwback to the grand, old-fashioned film romances of the 1930s and 40s (think Gone With the Wind), but for contemporary audiences, the few extended scenes of corny \"love speech\" dialogue might be pretty drab. However, these aren't as distracting or offensive as some claim. In fact, a couple of them actually work well, such as the meadow picnic, where Padme and Anakin discuss the futility of politics in the beautiful fields of Naboo. The actors have chemistry, and both are likable, especially Natalie Portman as Padme. Yes the love story can be a bit forced, and sometimes drab, but it fits the feel of the saga. It is a grand, sweeping, throwback to Hollywood's golden age.<br><br>If the love story might be hit or miss, it's the other facet of Anakin's character arc that Lucas gets absolutely right. Plagued by visions of his mother in pain, Anakin takes Padme to Tatooine where he tracks down his mother, only to see her die in his arms. His response is chilling and powerful. The scene between him and Padme in a garage after he brings his mom's body back is perfectly executed, unveiling a dark, angry side of Anakin, while simultaneously showing his frailty and confusion. It truly is one of the very best scenes in the saga.<br><br>Even if you didn't find the story as interesting as I did, there is no question that Episode II is an audio/visual feast for the senses. Lucas and company introduce a stunning variety of sprawling landscapes, crazy creatures, fanciful vehicles, and formidable weapons. Once again, the sheer amount of imagination contained in this world is unbelievable. While Attack of the Clones does tend to favor CGI backgrounds and creatures too much, it still looks undeniably cool. The nighttime skyline of Coruscant, the rain-drenched clone facility on Kamino, the termite mound planet of Geonosis; They all, along with the creatures that inhabit them, feel real, and look great. On these beautiful planets, we are treated to tons of terrific Star Wars action. George Lucas once again revels in directing off-the-wall fun. This film is an adventure through and through. Set-pieces range from a one-on-one battle between bounty hunter Jango Fett and Obi- Wan on the rainy platforms of Kamino to a gladiator-like fight against intergalactic monsters. The last half hour of the film particularly impresses, with a massive battle between the two giant armies, dozens of Jedis, and a helping of fantastic war machines. The whole thing ends with an epic face-off that sees Yoda battle with mind and sword against Christopher Lee's devilishly evil Count Dooku, a memorable villain with an air of gravitas. He's a classic Hollywood archetype with a Star Wars spin; an elegant villain who just happens to have a lightsaber (with an awesome curved handle) and can shoot lightning from his hands.<br><br>Needless to say, Attack of the Clones is much better than its reputation suggests. Complaints of poor story, too much politics, and \"fake\" looking CGI are almost completely unfounded, and the few moments of clichéd dialogue (the only complaint I can really understand) are such a small part of the film, that I barely notice them. However, for some reason that I honestly can't understand, it has become increasingly more \"uncool\" to like this film. Personally, I value energy and atmosphere in a blockbuster like this, and Episode II of the Star Wars Saga is packed with it. Attack of the Clones is a grand, sweeping, large-scale adventure. The story is mostly great, with only a few stretches that drag, and as with all the Star Wars movies (especially the prequels), the special effects and action are top notch. That is, after all, why you watch the Star Wars movies; to visit unknown worlds and have a ton of fun doing so. Star Wars - Episode II: Attack of the Clones isn't a world-class lesson in dialogue, but between the visual spectacle, first-rate action, and heavenly John Williams score, it is entertainment of the highest degree.<br><br>86/100","user":"jaredpahl","rank":[141,200]},{"title":"The most romantic episode of \"Star Wars\"","rating":8,"date":"4 June 2018","review":"The second episode of the new trilogy of \"Star Wars\" was much better than the first. He is much more gloomy, eventful and full of the sense that soon the customary world will collapse ... Moreover, it can be considered the most romantic film of the saga - speech, of course, about the love line of Anakin Skywalker and Padme Amidala performed by Natalie Portman. It is not only very well developed, but it also takes place mainly in very beautiful, blooming locations, which is generally uncommon for Star Wars. Even sad to realize that it is waiting for a tragic ending ...<br><br>In all other respects, the \"Clone Attack\" can be considered a good film. Excellent battles on light swords, skirmishes, long conversations and flights on space ships - all this is done very qualitatively and interestingly. There are a lot of really unexpected plot twists, which will be appreciated not only by the fans of the universe, but by all the rest. For example, when a small dwarf Yoda takes a lightsaber in his hands and almost starts on an equal footing with the formidable Count Dooku, perhaps everyone was surprised ...<br><br>However, in spite of this, the second episode can not be put on the same level as the classical trilogy. And it's not even the quality of performance, but the fact that those films evoked much more emotional response, they had the notorious \"Star Wars magic\", which is practically absent in the first two prequels.<br><br>However, watching the \"Attack of the Clones\" is worth all fans of fiction - these films are shot too rarely.","user":"BiiivAL","rank":[109,162]},{"title":"I loved it and I think it's getting too much criticism","rating":10,"date":"26 March 2003","review":"I happen to be one of the folks who really has enjoyed these films in the prequel trilogy.  I also can see why people would not like the films and I don't deny people the right to their opinion.  What has been bothering me has been some of the reasons people are giving for hating these new films... they are childish, they have too many special-effects, the acting is bad, the writing is bad, Lucas has sold out and has lost his touch... it makes me wonder if people are actually remembering the original trilogy correctly. Don't get me wrong, I love the original trilogy, but they weren't exactly well-acted or well-written movies.  We didn't love them because they were these great Shakespearian works of art; we loved them because we were little kids totally enraptured by this exciting fantastical world.  It seems that those same kids that loved the films 20 years ago have grown up into stuffy old yuppies that have no idea how to have fun anymore.  Our generation has grown up and it seems that we wanted Star Wars to grow up with us, to morph into some new R-rated grown up version to satisfy our more mature needs. Well, we didn't like the original trilogy because it was all grown up and serious.  We liked it because it was silly and fun and awesome to look at. I am personally glad that George Lucas did not make the prequels into a new grown up version.  I like the adventure and excitement and I challenge the one major complaint that says that they do not live up to the originals. Let's look at what people have complained about when comparing these to the original trilogy.<br><br>-The new movies are too childish and geared towards kids: So, somehow we're supposed to believe that the droids, aliens, spaceships swamp monsters, and warriors with mystical powers from the original trilogy were of the more mature variety.<br><br>-The new movies have too many special effects: We're forgetting that the original movies were also special effects laden.  Lucas has always pushed the limits of technology, even inventing new technology all the way.  He has not sold out or changed or just now relied on special effects, he has always concentrated on the effects.  If he had digital technology 20 years ago, he would have done the same thing then that he has now.  That's what he does; he makes up worlds that don't exist and then comes up with a way to put them on film.<br><br>-The writing has been bad on the new films: Does anybody recall Lucas ever receiving a Pulitzer Prize?<br><br>-The acting has been bad on the new films: Carrie Fisher???  Mark Hamill??? Harrison Ford???  We're not exactly talking about Academy Award winners here.  Name me one of the original main actors who was actually a great actor (other than Sir Alec).  Now, Harrison Ford has had a great career, but he's no Jack Nicholson.  And where are Carrie Fisher and Mark Hamill now?<br><br>-Anakin is just a whiny little brat: Does anybody also remember how whiny Luke was in the first two movies?  I mean, he did nothing but whine and complain until Jedi.  And how many times did they say that Luke was just like his father?  Should anybody then be surprised that Anakin was a whiny adolescent?<br><br>I think my point here is that people from my generation have taken something they loved as a kid and put it up on a pedestal so high that they are confused as to why they liked it.  They think the original movies were these serious Academy Award caliber pieces of art and that's why they liked them. In fact, we liked them because they were cool and had monsters and space battles and there were toys that we could play with and have fun.  The new movies are of the same mold as the original, they are unchanged.  WE have changed and we're having a hard time dealing with that fact.  Some would argue that these movies are not true Star Wars movies.  I say, they are exactly the same... that's why I love them.  If I want a serious film, I'll go find somethings starring Daniel Day-Lewis.  I like action and science fiction, so I'll stick to the childish, poorly acted stuff.","user":"sixpack-3","rank":[565,934]}]