[{"title":"hit and miss","rating":13,"date":"13 August 2003","review":"I was originally captivated by the Dr. Who series while PBS was airing the Tom Baker (my favorite) and Peter Davisson episodes during the 80's. Later I caught bits and pieces of some of the earlier and later incarnations of the Doctor during PBS pledge drives. (Yes, it worked! I have a bunch of Dr. who t-shirts and coffee cups now. And of course, i supported \"television worth watching\".)  So when i heard about the fox production i was waiting with bated breath.  Silly me.  I should have known that the clowns in hollywood would urinate all over a wonderful story.<br><br>Hits:<br><br>Paul McGann was a great doctor.  Good looking in the hollywood way but not a hollywood plasticface.  He actually projects some character.  He gives the role a sense of childlike wonder and earnestness, very much in keeping with the interpretation of T. Baker, Davisson and Troughton. His costume works for me.(but not how he got it. see my misses)<br><br>The regeneration scene.  Awesome!  The whole idea of a cocky surgeon suddenly unable to perform a routine procedure and because of her frustration and conviction of the way things are she kills him is wonderful. The fact she has to deal with the reality that if she had just stepped back, questioned her assumptions, given the x-ray techs and radiologist credit for knowing what they were doing, etc, she would not have \"killed\" him, works for me.  My only gripe is that she doesn't really agonize over it enough.  She doesn't even apologize for killing him!<br><br>Sylvester McCoy making his appearance.  I think this regeneration was approached as well or better than any of the others.  It's too bad Fox assumed that americans couldn't deal with the quirky McCoy as the Doctor. I guess he was just not \"beautiful\" enough. (last time i checked i was an american and i liked his doctor a bunch.  I'd put him in a close tie with peter Davisson as second best)<br><br>Some very typical doctor behavior.  I particularly like where he holds the gun to HIS OWN head in order to steal the motorcycle.  I could easily have pictured Tom Baker's or Patrick Troughton's Doctor doing that.<br><br>The kiss - I don't mind the kiss at all.  Actually it was kind of cool.  I was always disappointed he never kissed Romana. There seemed good chemistry there. (since Tom Baker and the actress did end up marrying i guess that makes sense.)  And come on people! it's just a kiss.  It's not like they went totally hollywood and had them strip down, jump in bed and have her teach him the \"human way\" to ecstasy.  And it's not like she shacks up with him in the Tardis.  They each go their own way, friends.  As it should be.<br><br>Special effects, nothing outstanding for an american show but not bad. Wouldn't it be cool to have seen some of the classic who stories shot with effects this good?<br><br>The new tardis.  Not bad.  A little hollywood i guess but no worse than the claustrophobic, antiseptic control room in the series.  Wasn't there a point where one of the doctors (i think it was t. baker) used a nice mahogany and brass \"old control room\" for awhile?  As for the spaciousness, not too hard to deal with.  I remember an episode of the tv series where the doctor seems to be running endlessly down corridors in the tardis that look strangely like they might be corridors in a studio basement.<br><br>\nMisses:<br><br>Doctor is Half human and renaming the chameleon to the cloaking device... These are the result of the brainless hollywood assumption that americans will better consume a product only if it is made according to formula.  In this world all sci-fi fans are by definition star trek fans, therefore these two \"tips of the hat\" to Star Trek are necessary.  To me they are just way too jarring - they don't belong in the story at all. Tell me, what does it add to the story for him to be half human? What?  Why does hollywood always assume that americans are all brainless boobs.... Still, (am i speaking heresy here?) if they are going to mix worldlines why pussyfoot around?  Why not have the tardis appear on the bridge of the enterprise?  I think the tension and interaction between Tom Baker's irreverent Doctor and Spock would be priceless.  Still, it wouldn't be a Dr. Who story.<br><br>Reinventing the master as a cheap terminator/krychek knock-off.  Yuch.  I accept the the incarnation of the master portrayed by anthony ainly was already a stolen body for the master trying to live beyond his final incarnation but still... this just doesn't work for me.  I think i saw a villain like this on Power Rangers.<br><br>Chang Lee does not leave with the doctor to become his first companion in the new Fox series.  Why not?  It's not like he's got much of a life to look forward to as a gang member.  It would have been great.<br><br>Procuring his costume -- I pondered that a long time after i saw the movie.  How does a guy who's just left the morgue and is wandering around in a hospital basement find a room with all the windows smashed out and filled with lockers containing stage costumes? huh?  I worked maintenance in a hospital when i was a teenager and EVERYTHING in the building was kept clean, painted and in perfect working order, even in the sub-basement.  A derelict room like that? Not in any hospital i've ever seen!<br><br>All the senseless incorrect references to the Dr. Who pantheon.  Ok, him having jelly babies is marginally acceptable, i guess, but the Eye of Harmony?  Just let the story develop naturally for pete's sake....<br><br>the chase scene and other hollywood pap.  I admit that Pertwee and the U.N.I.T. people end up doing that a lot but ya know, I always thought of pertwee's doctor as pretty lame compared to most of the others.  The whole thing about the doctor being sentenced to remain on earth seemed a cheap budgeting ploy by bbc to cut down the cost of sets and special effects. Why put any of this in except to make a nod to the pertwee incarnation. Again, why does hollywood always assume we're morons?  And the countdown scene for the bomb or whatever (it's been awhile since i've seen it). What's up with that? They only thing they didn't have was the scene where he has to cut the red wire or the blue wire.  Or the scene where he walks into the darkened room where the monster is and inexplicably doesn't turn on the light. Or the scene where his boss takes away his badge and tells him he's on his own... I mean if we're going to tell a story by formula what's up?  You missed a few, hollywood guys!!<br><br>Why wasn't K-9 in the movie?  It's amazing the hollywood guys missed the potential r2-d2 tie-ins.<br><br>I guess to sum up, i'd say that this Doctor is better than no doctor at all. I just wish they'd have given us a script that was even a little better than an episode of (70's) battlestar galactica or the six million dollar man. Maybe if they would have made the series it would have. Maybe.  I'd like to see the people that made the new Dune movies for the Sci Fi channel take a crack at the doctor.  Now that would be cool!","user":"ovationbass","rank":[42,49]},{"title":"Something Of An Anti-Climax","rating":6,"date":"25 February 2003","review":"It was in January 1996 that I first heard that my all time favourite TV hero was returning to our screens as a joint BBC / American network TVM . Whoever you are reading this review never EVER give up on your hopes and dreams because for DOCTOR WHO fans in the early 1990s not one of us ever believed we`d be seeing our favourite show return , never mind seeing a big budget American production or that this version was gong to have BAFTA award winning actor Paul McGann in the title role . Words fail to describe the anticipation me and every single other Who fan in the cosmos had in waiting till the TVM was broadcast in May . The only comparison I can think of is LOTR diehards waiting to see FELLOWSHIP , THE TWO TOWERS and RETURN OF THE KING . When the day of the broadcast came one Bank holiday Monday I`d almost bitten my fingers off in unbearable anticipation . I`d read every article I could find about the production in telefantasy magaziness , Paul McGann`s Doctor had appeared on the front cover of every British TV guide and the trailers led me to believe the Daleks were going to be heavily featured alongside the Master . So in mid evening the TVM began and for 90 minutes all the world`s problems disappeared . When the end titles rolled I was torn between being totally amazed by the good and bitterly disappointed by the bad .<br><br>The good bits were Geoffry Sax`s direction . Every single cent was up there on screen for the audience to gasp at . This is one Who story that can`t be accused of having crap FX . Sax also does an excellent editing job with intercutting between scenes , and it really was fascinating watching a Who story take place in an American setting .  But the best aspect to the production is Eric Roberts camp scene stealing performance as the Master . My own memories of Roger Delgado`s original Master soon faded as Roberts bad-ass TERMINATOR inspired American arch enemy of the Doctor stole the entire show .<br><br>But unfortunately much of the bad outweighed the good and most of this was entirely down to Matthew Jacobs script which involved far too much continuity and extremely bad continiuty at that which not only displeases diehard fans but will alienate casual viewers at the same time . Regeneration ? temporal orbit ? the eye of harmony ? I know of these concepts because I`m a fan but here they`re presented entirely different from what I know them as . Likewise when did the Doctor become half human ? But the most disappointing thing were the Daleks who seem to be intergalatic hangmen and not the Nazis of the universe as shown on TV for three decades . Also bitterly disappointing to see them relegated to an off screen cameo when according to the trailers they might have been making a physical presence . Oh BTW can anyone really understand the plot ? At times it felt more like a Bond movie as the Doctor races around on a motor bike trying to save the world from a super villain . With the exception of Roberts no one really turns in a good performance least of all McGann who is surely one of Britain`s most underrated actors . I really expected more from him , though to be fair he didn`t have a lot to go on due to the script.<br><br>Oh well I suppose it was good while it lasted and I suppose my life has been slightly enriched after seeing an American version of DOCTOR WHO , and let me just repeat if someone had told me in 1992 I`d one day be watching an American version of the show I would have laughed in their face . It`s not the worst DOCTOR WHO story I`ve seen but it`s not a story I`ll watch over and over again unlike The Silurians , Inferno , Genesis Of The Daleks , Seeds Of Doom or Kinda . These really were classic pieces of not only Who but of British television","user":"Theo Robertson","rank":[46,58]},{"title":"Watchable, but hardly Dr Who at its best.","rating":18,"date":"18 June 1999","review":"At last people can stop taking the proverbial out of the special effects in Dr Who!  Instead they can take the proverbial out of the limp plot (if you can call it that).  Eric Roberts isn't a patch on either of the previous incarnations of the Master.  Paul McGann, however, makes an original Doctor and it's a shame a potentially interesting incarnation of the great Time Lord wasn't allowed to develop.  There was a lot of complaining about the kissing scene, but I personally didn't see what was wrong with it as long as the Doctor doesn't turn into James Bond or Captain Kirk.  Anyway, since the Doctor has a grand-daughter (Susan) then he must have done more than kiss a woman at some point in his life!  But I did see what was wrong with the 'half-human' business.  Can't people accept somebody who is an alien?<br><br>This film certainly has its moments and shows great potential for a new series, but it's just a shame Fox couldn't get their act together and make that series instead of allowing it to fall back into the clutches of the money-minded BBC where it'll probably never be seen again.<br><br>Not an example of Dr Who at its best by any means, but if you're a fan of the program like me then it's worth watching just to see the Doctor back in action, if only for one adventure.","user":"G.Spider","rank":[32,42]}]