[{"title":"It used to be a better meal, now it's a better life","rating":19,"date":"19 June 2008","review":"I've almost always loved Crowe's style of storytelling and never tire of rewatching 'Almost Famous' and 'Jerry McGuire' (which I consider his best). Even though his more recent 'Elizabethtown' didn't match up the standards of those two films, that too had its wonderful moments (and it was better than 'Vanilla Sky', Crowe shouldn't have attempted remakes). Like most of his films, 'Jerry McGuire' has soul. Crowe's eloquent screenplay is rich in humour, drama and lots of energy. It features some of the finest dialogues and one-liners like 'You had me at hello', 'Don't cry at the beginning of a date, cry at the end like I do'... and the actors deliver them marvelously. Another fascinating aspect is the brilliant characters. Each and every one of them, no matter how long the screen time, has something that contributes. Thus, next to an engaging drama and a magnificent comedy it is a fine character study.<br><br>'Jerry McGuire' may also be one of Cruise's career best movies. I'm surprised to hear that the part was originally written for Tom Hanks. Hanks is a fine actor but I can't imagine him as McGuire as I doubt whether he has the right combination of energy and pathos that are required to be McGuire. I can't imagine anyone but Tom who fits the part. The same can be said of Renee Zellweger and Cuba Godding Jr as I don't see how a Winona Ryder, Cameron Diaz or Mira Sorvino and a Jamie Foxx (all good actresses) could respectively bring out the sweetness, vulnerability and charisma of Dorothy Boyd or the energy, humour, liveliness, enthusiasm and devotion (towards family) of Rod Tidwell. One wonders why Zellweger was overlooked as her presence too is crucial to the film.<br><br>In addition, the film has a splendid supporting cast that include a sublime and laugh-out-loud Bonnie Hunt, a bitchy gorgeous Kelly Preston, a sprightly Regina King and an unforgettably lovable Jonathan Lipnicki (one of the few child actors who's cute but not in the way that gets on your nerves)'. Child actors are very hard to direct but Lipnicki's performance comes across as very natural and he acts like a real child instead of those irritating oh-look-I'm-so-cute child models.<br><br>The soundtrack too deserves mention as it features some amazing numbers. One of the so many memorable scenes is when McGuire is driving in his car and he listens to the radio, switching channels and singing along. Then there's also the incredibly romantic 'Secret Garden' by Bruce Springsteen among other great familiar tracks by the Beatles, Rolling Stone, Marvin Gaye, Kurt Cobain etc. On the more technical side, the wild and smooth cinematography, slick editing and effective sound are superbly put together. The visuals are very impressive.<br><br>The last time I had watched 'Jerry McGuire' was about 10 years ago and I vividly remember saying 'wow!' when the end credits started to roll that my sibling wondered what the hell was going on. I feel the same about it after having rewatched it recently. Well, actually I like it more because I noticed more things that I overlooked before and understand and like the characters more. McGuire's transformation from the money-obsessed agent to the caring agent and then to the caring human being (in the form of a father and a husband), a change that wouldn't have happened if it weren't for the caring people in his life, is one remarkable story.","user":"Chrysanthepop","rank":[62,72]},{"title":"Successful multi genre","rating":9,"date":"26 February 2007","review":"This movie is a comedy, drama, romance, sports movie, and a money movie (e.g. Wall Street, where the main character is trying to make a lot of money). The problem such a movie faces is maintaining a consistent tone. Remember Prizzi's Honor? JM solves that problem by using restraint. It doesn't go over the top, although its characters sometimes do. It has funny moments, but it's not Animal House or American Pie. It's a drama, but it keeps the stakes low. This isn't Armageddon: they aren't trying to save the world. There are no life or death decisions. The romantic stakes aren't that high either: Renee Zellweger loves Tom Cruise, but she's been in love before and if this doesn't work out, she will be again. The only really high stakes are the money. By keeping the stakes low, JM let's us watch it with a bit of detachment.<br><br>This is more of a drama than a comedy. A good test is whether the characters change. Here, Tom Cruise starts off completely cynical, abruptly changes to ridiculously idealistic, then spends the rest of the movie finding the right balance. Renee Zellweger starts by loving Tom Cruise from afar, then gets him, then has to work out her ambiguous feelings.<br><br>JM is fun to watch. The characters, though flawed, are sympathetic. We enjoy watching them succeed, fail (sometimes in funny ways), and try to discover what they really care about. It's complicated, thoughtful, and surprisingly subtle.","user":"Tom-2128","rank":[55,67]},{"title":"Agent Seeks Something Higher -- Possibly Cruise's Best Film","rating":9,"date":"31 August 2007","review":"At the 1997 Academy Awards, host Billy Crystal referred to the characters played by the five Best Actor nominees (of which Tom Cruise was one) as being \"a burned guy, a mentally-challenged guy, a mentally-abused guy, a paralyzed guy, and an agent. And four out of the five are treatable.\" Of course Crystal was jokingly referring to the Agent as being beyond help. Among the figures of sports and entertainment, agents are often regarded as the necessary evil of the industry often with reputations as being the sleaziest of VIP's, just-above used car salesmen. Their antics which require a high-level of tough negotiations are sometimes seen as money-gouging and materialistic. In the film \"Jerry Maguire\", Tom Cruise decides to wear the shoes of a sports agent and walk around in them for just over two hours.<br><br>\"Who am I, and what am I doing?\" Jerry Maguire asks when he realizes his sports agency, SMI, tries to cover up the darker aspects of professional sports. His answer is inspiring, transcendent, and detrimental. He mistakenly writes down his inspired thoughts and submits them to his colleagues for suggesting the agency concentrate better on fewer clients. For his inspiration, he loses his place at his agency and many of his highest-paying clients to his rival Bob Sugar. Subsequently, he also loses his attractive but shallow fiancé. Maguire is forced to try and live his dream of being more caring and receptive towards the needs of his clients rather than just being there to get a slice of his athlete/clients' multi-million-dollar paychecks. In a particularly poignant sequence, he retains his client Frank \"Cush\" Cushman who is a leading contender in the NFL draft through a handshake with his father, played by Beau Bridges. However, on draft day, he learns through an unexpected phone call that his rival Bob Sugar, through deception, convinced Cushman to sign with him instead. Now, Maguire has retained only Tidwell, and he must create his new agency from the ground up with only a single client as his starting point.<br><br>So the question asked of the movie is: Can a sports agent find a more meaningful, possibly spiritual, life and still acquire the high-paying clientèle? And maybe even more to the point, can an agent make a difference beyond just being a high-powered money negotiator? \"Jerry Maguire\" is a thoroughly entertaining riches-to-rags-to-transcendence story of a fantasy sports agent trying to find a deeper purpose to an otherwise materialistic existence.<br><br>The film works at almost all levels, particularly because of the dynamism of Tom Cruise and Cuba Gooding Jr. in an Academy Award-winning performance, playing the only client willing to stay with Maguire. Part of the story is Maguire's journey from the purely material to a deeper and more-satisfying existence. Rod Tidwell (Gooding), wide receiver for the Cardinals, is a strange opposite to Cruise but has a similar problem. Tidwell is a devoted father and husband, emotionally involved with his family but does not quite give that same heart on the football field. The story becomes about both characters finding something deeper in their place in the world, Gooding giving what he gives to his family to his team, and Cruise giving to his clients and co-worker/lover Dorothy Boyd his love and attention. Renee Zellweger plays Dorothy Boyd in a passionate and sensitive performance that will definitely bring tears. Zellweger's son becomes an important character and also an inspiration to Cruise to find the deeper and more sensitive part of himself.<br><br>In the materialistic world of late 20th-century America, \"Jerry Maguire\" is a breath of fresh air. A rare story produced by the money-obsessed film studios about the dangers of losing oneself for the sake of self-promotion and monetary gain. An interesting statistic has emerged of late regarding a high number of American businessmen on their deathbeds who begin regretting the direction and purpose of their lives. \"Jerry Maguire\" offers an alternative, although probably few in his position would find the wisdom to change course. But since you can't take it with you, life is about what you leave behind.","user":"classicalsteve","rank":[48,59]}]