[{"title":"One of Brad Pitt's most memorable roles.","rating":9,"date":"8 December 2004","review":"In the same vein as Natural Born Killers, another movie that was not so popular with critics because of its excessive violence but that I also loved, Kalifornia is a movie that clearly glamorizes violence, but I like to think that it turns that around in the final act. Kind of like how The Basketball Diaries glamorizes drugs at first, but shows the bad side by the end of the movie, which is far worse than the good side is good. David Duchovny plays Brian Kessler, an artistic yuppie with an even more artistically yuppie girlfriend, who is into that violent sexy black and white photography generally reserved for, I don't know where, places where nudity passes for art. Maybe it really does and I just don't understand it. At any rate, Brian and Carrie (Duchovny and Michelle Forbes, who fits the role flawlessly), make the perfect couple to go on a documentary tour of famous murder sites. Brian, the writer, will write the book, Carrie can take the pictures.<br><br>Being artistic types, Brian and Carrie are not quite financially prepared for such a trip, so they put out an ad for someone to share gas and travel expenses, and are contacted by Early Grace and Adele Corners (Brad Pitt and Juliette Lewis). Early is on parole and assigned to janitorial work at the local university by his parole officer, sees the ad on a bulletin board, and decides to leave the state for a while, violating his parole but also leaving the scene of his landlord's murder so he won't have to deal with a pesky murder investigation. Two birds with one stone, you know.<br><br>The movie has a curious ability to portray two stereotypes, the artsy yuppies and the greasy trailer trash, without resorting to clichés or even ending up with caricatures of either type. Brian and Carrie are artsy liberals, but while Carrie catches on to Early and Adele, Brian is fascinated with Early's status as an outlaw, as seen in the scene where Brian shoots Early's gun. Never having fired a gun before, he's as fascinated as a little kid. While Adele and Carrie are back at a hotel and Adele reveals such things in her childlike way as the fact that Early \"broke her\" of smoking and that she's not allowed to drink (Early doesn't think women should), Early and Brian are out at the local bar. Brian reacts nervously to a drunk trying to start a fight with him, and Early first gives advice to Brian on what to do and then steps in and dishes out a quick lesson for the guy. \"Hit him, Bri, it's comin'.\" This is one of my favorite scenes in the movie, partly because it's so funny what Early gleefully says as the guy's friends drag him away, bloodied and battered, but also because as it is intercut with the girls back at the hotel, we learn so much all at once about the two couples, their differences, and the conflicts that are likely to come up because of them. And besides that, because Brian benefited from Early's actions and Carrie is appalled by what she hears from Adele, it also illustrates the different way that Carrie and Brian react to Early and Adele.<br><br>Clearly, by now, you can tell that this is not your typical odd couple type of thriller, where the city folk run into the country folk and all sorts of stereotypical mayhem ensues. On one hand it seems a little too convenient that Brian and Carrie go on a tour of murder sites and just happen to be accompanied by a real life murderer, but on the other hand it's a great way to counteract the glorifying of murder that is inherent within a cross-country trip designed to bring fame to murderers and their crimes. While studying the actions of past murderers, Brian and Carrie ultimately find themselves face to face with the very material that they are studying, and realize that murder is not as pretty or morbidly fascinating when it's in your face as it is through disconnected studies of murders past.<br><br>I am constantly amazed at Brad Pitt's versatility as an actor. Consider, for example, his roles in movies like Kalifornia, 12 Monkeys, Fight Club, and Ocean's 11 and 12. Pitt is like Tom Hanks in that he can change his appearance drastically or just enough to fit a given character, and is completely believable. Incidentally, I tried in vain to be Early Grace for Halloween this year, but just couldn't get the hair and beard right. I even got the hat right, which initially I thought would be the hardest part.<br><br>It's easy to understand why a lot of people disliked Kalifornia or why they think that it glorifies violence and murder, but I think that whatever glorifying it does is done with the intention of clarifying the audience's understanding of its subject matter. A film that didn't glorify violence, at least initially, could never be as effective as Kalifornia, but the movie structures it perfectly. The glorification is all embodied in Brian's and Carrie's fascination with the idea of murder and the auras of the places in which is happened, but their realization, and ours, is embodied in the real thing, which they encounter with Early and Adele. The movie's very purpose is to describe that difference between idealizing violence and seeing the horror of it up close and for real.","user":"Anonymous_Maxine","rank":[78,93]},{"title":"Gripping and disturbing.","rating":8,"date":"25 September 2007","review":"I had seen this film many years ago and it had made a lasting impression on me. Alas, I have hardened to many films over the years and did not expect to be impressed by 'Kalifornia' upon watching again recently. I am pleased to say that it is every bit as unnerving and watchable as it was ten or so years ago.<br><br>There are two things which really give this movie its power. The first is its cast. We have a staggeringly disturbing turn by a young Brad Pitt as Early Grace. Knowing Pitt, as we all do, as one of the most enduring heart-throbs Hollywood has ever had, it is refreshing to see him play such a vile, unattractive character. Pitt pulls the show off without resorting to white-trash cliché or parody, and manages to remain genuinely terrifying throughout the movie.<br><br>Juliette Lewis is equally impressive as Grace's tragic girlfriend, playing the character like a ten year old girl with a forty year old's life experience. Lewis manages to evoke pity (for her character's station in life) as well as contempt (for her naivety), but she underpins her performance with the kind of subtlety rarely seen by an actor so young. Personally, I think it's a tragedy that neither Pitt nor Lewis were nominated for any awards for their performances here.<br><br>David Duchovony and Michelle Forbes are both perfectly cast as the yuppy couple who unwittingly end up travelling across the US with Pitt and Lewis. Duchovony is aptly geeky and naive, and Forbes seems emphatically cynical and shut-off, but both actors manage to convincingly portray their characters' changes as they are equally intrigued, repulsed and strangely attracted to Pitt.<br><br>The fine casting and uniformly brilliant acting aside, this film really grabs us by the proverbial balls through its flawless pacing. At the time 'Kalifornia' was released, Hollywood was releasing a slew of nice-character-turns-out-to-be-psychotic movies ('Single White Female', 'Pacific Heights', 'The Hand That Rocks The Cradle', 'Deceived', 'Sleeping With The Enemy' etc). Most of these movies followed the same formula, the only variation being the nature of the relationship between good guy and bad guy. 'Kalifornia' doesn't really stray too far from this territory, but its first two acts are the perfect example of the slow-boil thriller, and we are kept on the very edge of our seats waiting for the tide to turn.<br><br>When the penny does drop, and Pitt is let loose to play the maniacal bad guy, the film shifts gears completely and the last twenty minutes don't quite live up to rest of the movie. That said, the action is thick and fast and the resolution is suitable cold. The fight is over, but the scars will always be there.<br><br>Much of the narration (provided by a somewhat whiny, pre X-files Duchovony) is a tad contrived. Of course, it's meant to be from the book the Duchovony's journalist character has written, so one could argue that the self-conscious narration is meant to be a nod to the kind of sensationalised style in which most journalists write.<br><br>The film is largely a success and is certainly a cut above 90% of the thrillers of the past twenty years. Highly recommended, but not for the weak of stomach or mind. This film is disturbing on more than one level. But then, it's meant to be.","user":"theskylabadventure","rank":[16,17]},{"title":"Killer On The Road","rating":8,"date":"11 July 2006","review":"It's a road movie, with a killer on-board. Brian Kessler (David Duchovny), a sophisticated, urbane writer, wants to conduct field research on American serial killers. But, neither he, nor his girlfriend, Carrie (Michelle Forbes), has the money for a cross-country tour of murder sites, so they advertise for someone to share travel expenses. Who they end up with is a young couple, Early Grayce (Brad Pitt) and his girlfriend, Adele (Juliette Lewis), two better examples of \"poor white trash\" you will never find in all of cinema.<br><br>Indeed, Early and Adele are what make this film so entertaining, as they babble, cackle, confide, muse, speculate, drool, and otherwise behave in ways I haven't seen since reruns of \"The Beverly Hillbillies\". Early's idea of California: \"People think faster out there, on account of all that warm weather; cold weather makes people stupid\". That's enough to convince Adele: \"I guess that explains why there are so many stupid people around here\". To which Early responds proudly: \"It sure does\". Early continues to instruct Adele about California: \"You never have to buy no fruit, on account it's all on the trees ... and they ain't got no speed limits, and I hear your first month's rent is free, state law\".<br><br>But poor Early has some, well, mental problems, which become ever more obvious to Brian and Carrie as the four travelers proceed west across the U.S. As they enter the desert Southwest, with its beautifully stark landscape, \"Kalifornia\" starts to look more and more like \"The Hitcher\" (1986), and Early starts to act more and more like John Ryder, everyone's maniacal hitchhiker, whose terror seemed so unstoppable.<br><br>In \"Kalifornia\", the acting is uneven. Duchovny's performance is flat. Brad Pitt is surprisingly effective, despite his overacting at times. Michelle Forbes is great as the avant-garde, photographic artist. But my choice for best performance goes to Juliette Lewis. With her nasal voice and heavy-duty Southern accent, she is stunning, as the naive, highly animated, child-like Adele.<br><br>Toward the end, the film takes on a Twilight Zone feel to it, as our travelers enter a Nevada nuclear test site with a dilapidated old house full of test mannequins. The plot dissolves rather messily into unnecessary and preposterous violence, an ending that was somewhat disappointing.<br><br>Overall, however, \"Kalifornia\" is an entertaining film, thanks to a clever concept, great scenery, especially in the second half, good cinematography, great dialogue, and that wonderful performance by Juliette Lewis.","user":"Lechuguilla","rank":[70,85]}]