[{"title":"I really liked it","rating":8,"date":"13 August 2000","review":"This movie has many weaknesses, but there is something really superior about it nonetheless.  On the negative side, everything people are saying is true; the dialogue is clunky, the plot is predictable, and the chemistry is weak. On the other hand, the charisma of both the leads is amazing and I really fell in love with Winona Ryder's character.  I think the makers of this film were resigned to the the fact that as far as writing was concerned, they weren't breaking any new ground.  What they did instead was dress up the standard love story with great actors, nice clothes, and pretty settings. Despite the gloss, there is a story here that everyone can identify with at some level.  The result, in my opinion, is something magical that I can't pin down.  I think it's a success.","user":"Matt-115","rank":[36,40]},{"title":"Something to redress the balance !!","rating":30,"date":"30 March 2001","review":"Whilst everyone is naturally entitled to their own opinion, I was rather shocked to read the large number of negative comments about this film on the site.  A redress is therefore  more than necessary ! Compared to a lot of the violent rubbish we get in the cinema today, here is a film without violence, beautifully made,  and concentrating on \"L O V E ! \" Naturally the story is all the more intense as we know that one of the protagonists's days are numbered, and why not indeed ? A parallel may be drawn with the film LOVE STORY but in AUTUMN  IN  NY, the dialogues are much less crude and closer to reality. The film is technically, plastically, very beautiful ( I m very sensitive to Autumn leaves ) and this film ranks with the best in the autumn ' genre ', ie, \"All that Heaven allows\", featuring Rock Hudson &amp; Jane Wyman, and \"The Trouble with Harry\" by Alfred Hitchcock. Rarely is autumn sunlight put to such good use as in this film. The subtle autumn light of New York accompanies the autumn of Charlotte's own short life towards the winter's snow and her voyage into eternity. Too much emphasis is placed on the difference in age between the two protagonists as well as supposed flaws in their characters. Who cares ? Love is Love ! Why should't a play-boy discover true love ? I think it is wonderful. Let's face it, true love is the only thing in the whole wide world that all peoples can agree on ! This film is reminiscent of the great American weepies of the 40's such as Waterloo Bridge or Random Harvest,  but with present-day film quality as an extra a bonus. Unfortunately, these kind of romantic melodramas seem to have lost favour with the public today, which is a great great shame, as romance and love are eternal themes which will never die. I think the film will stand the test of time and hopefully at a future time when violence and evil sentiment on the cinema screen will be less sought after than today will come onto its own. Indeed a second viewing of the film allowed me to appreciate even more the plastic beauty of the film which I missed the first time round as I was worried how it was going to end. In addition to that I was even more impresses the second time round by the performance to the two actors. So long live beauty and romance as portrayed in this film and let's hope there'll be more to come in the cinema of the future.","user":"nicholas.rhodes","rank":[54,65]},{"title":"A nice surprise","rating":7,"date":"31 January 2003","review":"Although a little boring at some points \"Autumn In New York\" managed to truly emotionally entertain and interest me. Even after seeing it I am still discovering the hidden meanings it tries to give us. Ironically despite being a romantic drama the romance between the main actors is the biggest downer of this movie. I must have missed the part when Winona Ryder's character's age is revealed, but she just doesn't pass as a 21 year old. I thought she was supposed to be like 26 or something. Not that there's a big difference in age, but she was a bit misscast, despite her child like face. On the other side she was really attractive in this movie and constantly reminded me of this cute girl I know. Gere looks and feels pretty old, but he's a believable 48 year old playboy. The movie is hence held together by good dialogues and nice and memorable scenes. There's also a great line Gere says to Winona after he cheats on her and realizes he screwed up: \"Can you let me love you?\" I've read some pretty different explanations of this movie, but basically I think it's about Gere's character slowly discovering he's been missing a great deal of life, he's never loved. So after \"accidentally\" falling in love with Charlotte he can't bear the though of her dying and tries everything in his power to prevent her death(this might have something to do with his previous life where he was always the one with power, whilst the women weren't). But he has to realize that in Charlotte's case he's completely powerless and there's where the point of the movie lies. He chose true love (despite knowing that Charlotte was going to die soon) over the life he thought he was happy with. It might sound ridiculous but I kind o envy the guy. I too would rather truly love a woman, if only for a short period of time, than spend a life with a woman I didn't love. I would be a happier man, even after that true love would, for some reason or another, leave me, because I'd know I loved, even if it didn't last. I was pretty surprised at most of the bad reviews and comments, but on the other side I couldn't help but to agree with most of them. It is a crude love story and it is somewhat predictable and boring, but it was overlooked for the most important reason it tries to tell us. Despite being an unconventional and hardly believable love story \"Autumn In New York\" is a movie that in the end managed to show me you have to take even the biggest sacrifices to find true love. Sad and Beautiful.  7/10","user":"bsinc","rank":[29,37]}]