[{"title":"A truly fun movie","rating":8,"date":"25 April 2003","review":"This is one of the best action-comedy movies that I have ever seen. The movie is full of hilarious one-liners, and action too. The plot is very original, not like a scheme I have ever seen in a cop film before. Don't watch this movie expecting it to be like Lethal Weapon, this isn't a film to be taken seriously. It's about a young, renegade 20-year old who takes over a special police unit after his brother, who ran the unit, was killed. This is a good action-comedy that will keep you laughing through the whole film. And Milla Jovovich is in it to boot...yeah, I'm a guy, sue me.","user":"Timberwolf788","rank":[31,36]},{"title":"Good, lightweight entertainment","rating":7,"date":"31 July 2002","review":"\"Kuffs\" is a fun, slick action-comedy that you just appreciate for what it is.  It doesn't even make an attempt to be a landmark cop movie like \"48 Hours\" or \"Lethal Weapon,\" and that's what it makes it work.  It's tongue-in-cheek and completely unpretentious.  And Christian Slater is the glue that holds this film together.  He's one of my favorite actors (who's quite underrated) and it's his credible, charming, charismatic performance that really makes this film tick.  Though this is not one of his serious character roles, he seems to be having a lot of fun and really entertains us with his effervescent presence.  <br><br>The moment you see Slater talking to the camera in the opening scene, you know this is not a movie to be taken seriously.  In fact, this can even be classified as a farce.  The material doesn't always seem suited for the big screen (more for the small screen in a TV cop show), but big screen or not it's damn entertaining.  My only criticisms are a few cartoonish scenes which are just plain silly, one being Tony Goldwyn drinking coffee spiked with narcotics and stomping around like a Looney Tunes character. <br><br>\nMilla Jovovich is beautiful to look at, the humor is often fresh and funny, Slater is very entertaining and there's some exciting action to boot. Sounds good?  It does to me.  <br><br>My score:  7 (out of 10)","user":"mattymatt4ever","rank":[20,25]},{"title":"Good clean violence and side-splitting comedy!","rating":8,"date":"20 May 2000","review":"This movie is one of my favorites. I saw one scene of it (the dry cleaning store scene) when I was 8, but I was too young to care. Fast-forward to about 2 weeks ago, when my mom rented me some movies, and I fell in love with Kuffs.<br><br>Christian Slater pretty much plays the same character: a smart-alec with the ability to kick some @$$. I love the way he can play that role in this movie, with a hilarious joke or monologue to the viewers just about every other minute!<br><br>Sure, it has its rough spots: the action could have been better, and I would have liked to see a little more of Milla Jovovich, but overall, it's a winner. <br><br>I give it a 9 out of 10.","user":"diovorez","rank":[25,34]}]