[{"title":"I enjoyed this movie","rating":6,"date":"23 February 2020","review":"This Movie Is Stupid, Dumb, Messy... Yes It Is. But Angelina Jolie Style Along Some Cool Set-Pieces And Action Scenes Made \"Lara Croft: Tomb Raider\" my All Time Guilty Pleasure. Because At The End, Did I Care About All This Mistakes? No.","user":"MR_Heraclius","rank":[38,40]},{"title":"Thoroughly enjoyable and not too serious","rating":10,"date":"23 March 2018","review":"I don't know why the ratings for Jolies Tomb Raider movies are so low. The story may be a bit cheesy but so were the games. Angelina's performance as Lara is perfect. Love rewatching this from time to time. Fun movie. I think after the new adaption 2018 tomb raider movie maybe gamers and fans of Lara will appreciate Jolies Tomb Raider a lot more.","user":"laura_e_dillon","rank":[72,86]},{"title":"I was entertained.","rating":7,"date":"10 June 2003","review":"\"Tomb Raider\" is a harmless diversion that should please its core audience. I loved the performance of Angelina Jolie, who brings the computer game heroine Lara Croft to life. I watched an interview with Jolie in which she said that she really \"became Lara Croft\".<br><br>With her mock British accent, Jolie is a lot of fun as the adventurer-archaeologist who is equal parts Bruce Wayne and Indiana Jones, but with a much better body.<br><br>Taking its cue from the video game, the film's screenplay is more of a puzzle than a plot. The script is a patchwork of ideas that plays like a Greatest Hits collection of other films. It deals with end of the world stuff, but it never feels apocalyptic. It's controlled chaos, utterly lacking in surprise. The script jumps from one expected moment to the next, never apologizing for its lack of originality.<br><br>At least Jolie understands the limitations of the script. There's enough conviction in her performance to make you want to believe in Lara Croft, the spunky heiress is who is equally at home in her spacious mansion or within the catacombs of a lost tomb. She's guided by the spirit (both literally and figuratively) of her late adventurer father, Lord Croft (Jon Voight), and assisted by an archaeologist Alex West (Daniel Craig) and cyber-geek creator Bryce (Noah Taylor).<br><br>The film opens like \"Raiders of the Lost Ark,\" with Lara Croft deep inside one of those musty, dusty tombs. Instead of outrunning a giant boulder, Croft squares off against a mechanical monster, a robotic menace that seems to come out of nowhere. It doesn't. We learn that it's a creation of Bryce, used to keep Croft on her toes.<br><br>Angelina Jolie made the perfect Lara Croft; her facial expressions and sly smirks added a personality to the flick that I can only imagine the video game is missing. She seemed smart, brave, and composed as well as full of emotion. Okay, maybe the parts with her father (real-life papa Jon Voight) were a little over the top, but since the whole movie is just eye-candy anyway they seemed to fit.<br><br>The fight scenes among ruins got me. How can you not love Lara Croft jumping onto a swinging obelisk to smash a glass eye that holds the key to time, or sledding thru an ice cave being pulled by dogs? Or the scene where the villains jump through her castle windows as she rappels around the walls, smashing chandeliers and pistol-whipping bad guys? What's a girl to do but hop on her motorbike, take a guy out sideways, and race off at 100 miles an hour? Excellent.","user":"kpickette","rank":[89,112]}]