[{"title":"Gilliam's Masterpiece of Madness","rating":10,"date":"29 November 2000","review":"Terry Gilliam's fantastic, twisted story of a virus destroying all but a handful of people across the Earth and forcing them to move underground and the man sent back in time to gather information about it is a fantastic, dizzying, and highly stylized film that boasts Bruce Willis' best performance ever.<br><br>What sets 12 Monkeys apart from most time-travel sci-fi movies is that Bruce Willis character actually deals with what the psychological effects of time-travel, that is, not knowing what reality is actual reality: the place that the time-traveler comes from or goes to.  Also, the film recognizes that things that have past cannot be altered and that the prevention of a cataclysmic event, in this case the release of said virus, cannot be stopped or changed.  As Willis asserts \"It's already happened,\" while he's in a mental hospital, the major dilemma the film trudges into is not a trite, overdone plot to save the world; instead it's Willis' inner struggle to simply survive himself.  It's a fresh, innovative concept, and it works beautifully thanks to a tautly written script by Peoples and Gilliam's unique brand of dementia.<br><br>Besides this, 12 Monkey's storytelling is totally non-linear and instead opts to distort and bend the way the story is told skillfully incorporating a bevy of different time sequences: flashbacks, dreams, memories, the present, the past, the future, and even a scene that is lifted out of Hitchcock's Vertigo.  All serve to envelop the viewer into its disturbing cacophony of madness and futility.<br><br>Visually, Gilliam is a master of desolate umbrage and shadow rivalling Tim Burton in his strikingly despondent scenery and imagery.  With cold, wide, and immersing cinematography, Gilliam plunges into the colorless surroundings and darkness of his characters.  The scenes are often bathed in a strangely antiseptic, dead white and help serve as a contrast to the often veering-on-madness characters.<br><br>Performance-wise, Brad Pitt steals most scenes, filling them with a patented loony, off-the-wall performance that deservedly garnered him an Oscar nomination.  As mentioned, Bruce Willis gives the best performance of his career, not reverting to his heroic cliches and cardboard hero and instead portraying Cole as a simple, poignant, tragic everyman.   Equally good is Madeline Stowe as Willis' psychologist.  She holds her own, injecting her character with both wild energy and strength as she collapses under the weight of what she comes to believe is a false 'religion.'<br><br>Gilliam's expert, overwhelming, and complex handling of what could have been a routine action/sci-fi film makes 12 Monkeys a compelling vision of a nightmarish, futuristic landscape.  Its rich, well-thought out, intricate storyline along with bravura performances from the entire cast and its brooding, bleak cinematography make it a masterpiece of madness.  Ranking in my top 10 of all time, 12 Monkeys is a darkly lavish spectacle of a film brimming with brilliance.<br><br>10 out of 10","user":"darkjosh","rank":[624,678]},{"title":"Imaginative, clever, engaging and very enjoyable  one of the best sci-fi's I've seen","rating":13,"date":"13 February 2005","review":"In the future humans exist underground, the surface having become uninhabitable due to the release of a virus years before in 1996. The ruling classes are scientists and large sections of the population are held as prisoners in tiny cells; prisoners who \"volunteer\" to help work out what happened back in 1996 that killed off 99% of the population. Requiring information about the visit, James Cole is sent back to 1996 to gather what information he can. However, sent to 1990 by accident, Cole finds himself in a mental hospital where he meets From the very start this film marks itself out as being very much a Terry Gilliam product and those who hate his work will probably dislike this film for the same reason. However, pleasing people like that is not my concern and 12 Monkeys is actually one of Gilliam's most accessible films as it sets his imaginative style within a narrative that is satisfyingly complex and thoroughly enjoyable from start to finish. The story is not perfect though, the connection to the start is nice but the ultimate twist behind the virus just seems to have been thrown in to keep the film tidy; a minor complaint though because even then the main thrust of the story (Cole) keeps it together. The twisting plot plays with both Cole's and our sense of reality and it is genuinely gripping from start to finish Gilliam's direction is superb, whether it be the realistic world of the 1990's filmed with clever angles and shots or the wonderfully twisted world of the future, it is all excellent and was such a pleasant find in my local cinema at the time.<br><br>The film benefits from great turns from the cast. Willis was having a bit of a career resurrection in the mid-90's when several films showed us that he could actually act  for me, 12 Monkeys was one of them. Willis is superb as he spins from madness to sanity and back again; he underplays all the way and is so much better than the wise-cracking everyman that he is better known for. Pitt is just as good but in a different way. Getting an Oscar nomination that he deserved, Pitt risks overdoing it but pushes his crazy performance as far as he can without being indulgent  I'm not saying he is perfect but I would could this as one of his best performances to date. Stowe is very much in the shadow of these two but she holds her own well. Morse, Seda, Meloni and Plummer are all good in minor roles but really the film belongs to the lead three  Willis in particular and Pitt in a great supporting role.<br><br>Overall this is a great sci-fi; the story is great and is only helped by Gilliam's imaginative direction and awareness of the fantastic. Meanwhile the cast are very strong, with the famous leads giving some of their best performances to date. Downbeat, imaginative, engaging and one of the more accessible of Gilliam's films, it stands out as one of the best American sci-fi's of the past few decades.","user":"bob the moo","rank":[139,157]},{"title":"So you're telling me those people in the mental institution are... crazy?","rating":9,"date":"15 September 2007","review":"Just kidding, I rented 12 Monkeys the other day because I am a huge Bruce Willis fan and I heard some things about the film. Some good and some bad, but it was one of those films you had to pay attention to every second, so I was a bit worried. Just because I felt like for a minute if this was going to be one of those films that I had to watch several times to get. But I watched it last night and I was really impressed, this movie had everything in it: action, drama, sci-fi, history, dark humor, and even a little romance. The actors all did a terrific job, I give a lot of credit to Bruce, during his scene in the car with his psychiatrist, he really got to me. But Brad Pitt, I'm just amazed with how much of a great job he did. He didn't over do his character, who was crazy, and just made it work and was extremely believable. The story was just scary, but very good and a wake up call.<br><br>James Cole is a man in the future where a virus broke out in the past and killed 5 billion people and only 1% of the population survived including him. Animals are now ruling the ground above while the humans are down below, but scientists send James to the past of 1990(really meaning to send him to '96), to find out about information of the virus. James gets put into a mental institution meeting his new psychiatrist, Dr. Kathryn Raily and another mental patient, Jeffrey Goines. He tells them the future, of course no one believes him, he goes back to the future. But the scientists send him back to the correct year to where the doctor is kidnapped by James, but he tells her more, and believes him. Now they are set on trying to prevent the virus from ever happening.<br><br>12 Monkeys was an incredible film. Like I said the story was so scary just because it's not at all hard to believe that we are not far from that happening. But the whole movie was just great, the cast, the sets, just the whole picture was a great one. It had a Terminator type of feel to it where we might loose something precious one day, ourselves if we don't listen to others. What is right and what is wrong? Who knows? But I would highly recommend 12 Monkeys, it's a great movie that if you give it the proper chance, I'm sure you'll enjoy it.<br><br>9/10","user":"Smells_Like_Cheese","rank":[223,259]}]