[{"title":"A 90s Sleeper: intelligent humor, A-list cast, don't miss it","rating":9,"date":"28 April 2009","review":"I loved this movie...a real 90s sleeper. It's hard to determine why some films don't get the attention they deserve. The Paper is delightfully acted by an A-list ensemble in their prime. It's hilariously funny, with great timing and pace, and some poignant overtones on commitment, loyalty, family, friendship, work and the workplace, and big city journalism.<br><br>Feel-good and sardonic at the same time, I did NOT find it completely predictable. The screenplay is terrific, with thoughtful, intelligent, brisk dialog. Not a dull moment; completely entertaining. A film for \"grown-ups\". More kudos to Ron Howard.<br><br>Renting it just to watch the superb Glen Close's character, especially in the \"stop the presses\" scene, is worth the time/money alone. A charming Marisa Tomei perfectly cast. Robert Duvall, Jason Alexander, Jason Robards, and of course Michael Keaton...what's not to like? One of those films that can be watched many times by men and women alike. Highly recommended.","user":"windsong353","rank":[21,24]},{"title":"The Paper Delivers!","rating":10,"date":"15 November 2006","review":"A funny, fast-paced and fascinating film, THE PAPER delivers. Michael Keaton is remarkable as Henry Hackett, a newspaper editor torn between the two loves of his life: his exhausting job and his long-suffering (and pregnant) wife. This juggling act plays itself out during one particularly frenzied day in which Hackett must weigh a better job offer while trying to outscoop his deep-pocketed competitors on a murder story.<br><br>It's a cliché to say so, but there's never a dull moment in THE PAPER. The multi-faceted storyline sucks the viewer in and doesn't let go until after the exciting, root-on-the-good-guys finale. An interesting film could have been made about any one of the angles explored here, be it the incredibly hectic behind-the-scenes workings of a major daily, the personal toll such an operation takes on its employees, or the media's tendency to oversimplify. To combine these into one film results in an infinitely mesmerizing piece of work. And let's not forget Ron Howard's direction, which is smooth and virtually flawless. The writing is equally brilliant. Whatever reaction the film tries to inflict -- laughter, excitement, surprise -- it inevitably succeeds.<br><br>The performances in THE PAPER deserve special mention. Everyone is so well cast that it's impossible to picture anyone else in these roles. Keaton has never been better in a starring role that is tailor-made to his comedic and dramatic abilities. Robert Duvall is on top of his game as the publisher whose job has cost him so much in other areas of his life. Marisa Tomei, as Mrs. Hackett, proves MY COUSIN VINNY was no fluke. (The scene where she glares at her husband in disbelief as he tells her he has to miss an important dinner with her parents is absolutely priceless). Randy Quaid is as quirky as can be as the paper's resident columnist. And although his appearances are brief, the late Spalding Gray is unforgettable as the head of a rival paper. This group of actors may very well comprise one of the most talented ensembles of the 1990s.<br><br>It's a shame THE PAPER has never received the attention it deserved. Had it been released 50 years ago, in a less cluttered era, it would most certainly be widely hailed as a classic today.","user":"ReelCheese","rank":[33,42]},{"title":"Why can't I stop watching this?","rating":10,"date":"3 August 2007","review":"I usually find Ron Howard's work a tad self-indulgent - you only have to watch Apollo 13 to know what I mean. However, with this, Ron really delivers a fully watchable film.<br><br>There are classic comedy moments - the Glenn Close \"I light a cigarette...\" line is just brilliant - while also providing true pathos with an excellent performance from Marissa Tomei (a disappointingly under-rated actress in anything she is in - witness her performance in Mel Gibson's otherwise rubbish \"Whast Women Want\").<br><br>I saw this in the cinema, and own it on DVD - it features in my regular rotation, and it doesn't matter how many times I watch it, it is still good viewing. A sign of a classic film is how often one can view it without finding scope for criticism - nothing yet!","user":"stevendocherty","rank":[24,30]}]