[{"title":"Applauding the guts","rating":9,"date":"27 September 2001","review":"From time to time a group of people with a lot of guts come forward and challenge something, that every average thinking producer would get nightmares to even think about making it.<br><br>Fear of failing must come to mind, if the setting says:<br><br><ul><li>only one actor for 80 min (and one dead body)</li></ul><br><br><ul><li>40 min of it basically limited to: \"Hello,.. What's that?.. Albert Miller,.. Over here,..\"</li></ul><br><br><ul><li>no BGM</li></ul><br><br><ul><li>no adrenaline injections with savages, sharks, snakes etc.</li></ul><br><br><ul><li>just plain \"Life is hard enough as it is.\"</li></ul><br><br>\nI loved it for:<br><br><ul><li>the guts of making it</li></ul><br><br><ul><li>the heartbreaking and real-to-life love story</li></ul><br><br><ul><li>Tom Hanks' performance</li></ul><br><br><ul><li>his companion Wilson</li></ul><br><br>\ngreat movie / must see","user":"marcgmiller","rank":[525,599]},{"title":"Outstanding","rating":10,"date":"8 March 2002","review":"I think this is an excellent movie..I've noticed many felt it \"too long, boring, etc...\" which is to be expected in today's \"gimme non-stop action; I haven't been doing anything for 5 minutes, I'm bored\" mentality.  This was a true man vs nature movie that really made me think about what I take for granted and I found myself wondering how I would react in such a situation. Would I talk to a volleyball?  you betcha...anyone who has spent any significant time alone can relate.  Bought the DVD and will watch it for years too come.","user":"jspratjr3","rank":[386,444]},{"title":"Amazing performance shines through","rating":9,"date":"22 December 2000","review":"Robert Zemeckis has his 4th best film here (behind Forrest Gump, Who Framed Roger Rabbit and Back to the Future) with Cast Away.  Sure it might be overhyped and some characters in the film aren't needed (not to mention it depends on the liking of the lead), but when you have Tom Hanks working harder than any actor in a movie this year, it is worth it.<br><br>The story follows Hanks as a dedicated fed-ex deliverer who has a fiance (Helen Hunt) and has to leave her Christmas time to go to Asia, but alas, the plane he's on crashes in the water and, dare I say more (well I can because practically everyone saw the all-revealing trailers)?  Well, Hanks arrives on a deserted island and then the real fun begins as he survives in a primitive way (probably remenicent of 2001, Hanks' favorite film), and even finds a silent companion named Wilson (a volleyball).  That Hanks can communicate with this volleyball, and almost make the ball as a real person with real feelings that is almost like the Silent Bob to his Jay, is one of the films triumphs.  The others of course being the whole lot of him on the island and Hanks' performance.  If it was someone else, it would not be as successful, but Hanks gives his all and (as usual) pulls through 5 fold delivering one of the years and his best performances. A-","user":"Quinoa1984","rank":[184,220]}]