[{"title":"Technically impressive with great script and sharp wit","rating":22,"date":"22 April 2003","review":"Andy's toys live a reasonable life of fun and peace, their only worries are birthdays and Christmases, when new toys could easily replace those already there.  One such birthday Andy's top toy, Woody the cowboy, finds himself in direct competition with Andy's new Buzz Lightyear doll.  When rivalries boil over Woody tries to hide Buzz down the side of the bed but accidentally pushes him out the window, the other tops expel Woody, and he leaves with no choice but to find Buzz and return him to the house.  But with only two days before Andy moves house, time is of the essence.<br><br>Given how often the same mix of animation, wit, jokes and kids humour has been used since Toy Story (Ice Age, Monsters Inc, Bugs Life) it is easy to forget how refreshing it was when it first came out.  I have just watched it again and it is dating a little in comparison to more recent twists on the formula.  It seems each one has to be sharper and have more references etc in the background.  However it is still very funny and deserves praise for being the first of a successful formula.<br><br>The plot is simple but effective and actually has genuine drama and excitement to it.  The main story is fun but the degree of character development is what really shores it up.  The conflict between Buzz and Woody is taken deeper than this and, when confronted by the truth of his status as a toy, Buzz's turmoil is very real as opposed to him being a cartoon character and nothing more.  Despite the two strong leads there is a real depth in the support cast.  They may not actually have that many lines, but they have all the funniest lines.  Most of the `adult' wit comes from the Potato Head, dinosaur, the pig and slinky dog.  They are funny and are very well used.  In fact the majority of this humour and plot will go right over kids heads.<br><br>Looking back on it, I do feel a cynical edge on it in so much as this film must really have helped sales of the toy companies in the film.  It's hard not to see the marketing department standing behind this film rubbing their hands.  However the actual product is so wonderfully fun that I forgot this quickly.  The voice work is excellent and the characters match the actors. Hanks is good as Woody and Allen has a good B-movie type voice for Buzz. Varney, Ratzenberger, Ermey (doing his usual), Rickles and others are all really good in the support roles and, probably, come out as the favourite characters for adults.<br><br>Overall this is a classic film that will appeal to adults as much as to kids (if not more).  A good plot and a really sharp script make the already short running time fly by.  The only downside is that your kids will want you to go out and buy the damn things!","user":"bob the moo","rank":[106,112]},{"title":"Best animated movies ever made","rating":10,"date":"15 February 2020","review":"Toy Story is one of my favourite animated films! Even as an adult I can still watch it and be entertained. This film is not only nostalgic but is relatable, emotional and a lot of fun!","user":"MR_Heraclius","rank":[41,42]},{"title":"Created a decade ago, but still stunning","rating":9,"date":"25 December 2004","review":"I am a big fan of the animated movies coming from the Pixar Studios. They are always looking for the newest technological possibilities to use in their movies, creating movies that are more than just worth a watch, even when they were made a decade ago.<br><br>The movie is about toys that come to life when their owner is asleep or not in the same room. When the young boy's birthday is coming up, all the toys are nervous. They don't want to be ignored when the new one arrives. Woody the cowboy is their \"leader\" because he's the most popular one of them all. He's the only one that hasn't got to be afraid, but than a new favorite arrives ... Buzz Lightyear. He hates him and tries everything possible to get rid of him, but as the time passes by they learn to appreciate each other...<br><br>When you see Toy Story, you may think that the different human like characters (Woody the cowboy for instance) aren't always as perfect as we are used to see in todays animated movies. Perhaps that's true, but if you keep in mind that all this was done in 1995, when computers weren't yet as strong and the technology for creating such movies was almost unknown, than you can only have a lot of respect for what the creators did. I loved the story and liked the animations a lot. I give it an 8.5/10.","user":"philip_vanderveken","rank":[139,154]}]