[{"title":"Some great character acting","rating":7,"date":"30 January 2014","review":"OK. So a couple of actors are so painful you can barely keep going, I'll admit that. 2 of the producers cast themselves and drag every scene they're in into painful moments. However, it's no worse than Your typical sitcom actors. I think it's the result of lazy directing. Those who do stand out are the ones with a ton of movie experience in their background and clearly didn't need any direction. Much like Cannibal the Musical, the plot comes secondary to the high jinks.<br><br>The bear is almost non existent which is weird. They talk a lot about it...but it was seldom seen. I suppose insurance was too much? <br><br>The bear is clearly not golden and I never figured that out... <br><br>The lead child actor seems to be hard of hearing... <br><br>The thing is that there are such a great characters that stand out so much you just wait for them to hurry up and get back on screen. Cheech Marin's incredible natural talent shines thru once more and goes to show his fame is well earned. I have to say the same for Danny Woodburn, who's smoldering good looks are hard to ignore even though the character is supposed to just be comic relief. George Buck Flower has a great naturalness and I want to see more of his work. He brings up the level of acting in each scene he's in. Kevin Brophy and Richard Molinare are simply adorable playing alongside him. <br><br>What about Mr. T ? Well folks...he's Mr T. Kids love him. All in all this is a cute little film that has a plot that lost my attention as I was so distracted by the vast differences in talent. The bad actors make me think It's a good example of why some people find that the good guys are boring and the good actors make understand why some folks think being bad is more interesting.","user":"imarriedshrek","rank":[0,0]},{"title":"A very sweet film for the whole family and especially young children.","rating":7,"date":"9 August 2000","review":"The third in a sequel; this sweet an unpretentious film entertains young children as well as adults.  Cheeh Marion is excellent as the magician and Mr. T delivers a surprisingly strong performance as mysterious woodsman. There are plenty of scenes with animals and a large cuddly bear that keep the story moving.","user":"White Weasel","rank":[1,2]}]