[{"title":"Arrrr, I want me gold!","rating":7,"date":"7 June 1999","review":"Most film critics will tell you that sequels are, as a rule, inferior to their predecessors. By there very nature they are derivative, the bastard child of what was once a good idea. Sequels, especially ones of highly successful films, are almost necessarily cursed with a dearth of creativity, made simply to make money, a cynical perversion of the \"art\" of moviemaking.<br><br>That's why you have to see Leprechaun 4: In Space. A fearless fourth in the Leprechaun horror series, In Space breaks rules that either aren't written yet, or simply could not be broken by celluloid alone. A completely original feat, it was borne not from a good idea, but a very, very, very bad one. It succeeds a highly unsuccessful film, and if there's anything it doesn't lack, it's creativity. And trust me when I say this, L4 (as I like to call it) was definitely not out to make money. Rent it now!  Rent it today!","user":"Blakjak","rank":[19,19]},{"title":"Possibly the best movie involving a Leprechaun in space...Ever!","rating":11,"date":"11 March 2002","review":"Leprechaun in space has all the qualities for this years Oscars... despite the fact that it did not come out this year. The leprechaun displayed so much soul in the film i forgot that he was trying to kill at all. i even cried when he blew up for the third time, never mind that they used the same footage as the first two times he blew up. Brilliance pure brilliance. Not once did I wish for my eyes to be gouged out as i did while watching the atrocious \"Astro Zombies.\" Ever scene captures your heart, from when the leprechaun comes out of a mans penis, to the totally unnecessary breast shot. The world would be a better place If there were more films like Leprechaun and less like \"Trucks.\" Four out of Four puke buckets.<br><br>Also check out \"Leprechaun in the Hood\" and the fantastic miniseries \"The Voyage of Mimi.\"","user":"Buggy-4","rank":[23,25]},{"title":"Exquisite","rating":7,"date":"27 June 2002","review":"Leprechaun 4 is that rare film that takes you to a place you never knew existed.  In this case it's the world of everyone's favorite leprechaun who has somehow ended up roaming around in space and decides to terrorize some unsuspecting travelers.<br><br>The acting is horrendous, the special effects are ultra cheesy, and the story, well, what story?  And that's why this film is so great!  My favorite part is the decline of Dr. Mittenhand.  It creates a parallel to the life of one man, his struggles, his torments, and his eventual transformation into some sort of demented spider/human hybrid.  Who hasn't dealt with that same trama and those same pains in their own lives?  When his metamorphosis is complete, and he declares his new identity in the heart-wrenching line, \"I am no longer Mittenhand, I am Mittenspider!\" it is a true milestone reached in cinema.<br><br>And of course the Leprechaun represents the antagonist in us all.  Big evil comes in quite the small package.  The leprechaun, in his quest for his gold, is simply a puppet of capitalism and corporate greed.  I think we could all learn a big lesson from this little fellow.<br><br>So, to summarize, I give this film a 7, because it is slow at points, but the occasional leprechaun in the pants scene redeems it all. Bravo!","user":"scarlet caulfield","rank":[30,34]}]