[{"title":"Nice Characters, Nice Message","rating":8,"date":"27 October 2006","review":"This is an almost all-black cast featuring many prominent black actors and singers. The most famous one, Bill Cosby, has several scenes but no lines of dialog! What makes the film appealing is its innocence and charm. There is hardly any profanity, there is a good-hearted likable hero (\"Jefferson Reed\" ) Robert Townsend) and a nice story of good folks trying to get rid of destructive violent neighborhood gangs.<br><br>It's hokey; it's corny, it's sometimes stupid but there are some genuinely unique and funny scenes in this film as when \"Meteor Man\" talks to his dog or when he does some amazing feats to save his friends.<br><br>A fun, lightweight film that - yes, the whole family can enjoy. It's a sad comment that it got so few reviews. Apparently, most people here would rather watch evil, nasty characters. I think it's refreshing to see some nice people and good role- models exhibited for a change.","user":"ccthemovieman-1","rank":[25,26]},{"title":"Ambitious and refreshing","rating":6,"date":"20 December 2000","review":"Following an encounter with a mysterious meteorite, a Washington D.C. school teacher (Robert Townsend) discovers that he has developed super powers and subsequently uses them to become a caped crusader against the forces of evil in his own inner-city community.  Although the ambitious, imaginative script is loaded with misfired comedic gags, it does produce several genuinely amusing sequences--in particular, the climactic showdown between Meteor Man and his golden-haired drug lord nemesis.  Biggest plus: the extremely talented (but frustratingly underused) supporting cast that reads like a Who's Who list of black television and movie greats.  It includes: Bill Cosby (\"The Cosby Show\" and \"Ghost Dad\"), James Earl Jones (\"The Great White Hope\" and \"Roots: The Next Generation\"), Marla Gibbs (\"The Jeffersons\" and \"227\"), and Robert Guillaume (\"Benson\" and \"Lean On Me\").<br><br>Also, it's just plain refreshing to see a 1990's larger-than-life black superhero/role model in a family-oriented film.","user":"Orisha Shango","rank":[11,12]},{"title":"Seriously silly fun.","rating":1,"date":"1 November 2002","review":"I think the previous commentor missed the point of the movie.  This movie is intended to be silly fun, not a serious superhero movie.  Granted, Townsend's comedy is not always ROFLMBAO hilarious, but the movie has a good message about coming together to fight evil and the showdown at the end, where both antagonists use the powers gained from various books to fight each other, almost makes the movie worth the price of admission.  Its a \"I've got nothing better to do and some time to kill\" matinee movie, but still worth watching once.","user":"nehesi","rank":[16,19]}]