[{"title":"Inspired by...?","rating":24,"date":"24 October 2004","review":"There are many deviations from the accepted facts of Jeanne d'Arc's life as set out in her trial documentation and the writings of the time. This said, the central question of whether she was a saint, an inspired lunatic, wholly mentally ill, or simply a headstrong girl determined to grab her chances while she could is well asked. Many of the comments here assert that Besson makes it clear that the Maid was simply mentally ill, yet I read the film as deeply ambivalent about what was going on. Were her visions the hallucinations of a schizophrenic? Were they given by God? What's the difference? More questions are asked: Why does an omnipotent, omniscient, all-compassionate deity allow terrible things to happen? What is the meaning of kingship - to own or to serve? What is the difference between taking the lives of individuals and killing en masse? What's the difference between Christianity and the earthly institutions of that religion? Where does conviction end and fanaticism begin? <br><br>Jovavich's Jeanne is plagued by the difference between her idea of utter submission to God and the consequences of doing so; by doubt over the veracity of her visions; and by the gap between her ideals of the divine rights of kings and realpolitik. She is constantly on the verge of a nervous breakdown - is this a manifestation of her mental illness, or of her \"burning for God\"? And where's the difference between the two?<br><br>The film raises more questions than it answers, and that's as it should be. It is something of a shame that Besson's film takes liberties with the facts as we understand them (though history is more often about our interpretation of events than the events themselves), but in terms of raising important questions on the nature of faith, it succeeds beyond measure.","user":"Mercian","rank":[103,123]},{"title":"France's Tragic Teenage Warrior Messiah","rating":8,"date":"19 August 2008","review":"I found Luc Besson's take on the story of Joan of Arc thoroughly compelling. Like all of Besson's films, The Messenger is highly stylized, nicely cast, and visually powerful. The film is also forgivably anachronistic in terms of language while developing a strong period feel through sets and costume. <br><br>Joan was, of course, the deeply religious teenage girl who lead Prince Charles' army to improbable victory over the invading English at Orleans and helped re-consolidate French sovereignty. Joan considered herself God's appointed messenger, and France apparently saw her as an avenging angel. Today, she is commonly regarded as a schizophrenic. She was canonized in the 1950s, 500 years after her death. Regardless of whether God or insanity was the source of her strength, power, will and incredible courage - there is little ambiguity about her role in the salvation of France nor the fate that awaited her afterward. <br><br>In general, the acting is quite good. Jovovich's much-maligned performance is actually very good and exactly appropriate for what Besson was trying to do with the film. Comparing Joan of Arc to her other Messianic role as Leelu in the Fifth Element is, frankly, ridiculous. I believe that the problems people find in Jovovich's performance are problems those same people bring to the film. Malkovich and Dunaway are phenomenal. Tcheky Karyo and Vincent Cassell provide excellent support. <br><br>Besson strays from what we think we know about the details of Joan's story, but only to present the truth of the big-picture more accurately. His film steadfastly refuses to answer the questions many people will bring to it: <br><br>* Was Joan schizophrenic? * Was she a catholic messiah or divinely inspired prophet?<br><br>Why is Besson so careful about accurately presenting the ambiguity of the story? I think he wanted to make a moving film, but not a film which would unsubtly challenge its audience's beliefs. If you do not believe, you will tend to explain Dustin Hoffman's character as a manifestation of Joan's psychological problems. If you do believe, you may want to think of him as Satan, am angel, perhaps both. Thus, Besson, who is a deeply spiritual person, makes a powerful statement about faith through his metanarrative while maintaining an appropriately unevangelical position. He took similar paths in his more uplifting films The Fifth Element and Angel-A.<br><br>Highly recommended for Besson and Jovovich fans. Not a biography - avoid this if you must have the \"plain\" facts! Mildly recommended as a piece of historical fiction.","user":"mstomaso","rank":[35,43]},{"title":"A mesmerising character study","rating":10,"date":"10 February 2016","review":"I love epic historical movies, both old and new (although I must admit I lean towards the latter - the more realistic, more visceral ones, like Braveheart or Gladiator). The story of Joan of Arc has been put on the silver screen countless times, and most versions are good. With such a captivating story, you cannot really go wrong.<br><br>In Luc Besson's take, however, it's not Joan's trial that takes centre stage, as in, for example, Carl Theodor Dreyer's classic (The Passion of Joan of Arc, 1928), but Joan, the self-proclaimed godsend, the driven, suffering, obsessed warrior, and the very human core of her actions. The film remains wonderfully ambiguous throughout and leaves it to the audience to decide which of the different interpretations they believe to be true.<br><br>But it is Milla Jovovich's riveting performance that truly makes this movie. She's literally possessed in her role, playing with such fervour, such delirious passion that you cannot but believe and follow her. It is indeed one of the most visceral performances ever in the history of cinema.","user":"roystephen-81252","rank":[19,22]}]