[{"title":"Hilarious!","rating":21,"date":"21 September 1999","review":"This movie is one of my favorite comedies. One of the funniest I've ever seen. My favorite parts are where the psycho crossing guard guy who is obsessed with Star Trek is stalking Reggie. It's too bad they don't call movies like these classics, if they did, teenagers would rule the film industry. Check it out. 10/10","user":"squir1y","rank":[14,18]},{"title":"Tommy Chong, Tara Strong and Nicole de Boer","rating":3,"date":"3 September 2007","review":"I really wanted to like this movie, but I could only come up for 3 reasons to suggest anyone else endure this movie. Tommy Chong, Tara Strong and Nicole de Boer. Quite frankly, Chong isn't enough of a reason since he can be seen in better form in a dozen other choices and de Boer is a minor player at best. You are better off watching the last few seasons of Deep Space Nine to be mesmerized by Nicole. So that leaves us with Tara. Yes, Tara is enough of a reason to watch this movie... once. Only because it is the only movie in existence that she is in as a physical entity. If you don't know Tara is the voice behind 100s of cartoon characters you probably watch with your kids. The movie has a few funny moments, but they are rare and limited. Tara on the other hand is absolutely gorgeous.","user":"kayabound","rank":[4,4]},{"title":"Perfect for a relaxing laugh.","rating":10,"date":"20 November 2002","review":"I was overly joyed when I saw the trailers for Senior Trip.  It appeared to be a very good no brainer for a 90 minute laugh.  Unfortunately it wasn't well taken to by movie-goers which made its release to vhs very slow and limited.  It hasn't even made it to dvd yet and I know of terribly worse comedies that have, and most are from the present Saturday Night Live Crew. The film does fulfill the area of not only certain high school hijenks, but also a human feeling for the kids of that specific time.  It pushed through the ideas of free alcohol, drugs but not so much sex.  There was the element of sex, in words and conversation, but no real nudity or fulfillment. Overall an excellent film that would have done better a few years later when teen flix came back with a vengeance.  Senior Trip carries with it the National Lampoon feel of Animal House, but doesn't veer off into a demented spoof like Not Another Teen Movie.  It filled the void where drama and action films had worn away movie goers in the mid 90s.  Watch for Tommy Chong as the bus driver and the chemistry, whether electrified or jaded between the characters.","user":"thenexusone","rank":[10,14]}]