[{"title":"See it once for the suspense, and again for the acting.","rating":7,"date":"11 October 1999","review":"MALICE is one of those movies that you simply MUST see more than once to believe.  The first time through, MALICE is a great psychological thriller, with twists and turns through a plot that contains rape, murder, life-and-death trauma, and a fight to the death...all within the first 45 minutes.  The second time through, though, provides a look at all the things you might have missed the first time around...and a chance to savor an outstanding performance from perhaps the most underrated actor in Hollywood, Alec Baldwin.<br><br>Bill Pullman plays Andy Safien, an associate dean at a small New England college outside of Boston that's currently under siege by a serial rapist who claims his latest victim as the film opens.  Nicole Kidman plays his wife Tracy, a volunteer in the pediatrics ward of St. Agnes Hospital. They're renovating a Victorian house and need $14,000 for the plumbing. Enter Alec Baldwin as Dr. Jed Hill, a former high school classmate of Andy's, who's brand new in town and needs a place to stay.  Andy needs the money, Jed needs a room, so the two hook up and soon Jed is sleeping upstairs in the Safiens' home...usually not alone, and his sexual escapades are grating on Tracy's nerves.  The rapes continue, Andy is fingered as a suspect, and in the midst of it all, Tracy collapses with a ruptured ovarian cyst.  Jed operates to save her life (after a night of drinking and wild partying), but renders her unable to bear children...leading to a malpractice suit from Tracy and an incredible soliloquy on surgeons with a God complex from Jed during the deposition.<br><br>But once the first half of the film is over, things really start to roll. Without revealing the rest of the plot, suffice it to say that as Andy, Tracy, and Jed all try to start their lives over again, their fates become inextricably entangled.<br><br>The movie is worth seeing once as a thriller.  But the second time around, Baldwin's mesmerizing performance is what stands out.  Jed is charismatic, seductive, and as charming as a cobra as he weaves his spell over the Safiens.  Baldwin's ability to jump from utterly charming to incredibly chilling in the blink of an eye is on full display here; it is truly the performance of a lifetime.<br><br>See it once for the suspense, and again for the acting.","user":"Scarlet-22","rank":[60,69]},{"title":"Slick, Supsensful, Mystery Thriller!","rating":8,"date":"25 January 2008","review":"Malice is a very gripping mysterious thriller! The opening scene's haunting music will stay with you forever and draw you into a roller coaster ride of suspense, drama, and deceit.<br><br>The film revolves around a couple who's lives become interwoven by a mysterious and arrogant surgeon who manipulates and cons his way into their lives with little surprises around every turn. Harold Becker's directing is superb in setting the mood and pacing of the film. There are dramatic moments and secrets in the story that will keep you captivated until the very end. Watch for outstanding performances by Alec Baldwin, Nicole Kidman, and Bill Pullman, as well as a powerful supporting role by Ann Bancroft.<br><br>Malice is very difficult to review without giving away parts of the movie, so I will not go into great detail. It's the uncertainties in the movie that make it one to remember. See it, you will not be disappointed! The background musical score is one of the most memorable that I have heard in any movie. Malice is a tale of arrogance, power, mystery, and deception, that must be seen and will be long remembered after the final credits roll.<br><br>This is a very fine film that does not get the credit that it deserves!","user":"jbartelone","rank":[36,42]},{"title":"Terrific acting and great cast! ***SPOILERS***","rating":2,"date":"2 December 2001","review":"Have seen this film several times and am hooked.  Even though I know the outcome, who cares.  It's worth it just to see these fine actors do their thing as they do best.  Alec Baldwin, who never ceases to amaze me in his work, is splendid as the doctor/villain [and what a smoothie he is].  His God \"complex\" speech is one of the highlights.  Then there's the delicious Nicole Kidman, as the demon wife of a mild schoolteacher, who goes for the icing on the cake by knocking off anyone that gets in her way.  What makes her performance stand out to me is that, as wild and evil as she can be, there's also a vulnerability in her portrayal.  You actually care what happens to her, even though you know she deserves to get caught.  This is the worst kind of a villain.  One that you hope won't get caught.  I loved the scene in the bar where she confronts her husband with smiles and flirting only to realize it won't work.  The change of expression and attitude was delightful.  Thanks, Nicole.  And Bill Pullman, being given a sort of wimpish character to play, brings it way up to the same level as the stronger characters with his performance.  He does an outstanding job in this flick.  I've not seen his work before, but will surely look for more roles in the future.  Playing smaller roles are Bebe Neuwirth as a cop who helps our professor solve the case, and Gwyneth Paltrow, in one of her earlier roles playing a bimbo student under Pullman's tutelege who unfortunately becomes a victim of a serial rapist.  George C. Scott appears, quite briefly, as a sort of chief surgeon defending Baldwin's reputation in the medical profession, Peter Gallagher [that handsome devil] appears as Kidman's lawyer in two scenes and that incredible Anne Bancroft in one scene, but she almost steals the picture with her alcoholic card tricks. Annie's the best! Director Harold Becker does a good job with his stellar cast, but sometimes the film is too dark.  At least on television it comes off hard to see.  But I loved  the scene when Nicole is waiting in her car for Pullman to leave so she can move in on the little boy next door in the window.  The lighting coming from behind her gave her curley red hair a kind of glow.  Terrific shot.  This is a story by Aaron Gorkin and written for the screen by Jonas McCord.  They say it's a copy of another story, however, I don't know about that.  I enjoyed this one, but my hat's off to the performers.  They brought this one up to the high place of good ensemble acting.","user":"guil12","rank":[26,31]}]