[{"title":"Fanfare for the wartime common man.","rating":3,"date":"3 February 2002","review":"'Diary for Timothy' is that most precious thing - a snapshot in time of ordinary people, their hopes and aspirations. It is considered by many to be Jennings's masterpiece.<br><br>The film is constructed around the first year of life for a baby, born in the closing stages of the war. There are two radical elements that distinguish this from his previous films. Firstly, the very literate narrative, written by E.M. Forster, no less! Secondly, the characters who appear are allowed to speak for themselves, almost in the form of soliloquy. Here are the voices of Britain, and one is reminded of  Chesterton's poem in that they 'have not spoken yet'.<br><br>The mood of the film is very subtle. Although not strident, it and the characters in it argues the necessity for a better world and a fairer society (anticipating the Labour landslide).<br><br>What is really poignant is the realisation that many of these hopes have not been realised.","user":"shrbw","rank":[19,19]},{"title":"A very evocative film indeed - Emotional poetry","rating":9,"date":"27 July 2010","review":"In the history of cinema, the history of documentary is very interesting and when talking about the subject and the United Kingdom, people cannot leave two names alone; Basil Wright and Humphrey Jennings. Basil Wright directed The Song of Ceylon, which was a shocking description of UK's colonial possessions. Then Humphrey Jennings made many propaganda films during the WWII, the most well known of them are Words for Battle (1941), which was a poetic picture of England, read by Laurience Olivier. Listen to Britain (1942), which used sound as narrative it didn't use commentary tracks at all when describing one day in London, and many see it as one of the finest documentaries ever made. Then last but not least A Diary for Timothy (1945), which is a very evocative pacifistic propaganda film.<br><br>The production of Humphrey Jennings is fascinating, he never followed the same scheme. For instance in Words for Battle (1941) a famous actor read the poetic commentary for the film, in Listen to Britain (1942) he didn't used commentary at all only the sound and music. Then A Diary for Timothy achieves to bring something completely new once again. It's dedicated to a boy called Timothy who was born on 9.3.1944, the fifth anniversary day of WWII. The documentary shows the world around Timothy, what happens in it, in what kind of place young Timothy will grow up. The poetic commentary of the film is like an essay read an actor, an essay tied to emotional situation.<br><br>A Diary for Timothy is pure cinematic poetry, only few have reached, and if talking about the history of documentary, only Jean Vigo and Humphrey Jennings. It is an evocative documentary, which calls us to make a change. The film is existentialistic, it highlights the experience of an individual during the time which wasn't the time of existentialism, people believed in communality. But A Diary for Timothy managed to light a new spark of hope in the people.","user":"ilpohirvonen","rank":[4,4]},{"title":"This war propaganda is inventing MacLuhan's TV approach","rating":10,"date":"27 November 2007","review":"The film was recently presented at the Cinematheque in Paris for a debate on Jennings' work, with David Robinson and Elena von Kassel Siambani as debaters, and the participation of Stephen Frears. Stephen Frears' participation was disappointing because he did not say one single piece of his mind about Jennings. But the two other debaters totally missed the point by qualifying Jennings' war films as poetic. That satisfied the nostalgic audience but they completely missed the point. Too bad for our historians. They got lost and satisfied to be lost in the biographical elements and the historical events of the time, as if it were capital to know that Jennings was an aristocrat by birth. When we come across a film, or as for that any work of communication or art, any work produced by human beings, we have to look for the language in the message, the alphabets used to produce the message and the syntax of that message. At once we discover that this Diary for Timothy has little to do with a documentary, as little at least as Oliver Twist. At once we know this diary is not a documentary and that the films Jennings produced that were not connected with the war are different, be it only absolutely boring. The war enable Jennings to jump into a different style, syntax, language, message. A Diary for Timothy is pure fiction aiming at having a political effect on the captive audience of 1944-45 in England. This film is a masterpiece for his time because it invents something that will become the first and foremost medium in human history, television. The first language of the film is dictated by its framing-shooting-editing. Jennings centers his framing and shooting on characters, bodies, at times traveling from foot to head or vice versa, at times giving close-ups of one or two faces. This very close shooting, narrow framing is typical of what was to become television. It is thus aiming at empathy, especially since the characters do not speak: the discourse comes from a voice-over. The second technical element. The framing-shooting-editing of this film concentrates on absolutely common place everyday situations in 1944, so that you  the audience  can feel a high level of all-sensory empathy. Take for example the image of the bunk beds in the underground station: It focuses on one person in one bunk bed, in the dark, wrapped up in a blanket. You can at once smell the dampness and the soot, the stale air, the sweat and other body smells. You can feel the closed up environment in which human beings are packed, slightly claustrophobic and holding onto people who are invaders in a way, and you are feeling as if you were an invader too. You can also feel the fear, the danger, the night, etc. And of course you can hear the announcement for the last train and the train rumbling by, without seeing it. It is all-sensory except for the intellect and the mind. It is an immediate un-mediated reaction. It does not want to make you go out and do anything, not even think. It does not aim at making you engage in any action of any type. It just wants you to feel 100% convinced that what you are doing everyday in that war is the right thing. It is propaganda. And this very last element is fundamental. Jennings is inventing the ultimate manipulating medium, television, for which the medium is the message, the message is a massage and the massage is the ultimate message. TV is doing that all the time, especially in its fictional productions and it seems to deal with its news programs as if they were fiction with the stamp of TRUTH printed onto them. Now is this Diary for Timothy poetic? That is your choice to consider most of these pictures as poetic. The aim is not to produce poetry but effective propaganda and the new medium he is inventing is using the same techniques as poetry to reach its aim which is neither to make people  in 1944-45  nostalgic or soft around the edges, or to make them wonder about the beauty of a scene or a vision. In one scene two people, one man and one woman are under a table covered with a tablecloth. But this scene is not funny and you will not smile or laugh at it, at least not in 1944-45 because of the direct edited surroundings of this short sequence. We know what this means and we admire the courage of these people very much. We think of other scenes of the same type (Mozart and his wife-to-be smooching under a table in Vienna as seen by Milos Forman) and the one here is serious and reveals the courage and strength of the two people, not their lust or freewheeling carelessness. Why on earth did the Cinematheque in Paris miss that point? Because they are entirely concentrated on the cinema and do not consider television, like for instance the Museum in Bradford (photography, cinema and television). And because in France it has been very trendy for decades to refuse to see Marshall McLuhan has a point on the question. But it is more surprising that the debaters went along with that mistake. As historians of the cinema they should always consider the cinema as one medium among many other media. Apparently they isolate the cinema from the rest of the mediatic world.<br><br>Dr Jacques COULARDEAU, University Paris Dauphine, University Paris 1 Pantheon Sorbonne &amp; University Versailles Saint Quentin en Yvelines","user":"Dr_Coulardeau","rank":[4,6]}]