[{"title":"An excellent adaptation of a scholarly work","rating":10,"date":"22 April 1999","review":"For me the power of this movie rests in its faithfulness to Margaret Rosenthal's book the Honest Courtesan; which is a well-researched look at Veronica Franco's life and the plight of Venetian women in the 16th century. Dangerous Beauty, while making certain assumptions and taking some literary license, was a talented translation of Rosenthal's careful research into a captivating film. Many of the witty remarks and social commentary come directly from 16th century documents. Surprisingly the most unbelievable aspect of the movie (her escape from the Inquisition and support from prominent Venetian nobles) is historical fact. While the details are unknown and the movie is certainly more romatically dramatic than I would imagine the actual historical event, it was very true to the spirit and feel supported by the evidence we have.<br><br>Venetian women, and indeed most medieval women, were in an unenviable position as second class citizens. Veronica Franco's struggle to find an acceptable position in society as a woman of good family but poor, is representative of the moral and societal conflicts of her time. Courtesans were not respected but they were accepted as a necessary evil. Their income was even taxable! In a society where female chastity was considered sacrosanct if she were to marry and a marriage bed was no less for sale than a courtesan's, women's choices were limited indeed. Franco's impassioned cry in the movie \"I did what was necessary to survive!\" is no less true were it not a verbatim report of her defense. As a penniless girl her options were limited to scullery work, the nunnery or prostitution. Her distinction was that, while she chose to sell her body, she never chose to be dominated by her profession or those who sought her out. In publishing her book of poetry and personal letters, she redefined herself as a woman first and a courtesan second. Using her wit to defend herself in the public arena she skillfully manipulated accepted literary mores of the day to show her mastery of the literary as well as political implications of her position.<br><br>Her greatest detractors were courtiers, such as Maffio Venier, who competed with courtesans for the money bestowed by wealthy patrons. As she says in the movie, they must both sing for their suppers. The problem is that while she is willing to accept they are equal in their need of patronage, he is unwilling to be outdone by a woman. His misogynistic works of poetry were directed toward Franco and other courtesans with the intent of parading his own virtue by damning theirs. The greatest irony is that Maffio was ultimately killed by a sexual disease while Franco died of causes unrelated to her sexual practices.<br><br>While there are those who might see this movie as an acceptance of prostitution, I believe they are missing the true story behind the sexual facade which they are focusing on. Franco's life was one of courage and honesty. She made choices that we may not understand, but we do not live in her world. And she accepted both the privilege and the degradation that her position brought her. This movie is a powerful tribute to one who sought more in life than mere existence and who faced her trials with the courage of her convictions, whether or not we or others share those convictions is immaterial.","user":"Aleatha","rank":[130,140]},{"title":"Engaging Story, Excellent Performances","rating":8,"date":"3 March 2002","review":"There's a consistent moral thread that runs through every society from age to age and generation to generation, the tenets of which are established within parameters, and therefore subject to change; or more specifically, subject to a change in perspective.  And that change can come very quickly-- veritably over night in some instances.  There is also another constant that defines the human condition in any era, and as we find in `Dangerous Beauty,' directed by Marshall Herskovitz, it is the fact that an individual will do whatever is necessary to survive.  It is simply an undeniable, irrefutable basic instinct of the human animal.  Moral tenets and survival, however, taken as properties are something akin to oil and water, and will mix accordingly.  Being more often than not polar opposites, conflict is inherent and will ultimately surface at some point or other, the outcome of which is determined by the strength of whichever perspective is prevalent at the moment.  And it is at such moments that we discover that life, like politics, can be a sordid, unpleasant affair; or at the other end of the spectrum, the greatest gift of all.<br><br>\tIt's 16th Century Venice; Marco Venier (Rufus Sewell) is of a wealthy and powerful family, and is a Senator in good standing in the community.  He is also in love with Veronica Franco (Catherine McCormack), who though intelligent and beautiful, is beneath Marco's station in society, and they are, therefore, forbidden to marry.  Instead, Marco's father, Pietro (Jeroen Krabbe), has arranged a marriage for his son, an alliance that will be to the substantial benefit of both families.  Veronica's family, meanwhile, due to prevailing circumstances must look to Veronica for support, so her mother, Paola (Jacqueline Bisset), not only arranges for Veronica to become a courtesan, but instructs her herself in the fine art of seduction and the kind of pleasures that will put the most coins in the coffers, as well as how to survive by being in love with `love.'  <br><br>\tFor Veronica, it soon becomes a lucrative, if not fulfilling enterprise, but there are clouds forming on the horizon, the least of which involves an impending war with the Turks, a war they cannot win without the help of King Henry (Jake Weber) of France.  Very quickly, life in Venice changes; Marco is off to war, and the formerly open acceptance of the courtesans undergoes a swift and drastic reversal of perspective among a seeming majority of those within the city.  And once again Veronica's life is in flux; and she is about to find out that it will never be the same again.<br><br>\tNicely presented and beautifully filmed (the cinematography by Bojan Bazelli is exquisite), Herskovitz's film-- which is based on a true story and adapted from Margaret Rosenthal's novel by screenwriter Jeannine Dominy-- succinctly points up the moral hypocrisy that has always existed within any given culture or society, and which will continue to exist so long as there are social institutions and structures to support them.  And the possible consequences of such diverse perspectives and attitudes, when zealously pursued, are effectively personified in the character of Maffio Venier (Oliver Platt), in whom we find the ultimate manifestation of moral decay, masked by platitudes of self-serving righteousness.  Herskovitz also effectively uses the relationship between Veronica and Maffio-- initially a mutually agreeable rivalry; a contest of words which later turns aggressively ugly-- as a reflection of how readily one facet of society will turn on another if but afforded the appropriate circumstances.  It's a film that works well on a number of levels, as on one hand it's a love story, while on the other it's an insightful dissertation on the inherent imperfections of society, and the fragile moral fiber that holds it together.<br><br>\tIn the title role, McCormack gives a solid performance; that Veronica is beautiful is obvious, but most importantly, McCormack conveys her intelligence, as well, and it makes her character three-dimensional and quite convincing.  Interestingly enough, Veronica is a sympathetic character for whom, nevertheless, you do not necessarily feel sorry; and perhaps it's because she carries herself so well and has such a strong sense of `victory' about her, hiding any vulnerability that would make her susceptible to pity. This is a woman who takes the detritus life throws at her and makes something of it-- and she does it with dignity.  If her life is morally compromised, it is not due to any acquiescence on her part, but rather the need and the will to survive.  This is a complex character who has to tread a number of fine lines, and McCormack plays it beautifully and believably.<br><br>\tAs Marco, Sewell hits his stride and turns in an excellent performance, as well.  Marco is something of a pivotal character, in that Veronica's response to him and their relationship becomes the most telling expression of the effects of the courtesan life on her.  And as the story unfolds, Sewell does a nice job of developing his character, finally achieving a depth of emotion that significantly heightens the impact of the climax. <br><br>\n\tIn supporting roles, both Platt and Bisset give notable performances, too. Platt once again demonstrates that he is one of the best character actors in the business; and not only is Bisset exemplary in the role of Paola, but the casting of her and McCormack as mother/daughter was inspired.<br><br>\tThe supporting cast includes Moira Kelly (Beatrice), Naomi Watts (Guila), Fred Ward (Domenico), Joanna Cassidy (Laura), Peter Eyre (The Doge), Justine Miceli (Elena), Carla Cassola (Caterina), Michael Culkin (The Bishop) and Charlotte Randle (Francesca).  As Michael Corleone said at one point, `We're all a part of the same hypocrisy;' and if there's a lesson to be learned from `Dangerous Beauty,' it's that one should not deign to pass judgment on another without first walking in that person's shoes.  It also reminds us of the necessity of maintaining a proper perspective-- and keeping in mind that what's acceptable today may not be acceptable tomorrow.  8/10.","user":"jhclues","rank":[42,45]},{"title":"One of the best and most passionate movies ever made","rating":10,"date":"9 October 2004","review":"This particular movie was lost in the shuffle somewhere but I am certainly glad I found it. Catherine McCormack (Braveheart) portrays an innocent girl, that loses in love so decides to do what she has to do just to have him any way possible. It's a very backwards Cinderella. A good girl that falls in love with a \"prince\" (he's from a family with a title and she's not) but will true love prevail? Rufus Sewell is to die for, the sexiest and most talented actor to come our way in years. The rest of the fine cast Oliver Platt, Moira Kelly, Naomi Watts, Fred Ward and Jacqueline Bisset are very convincing in their portrayals of these period characters. I have had every single one of my friends watch it and they all have enjoyed it as much as I have. The music is fantastic and we even get a short history lesson. With this sensational cast, the storyline that is based on actual poetry books from a Courtisan, it really is my favorite historical romance of all time. Take the time to find this rare gem and see it as soon as possible.","user":"Firstclassblonde","rank":[58,68]}]