[{"title":"It succeeds at what it sets out to do","rating":10,"date":"23 June 2001","review":"I won't lie to you-this movie is a CHICK FLICK!  Though I never saw it with a guy, it is definitely a chick flick.  That said, it's a high-end chick flick, which probably a few guys might enjoy, unless they happen to be the exploding helicopter type^^;  This movie feels more like a modern day adaptation of the classic romance \"An Affair To Remember,\" and it keeps referencing it too (In fact, the Cary Grant classic is very integral to the plot).  Tom Hanks and Meg Ryan have great chemistry together, and they both do what they're good at-Tom Hanks portraying the Everyman, and Meg Ryan being cute and innocent.  I have to disagree with an earlier comment that this film is unfair to guys-the way the characters are portrayed, I'd have to say that in the reverse situation, I'd still feel the same way.  Meg Ryan does not have the \"evil woman\" syndrome that popped up in later 90's chick flicks (The most notorious of which was \"My Best Friend's Wedding\").  She is very believable and actually does care about the feelings of her fiance. What I particularly liked is that the fiance was not portrayed as someone who Meg would do well to leave.  Most movies fall into this trap-Someone is about to marry someone who is horrible and find that someone else is better, the viewer supposedly not feeling bad because the fiance was a jerk anyway. Tom Hanks really shines here as someone who has lost the most important person in his life and is trying to rebuild again.  He always has a knack for easily slipping into the roles he's given and making them really convincing.  He does not fail here-you feel for him especially during the sequences where he starts remembering his late wife.  The movie's plot starts to stretch plausibility at the end, but not to the point where it destroys the entire film.  The ending scene in particular is handled very carefully.  You could have had a big, romantic, tear-jerking moment. Instead, the movie takes a more simplistic approach, and it succeeds-it feels much more natural than the alternative.  Overall, if you're in for a feel good romance, you should see this.  If you happen to be female, this is DEFINITELY worth watching.","user":"Rebochan","rank":[88,117]},{"title":"What if...","rating":9,"date":"22 June 1999","review":"The movies are full of alternate universes and maybes that make them a great escape. Sleepless In Seattle is a great romantic comedy. Tom Hanks and Meg Ryan star in a movie where they are hardly onscreen together and yet we feel both of their characters infatuation. It's an amazing job that director Nora Ephron does in making us care about the relationship between these two characters when their not hardly together onscreen. The movie also has great performances, from the leads and from supporting players Rosie O'Donnell and Rob Reiner, as well as a very goofy but sweet turn from Bill Pullman. This movie will make you feel good.","user":"Peach-2","rank":[35,45]},{"title":"How is this romantic ?","rating":1,"date":"15 February 2009","review":"I see a lot of comments about romance... so a woman falls in love with someone she heard on the radio saying he missed his dead wife and decides to stalk him. And he sees her and she finds her pretty. That's love.<br><br>I mean don't get me wrong, I liked how the movie started, but Annie doesn't prove herself in any way. she has a fiancée that loves her and who has some unconvincing quirks that make him the one that must be dumped. i mean the guy does nothing wrong. Annie gets the idea that the guy isn't good for her indirectly from her mother... and what does she do ? She decides to break up and go meet a guy on a roof. and the fiancée accepts like a good little puppet, because if there were any heartbreak from his part, the movie would have went down the tube. the movie is hanging on only a thread of optimism.<br><br>Of course, us, the viewers know that Sam isn't a bad guy and that he deserves a decent relationship. Sam is sane, tries a normal way to see if he can have a relationship. I like him. But if you cut out all of his scenes Annie just seems kinda nuts. You can't see her relationship falling apart. She just falls for Sam. And that stupid movie every woman in the movie is crying about... so what ? Because somehow they finally met in a similar manner makes it lovely ? Not really, no.<br><br>A movie for romantics? Sure. Just to remember that your girlfriend who seems very much in love with you will dump your carefree, no complicated past, caring, compassionate self for a guy with emotional baggage, with a kid, who she only met. But he has a nicer name than you.<br><br>The acting didn't impress me. I actually had hopes for this movie. Shame. It gets a one because if it's a romantic movie it's crap.","user":"kalin12351","rank":[81,113]}]