[{"title":"Under Appreciated Murder Mystery!","rating":6,"date":"17 April 2003","review":"The real mystery of D-Tox (hereinafter referred to by its video tile, \"Eye See You\") is why it never found a distributor in North America. I thought it was a good movie. You have to give star Sylvester Stallone a little credit for trying to shed his Rambo he-man image and playing a distraught and tragic hero.<br><br> The story involves a serial killer who has been murdering cops and whose murders will be investigated by FBI agent Jake Malloy (Stallone). When the killer murders Malloy's girlfriend Mary (Dina Meyer) he goes into a funk and finds solace at the bottom of a bottle to the point of contemplating suicide. Malloy's friend and partner Hendricks (Charles S. Dutton) convinces him to go to an isolated D-Tox center in Wyoming run by shrink Kris Kristofferson.<br><br> Malloy is thrown in with other cops from various locations who also have demons to exorcise. Among them are Christopher Fulford as Slater who tries to befriend him, Noah (Robert Patrick) who has a chip on his shoulder, McKenzie (Robert Prosky), Jones (Courtney B. Vance), Brandon (Mif) and Lopez (Angela Alvarado) among others. Polly Walker plays Jenny a sympathetic nurse and Tom Berenger and Stephen Lang as two suspicious workers at the facility.<br><br> It turns out that the serial killer that Malloy thought he had killed earlier, has in fact infiltrated the D-Tox Center and has begun systematically murdering the people there. But who is he or she?<br><br> Director Jim Gillespie gives us a murder mystery rather than an action film. It has the isolation and claustrophobic feeling reminiscent of John Carpenter's \"The Thing\" (1982) except in this case the killer is human and not alien.<br><br> Stallone is good in the lead role experiencing a wide range of emotions. Its one of his better performances in recent years. Of the supporting players, Patrick stands out as well as Fulford, Dutton, Prosky, Vance, Alvartado and Lang. Berenger hardly has anything meaningful to do and is wasted here. And watch for Ron Howard's dad Rance Howard as the proprietor of the lodge that Dutton stays at. \"Eye See You\" is an under appreciated film and deserves a chance to find an audience. It is hoped that the video release will give it proper visibility.","user":"bsmith5552","rank":[41,50]},{"title":"Flawed, but not *that* bad","rating":31,"date":"31 December 2002","review":"Well, having not only spent two years on the shelf but getting released straight to video AND the original studio - Universal - disowning it (removing its logo and \"Universal presents...\" as well as giving it to another studio to release on DVD and video) I was expecting yet another Stallone bomb. Actually, while I would never say it's a good movie, it nowhere as bad as you might think - it's certainly better than recent Stallone turkeys like GET CARTER.<br><br>It's actually starts surprisingly well. Not only is Stallone's character given a lot of dialogue, Stallone actually *acts* when delivering it. The subsequent events that traumatize his character are well done, with a genuine eerieness to them. Things continue well for a while longer, showing the utter pit of despair Stallone's character has fallen in, and Stallone once again is up to this challenge.<br><br>Then he goes to the detox center, and the movie quickly falls apart. The biggest problems are:<br><br>(1) WAY too many characters. It was extremely difficult to remember who was who with all these people walking in and out of the camera. It's also difficult to separate each person in your mind because we hardly learn a thing about each character - if we are lucky.<br><br>(2) REALLY bad editing. Scenes (and some individual cuts) go by so quickly that we often don't get the chance to properly digest what we're given to ponder. Two things happening at the same time (in different places) are cut back and forth with no seeming purpose, and no coherent flow. Though the DVD has eight deleted scenes, it's obvious that there was originally a lot more shot. I have to agree with another poster that there are signs there was a desperate effort to save the movie in the editing room.<br><br>(3) Once in the detox center, poor Stallone has almost NOTHING to do. He's given almost nothing to say, and frequently sits on the sidelines while things are happening. Not exactly a star vehicle, this movie.<br><br>Still, there is a good amount of atmosphere, the movie is briskly paced (though sometimes incoherent because of this), and the sets/production values are pretty decent. While I wouldn't have recommended anyone to see it at a theater if it had gotten released there, you have to remember there have been far worse films (with and without Stallone) that did get such releases.","user":"Wizard-8","rank":[49,61]},{"title":"Stallone is good in this...","rating":1,"date":"1 November 2004","review":"We all remember him as ''ROCKY'' or ''RAMBO'' it's unfortunately sad that the critics won't agree when sly does anything outside the ''ACTION'' genre....anyway the movie is the kind that you would watch with you're girlfriend or a loved someone on a rainy night...<br><br>Troubled ''ex'' cops are in a D-TOX center ..something goes wrong when they start winding up dead...its up too stallone to catch the killer..<br><br>Sylvester stallone is good as the main character, Robert patrick ( the guy in the terminator and the x files series ) is really good and gives a 10-10 In his performance in this movie..without giving away anything else..., its a good movie. and stallone just like in the last decade is very very underrated, he CAN act! <br><br>*** (3)out of(5) *****","user":"alpacino2007","rank":[57,80]}]