[{"title":"One Of The Best Performances Of The Decade","rating":8,"date":"28 February 2006","review":"How Kevin Bacon didn't get an Oscar, let alone a nomination is beyond me. What is wrong the the Academy? it was a better performance than Tom Hanks in Forrest Gump, I was moved to tears by the man, it's a heartbreaking performance. He should have been nominated for 'The Woodsman' as well. Great actor. But i have to say it's not an easy watch, and the violence is relentless, it reminds me of the time i once witnessed a boy get bullied at school, it just never ended and i remember feeling awful for the poor chap, the fact that it's a true story just makes me shudder. Gary Oldman gives one of the most hateful performances i've ever seen while Slater shows depth as the lawyer trying to get him out of prison as early as possible.","user":"bwziegler","rank":[52,53]},{"title":"Terrific!","rating":9,"date":"21 April 2006","review":"This is clearly Kevin Bacon's best performance. It's a shame he was not nominated for an academy award for his role. A truly emotional movie that ranks among the top Alcatraz movies made! Gary Oldman also puts in a very solid performance. Christian Slater plays a youthful, inexperienced attorney to perfection.<br><br>In showing another side of Alcatraz the movie breaks away from typical escaped based Alcatraz films. While \"Escape from Alcatraz\" may still be the top movie in this topic area, \"Murder in the First\" provides a new twist that involves a different type of drama. Kevin Bacon was surely jilted for not being nominated here!","user":"ferretinns2001","rank":[53,57]},{"title":"How This Movie Didn't Win an Oscar is Unfathomable","rating":10,"date":"23 October 2011","review":"Kevin Bacon was incredible. See he won for his performance. But so should Christian Slater have. So should the cinematographer. Unique, inventive and incredibly creative camera perspectives. Wonderful historic background interspersed, too. Superlative effort all around. every facet of it. Scenes I glanced away from, but that's just my distaste for depiction of violence. Thought it was tenderly beautiful that Kyra Sedgewick was cast in that cameo, since Bacon is her real life husband. Slater cannot act poorly. He's incapable of it.<br><br>Everything about it, to say nothing of the theme itself. The lighting, the cryptic cutting every time the point was made without fail, the lingering closeups when humanity was the point.","user":"tolerford-1","rank":[13,13]}]