[{"title":"One Movie Buff's Opinion","rating":10,"date":"12 December 2004","review":"I have seen criticism of this movie saying that the language should have been changed to our post-modern English instead of being the original late-middle/early modern English that Shakespeare used. But those who say that miss the point that what makes these plays so magnificent IS the language that Shakespeare used, and to change it would be to ruin the movie.<br><br>Anyways, the acting is marvelous, as it should be from such a cast as this. Michelle Pfeiffer plays the part of Titania with the utmost perfection. Kevin Kline as Nick Bottom is equally as good, and the two end up having a chemistry that is unmistakable (even if he is an ass at this point).<br><br>The directing is also great - almost as good as the acting, if not as good. Costumes, sets, everything with exception of there being headlights on the bicycles, is perfect. Michael Hoffman truly pulled of a great feat with this movie, and I would recommend it to anyone.<br><br>Also, on a side note, if you have trouble understanding the language, though it be English, watch the DVD and turn on the subtext.","user":"danielhalton","rank":[64,72]},{"title":"Excellent Job of a Difficult Task","rating":9,"date":"25 July 2004","review":"I'm a professional live theatre stagehand. People who are too centered on movies will have a hard time with this picture. If you could see the original first run performance of this play in Elizabethan England you would think you had stumbled into an over-costumed poetry reading. If the movie is hard to follow try &amp; imagine what viewing that play would be like. It is the measure of Shakespeare's greatness that now 400 years later &amp; in a medium born of photography that this greatest of fantasies still rings true. Try to show some respect; Shakespeare defined modern English. In comparing the lines to the original I thought that the adaptation was sensitive &amp; well thought out. Simplified to fit the film medium but not sacrificing any of the truly great lines that actors drool over. The fairy world sets seemed cramped to me &amp; reminded me of Cocteau's Beauty &amp; the Beast. I personally found the setting of the movie in turn of century Italy kind of fun. Resetting Shakespeare in times &amp; places other than he wrote is pretty much standard practice. The bicycles &amp; the phonographs were amusing to me &amp; generated some fun business for the actors. Kevin Kline was excellent as the ass. He got you to sympathize not pity or deride. In fact the whole amateur troop was memorable. Stanley Tucci was the quintessential Puck. Calista Flockhart threw everything including the kitchen sink into her part. Don't accuse her of overacting though; you'll only give away that you have never been deeply in love. Michelle Pfeiffer was radioactive beautiful, probably fatal closer than ten feet. Rupert Everett maintained perfect believability in a difficult part which is essentially support for Puck. As an answer to anyone who thought that things were a bit oversexed. The Renaissance was all about the rediscovery of the fact that people are noble &amp; beautiful, not sinful &amp; ugly. Shakespeare was one of the greatest products of the Renaissance. The movie is true to those Renaissance ideals. To sum up; a class act &amp; class acts are not for everybody.","user":"tvsterling","rank":[66,78]},{"title":"Surprisingly faithful adaptation","rating":10,"date":"19 October 2004","review":"As a general rule, I normally don't post comments unless I have enough time to write a thorough review, and have given it much thought before hand. I'm sorry, but even though it's 2am, I can't bear to go to sleep and let the review before me just sit there. Obviously the reviewer before me seems to have no idea that the complicities that arise from the various plots go back to Shakespeare himself - and it is a great achievement by this film to manage to keep all the plates spinning and all the stories interesting.<br><br>I am amazed by this film. I am a life-long Shakespeare fan and it's great to see a faithful American production. The British/American cast all worked fantasically well together - Christian Bale, Anna Friel, Dominic West, and Calista Flockheart were all perfectly cast as the four lovers. The fairies and the actors both worked very well to frame the story - and the director has managed to keep it both visually unique and incredibly entertaining.<br><br>I'm not quite sure why they decided to change the location from Greece to Italy, but in an age where Kenneth Branagh is trying to make a 1940s musical out of Love's Labour's Lost, I say, the changes could be a lot worse. All in all, this is a very impressive adaptation. I'm just happy to see that Shakespeare hasn't lost his appeal to modern audiences.","user":"Liza-19","rank":[42,51]}]