[{"title":"My favorite of the series","rating":7,"date":"3 March 2010","review":"Unlike many other reviewers, out of the Phantasm series, I liked this one the best. They really had fun with this one and didn't take themselves too seriously. And it was actually funny!<br><br>The movie picks up where the second one ended, but I don't think you necessarily need to see the first two movies to enjoy this one. There are plenty of flashbacks and, frankly, it's a pretty crazy story to follow in any case. I think this one actually made more sense than the first two.<br><br>The first Phantasm was an amateur pet project that was literally a bunch of friends working weekends putting together a horror movie for fun. It was and is a cult hit.<br><br>The second movie had more money behind it but, in my opinion, tried to take itself a little too seriously for such ridiculous subject matter.<br><br>For me, this movie had the perfect balance of horror and comedy. It was hilarious, horrific, and sometimes both at the same time. Good fun with decent make-up effects and an amazing car stunt with a hearse. I also really liked the way they introduced one of the main characters, the kid. I could see that idea being a great movie on its own: Home Alone done as a horror movie.<br><br>In the DVD commentary (yes, believe it or not, I even listened to the commentary) Baldwin asked Angus what the fan reaction to this movie was. He said that people either hated it for the comedy element or loved it because of it. I'm in the latter category.<br><br>If you're looking for top-notch acting and dialogue or a story that makes sense, this is not your movie. But if you like b-horror movies on the humorous side, I definitely recommend you give this one a shot.","user":"WisdomsHammer","rank":[9,12]},{"title":"Most Creative, and Inventive of the Series, a must see for Phantasm fans","rating":10,"date":"19 April 2007","review":"Most people note the humor in this picture as a downfall to the series... or the zombies which were never before seen. but what people don't know is that all the writing and strangeness has already been pre-thought out by series creator Don Coscarelli. If you want you could call this a fault on the series, but in my opinion as long as the original creator is coming up with the ideas it's alright, because he's the inventor of the franchise, he can do what ever he wants... he can't ruin the mythology of the Tall Man he can only expand it. <br><br>the good things about this film are the magnificent return of the original Mike Pearson (A. Michael Baldwin). Plus Bill Thornbury Mikes brother Jody. All the action, Set Decoration, SETS IN GENERAL... THE CHARACTERS... THE STORY, and the surprises. i don't want to go into too much detail on the plot because i don't want to spoil it for you... but the reasons most people give this movie flak are stupid. when you watch this film compared to the others you will see a big difference, this movies is in a little way the epic phantasm movie... seeing the building of the 'warriors' with Reggie and his crew... and the final battle... they could have ended the series with this one, but Coscarelli has bigger finale plans for his phantasm fans and we just might see that sooner then you think. <br><br>i hope this helps.","user":"Joxiua_Nietzsche","rank":[13,19]},{"title":"Start your engines","rating":10,"date":"10 May 2019","review":"The scene where the killer balls slide out of their case and bob in mid air, sounding like purring V8 engines is a classic.","user":"ileddysd","rank":[3,3]}]