[{"title":"the title says it all","rating":2,"date":"19 October 2006","review":"i had high hopes for two came back.obviously the ending is predictable,given the title.basically,a group of friends agree to sail a yacht for someone from san diego to vancouver.along the way,they get caught in a massive storm and all but two of them perish.the main focus of the story centres not so much on the storm,but its aftermath.the crew is left adrift in the middle of the ocean and struggle to survive,as they hope to be rescued.of course as days pass,each of them deals with their plight differently and eventually,when they are rescued there are only two remaining alive.that is the gist of the story.i thought it would be a better movie than it was,but it was mostly a bore.most of the actors weren't convincing.then again,they didn't have a lot to work with dialogue wise,so they can't be faulted entirely.the scenes of the storm were pretty exciting,but fairly brief.pre teens will probably enjoy this movie, but if you are in your mid teens and older,don't expect to be too entertained. 3*","user":"disdressed12","rank":[5,5]},{"title":"worth watching","rating":11,"date":"11 April 2004","review":"Even though the title and opening sequence give away the ending, this film is still worth watching.  Melissa Joan Hart, Jonathan Brandis, Susan Sullivan and Susan Walters give good performances.  There is a lot to learn from this film about leadership and survival.<br><br>If the producers would change the name of this film and delete the opening sequence, this would be a truly dramatic film.<br><br>Nonetheless, it still worth watching for the performances and lessons taught.<br><br>With all due respect to Melissa Joan Hart, Jonathan Brandis gave some truly spirited moments in this film, particularly when the characters are finally rescued.  Ms. Hart, who is quite talented, could learn to show strong emotion on screen, when it is appropriate.","user":"karenthomas61","rank":[12,22]},{"title":":)","rating":5,"date":"3 August 2005","review":"First of all I am a fan of Melissa Joan Hart so that I've watched the film. The Title \"Two Came Back\" gives us the ending.Although on the cover we can see Hart and Brandis' picture, so it's not hard to understand \"who will come back?\".I wish the title changed.On the other hand the movie has a only a few cast.But I can say their performance are well.They play really well. Brandis and Hart are doing whatever they can for survive. I like \"survival movies\" but this was a little bit simple.Did I expect too much from this movie?? It's not easy to make films, which will be watched by people. It's not a well-done job as well as \"Twisted Desire\" and \"Drive Me Crazy\". Heracting has been getting worse.But we don't know the reason, do we?. I think Melissa was good on just in 2 TV-Series: \"Clarissa\" and \"Sabrina\" . As a really fan I expect from her better films.But she got married and we don't know if she will continue her job as an actress.Maybe we can see her as a producer like her mom.At what career is Melissa Best? We'll know the answer soon. But it's also worth to buy and see the movie because of Jonathan Brandis, who also has fans from all over the world. Finally, If you have time for you, you can see the movie .","user":"Jack-","rank":[6,12]}]