[{"title":"dank you veddy much","rating":8,"date":"22 December 1999","review":"I've been an Andy Kaufman fan for quite a while now. True, I was around six when Andy died. But somehow this strange man was able to affect both my work and outlook. So needless to say I was looking forward to this film. And I was not disappointed.<br><br>Critics complain that while engaging, this film does not let the viewer in on who exactly Kaufman was. It's simple: there was no real Andy Kaufman. He was socially inept, utterly brilliant, and a strange and distant individual. His sense of humor (if he even had one) was not for everyone to understand. THAT WAS THE POINT. So why should a film spoil the mystery? MAN ON THE MOON was as an homage to Andy, NOT an explanation, and far better than those dull, lifeless documentaries on E! or comedy central in which uninteresting comedians try to explain why Andy was brilliant. It's common knowledge that explaining a joke renders it humorous (a notion that Andy toyed with in his Foreign Man routine, remember?)<br><br>True, some facts were altered for dramatic purposes (though the truth is just as interesting), or maybe just necessity, but the base story is still pretty accurate. Some of the more humorous moments in Kaufman's career were not mentioned (i.e. his stints on Johnny Carson and David Letterman, his work with performance artist Laurie Anderson, his street corner preaching). But lets face it, everything couldn't and didn't need to be included. The film is capable of capturing the essence of Kaufman's world. If you want to see everything Kaufman did, find a recording of it and watch that.<br><br>Carrey is brilliant as Kaufman. Some call it an imitation, though that seems overly simplified and absurd. That was an imitation along the lines of Geoffrey Rush in SHINE, or Hilary Swank in BOYS DON'T CRY, or Richard Farnsworth in THE STRAIGHT STORY. Sure, Carrey observes and uses the many Kaufman quirks without a fault, but his observation goes far beyond what any other actor seems capable of. Carrey is Andy Kaufman. So many seem unwilling to admit that Carrey can act.<br><br>Taken on it's own, MAN ON THE MOON is a magical, funny, and wonderful film. Taken with the rest of the sources currently available on Andy Kaufman, this is just another facet to a complex career and an homage to a brilliant man.","user":"J[oe]","rank":[138,162]},{"title":"Man on The Moon, indeed.","rating":8,"date":"2 March 2000","review":"\"Man on The Moon\", indeed. I remember seeing Andy Kaufman's act on TV as a teenager, and I admit, I wrote him off as another comedian, with an incredibly expressive face and a flair for silliness. Years later, I'm watching him on \"Taxi\" reruns. I admired the easiness where he could go from loving Latka to malicious Vic with ease, and I thought, \"Wow, this guy really loves what he does\". And then I watch \"Man on The Moon\". Reality check.<br><br>This picture, I believe, redeems Andy Kaufman. He endured five grueling years in \"Taxi\" just so he could get some laughs out of people. He did wrestling stints just for the heck of it. He came real close of hitting rock bottom just to save himself at the end. He died of cancer at the age of 35, ridiculously young, and even then his own family didn't buy it. He lived misunderstood, and died misunderstood. And years later, he gets a biopic. Just what he deserves. It is sad that many people will know Andy's talent and understand him only after watching this film. But still, let's face it, at the end he did get the last laugh.<br><br>The true cornerstone in this film is Jim Carrey. Yes, you've heard endless reviews about him immersing himself into Andy, not just playing him. But this is acting beyond your dreams, trust me. Especially when he plays Andy's foreign character, Carrey lived and breathed Kaufman air. This is the movie where his silly-putty face comes handy, as it seems to help Jim turn into Andy. (If only we could do something about those teeth...) NEWSFLASH FOR THE ACADEMY: Jim Carrey can act!!! I remember Tom Hanks beginning with the same kind of movies that Jim did: loud, colorful, goofy and silly (films like \"Bachelor Party\" come to mind). Then he did \"Big\", then came \"Philadelphia\". When is Carrey's \"Philadelphia\" coming along? I can't wait to see him at the Academy Awards this year.<br><br>Man on the moon, indeed.","user":"jaycer1","rank":[126,149]},{"title":"This is a story about a man who lived and died without being understood.","rating":5,"date":"5 January 2000","review":"It is truly sad that we have to wait until a person is dead and gone to give him or her the honor they should have received while alive.  Andy Kaufman was a man of many talents, and I saw him only as this funny little man on a TV show called, \"Taxi\" with a cute accent.  Who could not fall in love with that person he was on \"Taxi\"?  He was cute, honest, kind, and funny!  Who knew that while we were all at home laughing, he was crying on the inside because that wasn't who he was, nor wanted to be.  I went to see this movie about a person who was famous for his \"Elvis\" personation, and his little record player, doing the \"Mighty Mouse\" skit on Saturday Night Live, never to forget \"Latka\" on \"Taxi.\"  He was a man of many talents, so many that the world never knew about, so many that only Andy knew who he really was.  Jim Carrey allowed us to come into Andy Kaufman's mind, and realize that this grown man lived in another place, another time, an entire other world where Andy was free, and there was peace, and where everyone never grew up, they stayed children playing \"pretend\" forever.<br><br>Jim Carrey put himself into this part, he lived this role...  He was Andy Kaufman.  Carrey was able to show me a whole new light on this man I thought I knew.  This funny man who could make you laugh just by walking on stage.  Jim Carrey showed us that who we saw, was not the man we thought we knew.  And it took his death to show the world that Andy Kaufman was in fact a human being, who just needed a hug, and a chance at what he did best.<br><br>This sadness me to realize that our joy brought this man pain, who we wanted was not who he wanted to be, and I think everyone should be able to live the dream they choose. I never cry at movies, because I am able to pull myself back and remind myself that it is just a movie, and those are just actors.  Jim was Andy, and what I saw was too true for me to tell myself, \"It's only a movie.\"<br><br>This is a story about a man who lived and died without being understood.  I cry for the person Carrey brought us into, the life he showed us that was hidden for too long.  No one could have given Andy such a life as Carrey did.  This movie is not a normal movie, it is art in the most beautiful form imaginable.  To sit in a theater and be at aw... for two hours is amazing! I only wish we had known Andy Kaufman when he was truly alive.  Now it is too late, the curtain has gone down...","user":"I Live 4 Movies","rank":[171,205]}]