[{"title":"One of my Favorite Movies of all Time","rating":9,"date":"26 September 2001","review":"I don't understand why this movie is so underrated. I have seen it multiple times, and each time I get something new from it. It is a beautiful work of art (The Director's Cut is also a must-see, because the added scenes elaborate on a few confusing plot points) Now, I would just like to take a moment and talk about the aspects of Stargate that make it an enjoyable, exciting, riveting, and thought-provoking film.<br><br>First of all, David Arnold has to be recognized for his masterful soundtrack. He should have won some kind of award, like Hans Zimmer won for Gladiator. David Arnold combines themes of romance, adventure, and wonder the likes of which I have never heard. (And believe me, I am an avid fan of movie music, especially Sci-Fi) I am even brave enough to say that his music in Stargate rivals classic, celebrated soundtracks such as Star Wars (John Williams) Next time you see the movie, pay as much attention to David Arnold's music as you pay to the plot. The opening titles themselves are reason enough to rush to the store immediately and buy the soundtrack. My favorite sequence of the soundtrack, by the way, is (#21 Myth, Faith, and Belief) In the movie, this is the scene where Daniel (James Spader) talks to Ra (Jaye Davidson) It is the scene right before the one where Daniel is *almost* forced to kill the soldiers, including Jack O'Neill (Kurt Russell) that he arrived with.<br><br>Second of all, this is a VERY believable science fiction film. Most films (like Star Wars, Star Trek, and more) don't have very many ways in which they can actually tie-in with reality. Stargate is in itself a theory. It asks: Where did the pyramids come from? How did the Egyptians develop their gods, and how were they influenced? The answer given by the film to these questions is entirely feasible. Even though the gate itself isn't easy to accept, the underlying theme to the movie is. (pay very very close attention to Daniel and the \"seminar\" he gives about 10 minutes into the movie in front of other scientists)<br><br>Third, and last, I would like to tip the hat to Jaye Davidson's performance. His portrayal of Ra is chilling.(although some people don't seem to agree) Just hearing him speak and seeing his eyes glow sends shivers up my spine. He makes a perfect villain, and it is truly a shame that he hasn't been in many other movies.<br><br>This movie receives from me an easy 9 out of 10. It would have gotten a 10 if it were not for the horrible lack of character development. Jack O'Neill is especially bland, although he does seem to brighten up a little bit in the last scene.<br><br>\nSee the movie! Buy the soundtrack! And I hope you liked my comments!","user":"RaHasGlowingEyes","rank":[105,127]},{"title":"Potential!","rating":8,"date":"18 May 2005","review":"What grabbed me about this movie was the potential it had. There was just so much that could be done with this dynamite idea. That alone made this an essential part of my movie collection.<br><br>The movie itself is quite average and while worth seeing, isn't going to knock your socks off. The acting is from adequate to good; the effects were well done and quite nicely not overdone.<br><br>So it's a fantastic idea that wasn't ruined, but isn't spectacular. The actors carry themselves well and this is a worthy addition to any sci-fi collection (especially those who like the idea of alternate history for mankind - See Alien vs. Predator).<br><br>I normally don't write such quick reviews, but this is what I felt about the movie and I think that much more would give away too much for those who haven't seen it.","user":"kersus","rank":[162,201]},{"title":"An amazing story...","rating":8,"date":"12 April 2005","review":"Stargate is a terrific movie that has produced 2 hit TV shows, conventions and fans from all over the world. This movie started it all. I found it in my Uncle's basement and decided to watch it. It has an interesting storyline tying in Ancient Egyptian Mythology to make it even more interesting. It's about a struggling archaeologist with strange ideas about the gods and rulers of Ancient Egypt. Only one person is willing to believe him, and recruits him for a translator. What they find is even more amazing than they expected.<br><br>It's a highly underrated movie, in my opinion it's better than most sci-fi movies and very interesting.","user":"back_blast","rank":[108,137]}]