[{"title":"A great film","rating":23,"date":"23 November 2000","review":"Danny Boyle seemed like he was destined for directorial greatness before the surprise success of \"Trainspotting\" got to his head.  His first two pictures, however, are wonderful.  \"Shallow Grave\" is one of the best modern thrillers I have seen in a long time.<br><br>The story centers around three British roommates who are trying to rent the empty room in their flat out to another person.  When they finally do find a man to rent the flat out to, he dies in his sleep, leaving behind a briefcase full of a whole lot of money.  What to do?<br><br>Much like \"Trainspotting\" of a few years later, \"Shallow Grave\" has very dark comical undertones to it.  Unlike \"Trainspotting\" however, it is a much more serious film.  Like Sam Raimi's \"A Simple Plan\" of four years later, it explores a moral dilemma between three friends on what to in a situation when you find a lot of money that does not belong to you.  Do you compromise your morals for the money or do you do the right thing?  One is never quite sure how the story will turn out and as you approach the ending of the film, you are never quite sure which one of the three friends is more sinister than the next, which makes the twists in the last part of the film such a darkly hilarious and chilling delight.<br><br>Films like \"Shallow Grave\" are exactly what independent filmmaking is all about.  It's a smart, sleek and stylish film made on a small budget, driven by a cleaver story and interesting characters.  Ewan McGregor and Christopher Eccleston both give great performances in this film.  `Shallow Grave' is miles better than any thriller Hollywood has come up with in the last 10-15 years (if not longer).  I give it an 8 out of 10.","user":"urbanstruggle","rank":[85,97]},{"title":"Vibrant and suspenseful","rating":8,"date":"9 July 2005","review":"A great modern thriller containing all the necessary ingredients of a decent suspense story: constantly growing tension, sly humor, and genuinely surprising plot twists. It's kind of like a 90s version of a Hitchcock flick (think \"Rope\"), and like somebody here wrote, once you start watching it you can't stop.<br><br>The plot is deliciously wicked. Just how far are you going to go for money? Will you kill for it? Are you willing to share it? Will you give up your best friends for it? How insane will a large amount of cash drive you? And in the end, and this is the most important question \"Shallow Grave\" rises, will it make you happy?<br><br>If there was any more violence in this movie it would turn disgusting, but Danny Boyle knows how to measure it just right. Though he doesn't quite reach the virtuosity of \"Trainspotting\" here, his trademarks are all present: the fast pace, the urban background beats, the enthralling camera angles and so forth.<br><br>The three leads are all great, but there's no question about who the movie belongs to: Ewan McGregor is energetic, powerful and photogenic in his portrayal of a young journalist. No wonder he became such a star.","user":"samuliff","rank":[58,69]},{"title":"Well-done approach to classic suspense plot.","rating":7,"date":"8 April 2004","review":"Good first feature film from director Danny Boyle and writer John Hodge.  A good, solid thriller with a healthy dose of dark humor.<br><br>Interesting dynamic among the three principle characters, though their motivations toward each other could have been made more clear. <br><br>\nThe age-old plot of ordinary people getting mixed up in an unexpected acquisition of dirty money and finding their worst tendencies coming to light is done with style and clever wit, with a couple of nice twists that I doubt anyone will see coming.  (Although, I'm a little hazy on just HOW it ends up that way.)  <br><br>Boyle is definitely one of the great, stand-out directors of the 90s-and-beyond crowd, in the upper ranks with Tarantino, Fincher, Ritchie, and a few others.<br><br>7/10 stars","user":"tommonster3k","rank":[31,39]}]