[{"title":"Two thirds of a great film.","rating":7,"date":"9 November 2004","review":"Bille August's \"Smilla's Sense of Snow\" starts off with great promise. An opening sequence that's a terrific hook segues into an introduction of the character of Smilla Jasperson, played perfectly by the lovely Julia Ormond. Smilla is self-isolated, deeply unhappy, and unapproachable. Her only real friend is the young Inuit boy, Isaiah, who dies suddenly under suspicious circumstances, and Smilla determines to uncover the reasons for his death. For the first two reels, this film is a terrific mystery story with good pacing, fine acting, and evocative cinematography. Characters with uncertain motives come and go as the story unfolds, most played by a fine stable of talented actors. But then in the third reel, the film collapses. I'm not talking about a slow descent into mediocrity here; I'm talking about a precipitous nosedive. Out of the blue, the story suddenly switches to an action/thriller format that is poorly written, directed, and edited. New, undeveloped characters are suddenly thrown into the mix, each a deus ex machina as the increasingly unrealistic plot requires. The film's denouement, in which the underlying mystery is revealed, is so scientifically ridiculous both in terms of biology and especially in physics that I felt thoroughly cheated. It's as if the entire enterprise were rushed to completion due to a looming shortage of time, money, and interest. What a pity. Even so, the first two thirds of the film stand up well on their own, and my rating is based on that. Rating: 7/10.","user":"Latheman-9","rank":[63,75]},{"title":"Atmospheric Thriller","rating":7,"date":"18 November 2004","review":"n a cold December day in Copenhagen, a young boy named Isaiah falls to his death from the roof of the block of flats where he lives. The official police view is that he slipped and fell while playing on the roof. Smilla Jaspersen, a neighbour of Isaiah and his mother, does not accept that his death was an accident. Isaiah had a fear of heights, so was unlikely to have been playing on the roof; moreover, the footprints in the snow do not support the police version. Smilla therefore decides to start her own investigation to find out what really happened. <br><br>Isaiah and his mother belonged to Denmark's Greenlandic minority, and Smilla herself grew up in Greenland, the daughter of a Danish father and Greenlandic mother. She is in her late thirties, and works as a freelance mathematician and expert on the physics of ice and snow, although she has no formal academic qualifications. She discovers, however, that Isaiah's father was an employee of a Danish mining corporation and that he died in mysterious circumstances during an expedition to Greenland organised by this corporation. She begins to suspect that Isaiah's death was also in some way linked to the company, and learns that they are organising another voyage to Gela Alta, a small island off the coast of Greenland, although she does not know what the object of this voyage is. Nevertheless, she believes that the key to the mystery lies on this remote island and joins the crew of the ship as a stewardess, just ahead of the police who resent her interference in the case and are trying to arrest her. <br><br>This was one of those films that I enjoyed more than the original novel. Peter Hoeg's book was itself in some ways reminiscent of a film. The first half, with its urban setting, its tough, gritty investigator and its suggestion of a web of corruption and wrongdoing in high places, reminded me of a Humphrey Bogart style film noir, and the second part, set on the ship as it makes its way through the Arctic ice, of one of those filmed versions of Alistair MacLean thrillers that were so popular in the sixties and seventies. I found, however, that it suffered from an over-complex plot and was too slow moving to work as a thriller. Bille August's version removes some of the complexity of the plot and moves along at a faster pace. The revelation about exactly what lies below the ice comes earlier in the film than it does in the book- possibly August realized that the book's ending, more science fiction than science fact, was one of its weak points, and wanted to get this detail out of the way to allow the closing scenes of the film to concentrate more on the battle between Smilla and the villains. The film keeps, however, the book's atmospheric sense of place- there were some wonderful shots of Copenhagen in winter and of the Arctic ice.<br><br>Julia Ormond seemed to be the cinema's Big New Thing of the mid-nineties. Her role in 'Smilla's Sense of Snow' followed starring roles in three big Hollywood films, 'Legends of the Fall', 'First Knight' and 'Sabrina'. Since then she seems to have disappeared from the radar altogether and I have often wondered what has happened to her.. Her performance in 'Smilla', however, is a good one and she makes an appealing heroine. Rather more appealing, in fact, than Hoeg's original character, who combines a strong sense of justice with a gift for rudeness and sarcasm. Of the other actors, the best was Richard Harris as the chief villain, although he was probably considerably older than the character envisaged by Hoeg.<br><br>Although it is very different in its visual style, this atmospheric thriller is perhaps the nearest that the modern cinema comes to old-fashioned film noir. Despite its weaknesses it remained watchable throughout. It confirmed my view (based on 'Pelle the Conqueror' and 'The House of the Spirits') that Bille August is a highly talented director. 7/10","user":"JamesHitchcock","rank":[37,47]},{"title":"Absorbing intrigue set in frozen lands and satisfyingly directed","rating":7,"date":"14 April 2009","review":"This mystery picture begins on a crashing-meteor opening and concerns about Smilla(Julia Ormond), a lonely scientist resident in Copenhagen. The grumpy Smilla is an half-America and half-Inuit with many problems of adaptation and her father(Robert Loggia) is a rich financier. When she returns home discovers the body of six-years-old friend named Isaiah(Miano) nearly her apartment building. Smilla believes the kid was killed and starts investigating , it leads to the Greenland mining company that is owner the magnate Tork(Richard Harris). Meanwhile she falls in love with her suspicious neighbor(Gabriel Byrne).<br><br>The picture based on Peter Hoeg's best seller novel packs suspense,thrills,intrigue, tension and interesting character study. The story is well developed though its final fail to sustain the outcome and is a little bit crappy. Suspenseful and mysterious musical score by Hans Zimmer and Harry Gregson-Williams. Exceptional secondary casting mostly formed by British actors such as Jim Broadbent,Vanessa Redgrave,Bob Peck, Tom Wilkinson, among them. Evocative and cold cinematography is consistently created by Jorgen Persson, Billie August's usual cameraman.Location photography is particularly breathtaking with impressive images like a large icebreaker ship, snowy outdoors and giant floes thawing, among others. This partially successful first attempt at the thriller and tense mystery is efficiently directed by August. Billie is the Danish's best director, an expert on intelligent dramas as ¨Pelle the conqueror¨which took the best foreign-language film Oscar , ¨Twist and shout¨,¨The best intentions¨, ¨House of spirits¨, and ¨Les Miserables¨. Rating : Well worth seeing, better than average.","user":"ma-cortes","rank":[13,15]}]