[{"title":"High-Tech Whodunnit","rating":8,"date":"27 May 2006","review":"This movie is not always easy to understand but if you give it a couple of looks, which it is worthy of doing, all the pieces finally fit and it's a good two hours of entertainment.<br><br>This modern-day crime movie may have a lack of action compared to others of its genre but it never loses your attention. Sean Connery, Wesley Snipes and Harvey Keitel star, along with Cary-Hiroyuki Tagawa, Kevin Anderson, Mako and Tia Carrere. This is a high-tech story (at least for 1993) as two cops try to figure out who murdered a woman. It's Japanese-big business-politics intrigue with surveillance cameras being the key to figuring out a murder.<br><br>Connery and Snipes complement each other as a \"buddy\" cop duo with Connery being mostly responsible for making this story interesting. The still-suave ex-James Bond plays the cool veteran and it's fun to watch him operate.<br><br>The only complaint I might have is the ending, a stupid romance-type story with Snipes and Carrere that was very post-climactic and not needed.","user":"ccthemovieman-1","rank":[49,56]},{"title":"Great Book Turned Into Average Thriller on Film...","rating":17,"date":"17 March 2003","review":"\"Rising Sun\"<br><br>There is an old Japanese motto: \"Business is war.\" Well, that sentence is taken to new heights in the Philip Kaufman thriller \"Rising Sun,\" based on the best-selling novel by Michael Crichton.<br><br>Wesley Snipes plays Web Smith, a Japanese-American liaison officer in LA who is called on duty after a young woman is found dead at the opening party for the new Japanese company named Nakamoto. Sean Connery plays John Connor, a retired liaison officer who is an expert on Japanese customs and culture. He is requested to come on call as well, and does, trailing along with Web.<br><br>When they get to Nakamoto, they find Tom Graham (Harvey Keitel) and other cops hovering over the body of the dead woman. Soon, foul play is suspected, and Smith and Connor must find the killer before it is too late.<br><br>\"Rising Sun\" is taken from a great novel, and turned into an average thriller. There is nothing spectacular about the film. It stays surprisingly true to the book, but the very few things that stray from the course of the novel turn out to be the blunders.<br><br>There are no sparks flying between Sean Connery and Wesley Snipes. I think that Snipes was a bad casting decision. Connery is perfect for the character of John Connor, but Snipes just doesn't fit Peter Smith - whose name was changed to Web Smith for the film, for no apparent reason other than Peter isn't a suiting name for Snipes.<br><br>The director/screenplay writer of \"Rising Sun\" - Philip Kaufman, who brought us \"The Right Stuff\" - seems to have charisma and obviously tries to keep the film true to the book. Unfortunately, however, there is an element of suspense missing from the film. There are no real surprises. In the novel, Connery's character John Connor seems to know everything that is going to happen, but there is still a sense of suspense. In the film, however, Connery's Connor seems to know TOO much about everything that is going to happen. Instead of being one step ahead like he was in the book, he seems to be twenty steps ahead in the film. There is one scene that really jumped out at me where Connor walks in and says, upon discovering a man believed to be dead, \"Oh, I was wondering when he'd get here!\" In the novel, Connor gives a reason why he knew the man wasn't dead. In the film, he just seems to know the man is still alive for no apparent reason. If Connor knows everything that is happening, everything that has happened, and everything that is going to happen, why keep Web - and us - in the dark? <br><br>At least Connery fit the character of Connor - it would have been about ten times worse if they had chosen someone else.<br><br>Believe it or not, the film might have been better if it had NOT been so close to the book. What I mean by this, is that by making everything just like the book, Kaufman raises the expectations a notch, and when ONE SINGLE THING is changed from the book, the audience is disappointed, because by then we have come to expect everything in the movie to be like the book. Expectations wouldn't have been so high if he had made everything different from the book. Which is NOT to say I don't enjoy that he stayed true to the book. <br><br>It's a confusing opinion. In some ways, I enjoy how true to the novel the film was. But there is just something missing. Even though the cast is top notch for the most part, Snipes just didn't fit. And while Connery was perfect as Connor, he seemed to know too much about what is going on. There is no real suspense. Perhaps that is the biggest flaw of the film.<br><br>A great book turned into an average thriller worth seeing once.<br><br>3/5 stars -<br><br>John Ulmer","user":"MovieAddict2016","rank":[33,42]},{"title":"Fear of Other Cultures, Learning to Understand Them and the Seemingly Obvious","rating":7,"date":"15 June 2007","review":"Michael Crichton's Rising Sun is an extensive, dense, unpredictable mess. The actors have a lot of fun and the story is a splurge of entertainment, but it's not paying enough attention to a couple of things. One of them is what its focus is. Is the film about the murder, the two men solving the murder, the clash of American and Japanese cultures, or what? The other thing the film forgets could be a drawback of the first thing. It's that it doesn't tie up all its loose ends. At the end, there are strands left with no ending, even a mysterious ambiguous one. It just ends because it feels the pace of the film requires it to fade out at that particular point.<br><br>The film is not bad, mostly because it's far from boring. In fact, there are many scenes of dialogue, despite a few corny scenes of dialogue, that are subtly interesting. We don't quite understand why the exchanges are interesting until later, when we realize that the characters are so deeply contemplated that the scene felt as real as the room you're sitting in. But maybe I'm giving the film too much credit for simply being a load of fun for Michael Crichton to write. After all, he wrote and directed one of the greatest heist films ever made, The Great Train Robbery, also with Sean Connery.<br><br>Sean Connery, of course, is the highlight of the film, because there's hardly a way he cannot be. Despite his irrepressible suavity, he does not play himself. He plays a resentful, inflexible, self-indulgent veteran cop, and we are supposed to like Wesley Snipes more because the film centers, well, seems to want to center around his character and also we're given more backstory and information on him. However, we don't like Snipes more than him. Connery may play a stubborn old jerk, but I'd rather one of those than a pompous, intolerant, overpround young jerk like Snipes can hardly help but play.<br><br>I cannot reach a verdict on this film. How can I? There are so many things to enjoy at the same time they are hazardous to the film's health.","user":"jzappa","rank":[19,23]}]