[{"title":"A film that hits close to home....","rating":9,"date":"7 February 1999","review":"\"October Sky\" is a film that will steal your heart, fill your mind with vivid imagery, and lift your spirit. The tale of Homer Hickham and his dream of creating a rocket seem so simple at first, especially when the film is set in a mining town, where the future is as clear cut as the lumps of coal in the mine. But Homer cannot follow in his father's footsteps. With the encouragement of Miss Riley,(a friendly teacher), members of his father's staff, and his friends, Homer attempts to make his dream a reality.<br><br>Yet as in any true to life story, there are many stops along the way. Director Joe Johnston lowers us into the coal mines, where we witness the chilling plight of miners stooped beneath a ceiling of rock. With lit helmets and bent posture, they resembled alien insectoids more than humans in the darkness. The hacking coughs of the miners and the blackened faces were a constant reminder of the danger the miners faced in their work.<br><br>Contrasting the mine shaft's lugubrious load are the images of Homer and his friend's rocket launches. Underneath the blue bowl of sky, rockets are placed upon a pad and launched into the stratosphere...And nothing can match the scene when Homer sees Sputnik for the first time.<br><br>Yet what makes the film so endearing is the relationship between the characters. Homer's father is a classic hardened man...but he has a soft side as well. We see that he does love his son, despite their many arguments. The love and support of Miss Riley is evident as well. Best of all, the film is uncomfortable. It doesn't tie everything up in a nice bow. It tears at you, lifts you up. It keeps an air of reality, which is important in a film like this.<br><br>This film can be considered a complete work. At first, I was disappointed that the film did not continue with Homer's life. I didn't want it to end. Then I realized...that's what a good film does to a person. If it has done its job, you won't want it to end. And \"October Sky\" accomplishes just that.","user":"Jolie","rank":[129,134]},{"title":"Loved it","rating":10,"date":"24 March 2005","review":"1.) This movie was amazing! I watched it while I was in the town next to the one where he grew up! I went and saw the buildings that the story took place in. Overall, I loved this movie, One of Jake Gyllenhaal's best!! Also- my favorite parts were the science fair, and all the times with his father. They were so sad, it seemed. Homer wanted to follow his dream and his dad didn't seem to care one way or another. That tag line is true. \"Sometimes One Dream is bright enough to light up the sky.\" 2.) The way this movie was shot was impeccable, it was all so believable that it could have been recorded during the 1950's. Dress was accurate and they had their slang down too. Definitely recommend this movie!","user":"haydensprincess2005","rank":[97,105]},{"title":"Inspirational","rating":31,"date":"31 July 2004","review":"I loved this movie. It is one of the few movies that I have consistently recommended to friends to rent and have had all of them thank me for the referral. The film has some powerful themes that are beautifully scripted. The acting is superb all around (Chris Cooper has never turned in a bad acting role in my opinion!) The message of this film is so well delivered, so powerful, that it moved me to tears the first time I saw it. Not sad tears, which are easily solicited by cinema formula, but tears of joy--a rare thing.<br><br>Although I did not grow up in the 1950's, I believe this film honestly portrays the mood and setting of the time. Given today's harsh world with all its complications, watching this film is a welcome escape to a time of innocence, wonder, and discovery. Highly recommended!","user":"seagorn","rank":[75,84]}]