[{"title":"This doesn't deserve the low rating","rating":7,"date":"9 August 2017","review":"Little Nicky is the story of the son of an angel and \"the\" devil. It is not a smart comedy but it is hilarious and a good time. Just hang back and enjoy. It is definitely funny and the cameo's make it worth it. Stars like Ozzy and a good sh*t-ton of heavy metal music make for a good time. If you have some portion of morbid humor and like some heavy metal, I'd say bring some friends over and have a good time.","user":"thea-verburg","rank":[17,20]},{"title":"Pretty underrated!","rating":10,"date":"20 December 2003","review":"Geeze, this movie got the shaft!  I thought it was a lot of fun and pretty funny.  The Ozzy Osbourne line, 'Here, kill him with theeees' cracks me up every time.  I don't know why this is disdained so much.  Sure, it's no \"Rushmore\", but it has its place and I enjoy it for what it is--a kind-hearted, dumb, funny comedy in the vein of \"Dumb &amp; Dumber\" or \"Tommy Boy\"--both classic movies in and of themselves.  In that category, I give \"Little Nicky\" a 10!  Blow-hards and elitists need not apply....","user":"robbie-20","rank":[113,179]},{"title":"The Quintessential Sandler Film!","rating":10,"date":"13 February 2001","review":"This was a great film and one of the best films of the year, contrary to what so many others say. This is the second most underrated &amp; unappreciated movie of 2000, following Book of Shadows: The Blair Witch 2. There is nothing to not like about this movie, it is virtually non-stop laughs from beginning to end.<br><br>Reading some other user's reviews I'm stunned at their disdain and hatred for this great film. People always say that this is no Citizen Kane...well duh...to quote Highlander \"There can be only one!\". Now I'm not saying that this movie is in the same league as Citizen Kane, but that doesn't mean it's bad. This is an epic Sandler piece, and his funniest to date, and is quite possibly the definitive Sandler film.<br><br>Unlike most people, I loathed Big Daddy, writing it off as cheesy and overly sentimental; a one-joke gag stretched beyond its limits. Luckily that does not apply to this film, every aspect of this film is great, from the surprise cameo by \"CHUBS\" (Carl Weathers) to Harvey Keitel's hilarious turn as Papa Satan. You've gotta love a movie that lets Quentin Tarantino use his \"unique\" acting \"ability\" to his advantage in a brilliant performance as the religious zealot. My favorite cameo belongs to B-Movie God Clint Howard...after this movie, I don't think I'll ever look at him the same way again! The Cameos are worth the ticket price alone!<br><br>The story was top-notch and was brilliantly executed. This film definitely shows maturity in Adam Sandler and Tim Herlihy's writing abilities, as they created a complex and involving storyline, and great and hilarious characters.<br><br>I recommend this film to any film fans. Give this one a shot, regardless of your personal view of Sandler and his talent. Sandler is one of the most underrated and ridiculed acts out there today, which is sad considering his remarkable talent. How many other performers out there today write, produce, and star in their own films?<br><br>I give this one * * * * * * out of * * * * *","user":"darkgodmobutu","rank":[81,134]}]