[{"title":"Exposes The Vulgarity Of Reality Shows,And The Public That Loves Them","rating":9,"date":"30 May 2005","review":"I never liked reality shows,and when this movie was shown on cable I decided to watch it and found it really interesting.Matthew McConaughey plays video store clerk Ed Pekurny who lives with his parents and his big brother Ray Pekurny,played by Woody Harrelson.He is hired by a TV company that wants to do a 24-hour reality show based on his life,and Ed grabs the offer.In the beginning,the public tells Ed that his show 'stinks',but as they see him getting involved with his elder brother's girlfriend,the ratings go above the roof.What's more,when Ed makes out live with the bombshell to end all bombshells,that is Elizabeth Hurley,the interest verges on voyeurism.The icing in the cake comes when Ed's father suddenly turns up from nowhere,having abandoned him and his brother years ago.The film is a well-made documentation of the vulgarity of the public that makes up the television audience not only in America,but the whole world.Sex and scandal will always be the top-sellers,whether it is an ordinary man's tale or that of a celebrity.In fact,it is Ed's scandalous life that makes him America's Number One celebrity.McConaughey plays his role with ease,and so does Harrelson.Ellen Degeneres is good as the unscrupulous TV producer,while Elizabeth Hurley's brief appearance leaves the audience gasping for more.Quite entertaining and very candidly made.","user":"gatsby2244","rank":[28,33]},{"title":"Nearly nothing like the Truman Show.","rating":3,"date":"3 October 2001","review":"It's a shame that due to the timing of when Edtv was released, it was automatically deemed a pitiful copy of the Truman Show, a movie that won our hearts the previous year. Now, I love the Truman Show too, very much, and I'll admit that I was was very uninterested in ever seeing a copy-cat version of it. It was until just a few weeks ago that I actually watched Edtv (even with the expectation that I would most likely not like it too much) and I must say I was pleasantly surprised!<br><br>Not only was Edtv funny and entertaining, but it was nearly nothing at all like the Truman Show. I mean, the ONLY similarity is the idea of a live TV show about an \"ordinary\" guy. But Truman didn't even know he was on TV. He was just living what he thought was an ordinary life. All the cameras and microphones were completely hidden and he lived in a town that was entirely fabricated from his wife and life-long best friend, to the rain and even the sun. His is a story of a man searching for an escape from his everyday life, which little by little he is realizing may not be what it seems. Ed on the other hand was a nobody who was chosen to have a camera crew actually follow him around all day while he went on about his life. His life, and in turn the show, became more about instant celebrity as viewers became enchanted in watching this loser become a mega-star over night. People flocked around him just as much to meet him as to be on TV themselves and he endured some major struggles in keeping his life and relationships normal, which was impossible with his celebrity status and on-camera life.<br><br>Both movies had a theme of America's fixation with TV, and more specifically Reality TV, but have different plots and overall themes altogether. I think Edtv was a very enjoyable movie and Mathew McConaughey and Jenna Elfman delivered fantastic performances. Not to mention the mind boggling, and I think underrated, job of editing such an enormous amount of footage. Considering that while the film cameras were rolling, the video cameras were rolling too, and just about all of the video footage you see was actually shot when you see it being shot, I think that Ron Howard did a great job of keeping track of it all and actually making it work. So when someone says, \"Well, it was no Truman Show\" they are absolutely right. I  think it is a great movie that stands on it's own and should stand proud.","user":"DustoMcNeato","rank":[48,61]},{"title":"Feared this would be a gritty, angry Truman Show, but was pleasantly surprised.","rating":7,"date":"6 December 1999","review":"Even though I like most of the players, I really wasn't expecting much from this movie. I wound up surprised by its freshness, wit and thoughtfulness. I feared a poor person's Truman Show, but this film took a lot of the same themes and spun them in different directions. The film lacked Truman's sadness and humanity but made up the difference with more concise and challenging social commentary (not to mention a better supporting cast). Issues of celebrity, entertainment, the media, the information age were all handled in interesting ways. When it needed to be abrasive and shocking, Ed TV took its shots, but it usually remained in a very comfortable and entertaining middle ground. As a viewer, I felt like someone who had spent the previous 15 minutes surfing channels before finally finding a gem worth watching.","user":"genegorman","rank":[10,11]}]