[{"title":"No Direction Home","rating":9,"date":"22 March 2009","review":"RIVER OF GRASS is a quintessential example of Slacker film making. The script is sharp and well written with a most effective use of 'voice over'. The narrative is portrayed by a rag-bag cast of characters who could have have fit right in on any 1980's Jim Jarmusch film. Kelly Reichardt, the writer/director, has a sure feel for existential dialog and plot. The story involves a handgun which is lost by a detective, and inadvertently winds up in the possession of his aimless '30 something' daughter, Cozy. She and a barroom pickup participate in an absurd and incongruous shooting, and, in a panic, decide to hit the highway. Devoid of direction or purpose, the protagonists stumble and fumble in a car chase movie where they can't seem to get out of PARK. When they finally make it to the interstate, they are turned around by a trooper because they lack a quarter to pay the toll. Instead of a sensational interaction with the cops, they are more or less ignored. The film was shot on seemingly Third World locations near the Florida Everglades, and even the colors seem washed out and weary which adds to the cheerless experience of the movie. RIVER OF GRASS is an incisive bit of Independent film-making which might be described as 'THELMA AND LOUISE for abject losers'. This is truly a gem in the rough.","user":"valis1949","rank":[13,13]},{"title":"Indie budget update of 'Badlands'","rating":7,"date":"29 April 2012","review":"Like in Terrence Mallick's brilliant 1973 'Badlands', we have two, desperate, bored and unfulfilled young people here, who aimlessly - and pointlessly - fall into crime and then are then perpetually trying to avoid the repercussions from then on.<br><br>Charismatically, our two protagonists can't hold a candle to Charlie Sheen and Sissy Spacek of Badlands but as believable, everyday folk, Lisa Bowman and Larry Fessenden, as Cozy (a day-dreaming young woman named after her cop father's favourite jazz drummer) and Lee Ray, an unpredictable and moody son-of-a-gun who you could describe as having a poor attitude to both life and to others, they're fine.<br><br>Director Kelly Reichart's movie is at times both dreamy and at others more immediate. Though, if you're after blood-splattering action, you might be disappointed as this is more a character piece. Interesting camera angles add to the quite indie, fly-on-the-wall photography and we are introduced to some of the less glamorous and non-touristy parts of Florida. The title refers to the Native American name given to the stretch of swamplands near the Everglades.<br><br>A smattering of old jazz records provide the only soundtrack.<br><br>River of Grass says nothing new and covers no new ground but as a contemporary alternative to the Bonnie &amp; Clyde and Natural Born Killers genre, that I and many others find both enthralling and intriguing, then this is a worthwhile, if minor, addition. I saw it on Film 4.","user":"tim-764-291856","rank":[9,10]},{"title":"a sign of things to come, if less than the sum of its parts","rating":6,"date":"29 January 2016","review":"River of Grass is a 'first-movie' (practically in quotes to make the distinction) not just in the fact that it is for Kelly Reichardt, but in tone too: the film is a loose, vaguely noir-ish tale with a more low-key beat and looking forward for when the director really takes a hold of that \"mumblecore\" thing years later as it's about a mother of two and a 2nd-tier Jack Nicholson character think they've accidentally killed someone and they go on the run... not really(?) <br><br>It's like the American remake of Breathless I might've wanted instead of the weak one with Richard Gere. It's a little too short to be more than a little festival experiment, but it has some good jazz, some good acting, a few genuinely weird and funny moments (some with a quirky Orthodox Jew who laughs a lot), and a final twist that seems needlessly pessimistic. I want to emphasize if you're a Reichardt fan and come to this in retrospect that it's not a bad debut, and not a great one either, though it does speak to her as having more of a sense of humor than her other films might lead one to believe.","user":"Quinoa1984","rank":[5,5]}]