[{"title":"A spectacular portrayal of the unseen life of Charlie Chaplin.","rating":10,"date":"10 August 2001","review":"Robert Downey Jr., first of all, portrays Chaplin with amazing accuracy. Some parts of this performance are particularly memorable, such as his invention of the famous tramp's walk just after having feverishly picked out the outfit, the astonishingly accurate depiction of Charlie as an old man, and of course, the many parts of the film that involve parts of his life where he was working on his own films. These are clearly some of the most interesting parts of the movie, if only because these films are how we know him, but it is at least as interesting the way that the film hints towards things that happened in Chaplin's life that inspired those films.<br><br>\nVery early in the film, we see a scene in which Charlie's mother is booed off the stage by an impatient crowd, so Charlie, who is a little boy at the time, gets on stage to do a song and dance of his own. He performs a song that is very similar to the one his mother performed, but he wins the audience's heart and they respond by tossing coins onto the stage for him. You can't help noticing how this corresponds with the constantly youthful look of the Tramp (in Modern Times, for example, Chaplin was in his late 40s but looked like a teenager), and the coins tossed on stage may have played a significant role in helping him realize that this could be a good way to make money.<br><br>Charlie moves to America to pursue his dream, and we see the landmark events that punctuated his dizzying rise to stardom. He goes to work briefly on stage and is then hired by Mack Sennett, a gigantic figure in film history, but is unsatisfied because of his own lack of control over his work. It should also be noted here that there is a scene where he is working with director Mabel Normand, who demands acting from him that he does not agree with, and with whom he clashes. In 1914, Chaplin starred in a 9 ½ minute film called Mabel's Busy Day, in which he plays the uncharacteristic role of the antagonist. The Mabel in this film is a sporting event vendor who turns down Charlie's amorous advances, after which Charlie proceeds to steal all of her products and hand them out to anyone standing nearby. Then in 1920, he starred in another short comedy called Mabel's Strange Predicament, in which Mabel is a woman who becomes locked out of her hotel room in her pajamas and ends up avoiding the drunken Charlie for the rest of the film. In both films, Charlie plays uncharacteristic roles, the most unenviable of which was in Mabel's Busy Day, which Mabel Norman directed.<br><br>\nLater in the film we see Charlie in a small diner just after having terminated his employment with Mack Sennett, and he meets Edna Purviance in a scene that is reminiscent of his romantic endeavors in such early films as Caught In A Cabaret and, even more so, The Immigrant, one of his most famous early films. There are dozens of other references to the development of his cinematic personality - such as his sudden realization of how to make the Tramp appear rich to the blind girl in City Lights without talking, as well as the dance of the dinner rolls, which Charlie performs here at a dinner at an expensive restaurant - but there is an even more significant portrayal of Charlie's beliefs and his values in this movie that are more recognizable as well as more memorable to people not familiar with his earlier and less known work.<br><br>Charlie Chaplin was one of many filmmakers' in the earlier times of the medium that resented and disapproved of the coming of sound to the movies. His Tramp remains one of the most recognized figures in the history of the cinema, and it is widely known that the Tramp is an almost entirely silent character, so it is necessary for a film about Chaplin's life to address this in some way, and it is done perfectly here. There is a scene where Charlie's brother is trying to convince him to add spoken dialogue into his films and Charlie refuses outright, giving a hilarious example of a Russian ballet dancer and saying, `The Tramp CAN'T talk. The minute he talks, he's dead.' This is a brilliant way to illustrate Charlie's fondness for the silent film, as well as his knowledge that no voice given to the Tramp would fit his character right. He was too well known to be changed so profoundly.<br><br>\nCharlie Chaplin created 81 movies in his lifetime, many of them timeless and truly memorable, and has made a significant impact on the filmmaking medium as well as on the world itself. He was a fascinating personality both onscreen and off, which is another element of his life that was necessarily and skillfully presented in this film, this time directly in the dialogue in what is probably the single most important line in the entire film  `If you want to understand me, watch my movies.' Chaplin's ever-present sympathy for the underprivileged is subtly but effectively portrayed as two poor people approach him on his way out of a nice restaurant, right at the beginning of the Great Depression, asking for his autograph. The elderly Charlie notes in retrospect that, `I wish they'd wanted my money.' <br><br>He is always aware throughout the film and throughout his life of the difficulties constantly facing poor people, and he wants to give these people not only an escape with his films, but hope for the future. There is a point in the film where Charlie has returned to Europe to see an old friend, and he learns on the train that she has died. He is then asked, `What'll we do, Charlie?' And his answer, although spoken under his breath almost in a whisper, rings louder than anything else in the film.<br><br>`Smile.'","user":"Anonymous_Maxine","rank":[95,109]},{"title":"Don't forget greats like Chaplin!","rating":10,"date":"29 December 2000","review":"Thankyou to Richard Attenborough for this film.  I watched it many a time and enjoyed both the biographical aspect and the comedic one but it has also increased my interest in silent comics of this great era.<br><br>The film begins by exploring the early life of Charlie, his Brother Sid and his Mother as they try to scrape a living.  Thankfully Attenborough doesn't concentrate too much on this deprived part of Chaplin's life. However it does reveal interesting facts about Charlie that he never forgot during his rise to superstardom.<br><br>Although Chaplin is played by younger actors at the begining it is the arrival of Robert Downey Jnr which Chaplin fans will anticipate the most. He puts in an amazing performance, his London accent is excellent and ability to do slapstick even better he also really makes you believe that the great man is alive and on the screen again.<br><br>The film rightly concentrates on the private life of Chaplin and the development of the cinema.  Whilst others may want to see the film concentrate on Chaplin's great pictures e.g The Kid, Gold Rush, and the Great dictator Attenborough blends the creation of these films into specific turning points in Charlie's life.  For example Modern times is used to show Chaplin's sympathy towards victims of the wall street crash, as he knew what it was like to be extremely poor.  His Jewish connections are also highlighted by the Great dictator,  which shows his sensitivities to the European Jews were more at heart than just a making a heap of cash by having a laugh at Hitler's moustache and goose stepping troops.<br><br>The film doesn't get bogged down by Chaplin's hectic love life, as Dickie explores Charlie's political beliefs and how J Edgar Hoover was convinced of he was a communist party member.  By doing so it shows how Hoover was one of the most twisted individuals to hold public office,  with a dangerous obsession on peoples private lives and background.<br><br>The film does a good job in showing how important silent stars were and how we should not forget that they were the true greats when films were developing all the time from shorts to feature length, from silent to sound.","user":"a.kellett","rank":[64,73]},{"title":"the triumphs and darker spots to the clown of film","rating":8,"date":"18 August 2008","review":"Chaplin isn't really a great bio-pic, but there are moments when Richard Attenborough's direction shines and it's consistently got an amazing Robert Downey Jr. performance as the title character. In fact, this is the kind of movie where the lead actor is so important that some of the major enjoyment and success of the film rests on him/her, oddly enough since it is a varied and superlative ensemble. There are moments when Attenborough's grandiosity gets in the way, and the moments that mark it as being somewhat conventional. What made me pleasantly surprised is what Attenborough *did* decide to show with Chaplin the private man; I thought that he would cut out much of the stuff with Chaplin's penchant for young (usually underage) girls, or some of the things regarding his mother, but most of the notorious facts are put in for good measure to counter-balance some of the pompous, though fascinating, scenes of \"cinematic history.\" <br><br>Now as a fan of Chaplin's films and the given acknowledgment that he's one of the most talented comic actors and filmmakers of the 20th century, I do get a little choked up seeing that final clip-show at the Oscars of great clips from his most famous movies. And it's interesting always, from just a movie-buff stand-point, to watch the history behind Chaplin's transition from vaudeville to Max Senett's film company to slowly becoming an independent and world-famous auteur/star. But for the most part the writing and the direction make it entertaining just on that conventional, rise-fall-rise-fall-struggle-success-at-end story with maybe less drugs and a bit more politics than one might usually see (save for one fantastic scene when Chaplin and his brother and friends are sneaking around the film footage of The Kid from the brass who want it for tax purposes).<br><br>What makes it almost outstanding, however, is Downey Jr. He's funny as Chaplin when he needs to show how he was a great clown (i.e. the 'old-drunk' bit), he's melancholy when needed, he plays Chaplin as young, middle-aged, and old perfectly, and there's just the slightest details that keep you glued to the screen to see what he'll do next. It's not exactly a breakthrough role as he'd been doing some really good work intermittently in the late 80s, but this is the one that got him recognition by the likes of the Academy, and rightfully so. It's masterful work in a decent tribute to Sir Charles \"Tramp\" Chaplin, and should delight those looking for a good ensemble and a commanding lead performance.","user":"Quinoa1984","rank":[30,33]}]