[{"title":"Funny Interplanetary Sex Farce","rating":7,"date":"5 September 2000","review":"This is a cute little sex farce starring and written by Garry Shandling. Harold Anderson (Shandling) is actually an alien on a very special mission. He must impregnate an earth woman to begin the infiltration of earth for eventual domination and takeover.  He has done his research and learned to be a good listener, dutifully repeating `uh huh' at every utterance by a female.  Unfortunately, there are certain subtleties he hasn't mastered in the fine art of seduction, and he gets his face slapped repeatedly.<br><br>After countless humorous failures, he meets Susan (Annette Benning), his future mate and discovers that the only way she will have sex with him is if he marries her.  After the nuptials he learns that all the rules of engagement have changed.<br><br>This droll script ranges from mildly silly to hysterical as it holds a circus mirror up to our mating rituals.  Shandling is always funny with his deadpan whiney style, but the real treat here is Annette Benning.  She makes this film work as Shandling's overwrought love interest.  As she did in `American Beauty', she plays another caricature role to perfection.  Here she is the aging female who has been a continual loser at the dating game and is desperately searching for love.  Her brilliant performance is a treat that upstages Shandling at every turn.  In addition, the rest of the cast is wonderful and fits well with Shandling's wry sense of humor.<br><br>\nThis is a fun and very light comedy that works well most of the time.  I rated it 7/10.  Viewers who are offended by nudity, profanity and sexual situations should pass.  Others will probably enjoy more than a few good laughs.","user":"FlickJunkie-2","rank":[23,27]},{"title":"Another of My Guilty Pleasures...","rating":7,"date":"1 December 2005","review":"I don't know why I'm afraid to admit it, but WHAT PLANET ARE YOU FROM? is definitely one of my guilty pleasures which I have viewed multiple times and still find highly entertaining. This cute and entertaining comedy stars Garry Shandling as an alien sent to earth to impregnate a woman and bring the baby back to his planet. He ends up targeting a real estate agent and recovering alcoholic (Annette Bening) as his target, but he doesn't plan on complications like love, marriage, friends, business competitors...those little things that we earthlings deal with on a daily basis but an alien from another planet would have no concept of. The opening scenes of the aliens being educated on the female erogenous zones are quite amusing as is Shandling's explanations of women to aliens when he returns to his planet after impregnating Bening and stealing the baby. Bening is charming in a rare comedic turn and even gets to sing. Greg Kinnear scores as a slimy co-worker of Shandling's and Linda Fiorentino makes the most of her brief appearance as his sexy wife. John Goodman is solid as a cynical UFO investigator who can't get anyone to believe there is an alien on earth and has to deal with his paranoid wife (Caroline Aaron) who is convinced the man is cheating on her. Ben Kingsley, in a refreshing change of pace, plays the stone-faced leader of Shandling's planet and Camryn Manheim, Nora Dunn, and Ann Cusack appear as Bening's girlfriends. Shandling co-wrote this comedy, smoothly directed by Mike Nichols, of all people. It's no masterpiece, but there are worse ways to kill 90 minutes and there are laughs to be had along the way.","user":"Isaac5855","rank":[23,28]},{"title":"Criminally Underrated","rating":10,"date":"19 February 2001","review":"Mike Nichols; Gary Shandling; Annette Bening; Ben Kingsley; John Goodman; Greg Kinnear...<br><br>Some may look at this list of utterly-undeniably talented people and expect great achievement, while others may anticipate a too-many-cooks effect. Whatever *you* expect from What Planet Are You From? I can tell you one thing; Let this be the only review you read!!<br><br>I have read countless reviews of this film, such as Roger Ebert's One-Star one-note write up (in which he sounds as if he wishes he wrote the film), The SF Examiner's feeble complaint and Time Magazine's bile explosion in paragraph form, and they all nitpicked the film to death while ignoring the beauty of it all. Some focused on the 'buzzing penis' gag which leads me to believe they only screened previews and slept through the actual film. Yet others complained that Gary Shandling isn't sexy and shouldn't have starred in the title role. Uhhh... OK, lets cast Fabio, for his looks and great comedic timing.<br><br>I've seen plenty of movies, many of them comedies, and this one ranks with some of the best. I feel the casting was inspired across the board and features one of Greg Kinnear's best performances as a slimy womanizing cretin. Shandling is stellar as always, seeming to have an endless supply of one-liners and expressions for any situation. Annette Bening is possibly the best actress of her generation, and this performance clinches it.<br><br>I'll bring it into focus for you: it's a comedy of manners featuring a procreation-obsessed alien and a sex/relationship-disfunctional planet. The script is a Shandlingesque miracle and the performances are perfect. The film mixes universal truths about the human condition and truly funny situations which could have been clichés but were saved by the sly screenplay. <br><br>I don't know what the negative reviewers were expecting, but I got exactly what I thought I would: gifted actors and a fantastic director making what should have been a huge hit. Unfortunately, it seems that the prejudices and laziness of reviewers have sent this great movie to the bargain bin. See it today.","user":"Mr Mauve","rank":[16,19]}]