[{"title":"GenX Zombies","rating":7,"date":"23 July 2004","review":"Curt, a GenXer army brat, is madly in love with Julie, a Gothy punk girl with a fascination for the morbid. In order to impress her, Curt swipes his dads clearance card and the two lovebirds sneak into the high security testing facilities of the military base. Curt's dad, a high ranking military official, is involved in some pretty sick experiments which center around the reanimating powers of the chemical known as 245 Trioxin. After witnessing a gruesome resurrection, Curt and Julie flee, have sex and find out that Curt's dad is being transferred. Rather than be torn asunder, the two run away together. But a terrible motorcycle accident cuts their plans - and Julie's life - short. Now it's back to the base to reanimate his beloved, but even though the resurrected Julie seems normal, it's only a matter of time before her dead body rots, and her human emotions are replaced with an insatiable hunger for living human brains.<br><br>This third installment in the ROTLD series avoids the campy black comedy of the first film, and the utter stupidity of the second. It falls somewhere right smack between the two and ends up being halfway decent. There's some great scenes of cutting, scarification and body mutilation as Julie discovers that self inflicted pain can temporarily curb her nasty appetite. Whether or not this was an intentional comment on the habits of GenX teens to mutilate themselves to curb feelings of depression, I don't know, but it's quite effective and, considering that this came out in 1993, rather timely as well. Julie ends up resembling a Cenobite rather than a zombie, decked out in leather, chains and broken glass, but I'm not complaining. There's a LOT of gore, most of which takes place in the military labs as zombies are fitted with harnesses, lobotomized with power drills, held together with metal exoskeletons and, in general, end up resembling an S&amp;M orgy gone horribly wrong. It's pretty nasty, graphic stuff, but the zombies themselves are pretty cool looking, especially one who ends up looking like a freaky, bipedal giraffe. <br><br>The story isn't anything new, but some of the acting (especially that of Mindy Clarke as Julie) is pretty good and the zombie effects are impressive. The ending is a downer, but not as grim and disheartening as it could have been.<br><br>All in all, it's fairly enjoyable. It's much better than Part 2 was, anyway.","user":"Gafke","rank":[25,29]},{"title":"Part III and hopefully the last.","rating":7,"date":"11 June 2004","review":"Return of the Living Dead III (1993) was released upon the 25th anniversary of the release of Night of the Living Dead (1968). Instead of making another bad spoof, Brian Yuzna wisely decided to make a return to the basics. A creepy and dark horror film. A young military brat and his girl are fooling around on a motorcycle and she's killed in a fatal accident. Grief stricken and severely sprung, the kid takes his girl to the army base where his dad works and takes her to a secret lab and revives her. Sadly the boy doesn't know what he's unleashed and this young \"frankenstein\" has to destroy his little \"creation\". If you're going to watch this movie please avoid the \"rated\" version. As in all of Brian Yuzna's films he likes to make his flicks over the top and very gory. The \"family\" rental companies carry the \"rated\" version so \"look out\" for the \"unrated\" label. If not then you'll be treated to a bunch of freeze frames and badly cut scenes. A sad tale about true love.<br><br>Recommended.<br><br>Let's hope this ends the series. If it does then it'll end on a high note.","user":"Captain_Couth","rank":[30,39]},{"title":"\"Julie, are you eating him?\"","rating":11,"date":"11 November 2001","review":"Love and gore-what more do you need? Return of the Living Dead III is an excellent gore flick with a love story at the core. It's also a horror fans dream. That dream being that a great series never ruined itself like most do in the genre. At least that's the way I feel about it. RotLD III features a great story driven by great characters and awesome special effects. And of course, brains. Brian Yuzna (Bride of Re-Animator) is the mastermind behind this end to a great trilogy. J. Trevor Edmond stars as a guy who accidentally kills his girlfriend and uses Trioxin to bring her back. Said girlfriend, played by the awesome Mindy Clarke, makes for an unbelievable appearance by the end of the movie. My only problem with the movie is that it's missing the claustrophobic elements of the first one until the very end, and what an appropriate ending it is. Gore hounds will love this one. Brainsssssssss! <br><br>Note for genre buffs: Look for director Anthony Hickox and Brian \"Scuz\" Peck, who is featured in the entire trilogy, in cameos.","user":"Backlash007","rank":[17,21]}]