[{"title":"very enjoyable","rating":2,"date":"2 July 2001","review":"Okay, I didn't grow up in the time this film is set (I was born in 1978). But after seeing the film, I've got a pretty good idea of what it was like. My dad likes the film because of how much it reminds him of his own childhood. The story is simple: a new kid moves with his mother and step-father to a brand new neighborhood where he knows no one. So imagine his surprise when he winds up meeting a kid who invites him to play baseball with him and his best friends. Naturally, the other kids don't take to him too well: he's not very good at baseball, and he can't even throw right. But eventually, the kids grow to like him and teach him the ways of the game, and before long they're having a lot of fun during the summer. THE SANDLOT is a great kids film, very family-friendly, unlike the majority of so-called \"family\" films that are made nowadays. Sure, there's a scene where the kids are throwing up on a carnival ride thanks to some chewing tobacco, but the scene is done more for laughs than as a gross-out. (You can imagine that the scene would be done the opposite way if the film was made more recently). The characters and the young kids playing them are all appealing, and it's nice to see Denis Leary playing a kind sensitive role instead of the over-the-top characters he's used to playing. He's very good, even though the part's not a big one. The few scenes between him and star Tom Guiry are very nice. THE SANDLOT is a very good film. Kids will like the humor, and adults will remember how fun it was to be a kid.","user":"MichaelM24","rank":[57,61]},{"title":"Who's the Great Bambino?","rating":8,"date":"17 March 2004","review":"The Sandlot is one of the greatest kids movies ever. It is a refreshing break from the family movies of today that mostly concentrate on stories in that upperclass Reiner-esque suburbanite setting of husband and wife and two and a half obnoxious kids. Instead, The Sandlot falls into a line of memorable adventures like 'House Arrest' and 'The Wizard.'<br><br>Flashback to the 1960s. Scotty Smalls, newcomer to the neighborhood, narrates (in a Wonder Years way) the hilarious adventure of how he got he and his baseball playing buddies into the biggest pickle ever. Smalls is the shy brainy kid who makes friends with a bunch of baseball fanatics. While learning the sport of baseball, he learns of an exaggerated legend of something called 'The Beast,' otherwise known as Old Mr. Myrtle's junkyard dog, which is chained up in the fence just behind the ballpark. The kids like to play baseball. And the Beast likes to eat them. Not to give too much away, but, \"the pickle\" that Scotty gets his friends into, involves a pretty valuable baseball, one slobbering beast, and kids who try to do anything they can to save their buddy from being grounded for an eternity. The mess they get into and the junk they try to get themselves out is simply hilarious. That, and the subplots of a clever move on a lifeguard and the determination to show up some very obnoxious rival baseball players.<br><br>\nIt's a funny, fantastic film that most kids will likely enjoy--the boys for baseball and the girls for those noteable teen stars like Mike Vitar, Tom Guiry, Chauncey Leopardi, and Will Horneff. It's loaded with laughs and good time adolescents, despite Tom Guiry hamming it up only slightly. Plus, it's got a good theme about friendship and drive and determination to do what you want to do. I highly recommend it, if for nothing else, then the part where Squints tells the story about the history of the beast.<br><br>\nI can see from the message boards as well as other viewer's comments that it still has a rather memorable following, despite it's age. Definitely a must see!","user":"vertigo_14","rank":[53,57]},{"title":"One of the greatest childhood films ever","rating":8,"date":"14 June 2000","review":"The Sandlot is a great childhood film because it examines changes and friendship among a group of pre-teens.  It is really just good old fashioned fun (especially James Earl Jones' cameo) in the adventures of their baseball days.  Denis leary makes one of his breakthrough films here.  Entertainment supreme, and maybe adults will like it too. A","user":"Quinoa1984","rank":[55,63]}]