[{"title":"An underrated jewel","rating":8,"date":"3 November 2006","review":"After the box-office failure of \"Memoirs of an Invisible Man\" in 1992 forced him to work in TV (with the movie \"Body Bags\"), director John Carpenter returned to his roots in the horror genre and began working in what would be his return to the big screen with the 1995 horror film, \"In the Mouth of Madness\", a movie that would become the third and final part of his Apocalypse Trilogy (an unrelated series of horror films started with \"The Thing\" and followed by \"Prince of Darkness\"). Together with writer Michael De Luca, Carpenter crafted a film that pays honest tribute to the genre's original root: the written word.<br><br>In the film, Sam Neill plays John Trent, a freelance insurance investigator hired to find out if the disappearance of horror writer Sutter Cane (Jürgen Prochnow) is part of a complicated marketing plan, as he is the most popular writer at the moment. However, it seems that Cane has really disappeared, as not even his publishers know where he is. Together with Cane's editor, Linda Styles (Julie Carmen), Trent will attempt to find out where Cane is, but will discover that the famed horror writer has a deep dark secret hidden in the apparently not so fictional town of \"Hobb's End\".<br><br>Inspired by legendary horror writer H.P. Lovecraft, De Luca's story is a powerful ride to the dark side where the line of fiction and reality disappear. Themes such as the duality of reality and fantasy and the concepts of God and free will are carried through the film's remarkably well-done script, becoming one of the most interesting, intelligent and insightful horror stories ever put on film. As a tribute to Lovecraft, De Luca captures that atmosphere of dread and madness that was so characteristic of Lovecraft's works and that no film adaptation of his works has managed to capture.<br><br>A fitting return to form, \"In the Mouth of Madness\" is again John Carpenter at his best, giving form to De Luca's imaginative script with amazing talent and an effective care for the story not seen since \"The Thing\". While the plot is clearly inspired on the work of H.P. Lovecraft, Carpenter completed the \"tribute\" by adding countless of references to Stephen King and Nigel Kneale (his own favorite writer), making \"In the Mouth of Madness\" a homage to writers of horror fiction. With great skill, Carpenter crafts a film that is never boring nor tiresome, and that even manages to transmit the feeling one would get by reading a book.<br><br>Sam Neill delivers an excellent performance as John Trent, who incredulous of Cane's talent, enters the unknown and discovers the source of Cane's popularity. It is a very natural and believable performance that can give the chills as Neill makes his character to be so easy to be identified with. Jürgen Prochnow and Julie Carmen deliver both excellent performances too, although their characters receive few screen time (even for important supporting roles) as it is truly Neill who carries the film becoming the focus of the story.<br><br>\"In the Mouth of Madness\" is a haunting horror film that is both intelligent and effective thanks to Carpenter's expertise as director, and more than 10 years after is release it's hard to see why it failed at the box-office. While it's not a perfect film, it's a lot better than the average, and while it's true that it seems to lose some steam in the last third, the ending is really one of the best in horror history. Despite some quibbles with the special effects (as I think that Carpenter shows a lot more than what was needed), the film is overall a very well-done film that deserved a better reception in its day.<br><br>With an excellent cast and a superb story, \"In the Mouth of Madness\" ends up as a really inventive story that proves that horror in film can deliver the same creative as it has in literature. An intelligent and twisted tale of horror, this homage to horror fiction makes a really great film. To most people, the name John Carpenter is (and will always be) related to the \"Halloween\" franchise, but personally, I find \"The Thing\" and this film as the best works of his career. 9/10","user":"jluis1984","rank":[171,198]},{"title":"An unexpected treat","rating":8,"date":"20 February 2005","review":"Insurance claims expert John Trent (Sam Neill) Goes off on a search for missing horror author Sutter Cane (Jürgen Prochnow), convinced his disappearance is a hoax. Once Trent goes looking for the missing author, he's lead to Hobb's End, a supposedly fictional New England town, to discover that something very wrong is going onand Sutter Cane is responsible. \"In the Mouth of Madness\" came as a delightful surprise to me.<br><br>I rented the DVD solely because I'd been wandering the video store shelves for close to 45 minutes (I have a little too much free time) and figured I'd be kicked out so I grabbed a handful of movies. This was one of them, and let me tell you I'm sure glad I did, because this is a damn fine flick!<br><br>To start, Sam Neill is excellent, as is Mr. Prochnow. The only bad performer here is Julie Carmen (Regina from Fright Night 2), who gives a wooden and thoroughly unconvincing \"when-the-hell-do-I-get-my-paycheck?\" performance. <br><br>Michael De Luca's script is sharp enough to never takes itself too seriously, while at the same time it can be very scary and dark. John Carpenter's direction was top-notch. Some of the guy's recent films have beendisappointing, to say the least, but here he delivers the gore, suspense and action like a pro.<br><br>The special effects are great. The boys over at KNB effects studios cook up lots of monsters, gore and slime, delivering the goods as usual. The creatures here are indeed reminiscent of Carpenter's \"The Thing\", their creative and all look very lovecraftian in design. <br><br>At times the film can be extremely scary. The old trick of using darkness and shadows to convey creepiness that Carpenter's so good at are present and good as ever. <br><br>\"In the mouth of madness\" pulled all the right strings and I thoroughly enjoyed it. Highly recommended.<br><br>8/10.<br><br>Oh, and great ending.","user":"willywants","rank":[104,124]},{"title":"In the Mind of John Carpenter","rating":7,"date":"7 August 2001","review":"What a treat of a film this was.  It is witty, intelligent, and scary.  The basic plot premise is anything but basic as the line between reality and fantasy is almost indistinguishable through most of the film.  What is going on?  Who really knows...I'm not sure even director John Carpenter knows. But what we do get is a guessing game of what is real and un-real in a very stylish, sophisticated, almost bizarre fashion.  The film opens in a mental asylum with protagonist Sam Neill being put in a padded cell whilst in a straight-jacket.  The setting is larger than life.  The characters around Neill are caricatures for the most part.  John Glover plays a doctor(Doctor Saperstein...a possible homage to Rosemary's Baby) with complete camp. David Warner, another doctor, begins talking to Neill and asking him about what happened.  The rest of the film then details what Neill did working with regards to a lost author named Sutter Cane.  The plot is much more complicated than that and may take subsequent viewings to fully understand WHAT can be understood.  The end result is at the very least a very gratifying one as Carpenter constructs a dream-like story that has obvious roots in both the fiction of H. P. Lovecraft and Stephen King.  The acting is good all around...Neill is excellent as John Trent.  He makes a very believable presence in a sea of un-reality.  Julie Carmen is also very good in her role.  Look for Charlton Heston as a publisher and Bernie Casey in a cameo as well.  Kudos to Mr. Carpenter for bringing his visions of horror to the silver screen once again.  This may be his best film...certainly his most thought-provoking and sophisticated.","user":"BaronBl00d","rank":[71,86]}]