[{"title":"Former drug dealer gone straight has a REALLY bad day...","rating":18,"date":"18 July 2004","review":"Loved the movie, could kick myself for not buying it right away when the Unrated version was (briefly) re-released on DVD and generally available.<br><br>Similar in flavor to \"Pulp Fiction,\" but I wouldn't call it a knock-off, as so many have. Tarantino and Woods both have a talent for realistic, believable dialogue by colorful but still believable characters in a genre where it's seldom seen. But, in this movie Woods also shows a flair for using the absurd, and annoying, realities of everyday life to move the plot along. Woods, like great comedians, exposes the little frustrations of life that we all experience but few will admit to, and deals with them in politically incorrect, yet satisfying, finality.<br><br>This movie is well worth watching: sex, blood, outrageous dialogue supported by even more outrageous action, corruption, redemption, and the satisfaction of finally seeing a loud-mouthed, nagging wife at a loss for words when she is forced to confront the fact that there's more to her husband than just the long list of imagined faults she's dreamed up.<br><br>See it...soon!","user":"FurthurQ","rank":[41,46]},{"title":"OK, not THAT original,but very good none the less!","rating":8,"date":"12 April 2005","review":"OK,so this film is NOT very well known,and wasn't very well publicised.I discovered this fairly brutal gangster gone good movie by complete accident on one of Skys millions of movie channels late on some boring evening,but I'm glad i did!The opening sequence to this film is fantastically comical in a very dark way.This in fact sets what i think is the general tone for the movie.I think a lot of critics and movie fans that have actually seen this film have been a bit unfair to just write it off as a lower budget gangster movie in the Reservoir Dogs vein.OK,so there are undeniable similarities between Thursday and some other crime genre films that it has been compared to,but in all fairness,i think this film takes a much more darkly comic look at this type of film,and the end result is a engrossing,well made,funny,if not totally original film.Tom Jane is good in this,and deserves the recognition he will now hopefully get thanks to the The Punisher.His performance as the bad guy gone good is realistic,funny and just cold enough to make you believe Casey really was a bad ass before he reformed.Thats another thing that makes this film stand out for me,the characters.In Nicks gang you get the strangest trio of criminals ever assembled,a smooth,charismatic but very cold leader(Nick),a trigger happy blood loving sexually predatory bitch of a woman(Dallas)and a psychotic hill billy with brains with a penchant for torture(Billy Hill).Throw in the most bizarre police detective ever seen on screen,beautifully over played by Mickey Rourke,and you've got a recipe for...well for Thursday really.Its at times darkly comic,sometimes brutal,sometimes unoriginal,but always engrossing and worth watching.8/10","user":"liam-tully","rank":[36,41]},{"title":"A Damn good movie!","rating":9,"date":"14 November 2005","review":"It is a damn good movie,with some surprising twists,a good cast and a great script. Only a couple of stupid bits,like the Rasta hit-man scene (This guy's a professional?) but that has been commented on already. The fact I had only heard one guy at work mention it before, and did not have many opinions or reviews to go on, made it even more entertaining. This gets a higher score than maybe some people think it deserves, but I have to factor in the low budget and the good effort from the cast. It sickens me that some movies get made whose budget equals the GDP of a small country,with a hyped up release,good reviews,an Oscar winning director and/or actors, and turn out to be so disappointing,with actors sleepwalking through their roles and uninspired directing,with predictable plot lines and a story with holes in it so big,Sandra Bullock could drive a bomb-loaded bus through it. (Examples in my opinion are The Terminal,Castaway,Matrix:Revolutions) Extra points are awarded for the wardrobe department choosing great clothes for the cast,especially Paulina Porizcova,who wears a rubber dress in one scene,and a jacket with \"c*nt\" on the back in large letters in another!A sex scene which shows off her tight ass and a good soundtrack are added bonuses! And PLEASE,enough with the Tarantino comparisons,this did not remind me of a Tarantino flick at all.... and Tarantino borrows virtually every idea he has ever had from other movies! Even if that is your opinion,are we saying once a certain film or book is written or directed one way,no-one can ever use the same ideas again? get real. This film has it's own style.","user":"g_man252003","rank":[38,49]}]