[{"title":"\"Noir\" In The City","rating":8,"date":"21 April 2001","review":"In this contemporary film noir, two brothers with the same alma mater-- Folsom Prison-- discover something about loyalty and what `honor among thieves' really means, in `City of Industry,' directed by John Irvin.  Lee Egan (Timothy Hutton) puts together a crew of four men, including his brother, Roy (Harvey Keitel), to take down a jewelry store in Palm Springs, California.  If all goes well, they look to score a cool three mil in diamonds, and Lee has a fence in L.A. ready to move the merchandise.  Lee and Roy are solid, as is Jorge (Wade Dominguez), the third member of the crew who is already looking at 2 to 5 in Folsom, having been convicted of carrying a concealed weapon.  Jorge wants a quick score that will take care of his wife, Rachel (Famke Janssen), and their two kids while he's away. The wild card of the bunch is Skip Kovich (Stephen Dorff), their wheel man; he has a wild streak that emboldens him too much for his own good, a flaky girlfriend and some ideas of his own about how the split from the job should go down.  Lee contends that it's going to be an easy score, with each man's share being `Not bad for a day's work.'  But you can bet that anytime you have a `sure thing' it's going to turn out to be anything but, and this caper is, of course, no exception.<br><br>\tAs is befitting the subject matter, the film is dark-- much of it takes place at night, or in rather seedy, industrial locales-- with a touch of artistic cinematography that gives a sense of urgency to the story.  It quickly shifts from the posh atmosphere of Palm Springs to downtown Los Angeles and Chinatown, an environment through which you get a sense of who these guys are and what they are about.  As Rachel says to Roy at one point, `You guys are all alike--'<br><br>\tAs Roy, Keitel carries the film with the kind of credible performance we've come to expect from him.  While this character is certainly not a stretch for him-- you've seen `Roy' many times before, played by Keitel and others-- he does put a unique stamp on him; he's familiar, but Keitel manages to avoid letting him slip into stereotype.  And that is no easy task when you take into consideration that in reality a man like Roy would necessarily share certain traits with others of his ilk.  What makes the difference is Keitel's consummate ability as an actor, and his concern with fleshing out the details of his character.<br><br>\tThe role of Lee is something of a departure for Hutton, though similar to the part he played in `Playing God,' but with much more definition.  He gives Lee a very `real' quality, the cool confidence of one who lives just beyond the fringe of what society deems acceptable.  When he mentions that he's been in Folsom, it's believable.  Dorff, meanwhile, is effective as Skip, a guy perpetually pumped and strung out, crazy-- but like a fox-- with an aura of menace about him that is nearly tangible.  In attitude and style, Skip is reminiscent of Laurence Fishburne's two-fisted, gun toting Jump in `King of New York.'  And Janssen gives a notable performance also, successfully creating the one character in the film with whom the audience can sympathize.  You feel her desperation and the concern she has for her children's well being, which effectively adds valuable context to the story.<br><br>\tThe supporting cast includes Michael Jai White (Odell), Lucy Liu (Cathi), Reno Wilson (Keshaun), Dana Barron (Gena), Tamara Clatterbuck (Sunny), Brian Brophy (Backus) and Francois Chau (Uncle Luke).  A violent and stylish examination of the criminal element in our midst, `City of Industry' is a hard-edged film that presents the matter-of-fact way in which those who subscribe to a life of crime seemingly function within their own sect of society.  It's a part of life many would just as soon deny in reality, but as Steve McQueen said many years ago in `Bullitt,' `That's where half of it is.'  And a film like this is not about to let you forget it.  I rate this one 8/10.","user":"jhclues","rank":[42,46]},{"title":"A Great Guy's Flick","rating":8,"date":"6 September 2002","review":"In my book, this is one of the overlooked action classics of the 1990's. With solid production values and a top notch cast, and set against a sunny and seedy Los Angeles backdrop, this fast-paced story of desperate criminals driven by greed and revenge is the perfect vehicle for \"Guy's Movie Night.\"<br><br>\nHarvey Keitel is at his best as Roy Egan, the hardened career criminal bent on avenging a double-cross by former partner-in-crime, Skip Kovich (played by Stephen Dorff, in his best performance ever).  Also along for the ride are Timothy Hutton, the late Wade Dominguez (\"Dangerous Minds\"), and a very sexy Famke Janssen.  As if this weren't enough, this movie is notable for providing the only film nude scenes of Lucy Liu (a brief role as Dorff's stripper ex-girlfriend), and Dana Barron (Audry Griswold in the original \"Vacation\").<br><br>Despite its occasional plot holes, this film gets better with repeated viewings.  And for fans of what my Manly Man Movie Night associates have deemed \"Keiteling\" (the mandatory Harvey Keitel emotional and physical meltdown, e.g. the church scene in \"Bad Lieutenant\") it doesn't get any better than this.  However, the film is quite violent, and I have not met many women who like it.  Still, \"City of Industry\" belongs in the collection of any fan of revenge-based action thrillers.","user":"bubbazanetti","rank":[36,40]},{"title":"As usual Keitel is exceptional","rating":29,"date":"29 August 2001","review":"I would describe Harvey Keitel's performance in this violent thriller as exceptional, except that he turns in such remarkable performances time after time. He plays Roy Egan, a veteran con helping his kid brother, Lee (Timothy Hutton), and two other desperados, pull a big jewel job in Palm Springs. The job goes well, but then one of the gang gets murderously greedy, and Roy goes into LA, after him and the loot.<br><br>The other element which lifts the movie from competent to first rate are the downtown and industrial locations. For once we see an LA not made up exclusively of lush areas like Beverly Hills on the one hand, and no-go ghettos like South Central on the other. At the same time, writer Ken Solarz and director John Irvin make good use of LA's ethnic mix, with both Chinese and Black gangs playing a part as Roy hunts his man. Hutton, Stephen Dorff, Wade Dominguez and Famke Janssen contribute solid performances, and Lucy Liu is also to be seen. The movie may descend into too much mayhem for some; and the sunny epilogue seems out of place; but this is a must-see for thriller-lovers.","user":"Geofbob","rank":[17,19]}]