[{"title":"funny *and* realistic (whatever others may say)","rating":28,"date":"28 December 1998","review":"I first saw this movie with almost no expectations.  Now I own it and have watched it more times than I can remember.<br><br>I have heard that this movie caught a lot of flak about not being \"realistic\" about mental illness, and not providing a diagnosis for Joon, etc.  I think that it is more realistic for the \"average\" person with a mental illness than any other movie I have seen on the topic.  There was no theme of \"being institutionalised forever\" and there was no unrealistic expectation of a \"cure\".<br><br>The character of Sam put it best when he said \"Aside from being a little mentally ill, she's pretty normal.\"  I think that's the best quote I've heard in a movie, on that particular topic.<br><br>I also think there is a reason for there being no stated diagnosis of Joon. She personifies those of us who can't get on with the things we want to do in life because of a mental illness and treatment getting in the way.  She does it very well, down to the mannerisms.  If she were to be labeled, say, obsessive-compulsive, or post-traumatic stress disorder, or schizophrenic, or bipolar, then the universality would be taken out of it and it would suddenly only apply to people with one certain label.<br><br>This movie did wonders for my family.  Upon watching it, we all said \"That's us!\" and learned to laugh at ourselves and the situations we got into.  It offered me a lot of hope -- what more could I want than to find an understanding and eccentric friend to love and move into my own apartment, away from the mess of hospitals and doctors?  It still makes me laugh every time I see it, and \"Joon\" has become a household word... I recommend this to anyone, particularly anyone with a mental illness, and their families -- it might lighten things up, but it certainly doesn't skip over the bad parts.","user":"taneskal","rank":[138,147]},{"title":"whimsical and affectionate, like its characters","rating":9,"date":"3 August 2003","review":"BENNY &amp; JOON seems, at its heart, to be an allegory about the different ways people can be out of touch with their fellow human beings, and the ways in which that dischord can be healed.<br><br>Benny owns an auto shop and takes care - both financially and physically - of himself and his sister Joon after the death of their parents.  Other than weekly poker games, Benny's is a life of servitude, and this is the source of his isolation.  He longs to be free to have other relationships, but is wracked by guilt at the idea of leaving Joon in anyone else's care.<br><br>Joon is an artist and is also mentally ill, a schizophrenic who has good and bad days and who depends on Benny to provide routine in her life.  She has run out every housekeeper to be found in town, but cannot function without assistance and supervision.  The film does a superb job of differentiating between mental illness (from which Joon clearly suffers) and stupidity (which is not a problem she faces). <br><br>Into their lives comes Sam, a cousin of one of Benny's poker buddies. Through a clever conceit, Sam moves in with Benny and Joon.  Sam is undereducated, partially illiterate but a comedic genius who studies Charlie Chaplin and Buster Keaton, knows catalogs of old movies, and has perfected the art form (kudos to Depp for the grace and conviction of this part of his performance).  Like Keaton and the great silent film stars, Sam rarely speaks to communicate, and this combined with his illiteracy condemns him to be considered stupid as well.  The great sneaker quality of Depp's performance is to show that Sam is always watching, always listening, and that he's no dim bulb by any stretch. <br><br>In Sam, Joon finds a person who makes her laugh, lives by his own rules, and cares for her deeply.  In Joon, Sam finds a woman who appreciates him as he is, but he also knows a relationship with her is taboo.  In a particularly revealing scene, he asks Benny, as one man to another, \"How sick is she?\" We know he is wrestling with his feelings for her, but Benny does not, and his offhanded answer comes across as callous and almost mocking.<br><br>While the handling of Sam and Joon's budding relationship may seem trite, and the humor applied to Joon's illness might seem cruel, in my experience the people who make those judgments know little about living day to day with a mentally ill - not to be confused with unintelligent - human being.  There is deep and abiding truth in the idea that laughter and love can cure the incurable; people who seemed unable to function before can make great strides when they are shown trust and respect.  And although the psychiatric issues were glossed over in this film, it has at its core an honest message of hope.  One of my favorite films, for Depp and Masterson's outstanding performances and a true depiction of imperfect people on the journey to becoming whole. 9/10","user":"saska-3","rank":[105,112]},{"title":"from someone who's mentally ill...","rating":24,"date":"24 January 1999","review":"I really identify with this movie, and with Joon.  I myself am mentally ill (in fact, disabled by it).   I don't think it matters that her mental illness is unspecified... so many mental illnesses overlap in real life, and often DO go unspecified even if the person is counselling.<br><br>I am mentally ill and (as birds of a feather flock together) know many people who are also mentally ill.  As for it being representation of what it's really like to be or live with a mentally ill person, you can't really lump such an experience together. Mentally ill people vary just as much as \"normal\" people do.<br><br>Some of the details in this movie are great.  They depicted Joon as a rounded character, a creative, sensitive, intelligent person.  This is often the case with mentally ill people.  I love the eccentricities of the characters.  I think the details, writing, and everything about this movie are just wonderful.  I've seen it many times.<br><br>Most people who I know who have seen this movie adore it. I think it's great.","user":"tser","rank":[160,190]}]