[{"title":"Finally a sequel","rating":7,"date":"17 August 2005","review":"After the \"Alien Experience\" and the \"Remake Sequel\", \"Highlander\" producers decided to add two and two and get someone to write a marvellous script. They went on with the mathematics, and got together Christopher Lambert and Adrian Paul. The result is the long-expected good sequel to the first \"Highlander\", set after \"The Series\" ended.<br><br>Tired of the endless fights, Connor MacLeod enters the Sanctuary, a place where immortals can rest forever under the guard of the Watchers. However, an old foe of Connor releases him after killing all the other immortals in that place. Not pleased with this, this foe and his posse pays a visit to Duncan MacLeod, who gets away and looks for his clansman. Both MacLeods have sins to purge, and the time has come to do that.<br><br>Christopher Lambert, though intended to have a supportive role like Sean Connery in the original film, robs the movie. Though his Connor is hardly the same bad ass of the other films, it's by far the best performance in the film. Adrian Paul manages to lead the film well, like in the TV series. Bruce Payne, playing the embittered Jacob Kell, provides a fine interpretation that is however in the line of the other \"Highlander\" villains. Lisa Barbuscia as Kate MacLeod is somewhat fine, but I'm inclined to believe the only reason \"Fishlips\" got cast is her willingness to show her breasts.<br><br>The character of the film is indeed Jin Ke, played by Donnie Yen. However brief his presence on screen may be, he manages to give a very good impression, as well as some action. Another two characters worth mentioning are Rachel (the late Sheila Gish) and Heather (Beatie Edney), who appear again in a \"Highlander\" film. Briefly, but it's something.<br><br>Why don't I give it a 10? First, the first film (which indeed deserves a 10) is superior to this one. Secondly, the editing of the film is weak. It's not the one of \"Highlander II: The Quickening\" but this one has some big flaws. In any case, \"Highlander Endgame\" is a great film, with more action and entertainment than the other sequels, and it's a great choice even for non fans.<br><br>Seven!","user":"carlos_b84","rank":[40,58]},{"title":"A final(?) piece of a brilliant puzzle.","rating":8,"date":"1 September 2000","review":"The last installment of the Highlander movie series is a brilliant blend of the original movie and the popular television characters. The story line is weaved through past history (as Highlander fans have come to expect) and picks up where the television series ended. It still stands alone as a movie in itself, though I will admit it may be hard for a non-highlander fan to grasp all of the concepts that are thrown at them. All in all, Davis/Panzer have once again given credit to this wonderful science fiction series by watching the details of the character's pasts and still creating unknown events in their lives. This is the beauty of this series, just when you think you know the character something pops up from their past. This will be an emotional movie for diehard Highlander fans, just as the \"To Be/Not to Be\" t.v. finale was. In my opinion, even though this is dubbed as the final act of this series, there is still one minor issue that still remains....there can be only be one!","user":"bdparsons","rank":[40,64]},{"title":"Good movie with \"excellent\" bits here and there...","rating":9,"date":"25 May 2003","review":"Contains spoiler Well, frankly I have never been a fan of the Highlander franchise, but if I had been one, this movie would probably be one of the best Highlander movies around.<br><br>Actually, I have only see the second one (with Michael Ironside and Sean Connery, if I remember correctly) and in comparation, Endgame is somewhat better. Even though I prefer the post-apocaliptic look of H:II, Endgame provides us with better special effect (obvius), a lot-more digestible plot and some good acting. Even though I don't like the (SPOILER) fact that Connor died (END OF SPOILER) I think it was just to finally end with the Highlander franchise.<br><br>Excellent battles, good plot, and good acting (somewhat weird cast, but ok) is all I need for a movie, and Chistopher Lambert's acting is superb. A good end to the Highlander series. B+","user":"cernex","rank":[24,37]}]