[{"title":"Seagal's best buddy action flick","rating":10,"date":"25 May 2010","review":"Seagal who had become famous as a one man wrecking crew teams up in this to do a two fisted action movie. If you liked 48 Hours or any of the Lethal Weapon movies this is for you. This is not some fruity drama or foreign romancethis is a fighting shooting DUDE movie.<br><br>The story is clean and full of action with clever bits of comedy and well placed explosions. This is a kind of movie that can be watched over and over again in the company of dudes who love dude movies. Seagal plays his Asian holy man role, that for peace and harmony likes to beat the living crap out of bad guys. For a partner there is the wise cracking Keenen Wayans who perfectly compliments Seagal. And there are plenty of smaller role bad guys that meet their demise. But the parts played by Brian Cox and John Jackson were great.<br><br>Well worth owning.","user":"ciscokid1970","rank":[16,20]},{"title":"Classic Seagal at its best!!!","rating":10,"date":"16 February 2003","review":"Truly my favorite Seagal movie.  Akido, one liners, arrogance, and humor all provided by the action star the critics love to hate.  The Lento's scene is probably the best of Seagal's troubled career and is sorely missed in his latest films.  An action vehicle that played perfectly to his talents and probably the last of the finest when it comes to the Seagal collection with the exception of \"Exit Wounds\".  Although unappreciated at the box office, this is what made Seagal \"Seagal\" and belongs in any Seagal fans DVD collection.","user":"rynlarson","rank":[31,45]},{"title":"Seagal does some of his best fighting, and some of his worst acting as well!","rating":5,"date":"8 February 2004","review":"Steven Seagal certainly knows how to fight, and in some of his fight scenes in \"The Glimmer Man\" he comes across as a forceful, don't-mess-with-me presence. What he doesn't know is how to act: he's so wooden he's almost funny, especially when he has to show \"disgust\" at the horrible crimes he's witnessing, or when he's whispering his lines in an attempt to come off as \"menacing\". Keenen Ivory Wayans is likably unaggressive as his partner, and the director does his best to emulate the style of \"Seven\" (minus the intelligence), but (SPOILERS FOLLOW) the whole serial-killer business is actually a big red herring, and the film ultimately turns out to be the typical Seagal actioner. At least there are some good action sequences.  (**)","user":"gridoon","rank":[9,11]}]