[{"title":"Meet The Oh-NEED-ers!","rating":9,"date":"22 April 2001","review":"Tom Hanks wrote and directed this paean to the glory days of rock n' roll, an era in which even the wildest music still reflected a certain innocence, long since gone if not forgotten, before the advent of Metal, Rap and Grunge.  It's 1964, and `That Thing You Do!' is about to become a hit record for a small band out of Erie, Pa., who call themselves the `Oneders (pronounced Wonders),' but who are destined to begin their musical odyssey know as the `Oh-NEED-ers.'  Drummer Guy Patterson (Tom Everett Scott) works in his father's appliance store, but when the band's drummer breaks his arm right before a gig, Guy is asked to sit in for him.  And it winds up being a case of being in the right place at the right time for Guy, like when Ringo joined The Beatles, and the rest-- as they say-- is history.<br><br>\tIt's a lively, upbeat tale in which luck, talent and chance all play a part.  Hanks presents the upside of making it in the music business, including the adrenaline rush of hearing one's own song on the radio for the first time, as well as all the hoopla that surrounds those who happen to be in the spotlight at the moment.  But he also shows the downside:  The creative differences and in-fighting which plagues just about any band ever formed to some degree at one time or another, the personality conflicts and petty jealousies that are apt to surface at any time, and the reality of dealing with bloated egos, adoring fans and rude, insensitive record label executives who could care less about the talent that is putting the coins in their coffers, as long as they're selling records.<br><br>\tFor the most part, Hanks keeps it lighthearted and cheerful, which-- along with the original songs (some of which he helped write)-- makes this an entertaining, fun and thoroughly enjoyable movie.  He sugar-coats the dark side of it all to a certain extent, which makes the bad things that happen a bit easier to swallow, though it compromises the impact of the events somewhat as they unfold.  Then again, he manages to maintain the credibility and integrity of his story, and after all, `this' is the film he wanted to make, and he presents it exactly as intended.  Hanks captures a sense of time and place with this film, and also that same sense of reality conveyed by The Beatles' film, `A Hard Day's Night,' intentionally avoiding the more stoic reality of the more recent `Almost Famous.'  All three films are fairly true to life, but with varying degrees of honesty.  It's a matter of whether to `imply,' as Hanks has done, or to be explicit, as Cameron Crowe chose to do with his film.<br><br>\tWith this film Hanks proves that he is equally as adept behind the camera as he is in front of it; he knows exactly where he wants to take his audience and when, and he does it quite successfully.  He also extracts some nice performances from his actors, especially Scott, Johnathon Schaech (Jimmy, the lead singer), Steve Zahn (Lenny, on guitar) and Liv Tyler as Faye Dolan, Jimmy's girlfriend, who takes the brunt of the blunt edge of Jimmy's sudden notoriety.  Hanks also turns in a notable performance himself, as Mr. White, the representative of one of the labels interested in the Oneders.<br><br>\tThe supporting cast includes Ethan Embry (The Bass Player), Charlize Theron (Tina), Obba Babatunde (Lamarr), Giovanni Ribisi (Chad), Chris Ellis (Phil), Alex Rocco (Sol), Bill Cobbs (Del Paxton), Peter Scolari (Tony), Rita Wilson (Marguerite), Chris Isaak (Uncle Bob) and Kevin Pollak (Boss Koss).  What `Happy Days' was to television, `That Thing You Do!' is to movies; a film that evokes that perceived sense of  innocence of a time when life at least seemed simpler.  For the more distance you put between the present and the `Good old days,' the better they get.  In reality, they may not have been better, but Hanks preserves that illusion by giving us a picture of the way we'd at least like to think things were.  And it's more than a pleasant diversion; this is a feel-good film you'll be able to enjoy time and again, because it takes you to a place you'd like to be-- a place you've been to before at one time or another, in one way or another, if only in your mind. And that Hanks can take you there so readily is not only a credit to his talent, but another fine example of the pure magic of the movies.  I rate this one 9/10.","user":"jhclues","rank":[66,71]},{"title":"Familiar tale told freshly, honestly, with appealing cast","rating":8,"date":"18 March 2001","review":"We've sorta been down this road before: 1960s pop band makes it out of their dead-end hometown for Hollywood, but fame and fortune unravel the fun. Still, this picture has remarkable focus, careful period detail, and a lovely cast that rarely (if ever) strikes a false note. If some of the young actors sometimes seem like they're doing Tom Hanks impersonations, that's okay because director Hanks (himself a co-star) seems to know these characters inside and out--and he likes them. We in the audience are quick to respond, and even the conventional parts of the movie work because Hanks rides over clichés with verve and enthusiasm and wit. Not a raucous comedy a la \"I Wanna Hold Your Hand\" (which is what it looked like to me in the ads), this has its share of subtle moments. There is a mean-spirited dig at the Frankie &amp; Annette \"Beach Party\" flicks, and the ready-made romance at the end is sugar-coated, but \"That Thing You Do!\" is immensely likable. It has a huge heart. ***1/2 from ****","user":"moonspinner55","rank":[33,37]},{"title":"A Refreshing Throwback","rating":9,"date":"25 August 2006","review":"I remember when I first saw this in the '90s and thinking, \"Wow, what a shock: a modern-day movie with no no villains, no nasty people and nary a cuss word.\" I kept waiting for that stuff, and it never appeared. It also has a nice sentimental ending. <br><br>The story is a simple one about a group of average guys who form a band and become one-hit wonders.<br><br>Tom Everett Scott, a young Tom Hanks-lookalike, is an appealing lead and Liv Tyler looks very, very pretty in the female lead role. The band in this almost-old-fashioned musical, is good to hear, too. They are a throwback to the old movie musical days of Mickey Rooney and Judy Garland. Yes, you hear the same song (the movie title) over and over but's a great song which is very catchy. The rest of the music is decent, too.<br><br>Speaking of Hanks, he plays the promoter of the group. It's not a huge part but Hanks, as always, is entertaining. The whole film is, and, is refreshing to see.","user":"ccthemovieman-1","rank":[50,59]}]