[{"title":"Brainless and Shallow Action B-Movie","rating":4,"date":"4 May 2016","review":"In Brooklyn, New York City, Randall Thomasson (Christopher Cousins) is murdered while attempting to avoid a carjacking. His brother Karl Thomasson (Treat Williams), who is a veteran mercenary, attends the funeral and meets his estranged niece Anya (Susan May Pratt). Karl decides to pose as history teacher to replace his brother at the high- school and investigate his death. Karl also teams up with the also mercenary Joey 6 (Angel David) to investigate the gang The Brotherhood that is blamed for the murder. The teacher Kara Lavelle (Michael Michele) helps Karl in the investigation and he is hired by the school. Karl finds violent and disrespectful students in class and protects Anya, while has a love affair with Kara. He also befriends a school janitor that is also a war veteran. Soon Karl discovers that The Brotherhood is using the school to disassemble stolen cars to sell and that the school's auto-repair teacher Warren Drummond (BD Wong) is one of the leaders of the gang. The school becomes no mans land.<br><br>\"The Substitute 2: School's Out\" is a brainless and shallow action B- movie full of clichés. The storyline (a substitute teacher comes to a high-school at the outskirts where he finds violent students and a gang) has been used several times by the cinema industry. Karl, Kara, Anya, Joey 6, Warren among others are one-dimensional characters, indeed stereotypes, and there is no explanation why Karl has forgotten his brother and his niece; or why Karl and Kara have a love affair so soon; or why Warren is a member of a dangerous gang. There are shootings at school and no police appears in the area. Last but not the least, there is no message for the students and only a revenge. My vote is four.<br><br>Title (Brazil): \"O Substituto 2\" (\"The Substitute 2\")","user":"claudio_carvalho","rank":[7,7]},{"title":"It was okay but doesn't live up to Part 1","rating":6,"date":"2 April 2006","review":"Okay, take out the Latino gangs from part one and replace them with Black gang bangers. Switch the bad principal and make it a bad teacher instead. Take away the premise of drugs, and make it about guns and carjackings, then instead of the hurt girlfriend who creates and easy entrance for THE SUBSTITUTE, replace her with a dead brother of a former (you guessed it) mercenary (played by Treat Williams) and basically, you've got your SUBSTITUTE 2 - School's Out. It was a good time-passer but nothing as riveting as the first part which starred Tom Berenger as the mercenary-turn-substitute teacher. Telly alums Michael Michele and B.D. Wong co-star.","user":"Sherazade","rank":[5,5]},{"title":"The hall monitor...","rating":6,"date":"24 August 2006","review":"Treat Williams stars as a mercenary who fills in for his brother after said brother is murdered, along the way he finds that all blame points to Drummond (B.D Wong) but Williams' elaborate plan to teach and kickbox his students is put into full effect when Drummond's men find out about him and decide to kill him. Believe it or not I preferred this sequel to the original, only due to the faster pace and a more likable hero in Treat Williams. Williams is one of those versatile actors who can convince in action and convince in the role of being human. Treat Williams acts much like how a real teacher in real life would plus he seems willing to negotiate and make amends for his actions. Such as the scene where Williams offers to pay for the kid's radio that he threw out the radio. There are many good scenes that are quite well acted such as when Williams talks to the class and in all seriousness it works better than the original. Also another element I like is how the action is more under control and the movie develops a more serious take on the plot. Although the one line of which Williams says \"I've killed before but I try to not like it, so this is going to be a new experience for me\" Is a howler. This makes the movie far more enjoyable than sequels usually are.<br><br>* * 1/2 out of 4-(Pretty good)","user":"fmarkland32","rank":[8,9]}]