[{"title":"Wildly Imaginative Surreal Masterwork That Pushes The Limits Of Storytelling","rating":9,"date":"11 February 2018","review":"Charlie Kaufman (script) and Spike Jonze (director) burst on the scene together with their collaboration on this crazy masterpiece. 'Being John Malkovich' pushes the limits of storytelling; this wildly imaginative film shows that even the most surreal storyline can still be made entertaining if a filmmaker doesn't care about conventions and knows just what the medium is capable of. Perhaps the most original release in a year that had several very original releases ('Fight Club' and 'The Matrix' were both also released in '99), the film's playful creative energy had an effect on screenwriters, directors, actors and producers that can hardly be overstated. There had simply never been anything like it - and one only has to look at a contemporary TV show like 'Legion' to see what a mark this film left. Groundbreaking and simply inspired. 9 stars out of 10.<br><br>Favorite films: IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: imdb.com/list/ls070242495/","user":"gogoschka-1","rank":[101,131]},{"title":"A gem resulting of an unexpected mix of Twilight zone and The Monty Python","rating":8,"date":"2 May 2019","review":"This film is excellently made and based on an imaginative, intelligent and wacky script: a depressive puppeteer discovers by chance a mysterious portal in his five-foot tall office located on the 7,5th floor of a Manhattan office building, leading within the head of the movie star John Malkovich. The cast is excellent and the actors co-exist in perfect symbiosis, literally as well as figuratively. The quintet John Cusack + Cameron Diaz + Orson Bean + Catherine Keener + John Malkovich is awesome.<br><br>A not exhaustive list of my favorite quotes: Meet you in Malkovich in one hour. The truth is for suckers, Johnny boy. Let's have sex on his table and then make him eat an omelette off of it. I comes before U. You don't know how lucky you are being a monkey, because consciousness is a terrible curse. There is truth, and there are lies, and art always tells the truth, even when it's lying. She's got her doctorate in speech impedimentology from Case Western. It's the idea of being inside someone else's skin and seeing what they see and feeling what they feel.","user":"FrenchEddieFelson","rank":[21,24]},{"title":"I want to be John Malkovich.","rating":10,"date":"23 November 1999","review":"This film was absolutely incredible. Attempting to explain the plot in any way that would do it justice would be an excercise in futility, but let it be said that I see many, many movies, and in my lifetime, I have never seen a movie such as Being John Malkovitch.<br><br>The acting is completely brilliant .. Cameron Diaz is nearly unrecognizable, both in behavior and appearance, as is John Cusack. John Malkovich was presented with an interesting opportunity in playing himself, and he seems to have seized the opportunity with relish.  He is most definitely not being himself in front of the camera, but instead creates this wonderful character of John Malkovich the vessel.<br><br>I've admired Spike Jonez's work for a good long time, and I'm pleased to say that in his first full length feature as a director, he succeeds with flying colors in creating an original, beautiful, humorous, and good natured picture.<br><br>See Being John Malkovich, because come Oscar time, you're going to want to know why its winning!","user":"pikachu","rank":[163,229]}]