[{"title":"Wears real well","rating":9,"date":"23 November 2000","review":"Somehow I happened to see this movie in a real theatre. I'd never heard of George Strait  and I am not a country music fan. But this movie works. I first bought it in VHS and then on DVD (go for DVD, the sound is great).<br><br>This is a simple story of a famous country singer who goes underground because while he has everything, he really has nothing. He gets drunk and ends up on the shrinking ranch of a beautiful cowgirl. He stays anonymous and gets back in touch with the world. Meanwhile the s**t hits the fan with his touring show. The plot has to do some twisting to work all this out but the basic appeal of the film, a good man getting back in touch with what's real, has universal appeal.<br><br>You may find yourself wanting to watch this movie about once a year. I know I do. Highly recommended.","user":"peterghsd","rank":[14,15]},{"title":"If You Like George Strait...","rating":8,"date":"9 October 2001","review":"This is quite simply a movie that will be enjoyed by country music fans. Pure Country is a throw-back type of a picture.  Simply put, there's nothing to take away from this film.  It either makes you feel good, or you don't like country music.  If you DO like country, then sit back and enjoy, as this film is NOT meant to be taken seriously.<br><br>George Strait stars in this film about a musician who is at a crossroads. As his career has become bigger, the less control he has over himself.  In a moment of clarity, he decides to \"take a walk\" to find himself, leading to a better understanding of himself, as well as his finding and falling for a girl.<br><br>This film holds no surprises and it doesn't try to.  It simply tries to entertain, and that it does, at least for a George Strait fan.<br><br>True, the acting leaves MUCH to be desired.  But honestly, if you are watching this film, the LAST thing that you are thinking about is Oscar winning performances.<br><br>This film is a throwback to the days of yesteryear and the singing cowboy. No one took those films seriously, and neither should anyone take this one seriously either.  Just sit back and enjoy.","user":"wbcamera","rank":[11,12]},{"title":"Pure Country...yep that's what it is!","rating":25,"date":"25 July 2002","review":"This is a good vehicle for George Strait, although it IS a little hokey at times.  Some of the dialogue seems to be a bit too predictable, some of the plot lines too hackneyed, but hey, it's only a movie!  It's not an Academy Award nominee!  This is a good film about a country music star who has had it with all the \"stuff\" of performing, and has had it with 'performing' itself.  He simply wants to sing and play his guitar, he wants to get back to the basics of what pleased him about music in the first place.  I wouldn't expect too many people outside of fans of country music to like this movie, or even understand it, but I like it.  I understand it.  And I accept it as 'Pure Entertainment'...and with a soundtrack like this one has, it can't go wrong.  One might want to find a copy of \"The Nashville Rebel\" (sp) starring a very young and barefaced Waylon Jennings for comparison.","user":"TerryL","rank":[6,6]}]