[{"title":"The first and best western film to come from Soviet Russia","rating":10,"date":"7 March 2005","review":"The Russia House is an amazing movie. It captures the majesty of Russia in visits to Moscow and St. Petersburg (Leningrad) as well as the crumbling Soviet state. The first western movie filmed in the Soviet Union, The Russia House is better defined as a love story than as a spy thriller. Do not be concerned however, spy fans. There is plenty of intrigue to be had in this beautiful movie. The interplay between Sean Connery, Roy Scheider and J.T. Walsh in a scene from Vancouver, British Columbia alone is worth the price of admission. However, the true star of this understated romance is James Fox, who plays the British contact for Connery's Scott Blair and the foil for the CIA's Scheider character in such gentlemanly fashion as to make the audience believe the true Bond-style gentleman-spy really does exist in this world. From the beautiful scenery to perhaps the best and most haunting soundtrack of any movie--ever (reviews abound--just look them up, friends--easily the great Jerry Goldsmith's finest work), the Russia House is a truly mysterious and romantic movie.","user":"housejk","rank":[65,74]},{"title":"This is great stuff","rating":10,"date":"13 January 2002","review":"Admittedly, The Russia House may not be for all tastes, but I saw this when I was 15 when it came out in the theaters and I loved it then and I love it now. <br><br>If you go in expecting this to be a James Bond/Simon Templar/North By Northwest type movie, you'll be GRAVELY disappointed. Needless to say, the movie is dialogue driven and the performances are great. Sean Connery (my all-time favorite) gives a nice performance in a role that isn't typical Connery. Michelle Pfeiffer (my favorite actress) is equally excellent. I kept looking for her to flub her Russian accent, but she's on target from start to finish. <br><br>The supporting players: Roy Scheider, who I also love, is awesome. There's a lot of witty dialogue in this film, but Scheider has some of the film's most memorable ones. Ken Russell, the controversial director, has an equally memorable, witty role as \"Walter\". I own this movie, but between the time I saw it in the theaters and the time I bought it a year and half ago, Russell was one of the things about the movie that really stood out in my memory of the film. And of course, James Fox who's always great.<br><br>Not really a supporting player but it might as well be is the LOCATIONS. Wow, really breathtaking stuff. Fred Schepsi did a wondrous job with the locations, and the CAMERA. The cinematography and locations were first-rate. And if that wasn't enough, I was equally enthralled with the jazzy musical score. If it isn't already apparent, I love this movie, and I absolutely recommend it. <br><br>It has a nice blend of dialogue, plot, romance and humor. I reiterate: Not for all tastes given that many may find it slow, but definitely worth a look. Hope you all enjoy it as much as I did.","user":"konover","rank":[57,66]},{"title":"John LeCarre heaven","rating":9,"date":"24 January 2005","review":"My first comment for this site....exciting stuff.<br><br>Prompted to write this by seeing this again on video - the third time for me, and it's rare that I want to see anything three times. And I realized that it's fascination still holds....this is one of my top 10, definitely.<br><br>The reasons I would rate this a \"9\", while somebody else would give it a \"5.9\" are largely personal....i think it always comes down to the personal. Talk all we want, when we watch a movie - as when we eat a meal, or kiss someone - the pleasure center in the brain either lights up or doesn't. For me it's all about the love of a place...for Scott Barley Blair it's early Glastnost Russia, for me it's 90's Germany - Hamburg, Berlin...the strangeness, the trueness of people who surround you in such a place and your love for them because of this. The fact that a film can light up specific sense memories like these means that it is true - at least in that respect. This is a remarkably honest film - terrifically unsensational for a spy film and one of the rare \"love stories\" that delivers the satisfactions expected of a \"love story\" without getting mawkish. Everything rings true here except for the ending (a fabricated \"happy ending\" which is the only thing that kept me from rating this a 10).<br><br>To ask for Manchurian Candidate type excitement from this low key film is wrong. The suspense, which is remarkably sustained (those rich long tracking shots of people walking through public places to uncertain destinations to meet with, or maybe not meet with shadow characters who may be allies or enemies) is the truer suspense of the uncertainty of living in a gray, gray world...where nothing much happens, but peril is part of the fabric of mundane life.<br><br>(Those sequences are gorgeous....the colors of autumn in a Leningrad park, the closeups of the stone gargoyles....the moody circular stepping pace of the soundtrack....Branford Marsalis' saxophone.) Someone has said here that it is talky. Yes, it is talky...but the talk is brilliant...it is the perfect reflection of a world where everyone - book publishers and bureaucrats and spies alike speaks in mannered, ritualized streams of code. This is not disinformation - it is perfectly understood by all, a language that has supplanted the language of an earlier age in which sincerity was an option.<br><br>Besides that ending, the piece is perfectly faithful to LeCarre's novel. LeCarre's books have had good luck when being translated into movies. Of the eight or so that have been adapted, four have made great films: The Spy Who Came into the Cold, The Russia House, and the two George Smiley BBC miniseries. LeCarre is a great writer and more specifically great at plotting and dialogue, and these films all succeed pretty much by filming what is written unadorned and pouring on the atmosphere. And they are blessed with lead performances by three great actors at the top of the form - Richard Burton, Sean Connery and Alec Guiness (Guiness especially...to watch him for six hours in Smiley's People is one of the great pleasures).<br><br>A beautifully efficient and elegant translation by Tom Stoppard of a great novel, wonderfully dignified and touching performances by Connery and Michelle Pfeiffer (never seen her better), a beautiful soundtrack by a second tier composer graced by the presence of a real jazz master, a terrific evocation of a place and time....a very moving film.","user":"steviekeys","rank":[43,49]}]