[{"title":"Outside Providence does not seem like much from the preview, but it turns out to be a surprisingly good comedy.","rating":8,"date":"9 September 2000","review":"Outside Providence seems like just another low budget, goofy high school comedy from the preview, but it is really a good movie. Timothy Dunphy is the lovable high school screw-up whose father sends him off to boarding school after he is involved in an accident with a parked police cruiser while smoking pot with his loser buddies. He develops an unlikely romantic relationship with the stunningly beautiful Jane Weston (Amy Smart) at the repressive school while fighting off the disciplinary excesses of the school faculty. This seems like the premise of the kind of ridiculous high school comedies that characterized the 80s (Screwballs, Ski School, etc.), but Outside Providence works well because it has heart. <br><br>Timothy Dunphy is sent off unwillingly to this hellish school, and it turns out to be a really eye-opening experience for him. He develops a lot of insight about himself, his friends, his romantic endeavors, and his family. The story is not exactly something that is entirely original, but the presentation of the film and the acting are extremely good, and the end result is a great comedy. Alec Baldwin delivers a hilarious performance as the emotionally closed-off father, regularly referring to his own son as \"dildo.\" He steals every scene he is in, and he should be particularly noted for his ability to give such a convincing portrayal of an emotionless, macho father and still be convincing in the emotionally tense scene between him and Timothy where he describes Tim's late mother. That scene in particular is unexpectedly intense.<br><br>Outside Providence is a good comedy. It does not resort to tasteless sexual fourth-grade humor to pull it along (which is one of the biggest problems with teen comedies lately - American Pie, Scary Movie (there was no hope for that one from the beginning), There's Something About Mary, and Road Trip, which should have been a great movie). Instead, Outside Providence focuses on character development and a good story, and tops it all off with a healthy amount of comedy in the form of the cast, the characters, the script, dialogue, and pretty much everything else. Probably one of the best elements of this movie is that it is not a relentless comedy. It doesn't grab desperately for a laugh every second of the way, but instead it rounds out the content with drama, romance, skillful comedy, as well as good writing, directing, and acting. Outside Providence is badly underrated and should not be missed.","user":"Anonymous_Maxine","rank":[24,27]},{"title":"Surprisingly good","rating":8,"date":"20 June 2002","review":"I overlooked this movie when it was in theatres and just saw it on video. I was very impressed. It wasn't the dumb gross out movie the Farrely's are known for. It had some laugh out loud moments, and some surprising tender moments as well. Alec Baldwin was hysterical as Old Man Dunphy and the supporting cast of friends like Drugs &amp; The Wire were funny as well. This movie is a lot better than you'd probably think. It certainly surpassed my expectations.","user":"headfulofghosts126","rank":[19,21]},{"title":"Corrente and the Farrelly Brothers Deliver","rating":7,"date":"15 September 2001","review":"The ambiguity of youth and the road to maturity are addressed in a somewhat stoically humorous manner by the Farrelly Brothers in the comedy, `Outside Providence,' directed by Michael Corrente.  Set in New England in 1974, the story centers on Tim Dunphy (Shawn Hatosy), an irresponsible seventeen-year-old who since the untimely death of his mother has lived with his gruff, blue-collar father (Alec Baldwin), his crippled younger brother, Jackie (Tommy Bone) and a one-eyed, three-legged dog.  Life is less than idyllic for Tim, but it doesn't seem to make much difference as long as he can live in the moment and get high with his friends.  In that respect, in fact, life is pretty good.  Tim's a senior in high school with nary a care in the world, until a car accident involving drugs and alcohol lands him in big trouble, and he avoids incarceration only by the grace and intervention of one of his father's `connected' cronies.  Instead of jail time he is sent away to the prestigious prep school, Cornhill, whereupon graduation his offense will be expunged from his record.  All he has to do is toe the line and get through his senior year.  But that senior year can last a long time, especially after he meets Jane Weston (Amy Smart), the girl of his (and everybody else's) dreams.  So what is a lad to do, knuckle down, follow the rules and put his life in order-- or follow his heart?  Or, as Tim replies when a teacher asks him to name his favorite author, `Hamlet.'  To be, or not to be.  And that is the question.<br><br>While not terribly original by any means, Corrente's film (which he co-wrote with Bobby and Peter Farrelly, adapted from the novel by Peter Farrelly) is funny and well presented, and has that quirky, recognizable Farrelly Brother's touch.  There's even a poignant moment or two, and most importantly, this isn't a `silly' movie, and though the characters are fairly stereotypical, Corrente manages to give it something of a fresh face and allows the humor to evolve naturally, never fishing for laughs or manipulating the situations purely for the sake of hilarity.  And it works well; there are some genuinely funny scenes, some side-splitting lines and one signature Farrelly Brothers scene that involves a flashback of the traumatic `hazing' of a freshman named Irving (Jack Ferver).<br><br>Shawn Hatosy gives a believable performance as Tim, and though he's not overly charismatic or likable, he does create a character with whom many peers and parents will be able to relate.  Tim is a very real person feeling his way through a very precarious period of his life.  And beyond the humorous aspects of the film, there is actually some very credible character development evident in Tim's behavior, and in the final analysis the overall picture not only aspires to a higher level because of it, but succeeds in that regard.  Hatosy's Tim is very much the average kid who lives in your neighborhood and works at the local fast food joint while he figuring out what life is all about.  Without anything singular or remarkable about him, he is entirely true-to-life and honest.<br><br>As `Old Man Dunphy,' Baldwin gives a solid performance, and with limited screen time manages to establish his character with astute precision. Like Tim, Baldwin's character is real, and serves as a kind of core for the story, and that realism of the characters is one of the strengths of the film.  The `Old Man' maintains a gruff exterior-- a bravura by which to live, if you will-- but you get a sense that there is something deeper to him, while at the same time you realize that what you see is very much a true perspective of who he really is as well.  It's a matter of Baldwin's ability as an actor enabling him to infuse some complexity into a character that could easily have been one dimensional in less capable hands.<br><br>\nThe supporting cast includes Jon Abrahams (Drugs Delaney), Richard Jenkins (Barney), George Wendt (Joey), Adam LaVorgna (Tommy the Wire), Timothy Crowe (Mr. Funderbeck), George Martin (Dean Mort), Gabriel Mann (Jack) and Kristen Shorten (Bunny Cote).  In a market veritably saturated for some time with comedies about teen angst (most of which are silly, insignificant, devoid of real humor and not worth the film they're printed on), with `Outside Providence,' Corrente and the Farrelly Brothers have to be given credit for delivering one that is truly funny while at the same time anchored in reality.  There is, in fact, more here than meets the eye upon the initial viewing.  Not only does it capture the essence of the era in which it takes place, but a sense of reality that in the end is definitive of it, as well. And it's done with humor, and without taking it over the edge, as the Farrelly Brothers are often wont to do.  Ultimately, it's a satisfying experience, and it's the magic of the movies.  I rate this one 7/10.","user":"jhclues","rank":[21,25]}]