[{"title":"It's cheesy, but remember, cheese is good too.","rating":6,"date":"6 August 2002","review":"Ok, it's not an Oscar winner, but few films are.  It is a campy flick, but it's not the wanna-poke-your-eyes-out-to-stop-the-pain campy, but rather in the realm of a guilty pleasure.<br><br>In agreement with an earlier post, this was not supposed to be a film that took itself seriously.  Notably, the action was on par with any other martial arts movie being made, and the script had a bunch of smart-assy humor (which I must admit that I'm a big sucker for).  It's meant to be a fun film, and that was the end result.<br><br>As far as a video game movie is concerned, it's not the worst ever made...Mario Bros is still the king, with Street Fighter in a close second, and Final Fantasy in third place.  So you see, there are worst movies that have been made.<br><br>And folks, I'm not ashamed to admit that I have the DVD for this film in my collection.","user":"Skeletors_Hood","rank":[27,32]},{"title":"Gangs of Los Angeles fight with police for the city while the Shadow Lord fights for the other half of a long lost amulet.","rating":5,"date":"5 July 2006","review":"Double Dragon is better then Super Mario Brothers. Then again, so is everything else. The movie was released in 1994, looks like it was made in 1989, and the fashion is circa 1980. Why is it people from the future dress like they're from the past? And why is it Alyssa Milano looks hefty? It was terrible, unsophisticated and bumpy. <br><br>That said, it gave me exactly what I wanted. Slapstick Sung-fu action and a few familiar faces. I enjoyed. You don't rent a movie like Double Dragon because you want an engaging plot. You rent it to relive your childhood hi-jinx.<br><br>Watch it and I guarantee you that you'll be downloading an emulator and playing it within a week.","user":"die_buffy_die","rank":[17,20]},{"title":"Cheese on Toast","rating":5,"date":"19 August 2003","review":"Oh, for crying out loud. This was a fun little movie with lots of good action in it that never takes itself too seriously. For what it was intended to be, it can't possibly rate this low. Was it honestly worse than \"Highlander 2\", with its big budget and big-name stars? Or \"Glen or Glenda\", a shining example of deep cinematic ineptitude? I don't think so!","user":"Acolyte-2","rank":[35,48]}]