[{"title":"An Excellent Performance by Ray Liotta","rating":9,"date":"17 August 2005","review":"When I first watched this film, I could not help but marvel at how brilliant Ray Liotta was at his role. Even though Kurt Russell and Madeleine Stowe both gave very good performances, it is Ray Liotta that stands out the most. I found that the transition that Liotta made between playing a nice guy to an obsessed and jealous psycho was absolutely outstanding.I believe he deserved an award for his exceptional performance. Not many actors could pull off a performance like Liotta did. Overall I felt that this film was a well thought out thriller, and was well cast. It definitely deserves the credit it gets. I would thoroughly recommend this film to anyone who enjoys a good thriller.","user":"morgan-161","rank":[32,33]},{"title":"One of the best suspense films i've ever seen!","rating":10,"date":"9 July 2003","review":"Kurt Russell and Madeline Stowe are Michael and Karen Carr a married couple terrorised by a psycho cop in this chillingly suspenseful thriller.One night their house is broken in to and the thief gets hold of Karen with a knife pulled on to her throat.Michael tries to stop him but the thief gets away.The couple call the police and there they meet Ray liotta who plays officer Pete Davis a respected cop who they befriend and welcome in to their house.Davis comes to their aid and shows his genuine concern and friendly nature.From Davis's advice the couple get an alarm system on their house but as events follow Davis's behaivior takes a turn for the worse.When one night Liotta takes Russell to the house of the thief who broke in to the couples house and Davis starts beating the guy up.Michael sees the whole thing and is so shocked with what he witnissed.Michael angrily tells Davis that his job is done of being a cop and protecting Michael and his wife. Davis begins to make Michael's life a misery so he can get close to his wife.Kurt Russell is believable as the husband who is faced with a difficult situation which he has to solve.Ray Liotta gives a brilliant performance as the bad corrupt cop doing whatever it takes to get closer to what he wants and making the character so chilling and very real.Unlawful Entry is a brilliant nailbiting suspense thriller Kurt Russell and Madeline Stowe are excellent as the couple this is One of the best films i've ever seen Excellent viewing.","user":"RUKIA22","rank":[20,20]},{"title":"I'M NOT YOUR FRIEND; I'M NOTHING TO YOU","rating":21,"date":"21 November 2002","review":"I remember seeing this film in theaters in 1992 at the tender age of 12, and I can recall now how frightened I was. That just goes to show the professionalism involved in this first-rate thriller. When a cop is on your back, what are you gonna do? Call the cops? Hmmmm....Kurt Russell and Madeleine Stowe struggle to find that answer here. Ray Liotta has never been creepier. Kurt Russell shines yet again in a role balancing the everyman we can relate to and the hero we cheer for in the end. One of the best thrillers of the 1990s.","user":"jonpd","rank":[32,34]}]