[{"title":"a lesser known Stephan chow movie","rating":7,"date":"3 October 2005","review":"After forty years of running his coffee shop, Mr. Li (Man Tat Ng of \"God of Gamblers\", \"Shoalin Soccer\", and \"God of Cookery\", among others) gets the news that his lease is about to expire and his rent is going to be raised exponentially. Li needs to find a way to get the money. That main plot is intertwined with three romantic subplots: one involving Stephan Chow as Sui, \"Prince of egg tarts\", whom everyone goes to for advice, put's on an act that makes him look like a ladies man, and may have met his match in Candy Yip (acting and singing star, Sammi Cheng) a girl he wronged in the past, another between Li's son, Nam &amp; Fon Fon, a girl who tells Li that she's engaged to Nam in order to avoid loan sharks, and the third with a delivery boy trying to woo Fanny, a secretary at a karate school.<br><br>While this film isn't as off-beat, frantically paced, or sheerly madcap as Stephan Chows more well known films (\"God of Cookery\", \"fight Back to school\", \"Kung Fu Hustle\", etcetera...), it's still a fun little film. All of the main characters are fairly well fleshed out, likable, and well acted. And while the plot is hardly anything new, in fact fairly generic. It's heart is in the right place and there are enough laughs throughout to make it worthy for a watch with a loved one.<br><br>My Grade: B-","user":"movieman_kev","rank":[8,9]},{"title":"You need to watch it more than once","rating":6,"date":"16 November 1998","review":"I can't help but feel that this movie was rushed to meet the deadline (of Chinese New Year).  There are many big stars in this movie, especially Sammi Cheng.  The jokes often require repeated viewing to fully appreciate, especially the scene with Prince Egg-Tart and Ah Fuk both taking turns to be turned down by Fanny.<br><br>The other funny scene from the beginning of the movie where Ah Sui (Prince Egg-Tart) was dumped by an old lady for not being mentally in the same \"channel\" while Ah Sui turning down a babe who bought him a car and apartment is particularly amusing.<br><br>Overall, the movie is quite good, especially with Stephen Chow and Sammi Cheng, but like all the other Chow fans out there, I recommend repeating viewing to fully appreciate the movie.<br><br>I have watched it 7 times so far.","user":"tezza-2","rank":[11,14]},{"title":"If you like funny love movies with no plot and happy ending then this is the movie for you.","rating":2,"date":"2 January 1999","review":"It was a pretty good movie with some funny scenes. Their wasn't really a storyline, the main thing that happened was a shop was saved from destruction, and 3 guys get the girls of their dreams. If you like funny love movies with no plot and happy ending then this is the movie for you.<br><br>Rating                      7/10","user":"Messiah-4","rank":[3,4]}]