[{"title":"Meet Edward Norton","rating":25,"date":"25 November 2000","review":"Outstanding thriller on par with \"The Usual Suspects\", \"Primal Fear\" is an impressive film about one lawyer's (Richard Gere) yearning for the spotlight.  He gets his wish after an archbishop is brutally murdered in Chicago.  It appears that choir boy Edward Norton (in his first film, Oscar-nominated) is the killer, but there is more to this case than meets the eye.  In the end, Gere is going to learn that what he thinks he wants (fame and fortune) is not all that great because of what he has had to go through to get there.  \"Primal Fear\" was one of the more interesting films of 1996, but was ignored by almost everyone.  Richard Gere does some of his best work ever.  Laura Linney, John Mahoney, Alfre Woodard, and Frances McDormand are all good in supporting roles.  However, it is Edward Norton who proved to be the discovery of the 1990s.  He keeps the audience on their toes and he adds depth and emotion to a film that would have looked much different if he had not been in it.  4.5 out of 5 stars.","user":"tfrizzell","rank":[152,167]},{"title":"The birth of a star and the resurrection of another","rating":8,"date":"8 May 2004","review":"It's not often that viewers get a chance to watch a star being born - that a talented unknown actor's performance that is so spectacular it leads to the A-list in one role is rare: Julia Roberts in Pretty Woman, Brad Pitt in Thelma &amp; Louise to name a recent few. But Edward Norton's turn as the \"defendant/victim\" in Primal Fear is one of those \"Wow\" moments that leaves the audience salivating for his next performance. In this feature debut, Norton outdistances his role, as does Richard Gere, in a resurrection no less impressive than Norton's star-making turn. Heretofore, Gere has specialized in assorted intelligent professional cad roles. Here, he gets a chance to inhabit one that not only wears his dubious character on his sleeve, but wears it, drives it, drinks it... revels in it. Yeah, sure somewhere there's a heart of gold, but like his client, the layers on top serve him better, and the heart of gold is tarnished. Gere is at his peak, comfortably, cheerfully inhabiting the role.<br><br>\nLaura Linney deserves extra credit for often being the ice-queen foil which propels the two male characters' development; her own character is rather one- dimensional, but she herself squeezes as much dazzle as she can from it. Even though everyone else obviously falls for whatever Gere's Vail purrs into their ears, it's merely enough time for Linney's Janet to get a drag on her ubiquitous cigarette; another step in what will (hopefully) someday be film's love affair with her. Wasted, sadly, are fine character actors like John Mahoney, Steven Bauer, Maura Tierney &amp; Andre Braugher who could have lit up the screen had they not been handed scripts with generic character stereotypes.<br><br>See it to watch the ascension of Norton and Gere.","user":"advixen","rank":[168,192]},{"title":"Edward Norton delivers the chills...(POSSIBLE SPOILERS AHEAD)","rating":7,"date":"12 September 2006","review":"PRIMAL FEAR is a good old-fashioned thriller with a modern twist. The plot concerns an altar boy accused of killing a clergyman who molested him and a sleazy lawyer who sees a chance to make tabloid news by taking the case. What he doesn't know is that his client can be just as cunning as he is.<br><br>RICHARD GERE seemed to specialize in playing these kind of low-down heels (typecasting does have its perils), and LAURA LINNEY as the prosecuting lawyer has her hands full trying to play a game of one-upmanship against him during an intense courtroom trial.<br><br>The story ends on a chilling note, thanks largely to the clever, intense and totally convincing performance ED NORTON gives in his film debut. As the guy who seems to have a devious split personality driving him to do bad things, he's the kind of actor who makes the audience sit up and take notice of his abrupt mood changes. It's no wonder he pulls the wool over so many eyes.<br><br>Having said that, it's the climax of the film that is most stunning and brings the story to a totally unexpected conclusion. It's the kind of chilling twist that only the most clever scriptwriters can devise and make seem probable--but it succeeds here.<br><br>Summing up: The kind of film you'll want to revisit once you know the whole score. Gere, Linney and Norton deserve high praise.","user":"Doylenf","rank":[59,65]}]