[{"title":"I really liked this movie","rating":7,"date":"23 August 2002","review":"I don't know what to say: i just really liked this movie. I even cried :-o Maybe I am just cheesie or too romantic, but what the heck.... In my eyes, the main storyline is not the search for the mother, but the discovery of those first loving feelings, the changing of the body, the transformation from childhood to adolescence, in short: it is a story about growing up. Something we all have gone through....its such a \"feeling good\" film: all people are friendly, there are no sorrows...<br><br>It gets a 7/10 (which is a lot coming from me, believe me)","user":"The_Cobra","rank":[20,23]},{"title":"One of my favorites.","rating":22,"date":"22 April 2000","review":"Yes, I know \"My Girl 2\" was a sequel. Yes, I know it is hard to follow the first movie. But the reason why I love this movie is because of the way we see Vada Sultenfuss has changed over the course of a few years. I loved seeing the sweet, innocent Vada become more of an adult &amp; still remain likeable as a character. I also love Austin O'Brien in this movie; to date, he has not been in anything memorable, but I think the role of Nick was suited for him. I do find the relationship they have somewhat disenchanting, but it was what I was waiting for the whole movie. I think the plot was an interesting one, and Maggie Muldovan made this movie. It is, as another reviewer remarked, worth it to watch the movie countless times just to hear her sing \"Smile.\" I love all of this movie, though, so I would advise seeing it.","user":"silvergirl1385","rank":[7,9]},{"title":"The sequel's just as good as the original","rating":7,"date":"14 June 2015","review":"The original \"My Girl\" from 1991 was a quality drama about a 10 year-old girl experiencing tragic death. In \"My Girl 2\" she's now 13 and goes to Southern California to learn about her mother she never knew. Her companion is played by Austin O'Brien. Dan Aykroyd and Jamie Lee Curtis play her father and stepmother while Richard Masur and Christine Ebersole co-star as her uncle and potential aunt. The beautiful Angeline Ball has a small role as her mother in flashbacks.<br><br>This is just a solid drama, as good or better than the original. The adventures of the two 13 year-olds as they go from person to person searching for information about Vada's mother compels the story along. The people they meet are colorful or interesting. The peripheral subplots are good too, like will the Uncle propose to Rose or allow some rich dude with a Jaguar to snatch her up? <br><br>The film runs 99 minutes and was shot in Los Angeles, California, including Topanga Canyon.<br><br>GRADE: B","user":"Wuchakk","rank":[5,6]}]