[{"title":"Lovely Capraesque Comedy Drama","rating":21,"date":"21 February 2004","review":"It has been quite some time since I last saw this film. However, the amazingly low IMDB score has prompted me to jot down a few thoughts and memories I have regarding this under-appreciated masterpiece.<br><br>I find it appalling that this film would score so poorly in this arena. It is a wonderful, life affirming story with a positive message. Perhaps this is what we have come to. The comedy is not gross enough, the message too sentimental and the meaning too simple for modern \"sophisticated\" audiences. Well, I for one, absolutely loved every minute of it. It is easily Andie MacDowell's best performance. William Hurt is fantastic as the cynic who comes around in the end and the whole supporting cast does a wonderful job. Of course, John Travolta is superb. This is one of my favorite roles Travolta has played and it is simply resplendent. I would have to say this is in my top twenty of comedy-dramas ever. I just happen to love the way the film unapologetically illustrates how wonderful life is. How even the little things that we take for granted, like pie, are fantastic and how we should enjoy every minute like it was our last.<br><br>For a much more detailed and well written review see the fine work of jhclues who echoes my feelings about the movie so much that I feel it would be redundant of me to restate, probably poorly, all that they have already committed to page.<br><br>It is also interesting that so many people really hated it. I wonder if they weren't just put off by the \"less than traditional\" view of a religious subject.","user":"bigbillyt","rank":[69,76]},{"title":"charming, quirky, offbeat, light, fun ... do not take too seriously","rating":8,"date":"28 October 2005","review":"Possibly the best John Travolta role ever. Saturday Night Fever was a great movie &amp; role, but a LONG time ago. I can't think of many of his movies or roles I've even liked, and it's easy to think of rotten ones. He can do meanies like in Pulp Fiction, but he makes the perfect funky angel, and it's hard to imagine anyone doing a better (equally slobby) job with it. Plot summaries are available everywhere, but the plot isn't the point. Just go for the ride and enjoy the cleverness of the little funnies along the way. There is nothing to dislike about this movie, unless one is searching for something profound. I wish there were more movies like this. We need a break from deep or awesome or grisly or complex or hysterical.","user":"john-herbert22","rank":[37,41]},{"title":"Easily enjoyable","rating":8,"date":"30 May 2009","review":"Wow, I think the overall average rating of this film on this site is incredibly low. There's really no reason to dislike this film. \"Michael\" is a simple, but fairly original, and easily enjoyable romantic comedy. The plot involves a group of reporters/experts going to examine the mysterious appearance of an angel (John Travolta) in the midwest. The angel proves to be less saintly and more worldly than we would expect, and that's what makes it entertaining. His interest in women and the Beatles takes a new spin on the angel thing. The romantic side of this film involves Michael the angel trying to get Andie MacDowell and William Hurt together. The two of them may not have the all-time greatest on-screen chemistry, but they certainly have enough to make it work well. Everyone who has rated this film so low (a 5.4??), come on! The film is not that bad. In fact, I found it quite funny and memorable. Sure, it's not the best thing you'll ever see, but it's still good. This is a film I feel has been remarkably underrated. It's fun, romantic, and recommended by me.<br><br>*** out of ****","user":"kyle-cruse","rank":[11,11]}]