[{"title":"The Purple Noon of Anthony Minghella","rating":8,"date":"2 May 2005","review":"As a huge fan of Rene Clement's \"Purple Noon\" I came to Minghella's version of Patricia Highsmith's story with suspicion and an irrational predisposition to dismiss it. Well, I was wrong. The talented Mr. Minghella perpetrated a magic trick. The film stands on its own as an entertaining, creepy, thoughtful, beautiful to look at piece of film-making. Jude Law throw us for six, we're not suppose to feel attracted to the selfish Dickie Greenleaf, but we do. His scrumptious performance is alluring, seductive. He is a scene stealer of major proportions. In the original, Maurice Ronnet's oily Dickie Greenleaf was a perfect lamb to the slaughter. We don't mourn his death and want the murderous Ripley, as played by Alain Delon, to get away with it. Here, when Jude Law is on the screen that's what we're looking at. We're prepared to forgive him anything and everything. I did believed in Gwyneth Paltrow's qualm, totally. In the original, Marie Laforet played it as a tenuous, unclear little excuse. Gwyneth Paltrow gives us a multi dimensional character and we go through her torment every step of the way. That, presumably, is merit in great part of Minghella's superb screenplay. Other joys are Cate Blanchett and Philip Seymour Hoffman. On the minus side Matt Damon couldn't make me forget Alain Delon. His Ripley is a better written character than Delon's and his performance is top notch, but Delon was breathtaking on the screen. I think than Anthony Minghella was more interested in the inner workings of Ripley's mind that in the pyrotechnics of a implausible plot. Good. The semi confession of Matt Damon about a basement full of secret truths tells us about his pain about his fear. Delon's Ripley is amoral to the hilt. The murder of Dickie in the original is terrifying. It takes forever. As well as the getting rid of Freddy's body. Minghella never show us how Ripley managed to bring a dead body down the stairs. Clement spends a great deal of time with it. Making it enormously suspenseful. But, as I mentioned before we did care about Delon and, maybe, Minghella new that whether Damon got caught or not wasn't that important. All in all I liked the film very much and the biggest lesson from a film fanatic's point of view is: you don't kill your Jude Law half way through a film unless you leave us in the hands of someone who will make us forget him. Janet Leigh and Anthony Perkins, remember that?","user":"marcosaguado","rank":[210,232]},{"title":"Duality makes this film an heir to Hitchcock's classics.","rating":9,"date":"3 January 2000","review":"Duality -- the ability to be one person in a certain situation, and another in another -- is the underlying and pervading theme of \"The Talented Mr. Ripley.\"  It is a theme that sparks the central conflict of the picture, that influences each of the main character's decisions and actions.  Each character in the film is either pretending to be something else, or playing directly to a superficial identity.  The film unravels each of the character's motivations for doing so, and in so doing strips away the layers of reality we construct for ourselves.  Characters either uncover the explicit duality of their lives (Cate Blanchette's willingness to admit that she travels under another name), or have it uncovered for them (Tom Ripley). When each character is laid bare, when each character is most fully themselves, when each character stops acting and pretending, they are undone.<br><br>The film presents a main character who does his best to pursue another life -- but he cannot ultimately follow through with it.  We are trapped by who we are, aren't we?  Gwyneth tries to become Dickie's ideal woman, to avoid asking him to settle down, but she cannot -- she wants the home and the family.  This is her undoing -- she weeps in the film, \"I must have pressured him\".  Dickie can't escape the fact that he loves the nightlife -- that he strays, that his attention only lasts as long as the diversion. He says he will marry Gwyneth, but we know that his eye can never stop roaming. This is his undoing.  Dickie's pal -- superficially polite, while snide and arrogant at the same time -- is much smarter than he appears, which leads to his undoing as well.  When each of the characters lets their guard down and becomes who they are, it destroys them.  Each of the characters has a tragic flaw that they try to ignore, or play to, a flaw which undoes the perfect lives they all pursue.<br><br>The ironic twist is that Tom Ripley is the catalyst for all of this -- yet, his tragic flaw is that he has no flaw.  While each of the main characters has an identity they are running from, Ripley HAS no identity to speak of. He starts out pretending, and he pretends through the entire film.  Who IS Tom Ripley?  Even Tom himself wants to know.  One would think that this would enable him to become the perfect actor -- when you paint on a blank canvas, one would think you can paint anything.  But even Tom, blank as he is, distills down to someone -- even if it is a blank canvas, a \"real nobody.\"  And it is not only himself he is unsure of -- it is the entire world around him.  Among his first lines in the film is a line uttered while listening to a jazz record -- he mumbles to himself, \"Can't tell if it's a woman or a man.\"  It is this uncertainty that informs the world he sees, and how he relates to it.  Is Tom gay or straight?  Is he evil or good?  Even Tom doesn't know.<br><br>The film points out that we cannot run from our own darker half.  We are all tempted to become someone else -- anyone who has been made fun of in school, who has longed for the life of the rich and famous, can identify with this The enemy is not without, it is within.  It is this same duality which haunted and tormented so many of Hitchock's characters, most notably (but not exclusively) Norman Bates in \"Psycho.\"  \"The Talented Mr. Ripley\" is a worthy heir to that film classic in its ability to get the audience to sympathize and empathize with Tom.  We feel his love for Dickie Greenleaf -- we feel his frustration at being shut out of his life -- we feel the awkwardness of being trapped in a situation that was never intended.  As we watched Marion Crane's car pause in the swamp and waited breathlessly, perversely hoping it would sink and allow Norman's mother to get away with murder, so too we watch Tom Ripley descend into darkness, and when the cops arrive at his hotel, we wait breathlessly with Tom, hoping he will get away.<br><br>Duality is present within us all... and while we are taught \"to thine own self be true,\" in this film it is only when we are true to ourselves, that true pain comes.","user":"nathan19","rank":[44,46]},{"title":"Dark And Gorgeous","rating":9,"date":"10 October 2007","review":"Patricia Highsmith's Tom Ripley gets a deluxe reincarnation here, merit of the talented Mr. Minghella. A sensational script adaptation, stunning Italian locations and an extraordinary supporting cast. Tom Ripley saw the light before, most memorably with the face of Alain Delon in another beautiful outing by the underrated Rene Clement. This time, the winning feature is the superbly tailored script that gets inside the heads of the characters giving us a full panoramic view of their privileges as well as their desolation. Tom Ripley, the amoral, becomes the tortured immoral here. Anthony Minghella gives him a conscience, a self-awareness giving the tale an extra chilling touch. Matt Damon's natural dullness works wonders here. This may be his best performance to date. But it is the supporting cast that makes \"The Talented Mr. Ripley\" fly so high. Jude Law as the spoiled, vain and ultimately cruel Dickie Greenlef is truly remarkable. His worthlessness, crystal clear for everyone to see, becomes irrelevant due to the astonishing charisma and oodles of sexiness that Jude Law exudes. That, in itself, makes Gwynneth Paltrow's character totally believable. She's an intelligent woman who must know Dickie for what he is but she puts that aside and we don't question it. Philip Seymour Hoffman's Freddie is a fully fleshed out character who's on the screen for a few minutes but leaves and indelible impression. Great fun to witness his two faces. Creepy and wonderful. But it is Cate Blanchett, in a creation worthy of W Somerset Maughan that becomes the icing on this scrumptious cake. I would love to see a film where her Meredith is the central character. This \"Talented Mr. Ripley\" cemented my film relationship with Anthony Minghella. I wait for his films with childish anticipation.","user":"littlemartinarocena","rank":[143,162]}]