[{"title":"Not a bad movie at all ---- but probably made ten years too early!","rating":9,"date":"8 August 2006","review":"Despite lead actor Hugh Grant still riding high from his sleeper hit FOUR WEDDINGS AND A FUNERAL and a well publicized arrest for curb crawling in Hollywood the previous year, this was not received well in the theaters. Even with the support from the ever versatile Gene Hackman the movie was a box office flop! It's important to state from the outset that the film itself is pretty good and deserved better than it got, not just from the standard of movies that were around but also because it was well acted and raised some very important moral and medical questions that to some extent are more relative today with the controversy over stem cells than it was ten years ago! <br><br>As for why the movie bombed I cant really say, perhaps not enough guns, sex and violence or maybe the theme or scenario was very depressing to many people. Also I think that being a thriller, actor George Cloony who was a lead in the popular medical soap ER would have been a better box office draw than Grant. Clooney who was struggling to break into the \"A list\" of movie stars at the time would have been believable as a doctor and the movie it self would have elevated him faster up to stardom than the duffers he did at around that time! However, it has to be said this is only as far as being a better box office draw, Cloony of course being American. It has to be said Hugh Grant was very good in this part and I think it was one of his best films. Grant was and still is better known for comedy or a romantic lead not a tough guy roles or action films, so perhaps this is why many in his fan base did not take to his character because it was a thriller not a comedy.<br><br>Having said that he was very well cast for the part and on many occasions was able to display his dead pan dry wit and came across quite believable as the out of towner Dr. from the UK who didn't know what he was getting into. His character was typical Grant in the USA not aloof and pompous, but just a little awkward, slightly eccentric maybe and disorganized! I think that coming from England only made the character come across as more vulnerable and isolated as events unraveled and things seemed to conspire against him. When the well respected Dr. Myrick (Gene Hackman) decided that Dr. Luthan's (Hugh Grant) meddling was proving to be problematic as well as inconvenient, Luthan's feeling of paranoia towards his colleagues was more believable. No tough guy or macho part was needed here!<br><br>Grant played Guy Luthan who was deemed for great things in the medical profession is a physician who encounters a distraught and frightened patient who had been found wandering the streets. He is extremely agitated, suffering convulsions and has strange legations at the base of his spine. Despite desperate attempts to save his life the mysterious patent dies. Luthan who is shocked over what he has witnessed is puzzled by a silver bracelet on the wrist which indicates that the patient (Claude Minkins) was probably a hospital patient somewhere and starts to make inquires. He orders blood work and lab analysis despite the fact that patient has no medical insurance (much to the annoyance of his superiors). When he can not find the hospital that used silver a bracelet and is concerned about the bizzar results in the lab report, he then delves further into this case much to the disdain of colleges and top faculty administrators. It appears that the patient was homeless and his medical records wiped and put in storage where he is unable to track them.<br><br>Then the body mysteriously disappears, the chief residence is very nonchalant about it and berates and scolds Luthan in very dismissive and casual manner over his concern, this only leads him to become more suspicious. Soon he feels that he can't trust anybody as it appears that some are trying to thwart his own investigations. He is correct, ------ some within the hospital as well as outside are trying to frustrate his efforts in unraveling this mystery. Rather than back off, he let's his curiosity get the better off him, puts his professional reputation on the line which only results in disastrous consequences for him personally. Realizing that he is really on to something and now with nothing to lose he becomes even more determined to track down who is responsible for trying to ruin him, ------ but more importantly why?<br><br>This movie raises medical and moral issues over the balance of patient care and medical advancement. This is not a new topic, the earlier movie COMA and many or medial shows since have dabbled with this dilemma but the ending in this movie leaves that question strangely unanswered? (Interestingly, at the beginning of the movie Luthan has an ethical dilemma of his own. While working in the ER he has to decide who gets the priority for the only OR room available at the time. It's a choice between a wounded Cop and the and the 'perp' who shot him, who incidentally is in a more serious condition. He decides that the cop should get priority)!<br><br>Hugh Grant was good, so was Hackman and fine support from Sara Jessica -Parker, David Morse and Paul Guilfoyle. I would highly recommend this movie!","user":"dgrahamwatson","rank":[32,33]},{"title":"Very underrated film that actually provokes thought","rating":19,"date":"19 March 2001","review":"I just saw this for the second time, on telly, and was struck again by how good it is; not great, maybe, but a very solidly written and acted film on an intriguing premiss and leaving the viewer a bit of room to make up their own mind (this is a GOOD THING, in case anyone is wondering).  Hugh Grant shows again that he can do more than play variations on this 4 Weddings character - anyone who has seen An Awfully Big Adventure will be well aware of this.  And Gene Hackman is as excellent as ever.  A word for Elizabeth Hurley, who produced the film, and I think it was her first: a damn good job she did, despite some unsavoury sniping in the British press about her.  I'd give it an 8 out of 10","user":"azeemak","rank":[25,28]},{"title":"Amazing","rating":19,"date":"19 December 2007","review":"This movie is very relevant in this day and age with the on slot of diseases and people who are searching for the answers. Hugh Grant playing the moral side of this left and right medical thriller. The big question brought up in this film is that of medical morals that have been brought up in many movies and in the thoughts of many people, \" Would you kill many people to save lives in the name of medicine?\"<br><br>Hugh Grant is amazing as the hero Doctor Guy Luthan. His character works feverishly to find the truth of,\" What is going on with this mysterious men that come into his life, why his life is being destroyed and what is \"Triphase\"?\" This is a good movie of Hugh Grant's and shows how he works well as a serious actress which I think he should go back to. <br><br>Go rent this movie or check HBO for the next time it appears.","user":"BNVfilms","rank":[8,8]}]