[{"title":"More confusing than a fever dream","rating":1,"date":"14 April 2017","review":"It's nearly impossible to put into words how awful this movie truly is. The acting and dubbing is beyond laughable, it has the worst stock footage ever and barely has anything resembling a plot. The entire world in the film seems to operate without logic or reason. Somehow the kid, Paul, makes his way into the middle of the Sierra Nevada mountains after running away from boarding school because Bigfoot told him his dad was in danger. Paul is then picked up by a trucker who doesn't seem at all puzzled that a 10 year old is out there. Paul then proceeds to magically find his forest ranger dad walking around in the middle of the woods despite having no possible way of knowing where he would be, and his dad barely questions it. And that's just in the first ten minutes. The whole movie plays out like there wasn't even a script and instead the director made it up day to day. I'd recommend watching the MST3K version of this so there isn't any lasting mental scarring from the absolute mess assaulting the senses. The two people rating this movie an 8/10 and 7/10 either must've been involved in the production or actually had their sanity affected by this turd, because literally nothing in this movie is redeemable, save some nice shots of the California wilderness, and that's why it gets one star. This movie isn't healthy for children and other living things.","user":"DrForrester31","rank":[35,38]},{"title":"This was a doozie!","rating":1,"date":"16 April 2017","review":"This movie was chosen as episode 2 of the reboot of MST3K for a reason. It's not even \"so bad it's good\", just plain bad. <br><br>The story doesn't go anywhere, I've seen better editing from the average 11 year old's YouTube video, the acting is seriously painful to watch, and the whole thing is just completely disjointed. It's like a fever dream from which you just can't wake up from.<br><br>The only thing that saved the movie was the MST3K riffing, some of the funniest (and edgiest!) I've heard. Do yourself a favour... if you MUST watch this schlock, watch the MST3K version.","user":"Lost_cow","rank":[24,27]},{"title":"Captivatingly Bad","rating":2,"date":"6 February 2008","review":"I place this movie in my personal category of movies that cross into an area of unusually poor film-making, and in doing so, leave you unable to pull yourself away. Even telling friends, you have to see this movie because it is SO bad. I have to tell myself that this is the goal of those who make movies like this. I just can't honestly accept that someone wrote this, thought it was good, and was able to make the movie, with the honest intention of having it be good. So, if you are considering watching this movie, chances are it's because you've found it at a library, (I've never seen it in any video store), but if you have made the unfortunate decision to pay money to rent, or, heaven forbid, buy it, I suggest a healthy dose of your preferred inebriant and low expectations. REALLY low expectations.","user":"gabrielheath","rank":[20,24]}]