[{"title":"Disgusting, Violent, Awesome!!","rating":9,"date":"29 January 2001","review":"Not quite Jean Claude Van Damme, but still excellent karate action. This is Eric Roberts at his best for sure!! My kids use it to psyche up for football and my girl uses it to get pumped for her judo competitions. If I could find this on DVD I'd play it around the clock!!","user":"javaAZ","rank":[14,16]},{"title":"Good fight film .........","rating":6,"date":"21 June 2010","review":"The fight scenes elevate \"Best of the Best 2\" to above average territory. Chris Penn is his usual macho self and puts on a good show until he runs into the behemoth, Ralph Moeller (Brakus). Eric Roberts and Phillip Rhee avenge the death of their friend with some spectacular fighting. Special mention must be made of Wayne Newton's smarmy performance as the Coliseum's pompous announcer, someone you'll love to hate. As pure entertainment the film succeeds, because of the enthusiastic performances, and well staged gladiator style battles. Give this one a try if you enjoy martial arts, you will not be disappointed - MERK","user":"merklekranz","rank":[5,5]},{"title":"The best of the Best of the Best movies","rating":10,"date":"19 December 2010","review":"This movie was awesome! I don't remember the last time I enjoyed a martial arts movie as much as I enjoyed this. The fighting is sensational and the performances of the actors are very convincing and even touching in parts, rare for a B martial arts film. I can honestly say I enjoyed this more than the first and consider it the best of the first two. I cannot comment on the other sequels since I haven't seen them but I will definitely check them out. If you are looking for a great authentic action and martial arts film that is chock full of mindless and brutal violence, then look no further. As I was watching the movie, all I could think was how did this film managed to slip through my fingers? Anyway, if you are into this type of thing and see it at your local video store, give it a rent. You'll be glad you did. Bottom line: this movie rocks!","user":"danielv1989","rank":[5,6]}]