[{"title":"Great family movie","rating":8,"date":"13 January 2001","review":"This was my favorite movie when I was 11. I watched it everyday, until my older sister used it to record one of her soap operas. I'm 18 now and happened to be looking through a discount bin at an old town video store. Guess what I found? I have to admit, it was a little on the stupid side. It didn't have a great plot, and the action was unrealistic, but aside from all that, it was still funny. One week later, while watching my 8 year old cousin, I popped in Remote, and you know what, he loved that movie just as much as I did when I was young. Isn't that what watching videos is supposed to be about? I look forward to watching it with my children someday.","user":"Reaper-29","rank":[15,18]},{"title":"Pretty Cool film, full of tricks","rating":9,"date":"19 April 2009","review":"I love most of the films made by Ted Nicolaou. He is very experimental film maker. Every his film is a discovery. This time he surprised with really bright film for kids. The story is about young genius who makes his own world out of the remote controlled toys, who help him to entertain himself. He has got a lot of planes and helicopters, dolls etc.. He also has very good friends, a girl and a black boy with whom they like to ride their bicycles. But one day main character's mother prohibits the boy to play with his toys-that is why he found some other place to play with them, facing three local robbers who came to the same place. Unfortunately I did not see this film when I was 9-12- otherwise I would love the film even more. Respect to Ted www.myspace.com/neizvestnostlab","user":"andreygrachev","rank":[4,8]},{"title":"Strictly for children.","rating":18,"date":"18 March 2001","review":"**SPOILERS**   On the day before my family and I moved into our new houses in Atlanta, we stayed in a hotel for a week.  On the last day, I saw this movie Remote was on, and I kept it on for my niece and nephew to watch.  They thought it was a hilarious movie.  But I ended up thinking it was one of the lamest movies I have ever seen.<br><br>It's about a 13 year old boy who's a nerd and he's obsessed with remote controlled toys.  He even gets his girlfriend into them, too.  (Spoiler warning): Then one day he accidently demolishes a kid's science project, then his mother hears the dreaded news and threatens to confinscate his toys so he runs away into a tract house, which happens to be his secret hideout, with the help of his girlfriend only to be stuck in the house with three moronic criminals who have taken over.  Then he finds himself playing pranks and battling the bad guys.<br><br>The criminals in this movie were supposed to be stupid in a vulgar kind of way and weren't entertaining at all.  As a matter of fact, neither is this movie!  I've seen more entertainment in Pauly Shore movies!  Only children would like this movie, anyone over the age of say, 16, would want to shatter their TV with a lava rock!  Unenticing and totally pathetic from beginning to end.  You can tell that this movie was made on a low budget, anyway.  Recommended for children ages 6-15 or people with I.Q.s in the single digits.","user":"wishkah7","rank":[4,9]}]