[{"title":"Uneven with it's story, but not as bad as some say it is","rating":6,"date":"29 May 2012","review":"There are some things that went wrong with this film and I never read the comic strip, but I don't think it's as bad as everyone says it is. I'll start off with the positives.<br><br>The acting on the whole isn't that bad. Walter Matthau did a good job as Mr. Wilson as did Robert Stanton, Lea Thompson and Joan Plowright, but I think that Mason Gamble steals the show as the most likable title character who got the personality and characterization right. Even his chemistry with Walter Matthau was decent. Also, Christopher Lloyd was very sinister as the main villain and he steals the show as well. The scenery is nice and it has some nice cinematography. I also liked the music from Jerry Goldsmith. Not the best here, but still worth listening.<br><br>However, the story, while having its nice moments, falls into the predictable zone and the script feels flat and would've been so much better. Some of the humor gave me some chuckles (Dennis causing some trouble to Mr. Wilson and the baked beans farting scene), but some of them lacked wit and the pacing was very mediocre.<br><br>Overall, uneven with it's story and pacing, but not as bad as some say it is. I'm giving this a 6/10 because of it's likable cast and some nice scenery.","user":"gavin-thelordofthefu-48-460297","rank":[9,9]},{"title":"Great movie for kids of any age","rating":8,"date":"19 June 2003","review":"How can this movie get such a low rating? It is really well made, has some very funny moments and the casting is excellent. Dennis is cute as a button and totally believable, his parents are.. well, just perfect and mr Wilson is the best mr Wilson you could wish for. The same applies to many of the smaller roles. And then there is Christopher Lloyd in one of his best performances ever. I loved this movie, both the first and second time I saw it. It deserves at least an 8, so I gave it a 9 to boost the score.","user":"The_unemployed_cynic","rank":[33,42]},{"title":"*** out of ****","rating":7,"date":"29 December 1998","review":"\"Dennis the Menace\" is unique in its own way because it's observant.  This movie made me laugh at stuff i've always laughed at and things i'd never thought I would laugh at.  The film can be surprisingly innocent at times and sincere and heartwarming.  And the kid who plays Dennis is a way better actor than Macaulay Culkin.  I liked the film for its imagination and humor.  A good film.  I also liked how they showed Dennis trying to resist the temptation to do something bad but can't resist.","user":"clay-8","rank":[27,35]}]