[{"title":"Disturbing Thriller","rating":7,"date":"7 January 2007","review":"A beautiful army officer is murdered in compromising circumstances that the fort MacCallum officials would rather keep quite. John Travolta and Madeleine Stowe are the investigators into the murder, and it's seems that someone wants to keep the truth hidden.<br><br>Travolta and Stowe both capture the necessary elements of their characters and they are well supported by James Cromwell, Timothy Hutton, Clarence Williams II and James Woods.<br><br>This suspenseful mystery thriller delivers the disturbing truths of the story very well, it does have its flaws, but they are largely forgivable due to the captivating delivery and direction.<br><br>7/10","user":"mjw2305","rank":[45,50]},{"title":"Rape scene","rating":9,"date":"6 June 2007","review":"The film was altogether very interesting but at the same time tragic, especially the gang-rape scene which left me incredibly disturbed. The storyline is amazing and is enough to draw someone into the film even if halfway through and the direction of the film is very well done. The characters were very convincing and the acting of both the daughter and John Trovolta's character was unbelievable. The point at which the daughter was told not to talk of her rape - you could actually see every emotion through her eyes, enough to make anyone break down. Although the whole plot of the film was based around a young, murdered woman, it did cast a very negative view on how woman are treated in the US forces which could be seen as unfair. Although this is true, it did show a very valid point of how, in any job, men still value themselves as having a 'right' to be in the job over women.","user":"katie-rayson","rank":[20,21]},{"title":"Seen it many times and still enjoying","rating":9,"date":"17 April 2010","review":"I have developed a large DVD library over the years, some 1,000 today! There are only a few which I will see more than once or twice. And The General's Daughter is one I keep seeing with pleasure. You will have read many reviews, scattering ratings from 1 to 10, as usual, but with a poor average rate. I personally like the movie for its excellent tempo and accompanying music. Travolta, Cromwell and Stowe fit their respective role perfectly. The global integration of filming, dialogs, acting and plot come out exactly right. So of course I try to understand why the rating is so poor. I have read criticism regarding the poor adaptation from the book, the way the army is depicted so unjustly, the average performance of Travolta and his annoying southern accent and more. Well, we have the right to our choices and own judgment. On a closing note, I wish people would stop repeating the plot in their reviews: it's boring, redundant and does not provide a bit of film analysis.","user":"steve-ruzicka","rank":[30,35]}]