[{"title":"Entertainingly overblown action marred by slapdash storytelling","rating":11,"date":"11 January 2000","review":"The script for Double Team was originally called \"The Colony\" and by several accounts, it was actually quite good. Apparently, it went through many major alterations on its way to production until the final product bore little resemblance in tone and quality to the original script. Does this mean Double Team is a disaster? Not really, but its clear all the changes created some problems.<br><br>On the one hand, you have the participation of famed Hong Kong director Tsui Hark and world-class cinematographer Peter Pau. They manage to create some of the coolest, trippiest, most fantastical visuals this side of a MTV video and better still, do so without the excessively choppy editing that usually accompanies \"MTV-style\" films. You actually get to appreciate the luxuriously-shot images, though the film is by no means slow-paced. Better still, it's one of the few Van Damme movies that realizes the best Van Damme movies are the ones which absolutely never rely on Van Damme's acting (or anyone else's for that matter) to carry the film along. It's all action, goofily entertaining plot twists, and sweet visuals. As an action-packed, overblown, eye-candy fantasy, Double Team works very well.<br><br>On the other hand, it's painfully obvious that Double Team used to have a smarter script which called for a far more subtle and serious approach. Had these \"intelligent\" elements been completely erased or dumbed-down for the final product, this wouldn't have been a problem. However, it seems that some of the more subtle plot developments were left in and they do NOT mesh well with Tsui's and the rest of the final script's \"jackhammer\" approach to the story. For example, at one point a prescription label left on the wall is supposed to be noticed by Van Damme's character who then uses the name of the doctor on the label as a clue. However, unless you're paying very very close attention you'd never know that. It's so small on screen, the label may as well have been blank. And the shot where the label is taken off the prescription bottle is far too quick and unclear. A single extra shot showing a closeup of the label would've cleared things up immensely. But it never happens. The film contains several instances like this where a single clarifying shot or an extra line of explanatory dialogue would've made things much clearer. The result is that what seem like glaring plot holes (even for this kind of movie) are in fact due to badly explained plot points. Such an obscure presentation might have worked on a quieter, more \"intelligent\" spy film where the audience knows they aren't going to be spoon-fed the plot. But after 40 minutes of terrible one-liners and ridiculous action, the last thing that should be required of Double Team's audience is to suddenly pay close attention to what's happening.<br><br>\nI don't know whether Tsui Hark was trying to keep in some subtle elements while reconciling it with the rapid-fire approach, or whether he just didn't care about such details and wanted to keep things moving (Probably the latter, as his subsequent movie, Knock Off, experimented with this abstract, to-hell-with-storytelling visual approach to the nth degree). Whatever the case, the result is a pretty wild but somewhat confusing action movie that could've been much better with minor changes.","user":"ipkevin","rank":[26,27]},{"title":"Good action, but with some big plot-holes.","rating":7,"date":"19 March 1999","review":"Double Team is the third movie that Van Damme has done for a former HONG-KONG action-movie director. He has done \"Hard Target\" for John Woo and \"Maximum Risk\" for Ringo Lam.  Double Team is directed by rather splendid Tsui Hark.  Hark is excellent at directing action-scenes and Double Team is a good way for him to start in Hollywood. Van Damme plays agent Jack Quinn, and is sent out to kill super-terrorist Stavros, who is played by Mickey Rourke.  Quinn fails and is therefore sent sent to a place called \"The Colony\".  \"The Colony\" is a place where the world's most dangerous terrorists/agents are sent. These agents/terrorists are too dangerous to go free on the street and too valuable to kill.  Quinn escapes from the colony and goes after Stavroes for revenge.  Quinn is helped by Yaz, who is played by the basket-star Dennis Rodmann.  Double Team is full of well made action and martial-art scenes. However, it`s far from perfect.  The whole plot is very silly, there are huge logical gaps and holes in the story and Mickey Rourke is far from convincing as a villain. Double Team isn`t a film for everybody.  But it`s definetly worth to rent it for an action-fan. I give this movie 7 out of 10.","user":"action-6","rank":[17,21]},{"title":"Van Damme v. a Tiger!","rating":5,"date":"1 June 2005","review":"Continuing the tradition of successful Hong Kong directors going to Hollywood only to end up directing Jean-Claude Van Damme movies comes Tsui Hark with 'Double Team'. John Woo must have gotten lucky when he went to Hollywood: Ringo Lam is still making Van Damme movies, and Tsui Hark went back to Hong Kong after this and 'Knock Off'. I have nothing against Van Damme, but he seems to be some sort of trial-by-fire for any Hong Kong director with ambitions of making action films in Hollywood: If a director succeeds, he go on to Dolph Lundgren and then mainstream Hollywood action (John Woo), otherwise the director is faced with sticking with Van Damme movies or going back to Hong Kong.<br><br>Counter-terrorist Jack Quinn (Van Damme) is planning to retire after one final mission to nail the villainous Stavros (Mickey Rourke). The mission goes incredibly wrong: Stravos gets away, but somehow his son is killed in the cross-fire. Out for revenge, Stavros kidnaps the pregnant Kathryn Quinn (Natacha Lindinger), and the only way Jack can save is wife is team up with Yaz (Dennis Rodman) and kick-box his way to a happy ending.<br><br>Watching 'Double Team', I thought it was pretty clear than even Van Damme realizes that his movies are a joke to all but the most hardcore of action fans. Australian sketch comedy show 'Full Frontal' (featuring a not-so-famous Eric Bana) regularly took stabs at Van Damme for a good year or so (\"YOU LAUGHTER CRACKIN' AT ME? ARRRGGGHHHHH!\"), coincidentally around when 'Double Team' would have been released. At no point does 'Double Team' make any attempt to be taken as a serious action movie. All the fight scenes are played for laughs, if only slight chuckles. Van Damme gets to fight a tiger and use a coke-machine to shield himself from an explosion. All it really amounts to be is 90 minutes of action fun.<br><br>While fans of director Tsui Hark would be disappointed with this effort, something good came of Hark's short-lived collaborations with Van Damme: He went back to Hong Kong and directed the incredibly awesome 'Time and Tide' (which did not feature Jean-Claude Van Damme at all).<br><br>'Double Team' doesn't come to close to being one of Van Damme's best, and it might not even please hard-core Van Damme fans, but its all in good fun - 5/10","user":"AwesomeWolf","rank":[18,23]}]