[{"title":"The plot is... there is no plot","rating":7,"date":"7 December 2000","review":"This movie has no discernable \"plot\" except to follow the lives of some of the most interesting and quirky people you are liable to meet. You follow one person, you get a snapshot of their life and the movie then takes off on the life of a person that may just be walking by on the street. You get just enough to encapsulate where they are at in life right now. Most are going no where and this is the reason for the movies title. Great dialogue here and great stuff to get you thinking about the strangest things (Smurfs as Hindu propaganda???). Great movie if you will just give yourself over to it and release all expectations as far as what a movie is supposed to be.","user":"Schlockmeister","rank":[58,63]},{"title":"Original film, defining storylines","rating":10,"date":"30 January 2002","review":"The most interesting thing about Slacker is the way it was filmed. There is no real ONE storyline, until later in the film when viewers realize that one of the main premises is that everything that happens to someone in their day can have a effect on people they might not even know.<br><br>The film is split into 5-10 minute bits and pieces, as the camera moves from person to person. The first character we meet sees someone on the street and has a conversation with then, then the camera follows them for a while. Great stuff for those who suffer from Attention Deficit Disorder, which I think represents most of us age 30 and under.<br><br>It's a very original and thoughtful idea. Rather than develop one storyline, we get to see part of many peoples lives and how they all affect each other. There are some great moments of comedy, and tongue in cheek humor, as well as sadness. <br><br>Perhaps moreso than any other film, Slacker embodies what Generation X is/was all about. It is one of the great defining films of Generation-X, along with Trainspotting, Clerks, True Romance, and Reality Bites.","user":"matlock-6","rank":[46,50]},{"title":"Your tuition money at work","rating":7,"date":"12 September 2001","review":"Extreme boredom leads to fascination. Like sands in the hourglass so is this day in the lives of several bohemians living in Austin, TX in 1990. You'll either be bored to tears or fascinated to no end.<br><br>If you've ever been to Austin, or spent a sleepy summer in a college town like Lawrence, KS or Madison, WI, then you'll appreciate the parade of pseudo-intellectuals and good-natured conspiracy theorists that provide much of the grist for the script. These offbeat characters and wonderful dialogue make this film memorable. <br><br>Remember the traumatized yacht owner in the greasy-spoon diner or the older dude with the toupee from the coffee shop? 'We've been on Mars since the 50's', he says. I loved the loser with the TV strapped to his back and the older guy who found an armed robber in his house, only to take him for a stroll and a friendly chat (about Charles Whitman). I also enjoyed the menstrual-cycle stone garden and the fortune-telling hippie chick with the black eye who was having 'a breakthrough day'. Nearly every conspiracy theory in modern pop-culture is paid lip service during the film. That's a lot of sophistry and navel gazing to be sure!<br><br>Not every character is a gem. The Madonna pap-smear girl gets more annoying with every viewing. But I recommend this film for its originality and understated comedic themes. <br><br>Much has been made of the tangent approach to the story telling. I think the technique runs out of steam about three-quarters of the way into it. In other words, it's about 20 minutes too long. Still, it's a fun movie!","user":"fowlerjones","rank":[22,24]}]