[{"title":"If you're a fan of the actors, it's reasonable to say you'll find something to enjoy here.","rating":6,"date":"6 December 2005","review":"I only saw this film because of Kevin Bacon and Jennifer Aniston both being in it. Not a huge fan of either of them, but nevertheless I thought it might be interesting to see Aniston (during the peak of \"Friends'\" popularity) crossing over into mainstream film. For the most part, it works.<br><br>She's basically playing Rachel, her character from the TV show, again. Aniston's character is a shy, awkward business woman who isn't promoted due to the fact that she is considered \"unstable\" - no husband, family, etc. So she hires a fake boyfriend, Nick (Jay Mohr), to pose as her lover. She ends up winning the affections of a man she has a crush on in her office (Bacon), but then Nick begins to actually fall in love with her.<br><br>The title derives from the fact that she works at a picture agency, and that's where a lot of the film's scenes take place. It gets a little weary after a while, and is very predictable - but if you're a fan of the actors, it's reasonable to say you'll find something to enjoy here.","user":"MovieAddict2016","rank":[22,23]},{"title":"This is beyond charming - it has heart","rating":7,"date":"28 January 1999","review":"A seemingly small movie yet it's beyond charming, it has heart. Don't dismiss this as an expanded version of the TV series Jennifer is in, she's what she is, yet she fits into this story so well, playing opposite Jay Mohr and Kevin Bacon, with Ileanna Douglas as her best friend and Olympia Dukakis as her mom  it's Jennifer Aniston perfect.<br><br>The heart may not be evident in the beginning, especially with Jennifer's central character, but hang in there, heart becomes more and more ever present as you follow the story closely.  My appreciation for the nuances of this movie did not come deeper until I sat through it again on cable over the weekend. I remember I liked the movie in general and that Jay Mohr gave a very good performance  he's just as becoming as Jennifer is. They do seem like a perfect pair.<br><br>This could be a date movie: especially for a single young woman with career ambitions (here it is in advertising), who thinks she can be self-sufficient without any ties or warmth from others, including mom. It is very much a city woman movie. It is maybe for the 20 to 30 something's, yet there are lessons in loving that anyone can take away with. Essentially, it is about how we can take for granted the people around us and not realize the little things in life that are free and in abundance for us to receive and enjoy  if we would only open our eyes, pause - truly listen, and let the heart do the rest.<br><br>\nTrivia: There was a play on the movie title as it first appears and appears again. Ha! Have fun and enjoy.","user":"ruby_fff","rank":[29,32]},{"title":"A lovely, light romance. Aniston is terrific.","rating":4,"date":"4 January 2000","review":"There is quite a bit of divergence here with the Imdb comments for this movie, which may reflect where people's hearts were at when they viewed it. This is not a block buster or Academy Awards winner, but I found it to be very enjoyable and certainly agree with all of the positive comments below. Actually, I was surprised how I liked it, since I am a 50 year old man and do not normally care for 'fluff movies'. The acting by Jennifer Aniston and John Mohr was very good, and the film gives an overall positive message for us all (Hollywood style, but it feels great). Watch it with someone you love, or if you have a warm romantic heart.","user":"nz man","rank":[34,42]}]