[{"title":"Not as good as Psycho or Psycho II, but good enough.","rating":6,"date":"20 April 2000","review":"My father first rented this film in the summer of 1991. I was about ten years old when I watched it. I didn't understand most of it, but I liked it. I just re-watched it within the last few months as result of a sparked interest in both the movies and the books.<br><br>I liked how this film dove into Norman Bates's troubled past (that of course is an understatement). That was probably the best aspect of the film, not much else. I liked how Anthony Perkins once again reprised his signature role as Norman Bates after suffering that horrid humiliation from Psycho III. Olivia Hussey was wicked in this movie as Norman's mother. She must have taken lessons from Faye Dunaway in her role as Joan Crawford in Mommie Dearest. The way she yelled at him and stripped poor Norman of his manhood was just awful. But yet, she managed to stay human in certain scenes of the movie and not be such a demon. Henry Thomas did somewhat a good job playing Norman Bates as a teenager, but his performance lacked the geeky, child-like charm that Anthony Perkins had in the original film.<br><br>As for the rest of the actors, well, most of them aren't worth mentioning. Except for Thomas Schuster, who played Chet Rudolph, Norma Bates's midnight cowboy. His character was very cocky and rude, the kind of guy you love to hate. The kind of man mom would bring home and expect you to call dad, which in Norman's case was true. But that never came to pass, if you know the story line.<br><br>Director Mick Garris is no Alfred Hitchcock. He is no Richard Franklin either. But he does manage to deliver a good addition to the Psycho series. Not as good as Psycho or Psycho II, but good enough.","user":"Lionel M.","rank":[16,17]},{"title":"Surprisingly Enjoyable.","rating":30,"date":"30 September 1999","review":"After an onslaught of mass murder in PSYCHO III, Norman Bates is back....in a nice suburban home, with a lovely wife, and a new problem. He has to kill again.<br><br>Norman Bates, once again played excellently by the late, great and highly-talented Anthony Perkins, calls in to a radio talk-back show, where the topic of the night is matricide. Norman relives his past, and through these flashbacks we finally meet \"Mother\" -- played wonderfully by Olivia Hussey (man, she is SCARY!). <br><br>This film is a delightful surprise....there's not much bad to say about it. Henry Thomas captures \"young Norman Bates\" nicely, though I remember Norman Bates as being a bit more polite and friendly than portrayed here....but he still pulls off a good job as a mentally-abused and opressed psychopath in the makings. <br><br>Be aware, that this is not appropriate for anyone under the age of 15. No, it isn't \"shocking,\" but there are strong incestual undertones. They are necassary, however, because they give more valid reasons for Norman's descent into sick obsession, rather than \"He had a domineering mother,\" which we've all known for years. <br><br>PSYCHO IV has alot of character as a film, and is hard to forget. Perhaps the best sequel of the three.<br><br>Highly Recommended.","user":"SnacksForAll","rank":[32,37]},{"title":"A few interesting twists...","rating":6,"date":"1 August 2006","review":"If you liked the earlier sequels (with of course, the first one being inimitable) you may find this entertaining.<br><br>Tony Perkins seems deranged as ever, and there are some interesting conversations between him and CCH Pounder, (a radio shrink) as she tries to uncover what made Norman Bates the way he is...nature or nurture?... It may be genetic, but it could also have been his mother played by Olivia Hussey, a deranged woman who has an inappropriate relationship with her son.<br><br>Henry Thomas (\"E.T.\" and \"Beyond Obesession\", among others) is sad and affecting as the young Norman Bates, who tries to be a good son to his mother, until she realizes he has become a man, wherein she begins to flip out.<br><br>Overall, for die-hard fans of the \"Psycho\" sequels.","user":"MarieGabrielle","rank":[14,15]}]