[{"title":"Great cast in a decent movie","rating":7,"date":"12 April 2010","review":"I wasn't sure whether King Ralph would be my style, seeing how much the critics panned it. But when I watched it, I was surprised at how much I liked it. It is not perfect, but one of the worst films ever? No, far from it. It is enjoyable, despite the sometimes weak script, uneven direction and one or two parts that felt rather slow and contrived. What redeems it though is the cast. John Goodman amiably bumbles his way through his role and gives some charm into a character that could have been bland and uninteresting, and Peter O'Toole and John Hurt seem to be having a whale of a time as the adviser and scheming courtier. Also, the film does actually look nice, the cinematography is good and the scenery is lovely. The soundtrack and score were enjoyable as well. Overall, it has its problems, but it isn't a bad film by all means. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[15,16]},{"title":"Good fun","rating":8,"date":"3 September 2006","review":"This seems to get a panning from film reviewers here, but it actually is a good comedy. The story line is mildly stupid and a replay of the old fish-out-of-water formula, but the British were able to add a fantastic flavour to the film and the comedy is kept in check and doesn't become too outlandishly stupid.<br><br>Thumbs up in my view, but it's a little bit date these days. Superb supporting cast and a friendly film: nothing crude and from recollection, no bad language.<br><br>Goes to show that it can still be done if you really apply your mind to it!","user":"mattrochman","rank":[23,26]},{"title":"Predictable but Hilarious","rating":9,"date":"13 June 2004","review":"I confess that \"King Ralph\" is one of my favorite movies. Yes, the basic plot concept of the film has been done in MANY stories, both written and filmed, but the superb acting coupled with the not-so-subtle jabs at British Royalty push the plot right over the top. Never mind that John Goodman is brilliant (as usual), but the well-done and loosely-serious role of Peter O'Toole adds a much needed anchor to Mr. Goodman's highly-anticipated antics. The filming locations of the film as well provide a truly beautiful backdrop to the production, steeped strongly in tradition and British heritage. Two thumbs up for this light-hearted comedy that dares to poke at some of the more serious issues of royal responsibility and pressure.<br><br>Highly recommended for fun entertainment, I give \"King Ralph\" a 9 out of 10.","user":"yosef88","rank":[30,36]}]