[{"title":"Very entertaining. Why do reviewers always have to compare to the book?","rating":9,"date":"18 October 2010","review":"As usual, I am very glad I saw the movie BEFORE I read the reviews on this site. Why do soooo many reviewers here have to compare the movie to the book? A book allows 300-400 pages (or more) to develop plots and characters. We are reviewing movies on IMDb, not books. I guess reviewers here want to appear erudite by scraping up details from the book that get omitted or distorted on the screen. I am a very active reader, but I simply cannot read every book that makes it to the movie theatres. Writing a book (a fairly isolated event) is a significantly different event than producing a movie which involves countless people and issues: screenwriters, actors, writers, directors, production people, locations, etc., etc. Making all these book to movie comparisons isn't fair to the movie or the book. Many times I just want to watch a movie and judge it on its merits alone - as a movie, period. I did not read this book, but I watched the movie and found it very entertaining and extremely absorbing.","user":"readerguy","rank":[65,86]},{"title":"Totally ruined by some Hollywood dimwit changing the bad guys","rating":1,"date":"21 November 2014","review":"Well, if we start with the good. The story itself is not really too bad and if you forget the title, the mention of Tom Clancy and Jack Ryan, then the movie is decent enough. It is a reasonably well implemented thriller. Not great but worth seeing.<br><br>However, the book is about Arab terrorists performing terrorist acts by means of thermonuclear devices causing the two superpowers to come to the brink of a nuclear war. The movie has replaced this foe with some nonsense story about emerging neo-Nazis wanting to take over the world. This is just utter rubbish. It is obviously a political decision by some asshole not wanting to upset the Arab community so he picks a \"safe\" bad guy instead. The speech where the head Nazi compares themselves with a virus was just unintelligent writing and painful to watch.<br><br>Nazis are obvious bad guys and can be put to good use in movies, just as communists and Muslim terrorists and a whole bunch of other groups, but not when the original material uses another, much more logical, foe. The original foes in the book would have some force behind them in the radical Muslim community that made their plans for world takeover after the superpowers had annihilated each other at least somewhat plausible. If you ignore minor details like that there would really not be much to take over after a barrage of nuclear missiles from USA and Russian of course. But a few twisted old Nazis that sits in hiding in dark rooms cooking together this hair-brained scheme? No way! I am sad to say that whoever asshole that decided to rewrite the main adversary of this movie ruined it totally for me. I am really happy that I never watched it when it came out in the theaters but instead watched it, in a sense \"for free\", on my Netflix subscription.","user":"p-jonsson","rank":[35,48]},{"title":"Jack Ryan Saves the World!","rating":7,"date":"10 November 2002","review":"\"The Sum of All Fears\" is the latest film in the Jack Ryan series as written by Tom Clancy. In the previous films, Ryan was presented as a family man and played by Alex Baldwin and Harrison Ford. This time around we are asked to accept a Ryan who is 25 years younger (Ben Affleck), unmarried and a nerdy, wet behind the ears CIA historian. The age difference would have been more believable had the film been set in 1973, when the story begins, rather than the present.<br><br> Anyway, the story is about a disgruntled ex-Nazi, Dressler (Alan Bates) who acquires a nuclear device and plans to instigate a war between the USA and Russia and then take over when the super powers destroy each other. The new Russian President, Nemerov (Ciaran Hinds) is set up by Dressler to be blamed for a nuculear attack which wipes out a large part of Baltimore. U.S. President Fowler (James Cromwell) calls in the CIA headed by William Cabot (Morgan Freeman). <br><br> Cabot enlists the aide of historian Jack Ryan (Affleck) because Ryan has done a thorough study on Nemerov. Ryan believes the Russian to be innocent even though all around him believe him guilty. As each side prepares to launch their respective missles, Ryan and CIA Operative John Clark (Liev Schrieber) are busily gathering information and Ryan is racing against the clock to convince Fowler of Nemenov's innocence.<br><br> Affleck tries his best to make us forget Harrison Ford but to no avail. He simply cannot be taken seriously as the man who holds the world's fate in his hands. Freeman is excellent as always and Cromwell and Hinds stand out as the two world leaders. Bates makes a nasty villain and Schrieber is good as the mysterious man with a past, Clark. Bridget Moynahan appears as Affleck's love interest and future wife.<br><br> The real star of the picture are the special effects. The nuclear explosion is realistic and believable and the attack on the aircraft carrier is equally good.<br><br> I hope that in the next Jack Ryan movie, he is portrayed by someone who is at least old enough to shave.","user":"bsmith5552","rank":[69,102]}]