[{"title":"A small winner of a film all round.","rating":7,"date":"28 October 2008","review":"\"Passenger 57\" is one of the many films that followed in the wake of the action film that re invented the genre, 1988's \"Die Hard\" with Bruce Willis in the lead. When I first saw P57, rented on video in the mid nineties, I wasn't expecting a re-run of Die Hard, but i was pleasantly surprised at how enjoyable an action flick it was.<br><br>Wesley Snipes and Bruce Payne spark well off each other as the troubled hero and psychotic villain. They are given competent support by the rest of the cast, although one of my small complaints is how under utilised the other actors are. That said, Ernie Lively does a nice turn as the local police chief and Robert Hooks (father of director Kevin Hooks) is good as an FBI Agent.<br><br>Essentially, Passenger 57 is a solid little action movie which is well paced and has enough intriguing characters and good action scenes to keep you interested right through to the finale. The story is perhaps a little thin and the script could have used a bit more depth to develop the characters, but it's very enjoyable none the less.<br><br>Don't view this expecting a great movie, but if you have an hour and a half to kill this film is well worth a watch.","user":"RedRoadster","rank":[40,52]},{"title":"Good solid action flick. A must for Snipes fans.","rating":8,"date":"2 September 2004","review":"Passenger 57 is an enjoyable and rather underrated action film. Although there is not too much of a storyline, the slick action scenes combined with some very good performances from Wesley Snipes and Bruce Payne kept me entertained from start to finish.<br><br>While Passenger 57 offers nothing really new to the action genre, it does offer plenty of fast paced chaos and explosions and combined with some entertaining hand-to-hand combat skills by Snipes, it is certainly better than a lot of other standard action fares out there.<br><br>Snipes gives a very good performance as the lead and Bruce Payne is brilliant as the mentally unstable villain. The other cast are somewhat overshadowed by Snipes and Payne, but do an adequate enough job.<br><br>Overall I was very pleased by Passenger 57, so much so that it proudly belongs in my DVD collection. A very good choice for action fans and a must for Snipes fans. 8/10.<br><br>And don't forget....\"Always bet on black!\"","user":"Conan_The_Barbarian","rank":[67,95]},{"title":"Forgettable action film","rating":5,"date":"21 July 2009","review":"This isn't a bad film but it isn't exactly a great film either; Wesley Snipes does a good job as airline security expert John Cutter who is in the wrong place at the right time, Bruce Payne is okay as the psychotic terrorist and Alex Datcher is fairly forgettable as the feisty stewardess. For a thriller this is also lacking in any twists whatsoever. We are told who is bad and who is good almost as soon as their character appears.<br><br>The film opens with Charles Rane in an operating theatre awaiting plastic surgery, we know he is somewhat insane as he insists in having no anaesthetic. Before the operation can start the police move in and Rane attempts to escape but is eventually captured... now they just have to get him to Los Angeles for trial. Obviously the best way to transport one of the world's most wanting criminals across the US is to put him on a commercial flight with a couple of marshals. Of course Rane's people are on the plane amongst both passengers and crew and shortly after take off they seize the plane. Luckily they hadn't counted on John Cutter the airline's new security expert being on board.<br><br>He manages to call the airline and alert them about the hijacking before being briefly captured. He escapes his captors then flees to the plane's storage area where he accesses the avionics bay and forces the plane to dump fuel. This necessitates landing at a small airfield in Louisiana where Cutter jumps from the plane and is promptly detained by the local police who are stereotypical incompetent Southern yokels. While the plane is on the ground Rane and some of his associates get off the plane and flee to a local fair ground where after a bit more fighting he is captured again. That isn't the end though as his people still on the plane threaten to kill more hostages if he isn't freed. Once back on the plane Cutter confronts Rane one last time with the inevitable results on expects from this sort of film.<br><br>This isn't a film I'd go out of my way to see but it is okay if you have eighty minutes to kill and want some fairly mindless action. I wouldn't advise buying it unless you are a fan of cheesy action flicks or of Wesley Snipes.","user":"Tweekums","rank":[19,27]}]