[{"title":"Rethinking the art of the camera","rating":9,"date":"21 May 1999","review":"I was fortunate to see Maborosi on a large screen at the Joslyn Art Museum. The venue was appropriate, for this film stands as one of the great achievements of the cinema.  Indeed, I will go out on a long limb and argue that it deserves comparison to Carl Theodor Dreyer's Passion of St. Joan of Arc.  Light, shadow, angle:  in my experience these two films apply the most basic elements of cinematography in a most remarkable and brilliant fashion.<br><br>Maborosi opens with an astonishing shot, as the viewer looks up from one end of an arching bridge to see a young child following an old woman.  The shot is meticulously framed by light posts, giving the impression of a picture on canvas.  The camera remains still while the two actors proceed through the scene.  The director's brilliant eye for placing everything \"just right\" immediately catches one's attention.  It is a virtuoso shot;  and then one's amazement grows as scene after scene continues with no drop off in the careful, artful composition of each image.  After awhile, the viewer may become conscious of the camera:  it does not move.  As each scene commences, the activity occurs within a new, steady frame.  I think that the camera moves during a scene only three times in the film, and then only in side-to-side pans.  However, I was so enthralled with the film I may easily have overlooked some motion.<br><br>The story, concerning a young women's travail in overcoming the grief of her suicided husband, plays out quietly and slowly.  The actors speak sparingly, and emotions are primarily portrayed through facial and bodily expression. The impact is large and plumbs depths.  If a film like this were made in Hollywood--an utterly absurd idea--I'm sure the characters would be babbling on at each other.  Maborosi explores the virtues of silence, patience, and careful attention:  behaviors which are not widely cultivated in contemporary cinema, or in contemporary society for that matter.<br><br>Maborosi is a film to captivate those who want to see cinema which strives to be more than mere entertainment.  It is in every sense an \"art film,\" but in my mind it stands as one of those very rare films which emphasize the artful without a hint of the self-conscious and annoying artsy.  A monumental achievement.","user":"jtshaw","rank":[53,56]},{"title":"Maborosi","rating":25,"date":"25 May 2005","review":"The title of the film comes from a Japanese word that loosely translates into \"illusory light\". A maborosi is an inexplicable mirage that sporadically unveils itself along the waves of the sea, leading many curious sailors to their impending doom. Nobody questions where this mysterious light originates from; nobody wonders why so many men are lured by the maborosi's false promises of otherworldly beauty. The answers are patently unexplainable, leaving no feasible alternative but submissive acceptance and temperate remembrance. There are many aspects of this world whose origins are rationally indecipherable; perpetual mysteries as perplexing as the shifting of the tides or the changing of the seasons, the rising of the sun or the positioning of the stars, the birth of a son or the death of a father. The lesson of the maborosi is quite comforting in its reductive simplicity; there are some tragedies in life that cannot be readily understood or accounted for, but these setbacks should always be treated with a tacit acceptance of the unalterable past, and an unbroken willingness to overcome.<br><br>Yumiko is confronted with such a confounding loss following the unanticipated death of her husband, Ikuo, an otherwise cheerful individual occasionally prone to brief interludes of somberness and incredulity. As the film opens, we are shown passing indicators of the memories that will continue to haunt Yumiko long after her husband has departed: the stolen bicycle that the couple re-painted together, the intrusively endless loop of train-tracks that entangle the neighborhood, the dark empty hallways of a home encompassed by unfulfilled hopes and abandoned promises. These are the lingering images of a time long since passed, but never forgotten; the remaining links to a previous era divided by enigmatic fate, replacing the comforts of life's certainties with an encircling string of unanswerable inquiries. As Yumiko struggles to combat her own doubts and insecurities, her regrets and reservations, she is forced to reconcile the unaccountable cause for her grief with the prospect of an eventual regeneration of love and companionship. While Yumiko cannot escape from the memories of her past, she can still find hope in embracing an unforeseen direction, discovering solace and comfort in the arms of another man. But even the blissful serenity of the ocean's archaic blue cannot remove the painful memorials from the deepest recesses of Yumiko's imagination. The crashing of the offshore waves does not represent the progressive cleansing of the past, but the uninterrupted calamity of the storm, suggesting that Yumiko's thoughts are just as violently conflicted as the impartial forces of her surroundings.<br><br>Yumiko's struggle to assimilate her ways into an unfamiliar terrain is further compounded by the insolvable puzzle echoing throughout the barren corners of her new home, reverberating off the timeless waves of the indifferent sea. In spite of this continuous anxiety, there are many fleeting moments that would indicate a sense of personal advancement: images of a family finding comfort in each other's tragedy, reciprocally seeking to forge new identities out of an identical past. Some of the film's most memorable scenes occur with Yumiko's new found source of compassion, as Koreeda primarily focuses on the more joyful, celebratory moments of a strengthening bond between intimate strangers. However, a return visit to the city of Osaka brings back a flood of painful reminders, returning Yumiko to her previous state of inescapable depression. The journey further complicates the delicate situation unfolding within the confounding confines of her deepening psychological turmoil, exacerbating the tensity of her gradual acclimatization. Yumiko's inability to fully commit herself to her second husband is a direct consequence of her inability to comprehend the destabilizing effects of her innermost fixation; a persistent uncertainty concerning the nature of death, and a refusal to receptively acknowledge that which we cannot control.<br><br>Koreeda's transcendent depiction of the esoteric natural beauty of Yumiko's rural environment is a calculated effort to further reinforce the principle message of the film, which is simply the message of the maborosi. Why does Yumiko's husband selfishly succumb to the unfathomable temptations of the mystic light beyond the horizon? Why does the maborosi indiscriminately engulf the souls of its unwarranted victims? These are questions without answers, frustratingly enlightening reminders of the limits of our mortality, and the fragility of our most basic human certainties. The point of the film, however, is not to mock or ridicule our rational sensibilities, nor does Koreeda intend to paint an exceedingly bleak portrait of untenable despair and incomprehensible misfortune. Rather, the lesson of the maborosi is an alleviating reaffirmation of hope and anticipation, providing an acceptable resolution to an inconclusive affliction, dispensing clues to the solution of one of life's greatest riddles. The maborosi fable teaches us that closure cannot begin without acceptance, and that acceptance is ultimately earned through procession.","user":"wshelley","rank":[40,44]},{"title":"Cinematic EYE CANDY","rating":9,"date":"22 June 2002","review":"I don't think I have ever witnessed a film, in which the cinematography was so outstanding that it really was the star of the picture.  This film, about a Japanese woman who remaries and moves to a small fishing village after her last husband comits suicide is less about the story but more about its surroundings.  Scenes are mostly taken and shot from a distance with little camera movement, in a way they become living paintings.  Blues, reds, and greens come in to accent shots,  moving vehicles enter to give splash of colour and brilliant contrast. The actors are distant.  I couldn't take my eyes let alone blink for the fear of missing something amazing.  The simple act of a child throwing a pink ball, to the sunlit rooms that get illuminated, to blue paint in fishing boats it all had me engrossed.  I found myself more as a participant in a museum gallery of high art than being engaged in a plot or story not that there isn't one or that it was bad.  I have never witnessed a film like this and even found that just the scenes themselves and the background of story brought so much emotion out of me.   <br><br>A remarkable piece of cinema<br><br>Rating 9 out of 10","user":"smakawhat","rank":[27,29]}]