[{"title":"An excellent legal thriller. One of Tom Cruise's best performances.","rating":9,"date":"14 March 2001","review":"In The Firm, Tom Cruise plays an extremely intelligent young lawyer who takes a job with a tremendous firm, having been seduced by their huge financial offerings. \"The Firm\" begins to sound very creepy very early in the film, when it becomes known that `the firm' has never had a divorce, `the firm' encourages children,' `the firm' is a big, happy, 41 member family. Unfortunately, it seems that another interesting little side note is that no one has ever left `the firm' and lived. <br><br>Mitch McDeere (Cruise) is hired by `the firm,' and at first, everything is great. The firm loves him enough to pay back all of his student loans all at once, and he is completely taken in by everything, even down to the way that the firm furnished his new house, in his beautiful new neighborhood (`To make you feel at home. Hope you don't mind.'). The lives of Mitch and his wife Abby (Jeanne Triplehorn) are completely and drastically changed when he is hired by the firm, setting up a disorienting atmosphere, especially when strange things start happening, people getting killed by boat bombs and whatnot. <br><br>Gary Busey plays a small, seedy role, and it works really well because he's best at playing seedy characters. Ed Harris also delivers a good performance as an FBI agent trying to coerce McDeere into helping them investigate the big bad firm. It seems that McDeere has been helping the firm in its illegal activities, making him guilty without him even knowing about it. If he doesn't help the FBI, he'll go to jail with the other 40 members of that big, happy family. <br><br>The Firm really gets going once McDeere starts trying to investigate, making copies of incriminating files, etc. Some things may have gone a little too far, like the conveniently placed pillow truck, but as a whole, The Firm is a great thriller. It may not be quite as good as other John Grisham adaptations, The Rainmaker, in particular, but The Firm's complex and fascinating plot, as well as good direction and acting, makes it way above average.","user":"Anonymous_Maxine","rank":[104,120]},{"title":"Joining a law firm from hell can be detrimental to your health...","rating":5,"date":"5 May 2001","review":"All the elements to make a hard-hitting melodrama of corruption (with FBI and Mafia aspects present) are unfolded here in a gripping yarn from John Grisham's novel. Tom Cruise is excellent as a young man who joins a small but prosperous law firm, only to discover that all the perks he enjoys come at great expense to his integrity, not to mention his life. The plot thickens when members of the firm are murdered and Cruise gets drawn into the unmasking of the firm, risking his life to reveal the criminals. Gene Hackman, Ed Harris, Holly Hunter and Hal Holbrook all give strong performances, with Hunter fully deserving her Oscar nomination. The pacing is good despite the film's length (well over 2 1/2 hrs.) and there's seldom a dull moment. Especially gripping is the supercharged climax.<br><br>\nNot having read the book, I see where others are disappointed with the ending. Having no comparison to make, I can only say that it kept me absorbed until the final scene. Definitely a must-see if you enjoy action thrillers with a climactic punch. One of the best films of the '90s, full of suspenseful twists and turns.","user":"Doylenf","rank":[51,57]},{"title":"Better than the book! (*and possible spolier!*)","rating":10,"date":"31 May 2001","review":"I read \"The Firm\" after watching it, not knowing what expect (I didn't know if it would be a tight or loose adaptation). It was pretty close, with the difference mainly lying in the ending, and that where Sydney Pollack makes this story go from good to great: The book, at the end, makes Mitch out to be a coward and a traitor at the end, by making him give into the FBI. But, in the film, Mitch is seen as a hero who doesn't give into anyone. The FBI doesn't win and the Mafia doesn't win. Mitch wins. He bows down to no one. Tom Cruise also plays a *great* Mitch McDeere, with a lot of intensity and charisma. You cheer for him as the protagonist. Holly Hunter is top-notch with her portrayal of the vulnerable, secretary turned accomplice Tammy. Gene Hackman is also great as Avery Tolar, the one bad guy who sympathizes with Mitch and Abby. Such a great screen presence. His scenes while they're in the Kaymen Islands are key ones to watch. Jeanne Tripplehorn finally makes up for her role in \"Basic Instinct\" as Abby McDeere, the \"cheated wife\", not only by her husband, but also by the firm he works for. Sydney Pollack showcases some of his best work as director, especially by the opening segment that describes Mitch McDeere perfectly in the span of less than 10 minutes. <br><br>Such a GREAT adaptation, and a even better film to watch!","user":"smee3469","rank":[48,55]}]