[{"title":"Who will be the Lord Of The Ring?","rating":20,"date":"20 May 2004","review":"Generally speaking, I agree with the masses on the IMDb but in this case I must protest. This movie deserves a much higher rating than a 5. I would personally give it a 7. After viewing several mundane comedies, I found \"What's the Worst That Could Happen?\" to be refreshing. A quick summary of the plot: Kevin Caffrey (Martin Lawrence) attempts to burglarize billionaire Max Fairbanks' (Danny Divito) home. Max turns out to be in the house and holds Kevin at gunpoint until the police arrive. He then tells the cops that the ring on Kevin's hand belongs to him and the cops force Kevin to cough it up. The problem is that Kevin's new girlfriend had just given it to him. The rest of the movie deals with Kevin trying to get the ring back. Danny DeVito is hilarious and this is my favorite Martin Lawrence movie yet.<br><br>The plot is original and I thought the supporting actors were great. I would have given William Fichtner a bit more of a roll. He really had little to do with the plot yet I found his portrayal of gay Detective Alex Tardio to be one of the funniest parts of the movie. I read the book and will admit that the book's ending is a bit more satisfying but not a major issue. I have never seen a group of criminals and scoundrels more likable than the group in the movie. Everyone in the movie; the thief, the rich guy, the politicians, the judges and everyone in the periphery seems to be morally depraved. I guess that is what makes this movie so funny. If you enjoyed \"Blue Streak\" then you're going to love \"What's the Worst That Could Happen?\".","user":"jimbo700","rank":[26,29]},{"title":"Simple, good fun","rating":9,"date":"3 June 2001","review":"I read Donald E. Westlake's novel \"What's The Worst That Could Happen?\" prior to seeing the new movie. This is something I think moviegoers should do, read the book and go to see the movie to compare and contrast. The book is full of rich, comical characters as is the movie, but there are differences.<br><br>The film stars Martin Lawrence as Kevin Caffery, a suave, intelligent thief who often cases art auctions for new prizes to steal. However his partner named Berger (John Leguizamo) lets him in a score at a mansion owned by Max Fairbanks, a wealthy businessman (Danny DeVito) who is going bankrupt. The two thieves break in the house and DeVito catches Lawrence and steals his prized ring his girlfriend gave him. He is then bent on revenge and out to get it back.<br><br>\nThe plot is basic and works well and the film is smart, funny and actually even silly. Most \"silly movies\" get trashed and aren't given credit for trying to make us laugh a bit. \"What's The Worst That Can Happen\" has a good amount of intelligence to it but also has a good amount of summer movie silliness and it fits and works in a comedy that is well made and very entertaining.<br><br>Give it chance and it might work for you.<br><br>Costars Glenne Headly, Nora Dunn, Bernie Mac, William Fichtner, Richard Schiff, Larry Miller and Ana Gasteyer.","user":"conjunctionfilms","rank":[13,14]},{"title":"It's just plain funny !","rating":6,"date":"4 June 2001","review":"Just the name Martin Lawrence kind of makes me laugh, and this movie with Danny DeVito will give you several good belly laughs. Plain and simple, the formula for a good comedy is not all that complex, as this film clearly shows. There's no gross-out humor, or excessive vulgar language needed to make this movie a fun couple of hours. I also genuinely liked John Leguizamo's character throughout the movie. All in all this movie is a barrel of laughs from start to finish.","user":"MovieDave","rank":[14,17]}]