[{"title":"Better than I was expecting","rating":23,"date":"23 June 2003","review":"I saw this film recently on cable and found myself more intrigued by it than I thought I would be.  I hadn't heard anything about this movie so I really didn't know what to expect.  It ended up being much better than I expected and, while not a great film, it is certainly one I wouldn't mind watching again.  I recognized the elements of \"Treasure of Sierra Madre\" without having any information about the film.  I've since learned that it was indeed echoing Huston's film.<br><br>I had no problem with the actors and actually found some of the conflicts on both sides interesting.  Even some of the \"bad guys\" were struggling to deal with decisions they didn't necessarily agree with.  I didn't really see the characters as all bad or all good. Each had their own demons that they brought with them and they were all susceptible to the lure of gold.","user":"ateelah","rank":[20,22]},{"title":"Not Walter Hill's best work but still a very effective and tense thriller.","rating":16,"date":"16 June 2004","review":"Looking at the cover of 'Trespass' it would be easy to overlook it on the shelves, thinking it was just another one of hundreds of generic action movies that clog up the video store shelves. I know I did for quite some time. Bill Paxton and William Sadler are dependable character actors but seeing the pictures of both Ice-T and Ice Cube hardly inspires confidence. As rappers they are without doubt very talented, but apart from Cube's surprisingly good performance in 'Three Kings', neither has impressed me as an actor. In fact having Ice-T in the cast of a movie is invariably a sign that it sucks big time. No disrespect intended to T, but he seems to have made some lousy career choices when it comes to motion pictures ('Tank Girl', 'Mean Guns', 'Below Utopia', 'The Alternate',etc.etc.) closer inspection however reveals that 'Trespass' is directed by Walter Hill. That's Walter 'The Driver', 'The Warriors', 'The Long Riders' Hill. Even more interesting is the fact that the script is by Bob Gale and Robert Zemeckis of 'Back To The Future' fame. Well I'm glad I finally gave this movie a shot, because while it isn't one of Hill's best, it's a very effective and tense thriller. It's a siege thriller, and I love that style when it's done well e.g. 'Straw Dogs', 'Assault On Precinct 13'. Paxton and Sadler play firefighting buddies who come in possession of a map which reveals hidden treasure, looted from a church fifty years earlier. When they journey to an abandoned factory to find it they witness a murder and find themselves trapped. Outside is gangsta King James (Ice-T) and his gang, including hotheaded Savon (Ice Cube), and inside they have James' junkie \"brother\" Lucky (De'Voreaux White) as a hostage, and an old homeless man Bradlee (Art Evans). Okay, I'll admit that there's not much new here (the movie is deliberately modeled on John Huston's classic 'The Treasure Of The Sierra Madre'), but the acting is above average, especially from Sadler, a most underrated actor, and Hill manages to sustain the suspense right until the very end. Definitely worth a look.","user":"Infofreak","rank":[15,16]},{"title":"A tense, well-crafted action film","rating":10,"date":"26 September 1998","review":"A bizarre mix of creative talents went in to making this movie. Not the kind of thing that happens too often these days. A script from Robert Zemeckis and Bob Gale, direction by Walter Hill and his usual gang (strong editing from Freeman Davies, cool photography from Lloyd Ahern and score by Ry Cooder), Bill Paxton and William Sadler as the 'heroes' and Ice T and Ice Cube as the bad guys. It makes for a truly original movie.<br><br>Much like Judgment Night, Trespass is about two worlds colliding after bystanders witness a gangland execution. Two firemen on a treasure hunt in a huge, long abandoned East St. Louis factory. This happens to be the same territory as King James (Ice T) and his cohorts. They off some unwise punk by chucking him thru the glass roof and are pretty mortified upon discovering Bill Paxton and William Sadler are watching them. Ice T's crippled brother is taken hostage by Sadler and they seal themselves in old apartment. Several other bad guys show up and totally box them in.<br><br>What follows is a succession of stand-offs and shoot outs as Paxton and Sadler fight among themselves, T and Cube argue over who should be running the show, loyalties are challenged and each group begins to split into different factions. Stuck in the crossfire is poor old Bradlee, the innocent hobo caught in the middle as his apartment is besieged.<br><br>There are no clear-cut 'good guys' and 'bad guys' in Trespass. Just a bunch of guys who all came to the wrong place at the wrong time.<br><br>Originally called 'Looters' and scheduled for release during Summer 1992 the release date was changed to Winter and the title changed to 'Trespass'. Why? The LA riots were happening and Universal felt that there was enough racial tension in the media already. While I agree there is deliberate racism in this film it's nowhere near as bad as the morbidly extreme racism in such recent movies like Bad Boys II.<br><br>This new release by Universal is much better than the pathetic (and now OOP) release by Goodtimes. Gone is the snapper case. In its place is a sturdy keepcase and a nice bundle of extras. First of all there are some deleted scenes, a Behind the Scenes of Trespass featurette, the Ice-T/Ice Cube Trespass music video (it's the highly censored 'radio' edit) and a trailer. It is presented in 1.85:1 anamorphic widescreen with Dolby 2.0 sound.<br><br>You should definitely get this as it's not the standard of film Hollywood studios produce these days. IE made by talented people.","user":"CuriosityKilledShawn","rank":[37,44]}]