[{"title":"Good job all around","rating":7,"date":"19 August 2000","review":"I admit I have a weakness for alternate history stories, from ITS A WONDERFUL LIFE to GROUNDHOG DAY to 12:01. Among those greats is this little gem. It's pretty difficult to get through MR. DESTINY without giving a nod of appreciation to each and every cast member, from the goodhearted James Belushi to the murderous Courtney Cox. This movie lacks the gravitas and scale to make it a great film, but it's a fine cheer-up on a rainy afternoon. It's also a great rental for an inexpensive date.","user":"Uthman","rank":[22,24]},{"title":"Life is definitely worth living!:)","rating":23,"date":"23 February 2001","review":"Living the part of your life you wished were better is something that many of us have wished we could do, but for Larry Burrows, it becomes reality in \"Mr. Destiny.\"<br><br>Jim Belushi definitely played his best part in this well-done film about second chances.  The character of Larry Burrows is believable and is like many blue-collar workers in America.  Burrows is the kind of person that lets everyone go ahead of him, with out trying to get ahead himself.<br><br>The chemistry between Belushi and Linda Hamilton as Ellen is very charming, something that many loving couples have.  Michael Caine was also superb as Mike, who actually creeped me out the first time I saw this, which was at least 10 years ago.  It was amazing to see how contrasted his normal life was as opposed to his \"rich life.\"  People liked him in his ordinary life, but he was feared and despised in his \"rich life.\"<br><br>In my opinion, this film teaches a very important lesson: Life is what you make of it, and one should be thankful of what they have, and what helped them get there.  Destiny is what shapes us, and good things will definitely come our way.<br><br>RATING: ****1/2 out of 5.  Excellent!:)","user":"AllisonLVenezio","rank":[19,21]},{"title":"What a cute little movie !","rating":20,"date":"20 September 1999","review":"I just watched this movie yesterday on cable, and i really enjoyed it. Ok, it´s not the greatest movie ever, but i would recommend this movie to everyone who wants to see a simple movie, wich in the end makes us think, even if it is for a little while. Everyone has thought even once what if we hadn´t choosed a particular path in our lives, and this is what this movie is about. About the \"IF\" and about what might have happened. This is a story about a guy, who thought a bad event from his teen years, had ruined is entire life, then he is sent by some spiritual entity to a parallel universe in which that bad thing never happened and he gets to experience first hand what would have happened in his life, if his life had followed this other path. After this he learns that, there are good and bad moments in every ones lives independent of what lifes we live.<br><br>And so we have a very good movie. This is one of those movies, that we watch, and quickly forgget, but sometimes when somebody mentions it, we imediatly recall all the details. It is one of those movies that we always remember even if it is from time to time.<br><br>Another peculiar thing is MR.DESTINY is filled with familiar faces in every corner. From James Beluchi and Linda Hamilton to Michael Cane ,and we can spend the whole movie recognizing actors, wich is also fun.<br><br>So i don´t have much more to say, except that i really recomend this movie.<br><br>Very simple, but very good and very cute too. It realy puts a smile on our face by the end of it. So watch it, and be happy.","user":"Alcaminhante","rank":[17,19]}]