[{"title":"Spaced Out Fun!","rating":8,"date":"24 August 2003","review":"After mistaking a Halloween re-broadcast of Orson Welles' classic radio adaptation of WAR OF THE WORLDS for a real Martian invasion, a group of moronic Martians shows up on Earth looking to conquer only their plans go awry as they find themselves truly out of their element and in reality all alone.<br><br>This really is often quite good and funny, with some decent lines (just check the memorable quotes) to boot. It will most likely appeal to Sci-Fi fans. This has passed the test of time for me as seeing it again recently it proved much better than I expected it to be. Despite a cast made up of no-name stars, this may just be the funniest Martian invasion ever put to film. Interestingly enough, the Martians themselves seem to represent almost every classic Action Hero/Sci-Fi Hero stereotype there is (cool 50s teen, fighter pilot, fearless astronaut, brave soldier and kooky scientist). Fun for the whole family. <br><br>\"Prepare to DIE! Earth Scum!\"","user":"Space_Mafune","rank":[33,37]},{"title":"Just what is so bad about this movie?","rating":11,"date":"11 December 2001","review":"I first saw this movie in 1990 when it first came out on video.  I agree that it is total nonsense, but it is also one of the funniest movies that I have ever seen.  The very idea that a group of \"advanced aliens\" would be running for thier lives from a bunch of country hicks is totally side-spliting. Why do all science fiction movies have to be about murderous beings? This group of Imperial Martian Atomic Navy misfits reminds me of some of the idiots that I knew in the army!  No wonder they were left on asteroid patrol while the rest of the fleet went to war.  Leave this movie alone.  We need more like it.","user":"boomryoung","rank":[34,39]},{"title":"A little delight...","rating":10,"date":"24 October 2000","review":"Normally the best way to annoy me in a film is to include some reference to Orson Welles. But here is a sci-fi comedy quoting the War of the Worlds broadcast.... and it is gold! The very concept of a small bunch of diminutive,aggressive and stupid aliens being mistaken as kids in Halloween dress is magnificent. Don't be fooled by the notion that because it seems like a kids' movie it is unsophisticated - it isn't, there's a lot of hidden treasure...  A gem!","user":"Balthazar-5","rank":[10,10]}]