[{"title":"A Dissenting Voice (possible spoilers)","rating":5,"date":"13 June 2002","review":"Yup... I guess I WAS right. I MUST be the only person in this entire country who absolutely enjoyed this film. Yes, it wasn't as good as the original TV show, but name one remake that HAS been?..... Anyone?..... I didn't think so.<br><br>However, if you compare this movie to an episode of the show, you'll see that the formula was fairly well preserved. McHale seemed very in character to me, as did Binghampton. And I have a little theory that says that if an actor/actress from the original show agrees to have a role in the remake, then they have approved of it.<br><br>So, I'm not about to argue with Mr. Borgnine, although I have no reason to anyway. I thought Dean Stockwell as Capt. Binghampton was absolutely hilarious, and I think he did an imitation of his voice very well. This movie made me a fan of David Alan Grier--he was brilliant in this movie.<br><br>Yes, the movie was cheesy, corny, and whatever synonyms you can think of. But it was funny and every time I want a good laugh, this is the first movie I pop into the VCR.","user":"tina_als_girl","rank":[16,20]},{"title":"stop over analyzing","rating":8,"date":"4 January 2009","review":"The acting isn't the best and the story line is pretty stupid but it's a fun movie. Don't over analyze it because it's supposed to be a funny and retarded movie. <br><br>Why else would Tom Arnold be in it? lol <br><br>If you are a serious or uptight person who only appreciates high budget awarded winning films than don't bother watching it. On the other hand, if you are like me and enjoy watching all types of movies from low budget yet entertaining disasters to box office hits than you would probably enjoy this movie.<br><br>I love Tim Curry as Vladikov. He is a great actor and always does extremely funny roles.<br><br>I love this movie.It was extremely cheesy but it is so entertaining. When ever I want a good laugh this is one of the films I watch.","user":"movEjunkE","rank":[15,19]},{"title":"Better than I thought","rating":29,"date":"29 March 2003","review":"I just caught this movie on Encore.  I'd never had much interest in seeing it based on the negative comments that have been made about it.  It was much better than I (and a lot of other people) gave it credit for being.  I came to the IMDB site because the credits went by too fast and I wanted to check some of the actors.  I was surprised to find that so many people really disliked this film.  First of all, I'd like to point out that the original show was fantasy.  C'mon--does anyone really think that the series represented what it was like in the South Pacific during the Second World War?  It also doesn't give you much of a starting point except the characters and their interactions.  With apologies to Tim Conway, Joe Flynn, et. al., the original series had only one star--Ernest Borgnine.  It was called McHale's Navy for a reason.  So it's fitting that Tom Arnold should be the focus of the movie.  I think they did keep to the spirit of the original series and, where these comments started, the movie was just as much a fantasy as the series was.  In terms of the plot, it too kept with the spirit of the original series.  For those of you looking for plot depth or profound characters missed the point of both the series and the movie. It was supposed to be entertainment, escapism, with a mild segue into reality.  If you want something profound, watch Schindler's List or something by Kurasawa, or anything Shakespeare by Brannagh.  But don't ask me to eat the same thing for dinner each night--I'll get tired of it and I'll yearn for cotton candy.  Movies of this type are called \"guilty pleasures.\"  They're supposed to be fun.  Having said that, one man's fun is another man's Bergman.  This movie isn't going to be everyone's cup of tea but it isn't a bad movie.  Just take it for what it is--a little bit of fun, a little bit of fantasy.","user":"sboyer@sbcglobal.net","rank":[19,25]}]