[{"title":"Oldman is the Best Dracula Ever!","rating":10,"date":"14 February 2005","review":"This is the best rendition of Dracula ever captured on film. Gary Oldman's dark and sensual personae outshines any other vampire who ever dare put on a cape. To me Gary Oldman is the most talented and underrated actor ever. He becomes who he is playing, however in this role... Dracula became him... Oldman set the bar so high it is untouchable even to Bela Lugosi. Winona Ryder's delicateness suited the role of Mina/Elisabeta nicely and Keanu Reeves played the unsuspecting and naive Jonathan with satisfaction. However the whole movie comes together because of Gary Oldman's intoxicating essence. He draws the viewers into his darkness and passion and guides them through until the end. This film is drastically romantic and hauntingly captivating- just like a real Dracula movie should be. The cinematography deserved Oldman's phenomenal performance and perfectly created a true vampire realm. Francis Ford Coppola is brilliant. This is the spirit of the vampire.","user":"Moonlyn","rank":[350,464]},{"title":"Visually striking, but Coppola's storytelling eccentricities are ill suited for the story itself","rating":7,"date":"18 October 2005","review":"\"Apocalypse Now\" worked due to its hazy, surreal vision of a hellish world. Coppola returned thirteen years later and created a similarly haunting and poetic so-called \"masterpiece,\" a supposed truthful adaptation of Bram Stoker's Dracula tale - when, in fact, the truth is that this movie is no more faithful to Stoker than the (superior) Universal Pictures original.<br><br>The hazy film-making is visually satisfying, and some of the special effects are - simply put - amazing. Coppola's backlighting and use of shadows is creative and unique. But, unfortunately, after a while his emphasis on style over content begins to eat away at the film's other strengths - the relationship between the heroine (Winona Ryder) and Dracula (Gary Oldman) is weak. Many story links are completely nonsensical and people appear and disappear at whimsy. The heroine's fiancée (Keanu Reeves) writes to her from Transylvania, asking her to depart at once to marry him; in a matter of one or two scenes she has suddenly traveled a vast distance and is standing at the alter prepared to wed. It seems like Coppola loses a grip on his characters and plotting very early on.<br><br>Oldman gives a chilling performance but isn't given very much to do, because he's set aside and the special effects take over. The opening scenes of his battle and his motivation to become the King of the Undead is very enthralling - if Coppola had maintained this mixture of style and content the movie would have been far better.<br><br>The casting of the weak Keanu Reeves and Winona Ryder in leading roles harms the impact of the film as well. Reeves sounds like a Californian pothead imitating a Brit; Ryder treats the material as if it is a dramatic, over-the-top theatre rendition; every line she speaks is sickeningly cheesy.<br><br>Anthony Hopkins turns in a disappointing performance as the utterly forgettable Van Helsing, who is given very little to do in this particular film apart from show up when convenient and sprout fancy little one-liners, most of them dramatic closers to scenes (e.g. \"We are dealing with a demon!\", then a cut-away to another scene.) Overall, \"Dracula\" is a good film and is worth seeing for its visuals alone. It is not, however, the strongest adaptation of Bram Stoker's novel; given the hype surrounding its release in 1992, the completed effort is rather lackluster in the story department.","user":"MovieAddict2016","rank":[59,76]},{"title":"Stunning","rating":9,"date":"16 November 2017","review":"First of all, sorry for my English: I'm Italian and I don't know if I am able to express not in my language my thoughts with the proper terms. Anyway, I loved this movie, even if I agree that the title should have been F.F.Coppola's Dracula. In fact it is a very personal read of the original script. So, I can understand, but not agree, with all critics about important differences to Bram Stoker's masterpiece. It's a movie you can love or hate, there is no midway, as all comments prove. Personally, I loved the way Coppola reviewed the classic tale, giving Dracula a reason to be what he became after the loss of his wife e to search in England the reincarnation of his lost love. Gary Oldman is absolutely fantastic, lavish, romantic,chilling, in particular as he plays an old Dracula in the beginning of the movie. Definitely the best character of his career until now (let's see how he portrays Churchill in the Darkest Hour). Winona Ryder is so sweet and adorable that I forgive the fact she hasn't been the best choice to play Mina. The other actors (except for Keanu Reeves, completely outcast and unable to act) are all good choices. The music is wonderful, as cinematography, art/set direction, make up and costumes (who cares if Dracula wears John Lennon style sunglasses...). This Dracula is seductive as no other movies ever showed and as no other actor was able to portrait the dark prince. By the way, the choice of Keanu Reeves and some screenplay bad errors and holes don't allow to give a 10. But at the same time I can understand it's not a movie for all tastes. As I already written, you can love or hate it.","user":"gianlucabertani-77095","rank":[26,32]}]