[{"title":"A \"love it or hate it\" type of flick","rating":9,"date":"28 June 2005","review":"Bound By Honor (BBH) is not meant to legitimize or glorify gang life, or ennoble Latino culture. It simply tells a story that faithfully paraphrases harsh reality. If you don't get the story, then it's easy to lambaste the acting and directing. If you do get the story, then the acting and directing are good enough.<br><br>Many of the film's characters are people we know: Cruz, full of verve and potential, a victim of the needle; his father, a working class Chicano who wanted better for his sons; Miklo, the fresh-faced well-intentioned misfit driven inexorably to a life of brutality; Paco, the handsome athlete rescued from ruin by the Marine Corp; Juanito, the \"mocoso\" of the family, whom everybody wanted to protect from the perils of the barrio, tragically cut down nonetheless; Miklo's mom, a party girl ill-prepared to be a mother; Miklo's aunt - strong and responsible - called on to be a mother to her sister's son.<br><br>The prison scenes and subplot are quite visceral. Some people find them laughable or unbelievable, but I find them to be neither. Some liberties were taken, but for the most part, I thought prison gangs, corruption, killings, rape, parole boards, and trade were depicted quite well.<br><br>There are also universal themes: The meanings of home and family; hard but honest work versus a life of crime; the fickle consequences of youthful foolishness, striking down some while letting others pass; unfulfilled hopes, and other hopes fulfilled in unexpected ways; a family torn apart by tragedy with only time to heal the wound; the struggle to right one's ship; generational gaps bridged only by maturity that comes in the wake of mistakes; the constant questioning of oneself.<br><br>It would have been nice to see more character development of women in the family, and some of the actors should have worked on their accents and delivery a little more. Still, I highly recommend this film to anybody in search of a story like the one it tells. To those who don't feel particularly strongly about the material covered, I'd say BBH is no worse than almost any recent big budget film. But to those inclined to greet the *underlying story* with folded arms and a dismissive grin or snort, I'd say spend your three hours watching something else. My verdict: 9 of 10 stars.<br><br>Now I'll address some points raised by those who say the film is garbage.<br><br>1) \"It was too long.\" It was long, yes, but there's very little I'd have left on the editing room floor. I think if one finds the subject material interesting, then the film moves along nicely, despite its length. Also, I think it's hilarious that so many people who despise the film actually watched the whole darn thing! Any flick that keeps you watching for 3 hours can't be too bad.<br><br>2) \"Damian Chapa is too white to play a Latino.\" First, people who say this misunderstand what it means to be Latino, and second, they miss an important subplot. Chapa is a *Spanish* surname, and if Damian Chapa is Latino, then by definition, he's not too white to play one. Latinos of mixed ethnicity are not some Hollywood phantasm, and the treatment of mixed ethnicity and Americanization is a recurring theme in Latino culture in the USA. In the film, Chapa's character is of mixed ethnicity, and as such constantly has to prove he is \"Raza\" in a way that his peers never do. This constant challenge to his identity makes him fearless and quick to the draw, lest those whose approval he seeks question the make of his blood. For example, that's why *he* is the one to first confront Tres Puntos, not his fellow Vatos Locos. In a culture where fair hair, skin, and eyes are at times a liability, he proved his worth by the only measure his peers valued.<br><br>3) \"The acting was over the top.\" Some of the acting that seems over the top is actually not. Gang members quickly learn to communicate by force of will. Also, they are not generally educated or refined, and in their own parlance, one word can mean many things. So the frequent displays of machismo are not necessarily bad acting, and hearing \"ese\" and \"carnal\" repeated over and over is not necessarily bad directing, and the convicts' corny one-liners are not meant to be the witty banter of NPR... but yeah, the film could have been toned down a little in some places.<br><br>4) \"It wasn't true to the time period.\" Critics said the same thing about Doctor Zhivago, but a good film transcends that, and I believe BBH does. The film covered from ~1970 to ~1985, and I had no problem with the settings. Whatever time period mistakes were made weren't bad enough to distract me from the film.<br><br>5) \"BBH is a cheap rip-off of American Me (AM).\" I saw BBH before I saw AM, so I wasn't predisposed to dismiss BBH as a knockoff. I think AM is depressing and clinical, whereas BBH is uplifting and colorful. Both films cover the same reality and so of course will overlap at points. The same can be said of films about the Vietnam War or the Old West, except that because there are relatively few films about Latinos, the comparison of these two is inevitable. AM is more polished, but BBH is more riveting, probably because BBH makes you care about its characters more. If AM is a sad docudrama with all the loose ends tied up, then BBH is an emotional roller coaster with many questions unanswerable and others simply left unanswered.","user":"mrminimite","rank":[49,58]},{"title":"Blood In Blood Out - Criminally under-rated!","rating":26,"date":"26 March 2007","review":"I first saw this film a few years ago when my brother stumbled across it in a bargain basement basket bin! What a travesty for a start that it had not made a bigger mark at the box office and had been consigned to a cheap basket! I'm sure if released with more fanfare this time it would reach the audience it deserves! It is a story of rival gangs, family, love, betrayal, loyalty, acceptance - every film cliché you could think of.<br><br>It thoroughly explores the destiny of its 3 young stars as they struggle to make their way with the life path they have taken. I won't give away the plot as I believe anyway who truly loves films should see this film in its full glory with no knowledge of the plot or how the film eventually plays out.<br><br>I have been reading the postings, and many negative comments have been made about this film, but I believe this film stands up to much of its unfair criticism.<br><br>I will admit though, that I did squirm at some of Miklo's earlier expressions in the film, but a 3/4 of the way through he really picks up the baton and completely takes over. In fact, he is a revelation.<br><br>There are some cheesy bits of dialogue, but I don't think this takes away from the piece in any way.<br><br>It is a long film, but it needed to be. I don't think there are ANY scenes they could have done without - it is very effective, just the way it is.<br><br>Anybody who has seen it and didn't like it first time round, I employ you to rent it/buy it again and give it another try.<br><br>I purchased another copy of it again just a few days ago. I watched it yesterday and was still moved - as if it was the first time I saw it.<br><br>Its definitely TOP TEN best film material! MUST SEE!","user":"felicia-blake","rank":[53,64]},{"title":"Barrio Epic","rating":9,"date":"16 June 2009","review":"Based on the real life experiences of poet Jimmy Santiago Baca, Bound By Honor covers two decades in the latter half of the 20th century as seen through the eyes of half brothers Benjamin Bratt and Jesse Borrego and their cousin Damian Chapa. Growing up more or less together, all three start out as gang bangers, but each has a different destiny and in many ways one's destiny is caused by the actions of the others.<br><br>Borrego gets injured in a gang retaliation and works hard to not become a cripple. He does however become both a painter of note and a drug addict of considerable appetite. A tragedy there sets him and Bratt apart.<br><br>Bratt also winds up in a feud with Chapa. When both were young gang bangers and looking to retaliate for Borrego, Bratt and Chapa are arrested. Because this was Bratt's first offense he got a choice of the military or jail time and he chose the Marines. Chapa however was sent to prison, to San Quentin to be precise where he joined the Chicano prison gang La Onda. Pretty soon Chapa is high in the gang councils and deep in the politics of the prison. Bratt in the meantime joins the LAPD and destiny makes these two collide.<br><br>Bound By Honor has an epic quality almost a kind of Chicano Gone With The Wind. The mostly Hispanic cast do a great job in depicting life in the Barrio. The film runs just about three hours and it's a tribute to director Taylor Hackford that your interest doesn't flag for a minute.<br><br>Hackford also creates many interesting supporting characters two numerous to mention, always the mark of a good film. But your interest is always in the three leads. You get to care about what is to become of them, what destiny has in store.<br><br>There are certain similarities between Bound By Honor and the Edward James Olmos film, American Me. Personally I give a slight edge to this one, don't miss it if it is broadcast.","user":"bkoganbing","rank":[25,29]}]