[{"title":"Shakespeare would be proud","rating":27,"date":"27 December 1998","review":"I went to see this movie not knowing what to expect. On the one hand, I was excited, because you see, I am an English major and here was this movie based on the life of William Shakespeare. In the realm of Shakespeare rip-offs (i.e., \"Romeo &amp; Juliet,\" \"Macbeth,\" etc..)\"Shakespeare in Love\" clearly stood out. This is the first film I've seen based on the author, rather than his work. And it was a refreshing change from watching the pompous over-fed Hollywood egoes trying to pass themselves off as true actors. At the same time, however, the casting had me a bit nervous. I had not seen Joseph Fiennes work, but I had high hopes since his brother is, in my opinion, a brilliant actor. I liked Gwyneth Paltrow in \"Emma\" and \"Sliding Doors,\" but I was wary to see how she would pull this one off. And as for Ben Affleck.. well, I was truly afraid he would flop. I saw him in \"Armageddon\" and immediately racked him up on the list of other such forgettable actors as .. well never mind. The point is, I was afraid he would make a laughing-stock of this movie. As for the other actors,I did not recognize any one else except Judi Dench, and I figured hers was a bit role, nothing that could affect this movie much. I was wrong on almost all counts. Gwyneth Paltrow was so radiant in this movie, she fairly set the screen ablaze. I never knew she had such range. I had not expected such fire in her, I always thought she was a rather calm actress, incapable of such passions. Joseph Fiennes amazed me far more than his brother in that he knows how to balance wit and passion, joy and sorrow gracefully, even more so than Ralph. Together, these two actors did more than carry off the film; they raised it up to levels higher than any other actors I've seen in a very long time.  Judi Dench may have had a bit role, but she managed to make a lot out of it. She played Queen Elizabeth with more majesty and grace than any other Queen-playing actress I've seen. (I've yet to see Cate Blansett in the movie \"Elizabeth.\")But the true darkhorse of this movie is Ben Affleck. My God, he has a sense of humor! I never imagined. \"Armageddon\" didn't give him much space to roam in, but in this film he was all over the place. Had he not been flanked by such worthy thespians, he just might have stolen the show. The actors could not have done such marvelous work had it not been, of course, for the writing. The play flows smoothly, with nary a glitch in sight. This is note-worthy, for it is well over 100 minutes. It is written in a style that is at once clever and grave, passionate and dry. Love is one of the most abused notions on the screen today. It is rare to see a movie portray Love with as much originality and truth as this film has accomplished. Perhaps the highest compliment I can pay this movie I already did on Christmas night, when I went to go see this film. As the movie ended and the actors' names scrolled up on the screen, tears trickled down my cheeks. I must say it is not often a movie makes me cry. And don't underestimate me just because I am a girl and because I may be more sensitive because you see, my boyfriend left the theater with suspiciously bright eyes as well..","user":"Faery","rank":[182,242]},{"title":"What ever happened to \"And they lived happily ever after\"?","rating":10,"date":"23 November 2003","review":"Shakespeare in Love, the best picture winner of 1998, I know this film receives a lot of bashing due to that win. I believe that also Saving Private Ryan was nominated, which it was also an incredible film. To be honest, I couldn't pick between the two, because both were wonderful films and completely different genres. But anyways, back onto Shakespeare in Love. Everything about this film was perfect and I think that's why it received so many Oscar nods and wins, I mean, the costumes, the acting, the sets, the story was absolutely terrific and wonderful to watch. John Madden knew what he was doing and shot this film so beautifully. The cast also seemed to really enjoy doing this film and worked so well together. Gwyneth Paltrow won best actress for this film and she did a terrific job portraying Viola, she was so elegant and touching. The love story between her and William Shakespeare is truly a memorable one.<br><br>Viola is a first class lady who is about to be married to Lord Wessex, a man who she does not love. Her heart belongs to poetry, mainly the poetry of William Shakespeare. William has lost all hope though when his heart is broken by his girlfriend and he is writing a comedy called Romeo and Ethyl, the pirate's daughter. Since the plays are only played by an all male cast, Viola dresses up as a man and auditions for his new play. She receives the part of Romeo; later that night at a big party her father is throwing, she meets Shakespeare and it is love at first sight. When William finds out the truth that she is the boy who loves his poetry, he doesn't care, they have a passionate affair and continue on with the play as if she were a boy. But the plot thickens and Viola knows that she must go back to her life of an unwanted love and marriage.<br><br>Shakespeare in Love is without a doubt a fine film and should have a higher rating in my book. I don't understand why so many people hate this film, I thought it was extremely clever and witty. It had a beautiful love story, it was funny, it was sad; there's nothing wrong with this film, but hey, everyone's a critic, right? I highly recommend Shakespeare in Love, just trust me, if you enjoy Shakespeare and his poetry, I'm sure you'll love this film. Just give it a chance, who cares about the Oscars? They make mistakes at times, but Shakespeare in Love is a great movie and I enjoyed watching it.<br><br>10/10","user":"Smells_Like_Cheese","rank":[82,108]},{"title":"An excellent film in all aspects.","rating":29,"date":"29 December 1998","review":"I had high hopes for this film from the first time I saw the trailer. I am happy to say that the film lives up to the previews. Although it is an art house flick of sorts, it manages to be profound and accessible at the same time. So many art house films manage to be merely pretentious, as if aimed at those that want to believe that they are having an intellectual experience rather than those who are really open to one. This film shows that you can make a film of substance that is at the same time very entertaining.<br><br>One thing that stood out was the way they showed enough of the performance of Romeo and Juliet so that you could understand what the play is about, without making it a film of the play per se. There are many parallels between the fictional play and the events of the film, and this goes to underscore the relevance of great literature to the human condition. The actual performance of the play was acted so well that there were times when a character in the play was in a fight and I said to myself \"they're really fighting, that guy really got stabbed!\" So often a play within a movie is acted in a very staged manner, so this was a welcome surprise. And for anyone who is a fan of Shakespeare, it is easy to find little tidbits to reflect upon - such as the fact that Shakespeare himself was fond of the \"play within a play\" theme that we see in this film.<br><br>The performances are excellent throughout, including minor characters. In the midst of tragedy there is genuine comic relief, just as in Shakespeare. The historical details that surround the conjectural main plot are accurate down to the names of the actual people with whom Shakespeare crossed paths. In the end \"Shakespeare in Love\" causes us to feel as well as think, to think as well as to be entertained.","user":"vspa87","rank":[91,127]}]