[{"title":"Not Just for KITH Fans","rating":7,"date":"13 July 2003","review":"If you like Kids in the Hall, and are a fan of their wonderful comedy \"Brain Candy,\" then you will love this movie. Starring Dave Foley, with a cameo from Kevin McDonald and sly references to \"Brain Candy\" (at one point, paging \"Dr. Chris Cooper\"), it continues KITH-quality humor.<br><br>If you've never heard of KITH, and have no idea what I was talking about in that last paragraph, you'll still enjoy this movie. A wry turn on the \"Fugitive\"-style drama, a wrongly accused man on the run always looking over his shoulder to find...no one is chasing him. Tightly scripted, well acted, and just plain funny.","user":"BlackSox1919","rank":[18,18]},{"title":"Hilarious, brilliant, dumb","rating":8,"date":"21 May 2005","review":"I have no idea why this film is so unknown. I love it and it's so funny, of course, if you like dumb humor.<br><br>The main character Nelson doesn't get a promotion at his job, so he goes crazy in front of all his co-workers. He later finds out his dead boss and convinced that police will be looking for him, escapes (fugitive style). The thing is, the police knows Nelson didn't kill his boss, because there was a camera at boss' office.<br><br>Nelson however, tries to escape from the police, being careful of every step, while the real killer is convinced Nelson is after him (because certain coincidences occur).<br><br>The movie is great, Foley's acting is great and the whole movie has this positive feel to it. Some jokes are so... dumb and funny, you laugh just because of the dumbness of them.<br><br>All in all, I own the original DVD, and people should see this movie, because it really is great!","user":"Slamca","rank":[13,13]},{"title":"A pleasant surprise","rating":8,"date":"23 August 2002","review":"Don't be fooled by the B-movie production value of this film.  This is one of the funnier movies I have seen in a long time. Dave Foley plays his dorky persona to a tee, while Jennifer Tilly is sweet and sexy as his love interest.  I couldn't believe I was laughing so hard but this plot had so much to offer with its ridiculous main character under the misconception that he is the subject of a nationwide manhunt.  A worthy rental.","user":"sittler","rank":[13,13]}]