[{"title":"A sweet and funny romantic comedy...and a sweet and funny Benicio","rating":7,"date":"30 March 2003","review":"This was much better than what I expected.Since it had such poor reviews,I rented the video only to watch my new favorite actor, Benicio Del Toro .I was actually pleasantly surprised at how good he was in a romantic comedy.He should do these more often! He has proved himself in serious roles already, but I think he can be a very refreshing lead in romantic roles. Haven't we seen enough Hugh Grant movies yet? I wont' go into details about the plot,which had an interesting start but looked like it wasn't sure where it was headed at the end.Then again, a movie starring Alicia Silverstone can't be expected to be so plot-conscious...If you're a fan of Benicio, you'll enjoy his unique debonaire charm in this movie.For once, he doesn't look that intense or sad, and we can really feel the tenderness behind his half-smile...I might not be such an objective viewer, but this movie is such a nice distraction from the Julia Roberts, Sandra Bullock romantic comedies...","user":"passetemps","rank":[24,29]},{"title":"Misunderstood movie--well worth seeing.","rating":9,"date":"24 December 2001","review":"Excess Baggage was a joy.  Alicia Silverstone is gorgeous, bratty, and fun. Benicio del Toro is frumpy and totally unlike any other leading man ever. Unfortunately, this film seems to have been misunderstood in a big way, by the audience, by reviewers, and by the people I saw it with.  But, it's worth another look.","user":"dalenberg","rank":[48,63]},{"title":"Surprisingly sexy...great chemistry between Silverstone and Del Toro","rating":28,"date":"28 May 2003","review":"I rented this movie on a whim last night, and I was very pleasantly surprised!  The plot is entertaining, but what I really loved about this flick is that Silverstone and Del Toro have an odd - yet amazing - chemistry on screen.  Most of their intimacies are left to the imagination, but I thought that made it even hotter! I noticed there was a comment on imdb about the writing being sophomoric (or something to that effect), specifically the line, \"Do you like my tummy?\" I thought it was very sweet and REAL.  It's one of those silly conversations that makes them believable. Definitely worth the rent...and the buy (I'm purchasing it ASAP!).","user":"rebeccanoel","rank":[32,42]}]