[{"title":"Ritual as Remembrance and Participation","rating":8,"date":"3 December 2010","review":"Gabbeh, a movie from 1996, written, directed and edited by Mohsen Makhmalbah, capturing its story from a tiny scene depicted on a Persian rug: a pair of lovers riding the horse.<br><br>Gabbehs are one of the many varieties of Persian rugs. They are hand-knotted by women belonging to Lori, Bakhtiari or Qashqai clans: shepherds wandering with their flocks over the Iranian mountains and beyond.<br><br>A gabbeh is small sized while much thicker than other rugs; its surface is a symphony of colors: the yellow of the sun, the red of flowers, the blue of sky, the green of grass, all of them meeting there. Life is color, love is color, beauty is color: colors of surrounding nature extended on the clothes they wear and on the gabbehs they craft, these women living under the sun and the clouds, on the grass and among flowers.<br><br>As rich in colors as it is, a gabbeh has usually a very basic pattern, sometimes just a small scene some place on the rug.<br><br>I am thinking at those Chinese drawings in ink on rice paper, at one corner with a tiny fisherman in a small boat: it's telling a story, the size of a spot, and all the space that remains is just what? emptiness? Or maybe the whole is telling a much larger story? about the artist, about the making of the artwork? The gabbeh from this movie resembles those Chinese drawings in this detail: there is a small scene on the surface, the size of a spot. A pair of lovers on horseback; and the whole surface of the rug, exploding in colors, subtly supporting the tiny story.<br><br>An old couple is carrying their gabbeh to wash it in the river, as they've done everyday, for forty years. It's become a ritual.<br><br>A gabbeh and a ritual: we enter the realm of magic. And magic is what we see in this movie: the gabbeh is getting alive, becoming a young woman who's telling the story of the pair of lovers. A story that has lasted for forty years.<br><br>We associate rituals with religious practices, while they mean more. Rituals keep alive the collective memory of civilizations. The more primitive a civilization the more obvious.<br><br>A ritual, with its precise details, with its precise repetitions, is to keep the remembrance alive: to participate again at an event of significance; to cancel time and to live when the event actually took place. Participation, not reenactment. Father Alexandre Schmemann wrote an admirable book about the Eucharist as Mystery of the Kingdom: you'll find there some great pages about remembrance as participation, as canceling time and be there to witness the Passion, the Death, and the Resurrection.<br><br>The ritual of washing the gabbeh here in the movie is personal: the story of the pair of lovers is remembered by the old couple everyday: remembrance as participation, canceling of time.<br><br>But, as I said, this scene of two lovers riding the horse is just a tiny part of the whole surface of the rug: the story of love is remembered within the remembrance of that pastoral civilization: the clan of shepherds migrating over the Zagros mountains in search of grass for their flocks. A clan carrying, together with its animals, its primitive culture with severe rules and taboos, necessary for survival. A community kept alive through the force of its culture, a culture kept alive through carefully observed rituals.<br><br>And here Parajanov comes in mind, of course, and not only him: also the Chinese Tian Zhuang-Zhuang. They also depicted in their movies ancient communities kept alive by the force of rituals, of traditions, rules that are difficult to be understood as they defy logic: these rules express a cultural matrix, a system of values that defines the group as a whole.<br><br>What Makhmalbaf brings in this depiction of a patriarchal culture is the use of colors and sounds: these people have a special sensibility for colors, they spend their lives surrounded by the colors of nature, by the vivid colors of their female clothes, by the colors they put in their gabbehs. And as they spend all their life outside, these people have a special understanding of the language of sounds, be them sounds of the birds or animals, be them sounds of the grass in the wind, of the rocks on the footpaths in the mountains, or of the river. And Makhmalbah succeeded to give an active role in his movie to each sound, to each color: by the way they are placed, by the way they are repeated, by the way they come along with the feelings of people. This movie is a feast to watch.","user":"p_radulescu","rank":[10,10]},{"title":"This is a visually stunning film.","rating":9,"date":"25 December 2002","review":"This visually stunning film tells the story of an old couple's gabbeh-a finely crafted Persian carpet. One day when they go to a nearby spring to wash the carpet, an attractive young woman appears suddenly and mysteriously-she is the apotheosis of the people whose tale is told in the carpet's woof and warp.<br><br>The film is a surrealistic folk tale. As she helps the old woman wash the carpet, the young woman (the spirit of the carpet) begins the tale of her life, which becomes the film's story. The film's charm lies in the magical use of color and water to tell a story. Young girls are everywhere in native dresses that complement the picturesque scenery with as many dabs of color as a French impressionist painting. The filmmaker here is an artist, adept at sunsets, drifting cotton-white clouds on a pristine blue canvas. Pastels, ultramarines, burnt siennas, ochres-there is a sensuous joy in the very colors of the earth and sky.<br><br>The world of the film is a kaleidoscope of color. Exotic birds appear from nowhere like bursts of sunset. Young women dress in native Iranian costumes of reds, golds, blues, and greens. And through it all, the sounds of flowing water, like little bells or delicate wind chimes, is given a palpable presence.<br><br>The Persian carpet, no longer mute, beguiles the viewer with its simple, haunting tale of people and places at once so ancient and new. The wolf-like howls of a young woman's lover merge with the sound of the water as it rills and flows over stones, pebbles, and sand. The water is itself a comment on the people whose lives are lived within its boundaries. The magical and surrealistic elements of the peasant girl's story weave themselves into a fairy-tale. What enchantment there is in a young woman's quest for love and continuity. The very air is rich with the colors, sights, and sounds-the spices and incense of the Near East.","user":"tlarry858","rank":[19,22]},{"title":"Every scene is pure magic...","rating":10,"date":"28 December 1999","review":"GABBEH is so magical, colorful and involving that it makes me feel like a child listening a \"once upon a time\" story. The film is superb. Every scene is pure magic. At the end, you feel like you were dreaming: a beautiful shining dream. Don't worry if you want to see again and again again... See it now - if it's possible. 10/10","user":"junior-17","rank":[12,14]}]