[{"title":"The Thompson Factor","rating":10,"date":"17 October 2005","review":"If it's raining, if it's late, if I'm tired of working, if I'm restless or if I'm in a quandary of sorts, \"Howard's End\". I put the film on and Emma Thompson - presumably with the help of her accomplices, Ivory, Jhavhala, Hopkins etc - takes me away from whatever mood I'm trying to escape and leads me through her own, brilliantly drawn, gently torturous path. I don't recall when was the last time an actress has had this kind of power over my own psyche. The film is constructed with an Ivory attention to detail worthy of a vintage Visconti. The screenplay has no lapses of any kind and never falls into the usual traps. Loyal to its source material and yet, cinematic in the most revolutionary traditional sense of the word. The Britishness of Anthony Hopkins character is turned upside down giving us a glimpse into a character that's a mass of contradictions. But it is Emma Thompson's film from beginning to end. What a glorious achievement.","user":"mocpacific","rank":[148,161]},{"title":"One of my all time favorite movies.","rating":7,"date":"7 September 2000","review":"\"Howards End\" is certainly one of the best films of the last decade.  I have seen this film several times over the past 7 years and each time I find myself in complete awe.  I love how its intricate story gradually unfolds layer by layer, involving us more and more with the characters.  \"Howards End\" also boasts breath-taking cinematography by Tony Pierce-Roberts and a rousing and rueful musical score by Richard Robbins.<br><br>The ensemble cast is perhaps the best reason to see this film.  Emma Thompson won the Best Actress Oscar for her performance, and deservedly so! This is her best performance and her best film, in my opinion.  I loved watching the character development in her portrayal of Margaret Schlegel, as she transforms from an open-minded intellectual to a class-conscious social climber.  What's remarkable is that we still feel for her greatly as she is going through this transition.  She still remains a sympathetic character up until the very end when she slowly comes back to her senses.<br><br>Anthony Hopkins also gives one of his best performances as the cold and hypocritical Henry Wilcox.  So many scenes shed different lights onto his character.  The scene where he proposes to Margaret stands out in particular.  There is plenty of erotic tension, but at the same time it almost feels like he is making some sort of impersonal business venture with her.  <br><br>Vanessa Redgrave is a presence to behold as the fragile Ruth Wilcox.  Her performance may be brief, but it leaves an indelible mark, particularly in later scenes when Margaret visits Howards End.  Helena Bonham Carter should have gotten an Oscar nomination for her performance.  She really has great depth and passion that is well-suited to her character.  The rest of the supporting cast is superb.  Even the minor characters like Nicola Duffet's Jackie Bast and Jemma Redgrave's stony-faced Evie Wilcox are noteworthy.<br><br>\"Howards End\" is one of the richest, most nuanced films I have seen.  It is beautifully shot, well-acted, and exquisitely directed.  It deserves to be considered a classic.","user":"kdufre00","rank":[71,78]},{"title":"A Journey Everyone Should Take","rating":23,"date":"23 January 1999","review":"The literary period piece is a difficult genre to master, requiring a difficult balancing between restraint and flowing emotion.  Few films effectively achieve this as beautifully as  Merchant-Ivory's astounding HOWARDS END, making it probably the best period film of the 1990's.  The film juxtapositions the intellectual, emotionally unhindered Schlegel sisters against the restrained, imperious Wilcox family, and, for good measure, mixes in the differing attitudes toward class emerging early in the century.  What could quite easily have been a dry study in the cultural dynamics of pre-WWI England becomes an enveloping tale, thanks in no small part to the performances by Hopkins, Emma Thompson, and Vanessa Redgrave, whose Ruth Wilcox remains enigmatic after every viewing.  The emotions ringing through by film's end - not to mention its astoundingly pointed social criticism - give the film its power, a power missing even from Forster's rambling, distant novel.  And this story is nestled amongst some of the most beautiful art direction, music, and cinematography to ever grace the screen.  The haunting journey to HOWARDS END is one few other recent films can rival.","user":"awoolsey","rank":[64,71]}]