[{"title":"An excellent movie","rating":8,"date":"9 August 2005","review":"Who said all movie series become worse with every installment? Lethal Weapon 4 is probably the best fourth movie in a series ever. I find it incredible that the magic is still there. The main characters still feed of each other and their friendship (both on set and off set) is clearly felt in every scene they have together. Mel Gibson has finally laid the ghost of his wife to rest and is as chipper as ever. He does this without seeming truly obnoxious (even though that is a part of his character). In fact he seems more likable in this film than he did in all the previous films. Danny Glover reprises his role from the previous movies and that is not a bad thing because the Murtaugh role is the best of his career. Rene Ruso returns in her part and although it has been cut down considerably its still a decent role. Joe Pesci is also back and this time around he gets to add some depth to the character (something that was missing in the previous film). Chris Rock is decent. He isn't much of an actor but he is pretty funny and fresh. His part also adds a little something to the all-round comedy of the film, but if you want to know what it is you will have to watch the movie yourself. Jet Li is the villain in this movie and while he is the weakest villain in the series acting wise, he is definitely the most menacing.<br><br>The action is still brilliant despite the fact that the actors are getting older. The story is decent for a fourth film and the overall execution is brilliant. I actually prefer this film to the second and third of the series because I find it to be more entertaining overall. It cuts down on the seriousness (even though its still there) and adds a lot to the comedy and this is a very good choice.<br><br>All in all an excellent film. Highly recommendable for all fans of action movies and the series in particular.<br><br>8/10","user":"MinorityReporter","rank":[78,98]},{"title":"Lethal Weapon 4 - Great ending to a great series","rating":9,"date":"23 April 2006","review":"This movie is the end of a series which spanned almost two decades.<br><br>This time around Riggs (Gibson) is facing three very personal problems. 1) Age is catching up to him, 2) his g/f is pregnant and he's facing being a daddy, and 3) he's facing the dilemma of wanting to remarry. Also, Murtaugh (Glover) is about to be a grand-daddy to a baby by his oldest daughter, and she is secretly married to Detective Butters (Chris Rock), which everyone is keeping a secret from him.<br><br>Add to this the fact that both they are now taking on one of the most powerful crime syndicates in the world, the Chinese Triads, in an effort to stop slave trading and money laundering. The task of a bad guy this time goes to Jet Li, who made his American debut (atleast from an American Film Company) in this movie. Yes, this is the movie which launched him here in the states, and he deserved it.<br><br>This movie is as good as the rest of them, though nothing beats part 2 in my opinion. Lethal Weapon 4 really hits home on a lot of subjects, such as facing responsibility, to coming to terms with who you are. And it ended the series in a way that makes you smile and love it even more.<br><br>I give it a 9 out of 10.","user":"bujinbudoka","rank":[61,77]},{"title":"A Solid Sequel","rating":8,"date":"17 January 2005","review":"OK... so the language is gratuitous. Just having Chris Rock on set put it over the top. But his acting aside, I thought this was a worthy addition to one of the best cop/buddy series around. It was enjoyable to see the characters we love deal with the inevitabilities of aging and the fierce loyalty of friendship. Some of the mystery is gone and it feels like a pair of comfortable shoes. But aren't those shoes your favorite ones? It was interesting to see the development of Lorna and Riggs' relationship, as well as the growing up of the Murtaugh kids. It makes you feel like you're catching up with old friends at a reunion! Plenty of action and the incredible work of Jet Li make this movie a favorite at my house. Overall, a great wrap-up to the series and a lot of fun for long time fans. Worth seeing! If the language is a real issue, watch for it on TNT and enjoy the edited version.","user":"gaccrev","rank":[53,71]}]