[{"title":"No longer rehashing old material, they're even funnier this time.","rating":8,"date":"18 November 1999","review":"One of my favorite films. Paul Rudnick clearly had a field day writing this screenplay.<br><br>As odd as it may seem, this sequel is in many ways superior to its predecessor. The first had to spend much of its time introducing the Family--and, just as importantly, paying (totally justified) homage to Charles Addams' brilliant cartoons and to the old television series. As a result, the plot felt forced, as if it had been the best way the writers could think of to showcase all the source material. In the end, one left the theater feeling that the movie had been 'about' the old sight gags. And then there was the totally shameless product placement...but I digress.<br><br>Addams Family Values, on the other hand, gets to be more playful. Because we all know who we're dealing with by now, we don't have to spend nearly so much time introducing the family and their skewed universe. Instead, the characters get more of a chance to develop as they glide blithely through a fuller, more cohesive story.<br><br>Paul Rudnick's screenplay is masterful--you'll be quoting from it for weeks. Raul Julia and Anjelica Huston are particularly marvelous as one of the most genuinely loving, passionate couples you've seen in ages. In a weird sort of way.<br><br>That dance number! Morticia's ever-present shaft of light! Christina Ricci as the sublime Wednesday! Joan Cusack, unhinged! A split-second cameo by Charles Busch! Oh, rapture. I could go on and on, but I'm running out of superlatives. Suffice it to say that this movie is well worth your time.","user":"Andy Willett","rank":[80,88]},{"title":"Funny as hell!","rating":10,"date":"29 October 2001","review":"Usually I don't like horror comedies and I hate mainstream movies,but \"Addams Family Values\" completely cracked me up.It was so immensely enjoyable and funny as hell!Especially the first Thanksgiving Day performance,where Wednesday Addams(Christina Ricci)as a Pocahontas,and other Indians took a revenge on American colonists-I almost cried with laughter during that scene!I wonder what Americans think about it?As for Christina Ricci,she simply steals the show in this one!I'm looking forward to see this talented,young actress in more movies.The other actors are also excellent,and the film is filled with wonderful touches of black humour.Highly recommended.","user":"HumanoidOfFlesh","rank":[74,82]},{"title":"Ricci rules","rating":3,"date":"3 November 2001","review":"This is a film with several excellent performances, but that of Christina \"Wednesday\" Ricci is near perfect. The reluctant smile outside the \"harmony hut\" is Oscar material. And Christina as Pocahantas is the very definition of \"cute\".<br><br>Of the others, Joan Cusack also stands out. I doubt anyone else could play the part of \"the black widow\" quite as well, with just the right mix of sleaze and slapstick. Her deranged laughter alone is worth half the rental fee.<br><br>It may not be a classic but it is solid entertainment, with few if any weak passages. Go and see it!","user":"leif.hellstrom","rank":[69,78]}]