[{"title":"Overlooked Little Gem","rating":7,"date":"5 April 2002","review":"\"Father Hood\" is an overlooked little gem of a \"road movie\".  Fine performances by Halle Berry, Sabina Lloyd and Brian Bonsall, two really fun \"over-the-top\" ones by Diane Ladd and Michael Ironside,<br><br>and a downright outstanding one from Patrick Swayze. The movie is helped by an unconventional storyline, but badly undercut by it's flashback framing which results in a formulamatic, abrupt ending.  \"Father Hood\" would have worked MUCH better without these \"bookends\".  Nevertheless, the movie brings up important issues of \"family responsibilities\" and the consequences of state intervention. As long as the foster system rewards state institutions for NOT placing children, such abuses will exist.<br><br>Pick this one up.  It's worth the \"ride.\"","user":"Bob-45","rank":[15,16]},{"title":"Being A Dad On The Run On The Road","rating":5,"date":"5 February 2012","review":"Alright, so 'Father Hood' is not the perfect movie. There have been many of its kind. It isn't devoid of plot holes and is predictable. However, it's also an entertaining road movie about an ex-con, Jack, on the run with his kids (Sabrina Lloyd) who were treated harshly (their hands were cuffed and they were abused) in a detention center). The only person on their side is feisty journalist Kathleen Mercer (Halle Berry) who tries to convince Jack to give her an interview (providing information against the youth detention center) and she'll work out a deal for him so that his sentence is reduced. Jack also drops by his mother's (Diane Ladd) in Las Vegas.<br><br>Okay, so it's not anything new but that doesn't mean it can't be fun. Shot in a typical early 90's style, Darrell Roodt catches the cross country landscape effectively. The performances are good too. The late Patrick Swayze is brilliant as the reluctant dad. Sabrina Lloyd is cute and vivacious. Brian Bonsall can be annoying at times (but then again his character was a cliché). Halle Berry is charming in her limited screen time.<br><br>'Father Hood' holds some nostalgic value for me and it was nice to go back to memory lane for a while. The way to enjoy this one it to take it for what it is.","user":"Chrysanthepop","rank":[8,8]},{"title":"When your kids find you its time to find yourself!","rating":25,"date":"25 September 2004","review":"Patrick Swayze stars as a father who is lost to beer, woman and the bad boy life. One day, out of the blue, his children find him but are ripped away by the system. In typical character, after seeing his children handcuffed to a waist belt into the bus back to the home for disturbed children, Swayze decides enough is enough and hijacks the bus, which leads to a cannon ball run trek across America to New Orleans, where the next heist of money will get Swayze the good life.<br><br>On the way there, he starts to fall in love with his kids and helped by Halle Berry, the reporter who has tried to stop the home molesting children and billing for trips out with the kids that never really took place, Swayze has to decide whether he should take the money and run or look out for his new found family's interests. <br><br>I really enjoyed this film and recommend watching it, if you missed it back in '93, and the music played during the chases is soulful and funky throughout, which gelled nicely with the plot, especially the last track (wonderful one, if thats its name) which took me right to the end of the credits. I just hope in the next few years we get another version of 'Father Hood' and they stick to the northern soul tracks that blessed this version. Just please please please shut the blonde loud mouth kid up, his character played too well and was as annoying as he was paid to be!!!!!","user":"nd-electrical","rank":[7,7]}]