[{"title":"Wow! This Movie Has Everything!","rating":7,"date":"11 December 2011","review":"I give this film a 7 only as an enjoyably bad movie - so it gets that score for being cheesy and fun. To its credit, you never know what is going to happen next - it seems like five screenplays were thrown into a blender and they filmed that. Escaped prisoners, two innocent girls driving home late at night, abandoned mines, sleazy cops, cannibal miners, a little gore, ta-da! We laughed and enjoyed how bad it was. Everything you would want in a 80's horror/action movie. Veteran actor Cameron Mitchell (who was on Broadway in the original cast of Death Of A Salesman and then became an International B-movie actor) plays a worried father of one of the kidnapped girls but he's hardly in it. He must of had a mortgage payment due. Check out this bizarre cheesefest. You Will Be Trapped &amp; Entertained!","user":"droopyherby","rank":[10,15]},{"title":"Snacking down.","rating":5,"date":"29 December 2018","review":"Three convicts escape from a maximum security prison on Christmas eve, and hijack a vehicle on a snowbound backwoods road holding the two women hostage. In trying to avoid a roadblock, they go off road and crash through a rotting cover over an old mine shaft. The survivors now find themselves trapped in a maze of old tunnels, but soon realise they might not be alone. Meanwhile a local deputy sheriff is on their trail.<br><br>I don't know what to say... this is an odd genre film trying to balance a whole range of genre elements. I kind of like it, yet still felt somewhat disappointed. There's something there, but I don't think it fully taps into it and the lack of a budget adds to it. It's schlock material, but it doesn't entirely act like it. Well, not exuberantly so... with the exception of one character sub-plot. Story starts off straightforward with quite a long-winded setup, where the acting, and dialogues are ham-fisted in their serious delivery. For the first hour you got deal with a lot of it. Plenty of predictable character arches, and restless friction between unwanted company in the caves to move the story forward, but when the underground cannibal hermit (a wrinkly old man with scraggy white hair and a beard) makes himself known to the group. It sort picks up the pace, the dark is no longer playing tricks and what develops is downright nonsensical and unhinged, especially the events surrounding the mysterious women that lives nearby and the cartoonish nature of her inclusion. There are a couple eerie, and unpleasant jolts with decent looking make-up FX... just not enough when it came to shove.<br><br>One thing though that had me bug-eyed, and probably the most effective horror moments are the scenes where a mechanical claw (like out of a plush toys machine?!), would come down and clamp down on his meals. Quite a pro too, as it only took him one go each time.<br><br>For star power Cameron Mitchell sleeps through his tiny part, where he spends a good part of his role literally doing just that, and when not rolling around in bed, there's a Christmas party to host at the beginning, or talking on the telephone in his best attempt to look worried about his missing daughter. Oh, he wasn't even trying. Go back to sleep Cameron.","user":"lost-in-limbo","rank":[5,7]},{"title":"Cheesy, low budget nonsense","rating":3,"date":"3 July 2016","review":"It's fair to say that a lot of dross was made in the 1980s and TRAPPED ALIVE (aka TRAPPED) is a good example of this. It's a cheesy, low budget piece of nonsense that attempts to combine the thriller and horror genres but does neither successfully. The plot is the most interesting thing in it but even that's mishandled, leaving this a near unwatchable viewing experience.<br><br>The film sat on the shelf for five years before release which gives you some idea of the quality. The story sees some violent criminals bust out of prison and take some young people hostage. The local police department are in hot pursuit, but all of the characters end up being trapped in an abandoned mine where they're pursued by a cannibalistic killer.<br><br>It's predictable stuff indeed and feels so slapdash that it's impossible to enjoy. The early scene-staging stuff is quite dull but when the action shifts to the mine things get really dark (visually) so you can't figure out what's happening. There's some gloopy gore here and a lot of bad acting from the cast, including Cameron Mitchell in one of his '80s-era anything-goes B-movies. The killer is a visual disappointment looking just like an old man and there's no bang here, just fizz.","user":"Leofwine_draca","rank":[5,7]}]