[{"title":"Dumb But Innocent, And That's Not So Bad","rating":6,"date":"2 June 2006","review":"This was \"Dumb and Dumber\" without the crudeness and profanity. That doesn't mean it's an award winner: it's pretty stupid, but it is refreshing to see a movie in which both Joe Pesci and Danny Glover star and never utter a profane word! Unbelievable! And you can add Rosanna Arquett to that list, too, and she wasn't exactly Mother Teresa in a lot of films.<br><br>The professional critics totally lambasted this film, which wasn't altogether fair, either. It is refreshing in its innocence (something critics know nothing about) and it has its funny moments. Best of all it's entertaining. Yes, this is \"Lightweight\" with a capital \"L\" but I've seen a whole lot of films that were the opposite and total garbage. At least you watch this with your kids and have some laughs. What's wrong with that?","user":"ccthemovieman-1","rank":[28,33]},{"title":"Funny like Hope Crosby Films","rating":10,"date":"16 July 2001","review":"Don't listen to the cynics.  Gone Fishing was pretty fun.  There is nothing mean spirited here just a a funny flick about two guys who go on a fishing trip.  I know it is fashionable to blast this film.  I heard so much negative stuff that I almost did not rent it.  If you are looking for comedy based on satire, parody, insults, or crude situations you will not find it here.  This is just a fun movie with no agenda which makes it a rarity. This film is more in the spirit of Out to Sea, Grumpy Old Men,  Road to Hong Kong or even Legally Blonde.  Gone Fishing is worth a rental.","user":"mrskywalker","rank":[28,41]},{"title":"Two likable \"average\" guys on a memorable adventure","rating":10,"date":"15 February 2006","review":"While this certainly isn't your typical Joe Pesci movie, I found it highly amusing. Joe and Gus (Pesci and Glover) find themselves in the most absurd situations...but the characters are so darn likable you really WANT things to work out OK for them! It's a family-friendly (no cursing at all!) FEEL GOOD movie! Seriously, this movie is a fantastic \"pick me up\" after a rough day...I strongly recommend it. Even found myself not minding Willie Nelson in this flick (he plays the pro fisherman Joe and Gus admire).<br><br>\"We're lucky, Joe. We have great families, our wives love us, we go to church, we work hard...all we want is to go fishing. Can we help it that everything goes wrong around us?\"","user":"phillipsjennie","rank":[22,34]}]