[{"title":"one of the Cutest n Sweetest movie of all time.","rating":9,"date":"9 March 2004","review":"Amazing , sweet ,little ,funny ,feel good cinema thats what \"The Little Rascals \"   is all about .Quite amazing to see how small kids doing big deeds.The starcast is full of lovely kids and they make this movie a treat for the eyes to watch. The basic foundation of the Heman woman hater club shakes down when one of their member,Alfaalfa,  falls for Darla and there it all starts the fight for Darla and the story moves ..... When the movie is over there is something which makes u feel good.Director penelope spheeris completely justifies the subject the movie needed a good screenplay and its brilliant in the movie. Overall a good delightful movie to watch.","user":"ank_jabberwocky1","rank":[32,39]},{"title":"Excellent!","rating":20,"date":"20 August 2003","review":"I can not believe some of the peoples comments about this movie being stupid. What did you expect from a kids movie, to come out of it feeling inspired? No, it's just a happy-go-lucky kids movie which i can proudly say i have watched over and over again to this day! And one user commented 'How do the kids expect to marry women in the future, with a Woman Haters club' ? Oh my god, get over yourself! Although i haven't seen the original to this, i can praise this version as a feel good film.<br><br>The basic plot is about Spanky and Alfalfa, childhood friends, who have a group called the 'He-man Women Haters club' with their other pals Porky, Buckwheat, Froggy and so on. Though Secretly, Alfalfa loves girls and has a girlfriend,Darla, who he one day has lunch with in the Boys club! When the boys find out Alfalfa lied, they ruin his lunch with Darla (Kitty Litter sandwiches and so-called grape juice!). Unfortunately and accidentally, the clubhouse burns on fire, and the boys must enter a go kart race to win money to fund repairs for their clubhouse! An excellent movie whatever other people say! 9/10 and im sticking to  it!","user":"jay50","rank":[40,50]},{"title":"Ah, good times","rating":5,"date":"5 May 2004","review":"I've always loved this movie. I first encountered it when I was in 4th grade. We would almost always watch this or Alladin during our school parties. I am now almost 19 years old here in 2004 and I gotta watch this movie once in a while to recapture the good ol' days of my childhood. This movie is indeed really cute and good for the whole family. I remember my cousin borrowed it from me and I did not get it back for nearly three years because she loved the movie to death. I am just glad to see that some of kids have somewhat of a career after this. I was wondering what happened to Darla, Alfalfa and the gang. It's hard to believe that most of the Rascals are now high schoolers and growing up. As I write this review, I have an urge to watch the movie again. 10/10...loved it as a kid and as a young adult, I still love it!","user":"Charles_Bronson","rank":[42,55]}]