[{"title":"Don't even bother...","rating":1,"date":"1 September 2002","review":"Don't even bother watching this movie. It is a complete and utter waste of time. Here are my comments:<br><br>The plot: There isn't one, or at least I couldn't figure it out. Over half of the movie consists of a drunk guy babbling to the camera about... who knows. Apparently, this guy's \"spaceship\" crashes on a planet. Some people in another \"spaceship\" are doing something and at one point go and look for him. Meanwhile, the guy is on the planet doing nothing. A woman who is supposed to be an \"alien\" (but looks exactly like a human) suddenly shows up. An \"alien\", according to the movie, is a descendant of humans who uses a drug called horizon. For some reason, whenever she takes the drug, she starts doing tai chi. After a while it seemed like everyone in the movie was on horizon.<br><br>The acting: I've seen pre-school children do better. It was kind of funny watching the Admiral talk; the only thing missing was the set of cue cards he must have been reading.<br><br>The scenery: Probably filmed in an abandoned warehouse. The spaceship and computers were just sad -- the computer keyboard looked like a piece of cardboard with marbles glued on it.<br><br>The nudity: Often, with a bad sci-fi movie, the only reason you would watch it is for the nudity. Well, this movie even fails in that category. You see a whole five seconds of it, which is five seconds too much once you see what the woman looks like.<br><br>Summary: This movie seemed like an extremely bad episode of Red Dwarf, except Red Dwarf can actually be funny at times. At one point in the movie, the so-called Admiral asks someone, \"Doesn't the music of the universe ever tire your brain?\" I don't know about the universe, but the only way to watch this movie is to let your brain fall asleep.<br><br>Rating: 1 / 10","user":"BigDWS","rank":[14,19]},{"title":"Strangely Boring","rating":2,"date":"21 March 2007","review":"Of all the things that can make a movie good or bad, the budget is usually the least of them. Aronofsky made a near perfect movie on thousands of dollars while Verhoven and Sommers have made pathetic ones on hundreds of millions. What it really depends on is how good the story and storyteller are and whether or not the filmmakers know how to work within their means. \"Strange Horizons\" (which I watched on video as \"Project: Genesis\") has a modest budget and is very modest about using it. There are about five characters (including a talking computer) and two extras.<br><br>I tried to view this as a b-movie (and later as a serious one) and it didn't work out so well. All it has for b science fiction fans is a bad talking computer, an extremely weak space battle, and some female nudity. Unfortunately this movie aspires to be more than a b-movie and fails. Probably the best part of the movie is the lead actor's continuous Mickey Rourke impression.<br><br>A previous poster said this film is what science fiction is supposed to be. I didn't find the small story in \"Strange Horizons\" to be strictly science fiction. More than anything, it is a play. It's a story of a burned out ex-military man who blew the whistle on his drug-smuggling superior and winds up a drunken Robinson Crusoe... until this \"alien\" woman shows up. There's nothing wrong with a movie that talks a lot, but this movie really does nothing else. Other filmmakers might have found a way to create something of the future world that is continually described (or at least show more of the planet our hero crashes on than his wrecked spaceship), but in this case we get a closely cropped play shot on two obvious sets. This thing might have been passable on stage, but not in the movies.<br><br>The filmmakers tried to tell a good story, but they wrote a short play and not a movie. In either case re-writing would be necessary. My advice to them is to show a little more imagination in the future and perhaps suggest to an audience that horizon isn't just an imaginary drug.","user":"sexytail","rank":[7,11]},{"title":"Brilliant. This is what Science Fiction really is.","rating":7,"date":"14 October 2002","review":"This movie apparently had no budget. All the best SF movies had no budget. (Except for 2001: A Space Odyssey) So what it did have was ideas. Ideas are what REAL Science Fiction is about. Not action. Or comedy. Horror. Drama. IDEAS! To that end the script was quite intelligent with numerous philosophical discourses and classical literary references. I imagine that it went straight over the heads of 90% of its viewers. But if you are of that 10% elite, the high IQ geek type, then you will certainly revel in this movie.","user":"mxb2001","rank":[10,22]}]