[{"title":"A lot darker than your usual teen flick","rating":11,"date":"11 November 2004","review":"SPOILERS<br><br>I thought this was a pretty decent teen flick - if you remember that it is, at the end of the day, a teen flick. No one should be expecting massive doses of striking directorial depth or stunning method-acting here. When taken for what it is - ie. a teen jaunt about peer pressure, teen cruelty and the hidden power-trip behind most teens' quest for emancipation, this is a pretty decent film.<br><br>What surprised me was the fact that, given the opportunity to go ditzy, the script went dark - and that's always good when you're bucking convention. This ain't no \"Clueless\". <br><br>I think Fairuza is one scary, scary chick and seeing her all tied up in a mental asylum didn't quite put the fear out. Why doesn't she do more horror movies? I think she'd be one helluva a scream queen!<br><br>6.5 out of 10!<br><br>PS check out the somewhat toneless rendition of Peter Gabriel's \"I have the Touch\" in the movie. The original is way better!","user":"Brandy-at-the-foxhole","rank":[23,24]},{"title":"Interesting and Entertaining Film","rating":6,"date":"8 January 2005","review":"This is a very entertaining blend of supernatural thriller and teen movie. Sarah (played by Robin Tunney) is the new girl at a Catholic shool in Los Angeles where she meets a group of girls (Fairuza Balk, Neve Campbell and Rachel True) who dabble in witchcraft. When Sarah joins the group they discover that they have genuine power and start using it to sort out their personal problems, until the group's leader Nacy (Balk) starts taking it too far.<br><br>The film is well-made and several shades darker than the average teen movie. The cast are all very good, especially Fairuza Balk who easily steals the film with her part.<br><br>The film's portrayal of witchcraft is a bit more interesting than the standard Hollywood portrayal, and it certainly doesn't represent it as essentially \"evil\", which makes a nice change. However, as always, this is Hollywood so many liberties will have been taken with genuine wiccan practices.<br><br>The film is worth a look, however. The only thing that lets it down is the overblown climax.","user":"RobertF87","rank":[60,72]},{"title":"Very Cool","rating":10,"date":"10 December 2002","review":"The great thing about The Craft is that it reminds me of those 80's horror movies I used to watch as a kid. It's got suspense and thrills, which so few horror films have had in recent years. I would recommend it to anyone. I can't find a thing wrong with this movie, rent it now, trust me you won't regret it","user":"alicekeymer","rank":[10,10]}]