[{"title":"Funny movie","rating":7,"date":"9 December 2009","review":"I see where some people did not much care for this movie. That's the way it is with comedies. Not everyone has the same sense of humor.<br><br>I liked it.<br><br>I found Martin's character to be very entertaining. His constant stream of BS is very entertaining. I know it's comedy, so I am not like those people who felt a more traditional gangster actor would have been better. It's his very silly over the top style which I found endearing.<br><br>Moranis is OK. He's too typecast for me, always playing a similar role. I thought he was maybe funnier in ghost busters. I don't know. He's a decent actor. It's that whole square role he plays that gets to me a bit. He's supposed to be boring, obviously. But he's maybe too boring.<br><br>I found the female cop love interest for Martin to be great. She's cute and she's funny.<br><br>Joan Cusack...I have liked her better in other roles. She's hilarious in Grosse Pointe Blank. She's OK in this role.<br><br>I liked the silent film style \"captions, or whatever you would call them a lot. They added humor to the movie.<br><br>In summary, I found the movie very light, very entertaining, and cute. I like that type of movie. If you want something that requires no thought, where your goal as a viewer is just to relax and be amused, this is perfect.","user":"imdb-21622","rank":[10,10]},{"title":"under-rated","rating":3,"date":"3 May 1999","review":"In my opinion Steve Martin's most under-rated film, in which he plays an Italian gangster put on a witness protection programme as he awaits to go to court. Martin was born to play this part, and his character's cocky swagger had me laughing every time he appeared! Rick Moranis also stars, and is his usual nerdy self, which is funny enough!","user":"dave-346","rank":[19,21]},{"title":"A cute and lovable comedy","rating":6,"date":"3 November 2006","review":"I just watched Blue Heaven and I thought that it was a nice sweet comedy with two of my favorite comedians: Steve Martin and Rick Moranis. They make such a great duo and you can tell that they really enjoy each other's presence. This is the only Steve Martin movie my mom didn't have, so I had to rent it. But I was excited to see Steve Martin as a tough Italin mobster, so I couldn't resist the rental.<br><br>My Blue Heaven is about a man, Vinny, aka, Todd, and he's about to go on trial to rat out some Mafia members, but he must be protected from hit men, so that's where Rick's character comes in. He must take care of Vinny and make sure that he isn't arrested or injured, but that's going to be hard since Vinny keeps getting into trouble with the D.A. played by Joan Cussack. Vinny also thinks it's a good idea that she and Rick get together and they do. But Joan is going to try her best to get Vinny busted.<br><br>It's predictable, but it is a very adorable movie that I think any Steve Martin fan could appreciate. The cast was great and the story was very funny, I thought it was so cool that it was slightly based on Henry Hill's(who you probably remember from Goodfellas) life. Rick and Steve are just great and I think you'll enjoy this movie.<br><br>6/10","user":"Smells_Like_Cheese","rank":[15,17]}]