[{"title":"Everyone should watch it if they have the chance, but don't expect to go away smiling.","rating":9,"date":"26 January 2004","review":"Wow. I just watched The Brave. Before I saw it, I knew that it was the only film which Johnny Depp has directed.  After seeing it, I can add 'unfortunately' to the beginning of the fact.  In every film that he's been in, nevermind the quality of the film itself, Johnny Depp has always given a wonderful performance.  As a director, he's no different.  The Brave is truly outstanding. How to describe the film?  It's impossibly really.  All I can say is...wow. Every actor is great.  It's hard to get good child actors, but here it had been done.  Johnny Depp is fantastic as usual, the wife is brilliant too.  I don't think that there is a single performance that I would criticise. With the film, I did something that I've never done before - I didn't move for the last 10 or 20 minutes, and when it was over, I just sat through the credits completely in shock, crying.  I even stayed in front of the DVD menu for a while afterwards, completely still.  How anyone can call this film 'boring' is beyond me.  Heartbreaking, uncomfortable, yes, but it is far from boring. Everyone should watch The Brave if they have the chance, but don't expect to go away smiling.","user":"Chili_Padmez","rank":[96,118]},{"title":"A movie worth watching!","rating":10,"date":"27 October 2003","review":"I expected this movie to be a real \"stinker\" based on comments I had seen. But I was pleasantly surprised to see how good a movie it is.  It is a powerful story about desperate people and should have received more attention and respect than it did.  The movie could use some work in places, but it deserves to be released.","user":"makent01","rank":[57,75]},{"title":"it lingers","rating":10,"date":"29 October 2003","review":"I just saw this movie on DVD. As soon as I finished watching, I felt I had to see it again.<br><br>The thought of being killed for money may sound bizarre, but in this movie, it's very realistic.<br><br>The movie caught the mindset of a man about to be sacrified very well and you could feel the intensity. It neither condemned nor aprove his decision. But his actions all made sense, so we sympathize but not pity him.<br><br>Johnny Depp played the role so well, he was able to convince us that he was just doing his best to help his beloved family.","user":"bijindesu2","rank":[50,66]}]