[{"title":"The right movie for the wrong audience","rating":9,"date":"16 December 2004","review":"It's a pity this movie failed at the box office, because in my opinion, it's really good. It combines combines the classic dystopic sci-fi future with a scorched Earth, a few heroes struggling against enigmatic aliens and a corrupt military force, action style sequences that are at times quite intense, and the typical slow-paced Asian movie storytelling. Add to this a rich amount of influences from the FF games, including eight mysterious spirits that must be found in time or the heroine will succumb, as well as a lot of mythological references that must be taken for granted rather than analysed to bits if the viewer is to find any pleasure in this film.<br><br>The trouble is that the FF video game fans wanted a story based on the games, or on their particular favourite in the series, and were disappointed with both the story, the setting and the characters. The average sci-fi movie fan, though, who ought to have loved the wicked general (excellently voice-cast by James Woods) and his huge space cannon, as well as the 'Aliens' styled surroundings and technology, was put off by all the talk about spirits and world souls. Leaving for a few of us who went to see the film with no real expectations, to enjoy it.<br><br>Because it is a good film. The animation is, for the most part, excellent, even if some scenes have a too blatant 'look what we can do' boast to them. Particularly all the scenes of Aki's hair waving in the wind. Personally, I didn't think the story was either too slow-paced, nor too weird. It works well, especially if you like Asian movies. For the European and American market, though, there's probably not enough action and too much talking.<br><br>If this movie had been released this year, it would probably have been given a better reception. The thought of fully computer animated films isn't as new and strange anymore, and with films like Crouching Tiger, Hidden Dragon, The Ring and Hero, the west is opening up for the Asian way of telling stories. I hope to see more films like this, at least if they are this well made. 9/10","user":"winterimage","rank":[218,246]},{"title":"Not bad at all....","rating":7,"date":"11 May 2005","review":"Wow, I guess there is SOME hope for video game adaptations. While not a direct translation of the Final Fantasy video game franchise, it is written by the series creator, whose name I cannot remember. On top of that, his video game company branched off into a film company (Square Pictures) just to go and make this movie. At least one can't complain about the handling of the material.<br><br>But the big question here is: Do these guys know anything about film-making? Maybe. Maybe not. Truth be told, they don't need to. The beauty of this movie is that it does something new. It blends the world of video game technology and storytelling with the art of film-making. It cuts corners on film-making, but its uniqueness makes up for it. I will admit that I'm a gamer, so I appreciate what was attempted here. What we get out of this movie is an impressive display of what animators and video game technology can do together. I know there are other CGI movies out there, but, unless I am mistaken, they have all followed the over-the-top cartoony path. This is where Final Fantasy stands out. The animation is swelling with reality. From a technical standpoint, this is a gem, and a reason at the least to give it a rent.<br><br>The storyline is subject to much scrutiny though. It's not for everybody. This IS a film of Japanese origin, so anime fans will be right at home with it. For the mainstream audience, however, that remains to be decided. Although the script was revised to suit North American localization (and done very well might I add), it still is very Japanese in style, albeit with a bit less surrealism. It's fast-paced and a bit abstract at times, but it is coherent.<br><br>In the end, I would say that one should rent this just to see the technological achievement at the least. It's safe to say that all would agree with that point. Depending on the person, you may get into the storyline as well. Either way, you'll walk away with at least part of you satisfied.","user":"a2zol","rank":[79,93]},{"title":"Improbably good","rating":7,"date":"13 March 2006","review":"I never played the computer game, and knew nothing about it. I was drawn to this film because of the bold animations, but didn't expect the film to do anything for me beyond simple entertainment. I was pleasantly surprised. The excellent voice talent and stunning animation allow Final Fantasy to drawn you in just as well as a live-action version would have. It is very easy to forget that the characters you are watching are animations, and the action is CGI.<br><br>A meteor has struck the earth, carrying with it phantoms who strip away the life energy of whomever they contact. Dr. Aki Ross and her mentor Dr. Ced are locked in a stand-off against the earth's military forces, whose solution to this invasion may be worse than the invasion itself, and the mysterious phantoms who seem to have no specific purpose and can not be fought using conventional means. Following up on a quasi-mystical theory of Dr. Ced, they set out to collect 8 living spirits which must be used to harness the life force of earth itself in defense of the planet.<br><br>This film is dark and beautiful, with each scene a masterpiece of animated art. It feels less like a computer game than an immersive experience in an alternative universe.<br><br>A fast-paced action film, Final Fantasy blends elements of folklore, science and animated battle sequences into a satisfying, well balanced and well paced film. It is probably the most thoughtful computer game -inspired film I have seen.","user":"mstomaso","rank":[53,61]}]