[{"title":"I think this movie traumatized more kids than \"Jaws\"","rating":26,"date":"26 January 2012","review":"If your idea of a dark comedy is something like \"Beetlejuice\" or \"Deathtrap\" or \"Heathers\", then watch out. This one makes them look like Peewee's Playhouse.<br><br>You know how certain horror movies cross over into comedy? Like when Freddy Krueger says \"Welcome to prime time b!tch!!\" and slams a girl's head into the TV? Well, this is the opposite: comedy crossing over into horror. It gets pretty weird, and if you're not expecting it, it can be downright upsetting.<br><br>I think that's what makes so many people hate this movie. With an all-star comedic cast like it has, it promises to be a laugh riot like the DVD cover says. I was expecting something like \"Ghostbusters\" meets \"Fletch\" meets \"Summer Rental\". Instead it's more like \"Planes, Trains &amp; Automobiles\" meets \"Deliverance\". In other words the comedy is very low-key, not quite enough to offset the disturbing story.<br><br>Dan Akroyd, who plays a sadistic murdering judge, is just plain frightening. John Candy, who plays the sympathetic policeman, gives the story an air of tragedy. Chevy Chase is his usual wisecracking self, but it can't compete with the horror &amp; violence of the plot (being trapped in a hicktown house while people are getting brutally murdered all around you). You really have to be ready for it, otherwise you might end up traumatized. The \"Bonestripper\" scene will give lifelong nightmares to any kid under the age of 12, as well as impressionable adults.<br><br>But now that you've been warned, perhaps you'll be able to take it in stride. I'm not sure if writer Dan Akroyd intended this to be so nightmarish, but it sure is. Definitely a one-of-a-kind. NOT for young kids!!","user":"rooprect","rank":[59,68]},{"title":"Give this movie a try before you pass it by...","rating":8,"date":"15 October 2005","review":"I, unlike a lot of others, found this movie to be extremely funny- both in a smart way and a sort of gross out way. Chevy Chase is really funny with his sort of smart-ass, dry wit, probably his best performance after Christmas Vacation. From the movies I've seen Demi Moore in, this ranks as her best and shows that she can do comedy. Dan Akroyd and John Candy each pull double duty in this one and do it well- I couldn't even tell the second character Dan was playing until the credits rolled. The sets are unreal- from the junkyard (complete with piles and PILES of random junk and the Baby Huey-esquire Lil' Debil and Bobo) to the house of the honorable judge, it's hard to believe they actually put this together. Don't take everybody's word, check it out and you won't be sorry...","user":"flhero311","rank":[80,122]},{"title":"When an entertaining film becomes a flop","rating":10,"date":"13 August 2011","review":"I think I watched this film first on television and liked it....then I bought the DVD years later and loved it. I find this flick amusing, imaginative with good performances. So why was this film an ultimate flop at the box office? I didn't watch this picture because of any special actors who play in it. I believe a reason for this one being a flop is that people have a certain expectation if movie stars they love are performing...They are frustrated when they don't recognize Dan Aykroyd in make-up, when John Candy plays entertaining but without being overly funny and when Demi Moore is not as heart-wrenching as in 'Ghost'. That is and will be always an issue if you are a filmmaker for instance and have stars in your picture. They pull away quite some focus from the rest of the movie...Also, this film is a little gross at times and maybe for a big budget comedy people where not ready for that yet. I'd say this film was ahead of its time. One prove for that, supposedly 'Nothing but Trouble' has achieved a little cult status over the years.","user":"hilltom12","rank":[21,29]}]