[{"title":"\"Long Live The Hud!\"","rating":7,"date":"11 June 2004","review":"Another fascinating piece from the Coen Brothers, 'The Hudsucker Proxy' is an homage to the films of the 1930s. From the grey faux-Gothic cityscape to the over-the-top acting and rapid fire dialogue to the subdued colors to the stark sets, this film hearkens back to an earlier era of films. <br><br>The plot is simple enough. When company president Waring Hudsucker commits suicide, the board of directors, led by the deliciously evil Sidney J. Mussburger (Paul Newman) determines to devalue the stock by putting a 'shmoe' in charge of the company so that when the late Hudsucker's controlling interest in stock hits the market in 30 days, Mussburger's cabal can snap it up on the cheap. Enter shmoe Norville Barnes (Tim Robbins). Jennifer Jason Leigh is the newspaper reporter who infiltrates Hudsucker Industries under the guise of secretary, and is Barnes' love interest in the film.<br><br>Robbins performs more than adequately but is outshone by terrific performances by Newman and, in particular, by Leigh, who absolutely nails this role. Her saucy, lilt of the tongue is wonderful; she simply oozes sensual sass, and all in the very decent parameters of decades gone by in Hollywood.<br><br>Other highlights of the film include - the wonderful sets, where less is more; the usual Coen cinematography, which makes the film a visual delight above and beyond acting and plot; the clock (an unbilled role, in a sense). Curious characters pop up and return  Buzz the Elevator Operator, the Clock Maintainer, and many others. And, of course  that clock!<br><br>As will all Coen brothers films, this one calls me to see it again, as I always seem to discover new elements when watching their works for the second, third, fourth times, and beyond. A very worthwhile film  enjoy!<br><br>7 out of 10","user":"oghier_ghislain_de_busbecq","rank":[110,119]},{"title":"Magical","rating":9,"date":"22 February 2005","review":"The Hudsucker Proxy is a brilliantly entertaining movie from possibly the greatest writer/director partnership ever. The film is so engaging and whacky that many unfamiliar with the Coen's style may be turned away by it. However, the Coens are filmmakers who know what they are doing and this film is a perfect blend of reality and surrealism. Reminiscent of a classic movie from the 40s or 50s The Hudsucker Proxy has an atmosphere and look to it that we seldom see anymore. Part of this is due to the fabulous set design and costumes. But also, the Coens' direction and dialogue are top notch. One particular scene (near the beginning of the movie, so don't worry about spoilers) concerning a newspaper, a coffee cup and a heavy wind fills you with magical glee and perfectly sets the scene of this fantastic fairytale-like fable. Some may be disappointed by the ending but on close inspection it is a brilliant metaphor in a film that says so much about success, failure and how people cope with both. Paul Newman, Tim Robbins and Jennifer Jason Leigh are superb and are backed up by a cast that all gleam with their own wonderful persona including Steve Buscemi (sadly not in it enough), Bruce Campbell, John Mahoney and Charles Durning. So, If you want to see a film that will fascinate you, make you laugh and fill you with that magical joy that only the Coen Bros. can supply then The Hudsucker Proxy is the film for you.","user":"Bobby_DeNiro","rank":[18,18]},{"title":"Did the title kill this movie?","rating":9,"date":"12 October 2002","review":"That's the only reason that I can think of that explains why this movie wasn't more popular. Or maybe it's because this movie is more heart-on-your-sleeve sweet and uncynical than other Coen brothers movies. Indeed, the co-star and love interest, Amy Archer, must overcome her cynicism in order to see that she can love Norville. But like all Coen brother's movies, the atmospheric strangeness is really the star of the show.","user":"joeshannongabe","rank":[14,14]}]