[{"title":"Third Remove","rating":8,"date":"10 May 2005","review":"First thing: this is the third part in a trilogy. You really need to see \"Where is the Friend's House\" &amp; \"And Life Goes On\" first if you want to fully understand this. In short, this is a film about a man making a film of his own journey in search of actors in a film he made earlier. Once you know that, it's not in the least slow or simple, it's a hall of mirrors, as another commentator put it. Frames within frames within frames.<br><br>Second thing: Jean-Luc Godard praised Kiarostami's early films, but then felt he'd become too influenced by the international art movie tradition. I don't know if this is a film he liked or disliked, but it sure has a lot of Godard's influence in it - from the director interviewing sundry characters through the conflation of documentary and fiction elements to the use of music, it's like Godard crossed with Satyajit Ray. Not that that's a bad thing.<br><br>I don't know if Kiarostami is as original or as striking as some maintain - in many ways this is \"Day for Night\" transplanted to the Iranian countryside - but it's very watchable, often very funny and the landscape is beautiful.<br><br>There also seems to be (in the Iranian context) a subversive subtext to these films. Tradition is held up as hidebound and stupid (the adults in \"Where is the Friend's House\", the grandmother in this film) while the young are seen improvising their own lives and creating hope in the face of catastrophe. I can't imagine that's too popular with the mullahs, and indeed it seems that Kiarostami has been unable to get a film released in Iran in a decade.<br><br>Well worth a view, and it may even inspire you to get out into the world with a digital video camera, but do see the other films (and probably also \"Homework\") first.","user":"Krustallos","rank":[21,23]},{"title":"meaning hidden in small gestures of daily life","rating":9,"date":"22 August 2000","review":"I saw  the movie while on vacation in Sweden. Just clicking through TV channels, I stopped on this movie accidentally, initially not paying much attention to it. But the images started to attract me, finally they got hold of me. The realism of everyday life with some strange air of poetic aura was fascinating. The action just floats like a river, no big happenings but pictures are dense, close to skin, close to feelings. The people dreams pour out into daily life. The shaky balance between reality and a dream culminates in the last sequence and we hope for an answer, which is not disclosed but we are left to search it in our imagination and in our dreams evoked by this wonderful movie. Maybe longing for an answer is all what is possible.","user":"gronvius","rank":[25,30]},{"title":"no need to see the first two films in the trilogy","rating":10,"date":"12 December 2005","review":"I'd just like to disagree with those who suggest this film may not be accessible to people who have not seen the first two films in the trilogy. I haven't, but have not been as bewitched by a film since I saw Aggelopoulos' Travelling Players for the first time. My heart responded, the hairs on the back of my neck responded, my being responded. No matter if my brain wasn't fully au fait with what came before. Superb doesn't begin to cover it. How he captured these (non)performances from his actors is beyond me: perhaps, unfamiliar with the conventions of film-making, they were uniquely equipped to sidestep them.<br><br>Michael","user":"meleftheriou-1","rank":[24,31]}]