[{"title":"Silly but fun","rating":9,"date":"6 July 2006","review":"Chucky (the murderous doll from \"Child's Play\" and 2 crappy sequels) is dead. But his ex-girlfriend Tiffany (Jennifer Tilly) gets his remains and (using \"Voodoo for Dummies\") revives him. Then, through circumstances too convoluted to get into, SHE is killed and has her soul put into another doll! Together they fall in love and kidnap a nice couple (Nick Stabile, Katherine Heigl) to take them to Chuck's coffin to get an amulet to make Chucky and Tiffany real people again...<br><br>A lot better than it sounds. After the last two sequels to \"Child's Play\" (both of which were horrible) I was expecting the worst, but this actually was lots of fun. The movie doesn't take itself seriously for a second (seriously--how could it?) and the lines and situations are actually quite funny. Also there are a few VERY gory murders thrown in to satisfy us horror fans and the film never stops moving. The movie also has a few things usually not found in a horror movie--a gay best friend (Gordon Michael Woolvett) who is intelligent and not played for laughs and a sequence in which Stabile has his shirt off just to show his muscular body. John Ritter has a nice cameo too as a sheriff.<br><br>The acting is good--Stabile is young, VERY handsome and likable; Heigl doesn't have much to do but pulls it off and Brad Dourif (the voice of Chucky) and Tilly are hilarious as the murderous dolls. My favorite part is when the dolls have sex (don't ask) and she asks for a rubber and he responds, \"But I'm MADE of rubber!\" The special effects are good (no lousy CGI here) and this is one of the few horror films to mix humor and violence in an entertaining way. Well worth seeing. I give it a 9.","user":"preppy-3","rank":[17,20]},{"title":"Who The (Beep) Is Martha Stewart?(**** Out Of ****).","rating":10,"date":"13 December 2012","review":"Well my opinion has changed for this one because if you remember last time I gave this movie 3 1/2 out of 4, now it is up to the full 4. So just why is this one the one sequel that I like out of all the others? Well a lot of good reasons come into mind.<br><br>The film picks up about a month after Child's Play 3, where Chucky's remains are stolen by Tiffany played by Jennifer Tilly and she takes them back to her house and sews them together. When her wannabe goth killer boyfriend comes over, Chucky comes alive and kills the boyfriend in a very bloody death. It is revealed that Tiffany and Chucky were dating before Charles Lee Ray was put inside the doll. They at first are happy but Tiffany locks Chucky in a playpen because Tiffany was under the false impression that Chucky was going to propose to her. Chucky, Now raging mad, Kills Tiffany and puts her inside of a doll body. They take a couple played by Nick Stabile and Katherine Heigel hostage and plan to posses their souls.<br><br>The first good thing is the story. I really like how they don't really go after Andy here and instead go after new people. However They at least could have mentioned him more than they did, at least more than a newspaper article. Also I love the idea of giving Chucky a bride so he can have another doll to interact with.<br><br>The next is the Bride Of Chucky. Her character is really well done here and I like how Jennifer Tilly does voice Tiffany. The look of the Bride is pretty cool with the doll starting out as a wedding doll and then transformed in this goth/biker chick look. Plus Chucky gets lucky, twice. The first is, obviously when he gets married but the second is when he really gets \"Lucky\" if you know what I mean.<br><br>The next is the special effects which are better than the last two. Chucky is now all scarred up and this look is pretty frightening but to be completely honest I found his appearance in the first film more scary, But I do love the look they go with and this look does continue into Seed Of Chucky.<br><br>The last is the acting. Stabile and Heigel do a really good job and are believable as a couple, John Ritter, yes he is in the movie, does a good job as a dirty cop. But I want to talk about the dolls. The voice acting by Brad Dourif and Jennifer Tilly are great. Plus Jennifer Tilly is hot. Both in and outside of the doll.<br><br>The Final Verdict for Bride Of Chucky is 4 Out Of 4 Stars. Great acting, amazing special effects, also not to mention the movie is extremely funny. My favorite quote is from Chucky and it was used for the title of the review. Go out and watch this because it deserves to be seen.<br><br>Rated R For Strong Horror Violence And Gore, Language, Some Sexual Content And Brief Drug Use.<br><br>1hr 29min/89min.<br><br>15 uses of the F-word.<br><br>Cost: $25,000,000.<br><br>Box Office: $50,692,188.<br><br>IMDb Rating: 5.2/10.<br><br>Rotten Tomatoes Rating: 42% Rotten My Rating: ****/****","user":"kylehaines96","rank":[11,13]},{"title":"The many deaths of Chucky.","rating":8,"date":"8 April 1999","review":"Well, as you can see, everyone's favorite blue overalls-wearing psychopathic doll has survived for a fourth installment. An excellent fourth installment, at that. I was very impressed with this one, especially after the \"dullness\" of Part 3 that got me completely bored that I doubted that there would even be any more sequels. . . Boy, was I wrong. But it just seems that in \"Bride of Chucky\" you actually feel some chemistry going on between him and Tiffany. Not only that, but it always seems that in the \"Child's Play\" series you could never really tell if Chucky's dead or not, whether he's shot in the heart, exploded into bits of pieces, or hacked up in a huge fan.<br><br>This film also includes some memorable scenes, for example, the stunning segment where that guy gets blown to bits by getting hit by that huge truck. Pure genius from the film's screenwriter, and creator of characters, Don Mancini.<br><br>Yes, shocking was the movie, the ending especially. Some good dialogue, a great plotline, pulse pounding suspense, and a hard-hitting soundtrack, \"Bride of Chucky\" promises everything the previews do and may become a famous pick-out in the horror genre. Highly reccomended for die-hard fans of the \"Child's Play\" series.","user":"Weirdo-x","rank":[23,33]}]