[{"title":"Dumb and Dumber","rating":10,"date":"5 February 2020","review":"In my opinion the greatest comedy ever made! Daniels and Carrey work magic together in this film that more than 20 years later is finally considered a classic. When it first came out it was labeled as complete garbage and toilet humour. But to those people I say it is the best garbage and toilet humour you could ask for. What do you expect to see when the title of the film is ''Dumb and Dumber''. The quick back and forth between the two lead actors and not so subtle chirping often goes unnoticed because your'e laughing so hard from the previous scene.the jokes and dialogue are so good and Carey and Daniels deliver them with such authenticity. It's because of this reason that I am able to watch this movie countless times and still be entertained, as I listen to funny remarks that I missed on the previous 100 viewings. What's truly great about this film is that even people who say they hate it will always without fail crack a laugh or two when re-watching it. They just don't want to admit that they find this nonsense to be funny...but it is. More than 20 years later and I still have not seen a buddy comedy that comes close to matching it.","user":"MR_Heraclius","rank":[41,45]},{"title":"Will most likely continue to be the funniest movie of all time.","rating":10,"date":"1 February 2006","review":"Dumb and Dumber is a stupid movie, but what some people don't understand is that is what it is supposed to be! It's about two completely pathetic, dumb, and hopeless guys who do nothing but make complete fools of themselves. Jim Carrey and Jeff Daniels give the greatest comedic performances and form the best duo that has ever graced a screen. Every scene, every sentence they speak, and every body movement is pure genius. The way that each of them deliver their lines makes this movie an all time classic that will never get old. I never understood how someone could not like this movie. The only explanation I could have is they think they are too \"intelligent\" for a \"dumb movie\" like this. What they don't even understand that it's not the jokes or gags that make this movie so great, it is all in the performances. To those of you who do not like this movie please give it another try and watch Jim Carrey and Jeff Daniels play the roles that they were meant to play.","user":"cornhol675","rank":[316,392]},{"title":"\"Dumb and Dumber\" is really \"Funny and Funnier\"","rating":10,"date":"2 November 2006","review":"This movie goes from joke to joke constantly and never misses a beat. I could not stop laughing the first time I saw it, and the tenth time I saw it, and the hundredth time I saw it. This movie never gets old. There is not one single dull moment. The movie takes off and never lets up, not even enough to let you breathe. There is something absolutely mesmerizing and hilarious about Jim Carrey and Jeff Daniels' performances as the lovable idiots Lloyd Christmas( Jim Carrey) and Harry Dunne (Jeff Daniels).<br><br>The movie starts out in Providence, Rhode Island with two guys who are down on their luck. They've just lost their jobs, are late on the gas bill(again), and make the best of a bad situation by returning a briefcase they've recovered to its rightful owner, an attractive woman named Mary (Lauren Holly). And Lloyd(Carrey), has fallen madly in love with Mary after driving her to the airport. It just so happens that Mary lives all the way across the country, in Aspen, Colorado (or is it California?) Sure its crazy and stupid, but they've got nothing to lose, so they take off in their 84' sheepdog. And let's face it, if we were them, we'd go too.<br><br>Dumb and Dumber was not pretentious, the actors never made you feel like they were in on the joke. No, they played it with a straight face the whole way through, and that's really the best way to do comedy. Even when they aren't speaking, their body language alone is enough to elicit huge laughs. The reactions and facial expressions are perfect.<br><br>The film wasn't warmly received by a lot of critics, but only because they couldn't lower their snouts long enough to realize that this was not another movie about dumb guys, but really a film about earnest guys. And they are pathetically funny just being themselves. They play stupid games in the car to pass the time, and sing aloud to keep from getting bored, and have crazy dreams of one day opening up a worm store.<br><br>The movie plays out with a high spirit and feel good attitude that can't be matched. And the soundtrack is perfect; it really sets the tone and never feels out of place.<br><br>Really, truly, without a doubt, the best comedy ever made. I will treasure this movie forever, and even when I watch it the 101st time, I know it'll make me laugh... and laugh... and laugh till it hurts.<br><br>The film is well paced and has a spontaneous nature that lacks in most comedies. Behind all the stupidness, there is a real glow of brilliance. The fact is, more than all the goofiness and crazy antics, \"Dumb and Dumber\" is a film full of smarts, and that's what we end up admiring the most.","user":"iggyivan","rank":[75,89]}]