[{"title":"I am not someone to randomly give out a perfect score for a movie...","rating":8,"date":"22 September 2006","review":"...And I also happen to be a very critical person of most films. With that being said, The Crucible completely blows me away with its virtually flawless cinematic achievements!<br><br>Daniel Day-Lewis is absolutely superb as John Proctor; there is no other way to put it. He is simply perfect, from his bitter, withdrawn opening few lines to when he is accused of witchcraft by his former adulterous--and scorned--lover (Winona Ryder) and begins passionately fighting for his very life and existence--and, of course, his name.<br><br>Winona Ryder turns in a beautiful performance as the disturbed and tragic Abigail Williams: a Puritain orphan raised by her super-strict, brutal, and overall villainous uncle. She becomes infatuated with John Proctor, a married man and a bit of an outcast to their society, and is willing to do anything and everything to 'obtain' him, if you will.<br><br>Joan Allen's Oscar nomination for Best Supporting Actress was not undeserved. Her portrayal of the honest and saintly Elizabeth Proctor (not fake innocence, like Abigail's) was touching and a bit heart-wrenching toward the end (won't give that away here).<br><br>It wasn't just the awesome acting that won me over, but the authentic Old English dialog, the somewhat grainy cinematography (which provided an uneasy feeling in viewing the town of Salem), and wonderful sets and costumes that really made this a classic for me, and my all-time favorite movie. Highly recommend it! A perfect 10/10!","user":"sugar_n_spice","rank":[76,86]},{"title":"One of the finest plays in history is turned into a cinematic masterpiece.","rating":10,"date":"18 October 2007","review":"One of the finest plays in history is remarkably turned into one of the finest masterpieces of the '90s. Arthur Miller's original story is one of power and the terrible nature of society on two fronts. First, it tackles the inner struggle of a morally strong man who's emotions get the better of him and the girl who will do anything to have him be her's forever. Secondly, it displays the flaws of the government and society in general, and how one person's claim can corrupt an entire town. It's a stunning take on the foolishness and utterly unbelievable nature of a topic that dates back to the Salem Witch Trials, McCarthyism and is even poignant today in terms of the War on Terror.<br><br>The topic that interested me more was the first one I spoke of; a striking study of a moral man who's done a wrong and the pain he has to suffer because of it. John Proctor (Daniel Day-Lewis) is a working man, who gets whatever he earns with his bare hands. His wife, Elizabeth (Joan Allen) is the standard working class wife. While John is in the field, she gets dinner ready and gets the house in order. Lingering over this seemingly perfect marriage is a secret that has isolated them from the rest of the community. John's affair with a former servant, Abigail Williams (Winona Ryder) has created a cold, emotionless relationship between the two but Elizabeth's devoted love for him means that they will stay isolated and no one will ever know of his sin which would surely lead to his hanging. Of course no man can endure this experience without suffering some severe inner pain and this slowly unfolds over Proctor throughout the course of the film.<br><br>In the end, after turmoil between John and Elizabeth both trying to do the best thing for each other that has turned into the worst case scenario for both, Proctor's pain is unleashed in one of the most heartbreaking scenes in as long as I can remember. He agrees to proclaiming his life in the world of witchcraft in exchange for releasement from prison back to his wife and unborn child. But when they ask for his signature on the statement, and state that they will post it on the church wall, his years of torment and internal frustration explode as he pleads in a scene of gut-wrenching release as he begs for the jurors to leave him his name. This story is all highlighted by an absolutely brilliant and cathartically heartbreaking performance from Daniel Day-Lewis. He even upstages the commanding Queen Joan Allen (who also delivers a superb performance) in several scenes, and delivers one of the finest examples of acting genius I've ever had the privilege of experiencing.<br><br>This entire relationship and painful release is experienced under the grand scheme of the Salem Witch Trials, an eye-opening display of how easily the government and society can be fooled and won over. Due to her love for John Proctor, Abigail Williams will do anything to take Elizabeth out of the picture. Even if this means bringing down all of Salem in the process. She starts claiming that everyone is a witch, along with her numerous friends who so easily follow her example, in order to avoid getting into trouble. When she realizes how brilliantly this works, and how everyone she claimed practiced witchcraft ended up in the gallows, that she could use it to end Elizabeth and live a happy life alone with John. Of course the folly of youth is there blind belief that everything will work according to plan, and she underestimates Proctor's love and devotion to his wife who he clearly shows he will go to the grave with. Abigail see's that no matter what she does, she won't get John back and flees Salem in the midst of night, never to be seen again (at least as far as the film/play is concerned). Winona's performance is also very strong and ranks high among the best of her career and of 1996.<br><br>At the center of this entire story is how easy it is to sway society, shown through these Witch Trials. Arthur Miller originally wrote his play to comment on the foolishness of McCarthyism; the children representing McCarthy, the jurors obviously as the government and the false witches as the dozens of people that McCarthy accused of being a communist under no grounds that were put into prison for being completely innocent. These two incidents in American history show that the government lies down to the very core of their jural structure. The phrase 'Innocent until proved guilty' is one of the most abused in history and these historical accounts prove that we are and have always been much more about the reverse; guilty until proved innocent or, in terms of the Witch Trials, hanging unless you admit your guilt. Even now we see the flaws of the governmental structure as numerous people are being claimed to be terrorists and are put in prisons, though there is no concrete evidence of that which they are prosecuted for, just the false claims of a foolish society.","user":"dead47548","rank":[17,18]},{"title":"Just fantastic","rating":9,"date":"20 May 1999","review":"Based on possibly the greatest play ever written, The Crucible is a fabulous movie - it's hard to believe that it was actually distributed by 20th Century Fox, and not an independent company. Why it took so long to be adapted for the big screen is just baffling to me. Thank God that the genius behind the original text, Arthur Miller, was permitted to write the screenplay - and get an Oscar nomination for it! The cast are all to die for, with Winona Ryder proving she doesn't always have to play lovable characters like Charlotte Flax in Mermaids (1990), or Jo March in Little Women (1994) - her performance as the malicious Abigail Williams is just as outstanding. In her Oscar nominated portrayal of Elizabeth Proctor, Joan Allen leaves an indelible impression of marvellous acting. I was in tears in the scene where she and John Proctor (Daniel Day-Lewis) fall in love all over again. I sincerely hope that The Crucible will be shown in schools/colleges in years to come, to remind us of the horror that occurred in 17th century Salem. A work of cinematic genius.","user":"Barnes-3","rank":[59,75]}]