[{"title":"Not as Bad as Anticipated.","rating":5,"date":"4 August 2006","review":"\"Children of the Corn V: Fields of Terror\" is the fifth in the series, and actually wasn't as bad as I was expecting it to be. Now I'm not saying it's great, but it wasn't a complete waste either. This film is about a group of teenage friends who happen to be driving through a small midwestern town that is home to more of the evil child cult. When they crash their car, however, and have a creepy encounter with the children who emerge from a cornfield, they decide to try and get help somewhere. They end up finding an abandoned farmhouse that is currently for sale, and decide it is perfectly okay to shack up there and raid the cupboards where the only find some Maracchino cherries. Of course, the house is right at the edge of a cornfield, where the evil kids are lurking. From there on, the friends begin to drop like flies, all meeting grisly fates from the children.<br><br>This was alright, I was expecting something much worse (I usually expect the worst from films like this). The story wasn't really original, but none of these sequels are so that doesn't really matter. The friends decide they're going to try and help the children, which is rather ridiculous. The acting was a surprise, it was actually decent. The only cast member I recognized was Eva Mendes from \"Urban legends: Final Cut\", the rest are pretty much unknowns. We had some good cameo appearance by David Carradine, an evil supporter of the cult, and Kane Hodder (who played Jason in some of the \"Friday the 13th\" films) in a minor role of a local bartender. I really didn't the movie was that bad though.<br><br>Overall, this isn't as good as \"Part IV: The Gathering\" was (in my opinion at least) but it was an alright follow up. Don't take it so seriously, you might enjoy it. Of course it's campy, but in a good way. 5/10.","user":"drownnnsoda","rank":[7,10]},{"title":"Fun Slasher Flick!!!","rating":10,"date":"14 December 2001","review":"Unlike many people who apparently don't like the Children of the Corn sequels, I happen to believe this is the best one of the series, I simply love this film, I think it is a great Slasher flick, not scary, just lots of fun, the cast was atractive,it was well acted, it has several familiar faces and there was MORE  blood and special effects THAN in a lot of recent mainstream movies.","user":"JimSthers","rank":[11,18]},{"title":"Not as bad as I expected.","rating":6,"date":"15 April 2003","review":"\"Children of the Corn 5:Fields of Terror\" is actually better than the following entry \"Children of the Corn 666\".The acting is pretty good and the cameos by Fred Williamson,David Carradine and Kane Hodder are nice to see.The pacing is decent and there's a bit of gore.So if you like slasher/splatter movies give this one a look-I still think that Fritz Kiersch's \"Children of the Corn\" is the best of the series!My rating:6 out of 10.","user":"HumanoidOfFlesh","rank":[7,11]}]