[{"title":"A trip into the mind of a serial killer.","rating":9,"date":"13 April 2005","review":"Before I start this review, let the words of German director Jorg Buttgereit explain his intentions: 'Welcome to a trip into the mind of a serial killer. When Franz Rodekirchen and I sat down to write the script for Schramm, we had seen a lot of so-called 'serial killer' moviesit seemed to us that these films were more about some police guys who try to quit smoking because their wife had left them. In the end they hunt the killer down, put him in jail, and the world is savedSo, f--k all the police stories. We couldn't afford to rent a police car anyway. So we started concentrating totally on Schramm - the man, the loner and his guilt, looking for love in a world so far away.' True to his word, Jorg Buttgereit does indeed 'f--k all the police stories' and concentrate on the lonely, emotionally fragile and somewhat psychotic Lothar Schramm (Florian Koerner von Gustorf), a man living alone in a small flat opposite a prostitute (Monika M) whom he lusts after. But Schramm isn't too good at male/female relations, indulging himself with a bizarre blow-up doll rather than make advances towards his true love. Schramm's problems lie directly in his sexuality, killing female victims and putting them in sexual positions for him to photograph and use for his own personal gratification. Schramm punishes himself for his crimes, at one point hammering a nail into his foreskin because of the frustration and sexual inadequacy that often provokes him. He dreams of a literal vagina dentata, a monstrous, toothed female genitalia that crawls in his bed on slippery tentacles towards his crotch. Schramm truly is scared of women, the castration scenario quite literal in his head, and his rage seems to be stemmed from this. But amongst all of the disturbing imagery and violent rage, Schramm dreams of the beach, of being a little boy again, and of the prostitute who lives over the hall from him.<br><br>The film is told within a fractured time-line, jumping back and forth between the present (where a fallen Schramm lays dying) and Schramm's past murders. The film is full of disturbing images and hard-hitting gore, but more interestingly, a story of unrequited love. At times it is a hard film to watch, with von Gustorf giving a remarkable performance that seems to defy acting conventions, giving Lothar Schramm an earthy, realistic edge that would be more suited to documentary. The visual style is one of a talented filmmaker with very little money - lots of imaginative movements and angles but with a raw, amateurish edge that only serves to heighten the dark, edgy world of Lothar Schramm.<br><br>Bizarrely, about half way through, the film takes a unique and frightening jump completely out of the narrative to show a man shooting himself in the head outside Schramm's flat as the crew film on, supposedly witnessing an unplanned suicide. Although staged, this sequence suggests it is snuff, and its pure incompatibility with the film takes you completely out of the narrative for a few seconds, wondering just what the hell is going on.<br><br>Buttgereit, best known for his super 8mm feature Nekromantik, has constructed a unique and powerful film that deals with human feelings and frailties whilst maintaining enough nastiness to please horror fans and a certain art-house pretension that invites analysis into its narrative and imagery. Not for the faint-hearted, or those unfamiliar with Buttgereit's work, Schramm proves to be a thoughtful, intelligent film where not all is what it seems.<br><br>At only 60 minutes long, Schramm won't take too much out of your day, but it will stay with you for weeks afterwards, leaving indelible images in your head that you wish you could shake off. Like Schramm, you might feel a little dirty after watching it, but ultimately you'll feel rewarded.","user":"captain_bungle","rank":[27,31]},{"title":"Could have, should have been much more.","rating":5,"date":"12 September 2006","review":"The first thing I would like to point out for all potential viewers is that this is not a gory film as much as it might be mildly disturbing. There are scenes of blood, but this doesn't necessarily constitute 'gore'. This is just my opinion, though.<br><br>Schramm is, as most already know, based on a lonely psycho with issues, many of which revolve around women and 'unrequited love' as someone else put it. While I understood the base and idea behind the film, I was left wanting.<br><br>Schramm managed to pique my interest but did little more. There is nothing here to flesh out the serial killer; just hints of his self-loathing and dementia. I would have liked some kind of inner monologue at points in the movie, to hear what the killer was thinking during and after his murders. Did he hate his body or did he just enjoy pain? Was he afraid of women or really just somewhat of a necrophiliac? Did he hate was he was doing, though he could not stop, or was he laughing maniacally on the inside? What exactly drives him? Many questions, few answers. Perhaps that was the point though, to leave one thinking and drawing their own conclusions. Maybe not.<br><br>In the end, I found this film did not live up to the hype. It wasn't necessarily bad, but it most certainly could have been better.<br><br>For those interested in 'gore', find something else. Schramm will not entertain you.","user":"gaeanprayer","rank":[16,19]},{"title":"If you can take it, be hit by this film.","rating":23,"date":"23 May 2001","review":"I  think of Schramm like a train and you're tied to the tracks. Its a primitive film, full of aggression and violation. Buttgereit's film Nekromantik was snide and built up a cult, Schramm has more narrative than his film Der Todesking but its definitely not linear. Schramm retains the trademark cinematic dissociation Buttgereit does so well and which makes this film disturbing. Its the cheapness of the gore and the ordinariness of the surroundings which makes the dissociation possible. Odd to say, but there's a scary realism here in the blankness and bleakness. Its grosser than ever in Buttgereit land and this tale of a self-abusing, disturbed killer is compulsive viewing if you can","user":"Mattydee74","rank":[9,11]}]