[{"title":"Wit, depth and beauty - Will Wilde follow Shakespeare to Hollywood?","rating":18,"date":"18 June 1999","review":"As I left this movie, someone said \"How nice to see an intelligent movie!\"<br><br>The risk going in was that it would be ONLY an intelligent - or at least clever - piece, all period manners and costumes. In fact, with all the Oscar Wilde wit which sounds wonderfully fresh here, there are also rich moments of emotional depth throughout this amusing but also quite moving film.<br><br>One theme here - touching in hindsight - is how little it can take to destroy a reputation - Wilde was later to have some of the most painful possible firsthand experience of this.  But the central question here, which anchors the humor and beauty that decorate it, is the cost of rigorous, even rigid, honesty. And the growth of the central characters on this point shines through, even through the dance of wit and farce.<br><br>Underpinning this is a surprising faith in human nobility, quite in contrast to the ironic persona Wilde maintained.  It struck me while watching it both that Wilde had very French characteristics - a continental finesse, the love of repartee - and yet was profoundly an English writer by virtue of his faith in fair play and the bonds of (platonic) male friendship.<br><br>In fact, Lord Goring, whose world-weary ways make him something of a surrogate for Wilde, is a distant cousin to Sidney Carton in coming to the defense of a 'nobler' friend even at great (possible) sacrifice to himself. His very lack of seriousness is what makes his efforts on behalf of his friends so moving.<br><br>With this, the pure visual beauty of actors like Cate Blanchett and Rupert Everett, matched by sumptuous costumes and sets, adds a sensuous element which, in a lesser film, might have dominated the movie. They, with Minnie Driver in cheeky comic form and Julianne Moore sweetly evil and superbly English, make it a delight both to watch and to savor later as tart food for thought.","user":"jimcheva","rank":[48,54]},{"title":"Superb filmmaking","rating":10,"date":"19 January 2000","review":"To say that this film is a filmmaking tour de force would be a great injustice.  It is far better than that.  Oliver Parker's revitalizing of Oscar Wilde's classic play is filmmaking at its finest.<br><br>Every element of this film is superlative.  Wilde's story as adapted to the screen by Parker is witty, intelligent and engaging from start to finish. Seldom can you find a story that attempts to be a romantic comedy, a tale of duplicity blackmail and betrayal, and a drama of political intrigue, and succeeds so well on all counts.<br><br>The intricate weave of deception, manipulation and double entendre along with comic misperception, irony and rapier witted dialogue are delicious and classic Wilde.  This is a film you will want to see again and again, just to discover all the lines within the lines.<br><br>I cannot say enough about the brilliance of Oliver Parker's direction in this film.  He has captured late 19th Century aristocratic England with vivid and rich images that put the viewer right into the period.  David Johnson's cinematography is fantastic, with every scene working well as to lighting and color.  The beautiful blend of colors in the costumes and the set always looked like they belonged together.  Parker also provides numerous interesting camera angles that help dramatize the scenes.  It serves to remind us that glorious films can still be made relying on the creative eye of the director rather than special effects.<br><br>The acting was delightful.  Rupert Everett, as the self absorbed Lord Arthur Goring, delivers an exquisite performance as the unscrupulous rogue upon whom the mantle of truth and honor is laid.<br><br>Julianne Moore was delightful as the evil and cunning Mrs. Cheveley.  As cold, manipulative and heartless as she is with Chiltern and Lady Chiltern, she is that vulnerable and helpless with Lord Goring, for whom she has long held a flame.  Moore handles this emotional juggling act with great skill and you find yourself simultaneously loving her ingeniousness and hating her treachery.<br><br>Cate Blanchett turns in another wonderful performance as the oh-so-perfect, Lady Gertrud Chiltern.  Jeremy Northam is also excellent as Robert Chiltern, the man of untouchable character with a scandalous secret in his past.  Even Minnie Driver is charming as Robert's sister.<br><br>This is a terrific film for the refined viewer who appreciates all aspects of filmmaking.  Even for those not into the art of filmmaking, it is simply great entertainment.  I can think of no negative criticism of it.  It is well written, directed, photographed and acted.  It is filmmaking the way it was meant to be.  A perfect 10.","user":"FlickJunkie-2","rank":[44,52]},{"title":"Surprisingly good - surprisingly timely, terribly marketed","rating":9,"date":"26 February 2000","review":"I saw \"An Ideal Husband\" at the Old Vic theater in London, and was surprised at the time how timely a 100 year old play could be.<br><br>When I saw the trailers, TV ads and posters for this version, it seemed like an entirely different story--will Rupert Everett get married off. That's certainly a thread in the movie, but in the marketing of this version, they made it appear as if it was the entire wardrobe.<br><br>I didn't see the film when it was in theaters because these ads, with their very modern music and fast cutting, made the film look like a joke.<br><br>But when it came out on video, I decided to try it, and am glad I did.<br><br>The film itself is excellent. Beautifully shot and paced, with an expert cast. Wilde's humor shines through, and the writer-director has done a wonderful job \"opening\" up the play into a film, without changing anything important. It's a masterful job of translating from stage to screen.  It's really so crisply done, and very funny.<br><br>In years to come people will realise that this is a fine movie version of this play. And by then, hopefully, they will have either forgotten about the marketing campaign, or hopefully learned from it.<br><br>I recommend the film.","user":"danielwill","rank":[19,21]}]