[{"title":"A good, watchable movie despite its flaws.","rating":7,"date":"25 April 1999","review":"Compared to previous attempts by competing studios to break Disney's stranglehold on the animated film market, The Swan Princess really is a good movie. The animation does not quite have Disney's finesse and got a little rough in places, but was still watchable and generally pleasing to the eye, unlike, say, Thumbelina. The songs, though not particularly memorable and vaguely cheesy in the manner of much older animated flicks, did not bring the movie to a grinding halt and actually managed to, in general, help it along. It has a plot.<br><br>That's not to say that The Swan Princess doesn't have its problems, mostly in its characters. The titular lead, Princess Odette, is a flat failure as a heroine--she never *does* anything except lead her one true love, Prince Derrick, to her--and even then, she only does that because her animal friends, Puffin, Speed the turtle, and Jean-Bob the frog, cook up the plan for her.<br><br>Derrick is much more likeable, and though throughout most of the movie he is a flaming idiot, he is a likeable and sympathetic flaming idiot--and he does learn. His mistakes are, as a rule, human and understandable, and in the end it is he who saves the day and finally learns the movie's apparent lesson--that beauty is not all there is in matters of love or anything else.<br><br>The development of their relationship is refreshing--rather than falling in love at first sight, they start out hating each other with a passion, and it takes them years--spanned capably over the course of one amusing if sugary song--to realize that they do love each other. And then Derrick blows it(!), and spends the rest of the movie scrambling to recover from his mistake.<br><br>The end battle was satisfying, though in general I prefer for the heroine to help save their hides in some manner. The movie-makers were not afraid to beat the living daylights out of their hero, and though the save he pulls in the end is nothing short of miraculous, it was at least shown much earlier to be within his princely capabilities.<br><br>Despite its flaws, I found The Swan Princess to be a satisfying and re-watchable movie--though I did catch myself agreeing with Derrick's comment (stated early in the movie) that he could do much better.","user":"Raven-49","rank":[28,37]},{"title":"loved it","rating":8,"date":"19 December 2005","review":"*sigh* I was like around 2 years old when it came out and apparently it was a favorite of mine along with the Disney classics and such. And even though I'm 13 now.. i still love it. A total classic love story where the two \"lovers\" are separated and the Prince has to find the Princess. I love the songs 'This Is My Idea' and 'Far Longer Than Forever'. This Is My Idea is probably my favorite because it shows Odette and Derek grow up together and it's quite funny when they come to the \"This is not my idea.. This isn't my idea.. of fun\" since it usually concludes humorous scenes. Any young child would love it.. especially girls. The animal-trio are hilarious especially Jean-Bob and Speed.","user":"puteriain6","rank":[20,26]},{"title":"A cult classic that has been stuck with me since my childhood","rating":8,"date":"14 January 2013","review":"After Disney released \"The Lion King\" which has been met with critical praise and became a success at the box office for the company, Disney animator Richard Rich (known for directing \"The Fox and the Hound\" and \"The Black Cauldron\") teams up with New Line Cinema to make their very first animated feature, \"The Swan Princess\", based on the Swan Lake ballet.<br><br>It tells the story about two kids named Derek &amp; Odette who started to hate each other for about a long time until one day, as young adults, they finally realize that they do love each other, but Derek ruins the wedding by saying \"What else is there?\" and they will never see each other again. Meanwhile, an evil sorcerer named Rothbart captures Odette and turns her into a swan that would only turn her back into a human as the moon rises. As Derek tries to find Odette by learning from his mistake, Odette and her animal friends Jean-Bob, a frog, Speed, a turtle, and Puffin, a bird attempts to bring her back to Derek.<br><br>I first saw this film when I was a child and it has been stuck with me ever since even as a young adult (I'm turning 19 soon, by the way). It still holds up, but there are two problems that I do have with this classic. The animation is beautiful and colorful, but is a bit deflated some of the time. Derek is a bland character, but is a somewhat sympathetic character since he learned that to love a woman is to prove his love for her.<br><br>Flaws aside, everything else still holds up. The story is very original and sticks closely to the ballet without any ballet dances which works for me. The characters are charming and likable; Odette is a beautiful and feisty character and I liked her hair as well. The side characters including Bromley, Rogers (whose line \"How To Offend Women In 5 Syllables Or Less made me laugh) and Uberta, who never fails to steal every scene in the movie. The animal sidekicks including Jean-Bob, Speed, and Puffin are excellent. The villain Rothbart, voiced by the late Jack Palace, is great and his motives, although over-the-top, are very amusing. The songs, on the whole, are pleasant and memorable to listen to especially \"Far Longer Than Forever\". Even the ending is satisfying. The battle between Derek and Rothbart is the best highlight of the movie because it represents some of the past-Disney films with a style and tone to it.<br><br>Overall, The Swan Princess isn't a masterpiece, but it's by no means a cult classic that has been stuck with me since my childhood. It may have received a mixed reception when it was first released, but I'm recommending this to those who love Disney and Non-Disney films.","user":"gavin-thelordofthefu-48-460297","rank":[7,8]}]