[{"title":"Meryl Streep Italian Style","rating":9,"date":"29 August 2005","review":"Meryl Streep is absolutely astonishing. I forgot it was her ten seconds into the film. That opening breakfast scene where all of her story is written in her magnificent face. As an Italian I know there is no acting involved here. She IS Italian. She reminded me of Anna Magnani in \"Bellissima\" there is not a single false note. Clint Eastwood, clearly, dedicates the film to her and the results are pure magic. The film is based on an unreadable book- at least I couldn't get through it, in spite of the brevity of the volume - the film however, is bound to become a classic thanks to the powerful chemistry of the stars. If you love film,like I do, I recommend you to see it once and let yourself be taken away by the truths in Meryl's eyes then go again and take note. Look at every one of her moments, from how she closes the refrigerator door to her laughter. Look at her reaction when she discovers that Clint stopped at Bari, her home town, just because he thought the place was pretty. Look at her hands, her walk and then go back to her eyes. It's a treat of the first order. Clint, in front as well as behind the camera,does a miraculous job. I passionately recommend it, no matter how young you are.","user":"ccrivelli2005","rank":[227,262]},{"title":"Meryl from Bari","rating":9,"date":"26 September 2007","review":"When the soul of a movie is reflected in an actor's eyes then you have a miracle, you have something that's going to last. Meryl Streep in \"The Bridges Of Madison County\" is such a miracle to me. I never thought for a moment that she, no matter how wonderful an actress she is, could fool me. Meryl Streep could never be Italian. Well, there I was, thinking and pre-judging like people I detest. I was so wrong. Not just because she fooled me, although there is no fooling involved here. She won me over. I forgot she was Meryl Streep, the actress, and I lived Francesca's story to the fullest because, I suppose, that's the mystery of great acting, I was confronted by her sheer undiluted truth. The truth in her eyes in every one of her gestures. The truth on her brow. Her thinking, transparent. Clint Eastwood does the right thing putting the entire film at her service and placing himself as the foil to liberate that powerful latent side of Francesca. I though it was ironic and I'm not sure if was meant to be that a wonderful woman like Francesca will sacrifice, what could arguably be call the love of her life, for those children. The grown children's mediocrity was kind of shocking to me. Will the revelation of their mother's secret, reveal a latent, greater side to their natures. I hope so. Francesca deserved extraordinary children. Try no to miss this little miracle.","user":"fanaticusanonymous","rank":[127,147]},{"title":"A mature, believable, and truly moving love story","rating":28,"date":"28 June 2008","review":"I admire the likes of Woody Allen, Chaplin and Clint Eastwood (just to name a few), who possess(ed) the chops to write, direct AND act. They're complete artists, and I wish I could be like that (I'll be already too happy if I can ever achieve my life passion of writing and directing, though, since my acting would be less convincing than Owen Wilson playing Hamlet). <br><br>Even though Eastwood didn't write this (Richard LaGravenese did it beautifully, based on a novel by Robert James Waller), he does a good job in front of the camera while also directing this human encounter between a photographer (played by himself) and an Italian housewife (Meryl Streep, magnificent) in 1960s Iowa. Their four days together would change their lives forever. <br><br>The premise doesn't sound too original, but Eastwood wonderfully captures all the raw emotions between these people, who seem throughly genuine, alive, and passionate. Lennie Niehaus' beautiful music score helps enhance the romantic atmosphere, and the slow pace is never a bore since it's necessary to make you live those brief but special moments with them. From westerns to female boxers to jazz musicians to war dramas, Clint Eastwood knows how to tell a good story, and \"The Bridges of Madison County\" ranks among his best. 10/10.","user":"Benedict_Cumberbatch","rank":[50,57]}]