[{"title":"Moved me like no film I've seen in a long damn time!","rating":10,"date":"23 March 2004","review":"I watch a lot of movies &amp; I can't remember the last time a film held me so spellbound. Not only are the characters engaging &amp; vividly portrayed by an excellent cast, the subtle dynamics of their interactions are portrayed with inspired undertone &amp; nuance. Star billing or even an Oscar should also have been awarded to the spectacularly beautiful scenery of Montana for the vast majesty it bestowed.<br><br>This complex saga of love, grief &amp; loyalty is narrated with stark simplicity by old Stab, long-time friend to retired Colonel Ludlow &amp; his 3 sons: staid Alfred, the eldest (\"old even for his years\"); idealistic Samuel, the youngest (\"There was nothing these brothers would not do for him.\"); &amp; wild Tristan (\"Such people become crazy or they become legends.\"). The conflict between Ludlow's fiercely anti-government anti-war stance &amp; his sons' determination to do what they see as their duty is but a small part of the story; the heart of the tale is the rift that threatens the mutual devotion of these 3 loyal brothers as they all come to love the same woman. \"She was not to blame,\" Stab tells us, \"She was like the ice that freezes in the rock and splits it apart.\"<br><br>A tragic tale, yes; heartbreaking at times, but never boring. Every time I felt certain I knew what was coming next, the plot took another unexpected turn &amp; I sat there riveted, softly breathing \"Wow!\" now &amp; again into the darkness. This film immediately became one of my all-time favorites; I've watched it half a dozen times since then &amp; its scope &amp; power never fail to move me.","user":"epat","rank":[269,318]},{"title":"I am a sucker...","rating":9,"date":"11 August 2003","review":"...but I must admit that I loved Legends of the fall. I understand that some people think it's corny and too romantic but if you like epic dramas this is the movie for you.<br><br>Reasons to see the movie: - Great acting. Anthony Hopkins makes a classic role as the US army officer gone anarchist father. Brad Pitt is perfect in the role as the wild one with an indian \"stepfather\". Aidan Quinn makes another great performance, and Julia Ormond is very good as the (tragic) woman they all long for. - The scenery. Magic. I want to have a farm in Montana! - The camera work. - The story. I guess I am a sucker for epic dramas. - A number of very, very good scenes. - The movie is a kick in the nuts to \"civilized life\" and state affairs. - The anarchistic attitude. - The character Tristan Ludlow. - The character William Ludlow. - The emotional ride.<br><br>Reasons to NOT see the movie: - You will be called a pathetic romantic if you like it. And you will most probably like it...","user":"jonas-adolfsson","rank":[208,256]},{"title":"My favorite movie of ALL TIME","rating":10,"date":"5 July 2003","review":"The raw passion of this movie is enough to make any serious movie enthusiast weep.  I honestly can't believe this movie was not nominated for about 8 or 10 Academy awards.  It also baffles me that some people think this was Anthony Hopkins worst portrayal. He was absolutely brilliant in this, as was Brad Pitt. THIS was the movie that made me take a look at Pitt and see that he's more than just a pretty face. After watching this, he became, and is still to this day, my favorite actor.  In this movie he was rustic, yet thoughtful.  He was strong and vulnerable.  He had a great love for family(especially his father) and for a woman he knew should not be his. This film a true epic with history, talent, superior cinematography,  and most of all(and what many movies of today lack)..  closure.<br><br>\nWatch and wonder","user":"lmartinez82","rank":[215,271]}]