[{"title":"Very intimate and compelling - a splendid debut for PT Anderson","rating":9,"date":"20 June 2007","review":"Though he is best known for two ambitious ensemble pieces such as Boogie Nights and Magnolia, writer/director Paul Thomas Anderson was first noticed thanks to a low-key, unpretentious character study, a gem called Sydney.<br><br>The film takes its title from the main character, a lonely elder man played by Philip Baker Hall. At a diner he runs into John (John C. Reilly), a poor fella who has just lost all his money. Sydney buys him coffee, and after a little chat he persuades him to come to Reno. Once there, they manage to get a free room and under Sydney's tutelage John quickly becomes a successful gambler. All's well until he falls in love with Clementine (Gwyneth Paltrow), a waitress and part-time prostitute, and trouble ensues with a gangster named Jimmy, meaning Sydney will have to come up with something extreme to save his protégé.<br><br>For a first-time director Anderson shows great skills and confidence: even though he doesn't do much but follow four characters, he frames each shot to perfection and proves he is every bit as good as Scorsese at staging tracking shots (a thing he perfected on his next two features). But style doesn't really matter here: the important thing is that the audience cares for the story, and this essentially happens courtesy of sublime dialogue and great acting.<br><br>Anderson fought really hard to keep the movie's original title (and partially failed, which is why the film is known as Hard Eight in some countries), and the reason is clear from the beginning: the picture rests entirely on Hall's shoulders, and he carries it admirably. His performance is nuanced and genuine, and he manages to ensnare the viewer even when we are not sure what his motives are (and once they are revealed, it is not that important). Reilly is equally good, in a turn that opened his way to becoming one of the most reliable character actors in Hollywood, and the same intensity emerges from Paltrow and Jackson, the latter in particular adding extra dramatic flesh to what could have been a rehash of his more famous roles (Pulp Fiction etc.). Even Philip Seymour Hoffman, who has a brief but memorable role as a cocky gambler, gets his opportunity to shine, showing beyond any doubt that Anderson has a great eye for casting. He also knows how to write: the dialogue flows freely and seamlessly between the players, spawning some of the most affecting, realistic conversations ever heard in a movie, although the director can't resist the temptation to insert a couple of in-jokes as well (in one scene, Hall mentions two characters he wound up playing in Boogie Nights and Magnolia).<br><br>Overall, a very good film, and a must-see for PT Anderson fans: like many other directors who rose to fame in the '90s (Tarantino, Rodriguez, Bryan Singer) he proved right from the start what he was capable of, and has never disappointed the audience since that.","user":"MaxBorg89","rank":[50,57]},{"title":"a first-time filmmaker very well on his way...","rating":9,"date":"23 August 2005","review":"Paul Thomas Anderson's first film, Sydney (titled 'Hard Eight' by the distributors), has a story, but its more concerned about the characters, and how these actors play them. Like its inspiration, Jean-Pierre Melville's Bob le Flambeur, understanding who these people are in this seedy, desperate environment, is the key. The script is intelligent, and contains a truth that isn't found in most \"off-beat\" crime films. In fact, the crimes in the film, while not without the importance to the story, is secondary to how these people are around one another, the courtesy, the un-said things, the mishaps, and the truths. In tune with Melville, the film is decidedly European- the story is quite leisurely, almost too much so, but in the characters Anderson has created and fleshed out he has people we can care about.<br><br>Philip Baker Hall, in a towering performance of professionalism (he's one of those great character actors who practically wears the years of his life on his face, not to sound pretentious about it), is the title character of Sydney. He offers Jimmy (John C. Reilly, believable in a role seemingly more like himself than his Reed Rothchild in Anderson's Boogie Nights) a cigarette and a cup of coffee, and then finds out through the conversation his mother's passed on. He offers up an intricate, but rewarding, way of making money in a casino without laying down a card (the slots, and a different scheme). Flash ahead two years later (awesome transition, by the way) where Jimmy is with Clementine (Gwyneth Paltrow, a good performance). Things seem to be going alright all around, except that Jimmy has a violent (shown off-screen, of course) run-in, and needs Sydney's help. But there's another secret that has yet to be told.<br><br>All the little details of the story are accentuated by a directorial style that is usually peerless, and the tracking shots that have become paramount in Anderson's films (i.e. opening of Boogie Nights, walking through TV studio in Magnolia) are as smooth and interesting as anything from Scorsese. The Vegas Muzak is a touch that adds, like with Melville, a cool kind of touch not at all un-like film-noir. It's actually a thin line that Anderson is walking; how to make the Melville story's elements (an aging gambler past his prime, watching over the young people in their own messes, seeing the old turn to new) as one's own. I think he's achieved that in the film with a sense of sincerity with the characters dialog with each other. Perhaps Sydney has a different agenda than just being friendly. But Anderson wisely allows Hall to make the right choices with just certain facial expressions, what isn't said that counts. And the scenes with Samuel L. Jackson bring out the kind of intensity, sometimes quiet sometimes not, that hallmark his best performances. Maybe not a masterpiece, but it certainly isn't the work of an amateur, assured in his own script as a director, and in the strengths of his four key players.","user":"Quinoa1984","rank":[57,68]},{"title":"Somewhere between Casino and Swingers lies \"Sydney\"","rating":19,"date":"19 June 2000","review":"\"Sydney\" is the first film from director Paul Thomas Anderson better known as the director of \"Boogie Nights\", this years loathed and loved \"Magnolia\" and several Fiona Apple videos. This film is essentially about a man who seems to pick up kids off the street (John C. Reilly, Gwyneth Paltrow) and teach them the ways of the casino and gambling and helps them out. Sydney knows everything about everything, the man is flawless, or is he? Paltrow is good as a waitress who just can't stop prostituing herself. Reilly is funny and sweet as John the serrogant son of Sydney. Jackson is slimey, sleazy and somehow likeable as only Jackson can be. And of course Philip Baker Hall as Sydney is amazing. \"Sydney\" is merely a taste of what was to come from this young director. There are some long steadicam shots and there is the funny, Tarantinoish (minus much of the swearing and less pop culture references) dialogue. Anderson knows how to use a camera and editing to their full effect and make a scene that could be boring if directed by anyone else, exciting. Look for cameos from many future Andersonites (Philip Seymour Hoffman, Robert Ridgely) The film is a cut above most crime thrillers, this one is more light hearted (for a crime movie, it's not light hearted for say a romantic comedy, no no :), funny and even touching in some parts. If you are a fan of Anderson rent this, see how he has  increased his creativity and grown on his talents since this film. If you are not a fan of Anderson rent this, cause if the things you didn't like about Magnolia were the long running time and some pointless steadicam shots, you'll be happy to see this one is little over 1 hour 40 min and only has several long steadicam shots that are used for a reason. Listen for the great score by \"Boogie Nights\" composer Michael Penn and \"Magnolia\" composer Jon Brion and a Christmas song at the end credits by Penn and his wife, \"Magnolia\" soundtrack star Aimee Mann.","user":"srbelden","rank":[9,9]}]