[{"title":"A great movie","rating":10,"date":"4 September 2006","review":"This movie is an excellent portrayal of the brutal and often non-conventional Irish freedom struggle. The movie has several great strengths. The biggest strength is Liam Neeson in his tour-de-force. His acting in this movie is as good as it gets. His personality changes subtly throughout the movie, becoming increasingly affected by the changes of the world around him. The supporting cast is also excellent, with Rickman in one of his best roles.<br><br>Cinematography is very nice, capturing everything from the hopelessness of the defeats in the ashy cities to the beauty of the Irish landscapes. The pacing is very good as well.<br><br>If you saw this movie with no opinion on the Irish history, you will have one when you leave the theater. This shows to me how powerful this movie is. After all, Michael Collin's tactics were not pretty, everything from car-bombings to mob-style executions. Yet we still care for him, we want him to succeed, even if he himself isn't sure he wants to.<br><br>Without it's politics, this movie is still excellent. It's a great piece of movie-making, it's involving, sad, funny and sometimes tense. One of the movies I consider classic.","user":"MrVibrating","rank":[46,59]},{"title":"Underrated","rating":8,"date":"29 March 2008","review":"This is a very touching film. I was shocked to see the IMDb score of 6.8. The only major fault of this film is Julia Roberts. She really takes a wonderful film and turns it down a few notches. She can't keep an Irish accent, switching back and forth with her American accent throughout the duration of the film. <br><br>Anyway, Michael Collins is great to watch. The story is heartfelt, and the nuances between personal battles and patriotic duty are displayed in a very mature fashion - - to what extent will you go for your country? What will you lose? Who will you fight? Why will you do any of it? Who are your true friends? etc. <br><br>The music is FANTASTIC. Worth renting just for the listen. Of course Neison is great. So is Aidin Quinn (when I first saw this movie I thought Quinn was Irish given his name and his performance here). Alan Rickman is Alan Rickman - - which is great, though he doesn't pull off the Irish thing too well. However, given his character, Eamon de Valera, it isn't really a miscast, just takes time to get in.<br><br>If you can ignore how horrible Julia Roberts is and think about the heart and emotion behind this film while enjoying the awesome score you're in for a treat. A jewel in the rough. (my favorites)","user":"mswjr","rank":[35,45]},{"title":"Liam Neeson powerful","rating":7,"date":"15 May 2016","review":"In 1916 Dublin, Michael Collins (Liam Neeson), Harry Boland (Aidan Quinn), and Éamon de Valera (Alan Rickman) are among the captured rebels in the Easter Rising. After being released, they are politically active. De Valera and the political leadership get arrested. Collins is tipped off by double agent police detective Ned Broy (Stephen Rea). Collins goes into hiding with his best friend Boland. He meets his love Kitty Kiernan (Julia Roberts). Collins and Boland lead a guerrilla war against the British forces. De Valera takes Boland with him to work diplomatically. Eventually, the Brits relent and De Valera sends Collins to negotiate. Collins returns with home rule and splitting off Northern Ireland with De Valera opposing him. In 1922, the Anglo-Irish Treaty is approved. De Valera and his men resign taking Boland with them. They start their own revolt against the Irish Free State Army headed by Collins.<br><br>This is an expansive epic historical drama. Liam Neeson leads this with his powerful presence. He looms over this movie like the leading man that he is. The actors are all great although Julia Roberts does stick out a little. It would have been more fitting to have an Irish lass. The movie does try to fit a lot into two hours. Some of it can feel a bit disjointed. Liam Neeson is big enough to tie it all together. It would also be nice for him to have a constant foil. Whether or not he deserves it historically, the movie seems to make De Valera Collins' foil. It would be great to fully embrace the conflict and give De Valera more screen time. Make this Collins versus De Valera.","user":"SnoopyStyle","rank":[10,11]}]