[{"title":"Simple, passionate and beautiful","rating":10,"date":"23 November 2003","review":"Bacheha-Ye aseman (Children of Heaven)<br><br>It was with some trepidation that I popped this DVD into the player - it was, after all, my first venture into Iranian cinema, so I was a little unsure what to expect. I am used to, and for the most part, enjoy foreign films. They open up an incredible world of cinema that one would otherwise miss. After five minutes, it was fairly evident that this film was something a bit special. The story is simple. While at market shopping, Ali loses his sisters school shoes. After desperately trying in vain to find them, he decides that he and his sister will share his sneakers, meeting her after to school each day to recover them from her, in order to get to school himself. That is pretty much a synopsis of the entire movie. It doesn't end there however...<br><br>This film is played with such beauty and innocence; it is a true pleasure to watch. Mohammad Amir Naji plays Ali with such incredible depth and passion, one is completely drawn into his plight. From the start of the film, we see the relationship between brother and sister, played with equal warmth by Bahare Seddiqi, strained as he explains how he lost her shoes. The sorrow on Ali's face, and Zahra's tears at the news, are truly heartbreaking to watch. The expressions on the faces of the children are so genuine, it is clear that spending a cinematic hour and half will be a pleasure, albeit not an easy one.<br><br>We see Ali and his Father looking for work as gardeners. From the outset it is clear that Ali's Father is strict, but it is also evident he loves his son dearly, and the simple exchange of smiles as they find their first job is heart-warming, and totally believable. Cycling through the city, it is very striking that there is a clear division between rich and poor. We are watching a boy, to afraid to tell his father of the loss of a pair of shoes, riding through streets with billboards advertising cell phones, into rural areas where houses with swimming pools, ornate architecture and luxury are rife.<br><br>There is so much in Western civilisation that we take for granted. What to us are simple daily belongings to others is pure decadence. Aside from anything else, this film is a window into a world so many of us do not understand. Simple things bring Ali pleasure, blowing bubbles, swinging on swings with his new found friend, the smiles and laughter of the children is absorbing.<br><br>Later in the film we see Ali enter a race in order to win a pair of brand new sneakers for his sister. To win them, he must come third. Again we see the division of wealth, as Ali races through the streets, the thoughts and images of his sister swirling in his head, and on screen, while at the same time, parents of other children film the race on camcorders, all the time Ali running, fighting for the shoes he needs so desperately.<br><br>The film is directed perfectly, and the credit for this goes to Majid Majidi, whose films have won acclaim worldwide. There are no special effects, no luxurious settings. There are times when the film feels like a documentary in the direction, and that works in its favour.  This film would make an excellent introduction into the world of foreign cinema. Throughout the movie, the expressions and emotions displayed by the children speak far louder than any dialogue ever could.<br><br>The film is not dialogue intensive, and one could easily watch the film, and understand the story, even without the aid of subtitles. This film was nominated for an Academy Award, and it not difficult to see why. Ignoring for a moment the subtitles and language barriers, since they are not overly crucial to the film, this is a story of true innocence, and tugs hard at the heartstrings, sometimes to breaking point. The portrayal of the children is gentle, warm and absolutely believable, and one cannot help but be drawn into this tale, as it gently unwinds. It is sometimes tough to watch the emotions played out, but ultimately, worth every second.<br><br>Missing this film, particularly if simply put off by the fact it is foreign language, would a sad deprivation of the senses and the heart. It is not just a film, it is an experience, and one that is completely passionate, and totally unforgettable.<br><br>I truly cannot recommend this highly enough. It is widely available on DVD or VHS - rent it, borrow it or buy it - you will be glad that you did!<br><br>Reviewed by Ollie","user":"ollie501","rank":[207,215]},{"title":"a work of art","rating":4,"date":"4 January 2000","review":"The wonderful Iranian film \"Children of Heaven\" and its companion piece, \"The White Balloon\", remind one of those great Czechoslovakian films of the 1960's (\"The Shop on Main Street,\" \"Loves of a Blonde,\" etc.) in that they achieve their artistry by providing keenly observed glimpses into the minutiae of everyday life. They also help to humanize a culture often regarded as alien and even incomprehensible to western eyes. Above all, this magnificent film reminds us that real drama comes not in the form of over-plotted special effects-laden extravaganzas, but from films that examine the universal simplicities of life as we all know it. When it is distilled through the eyes of a poet - this is when art is achieved.<br><br>\"Children of Heaven\" has its roots planted firmly in the neorealist tradition. Its simple story echoes not merely the earlier \"The White Balloon\" but the original Italian classic, \"The Bicycle Thief.\" In this film, young Ali accidentally loses his sister's recently mended shoes; out of this tale of utmost simplicity, the filmmakers take us on a fascinating tour of life in a typical Iranian village and family. As Ali and his sister scheme to overcome this obstacle, the film touches on any number of universal themes: the close ties of siblings united in their common bond of avoiding often irrational parental anger; well meaning, loving parents overwhelmed with the trials of everyday life who are often compelled to act out in ways that seem cruel to the children who adore them; the petty viciousness with which children often strike out at each other, yet, at the same time, the often unexpected kindness and empathy with which they also treat one another. The film manages to keep the audience constantly engrossed in its action without once resorting to even a smidgen of incredibility or melodrama. Beautifully directed, with a superb soundtrack filled with heightened naturalistic noises, it is a film of many-splendored wonders, its lyricism caught in a glimpse of soap bubbles floating around a backyard produced by two children abandoned to their moment of incomprehensible youthful joy, its high drama found in a shoe racing down a city sewer with a desperate young girl in tow.<br><br>The actors, children and adults alike, underplay their roles in so naturalistic a fashion that one does not even feel they are performing at all; the film, through them, becomes a magical fabric of life that draws the audience deep into its world.<br><br>\"Children of Heaven\" brilliantly demonstrates that works of art often arise from the observation of the most seemingly mundane concerns of daily life and reminds us that this provides far more drama than all the exploding spaceships, car chases and hyperkinetic melodrama that flood the screen in the guise of entertainment. It certainly shows just how phony, empty and bereft of life most American films are. Don't miss \"Children of Heaven\"! It is a richly rewarding experience.","user":"Buddy-51","rank":[111,116]},{"title":"Solid, moving. There should be more movies like this!","rating":13,"date":"13 November 2003","review":"This movie quietly puts to shame the majority of junk spewing out of Hollywood. A fat wad of cash thrown at big names and special effects cannot move the human soul like the innocence and sincerety displayed by Majidi's cast and direction. It's a shame that there are not more movies like this.<br><br>The plot is simple, the actors sincere and the tone spot-on. This movie works because we're drawn into the world of Ali, his life and his surrounding. Kudos to Majidi's craftsmanship. Ali's plight, though simple (if not trivial to most of us), becomes his obsession because of his love and respect for his sister and his family. We would do well to be so moved! The climax of the movie is brilliant! Ali's grueling determination to win a race and get shoes for his sister results in an unwanted triumph! (Sorry - no spoilers here. You'll have to see the movie). I must be getting older, because I'm moved with emotions just describing the movie -- and it's been months since I've seen it!<br><br>The redemption of Ali's resulting emotion and confusion will be lost on an innatentive viewer, so *PAY CLOSE ATTENTION* to the last 10 minutes of the movie.<br><br>Beauty doesn't have to forcibly blow you away. This movie is simply beautiful, and it will blow you away.","user":"timffoster","rank":[136,146]}]