[{"title":"Underated film","rating":9,"date":"7 January 2018","review":"I have read the multiple low ratings given to this film by the likes of Ebart and others. My response is somewhat simple, but first I have to concede that I watch drama films not as documentaries. ALL fiction is contrived. So what?<br><br>What is special to me about this film is that Harrison Ford plays the character rather well. I am an emergency physician, and I know that a gun shot wound to the head, if survivable, is fraught with life changing effects. However, this is NOT the point of the movie.<br><br>To me, the point of the movie is to reflect on MY humanity (or lack thereof). By watching his character go through rehab and, ultimately, arrive at his own sense of what he wants to be, I feel vindicated, in my mind, because I have become the person who I want to be. It IS personal to me! Not my job, not any wealth, but the essence of who I am, stripped from all the material passions confronting this world we live in. <br><br>I have lived long enough to appreciate what is important to me. I am lucky enough to have discovered this quite long ago. Those who are unable to appreciate their own humanity AND humility are the truly poor among us.<br><br>Who among us wants our epitaph to read \"He made a lot of money!\"?","user":"sambinder","rank":[11,11]},{"title":"I Am Overwhelmed & Disappointed...","rating":9,"date":"23 September 2018","review":"...at the horrible ratings this film is getting.<br><br>How can anyone not see &amp; savor the multiple emotional trips upon which this film takes the viewer.<br><br>From the lead male, to the lead female, the young girl - even the dog - the story steers viewers throughout the scope of humanity. Supporting cast are well-selected.<br><br>If you're looking for Han or Indy, move on, for you'll be seeing a side of Harrison Ford not duplicated. Open your heart and mind, and embrace a lovely yet provocative film.","user":"safetypro-102-160847","rank":[8,8]},{"title":"A feel-good film, great cast, touching story","rating":8,"date":"17 May 2009","review":"I keep reading about how \"sappy\" and \"predictable\" this film is. This is true, so I will tell you now, if you hate those types of films then this is not the film for you.<br><br>But if you miss seeing movies that you waited for the happy ending you knew was coming, then you will not be disappointed. There are so many movies that don't end so happily nowadays, but remembering the times with movies that had a character who had to learn a lesson but got something more in the end (eg. \"It's a Wonderful Life\") I couldn't help but enjoy this movie.<br><br>I highly recommend it, the acting is fantastic, the story is touching, and knowing what it's like to go through hard times (my own dad had to go through some rehabilitation) then this movie hits it home. I suggest it if you agree with the points above, but it's not for everyone.","user":"prehistoricplague","rank":[19,22]}]