[{"title":"Ignore the anti-\"liberal\" criticisms of this film","rating":10,"date":"2 February 2000","review":"This is one of the most inspirational films I have seen in quite some time. I remember when this film was given the Academy award for best documentary, and hearing criticisms from some in the so-called \"liberal\" press (a reason to knock down this straw-man theory) that the film as undeserving of this title. Well after just seeing the film on video and reading some other comments from IMDb users claiming the same thing, I will have to outright disagree.<br><br>The point of this film was not about the fight itself or George Forman, (yes he played a role) as some have argued it should have. It was about the symbolism that this fight possessed, especially revolving around Muhammad Ali' and the causes he fought for. Recently ESPN selected the top 100 Athletes of all time (well they should have said American Athletes, but that's our American arrogance for you) and Ali was picked third behind Babe Ruth and Michael Jordan. The definition of \"greatest athlete\" is ambiguous, but in my mind Ali, through this film and my recent is truly, \"The greatest\" as he so claimed.<br><br>The film did an excellent job of getting as much footage as possible of all that occurred during the preparation that led to the fight and how it symbolized the joining of black people in America and Africa for a common cause in defeating their oppressors (US - white supremacy, and in Africa - European Colonialism). (which was clearly the main focus of the film) Yes, their were flaws in the film, and it was carried by the narration, Ali's unbelievably charismatic personality, and the numerous intelligent quotes that were made by him.<br><br>But those that wish to criticize the \"music\" as they call it, clearly have NO UNDERSTANDING OF BLACK CULTURE. This film was a celebration of it, focusing on GREAT MUSICIANS such as James Brown and B.B. King. These artists represent a significant part of black American culture, and knowing how important it probably was to all of those black Americans to go to Africa to spite the white American culture (which wanted the fight there), which they felt used them, was something that was revolutionary.<br><br>Before seeing this film I knew little about the \"Rumble in the Jungle,\" and little about Ali, but after seeing this film, I have come to realize that he really was \"the greatest.\"<br><br>10/10","user":"prezike","rank":[36,49]},{"title":"fascinating piece of history, even for non-fight fans","rating":20,"date":"20 September 2002","review":"It goes nearly without saying that Ali is a transcendent figure of his generation. For those currently in their twenties who did not grow up in Ali era, this film is a glimpse at why the world choked up upon seeing Ali light the flame at the Atlanta Olympiad. <br><br>While Gast's footage of Ali in Kinshasa is sparse, interview segments with Plimpton, Mailer and Lee, and a pulsing soundtrack fill in the blanks to tell a surprisingly complete tale. The characters are fascinating: A young Don King, who had not yet made his name; a sullen, menacing George Foreman bearing no resemblance to the huckster we see today; the creepy Mobutu, who is rarely seen though his presence is felt, and Howard Cosell, who appears briefly to predict the defeat of the man who practically created him. Far, FAR superior to Michael Mann's Ali, which lifted huge pieces from this documentary. While Mann's film provides much more for the eye, Gast's \"Kings\" is a superior example of pure storytelling.","user":"kevink868","rank":[12,15]},{"title":"a great documentary","rating":15,"date":"15 October 2003","review":"This film won a slew of critical praise (as well as quite a few awards) and it deserves all of them. Muhammad Ali is the most amazing athelete of the twentieth century and perhaps the most beloved boxer of all time. A public poll once showed that people all over the world recognized him more then the President of the United States. Maybe its because he is such an ill, tragic figure today that this film is so important because it shows him in all his glory when he was not just a magnificent boxer but a ringing voice of social conscience as well. This film shows him again in all his glory when he took on the seemingly invincible giant George Foreman. George is such a beloved figure now that people have forgotten that when he first won the Heavywieght Crown from Joe Frazier in 1973, that he was as dreaded and feared as Sonny Liston was in his heyday. Howard Cosell was one of Ali's most ardent supporters (he was one of the first to call him by that name and support him in his opposition of the draft) and yet even Cosell said that he didn't think that Ali could beat George Foreman. Ali had lost to Joe Frazier and Ken Norton and had barely won rematches with them, and Foreman knocked both of them silly in less then two rounds. Ali was almost 33 years old and considered all washed up and yet he showed no fear against this man. He told the public \"You think you were shocked when Nixon resigned, wait till I whip George Foreman's behind!!!\" This film brings that time and place in Zaire, Africa to life. Don King is a despicable character and yet he was a genius in promoting this fight in Africa. He said it was like from slaveship to championship. The symbolism was just tremendous. Norman Mailer and the late George Plimpton are two of the writers who most observed Ali and they both offer wonderful insights during the course of this film. They are especially good when they talk about the fight itself and how they both had a ringside seat. George Plimpton saw Bobby Kennedy shot and yet I don't think he was much more astounded when he saw what happened in that ring when Ali pulled off an amazing upset and knocked out Foreman to begin another glorious championship rein. It is almost comical when they show their shocked faces as Ali delivered the knockout blow. The best part of the film is where they play the song \"When We Were Kings\" at the end and show a montage of Ali's fights during his amazing career. You will look at these and realize how awesome this man truly was!!!","user":"dtucker86","rank":[16,23]}]