[{"title":"Strange and interesting study of a warped genius","rating":28,"date":"28 September 2004","review":"Robert Crumb must have had a bellyful of people calling him a genius, but that's exactly what he is. Having grown up a bullied, miserable child - and an anachronism almost from the start, with his interests in pop culture ephemera and old-time music - in a dysfunctional family (his father was an overbearing tyrant, his mother an amphetamine addict, his older brother so obsessed with comics that he forces his siblings to draw them), Crumb escaped this drudgery by fleeing to Cleveland, where he first became a staff artist for a greetings card company, then one of their most innovative and prolific designers, before relocating to San Fransisco. His initial impetus was to \"get some of that free love stuff\", but his pen ran away with his thoughts and he wound up virtually launching the underground comics movement. Between 1968 and 1993, Crumb produced some of the funniest, most outrageous, licentious and flat-out brilliant comic book work of all time, and this film is an invaluable insight into the man behind the madness and the mayhem. Turns out Crumb, despite his bizarre appearance (he's stick thin, wears Coke-bottle spectacles and dresses like a character actor from a 1930s comedy) and sexual deviance (he likes nothing more than hefty haunches and big, strong legs in a woman), is something of an everyman - he's married, dotes on his understanding wife and gifted daughter, and feels just as alienated from the 'evils' of modern living as the rest of us sensitive intellectuals! At first glance, of course, Crumb is as weird as they come, but the sight of the aforementioned older brother Charles (a reclusive crank who rarely leaves his squalid bedroom, let alone the house) and younger brother Maxon (a haunted, bedraggled amateur mystic, given to sitting on beds of nails and begging on the street with a wooden bowl) throws the relative sanity of Robert into stark relief. One gets the impression that if Robert had not escaped, he'd have wound up suffering just as much as Charles and Maxon, possibly even more. This isn't easy viewing and the subjects are undeniably resistable, but it does offer a unique and enlightening glimpse into the reality of the old cliché about genius and madness walking hand-in-hand. Recommended.","user":"world_of_weird","rank":[52,56]},{"title":"A Different Way to View Crumb","rating":10,"date":"25 November 2002","review":"First, I liked this movie very much. But, as you can see from the previous comments, this is a movie that you'll either love or hate. But its hard to be indifferent to it. Zwigoff does a wonderful job of setting a mood that allows you to examine an artist who is depraved, perverse and, yet, insightful.<br><br>Everyone seems to come away from the movie with an idea that Robert is spared the obvious insanity of his two brothers because of his art. But I see it differently(hence the title of this comment). Even Robert admits that his brother, Charles, was a better cartoonist. Another way to view Robert's \"success\" and his brothers' descent into \"crazy\" is fame. Crumb was an involuntary icon of the 60's. Where would Robert be today if he wasn't recognized and rewarded in the 60's? If Zap comix had turned him away for his misogynist and racist comics, would he have had the subsequent female relationships that seemed to normalize his existence? What would his fantasizing over a high school yearbook and habitual masturbation meant if he was an unknown sharing a room with his brother at Mom's house?<br><br>When I watch this movie, I am always mindful that Robert's obvious genius would be lost were it not for his luck at being discovered. I suppose that is an obvious statement but, in Crumb's case, fame has managed to gloss over many unacceptable characteristics. And, maybe, that's not such a bad thing.<br><br>\nThe film lightly touches on Crumb's relationship with his son and daughter. For some reason, Crumb's bumbling attempts at affection with his children were a bit disturbing. Or maybe its just that Crumb's fixation with wrestling and piggyback riding lingers in your mind when he hugs his daughter.<br><br>On a lighter note, I've noticed that no one has mentioned the soundtrack of this movie. Designed to be in keeping with Robert's love of old American music, the music helps to define the subject. I wonder why Zwigoff made no mention of Crumb's Cheap Suit Serenaders band.<br><br>Crumb comments against the crass commercialism of America. And, yet, I first saw this movie at a theater in Baltimore where the lobby was chock full of Crumb comic picture cards, mugs, etc.<br><br>Crumb, the movie, is a crazy world of contradictions and well worth the ride.","user":"NYC Lion","rank":[22,23]},{"title":"Bordering On Sanity","rating":10,"date":"18 April 2001","review":"After reading the couple of negative reviews of \"Crumb\" on IMDB I re - viewed the movie one more time just to make sure that the many times when I had seen this movie before, on the silver screen and on video, I have not been in a state of delusion.  With the movie fresh in my mind I want to put out this message to all the people who have made depreciating statements such as \"what is Crumb moaning about, he's famous now\", \"the Sixties weren't really like that\", \"it was just two hours of whining, rambling and unjustified complaining\" etc. etc.:  go back to your Kevin Costner, Tom Hanks, Tom Cruise big budget Oscar winners, and stop smearing dirt on one of the best documentaries ever made.  So frigging what if it's shot with a hand - held camera and without studio lighting?  \"Crumb\" is the real thing, it does not need any trickery or gloss.  Basically it shows Robert Crumb, the artist famous for \"Keep On Truckin'\", \"Fritz The Cat\" (though he does not like to be associated with either of them) and \"Mr. Natural\", telling the story of his life through his wife and brothers, with a few scenes of him at a vernissage and a comic book store (etc.) thrown in for good measure.  Call it a modern - day version of the van Gogh - story, or a look at the darker (or even just the non - Warner - Brothers) side of the flower - power generation, the human condition, the power of art, the battle of the sexes, a case history of mental illness, psychotic families, whatever.  The story, and with it the film, is amazing and totally captivating.  I have watched it many times and intend to watch it many times over.  Give it a miss only if you expect some good, clean, family entertainment, but do so at your loss.","user":"Karl Self","rank":[82,95]}]