[{"title":"Fairly Engaging","rating":7,"date":"16 August 2005","review":"True Crime is a fairly engaging movie that has some good performances. Eastwood as the director stages the action well and moves the plot forward. Only in the scenes where he takes his daughter to the zoo does the film tend to lose a little momentum. Then again, a scene like that helps illustrate the character that Eastwood is playing. He'll follow a story, but he'll try to make time for his daughter. Eastwood the actor, he seems to enjoy the roles of the tough but flawed theme. His character in True Crime is a womanizer, and a former drunk. Good characters always have flaws and Eastwood can play them with his eyes closed. The supporting cast is well rounded and helps advance the narrative. The only qualm I had was that Eastwood the director, should've tightened the running time and made the story that much more urgent. We've all seen the beat the clock films and this one's no exception. What could've made this movie better is a brisker pace, but Eastwood the director chose a more laid back style. After thirty years in the business, Eastwood can do whatever he wants with his films. He's earned it.","user":"gottogorunning","rank":[38,40]},{"title":"Good character driven story  but usual `race against the clock' conclusion","rating":2,"date":"2 May 2002","review":"When his colleague is killed in a car crash, worn out journalist Steve Everett inherits her story  a human interest piece on a man due to be executed at midnight that night.  Everett tries to balance his collapsing personal life with his feeling that the condemned man, Beachum, is innocent. He begins to search for the vital evidence that will prove his feeling correct.<br><br>This sounds like you know where it's going  a worn out journalist (alcoholic), an innocent man on death row, an investigation etc etc.but for the majority this manages to avoid all the usual pitfalls.  It does this by being very well written, instead of caricatures we have characters.  Everett is a mess, and Eastwood lets us see this  we're used to seeing rogue cops and journalists sleeping around, drinking etc, but here we see the consequences of this.  Likewise we are made to feel for the Beachum family and get a feel for the human stories that exist in the support characters. However, with 30 minutes to go, we have the usual twist and countdown thriller conclusion that spoils it a lot, but not completely.<br><br>Eastwood is excellent as a director, but he's even better here as a actor. At times he plays it too light, but for the majority we can see him weighted down by the pressure of his quest but also the self inflicted collapse of his personal life.  This is not an ego-driven project.  Washington however steals the show with a great performance, you can't help be moved by his dignity  Denzel is not the only Washington who is under-rewarded.  Lisa Gay Hamilton is also superb and works really well with Washington  together they take some scenes that could have been soapy or melodramatic and make them powerful and emotional.  Woods is good and has good banter with Eastwood, but a times feels out of place with the mood of the film  but he does provide some humour.  Leary is great in a non-comedy role, he is the representation of Everett's selfishness.  Diane Venora is OK in a small role as Everett's wife (the casting director had clearly seen her similar role in Heat).  And we have small roles for McKean and a strange role from Lucy Liu  very small considering she had already done a few big movies.<br><br>We get some `jobs for the boys' but they don't affect the quality  Eastwood has his wife (at time of writing!) Dina Eastwood and his daughter Francesca in side roles.<br><br>Overall, it may fall into the usual crime thriller cliché of a big twist, but up till then it is an assured character driven piece that is very enjoyable to watch.","user":"bob the moo","rank":[31,33]},{"title":"Slow build-up to a clock ticking climax...","rating":6,"date":"21 September 2006","review":"TRUE CRIME is a sophisticated crime thriller that takes time to delve into its lead character--CLINT EASTWOOD--who promptly turns out to be very much like the Eastwood character we've already seen in a dozen or so films--boozy, insolent, direct, and relentless when he's on the trail of a killer or playing detective with everyday citizens.<br><br>It isn't until his newspaper partner is killed in a driving accident that his conscience takes over and he decides to pursue the case that intrigued her--a case involving a man she believes is innocently awaiting sentence in California's death row.<br><br>He pleads with his newspaper boss (JAMES WOODS) to give him more time to insert himself into the case and track down the real killer. This leads to a black woman who inadvertently gives him a clue he's been searching for and to their desperate attempt to reach the governor in time to stop the execution. Scenes of the state preparing step by step to begin the process are cross-cut with Eastwood's car chase to alert the authorities in time. It makes a smashing, riveting climax.<br><br>Basic storyline seems awfully familiar for anyone who has seen a movie from the '40s, CALL NORTHSIDE 777, all about one man's attempt to save a man from the chair whom he believes is totally innocent. And there too, the clue depended on a piece of evidence seen by the naked eye.<br><br>Eastwood's acting and direction is above reproach--he's fine and totally in control in both departments. In fact, all the supporting roles are extremely well played. Well worth viewing--and has something to say about race relations too.","user":"Doylenf","rank":[36,39]}]