[{"title":"Unappreciated Classic! 9/10","rating":9,"date":"9 April 2002","review":"I nearly spit out my teeth when I saw how low Frankenstein (94) score was. This film is quite simply spectacular!  It goes in the same category as From Hell, they are both too sophisticated and beautiful to be JUST horror films. The cleverness of this film and its sheer radiance must throw some people off.  Robert De Niro is the creature!  De Niro gives the foul beast a soul of his own.  De Niro's performance brings out genuine pity, sorrow, and most importantly, fear. Kenneth Branagh has always added a bit of class to his films, and his version of Frankenstein is no different.  A visually brilliant triumph as a director.","user":"The_Wood","rank":[149,209]},{"title":"Underrated masterpiece","rating":9,"date":"26 January 2004","review":"One of Branagh's more maligned works, though for the life of me I can't see why.  Sticking closer to the book than to any preconcieved notions of Boris Karloff (perhaps that's why), this injects true horror into the story of a medical student who brings a corpse to life.  If you don't like melodrama then maybe it's not the thing for you, but this deserves a far better reputation than it has.","user":"R_O_U_S","rank":[131,192]},{"title":"Another Great Film from Kenneth Branagh","rating":7,"date":"4 March 2004","review":"While many people seem to scorn this film, I found it wonderfully enjoyable.  Like the great Orson Welles, He stars in, and directs, many of his movies.  This one in particular shows some of his more excentric, if not marketable, passions in filmmaking that make movie buffs and connaisseurs alike enjoy this stylized and emotional film.<br><br>Yes, it is melodramatic.  Yes, the acting is often over the top.  But what many critics of this film fail to recognize is that this is precisly the point.  By staying very true to the source material(until the Elizabeth thing) and the significant changes that WERE made are clear evidence of this.  The book was melodramatic.  What Kenneth Branagh does here is stay true to the spirit of the classic gothic novel.  The great close-ups define the characters, and through them you can understand them.  Do not mistake stylization for poor film-making, because this is a wonderfully made and presented film, that if understood captivates you from the first spoken words(a quote from Mary Shelly, setting up the stylization) to the last frame.<br><br>Know what you're getting into, a passionatly made film about what drives one to both excel and what drives one to madness, and the dangers of excess beyond reason.  If you have read the book, regardless of whether you liked it or not,see this movie.  You will love what they have retained, and will embrace what they've changed.  this is not a film(not a movie, a film) for everyone.  But for those who are willing to have an open mind, it is pure bliss!","user":"richardscd","rank":[98,145]}]