[{"title":"A good action movie!","rating":21,"date":"21 May 2008","review":"jet Li rocks, and this film was great. Sure, it's silly, but it's never boring, there are some slick fight scenes, and the soundtrack is pretty neat. It manages to be a romantic film without being sappy and stupid, it manages to be an action film where the action rocks but isn't too over-the-top, and it manages to make good use of the Shakesphere story, ROMEO AND JULIET while still respecting the themes and the humor. Generally, the film is pretty silly. The acting isn't particularly good, the characters are two dimensional, the plot holes are numerous, and events are sometimes quite predictable. However, I don't regret watching it. I was entertained and was satisfied by the film as a whole. It worked really well. If you're looking for a good film that doesn't require a lot of thought and investment from the viewer but is at least entertaining and energetic, ROMERO MUST DIE is a good film to check out.","user":"tonymurphylee","rank":[23,24]},{"title":"Action with Depth.","rating":10,"date":"11 July 2005","review":"Not usually a fan of this type of all-out Action movie, \"Romeo Must Die\" knocked me off balance when I found it to be one of the best films I have ever enjoyed. Producer Joel Silver (Who also produced \"The Matrix\") describes the film as an \"Urban rendition of Romeo and Juliet\" and although this is a very simple way of looking at the film, it's not far off the mark. Like the great Shakespeare work, there are two opposing families in this film, each looking to make big commercial gains in the world of real estate development. Caught up in their lies, greed and violence are Trish O'Day (Played by Aaliyah) and Han Sing (Played by Jet Li). The story revolves around their quickly blooming relationship and the opposing families around them.<br><br>The film boasts some serious eye candy with some of the best special effects you'll see. Luckily, this is not the only good thing going for the movie as the eye candy is wonderfully supported by some fantastic performances from the cast. In her first feature movie, Aaliyah is absolutely breath taking as Trish O'Day. Showing the kind of charm and 'x' factor that few will ever have, she alone makes this film a must see. Jet Li's performance is, as always, about his skills as a martial artist but his scripted acting continues to improve. Another stand out performance for me was that of D.B. Woodside who plays Trish O'Days brother - Colin. Although not such a major role, D.B. excels in this role. High end production values mean the film has a real style and \"gloss\" to it and everything fits in place and the story moves along at just the right pace. In fact, \"Romeo Must Die\" is a shining example of how good story telling does not need to be lost in a sea of special effects and glossy American values. Jonathon Ross describes the film as \"Fast, Furious, Fun\", which is definitely true, but there is more to this film that the audience can take away with them. The reason the film works is that it works on two levels - storyline and action. You can enjoy both aspects and take from them what you like. This is a brilliant film and I highly recommend it.","user":"Translucid2k4","rank":[53,65]},{"title":"Superior Gangster Film; Mediocre Kung Fu Film","rating":7,"date":"21 May 2000","review":"ROMEO MUST DIE is one of those rare films which, while not particularly good for its genre, is surprisingly good for other reasons. Most of the black characters, even the villians, are sympathetically portrayed, even though the hero is Asian. Aaliyah is wholesomely sexy and quite beautiful.  Russell Wong is phenomenal is a very short role.  This guy has the looks, style, and presence of Russell Crowe. Jet Li, however, is very humane and appealing, though his character is underwritten. Most of the asian characters are shortchanged dramatically. However the white (primarily Jewish) characters are shortchanged the most.  They receive the brunt of the ugly stereotyping. The kung-fu sequences are nothing special.  They are too fast and too confusing to be completely effective.  Though neat, the Xray effect detracted from the \"realism,\" sort of like the old split screen and slo-mo effects of the 1960s films. Bone-crunching is far more effective; and, would someone please dispense with this \"flying\" nonsense?  I don't want to see anything up there or the screen that is not physically possible. Special note must be made of Francoise Yip, the Female bike / fighter.  If Ms. Yip did all her own stunts, she's not only stunningly beautiful, she is also awesome. One quibble, which I feel follows a disturbing pattern in motion pictures.  Though Jet Li and Aaliyah are quite obviously in love at the close of the film, they never kiss.  In a film which shows two beautiful asian dances french kiss, and one bares the other's breast and kisses her erect nipple,would it have been too much to ask to have to people of different races who are obviously in love share a romantic kiss?","user":"Bob-45","rank":[35,43]}]