[{"title":"Underrated Sci-Fi Cyberpunk decent Action Flick from the 90's","rating":9,"date":"30 July 2015","review":"My review of the underrated cyberpunk film, Johnny Mnemonic(1995) starring Keanu Reeves, Dina Meyer, Ice-T, Takeshi Kitano, Denis Akiyama, Dolph Lundgren, Henry Rollins, Barbara Sukowa, and Udo Kier. Johnny Mnemonic is a 1995 American cyberpunk sci-fi action film directed by Robert Longo. It was loosely based on the short story \"Johnny Mnemonic\" by William Gibson.Keanu Reeves plays the title character, a man with a cybernetic brain implant designed to store information. The film portrays Gibson's dystopia view of the future with the world dominated by mega corporations and with strong East Asian influences. Seriously this movie kicks ass. Keanu Reeves and Dina Meyer are awesome. I love when An assassin try's to kill Johnny he aim his gun on his back and says \"Time to die\" and Johnny says \"Time\" and he switch's his watch and the bomb explodes. Dina Meyer as body guard Jane throws a grenade and kills a few assassins. Dina Meyer also co started in her latest movie in the 90's Starship Troopers unfortunately her character in that movie was killed. I really love Dolph Lundgren as Street Preacher \"It's Jesus time!\" \"HALT SINNERS!\" Dolph shows up after next 45.mins. in the movie I wish he would have showed earlier. He's acting is still pretty good. Ice-T and Udo Kier did a great performance in their roles. <br><br>This movie is very underrated an solid Action flick I wish there would be more Action flick like are this today. In my opinion The Matrix and Johnny Mnemonic are my top 2 best Action Sci-fi flicks from Keanu Reeves of the 90's. Movies like are this don't exist today anymore. <br><br>The film was shot on location in Canada, with Toronto and Montreal filling in for the film's Newark, New Jersey and Beijing settings. A number of local monuments, including Toronto's Union Station and Montreal's skyline and Jacques Cartier Bridge, feature prominently.<br><br>The film premiered in Japan first on April 15, 1995, with a longer version (103 Min's) that is closer to the director's cut and features a previously composed score by Mychael Danna, different editing, and more scenes with Japanese star Takeshi Kitano and Dolph Lundgren notably. Val Kilmer was originally set to star, but left the project after he was offered the role of Batman in Batman Forever.The character Molly Millions, from the original story, was changed to Jane for the film. They are very similar characters except that Molly had retractable razor blades under her fingernails and augmented vision. It is believed that the change was due to the \"Molly\" character being attached to the rights for any possible future Neuromancer film adaptation.<br><br>The script was rumored to have been dumped on the doorstep of Keanu Reeves' house, a tactic that piqued his interest and led to him accepting the role of Johnny.<br><br>B.J. Rack, one of the producers, is still credited although he left the project due to creative differences with director Robert Longo First of all, the prologue is different and more poignant. <br><br>Here it is, in this exact form:<br><br>\"New century. Age of terminal capitalism.<br><br>The armored towers of multinational corporations rise above the ruins of the democracies that gave them birth.<br><br>Soldiers of the Yakuza defend them.<br><br>Hackers, data-pirates, LoTek media rebels are the enemy, burrowing like rats in the walls of cyberspace.<br><br>A new plague convulses the cities: Nerve Attenuation Syndrome, incurable, fatal, epidemic, bringing fear and misery as old as the species itself.<br><br>But the most precious data is sometimes entrusted to elite private agents, wet wired to function as human data banks.<br><br>Mnemonic couriers.\"<br><br>10/10","user":"ivo-cobra8","rank":[95,103]},{"title":"I cut this movie a lot of slack because it is based on a W. Gibson short story.","rating":25,"date":"25 August 2001","review":"Why does everyone hate that movie so much!?! All the reviews I have read called it \"confusing\". How could it be confusing?<br><br>1. Takes place in a world created in William Gibson's many works of fiction. 2. Man has data in head. 3. Others REALLY want data. 4. Man tries to get data out of head before it kills him -- or the people chasing him do.<br><br>Along the way there are some colorful characters, cool gadgets and cityscapes from Gibson's 2021, and even a smidgen of romance (but not enough to bother anyone). I mean what's the problem!?! The movie is very faithful to Gibson's vision and even asks the main character to wrestle with an ethical dilemma or two while all the action is going on...","user":"scott_m","rank":[51,56]},{"title":"Cyberpunk at its best and worst","rating":9,"date":"8 March 2006","review":"I must start with a personal statement - I'm amazed at the silliness of those who bombastically declare this to be the worst movie of all times and so on... Really? Is it really that bad, worse than \"Manos - The Hands of Fate\" or \"Cocoon - the Return\"? <br><br>I think most of the people who diss this film fall, broadly, in three large categories: 1) those who are so attached to the original short story that they can't stand the idea of an eponymous film with a different vision (although, again, its Gibson himself who penned this script!) This is not \"purism\", but acting like brats - just like those who criticized the film \"Resident Evil\" for not \"sticking closer to the original games\". 2) then, there are those who have a personal dislike for Keanu Reeves, and they follow him over the 'net, criticizing him for \"wooden acting\". It doesn't matter to them that the Johnny character is exactly what Keanu portrays - an egotistic, self-absorbed bastard, who only cares about his posh clothes, cold Mexican beer and hookers (and there are already so many out there like him, in the real world!). Then 3) there are those who are simply too stupid to actually watch what's going on on the screen, because of personal convictions, education or background (i.e. those who mention Grenpeace and anti-capitalism as if they are capital crimes, or those who think PharmaKom is a Japanese company). I was particularly amused at the user who launched a furious diatribe against the idea of the Lo-Teks being so visible in the ruined bridge, despite the fact that the only time in which they actually identify themselves as the source of anti-establishment activities is the very end, when they also announce they'll be going off the air. <br><br>The list could go on. But this is supposed to be a review, not an answer to those who dislike the movie so vehemently.<br><br>I believe this is *the* film which, despite its occasional artistic shortcomings, connects \"Blade Runner\" to \"The Matrix\". It was a courageous endeavour, portraying an all-too possible near future, and reminded me of another picture, similarly vilified by simpletons who couldn't see beyond the surface - \"Starship Troopers\". <br><br>The sad fact is that the movie was mistreated, and what we ended by seeing on DVD in most of the world is not what the director intended. There is an alternative version (briefly mentioned on this site) which makes some significant changes, and it's available only in Japan. <br><br>First of all, the prologue is different and more poignant. Here it is, in this exact form:<br><br>\"New century. Age of terminal capitalism.<br><br>The armored towers of multinational corporations rise above the ruins of the democracies that gave them birth.<br><br>Soldiers of the Yakuza defend them.<br><br>Hackers, data-pirates, LoTek media rebels are the enemy, burrowing like rats in the walls of cyberspace.<br><br>A new plague convulses the cities: Nerve Attenuation Syndrome, incurable, fatal, epidemic, bringing fear and misery as old as the species itself.<br><br>But the most precious data is sometimes entrusted to elite private agents, wetwired to function as human data banks.<br><br>Mnemonic couriers.\"<br><br>In this day and age, in the post-Enron, post-9/11 world, all the above doesn't seem so far-fetched anymore.<br><br>The film is more somber in the Japanese version. We see more of Takahashi's inner desolation, and there are some added bits of gore and violence in the Beijing fight. Johnny himself is much more of a corporate puppet - we see it from a longer dialogue with the hooker in the hotel room, or in the scene in which he acquires the memory doubler. We see J-Bone sticking a syringe in the dolphin, sadistically commenting how the creature is a junkie.<br><br>There is also more realism involved (Spoiler alert!): the hero doesn't somehow miraculously recover his childhood memories after being connected to Jones. And we see how Johnny, exhausted, decides to get it over with, despite a dire warning that the \"looping\" procedure through the dolphin will most certainly kill him. That is a moment of pure redemption, sadly lost in the official European and North-American film versions.<br><br>Last but not least, the extended cut gives more screen time to Lundgren's \"mad preacher\" character. We see him sermonizing in his church, in front of a rapt audience, using words and gestures that are scarily familiar to anyone who has watched an Evangelical TV channel. He discovers along the way that Johnny's \"load\" is the miraculous cure for NAS, and he covets it for himself - he even shouts he wants to \"become (like) God.\" It's easy to see why \"some circles\" decided to eliminate all this potentially uncomfortable content... but we ended up with a caricature, instead of a cunning and shrewd film villain.<br><br>Johnny, we barely knew you.","user":"Playitagainsam","rank":[121,141]}]