[{"title":"Unoriginal but entertaining","rating":7,"date":"13 January 2001","review":"Thirty years is a long time to wait to make a sequel, especially when no one is clamoring for one.  Director/Writer/Producer John Singleton decided it was about time.  The result is a solid, but undistinguished crime drama. The elements of this story have been told so many times that they are becoming hackneyed.  A tough, no-nonsense cop fights evil and corruption to bring justice to the streets while often disregarding the law.  A spoiled rich kid is trying to get away with murder by hiring a drug dealer to snuff an eyewitness with the help of a couple of dirty cops.  This is not vanguard material.<br><br>Singleton's direction is good in the action sequences (of which there are plenty) and adequate in the dramatic scenes.  In this film, he doesn't bring much innovation to the screen, with very straightforward shots and mundane locations.  In an overly reverent gesture to the original film, he brings back Richard Roundtree (the original Shaft) as the current Shaft's (Samuel L. Jackson) uncle and mentor.  There is also a cameo appearance by Gordon Parks, the director of the original, and of course, Isaac Hayes theme song is back.<br><br>The film is elevated from mediocrity by the acting.  Samuel L. Jackson is an outstanding actor and slips on the character of this tough, streetwise cop like a tailored glove.  When he's bad, he's very very bad and when he is good, he's almost saintly.  Christian Bale also gives a fine performance as the despicable rich kid who thinks his wealth puts him above the law. Jeffrey Wright is explosive as the egomaniac drug lord.  The supporting actors are also excellent.<br><br>This is an entertaining film despite its lack of originality.  I rated it a 7/10.  Action junkies add a point or two.  This film is extremely violent with a high body count.","user":"FlickJunkie-2","rank":[40,48]},{"title":"Still the man...","rating":8,"date":"20 June 2000","review":"I went to see this movie expecting to see a big-budget remake of the original Shaft, and I got it.<br><br>This version is a lot more violent than the original, it didn't seem to be in Shaft's style. The pacing and editing in the first half of the movie were fast and smooth. John Singleton did a great job in establishing Shaft's character and the plot.  During the second half of the movie (when the action really begins), however, the movie starts to lose it's original slickness.<br><br>Samuel L. Jackson is truly a great Shaft, he's probably the only actor out there (besides the great Richard Roundtree) who could pull this off, and he does an excellent job.  This time around, though, we don't really see Shaft's \"Ladies' Man\" side, except for a couple of innuendoes with minor characters.  Like I said, Jackson's Shaft is a little too violent (even for a desensitized, Tarantino fan like me). Christian Bale, after playing a cold,rich, psychopathic killer in \"American Psycho\", plays a...cold, rich, psychopathic killer.  He's perfect in his ability to make us feel absolutely no compassion for him. It's impossible not to mention Bustah Rhymes in a small but great role as Shaft's driver/assistant.  He provides some of the comic relief, taking some strain off of Jackson.<br><br>I thoroughly enjoyed Isaac Hayes' Oscar-Winning theme, which plays throughout the movie.<br><br>This Shaft is a great movie for anyone who's a fan of the original, Sam Jackson, or great action movies in general.","user":"Willy-73","rank":[55,71]},{"title":"lively homage","rating":13,"date":"13 January 2001","review":"Samuel L. Jackson seems to be having the time of his movie acting life portraying the title character in `Shaft,' John Singleton's take on the groundbreaking classic that, on its release in 1971, served as the blueprint for all the `blaxploitation' films that filled theatres throughout the early and mid 1970's.   Unfortunately, the concept of a rogue black cop, defying the rules and doing things his own way, is not as fresh as it was back in the time of the original film, so this new version of `Shaft' has less to recommend it.  Still, it is an efficient police procedural, filled with crowd-pleasing moments of adrenalin-pumping melodrama, hissable villains and a wisecracking, kickass hero who seems virtually indestructible  just the way we like our heroes to be in a movie like this.<br><br>Singleton pays affectionate homage to the original film in many ways. Jackson actually plays the nephew of the original Shaft and, indeed, Richard Roundtree makes a cameo appearance early on in the film as Jackson's seasoned mentor.  Singleton wisely uses the original Isaac Hayes recording of the hit song as background for the film's opening credit sequence and backs up many of the action scenes with an impressive instrumental interpretation as well.<br><br>The story offers little that is new for this particular genre whose films often rise or fall based on the quality of the foils against whom the hero must ultimately contend.  Luckily, the filmmakers are blessed with not just one but two impressive villains  Jeffrey Wright as Peoples Hernandez, a tough talking thug who wants to expand out of the little neighborhood kingdom he has established into the big time of upper class drug dealing, and Christian Bale as Walter Wade, Jr., the racist, spoiled-brat son of a New York City magnate whose hate crime killing of an innocent black man sets the plot in motion and serves as fodder for Shaft's personal vendetta. Bale proves definitively that the quality of subtle, soul-cringing evil he brought to his role in `American Psycho' was no fluke and that he can be as effective in a big budget extravaganza like this one as he is in a smaller scale, far more quirky work like `Psycho.'  Vanessa Williams, on the other hand, who plays Shaft's partner and who is almost unrecognizable buried under a dark beret, fails to distinguish herself either in her role or in her performance.<br><br>Then we have Mr. Jackson himself.  Here is a man who slides so effortlessly into the role that, despite the absurdity and incredibility of much that is going on around him, we never question the film's veracity for a moment. Whether tossing off wisecracks, shooting at unarmed criminals, pounding defenseless suspects into insensibility or consoling distraught witnesses, Shaft remains forever a hero, acting out the impulses we in the audience feel but are never able to fully act upon in our daily lives.  Thus, this new `Shaft' works best as simpleminded good vs. evil melodrama  and even the most sophisticated movie watcher can use a bit of that once in a while.","user":"Buddy-51","rank":[11,12]}]