[{"title":"This movie was great, and I cannot see how someone could not like it.","rating":10,"date":"17 February 2005","review":"It is only my opinion, but this was probably one of the best animated movies I have ever viewed. I cannot understand why someone could disagree against this movie. Character voicing was superb, full of life and very well constructed. Aniamtion was beautiful, with smooth backgrounds and even up to the little details such as footprints left behind in the snow. The music was probably the best part of all, with the excellent orchestral background, full of dramatic phrases during an intense part of the movie. It especially sounds great when you're supporting surround sound.<br><br>This movie was a great movie and people think it was one of the greatest letdowns in the 1990's. In my opinion, it was the greatest animated movie and I would recommend that you should watch it with your family or with a friend. It is a fantastic movie...","user":"fatalframer122","rank":[70,77]},{"title":"A great movie! One that will live in your memory forever!","rating":3,"date":"3 May 2002","review":"This is a great children's movie. But, being a kid's movie doesn't mean that it isn't good for others. This film entertains audiences of all ages. I first saw this movie when I was seven. And to this day, I still love it. Kevin Bacon supplies the voice of Balto, a half-bred wolf who risks his life to travel in the cold of Alaska to retrieve a sled of dogs that were lost while bringing antibiodics back to the town of Nome to stop an epidemic. BALTO is a film to see on a cold, Sunday when you have nothing better to do. You will enjoy this film greatly. After viewing it once, you will want to see it again. I lost track of how many times I have seen this film. But it has been more than thirty times. See this movie. It's well worth seeing. This one is one that I am proud to have in my video collection.....5/5.","user":"Jack the Ripper1888","rank":[41,44]},{"title":"A dramatic and well made film","rating":8,"date":"4 June 2000","review":"This film has a seriousness and drama to it that will surprise you. There are no songs, and it has an adult feel to it, with mature themes and exciting action. The voice characters are its main failing, with Kevin Bacon giving rather flat performance to Balto, and there is an overall lack of conviction in most of the other voices as well.  But this movie has good story and excellent pacing- there are several gripping action sequences, and very few childish moments. Balto is an excellent family film, and will keep adults and older kids enthralled and entertained.  I think it's a little too serious for very young kids to enjoy, though.  It has realism and is not light hearted. There are ideas about sickness, death and prejudice which are used very well to move this story along and help resolve it in the end. This is a hero story with a feel-good ending, and plenty of adventure along the way.  The art and appearance is interesting and unique, mostly classic animation with a few computer assisted scenes-- the overall look is tidy and quality, with some charm and humor that will get you smiling.  It has a live action entry and closure (including a view of the Balto statue in Central Park) which acts as a tie-together, and the true story behind this movie gives it additional appeal. This film, like the WB's 'Iron Giant', has been breezed over by the public and not gotten the recognition it deserves. I would recommend Balto for anyone who likes dogs, realism, or just a smooth, enjoyable film.","user":"thousandisland","rank":[28,30]}]