[{"title":"Where has this zombie flick been hiding?","rating":24,"date":"24 August 2002","review":"As you can probably tell by my nickname, I love horror films, zombie films in particular. I have pride in my knowledge of horror films, as I own close to a thousand of them and have seen many more. But I have to admit, I had never heard of this flick before yesterday. Browsing through a video store in another town, I came across it,scratching my head wondering how good could this be if I've never heard of it before. I was pleasantly surprised by this film. I think it was just as good as The Dead Next Door(a B grade zombie flick that gets a lot of attention as being an unknown classic). This is a fun film to watch if you don't expect too much from it. Don't expect great acting,top quality production, and whatever else most people think it takes to make a good film. But if your a fan of B grade horror movies, or on a quest to see and own every zombie movie ever made(such as myself), give this one a chance. I was surprised to see one of the zombies in this movie was Bill Hinzman, the cemetery zombie who chases after Barbara in the original Night Of The Living Dead. I guess you could say he is reprising his role, so to speak. I think he also directed and produced this film. I must admit, this film does seem to borrow a little from the original Night Of The Living Dead, but I don't care. This movie was fun and entertaining to watch and that's all I ask for. I was surprised at the amount of gore as well. The version I got was an uncut one entitled Revenge Of The Living Zombies. Once again, a pleasant surprise. Well,  I have to go now and find a copy of this movie to buy somewhere! Later.","user":"Submission_Grappler","rank":[18,23]},{"title":"RIP Bill Hinzman","rating":10,"date":"1 July 2012","review":"A couple of things that are really a treat for any NOTLD fan. Of course Bill Hinzman (RIP my good man, you will be missed) the cemetery zombie from NOTLD directs and stars, but did you know that when George Romero and company set out to make NOTLD, the working title was \"Night of the Flesh Eaters\" yet another film, 1964's \"The Flesh Eaters\" discouraged George from using \"Flesh Eater\" in the title, but Bill seemed to use \"Flesh Eater\" to further the NOTLD mythos. also (spoiler alert) the little fella who pops the remaining two teenage survivors in the head, believing them to be zombies, when they scurry out of their hiding spot in the barn, well that fella was the same guy who shout Ben in the head when he peered out of the arm house in NOTLD. Seems Bill was trying to make a subtle point. I loved the Pennsylvania scenery in this film, and all the time watching, I was really dying for an Iron City Beer what with all the product placement. I love this movie for the bad acting, the camp, the non-plot, and all the bravado Bill put into this. Bill is the Ed Wood of the zombie film. any serious NOTLD fan should watch this for the shear nostalgia.","user":"patrick-wheeler-31-914173","rank":[5,5]},{"title":"flesh eater rocks!!!","rating":8,"date":"22 October 2009","review":"Now this is no night of the living dead but what it is its fun great zombiploitation if you will.Starts off with some young people on a hayride going to drink beer and have some fun.This tractor riding dude unearthed zombie bill hinzman than all hell breaks loose lots of gore nudity and sleaze exploitation for sure the DVD is wonderful media blasters do a great job with their product and this is a fin example.If your a fan of zombies exploitation and cheesy 80s cinema buy this!Also its a zombie movie that happens to be set on Halloween sweet and yes the movie is somewhat of a rip off of the original night of the living dead but who cares its exploitation and its mighty entertaining.","user":"zombizombizombi","rank":[5,5]}]