[{"title":"Good, if you are familiar with Hong Kong cinema","rating":7,"date":"31 October 2019","review":"I enjoyed \"Casino Tycoon\" a lot, though I feel that I should point out that I am quite familiar with Hong Kong cinema and how crazy it can get at times. Western viewers who sit down to watch this movie and are not familiar with Hong Kong cinema may be taken aback at times. That's because the movie throws in a number of genres along the way and jumbles them around. Sometimes the movie is a gangster movie, sometimes it's a romantic movie, sometimes it's a kung fu movie, sometimes it's a revenge saga, sometimes it's a look at characters over a long period of time... see what I mean? It's is kind of messy at times, but I admit that it's never dull, so if you are prepared for it like I am, you should find it enjoyable despite its two hour length. Looking forward to watching the sequel!","user":"Wizard-8","rank":[2,2]},{"title":"We need more films like this.","rating":10,"date":"20 July 2018","review":"I loved the film from the beginning to the end. Is there another one coming after this one?","user":"horaceblacktree","rank":[1,1]},{"title":"Wong Jing and Andy Lau come up trumps again","rating":6,"date":"31 May 2017","review":"CASINO TYCOON is another gambling-themed movie from director Wong Jing, here re-teaming with star Andy Lau after the success of the breakneck HARDBOILED 2: THE LAST BLOOD. CASINO TYCOON is more of a laidback and mannered piece of work, reminiscent of GOODFELLAS in the long-term, expansive storytelling, told on a budget which does the story justice without it ever feeling epic in scope. In fact it feels much like an updated Shaw-style movie along the lines of Takeshi Kaneshiro's HERO, although it isn't an action movie.<br><br>The above average central cast members certainly work hard to bring the story to life and by and large they succeed. Lau is an intensely likable figure from the era and Chingamy Yau and Joey Wong both do well as his rival lovers. Alex Man's stalwart buddy is a great asset in the movie and features in some of the most intense moments, while Paul Chun (one of David Chiang's brothers) has one of those love-to-hate bad guy roles. CASINO TYCOON features plenty of twists and turns, a large dose of villainy, some brief but cool action, and lots of drama. I give it the thumbs up. A back-to-back sequel followed.","user":"Leofwine_draca","rank":[0,0]}]