[{"title":"One of the most widely underrated movies of our time","rating":10,"date":"5 January 2005","review":"Rounders is I believe, one of the most widely underrated movies of our time.<br><br>I first saw this movie as it was a 'bonus DVD' thrown in for free with my DVD player back in 2000, so naturally I didn't expect much (as the other bonus DVD's were very mediocre), but what I found was a very enjoyable movie.<br><br>At that stage in my life, I had only played a little poker as a child growing up, and never 'Texas Hold'em' so to be honest, a lot of the terminology went 'over my head', but even so, the film became an instant favorite of mine purely because of the performances.<br><br>The film has so much star power, and yet none of the fine actors try to 'steal' scenes. Damon, Norton, Malkovich, Landau ... and then the fine supporting cast of Turturro, Jansen, and Mol.<br><br>In fact, there is a scene with Martin Landau and Matt Damon that is perhaps one of the most beautiful performances I have seen in a long time between two very fine actors.<br><br>So even if you're not a poker player, the story is tighter than a lot of Hollywood 'pop fluff' and the performances alone can sell the film as an enjoyable movie capable of multiple viewings.<br><br>But ... if you start playing poker and get really into what they are talking about, and reading about poker theory (like Doyle Brunson's book Super System) then the movie moves up to a whole different level.<br><br>A lot of the time, Hollywood will attempt to cover a specialized error, and usually fail, or at best only partially succeed, whereas Rounders managed to get everything 'spot on', just look at the US DVD, it has a commentary track from 4 World Champion Poker players, if that's not a stamp of approval then I don't know what is.<br><br>When you factor in how the film can be enjoyed by someone who has little to no idea about Poker (as I did when I first saw the film) just because of the tight story and stellar performances and also be 'immortalized' by poker enthusiasts as the best movie ever made on the subject (and truth be told, a big reason why the World Series of Poker has been doubling it's entries year after year) ... what you have here is a true gem that works on so many levels and what I believe is, as I said initially, one of the most widely underrated movies of our time.","user":"ironman0304manutd","rank":[194,225]},{"title":"The Son of the Cincinnati Kid Rides Again!","rating":2,"date":"2 October 2001","review":"I love this movie: the plot line is pat and predictable as it effortlessly unfolds; the characters are clearly defined and you know who to root for and who to despise; and there are no dull scenes or dead end sub-plots. Matt Damon is Mike, an affable law student with little interest in the law and a passion for high stakes poker.  When he loses his shirt and promises his girl friend (cute and perky Gretchen Mol) that he will never play poker again, you know this pie-crust promise will quickly be broken.  And broken it is when Matt picks up his former schoolmate buddy, \"Worm\" (Edward Norton) who is getting out of prison and leads him back to the poker table and deep, deep into debt and hot water.<br><br>As usual, Matt Damon is adorable as the talented gambler, flashing those dimples and that Gary Cooper down-turned grin; John Malkovich is over the top as cookie-munching Teddy KGB, and, yes, if you're familiar with Russians just off the boat, you know they really DO speak like that and have a natural flare for the dramatic; Martin Landau delivers another impeccable performance as the aging, melancholic law professor whose family expected him to become a rabbi; Famke Janssen is nicely understated as the errand girl who has the obvious hots for Matt; and John Turtorro puts is solid as Knish, the grinder.  Indeed, Mr. Turorro is becoming one of the most reliable and dependable supporting players to grace any film in which he appears.  When the time and the role are right, his time will come.<br><br>But the real star of this film is Edward Norton as the low-life sociopath who bears the appropriate sobriquet \"Worm.\" Twenty years ago when I first saw \"The Onion Field,\" I thought James Wood had created the sleaziest character ever to appear on film.  Jim, move over.  Norton is cheap, slimy, and skinny, devoid of scruples and empathy, a little wise guy with a big mouth and nothing to back it up. You just KNOW this scumbag neither bathes nor brushes his teeth, and when the little rat gets the stuffings beaten out of him by a group of off-duty cops whom he has cheated, you want to join in and get in a punch.  Women will want to slap him.  In his first scene he lets you know he's a hard-hearted louse:  told that he is being released from prison in the middle of a penny-ante card game with his cell mates who beg him to leave his cigarettes behind, he gathers them up and then contemptuously drops them in the dumper on the way out. This is a cockroach with no redeeming social value who lives to use and con and degrade people.<br><br>It's no trick for an actor to make you love him; to make you despise him so much you'd like to throttle him takes real talent. I've seen Ed Norton in \"Fight Club,\" \"Primal Fear,\" and \"The People vs. Larry Flynt\" and this is one young actor to watch. He's one of those natural actors who can be whatever he wants to be and it will be sheer joy watching him grow and mature.<br><br>\"Rounders\" may be short on originality, but it's long on suspense, action, and entertainment and while not the best flick to come down the pike, it's a wonderfully satisfying two hours.  I don't know much about the game of poker, but I sure do know a good movie when I see one. I give it an 8 out 10 rating for human interest.","user":"pae-sk","rank":[74,86]},{"title":"Who would have thought a film about Poker would be so good?","rating":8,"date":"16 October 2002","review":"There is a lot of good stuff in this film.  You have a great story, an excellent cast, excellent directing, and a couple great games of poker.<br><br>When I first heard about this film, I was a bit skeptical.  It's a game about poker, how exciting can it be?  The fact that Edward Norton was in the film was the prime reason I wanted to see \"Rounders\".  After seeing the film, I couldn't believe how much I liked it.  The film flows very well from start to finish and you can't wait to see what happens in the next scene. Also, the film is filled with interesting, well-written characters.<br><br>As I mentioned above, the cast is fantastic.  You have Matt Damon, Edward Norton, John Malkovich, John Turturro, Gretchen Mol, Famke Janssen, Martin Landau and some small roles by Melina Kanakaredes (of \"Providence\") and Goran Visnjic (of \"ER\").  Matt Damon is quite a good actor and this is just another great film to add to his list of already impressive roles.  Edward Norton is fantastic as \"Worm\", he plays a truly unlikeable person, but at the same time you respect him for taking the fall for his friends.  John Tuturro is excellent, as always, he has such a cool style about him.  John Malkovich is superb in his portrayal of Teddy KGB.  And the rest of the cast does a great job as well in their respective roles.<br><br>If you are a poker fan, then I recommend you see this film, hopefully you'll enjoy it.  I myself am not a huge fan of poker, but I do play the occasional game and I loved this film.  I loved the characters, the dialogue, the acting, EVERYTHING.  I truly hope you enjoy the film.  Thanks for reading,<br><br>-Chris","user":"LebowskiT1000","rank":[105,125]}]