[{"title":"Just great","rating":10,"date":"17 December 2001","review":"Funny, absorbing and smart movie about a no-budget film and the people trying to make it.  The movie plays around with reality and dreams without getting too obscure or serious.  It's well-done, well-acted (one of those rare movies where the entire cast is great), very funny and very smart. Naturally, this bombed...it was TOO intelligent for mainstream audiences and how do you market a film like this.  But it plays on IFC all the time and it's basically one of the best films of its year and one of the best on the art of films and filmmaking.  If you even slightly like movies, you have to see this.  Don't miss it!","user":"preppy-3","rank":[49,55]},{"title":"A great hidden documentary of a film","rating":7,"date":"1 July 2002","review":"For all of us who have worked on a film production before, watching Living in Oblivion is an honor and an enjoyment. For once you have experienced what it is like to work in that kind of atmosphere with that group of people, you accept it even more. A story about a director making a movie, Living in Oblivion holds many true tidbits and crazy moments that occur regularly on a film shoot. The relationship between the director and the D of P, the treatment of the actors between the other actors and the crew, and most importantly, how a director holds himself with one member of the production with another. Altogether, you got an amazing film that tells it like it is. A pure, a true enjoyment.","user":"caspian1978","rank":[29,35]},{"title":"A smart, biting sleeper","rating":9,"date":"9 July 2003","review":"\"Living in Oblivion\" is one of your video store's coolest secrets. Writer-director Tom Dicillo takes a satiric look at independent films while capturing the ups and downs of making a movie. For the cast and crew of the film within this film, the downs hilariously outnumber the ups.<br><br>Steve Buscemi shines in an all-too-rare lead role as the frustrated director. There's also great work by James LeGros as the pompous leading man, Catherine Keener as the insecure leading lady, and Dermot Mulroney as the broken-hearted cinematographer.<br><br>Dicillo is especially concerned with the nightmares and daydreams of his characters, and rightly adopts a dreamy visual style that shifts between black and white and color.<br><br>It all adds up to an uncommonly intelligent, artistic, and funny(!) comedy that deserves your attention.","user":"sparklecat","rank":[22,26]}]