[{"title":"This Movie Will Blow You Away","rating":10,"date":"17 October 1998","review":"I rented this movie expecting to see just another average gang related film about the Ghetto, but I was proved wrong.  It ended with my eyes wide opened and my mouth to the floor.  Set It Off is a very Dramatic film and the performances by the four women were done perfectly.  Set It Off reached my heart and all my emotions.  It starts off light, but ends deep and touching.  There is no possible way you could leave from watching this movie without your eyes being flooded.  -A heart-filled film that deserved more publicity than it received.","user":"Critic-12","rank":[20,21]},{"title":"A Well Done Sleeper","rating":8,"date":"30 April 2003","review":"\"Set it Off\" is another brilliant little B sleeper by the talented F. Gary Gray. What sets this film apart from your routine crime caper/heist flick is that it features some very impressive and strong performances by Jada Pinkett-Smith (one of her very best roles) and Quen Latifah. Vivica Fox, Kimberly Elise and the underrated John C. McGinty were also quite effective in supporting roles. Blair Underwood, who I lilke, was sort of wasted as reverse eye candy. The love story sub plot was a bit if a distraction, only in a minor way. But at the core of this film was the bond between these ladies, all driven to rob banks for various reasons. What they all shared was their desperation. Instead of cliched cardboard characters, we are served pretty well fleshed out characters with as much depth as time allows. Some have mentioned they didn't like the ending, but I rather did. Queen Latifah was outstanding as a hardened career criminal. There is one scene where Jada's character stands up to her and it's tasty.<br><br>All in all, a pretty dang good thriller film that should be seen. The performances are what elevates it above the norm for this genre.","user":"Lexuses71","rank":[33,38]},{"title":"Surprisingly good","rating":8,"date":"19 November 2001","review":"My first impression was \"Gangsta flick with chicks.\"  And, to some extent, that's what I got.  But there was a lot more, and I was deeply impressed with the realism, with one exception.  The exception comes near the end and I won't give it away, but it involves police officers taking shots at a suspect with a bus full of people in the background.<br><br>One of the recurring themes of this film is how innocence and good intentions can turn into a nightmarish reality.<br><br>A bank teller is confronted by a robber that she knows from childhood.  She can hardly believe what is happening, and she doesn't react in the manner in which all bank tellers are trained.  A hostage dies, and she loses her job. A slow reaction leads to a death, accusations, and the loss employment.<br><br>A bright young man gets a haircut that is identical to a robbery suspect's. The police surround him.  He has a champagne bottle in his coat that he doesn't want to break and tries to pull it out.  They think it is a gun. An innocent mistake leads to a death.<br><br>A loving mother can no longer afford a babysitter.  She has to bring her child to work, and he gets into some cleaning supplies.  A mother's good intention turns into a hospital trip and a custody battle.<br><br>There were other instances where one mistake led to dire consequences, but I found them all believable, and none of them gave me the impression of being mere vehicles to advance the plot.<br><br>I enjoyed some of the other representations of Life as it is.  One being the inclusion of a lesbian (Latifa) in the cast without making a big deal out of it.  Although exhibiting some stereotypical lesbian traits (denim overalls for example,) she wasn't overly \"butch.\"  And homosexuality wasn't used as a plot device to include nudity either.  Speaking of which, the sex in the movie was pretty well done.  When there was love, the sex was passionate. When Stony was doing it for money, she looked ready to burst into tears. For the most part, the sex came without nudity: disappointing in some ways, but adding credibility to the movie in others.<br><br>I did have a few problems with this movie.  One is a failing that I see in many movies.  When a character's friend or family member is killed, he or she expresses initial shock and pain, but later on exhibits no outward mental stress.  There is also the \"I would have done it differently\" factor. I felt this a few times, the first being the opening scene where Frankie (Fox) is being held up.  Or when Cleo (Latifa) is stealing get away cars and tossing the previous owner's CDs out the window.  Both of these are cases in which one needs to move fast and do what is needed to move on.  You don't have time to stare blankly at your old friend.  You don't have time to select the proper driving ambience.  But these flaws didn't take too much from the general feeling.<br><br>I rated it 8 of 10.","user":"Sandro-LN","rank":[18,20]}]