[{"title":"To think some of you used to be my heroes.","rating":10,"date":"20 July 2014","review":"There quite often comes a time when a film fan who is so enamoured with a specific genre or style of film making, comes across a picture that one knows is far from perfect if deconstructed frame by frame, but still loves it with every breath they take. Purgatory is one such film for myself.<br><br>Purgatory, a TNT TV production, is that rare old beast of the Western fused with fantastical or supernatural elements. More often than not this is a blend that proved to be disastrous, hence why there are so few films of this type put into production here in the modern era. Yet director Uli Edel and producer Daniel Schneider pulled it off back in 1999, my only regret is that it took me so long to let it into my cinematic life.<br><br>The title is something of a give away, thus rendering the supposed twist as being hardly surprising. However, it was not the intention of the film makers to hoist a Sixth Sense surprise on us, really it wasn't. We are asked to put ourselves into the young Greenhorn shoes of Leon \"Sonny\" Miller (Brad Rowe) and experience his own coming of age awakening. From dime novels and hero worship to first kills and first loves, Sonny is our conduit and the key holder to the gates of redemption for many of the Wild West's legendary characters.<br><br>The cast is a veritable feast of splendid character actors playing a veritable feast of iconic real life people. Sam Shepard, Eric Roberts, Randy Quaid, Peter Stormare, Donnie Wahlberg and J.D. Souther. While Brad Fiedel provides a musical score of some magnificent beauty, a piece that revels in heroic swirls and escalating emotions, it darts around the town of \"Refuge\" like a novelist writing a dime novel soon to go down in folklore legend.<br><br>Budget restrictions are hidden very well, Edel and his cinematographer William Wages prove adept at lighting techniques and scene staging. Be it keeping things in the shade or cloaking a sequence with believable dust clouds, there's a professional touch here that puts the pic into the upper echelons of TV movies.<br><br>Then there's the action, a key component for so many Western fans, and thankfully Purgatory is book-ended by superb action sequences, with the finale a skilled lesson in shoot-out choreography and machismo pulse beats. And then there's the emotional kickers, ready to be embraced by those who still yearn to have the spirit lifted and the heart gladdened.<br><br>I could write a whole weighty paragraph on Purgatory's flaws, maybe even point out thematically what I think will annoy others, because for sure not everything works. But as a Western movie lover I found myself cheering at the film's end, even wiping away a damn fly from my eye. That's job done for me, a Western that tickled and teased my every emotion, wonderful. 10/10","user":"hitchcockthelegend","rank":[27,28]},{"title":"They Don't Make Westerns Like This Anymore","rating":8,"date":"24 January 2007","review":"They don't make westerns like this one anymore, in fact I don't think they ever made one just like this one. Imagine a town where the sheriff wears no gun, there's a saloon where no one drinks, and everyone goes to church every time the bell rings day or night. There is always smoke and fog behind the cemetery gate, and an old Indian warrior stands guard there. But this town is not what it seems, as the citizens turn out to be Wild Bill Hickcock, Jessie James, Doc Holiday and Billy the Kid to name a few. The problem is they are all dead or are they?<br><br>Then an outlaw gang, fresh from a bank robbery ride into this peaceful town, trying to wake it up and help themselves, puzzled about the meekness of the citizens. A young fellow with the gang is the only one to figure out what is happening as he realizes just who most of these people really are. Sam Shepard, Eric Roberts and Randy Quaid give especially strong performances, as does R. G. Armstrong as the stage coach driver who comes to take the citizens of Purgatory home after the stop here. They don't make cowboy movies like this anymore, but they should.","user":"ozthegreatat42330","rank":[16,16]},{"title":"a TV movie that's a pleasure to watch","rating":9,"date":"5 July 2004","review":"Purgatory is a conscience western you can compare to 'Unforgiven', or more likely 'Pale Rider.'  It seems adapted from a scifi short story, meaning it is not dominated by its wild west setting.<br><br>Someone at TNT Originals has a great skill for making movies for the small screen.  They can port a plot from the big screen and scale it down to the small screen.  They reduce it from \"larger than life\" size to \"life\" size. That's what you get with this movie 'Purgatory.'  It's a TV movie with characters that are serious but not ridiculous, a pace that's neither too fast nor too slow, a soundtrack that unique but not overbearing, and is a story that is epic but understated.  This movie is a rare gem in TV viewing: something that makes you feel good about watching TV.","user":"snsh","rank":[38,43]}]