[{"title":"Bizarre, low budget fun","rating":8,"date":"23 August 1999","review":"The Creeps is a perfect low budget film. The whole picture looks like it was made for less than $200. But lacking in set and money, the crew seems to have a fun time. A lot of fun is poked at the library system, notably in a feminist having sex with a first edition book of \"Jane Eyre.\" The midgets are the stars of this. When an experiment bringing literary characters to life goes wrong, the real fun kicks in. The lead star as Dracula gives a great performance. The acting seems a bit off once in a while, but if you like a B-movie that doesn't take itself seriously and could make you laugh, tune in to \"The Creeps\" at your nearest specialist video shop!","user":"kulaboy","rank":[10,12]},{"title":"Reasonably entertaining B-movie.","rating":4,"date":"1 May 2005","review":"A monster movie, but with little people. The front cover pretty much sums it up ... dwarf versions of the classic Universal horror monsters groping a half-naked busty young woman (who, incidentally, doesn't appear in the movie). Tasteless? Well, that goes without saying ...<br><br>Considering it's short overall length and it's fun tongue-in-cheek approach, this movie does take quite a while to get going. In the story, a nervous mad scientist is stealing first editions of various great horror books, in order to bring the archetypes to life with an ingenious machine. He wants to bring back Dracula, Frankenstein's Monster, the Werewolf and the Mummy, and so needs to get first editions of the definitive books on these monsters. He succeeds, but something goes wrong during the creation and they end up around four feet tall. Ha! Anyway, a librarian and a wannabe detective become mixed up in this plot, and decide they must foil his plans.<br><br>For a low-budget B-movie, the acting isn't that bad here. Most of the cast appear to be very competent comedic actors, and that of course helps to make the whole thing more enjoyable. As for the monsters, a couple of them appear to have been cast right off the street which works okay because there's only one speaking role -- Dracula. Dracula is played by Phil Fondacaro, who like Warwick Davis got his start playing one of the ewoks in \"Return of the Jedi\", and since then you might have recognised him in films like \"Willow\" and \"Meridian\". He plays the part very well, acting it completely straight and letting the other comedians play off against him.<br><br>\"The Creeps\" was put out by Full Moon Pictures, a horror studio that makes puts out these great little trashy low-budget B-movies (check out their website). It was originally released in 3D, which explains some of the rather odd camera angles. The production values are actually very good -- the monster makeup for the most part looks really great, and in fact for genre fans that alone almost makes this movie worth watching. And in keeping with the Laws Of The B Movie, there is of course one brief scene of nudity.<br><br>It's silly and campy and a bit lame, but if you enjoy a good bit of light-hearted B-movie trash then this really isn't that bad at all. And yes, it is a bit creepy.","user":"Teknofobe70","rank":[11,14]},{"title":"Bad","rating":15,"date":"15 April 2019","review":"The premise of midget monsters and people being afraid of them had tremendous promise and could have been really funny. Of course they failed hard and it's just boring. There is constant background music to let you know when you're supposed to laugh or be scared because there's no other way of knowing. It's like a Spike Lee movie only more realistic. To make it even worse, the entire story makes no sense. They frequently find themselves trying to explain what has just happened and it still doesn't make sense. They even have the guy work at a video store just to mention the other terrible movies these people have made. Don't waste your time.","user":"TheMeanGreenMidget","rank":[6,7]}]