[{"title":"Fun movie","rating":7,"date":"3 April 2005","review":"I read somewhere (in a fairly panning review) that this is something of a live-action mecha anime, and I think they're on the right lines. I first watched this movie when I was very young and I've been dying to see it again, and when I finally did just recently all the memories came flooding back. I don't think this is to be taken too seriously - it's just a bit of good old 80's almost-a-TV-movie fun (it is set against the backdrop of a fairly dark future, although this point isn't stressed too much). What I admired most about this movie was that the dialogue didn't sound generic - no clichés, no predictable lines - all in all just good fun! Maybe time hasn't been kind to this little movie, but still I can find appreciation for it in me. It's by no means perfect, but it's entertaining and doesn't try to be anything other than that. Let the nerds and comic-store-guys worry about technicalities - who cares? See it for yourself and make your own decision. No-one else's opinion matters.","user":"Bungle-9","rank":[35,37]},{"title":"One of the Great Cheapies","rating":5,"date":"5 April 2003","review":"While this movie in no way could be compared to the greats like Godfather or Star Wars, keep in mind that it had very little money. Stuart Gordon does a spectacular job of trying to maintain a big-budget realism with a very small budget.  Not only does he do that, but he also makes a fairly entertaining film as well.<br><br>I saw this one a long time ago, and have since bought the tape.  It really is a true guilty pleasure.  While this is not as good as Stuart Gordon's other movies such as Re-Animator, it does beat out the awful Castle Freak.  While many say that this is possibly the worst ever, they have obviously never seen a really bad film before.<br><br>The plot, which is actually fairly original, focuses on a \"Robot Jock (Jox)\" that is torn between retiring or continuing to fight for his country in a giant man made robot with specially made weapons to against the interesting, although cliched, Alexander.  Add in genetically engineered fighters, and you have yourself one heck of a final fight royal.<br><br>The music score, done by some no name composer I have never heard of is actually quite good.  I was very very impressed.  The score really cought the mood of the action to me.<br><br>Overall, it's worth a rental, and if you like it, buy it on tape.  I love it, but can see why others would call it average fair.  But considering the budget and the company (It was made by the same guys who made Full Moon Studios) it scores pretty high on the zombie meter- 3 1/2 out of five","user":"zombking","rank":[24,25]},{"title":"Cheesy action-drama with cool robots!","rating":24,"date":"24 October 1999","review":"This under-budgeted film has the kind of stuff I like to see in sci-fi movies: A cool premise (two factions using giant Mech-warrior type robots to fight for land or politics in an arena), two-dimensional characters and great miniature filming!<br><br>The story's about a soon-to-be-retired jock who drives giant robots and slugs it out with the other faction's jocks and robots. He is unwillingly replaced by a novice girl he cares about or something, and she tries to fight the old jock's nemesis. Before this guy kills the girl, the old jock gets a chance to mount a robot and fight his enemy until both robots are done with.<br><br>The fight sequence are nice to see, the miniature filming is top-notch, and the story breezes through without been noticed (believe me, it's not important enough to notice)... The space-fighting scene at least has an honest-to-God true fact about space fighting: no sound!! (for the first time in Sci-fi movie history, except of course for \"2001: A space odyssey\", but they had no space fighting in \"2001...\").<br><br>For sure, a fun grade-B movie.","user":"FrankTG","rank":[11,11]}]