[{"title":"A Worthy Addition to the Corpus of War Films","rating":8,"date":"25 June 2004","review":"The traditional, patriotic World War 2 film was popular in both America and Britain throughout the fifties and sixties, long after the war itself was over. In the late seventies, eighties and early nineties, however, it went into something of a decline in both countries. In Britain, this was connected to a decline in the British cinema itself, which only occasionally had the financial resources and self-confidence to make pictures on a large scale. (The best British war film of the period was 'Hope and Glory', which concentrated on the Home Front rather than on actual combat).<br><br>In America, the decline of the war film probably had more to do with post-Vietnam syndrome which led to patriotic sentiment and the military being viewed for a time with some suspicion. There were a few disguised war films, such as 'Top Gun', which had modern American fighter pilots battling an unidentified enemy in a fictitious war, or the 'Star Wars' trilogy which, even if George Lucas disliked the analogy, was widely seen as either World War Two or the Cold War translated into outer space. Genuine war films, however, were few and far between, although there were a number of exceptions, and TCM recently broadcast two of these as part of the D-Day sixtieth anniversary celebrations, 'The Big Red One' from 1980 and 'Memphis Belle' from ten years later. <br><br>Of these two, 'Memphis Belle' is closer in style and in spirit to the traditional war film. Like many other war films it follows the fortunes of a small, tightly-knit group of fighting men. The group in this case is the crew of an American B-17 bomber based in England in 1943; the producer David Puttnam originally wanted to make the film about a RAF Lancaster bomber, but no British studio was interested and Hollywood has never taken much interest in the British war effort. The crew of the 'Memphis Belle' have already flown twenty-four successful missions; one more, and they will have completed their tour of duty (the first American crew to do so) and will be able to return home. (The name 'Memphis Belle' was taken from that of the first aircraft which completed twenty-five missions in real life).<br><br>The film follows the men on their twenty-fifth mission, an attack on the German city of Bremen. The raid is a difficult one; the bombers meet strong opposition from German fighters and anti-aircraft gunners, the plane is damaged and one of the crew is seriously injured. This leads to a tense finale which leaves the audience wondering whether the crew will be able to make it back to base. The main glory of the film lies in its exciting depictions of aerial combat, among the best ever filmed (although those in 'The Battle of Britain' made over twenty years earlier are also excellent). As in that film, the combat sequences in 'Memphis Belle' were achieved by the use of real aircraft and models rather than by computer-generated special effects. <br><br>We are introduced to each of the crew, each of whom is presented as a distinct and different personality- Dennis, the conscientious pilot and captain, the depressive Phil, Val the medical student who pretends to be far more knowledgeable than he really is, the poetic intellectual Danny, and so on. Trying to make each crew member an individual character in his own right was perhaps a mistake, as this meant that there are too many actors in leading roles for the viewer to concentrate on. The crewmen all emerge as half-formed characters with no fully-formed ones; it might have been better to concentrate on, say, four or five crew members and to tell their stories fully, with the others only playing supporting roles. <br><br>The film touches on the moral dilemmas of the bombing campaign rather more than earlier films on this subject might have done. Rather than take the risk of hitting a nearby school, Dennis insists on flying round (thereby increasing the risk of his aircraft being shot down) until he has a clear view of the intended target, a German aircraft factory. There is also a sub-plot involving a rather unpleasant Air Force officer who is eager to exploit the Memphis Belle and her crew for propaganda purposes, and his clashes with the base commander, who finds this distasteful and who is more concerned about the heavy casualties his unit is suffering.<br><br>These elements aside, there is little in the film that could not also be found in earlier films about the World War Two bombing campaign, such as 'The Dambusters' or '633 Squadron'. That does not, however, necessarily mean that the film is anachronistic, as some have complained. Fashions in film-making may come and go, but this cannot alter the fact that the Second World War provides innumerable examples of heroism and drama which are capable of being made the subject of a good film. That was as true in 1990 as it was in 1950 or 1960, and remains true even today. I myself found 'Memphis Belle' to be both exciting and, at times, moving; a fine tribute to the men whose bravery inspired it and a worthy addition to the corpus of war films. 8/10","user":"JamesHitchcock","rank":[60,65]},{"title":"Actually was an fairly accurate account...","rating":7,"date":"22 November 2005","review":"The movie actually was a fairly accurate account of the Belle's experiences except that the movie had everything that actually happened to the plane and crew on its 25 flights happen on the last flight. The one thing missing was that a Belle waist gunner ended up with frost bite on his hands and was replaced. The characters in the movie were fictional. I've seen some comments by people that it was unrealistic for a 21-year old (Matthew Modine's Dennis Dearborn character) to be the pilot. The real Belle pilot, Robert K. Morgan, was only 24 when they began flying missions in late 1942. Some of the movie's dialogue actually was said by crew during the Belle's missions. The government produced a 1944 documentary on the Memphis Belle directed by William Wyler and if you watch it you will recognize some of the scenes and dialogue from this movie.","user":"bootssara","rank":[22,24]},{"title":"Bandit's At Five O'clock","rating":8,"date":"29 September 2004","review":"True story of the valiant B-17 bomber \"Memphis Belle's\" 25th and last bombing run over the German port city of Bremen on May 17, 1943. Having flown 24 bombing missions over Nazi occupied Europe since it's first bombing run on November 7, 1942 over the city of Brest France this if successful, it's 25th bombing run, would be the planes and crews ticket out of WWII.<br><br>It had been determined by the US general staff that 25 bombing and combat missions over Europe were the limit that a bomber crew, in order to keep casualties down, can take before they start to fall apart from the stress and cease to be effective. The crew of the \"Memphis Belle\" are the first to almost reach that goal, 25 successful bombing missions. <br><br>The unbelievably ferocious German resistance from it vaunted Luftwaffa and ground anti-aircraft batteries over the skies of Europe cost the USAAF and RAF some 35,000 planes, fighters and bombers, and their crews, over 150,000 airmen, during the bombing of Germany and German controlled Europe from 1942 to 1945. Thats just how savage and bitter the fighting was for air supremacy over that war-torn continent. <br><br>Stirring story with fine performances from the \"Memphis Belle's\" Captain Dennis Dearborn, Matthew Modine, on down. As the legendary bomber weathers wave after wave of deadly German ME 109 Messershmitt fighter planes from the sky and massive and murderous German AK AK anti-aircraft fire from the ground. As the \"Memphis Belle\" flies over Bremen and drops it's bomb payload and then limps back to England. With it's crew battered and bloody but safe and alive to be the first bomber crew to survive 25 missions over German controlled Europe. <br><br>The spectacular air combat photography was the best I've ever seen in a war movie and the cast was on par with the \"Memphis Belle\" with no one outshining the others but all equal up to their task just like the famed bomber was.<br><br>Back on the ground there was another drama played out with officer Col. Harriman, David Strathaim, who sent out the \"Memphis Belle\" and the other 23 B-17's of his bomber squadron on their mission over Bremen Germany. Col. Harriman didn't go along with Col. Derringer, John Lithgow, the US public relation officer who seemed too eager to reward the \"Memphis Belle\" crew with honors and glory even before they successfully finished their 25th mission. Not realizing that he was making the bombers crew and Col. Harriman very nervous with his not understanding how dangerous their mission was and even possibly jinxing them. <br><br>Tense and terrific the movie has already become a war classic without the false heroics that was so common in war movies made during WWII by Hollywood in order to boost the US morale at home and on the battlefield. The crew of the \"Memphis Belle\" were just as normal and scared as anyone of us would be if we were in the same situation that they were in. But it was that very fear that brought the best in strength and courage out of them and made them the hero's that they eventually became.","user":"sol1218","rank":[51,62]}]