[{"title":"Better than most sequels on Disney Classics","rating":7,"date":"28 May 2013","review":"I feel like this movie could of been so much better if it was introduced properly, and more effort was put in to match the beauty of the original. Having the outsider lions added in was a very interesting twist, but the way they introduced them just made it seem like they needed a new antagonist. If the creators took the time to have a flashback of Simba banishing these lions, and what exactly these lions did that lead to their banishment, would of really helped the story.<br><br>Timon and Pumbaa (who were some of my favorite characters from the original) just seemed to have forced comedy, and not really a place in this movie. The whole idea behind the story however, was fascinating, which made for a better sequel than most of the sequels released by Disney. Most of the original Disney movies are wrapped up so nicely, leaving no room for sequels, this is not so much the case with \"Simba's Pride\". The creators found an interesting way to bring back the wonderful world of The Lion King.<br><br>I really liked this movie when it came out, and I still like it now as a young adult. I just feel like it was a lazy sequel, and could of been so much better. It is NO where near as good as the original Lion King, but that is expected. The Lion King was probably the best movie Disney ever released, and in my opinion, one of the best movies ever! Having a sequel to match that success would be challenging. <br><br>Overall, I did like this movie and the storyline. It just didn't have the same WOW factor as the original Lion King. In the original, the music was booming, the scenery was spectacular, the animation was brilliant, and this is all toned down in \"Simba's Pride\". Would I watch it over again, however? Absolutely!","user":"anna-trujillo13","rank":[14,15]},{"title":"Why is this Movie Given So Much Crap?","rating":10,"date":"7 October 2005","review":"I don't understand why this movie is regarded to as trash. Of course it is not as good as the first movie but it comes pretty stinkin close! The animation is actually equal too the quality of the original movie. I think that it is the most perfect Disney sequel ever! It is a very interesting story that shows Simba as a father. It is cool because you get to see Simba has now become basically, like his father. Every time I see this movie, I can feel that Simba has the same sense of power that Mufasa had. It has a fun and sweet story line and a great ending. When this movie was being made, the goal was to create a sequel to a movie that everyone loves so that they could spend more time with the characters. I think (despite what everyone say's) they created an awesome, spectacular Disney film!","user":"apeclaw2011","rank":[86,110]},{"title":"A good sequel for Disney, but it could have been so much more.","rating":7,"date":"6 May 2008","review":"When I first saw the original 'The Lion King' in cinemas at the age of four, I'd been hooked. Ever since then, my favorite movie has always been this Disney classic. The sequel came out when I was seven, and for a cheaply made direct-to-video movie, was quite enjoyable to watch. Basically, the story follows on from the original film. To beat the original Lion King would be a near-impossible feat, so when put in perspective, the movie really isn't all that bad. The story is neatly tied in with the original film, with the concept of Scar, the antagonist of the first film, having a family bent on revenge over Simba, the protagonist of the 1st Lion King. The film can be very moving at times, and some songs I even preferred over the original's. However, this movie could have been so much more! Had Disney spent more time on it and released it to cinemas instead of having a direct to video release, this could have easily been just as good as the original. What brought this movie's rating down was the fact the storyline had a lot of unanswered questions - where was this pride int he rpevious movie? Many other gaps fill this film, and are far too vague for the viewer to assume what might have happened.","user":"Ayem-Emsy","rank":[35,42]}]