[{"title":"sooo funny!","rating":10,"date":"5 February 2000","review":"i guess i am one of the few people that find this movie hilarious, i watch it every time it's on tv, i rent it.. etc. i have no idea why people seem to be so offended by it, you must be some mean grandparents or something. it's just a MOVIE and it's not supposed to be taken so seriously..","user":"DorsiaRes","rank":[16,18]},{"title":"Haha, hilarious movie","rating":24,"date":"24 April 1999","review":"Man, some people have no sense of humor.  When I saw this movie as a youngin i didn't get it much.  Then I saw it again a few years later and I busted a gut.  If you don't want your kids to see it, don't let them.  Don't ruin it for the rest of us.<br><br>Problem Child 2 was pretty funny, but Problem Child 3 (made for TV) really blew.  They couldn't even get the rights to \"Bad to the Bone.\"","user":"Tyranork","rank":[12,13]},{"title":"Really refreshing!","rating":7,"date":"7 May 2003","review":"I really enjoyed this film - which was truly different.<br><br>To be honest, I'm absolutely fed up with  portrays of children (especially in commercials and family movies). Children are always portrayed as so cuuuuuuute and nice - actually, I'm worried about getting tooth decay because of the sweetness involved.<br><br>Problem Child is just different - the child is a complete evil brat which causes havoc during the whole movie.<br><br>Basically, the film concentrates on showing the evil side of children - and yes, people, there is a cruelty in children. Do you remember your own childhood? The bully who loved to harass weaker children? How about children treat outsiders, like fat/ugly peers? What about kids torturing animals like flies or frogs?<br><br>Sure - this comedy is far of and unrealistic,  but so are cuuuuuuute and sweet  family movies.<br><br>So - I quite like the movie, it's a black comedy which is a nice counterpoint to sweet &amp; cute comedies like Home Alone.<br><br>7 / 10","user":"buckaroo-6","rank":[38,50]}]