[{"title":"Lovecraft in the flesh","rating":5,"date":"5 June 2004","review":"Brian Yuzna's Necronomicon features a wraparound in which Jeffrey Combs portrays H.P. Lovecraft, circa 1932. Prosthetic makeup, in combination with Comb's naturally high voice, results in what is probably the best portrayal of H.P.L. we're likely to see. However, those familiar with Lovecraft's life will be amused (or perhaps annoyed) to see him depicted as an occult believer/action hero who gains access to a copy of the Necronomicon through subterfuge. A somewhat similar liberty was taken by novelists Robert Shea and Robert Anton Wilson in their 'Illuminatus' trilogy; and, of course, Robert Bloch based a character in 'Shambler From The Stars' on Lovecraft. (With H.P.L's permission, however.)<br><br>Necronomicon is a melange of Lovecraftian characters, stories, and themes. The Deep Ones, Cthulhu, the strange high house in the mist at Kingsport Head and, of course, the dreaded Necronomicon itself are all reasonably well treated. H.P.L.'s short story 'Cool Air' provided some inspiration for one of the film's segments. <br><br>Lovecraft's stories - notoriously short on dialog and female characters - do not easily lend themselves to direct cinematic adaptation. Consequently, Brian Yuzna deserves credit for extracting many essential elements from the Mythos and presenting them in a way contemporary horror audiences can appreciate. Necronomicon may offer a bit too much gore for some tastes; but as far as I'm concerned, even loose adaptations of Lovecraft's work are better than none at all.","user":"JVSanders","rank":[25,28]},{"title":"Not a bad anthology","rating":7,"date":"22 July 2004","review":"Necronomicon is a horror anthology, loosely based on the works of H.P. Lovecraft. Lovecraft regular and B-movie icon Jeffrey Combs gets to perform as Lovecraft himself in the wraparound story for this movie, which involves Lovecraft reading stories from the 'Necronomicon' inside a library.<br><br>The first story, titled \"The Drowned\" follows the story of a house in which a man resurrected his dead wife and son with the help of the Necronomicon. This tale is directed by Christophe Gans, the same man that went on to direct the French horror hit \"Brotherhood of the Wolf\". This tale is well directed, Christophe manages to create the right atmosphere for the house, and the special effects are surprisingly well executed, especially upon the appearance of the demon god towards the end. Surprisingly, it is the story that lets this tale down. After a delightful sequence in which we see an elderly man, consumed by the loss of his family, throw his bible into the fire and then resurrect his family with the Necronomicon; the tale is unable to suitably follow it up, and the ending disappoints as it doesn't go anywhere; it doesn't have a point to it and it leaves it feeling rather empty.<br><br>The second tale is without doubt the best of the three and is worth the film's running time on it's own. This tale, titled \"The Cold\" and based on the Lovecraft story \"Cool Air\" follows the story of a reporter that is sent to a woman's house to investigate a series of murders. The lady of the house tells her story of how the murders occurred and through this story, a great sense of mystery and intrigue is built up and it makes you want to find out what the truth is behind the events. Unlike the first tale, this tale is not skilfully directed, and also unlike the first tale; it has a story that is more than enough to carry it despite this. This tale also features a predictable, but non the less satisfying twist at it's conclusion.<br><br>The third and final tale of the three, titled \"Whispers\", is the darkest of the bunch. This tale is about a policewoman that follows a criminal, known as \"The Butcher\" into an old abandoned house. This story is directed by the accomplished horror director; Brian Yuzna, whom horror fans will recognise instantly as the producer of the horror classic \"Re-Animator\" and the underrated \"From Beyond\", as well as the director of both the Re-Animator sequels, and the under acclaimed horror gem; \"Return of the Living Dead part 3\". His dark and repulsive style is shown abundantly in this tale. Despite its dark and creepiness, this is, unfortunately, the weakest of the three tales. This is a shame because it has a great set up, and it does feature some really nice moments, such as the brain dead cop and the atmospheric 'cave'. This tale is also the goriest and most horrifying of the three, and its lack of a coherent plot is most definitely its downfall.<br><br>The film is finished off with the conclusion to the wraparound tale, which stars Jeffrey Combs. The conclusion feels rather rushed, and is something of a rip-off of the ending of the first tale. This is a shame because the film ends on a limp note rather than an exciting one, and it therefore doesn't leave a good taste in the viewer's mouth.<br><br>Necronomicon is not essential viewing, or even recommended viewing; but if you just want a film that will entertain you for 90 minutes, then you could do a lot worse.","user":"The_Void","rank":[37,44]},{"title":"Hang on! It gets better after the awful start.","rating":5,"date":"9 July 2004","review":"Like the other horror trilogy I saw recently, \"Tales From The Darkside\", \"Necronomicon\" gets progressively better as it goes along. The first story is unspeakably boring, but the second is an improvement (and features a notable performance by David Warner), and the third one comes closer to a convincing depiction/vision of what Hell might look like than perhaps any other horror film (\"Hellraiser II\", for example). Spectacular gore effects are a highlight throughout. (**)","user":"gridoon","rank":[22,27]}]