[{"title":"Surprisingly good...","rating":10,"date":"28 November 2001","review":"Hey, who would have thought, this movie is actually pretty good and fun to watch.  Performances are good all around, too, especially Prochnow as the main bad guy (it's definitely a bit of a typecast, but hey, he's cool). And it's really nice to see Andrew Divoff playing the role of the hero for one time. The budget wasn't that high and you can see this on the screen, but a high budget doesn't guarantee a good movie (\"Air Force One\" anyone...?). This one's alright, watch it.","user":"ep.com","rank":[9,12]},{"title":"\"Die Hard\" on a C-5 Galaxy","rating":11,"date":"11 June 1999","review":"That's about it.<br><br>Okay, okay.  The plot, such as it is, goes like this: Our hero is a USAF pilot testing a \"Virtual Reality\" helmet in an F-117 over Turkey.  It fails, and he barely has time to bail out before his plane crashes.  Disgraced, he's sent home packing, along with the two remaining VR F-117 prototypes.<br><br>Why are they testing it over Turkey?  Why not Area 51?  Why not *anywhere* in the United States?  Because the long flight home  means that the terrorists, led by \"Das Boot\" kapitan Jurgen Prochnow, can board through an air-to-air refueling line (!) and make a grab for the remaining two planes.<br><br>You can figure out the rest.  Our hero must sneak around the conveniently large ductwork of the C-5 transport, offing terrorists one by one, while the love interest ('scuse me, the C-5's pilot) keeps trying to kick bad guys out of her cockpit and call on the radio for help.<br><br>There's absolutely nothing innovative about this movie in the slightest. The action is mundane, the characters are cardboard, and the technical goofs are legion.  Watch it only if you feel like having an \"MST3K\" party at your house.<br><br>Or rent \"Air Force One\" and have a double-feature.","user":"Royce-5","rank":[3,4]},{"title":"Best comedy of the early 90's","rating":16,"date":"16 June 2004","review":"In reality this is a fun movie. It is a simple good guy vs bad guy story. During the story you learn just how bad the \"evil\" guys are. By the final scene you can find yourself cheering the good guys.<br><br>On the other hand,<br><br>If you have any knowledge of military aircraft you must suspend a \"lot\" of disbelief. I was in the U.S. Air Force and stationed at Dover AFB at the time this movie came out. For those that don't know, Dover AFB is the home of 48 C-5 Galaxy's. When this move was released it ran in our break room nonstop for two weeks. In spite of all the jeers about the errors in the aircraft we still found ourself clapping at the end of the movie. I only wish it was my aircraft that was blown up (70-00452)<br><br>In the end I don't really view this movie to be a military film, but rather a story of a hero overcoming adversity. The setting of a military aircraft just makes it a convenient way to tell which side is which.","user":"ralphb-3","rank":[8,16]}]