[{"title":"Dew it","rating":10,"date":"19 December 2019","review":"After watching the rise of skywalker and the sequels as a whole, I thought It would be fitting to come back here and show the love it truly deserves!<br><br>Revenge of the sith is my favourite Star Wars movie, empire being the best. Obi-wan, anakin and palpatine all steal the show as George Lucas shows how to close but also open a trilogy with the perfect bridge of prequel to original trilogy! From jaw dropping lightsaber duels to great story telling it has it all! I really believe so many more will appreciate not only this movie but the prequels as a whole showing that the best way to make a Star Wars movie is originality!<br><br>Though at times the script can be clunky, it sure doesn't take away the drama that continues to build throughout the movie as anakin starts to sway deeper into the dark side! Palpatines mischievous yet cunning way of turning anakin to the dark side of the force (did you ever hear the tragedy of darth plagueis the wise?). It really is the perfect bridge as we see dark aspects of the Star Wars universe (order 66) and also the fan pleasing moments and references imply what is to come!<br><br>This is Star Wars!","user":"nawi-34881","rank":[108,116]},{"title":"This is war","rating":9,"date":"5 June 2018","review":"May 19, 2005 was not a simple day for fans and fans of the \"Star Wars\". It was a day when all pieces of history fell into place, finally opening a riddle that lasted more than 28 years. People imagined and thought out, wrote books and stories, collected facts and made legends, and everything for the sake of one saga, which will forever remain in the hearts of its admirers. Probably, almost every person, leaving the hall, could not convey or describe in words, what happened during these several hours in the cinema. Joyful, sad, tearful, shocked faces, slowly headed for the exit, promising to come back and see this episode again.<br><br>This is the chapter of history, truly the most intense and the most powerful. It penetrates into the lungs, not allowing to breathe, touching hearts and souls. We are just spectators. But we can experience. And at some point, there is only a doomed sigh, realizing that there is no way out.<br><br>Indeed, the third episode is the most cruel and tragic. There is much more pain and despair in it than in any other part. Here the republic collapses like a house of cards, turning into an empire, the Jedi perish at the hands of their \"single minded\", and the face of Anakin Skywalker forever hides the black helmet of Darth Vader. And all this inspires horror, the horror of hopelessness, when you slowly begin to understand that all this is only part of the plan, the way of a petty senator to a ruthless emperor, where everyone is just a pawn, in a huge game of the big world. And every word said accidentally becomes the key to this great puzzle, which accompanies the imperial march. But when you realize it, it's too late.<br><br>\"I swear the faithfulness of your teachings,\" whispers the future dark lord to his master with despair and devotion, asking only one thing - to save her beloved. At this moment Anakin Skywalker perishes, dies together with the republic, along with the Jedi, together with her beloved, giving birth to Darth Vader - the future tyrant, which inspires terror and fear, driven by hatred and despair, in the eyes of which something like love is reflected ...\nAnd the most terrible thing was that it was inevitable. The Jedi themselves dug themselves a pit, while the enemy stood behind them, alternately, pushing them down. This is war. Order 66. The army of clones. Padmé Anakin. Alone, these errors are not so significant, but together they form a whole madness and panic, in one hour destroying everything that the galaxy has been working on for many millennia. Therefore here the absolute evil and absolute good unite in the struggle, this cinema and consists of some contrasts. Good and bad, the Jedi and the Sith, Obi-Wan and Anakin, the emperor and Yoda, Anakin and Padmé.<br><br>Such a controversial character went to Hayden Cristian. In essence, he plays two opposites in one body. Nobility and sincerity at the beginning and anger and hatred in the end. And all fear began, which slowly grew into panic, then into despair, anger, getting to hatred. It was thanks to fear that the emperor firmly grabbed Anakin's soul, not wanting to let go of his new servant. The glitter of embittered eyes, in which hatred for everything and the thirst for power breathe. It is difficult to imagine someone who could better cope with this task. Therefore, there are no more words left than one: \"I believe\".<br><br>It's all over, Anakin. I'm above you!<br><br>The battle of Obi-Wan and Skywalker is what remains in memory forever. This is not just a battle between two people who have spent together their whole lives, this is a battle between two brothers who sacrificed their lives for each other's sake. Here, the side and skills of each are determined. Obi-Wan (in the brilliant, by the way, performance of Evan McGregor) does not try to follow the easy ways to achieve his goals. He goes to Mustafar, he understands with bitterness what is going on. Therefore, this battle is not only with the darkness, it is a battle with yourself, with your feelings and attachments. Unlike Anakin, Obi-Wan is firmly committed to duty, goals, order. For some reason, he is sorry for the most in the end. A person who, in any situation, acted as correctly, and not as easily.\nAt the same time, we see the battle of two other opposites. Yoda and the emperor. Here, the battle goes for other concepts, for democracy, peace and freedom. The fate of the entire galaxy is being decided. And as the swords are crossed, good and evil are constantly side by side, weaving and maintaining the balance of power, crossing swords, but achieving different goals.<br><br>But where did it start? Padmé Amidala, without knowing it herself, is the center of the whole string and culmination that unfolds during these few hours. A tragic figure that unwittingly became the key to the empire, from which they simply got rid of unnecessarily. Natalie Portman, like no other, fits into a gloomy sweep and the helpless panic that reigns around. Her heroine is touching and ardent, but unable to change anything, she is only an outside observer of the war and the collapse of the republic.<br><br>Painful and sad ...<br><br>Most of the attention of the film is given to Anakin, whose fear and sweeping increasingly turns him into the ruler of the Sith. However, about the persecution of General Grievous, powerful battles and amazing planets, also did not forget. This is a movie that will not leave anyone indifferent. Yes, and whether to restrain feelings? After all, this legend, which will be remembered.<br><br>Bravo George Lucas.<br><br>The highest ball.","user":"BiiivAL","rank":[226,261]},{"title":"Epic, Emotional, and Powerful. George Lucas' Farewell to the Star Wars Saga is an Operatic Masterpiece of Blockbuster Cinema","rating":9,"date":"19 December 2015","review":"The final entry in George Lucas' Star Wars saga, Episode III - Revenge of the Sith is one, giant climax to arguably the most popular movie franchise in history. It's also the most riveting of the series; A movie of such visual and storytelling intensity that it makes our typical standards for summer entertainment seem trivial. Sith has wall-to-wall action and jaw-dropping special effects, yes. By all measures, Episode III is a grand success when it comes to giving the legions of Star Wars fans any and everything they could have hoped for after Darth Vader uttered the words \"We meet again\" in 1977. The beauty of Revenge of the Sith is that it earns much more than diverting summer thrills. Strip away all the baggage that comes with the name 'Star Wars' and what you are left with is one of the most enthralling films of 2005.<br><br>Star Wars: Episode III - Revenge of the Sith serves as a bridge to the first Star Wars, A New Hope, where we see the culmination of Anakin Skywalker's fall to the Dark Side. This is where Darth Vader is born. In addition to finally delivering on the promise of the entire prequel trilogy, Revenge of the Sith also has the gargantuan task of telling the story of how the Clone Wars ended, how an evil Empire emerged from a democratic Republic, and how Luke, Leia, Obi-Wan, and the rest found themselves where they are at the start of the original Star Wars movie. With all these massive story lines, it's a wonder that Lucas manages to squeeze the best out of every plot line, without straying from the film's most important element, Anakin's seduction by Chancellor/Emperor Palpatine. After having a vision of his wife, Padme, dying in childbirth, Jedi prodigy Anakin Skywalker consults with the chancellor, who expertly influences the young Jedi into turning to the dark side of the force. <br><br>The entire seduction works brilliantly. With the seeds of Anakin's tragic flaw planted way back in The Phantom Menace, and expanded upon in Attack of the Clones, Revenge of the Sith is free to focus on the straw that broke the camel's back. Anakin's desperation to save Padme's life makes his eventual turn believable, and Ian McDiarmid and Hayden Christensen both do well portraying an icy relationship that turns into a destructive mentorship. Anakin's final fall, framed alongside the rise of the Empire is a storytelling masterclass. Palpatine's seduction is subtle, yet dramatic, and the numerous loose ends from the originals are all tied with a certain kind of poetry. For all his writing deficiencies, Lucas spins this fable elegantly, with a delicacy that makes you realize, he's been dreaming of telling this story for a long, long time. <br><br>The plot marches relentlessly forward with commanding momentum, but it is only one side of Revenge of the Sith. The special effects and action are in a class of their own. Episode III is the biggest of all the Star Wars movies in terms of story, and the visual effects return the favor. Once again, Lucas and company revel in all kinds of wide, sweeping shots of new worlds such as the lava fields of Mustafar or the city-sized sinkholes of Utapau. It's all part of a grand, dramatic style of filmmaking that makes Revenge of the Sith look like a finale, through and through. It's also remarkable how certain elements like the ships, soldiers, and costumes seamlessly blend into what is seen in the originals. As sophisticated as the effects are, its George Lucas and his painterly talent for composition that propel the effects from technically well done exercises of CGI and miniatures to truly beautiful cinematic images. <br><br>Lost in all this is the action. The film begins with an old-fashioned space battle on an epic scale. It's a feast for the eyes, and it feels distinctly like classic Star Wars. The lightsaber duels, the lizard versus mono-wheel chase scene (which includes the villain General Grievous; a half droid, half alien, wheezing wonder of imagination and digital wizardry), and the Clone War battles are dazzling on levels rarely seen in traditional summer blockbusters. The final duel between Obi-Wan and a newly christened Darth Vader is operatic and straight-up Shakespearian in its emotional complexity. Along with the Order 66 montage, the action of the last half of Revenge of the Sith is as powerful as anything in the series.<br><br>As with any movie, there are things in Episode III that could be criticized. The dialogue isn't dramatically better than it was in the previous two movies, and the acting can be wonky at times, but none of this amounts to anything in the grand scheme of things. In the end, Sith does so much right that complaining about a line or two that was corny or delivered awkwardly is an utter waste of time. The finale to the Star Wars saga aims so high and nails so many key notes, that its minor flaws are almost completely inconsequential. Revenge of the Sith is one of the boldest works of blockbuster filmmaking ever made. I can't name another tentpole franchise movie that comes close to the level of operatic emotional poignancy that marks the best moments of Episode III of the Star Wars Saga. Movies like this don't come around often. A New Hope is still the Star Wars movie we will cherish most, but in its boundless ambition and breathtaking power, Revenge of the Sith is high art in the form of a summer blockbuster. George Lucas puts every idea he's had about good vs evil, fathers and sons, and the rise and fall of empires into this masterpiece of popular entertainment. Star Wars: Episode III - Revenge of the Sith is a brilliantly crafted epic, one that cements George Lucas' Star Wars Saga as one of the great achievements in filmmaking history.<br><br>92/100","user":"jaredpahl","rank":[164,195]}]