[{"title":"Basic but good direction from Cannon and good performances from many of the cast","rating":18,"date":"18 July 2002","review":"Youth crime and drugs are rife in London.  Scotland Yard call in an advisor from the DEA because they believe a new force is in play within the underworld.  Harris arrives in London to find nothing different from the LA he just left and begins to make links with Chris who seems to offer the only way into the gangs.<br><br>The story may not be anything to write home about, but this film was a good introduction to the ability (if questionable script judgement) of Danny Cannon.  The story makes a lot of leaps as Harris tries to shut down the American influence in the drug game.  However many subplots are weak or totally incidental and just seem there to make up the time.  The main story itself is a little too glossy and is a times just an excuse for Cannon's direction.<br><br>Cannon directs well here  London looks good, whether it's the dark alleys or the sun setting over the cityscape.  He can't really work well with character but he can do visuals pretty well.<br><br>Another reviewer has commented on the `unknown' cast  however there are no more `unknowns' in this than in anything else.  Keitel is good despite having the whole family subplot that he clearly doesn't know what to do with and he doesn't do as much with his exploitation of Chris as he could have  but he's always watchable.  Kelly is good as the young Chris  but the emotion towards the end is a little beyond him.  The rest of the cast is fully of unknowns is it?  Thandie Newton?  Viggo Mortensen? Keith Allen?  A host of faces from British TV and films?  All are pretty good although some have more to do than others.<br><br>Overall the plot may not be totally together but a good strong lead by Keitel and a good bit of direction by Cannon makes this feel better than it actually is.","user":"bob the moo","rank":[16,18]},{"title":"A fine debut for Danny Cannon - but what happened . . . ?","rating":6,"date":"12 August 2005","review":"There's a couple of stories (possibly apocryphal) about how Cannon's career was launched, one story is that respected film Director Alan Parker, saw a short film he made on a BBC amateur film-making programme and, impressed with what he saw, immediately phoned the BBC so he could get in touch with Cannon - which he apparently did, Parker then supposedly recommended him to a prestigious film school...<br><br>The other story is that Danny Cannon's father is a top studio executive and that nepotism was the way he started.<br><br>Either way, Cannon's debut film was an interesting little movie with big aspirations - at the time British films tended to be almost always socio-political, so-called worthy films, usually about the social underclass - remember this was 1993 and just before Richard Curtis invented the Britsh Rom-Com...<br><br>What the film lacks in terms of story (Cannon was Co-Writer) it makes up for in sheer film-making skill - The Young Americans is a beautiful-looking movie.<br><br>It's a film that belies it's VERY low-budget, and looks like a much more expensive piece.<br><br>Danny Cannon displays an almost Ridley Scott like style in the care he takes with the look of the film, and the careful, unhurried pacing, he is aided in his efforts by excellent Anamorphic 2.35:1 photography from D.P. Vernon Layton - giving The Young Americans a rich, almost sumptuous look, for what, on the surface, is a gritty urban crime thriller.<br><br>A special mention should be made for Composer David Arnold and his beautiful, almost tragic Music Score - of course he went on to bigger things: Stargate, Independence Day, the Bond movies - Tomorrow Never Dies, The World Is Not Enough, Die Another Day, plus Zoolander, Changing Lanes, The Stepford Wives and the upcoming Ghost Rider, and another Bond - Casino Royale.<br><br>Personally, I thought Danny Cannon's career might have amounted to something more substantial that just 3 feature films.<br><br>These films include the badly mis-judged(!) Stallone vehicle Judge Dredd and the horror sequel I Still Know What You Did Last Summer - not sure how the latter film fared at the box-office (though I suspect not good!) <br><br>I DO know that Judge Dredd was a BIG financial and critical failure - Cannon got the film right after The Young Americans, tiny budget to mega budget - could this be a case of Cannon running before he could walk? <br><br>Of course Danny Cannon has found considerable success as an Executive/Supervising Producer, occasional Writer and sometimes Director on the 3 hit CSI TV series from Jerry Bruckhiemer - this in itself is no mean feat, but I do feel Cannon's potential as a Director of Feature Films has gone largely untapped and that he could have made a more substantial career if he'd stayed in Movies.<br><br>Hear he's got a Soccer movie in the works, let's hopes that this is a return to features for an underrated and talented Director.<br><br>Lata.","user":"pagangod","rank":[13,17]},{"title":"A powerful dark drama with millieu and mood first and story second.","rating":7,"date":"10 December 2001","review":"There's hardly a smile to be found in this dark, brooding, oppressively heavy drama which tells of an American DEA agent (Keitel) who comes to London to assist in the capture of a drug trafficker as the UK bends under the strain of a virulent drug trade. The camera spends most of the time examining the bleak, grim, and sad expressions of police, innocents, and others caught up in the drug war leaving the plot muddled and somewhat buried in its attempt to show that where drugs are involved there are no winners. A powerfully compelling drama for those who can appreciate the reality of the lose-lose nature of crime.","user":"=G=","rank":[13,20]}]