[{"title":"A fun film, if nothing else.","rating":8,"date":"8 September 2002","review":"First and foremost, if you have read the Dumas book, then you realize that this movie doesn't resemble the novel in the slightest.  The only thing that this movie got right was the names of the characters! <br><br>\nHowever, I am a big advocate in saying that you should never compare a movie back to its book, and I use this movie as an example.  This story has been \"Disney-fied\" so that it can be called a family film.  If you read the book, a true adaptation would not be family entertainment.  Disney changed everything that they do.  Read the Tarzan novel and compare to the cartoon. BIG changes there.  The Little Mermaid.  How convenient that Disney left out the fact that Ariel dies at the end of the story.<br><br>But what we should judge is the end result.  This movie is still entertaining, despite having nothing to do with its literary influence.  The characters are portrayed with the same attributes that they have in the book.  For instance, D'Artagnan, while very duty bound and honorable, is young and headstrong, and prone to impulsive decisions that will help him to prove his skill and worth.  Porthos is self serving and self praising, very vain and cocky, yet has a lust for the finer things in life.  Aramis is humble and religious, but very skilled and intelligent, making him a very formidable soldier, yet he also loves the finer things in life.  And Athos loves his wine, trying to bury himself in a alcoholic haze to hide the pain that he suffered in losing the love of his life.  All of these come through in the movie, and all of the actors were great in performing them. <br><br>\nAs far as the story is concerned, Disney likes things black and white, good vs evil.  And so, the story changes to make the Cardinal a power hungry man with his own interests in mind.  He wasn't like that in the book or in real life, but he was underhanded, and Tim Curry does another great job as the villain that he steals the show.<br><br>Overall, a great and enjoyable movie, worth watching with the family.","user":"Skeletors_Hood","rank":[65,70]},{"title":"Underrated swashbuckling adventure from the 90s Young Turks.","rating":10,"date":"15 August 2003","review":"This is a VERY underrated action-adventure story which revamps the classic tale with a lot of top class young talents of the 90s.  The humour and action fit together perfectly, and it features some very outstanding scene-stealing performances; especially from Tim Curry (natch!) and Oliver Platt.<br><br>&lt;Spoiler Warning&gt;<br><br>IMHO, Chris O'Donnell plays a young dashing hero very well in this (my fav movie of his); and Platt, Charlie Sheen and Keifer Sutherland play the classic sword-masters with a great mix of dash and humour.  Keifer's dramatic undercurrent to the frivolity going on around him works very well, and helps this from becoming too schmaltzy.  The highlight for me was the the scenes where D'Artagnan accidentally arranges three fights with the famous trio; as well as the final climactic showdown of course.","user":"BadWebDiver","rank":[27,31]},{"title":"Harmless and action packed","rating":8,"date":"15 March 2012","review":"Lightheaded and lighthearted this is the definition of escapist entertainment and that is meant as a compliment. Something to watch when you want to relax and not have to think about the plot of the movie. <br><br>Chris O'Donnell is impish if a bit callow in the lead but the real show is musketeers anyway and there is where the movie excels. Keifer is suitably brooding as Athos and Charlie Sheen, before he became a surly twitchy mess, is a charming Aramis. The standout however is Oliver Platt going full on ham as Porthos giving a delightfully over the top performance and walking off with the picture whenever he is on screen. <br><br>Rebecca De Mornay also seems to be having a good time enacting the villainous Milady de Winter, she's sexy and silky. Lastly there is Tim Curry positively consuming the scenery as Cardinal Richelieu, in his flowing red robes he and Oliver Platt are in a dead heat for biggest scene stealer. <br><br>The production is high class with vibrant with color and beautiful settings, true it bears only a passing kinship with the source book but it is a fun time with lots of action and a carefree mood.","user":"jjnxn-1","rank":[14,16]}]