[{"title":"highly derivative sci-fi film","rating":26,"date":"26 February 2000","review":"What do you get when you mix six parts \"I Married a Monster From Outer Space\" with four parts \"Rosemary's Baby,\" \"The Omen\" and \"Village of the Damned,\" shake it and stir it, then add \"Invasion of the Body Snatchers\" and the \"Alien\" movies as  chasers?  You end up with \"The Astronaut's Wife,\" a film cobbled together from so many disparate and familiar sources that the audience is always ten giant steps ahead of both the plot and the characters.<br><br>This shamelessly derivative film, essentially an unattributed remake of \"I Married a Monster From Outer Space,\" stars Johnny Depp, taking one of his rare side forays into straight commercial moviemaking, as an astronaut who experiences a strange, inexplicable two-minute long phenomenon while outside his space capsule and who returns an oddly changed man - though Depp plays both the before and after roles in so similarly deadpan and lowkeyed a style that we frankly cannot see too much of a difference.  Charlize Theron portrays Spencer's wife, Jillian, who slowly comes to perceive that all is not true blue with her hero husband.<br><br>\"The Astronaut's Wife\" suffers so fatally from a sense of deja vu that it becomes almost impossible to stay interested despite a yeomanlike performance by Theron who even sports the shorn pixie hairstyle made famous by Mia Farrow, thirty-two long years ago, as she too ran around New York City, desperately searching for answers as to just what diabolical force was incubating deep inside her womb.  <br><br>This film does provide an admirably dark finale as well as art direction, cinematography and music that create a spare, almost hermetically sealed world, devoid of sunshine and life.  Too bad these quality elements are placed into the service of such completely unimaginative material.","user":"Buddy-51","rank":[53,70]},{"title":"Could have been a Classic Thriller","rating":8,"date":"14 April 2004","review":"I watched this movie yesterday, and I was hooked to its haunting story till the end. First I have to say the performances were excellent, Johnny Depp still surprises me with his variety of roles, I can't imagine he could have done the hilarious role of Captain Jack Sparrow after this scary role.<br><br>His eyes were acting more than any part of his body and you could feel the slight change in his character through the stillness of his eyes. Charlize Theron gave a better performance than her Devil's advocate role although they had the same criteria, the disturbed wife. But her genuine agonizing performance distinguished her in this movie.<br><br>I noticed the music was a major pillar in this movie, it was like another main character in this movie, the editing was great also especially the scene in the subway. The story was an original also, it had good turn ups and twists.<br><br>The movie had all the right elements in general and it certainly doesn't deserve a 4.7 on the imdb. I think the voters were greatly disappointed after seeing all those good elements destroyed by the cheesy and typical ending that only producers could have had a part with, in order to make another sequel.<br><br>The ending by all means was bad, it destroyed the originality of the story and the tension build up. I give it an 7.5 for all the good elements, it would reached a 9.0 if the ending was different.","user":"mmr07","rank":[97,134]},{"title":"Visually enticing and well acted, but poorly executes good ideas. ** out of ****.","rating":4,"date":"30 April 2000","review":"THE ASTRONAUT'S WIFE / (1999) **<br><br>Johnny Depp plays a NASA astronaut named Spencer Armacost who, while on a space mission, losses contact with Earth for two minutes. He and his colleague, Alex Streck (Nick Cassavetes), return home to their spouses, Jillian Armacost (Charlize Theron) and Natalie Streck (Donna Murphy). Bizarre episodes begin to occur with Alex, leaving Jillian suspicious of her husband's condition. As her husband's strange behavior increases, Jillian begins to question what really happened in those 120 seconds.<br><br>\n\"The Astronaut's Wife,\" written and directed by Rand Ravich, poorly executes good ideas. We have imaginative and potentially suspenseful ideas with this film's concepts behind such happenings in two minutes as Spencer and Alex are in galactic boundaries. The gradual increase in Spencer's unusual behavior depicts effective suspense-but thorough introduction of the characters does not take place, nor do we witness the key events in which the rest of the move hinges upon. Consequently, \"The Astronaut's Wife\" does not work.<br><br>The film's first act is full of incidences, characters, and subplots. Clearly too many things happen too early in the story. Within the first thirty minutes the production attempts to develop two separate relationships, shows us the atmosphere of a teacher's workplace, something bizarre transpires out of earth's orbit, a decision is made to resign and move to New York, a suicide takes place, a character mysteriously dies, and probably  more. I just couldn't follow the plot.<br><br>I liked the eerie, supernatural overtones located throughout the production. The film is smart to reveal the right amounts of information at the precise time. There is also a certain style to \"The Astronaut's Wife,\" containing an elusive mood, a weirdly intriguing design, and some tense and unusual camera angles. The movie becomes more interesting as we reach the closing.<br><br>Charlize Theron has been in a lot of movies lately, but \"The Astronaut's Wife\" is her first leading role. She seems to have come out of left field in 1997 with the comedy \"Trail and Error.\" Afterwards, she contributed larger performances in \"The Devil's Advocate,\" \"Celebrity,\" \"Mighty Joe Young,\" and most recently \"The Cider House Rules,\" and \"Reindeer Games.\" Her role in \"The Astronaut's Wife\" is a little more complex than her past credits, excluding her enticing and believable acting job in \"The Devil's Advocate.\" She presents the traumatized Jillian Armacost with the perfect blend of zest and tragic confusion. <br><br>Depp and Theron conjure a chemistry-rich couple. The movie very clearly takes Jillian's point of view instead of allowing us to know mysteries with Spencer. This stays consistent and focused, but sometimes leaves us pondering about unexplained events.  <br><br>\"The Astronaut's Wife\" builds for an awe-inducing conclusion through revealing and intriguing dialogue and an omnipresent undertone. The film suggests a form of extraterrestrial is behind the deaths of several characters as well as the strange behavior of Spencer, but we learn the truth  only in the end. Call \"The Astronaut's Wife\" an unusual \"The X Files\" episode featuring a cliffhanger conclusion and a supernatural climax. The movie must have appeared really exciting on script. If only more capable filmmakers would have claimed this production we may have had a real winner. Instead audiences feel disappointment and failure, potential is wasted and originality is underscored","user":"Movie-12","rank":[57,77]}]