[{"title":"Always Satisfying To See Punks Get It","rating":7,"date":"16 August 2006","review":"Even though it was kind of a low-class type of story and movie with mostly bad, profane people tossing the f-word around like it was candy, it still was an enjoyable movie in a lot of parts and certainly had a satisfying ending. Perhaps that's why it was successful enough to spurn a sequel (albeit, a weak one.)<br><br>Tom Berenger is good to watch. He's convincing as a tough guy substitute teacher \"Jonathan Shale\" who won't put up with the punks in the classroom. And, boy, you see the worst group of high school students I've ever seen on film. Tough to imagine kids harder to encounter than these slime-balls but satisfying to see them dealt with accordingly. <br><br>You have to love it.","user":"ccthemovieman-1","rank":[41,44]},{"title":"Not high art, but you gotta enjoy teachers putting it to the punks!","rating":4,"date":"4 August 2002","review":"\"The Substitute\" is not high art. Ebert reviewed it as a serious film and gave it a very negative review. But as a B-movie where the teachers get revenge, the bad guy dope-peddling punks and principal get their due, it is a virtual \"The Patriot\" for the high school system. You can't help but smile and root and rejoice when punk after punk gets thrown out the upper floor window by Beringer while the principal relaxes in his office, assuming the punks will prevail.<br><br>Beringer plays a mercenary who becomes the substitute when the real teacher is injured by the punks. With his background in covert operations, and his support network, the punks are no match for him. I've seen it several times on network TV, its one of those films I just can't stop watching. Roy Frumkes, who wrote each of the \"Substitute\" movies wasn't trying to create a classic, just fun entertainment. In a personal communication he said, \" Not only did that film surprise everyone by doing as well as it did, but when it came time for the three sequels, my contract was worded so that they couldn't get rid of me!\"  Thus providing his retirement fund. Hey! some people win the lottery. His was a different kind of lottery.<br><br>I like \"The Substitute\" a lot. I think Roy Frumkes is a classy guy. It is destined to be one of those cult films that lasts much longer than logic says it should.","user":"TxMike","rank":[35,38]},{"title":"Great fun. Just don't take it seriously!","rating":7,"date":"1 April 2003","review":"No matter how many times this movie is shown on cable, I still have to pause for at least a few minutes and watch portions of it. This is one of those action films that will entertain you as long as you don't try to apply logic to it or take it seriously.<br><br>The story has a professional mercenary (Berenger) and his army pals looking for work after they are cut loose from active duty following a botched mission in Cuba. Berenger doesn't want the group to get involved in running drugs for anyone, but that seems to be the only work that mercs can get these days in Florida. After Berenger's girlfriend is attacked by a ruthless street gang (led by Latin heart-throb Marc Anthony, no less) he and his pals end up trying to weed them out of the high school where she teaches. Berenger poses as her substitute teacher, and once he gets an inside look at the problems at the school, he realizes there may be more than just a gang of punks causing the trouble. It's up to Berenger and his merc pals to try and rid the school of its criminal element, and make things safer for the kids.<br><br>You cannot deny the good intentions of the plot, even if it is a bit preposterous. The acting is a little wooden in places, and the soundtrak (particularly the rap song in during the final credits) is laughable. The script has some questionable dialogue, and sometimes it can be downright amatuerish. There are plenty of shoot-outs and explosions to get the viewer's blood pumping, and it's nice to see someone make a stand in a tough environment like an inner-city high school.<br><br>This movie has spawned a few sequels which I won't comment on since I have only seen one of them, and they have no connection to the original.<br><br>Overall, this film is definitely worth watching if you are into action and revenge type themes. If you are looking for anything deep and insightful about the problems of the inner-cities, you may want to look elsewhere.<br><br>\nSo sayeth the Hound.","user":"TOMASBBloodhound","rank":[21,23]}]