[{"title":"Why so harsh?","rating":7,"date":"2 December 2007","review":"I gave this movie a 7 on a scale of 1-10 because I took into consideration it is a kids movie and should be judged as such. When this movie came out I was 13 and of course I enjoyed it much more then as opposed to now but having watched it as a child and as an adult I do remember how much I enjoyed the film as a kid. From the harsh grade of a 4.4 average I assume people where comparing this to complex movies with great plots. Kids should not be subjected to nothing but adult theme. So when you grade the movie remember what audience it was desighned for.As a child I would have gave this movie a 7. Would you drive a metro and act as if it should perform like a porsche?","user":"robb4964","rank":[57,60]},{"title":"Enjoyable Movie For Teens & Adults","rating":8,"date":"13 November 2006","review":"This is definitely teen fare, but it's very entertaining which means adults would get a lot of laughs out of it. As with any comedy, some of the stuff is really stupid and some of it is really funny. Along the way, you get some of modern Hollywood's secular plugs and a few swear words that you wouldn't want your little ones to hear, but overall, I have little to criticize with this one.<br><br>There were a number of sight gags, things that made me laugh out loud, such as dollar signs instead of spots on the dog, the dress-ware of the little rich kid (Macauley Culkin), the eccentric characters - good and bad guys - are all fun to watch.<br><br>I thought Jonathan Hyde, as the butler, stole the show.","user":"ccthemovieman-1","rank":[37,44]},{"title":"Good Fluff","rating":6,"date":"29 September 2007","review":"Sometimes, when I come home tired from work and have a brewski and want to zone out, I feel like a total fluff movie. Richi Rich fills the bill. It moves along, something most movies don't. It's harmless and doesn't require any involvement on my part. The jokes are silly. I can miss some of it on a fridge run, come back to it, and still follow it. In fact, if I don't finish the movie, it doesn't seem to matter. However, it is charming, so I usually do.<br><br>The movie pokes fun at the super rich on a superficial level, but that's all right. I'll save the harshly critical movies for a different mood. There's some lovely views of the Biltmore estate. There's light ribbing of the corporate world. Oh dear, I'm falling asleep. I'll miss the end of the movie. Too many brewskies.","user":"marsh876","rank":[29,34]}]