[{"title":"Just Like the Comic - For the Right and Wrong Reasons.","rating":5,"date":"11 June 2000","review":"This film is just like the comic that inspired it: Great visuals (I still really like McFarlane's superhero art style), but much like the majority of \"Spawn\" stories, it really doesn't go anywhere. The set looks good, the characters look good, the cape looks REALLY good, but the story? Other than telling the origin and the standard \"must stop the bad guy\" motive, it doesn't do as much as it should. And yes, I know it's a Hell-based movie, but the metal soundtrack just got distracting and annoying, instead of enhancing the story like it should have. John Williams or Danny Elfman it wasn't.<br><br>Need to see the film? It's a great visual ride. Just don't expect much more than that. It did make for some cool toys, though.","user":"GuyCC","rank":[59,85]},{"title":"Heavily flawed, still enjoyed it a bit.","rating":6,"date":"20 November 2019","review":"You can easily tell that comic book based movies were not a popular demand back in the '90s. Spawn is a result of a sloppy adaptation from a source material which is really difficult to rightfully adapt, special effects that were expensive and got dated after two years and a production company that didn't seem to have taken the making of this movie seriously. So logically it feels like a really poor effort, yet it has its moments.<br><br>Great casting choice in Michael Jai White, he proved himself worthy of portraying a broken man looking for revenge and a chance to see his family again. Action sequences are actually quite tolerable, and dark humour mostly provided by John Leguizamo's character (in a funny/disturbing performance) was done to a right amount, enough to add a bit of edge to the story and not much to harm the film, a trend you see nowadays in comic book films, too much unnecessary humour.<br><br>The special effects are cringe-worthy at best, which don't really appeal visually other than the cape and Spawn's overall look. So, there aren't many reasons to watch this film, well perhaps the hope that a new Spawn adaptation won't be as bad as this one. Even though I know it's bad, I still got a kick out of it, hence my 6 rating.<br><br>Oh, if you expect to see a good performance from Martin Sheen, you can forget about it, he's atrocious in this. All I want to do is forget he was in this movie.","user":"patriciogl10","rank":[5,5]},{"title":"A flawed but enjoyable absurdist horror-comic book film","rating":8,"date":"25 January 2005","review":"Al Simmons (Michael Jai White) is one of the top operatives for Jason Wynn (Martin Sheen), who is the head of an organization called A6. When Simmons becomes aware that A6 might be a little shady, he learns the hard way that he isn't allowed to quit A6. This leads to his transformation into Spawn, a superhero with a background and motivations that are just as morally ambiguous as A6. The film largely concerns Spawn discovering and exploring his new identity, while working to uncover a nefarious plot and attain revenge.<br><br>If you read my reviews frequently enough over time, you'll notice that my ratings often change on repeated viewings. My rating for Spawn has definitely gone down since my last viewing, but currently, I'm giving it a generous 8 out of 10. There are a lot of things that are brilliant about the film, at least for viewers with particular, odd tastes similar to mine, but there are also too many unfortunate missteps to allow for a higher score.<br><br>Let's look at the missteps first. The main problem with the film is that screenwriter Alan McElroy and writer/director Mark A.Z. Dippe tried to squeeze far too much plot and too many characters into a 90-minute film. In retrospect, it would have been better to make one film covering everything up to Spawn's transformation (or the beginning of the transformation), and then save the other material (which comprises the bulk of the story here) for later films. Maybe Todd McFarlane, who created the comic books upon which this film was based, was worried that he wouldn't receive funding for sequels, so a multi-film plan wasn't attractive. As it is, there have been no live action sequels to date (there have been animated versions of Spawn), but I think there may have been if the first film would have been handled differently.<br><br>As the film stands, too much time has to be spent explaining the plot. The A6 plot is complicated enough, but there is a very high-concept idea behind the creation of Spawn that also has to be explained, too. Also, a lot of characters, most critically Cogliostro (Nicol Williamson--one of my favorite character actors), are basically wasted. There just isn't time to get into them.<br><br>A further problem is that both Sheen and White use odd affectations in their speech. I suppose it's supposed to be over-the-top in a comic book way, but on this last viewing, at least, it was more distracting to me. Also, a lot of the cgi-heavy effects already look very dated, and there's a weird cheesiness to most of the scenes in Hell. On the other hand, I personally like that kind of weird cheesiness, so I didn't subtract any points for that.<br><br>And speaking of weird cheesiness, I'm sure a lot of people hate John Leguizamo's character in the film (Clown/Violator), but I love it. It's exactly the kind of surreal campiness--part horror, part humor--that I cherish. As Mike Mayo has said, he's like (an evil) Krusty the Klown on acid. That works well for me, but if you're not the kind of person who loves films like Killer Klowns from Outer Space (1988), you probably won't like this Killer Klown either.<br><br>There is also a great campy quality to the material overall, including some of the dialogue (a scene where a father yells at a son in \"Rat City\" for spitting out a meal they retrieved from the garbage because it's \"wasting good food\" is a treasure). Spawn, the comic, is really a bizarre amalgamation of a number of different influences, from horror to twisted fairy tales, and the film is not afraid to indulge in that.<br><br>The best part of the film, though, aside from Leguizamo's character, is Spawn as superhero. The costume and devices of the costume are fantastic, the cgi for the costume is excellent (I especially loved the cape), and White (as well as the stunt person(s)) does a great job physically. All of the action sequences involving Spawn were incredible. I wanted to see a lot more of that kind of material. In fact, the visual style of the film overall is admirably creative, all the way down to the opening and ending credits.<br><br>In the end, the film teeters between being something that's \"so bad, it's good\" and being just a good film with some unfortunate flaws, but in either case, it's still very enjoyable to watch. You just need to approach it not expecting a realist dramatic masterpiece, but rather with a love for the absurd.","user":"BrandtSponseller","rank":[69,108]}]