[{"title":"A personal favorite of Gloria Steinem.","rating":6,"date":"4 May 2003","review":"Two very disturbed brothers kidnap women, take them to their secluded farmhouse and lock them in the basement. They seemingly do it for their mother (a la PSYCHO), who is only seen from behind, sits on a rocking chair and says, \"Ah, it's good to have two fine boys!\"<br><br>Johnny (John Stoglin) is the mentally adolescent one in overalls who bounces up and down, likes to be pushed around in a wheel barrow and, more importantly, likes to play \"games.\" The sick games include doctor (where women are stripped naked, fondled and get a syringe stuck in their ass) and topless leap-frog (?!) John is also a voyeur who watches a young couple have sex, then kidnaps the girl.<br><br>The other brother is Frank (Gary Kent), who is depressed, impotent and sulks around a lot in deep thought. He seems fairly normal except during scenes where he rants about his mother, kills and tries to rape a captive. In one scene he relates an outrageous flashback to how his mom drove his fiancée away by telling her that \"We make love! We make love like two lovers!\".<br><br>The sickly chained up women in the basement have rats crawling on them while they sleep, are beat, sometimes killed and constantly humiliated and subjected to the sick games of brother Johnny. They're referred to as \"pets\", \"toys\" and \"playmates\" by their captors. Yes, this film (the video I picked up was titled LET'S PLAY DEAD) is very trashy, offensive and misogynistic, but cult/sleaze movie fans will love the depravity at work in this entertaining and mostly forgotten gem of the 1970s exploitation circuit.","user":"capkronos","rank":[32,39]},{"title":"Very very tame","rating":3,"date":"9 October 2009","review":"I'm not sure what I was expecting from this film. I suppose I did want to see some schoolgirls and some chains. And I sort of got both. There are maybe 2 scenes with chains, but they are like dog leashes, which is pretty silly. And after forcing myself to finish the abortive The Forest, by the same director,(and yes, I foolishly purchased The Forest, curse my hide), I have no idea why I wanted to see this. I read that this was up on the banned list for a while, not sure if it really was banned or what. Apparently the title Schoolgirls in Chains was substituted with Abducted, but some censors still found copies with the original title and flipped. Anyway... What you have here is your basic Psycho rip-off with a little Of Mice and Men thrown in. Two brothers, one a sort of regular guy(who sleeps with his mother, OK there is no sleeping going on) and another guy who is a simpleton who likes to play children's games, live in a house where they keep girls they have abducted under their home in a cellar. There aren't a lot of sex games, as one might expect with a title like this, but there is one rape scene which is rather mild and brief. Mainly, you have the idiot brother, John, playing games like Hide n Seek or Follow the Leader with the girls as the damsels plot for ways to escape. Of course, I was waiting the whole time for the \"pay-off\" which would come in the form of some good revenge on the part of the girls. Unfortunately, that didn't really happen. Frank, the \"regular fellow,\" does get his comeuppance, but by his own hand, leaving John presumably to be a ward of the state again. Strictly speaking for myself, because I'm strange, I would have thought a much better ending would involve the latter-day heroine, Bonnie, and her boyfriend going into the upstairs bedroom and finding Frank and John in bed with their mother's dead body, or Frank dressed as his mother with John next to him and Frank talking like their mother. Or just shotgun the lot of them. <br><br>In short, you really have to have nothing better to watch than to sit through this one. Minimal nudity, no gore(except for a shot or two of a decaying body), sloooow pacing, bad acting, no violence to speak of, etc. But....it's still a lot better than The Forest.","user":"Tender-Flesh","rank":[12,14]},{"title":"Psycho-pstyle pseventies psickness.","rating":3,"date":"3 December 2003","review":"Charming little thrust of misogyny concerning two psychotic brothers(one, a drooling, feeble-minded idiot, the other a more literate and functional idiot) who abduct random pretty girls off the interstate and imprison them in a filthy storm-cellar. The purpose for this is that the girls are regularly utilized as props for the brothers' sick, perverse \"games\". The reclusive mother of the boys, a strict, punctilious old broad, oversees these sadistic activities with loving but cautious approval.<br><br>A gleaming example of \"only in the 70s\" cinema, this lovably tactless little mud-wallow is a treasure-trove of trash-a-plenty. Incest, torture, nekkid gals, rape, and murder...all the requisite bases are covered, and there's even some almost-artful production qualities. Sure, the conceptual nuts-and-bolts of SCHOOLGIRLS IN CHAINS might be hackneyed and unoriginal, but this flick injects some pretty edgy nastiness into those worn-out ideas and shoves them straight up your nose.<br><br>Recommended to most, and mandatory for vintage trash-film zealots...7/10","user":"EyeAskance","rank":[19,25]}]