[{"title":"This is a good movie! What was the problem?","rating":7,"date":"7 January 2002","review":"Why the poor box office performance?  Why the bad reviews?  Why the bad word of mouth?  I really didn't see anything horrible about this movie!  First of all, it's a character-driven story.  There's little subplots involving jealousy and philandering, but it's not handled in a soapy fashion.  I didn't feel any of the characters were one-dimensional.<br><br>\nOf course, Mike Myers steals the show as the homosexual club owner Steve Rubell.  I don't know the real Steve Rubell, so you be the judge whether or not his performance was accurate, but I have to say that Myers did an incredible job!  And I'm not overstating the least bit!  You watch him in this movie and you totally forget that this is the same guy who played Austin Powers.  Not to say I didn't realize Myers had talent prior to watching this film.  He has definitely proven that he has talent as a comic actor, but I didn't know he had the chops to pull off a straight, dramatic role.  Even his accent sounds real, not the least bit phony.  I'm surprised Myers didn't even get an Oscar nod.  He should've at least gotten the nomination for Best Supporting Actor.  Trust me--you will be blown away by his performance in this movie!<br><br>The music is great.  It's always great to reminisce to the great songs from the seventies.  Mark  Christopher nicely captured the whole rebellious atmosphere of 54.  We're given a taste of the drug addiction and even the sexual promiscuity that made the place famous--there's a scene where a couple shamelessly pounds away on the balcony.  I read one person's review, saying that this movie should've been an hour longer.  I find it ironic that people watch movies that are two and a half to three hours long and complain, \"Oh, this movie dragged!  Oh, this movie needed more editing!\" Yet they watch a succintly timed film like this and complain it's too short. This may not have been the most thorough examination of the famous nightclub, but I think it got to the point.  No reason why we have to go into every tiny detail.<br><br>This is a serious, dramatic film but it's also very entertaining.  I actually had a smile on my face when the movie ended.  It ended on a happy note without having that forced, schmaltzy Hollywood feel.  Plus, I really like that song \"Knock on Wood\" that they played over the credits.<br><br>\nMy score:  7 (out of 10)","user":"mattymatt4ever","rank":[48,58]},{"title":"Surprisingly well done.","rating":26,"date":"26 January 2001","review":"One does not usually expect a popular movie to be much good, namely because it caters to the tastes of a crowd, which are notoriously un-demanding. Rarely, however, one finds a film which delivers on its promises.  This, fortunately, was one of these films. The acting was the high point of the film.  Mike Myers wore his role like a skin, naturally and easily.  Ryan Phillippe proved that despite occasional bursts of negative popular opinion he is more than a simple dime-a-dozen pretty boy, and possesses both skill and talent, both of which are put to good use.  (And he is good looking, which despite all else, never hurts. But, let's not belabor the obvious).  The filming was excellently done, with a good eye towards shock and an occasional shot of strangely unexpected beauty. The only real objection one could put to this film is that it was far too short.  Several sub-plots came up which were either abandoned or underdeveloped, and the ending, while highly effective, had a slight air of \"deus ex machina\" about it.  On the whole, though, a talented, unusually intelligent film with excellent actors and direction.  Well worth watching.","user":"iliawarlock","rank":[35,43]},{"title":"Mike Myers should have received that rumored Oscar nomination for this movie...","rating":8,"date":"17 June 2000","review":"While the acting is pretty dull in this movie, Mike Myers proved that he can handle serious drama. Shortly after this movie came out, it was rumored that Mike Myers would receive an Oscar nomination for Best Supporting Actor for playing the Studio 54 owner. I would have strongly agreed with this nomination, and I only recommend 54 to anyone curious about the serious side of Mike Myers.","user":"joely-3","rank":[22,26]}]