[{"title":"\" Fear is the other's guy's problem, . . Unfortunately, I'm the other guy! \"","rating":6,"date":"14 March 2011","review":"Liam Neeson was once a truck driver for a beer company, whether or not he was any good is a matter of conjecture. Fortunately, for movie audiences around the world, his talent for acting on the big screen has superseded and today he is known as one of the finest thespians in show business. Take this film for instance, it's called \" Gun Shy. \" In this story, he plays Charles 'Charlie' Mayeaux (pronounced - MAYO) a field operative working for the D.E.A. His job is to take on the big drug cartels and put them out of business. However, a bad experience in his last encounter with the drug lords, got him so shook up, it left him with a confidence problem, which has created a noticeable fear of death. So much so, he has begun seeing a therapist. In the meantime, his job continues and he must go undercover to confront the Columbia drug cartel and the America mafia, which could get him killed. Oliver Platt, is a gangster with anger management issues, José Zúñiga and Michael DeLorenzo play Columbian operatives out for the big score or big hit, whichever comes first. If that were not enough, Charlie must also attend Group therapy with Richard Schiff and other problem oriented patients. Mitch Pileggi, interestingly plays Dexter Helvenshaw a corrupt agent. Although there are several parts of the film which exercise Neeson's great gifts for interaction, most of the movie scenes are hampered with too many issues and little cohesion and this makes for awkward moments. Still, it's a good and interesting film and one which makes for entertainment and isn't that what movie making is all about? ***","user":"thinker1691","rank":[10,10]},{"title":"Stressed out","rating":7,"date":"6 February 2006","review":"No wonder Charlie, the man at the center of the film is suffering from the pressures of his job. He has too many things to worry about and all his problems affects his stomach functions producing funny noises at the worst moments. What's an undercover man to do? He gets involved more deeply into trying to do a decent job and in the process, he falls in love with the woman who understands what has to be done to relieve his symptoms.<br><br>Erik Blakeney has written and directed a film that should have been seen by a wider audience, yet, this movie came and went without fanfare. It deserved a better fate because of the funny screen play Mr. Blakeney created and the wonderful cast that was gathered for the picture. The problem seems to have been in the marketing. This is clearly not a Sandra Bullock vehicle at all!<br><br>Liam Neeson and Oliver Platt are about the best thing going for the movie. Liam Neeson's Charlie is one of the funniest roles he has done in his career. Mr. Neeson tends to gravitate toward more dramatic fare, but as Charlie, he proves he is an accomplished comedian. The same goes for Oliver Platt who plays a bad guy interested in domestic activities such as cleaning a messy kitchen, or even thinking about a life in Italy growing tomatoes.<br><br>The minor roles are equally good. Jose Zuniga and Micahel DeLorenzo are hilarious as a pair of gay drug dealers. Sandra Bullock doesn't get as many opportunities in the movie, but she is seen in the pivotal role of Judy. The group therapy sessions involving Charlie and other law enforcing people are fun to watch.<br><br>Erik Blakeney shows he can do good work if only he could have the right studio people behind him.","user":"jotix100","rank":[28,33]},{"title":"Brilliant but poor marketing...","rating":10,"date":"2 May 2004","review":"This gem hit box offices in 2000, though there's a large chance that you were sick the day it was in theaters.. Disney mistakenly bills this as a Sandra Bullock romantic- comedy, which it  isn't... If you want to see Sandra Bullock in a cutesy role, go see \"Miss Congeniality\". If your tired of one-track crap like that, come see Gunshy. This is an honest, funny view of what happens when Liam Neeson's character, a former DEA golden-boy, starts getting job-related panic attacks... Add Oliver Platt as a high-strung gangster with marital problems, Jose Zuniga as a secretly-homosexual drug lord, and group therapy, and the result is GUNSHY, a smart, wicked, sweet, fast, and funny look at the modern gangster flick. You won't be disappointed... 10!","user":"b_blakeney","rank":[31,40]}]