[{"title":"Middle of the Road Slash Fest","rating":5,"date":"6 April 2019","review":"Splatter University doesn't have an awful lot going for it. It looks the cheap, the sound is lacking, most of the performances are awful, and the gore effects rarely convince, but there's a certain low budget 80's charm that keeps you tuned in for its fairly short run time.<br><br>Francine Forbes makes for an incredibly appealing lead and she's easily the best actor in the film. Thankfully, we spend most of our time with her (although, maybe not enough time). She plays a young teacher who's replacing a teacher at a local college who's just been brutally murdered. Needless to say, the murderer isn't done yet and seems to have an issue with both the teachers and the entire student body of this university.<br><br>There's not a lick of suspense or terror in this movie and, as I said earlier, even the death scenes feel a bit uninspired, but Forbes keeps us invested and along for the ride. The finale does manage to surprise due the sheer mean spiritedness of it all, so I've got to give the fimmakers props for that. I certainly didn't see it ending that way and it was a genuine shock.<br><br>Splatter University is more of a movie to play in the background than one you really need to pay much attention to. It's saved by charm, Forbes, and a shocking finale.","user":"tildagravette","rank":[8,8]},{"title":"Some Good Ideas, But Poorly Made","rating":5,"date":"17 June 2019","review":"Man, this was a rough one to watch. I'm all for low budget movies, but this one looks like about the cheapest movie I've ever seen. Had the story been more interesting, this wouldn't have been an issue, but every time it starts to get interesting, it cuts away to silly subplots involving the students and ruins any tension. If the students were better developed, it wouldn't be an issue, but they feel like they're shoehorned in from another film.<br><br>Francine Forbes plays the leading lady and she's actually pretty great and likable. Whenever the film follows her, it's on a roll and we care about what happens to her. I'm not sure if it's because the writing for her is a little bit better or because Forbes is such a pleasant actress, but she seems to have been pasted in from a far better film.<br><br>There's about zero tension or scares, but some of the effects work isn't too bad and there are a few fairly gruesome murders. The killer reveal and finale finally ratchet up a little tension, but by that point, it's too little too late. The ending itself is shockingly downbeat and unexpected, so one must give them kudos for that.<br><br>Splatter University is a minor effort in the early 80's slasher cannon and probably for completists only.","user":"bettybenzone","rank":[6,6]},{"title":"Fails to make the grade.","rating":3,"date":"19 October 2017","review":"With its outrageous students (one of whom howls like a wolf at anything with a pulse), '80s slasher Splatter University can be remarkably silly at times, but isn't amusing enough to qualify as a parody or black comedy; it's also a fairly bloody flick, but nowhere near scary enough to pass as a proper slasher. Exactly who would find the film satisfying is anyone's guess.<br><br>Forbes Riley plays recently qualified teacher Julie Parker, whose new job at St. Trinian's school gets off to a bad start when one of her students is murdered. After further students and members of staff turn up dead, Julie decides to quit, but will the killer let her leave? Not on your nelly! In it's one moment of originality, the film does the unthinkable and actually kills off the final girl, which almost makes up for the sheer predictability of the psycho's identity. If you fail to guess who is responsible, you clearly haven't seen enough horror films.<br><br>It's an absolute stinker, but I'll be kind and give Splatter University a rather generous 3/10 for the bloody knifings, the slit throat, the disembowelled corpse, Julie's surprisingly nasty death, and that Ginger girl's amazingly bad hairstyle.","user":"BA_Harrison","rank":[4,4]}]