[{"title":"Unlikely partners","rating":7,"date":"25 November 2005","review":"What does one get when one mixes two different types of actors as the leads in a comedy?: A surprise! \"Nothing to Lose\" shows how Steve Oedekerk's gamble in casting such different actors as Martin Lawrence and Tim Robbins can produce great results.<br><br>Not being a fan of Mr. Lawrence's style of comedy, we decided to take a gamble on this 1997 film that came and went without much fanfare. In fact, we had no expectations whatsoever as to what to expect because even the trailers we remember seeing at the time before its release didn't show anything of interest.<br><br>In fact, Mr. Lawrence, guided by the expert hand of Mr. Oederkerk, shows a man that can deliver without resorting to his usual excesses. Tim Robbins on the other hand shows an uncanny flair for this type of comedy and a chemistry for his co-star. Both these actors are seen at their best in the comedy.<br><br>\"Nothing to Lose\" feels shorter than its 98 minutes running time. There are also good supporting players behind the stars. Kelly Preston, John McGinley, Giancarlo Esposito, Michael McKean and the fabulous Irma P. Hall, who one would have loved to have seen more of because she is an extraordinary and accomplished actress.<br><br>Let this film win you over and watch it without any preconceived ideas because it's packs a lot of fun.","user":"jotix100","rank":[33,39]},{"title":"Best Black Guy, White Guy Comedy ever","rating":10,"date":"25 February 2005","review":"Even better than Trading Places. (I will only spoil the first 20 minutes.) Nick Beam, well played by Tim Robbins, is an upper-middle class white man with a pretty wife, a successful career in advertising, and a nice home. His marriage seems happy, but one day he comes home early and sees his wife straddling another man in their bed. He doesn't say anything. She doesn't even know he was there. He finds his boss's cuff links on the way out, and therefore realises that it was his boss whom his wife was on top of.<br><br>After driving in a daze at about 20 miles an hour, Nick Beam wanders into the ghetto. This is where Terrance, played by Martin Laurence, attempts to mug him. Well, Nick Beam is so depressed that he really doesn't value his own life, and takes Terrance for a little ride.<br><br>The rest of the movie is filled with their crazy adventures. A few robberies, and Tim's gradual transformation into a criminal. There is a hilarious scene where Tim has a spider on his head, freaks out, and... well you'll see. That scene alone would have made the movie worth watching even if the rest were terrible. But fortunately, there is plenty more wacky adventures for these two before the twist at the end.<br><br>Most of this is comedy, but it does get a little serious at certain parts. How could the producers contrast the lives of a well-to-do white man with a struggling black man from the ghetto without going into social injustices? Nick Beam accuses Terrance of laziness and wasting his time robbing people instead of finding a job. Terrance never goes into details, but just tells Nick not to judge him. Then, Nick discovered several rejection letters to Terrance from potential employers. Furthermore, Terrance, a mugger, has a wife and kids and he seems to be a good father to them. It looks like Terrance is more than a common thug.<br><br>Lastly, I complement the musical choices. The spider dance scene was to the song, I think its called, 'The Scott Man.' Something like that. Its funny. Later in the movie, Pachebel's 'Canon' is played. The song at the end of the movie is a rap to the music of 'Canon.' I don't normally like rap, but I liked that, very creative.<br><br>I give the movie a perfect 10. Its not a copy of Trading Places at all, but it does have a similar theme, rich white guy, poor black guy. This is one of the few movies that has made me laugh uncontrollably for more than a few seconds at a time. If you haven't seen it, watch it, and you will watch it many more times after, I guarantee.","user":"thewag777","rank":[39,51]},{"title":"a pleasant surprise","rating":21,"date":"21 December 2000","review":"When I went to see this movie in the theaters, I wasn't expecting too much. I was expecting to see a decent comedy with an occasional chuckle with some good lines.<br><br>What I wound up seeing was a hilarious film with consistent laughs throughout. I loved it. Lawrence and Robbins were well cast and worked well together. If you get a chance, check this one out.<br><br>*** out of ****","user":"mattkratz","rank":[36,48]}]