[{"title":"Rapumentary gone horribly wrong... produced by A. White","rating":10,"date":"14 August 2002","review":"This is by far one of Chris Rock's best works to date, and it's his first starring role!  This movie has tons of talent, a tight plot (okay - you need a good ability to suspend your disbelief), and a palpable message.<br><br>It quickly became something of an underground classic as the early 90s launched the careers of many gangster rap artists.  This movie does a great job of parodying the rise and fall of a gangster rap group.<br><br>It's got a unique urban flavor and is loaded with perhaps more race-driven humor than others may think necessary (many many MANY racial stereotypes are exploited in this movie, such as a local restaurant called \"Big Ass Biscuit\" where the young rappers frequented).  However, it's done in a very tongue-in-cheek manner and the overall effect is hilarious, not heinous.<br><br>The addition to the cast of Chris Elliot playing the role of \"A. White\", the rapumentary's director, is brilliant.  Elliot is great at playing a white fanboy who lands the job of working for his new favorite rap group, and he fumbles through the movie as only Chris Elliot can.<br><br>Phil Hartman is equally funny as Virgil Robinson, a local politician who tries to use CB4's profanity as his new platform for re-election (meanwhile, his son is addicted to CB4's music and image).  The interaction between Virgil and his son in this manner represents how many parents viewed rap music as their children began to listen to it.<br><br>This movie is laden with parodies too numerous to list.  The soundtrack is also quite good (if you like rap music at all) and includes the song \"Sweat of my Balls\" - a song featured in the movie (also hysterical, complete with a stage show of large testicles being dropped from the ceiling onto the crowd).<br><br>If you aren't easily offended, this movie is VERY entertaining.  If you are able to look beyond the veneer of racial overtones and profanity, it also has a few points to make about the origins of \"fake\" gangster rap groups and their image.<br><br>Look for underrated performances by Tyrone Granderson Jones as \"40 Dog\", Richard Gant as \"Baa Baa Ack\" and Charles Q. Murphy as \"Gusto\".<br><br>I CAN'T WAIT for this to be released on DVD - if it ever will be...","user":"atriumelph","rank":[9,11]},{"title":"The Greatest Rapumentary of all Time","rating":16,"date":"16 February 2003","review":"This is one of my favorite movies of all time. I love the fact that they pretty much play on the myth that most rappers are essentially middle class kids who've never even smelled the ghetto but try to pass themselves off as true \"gangstas\". Chris Rock and the rest of the cast make this one of the funniest movies of all time as well as a great commentary on the music business. Also, Allen Payne shows that he has a great flair for comedy as he plays Rip and Candy Alexander shines as Cissy. She pretty much has fun playing the stereotypical groupie that everyone has written about from rockers to rappers. This film really is a classic.","user":"Sargebri","rank":[12,16]},{"title":"Funniest FN movie","rating":10,"date":"4 August 1999","review":"whether you hate rap music or you don't this is one of the funniest movies about rap music.  CB4 pokes fun at west coast gangsta rap that was popular in the early 90's- this had to be one of Chris Rock's funniest roles ever!!! The songs are really funny and all the characters in this movie make it what it is- from Chris Elliot to Phil Hartman.","user":"madeazy","rank":[9,12]}]