[{"title":"If Bobby and Chazz are reading this...I couldn't thank you more!!!","rating":10,"date":"9 May 2001","review":"This might be a matter of taste, but \"A Bronx Tale\" remains Number 2 on list of Favorite Movies of All Time.  It just happens to be one of the most deeply moving, powerful films I've ever encountered.  Yes, some may consider this a simple story, but that's the beauty of it.  It's a down-to-earth, coming-of-age story that perfectly mirrors the life of a boy like C growing up in the Bronx at such a hectic time.  Of course, this is based on Chazz Palminteri's real life experiences, and I envy Chazz, being an aspiring screenwriter/director.  I wish I had life experiences like that to put on film.  And I have to commend my man Bobby D for bringing these images to life in such a vibrant, engrossing way.<br><br>DeNiro captures every element of the 1960's Bronx, with a great opening sequence featuring doo-wop singers sweetly singing the movie's theme.  He captures so many elements of the period, and it was nice to see only one goof was captured.  It was interesting to find out that most of the movie was actually shot in Brooklyn--my hometown.  Then again, the two places are alike in their own simple ways.  <br><br>Bobby D has a short, but memorable role (which is against type) as a working-class bus driver.  He's desperately trying to get by and support his son, Cologero (I think that's how to spell it...LOL), and disapproves of his son's new \"job\" with gangster Sonny (Chazz, who gives a landmark performance).  The interactions between DeNiro and his son are extraordinary in the way they mirror the way a real father and son would argue in those situations.  As I said, it's the whole down-to-earth quality of this movie that I think made it tick.  It's nothing pretentious.  This is a simple movie about humanity.  The gangster plot is merely a backdrop. <br><br>\nThe only other movie I've seen him in was \"Crimson Tide\" in a very small role, but Lillo Brancato (who plays DeNiro's son in the later years) is a revalation!  He gives one of the best performances I've ever seen and I'm surprised I haven't seen him in any more recent movies.  And I have to say DeNiro did a dynamic job of casting.  As far as I know, Brancato and Bobby aren't related, but please tell me if I'm wrong, because they look EXACTLY alike!  If you've seen any of DeNiro's very early films, Brancato is a mirror image of him.  Is it coincidence or what?  I've rarely seen a film where the son/daughter even directly resembles the parents, but Brancato has the DeNiro nose and everything.  If you observe closely, there's a scene where Brancato is wearing a black jacket and a black hat, and if you were to see this in a split-screen with DeNiro in \"Mean Streets\" it would be uncanny.  <br><br>There are so many people I have to commend for this film.  That also includes the supporting cast.  Taral Hicks as C's love interest was also impressive.  And of course, you can't have a movie directed by DeNiro and starring DeNiro without his main amigo making an appearance.  Hopefully, you haven't read the cast list on the IMDB.  Because I was surprised and overjoyed when \"the man\" appeared in the final scene. <br><br>\nThere are many lessons on life to be drawn out of this film, some of which given by Chazz's character Sonny, who plays the most likeable gangster I've seen in cinema.  Yet at the same time, you can't consider him \"too nice.\" Which was a good move.  Sonny was a nice guy in the core, yet he still has a heart of a gangster.  In a great monologue, he explains how he'd rather be feared than loved.  And of course there's the great monlogue that everyone remembers:  the car door scene.  That was really an unforgettable speech. Plus, there's funny moments, too.  The gambling scene in the basement, for example.  \"Get in the f**king bathroom!!!\"  LOL...that was hilarious. <br><br>\nTo add to the emotional intensity, we have an interracial relationship between Brancato and Hicks at a time when Bronx was heavily segregated and whites wanted absolutely nothing to do with blacks.  The scene where the boys beat those innocent black boys down was an extremely powerful scene. And through DeNiro's direction, we feel the characters' every emotion.  I like how he used the doo-wop music to contribute to the soundtrack.<br><br>By the end, I was almost at tears.  I'm virtually tearing up just writing this review and looking at this masterful drama in retrospect.  This is something ONLY Bobby D and Chazz could've done!  No one could've done it better!  For me to be this deeply moved by a motion picture is unprecedented.  I wish I could be thanking the two guys in person.<br><br>If anyone hasn't seen this movie, please don't hesitate to pick it up!  This is one of those great, underrated masterpieces that you feel sad after finding out about its poor success.  A film like this really deserves more recognition.<br><br>And Bobby D....I think you owe a bunch of \"thank yous\" to your buddy Scorcese.  He's taught you well.<br><br>My score:  A perfect 10! (out of 10)","user":"mattymatt4ever","rank":[161,184]},{"title":"Wonderful coming-of-age story in little Italy","rating":3,"date":"3 November 2000","review":"Oh, what a wonderfully small and intricate film this is!  How I love and cherish the world I am pulled into every time I see this film.  Robert De Niro's directorial debut proves strong and lively, evidenced by how he stuck to a topic close to home; a young, impressionable Italian kid growing up little Italy in the late 60's.  As the naive protagonist Calogero, or 'C' as he is nicknamed, Lillo Brancato gives a great performance as a young man torn between the working-class honesty displayed by his strict father and the ruthless world of organized crime demonstrated by the neighborhood crime boss Sonny (Chazz Palminteri adapted his own play and cast himself as a burly, laid back, world weary know-it-all).<br><br>One key element that snags you in is the narration.  Like equally personal films of its stature (Scorsese's gangster trilogy, \"Taxi Driver,\" \"Election,\" \"Bringing Out The Dead\", \"SLC Punk!\"), the voice-over guiding brings you in even further into the already detailed landscape and story presented. I don't really consider this a mafia movie, it's much more of a coming-of-age tale.  However, the background De Niro provides is so intimate and thorough that you wish for another film chronicling the life of Sonny.<br><br>I have to admit that, for a debut, De Niro's judicious use of music seemed to rival that of Spike or Scorsese in turns of effectiveness.  First of all, De Niro kept a much more grass roots approach, sticking to doo-wop, soul, rock, \"mobster pop\" (Dean or Frank) and a little jazz.  Whereas Scorsese will use anything at his disposal (\"Casino\" had two Devo tunes in it), De Niro really seems to search for what really makes the scene.  My favorite is the scoring of a street fight scene to \"Nights In White Satin\"... De Niro must of knew before we did it was all in the violins.  De Niro said he knew this type of story had been done before and didn't want to repeat anything, so he viewed Scorsese's mobster trilogy to see what already had been done. It's obvious he paid attention.<br><br>Even De Niro himself knows a little Italy gangster film is not complete with at least a surprise-ending cameo from you know who...","user":"JawsOfJosh","rank":[67,74]},{"title":"Growing Up In The Bronx","rating":9,"date":"15 April 2008","review":"A Bronx Tale does take me back to New York City in the sixties. I grew up in Brooklyn then which certainly has always had its own identity. I'm glad that Chazz Palmentiri has given the Bronx an identity of its own. There are still parts of the Bronx which have the Italian neighborhood you see depicted here. But the Bronx is a Latino majority borough now, ironic when you consider part of the story of A Bronx Tale is the racial tension between the blacks and Italians.<br><br>The movie divides in two parts, the first is around 1960 with the background of the 1960 World Series, one of the best ever played where the Yankees of Mickey Mantle lost to the Pirates in seven games. Robert DeNiro is your average Joe, a bus driver by profession trying with his wife, Katherine Narducci, to raise their son who is eight years old. Young Francis Capra who is fascinated by the gangsters hanging out at the bar down the street, witnesses the local boss commit a murder. True to the neighborhood code he doesn't snitch to the police and the local boss takes him under his wing.<br><br>Chazz Palmentiri is the boss and he's an interesting character. A man who's risen to the top of his profession, he's got a sense of himself and what it took to get there. Life is about choices, he made his and he's going with the flow, but he knows it isn't for everyone. He advises young Capra to stay in school, but the more he advises the more fascinating Palmentiri becomes to DeNiro's dismay.<br><br>The second half of the story is in 1968, the Bronx as part of America ravaged by racial tensions, assassinations and the war in Vietnam. The little boy is now teenager Lillo Brancato who gets interested in a black girl, a big no-no in the crowd he comes from, but Palmentiri is the one person who encourages the relationship. Let's just say that everything, every element of the story comes full circle on one night in the Bronx in 1968.<br><br>The comparison to Goodfellas for me is obvious. The two kids who grow up to be Joe Pesci and Ray Liotta are taken under the wing of neighborhood boss Paul Sorvino who sees them as promising gangster material and they grow into the roles. Palmentiri keeps telling the young kid here do what I say not what I do, but in the end it takes some tragic events to set him on a right path.<br><br>DeNiro who you would normally expect in the gangster role is just fine as the father, a good man, not a perfect one by any means, but just a guy trying to do right by his family. It's Palmentiri however who really steals the film as the local gangster boss who's as street smart as they come, but even with all that can't anticipate all contingencies.<br><br>Lillo Brancato who went on to several other film roles and a long running one in The Sopranos certainly in real life didn't make the same choices as his character Calogero Anello did. Life really imitated art in his life story.<br><br>Nice to see the Bronx get its due.","user":"bkoganbing","rank":[42,46]}]