[{"title":"Great Adventurous Fun!","rating":23,"date":"23 July 2000","review":"Certainly this Universal remake is more in the vain of Indiana Jones rather than the original Mummy.  It is high on adventure and comedy, and wins because of it.  The sets, scenery, special effects are all first-rate.  The film is fast-paced from beginning to end and is very suspenseful.  Stephen Sommers again shows his talent as a director for creating action-packed adventure with a high level of comedic overtones.  The cast are all very good in their roles, yet none of them seem really to be taking themselves or the film too serious.  Brendan Fraser is an affable hero, and Rachel Weisz makes a good heroine.  Good support comes from John Hannah, Kevin J. O'Connor, and the mummy, Arnold Vosloo.  Also a real treat was seeing Bernard Fox in a small role as an aging British pilot.  Don't expect the old mummy of lore in this one, but sit down and have one heck of a ride...a rollercoaster of hijinks in the sands of Egypt.","user":"BaronBl00d","rank":[87,92]},{"title":"One of my all time favorite movies","rating":10,"date":"1 January 2008","review":"First off, everyone is entitled to their own opinions, but most of the low ratings I am seeing are criticizing \"The Mummy\" because of it's \"weak plot\" or someone even said that this movie could have been written by the person's dog!<br><br>Does anyone realize that there is different movie genres? If you go to see \"The Mummy\" and expect to see \"The Departed\", \"The Godfather\", or \"Shawshank Redemption\" then yes, of course you will be disappointed. This is not a drama, it's an action/adventure movie! <br><br>Everyone has commented on the fun of this movie, that is what this movie is all about! Personally, I think the story is very good, and interesting. There is a lot to like here: it has elements of action, adventure, comedy, fantasy, mythology, horror, and tells a pretty well made tale (seriously, how many movies manage to pull all of these things off? And pull them off well!). And, it manages to do all of this in style, with amazing special effects and action sequences. No, it's not perfect (what movie is?) but this movie kills most movies in the same genre! I have never seen a movie that can contain so many different elements while still being coherent. This movie is a technical marvel is many aspects!<br><br>Rachel Weisz is great and looks beautiful as well playing as Evelyn. Yes, she is something like a \"typical damsel in distress\", but she brings humor, intelligence, and a strong will to the part. It's hard to integrate so many qualities into a believable character, but she does it well.<br><br>Brendan Fraser as Rick O'Connell: After seeing him in so many goofy movies, playing an equally goofy character, I thought he was always going to be cast in lame movies such as \"Encino Man\" and \"Monkeybones\". He was the reason why I had doubts I would like the movie because I could not picture him being more than a one-dimensional actor (able to pull goofy-charismatic off only). Not only does he act the part with stride, but he nails every aspect of his character: He is cool, yet has humor and he really surprised me with how much depth he can add to a role that really doesn't need it! Rick O'Connell wields his dual guns with flair, and I will never doubt Fraser again! I just hope they keep him utilized more and more like this. I was really impressed with him most because he surpassed all expectations!<br><br>Everyone else did their parts extremely well, they always stay in character, and add to the elements of the story. <br><br>This movie has a lot to offer, and lots of different ways to get your interest, especially if the Ancient Egyptian mythology fascinates you. This movie does have elements of horror: it will most likely scare younger kids more than adults, but putting yourself in the characters places you would be quite afraid. <br><br>Imhotep is very scary, mostly because of all the different abilities he possesses, as well as forms he can take. <br><br>I could not recommend this movie enough, especially if you have a HDTV and have the High Definition version, you will be blown away! Just don't expect a character driven drama, you're not looking for that with this either!","user":"ricsim78","rank":[37,38]},{"title":"I love this movie so much!","rating":8,"date":"20 February 2020","review":"A real romp of an adventure/horror genre with a wonderful aesthetic that works perfectly and he period setting is pure genius at creating an immersive world. Performances are terrific with Weisz and Fraser having a blast and a great dynamic. The CGI does look a little outdated and of course brings the overall film down but the humour and the overall tone is balanced brilliantly.","user":"MR_Heraclius","rank":[33,34]}]