[{"title":"The best teenage horror slasher film in the 90's my all time personal favorite in the horror genre","rating":10,"date":"18 February 2018","review":"Scream is the best teenage horror slasher film in the 90's and it is my all time personal favorite film in the horror genre. I love this film I always did and I love to death! It was really the first movie that introduced me in to \"horror\" genre slasher films. It was directed from my favorite horror master Wes Craven and written by Kevin Williamson. It is a horror mystery like was Friday the 13th and April Fool's Day. Scream deserve legendary status. The movie spawned three sequels and the TV series that I did like. Neve Campbell, David Arquette and Courteney Cox and Rose McGowan work for me. It is about a high school teenage student in the fictional town of Woodsboro, California, who becomes the target of a mysterious killer known as Ghostface who kills teens and who uses his obsession with scary movies. The first one is the best in the series and it is still one of the best horror films of all time. <br><br>Wes Craven borrowed and used Halloween, Friday the 13th and A Nightmare On Elm Street mostly scenes for this movie. It mentions a lot of cult classic horror movies and till it's day it is still praised by fans. I enjoy this film I always do. This is my movie and my personal opinion! Scream follows the teenage girl Sidney Prescott (Neve Campbell) who becomes targeted by a psychotic killer dressed in a ghostface mask who uses his obsession with scary movies. David Arquette plays police deputy, Dewey Riley who helps protect Sidney and Courtney Cox plays tabloid reporter, Gale Weathers. This is one of Craven's best along with \"A Nightmare on Elm Street\" that redefined the genre and Ghostface has become another popular slasher since. \"What's Your Favorite Scary Movie?\" Ghostface is one of the most popular and really scary character. The mask is so scary before new year on Halloween day I saw the mask putted on a front seat in the car and i was so scared, I thought it was the killer waiting on me but it was only a mask but a scary one. <br><br>The Story begins after two high school students are murdered by the serial killer. Sidney Prescott becomes next victim of intelligent serial killer, Gale Weathers reporter and journalist is shure that serial killer is the same person who murdered Sidney's mother one year ago and now he's terrorizing Sidney her self. Deputy Sheriff Dewey wants to investigate the murders by himself, but attractive Gale seduced and confused him, so it's up to Sidney to find the killer, before he kills again to find the truth, she will must kill. I love also the characters: Matthew Lillard as Stu Macher, Rose McGowan as Tatum Riley and Jamie Kennedy as Randy Meeks. Great story and great soundtracks. I watch this movie thirty times and is still the best, I watch with my mom as a teen good times. I love the script the dialogues in this movie, I love Drew Barrymore as Casey Becker in here.<br><br>10/10 Scream deserves a legendary status it is my personal favorite horror slasher film from Wes Craven in the franchise. I have the whole collection on Blu-ray discs and I have the first three movies on VHS tapes. I love this film to death I love it!","user":"ivo-cobra8","rank":[137,150]},{"title":"Iconic, unique, fresh, a definitive new horror","rating":8,"date":"27 February 2006","review":"Scream With the countless number of teen slasher movies doing the rounds, it is too easy to watch scream and see simply another school serial killer movie that has just rolled off the factory production line. However, it was Wes Craven's 'Scream' that started the whole revival of the horror genre and re-invented the teen horror. Through no fault of its own, but rather a succession of bland rip-offs, not to mention a very successful spoof (Scary Movie), Scream's original impact has been severely dulled. Were Scream released today it would no doubt be moderately successful but would be instantly forgettable. But back in 1996 the teen horror market was wide open. The teenagers of the 90s were bored of traditional horror movies featuring haunted houses, vampires or deformed monsters. They had seen them all. So Wes Craven, having reinvigorated the horror genre once before with 'Nightmare on Elm Street', set out to do it again. This time, along with Kevin Williamson, who would go on to be creator of Dawson's Creek, created a new kind of horror  one that you could laugh at as well as scream at.<br><br>What made Scream so successful is that it was never patronising, and displayed a strong sense of ironic self-awareness. It took every horror cliché in the book and turned them upside down. For the kids that had seen too many movies, there was now a movie for them. The characters did not follow the clichés, but in fact talked about them, and talked about what would happen if they were in a movie. This sense of irony may seem tired now, but when Scream came out it was new and exciting. There was rarely a need to scream 'don't go upstairs' or suchlike in Scream, because the characters themselves were saying that! The idea of the killer being amongst the students adds a fresh dimension to the film, as fear gives way to paranoia at not being able to trust anyone. The subversions of the accepted horror clichés, in particular in the opening ten minutes (I'm not going to give anything away for those who have not seen it) also contribute to making Scream a truly shocking movie. It was this sense of innovation that made Scream such a breath of fresh air for the horror genre, and it is only a shame that Craven's genius has been ripped off so many times that his work has dated far too quickly. Craven and Williamson have also created a new horror star  but it was not a particular character but just a costume with an iconic mask. The Scream mask has become just as symbolic, perhaps even more so, than that of Michael Myers or Jason Vorhees.<br><br>For any serious horror movie fans, Scream is essential viewing, if only to witness the film that started it all. The 'movie within a movie' idea was terrific, and would be taken even further in the sequel. The frequent references to classic horror movies, and reversals of accepted horror clichés, especially in the opening ten minutes) are also fun to watch out for. There is even a wonderful moment where one boy climbs in the bedroom window of his girlfriend  a scene that would be taken and used as one of the foundation for Williamson's successful teen series Dawson's Creek.<br><br>The iconic mask, the one-liners, and the unique self-awareness when it comes to horror clichés make Scream a true original  accept no imitations.","user":"Mr_PCM","rank":[76,86]},{"title":"Hate To Admit It, But It's Great","rating":8,"date":"9 May 2001","review":"There's more than a few reasons to hate `Scream'; the main reason would be that the film single-handedly resurrected the teen-slasher genre, a movie category that had long been beaten to death.  Because of the success of `Scream', witless horror crap like `I Know What You Did Last Summer' and `Urban Legend' got greenlighted, half the teenage casts of various WB television shows got summer acting jobs, and some awful scripts that should've been left dead and buried `Teaching Mrs. Tingle' got to see the light of day.  `Scream' is responsible for a lot of garbage.  But the truth of the matter is, `Scream' is also a phenomenal movie.<br><br>The plot of `Scream' is very simple: a masked knife-wielding maniac is busy stalking the students of High, killing them off one by one.  The killer's inordinately obsessed with one girl, Sidney Prescott (Neve Campbell), who of course gets involved in the quest to unmask the killer.  The catch (in case you don't already know it), though, is brilliant.  Everyone in the film is familiar with all the slasher film conventions.  They know that you shouldn't walk in the woods alone at night.  They know that having wild sex is an unwritten invitation to be hacked to pieces.  They know not to say things to each other like `I'm going outside for a cigarette; I'll be right back.' -- such statements are virtual death warrants.   One of the best examples (and best characters) of this is Randy (Jamie Kennedy), the film-obsessed nut of the film, who actually goes so far as to muse what `real' actors and actresses should play the other characters in the film, going so far as to joke about who gets to be Tori Spelling.  All the dumb conventions of slasher films are pulled out of the shadows, exposed for what they really are . . . and then, some of them get used anyway, because the characters willingly choose to ignore those conventions.  Some cliches are thrown away, while others are embraced.  `Scream' really turned the horror/slasher film genre on its ear, becoming the first truly suspenseful and exciting slasher film in many, many years simply because it suddenly had a million new avenues to explore.  The film's self-awareness allowed to move in brand-new directions . . . and suddenly, scenes that used to be predictable in other slasher films suddenly become incredibly intense in `Scream'.<br><br>Director Wes Craven was perfect for this film -- as director of slasher classics like `Nightmare On Elm Street', he easily sets the visual feels and style of film to perfect evoke all the slasher films of yore . . . and then, much like `Scream's' script, chooses to either faithfully follow the tried and true, or to go off in competely unexpected directions.  Either way, Craven manages to create a lot of absolutely nail-biting, thrilling scenes. He also doesn't hold back with the gore, which is always a plus in great slasher films.  The acting ranges from barely mediocre to good -- Neve Campbell's okay as Sidney; Courtney Cox is pretty good as tart-tongued reporter Gail Weathers; Jamie Kennedy rules as Randy the film geek; and David Arquette is utterly bland and forgettable as Deputy Dewey Riley, the sad-sack policeman.  But casts in slasher films don't particularly matter anyway; the good ones are all about suspense, terror, and gore.  And in `Scream', Wes Craven provides massive amounts of all three of those criteria.<br><br>The irony is, `Scream' spawned dozens of imitators, and by spawning imitators, all the new avenues opened up by `Scream' quickly got old and boring once more.  Still, purely on its own merit, it's an excellent film. The best slasher film of all time is still John Carpenter's `Halloween', without question, but `Scream' actually runs a close second.  It's well worth watching.  Grade:  A-","user":"MadReviewer","rank":[226,269]}]