[{"title":"Great dramatic social genre films but mostly mystery!","rating":8,"date":"1 March 2016","review":"Do you know why I love especially the Korean cinema at the turn of the 60s and 70s? Because there were directors like KimKi-Young bold and courageous that defied the strict rules of the censorship of the period and were able to direct authentic cinematic pearls, full of originality and beauty. Iodo considered and re-evaluated (during the period when the film came out was not so) as one of the best films of the director as well as 70s. The film deals with various issues, but the most predominant part is the mystery with some sprinkling of horror. Boys do not exaggerate when I say that certain scenes are chilling and disturbing and the final part then ... a scene that I think would be too strong for today's production, in fact, the end of time was censored. I would like to report good use of flashbacks, present at the right time that give the viewer a more step in order to understand the intricate plot, even if after the end of the film remain the open questions, it is needless to say that the viewer can draw their own personal interpretation Regarding Iodo environments looks a lot like A Splendid Outing (mainly in the island's environment), both films have something in common, I repeat \"something\" though summing up in the end the two films are quite different<br><br>Nice really nice, this is one of those films that will remain impressed after watching for a long time in the viewer's head! really cool movie","user":"dreist","rank":[6,8]},{"title":"The covered and the found.","rating":12,"date":"12 September 2000","review":"This movie has been looked away for many years because of Korean Audiences' ignorance. I firmly assert that this movie could be the most bizarre and flawless over the Korean film's history. We can find easily the features of Kim. For example, Almost lines are made up of a literary style. However it looks very seriously intended.","user":"disole-2","rank":[7,24]}]