[{"title":"beautiful film","rating":8,"date":"4 December 2001","review":"One of the best films of last decade. Impressive visual style, especially cinematography and production design, despite ultra low budget. Deep emotional touch, very special atmosphere, captivating cast, simply beautiful film. This young author (director and writer) did it only with money from his cousins, friends and support from senior Hong kong moviemakers. Enthusiasm above all and remarkable accomplishment is here.","user":"damirradic14","rank":[18,21]},{"title":"Bitter and Sweet","rating":29,"date":"29 April 2000","review":"Being half Japanese, but never having visited any other Asian places like Hong Kong, I nevertheless saw a lot of similarities between the two cultures. Take for example the energy of millions of people living next to each other. This is something I saw in Tokyo and which I recognized in this movie as well. This energy, together with the typical asian summerheat, is felt throughout the whole movie and made me both unease as well as more alert. It gives you the sense anything can happen and you have to watch out. This has everything to do with this movie, since it depicts Hongkong as a jungle where only the fittest survive. Fittest in this context means ruthless and not caring for others. The main character, a teenager and gangmember, does just this and this will prove to be fatal to him. He protects a mentally handicapped boy and falls in love with an terminally ill girl and he even offers her his kidney (which she refuses). Another similarity between the Hongkong and Japanese culture that I noticed, is the innocence and spontaneity with which the young Asians act. Europeans tend to be more serious and worry about life, whereas these guys just have fun and enjoy the moment, 'carpe diem'. This motive contrasts with the more tragic moments in the movie. Life is just like that though; it's bitter","user":"liou","rank":[17,21]},{"title":"Who'd have thought a Hong Kong director would have brought danger and poetry back to the gangster movie?","rating":9,"date":"27 October 1999","review":"Sluggish gangster genre revitalised by infusion of teen melodrama.  One of the films of the year.  The violence is, for once, sickening, immediate and real, rather than crude comedy, but interlaced with expressionistic sensibility of dead protagonist.  Deeply moving on a personal level, and highly comic in spite of ultimate despair.  The director's visual vocabulary is immense, with imagery of such dreamlike, poetic, evocative beauty, your heart stops.","user":"alice liddell","rank":[11,13]}]