[{"title":"Please forgive us, Brit friends","rating":1,"date":"4 May 2001","review":"***May contain Spoilers***<br><br>I was embarrassed as an American seeing this film. Just knowing that it would be seen over seas. It's amazing how a submarine can withstand 40 depth charges while another could be put out by two. And I believe it would also be a virtual impossibility for Americans to commandeer a German sub and vice versa.<br><br>But the worst thing about this movie is its arrogant rewriting of history. It was the British who first captured the enigma machine NOT the Americans. We have no right to take credit for other nations accomplishments. Hollywood simply has a historical ignorance. But beyond that it is still just an awful, awful movie. No one with half a brain would be entertained by this garbage.","user":"Rev-Maynard","rank":[207,266]},{"title":"Offensive & revisionist, it should not have been made.","rating":1,"date":"28 April 2000","review":"I have only one comment about the movie and it isn't about its suspense, direction, acting or musical score.  It's about deceit.  Reading through user comments, I see that many are in touch with the idea that this is a British story, not American.  But do they grasp how much more ignorance this is fostering?<br><br>People are saying that the supply lines between America and Britain were being threatened by the U-Boats and that America had to come to the rescue. This folks, is simply untrue, revisionist garbage. And people are buying it. It offends me, because as a Canadian, I am painfully aware of the fact that America risked nothing at all to supply Britain in its hour of need - that was Canada's great claim to fame, and America's claim to shame. The British captured the enigma first, the Canadians caught another later and the U.S. WASN'T EVEN IN THE WAR YET!<br><br>This is beyond \"just entertainment\" as Americans are now laying quasi-historical claim (and we all know how many will take some or all of it as true - most) to victories and sacrifices purchased by people of other nations.  If you want to spit on someone else's flag, just spit on it, don't steal their histories and dishonor their heroes and their fallen soldiers. Nobody can fall back on \"it's just a movie,\" unless they already feel at home with a British movie about how the Brits won the Battle of Midway and saved the Americans.<br><br>Americans have plenty to be proud of, plenty of heroes from that war, plenty of stories they could bring out to show their pride and grit without resorting to such theft.<br><br>This movie should have been made as British or not at all. Another sad day for film.","user":"marquis2100","rank":[199,273]},{"title":"Mel Brooks does Das Boot","rating":3,"date":"22 July 2001","review":"This movie is another one in a long line of pro-U.S. war films. You know the kind. Those are the films where north american soldiers are the only ones capable of any wit, wisdom, intelligence and courage.<br><br>Unfortunately, by now the rest of the world is a bit brighter, and we know that, really, Ben Affleck didn't save Great Britain from the Germans. There is an undeniable and deep love and respect for all veterans and U.S. soldiers that lost their lives in Europe during both World Wars from the rest of the world, the kind of respect that only comes from defending an ideal with their lives. It's Hollywood who is keen on destroying those heroes' reputation by making them seem so superior as to be ridiculous.<br><br>In summary, this film is a parody of the amazing \"Das Boot\". It's quite obvious that the same things will happen in any submarine: depth charges, marine battles, etc. But U-571 makes everything seem sweet: there is no claustrophobia, the crew gets along pretty well, they kill every german in sight, and even a destroyer. Das Boot shows a destroyed boat, terribly strained relationships, a sense of quiet desperation and resignation. Where U-571 plays glorious fanfare, Das Boot counters with powerful silence. Where Das Boot puts grime, U-571 substitutes pretty faces. Where Das Boot has realism, U-571 doesn't.<br><br>But most insulting of all, where englishmen should have been, U-571 cleverly substitutes them with U.S. soldiers. Oh, the nerve.<br><br>Bottom line: this movie makes for a great surround sound demo disc, or a nice coaster. Hollywood is still clueless when it comes to making war movies. If a future historian only had U.S. war movies to base history upon, he would decidedly declare the rest of the world sub-human idiots, and the U.S. civilization as a more evolved race.<br><br>A theory Hollywood debunks quite nicely.","user":"fjhuerta-2","rank":[382,547]}]