[{"title":"Great action, great suspense, great cultural satire, and a great mind-bender","rating":10,"date":"21 March 2005","review":"Set during an unspecified future era, Douglas Quaid (Arnold Schwarzenegger) is a construction worker who longs for a trip to Mars. His wife, Lori (Sharon Stone) isn't so keen on it--she'd prefer a trip to Saturn, or a space cruise. Riding on the subway one day, Quaid notices a television advertisement for a company named Rekall, which specializes in memory implants of vacations. Quaid checks into it as an alternate means of having a \"Mars vacation\". While at Rekall, he chooses an alternate personality upgrade of a secret agent. However, while undergoing the procedure, something goes wrong. He learns that his Quaid identity was a memory implant and he really _is_ a secret agent. Now that he has his real memory back, he's on the run and he escapes to Mars. But why is everyone after him? <br><br>Total Recall, based on \"We Can Remember It for You Wholesale\", a short story from 1974 by Philip K. Dick (and novelized in conjunction with the film production by Piers Anthony), had a laborious history getting to the silver screen. Tens of drafts were written. Production companies were attached then went out of business. Many directors and stars were attached who either changed their minds or who were dropped. Luckily, Arnold Schwarzenegger talked Carolco into picking up the project for him, with Paul Verhoeven--who'd already proved his mettle on the similarly toned RoboCop (1987)--on board as director, because this is an excellent film.<br><br>While Total Recall certainly has influences, including \"The Martian Chronicles\" (1980), Dune (1984) and the first major film based on a Philip K. Dick work, Blade Runner (1982), it's more notable for the films that it has influenced in subsequent years, including The Fifth Element (1997) and many of the \"rubber reality\" films such as Abre los ojos (1997)/Vanilla Sky (2001) and The Thirteenth Floor (1999). It's also yet another film on the very long list that have had various elements \"adapted\" into part of The Matrix (1999)--most explicitly here, the \"bug\" that Quaid has to remove from his body with a high-tech machine and the possibility of \"waking up\" from a particular reality by taking \"the red pill\".<br><br>Although it's easy to interpret Total Recall in a very straightforward manner, so that the bulk of what we're seeing at any particular moment and the bulk of the dialogue are the literal reality, very convincing arguments can be made that the majority of the film is a depiction of Quaid's memory implant while in the \"patient's chair\" at Rekall. And those certainly aren't the only two interpretations possible.<br><br>What matters more than thinking one has a \"right answer\", though, is the deeply captivating story that provokes our interpretations and the amount of fun we have getting there. Verhoeven and the scriptwriting team, which included Dan O'Bannon and Ronald Shusett, the writing team behind the Alien films (beginning with Alien, 1979), never let us go very long without another plot twist, most of which force a reinterpretation of the material that went before. The twists occur about once per every ten minutes, if not more frequently.<br><br>The film is notable for its special effects by Rob Bottin, which were far ahead of their time, and its fantastic production and art design, which manage to make us feel both that we're experiencing a vicarious trip to a \"future grunge\" Mars and an almost \"Doctor Who\" (1963)-ish absurdly artificial reality, complete with supersaturated red skies, ala Frank R. Paul's illustrated covers for the Amazing Stories fiction magazine.<br><br>Some locations in Mexico were used for the film, including some subway shots on Mars, and actual commercial sign age was incorporated into the film. There's a lot of fun to be had noticing all of the cultural differences and similarities that the future era of the film will bring. Verhoeven delights in subtle glimpses of various symbols and accoutrement's. His view of the future is one full of corruption, commercialism and decadence. He doesn't have much confidence in a \"bright new world\" as humans spread out to new territory.<br><br>Verhoeven is basically extending the way things are now to the future; it's as if he sees our state as indicative of human nature, so that as long as we're humans, people are going to be taking advantage of one another, trying to control one another, engaging in behavior that's a conflict between desires and societal mores, but also helping out each other when the going gets tough. In these respects, Total Recall has culture-satirical similarities to later films such as Starship Troopers (1997), which isn't surprising given that Verhoeven directed both films. It's notable that Total Recall's future is not quite as bleak as Starship Trooper's.<br><br>But the film is hardly less violent. Verhoeven's initial cut was given an X by the MPAA for violence. A number of scenes had to have small edits, most of which have thankfully been restored on at least one special edition DVD. The violence here is a lot more small scale and personal than Starship Troopers. In terms of the visceral, Total Recall often rides a gray area somewhere between action and horror. While the action isn't as explosive as many Schwarzenegger films, the suspense never resolves until the end. This is an amazing thrill ride of a film.","user":"BrandtSponseller","rank":[276,312]},{"title":"Certainly One Of Arnie's Best Ever Movies","rating":8,"date":"1 June 2004","review":"I've seen TOTAL RECALL many times over the years and I'm never failed to be impressed with it . Some people dislike it and I feel I must defend the movie <br><br>\" Confused plot \" - Sorry but I managed to understand the complex plot first time I saw the movie and was impressed that Hollywood had merged a high concept plot with a FX laden extravaganza , such a pity this didn't lead to more thoughtful action adventures . If you want to see a confused plot try watching a James Bond movie from the 1980s <br><br>\" The violence \" - Yeah this is a violent movie for sure but I do wish people would educate themselves to the work of directors before they criticize . Paul Verhoeven had previously made FLESH AND BLOOD and ROBOCOP so a futuristic adventure by Verhoeven that was awarded an 18 certificate isn't going to be confused with an episode of the teletubbies<br><br>What I liked from Verhoeven's directing is that he's made everything so recognizable , nothing is ridiculously futuristic looking and we see the characters wearing clothes that wouldn't look out of place in the 1980s . Verhoeven also brings little satirical stabs to the proceedings as he did with ROBOCOP and it's a great shame we see less and less of this European director working for Hollywood <br><br>Verhoeven even gets a good performance from Big Arnie , okay this body builder was never in danger of winning an Oscar but Arnie doesn't send himself up and nor do his wise cracks like in his other blockbusters but he does make for an affable - Though violent - hero . Michael Ironside gives the most memorable performance which considering he spends most of the movie running around with a gun is no small achievement . <br><br>One interesting thing I noticed about TOTAL RECALL after seeing it again last night is that it's unapologetic on being on the side of the rebels who are waging a war against the greedy Mars company . Anyone believe that if it was made today the rebels/terrorists would be the bad guys ? <br><br>Anyway this is along with the original TERMINATOR the best movie starring Arnie though most of the credit for this movie belongs to the screenwriters and director and it's a great pity Hollywood is reluctant to mix a high concept SF plot with a crowd pleasing action adventure","user":"Theo Robertson","rank":[195,245]},{"title":"The Trilogy Needs Total Recall","rating":8,"date":"31 May 2006","review":"When a man (Arnold Schwarzenegger) goes for virtual vacation memories of the planet Mars, an unexpected and harrowing series of events forces him to go to the planet for real, or does he?<br><br>One could consider \"Total Recall\" part of a Philip K. Dick trilogy: Blade Runner, Total Recall and Minority Report. With A Scanner Darkly and Paycheck (among others) creating an extended trilogy (you know, like Douglas Adams did). Total Recall is easily worthy of standing beside Blade Runner. And even as a stand-alone sci-fi film, it ranks as one of the better ones of the 1990s, if not all time.<br><br>One of the great things about Total Recall is the ambiguous nature of the story. Is it a dream? A brain embolism? Reality? Any of these has evidence to support it and also to contradict it. And this is a strength for the movie.<br><br>There is a certain absurdity with the special effects -- eyes bulging and whatnot when the people lose oxygen. In real life you would simply die in space, not explode. But at the same time this was somewhat amusing and a bit comical so it can be overlooked. Besides, coming from Rob Bottin (\"The Thing\"), the focus should be on the strengths of the makeup and effects and not the possible shortfalls.<br><br>The casting was great. Arnold was a great choice, and no one else could be Quaid. Kurt Russell, Stallone, Swayze... these guys are great but not right for this part. And Sharon Stone was looking her best for this movie, and since her role seemed to be the sexpot wife who does little more than exercise and seduce her husband, that is a big endorsement.<br><br>Clearly the best character was Benny the Cab Driver, played by Mel Johnson, Jr in his only notable role. He stole the scenes he was in with great comic timing and an interesting back-story. I was quite interested by how he went from being what could have been a minor background role to a primary figure in the overall plot. Exquisite.<br><br>I guess I simply must recommend you see this movie. If you have not seen Blade Runner, watch that first. If you have not seen Minority Report, watch this first. But either way, be sure that you put this movie somewhere high on your to-do list.","user":"gavin6942","rank":[23,26]}]