[{"title":"A terrific inspiring movie","rating":10,"date":"28 December 2001","review":"This is a movie for everyone who ever felt like the little person, overlooked by those who were bigger or more popular. \"Rudy\" had kind of a lame title for a sports movie, and i remember the first time I saw a preview of it, I was totally moved and involved by the scenes and then guffawed aloud at the end when the announcer intoned, \"RUDY.\" That set the rest of the theater laughing too, so imagine my surprise when i saw it a couple months later and it was a 10 out of 10 in my book. I'm not even a sports fan but this movie got me. It shows the power of faith to get by with any frustration in life, the performances are great and it's a shame that Sean Astin had to wait eight years to get another great break with \"Lord of the Rings.\" His is a worldclass performance in this film, see it as it is one of the most inspiring films you'll ever see.","user":"comickoz","rank":[32,34]},{"title":"Better that I expected","rating":8,"date":"24 May 2004","review":"To be completely honest, I was actually impressed with this film. It is sweet, but there is an honesty and a strong sense of realism at the heart of this film, which to me, provides the base of its appeal. \"Rudy\", unlike the majority of films about athletes, paints a picture of the real everyman (basically, the jock who isn't a jock) and it does so in a way that is plausible from start to finish. Working hard, eating, breathing and sleeping the game does not mean that you will wind up the star quarterback. Rudy's struggles are genuine: his family is poor and has never sent anyone to college, his grades are sub-par (largely the result of an undiagnosed learning disorder), he can't afford his junior college let alone Notre Dame and Rudy is, at best,only a moderate athlete. It is in the way that he overcomes these obstacles (not to mention the beautiful performance by Sean Astin) which provides the refreshing realism which is at core of this film. \"Rudy\" is what sports are really all about.","user":"gwenivere_pendragon","rank":[50,55]},{"title":"Enjoyed it very much...","rating":3,"date":"3 August 1999","review":"I found the movie to be inspirational, a little cliched and always interesting.  Sean Astin made me believe in the character he played and I also enjoyed Charles S. Dutton.  You know how the movie will end, unless you were born yesterday, but its still satisfying and I wasn't ashamed to shed a tear....","user":"Boyo-2","rank":[34,37]}]