[{"title":"The film with the highest rewatchability factor of all time","rating":3,"date":"3 November 2015","review":"It's actually kind of hard to describe this movie (and what's so great about it) to people who don't already know it and love it; as with many cult films, The Big Lebowski will either speak to you (in which case you will become a fervent follower of His Dudeness and abide by his code for the rest of your life) or, if it doesn't, the film will either leave you completely indifferent or you'll even downright hate it.<br><br>I believe it's a very funny film and I'm sure it can be rightfully called a comedy, but don't expect punchlines, gags, jokes or slapstick - it's not that kind of comedy. If you want to enjoy this film, you have to meet Jeffery \"The Dude\" Lebowski on his terms, hang out with him and his bowling buddies and follow them at a their (perhaps somewhat leisurely) pace through this weird and unbelievable tale about nihilism, theft (of a car and, more importantly: a Creedence Clearwater Revival tape), kidnapping, abstract art, porn and - of course - bowling. <br><br>The story is actually kind of simple. You see, some no-good German nihilists urinated on The Dude's rug - and this kind of aggression just won't stand against The Dude. With the help of his bowling buddies, he will do everything in his power to get someone to pay for his rug - or possibly get a new one (because that rug really tied the room together). So he embarks on this worthy quest during which he will encounter many wondrous things and fascinating people (even Jesus - who is NOT the messiah but a very naughty man).<br><br>With Jeff Bridges in the leading role, the Coen brothers have found the perfect actor to incorporate one of the most iconic characters that has ever been created. But it's not just The Dude that makes this a winner; the whole film is such an inspired folly and simply inventive filmmaking at its finest (the hilarious dream sequence alone is worth the price of admission). The supporting cast is outstanding (J.Turturro, J.Goodman and S.Buscemi among many others), the song choices are perfect and the dialog is the funniest, most quotable in any comedy I've ever seen. This - for me - is without a doubt the film with the highest rewatchability factor of all time. 10 stars out of 10.<br><br>Favorite Films: http://www.imdb.com/list/ls054200841/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/","user":"gogoschka-1","rank":[275,311]},{"title":"You can watch it a million times, and yet, it will never get old","rating":10,"date":"28 March 2004","review":"The Big Lebowski is the type of movie that is so funny, and so clever, you want nothing more but to meet the Coen brothers, congratulate them personally for their unique talent, and get inside their heads and find out what makes these two geniuses \"tick\".  The main characters are Jeff Bridges (who plays such broad roles like The Muse, The Contender, and Sea Biscuit), John Goodman (who should have won an oscar for best supporting actor for his character, Walter Sobchak)Juliane Moore (Maude Lebowski)and Steve Buscemi (who is unique in every Coen Brother movie).<br><br>The first time I saw this movie, I will admit that I enjoyed it, but did not fully appreciate its level of humor and raw talent.  I thought the middle section was a bit too depressing and long.  But trust me, this is a movie that gets more funny every time you see it, even if it's your thousandth time seeing it. Its level of comedy, action, brutality, and vulgarity become that much more evident and important.<br><br>The characters are brilliantly written by the coen brothers, and, likewise, are brilliantly portrayed by the actors.  The Big Lebowski is like no other film.  It will make you laugh and it will make you cry.  There is no other film such as TBL that is sharp and witty all the way through. One of the Joel and Ethan Coen's best, and one of the movie industry's best comedic film of all time.  You want to go see this flick.","user":"cleaf","rank":[727,940]},{"title":"Simply Beautiful","rating":16,"date":"16 October 2004","review":"It's a travesty that most critics only read The Big Lebowski at its most superficial level and called it a modern take on a Raymond Chandler potboiler. I simply can't begin to perceive how one could sit down in front of this cinematic pop-poetry, as it plates gold on the silver screen, and not feel so incredibly alive. The dream sequence Busbee Berkley musical numbers are unique and awe-inspiring; the humor is rich, subtle, and clever in the way it satirizes politically correct arrogance; the free-flowing story avoids (even pokes fun at) nonessentials like plot points and pay-offs. But what really makes this film such a masterpiece, such a panacea, is the incredible humanism, the care that the Coen brothers put in developing The Dude (Jeff Bridges), Walter (John Goodman), Donnie (Steve Buscemi-tremendously endearing), and Brandt (magnificently played by Phillip Seymour Hoffman). Looking at the films use of Sam Elliott to play The Stranger, who constantly rambles about the many wonders of The Dude (among other things), it is clear that the film is an ode to a Dudist way of life. And in a time where so many film promise that they have the answer to the worlds problems and end up as slick, stylistic show-off films, what more could one ask for than a good-hearted film like this? Not to mention the performance by Jeff Bridges, which ranks among the best performances of the nineties; he has a relaxed slouch, a goofy smile, an enthusiastic dance, and his buttons can only be pushed by Walter, who John Goodman plays with charm and fury. The Coen brothers have always been considered 'cold' filmmakers, but there is nothing here but warmth and humanity (as is the case with the Coens' Fargo). What we have here is one of the greatest achievements in modern cinema and if you can't see that, grab a White Russian, hit the bowling ally, and find your inner-Dude as soon as possible.","user":"butterfinger","rank":[605,796]}]