[{"title":"Very fun and imaginative","rating":8,"date":"15 November 2001","review":"I thought this movie was very good.  The people leaving bad reviews are being too critical.  This movie was meant to be fun.  The way the inside of the body is a city, the white blood cells are the police, fireman, etc., the lymph nodes were the police stations, veins were highways, the stomach was a bus station/airport type place, and the germs and bacteria were, of course, the criminals, and so on.  This movie gives a very imaginative way the body works to fight infection, as if the body was a city of people just like in the real world.  You may need to have some sort of knowledge about the body to get some of the puns and jokes, maybe not very young kids will get it, but they will like the animation...this movie is even good for adults.  I give the movie 8/10...I thought it was a very entertaining movie!!!!!","user":"jarossi","rank":[41,43]},{"title":"Very inventive!","rating":7,"date":"4 December 2001","review":"Okay, I think I've found the Sadly Underrated Movie of the Year. <br><br>\nI think that, between this and \"the Iron Giant\", Warner Brothers Animation has GOT to spring for a better promotion department.  Really, all they'd have to say is something like: \"We just let the creators of 'Something About Mary' and 'Dumb and Dumber' make their own cartoon.  Brace yourselves.\"<br><br>All complaints aside, and none of them are really the movie's fault, this is one of the most inventive animated films I've seen in a very long time.  The characters and backgrounds are allowed to look and move in ways that are downright refreshingly bizarre.  The visuals are very imaginative.  The humor, while funny, is still very much what you'd expect from a Farelly Brothers movie that takes place inside a very sick man, so I wouldn't recommend it to little kids or the weak of stomach.  If you have a little future A+P major, however, this is going to blow their mind.  Give it a look!","user":"La Gremlin","rank":[42,49]},{"title":"A Great Class of Hygienic and Human Body Functions","rating":9,"date":"27 November 2003","review":"Frank (Bill Murray) is a widow without hygienic and bad alimentary habits. He eats food that felt on the floor without cleaning, he does not wash his hands before eating and he eats only junk food. His daughter keeps unsuccessfully trying to correct his behavior. One day, Frank eats a dirty egg and gets a disease. From this moment on, the human body functions are showed through very funny and educational cartoons. The hero, Osmosis Jones, is a white globule, with Chris Rock's voice. The great Farrely brothers again surprise me. This funny (and sometimes scatological movie) is a great class of hygienic and human body functions. Chris Rock and Laurence Fishburne give a great performance with their voices. Bill Murry has the role of a disgusting character. An excellent and very educational movie, indicated also (or specially) for children. My vote is nine.","user":"claudio_carvalho","rank":[23,26]}]