[{"title":"good fun comedy","rating":10,"date":"30 June 2003","review":"The Flinstones, starring john goodman, rosie, elizabeth p., and rick m., was very cute and fun. It teaches you to forgive and that fame isn't as important as your family and friends. From all the reviews it got and the 4.3/10 it got here, I didn't expect much. But I did end up enjoying it. Pretty funny, too. Good Family comedy. I recommend this to people who like the show \"The Flinstones\", or comedies. If you don't like either of those, then you might not enjoy it as much.<br><br>Good Fun comedy! ****(out of five) stars","user":"sportskid1164","rank":[15,16]},{"title":"I liked it, what can I say?","rating":6,"date":"16 June 2008","review":"I was 8 years old when this movie came out and remember really liking it despite the lackluster reviews it received from not only critics but most of my friends as well. I don't remember anybody out and out hating it, it just kinda got one of those \"meh\" grunts whenever it was mentioned.<br><br>Now I'm twenty three and I just watched it again and I gotta say, I still think it's pretty damn good. And unless you just simply are not of a fan of the Flintstones cartoons I don't see how you can not like this film. It plays like an extended episode of the series, with a plot not unlike something we have seen in our Saturday morning reruns, but loaded with enough clever one liners and risqué humor to elevate it to a much more adult oriented comedy. It's also got tons of sight gags and background jokes that you will likely need some multiple viewings to appreciate. Not to mention the sheer scope and execution of the sets, costumes and animatronic and CG dinosaurs are really something to admire, especially for its day.<br><br>The actors all play their parts well too, John Goodman and Rick Moranis as Fred and Barney are the standouts but there's nobody here that I thought fell short. Yes, I would have liked to have seen Betty portrayed with somebody with more curves in the right places...I mean she was the hottie in the cartoon and Rosie O'Donnell's physique definitely doesn't live up, but you have to give credit where credit is due and while she may not look quite the same, she plays the part well and has the voice and trademark giggle down perfectly.<br><br>Is this a fantastic film no...but I enjoy it every time I watch it and I think the attention to detail and obvious care that went into making this movie alone should keep it entertaining for years to come and considering its unlikely anything quite like this will ever be done again outside of its sequels, I would not be surprised if this movie eventually earns its respect among film buffs in the future.","user":"on_the_can","rank":[42,51]},{"title":"Well-made live action imitation...","rating":7,"date":"12 January 2003","review":"1st watched 1/12/2003 - 7 out of 10(Dir-Brian Levant): Well-made live action imitation of the popular Hanna-Barbera cartoon series. Maybe it's because Hanna &amp; Barbera were involved and were two of the executive producers of the movie as well as having small roles in the production.  Besides this, this classic tale of life in the stone age had tremendous casting in the way of John Goodman(Fred Flintstone), Rick Moranis(Barney Rubbel) and the entire group for that matter.  The movie starts with the Rubbel family adding a new member in the adopted Bam-Bam and then the rest of the movie matches pretty much the way the two families lived their lives &amp; worked together as neighbors in the prehistoric town of Bedrock.  Of course there is evil-a-foot within a demented man in a higher position in the stone quarry who tries to frame Fred and the rest of the movie is a culmination of all this.  What is great about the movie &amp; the series the Flintstones is that no matter what trouble they got in, the families always patched it up in the end showing us what true friends our made of.   And besides all this the movie was funny &amp; visually appealing too !!","user":"dwpollar","rank":[27,32]}]