[{"title":"Good film, but not great.","rating":7,"date":"14 December 2005","review":"This DVD/VHS covers a part of World War II history which is ordinarily overlooked...the Negro (African-American) soldier. There are scenes which show the physical, academic and practical challenges Black American troops met and completed. Additionally, this film shows the morale and spirit of the \"home front\" while the troops were away fighting. My favorite portion of this includes the reading of some sections of Mein Kampf and the specific mention of Blacks therein. Some film scenes were used elsewhere. Overall, this is not a comprehensive documentary. Rather, it is a snapshot of a place in time designed to booster wartime morale and to combat the argument-put forth elsewhere-that WWII was not the Black man's war but instead should be left for whites to fight without involvement by Black America. The direction of this is worthy of Frank Capra.","user":"Sisko24","rank":[12,13]},{"title":"Clever documentary","rating":8,"date":"13 November 2016","review":"The US was recruiting more and more black people as soldiers as WW2 came to a close. Eventually 125,000 would serve overseas and nearly 1000 would die in combat, but in 1943 the big question was how to motivate blacks to fight for an America in which segregation was still very much alive.<br><br>Carlton Moss was serving as an adviser to the War Department and the job was given to him to write the documentary, and eventually he ended up starring as a Minister.<br><br>Moss decided to focus on the contribution of blacks in American history, particularly their role in battles as well as their achievements in science, medicine, and education. He contrasts that with the Axis views about \"colored people\" and their treatment of conquered peoples. The film switches tones and then follows the life of a new enlistee who eventually makes it to officer candidate school.<br><br>The documentary is very clever, telling the truth, but just enough of the truth to avoid some of the awful elements of life for black people in the U.S.","user":"drjgardner","rank":[7,7]},{"title":"True Propaganda Treasure from the Department of Defense","rating":6,"date":"14 March 2004","review":"This production was made in partnership with the then called Department of War.  The goal of this film was to recruit African-Americans to join the war effort in WWII.  The film tries to convince blacks that the U.S. has always had an amicable relationship with them.  The film offers happy imagery of blacks building log cabins beside the early settlers and working pleasantly beside whites in factories.  However, never does the film try to explain or apologize for slavery.  The film also suggests that blacks have always had the same opportunities as whites.  In this film, slavery, lynchings and inequality are simply erased.  For this reason, this film is a true treasure for the propaganda film archive.","user":"roomgames","rank":[17,30]}]