[{"title":"the dialogue is fresh and chances are you'll be grinning from here to Bolivia when the \"Love Train\" rolls through the subway at the end.","rating":15,"date":"15 December 1998","review":"`You have no idea what men think about women's breasts,' womaniser Des McGrath (Christopher Eigeman) pleads. No, not a rehash of Boogie Nights, but the third instalment, following Metropolitan and Barcelona, of Whitman's `yuppie' odyssey.<br><br>This New York yarn centres on publishing assistants Charlotte (flawless snotty American accent by Kate Beckinsale) and her best friend/biggest rival Alice (Chloe Sevigny). Bitchy Charlotte - `In physical terms, I'm cuter than you, but you're much nicer than I am,' - and Alice fall in with a parade of self-absorbed fellows in pullovers and drab ties. The `verbal' action between this set of intellectual folk takes place at a ludicrous dance palace in the very early 80s, with the `disco movement' decaying and Reagan's soul-devouring materialism taking hold.<br><br>In the main these are disagreeable people, but as much as you urge yourself to loathe them, you can't quite do it. Whitman's wildly self-indulgent and witty script (`Do you think the neurological effects of caffeine are similar to that of cocaine?') makes them impossible to ignore and eventually their awfulness becomes disturbingly compelling. A bit like Friends, only without dumb Joey and flaky Phoebe.<br><br>Although, aesthetically and visually Whitman's film doesn't quite ring true  clothing looks too 90s and they'd never be able to talk so much in a club  the dialogue is fresh and chances are you'll be grinning from here to Bolivia when the \"Love Train\" rolls through the subway at the end.<br><br><ul><li>Ben Walsh</li></ul>","user":"walshio","rank":[43,56]},{"title":"Oh, to be Young","rating":8,"date":"3 December 2000","review":"\"The Last Days of Disco\" follows a group of newly minted adults in the New York of the early 1980s.  They're affluent, and recent products of Ivy League educations but they really don't have much of a clue as to what adulthood is all about. They're groping, but they're not sure for what. They all have jobs, but their lives revolve around a posh disco where they mate, mingle, and talk. There's not much of a plot; \"The Last Days of Disco\" is mostly a series of conversions. But the conversions are wonderful. Whit Stillman's dialogue is a delight; he nails what its like during those first years of adulthood when the life of the group is replaced by a mature individuality.  The ensemble cast is wonderful to watch, not overplaying their characters. I recommend this movie very highly","user":"gbheron","rank":[35,45]},{"title":"Clubs were not as loud then as they are now","rating":7,"date":"8 February 2004","review":"Several people have commented that the conversations in the club would have been impossible due to the loud disco music. I was a regular bar goer in the 1970s and 80s and though some rock and roll bars were deafening, most dance clubs were not as \"loud\" as they are today. Conversation was a possibility back then believe it or not. I think that is one retro idea that should be revived.<br><br>As for the rest of the film, I liked it. I did not think all of the elements worked however. For example, I would have liked to have seen more proof that disco was on its way out. Having guys walk around in shirts that proclaimed \"Disco Sucks\" and footage of a \"death to disco\" rally at a baseball game between the Detroit Tigers and Chicago White Sox were both evident in 1979 when that game was played. I watched that game. Incidentally, the Tigers won by forfeit as the Chicago field became a disaster area. I would have liked to have heard more of the change in music. We did hear some Blondie, but this film was supposed to take place in the early 80s. I think the song \"Bette Davis Eyes\" would have been a good choice.<br><br>If you are looking for a celebration of Disco, this film isn't it. It does have some realistic portrayals of people who might have been involved in the scene. I watched the film because I disliked the whole disco scene and thought that a film showing it dying may be interesting and it did not disappoint me. If you are looking for a plot, this film doesn't have it. Not all of it worked and I was scratching my head a few times, but I think this film may become more enjoyable with a second viewing. I gave it a 7.","user":"RDenial","rank":[40,54]}]