[{"title":"Predator 2 (1990) - Kicks Ass - Defending an underrated Action Sci-Fi flick Sequel","rating":10,"date":"16 October 2015","review":"Predator 2 (1990) Is very underrated, bashed and hated decent Action Science Fiction Horror flick! I don't get why It did got 6.2 on IMDb I give it 10 out of 10. I love the action I love Danny Glover he is my favorite action star! From Lethal Weapon 1 &amp; 2 he is terrific he is the action hero I wanted. Gary Busey and Danny Glover they both started in Lethal Weapon. In this movie they were great. I am a big fan of action flick Predator 2 and is not a stupid movie! I am comparing with Lethal Weapon 1. Because Danny Glover star of Lethal Weapon was the main cast and hero. Gary Busey from Lethal weapon was FBI agent and Glover's nemesis like was Gibson's nemesis in Lethal Weapon. The movie has great action tough the plot wasn't great but was 90's action and I love it. <br><br>It is my childhood movie and the last good Predator film and worthy sequel of all time. I don't like Predators (2010) and I think Predators it is a rip off the first film. When people criticizing movies I love them because I am a big fan of Predator 1 &amp; 2 so I really don't care. Arnold Schwarzenegger turn down the offer to reprise his role from the first movie he said the story set in the city would be bad idea and maybe it was. The new Predator the actor form the first movie had new technological weapons than in the first one. I love Predator 2 no matter what everyone say's I love my childhood movies and I enjoyed the score too and the movie it is not bad as people are saying, it is underrated I love it.<br><br>There are many elements that I enjoyed in the film. The score, the action scenes and Danny Glover. The predator was there as a test of rites or passage which is pretty clear by the end with the elders showing up to collect his body. I think this film is highly underrated and no where near as bad as some say about it.<br><br>Why I love this film as much, that I love the original film?: because of action, it is sequel to the first movie, Kevin Peter Hall stars in this movie actor from the first movie , it has Predator movie theme score, more Predators showed up at the end. Glover gets a gun from 1717 sorry if I did not wrote correctly. I always love Predator 1 &amp; 2 movies no matter what, if it was terrible or not.Some people are saying similar things about Predators but I am not listening them, I love them and I am listening to my self. Predator 2 does have error hole the story shouldn't be set 10.years after first movie in 1997 Los Angeles because the movie was released in 1990\" so it should be set in that year. <br><br>Kevin Peter Hall returns as Predator. When Gary Busey say's The Lions, The Tigers, The Bears, o may your the Lion and this is the Jungle. Predator 2 the story is set in Urban jungle and is different than the first one. You are 100% right predator 2 doesn't copy predator 1 it has his own story. Predators did copy the first movie. Oh and AVPR Requiem they stole the line from Arnold Schwarzenegger Predator! I think both movies are great. I love both of them. I only liked Predators because the story was set in an amazon Jungle and it relaxed me. Predators does have a lot of mistakes and I hate it. Lauernce Fishburne from The Matrix and CSI with who was he talking? when he set the fire for Brody and his friends ugh. The rest of the Predators film I don't like. <br><br>Predator 2 is the best one! It is better than Predators! I love Predator 2. Danny Glover and Gary Busey are the main cast and they completely rock. Predator 2 is the best action movie ever. More sci-fi and action more facts about Predator, they are more Predators.They are cops and FBI agents best action movie in 90s i love you Danny Glover killed him at the end of the movie Arnold did not killed him he only wounded him, Predator activated self distraction advise and he blows him self up,so Arnold did not killed him. A lot of people does not get this movie. So if you hate this movie than don't watch Predator 2,go and watch Smurfs instead stupid morons!Predator I and II are excellent films. Part III was outrageous and out of question. It has since become a cult film among fans.<br><br>Amidst a territorial gang war, a sophisticated alien hunter stalks the citizens of Los Angeles and the only man between him and his prey is veteran L.A.P.D. officer, Lieutenant Mike Harrigan.<br><br>This electrifying action sequel unleashes the deadly invisible Predator in another jungle -- the urban jungle of Los Angeles. Danny Glover stars as a lieutenant who mistakenly concludes that mangled bodies found by the police are the work of feuding gangs. Instead, he finds himself confronting a savage alien who has come from a distant world to hunt humans for sport. Gary Busey and Ruben Blades co-star in this action-packed, high-tech thriller.<br><br>Predator 2 is a 1990 American science fiction action film written by Jim and John Thomas, directed by Stephen Hopkins, and starring Danny Glover and Kevin Peter Hall. The film is a sequel to 1987's Predator, and Kevin Peter Hall again plays the role of the Predator.<br><br>10/10 Score: Bad Ass Seal Of Approval Studio: 20TH Century Fox, Silver Pictures Starring: Danny Glover, Gary Busey, Ruben Blades María Conchita Alonso, Bill Paxton, Robert Davi Director: Stephen Hopkins Producer: Joel Silver, Lawrence Gordon, John Davis Rated: R Running Time: 1 Hr. 48 Mins. Budget: $35 Million Box Office: $57,120,318","user":"ivo-cobra8","rank":[103,121]},{"title":"Extremely underrated.","rating":10,"date":"3 July 2006","review":"WTF is wrong with people? Predator-1 had more Arnie than Predator. This movie simply has more Predator. It also greatly expanded the Predator universe and franchise. It introduced a whole new bunch of Pred weapons, tactics and behavior which never ever seemed out of place and were perfect fits. It explored their race further. All these were added to full effect in the AvP and AvP-2 PC games which were smash hits so imagine how horrible it would be if this movie never happened? The urban (steel jungle?) setting contrasts against the previous jungle setting and is a major plus for this movie. This movie was also extremely realistic and gory. All in all, this movie is fantastic and a few ignorant critics just want to bring it down by comparing it with the uniqueness of the original.","user":"nerpaakula","rank":[319,422]},{"title":"Want some candy?","rating":10,"date":"25 April 2004","review":"I've always loved this movie ever since I saw it way back in 1990 at the theater. Predator is great, but part 2 is equally great. It may not be quite as primal and fast paced, but it more than makes up for it with well developed characters, a more detailed back story and compelling setting, and a deeply developed story. If the predator wasn't in this movie, the story set up would make for a great movie on its own.<br><br>You may not realize it when you're watching it, but the climax of this movie is nearly 45 minutes long! Starting from the subway shoot out, the tunnel chase, the street-roof chase, the slaughter house fight, the roof top fight that spills into the apartment building across the street, the elevator shaft, and finally to the Predator ship itself. It is a breathless series of action sequences strung together so well that it's almost astonishing to look back on it and imagine such effort was crafted to make this movie.<br><br>This movie would never be made today. A sequel without the main character from the fist movie? A whole new setting? This would be seen as too great a risk, but in 1990 movie studios were still run by creative people, not accountants. This movie is a true, unsung classic of sci-fi, coming from an age when great care was put into genre movies that had strong stories, good characters, and dialogue that didn't sound silly and forced. Lines weren't meant to become one-liners, they were just so memorable that they ended up that way.<br><br>\"You can't see the eyes of the demon, until him come calling.\" \"Okay P-ssy face, it's your move.\" \"Danny Boy.\"<br><br>And of course...<br><br>\"Want some candy?\"<br><br>Granted, those aren't as good as the classics from the first Predator, like:<br><br>\"You son of a bitch!\" \"I ain't got time to bleed.\" \"Knock Knock.\" \"Stick around.\" \"If it bleeds, we can kill it.\" \"You are one ugly mother f---er.\"<br><br>and of course...<br><br>\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAARRRRRRRRRRRRRRRRRRRRRRRRRRRHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\"<br><br>Last but not least, the music score from Predator 2 is one of the best ever. Alan Silvestri hasn't topped his work from this movie which has to have one of the most complex, layered, and just flat out astounding main themes ever composed for an action movie, or any movie.<br><br>And of course, it had the cameo that sparked the whole Alien vs Predator phenomenon. If it weren't for Predator 2, god knows where we'd be.","user":"neo_jenner","rank":[212,286]}]