[{"title":"One of the better examples of the \"Criminal makes good\" genre.","rating":7,"date":"31 January 2000","review":"This movie makes you care about its characters.  This should be said about all films, but this one accomplishes it where others do not. The story revolves around a young man in South Central Los Angeles who is involved in a gang that is slowly making itself successful by selling drugs. He goes to jail after being convicted of shooting another gang lord. While in prison, his son grows up and is drawn by the romance and easy money of his father's old gang, and becomes involved as well. The story is a little over-simplistic, and the dialogue is a bit thin at times.  But the director and cast rise to the challenge and turn this into a film about relationships and philosophy, rather than going for the easy solution of shooting off as many guns as possible.  The ending is one of the most sappy we've seen in a while (just a bit too much 'Mom and apple pie'), but given the situation you are willing to go with it. While it's not perfect, this film ultimately works -- which is better than 95% of this genre.","user":"iam-1","rank":[19,19]},{"title":"\"South Central was adapted from my novel \"South Central L.A. Crips\"","rating":10,"date":"31 December 2007","review":"I would like to thank all of the fans and supporters of the the film; it pleases me greatly that you got the message. I am a retired (South Central L.A.) English teacher; I wrote the novel \"South Central L.A. Crips(the story of the L.A. Street gang, 1971-1985)\" in 1986 as a roman a clef (faction). \"Deuce\" was a euphemism for \"Crip\" (which was censored in movies in 1991) It had become obvious to me that the old canon of American literature would not inspire the will necessary to become literate for Crips and Bloods and many other lower class African Americans, so I interviewed hundreds of gangsters over a 4 year span and wrote a book about them that would do the job. The movie \"South Central\" was, initially, merely a vehicle to advertise the book and promote the message of literacy. I used the book and the movie in my curriculum for 12 years. Gangsters stole it out of my classroom and the local libraries. I considered it an ironic tribute and an effective way to distribute to the people who needed it the most. But, best of all, L.A.'s gang murder epidemic has been subsiding ever since until it's now lower than it has been in over 30 years. \"South Central\" was made to save lives and I believe it has as \"Variety\" predicted when it came out in the midst of over 1000 murders in 1992. I rushed it to the screen (I signed a 6 month option w/Steve Anderson for $1)because I knew there was a volcano about to erupt in South Central L.A. from teaching 100's of gangsters in the area; I partnered w/Steve and Oliver Stone because they had the sensitivity for the mission and skill to make the film. Unfortunately, \"South Central\", though completed in 1991, was not released until the summer of 1992 after the South Central L.A. Uprising which stigmatized it to the owners of theaters causing it to go from a projected 1200 (approx.) screen opening to less than 100. It was a big success immediately in video stores and on cable. Hopefully, it will last as long as \"Huckleberry Finn\". I am not a \"Hollywood\" writer; although I wrote the novel and collaborated on the screenplay (for which I received no credit), I was not able to join the WGA (I played Dr. King in the movie, so I am in SAG). However, I am honored to have made the film; I, even, believe it is time to remake it for today's audience. I would have liked to: keep it PG-13; eliminated the N-word and profanity; used more of the slang from the novel(\"h-nk-ball\"?, \"ginawagon\"!, please); shown more of the L.A. Islamic influence and local history, obviously Bobby (Jimmie Black in the novel) is changed by copious reading like Malcolm X, and I, being a devout Muslim, wanted to note the great work Muslims have done in prisons (this, too, was pretty much anathema in 1991, but we sneaked it in subliminally). I have written a sequel, \"Inhale Gasoline &amp; Gun Smoke (the story of the L.A. Uprising)\" which is probably too hot for Hollywood but will eventually be made one way or another. I am Executive Producer of SAB Productions and my film \"Bilalian\" shows on BET's Black Stories every now and then. My new book is \"N*GG*S-The Black Curse\", and completes my trilogy on South Central L.A. <br><br>As Salaamu Alaikum, Donald Bakeer P.S. 100% literacy for African Americans by 2010 (gangstas, too)!","user":"DBakeer107","rank":[45,52]},{"title":"8/10","rating":8,"date":"20 July 2002","review":"SOuth Central was a gripping drama about a former gang member who has to decide between being a daddy and being a gangster.  He rolls with the wrong crowd and gets caught up, BAD MOVE!  NOt to spoil the film for those who haven't seen it I'll just leave it at that.<br><br>THe direction was fluid and well executed.  S. Anderson brings the viewer into the scene and captures the moment with sheer brilliance.  THe only two acting performances even worth mentioning were Glenn Plumber's and Byron Minns's. The supporting performances where sub-par but good writing rescued them from seeming cheezy.<br><br>I enjoyed South Central.  It made my collection and I recommend it for yours.<br><br>BUggie","user":"Buggieblade","rank":[9,9]}]