[{"title":"Worth watching even for non van Damme fans","rating":7,"date":"3 March 2004","review":"Legionnaire is beautifully photographed and contains both an engaging story (loosely based on Beau Geste) and good performances by the actors. Underrated from the start, the picture undeservedly went straight to video. However, it is not a 10 out of 10 as some suggest. The story and characters fall too often into clichés and some of the roles could have been given more depth. Particularly the love story, mostly told in flash backs, is depicted with emotionally appealing pictures and music but remains too superficial to be fully satisfying.<br><br>This film had the potential to be great with a bit more emphasis on the drama part and toning down the more usual action flick formula (the action scenes are well done, though). However, here is hope that van Damme will make more serious movies, even if they have martial arts and action themes. I always liked him as an actor. There is an honesty and modesty to van Damme's work that is missing in most Hollywood products.","user":"liebpferd","rank":[40,41]},{"title":"A pretty good Van Damme picture.","rating":7,"date":"14 February 1999","review":"This is better than most Van Damme films and it has a great score. The film is cliched, but it's a Van Damme picture. I don't think any Van Damme fan wold have it any other way. Some have said that Van Damme reminds them of Schwarzenegger, but I personally think the comparison runs closer along the lines of Charles Bronson. Jean-Claude Van Damme is the B-movie actor of our generation and to me that is a major compliment. Some might not like his accent or his fancy karate, but his films are usually entertaining and solid action pieces. I remember a long time ago somebody said to me that Steven Segal would outlast Van Damme, well all I have to say is \"Has anybody really liked the last 4 or 5 Segal pictures?\" People should appreciate Van Damme for the action star he is and not the actor he may or may never become.","user":"Peach-2","rank":[34,36]},{"title":"What? No kicking?","rating":8,"date":"2 October 2003","review":"This has to be one of the oddest, yet best Van Damme films ever. It's not chop-socky martial arts kickboxing crud, and it isn't mindless sci-fi action... it's a war drama. And a surprisingly good one. Van Damme plays Alain, a boxer who is paid to take a dive, but who instead flees and joins the French Foreign Legion, where he learns about friendship, honor, and fighting to the last. Sound like a normal Van Damme movie? Far from it. Sheldon Lettich's script, while somewhat cliche, is very well put together. The acting is surprisingly top notch, with even Jean-Claude Van Damme himself turning in a good performance. What a shame this movie never made it to theaters. I recommend it to anyone who enjoys an exciting, epic war film. I give it 8/10.","user":"nerph20","rank":[39,43]}]