[{"title":"Excellent parody!","rating":8,"date":"6 March 2004","review":"Anybody who didn't enjoy this movie didn't get it... it was one of the most hilarious parodies I've ever seen.  But, perhaps the circumstances of my initial viewing overly influenced my opinion.  On a business trip to DC in 1998, I saw \"The Game\" with Michael Douglas and Sean Penn on the way out... great movie, but very heavy and deep.  However on the way back, this movie was playing.  Based on initial reviews I wasn't expecting much, but watching it was like someone purposely made a funny version of The Game, and I probably annoyed my fellow passengers as I was laughing so hard.  I thought Murray was at his best, not unlike Chevy Chase in the Fletch movies (shame they didn't make more of those), as they were both in their comical element.<br><br>The coincidental (or perhaps not) pairing of these two films really added to my enjoyment of both.  On a cold rainy weekend, I strongly recommend renting both and watching them in the same order I did you won't be disappointed!","user":"wipster","rank":[52,55]},{"title":"First of all....I loved it.","rating":13,"date":"13 February 2000","review":"First of all....I loved it. Simply put, this film was great. Talk about a story that could have been based upon true life incidents is not what this film is about. This is comedy at its best. Bill Murray's character is a man who manages a Blockbuster-video store someplace in Iowa. Murray decides to take a vacation and visit his brother in London. His brother (Peter Gallagher) is entertaining some important clients that same evening and sends his brother (Murray) out to participate in this audience-interaction play involving spies called the `Theater of Life'. Well, as the play begins, Murray accidentally stumbles into a real-life spy drama and takes everything that happens next as if he is just acting in a play. The result is non-stop humor which leaves the audience busting up outloud. You don't have to love Bill Murray to love this film...he brings to the screen the best parts of his roles in \"Scrooged\", \"Stripes\", \"Ground Hog Day\" and \"What About Bob\"...you just have to be ready to experience Bill Murray at his best. Bottom line, what might even be funnier than the film, is being part of an uninhibited audience, because once some people begin laughing, they will be at it for the next two hours.","user":"gagliano","rank":[46,49]},{"title":"One of the Greatest Comedy Tour De Forces in Film History!","rating":10,"date":"27 December 2004","review":"How could so many people miss this amazing performance? Bill Murray pulls off something that hadn't been done since the days of Harold Lloyd: a character who always succeeds despite the fact that he thinks that everything is a game. Like Lloyd's blindfolded wanderings on suspended buildings many stories in the air where he never falls down or gets hurt, Murray triumphs as a super-secret-agent when he thinks the entire thing is a parlor game, a bit of 'real life theatre'. The twists and turns of the plot, the misunderstandings and misinterpretations by everyone around him just add to the giddiness of the whole film. I have rarely been so disappointed when I had to finally concede that it was the end of the story. Give this a second look if you dismissed it as just a silly movie. It's a classic, and one of my 10 best movies of all time.","user":"ddrucker","rank":[93,107]}]