[{"title":"Touching and unpredictable","rating":17,"date":"17 December 1999","review":"Engaging, well-made comedy based on the play by Ayub Khan-Din concerning the misfortunes of an Anglo-Pakistani family verging on the brink of change in early 1970s Salford. Traditional dad Om Puri is shocked when his oldest son (Ian Aspinall) runs away from an arranged wedding, and decides that from now on his family will be more respectful. Among his plans are the weddings of two of his other sons, both of whom are far from delighted with the idea. Khan-Din's fine script never resorts to cliche resulting in a funny, study of the clash between the old and the new.<br><br>Linda Bassett as superb as Puri's second wife, an English woman who straddles both camps between her husband's traditionalism and her kids' sense of rebellion while nonetheless attempting to keep her own dignity.<br><br>Fine performances from Chris Bisson and Jimmi Harkishin (Coronation Street) and Jimi Mistry (EastEnders) while little Jordan Routledge is great as the parka-loving Sajid.<br><br>However, it's Puri who shines as the complex father, desperately trying to hang on to tradition and finding nothing but rebellion from his family.<br><br>The ending could easily have been a familiar family seeks revenge on their overbearing father but what results is a refreshing change to the many TV movies that usually opt for an easy solution to a difficult problem.","user":"Dodger-9","rank":[23,25]},{"title":"Well-made drama about culture clashes","rating":8,"date":"8 June 2006","review":"Three teenagers are sitting in front of a TV, enjoying their large helpings of pork sausage and bacon. Suddenly they hear a door opening and immediately start cleaning up all of the dishes and unsuccessfully try to get rid of the fumes of grilled bacon and sausages that billowed through the whole house. This is, of course, not depicting the normal life of three teenagers, but taken from the film \"East Is East\" by Damien O'Donnell. It deals with the story of a family in England in the 1970s with a Pakistani father (multi-facetted enacted by Om Puri) who still believes in his Pakistani traditions and his Muslim religion and an English mother (great performance by Linda Bassett) who tries to give her seven children as much freedom as all of their \"fully English\" friends enjoy. This movie was labeled as a Comedy both in theaters and on DVD or VHS, but anybody looking for light-hearted entertainment fitting for a Saturday night will be hugely disappointed. This movie is out to teach the viewer about how difficult it is to get two very different cultures to not only co-exist peacefully next to each other, but to merge them to create a new one. The script by Ayub Khan-Din, who also wrote the book and the stage version of this movie, does have its funny moments, and the whole cast, including the children, is in for some good laughs. But the more intense moments are those where the viewer has to deal with outbursts of domestic violence or things like arranged marriages that seem so far away and cruel to Westerners. The cast shows its brilliance in those intimate moments. Even though the script might sometimes appear to be too ambitious  there are just too many characters all developing in a very distinct manner and all crucial to the movie  the movie can be recommended to anyone who is not looking for a standard comedy and is willing to have his views on life challenged.","user":"chri_fi","rank":[19,22]},{"title":"A different side of England","rating":15,"date":"15 December 2004","review":"I wish there were more movies about the different cultures in the UK. Not just the Anglo, but the Asian and West Indian perspectives. Even the Southeast Asian view. The Middle Easterners have shown great strides with movies like \"Bend It Like Beckham\" and a few others. This movie got away from me until recently. I saw in the library video section and decided to check it out. The box is very misleading. They put a young interracial couple, front and center on the cover when actually their subplot is very peripheral to the story. I guess the movie studio figured they'd get a wider audience interested with younger faces on the cover since the main characters look to be in their 50s.<br><br>George Khan (Om Puri) has left his native Pakistan to live in the UK with its soveriegnty ties. Though he has a wife back in his homeland (she is only mentioned, not seen), he marries a white Englishwoman, Ella (Lynda Bassett). They have 7 kids: 6 boys and 1 girl. Flash forward to the late 60s (where the movie actually begins) and we see his kids are truly English in behavior though he stresses that they must go to Mosque to study and worship. His oldest is to be wed in an arranged marriage to a woman he hardly knows. He runs out in the middle of the ceremony in fear, embarrassing his family especially his father who disowns him. This sets the tone of the movie. His kids are English-born and want to live like their friends in their working-class neighborhood but George wants to raise them as traditional Muslims, despite opposition from his wife, Ella, who only wants the kids to be happy. She tries to help them avoid run-ins with their father who despite his cheerfulness is quite an ogre when angered. The kids range in attitude and indifference toward George's attempts to introduce them to the traditional ways. <br><br>This is a decent introduction to immigrant life in the UK especially since it's set during a time when there was political strife over immigration of non-whites into Britain. Though it's an effective comedy, it also touches on the frustration immigrants of any culture go through to hold onto or reject their identity. The only thing marring this movie is a domestic violence scene that may bother some. Still a very good movie worth seeing.","user":"oxblood","rank":[31,41]}]