[{"title":"to yacht or not to yacht","rating":8,"date":"15 July 2000","review":"One thing is for certain - you will either hate this film, especially if you can't stand the sea, boats and wind, or, if you like any of these, especially if you like _all_ of them, you will love it. Admittedly it has a simple, proven plot, gives short shrift to the history of the America's Cup and features a rather non-describt cast - but the film does have superior and imaginative cinematography, impeccable editing and a marvelous soundtrack, as well as a slow, but steady build-up of drama. To my knowledge there is no other film that even comes as close as this movie to capture the feeling, tension and athmosphere of offshore competitive racing. It deals with an unconventional, off-beat setting and theme - go, see/rent/buy it if you can stand that.............","user":"humpback","rank":[16,17]},{"title":"The quintessential yacht racing movie","rating":9,"date":"14 January 2006","review":"As a long-time sailor and racer, I admit that most consider a sailboat race like watching the grass grow, but they've done a great job of producing exciting racing scenes, while having so few technical inaccuracies that the most avid of us keep rewinding to review and debate. Take good note of the early dinghy racing scenes. I don't believe they used any trick photography: things really can happen that fast.<br><br>Of course, there's a larger set of stories, the classic love stories: between men and women, of sailing, of ideas, of ideals; the rough retelling of the Dennis Connor story (though I place Robertson/Weld as Connor, not Modine/Parker); an accurate representation of the \"Old Boys'\" network that *is* big-money yacht racing --I've met \"Abigail Weld\" many times; and the \"absurdity\" of a desert-based effort winning the Cup, a nod to the Melges' campaign.<br><br>The photography is astounding, the character development (the reason for the film's length) good, and the music complimented everything admirably.<br><br>That it's \"about\" sailing will turn many off, but those of us with a love of the sea and sailing hold this as a classic to be cherished.","user":"jerelull","rank":[13,14]},{"title":"For sailing enthusiasts.","rating":11,"date":"11 April 2004","review":"Wind is a great look at the sport of competitive sailing and also contains a bit of insight into mechanical engineering and the process of design and development. <br><br>Matthew Modine is Will Parker, a good sailor who is slightly overconfident about his skills. He joins the crew for the America Cup, but his actions help to lose the nation's undefeated title to their tough Australian rivals. This was more than just a loss of the cup to the new world champions, but it also ended his relationship with girlfriend Kate Bass (Jennifer Grey) and sent the boat captain into a bout of depression. <br><br>But, Will Parker, with the next Cup race rolling around, Will Parker wants to reunite a team, and seeks the help of Kate and her new beau Joe (Stellan Skarsgård) to help him rebuild his confidence, his team, and a better boat. Will and his team challenge the Aussie's to defend their title for a second year. <br><br>Indeed, as another viewer wrote, the movie is rather long. But, the subject of the movie is really something different, and the photography is just beautiful as you get the first-person perspective of competitive sailing, and it really gives an appreciation of what all goes into the sport, even the traditions. Modine's character is a little annoying because he sometimes obnoxiously boasts his masculinity to Kate as though trying to show up her new boyfriend, Joe. It's worth catching if you can find it around.","user":"vertigo_14","rank":[12,13]}]