[{"title":"We need more films like this","rating":10,"date":"25 January 2003","review":"In a time when Hollywood is making money by showing our weaknesses, despair, crime, drugs, and war, along comes this film which reminds us the concept of the \"Indomitable Spirit\".  If you are feeling beaten down, this movie will free your mind and set you soaring.  We all know how tough life can be, sometime we need to be reminded that persistence and courage will get us through.  That's what this film did for me and I hope it will for you.","user":"mvirgili","rank":[130,135]},{"title":"One of the best animated features not to have the Disney name on it","rating":18,"date":"18 July 2004","review":"Looking for a movie with cutesy talking horses that the kiddies will love? Then Spirit is probably not the movie for you, it is instead one of the nicest animated features to come along in a long time to not have Disney written all over it. No, the horses do not talk and they shouldn't as the whole story is told from a horse's point of voice in a wonderful narrative. In fact there's not a lot of pointless dialog to weigh down the movie at all.<br><br>Instead it's filled by a wonderful score by Hans Zimmer and songs by Bryan Adams who admittedly I wasn't a big fan off except for (Everything I Do (I Do It For You) and Star) but the songs he did for this movie especially Here I Am, Get Off Of My Back, Can't Take Me, Brothers Under The Sun and Sound The Bugle made me download the soundtrack from Walmart.com the next day.<br><br>The main reasons I liked this move would have to be the beautiful drawn animation, mixed with an endearing story with some comedy elements and a wonderful soundtrack. Spirit is simply fun and enjoyable for the whole family no matter what their age.","user":"ThomasRiordan2002","rank":[111,116]},{"title":"Full of Heart, a great story.","rating":8,"date":"22 December 2002","review":"If only ALL animation was this great.  This film is classic because it is strong is two simple aspects: Story and Character.  The characters in this film are beautifully personified.  I felt for all of the characters, and human-animal relationship in the movie works perfectly.  The beautiful animation and 3-D computer animation hasn't worked better in any other film. This is a great movie for kids, and for adults who want a classic hero's journey.  8 of 10.","user":"NickSDV","rank":[57,59]}]