[{"title":"Enjoyable Romantic Comedy","rating":7,"date":"20 November 1999","review":"MR. JEALOUSY doesn't aspire to greatness; just a small, quirky, romantic comedy.  To this end it succeeds.  Set in Manhattan, Eric Stoltz plays a young thirty-something wannabe writer earning a living as a substitute teacher.  Annabella Sciorra plays his girlfriend, and they are falling in love with one another.  Eric's problem is that he is pathologically jealous and is being eaten away by thoughts of one of her earlier lovers who is now a successful writer.  So obsessed is Eric that he joins the ex-boyfriend's group therapy session under the guise of his best friend.  And far from being irate, the friend begins to dig on this, receiving therapy vicariously through Eric.<br><br>Of course the whole shebang unravels and...well that's the movie.  As far as 'date' movies go, this is better than most and is heartily recommended for the guys when the lady wants this kind of movie brought home.","user":"gbheron","rank":[15,16]},{"title":"Offbeat and thoughtful, this film may, nevertheless, lose viewers with its slow delivery","rating":6,"date":"5 April 2007","review":"Lester (Eric Stolz) has a new girlfriend in Ramona (Annabella Sciorra). She is a beautiful lady, with a swell job in a Brooklyn museum, and she is continuing work on a graduate degree at Columbia. Substitute teacher Lester, however, is obsessed with Ramona's past relationships. He was burned by a couple of former girlfriends and fidelity is paramount to him. When Ramona actually gives Lester a book to read, written by a former boyfriend, Lester is stunned. Not long after this, Lester stumbles upon the nouveau-celebrity author at a therapy group. Ah ha! If Lester assumes an alias and becomes part of the group, he has a chance to find out more about Ramona's past and her predilections for loyalty. Yet, even as Lester discovers revelations about his new girlfriend, he may be endangering his own chance of survival with Ramona, by not living in the present alone. Should he continue? This film has an offbeat charm that makes it attractive. The script is thoughtful, clever, and original, daring the viewer to listen closely to every word and idea presented. The actors, in addition to the two stars, are very fine, with Chris Eigeman giving a nice turn as the newly famous author, and Bridget Fonda, Peter Bogdanovich, and others on hand to help out in a big way. The costumes are attractive and the NYC setting always a winner. However, this is not the typical romcom by any means. It has a slower pace and its commitment to dialogue over action makes it a hard sell for the ADD crowd. This said, do catch Mr. Jealousy at your earliest opportunity, if you like to vary your viewing habits. Here is one movie that offers charm and intelligence without losing its own unique identity.","user":"inkblot11","rank":[9,9]},{"title":"A truly delightful film.","rating":10,"date":"15 April 2000","review":"This film caught me by surprise on cable one night,  and I went out and rented it again to show my friends.  Eric Stoltz and Annabella Sciorra look gorgeous and have a wonderful chemistry together,  and Chris Eigeman (from 'Metropolitan' and 'Barcelona') is the perfect Brett Easton Ellis-esque foil.  It's rare to find a funny film about romantic jealousy,  but this is it.  Carlos Jacott just about steals the film with his impersonation of a British gentleman,  and the rest of the cast is superb.  The cinematography is sumptuous and the music is perfect.  A great date movie..","user":"karen-128","rank":[7,7]}]