[{"title":"Kill The Rats","rating":13,"date":"13 November 2004","review":"Sofia Coppola's 1998 short film \"Lick the Star\" is about a group of 7th grade mean girls who devise a bizarre plan to \"make the boys weak\" with arsenic. While that may sound strange, \"Lick the Star\" actually comes closer to the truth about junior high cliques than one might expect. Early scenes of the girls flaunting their new secret plan to the uninitiated are particularly powerful. <br><br>The short was shot at a real life junior high school and it shows, but its inky black-and-white visuals lend it a rather surreal beauty. That many scenes are accompanied by a fitting soundtrack of jangly girl-group rock is an added bonus. \"Lick the Star\" makes an agreeable 15 minutes or so, to say the least.","user":"sparklecat","rank":[14,14]},{"title":"A Small But Illuminating Short Film from Sofia Coppola","rating":8,"date":"20 October 2003","review":"While it's a small film often shown on IFC, \"Lick the Star\" is an excellent, illuminating film shot in black &amp; white by Lance Acord (who also worked with Coppola in her masterpiece \"Lost in Translation\" about a young 7th grade queen who becomes outcasted by her peers.  Like \"Lost in Translation\" and \"The Virgin Suicides\", the theme of disconnection is predominant throughout the whole film.  How a young girl is like a snob with all of her friends and one of them turns on her and in the process, things go to hell for the young woman.  The film has an excellent soundtrack as well.  For those who loved her full-length features, \"Lick the Stars\" is a must-see for any fan of Sofia Coppola who will be a director that will amaze us all.","user":"thevoid99","rank":[5,5]},{"title":"A fantastic b&w short","rating":10,"date":"13 July 2005","review":"As an avid watcher of IFC's Short Film Collection, I rarely see a short film that sticks with me after I have changed the channel. Sofia Coppola's 'Lick the Star' is the only exception to my nearly daily ritual. It is pitch perfect on showing the way teenagers lose interest in true friendship and begin sharing the same brain and thinking the same thoughts.<br><br>It's shot in a haunting black and white and uses a fantastic array of music that added to the emotion of the movie. Overall it was a great short film that would be great to own.<br><br>This film was made before Coppola won an Academy-Award winner but after her also disturbing-girl-coming-of-age story The Virgin Suicides. You can see the greatness of this film simply on how it's directed, with honesty and devotion that Coppola always brings to her films. <br><br>A must-see.","user":"MLCromwell","rank":[7,10]}]