[{"title":"Gripping Character-Driven Thriller","rating":7,"date":"12 June 2005","review":"When Carolyn Polhemus, a young prosecutor employed by the District Attorney of an American city, is found murdered, the job of investigating her murder is given to Rusty Sabich, one of her colleagues and her former lover. The DA, who is shortly coming up for re-election, wants quick results, but Sabich seems to be making slow progress. The DA is defeated in the election, and Sabich finds himself arrested by his successor and charged with the murder. The evidence against him initially seems strong, but more questions emerge during his trial. Is he really guilty? Is someone trying to frame him? If so, who? Was the murder connected to an investigation which Carolyn was pursuing into judicial corruption? Or was it connected to her complex sex life? We learn, through flashbacks, the story of her affair with Sabich and that she was promiscuous, sleeping with a number of influential men who could help her career, including not only Sabich but also the DA himself.<br><br>Besides being a legal thriller, \"Presumed Innocent\" is also a study in contrasts in character- either contrasts between two different persons or between the inner and outer person. Harrison Ford is often good at playing rather stolid individuals who have difficulty in showing their feelings but whose impassive exterior can hide powerful emotions. Norman Spencer in \"What Lies Beneath\" was one such individual; Sabich is another. Both are men whose life spins out of control after they become involved in extramarital affairs. Fortunately for Sabich, he has someone to take control on his behalf, his smooth and fluent defence lawyer Sandy Stern. Ford and Raul Julia, who plays Stern, form a double act in the second half of the film, both playing their parts very well. Sabich and Stern are both lawyers, but with very different characters and different approaches to the law. Sabich is determined to tell the truth as he sees it; the wily Stern sees the law as a game to be won on behalf of his client rather than a search for truth. If winning involves preventing the truth from emerging, so be it.<br><br>There is also a contrast between Sabich and his former lover Carolyn. While he is undemonstrative but inwardly emotional, she is outwardly seductive and flirtatious but inwardly cold-hearted. Both Sabich's wife Barbara, seemingly noble and forgiving, and the judge who tries his case, may have hidden secrets. Raymond Horgan, the DA, initially seems to be a friend of Sabich, but later turns against him when his self-interest dictates.<br><br>This concentration on character pays off, raising the film above the run-of-the-mill legal thriller. Contrasts between the various characters, and their inner conflicts, give rise to a gripping courtroom drama, one of the best in recent years. The pace of the film never flagged, and it held my attention throughout. The ending (which I will not reveal) has been criticised as either predictable or implausible. In my view it was perhaps unlikely, but neither completely unbelievable nor inconsistent with what has gone before. I certainly did not predict it. This is a tense and watchable drama. 7/10","user":"JamesHitchcock","rank":[49,54]},{"title":"Exciting Courtroom Drama","rating":8,"date":"28 February 2004","review":"This is a very good film centering around a murder investigation and trial involving a chief deputy DA and a beautiful, young attorney in his office who is found murdered one morning.  The direction, screenplay, and acting are all top notch and you never really know how it's going to turn out til the very end.<br><br>Harrison Ford is the deputy DA accused of murdering one of the female attorneys in his office.  Ford's character is that of a strident upholder of the law who strays into marital infidelity.  Caroline Polhemus, played by Greta Scacchi, is beautiful and manipulative, using her sexuality to get what she wants, career advancement and power.<br><br>Ford is assigned to head the murder investigation team, however, his boss, played by Brian Dennehy, loses his re-election bid a few weeks later and the new district attorney charges Ford with Caroline's murder.  He knows Ford had had an affair with the victim and has physical evidence that he was at the murder scene and had been placing phone calls to her apartment in the days prior to her death.<br><br>The continuing investigation by Harrison Ford's team of lawyers and his friends in the DA's office and the trial highlight the remainder of this film.  Events take strange twists and turns and the viewer is taken along for the ride without really knowing where it will take him.  The ending is a bit of a surprise and neatly ties everything together.<br><br>The direction by Alan J. Pakula is tight and suspenseful.  I thought it was his best film since the early days when he directed \"Klute\" and \"The Parallax View\" - certainly better than the muddled \"Pelican Brief.\"  The overriding theme of the movie is darkness, people hiding secrets from one another, and the direction emphasizes that.  There are very few outdoor daytime scenes and most of the interior shots are of dark rooms and corridors.<br><br>Harrison Ford is good in the role of the besieged deputy DA, but I thought the secondary actors were the ones who made this picture as good as it was. Raul Julia plays Ford's attorney defending him in court and he's excellent (I thought it was his best role in any film).  He's urbane and confident, and he steers the defense through a very difficult set of circumstances.<br><br>Bonnie Bedelia plays Ford's wife and her character is much more complex than that of the supportive wife standing by her man.  She also has dark secrets of her own and she plays the part with sly understatement.  John Spencer (\"L.A. Law\") plays an investigator in the DA's office helping Ford, Brian Dennehy plays Ford's boss who turns on him, and Paul Winfield plays the judge handling the trial, and all are excellent. <br><br>My only criticisms would come from Harrison Ford's character, who is so emotionally detached that it makes the circumstances of the affair with Greta Scacchi unbelievable.  He's not an easy person to identify with or feel sympathy for, but the film is so well done that you can easily skip over that void and just sit back and enjoy the performances.","user":"senortuffy","rank":[20,21]},{"title":"Presume Nothing","rating":8,"date":"1 June 2007","review":"From Scott Turow's successful novel came this tense drama about a man accused of the rape and murder of a legal colleague with whom he had previously had an affair.<br><br>Alan J. Pakula's direction, along with strong performances by Harrison Ford, Raul Julia, Bonnie Bedelia, Brian Dennehy and all the other supporting cast, contribute strongly to a film that keeps you guessing until the very end; which by the way, will shock the sox off ya.<br><br>This is a thriller that never gets out of hand, or goes over the top. All credit to Alan J. Pakula and Frank Pierson's adaptation. Great down to earth stuff.<br><br>Sunday, June 16, 1991 - Video","user":"gcd70","rank":[24,27]}]