[{"title":"I know I'm in the Minority When I Say That...","rating":8,"date":"1 March 2006","review":"I found this film much more fun and fulfilling than the first because of the addition of Jon Lovitz to the base cast. <br><br>I realize this goes against common opinion, but I believe this installment was much better executed. The first movie, when compared to this sequel, feels like the main characters had something to prove to one another and not just to themselves where this chapter feels more self-motivated and \"real,\" primarily to the addition of Jon Lovitz<br><br>One thing is for sure, without the City Slickers' version of the Criterion Brothers as ranch hands, it was definitely more enjoyable for me. The \"danger\" sequences were slim and short while maintaining a tall adventure.<br><br>Instead of using the first third of the movie to develop all the characters, they catch you up on Phil and Mitch and then lovingly introduce you to Glen. It left more time for the actual movie and less time for the \"you must grow up to be a warrior\" speeches and diatribes. <br><br>I loved it! Jon Lovitz is awesome!<br><br>It rates an 8.7/10 from...<br><br>the Fiend :.","user":"Elswet","rank":[24,27]},{"title":"Clueless Characters, But Funny","rating":7,"date":"21 March 2006","review":"I don't have a problem with sequels because many times I find them more appealing than the original. This is another example, although not a wide margin. The first was good; this is a little better.<br><br>Despite being almost two hours which is long for a comedy, this moves very fast. That's the selling point of the movie: it's entertaining. Not only do you get a comedy with a lot of laughs, you get brilliant Western scenery enhanced by the widescreen DVD.<br><br>The negatives, at least for me, was the all-too-secular outlook on life and an obsession with sex espoused by lead actor Billy Crystal and his clueless buddies Daniel Stern and Jon Lovitz and the unnecessary profanity by Jack Palance.<br><br>All the characters, however, are definitely fun to watch and there is a good message in the end about sacrificing for friends and relatives. The story also features a very neat twist at the end. This is a film you can laugh at with multiple viewings.","user":"ccthemovieman-1","rank":[18,26]},{"title":"pretty good; Palance gives another winning performance","rating":21,"date":"21 March 2004","review":"I don't know why it took me so long to see this sequel.  It has been so long since I saw the original that I can't make a comparison.  But Billy Crystal gave as good a performance as usual, and Jon Lovitz was a worthwhile addition as Crystal's idiotic brother.  Jack Palance gave another Oscar-winning performance as the sailor-turned-restaurant-pirate who hoped his late brother knew a big secret (too bad those who decide Academy Award nominations didn't agree).<br><br>It took a while to get to the quest for \"Curly's Gold\", but even the early parts of the movie were entertaining.  The search for gold was the best part, with these bumbling idiots, and Duke, getting into all kinds of trouble.  Plenty of action, and beautiful scenery, and lots of physical comedy.  I wasn't all that happy with the ending, but the reality is, can a group of ordinary guys really be happy if they find millions of dollars in gold? I won't say what went wrong in their quest, but they did get to be really, really happy at one point, and that was satisfying.<br><br>The real gold here was Duke's telling of his life story, and the guys working together despite incredible odds.  This was probably as good as the first movie for those reasons.","user":"vchimpanzee","rank":[6,8]}]