[{"title":"Why Mulan sticks out as a great Disney film.","rating":29,"date":"29 October 2004","review":"I was impressed by this Disney film for so many reasons, too many to list here, but I will go on the record as saying that Mulan has got to be one of the best Disney female characters that ever saw production, in the midst of a colorful and artistic film, that will resonate in your memory.<br><br>Mulan sticks out in my mind for this reason. For once, we have a strong female lead, or at the least, stronger than most of them. She isn't counted among the Disney \"princesses\" line-up. She doesn't want for herself, and she seeks to look deeper within herself to discover her inner being. She isn't like Ariel, who wants to be someone else. She isn't like Jasmine, who sits in luxury, waiting to be swept off her feet by Prince Charming, just like Snow White, Cinderella, Sleeping Beauty, and almost any female character that Disney brings to life. And while she does share some traits among this list, she stands out because she does something that these do not. She uses her mind. <br><br>Mulan, in fact, has more in common with male Disney leads than the female Disney leads. Mulan is a thinker, and a do-er. She's resourceful, like Aladdin. She is quick to act, like Eric (mermaid.) And she sacrifices herself for the sake of others, like Hercules. She also speaks her mind, even in a culture that does not allow such a thing. She doesn't waste time pining about \"will I ever find true love?\" Indeed, we see that she has an attraction to Shang (as he was her husband in the legends,) but we see her uncomfortable and unsure of meeting the Match-maker. She begs for her father's life when Chi-Fu came to the village. When you see her make her decision to take her father's place in the army, she does so out of her love for him, valuing his life above hers. She doesn't wish to become a man to see what it is like or for a change. Only to save his life. She later doubts herself and her reasons for going, but she did so because of her inner strengths, something other female Disney leads too often lack. (And it is these strengths that Shang is attracted to at the end.)<br><br>This movie also has a simple, but very effective villain, Shan Yu. Though not as memorable as Jafar or Ursula, he is more effective and more menacing because he is not fantastic. By that, I mean that he is not magical, he holds no special power. He is portrayed as a man, and as a man that could have truly existed, performing vicious acts that men do. We see the destruction that his army lays to a village, and when Mulan finds the doll, it shows that Shan Yu left no one living, man, woman or child. This is what makes him so effective as a villain, showing how truly human he indeed is. Granted, the producers did not develop him in any great depth, but they showed enough of him to remind us of his threat to China. Besides, sometimes the better villains are the ones you don't know too much about, or see a lot of.<br><br>Of the rest of the supporting cast, I will only mention four of them as being memorable in any real way. Chi-Fu, the emperor's consultant, was a reminder of the way many men looked at women in this culture. He thrusts his head up when Mulan begs for her father's life, and when she is discovered to be a woman, though she is a hero, he is quick to insult her, and to order her execution, simply because she impersonated a man. The other three were, of course, her comrades, Ling, Yao, and Chian Po. Though they were mainly comic relief (almost like a 3 stooges set,) they remained loyal to Mulan and trusted her fully, even after she was discovered. I like them, because they were not discriminatory to her in any way, even trying to stop her execution. When Mulan told them she had an idea to help the emperor faster, they were the first to her side, even when Shang was still reluctant to do so.<br><br>Overall, a wonderful movie to the Disney list. If you haven't seen it, then do so, you won't regret it.<br><br>And yes, Mushu was a cool character as well.<br><br>**** In Response to an earlier post by Phoenix-1 **** To expect any movie to accurately portray history in any way is lunacy. Even those movies that come close to historical accuracy are flawed in many ways. This was a way of telling a story, as any movie is. It can be argued that it tries to provoke curiosity in another culture, but it is also meant to entertain. I would also like to point out that Mulan is really not \"historical,\" like Joan of Arc, but rather she is a legend, much like Hercules and Aladdin, who also come from the realm of myth, stories and legends. And while there is some difference between the original legend and this movie, your examples of how Disney would butcher tales of George Washington and Abraham Lincoln do not compare to this story in any way. Your arguments for comparison should be better applied to Pocahontas, as she was an actual historical figure.","user":"Skeletors_Hood","rank":[205,220]},{"title":"The growth of the typical Disney heroine","rating":10,"date":"3 December 1998","review":"There are two things I love about this movie, aside from its stunning and beautiful animation.  One is that I love the fact that Disney is exploring legends from other cultures and I am so glad it brought us this one.  The other is that I just wanted to stand up and cheer at this great heroine.  I am a huge fan of Disney movies, but most of the heroines, while spunky, are still just your basic damsel in distress.  I loved Mulan's character.  She was strong, she was powerful, she could do anything she wanted, and she overcame much diversity.  I was thrilled to see the portrayal of a strong female character surviving because of her own integrity and strength rather than because of her looks.  Bravo, Disney, for bringing us this wonderfully progressive Chinese tale.","user":"Emma97","rank":[64,71]},{"title":"The flower that blooms in adversity is the most rare and beautiful of all.","rating":8,"date":"21 January 2006","review":"One of the reasons why I like Mulan so much, is because she is independent and braver than many of the female characters from Disney, who looks always to be searching for a man to be the reason for them to live or to be happy. Mulan is lovely, but also a tomboy what always gives her problems. Since the story takes place in a China of more than 1.000 years ago, women from that time, more than in the present days, needed to have an outstanding behavior all the time and with everybody.Being the only kid her parents had in a time where women didn't have many rights,Mulan is pressed to marry with a good catch. One day, she is going to see the matchmaker but everything goes wrong,since she is clumsy and not very graceful. Being accused that she '' will never bring honor to her family'', Mulan stays sad and depressed, and so stays her parents. But the chance to change that awful prophecy comes quick when the Emperor's men started to call one man from every family to serve in the Imperial Army: since Mulan's father was no longer young and healthy, Mulan reported to the army with a new name and looks. But she needed to make this a secret, because it was against the Chinese laws to a woman be a soldier, so, with the help of the dragon of the family called Mushu,one of the coolest adventures from Disney's starts.","user":"Lady_Targaryen","rank":[24,25]}]