[{"title":"A Quirky and Wonderful Slice of Magic & Youth","rating":28,"date":"28 September 2004","review":"Hi hi!<br><br>Danny DeVito touches on the viewpoint of children - and their imaginations - in this fantasy come to life: MATILDA.<br><br>Who of us as children didn't see the world in the powerful images of youthful, innocent eyes? The horrific Agatha Trunchbull, the kindly librarian, Mrs. Phelps? The annoying big brother 'Mikey', or the wondrous, perfect teacher, Miss Honey? Who of us as children didn't see that some things in life were wrong and wanted to put them right - if only we had magic powers!<br><br>Life as a child is fantastic and happy and exciting and scary. And in MATILDA we see all elements of childhood shine through by the intentionally ridiculous, over-the-top performances of Danny DeVito (Matilda's Dad), Rhea Perlman (Mom), and Pam Ferris (Ms. Trunchbull, the principal).<br><br>And yes, there is a scary element to the movie: The chase in Ms. Trunchbull's house; the \"Chokey\"; the spooky scene of Matilda taking back \"Lizzie Doll\" from Ms. Trunchbull while \"haunting\" her house. But this is the scariness of youth; shown from a safe distance for even the young audience. And despite the scariness - which kids KNOW exists - Matilda and Miss Honey and all their friends are victorious. Danny DeVito has demonstrated a lesson well-learned from the Disney animated films of yesteryear: The more evil the villain, the more noble and victorious the heroine.<br><br>To miss seeing MATILDA is to miss a heart-warming, hand-clapping, magical trip back to your childhood fantasies and ideals.","user":"RachelAnnPrellwitz","rank":[56,61]},{"title":"Utterly Fantastic","rating":10,"date":"24 March 2005","review":"This movie is an absolutely wonderful fantasy. I totally loved it.<br><br>The dialog is brilliant. The humor is both bold, and subtle. The characters are archetypal.<br><br>Matilda perfectly captures what it is like to be an intelligent person, trapped in the body of a child, and surrounded by idiots who control far too much of your life.<br><br>The notion that bad people (even adults) deserve to be punished for their evil ways (even by children) is truly subversive. Any child who suffered through the countless typical abuses of unthinking, uncaring, and ignorant parents will truly love this movie. Those same unthinking, uncaring, and ignorant parents will probably hate this movie, unless they are wise enough to see the truth behind the fantasy.<br><br>Despite the difficulties Matilda faces, like all good fantasies this movie has a wonderfully happy ending. I wish the same for all.","user":"richard-786","rank":[120,141]},{"title":"Americanized, but still good","rating":9,"date":"12 December 2002","review":"One of my most highly-anticipated films, 'Matilda' is both a treat and a disappointment. The casting of Mara Wilson as the title character is ingenious - the little girl exudes the qualities set forth in Roald Dahl's classic. Unfortunately, the filmmakers apparently could not resist the urge to alter the book, in which Matilda is British and lives in a small village. The movie version, of course, depicts Matilda as American, but what's worse, that she lives in a larger area. This detracts somewhat from the bucolic setting of the book, although not enough to create a starkly different environment.<br><br>The casting of Embeth Davidtz as \"Miss Honey\" was another great choice. While not what I had pictured from the book, Miss Davidtz captures the warmth and energy of the young teacher. Pam Ferris, as the grotesque \"Miss Trunchbull,\" is simply outstanding. Both her demeanor and her looks bring the book's character alive.<br><br>'Matilda,' while straying from the book's true form, is still highly enjoyable to watch, especially for those of us who have read the Dahl's masterpiece. Those who enjoy 'Matilda' should also enjoy the movie adaptation of ``The Witches,\" another Roald Dahl classic.","user":"Inliten","rank":[72,88]}]