[{"title":"Black Sheep? Not Quite","rating":6,"date":"22 July 2006","review":"Every horror series has a black sheep. \"Friday the 13th\" had the Jason-less fifth installment, \"Halloween\" the Michael Meyers-less third entry, and \"A Nightmare on Elm Street\" the silly first sequel. For many fans, \"Child's Play 3\" is the embarrassment of the Chucky saga. But why?<br><br>So many reviews of this film express exacerbation, even confusion, over the sudden shift eight years into the future. What's so hard to understand? We had already had two movies with Chucky chasing a little kid. It was time to move the story along, hence our hero Andy Barclay (Justin Whalin) is now a teenager at a military academy. This change of scenery was the breath of fresh air the series needed, as it opens up all kinds of new options to the murderous doll, which he fully exploits (paintball guns loaded with real ammo, anyone?).<br><br>Other reviewers complain this just isn't scary. There they have a point, but how many gorefests actually bring our hands up to our eyes? Scariness is a great complement, but that doesn't mean the whole project goes down the tubes without it. \"Child's Play 3\" has a smooth storyline, a touch of suspense and a truly memorable, original climax at a carnival (though it doesn't quite surpass the doll factory finale of the the previous film). Chucky's foul mouth begins to be a liability rather than an asset, but we can cut him some slack -- he's certainly never looked better (or more realistic).<br><br>\"Child's Play 3\" does have its ups and downs, however. The romance between Andy and a fellow cadet is a distraction, and there are times when our plastic star just seems brushed aside in favor of more serious moments. Chucky's desire to swap souls with someone other than Andy is a welcome change, but his new target, young Tyler, is one dimensional and uninteresting. He's unable to carry his scenes like Alex Vincent, who played child Andy in the first two films.<br><br>As far as I'm concerned, this was the last of the true \"Child's Play\" films. Once this one was done, the series became a shameful, hokey parody of itself. This entry is by no means perfect and it's certainly not up the caliber of \"Child's Play 2\". Yet it's not the piece of trash so many would have us believe. In fact, it may just be one of the most underrated theatrical horror films of the early '90s.","user":"ReelCheese","rank":[46,55]},{"title":"Child's Play 3","rating":18,"date":"18 July 2013","review":"Another hit classic thriller/horror film into The Child's Play Series. Child's Play 3 was a amazing comeback. The film is about Chucky who returns again as a doll after being possessed by a serial killer. He goes to search for Andy Barclay who has enrolled in a Military School, he is now a teenager. Chucky's plan changes when he meets a younger boy named Tyler he tried taking over his soul, but Andy will do whatever it takes to stop Chucky before he transfers his soul into the innocent Tyler.<br><br>After hearing about Child's Play 3 long time ago I thought that they were going to re-cast Alex Vincent in this one when he became a teenager because Alex Vincent always shined in the originals. We wanted to see the story continue with Alex Vincent, but after seeing Child's Play 3 it was too bad. The film had great performances by Justin Whalin who starred as Andy and Jeremy Sylvers was great starring as Tyler. The film was another Horror hit classic and Brad Dourif did great again playing the voice of Chucky.<br><br>The film had different plot points and all new cast. Child's Play 3 was good into The Child Play Series. I recommend this one to everyone as well. Child's Play and Child's Play 2 with Alex Vincent amazing horror classic. Child's Play 3 another great horror comeback.","user":"ChrisOfficial","rank":[9,9]},{"title":"My favorite of the series for some reason","rating":9,"date":"7 March 2008","review":"I'm going to comment hell for this one. This comment will most likely receive a very low \"useful\" rating, but I'm OK with that. This movie was quite possibly my favorite of the Child's Play series. And although you will probably not agree, you will see what I mean:<br><br>This movie takes place 8 years after the previous. Andy is now a teen and has been sent to a military academy. And guess what: Chucky decided to tag along. This makes for a great story. Chucky really shows his true colors and sick, twisted sense of humor here. We also have an interesting group of characters here, who are actually worth mentioning. We have Andy of course, we have Tyler, a young cadet who catches Chucky's eye as a replacement of Andy; there's DeSilva, a tough girl who has a soft spot for Andy; we have Whitehurst, an outspoken, nerdy type who quickly befriends Andy; we have Shelton, a military-loving, tough, intimidating young man who has it in for Andy; and we have Botnik, an older guy, the barber who loves his job just a little too much. Together with these great characters is a great setting. There are some very interesting kills here which I have not even thought of or seen in any previous film. I do not understand why this movie is so underrated. Is it because of the time lapse? Maybe because Andy's not a kid? New setting? No matter what the reason, this movie deserves much more than a 4.1 rating (as of 3/7/08). I say it gets 9/10. Fans of the first 2 films will not want to miss this.","user":"emperor_bender","rank":[41,51]}]