[{"title":"good old fashioned ripping yarn","rating":7,"date":"16 December 2004","review":"I watched this movie on TV last night and found it great fun.In the best sense of the word.<br><br>Old fashioned film making, good guys and bad guys, clearly defined and a good tale, well told. OK there were flaws in there also(mainly the interior set pieces which look like sound stages), but they should be overlooked, as its not a serious film and is not pretending to be anything other than it is. Its a fantasy/adventure film, in the best tradition, the kind they don't make anymore,no special effects, to speak of, but good action, wonderful locations and some good acting, for this genre. <br><br>I expect in this day of high tech special effects, it may seem less alluring to the more high tech minded but if your looking for some good old fashioned fun, this is one to watch. Not my favorite film, by any means but worth a look and deserves more than 5 out of 10, I give it 7 and hope somebody enjoys it for what it is, rather than what they feel it should be.<br><br>A film for the family to enjoy on a rainy Sunday afternoon.","user":"lindaochopper","rank":[95,104]},{"title":"Heroism Is Now Fantasy (and that's just unrealistic!)","rating":10,"date":"9 January 2006","review":"It's hard to believe that a movie that so hits the mark set by its original intentions can receive some of the stupid, silly and brainless reviews seen in these pages. This is a movie based on the original comic book hero, so yes, we have a character in a costume. If that's a problem for you because it's \"unrealistic\", well what would be realistic for you? Lots of blood, sex with movie-star-hot men or women, big explosions, exit wounds? Lots of that in your everyday life, I assume? And yes, a lot of fantastic, unrealistic things happen in this film, which may also pose a problem for you if your sense of wonder is limited to things like who is going to win the next Survivor. Yet all of these fantastic unrealistic things are all directly related to the concepts of heroism and villainy.<br><br>This entire movie is about heroes and villains, right down to the cab driver. It is not about how Billy Zane looks in purple spandex, or how hot the female leads are, or how much you hate Treat Williams' over-the-top performance, or how you think it \"rips off\" Indiana Jones (funny, I'm pretty sure Jones was a nod, in part, to the Phantom!). If these are your only reactions after watching this movie then you have indeed wasted your time. Fortunately, time like yours isn't very valuable when you would probably rather waste it spending days playing the next version of Grand Theft Auto.<br><br>The Phantom revisits the concept of heroes. I'm not talking about people like Vin Diesel, Pamela Anderson, 50 Cent, or this year's American Idol. Heroes are people who have character, integrity, morality, and courage; people who stand for, and stand up for, what is right. With so little of this in the world around us today, I guess it's not surprising that so many people have a problem with the concept. These days the hero is the person who can kill the most opponents (I can't call them \"bad guys\" here), screw over the most people, get the most toys, or have sex with the hottest hotties. Basically, we now equate heroism with personal gain and success.<br><br>The Phantom, like all true heroes, does what he does because it is the right thing to do, not because he stands to gain from it. He is capable of performing selfless acts that can make a difference for the better, and on top of that, he does so anonymously! How often do you see that in today's society? Drax is a villain because he is the villain, not because we see him slaughtering innocents or committing some other purely evil crime. We don't need to see Singh's band blow up a ship full of people with body parts flying in slow motion to understand they are also villains. It might require a bit of imagination, which also seems to be in short supply these days, but the idea is that they are as bad as you can imagine them to be. Once again that sense of wonder has to come into play. The only thing I'm left wondering is how anyone who sat down to watch this movie couldn't have known this.<br><br>In a nutshell: The Phantom is a comic book character movie wherein the hero wears a cool purple costume and performs fantastic acts of heroism, gets the girl of his dreams, and defeats evil by being a paragon of virtue and valor. It is fun for all ages; the six kids that sat in front of me at the theatre had a blast, and my mother likes it too. The character's creator apparently approved of this film despite its slight deviations from the printed version. And I give this movie with heart and soul a 10 out of 10.","user":"woody0023","rank":[126,146]},{"title":"A pleasant surprise","rating":8,"date":"18 March 2005","review":"This 100-minute nugget of superhero charm was a lot more fun than I had expected. I subscribe to Netflix, the mail-in rental service, so I had forgotten which movie I had coming next. I groaned slightly when I saw The Phantom was it.<br><br>I started watching, feeling that I was going to be in for a dud. About a week ago, I rented The Rocketeer---a mildly entertaining movie with some good moments, but didn't really add up to a DVD purchase or repeat viewings. I thought I was in for more of the same, but alas. <br><br>The Phantom had all the charm, action and humor missing from Rocketeer.<br><br>I particularly enjoyed the two leads. Billy Zane delivered the one-liners with aplomb. He has the swagger, voice, demeanor and charm to carry the role successfully. He transcends a rather mundane superhero outfit. Treat Williams gave an amusing turn as the villainous Xander Drax, (\"Starts and ends with X.\") Not the typically evil superhero nemesis, he's more of a lighthearted villain in the \"Gene Hackman as Lex Luthor\" mold, but his line delivery is spot on.<br><br>The movie definitely comes alive with the characterizations, a feel of a time and place early in the 20th century, and always on the move, but not too much in a hurry to make you enjoy these characters. I rather liked the idea of a superhero with a pet horse and wolf.<br><br>I'm not sure I've seen a recent superhero film that strikes a perfect balance of action, humor, sets and characters. Enough humor to keep me smiling throughout, but mildly serious enough to engage me for the duration.<br><br>Definitely worth a look for those who haven't seen it, and a future addition to my DVD collection.","user":"konover","rank":[76,89]}]