[{"title":"Walk on the wild side","rating":8,"date":"11 July 2004","review":"Whats not to like about this movie? Well, the violent and the dark, at times manic context which prevails in a good share of the scenes, together with the perversity thats being thrown at you in the most unsubtle way. Nick Nolte's Brennan must be the most foul,intimidating and maniacal cop figure ever portrayed since Orson Welles' Captain Quinlan in \"Touch of evil\". He pulls off a great performance, although not very pleasant to watch (nor listen, for that matter).<br><br>Whats there to like about this movie? For one thing, there is Armand Assante and what most likely is the role of his career, even if its a supporting one and he gets only a couple scene stealers. He demonstrates how great he can be if given the right part. And his role is very interesting, an archcriminal with feelings, brought out by a woman who may not even love him.<br><br>Jenny Lumet was also good in her role, although I missed more interaction between her and Assante's character. Timothy Hutton, although overshadowed by Nolte and Assante in turns (inevitable really), proves again that he is a solid actor.His performance is not spectacular(as the role doesn't allow it), but its worthwhile. Another great presence by Patrick O'Neal as the sly and cunning district attorney with a criminal past and ties to Bobby Texador(Assante).<br><br>Sidney Lumet is the master of socio-political drama/comedy/thriller. Here he mixes all three into an enjoyable, intriguing and satisfactory work. This film deserves more attention than I believe it got. But again, looking at its \"walk on the wild side\" perspective, it really couldn't have become a blockbuster hit an average person chooses to watch on video or DVD on a Saturday night.","user":"ereinion","rank":[25,28]},{"title":"In Defense of Jenny Lumet","rating":8,"date":"4 May 2002","review":"Many reviews here have trashed Jenny Lumet's acting in this film and I want to go on record saying that I thought she gave an above average performance. I know, she's the director's daughter, but I think she more than holds her own opposite the likes of Timothy Hutton and Armand Assante (she doesn't have any scenes with Nolte).<br><br>Lumet plays a girlfriend from Reilly's (Hutton) past.  Reilly dated her when he was a beat cop and has since risen to Assistant DA.  When the film begins it has been 6 years since their break-up and she strolls into a tense interview session on the arm of notorious drug czar Bobby Texador (Armand Assante).  Obviously shaken by her involvement in the case, Reilly attempts to talk with her about their past.  I think Lumet is quite convincing in her scenes with Hutton: wrenched emotionally as she kicks him out of her mother's apartment and touching as she discusses their failed relationship. She's no Meryl Streep, but she effectively conveys the anguish of a young woman forced to re-visit her painful past.<br><br>Nolte is incredibly powerful as rogue cop Mike Brennan, a brooding, unstoppable evil force unlike any other character Nolte has played.  His Mike Brennan is a distant cousin to Denzel Washington's Oscar-winning performance in \"Training Day\".  Assante is nearly perfect as the menacing-yet-philosophical drug lord Bobby Texador.  One of my favorite aspects of this script is the multi-faceted nature of Assante's character. Audiences aren't usually asked to identify with drug dealers, but Lumet's script and Assante's performance make Texador into more than just a one note crook.  Both he and Nolte were Oscar-worthy, yet neither was even nominated (Jeremy Irons and Joe Pesci took home the male acting Oscars in 1990).<br><br>My only criticism of the film is the way racial and ethnic stereotypes are forced into almost every scene: the hard-drinking Irish cop, the Italian mobsters, the shyster Jewish lawyer, the street-brawling Puerto Rican gang members.  Maybe Lumet had a point to make by concentrating so obsessively on his characters' ethnic origins, but it seems like over-kill.  Despite this flaw, Q&amp;A is still an absorbing and powerful film.","user":"ProfessorFate","rank":[21,25]},{"title":"New York Confidential","rating":8,"date":"17 November 2005","review":"Guess the film from the following description of its characters. A young man investigating misdeeds in the police force, motivated by the memory of his father (a legendary policeman) but also by the pain of having lost the affections of a woman he loves to another player in the drama. A renegade cop, rampaging violently through the city, but revered on the force for standing up to the scum on the streets. And the renegade's boss, who protects him, partly because he himself is on old-school Irish policeman; but partly because he appreciates having his own private bag-man, especially in his dealings with organised crime. Throw in some prostitutes for a little background colour, and it sounds like a perfect description of 'L.A. Confidential'. But it also describes this tough and underrated movie made by Sidney Lumet some years before Curtis Hanson's film.<br><br>Whereas Hanson's film was stylised, and glamorised violence (provided the cause was just), Lumet has gone for a more realist approach, and his bad cop (played mesmerisingly by Nick Nolte) is completely rotten, in fact resembling Harvey Kietel's 'Bad Liutennant' in Abel Fererra's movie. The film is dated by its ghastly electronic soundtrack, and more interestingly by its portrait of New York at a time when the city was at its lowest ebb. But it's a very well assembled thriller, exploring issues of race, mixed loyalties and the meaning of good policing without flinching from a grim picture of life on the margins of law abiding society. Lumet has had a long career, but this is one of his better films, and ultimately more truthful than Hanson's stylish charade. Each are good, in their own way: why is only one so appreciated?","user":"paul2001sw-1","rank":[23,29]}]