[{"title":"Every Little Bit","rating":10,"date":"1 January 2005","review":"Over the years this little gem of a film has become a personal favourite. I revisit it continuously, I enjoy showing it to someone who never heard of it and it never fails. The emotions are renewed and reinvigorated with each viewing. Jesse Bradford is simply phenomenal and so is Adrian Brody, yes him, \"the kissing pianist\" in a remarkable early performance. The face of Karen Allen, as the teacher, listening to Jesse Bradford read his tall tale, profoundly aware that she has someone truly special in her class, is so beautiful that goes in an out of my memory bank more often than the names of some of my closest relatives. Spalding Gray and Elizabeth McGovern's characters deserve a full movie of their own. Lisa Eichhorn's tender fear of having to leave her children behind is just another of the ravishing notes of this stunning film. If you haven't seen it. Give yourself the pleasure. You are going to love every little bit of it.","user":"don_agu","rank":[78,82]},{"title":"The best American film of the nineties","rating":10,"date":"16 February 2002","review":"Without a doubt, I would argue King of the Hill to be the best American film of the 1990's above any other American film you can think of.  The subtlety of the performances and the evocative production design pull you into the carefully constructed world of Aaron Kurlander, building the right level oh humour and drama, and never allowing it's self to become bogged down with tacky sentimentality.  Steven Soderbergh really out-did himself with this one, and it's by far the best thing he's done, you can forget the overrated, over-hyped Oscar nabbing rubbish of Traffic, this showed a young director willing to experiment with tried and tested film-making techniques and find the right visual language for the film. King of the Hill is a film that is so deliberately paced, and so elegantly put together, that at times it's as though your not watching an American film at all, there is such a European atmosphere that it seems out of place with some of the other U.S. film released in the same year (Jurassic Park, Mrs Doubtfire and Cliffhanger being just three of the top grossing movies of 93).   <br><br>\nSo is it any wonder that King of the Hill failed to set the box office alight with popcorn based seat fillers like that, I mean, who wants to see the story of a young boy coming of age under the harshest conditions when you can see Robin Williams vacuuming in drag to the sounds of Aerosmith. Yeah, sounds like a safe bet for all the family.  But King of the Hill is such a good movie, that the hard-to-describe plot should be overlooked, and people should just give it a chance, they will be so moved by Aaron's plight, and so drawn in by Soderbergh's direction (coupled with Elliot Davis' composition heavy cinematography) and detailed production design that they will not be able to pull themselves away.  Added to that the great acting from the entirety of the eclectic cast, that includes Jeroen Krabbe, Spalding Grey, Elizabeth McGovern, Karen Allen, new comers Jesse Bradford and Cameron Boyd, and (then) unknowns Adrien Brody (who was great as Ritchie in Spike Lee's Summer of Sam) and Roswell star Katherine Heigl. Soderbergh's handling of his young actors is nothing short of genius, their characters and characterization is multi-layered to the extent that we never doubt that their characters are real.   <br><br>King of the Hill is an unbelievable film that, as I have already said, is (in my opinion) the greatest American film of the nineties and should be seen by everyone who is a fan of not just intelligent cinema, but film lover's in general.  And it's about time the film got some kind of proper video and/or DVD release, as it's unavailability is scandalous. 10/10","user":"AdFin","rank":[48,54]},{"title":"This is not Norman Rockwell's America","rating":9,"date":"5 December 2006","review":"I can recall first seeing \"King of the Hill\" shorty after its initial release when I wasn't much older than the main character, Aaron (Jesse Bradford, who displays the natural swagger of a young George Clooney here). I was totally enthralled by the story, and this was one of the pieces that ushered in my complete love for and eerie obsession with Depression Era America.<br><br>Steven Soderbergh as a director over the years has been wildly all over the map traversing genres and styles from top-notch cracker-jack indie flicks (the superb \"Limey\") to vapid star-studded populist entertainment (the \"Oceans\" series) to entertaining star vehicles (the excellent \"Erin Brockovich\") to overblown misguided message movies (\"Traffic\") to Kubrickian quandaries (the unfairly maligned \"Solaris\"). In 1993, still in his formative early years, he hit all the right notes with his vividly detailed and heartbreaking tale of a young boy (Bradford) abandoned in a sleazy hotel room on the edge of a Hooverville in 1933 St. Louise by his flaky salesman father, consumption riddled mother, and little brother who got shipped off to live with relatives so he wouldn't starve to death. The boy lies, steals, woos girls and wins academic awards at school propelled only by his keen wit and innate will to survive. Soderbergh brilliantly abandons almost all sentimentality (the exchanges between the brothers are heartfelt but raw, between mother and son tragically subdued, and between father and son frightfully cold yet honest) and views not the actions of the characters through the lens of our modern moral codes, but through the lens of the era in which the characters survived.<br><br>Special note has to be given to the cinematography, which in lesser period pieces can so easily succumb to stylish excess. The film looks real and puts you right there in the middle of this American quagmire. There's also one amazingly rendered shot of a traffic cop holding up a squealing street urchin by the ear after capturing the boy stealing an apple that is so painstakingly lighted and framed that it serves as the complete flip-side of your classic Norman Rockwell painting from the same era.<br><br>Viewing this film recently on cable, I was even more transfixed than the first time over thirteen years ago. There's also delight to be found in seeing Oscar winner Adrien Brody in his first major role as Aaron's \"big brother\" role model, and Grammy winner Lauryn Hill in a nice bit part as a sympathetic gum-chewing elevator operator.<br><br>Although historically little seen, this film has been universally lauded, and as the early masterwork of an Oscar winning director, it's a crime that there has been no DVD release.","user":"WriterDave","rank":[21,23]}]