[{"title":"Yet another great Ken Loach film.","rating":8,"date":"2 July 2002","review":"Yet another great Ken Loach film. It begins as a somewhat gritty comedy. Bob (Bruce Jones, aka Les Battersby) and his mate Tommy (Ricky Tomlinson) are out of work and desperate for money. They decide to capture a sheep, and sell the meat in the local pub. They also go and steal the turf from the local Conservative Party club grounds (if anyone deserved it then...!).<br><br> The heart of the film, though, is Bob's desperation to get the money together to pay for his daughter's Catholic Communion outfit. He ends up borrowing money from the loan sharks, and things begin to go downhill. There is one scene, where a loan shark \"pays a visit\" after Bob misses his payments. Bob is out, but his wife and daughter are in. There is no serious physical violence in this scene, but plenty of verbal threats. For me, this is one of the most menacing scenes in film I have seen in years. Loach directs it to perfection.<br><br> As often with Loach, behind an ostensible political message, lies a complex moral analysis of real people's lives, handled with great sensitivity.","user":"mob61uk","rank":[16,17]},{"title":"When you are a worker, it rains stones seven days a week.","rating":8,"date":"29 March 2013","review":"Raining Stones is directed by Ken Loach and written by Jim Allen. It stars Bruce Jones, Julie Brown, Ricky Tomlinson, Tom Hickey, Mike Fallon and Jonathan James. Music is by Stewart Copeland and cinematography by Barry Ackroyd.<br><br>Northern England and as unemployment bites hard, Bob (Jones) frets about finding the money for his daughter's communion dress...<br><br>It's classical Loach, an awareness of the lower to working class lifestyle during a politically turbulent time. As is the great director's want, realism leaps out from every frame, earthy humour is evident and Loach draws you into his kitchen sink world with ease. Raining Stones has no political agenda as such, it's primary focus is the people, specifically examining how a basically honest hard working man has pride in abundance but little brains in accompaniment. And we all know what pride comes before...<br><br>The structure is simple, an hour of film lets us know the principal players, their surroundings and their beliefs. Humour dominates the narrative at this point, be it nutty ideas like stealing a sheep off of the Moors to sell to the butcher - Bob's date with a sewer drain - and Tommy (Tomlinson) showing his ass and genitals to an overhead police helicopter! There are scenes and snatches of dialogue that genuinely bring the laughs. Yet lurking in the background is the palpable sense of things about to turn bad, which is the case of course, and the film shifts for its last third into dramatic thriller mode.<br><br>Religion is a feature, but again it's not something that Loach wants to use as a tool for head beating. In fact it's refreshing that the portrayal of Father Barry (Hickey excellent), who is the glue that binds his unemployed flock together, is not about pious pontificating, he's very aware of the times and happy to share a glass of whiskey with Bob and offer up some surprising advice. Cast performances are across the board great, something which is another trait of Loach's direction, while Ackroyd's photography around the Middleton, Rochdale locale is suitable stripped back to reveal a climate of struggle.<br><br>A must for anyone with a kink for Loach's type of story telling, Raining Stones is another fine entry on his considerable CV. 8/10","user":"hitchcockthelegend","rank":[9,9]},{"title":"A natural and convincing story about the traps of poverty and the spirit of the poor","rating":4,"date":"4 August 2006","review":"Bob Williams is one of many unemployed in his area and faced with doing cash-in-hand work and odd jobs to keep his family's heads above water. Regardless of his and his wife's hardships they are both committed Catholics. His daughter is having her first communion and Bob wants her to fit in with the others  meaning a new dress and shoes which will total about £100. His attempts to raise the money mostly brings very small reward and frustration. Meanwhile his luck runs nothing but bad and his van is stolen  limiting his ability to pick up jobs and get around. As his debts rise, so do his troubles and his desperation.<br><br>The type of film that Ken Loach made his name directing, this film is a touching and natural ode to the spirit of the poor man. The plot is not so much a typical day in the life as a dramatic piece that follows the downward spiral of Bob as a representation of how life on the breadline is one challenge after another. In Bob's life an one-off expense of £100 is a major incident to be gotten through rather than the inconvenience that it is for the majority of us. The film does a very good job of portraying it  it isn't a film noir descent into crime but rather just the spirit of a man fighting to pay the bills. Most of us will have had this at some point but few of us can relate to those that get by daily on odd-jobs and going door-to-door; however the script here lays it out convincingly and naturally, easily allowing me to get into the lives before me. In this regard it is impacting because the humour and desperation of the people is convincing and their day-to-day situation dire.<br><br>The cast all take the material and run with it and there are few here that I didn't totally believe. Jones wears the character like a second skin and fits into it really well. His desperation is well complemented by Tomlinson who adds the comic spirit to the bottom classes. The rest of the cast are solid despite not having the limelight in the same way. Brown is good despite having the very occasional rare moment. Phoenix is sweet and natural and the rest of the cast feel mostly real. Loach's direction is grainy and fits the world his story is in.<br><br>I hate to use the words over and over again but this is a convincing and natural story and it is touching and engaging as a result. It does a great job of capturing the spirit of the poor, making the best of what they have  but not ever ignoring the fact that Bob et al are the type of shifty people who you wouldn't want to mess with.","user":"bob the moo","rank":[13,14]}]