[{"title":"A good ride, good actors, some flaws.","rating":8,"date":"1 February 2001","review":"Last week, as I considered ordering this DVD, I checked the IMDB rating and saw a \"fair\" 6.5.  Since I like Tommy Lee Jones and Samuel L. Jackson, I placed the order. Like most roller coasters, I found it to be a good ride and Jones and Jackson did very credible jobs.  The flaws in the movie have been correctly pointed out by numerous other reviewers.  I was somewhat surprised that some of the most critical reviews were by US viewers.  I fully understand how non-US citizens would be irritated by the stereotypes. I found it to be a very exciting movie from my particular perspective (US citizen, military family, male over 45). The scenes of combat when the marines are ordered to the US embassy in Yemen to safeguard our state department personnel were VERY well done, even to the point of gripping.  The court scenes and conflicts of evidence or lack of evidence were interesting to me and I also understood, but did not agree with, the aims of the State Department.  I don't think some of the reviewers are aware of what a person might do in such an extremely stressful situation as that of Colonel Childers (Jackson).  It was fascinating to me to see what he did do and how he and others looked back on it.  I would have given Rules of Engagement a 9 or 10, but for the flaws. It's a good movie though and well worth renting.  It's an 8.","user":"moviecat-6","rank":[68,98]},{"title":"One wonders what the reviews would be if this were released today","rating":6,"date":"21 December 2016","review":"\"Rules of Engagement\" is NOT \"A Few Good Men.\" But it is also not the travesty that many reviews have made it out to be. The film was released in 2000, prior to the events of 9/11/2001 in New York City. Much has transpired since then, and Americans are slowly coming to the realization that, while not all Muslims hate us, the haters are all Muslims. And that is becoming increasingly significant, especially given the results of the 2016 election. \"Rules of Engagement\" takes a crack at explaining how difficult it is to fight Muslim extremists, whose tactics violate all the \"rules\" of warfare. Muslim extremist gunmen constantly use \"innocent\" civilians as shields, knowing full well that American troops will find it difficult to shoot back. \"Rules of Engagement\" revolves around this dilemma. Considering when it was produced and exhibited, this was not destined to be well received. Screenwriter Stephen Gagnan and story writer Jim Webb (yes, that Jim Webb) are not fanatics; their resumes show them both to be thoughtful and respected. It is unlikely they would be telling a story they did not believe in, just as director William Friedkin would not be bringing it to the screen if he did not believe it had a valid point to make. Before 9/11, the pacifist persuasion in the United States was imposing a heavy hand of deterrence on the American military. \"Rules of Engagement\" basically advocates that the enemy has to be taken out, even if it means collateral damage. Of course this elicited hoots of derision in 2000. A year or more later, with a lot of collateral damage in downtown New York, the reaction would undoubtedly have been much different. Many reviews have pointed out inconsistencies, factual errors, glib script devices, even casting anomalies. True, but inconsequential. \"Rules of Engagement\" is intended to point out the folly of the United States' approach to its enemies in a war unlike any other - a war we are still fighting 16 years later. It made its point, just a year too soon.","user":"mharah","rank":[17,23]},{"title":"Excellent Movie","rating":10,"date":"11 August 2014","review":"After serving a career in the Military, I definitely relate to every soldier in the story. I consider this a very honest portrayal, especially civilians misunderstanding the reality of 'Rules of Engagement'. <br><br>These previous reviewers have no concept of the reality of combat:<br><br>A Flag is more important than Marine's life ? (This person should read about Francis Scott Key, Ft McHenry and those who died to keep the flag standing) http://www.historybuff.com/newsletter/july08.html<br><br>The ending was absurd! (\"The Corps, the Corps, the Corps\" - not understood by civilians.<br><br>Propaganda at its best (Closer to truth than you know..!!)","user":"dighambara","rank":[15,20]}]