[{"title":"A decent spy yarn but falls far short of the true story","rating":5,"date":"29 October 2003","review":"A couple of years ago PBS aired a 2-hour episode of Nova (the American equivalent of the BBC's Horizon) called 'Decoding Nazi Secrets.' It was a fascinating documentary about the work done at Bletchley Park, as well as some material about its American counterpart, Arlington Hall. I had wished it was even longer, for I suspected that what was left out was as interesting as what was included. Among the many memorable characters in the story, none stood out more than Alan Turing, a painfully shy, socially awkward, utterly brilliant genius. I found myself wishing that someone would make a theatrical film about the Enigma code and a film of Alan Turing's life, or both.<br><br>Unfortunately, this isn't it. In March of 1943, code-breakers at Bletchley Park discover to their horror that the German navy has changed the code sets used to communicate with U-boats at sea. These were based on the famous and diabolically complex encryption machine known as the Enigma. Authorities enlist the help of a brilliant young man named Tom Jericho (played by Dougray Scott) to help them break the code again. The possibility of a spy within the British code-breakers' ranks is raised, and Tom's love interest, Claire (Saffron Burrows), has disappeared. To solve these mysteries, Tom recruits Claire's best friend, Hester Wallace (Kate Winslet). While investigating Claire's personal life, the pair discovers personal and international betrayals involving the now-infamous Katyn massacre in Poland. Of course, Tom and Hester fall in love.<br><br>Dougray Scott actually does bear some physical resemblance to Alan Turing, but there the comparison ends. Turing's sorry, shabby reward for the instrumental role he played in winning the war for Britain was to be persecuted during the Cold War because his homosexuality was viewed as a security risk, to the point that he committed suicide. While 'Enigma' looks good and plays fairly well as a decent espionage film, the viewer who knows the factual background of this piece of fiction will probably be disappointed. The best part for me was the recreation of the physical setting at wartime Bletchley Park, especially the Enigma machines themselves and the famous Bombes, which were invented by Turing (Jericho in the film). These were among the world's first computing machines; they were a stroke of brilliance by Turing: Instead of looking for what a coded message WAS, they operated according to the principle of eliminating what it was NOT. This cut the number of possibilities by better than 90% and greatly simplified the work of the human code-breakers. It is somewhat surprising that this rather wan film is the work of Tom Stoppard and Michael Apted; they have done better.","user":"mfisher452","rank":[83,112]},{"title":"Not a war movie for the masses","rating":8,"date":"10 April 2005","review":"'Enigma' is the kind of war movie that may not be loved by many people, mostly because there isn't much of action to be seen in it. At least, not the kind of action they would like to see: no heroically fighting soldiers, no breathtaking dogfights between the RAF and the Luftwaffe... But people like me, who are deeply interested in every aspect of the Second World War and who can appreciate a good story, certainly will love it.<br><br>It's March 1943 and the crypto-analysts at Britain's code-breaking center have discovered that the German U-boats have changed their Enigma Code. At first the English were able to read all their messages, but now they are back where they first started ... nowhere. Their only hope is the brilliant young man named Tom Jericho, who was able to crack the first code and who'll now have to do the same with the new one. In the meantime Tom's girlfriend Claire has disappeared and at the same time it is believed that there is a spy in the ranks of the code-breakers. When looking for his lost girlfriend and investigating her personal life, he uncovers some personal and international betrayals...<br><br>However it is clear that the main story of this movie is fictional, the entire movie is certainly interesting to watch. I mean, I have never had the chance to see how this enigma machines really worked, so I really appreciated the fact that it was shown so well in this movie. What I also liked in this movie was the love story that certainly wasn't too corny or overwhelming. It was an interesting part of the story that never bothered me, it just made the movie even better. <br><br>As I already said, this may not be the kind of war movie for the masses, but I liked it and that's why I give it at least a 7.5/10, perhaps even an 8/10.","user":"philip_vanderveken","rank":[52,68]},{"title":"Nutritious whole brain entertainment for the mind","rating":8,"date":"25 September 2002","review":"\"Enigma\" blends fact with fiction as it tells a carefully crafted story about the unseen and unsung heros of British WWII code-cracking who decrypted the infamous \"Enigma\" code which Germany used to command it's U-boat armada in the North Atlantic putting allied convoys in peril. With plenty of history and super-secret code cracking to feed the left brain and a dramatic tale of a top code-cracker and his surreptitious affairs of heart and mind for the right brain, \"Enigma\" has something to offer everyone. The film manages it's intricate plot well, offers solid performances, blends intrigues with lots of WWII crypto-speak, and moves along swiftly while staying real and avoiding the usual excesses of filmdom. A smart flick for smart minds. (B+)","user":"=G=","rank":[52,72]}]