[{"title":"A Sensual Movie With A Difference","rating":10,"date":"5 February 2000","review":"It's not often I get to see a movie like this.  The story of L'Amant potrays a most complex and provocative relationship between a young French girl (Jane March) and a Chinaman (Tony Leung).  The two lovers' attraction towards each other are purely physical, but there are a lot of psychological burdens and suffering that they can't break free from, since the two of them are psychologically washed-up people who lives within the shackles of society that they live in.  At times they treat each other cruelly while at times they treat each other with tender affection, yet we don't know whether they feel true love for each other or not.  That's where the story gets very interesting and different.<br><br>The sex scenes are indeed graphic, but by no means done in bad taste or just for the sake of sex.  The film is much more than about lust, it is about two lovers who found refuge in each other's arms.  Jane March and Tony Leung gave great performances, showing the subtleties of conflicting emotions that they had to endure.  Beautifully paced storyline with great atmosphere and soundtrack will make this a worthwhile movie experience. Very highly recommended.","user":"Dark Eye","rank":[85,91]},{"title":"One of the greatest films about sexual awakening","rating":2,"date":"2 June 2000","review":"Based on the semi-autobiographical novel of Marguerite Duras, who was born in French colonial Vietnam, this film chronicles the sexual awakening of a young French girl who falls passionately in love with a Chinese scion of a rich trading family who have his marriage already arranged. They make love passionately in a way which more truthful than is usual on the screen. This film is intensely visual, written by a major French script writer, Gerard Brach, and narrated by the powerful world weary voice of Jeanne Moreau. If you have experienced consuming sexual passion and the pain which it can engender, you will understand this film. If you haven't, this film will give you that vicarious experience. It is all the more truthful because although the relationship is interracial, the passion transcends, whereas the cultural differences block the fulfilment of their true love. It is about how people miss love trapped by convention and common sense. This is a flawless film, beautifully shot--a minor classic, much under-appreciated.","user":"Antonius-5","rank":[43,47]},{"title":"Meaning behind the scenes","rating":27,"date":"27 July 2004","review":"I first saw this movie when I was younger, as one of the most graphic \"mainstream\" movies available. That was before I ever knew what the word \"soft-core\" meant.<br><br>I watched it again, when I was older, and I finally understand it. The quiet sequences and unemotional facade of the female lead are no longer just boring filler between the exciting love scenes. Perhaps it's because I needed a little more life experience to know the unexpressed feelings of the female character and the expressed feelings of the male character. Sure, this movie is about taboo and tasting forbidden fruit. This movie is about sex. But this movie also has very strong depictions of the other emotions involved in the affair. Shame. Guilt. Racial and social prejudice. Love which is explored when both parties know there can be no future. Emotional detachment born out of necessity, as a \"defense mechanism\". Being ostracized by your peers, and life in an environment rife with vicious rumors. But mostly the shame and guilt. It's made clearer to me what a former lover of mine may have felt.<br><br>To live through all that and then to watch this movie makes for a very personal, moving experience. I can't recommend it to everyone, since every movie experience is unique. But I can say that \"The Lover\" is much, much more than just an excuse for graphic love scenes. It's a story of a reminiscence... a first time... a shameful secret... a hidden love, fostered through hardship and burning into the mind of the narrator an indelible, permanent mark of memory of a first, life-shaping lover...","user":"HellBoy13","rank":[100,118]}]