[{"title":"Wes Craven's Underrated Classic one of the best Elm Street movies!!!","rating":10,"date":"1 November 2015","review":"Wes Craven's New Nightmare (1994) is one of the best horror films of the 90's. Possibly the second best Elms Street entry. But in my opinion A Nightmare on Elm Street 4: The Dream Master (1988) is much better than this. I just love this film to death! I love this film because it is Wes Craven direction debut. Wes Craven did write and directed this film. In this film, Freddy is depicted as closer to what Craven originally intended, being more menacing and less comical, with a greatly updated attire and appearance. The film is very scary and it does involve Freddy coming in to a real world. Nancy Thompson (Heather Langenkamp) returns this time Heather plays her self and she defeats the third time Freddy but this time it is different than it was in the first film. I can always watch A Nightmare on Elm Street (1984),A Nightmare on Elm Street 4: The Dream Master (1988) and New Nightmare and those three films just kick ass and they are my favorite horror slasher films in the genre! <br><br>I love this movie so much mostly for the real world setting and the return of the characters from the first movie. Heather Langenkamp is the essential leading lady for a horror franchise. One aspect of this film I really liked was how Robert Englund just played himself and \"Freddy\" was more of a demonic killer from Hell. If you're looking for the scariest impersonation of Freddy, this is the one to watch. The story is about the original cast members of the first Freddy film being haunted by a \"reel\" Freddy. This movie is so good it stands on its own! New Nightmare is a 10.year anniversary of Wes Craven's A Nightmare on Elm Street (1984) which that also counts in this film and it is mentioned in here!<br><br>I like what they did hear what it would be like if Freddy was in the real world Freddy had a makeover he looked bad ass to me I thought this was some sort of re imaging Wes Craven try to do something different with Freddy but that's my opinion. The whole tone of it was great to me and like you said the actors playing themselves was great:)! The story it is a very clever concept for this series which it has a potential. I prefer this film over the Elm Street sequels except part 3 which I love the third entry to death! The same way I love the seventh entry in to series. Some people don't prefer this film into the series I do. The movie is very realistic and very scary. heather Langenkamp did the best job portraying her self and getting back to the roots of Nancy Thompson!<br><br>I always have enjoyed this film, Wes did a solid job directing this horror slasher movie , I really feel terrible for his family and I can't believe a tragedy strike him and his family! It is the worst loss of my beloved Director ever! Very different entry into a Last Action Hero idea of a horror movie becoming reality. My favorite moment in the movie is the freeway sequence. Heather/Nancy takes sleeping pills to join in on a lucid dream, final showdown with Freddy to save an already captured Dylan. It occurs in a hot, steamy and water-logged dream scape ruin, apparently Freddy's home turf. The final showdown between Nancy and Freddy was outstanding, the bets sequence ever. Nancy with her help of her son defeat the demon Freddy they both lock him in a lit furnace where upon catching on fire and killing him. His true visage is shown amidst a fiery blast that was awesome!!! Nancy and Dylan escaping back to reality which was phenomenal. I love the actress Tracy Middendorf playing babysitter Julie. Gosh in the hospital scene Julie ends up punching a nurse and threatening another with a needle (cameo appearance by Wes Craven's daughter), and locks the door.) was awesome I love that scene! Seriously I thought the actress who played Julie was actually Jennie Garth because they both look alike, they were great. I love actress Tracy Middendorf playing Julie, I thought she made wonderful performance in this film. Fighting for Heather's son.<br><br>The most two actors that blazed in this film were Heather Langenkamp and Robert Englund who played them self's and their famous roles Nancy and Freddy. I am also pleased that John Saxon did return in this film as a support cast and a close friend of Heather, he even played Donald Thompson again in this film. <br><br>This time staying awake won't save you.. Ten years after writer and director Wes Craven (\"Scream,\" \"The Hills Have Eyes\") brought his personal nightmares to the movie screen as Freddy Krueger in \"A Nightmare on Elm Street,\" the horrifying child killer returns, stepping out of his celluloid world to haunt the life of the actress who first defeated him on film. This seventh film in the Nightmare on Elm Street series has the cast starring as themselves in a wicked spin as key players from earlier installments are terrorized by Freddy Kreuger and his razor-fingered glove. That is the basic plot. <br><br>Anyway I love this film and I am giving a 10 because this film deserves it and it is my third best favorite Elm Street horror slasher film!<br><br>Wes Craven's New Nightmare is a 1994 American slasher meta film written and directed by original Nightmare on Elm Street creator Wes Craven.<br><br>10/10 Grade: Bad Ass Seal Of Approval Studio: New Line Cinema Starring: Robert Englund, Heather Langenkamp, Miko Hughes, John Saxon, Sam Ruben Director/Writer: Wes Craven Producers: Wes Craven, Robert Shaye Rated: R Running Time: 1 Hr. 42 Mins. Budget: $8.000.000 Box Office: $17,400,601","user":"ivo-cobra8","rank":[92,97]},{"title":"Makes up for the bad sequels","rating":9,"date":"2 August 2003","review":"The First Nightmare on Elm Street was scary and original. It had the great idea of a killer killing people in their dreams. All of its sequels (except for part 2, which went in a horrible direction) just built on to that idea, and the idea wasn't scary anymore as the series progressed. Now with New Nightmare, Wes Craven came up with another original idea. It turns out that Freddy is in fact real, some kind of ancient evil that took the form of Freddy Krueger and could only be contained through storytelling, IE: the Nightmare On Elm Street movies. But since the series has ended, the genie is out of the bottle, and this ingenious film unravels.<br><br>I wouldn't say this movie is that scary, it's more creepy than it is scary, but I love its imagination. It plays mind little mind games and you wonder what is real and what is not. Freddy Krueger is even credited as \"himself\". It's a must-see for any Freddy fan and in many ways it stands on its own...but only if you've seen the other movies. If that makes any sense.<br><br>This is one of the best sequels in the Nightmare series and it's nothing short of brilliant. It's nice to see that Freddy is back in the bottle where he belongs, and hopefully will be for a long time...<br><br>My Rating: 9/10","user":"Derek237","rank":[63,82]},{"title":"Amazingly original and creepy horror film.","rating":8,"date":"23 June 2006","review":"Wes Craven's New Nightmare features Heather Lengankamp, who played Nancy in the first and third films, living a normal life with her husband and son. Lately, strange things have been happening, and her son isn't acting like himself. She is called in for an interview with New Line Cinemas, where she finds out that Wes Craven is making a new Nightmare film. The events of this film are beginning to unfold in the real world, because Freddy Krueger is angry at being killed off in the last film, so he steps out of fantasy and into reality to go after the makers of the original film. Now Heather Lengankamp must protect her son and defeat Freddy one last time...Only this time, it's real.<br><br>I love this movie. I personally think it's just as good as the first movie. This is one of the most original and ingenious plots for a horror movie I've ever seen. All of the people involved with the original films appear as themselves, including Heather Lengenkamp, John Saxon, Robert Englund, and Wes Craven. Freddy is amazing in this movie. He appears with his trademark brown hat, but now he's in a much darker red and green sweater along with a brown tattered trench coat, and his burns are more severe. Also, his trademark knives are actually coming from his fingers. The best part about it is that in this film, Freddy isn't a wise cracking killer...He's an all business violent and brutal killer.<br><br>This movie features the best acting for a slasher movie I've ever seen, but then again, almost every actor in the movie plays themselves, so it would be pretty hard to screw that up.<br><br>Overall, this movie is on a par with the original, and I'd recommend it to any horror fan.<br><br>8/10","user":"theshadow908","rank":[41,54]}]