[{"title":"Mis-marketed and misunderstood, among Kubrick's best","rating":9,"date":"7 June 2002","review":"***SPOILER ALERT - I'M GOING TO EXPLAIN THIS MOVIE! ***<br><br>It's a shame that this film was promoted as a \"hot\" erotic thriller. Kubrick would not have allowed that marketing campaign to go forward had he been alive.  Sure there's a lot of eroticism in this movie, but those who go to it looking for sexual thrills are going to be (and were) sorely disappointed.<br><br>The events in this movie are triggered by the protagonist's wife's revelation that she almost slept with another man.  This kicks off a range of emotions and prompts him to re-evaluate his sexual relationship with her, subsequently leading to a trip through his sexual SUBconscious.  This is the critical point that all too many viewers miss, though it's so overtly surreal I don't see how one could miss it.  None of this is real!  It's called Eyes Wide SHUT for a reason!<br><br>All of our protagonists' \"encounters\" represent manifestations of his sexual fantasies and fears.  His fantasies include group sex, sex with a teenager, sex with a prostitute, sex without strings.  His fears include disease, homosexuality (notice the brutal and brief encounter with the gay-bashing gang), and most of all: discovery.  Discovery of his hidden fantasies, which might reveal his true nature to the world.  Discovery that he is really a pretender, doesn't really belong, and is not worthy after all.  This latter is probably universal, and in his case while it has sexual dimensions it is not purely sexual.  In the end he realizes that his fantasies are just fantasies, at least some of his fears are legitimate, and that instead of just fantasizing about sex he should actually have sex with his wife.  Not rocket science here, but plenty of people need reminding of this from time to time, and it's a well-told story.<br><br>I was fortunate enough to first see this movie in theaters overseas, and was spared the atrocity of digital editing to make things less explicit. David Lynch did the same thing more recently in Mulholland Drive, and I hope that this is not the beginning of a trend.  Given all of the explicit gore and brutality in movies, the level of sexual explicitness that triggers the censors is simply laughable.  Frankly, having seen the un-edited version, I didn't think it was a big deal.<br><br>One can't dismiss criticisms that the nudity was all female and many of the women were depicted as sexual objects, but this movie is quite pointedly a trip through a fairly conventional man's sexual unconscious and necessarily told from a male point of view.  So none of these things should be a surprise.  It would be very interesting to see a comparable exploration of the female sexual subconscious by an accomplished woman director, though I'm not holding my breath that the Hollywood establishment will allow that to happen soon.","user":"WriConsult","rank":[445,520]},{"title":"An impressive film with a bad marketing campaign","rating":9,"date":"17 July 1999","review":"Eyes Wide Shut is ill-suited for the summer movie corridor.  It has no explosions, no running, shouting, or a single gunshot.  What it has are long scenes in which characters talk to one another.  Slowly and carefully.  The problem is that the film is marketed as having white-hot sex scenes and plenty of gratuitous nudity, while it has neither.  There is plenty of naked flesh, don't get me wrong, but in exactly the opposite way that the ads make it appear.  This is not a movie about being sexy and naked -- it's a movie about how flesh is just another part of being human, so what is all the fuss about?  The marketing campaign is misleading, and led to disappointment in the audience that I saw the movie with, who were just looking for some skin.<br><br>The tension in the plot and the issues that the film discusses aren't telegraphed to the audience, they're hinted at in the dialog.  There is no neat resolution at the end, life simply goes on.   You may watch the whole film and think \"that wasn't about anything!\" Then think about what you've seen and realize it has a great deal to say.<br><br>The film is a meditation on sexuality and how it relates to marriage, death, and money.  It's a fascinating commentary on modern life, and a rare movie that dares to examine sex as impassionately as any other issue.<br><br>The directing and cinematography alone would be worth the price of admission without the social commentary.  The sets are an integral part of the movie; they breathe and glow and live.  Kubrick was a master director, and he uses long shots and dissolves to great effect.  Cruise and Kidman are at their best, and the supporting cast is also strong.  It's Kubrick's magic work with the camera that holds the film together.<br><br>All in all, definitely worth seeing for the un-uptight.  It's possible to watch this film and actually think about it for hours afterward.  That's something you won't get with the Wild, Wild West.","user":"niteman","rank":[397,511]},{"title":"A mirror audaciously obsessive in its dazzling revelations...","rating":8,"date":"7 September 1999","review":"Stanley Kubrick was tempted to do \"Eyes Wide Shut\" in 1970, but Christianne, his wife, felt that her marriage could be in jeopardy, so she implored him not to do it... But \"Eyes Wide Shut\" came to be after all, the last temptation of Kubrick...<br><br>The film begins revealing the nice figure in high heels of Alice Harford (Nicole Kidman), moving in sliding motion her nice black gown... Alice is invited with her husband Dr. William (Tom Cruise) to a holiday party given by a New York wealthy broker called Victor Ziegler (Sydney Pollack).<br><br>While Alice is dancing half-drunk with an effusive Hungarian (Ski Dumont), she was, at the same time, spying on her husband who was flirting with two models... A ménage à trois is insinuated by the attractive girls, but a sudden interruption comes from Ziegler's private apartment which made the doctor climb upstairs to assist an attractive woman lying unconscious, repressed, overdosed!<br><br>The famous mirror love scene, between Alice and her husband, reflected a missing sexual desire between them both... William was kissing his lovely wife on the neck while her glance seemed weary and tired... It seems that the eroticism has vanished from her boring life... Only a little intimate contact is left... Is she truly recognizing a necessity for a change, maybe for a new husband much more nearby...<br><br>Looking for a certain sexual vengeance, Alice begins irritating her husband about adultery by testing his immunity, and relating some fantasy she had with a handsome naval officer last summer, she assures William that 'if the handsome office had wanted her,' she would have sacrificed everything, even her marriage and her child for one night stand!<br><br>Feeling his word destroyed into fragments, and walking the dangerous streets of New York, William remembered an old friend he met in the party, the piano player Todd Field (Nick Nightingale). He decides to pass by...<br><br>There, Nick divulges a secret... A secret place on Long Island... A château where he will be playing piano 'eyes shuttered'... But he continued, to get into the castle, one must have a mask, a disguise and he must 'know' the password...<br><br>With shades of Hitchcock's \"Vertigo,\" Kubrick starts to play, at this point, with his characters... He seems escorting them and leading the audience for some purpose, for one definite performance he prepared his whole picture for it... Kubrick did not create a film about sex... He made a film about the conception of sex... He wanted us to explore something inside our mind that we usually prefer not to discover... Through his eyes a visual work appeared, a cinematic technique breathtakingly beautiful, a perfectionism, precise and mystical...<br><br>Reducing the dialog to a minimum, and with a distinguished confused music, we were in presence of a strange ceremonial rite, a picturesque ritual...<br><br>Based on a psychological drama, written by the Viennese novelist Arthur Schnizler, \"Eyes Wide Shut\" is a mirror, audaciously obsessive in its dazzling revelations, profound, provocative and passionate, transmitted in a frame of sex, fear and death, that we have to see with wide eyes fully opened...","user":"Nazi_Fighter_David","rank":[146,184]}]