[{"title":"Not for everyone, but what is???","rating":10,"date":"10 May 2003","review":"It's amusing to see people getting so upset at not \"getting\" a film others call great that they'll denigrate not only the film, but the people who made it and anyone who does like it. There seems to be a lot of that with Woody Allen. Stand-up comics aren't supposed to make great films. Fortunately, Woody doesn't care what people think he's \"supposed\" to do.<br><br>And make no mistake, \"Shadows and Fog\" is a great film. Not merely an homage to the German expressionists, it abounds in the philosophies Woody has discussed in all his films: god, love, death, sanity and craziness, honesty, cruelty, tyranny, humanity. The characters in this, one of the best of his screenplays, are all individuals, all facets of Woody's immense understanding of the common man. The scene in the brothel is stunning in its casual ordinariness. Kleinman (translation, \"little man,\") is all of us, in the shadow and fog of confusing times. Consider the line he delivers just before he blows pepper in the crowd's face: \"I never did anything to deserve getting in trouble.\" The irony here is that much of the fascism that overtook Europe came because too many good people did nothing. The lesson was as significant when Woody made the film as during the time depicted, and just as significant today. A great film, 10/10.","user":"gayspiritwarrior","rank":[67,77]},{"title":"Style Over Substance","rating":8,"date":"21 April 2005","review":"Woody Allen's tribute to German expressionism is better than most critics would have you believe. Sure there is very little plot to speak of, it's more a series of vignettes and gags than a cohesive narrative. Sure, it ends rather abruptly, never solving the mystery, but none of this stopped my thorough enjoyment of this film.<br><br>As the title suggests the entire movie is designed in shadows and fog. Shot with beautiful black and white photography, Allen and cinematographer Carlo Di Palma create the look and feel of an unnamed East European city as seen in such films as M and Nosferatu. The lighting is set up so that in nearly every shot underlying shadows engulf the scene. In the exteriors a vicious fog rolls across the night sky obscuring most details. Through the fog bumbles Kleinman (Allen is his typical neurotic schmuck role) trying to find his role in a vigilante mob's plan to stop a serial killer roaming the streets. From dark night until dawn, Kleinman wanders from place to place meeting a wide variety of curious characters (played by an even more curious group of celebrities), the most endearing of which is a desperate sword swallower (Mia Farrow)who is has wandered into a brothel after fleeing her cheating boyfriend/clown (John Malcovich).<br><br>It is a little unsettling to watch Allen do his normal schtick while the characters around him are murdered, subjected to racial prejudice, beaten by the police and discuss such subjects as love, sex, and meaning. There is a subtext involving the plight of the Jews between the World Wars, foreshadowing the Nazis. Yet the gags remain as solid as any Woody Allen film. Amongst the seriousness of his subtext and the films he is paying homage to, Allen finds away to bring full bellied laughter. Though his quirky neurosis isn't as resolutely hilarious as it is in such films as Annie Hall, it is still enough to fill the film with mirth.<br><br>The film ends rather abruptly with Kleinman having never learned his role in the plan, nor the killer having been caught. Yet as the credits role we realize the mystery was not so much the reason behind the story as method in creating it.","user":"MatBrewster","rank":[41,46]},{"title":"Vintage Woody (either you love him or hate him there is no inbetween)","rating":10,"date":"29 December 1998","review":"This excellent black and white, set perhaps in Berlin in the 20's has no conclusion, only vignettes in the period from midnight to dawn. The city is engulfed in fear. A serial killer is at large..<br><br>The camera shots illicit tension. All is shrouded in dark and murky unusual camera angles. The outdoor scenes are always somewhat blurred and slightly out of focus adding to the climate of fear.<br><br>There is no plot per se, only chance meetings between participants. Of note is the conversation in the whorehouse, stimulating and extremely thought provoking. Woody's use of a revolving camera in the shot from face around to face around to face while the girls talk and the conversation is heard no matter on whom the camera is focused, -- this is a first. The viewer needs to pay extreme attention. Moreover the background music of Kurt Weill adds so much to the ambience.<br><br>Seeing this now makes me wish wholeheartedly that Woody and Mia never had that horrible unpleasantness between them. Now the future forebodes there never being such a pairing. We all do suffer, including them.<br><br>I say this film deserves a 10 out of 10 and the critics be damned.  So many critics are prone to criticize every theatrical offering of Woody just because of his personal behavior.","user":"Nimbo","rank":[41,49]}]