[{"title":"One of the most under-rated movies made","rating":10,"date":"7 November 2013","review":"I first saw this movie in 97 when it first came out.I had barely heard of Baldwin,Hopkins or Perrineau.It turned out to be one of those movies I sat on the \"edge\" of my seat and was stunned by the ending.I sat there,mouth agape.I found I had a deep respect for all three actors.This movie,in every discernible way,is a masterpiece.The cinematography is breathtaking.The musical score is one of the most beautiful themes I have ever heard.The plot is smooth and the acting superb.I had heard of Baldwin but had not thought he was a great actor until seeing The Edge.Hopkins has made some great movies but this one..well it my personal favorite.The subtleties are numerous,the suspense captivating and the message is profound.The bear is without a doubt frightening and primal.This movie evoked emotions in me that were also primal.And the ending? It is the best ending to any movie I have ever seen.Perhaps you might have to appreciate the complexities of human nature as well as the action sequences in The Edge to get the most out of the viewing experience.It truly is the best of both worlds.","user":"slhma10","rank":[40,42]},{"title":"In A Word: Intense","rating":9,"date":"9 March 2006","review":"Boy, here's an intense film, a survival-in-the-wilderness adventure/thriller starring the unlikely duo of Anthony Hopkins and Alec Baldwin. It's not hard to guess who's the villain, in addition to a man-eating bear who stalks the two of them after their plane crashes in the woods of Alaska.<br><br>The sophistication of Hopkins, playing an extremely smart man, battling the crude Baldwin, who is insanely jealous of Hopkins' possessions, including his gorgeous wife (Elle McPherson), is intriguing to watch. So is the great scenery and best-of-all, a great action story that has you focused intently for the full two hours.<br><br>A human characteristic so often ignored in films the past half century is put on display here: compassionate forgiveness. Seeing forgiveness demonstrated instead of revenge is almost shocking to see. Kudos to the filmmakers, too, for not going overboard on the brutality in this adventure.","user":"ccthemovieman-1","rank":[96,112]},{"title":"Terrific Action Adventure","rating":10,"date":"9 February 2000","review":"\"The Edge\" is a terrific movie, not just as an action movie but as whole. I went to see this film because I thought it looked interesting, my expectations were shattered, this is a well written, well acted, well directed thriller. Anthony Hopkins as always turns in a great performance but the big suprise is Alec Baldwin who did just as well. This film has some of the best dialogue ever written for a movie of this type, and the action scenes are clever and blazingly paced. This is a terrific movie.","user":"claudonio","rank":[124,156]}]