[{"title":"great flick for pop culture lovers - five stars, three thumbs up","rating":4,"date":"4 December 2000","review":"This is a light and fun - although intelligent - movie, worth seeing, if not for the whole marvellous opus of pop culture, for his cast alone: Harvey Keitel, Roseanne, Victor Argo and precious appearances of Lou Reed, Jim Jarmusch (as Bob, in my favorite sequence of the movie), John Lurie and Madonna, to name a few. Soundtrack by David Byrne only adds to the mix.<br><br>´Blue in the Face´ cynically, cleverly and ironically chronicles the life and the history of Brooklyn, NY. Watch it, it´s independent cinema at its best.","user":"cls-6","rank":[10,12]},{"title":"An understated, but brilliant film","rating":9,"date":"14 September 2001","review":"Blue in the face is a follow up to 'Smoke' a film which I saw recently and very much enjoyed. I thought I'd give this one a try as well.<br><br> Like the first film (even more so) this is a collection of beautifully acted, largely improvised vignettes, involving the customers and general passers-by of the Brooklyn based cigar shop run by Auggie (Harvey Keitel). There is a lose storyline involving the relationship between Auggie and his girlfriend Violetta (brilliantly played by Mel Gorham) and the troubled marriage of Vinnie the storeowner and his wife. The store has been a part of the local community for years and when Vinnie gets a very good offer to sell up, it's bound to badly affect a lot of people.<br><br> The best moments of the film lie in the documentary style rambling of Brooklyn residents (including Lou Reed) as they describe what it means to them being part of the city, and also the brilliant monologues that some of the characters perform. There are moments of genius in this film. It is very funny in a very understated way, the assembled characters are all eccentric in their own way but totally believable. The dialogue is natural and you get to know and feel for the characters very quickly in to the movie.<br><br> I loved this film; I thought it was better than 'Smoke' a film I also liked. 'Blue in the Face' might be harder to get in to for some people, it's improvisational style and lack of structured story might put people off or make  them think it's hard to follow, but it isn't. Don't try to make too much sense of what's going on you don't need to. Treat it as a series of snapshots in to the lives of a collection of colourful New Yorkers. Just sit back and watch the characters play out their lives, you'll very soon be engrossed by it.<br><br>It was an absolute delight to watch. Not for everyone maybe but definitely for me!","user":"maurizio-11","rank":[14,18]},{"title":"A romantic view of Brooklyn, excellent improvisation.","rating":18,"date":"18 November 2000","review":"Blue in the face might be boring to many because it doesn't follow a standard hollywood paradigm of rising action, climax, resolve.  It is more documentary style, although fictitious, and quickly jumps from story to story and character to character.  The editing is an interesting component because it successfully brings together disparate themes and characters (who are improvising their lines and stories to some degree).  This and some fantastical elements provide a very romanticized view of Brooklyn.  Altogether a cohesive piece with some nice performances and some insight into what it is to growup and live in a special loved place.","user":"gunnar-3","rank":[5,6]}]