[{"title":"You can't be serious! ( has a few spoilers)","rating":1,"date":"21 January 2012","review":"I can not believe this movie has gotten these great rating &amp; reviews. It is absolutely awful! As a black 20something female I can't believe they could make a movie like this where an innocent woman was trying to defend herself against some thugs who were trying to car jack her &amp; killed her with no remorse from the person who actually did the killing throughout the entire movie. Then the one kid who had remorse gets killed at the end. They turned the whole movie into some type of racial profiling mumbo jumbo when it had absolutely nothing to do with the case at all. And Gregory Hines who is an awesome actor took a role in this movie as the biggest hypocritical idiot through the whole thing. I totally feel like i wasted an hour &amp; a half of my life watching this bull.","user":"rac18","rank":[10,11]},{"title":"Refused to follow the FACTS of the attack!","rating":4,"date":"22 June 2018","review":"4 black kids attack a lone woman, at night and Smash in the window of her car so they can steal her car, bash in her head with a gun, kill her and their defense is they did it because of the way white people treat them? The movie forgot to let the prosecution mention these facts. Stupid waste of good actors.","user":"aurasbob","rank":[3,4]},{"title":"Brilliant and believable performances in a movie with substance","rating":9,"date":"17 May 2002","review":"If you enjoy intelligent political dramas as I do 'Color of Justice' is definitely not a movie to be missed.<br><br>Despite this being a movie made for TV it delivers in many ways where many movies for cinemas fail. It has a great story and all of the characters are well played and believable.<br><br>This movie has enough substance and raises questions for at least one more hour of playtime.<br><br>Who will benefit from the trail of 4 black juveniles accused of murdering a white woman? The New York D.A hoping to run for mayor? The rising star TV reporter and the network she is working for?  Or maybe the black Reverend Walton (Gregory Hines) claiming the accused are victims of race?<br><br>Will justice be done? You will have to see for yourself. Enjoy.<br><br>9/10","user":"jesper-1","rank":[6,13]}]