[{"title":"Stop looking at me, Swan!","rating":8,"date":"22 May 2001","review":"What can I possibly say?  This is no \"Citizen Kane,\" but this is one of the movies that sticks out in my mind the most.  It's a twisted, crude, tasteless comedy but never ceases to bring out extreme laughter, even after I've seen it approximately 200 times--give or take.  I just cannot get tired of this movie!  There are things in this movie that cannot be understood, like every Sandler flick.  What the hell was the deal with the penguin? However, it's a memorable moment.  There are so many memorable quotes from the film.  It's one of those movies I can quote line per line off the top of my head.  <br><br>Here's a share of my favorite quotes:<br><br>(singing) \"Suntan lotion is good for me.  You protect me. Tee-hee-hee.\"<br><br>\"O'Doyle rules!\"<br><br>\"It's too damn hot for a penguin to be just walkin' around.  I gotta send him back to the South Pole.\"<br><br>\"You're giving the company to Eric?  He is a bad, bad man.\"<br><br>Adam Sandler has that brand of comic genius in which you don't know what you're laughing at, but it's damn funny!  You can't help it!  I can't rant and rave about anything artistically brilliant about \"Billy Madison.\"  Yet it's one of my favorite movies of all time.  <br><br>It's funny, it's original, it's Sandler!  Nuff said.<br><br>My score:  8 (out of 10)","user":"mattymatt4ever","rank":[66,107]},{"title":"\"I'm one of the GOOD guys, Penguin!\"","rating":7,"date":"5 March 2002","review":"This is one of those lucky cases where the opening sequence of a movie gives you an excellent idea of what you are in for.<br><br>If you do not enjoy Billy's sunblock song, or the bit with the penguin, then you must turn off the movie and stop being such a nag about it.<br><br>But for those of us who happen to enjoy movies that are silly and stupid, this is one of the best ones out there.","user":"La Gremlin","rank":[52,86]},{"title":"I Laughed my balls off!!","rating":9,"date":"30 April 2000","review":"Billy Madison in a landslide is Adam Sandler's best film.  I never laughed so hard.  Maybe the humor is a little stupid, but that is because before seeing this movie, you have to make sure your brain is not in Fellini mode and in Sandler mode.<br><br>Story revolves around Billy Madison, who must go back to school (he is 27) and graduate High School so he can take over his father's hotel ring.  His whole odyssey is utterly hilarious from start to finish.  Especially because he has cameos and stars like Norm MacDonald, Steve Buscemi, and Chris Farley as a Penguin lover (that penguin hadn't made me laugh that hard since the pee scene in Naked Gun).  Great fun (one of the best of 1995). A++","user":"Quinoa1984","rank":[56,99]}]