[{"title":"I have not been so thrilled since Pierrot le Fou!","rating":10,"date":"13 November 2001","review":"Thank you to viewers who stayed to the end, that's what the credits say!<br><br>It is true that some people left the house after twenty minutes. I have felt amazed, puzzled, wondered, what a beautiful movie! What a strange movie to!<br><br>Usually the screenplay, or the director, takes the spectator in consideration and explains to the viewers what it is all about. Not here: suddenly, you are in this farm, people live their lives, don't seem to realize you are there, they work and play and toil, and laugh and cry, and you are still there and you have to make it up for yourself. And you would like so much to be in the screen with them, and talk to them and try to help, and love them, and... and.. and.. And you are hot in the summer and you are so cold in the winter when she picks cabbages (or is it celeriac?) If I refer to Pierrot le Fou, it is because I have not seen anything so different and so catching since.<br><br>Thank you, thank you for such a beautiful movie. I'm so glad you ran out of gas!","user":"JL-5","rank":[6,10]},{"title":"Perhaps it will, perhaps it won't!","rating":19,"date":"19 October 2003","review":"First movie made by Sandrine Veysset and launched a week prior Christmas in 1996, \"will it snow for Christmas?\" was rewarded by the Louis Delluc price in 1997 and it was a beautiful commercial success in France. This commercial and critic success was partly deserved.<br><br>The director Sandrine Veysset draws an engaging description of this family who lives in a farm located in the south of France and whose living conditions aren't always easy. She shows compassion and tenderness for her characters and notably towards the mother. She also manages to making them engaging towards the spectator. As for the father, he's a violent and hateful human being. In short, he's a total trash and however, I think he never falls into the caricature. Sometimes (although it rarely happens), he can show a touch of humanism and kindness. <br><br>Moreover, \"Will it snow for Christmas?\" is a film without plot and where nearly nothing happens. However, you aren't bored because Veysset succeeds in arousing the spectator's interest and making the  work sequences gripping.<br><br>In spite of these qualities, \"Will it snow for Christmas?\" also includes certain weaknesses and unlikelihoods, especially with the mother, how could she have seven children with a man she hates? Moreover, work in a farm is quite hard especially for young children but in the movie, they don't seem to suffer a lot even if they complain from time to time. You can also judge the last sequence as a convenient and a bit syrupy sequence.<br><br>Even if \"Will it snow for Christmas?\" isn't a perfect movie due to an important number of faults, it remains watchable.","user":"dbdumonteil","rank":[4,6]},{"title":"Sobre statement on French farming society","rating":7,"date":"13 July 1999","review":"Since Y AURA-T-IL DE LA NEIGE A NOEL? often appears to be a documentary, the film succeeds in reflecting the gritty realism of French farming society, the plight of the minorities working in it (particularly women and children), and the dysfunctional families this society spawns. These are universal themes. They are played out primarily by a young mother of seven children, shamelessly exploited as farmhands by her man, who has a \"legitimate family\" in a nearby village. Their daily life is very naturally exposed on film, accentuated by the changing nuances of the different seasons of the year, ending in winter, during \"Noel\" or Christmas. All this, however, sounds a lot better than it plays on the screen. Even at 90 minutes, the film seems overly long, and is tedious watching for most audiences. There may not be a more captivating way to address these issues, but ultimately, it is a bore for all but die-hard fans of the social realism genre.","user":"Guy33134","rank":[4,7]}]