[{"title":"A sweet and colorful dark comedy that's still a little hard to swallow","rating":7,"date":"21 January 2004","review":"Much like the candy that bears it's name, \"Jawbreaker\" is a sweet, infectious dark comedy that wants you to enjoy it for a good, long time. Unfortunately, also like the candy, the film is a little hard to swallow, and it doesn't last as long or come on as strong as it's name would lead you to believe.  But even though you know that much candy is bad for you, you still want to have it.<br><br>On her 17th birthday, popular girl Liz (Charlotte Ayanna, here as Charlotte Roldan), a member of the \"Flawless Four,\" is kidnapped by her best friends Courtney (Rose McGowan), Marcie (Julie Benz), and Julie (Rebecca Gayheart) as a prank, her screams muffled by a huge jawbreaker.  The prank goes horribly wrong, however, when Liz chokes to death on the candy.  Instead of going to the authorities, as Julie insists, Courtney devises a massive plan to cover up the death, a plan discovered by the unpopular and awkward Fern (Judy Greer).  To win her silence, Courtney makes Fern in her own image, renaming her Vylette and allowing her to hang and commiserate with the most popular people in school.  As Fern becomes intoxicated with her new-found power, Julie becomes more concerned with her friend's death, and Courtney spins a devious web of lies and trickery.  Enter Detective Vera Cruz (Pam Grier), the only person who may be able to get to the bottom of the crime. But what does all this mean for the Prom?<br><br>Writer and director Darren Stein as obviously seen \"Heathers\" a good number of times.  Like that classic film of teen angst, \"Jawbreaker\" is a dark comedy set in a high school, featuring an accidental murder of a popular student.  While \"Jawbreaker\" is certainly more colorful than \"Heathers\", both in terms of set design and characters, it also comes off as a pale imitation.  The students live their lives in near-vacuums, with parents showing up only occasionally, and then only as ineffective or ignorant.  The impact of their actions on the community at large is only hinted at, and as a result, you never feel as if anything important in the reality of this film has ever happened.<br><br>That being said, the movie is still pretty sweet.  Rose McGowan is cruel and calculating villain, terrifying in her powers of manipulation and contingency.  Julie Benz is the perfect toadie, existing only to buoy Courtney's already swollen ego.  Rebecca Gayheart's warm-natured Julie is a stark contrast to Courtney's \"Satan-in-heels\" persona, and Judy Greer is wonderful to watch as she goes from under-appreciated geek to power-mad diva.  Pam Grier is, as always, a pleasure to watch, even if her role seems too small.  The interactions between her and Rose McGowan are some of the highlights of the film.  A good supporting cast also deserves mention, most notably Carol Kane as the slightly daffy school principal, Marilyn Manson as a seedy barfly, and Ethan Erickson as the dumb jock being relentlessly manipulated by Courtney's sex games.<br><br>While the script is full of caustic one-liners, it never succumbs to its own hipness.  The characters are witty, but not nearly as unrealistically urbane as the characters in movies like \"Scream.\"  Some scenes and interactions come off as gratuitous, and to be sure there are a number of times when Stein really wants you to notice to how well he paid attention at film school.  But there are a number of scenes that gain new meaning when analyzed in the larger scheme of the movie, and a repeat viewing may be in order to catch the full signifcance.  You may sometimes get so distracted by the candy-colored schemes (McGowan's lips alone may send you into insulin shock) that you'll forget about the plot.<br><br>Some may see the movie as derivative, and there are certainly a large number of detractors.  But taken on its own merits, \"Jawbreaker\" is a fun, giddily dark comedy that requires more than few licks to get to the bottom of.  Just keep your consumption to a moderate amount, and you'll do fine.  7 out of 10.","user":"johnnysugar","rank":[46,53]},{"title":"A guilty pleasure","rating":7,"date":"5 November 2004","review":"\"Jawbreaker\" has all the predictable, clichéd elements of past teen comedies, but I can't deny the fact that I enjoyed it. I think part of its appeal is that it's a darker comedy, like \"Heathers\"--though this movie certainly isn't in the same league. Everybody in the cast gives fine performances. Rose McGowan's is a little over-the-top, but I think it fit the tone of the movie. The running time is about 85 minutes, so it doesn't go on long. There are plenty of funny moments that keep it entertaining. You can argue that the Karen Carpenter joke was too cruel, but that joke alone didn't ruin the film for me. The ending is certainly a cop-out. There could've been a MUCH better pay-off! But despite the fact that \"Jawbreaker\" is undoubtedly a flawed film, it's energetic and fun. There are much worse teen movies out there.","user":"guyfromjerzee","rank":[25,31]},{"title":"A great movie with a great cast!","rating":31,"date":"31 August 1999","review":"What happens when you take the movie \"Heathers\", sprinkle on some \"Clueless\", and add a pinch of \"Carrie\"?  Well, you get the phat movie Jawbreaker, a good movie which really lets Rebecca Gayheart and Rose McGowen shine like the stars they are!<br><br>The movie itself is somewhat true to the lives of teenagers---there was always that incredibly exclusive group of kids that NOBODY but NOBODY could be good friends with.  Well, this movie lets us see into one of these groups...and what lies underneath is totally rotton.<br><br>Rose McGowen is a total witch, much to the dismay of Rebecca Gayheart...who has to solve the puzzle of Courtney's scheme after her character Julie is tossed from the clique.  The ending is pretty memorable...reaching back to it's roots of Carrie.<br><br>Speaking of Carrie...P.J. Soles is in the movie, as well as the cool Carol Kane (When a Stranger Calls).  I really enjoyed the movie as did my friends. A laugh-a-thon that doesn't try to take itself TOO seriously, and remembering that is a good thing.<br><br>Oh, and Rebecca Gayheart is grrrreat!","user":"Lothos-3","rank":[37,48]}]