[{"title":"The best in the series","rating":4,"date":"4 April 2002","review":"Toulon's Revenge is the best in the whole Puppet Master series (With the exception of part 1 of course. This one goes back to World War II where the Nazi's are p****d off because of Aundre Toulon's<br><br> puppet shows giving negative buzz about the Gustopo. And soon they discover that his puppets are actully alive and decide to use Toulon's technology to revive soldiers that were dead to replenish their army. Needless to say everything goes south and puppets spring into action to protect their master.<br><br>What makes this movie great is it tells who the puppets are and shows the making and birth of leech woman I give it a 10","user":"sickosaint","rank":[14,16]},{"title":"The plot is a bit much for a PUPPET MASTER movie...","rating":31,"date":"31 July 2001","review":"During the pre-war era of Berlin in 1941, the Nazi regime is working at creating a drug which will reanimate the dead.  Their intent is to use the serum on fallen soldiers in order to render their army invincible.  After many failed attempts, Dr. Hess soon learns that the local puppet master Andre Toulon holds the ancient secret of giving life to inanimate objects. Toulon and his legion of puppets must now defend themselves and flee from the pursuing Nazis as they try to capture him and use his powers for evil. This is an exciting and adequately-scripted entry in the still-continuing Puppet Master series, even though the story suffers from a gaping, inexcusable plot hole: the original movie has Toulon committing suicide in 1939, two years before the events in this film.  All imperfections aside, however, this still is a decent little flick.","user":"Cowman","rank":[9,10]},{"title":"Simple, Effective & Fun","rating":9,"date":"5 August 2006","review":"This horror flick doesn't pretend to be anything but a simple revenge story, and I like that. There are no pretensions. \"Toulon\" (Guy Rolfe, replacing William Hickey who played the role the first two films) is the puppeteer-extraordinaire whose creations are literally lifelike.<br><br>Rolfe and his deadly puppets go after the Nazis after they seek him out for his scientific genius of reanimating puppets. They want that information to use for their evil purposes so \"Toulon\" and his puppets fight back. It's sort of a do-it-to-them- before-they-do-it-to-us mentality. The head Nazi is played by Richard Lynch and the man reminded me facially of Rutger Hauer.<br><br>We see the Mr. Clean-type puppet with the little head and massive body; the puppet who \"screws\" everyone; the femme fatale and the cowboy \"Six Shooter.\" There is probably someone I forgot, too. All are fun to watch.<br><br>The plot is secondary to the puppets doing their thing, eliminating all the bad guys one-by-one and it's all entertaining and done with in less than an hour- and-a-half. I have found the first three in this series all to be good but this is my only \"keeper.\" I sure wish this was available on DVD.<br><br>Note: It's rated \"R\" not just for the violence. There are a couple of quick sex scenes showing bare breasts. Although the film in general might not be considered grade-A quality, it's not as dumb as you might think, either.","user":"ccthemovieman-1","rank":[18,23]}]