[{"title":"Russell Crowe gets the \"Maximus\" out of an early role...","rating":13,"date":"13 June 2003","review":"Saw this again for the first time for almost a decade, on the Sundance Channel during their Pride Festival. The character-to-camera (audience) device seems a lot stagier now than it did when I first saw it, but overall it doesn't mar any of the film's inherent bittersweet attraction.<br><br>I've always been a sucker for good father/son relationship movies, and this ranks up there with the best, and not because of the twist: Harry's (Jack Thompson) almost too-willing acceptance of his son's gayness.  What makes it ultimately work is the true love, respect and affection that they have for one another, a bond that is sorely tested in the film's third.<br><br>\nThompson is funny and engaging in a kind of role that he's not usually known for, (for that, see the excellent BREAKER MORANT.) And as for Russell...I saw this for the first time only weeks after seeing ROMPER STOMPER, and not only was it a startling contrast, but a sure-fire sign that this boyo was a talent to watch even in the early stages (now proven a thousand times over.)<br><br>And here's another refreshing difference: nobody's in OTT drag, (you can rent TO WONG FOO for that), nobody gets AIDS, OD's, commits suicide or otherwise meets the Grim Reaper most tragically, as gay characters are wont to do in most big-budget Hollyweird \"gay-friendly\" dramas.<br><br>\nDavid Stevens writing remains true to the joys of \"Australiana\" (a new word that I love, thanks to an earlier reviewer here), which means that some less-experienced viewers may find Harry's extremely tolerable demeanor and the turn from comedy to tragedy off-putting. (For other references to similar scenarios, see MURIEL'S WEDDING, SWEETIE and of course, MOULIN ROUGE.)<br><br>But for me, it's a rare-look back at the kind of risk-taking that Russell may never again explore in his career. More than worth the cost of a rental or your time, if you can catch it.","user":"cchase","rank":[37,37]},{"title":"Back when I was 13.....","rating":10,"date":"7 February 2001","review":"I was coming out to myself.. I had this warped image of being gay that I had to develop a lisp and become high camp just to conform with being gay (I repeat I was 13 and living in the sticks.) I saw an ad for this movie TSOU and I just had to see it. With alot of precautions I caught a train for 2 hours to a movie theater that was far enough away so no one that I knew would see me going to a \"gay\" Film. Any way Sitting in the theater I was presented with an image of a gay man that didn't fall into the stereotypes I had been so used to, I guess the film taught me I could be gay with out being faggy. To simply label this as a gay movie is to miss the entire point its a Romance movie, both father and son looking for a partner of same/different gender. To make a tired point I love this movie Russell Crowe and Jack Thompson are brilliant.. I wish I had a dad like Henry.... or a boyfriend like Jeff :)","user":"limesoda","rank":[68,70]},{"title":"Father supports gay son unconditionally","rating":10,"date":"12 October 2004","review":"\"Aussie\" Film Stars Jack Thompson and Russell Crowe as father &amp; son \"best friends\", looking for lasting love/companionship with a life partner. The aging \"dad\", who is a widower, habitually tries to play cupid for his gay 20-something son, seemingly spoiling all chances of \"success\", and eventually starts a search for his own second love. <br><br>This film is hilarious, filled with great gags throughout. The deeper message of tolerance towards gays and lesbians, as well as loyalty to a loved one in need (when the father suffers a stroke, the son refuses to abandon him, caring for him like a parent would care for a small child) is not diminished by the brilliant humor which surrounds it. \"Sap-lovers\" will get their fill as well!<br><br>Honored with many International Film Awards, \"The Sum Of Us\" adds up to a big winner! Highly recommended!","user":"mdm-11","rank":[26,26]}]