[{"title":"Derivative fun","rating":7,"date":"2 August 2009","review":"OK....mix together elements of Die Hard, Blade Runner and the Terminator and hey presto - welcome T-Force! Yes it's yet more B-movie heaven from director Richard Pepin who apparently not only content to steal basic elements from the aforementioned classic flicks, additionally directly lifts scenes from them to(!), most notably an almost scene for scene swipe of big Arnie's attack on the police station from the original Terminator film. Well, normally I would berate any such blatant plagiarism with the utmost haste and deduct points from the offending film like there was no tomorrow......but you know what? - This film is simply so much damned fun that I can't but help to love it and actually find the rip off elements to actually ADD to it's bizarre charm (a factor which so often occurs in B-movies in fact).<br><br>Also adding to the enjoyment is the assembled cast including (in the beginning at least) Vernon (Bennett!) Wells, a still incredibly sexy Erin Gray (damn, I used to fancy her like crazy when she was in Buck Rogers!) and he of the cleft'd chin (no not Kirk Douglas!) Jack Scalia. I've just got to award another point to this for its inclusion of one of the most stupid excuses for a sex scene ever in which two of the cybernauts get down to it......after looking at a dirty mag(!!!!) Tremendously entertaining stuff from start to finish! Alas, shame there wasn't a sequel (yet.....)","user":"HaemovoreRex","rank":[8,9]},{"title":"Low Grade","rating":4,"date":"14 March 2001","review":"Wouldn't it be nice if we lived in a world that had mastered the art of cyborg creation? We could have robot butlers serving us drinks and killing masked terrorists. That's essentially T-Force in a *ahem* box. In the not too distant future when law enforcement is unable to cope with high risk maximum loss situations they call in T-Force. A group of elite cyborgs who were made specifically to deal with situations of deadly peril and possible human loss.<br><br>Unfortunately T-Force will do anything necessary to complete their mission within acceptable parameters including the death of hostages. Of course that's seen as unacceptable and the future of T-Force is all but sealed. They are to be dismantled, but wait - oops - it turns out they don't like the sound of that - so they escape and here enters Jack Scalia as the guy given the plum job of bringing them in a la Blade Runner.<br><br>What follows is the usual assortment of cheap action segments and an underlying question of morals. Are the cyborgs people? Do they deserve the same rights? Can cyborgs have babies? That sort of nonsense. Jack Scalia and director Richard Pepin team up and once again we find the same routine with Pepin bringing the movie in at a certain budget and Scalia turning in yet another burned out lone cop role. Which must be getting tough. T-Force doesn't fool anyone. It's a mindless low budget action flick that borrows upon ideas from other films. I don't see how you could be surprised nor left feeling cheated by T-Force. It has a fun moment or two, but you know it's not really worth your time.","user":"refinedsugar","rank":[5,9]},{"title":"Hmm.. I have memories.","rating":8,"date":"5 April 2005","review":"I first saw this movie years back when I was on 6.th grade or something. Well, till now I remember some of the things from this movie.<br><br>T-Force (Spoilers******) <br><br>Inspired from the Terminator movies, director Richard Pepin tells the sci-fi story of some kind of Robots (much like T-800 series) used by the government. When there is any highly critical condition like terrorist attacks or hostage situation the cops used to call the help of T-Force. It includes 4 or 5 members including a lady robot (Yahe, she's pretty!) But things one day get messed up when the Robots take up on their own charges. They begin a new war against the authorities resulting a bunch of actions, gun fights, and shoot outs. Who will win the war, watch out T-Force! <br><br>Yahe it's a low stage action films that came up with the ideas of Terminator, the smash hit of that times. But hey it has some cool visions from the writers Jacobsen Hart and Lenore Kletter one which shows virtual realistic girlfriend (yahe it was first seen on Total Recall, but this one really worked), that was later copied to Arnold's Sixth day. Also one unforgettable scene is the love making of Robots, huh Jennifer MacDonald (I really searched madly to find her name) make that scene unforgettable! Go and watch the movie for some lag in time.<br><br>T-Force = A memorable movie.","user":"ChrisTreborn","rank":[2,3]}]