[{"title":"Fast paced entertaining horror","rating":8,"date":"11 September 2018","review":"This is the best Halloween movie since the original came out. It starts as it means to go on with action and nods to the past that will have horror fans glued. It's so fast paced it needs to almost slow down for a rest half way through before the thrilling climax. An excellent sequel.","user":"Brommieboy","rank":[46,52]},{"title":"A big step up of the franchise!","rating":8,"date":"18 February 2018","review":"Since I've been torture with part 6, H20 is so fun like it's a fun fast pace movie. Good story, good acting, good pacing, and fun! They could of end it here but nope they decide to make another one and I have to say that one suck too. In my opinion this is the only good Halloween film of the 90s. This is a good sequel, go see it now!","user":"IssaGuy","rank":[45,51]},{"title":"The Best Sequel of the Series","rating":2,"date":"2 October 2018","review":"\"Halloween H20\" is the most accomplished sequel of the \"Halloween\" series, and a film that would deserve a \"10\" for its potency, conviction, and intelligence if it weren't for a few non-Laurie scenes earlier in the film that feel less than what other films achieved at the time. <br><br>You can't talk about \"Halloween H20\" without discussing the impact the \"Scream\" trilogy had on this era in horror cinema. The post-modern references, thrilling and modern style, sexy stars, and heightened feminist protagonists that made the three \"Scream\" films so successful are borrowed by \"Halloween H20\" and are used to the film's triumph. <br><br>The single best aspect of \"Halloween H20\" is Laurie Strode's character development. Though it's a bit more heavy-handed than Sidney in \"Scream,\" it's effective, thorough, and aided by Jamie Lee Curtis' phenomenal, unforgettable portrayal. The last 20 minutes are first-rate 1990s horror. <br><br>\"Halloween H20\" feels as scary and fresh today as it did in 1998.","user":"RyanCShowers","rank":[30,34]}]