[{"title":"Analysis aside, this film moved me.","rating":13,"date":"13 December 2000","review":"Fortunately, I do not judge a film merely by its technical excellence. Other reviews seemed to overemphasize the limited script, miscasting, lack of focus, etc, that this movie supposedly represents. All of it may be true, and certainly if the movie did not reach me, I too, would come up with a barrelful of sophisticated reasons why it didn't work.<br><br>The problem is, it moved me. It touched my heart in just the right way, and left me once again, with a longing have known everyone who ever lived, suffered and died.<br><br>Ah, the human condition!<br><br>The first half of the film was slow, and seemed to be searching for itself. But from the time Robert entered into the home for the insane, it became engrossing. I thought the story of the \"Lost Valley\" was poignant and worth the whole movie. All that came before was necessary background for all that came after.<br><br>So...not extraordinary, not outstanding, but quietly satisfying and definitely memorable. A little gem -selected with care- to share with those you love.","user":"pb-10","rank":[51,53]},{"title":"Hidden Gem!","rating":2,"date":"2 May 2000","review":"Restoration is one of the great overlooked gems of the 1990's. This movie is beautifully shot and competently directed. It is based closely on the original novel, and also reminds me of some of the more juicy excerpts from Samuel Pepys Diary. The use of real historical locations in Britain is inspired, for instance, the Fire of London and Cheapside market scenes were shot at Caerphilly Castle, the 13th-century moat doubling for the 17th-century Thames! Robert Downey gives a highly respectable performance as Merivel (and has an excellent British accent), but Meg Ryan is totally mis-cast, seeming very lost in some scenes. Sam Niell, I think, is probably the best casting for a British Monarch since Alec Guiness as Charles the First in Cromwell, and Dudley Sutton as James the First in Orlando. One of the best performances, however, comes from David Thewlis in support. His moving scenes with Downey at Tretower Court steal the movie. I worked as an extra on the movie, and some scenes for Pierce Brosnan's 'Crusoe' were shot back to back on the Cheapside market set. That movie has still to be released. 'Restoration' was filmed during 1994, and was delayed for release amid rumours of re-shooting scenes with Meg Ryan, and probable cold feet after the box-office difficulties with 'The Red Letter'.<br><br>This movie has not been given the credits it truly deserves, and is an excellent illustration of Court life and marriage politics during the reign of Britain's sexiest Monarch!","user":"Steve P.","rank":[48,51]},{"title":"Lush And Unnervingly Eerie","rating":29,"date":"29 March 2004","review":"The set design and art direction on this movie was entirely mesmerizing! I will never forget the scene in which Dr Merivile returns to court (after The Plague has ravished London) in which this huge heavy swishing pendulum like incense burner, apparently to help ward off sickness... makes such a haunting and ominous sound as it waves smoke across the vast room...you can almost smell it! This movie is robustly lush and unnervingly eerie. As has been mentioned by a few others on the database...it's full of contrast on all levels. <br><br>Personally, I was gladly surprised at how inventive Robert Downey Jr was with the role of Robert Merivel. He began with a laughing stupidity which grew to eventual compassion and downright intellect by the end of his story. Sam Neil is always all around proficient at what ever he takes on, his portrayal here is no exception, although I think he granted Charles II a lot of likableness and charm that was surely improbable in reality. Got to love the fifty or so Spaniels meandering with him down the plush hallways of the nobility through out the kingdom. And the scenes with intricate scientific inventions and mechanisms of the era were sheer beauty to behold.  At the same time there was such desperation and bleak contrast when dealing with the devastation and hopelessness of The Plague...only to be followed by the horrific Fire Of London. It's a wonder civilization survived at all in England at the time. The movie's art direction was of such a brilliant intensity. Parts of the script were a bit slow but the visuals tended to make up for it. The only truly unfortunate aspect of the film was the casting of Meg Ryan...just Plumb Awful(as they say)in the role of Dr Merivil's asylum inmate lover....who was by the way, miraculously cured of her insanity by his physical attentions. Whoever twisted Hollywood arms to get her on this project should be quartered and drawn.<br><br>\nConsidering all, this movie made me curious enough to download a copy of Samuel Pepys Diary 1665 to read more about the history of the Restoration. Isn't that what a good historical adaptation should do?","user":"httpmom","rank":[39,41]}]