[{"title":"A gem!","rating":9,"date":"9 December 2003","review":"I fell in love with this movie the very first time I watched it on cable. Don Johnson and Melanie Griffith were perfect in this tale of grief in the aftermath of the loss of a child.  Elijah Wood, Thora Birch, and Sheila McCarthy round out the cast and make this a poignant tale.<br><br>Melanie Griffith was never as vulnerable and powerful as she was in this movie - and I liked her in Working Girl and A Stranger Among Us.  This was by far her most affecting role.  And the almost always underrated Don Johnson turns in another versatile and incredibly touching performance.  And the emotion between their two characters is clearly palpable throughout their estrangement in this film. <br><br>'Paradise' truly is a gem!  If you haven't seen it, do so.  You won't be sorry.","user":"teejay-4","rank":[27,28]},{"title":"Trouble in Paradise (spoilers)","rating":7,"date":"14 July 2004","review":"This is a pretty good drama about several people dealing with difficult problems. At the center of the story is Williard Young (Elijah Wood), a lonely little boy who is sent to his mother's friend's house for summer vacation in a quiet, small town.<br><br>There has been a quiet, untouched bubble of emotional problems among the residences of the town who are the main characters of the story. And Williard's visit seems to make the bubble burst and each is forced to finally confront the problems they had been hiding for so long.<br><br>Primarily, that is between the Reeds, the people who Williard is staying with. Lily Reed (Melanie Griffith) is the quiet, fragile type, damaged by the death of their infant son some time ago, creating a pain in her heart that she had never been quite able to get rid of. And it seems as though, it is not something she wants to let go or to stop blaming herself for. This decision, unfortunately, keeps her apart from her husband, Ben Reed (Griffith's then-husband, Don Johnson [hubba hubba]) who can't seem to get close to his wife, and has become bitter in his many unsuccessful attempts.<br><br>Williard's presence, however brings them together, since both Lily and Ben, enjoy his company once they warm up to him, of course. He is like the surrogate son type. Though their relationship with Williard is often shared separately, Williard tries what he can to bring the two together once and for all, because he knows that they still love each other. They just don't know how to get over the past and get their lives back together again. It takes an awful lot of coaxing and some teary moments, of course. Melanie Griffith pulls out all the stops for this role, as does Don Johnson. And it works quite wonderfully because you can really see how much their son's death really effected them, especially Lily. <br><br>The summer vacation with the Reeds is a sort of therapy for Williard, too. In part, his next door neighbor Billie Pike (Thora Birch) is one of the few friends he has aside from the Reeds and his time with her is a good lesson in the pangs of childhood like dealing with self-esteem, and learning the truth about his legendary father.  <br><br>It is an all around good drama. The story has a lot going on, and all of the actors, especially Wood and Griffith push things along quite nicely. You never get into too much rambling dialogue, and a story with children often entertains with little subplots of mischief while providing the comic relief to this teary (but not overly sentimental) movie.","user":"vertigo_14","rank":[12,12]},{"title":"Touches the heart and soul","rating":9,"date":"22 August 2000","review":"I wrote a short essay after watching this movie, not because it affected me, but that it left such a great impression. To me, the use of 'Paradise' as title is apt, as the movie goes to show how many people continue to live in their private hells, when all around them is a place which seems like paradise. These people, though socially interactive at times, seem more preoccupied with the ghosts of their pasts rather than the blessings of the moment. Only when these characters are able to let go of the demons that haunt them are they able to once again experience the joys of love and intimacy.<br><br>This film can help us to evaluate the things that we allow to control us, and help us to understand that instead of examining our lives under a microscope, we should allow ourselves to look up and out sometimes, and maybe discover all those things missing in our lives but which were right by us all the time.","user":"Mike-DD","rank":[18,19]}]