[{"title":"surprisingly mean-spirited and unfunny","rating":2,"date":"7 November 2005","review":"I actually liked the sketch \"Pat\" on SNL. It was a fresh idea - honestly, how many other \"andrognenous character-sketch\" routines can you name? It had its limitations, and it sure as hell could have been pushed past the \"Pat almost reveals his/her gender but then doesn't\" joke that seems to have been the limit of its humor.<br><br>So when there was a movie, I thought, \"Hey, they're finally going to push the character beyond the one-joke limit. I like Pat, sure, I'll like the movie!\" Well, I was stunned at how ineptly and poorly executed the whole thing was. The Pat character is immediately portrayed as boorish, intrusive, insensitive, and a host of other undesirable characteristics. Who decided this is what Pat was about? Who thought this would be funny? And how does this relate to the SNL character, anyway? I see no resemblance at all.<br><br>Even Dave Foley, whom I love and who is well-known for his excellence at portraying long-suffering comic characters, cannot soften the unrelenting ugliness that Pat exudes. In addition, I really think they took the low road with the \"Chris\" character. Of all the androgynous names they could have chosen (Terry, Bobby, Sam, the list is long), \"Chris\" is so boring! And the style of androgyny that was chosen, \"70's-esque flower child\", complete with page-boy haircut, while certainly complimenting Pat's dowdiness, was just one more joke with a very short lifespan.<br><br>By the time you finally realize the ugly boorishness that Pat is all about is not going to be a short-lived bit, but is instead the main (and only) joke, and that you will get no reprieve at all, ever, through the entire film, it will be too late. You will have suffered through the whole film, with very few laughs, and entirely missed out on a \"naive-but-loveable-doofus\" version of Pat, that you might have expected to get.","user":"ithearod","rank":[29,39]},{"title":"possibly the worst movie I have ever seen.","rating":1,"date":"14 July 2001","review":"No it is the worst movie I have ever seen. I do not know why any television station would even broadcast this drivel. You could use it as a form of torture for those you hate or really really despise. In my opinion all copies should be pulled from circulation and buried in a very deep pit, but then that would be pollutting the earth.  I would have given it a MINUS rating, but the poll doesnt go that low.","user":"bingo2","rank":[18,23]},{"title":"The worst movie ever","rating":1,"date":"19 January 2007","review":"I've seen a lot of movies, many good and many bad ones. But trust me on this; this is by far the worst. There is nothing positive I can mention about this movie. Why? Well I'll tell you why; The script is something that should have been thrown in trash, the acting is awful, the jokes are not even a bit funny and the characters are utterly annoying. I would understand if this movie would be a film for kids but with all of the \"undeterminable sex\" stuff, it's clearly not just for kids. A certain Quentin Tarantino helped out with the script(according to the trivia) and he will be relieved that he chose to be uncredited. It's hard for me to even imagine what types of idiots would do a movie like this or even worse find it funny. This is as I mentioned earlier the worst movie I've ever watched and therefore I can't recommend it to anyone. In my opinion this should occupy the no. 1 spot in the bottom 100. It's so bad that if you for instance showed it to some monkeys at a zoo, even they would understand how bad this movie actually is and would destroy the TV set after the first five minutes.","user":"robertseege","rank":[19,26]}]