[{"title":"Neat coming-of-age drama","rating":8,"date":"5 July 2003","review":"I tend to be a sucker for coming-of-age dramas like these, and this is one of the good ones.  The premise of a boy wanting to accumulate 25 cents to go to the movies is simple but engaging and effective.  Modern day viewers might look at his quest as stupid and redundant, but that's easy to say when you have enough money to go the movies every weekend.  To this little boy, it's his dream to go to the new local cinema on opening day.  Plus, in the days of the depression, the cinema meant much more than it does now. Nowadays, people don't respect the institution.  You see people put their feet up on the chairs in front of them, throw popcorn at the screen, shamelessly talk amongst themselves and to give a thoroughly modern example, let their cell phones ring.  I think it was Gene Siskel, who said the most beautiful sight is seeing a movie audience as the screen shines over them and their eyes are glued to the screen.  Cinema just had that magical feeling to people.  So though I was born five decades later, I was still able to put myself in the main character's shoes.  <br><br>Joseph Stefano, known mostly for his screenplay for \"Psycho,\" wrote this nice character-driven drama that took me on a journey.  Of course, that's also thanks to the child actor who played the main character.  He has a certain authenticity to him that not all child actors have.  If a child actor can say his lines like he means them and deliver emotions without dialogue, he's doing a good-enough job.  Not only that, but he holds his own opposite the brilliant Al Pacino.  Like always, Pacino gives a powerful performance, and I felt the character he played was different and unique. This time he's not a gangster or a cop.  Though he has a supporting role, he makes his screen time memorable.  Mary Elizabeth (I'm not gonna attempt to say her last name) is great as well.  <br><br>The situations our protagonist gets into are sometimes funny, sometimes sad. As trivial as his quest to get 25 cents may seem, I wanted him to accomplish it.  The ending is sad, though not unexpected.  Mainly, it's the richly developed characters and their interactions that make this a solid film.  <br><br>My score:  8 (out of 10)","user":"MovieLuvaMatt","rank":[12,12]},{"title":"things like this may happen all the time","rating":7,"date":"1 January 2007","review":"\"Two Bits\" was a noticeable change for Al Pacino, casting him as a man getting his grandson (Jerry Barone) to rectify an age-old matter in 1933 Philadelphia in exchange for a chance to go to the movies. Watching the movie, one gets a sense of the poverty characteristic of the Great Depression, but also how people understood that they had to try and go on no matter what. I realize that some people may consider it bad taste - if not unethical - to use the Great Depression for the setting of a nearly magical story, but I wish to assert that the movie did a very impressive job portraying the setting without getting sappy; then again, how could an Al Pacino movie be sappy? I recommend it. Also starring Mary Elizabeth Mastrantonio.","user":"lee_eisenberg","rank":[8,8]},{"title":"A Very Nice, Understated Movie","rating":8,"date":"4 September 2006","review":"This movie reminded me of some foreign films I own, low-key films which feature nice storytelling. There are no good guys vs. bad guys, no action, no blood, no sex: just a story of a day back in the Depression era in South Philadelphia.<br><br>The story centers around a young boy \"Gennero\" (Jerry Barone) trying to raise \"two bits\" (25 cents) to see a movie. It features his dying grandfather, played nicely by Al Pacino. Along the way the 12-year-old encounters interesting people and events. Pacino dishes out the usual grandfatherly advice and well meaning-but-on-Biblical theology (\"God puts a brick on your house in heaven every time you do a good deed and he takes one away when you are bad.\") Some have criticized Pacino for taking this role. I guess they want him to be a cop in every film. Well, he's a great actor and shows his diversified talents well in here. Whatever.....this film is loaded with charm and a nice story that's like a good book: hard to put down once you start. <br><br>At 84 minutes, it doesn't overstay its welcome, either. Even though there is little profanity, I would not recommend this as family fare because the film touches on a disturbing doctor and his wife.<br><br>Overall, I really enjoyed this movie and glad to see it's out on DVD now, too.","user":"ccthemovieman-1","rank":[23,28]}]