[{"title":"The leash has come off.","rating":8,"date":"28 November 2006","review":"Jubei, a rouge samurai who's wandering the land becomes involved unwillingly in the battle between an evil group of supernatural demon warriors known as the Eight Devils of Kimon and the country's government. After a town was wiped out overnight by a plague, so the eight devils could get in to get perform a certain mysterious task. Jubei soon is joined by a poisonous female samurai known as Kagero to find out the Devils' business is in this town, after one of them wipe out her ninja team and nearly her if it hadn't been for Jubei. He also encounters someone of the past, who he thought that he already had killed. <br><br>So I've gone back to my roots when anime was a childhood favourite of mine, but this one isn't for kids. I loved this flick when I was in my early teens, so watching it now was such a nostalgia trip and surprisingly it still holds up exceptionally well. The popular worldwide hit \"Ninja Scroll\", which was directed by Yoshiaki Kawajiri (who brought us the excellent \"Vampire Hunter D\") paves way for a maturely slick, extremely violent and intensely erotic outlook. Everything about it comes thick and fast. It frenetically exploits the blood sprayed violence like a running tap, but still never loses that beautifully tender edge that seeps into many of the situations. The compelling premise isn't a mind-bender, although a bit jaded, but its simple origins only enhance the taut lay out and poignantly dark array of blisteringly out-there conflicts. It's surprising in it developments and you're left amazed by the film's personality and unique world that's created. It vividly captures the period of this atmospheric world. They're such an imaginatively diverse barrage of dynamic characters, with the likes of the rock-build demon to the hunchback whose hump are a wasp nest and a snake lady who can actually shed her skin. This gave it a real eastern mythological state and only proves that the bad guys had the most fun. The story might feel like its there only to set up one spirited confrontation after another and really it is. But the story-telling element is effectively defined, as most of the main players get enough time to mould there own back story and present their significance to where it could be heading. Jubei makes a cool anti-hero and Kagero fits nicely along side him. The skillful animation has class, agility, originality and distinguishing details making its way into these stunningly pristine visuals. An aggressively crisp sounding FX makes the experience a whole lot more impressive with such a wide range and the oriental twang found in the eerily mystic music score makes this presentation more brooding in its blinding passion and checkered emotion. Kawajiri faced no restrictions here, and was free to come up with an illustriously innovative and majestic anime piece that works in every frame. <br><br>\"Ninja Scroll\" is more highly involving than you would believe. Recommended.","user":"lost-in-limbo","rank":[17,18]},{"title":"Great high-octane ninja action.","rating":9,"date":"15 September 2003","review":"A great movie to just sit back and enjoy, not in the mind set of Akira, Ghost in the Shell or Perfect Blue just a great all out action film. When I first saw this movie I was amazed by the high quality of the action and the animation. To this day they both still stand the test of time. One of the best anime's set around the time period of feudal Japan, although the main reason to see this film is for the characters. Not so much for the good guys but the villains. The designs of the villains are outstanding and there individual powers uniquely brilliant.","user":"mike-moran","rank":[20,22]},{"title":"An absolute favorite, and highly recommended :)","rating":19,"date":"19 November 2003","review":"Ninja Scroll is easily one of my favorite anime movies. Great animation (the minimal movement in Japanimation far superior to the over-produced Disney cloned animation style), great story and characters, a decent running time - it all works for me.<br><br>Recently here in Australia, the movie has thankfully been re-released in the 10th Anniversary Uncut version. After a controversial screening on commercial TV some years ago, the video version was upgraded from MA to an R-Rating, and had some sex scenes cut. The new DVD has been restored, uncut.<br><br>A classic, highly entertaining and impressive anime - strongly recommended to Japanime newbies :)","user":"starbase_74","rank":[32,38]}]