[{"title":"So bad, it is good!","rating":2,"date":"16 October 2019","review":"One of the most horrendous films I have ever seen. And one of my favorite movies, for all the wrong reasons. Nothing gets more atrocious and hilarious than this!<br><br>Normally I divide my reviews into good, mixed and bad parts. But for this film, there's just good - very little of genuinely good and a lot of good things for all the wrong reasons. Genuinely speaking they are really bad, but as I didn't really hate them, I didn't want to call them as \"bad\".<br><br>Speaking of actual good, Robert Englund shows off his comic skills and goofiness really well. It's being done in a completely wrong movie. There are homages to Tom and Jerry and Looney Tunes. Again in a completely wrong movie. By the tone, you might have guessed it (correctly) that it's a guilty pleasure of mine. Now let me just say what were really good. As I said, Robert Englund has a really good comedic side to him, and he shows it off well. There are Looney Tunes references and are great in what they are. Also, it has the flashbacks of Freddy's past and we get to see the pre-boogeyman Freddy. I have always wanted to see a full fledged Freddy origins movie or a short film. So, I liked those parts. And that's all about it. The movie is an absolute trash. I can agree with that, though I like it. The comedic and slapstick parts were the totally wrong choices for a Nightmare film. Robert Englund might have shown his comedic skills, but Freddy doesn't have them. It is the worst incarnation of Freddy. They lost their balance between maniacal Freddy and goofball Freddy since part 4. Here, they went full on bonkers with goofball Freddy. The kills involve Freddy playing Nintendo games with power gloves to kill a moron, and literally says \"boing, boing, ... boingboingboingboing\". John Doe kill reminds me of a generic Road Runner episode with Coyote planning to kill the bird. And the Carlos kill is my favorite! Freddy simply scratches a blackboard and blasts the heads off! You need to see the reaction of Carlos in the entire sequence. If that doesn't make you laugh, nothing will. In fact, this movie is a complete package of laughter. So, what makes it so bad for so many people? Despite all of this, it takes itself seriously. While a lot Freddy fans get enraged by the seriousness, I get more of a laugh out if it. It's so atrocious that it is entertaining! All the actors have given incredibly terrible and over the top performances. Really dumb and corny, making the movie more entertaining. I can appreciate the basic ideas for 4 &amp; 5, movies which I didn't really like. This doesn't even have that sort of an idea! Every idea that has been put in it are the wrong ones. And those wrong ideas are implemented in the worst way possible. .\n.\nConclusion : All of the things I liked about it are absolutely wrong for a movie like this, but more appropriate for a parody of the same. Freddy's past is shoehorned like anything, and if you're in a serious mood, this movie is infuriating as hell. You need a right time to enjoy the atrocity of it. I do like it for all the wrong reasons, but in all seriousness, even I would say \"F\" THIS MOVIE!<br><br>Rating.<br><br>Score : 2.2/10<br><br>Grade : F","user":"NpMoviez","rank":[12,14]},{"title":"Lots of fun","rating":7,"date":"7 March 2003","review":"I guess I'm part of the silent minority who enjoyed this film.  Is it one of the best of the \"Nightmare\" series?  Maybe not, but I had lots of fun with it.  Freddy Krueger reaches his evil, wisecracking potential.  Since parts 4 and 5 kind of lagged the series down, I felt this so-called final installment (\"New Nightmare\" is the real finale) brought the series out of its slump.  There are some great nightmare sequences, including one where Breckin Meyer plays a stoner who gets trashed, falls asleep and gets stuck in a video game to which Freddy controls.  This is both a highly original and hilarious sequence, especially when we see him out of the dreamscape, hopping around like Super Mario.  And Freddy belts out the funny one-liner, \"Great graphics.\"  And since the movie was made about 10 years ago, it brought back memories when Freddy started controlling the game with the Powerglove.  Anyone who remembers the first 8-bit Nintendo remembers the Powerglove.  <br><br>The cast is superb.  Lisa Zane is perfectly cast in the lead.  I haven't seen Yaphet Kotto since \"The Running Man,\" and I think the last time I saw that film was about 5 years ago.  He's another great, underappreciated actor who possesses a powerful screen presence.  And who can forget the cameos? The best one is by Johnny Depp (from the first \"Nightmare\") playing a spokesman for an anti-drug commercial.  <br><br>The 3D sequence at the end is really awesome!  So for those who are looking to check this film out--please rent or buy it on DVD!  Hopefully all the editions come with the 3D glasses, but I'm sure the video edition has the 3D element removed.  <br><br>I personally didn't see many things wrong with the film.  It even elaborated on Freddy's backstory.  The film is a great mix of humor and scares, and the gross-out effects are terrific.  Could this have given better justice to the franchise?  Of course it could have.  But Rachel Talalay did a fine job. And finding the perfect conclusion is easier said than done.<br><br>\nAnd in closing, I loved the montage over the opening credits.  Fans of the series will be delighted, and will look at it as a tribute to beloved Freddy.   <br><br>My score:  7 (out of 10)","user":"mattymatt4ever","rank":[46,67]},{"title":"OK, I think this is Freddy's 6th death already","rating":2,"date":"11 November 2003","review":"Freddy's Dead: The Final Nightmare, the sixth installment of the Nightmare on Elm Street series and once again another bad sequel. I think this is tied up with the last sequel of the Dream Child. I was lucky enough to get the Nightmare on Elm Street series box DVD set for my birthday, so I got to see all the sequels. May I say that I'm just getting more and more disappointed though with these sequels, at least the past two, it just seems like Freddy lost his edge. It's almost like the writers were trying to give Freddy a soul and they're just destroying it instead of reinventing the story. This was a sequel that wasn't needed, sorry to Robert Englund, but this was very much below what Freddy Krueger represents.<br><br>Freddy is back, but he's got something we don't know about, a daughter. Maggie, she's not aware that he is her father, but soon she finds out what his dark secrets are and he wants her help. She has to do her best to resist his powers, but it's hard with all the good memories she has of her loving father. Ironic, isn't it? But Freddy isn't giving up without manipulating her into his ways.<br><br>Freddy's Dead: The Final Nightmare is also presented in 3-D, radical, huh? Note the sarcasm. This is one of the worst sequels, it's tied up with the fifth sequel of the Nightmare on Elm Street series, I'd rather watch the second Nightmare on Elm Street to be honest. This just had bad acting, stupid editing, and just over all a bad idea for a story. I didn't like the concept of it and it just ruined the whole idea of who Freddy Krueger really is, the death master of nightmares, not Father Knows Best.<br><br>2/10","user":"Smells_Like_Cheese","rank":[64,98]}]