[{"title":"Hilarious","rating":10,"date":"23 July 2000","review":"This movie is wonderful. It points out all of the absurdities of the earlier 'hood movies. You need to have seen most of the movies being parodied in order to see the true depth of the humor in this movie.<br><br>Absolutely one of my favorite light comedies with \"I'm Gonna Git You Sucka\" and \"Half Baked\". I can't put it in a category with \"Airplane\" because that is the standard by which all other parodies are measured.","user":"keith_b","rank":[49,57]},{"title":"This movie shows that stereotypes can be funny.","rating":7,"date":"19 September 2005","review":"Spoofing practically every \"growing up in the hood\" movie, \"Don't Be a Menace to South Central While Drinking Your Juice in the Hood\" is a laugh a minute. Following the adventures of Ashtray (Shawn Wayans) and Loc Dog (Marlon Wayans) in LA's black ghetto, it's one joke after another - the way that a Mel Brooks or Leslie Nielsen movie is. Probably the funniest scene is when they enter a convenience store. The owner, convinced that African-Americans would only enter his store to steal things, follows them around - while a rich white man comes in and proceeds to empty the place. Containing virtually every imaginable use of the N-word, \"DBAMTSCWDYJITH\" is pure hilarity. Those Wayans brothers have it down.","user":"lee_eisenberg","rank":[47,57]},{"title":"Hits more often than it misses","rating":8,"date":"31 March 2000","review":"Shawn and Marlon Wayans, along with director Paris Barclay, have created a very humorous satire of the flood of films recently dealing with African-American life in the ghettos of inner-cities of America.  \"Boyz in the Hood\" and \"Menace II Society\" are among the films at which the Wayans brothers poke fun.  \"Don't be a Menace...\" follows the story of Ashtray(Shawn Wayans) as he wades through a series of episodes in Barclay's \"hood.\"  He lives with his father, who is \"only a couple of years older than him.\"  Among the lessons his father teaches him are:  \"No smokin' my shit, no drinkin' my shit, and if you bring any of them hos up in here, make sure I fuck 'em first\", and (drinking and driving)\"That shit is fun, man!\"  No stereotype or politically-correct boundary is too sacred for the Wayans brothers to poke fun at.  Some of the jokes hit, some miss, and the fun will definitely be increased by those who have seen the films that \"Don't Be A Menace...\" frequently jests.  Not extremely culturally-important fare, but a good laugh, nonetheless.","user":"joswalt","rank":[24,28]}]