[{"title":"Good","rating":8,"date":"23 February 2020","review":"I've been slowly making my way through Guillermo del Toro's catalogue of movies and this is my first time watching Hell Boy. If you're a Del Toro fan, then this one won't disappoint. He's such a superior director - he adds artistry to this action film through his use of shot making, pacing and colour. At times, the dialogue attempts to be a bit too cute and the love story adds little to the plot, but overall, it's a fun movie that doesn't try to overextend itself.","user":"MR_Heraclius","rank":[39,40]},{"title":"One of the best comic book films","rating":10,"date":"2 February 2005","review":"Towards the end of World War II, the Nazis engage in efforts to win the war through means of invoking the paranormal. They attempt to open a \"portal\" for seven beings who are meant to invoke the apocalypse on Earth, but a U.S. Bureau of Paranormal Research and Defense is on hand to stop them before they get too far. They do not stop them as quickly as they'd like, however, and the U.S. troops soon discover that a bizarre infant, part devil, part man, red, with horns and the demonic works, with a large right hand made of indestructible stone, has gotten through. They acquire the infant, we go forward in time to the late 20th Century, and most of the film concerns an adult Hellboy still working in conjunction with the U.S. government to help battle monsters and the paranormal.<br><br>Hellboy was a 10 out of 10 for me, but there are a number of criteria for any viewer to have such a high opinion of it. One, even though director Guillermo del Toro is a big fan of the Hellboy comic books and many comments have been made by him, comic creator Mike Mignola and others that the film is faithful to the books, they've also said they've changed it to suit the context of the film, so you have to not be a purist about source material to screen translations (or current screen instantiations). Two, you have to have a taste for fantasy where the creators are not very concerned with making the material coherent with or plausible in the actual world. Three, you have to enjoy your fantasy both very dark (on the horror side) and humorous/sarcastic at the same time. Four, you have to like an epic, sprawling feel to your fantasy. And Five, you have to not hate cgi creatures. I meet all of those criteria. How many you meet will likely determine how well you'll like Hellboy.<br><br>What worked best for me was the material that showed Hellboy, portrayed exquisitely by Ron Perlman, as just a regular guy cum sassy detective. Even though he's half demon, a large part of the comics, at least--and this is hinted at in the film, particularly in the climax--is a continual nature versus nurture \"debate\". He was raised by humans who were as normal as they could be, being government agents in a bureau dedicated to the paranormal. So he has a large number of human-like quirks, including a love of old music, beer, cats, pancakes, chili, and so on. He's also a cigar-smoking, smart-assed detective. Hellboy is at its best when it focuses on these characteristics.<br><br>But everything else works well, too. Hellboy has a monster-like counterpart, Abe Sapien (Doug Jones), and a \"freak\" love interest, Liz Sherman (Selma Blair), who are almost as fascinating as he is. The villain and neutral creatures (such as the \"half-creature\" with a speaking role towards the end) are just as captivating. There are also other characters providing enjoyable comic relief, most notably Tom Manning (Jeffrey Tambor). His adopted father, Professor Trevor \"Broom\" Bruttenholm (John Hurt) is intriguing. And newly recruited \"caretaker\" John Myers (Rupert Evans) shows promise, even if we do not get to spend much time with him here. Like many films of this type, I'd love to see all of these characters further explored in prequels, sequels and spinoffs. That's a good sign, because it shows that del Toro and fellow writers Mignola and Peter Briggs have successfully conveyed a world with \"deep\" characters who have extensive histories.<br><br>Also worth noting is the cinematography/lighting/production and set design, which is consistently beautiful, and ranges from the popular recent trend of more monochromatic textures (blue is the color of choice here), to the strong chiaroscuro of the comic books, to striking contrasts, such as a mostly monochromatic scene which is suddenly penetrated by a supersaturated red stream of blood. The sets are all engaging, from exteriors (one hilariously claimed to be in Newark, New Jersey) to interiors, urban to expansive countryside and even outer space environments.<br><br>As for effects, which are a large part of the film, I can't for the life of me imagine someone claiming that cgi looks \"fake\" compared to mechanicals, practicals, stop motion (ala Harryhausen), and so on after they see this film. For my money, these are some of the most impressive cgi creations yet, including some great cgi fight scenes.<br><br>Hellboy is captivating, suspenseful and humorous. It is well worth watching for anyone with a taste for fantasy.","user":"BrandtSponseller","rank":[177,223]},{"title":"Hellboy, not perfect, but entertaining.","rating":7,"date":"1 December 2004","review":"Let's be blunt, the movie is, in essence, a little lumbering and flawed and has a rather odd climax. The beginning is overlong and vaguely too fantastical, but once you realize this is a very different world, a comic book really, and normal rules don't apply, it can be forgiven. In fact most of the flaws can be forgiven because of Ron Perlman and what he brought to the picture.<br><br>This is one of few movies I've ever gone to see on the opening weekend, possibly the only one. And I did so because I was already a fan of Ron Perlman and it was great to see him in a leading role, even though he's covered in makeup. Perlman is the best thing in this movie; he is perfect as Hellboy. He swaggers through it as if he'd always been a leading man. Delivering one-liners with ease and to perfection, battling monsters through subterranean sets and city streets, and giving a great comedic performance as well as a very emotional one that makes you just love the big red oaf. A great feat considering the extensive makeup he had to act through.<br><br>And the makeup and prosthetics are the best of its kind I've ever seen. There's movement and expression in the lips at times that you would think would be impossible. You might at first think that the lips are rather stationary and unexpressive, but if you just pay attention you'll see that there is a lot of movement and subtleties to it. Rick Baker should be praised for his work in this, it's amazing.<br><br>Doug Jones is awesome as the body of Abe Sapien. His movements are truly beautiful. And David Hyde Pierce as the voice is perfect. Abe is a very interesting and neat character that I wouldn't mind seeing more of. And his makeup is as amazing or even more so than Hellboy's.<br><br>John Hurt is great in this, as is Jeffrey Tambor. Everyone in this does a great job. But Perlman's performance as Hellboy really holds the movie together. His character stands out and speaks to the audience better than any other.<br><br>If you liked X-Men or Spider-Man don't expect a movie as well polished and put together, but you should be able to enjoy it and the more overt comic book feel of the movie. And unlike the aforementioned movies there is quite a bit of light humor throughout Hellboy that should garner some laughs from most anyone.<br><br>Hellboy isn't perfect, I would have changed some things, but I had fun watching it and in the end, especially for a movie of this type, I think that's what matters most. In fact I like it more now, after seeing it again, than I did when walking out of the theater.","user":"has_no_pseudonym","rank":[142,178]}]