[{"title":"Best Van Damme Sci-Fi-Action comic book classic film!","rating":10,"date":"30 December 2015","review":"Timecop (1994) is my favorite Van Damme action sci-fi classic! Just Like Sylvester Stallone's Judge Dredd, Van Damme's Timecop is very Underrated action sci-fi flick ever. One of my favorite and serious Van Damme's roles in this film. Great travel time, great action, great villains and great story. I love the fighting sequences as well. One of my favorite action movie flicks till this days. It was directed from Peter Hyams who become a good friend with Van Damme and a year later he directed Sudden Death with Van Damme. He was the only one of the directors who come visit Van Damme in hospital after he got injured. His son years later directed two Universal Soldier film sequels. I love this movie to death and it is my 6th favorite best Van Damme movie.<br><br>What I meant in the top written: \"to take a few sci-fi leaps of faith\" This movie involves time travel about a cop who travels from 2004 to 1994 and try's to prevent the death of his wife and change the future. It does involve travel into the past, so it immediately presents a time-travel paradox which can't really be resolved. Timecop (1994) is very underrated film, there was a sequel and a short-lived ABC series. I watched the sequel without Van Damme in it and the sequel sucked. In here you have nice realistic martial arts and action. You have a lot of explosions and it also involves conspiracy. Ron Silver did an excellent joy playing a villain in this movie as Senator McComb. Mia Sara was absolutely wonderful as Max's (Van Damme's) wife Melissa.<br><br>Timecop is more classic. Half-n-half sci-fi/action films get lost beneath pure action and pure sci-fi but Timecop is top shelf. This was another childhood movie. I actually rented on a VHS tape in the 90's my parents paid me for the VHS tape so I could watch this movie. I like this movie a lot. I have it on Blu-ray in my Van Damme collection. I have grew up with this movie and it was a hit in 1994 when it was released out. Today I love it so much. The film is a lot smarter than people give it credit for. I also think Van Damme definitely deserves some credit for his non-action scenes in this film, but I suppose his performance in this film will always be remembered for that splits scene. The movie it self has a good look, action and effects and very good acting performance by Van Damme, you really feel bad for him and want to see him kick bad guys asses. Also I think that this movie has Van Damme's best hairstyle. That mullet Is the best he ever had, not the one in Hard Target. And yes, this movie, like many other Van Damme classics deserves a special edition.<br><br>Not only this movie is my favorite best Van Damme movie, it is one of those movies that you watch over and over again and never gets tiring . A lot of my friends that I know in real life, loves this movie. Someone said it is even the best one. Honestly this is the third time Van Damme played in a science fiction movie. The first time was in cyborg (1989) and the second time was in Universal Soldier. I never really liked Cyborg, but I absolutely love this movie. The action sequences where amazing, the fight scenes and Van Damme martial arts where very realistic. I always enjoy watching Timecop. I enjoy the story, the concept and the action. I think this film is beginning, to get a bad wrap from the general audience. like \"oh it is cheesy\". \"oh its a guilty pleasure at best\" that's stupid! This film deserves a special edition in some way.<br><br>That is the more or less basic plot, In order to even try watching this movie, you MUST LOOK PAST THE PARADOX. If you don't, this movie has zero credibility, and is not worth your time. The paradox in leap faith of this movie is also that works so well and fits with the story. Jean-Claude Van Damme was great. In my opinion, this was one of his best performances. I also liked the opening scene and the scene in which he goes back to 1929 to arrest his partner.","user":"ivo-cobra8","rank":[89,92]},{"title":"Mainstream Van-Damage.","rating":8,"date":"20 January 2006","review":"Timecop is probably remembered as his last good movie before he got into a rut of mediocre(though successful) action flicks.Its also the most mainstream picture he was ever in for my money.<br><br>In 1994 Time-travel has become a possible reality.Washington decides that it needs to be \"policed\" from criminal activity and the paradox's of undoing life as we know it.Cut to 2004:Enter Van Damme as Walker the on-the-rocks time-cop who uncovers a plot to swindle the presidency by a corrupt Senator McComb played by Ron Silver,who actually engineered the murder of Walkers-wife(Mia Sara).Can Max stop McComb?Can he go back and save his wife?After some decent gunfights and roundhouses you'll have to find out.<br><br>Timecop benefits from having a talented director Like Peter Hyams behind the wheel for this one.He stages everything well,Keeps the action and plot flowing,Special FX are engaging,and gets a very good performance by Van Damme.Who comes off vulnerable and like a real person.The production values are very good here too.It is also pretty decent political backdrop/Sci-fi combo.<br><br>Ron Silver is a great Bad Guy here as McComb.He gets to shoot, beat people up,Snarls And looks frankly maniacal at times.Mia Sara is engaging and looks beautiful as ever.Bruce McGill has some funny bits as Van Dammes Boss.The very sexy Gloria Ruben also shows up as Walkers new partner.<br><br>Timecop is not the greatest when it comes to plot-holes.But unlike the recent version of HG Wells Time machine, it is a very fun movie.And one of Van Dammes best.","user":"argentobuff","rank":[46,56]},{"title":"turn back the clock before van damme's career was history","rating":10,"date":"5 January 2008","review":"kicks? check <br><br>punches? check <br><br>signature semi-nude van damme splits? check<br><br>van damme playing multiple roles? check <br><br>'Pete' from MacGyver? check<br><br>time travel police going back in time wearing futuristic uniforms labeling themselves as Time Enforcement Commission officers indicating to those in the past that time travel will one day be possible even though TEC code 40.8 subsection 9 strictly forbids time travel with intent to alter the future as a crime punishable by death? check<br><br>Van Damme takes a break from his usual tournament-style fare to bring us a movie based around a story rather than a series of jump kicks. I won't repeat the synopsis you can read on IMDb. What I will say is that this is honestly the single best movie of Van Damme's career. It made a solid attempt at a story, it had decent special effects and sound effects, the acting was as good as van damme gets, and the action was good. Perhaps if he had made a few more of this caliber he might have become a more stable box office draw rather than the queen of straight to video punch-and-kick drivel.","user":"frankduxvandamme","rank":[24,28]}]