[{"title":"Very strong depiction of Satan worshippers","rating":9,"date":"13 July 2002","review":"Jim Van Bebber's short film My Sweet Satan (1994) is supposedly based on real life character, who committed a horrible murder, was then sentenced to prison, where he finally killed himself by hanging. Director Van Bebber plays Ricky Kasslin, the main character, who is young fellow who listens to heavy metal, has one of the ugliest hair cuts ever, and acts like some animal, and believes that Satan is his Master and he loves Satan the most.<br><br>This film really makes me wonder why this kind of things happen. Those Satan worshippers are depicted miserable, but dedicated lost persons and souls, who find a meaning to their lives by worshipping and praising the Satan, the most evil thing imaginable. I think this film definitely doesn't promote Satanism, since the final phrase Ricky's friend says in prison is so underlining, and tells the opinion of writer/director.<br><br>\nThis shortie has some very interesting cinematic elements, most notably the soundtrack which consists of different metal bands, but also very menacing sounds and moans which are played also backwards and create very ominous atmosphere and a feeling of evil and pure wickedness. Also, different kinds of camera techniques add to the atmosphere and the film is very great in its elements and visual power. <br><br>The infamous ending is very disturbing and graphic, and the whole short film is full of violent and off putting imagery like actual body piercing, blood and terror, but the last murder is the worst, and that murder finally led the main character to prison and suicide. The suicide is also very relentlessly and realistically depicted, so this film is definitely not nice to watch. The film is important since this madness really exists in the world and this film just shows some facts and asks couple of questions without moralizing. I liked this very much and appreciate the cinematic talent of Van Bebber and give this 9/10. This little film is not likely to be easily forgotten once experienced.","user":"Bogey Man","rank":[6,9]},{"title":"Those must be the fakest tattoos I ever saw in my life.","rating":2,"date":"29 December 2018","review":"How the hell can this short movie get such a high rating? It's obvious that not alot of people watched it otherwise My Sweet Satan would never get such a high average. I stumbled on this movie as I read that it was supposedly based on a true story. Since I do like a bit of gory movies every now and then I gave it a shot. The reality is that the acting is bad, the filming even worse and the sound just awful. Not the music though, that's my kind of music, but the recording of the voices and the editing was just awful. The story is just boring and stupid, and it's not that bit of blood spatter that's going to make it a good gore movie. Luckily it's a short movie and so I only wasted 20 minutes of my life. 2 stars for the music, all the rest is just garbage.","user":"deloudelouvain","rank":[2,2]},{"title":"Rather shocking horror short.","rating":7,"date":"24 October 2004","review":"\"My Sweet Satan\" is based on a real-life murder/suicide case where a dangerous drug dealer took a teenager out into the woods,got him high on LSD,accused him of stealing money,tortured him and stabbed him to death whilst screaming \"Say you love Satan!\".After this sickening event his friend stomped the boy's head to the pulp.\"My Sweet Satan\" is a pretty gross little horror short.There is a hanging,a closeup nipple piercing and extremely brutal head stomping.Jim Van Bebber is fairly convincing as a creepy drug dealer and Mike Moore is okay as his whiny victim.This disturbing short is clearly not as good as Van Bebber's masterpiece \"The Manson Family\",but if you enjoy low-budget independent horror you can't miss it.7 out of 10.","user":"HumanoidOfFlesh","rank":[3,4]}]