[{"title":"Talos The Mummy (Tale of the Mummy) (1998)","rating":7,"date":"26 October 2005","review":"This somewhat unknown mummy movie starts excellent, with a great mysterious touch and some nice special effects. There is also some wonderful acting by Christopher Lee (as usual). But after the main titles (with a strong piece of music by Stefano Mainetti) this movie fails to maintain the great atmosphere. Some locations just aren't interesting. That is the biggest problem of the film. The rest of the cast isn't bad at all (Jack Davenport does a great job). Talos is not your usual mummy, but he's quiet original. The film has a great plot with some surprising moments. Do not confuse this with The Mummy (1999) by Stephen Sommers, while that one is more adventure than thriller, this one is more thriller than adventure. Overall an entertaining film, the prologue is really worth the effort. I strongly recommend this film to fans of the Hammer horror films.","user":"Boromir007","rank":[20,25]},{"title":"Enjoyed it","rating":7,"date":"22 December 2002","review":"I actually erm....well eh....enjoyed this movie. I was suprised to find all of the negativity about it here on imdb. I agree some of the voice audio was difficult to hear but that's about the only criticism I agree with. Story was fairly typical of this genre but the ending was brave - not copping out to another 'all is well' happy ending. If I have a problem with the ending it would be that it is not all that clear what actually happens - but I think I got the gist. I score it 7.5 out of 10.","user":"martincooper","rank":[19,25]},{"title":"Good cast, curious script","rating":23,"date":"23 March 2004","review":"I took a chance on this, based on the cast (Christopher Lee, Honor Blackman, Sean Pertwee, Lysette Anthony, etc.) and because I liked some of the director's previous films (HIGHLANDER, THE SHADOW).  But this was definitely a film where the parts were greater than the whole.  It had some good moments (and, like many mummy movies, the early scenes in Egypt were among the highlights), but overall the film's plot unraveled faster than the mummy's wrappings.  (I would recommend one of Hammer's classics, be it the 1959 MUMMY or 1971's BLOOD FROM THE MUMMY'S TOMB, over this.)  I have to admit I have only seen the version released here in the U.S., which is 88 minutes compared to other running times of 115 and even 122 minutes, so maybe the longer cut would help.  Would like to point out something, however:  Throughout many of the reviewer comments made about the film on IMDB, it is repeatedly stated that writer/director Russell Mulcahy must be an American because of all the mistakes the movie made when it comes to London lifestyles...sorry, folks, but Mulcahy is from Melbourne, Australia.","user":"BijouBob8mm","rank":[16,22]}]