[{"title":"Pleasant Enough but Underpowered","rating":6,"date":"9 December 2002","review":"This movie version is pleasant enough but does not have the power of the stage play upon which it is based.  Spoilt brat that I am, I saw the original production at the RNT in 1990 with the amazing Alec McCowen as Uncle Jack.  I am a great fan of Michael Gambon, but he is simply miscast in that role for the movie.  Not so Meryl Streep, who does a superb overpowering aunt.  The delightful Catherine McCormack and Rhys Ifans do a good job of the love interest.  This is nevertheless a shadow of the stage play.  My better half liked it, but had not seen the stage version.  For lovers of Irish drama the film is worth 90 minutes of your time.","user":"ian_harris","rank":[12,13]},{"title":"Perfection","rating":30,"date":"30 October 1998","review":"This movie was completely wonderful for every single moment. The cast is terrific from top to bottom; the cinematography is gorgeous, even the soundtrack is memorable.  It is the type of movie where very little happens, but it does not matter a bit.  The characters are intriguing enough to hold your interest.  I do not know how Streep does it; I think her talent is limitless.  Everyone else is great too.  For 92 minutes you will forget everything else and if you can allow yourself, you will be swept away by this movie.","user":"Boyo-2","rank":[21,26]},{"title":"Play's significance lost on filmakers","rating":5,"date":"27 August 2001","review":"What distinguishes stage from screen?  If a viewer had only Brian Friel's play, `Dancing at Lughnasa' and its cinematic adaptation to judge from, he or she might be tempted to answer that, while stage is highly engaging and meaningful, screen is superficial, insulting, and thin in content.  Friel's play is structured in such a way that a film version necessarily provides a fascinating comparison of the two mediums.   However, director Pat O'Connor's efforts tend to demonstrate the weaknesses of cinema rather than the strengths.  Adapting a play to the screen has often proved to be a tricky business; it involves some pitfalls which this film does not manage to avoid.<br><br>Screen is extremely literal.  It allows for--in fact, often demands-- a sense of realism seldom conveyed on stage.  The makers of `Dancing at Lughnasa' are clearly appreciative of this fact, and have made valiant, if not always successful, allowances for it.  The primary result of their efforts is a heightened sense of setting.  The world these characters inhabit feels real.  We get shot after shot of Irish countryside; set and costume design seem perfect for Ireland in the 1930s.  Mark Geraghty's production design is one of the best things about this film.  Additionally, excellent accent work by all the actors proves perfectly convincing and adds depth to the setting.<br><br>However, such a literal medium has its drawbacks.  In particular, young Michael's narration, which was used to achieve a specific effect in the play, seems unnecessary here.  The play's Michael is full-grown and speaks young Michael's lines as his `memories' take place in the action on stage. The film makers did well to recognize that there was no cinematic equivalent for this; having the adult narrator speak the child's lines would have seemed ridiculous.  However, in removing that aspect of the narrator's role, they stripped away most of his significance, as well.  The film's narrator seems like an afterthought, occasionally intruding into the action to tell us that what we are seeing is a memory.  We could easily forget that the events are, in fact, happening in flashback.<br><br>While some of the abstract elements of Friel's original play do not translate well onto the screen, individual performances are only aided by the medium.  Since film is not hindered by the simple vocal requirements of stage, the actors are able to convey much more subtlety of meaning.  The players in this film version are, without exception, excellent.  Meryl Streep stands out as the proper, reserved Kate.  Her manner is nervous and slightly shrill, but conveys genuine concern for her sisters.  When Kate opens up and allows herself to dance, Streep shows a joyful abandon which is believable and pleasant to see.  Another standout performance is delivered by Michael Gambon in the role of Father Jack.  His lines are spoken with calm assurance, betraying Jack's senility only by their complete lack of relevance.  Gambon's distant eyes and quiet detachment reinforce the feeling that he exists in a world entirely different from the rest of the family, a point which is absolutely crucial to his character.  Supporting characters are also portrayed dead-on.  This film has some of the best acting that could have been hoped for.<br><br>Despite these considerable advantages, the movie runs into trouble when it tries to adapt Friel's plot to the screen.  Film is so much more visual than theater that it demands a great deal of variation in order to keep the viewer interested.  Since we do not have the benefit of the actors' physical presence, we need other things to hold our attention.  In attempting to add variety to the play's structure, screenwriter Frank McGuinness breaks up Friel's original dialogue into smaller scenes, most of which involve household chores.  McGuinness also tries to represent some events which the play's dialogue only alludes to.  The result is a film which is so fragmented that we lose sight its content.  Friel's dialogue is integrally important to his play, and the same is true for the film.  However, the way that the film breaks up this dialogue among tiny scenes is extremely distracting.  We lose sight not only of the dialogue's meaning, but of the relationships between characters.  Since the adapted structure requires that the five sisters rarely appear in the same scene together, it is very difficult to get any sense of the dynamic in the household.  Ultimately, so much time is spent with action rather than dialogue that the characters lose a great deal of their depth.  Perhaps film makers did not trust their audience to be as interested in the characters as in the events.<br><br>It is somewhat unjust to evaluate an adapted play simply in light of the original.  However, this cinematic version fails to hold up even on its own terms.  It is difficult to conceive what value those who have not been exposed to the original play could see in this adaptation.  What we get is a good-looking, but ultimately insubstantial, portrait of five women who could all stand to let their hair down a little bit more than they do.  I can't help but think that Friel had more in mind than demonstrating the value of letting one's hair down.","user":"asizer","rank":[25,32]}]