[{"title":"$1,000,000? For a night with Robert Redford? For real? Where do I sign up?!","rating":8,"date":"17 October 2005","review":"Wow, I am a little surprised by the rating. Only 5.3? Come on, this was a good movie! Was it the best? No, but it's better than most I have seen. If you were offered a million dollars, could the strength of your relationship survive it? I really got into this movie, because I knew how it would damage the couple's life. I think that they did deeply love each other, but they mention how they were childhood sweethearts, and kind of rushed into marriage. So, the point is, they've probably never been able to question if they had feelings for anyone else.<br><br>Struggling financially is horrible. How far would you go to get some money? People will go the distance and sometimes take a front seat with the devil! \"Indecent Proposal\" goes all the way and shakes up human emotions. I really felt that this was a very good movie and should be watched. 5.3 is a little harsh, what was so bad about it? <br><br>8/10","user":"Smells_Like_Cheese","rank":[168,218]},{"title":"An interesting idea is condensed into a superficial and glossy affair that does nothing of value","rating":27,"date":"27 December 2005","review":"David and Diana had been in love since college and married into a dream life where both are happy and able to pursue their dreams together. However they hit upon hard times when Diana's real estate work dries up and soon the pair decide that the only option available to them is a literal last throw of the dice with their last few thousand in Vegas. Despite an early winning streak they end up worse than they started. About to head off, Diana catches the eye of gambling billionaire John Gage who uses her as a lucky charm to win another million or so. Afterwards they get together to play some pool and Gage turns the conversation to the idea of what money can and can't buy  specifically offering the Murphy's a cool $1,000,000 for one night spent with Diana.<br><br>When this film came out, the basic concept was enough to give it lots of free advertising by getting the nation asking itself \"what would I do?\" and all the hype over that allowed the producers of the film to avoid people finding out that there really wasn't much worth seeing passed this question. It should have been so different though, because it could have been a classic morality tale that went deep within the characters to see what is there. However it doesn't really do this and instead we are left with a rather vacuous affair that is given plenty of gloss but is essentially lacking in interesting things to say. The tensions between David and Diana never get beyond the level of strops and it never even makes an attempt at moral debate.<br><br>The fact that the characters are so thin doesn't help either. David and Diana are basic but the real failing is in Gage; he should be a rather sinister figure who plays with people like he plays with his money but instead he is just a twinkling eye and a sly smile  in fact, he is Robert Redford. This is part of the problem because, although the material is weak, the cast cannot do anything to improve the situation. Redford is far too smooth and playboyish to really convince in the main role  he cannot tap into any darkness or complexity and his failing is just one of the film's failings. Moore doesn't help either with a basic role where she doesn't seem to understand what her character is supposed to be feeling and therefore cannot convince in many of her scenes. Meanwhile Harrelson puffs and blows on cue but adds little. The support cast features turns from Platt, Cassel, Connelly and Thornton but aside from being recognisable faces they don't add much. Lyne directs with typical glossy style but he has no clue how to get deeper into the characters and story so instead just throws in lots of exploitative but empty scenes in the hope of somehow emotionally engaging his audience.<br><br>Overall this is not an awful film but it is so superficial and hollow that it is just bland and glossy. It only is made worse when you think of the potential it had to be a complex and insightful modern morally piece. Those happy with the substance and complexity of a slushy music video will enjoy it but the majority will leave it wondering what all the fuss was about and how such an interesting concept was so completely fouled up.","user":"bob the moo","rank":[53,70]},{"title":"Something to learn from","rating":28,"date":"28 January 2002","review":"Without doubt, the touchy theme makes this film worth watching.<br><br>However, your opinion of it will, very likely, be influenced by what your own reaction to the 1 million dollar proposal would have been if you were in the same situation.<br><br>The film doesn't condemn anybody. It just reveals the fragility of a relationship, despite the strong love that resides in it.<br><br>Does it really matters if this kind of indecent proposal is not a realistic scenario? The millionaire willing to give a million dollars to spend one night with someone else's gorgeous wife is a fantasy. The consequences are, however, real.<br><br>The film uses an extravagant trigger to create a convincing emotional crisis that many couples will recognize.<br><br>The message is that at the end, true love wins; an attitude that I would recommend to any loving pair, attained by jealousy and resentment.","user":"anacunhal","rank":[42,60]}]