[{"title":"I love it - An underrated solid action fun sequel from my childhood!","rating":6,"date":"26 February 2016","review":"Teenage Mutant Ninja Turtles III in my opinion it is a underrated solid good sequel to the original flick. Everyone hates this film and going for the second film. This one get's the crap for it and the second one gets the praised. This film was actually the first film in the trilogy that I have watched. As child I wanted so badly to see Teenage Mutant Ninja Turtles the original movie it was my biggest childhood wish, I heard that Splinter throw Shredder off the roof, I didn't know in which movie that was, so my mom bought me Teenage Mutant Ninja Turtles III on VHS in 1993, when this movie come out. The VHS sadly had a terrible picture quality and awful sound but even with all that I still liked the film not seeing the first two films. But after watching the first two films, they both become my favorite films, but I hated this one because there was no Shredder, Rocksteady, Bebop, Foot clan or Krang in this movie, that was than. I was really surprised by this film. They don't use jokes in here, they try too, but they aren't cartoonish like are in the second one. They actually use weapons and swords, nunchakus, not their fists they are Ninja Turtles so they are using weapons which I love that. The only thing that hurt the film are the costumes they aren't Jim Henson's Creature Shop, they are more cheap costumes that were provided by Effects Company the animatronics, that is a minor flaw. <br><br>Plot: The four turtles travel back in time to the days of the legendary and deadly samurai in ancient Japan, where they train to perfect the art of becoming one. The turtles also assist a small village in an uprising.<br><br>It is my childhood film. I love that the story is original, no one brings back the characters who died back again. Elias Koteas reprise his role back as Casey Jones and he also plays another character Whit a double spy by Walker's army. There is less humor in this film and it is more serious. Turtles are using there weapons. Leonardo is a bad ass. Fighting Japanese Samurai was awesome. I love that Turtles are back in the time in ancient old Japan, where the air was more cleaner, than it is today. I love Stuart Wilson as the villain Walker. A year later he was another villain in Lethal Weapon 3. <br><br>Seriously I don't see the hate for this film I love it a lot! I love that Elias Koteas plays two double roles, one as Casey Jones and the second one as Whit. Again a lot of people are complaining because Casey Jones doesn't do anything in the film, just sit around, really? Seriously? Haven't you watched the movie? Whit (Elias Koteas) kills Waalker on the end of the film, when he fires a fire ball on Walker, while he try's to escape. Leonardo defeats Lord Norinaga (Sab Shimono) in a sword fight, even tough the scene was hilarious I still have enjoy it. I love the music score and song Tarzan Boy by Baltimora and of course Rockin' Over The Beat by Technotronic. Paige Turco did outstanding performance as April O'Neil much better than she did in The secret of the Ooze. I grew up with this movie as a child a lot, I have even had Michelangelo and Walker's toy's, I Think I even had a Raphael figure I am not sure. <br><br>Teenage Mutant Ninja Turtles III is a 1993 American action comedy film based on the comic book characters the Teenage Mutant Ninja Turtles. It is the second sequel to the 1990 live-action Teenage Mutant Ninja Turtles film. <br><br>Overall: I love this movie it get's 6 by me, I love Ninja Turtles in here, I love how Michelangelo saves a child from a flammable house and Leonardo saves him from dying, by giving him a mouth to mouth and he saves him. So why would I hate this film? when the effects are good and the acting is solid. Turtles saved and they prevented the war, they help people out. I think this film for me personally is better than second one and the reboot. I love this film to death and it is my second favorite film of the three.","user":"ivo-cobra8","rank":[14,15]},{"title":"Marshmallow pizza","rating":8,"date":"3 August 2012","review":"Vilified, a film that ponders the wasteland of sequels. It's often hard to make a good follow up to a series of movies, and making a third or fourth or whatever sequel proves to be even harder (hellraiser, lethal weapon). But Hollywood is a place largely dominated by how much money can be squeezed out of an idea, so here we go. This movie get's way more flak then it deserves, the costumes are an improvement, the time travel was cool, April is still hot and the action is dope. The second installment had weird costumes that looked to be heavy on complex mechanical masks and not enough on body movement/fluidity. The third makes up for that, the costumes look the best in the whole live action franchise which helps for any part of the movie driven by dialog or combat. This film saw the return of Corey Feldman, a departure from the Jim Henson prop department and the introduction to an awesome SNES game. But it failed to catch on with fans and was panned by critics. The sequels never managed to capture the gritty aspect of the first film, or find a happy medium between storytelling and action, but for a trilogy i've seen a lot worse.","user":"peterpants66","rank":[5,5]},{"title":"Not the best, but still a laugh","rating":6,"date":"8 August 2006","review":"Originally when I saw this movie, it had only just come out in theaters and I was just a kid. At the time, I thought the movie was a steaming pile of crap, no where near in comparison tot he first two. Hell, I overlooked the inclusion of Vanilla Ice for YEARS, insisting that even if he was in the second movie, it was still better than the third. However, now that I am older and a touch wiser, I've gone back and watched all three movies (I've been on a serious TMNT-a-Thon ever since I heard a new movie was in the making). While I admit the third is indeed the worst of the three, it is far from the travesty I originally thought (and thought for years). Aside from the silly story and the poor quality turtle costumes, the dialog is given several moments to shine with some surprisingly funny jokes and one-liners and minor giggles. I'm not saying every TMNT fan should go out and buy this. I don't even own it myself. However, I think you should get a few friends together, grab some snacks, some source of caffeine, order a pizza, and rent TMNT III for a night of absurdity and laughs. That's what my friends and I did &lt;3","user":"blabbity","rank":[8,9]}]