[{"title":"TERRIBLE, but I've watched it eight times.","rating":1,"date":"28 November 2001","review":"This movie is completely inept, but I love it. I think it's hilariously bad.  I usually don't post positive reviews, preferring to use IMDB as a grouchy outlet for complaints.  But I want to show my support for this movie.<br><br>     When DGITW attained \"bottom 100\" status, I was happy for it.  It had finally been accepted by its peers!<br><br>     As you may have read, a maniac is killing anonymous campers in the woods- hence the cautionary title of the movie.  Most of the acting is horrid, usually providing chuckles.  The music alters between generic upbeat country guitar and cheap early-eighties casio keyboard. And the gore looks fake, but that's really the least humorous aspect of the movie.  The acting and bad script are what really makes DGITW special.  I have seen many bad horror flicks,  and DGITW easily makes my top five so-bad-it's-good list.<br><br>     If you're looking for a more detailed description, there are several reviews floating around the web.  Check 'em out. <br><br>     Watching it the first time I was a little disappointed, but I fully appreciated this movie on the second viewing.   If you like bad movies, I highly recommend this one.","user":"latherzap","rank":[36,44]},{"title":"'WRONG TURN' without the turn!!!!","rating":19,"date":"19 March 2004","review":"Yet another of the films that languishes in the hell that is 'Banned by the BBFC'. My only question being 'did you watch a different film to me?' I cannot even begin to think why this was considered banworthy (is that a word?) unless it was 'cos they didn't want to subject us to this!!! This is definitely another one of those 'So Bad they're good' contenders that I love so much I also think that an average mark of 2.2 out of 10 seems a bit harsh for this film I would give it at least a 3!!<br><br>Basically this film consists of a 'Crazy Man' running around in the most densely populated 'middle of nowhere' that I have ever seen and killing people with a large Machete on a stick<br><br>It really is that SIMPLE","user":"skanners","rank":[12,13]},{"title":"Amusing in its badness!","rating":4,"date":"31 August 2005","review":"Two couples on a weekend backpacking trip through dense mountain ranges turns into a bloody and horrifying nightmare of a journey. When they come across a maniac who lives in the woods and who's knocking off everyone that it comes across in many gory ways. Now they're trying to get to civilization to report this carnage before they became dead meat themselves.<br><br>Incompetently made? Oh boy, definitely! But hold on it wasn't as bad as I thought it might be. I see other comments that label it the worst slasher, but IMHO there's far worst (and boring slashers) that deserves that tag. It's gritty, shocking, repellent and hardly memorable and nor it should be. But for the odd 80mins of schlock, I was reasonably entertained and I was amused by its badness. I couldn't help but raise a smile or crack a laugh from time to time. Sure, this basically rips off the likes of the Friday the 13th films and even to a extend - The Hills Have Eyes, but really it's nothing much out of the ordinary from your routine/predictable slasher of the 80's. Meaning a pointless/no nonsense bloodbath that fails logic and doesn't make much sense. But the plot is not the reason why people really watch these films; I hope not! <br><br>Now onto... the plot, well there's not much of one, really. They're so many gaping holes and how can that be scenarios. The central focus of the young backpackers is to make it look like there is an actual plot to round it off, but really it's nothing more than watching people getting knocked off in the backwoods by some primitive killer. You don't even get any explanation about our scruffy maniac's origin and his makeup was fairly lacklustre. Everything is pretty much telegraphed, with one attack set up after another, in one continuous loop. Stupid characters doing stupid actions, but hey that added to the fun because of its unintentionally (I think?) humorous moments - or for those who aren't used to this trash it might be excruciating to comprehend. The deaths are not particularly spaced out, but reasonably confined. I lost count of how many people actually died in the opening half hour! But when it came to the final 20mins it felt incredibly drawn out and flat. Although, the climax is fairly brutal. So, you pretty much get what you expect - poor narration replaced with cheesy/graphic blood splattering and nasty moments. Although, one thing you can't shake is that atmosphere of horror and that damn electronic score! Jeez it couldn't make its mind up. It would go from a light hearted tone, which at times it was incredibly out of place and then it would go all jerky with a real pounding score. This moment your heart is either throbbing or your thinking when is it going to stop, as my headache is getting worse. It felt like overkill and takes away from the tension, hmm, actually there's no real tension to begin with. What might make your headache worse, would be the terribly shaky and obscure camera-work. It's incredibly nauseating, with the sheer amount of bumpy movement, but it seemed to settle down in the latter half of the film. Sometimes you don't even know if the POV shot was the killer's or not? Loved the panning of the stunning background features, though. I'm a sucker for films set in mountainous woodlands and open fields. The lovely scenery was a marvel to look at. Also the terrain really added to the creepy and forbidding vibe.<br><br>Lets move onto the acting - amateurish/or dreadful is the best way to describe it. But were they acting, I ask? I just don't know if they're mocking themselves, or are they playing it... for real? We even get the usual dim-witted sheriff and a real pansy of a deputy. His particular performance was ridiculous and so was most of his dialogue. There's even a moment involving two lovers in a car, which was awfully funny and at the same time cringe worthy. The two teenage couples that are backpacking might be annoying and obnoxious brats, but I tell you they know how to pull a terrifying facial. Sadly, there's no hot women in the film. The script is pretty crumby and so was the supposed humour. The inept direction is quite bland and clumsy, but there are enough well designed shocks and horrendously, bloody kills. There's a pretty good set up when we see the killer for the first time. Also Just wait around for the ending credits to hear a wailer of a song ;).<br><br>It might be a stinker and I wouldn't really recommend it, but overall it kept my interest no matter how awful it was. If you just want pointless and joyous spree of blood and mayhem, maybe this trash is right up your alley.<br><br>Sidenote: I felt a bit conned by plot outline on my video case, which claims an axe-wielding maniac is on the loose in the woods. The killer is far from an axe-wielding maniac!","user":"lost-in-limbo","rank":[9,10]}]