[{"title":"Very unique sex movie","rating":8,"date":"8 May 2005","review":"John Waters once said that he wanted to make a film that had no sex and no violence, but was rated \"X\" just for its theme and ideas. Well, this movie might be as close as anyone has ever come to that--it has no on-screen violence and very little sex but it is unbelievably sleazy, managing to touch on incest, pedophilia, fetishism, frigidity, prostitution and rape all in a scant running time. It is also surprisingly serious and well-made. It's not a film I'd want to watch again any time soon, but you have to respect the fact that it was made at all.<br><br>The movie is about a young girl with a shrewish, puritanical mother and an absent, whoring father. She becomes unnaturally attached to the toys her father gives her, even taking them to bed with her as a young adult, much to the consternation of her new husband with who she proves decidedly frigid. While her husband seeks solace from other women, the heroine comes upon a unique solution to her frigidity problem--she becomes a prostitute (!) catering exclusively to a strange breed of older men who call her \"baby\" and insist that she call them \"daddy\". All of which leads to a very predictable but nevertheless touchingly tragic encounter with her actual father.<br><br>This is one of strange breed of early 70's \"roughies\" that were marketed as sexploitation films, but had a surprisingly downbeat view of sex. Other films like this include \"And When She Was Bad\", \"Swinger's Massacre\", and \"The Toy Box\" (with which this has been paired on Something Weird's latest DVD release). But while many of these other films no doubt left their male audience with mixed feelings of being turned on and wanting to castrate themselves, this film definitely evokes the latter response. I know that doesn't sound like much of a recommendation, but this a rare film that despite its far-fletched plot realistically portrays sex as a potentially destructive force for both the repressed and the promiscuous (and without any preaching or moralizing). That's in many ways preferable to the usual \"adult\" fairy tales where everyone has a lot of sex with multiple partners and lives happily ever after.","user":"lazarillo","rank":[29,31]},{"title":"a mind&%#$ of a film, i liked it","rating":9,"date":"9 November 2003","review":"Jamie is a mentally stunted adult obsessed with the father whom her mom kicked out when she was a young girl. This movie is insane. it did keep my interest throughout. Those who go into this film, thinking it'll be another 70's-era skin flick are in for a surprise. Nudity is kept to a minimum. This is more of a psychological mind&amp;*%$ If you stick with it, it's a pretty good, creepy b-movie. This movie is coupled with \"The Toy Box\" on the Something Weird DVD.<br><br>My Grade:B<br><br>DVD Extras: Art Gallery;2 short subjects ( the Toy Telephone Truck, &amp; the Christmas Eves); Trailers for Toys are not for Children, the Toybox, The Exquisite Cadaver, Tales of the Bizarre, The Single Girls, Ann and Eve, The Depraved, Sextet, The Naked Countess, and Labyrinth of Sex","user":"movieman_kev","rank":[18,21]},{"title":"This Movie is not for everybody!","rating":6,"date":"31 October 2008","review":"The good people at Something Weird Video obviously don't watch any of the exploitative junk they distribute and simply put films together purely based on matching titles or something! \"Toys are not for Children\" sounds like an ideal companion for another movie called \"The Toy Box\", but if you've seen them both, you can immediately conclude these two movies differ enormously when it comes to atmospheres, filming styles, substance and intensity level. \"The Toy Box\" is totally lurid and nonsensical crap about sexist aliens, whereas \"Toys are not for Children\" is an aspirant-controversial and mildly perverted tale about a girl with an unhealthy desire for her father. This is not a particularly pleasant movie  and definitely not the usual type of light-headed sleaze Something Weird brings forward  but it's nevertheless a curious attempt at drama and adult themes. 19-year-old Jamie is obsessed with her daddy ever since her shrewish mother kicked him out for visiting prostitutes. He still sends her presents and she \"plays\" with them, all right, but let's just say the toy soldier didn't get any training for this type of field work Jamie gets married but refuses to sexually satiate with her husband and still only wants to play with daddy's toys and recapture memories of her early childhood. She then flees to the big city and moves in with an elderly prostitute who introduces her to a lot of old perverts that just love to act like Jamie's daddy. You don't need a degree in quantum-physics to predict the film builds up towards an actual encounter between Jamie and her dad in a climax oozing with incestuous vibes, bizarre fetishism and abrupt acts of vengeance. The atmosphere and themes of \"Toys \" may be extremely sordid and sleazy, but there's actually very little nudity or sexual content on screen. Writer/director Stanley Brassloff had copious opportunities to turn the movie into one gigantic sex feast (Jamie's husband picks up randy girls in bars, Pearl's pimp assaults women, etc) but the sexual content largely remains suggestive and off-screen. Rather than to focus on all the luscious and willing women in the film, the story solely revolves on the frigid Jamie and her messed up sentiments. Like the other genius reviewer already stated, \"Toys are not for Children\" probably one of the sleaziest concepts ever thought up, but the actual content is rather sober. That's quite a remarkable accomplishment; especially for the early 70's. The production values are also fairly decent, with monotonous but relatively stylish photography and nice musical guidance. Definitely recommended for avid cult fanatics, but stay clear if you're just looking for rancid sleaze. In that case, you're better off watching the aforementioned \"The Toy Box\".","user":"Coventry","rank":[17,22]}]