[{"title":"Platinum belt. With an unlimited line of credit.","rating":8,"date":"18 July 1999","review":"The Muppet franchise has mellowed a bit with age.  MUPPETS FROM SPACE doesn't have the level of frenetic insanity that occasionally marked the original syndicated MUPPET SHOW, and it's neither as edgy as, say, the latest Mike Meyers movie nor as fast-paced as an Indiana Jones yarn.<br><br>But even if it's a little on the laid-back side, its heart is very much in the right place.  In some ways, this is a direct spiritual sequel to the original MUPPET MOVIE, focusing this time on Gonzo's origin story rather than Kermit's.  Where the first film spoofed the \"road\" comedies and Westerns, this one spoofs CE3K and MiB (but not, as the title might suggest, the Star Trek or Star Wars franchises).<br><br>It's lighter on the zingy one-liners than MUPPET MOVIE, and longtime Muppet fans will probably be a bit frustrated at the soundtrack, which relies almost entirely on borrowed and guested songs rather than musical performances by the Muppets themselves.  (Note: if you peeked at the soundtrack album listings first, be advised that \"I'm Going to Go Back There Someday\" is NOT in the film.  Should be, darnit, but isn't.)  But there's some inspired silliness involving lab rats and a wonderfully zany infiltration of a Secret Government Installation.<br><br>All in all, what's here is a very warm and watchable comedy of a kind that's increasingly hard to find in theaters these days.  And Miss Piggy's karate is still as dangerous as ever. I'm looking forward to the next Muppet film already.  (How about a spy spoof, guys?  \"My name is Frog, Kermit the Frog.\")","user":"Djonn","rank":[13,17]},{"title":"Tough To Beat Gonzo & Rizzo","rating":8,"date":"25 June 2006","review":"Good special-effects, funny and likable characters and an interesting story all made this 1999 'Muppets In Space' movie much better than I anticipated.<br><br>This one featured more of Gonzo and Rizzo, my two favorite characters. The movie, in fact, centers around Gonzo. Miss Piggy played a lesser role than normal, which also pleased me. <br><br>A tiny bit too secular-liberal in parts but overall, not offensive and definitely entertaining. It looks great and sounds good on DVD, too.<br><br>Some have said this was the best of the Muppet films and perhaps that's true. I wouldn't argue.","user":"ccthemovieman-1","rank":[19,30]},{"title":"Got the classics, a good story... still lacking something!","rating":8,"date":"24 April 2011","review":"I love the Kermit the Frog stories, movie, films, etc. And I figured that Muppets from Space would be great. And it was, it really was! I loved how the characters interacted, the intense story, the fact that they had to save their friend, they way they presented the conflict, etc.<br><br>The thing that was lacking, I'm not sure. I felt the ending was a bit pushy. Like they were starting to rush to get it over with. I mean, Gonzo has a chance to get back to his parents, yet he chooses to stay with his friends. Which is nice, but I felt that it was a powerful moment that was lacking the right emotions.<br><br>But anyway, I cannot diss a series of classics that everyone likes. Kermit the Frog was and always will be a favorite of mine. The Muppets are great!","user":"robert-710-767167","rank":[3,3]}]