[{"title":"Almost a Documentary...","rating":10,"date":"14 July 2005","review":"There are spoilers in this review...<br><br>What a great, great movie. If you want to know what being in High School in the mid 70's was like, rent this film. I grew up in the metro Manhattan area. We didn't have the freshman hazing, and few of us could afford the cars (although we sure knew about them and lusted after them), but the rest of this movie is so dead on about my experience of High School in the 70's that it's scary. Every character in the film corresponds with someone that I knew during that time. Yes, there was a lot of pot smoking, yes, obtaining beer was quite easy for underage kids...I used to buy it in bars when I was 16. We made pipes in shop class. We hung out and had parties at night, drove the streets drinking beers and smoking joints listening to the same music. There were no youth centers though. The girls that I knew were as beautiful, and also struggled to get into their jeans. They used pliers too, but they also put them on while they were wet to further get that skintight look. There was no HIV virus to worry about, Herpes was not a big thing then, the biggest worry was getting pregnant. Everyone was having sex... All of these facts also were no big deal. Most of my peers grew up just fine, and now are upstanding pillars of the community. Many today would like you to believe that this is an example of the road to ruin. It was an incredible great time. The film has interesting character development, with the same types I remember. Philosophers, heads (now called stoners), bullies and waifs. This is my American Graffiti and it is perfect. Waxing nostalgic? Perhaps, but anyone that didn't live through that time will sill love the dialog in this film, as it deals with the universal experience of that point in one's life. This is high school in the 70's. Check it out.","user":"goodwynn1919","rank":[305,352]},{"title":"A Time Machine Trip Back To The Texas Summer Of 1976","rating":10,"date":"4 February 2005","review":"I graduated in 1976 from a high school in North Dallas and this entire movie is so spot on it's scary. It is my favorite film. I've seen it hundred's of times and every time it's like watching it for the first time. Only someone that was there and lived through those days could have directed such a movie. I drove a 70 dark blue Chevelle SS 454 with a 4-speed, over 400 HP and all of the goodies Wooderson described. Starting that car up, listening to the roar of that engine and burning out in 1st gear while in a thick cloud of blue smoke in front of the high school at 3PM while wasted......doing over 80MPH in 2nd gear....oh yea! I feel sorry for the teenagers today that drive the limp wrist fluffs of metal that pass themselves off as cars these days. <br><br>I was a stoner like Pickford smoking weed non-stop. Some mentioned that the heavy drug use was not too common. Well, at our school it was beyond common. Before school, during school (in the bathroom and football field) and after school. Our school had a smoking area outside the cafeteria where everyone went to light up. <br><br>The opening scene with Aerosmith \"Sweet Emotion\" slowly building up and Pickford driving his Goat and girlfriend in the school parking lot kills me every time. I cannot imagine a better opening scene for the movie. That was pure genius. The funny thing is Linklater did not show getting licks from the coach or the principal. For all the \"uninitiated\" back then all a coach or an asst. principal had to say was \"Smith, I want to see you back at my office now\". Our coach had a paddle he personally made that he kept on his wall over his desk. It had about 30 holes drilled in it and it was covered in black electrical tape! When that one came down you knew it! Now with all the PC people coach would go to jail for \"assaulting the poor boy\" Hell, back then it was called character building. As I remember from the 7th grade on licks were given out. <br><br>The soundtrack. Best ever. Might as well be back at White Rock Lake or Lake Ray Hubbard on a Friday night getting wasted. Head East was a nice touch. Every time I listen to that soundtrack I remember things I have not thought about in 25 years. The man that portrayed Pickford's dad was dead on. Accent, demeanor along with the big caddy and the tennis playing wife in the mini-skirt and puffed up hair. <br><br>Some of the reviewers mentioned they did not think it was too realistic showing/mixing a lot of sexual activity among the freshman girls. That is another point I must dispute. Maybe at their school in their town of 500 or their strict upbringing but at our junior high and high school the freshman and younger girls were pretty wild. I mean really \"wild\"! This is coming from someone who \"lost it\" at 12. So insinuating things about a 15 or 16 year old freshman is pretty tame. 15 and 16 year old's were the \"world travelers\" to us 13 or 14 year old guys. <br><br>There is something about this movie that pulls me back over and over again. It's hard to describe. I'm not sure what it is. Am I a Wooderson that enjoys reminiscing? Am I someone that prefers simpler times? Am I someone that is so sick of PC people that a movie like D&amp;C is like a breath of fresh air? Was there something magical in the air back in 1976? The country was celebrating 200 years of freedom. Now within the last 30 years it seems that most of those freedoms have been slowly whittled away with and all that is left is a former shell of the old. Especially after 2001. <br><br>The best scene? To me it's a toss-up between the opening \"Sweet Emotion\" GTO in the school parking lot and the Emporium scene with \"Hurricane\" playing in the background while (The Past) Wooderson, (The Present) Pink and (The Future) Mitch walk into the Emporium while the camera films every little nuance in slow motion. The cockiness of Woods, the mellow Pink and the innocence of Mitch. Put that scene on slow motion and study their faces and the reaction shots of their peer's faces as they acknowledge their presence.<br><br>Your own personal time machine if only for an hour and a half. Slip the DVD in, turn the lights down low, take a couple good strong hits and wash them down with a few Tallboys. Use your imagination and for the briefest of time you are back in 1976. I wish they made more movies like this instead of the sugar coated pablum coming out of Hollywood nowadays.<br><br>Remember this?<br><br>Howard Hughes died, Robin Trower-Bridge of Sighs, Jeff Beck, Kawasaki Z1, Kawasaki 750 triple 2-stroke, 45 cents a gallon gas, 104 octane gas, Frampton Comes Alive, Bad Company - Shooting Star, Elvin Bishop - Fooled Around and Fell In Love, Jimmy Carter, Dirty Mary, Crazy Larry, 1969 Dodge Charger 440, 2 Lane Blacktop, 3 finger lids, windowpane, Diamond Dogs, J. Geils, Midnight Special, Wings Over America tour, Bad Company - Movin' On, Mott The Hoople - All The Young Dudes, SD 455 with the Big Bird on the hood, Marshall Tucker Band - Heard It In A Love Song, Emerson, Lake and Palmer - Brain Salad Surgery, Edelbrock Tunnel Ram with Holley Double Pumpers, getting high at dusk while listening to Pink Floyd's \"Time\" and looking at the Dallas skyscraper skyline against the setting sun.<br><br>If you do then Dazed and Confused is right up your alley. If you don't then still watch it, the characters in D&amp;C cover all generations, just the cars and clothing have changed.","user":"Oracle2959","rank":[446,528]},{"title":"a breeding ground for talent","rating":10,"date":"7 May 2005","review":"\"Dazed and Confused\", which takes place during the 70s, was one of the best movies of the 90s. It really is phenomenal how much talent was in this ensemble; if you want to see Adam Goldberg, Matthew Mcconaughey, Milla Jovovich, Joey Lauren Adams, Parker Posey, or an almost completely unrecognizable Ben Affleck (playing the sort of role he would almost never play again, an a**hole) before they were stars, look no further. And of course this was an early movie for director Richard Linklater, who had made the relatively unknown \"Slackers\" previously and who would go on to make \"School of Rock\", which was almost as good as \"Dazed and Confused\".<br><br>Taking place on the last day of school in a small suburban town, \"Dazed and Confused\" is a brilliant ensemble piece rivaling anything done by Robert Altman that covers the broadest spectrum of teenagers imaginable. We see the nerds, the potheads, the jocks, and the cheerleaders, as well as the incoming freshmen, as they celebrate the beginning of summer. Some celebrate less than others, of course; freshman hazing is a big part of the movie, both male and female. The dialogue is fresh and unexpected; lines about George Washington's proclivity for marijuana, why you just gotta love high school girls (\"I get older, they stay the same age\", as McConaughey's character says), and the herd mentality when a fight breaks out demonstrate how all-over-the-map the dialogue can be, and it's always affecting and usually quite funny. <br><br>Of course, it's the acting and the characters that really steal the movie, and it really is amazing how many people in this movie went on to bigger things. As I said before, Affleck was the most surprising, but Mcconaughey had the most memorable role as an older dude who can't seem to let go of his youth, a slick slimeball who chases after under-age jail bait. And he has never been funnier or better than he was in this. Eventually, his character will wake up and the kids aren't going to want to hang out with him and the girls aren't going to want to sleep with him anymore, and he's going to have a rude awakening. But for the time being, he's all macho cool swagger, and Mcconaughey pulled off the part perfectly. Parker Posey is also excellent, playing a senior bitch (but only because she's \"supposed\" to be) unleashing a humiliating hazing on the incoming freshman girls.<br><br>You have to give props to the writing. It's not a long movie, but it covers so much ground that it feels big. At one point, a character says that the 70s obviously suck. That may have been, but it's never looked cooler than it did in \"Dazed and Confused\". And the soundtrack must be mentioned too. The 70s was a decade full of musical highs and lows, and thankfully the soundtrack highlights the highs while ignoring the lows, and we have songs by Aerosmith, ZZ Top, Dr. John, War, and other seminal 70s rock figures (curiously missing: \"Dazed and Confused\" by Led Zeppelin, but that's forgivable). Brilliant; there's not a single clunker, and it adds to the free, easygoing atmosphere of the movie. \"Dazed and Confused\" is quite possibly the best \"teen movie\" ever made, and, from the point of view of someone who grew up in the 80s anyway, the best movie about the 70s ever made.","user":"the-jerk","rank":[146,185]}]