[{"title":"Step into the magic!","rating":8,"date":"21 June 2003","review":"After working as an actor in such films as Sam Peckinpah's controversial Western \"The Wild Bunch,\" and starred in Alejandro Jodorowsky's legendary cult film \"El Topo,\" Alfonso Arau makes his directorial debut in a magical Mexican art film, 'Like Water for Chocolate,' set during the Mexican Revolution... <br><br>His success makes him direct his first English-language feature, where he presents the strength and beauty of the bonds that can unite human hearts... <br><br>The time was right after World War II... <br><br>The place was more lovely than you ever imagined... Gorgeous scenery dominated by vineyards, the perfect nestle for a romantic fairy tale...<br><br>Everything comes from the heart in this rich heartwarming film... Arau's vision and dream was to build a tunnel between what we know and don't know about two-spirited people, the roots and blood-ties of a family, its traditional values, and its attachment to the earth...<br><br>Arau reinforces the borders of tradition in the Mexican aristocratic family who have lived on American soil for generations, describing her fundamental values: family solidarity, religious commitment, and cooperation with the land and nature... His motion picture derives its emotional power not only from the sweet love that blossoms between Paul and Victoria, but from the unconditional familial love that the young GI encounters while at her hacienda... Each type of love is strengthened through the knowledge that one leads to the other...<br><br>Keanu Reeves plays the quiet expressive dreamer who finds the traditional values in a magical place... He is a genteel seller of chocolate candy who, en route on a train from San Francisco to Sacramento, meets a graduate student in crisis... He learns that she is frightened to return home because she is pregnant and unmarried...<br><br>To protect Victoria from her father's wrath, and ignoring obviously the outcome, Paul tells Victoria that he believes \"there's a perfect someone for everyone - someone who'll love you no matter what.\" He gallantly insists in posing as her husband just for one night...<br><br>Making her American film debut, Aitana Sanchez-Gijon plays the strong, exquisite woman 'so easy to love'... Victoria has been seduced and abandoned by a 'free spirit.' She is now on her way to her wine-growing family in Napa Valley to help with the annual grape harvest... <br><br>While her silken butterfly big wings spread the heated air around the frozen grapes, Victoria's sight was enough to engulf Paul with desire... And when her dark hair tumbled down to him, Paul's face was burnt by the harshness of actually having been able to feel some part of her... This burning has been caused by something as soft and luscious as her beautiful black hair... It is simply Arau's shot of her luminous figure, that discreetly heightened her feminine mystique, and her strong sensuality...<br><br>The legendary Anthony Quinn, a two-time Academy Award-winner for \"Viva Zapata\" and \"Lust for Life,\" is the wise patriarch, Don Pedro who tries to intensify the romance between Paul Sutton and Victoria, while her father tries his best to show his displeasure at her choice... While chomping Paul's chocolates, the sagacious old man shows the polite soldier the root from which the entire vineyard has grown, and instructs him the traditions and beliefs of his ultra-conservative family...<br><br>Screen veteran Giancarlo Giannini (who received an Oscar nomination for his performance in \"Seven Beauties\"), plays the proud, suspicious, ultra-traditional father, whose beliefs are deeply rooted in tradition: 'My daughter can trace her roots back 400 years to the best families in Mexico,' he affirms... As a strong believer in the importance of family, Don Alberto Aragón reacts violently to the prospect of his beloved daughter already married to someone who has nothing... No family. No past. No future! <br><br>If you want to be moved by a consummate screen composer, and enjoy a wonderful family dinner... If you want to watch Reeves and Quinn singing and getting drunk... If you want to observe joyous women rolling around in a tub of emerald green grapes, keeping pace with the help of musicians... If you want to admire sensational landscapes sleeping against the sunset sky, or forming like a dream out of the silver dawn... don't miss this breathtaking piece of visual art, and step into the magic!","user":"Nazi_Fighter_David","rank":[62,71]},{"title":"Beautiful...","rating":27,"date":"27 August 2000","review":"This film in one word, \"beautiful.\" Keanu Reeves and the rest of the cast make this film enjoyable. I am not a big fan of romance pictures, but this has to be one of the more enjoyable ones. The acting is superb and the story is excellent.<br><br>A young woman heading back home meets up with a chocolate salesman. She is pregnant (but not married) and cannot bare to face her father. Keanu's character hides his true identity to play the role as her husband.<br><br>This picture is worth seeing and I advise anyone to see it. Whether they are into romance films or not. People who bad-mouth this film are too dense to realize you don't need action and bloodshed to have a good movie.","user":"BlueOrgy","rank":[71,84]},{"title":"Beautiful, Wonderful, Romantic...but cynics, please stay away","rating":16,"date":"16 March 2001","review":"It always amazes how many opinions can come from the viewing of the same movie. But this movie should have as many admirers as possible.<br><br>OK, the ending is predictable. So is eating, sleeping, working and making love. Is that any reason not to watch a movie? <br><br>What makes CLOUDS wonderful is the ride. It is a beautifully acted ride: Keanu Reeves acting his guts out plus: international sensation Sanchez-Gijon, noted actress Aragon, veteran actress Elizondo, Giannini the legend and the irresistible Anthony Quinn, Beautifully directed: Alfonso Arau, Wonderful cinematography: Emmanuel Lubezki, the wonderful music of Maurice Jarre and the song by Cuban Guitar composer, pedagogue and legend Leo Brouwer.<br><br>What is bad about smiling during a movie? I found myself smiling and giggling during the grape stomping scene. Does it hurt when you laugh? I guess only if you are jaded, spoiled and bored with life. <br><br>There is love, mysticism and joy...This is a movie to savor and breath in and enjoy the wonderful..<br><br>Walk in the Clouds....","user":"Enrique-Sanchez-56","rank":[107,131]}]