[{"title":"Awful!","rating":27,"date":"27 June 2004","review":"The only reason to watch this movie is to see just how awful it is and how far Tobey Maguire and Benico Del Toro have come as actors. The script and dialoge are awful, and appear to be written by high school level talent. The premise is absurd and loaded with ridiculous sub plots to further waste viewers time. In short, three just out of high school kids tango with death so they can keep a car. Adam West is good for a laugh as some sort of pimp/daddy business man. If you're a collector of some sort and want this film, the good news is you should be able to get it for about three bucks at any Target or WalMart style store. However, I certainly don't bother messing with this one.","user":"pdsca21","rank":[18,21]},{"title":"Trainwreck of a Movie","rating":2,"date":"17 September 2005","review":"Tobey Maguire had to start somewhere before becoming Spiderman. His acting is quite good even if his aimless and clueless character makes no sense. Here's the plot: a motel owner's son hooks up with a hooker tenant, hangs out with his gay buddy (who seems to have a crush on him) and steals a car from an icy villainess assassin. Then a lot of other plot points occur that have nothing to do with each other. The first half is OK but then quickly disintegrates into this tangled non-sensical mess. Wilson Cruz does his best as Tobey's gay friend but his acting is too good for the amateurish script. Adam West as a father who pimps his daughter is an interesting stunt cast but who cares by the end. I bought the DVD for five bucks and paid about $4.79 too much.","user":"jangehr","rank":[9,11]},{"title":"No Joy","rating":3,"date":"28 January 2007","review":"After having watched Benicio Del Toro in some brilliant and engrossing roles, i decided id give 'Joyride' a watch. Toby Maguire isn't one of my favourite actors, and I've often found him to be a fairly boring, and in the hands of a movie such as this, Maguire is stretched far beyond his limits. The story is laughable for all the wrong reasons, and the movie plods on and on, without many scenes of any real depth. Del Toro is also slacking, mostly mumbling his way through the terrible script. As if all this wasn't bad enough, the movies production and soundtrack kill what little merit 'Joyride' had. I've tried to think of some good points to raise, but upon reflection, there are non.<br><br>3/10","user":"Barclayandrew","rank":[10,14]}]