[{"title":"A Warm and Hilarious Comedy...","rating":8,"date":"22 December 2005","review":"THE BIRDCAGE is the hysterically entertaining Americanized version of the French classic LA CAGE AUX FOLLES. In this version Robin Williams plays the gay owner of a Florida nightclub who learns his straight son (Dan Futterman) is coming home and is engaged to be married. Williams learns from his son that his fiancée's parents (Gene Hackman, Dianne Wiest) are straight-laced and ultra-conservative and will not be comfortable meeting his gay father or his even more flamboyant lover (Nathan Lane) and suggests Williams send Lane out of town while Hackman and Wiest are in town. Instead, Lane puts on his best drag and meets the parents as Williams' wife in one of the most hilarious dinner party scenes ever filmed. This film is chock full of sparkling dialogue and sharp performances. I also found it rather refreshing to see Robin Williams playing straight man to Lane, who along with Hank Azaria as their housekeeper, practically steal the film from everyone else in one of the most entertaining comedies of the 90's. And the sight of Gene Hackman in drag is something everyone must experience.","user":"ijonesiii","rank":[48,53]},{"title":"We Are Family!","rating":16,"date":"16 February 2003","review":"This film has the distinction of being quite possibly the funniest film that I've ever seen.  I remember seeing this film the night it opened and laughing so hard that my friend told me she'd get up and leave me there if I didn't shut up!<br><br>Almost everyone I've talked to over the years swears by how hysterical this film is.  There is a reason for that: Nathan Lane.  This guy is a comic genius.  He was nominated for a Golden Globe for his performance but should have been nominated for an Academy Award as well if you ask me.  Originally when I first saw it, I didn't care for Robin Williams' character at all but the more I've seen it over the years (over fifty times) it grows on me. Dianne Wiest is her normal, ditzy self but is a scream here and Gene Hackman in that last scene...well, I don't want to give away anything.<br><br>Half of the fun of this film is the verbal repartee between the characters, especially anything between Hank Azaria, Nathan Lane or Dianne Wiest.<br><br>If you haven't seen this film, you owe it to yourself to just have fun and laugh the night away.  Enjoy it!!!<br><br>My rating: 4 stars","user":"JSanicki","rank":[72,85]},{"title":"One of the best comedies ever made","rating":10,"date":"5 August 2005","review":"First off; I can understand why people would dislike this movie; The characters are all portrayed in an extremely stereotypical way, the acting is considerably over the top most of the time, the story is rather cheesy and not very believable - I mean which gay couple would (or COULD) transform their eccentric home into a monastery-like environment in 24 hours to pretend to be a cultured family to impress the son's fiancée's parents?<br><br>...Yet I couldn't stop laughing all the way through, even after the 10th time. Why? It's BECAUSE the characters are so stereotypical, it's BECAUSE the acting is over the top, it's BECAUSE the whole thing is so unbelievable that it makes it scintillating to behold. Even though the characters are stereotypical, the script has obviously been written by someone who doesn't intend to contribute to the stereotypical view of the gay drag community, but who rather wanted to create characters that are lovable while at the same time shouting \"don't take us seriously\". <br><br>This isn't a movie portraying life in the gay society; and everyone who expects realistic (and hence probably rather unfunny) portrayal of such a theme is better off NOT watching a comedy featuring gays (don't most comedies thrive on making the stereotype seem funny?) It may not be politically correct all the way, but hey; society's too hung up on all this political correctness as it is,. The characters in this movie were lovable, perhaps BECAUSE they were stereotypical depictions. However they're brought to life so well by the actors playing them that it doesn't make you shake your head in frustration over yet ANOTHER movie portraying stereotypes, but rather makes you shake your head in laughter over the deadpan things they say and do, which are so obviously unreal at times that anyone who thinks this movie will promote a false picture of the gay community needs a reality check. <br><br>The script is amazing, and even though it may really be too over the top once in a while, it doesn't distract from the overall picture. The story isn't much; the focus on details is what makes this movie funny. Little gestures, frowns, face expressions and little subtleties make this movie one of the best comedies I have ever watched, and probably one of the best comedies I will ever be fortunate enough to see in my entire life. Contrary to what it may seem like at first sight, the humor is overly refined without being intellectual, instead of jumping in your face all the time.<br><br>What's more, the cast is great. Both Robin Williams and Nathan Lane are very fine comedians who have the touch it takes to play a role like this one. They make over-the-top stereotypes actually FUNNY, instead of just laughable.<br><br>And yes, I HAVE seen the original movie, not all too long ago actually, and I have to say the remake is twenty to the power of 99 times better than the original. I barely laughed, and the original version was in my eyes an utterly forgettable movie. And that coming from a person who usually hates remakes. <br><br>This movie gives the original \"Birdcage\" a fresh new shine and transports the story into the 90's. Well made, on all accounts, I can't think of a single criticism!","user":"Koteas1","rank":[133,167]}]