[{"title":"The secret is in plain view","rating":10,"date":"10 April 2000","review":"A SPOILER<br><br>I was inspired to write this, my first film commentary ever, when I was reading through those already posted.  It struck me that nobody seemed to have got who \"the girl\" (played by Polanski's wife Emmanuelle Seigner) is! Everybody who mentions her -- and most do -- say she's in the film for no reason, she keeps appearing and disappearing to no effect, she's never explained, and that the film would've been much better if Polanski had only left her on the cutting room floor.<br><br>I hope Polanski is getting a kick out of this: the fact that nobody has got the secret of this, his most recent (and I think brilliant) film.  I hope he's reached the point in his life and career where he cares more about making the art he had in mind than he does about whether people are getting it.<br><br>Darlings, \"the girl\" IS Lucifer!!  It's right out there in plain view.  And this is the beautiful irony of this movie: that s(he) IS right out there in plain view, to all these people who are seeking her, and doing all this stuff to summon her, and she's right there -- which is one of the oft-told truths about gods and deities throughout time, that they're right there, right next door to you, and you don't even notice them.  This is the truth (one of them) that Polanski is putting on screen here.  Witness the scene in the St. Martin Chateau where \"the girl\" crosses paths with Mrs. Telfer; look at the expression on the girl's face; it is ironic and absolutely amused. And there are more \"clues\" -- many more.<br><br>The girl is the only person in the film with actual supernatural powers. She floats.  She is always around whenever Lucifer is being discussed. Although she repeatedly rescues Corso, she has anything but an angelic face. Her beautiful face has a subtext of evil and corruption.  She anoints Corso with her blood in an arcane symbol on his forehead!  And -- the giveaway -- when she finally has sex with him, didn't you notice that her eyes turn into demon eyes? that she morphs into a devil?<br><br>This is really a love story.  It is about Lucifer finding a mate  -- the person s(he) will accept to enter through the Ninth Gate into his/her kingdom.  You can see how \"the girl\" is evaluating all the candidates throughout the film and how s(he) decides on Corso who is, after all, corrupt from the very beginning and therefore a likely candidate.  Witness the scene when Corso is beating Pablo to death, pounding him repeatedly on the face.  \"The girl\" says \"Well, Mr. Corso, I didn't know you had it in you.\"  She is obviously pleased with him; she is choosing her mate!!!!  The reason she keeps rescuing him is because he is the one she's seriously considering.<br><br>Watch the film again.  See if I'm not right.<br><br>Anyway, what probably has Polanski laughing is the fact that he managed to disguise all this so brilliantly simply by making Lucifer a girl.  He's probably a bit surprised by how completely this simple gender-switch had the audience totally fooled! If \"the girl\" had been \"the boy\" -- an equally beautiful young man who follows Corso throughout the film -- I'm sure half the audience would've gotten it.  But nobody, still, can imagine that the mythic figure of the devil could be female. But of course! The gods are androgynous; they have to be!<br><br>And Polanski adds yet another layer of irony and humor by dressing \"the girl\" as a student with different color socks: the most innocent, innocuous, universal and asexual dress imaginable.  Put yourself in Lucifer's shoes. Isn't this how you'd disguise yourself, if you were making a visit to earth? Obviously it is because, if the people who saw this movie are any sample, nobody would suspect.","user":"diana-51","rank":[356,388]},{"title":"What Corso represents (a theory about the last engraving)","rating":10,"date":"26 April 2006","review":"This is not so much a movie review (those are done well elsewhere), but a theory about the ending of the movie and who Corso really represents.<br><br>SPOILER ALERT**** I too have enjoyed reading the posts and have come up with something that I just wanted to throw out there. Corso is a biblical figure--he is the serpent in the ninth engraving. After all Corso experiences each of the engravings on his quest, so logically he would have to experience the ninth engraving as well. Since the woman in the ninth engraving is \"The Girl\"--who presumably is the Whore of Bablyon (a case will be made later on that the whore=Lucifer), the only person that Corso could be is the beast---which is a subtle but powerful point of the film/book.<br><br>The beast in the engraving has 7 heads which could conceivably represent the seven deadly sins--(i) pride (ii) envy (iii) gluttony (iv) lust (v) wrath (vi) greed (vii) sloth--throughout the film Corso commits each one of these sins, but it is done gradually. The point being that while everyone is on the lookout for a \"beast\" or other terrible creature it could actually just be humanity falling victim to the sins. When Corso kills the man in the cellar the girl exclaims \"I didn't think you had it in you.\" This is what sealed his fate as her chosen one.<br><br>Just like \"The girl\" Polanski puts Corso right out there in front of everyone to see, but we tend to ignore him and focus on the evils committed by Boris and Liana. But those people are not who the devil is interested in, the devil wants people who are consistent and gradual with their sinning. Corso is perfect as this \"everyman.\" Incidentally this is why I think \"The Girl\" represents Lucifer, because she is out there for everyone to see. All the idiots are busy trying to summon the Devil but she is right there for everyone to see. (refer to diana 51's post somewhere here for more on this, she does a great job as do many others). Just like people are always looking for the sign of the beast or his return--and tend to lose the forest from the trees (i.e. their own sins) Incidentally the \"whore of Babylon\" symbolism is apt because, just as a whore is a servant, she can become a master. just like the girl in the movie--she \"served\" Corso at many points but she also made it clear who was boss (i.e. when she twisted his arm after he grabbed her in the hotel lobby and when she held him back from saving Liana from Boris).<br><br>More generally Whores are there to offer immediate gratification, but many men have fallen victim to manipulation and have ruined their lives in pursuit of a whore. (This argument is not meant to limit whore to just male/female, a whore presumably offers immediate gratification, thus it is more beneficial to think of a whore as anyone who offers the quick fix--which is the Devil for all intents and purposes). However in order to obtain that quick fix how many of the seven deadly sins must a person commit?Chances are that a few transgressions would normally be in order.<br><br>The reason that \"The girl\"/Lucifer picks Corso out of all the other evil people is because he doesn't commit the sins all at once for the quick fix. He starts out his quest purely for greed, and a long the way commits each sin as he sees fit or just for the hell of it (i.e. sleeping with Liana even though he had no intention of giving her the book; accepting another \"zero\" to the paycheck even though a friend of his was killed; not caring about getting paid by Boris at the end--he wants the engravings). Finally when he realizes the power that is at stake he is willing to make the ultimate jump to wrath (first he kills the guy in the cellar and then he kills Balkan when on fire). BUT both times he didn't need to kill those people, he could have left Liana's helper knocked out and he could have let Boris burn to death, but he just wanted to kill them out of anger (contrast this to Boris who killed for the pages in the book--and killed Liana so that she would stop bothering him). Gradual decent into evil and darkness is what endeared Corso to Lucifer/\"The Girl\" and that is why he came to Corso in the form of a woman and helped him along his path. Ultimately you become one with the devil when you commit all seven deadly sins because that is the power that humans have--to choose between good and evil. That is symbolized by the ninth engraving with the woman \"riding\" the seven deadly sins--and thus unlocking the gate into the Kingdom of Shadows.<br><br>(Because the word limit is set at a 1000 for comments, this post is not able to discuss some other interesting points that are brought up by others. There are some who believe that Corso is not evil at all, or rather that he has no choice in his path (i.e. he attempted to save Liana and he shot Boris out of compassion). I attempt to give my take on that in a post located at http://www.imdb.com/title/tt0142688/board/nest/41792586 (May 4, 2006 @ 11:04), but it's meant to be a complement to this post). Please forgive any repetitions. The variation in interpretations of this movie only reinforce the fact that it is a unique cinematic gem.","user":"mnjacks","rank":[138,161]},{"title":"A Great Film - Highly Underrated","rating":10,"date":"31 July 2003","review":"The Ninth Gate is a great film and one of Roman Polanski's most underrated films. Twenty years from now people will give this film the respect it deserves and hail it to be the great film that it is. <br><br>Fist of all The Ninth Gate is not an action film. It's a slow-paced psychological thriller very similar in tone and style to Polanski's earlier films Chinatown and Frantic. Johnny Depp and Frank Langella both give great performances. Darius Khondji's photography is amazing and it has an even more amazing score by Kilar. The majority of the film was shot on location and is like a guided tour through Europe.<br><br>Ignore the negative reviews and comments from people who've been brainwashed and blinded by the current Hollywood fast-food style of film making with the intention of only appealing to the lowest common denominator. A review doesn't make a good film better or a bad film worse. A superb film. Rating 10 out of 10.","user":"Bloodfordracula","rank":[462,568]}]