[{"title":"Clancy's Best Movie Outing to Date","rating":8,"date":"18 September 2002","review":"Tom Clancy's Jack Ryan has had an odd time at the movies. So far 3 actors and as many directors have had a go at him, with varying degrees of success. Hunt for Red October might come up in conversations more often, but it's hard to get past the silliness of Sean Connery pretending to be Russian (and speaking worse Russian than Baldwin's American character).<br><br>Clear and Present Danger is where your money belongs. One of Clancy's best Ryan efforts in print, this massive door-stop of a book was condensed by veteran scribes Steven Zallian and John Milius - how's that for a screen writing combo? - into a script that retains a lot of the original's moral complexity while making smart concessions to the blockbuster format. For a blockbuster is what you have before you, and one of the smartest ones out there, where art and commerce were combined in perfect harmony.<br><br>As Ryan 2.0, Harrison Ford is perfect in the lead, and it's hard to believe at times, that Clancy didn't have him in mind when creating the character. With a narrative this fragmented, it is essential that the supporting roles be pitch perfect and across the board everyone does first-rate work, with special mention to Willem Dafoe as John Clarke and Donald Moffat at a devious commander in chief.<br><br>Philip Noyce builds on his Ryan-debut Patriot Games and shows he is equally at ease with the quiet parts and the loud ones, particularly an RPG-powered car ambush centerpiece. The action beats are used sparingly but with brilliant precision.<br><br>All in all, this is smart, tight, believable and expertly executed. It is that rare brainy \"action\" film that will involve you and have you hanging on the edge of your seat.","user":"OttoVonB","rank":[68,81]},{"title":"A Lot More Good Than Bad","rating":8,"date":"21 March 2006","review":"Harrison Ford returns as \"Jack Ryan,\" star of the very well-done \"Patriot Games,\" the film adaption off the best-selling Tom Clancy novels. Also returning are Anne Archer and James Earl Jones.<br><br>THE BAD - This isn't as intense, especially in the first half hour, as Patriot Games and the ending was a little disappointing with a action-scene credibility problem. Once again - it's getting to be a tired Hollywood theme - top U.S. government officials, going all the way to the President, are corrupt people, liars not to be trusted.<br><br>THE GOOD - It's nice to see Willem Dafoe finally play a good guy. The villains in here are deceptively interesting, actors such as Joaquim De Almeida, Harris Yulin and Henry Czerny and Miguel Sandoval - not big names but recognizable and good actors. The violence is not overdone in here and when the action does occur, the sound is terrific. The best action scene was shootout in the streets with snipers firing at cars below. <br><br>The positives are far more than the negatives, making this a solid thriller.","user":"ccthemovieman-1","rank":[51,62]},{"title":"nice mix of intrigue and action","rating":8,"date":"2 June 2015","review":"President Bennett's friends are murdered by Columbian Cali cartel drug lord Escobedo. He seeks revenge by declaring them Clear and Present Danger. Presidential Adviser James Cutter and Bob Ritter sends John Clark (Willem Dafoe) and his team to direct bombs on the targets. It's a secret mission that neither Jack Ryan (Harrison Ford) nor his mentor Jim Greer know about. Greer is sick with cancer. Ryan is appointed Deputy Director of Intelligence and sent down to Bogota. Meanwhile Escobedo has intelligence operative Félix Cortez who has inside info in the White House and plans of his own.<br><br>It's an intriguing political espionage mixed with some well executed action scenes. The ambush in Bogota is terrific action. Joaquim de Almeida is a great villain. He has a great depth which is perfect for his double dealing. It's a well made Tom Clancy spy movie.","user":"SnoopyStyle","rank":[14,15]}]