[{"title":"a modernist masterpiece","rating":15,"date":"15 March 2001","review":"One of capitalism's favourite pretences, especially when making bogeymen of alternative ideologies, is that is is natural, the obvious orientation for any society, the inevitable result of progress, while all other systems are theoretical, foreign, applied.  'Songs from the Second floor', which could be subtitled 'Fall of the Western Empire', takes this assumption literally , and makes late capitalism the natural environment in which its drama plays itself out.<br><br>The ethics of capitalism are figured in architecture, in the way people compartmentalise and miniaturise their lives, the way they treat other humans, the mechanical way they move.  The film's look is updated Kafka - the nightmarish bureaucracy, the endless corridors, where the individual is arbitrarily humiliated, furtively watched by a frightened audience behind adjacent doors.  The recurrent motif of the film, besides the endless triangles, is of frames - there is not a single composition that doesn't give onto other frames: windows, doorways, corridors, elevators, streets, etc. - like a kaleidoscope, the mere switching on of a light can radically reconfigure these spatial arrangements.  This might seem to open up a very claustrophobic world, suggesting another world beyond the rigid frame we watch; rather, it creates a hall of mirrors effect, one world reflecting itself, in a whole city, society, culture - a never-ending repetition of the same lifeless tableaux that comprise this way of life; a prison literalised in the infantilising case of the senile military commander.<br><br>\nBecause this way of life is made to seem natural, feeding into the very buildings in, and gestures with, which people live, its collapse is not sparked by an external force, but results in an implosion of the environment, buildings toppling, the ground tilting like a sinking ship, the body, mind and society breaking down, a whole world grinding towards sterility and inertia.<br><br>This is where Andersson's career as the 'world's greatest advertising director' (dit Bergman) comes in.  Normally a career in advertising results in films of glossy shallowness.  Andersson takes a theme of Fellinian decadence - think 'Satyricon', 'Casanova', 'Ship of Fools' - where a sophisticated society begins to decline, where immutable buildings begin to crumble, crowd hysteria is let loose, where public rites frame primitive barbarism (the sacrifice of young girls to appease the pagan gods) are all filmed like an Ikea advertisement, full of antiseptic sheen.<br><br>The film could be described as 'The FAst Show' directed by Bunuel.  The narrative consists of connected, but self-contained vignettes or sketches with a recurring set of characters.  Most of them would be simply funny jokes in a TV show - the magician who really saws a volunteer's chest etc. All have the concentrated brevity of an advert, all the visual imagination and surprise necessary to capture the viewer's attention.  But what the film is advertising is the decline of a soulless consumer society, a society where the minimalist surroundings reflect minimalist humanity, where human relationships (especially in families) are grotesquely alienated.<br><br>Despite its post-modern sheen, the film's source are very - gloriously old-fashioned modernist or classic auteurist - Fellini (especially the scene at the airport, where the  escapees are bogged down by bulging luggage), Dreyer (the sensitive poet gone mad because of his society); Godard (the apocalyptic traffic jam and barbaric bourgeois behaviour); Antonioni.  BUt the presiding spirit is Bunuel, with the 'Milky Way'/'Phantom of Liberty'-like surrealist picaresque narrative, full of bourgeois-baiting and random violence; the 'Exterminating Angel' scene where the civic and clerical worthies are paralysed in the hotel, frothing like distempered dogs; the perverse anti-clericism that convincingly creates a vision of hell climaxing in an ambiguous scene of resurrection (the crouching crowd in the fields) and despair (the rubbish heap of crucifixes).<br><br>What Andersson truly shares with Bunuel, however, is a skewed comedy, never letting the Big Themes get in the way of the rich detail - the wonderful scene with the tramp, rats and ex-girlfriend especially.  For all its alienated style and dehumanisation, 'Songs', like Bunuel, is devastatingly, humanly angry, and somehow very moving.  the meticulous smoothness of the filming actually creates an oppressive violence in the viewer, a desire to smash the whole glasshouse down.","user":"the red duchess","rank":[114,136]},{"title":"an extraordinary examination of a society not so far away","rating":28,"date":"28 February 2001","review":"I have only seen this movie once and that is certainly not enough. The pictures contain more than our perception can handle. The general impression of the film is however, that Roy Andersson has performed a splendid diagnosis of our society, a society whose individuals no longer communicate, no longer interact. He shows us the result of a system that proclaims egoism and neglect. The message is clear: Only together, people can find a way to endure the tragedy of life, only together, we can enjoy the small fragments of happiness that life offers.<br><br>I encourage all non-Swedish people to see this film, 99,84% of the world population is not Swedish. This movie concerns all of you.","user":"axel-32","rank":[32,37]},{"title":"\"Slapstick Bergman\" indeed","rating":8,"date":"13 June 2003","review":"One critic described this film as being \"Slapstick Ingmar Bergman\";  it's a great joke, and in many ways a true one.  I've never seen a movie like this before, and I haven't laughed so hard at one in years.  Every single scene has something off-beat or funny happening in it, so that you may want to see it more than once.  (I watched it twice in one day!)  The best bit occurs when the businesspeople decide on a rash course of action to save the faltering economy.  I won't spoil it for you but trust me, it's one of the blackest comic moments in all of film.  Don't miss it!","user":"-88","rank":[19,21]}]