[{"title":"Not half bad and lots of small quirks that will make you smile","rating":6,"date":"25 October 2013","review":"Doctor Dolittle (1998)<br><br>I was surprised to see this movie got such a low rating—it's not so bad. Oh, for sure it's not so great, either. But Eddie Murphy alone makes it something worth watching (he's one of the few perfect-pitch comedians out there). And the story, a 1920 classic for children, is something of its own.<br><br>What falls apart is the slightly pushy sentimentalism and the generally mediocre secondary cast. That might be enough to push it into mediocrity, for sure, but it's not meant to be a deep classic, and it plays with the story nicely.<br><br>That story is not just about a doctor (of the human type) who can hear animals talking. It's more about how society condemns hims and tries to help him with psycho-care. His bland wife (with the gorgeous eyes that get overplayed) is typical of his \"friends,\" all nice people with distractions and no time for the possibility that he might, in fact, hear animals talk.<br><br>The talking animals are of course great fun, from the rats to the tiger. This is the part of the movie that is meant to appeal across the board, and it does, including its good special effects. The feeling of family, not dysfunctional, is another bit of warmth, not to mention that the family is African American, a nice twist on the original story based on an English doctor.<br><br>And though the movie was not liked by critics, it has made a third of a billion dollars, which speaks for itself. Not a masterpiece, and not even a classic, it still has wonderful aspects including a very wonderful basic concept.","user":"secondtake","rank":[9,9]},{"title":"Amusing lines but weak plot","rating":2,"date":"2 October 2003","review":"John Dolittle was a worrying child  his father always caught him pretending to talk to animals and eventually had to get him to stop it.  As an adult, his gift is long forgotten until he hits a dog with his car and hears it talk to him.  When he realises that he is not going crazy and he can talk to them he is suddenly inundated with animals to treat, his family is falling apart and his business partners think their whole business is at risk.<br><br>Eddie Murphy basically rebuild his career around a couple of big comedy remakes which relied on humour and effects.  Here the humour consists of good lines and the effects the animatronic animals.  The plot is the weakest point of the film and, although it has a basic story, it never really involves or becomes important.  Supporting the film then is some funny lines (rather than consistent jokes) from the animal support cast  whether it be main characters (Rodney the hamster) or quick one-liners (`I am Kyser Soze').<br><br>The effects are surprisingly ropey  they look good but they don't move naturally and the cuts between the real animals and the puppets are very clear.  The support cast basically carry the movie and save it from being pretty dire stuff.  Rock, Brooks, MacDonald, Leguizamo, Shandling etc all do good work and their dialogue basically consists of one-liners rather than anything else.  Beside this the adult cast look like straight men.  Murphy is quite dull and even the likes of Platt and Boyle (who usually do OK in small roles) have little to do.<br><br>Overall this is fun to watch simply because of the support cast and the regular sharp lines of dialogue from the animals.  However, look for any more than that and you'll be disappointed.","user":"bob the moo","rank":[16,20]},{"title":"\"Doctor Dolittle\" does a lot with Chris Rock","rating":6,"date":"1 May 2006","review":"OK, so \"Doctor Dolittle\" is mostly stuff that would only appeal to little kids, but it is worth seeing (I've actually never seen the original version, which I heard was a pathetic excuse for a movie). Eddie Murphy is, in my opinion, trounced in the movie by Chris Rock as the out-of-control hamster. I almost wish that they could have had more scenes with both Eddie Murphy and Ossie Davis (yes, Ossie Davis went so far as to take a role in this movie).<br><br>So, this movie's nothing special, but pretty funny nonetheless. Also starring Oliver Platt, Peter Boyle, Richard Schiff, and the voices of Albert Brooks and Ellen DeGeneres (who would later co-star as the voices in \"Finding Nemo\").","user":"lee_eisenberg","rank":[11,13]}]