[{"title":"I adore this movie","rating":10,"date":"14 December 2012","review":"I watch it every year. I've read negative reviews of Mara Wilson's performance but I think she is charming and smart but not at all obnoxious or know-it-all as others have said. She is acting over maturely as she was raised by her no-nonsense and jaded mother. Her subtle winks and expressions are very apropos to her role and she interacts very well with Mr. Kringle. (Perhaps I like her because she looks like my daughter when she was little.) Regardless, I love the way this story is told and Mara makes it for me. Even though logically she was taught that Santa was not real, as a little girl she was still willing to believe. Take a little joy in believing! I hope you enjoy :)","user":"pegaroo2-235-917453","rank":[42,48]},{"title":"51 year old guy bawls his eyes out, as usual","rating":8,"date":"19 May 2005","review":"I can't see why a retelling of a really good story gets panned. It stayed true to the original concept, that believing in something good, even if it only comes once a year, can make us better. If I may reference another Christmas classic of which there have been several worthy interpretations, \"Scrooge\" (1951), the young Scrooge says to the young Marley upon their meeting, \"I believe the world is becoming a very hard and cruel place...\". If it was that way in the 1800's, it's ten times worse today, and therefore all the more reason to be reminded of our better nature. I especially enjoyed the scene where the streets of New York City were filled with throngs of people, traffic on the bridges was stopped, all waiting for the verdict. I know NYC well, and how its people rise to such occasions. These scenes were not in the 1947 version, and I think they added a uniqueness to this version. Better, worse than the 1947 version? Neither - just different, and just as valid.","user":"ProudSonOfNewJersey","rank":[57,74]},{"title":"Good movie, little cheesy","rating":7,"date":"21 December 2010","review":"Honestly, I'm not one for Christmas moviesnot that I'm a Grinch or a ScroogeI'm just not one for cheesy happiness. Me and my boyfriend were up watching TV, when we ran across ABC Family and them premiering the 1994 version of Miracle on 34th Street. My boyfriend immediately stopped channel surfing and asked if I liked the movie. When I told him I had never seen the movie, he insisted we watch it. I do have to say, this movie was happy, and at time cheesy, but overall it was a good movie. It's honestly not my favorite Holiday movie out therestill, I enjoyed watching it and feeling the spirit of Christmasbelieving. If you're looking for a good holiday movie that will lift your spirits, try this one out. But me, personally, I would grab Elf or the Grinch before I would grab this moviebut that's just my opinion.<br><br>For daily movie reviews visit: http://kimsmoak.com/","user":"kim_smoak","rank":[7,8]}]