[{"title":"A+ for a B movie","rating":9,"date":"14 May 2011","review":"My girlfriend and I had a movie night recently in which we watched the critically (and audience)acclaimed Black Swan, Jackass 3 and this. I bought it mostly because I heard it had some A listers in early rolls and I enjoy trying to point out future stars before my girlfriend can recognize them.<br><br>I'm sure I would be mercilessly attacked for saying this on a Black Swan board -or even a Jackass board for that matter- but we both chose My Boyfriend's Back as easily our favourite of the three. Sure it was stupid, but after the dark, serious feel of Black Swan, it's silly, goofy tone was all the more appealing. Andrew Lowery is quite likable in the lead, and Traci Lind is lovely in a roll that was likely quite difficult to play. Her character was required to show some very serious emotions in a very unserious movie, and she seemed to walk the line between them admirably.<br><br>The supporting cast was a joy, without fail they understood the script's oddball, offbeat humour and really ran with it. The scene stealing Mary Beth Hurt was a stand out as Lowery's too understanding mother, and Cloris Leachman was excellent in a small, rather thankless cameo. Celebrity watchers will find plenty to keep them busy here as well. A young Matthew Fox (future star of Lost)makes his film debut; Oscar winner Phillip Seymour Hoffman plays his loathsome sidekick;as well as Edward Herrmann and Austin Pendelton(from HBO's Oz, not to mention countless other films and TV shows); character actor Paul Dooley; JFK's Jay O' Sanders; and even Matthew McConaughey makes his film debut as Guy in Movie Theatre. <br><br>Perhaps this means I don't have any future as a film critic, but I was really surprised that both of us enjoyed a low budget flick with a rating under 5 and less than two thousand votes hands down over a 13 million dollar movie with 100,000+ votes and a rating over 8. <br><br>I guess my point in all this is that you really can't judge a movie based on the general consensus about it. Had I dismissed this movie because of it's low approval among both critics and IMDb user's (as I normally would have), we really would have missed out on a sweet, irreverent little hidden gem. When selecting a movie, don't just check the star rating or critic approval percentage, but scan the fan reviews as well and see if any really speak to you. You just might end up turning a rather uninspired date night into an unexpected last minute success.","user":"Gprime1318","rank":[14,15]},{"title":"Underrated Black Comedy","rating":8,"date":"19 July 2004","review":"You want to see a zombie movie, but your girlfriend wants to watch a romantic comedy.  What do you do???  Compromise!!!   This movie bombed at the box<br><br>office, if I recall, and didn't do too well on video either.  As such, its hard to find out there (I had to visit 15 video stores personally), literally making this a hidden gem!  While the narrative is a little off, the one liners alone make this Romantic Black Comedy about a zombie truly entertaining!  And while most of the actors in it have fallen off the face of the earth (except Edward Herrmann and a very young Phillip Seymour Hoffman), they help make this film what it is. Definitely worth hunting out if you want something a little different than your average run of the mill comedy.","user":"LONDON537","rank":[19,22]},{"title":"Sweet. Charming, Blackly funny","rating":16,"date":"16 April 2000","review":"This really is special: a zombie movie about acceptance and love. Our zombie's parents accept him with barely any question, because he's their son, and our zombie's girlfriend accepts him because the depth of his love is what has enabled him to return from death and make it to the prom, even if that means his devouring a couple of classmates. Charming and sweet, and I mean that sincerely,","user":"angelynx-2","rank":[14,16]}]