[{"title":"The most uncompromising studio picture of the 1990s.","rating":10,"date":"20 February 2000","review":"A complex, multilayered, beautifully directed film, Martin Scorsese's Casino is a masterpiece of destruction and betrayal. Few films take so many chances and succeed so wonderfully. It takes some of the basic formulas that were found in Goodfellas and applies them to another type of story - while Goodfellas' view was ground-level, telling the story of the \"blue collar\" gangsters of NYC, this film tells the story of the guys who controlled those guys. And it's fascinating to watch these people run Las Vegas, control the flow of money, and then fall from the heights of power due to lust, hubris, and greed. An amazing film that will hopefully get the recognition it deserves in the years to come.","user":"contronatura","rank":[290,343]},{"title":"An underrated and undervalued Scorsese Classic","rating":10,"date":"28 October 2000","review":"If you haven't seen Casino yet, stop whatever it is you're doing, rush to the nearest video store, rent it, and watch it.  Along with Mean Streets Casino is probably Scorsese's most underrated and unheralded picture.  I would also venture to say that this is probably his most ambitious film. The film deals with a particular time period and a particular atmosphere and accomplishes an overwhelming achievement by creating and accurately portraying both.  The art direction is splendid, most likely the best of any film Scorsese has ever done.  The acting is superb.  I never thought Pesci would be able to top his dynamic performance in Raging Bull until I saw Casino.  Every time I watch this picture I fall in love with it all over again.  This is the most honest depiction of Las Vegas, especially of the time period it was portrayed in.  Scorsese's direction is flawless. Perhaps it is because I watch alot of Scorsese and Kubrick films, but I am becoming less satisfied with plot driven films and more enamored by films that possess the freedom that typical stories just don't seem to hold.  Sharon Stone gives the best performance of her career, and as far as the editing is concerned, well if you believe like Kubrick and Pudovkin that a film is not shot, but built who better to have on your team than long time cohort, collaborator, and editor Thelma Schoonmaker.  Ultimately, the genius of Scorsese is not just in the mastery of the medium, but in the understanding and appreciation for the necessity of great collaborators on all levels that Scorsese has consistently utilized throughout his career.  Casino exemplifies not only the best of a Scorsese film, but transcends it.  This film is truly a gem.","user":"famsmith","rank":[332,413]},{"title":"\"Now it looks like Disney Land\"","rating":10,"date":"30 October 2003","review":"This is one of the best films of the 90's hands down. Without a doubt this has become one of my favorite movies. I'm not sure why really, I just love it. I think because I read the book and a lot of what happened in real life happened in my little town in Chicago. No names, and my old boss who runs our town grocery store actually knew \"Ace\". Again, no names. That was always pretty cool to me, since my town really didn't have much excitement. I guess also because I'm a huge fan of Martin, Robert, and Joe's. When they work together, they create masterpieces. <br><br>I've read a lot of comments on IMDb, and more than 50% of the comments are calling this \"Goodfells Part 2\". Is it \"Goodfellas Part 2\", in my opinion, no. Yes, it's very similar situations, but it's not the same plot. It's a little more gory and more bright. \"Casino\" is mainly about the rise and fall of Las Vegas. When Robert DeNiro's character says \"It's more like Disney Land now\". Actually that's true, it's not like it used to be. I'm only 20, but my mom and dad told me how different the times were in the 60's and 70's. Everyone was more close and wanted to know who you were and how everything was going. Everything is more corporate greed now-a-days. But back onto the movie, it does have gangsta's in it, and with that comes some pretty gruesome violence.<br><br>Robert DeNiro. No words can describe how wonderful of an actor he is. If you read in most of my comments, you can tell I'm a fan. This movie is actually what made me into a huge fan of his. He's dialog and image is very powerful and you understand his position. You want to love him, even though technically he's a bad guy too, you still think he is so cool. A lot of people I talked too: the guys wanted to be him and the girls wanted to be with him. What a performance, it deserved more praise.<br><br>Joe does it again being the A$$hole who thinks with his gun and not with his head. Joe as an actor is very remarkable. He's only 5' 6'', but he is so intimidating. His speech in the desert with Ace and the big confrontation. \"You want me to get out of my own town?! Don't *bleep* with me, Ace!\" Does he swear in this movie? Oh, yeah. A lot, we're talking 400+ f-words, guys. But you get past the vulgar language and just enjoy what Joe says and does. The head vice scene and the metal bat scene with Joe is two of the most disturbing scenes in cinematic history.<br><br>Sharon Stone, what can I say? What a remarkable performance! She was very much robbed of her deserved Oscar. I was reading in my \"Rober DeNiro: A history of his films\" that Sharon over shined both Joe's and Robert's performance. In some ways that is very true. She plays a gold-digging, druggie, drunk, hustling, whore. She is very glamorous in the film though, she is covered in beautiful gowns and jewelery that no guy could ever resist. Her first scene where Robert first sees her and she is stealing chips from a guy who has \"hired\" her for a night was extremely effective. You can see why Ace fell so hard for her. What a terrific performance in the end. When she screams at Ace \"I will go to the FBI! I will go to the police! I'm not protecting you anymore!\", you get scarred and can't help but watch more even though you are sitting on your butt for more than 2 1/2 hours. You hate her character so much, you want her to get what's coming to her, that's what makes a terrific performance. When you actually want to make sure that this character gets the justice he or she deserves. Sharon, I apologize, you deserved more praise as well.<br><br>Martin Scorcesse. One of the greatest living directors of our time. This film was very wonderfully made with great visuals. The soundtrack really adds a lot, I'm telling you, and the theatrical trailer with the song \"Gimme Shelter\" by the Rolling Stones, what a great feel. Martin has been nominated several times for an Oscar, but they snub him. I think because his films are so violent and typical. But they remain classics. I'm disappointed with the Oscars, this man deserves more. <br><br>Whew. \"Casino\" is an excellent movie that I highly recommend for mob movie lovers. Don't compare this to \"Goodfellas\", let it stand on it's own. But please, this is not a movie for children in any manor. For the parents, this is a movie that should be on the wait until the later teens. It's very violent, we're talking a head in a vice, a beating with a metal bat(just to name a few violent scenes, there's more)drugs, sex, and very vulgar language. This is for adults only!It's a great movie that deserves very much to be on the top 250. I'd like to see it in the top 100, but we'll see. <br><br>10/10","user":"Smells_Like_Cheese","rank":[279,354]}]