[{"title":"Words cannot describe the greatness of this movie","rating":10,"date":"14 October 2005","review":"A Terminator(Arnold Schwarzenegger) was sent from the future to kill the unborn son of Sarah Connor(Linda Hamilton) in the original. Now, that Terminator has been sent back again but with a different assignment: Protect John Connor. John Connor(Edward Furlong) is now about 10 years of age and must evade a new Terminator sent to kill him;The T-1000(Robert Patrick). Sarah, John, and The Terminator journey together on their quest to stop Judgement Day, with a trailing, shape-shifting Termiantor trailing from behind.<br><br>This is the greatest of the Terminator trilogy. I have watched three times in the past year and have not found anything that Cameron could have improved on. The move is a masterpiece in every aspect of film. Schwarzenegger's acting might not be incredible but this is the perfect role for him. He isn't supposed to show emotion or feelings. He is a machine. I hate almost every one of his movies besides this trilogy because he is a horrible actor but he works perfectly into this role.<br><br>The special effects are incredible beyond belief. The shape-shifting T-1000 is some of the greatest animation I have witnessed in cinema history. It absolutely blew my mind when I first experienced this visual extravaganza. The animation looked so real(remembering this was a good ten years). The movie included fast-paced action along with some clever sci-fi drama/horror. The idea of a vast army of machines taking over the world after sending off warheads to every major city should be scary enough. But the T-1000 has very little lines and is just creepy enough to make twitch when you see him.<br><br>Sci-fi movies can rarely be made in such way that can be looked at as works of art. This is one of the few exceptions. The prediction of judgment day with Hamilton watching a playground full of kids be burnt to the ground is an absolute brilliant portrayal of Armageddon. The theme that men will destroy themselves is also shown throughout the movie also and is even said by The Terminator\" It's in your nature to destroy yourselves\". This brings the movie to a whole new level of sci-fi.<br><br>Overall, Termiantor II: Judgement Day is an absolute must see classic. If you have not seen it, buy it! Because once you have seen it, you will want to do so anyways. It is fast paced and highly enjoyable for just about every audience.<br><br>I highly recommend this movie.","user":"SeminolePhenom","rank":[743,899]},{"title":"the best action film of all time, and NOT due to the CGI","rating":10,"date":"23 February 2004","review":"Disclaimer: If you are a viewer that mainly prefers arthouse-type movies, then you might as well ignore this review. In addition, if you're not able to take a few sci-fi leaps of faith, ignore this review, as well. We'll both be better off.<br><br>This is the finest action movie of all time. And, yet, believe it or not, it's not the action in the film itself that makes this be the case. This is especially odd in a movie with a $100 million budget (in 1991!), with multiple huge explosions, with thousands of bullets fired, and scores of stuntmen used.<br><br>This movie is what it is, a perfect 10, because it takes the vision of one of the most imaginative directors on Earth, and realizes them almost perfectly with all the tools that fit the task -- actors, stunts, puppetry, models, and CG. Without the vision, this film would be nothing. Without the tools, this film would be nothing.<br><br>But, a little bit of background is due. This is the sequel to the Terminator (1984), whose premise was that a near-indestructible cyborg is sent by evil self-aware machines from the near future to destroy the mother-to-be of the military commander who would lead the humans to a victory over the machines. Oh, and this terminator machine would come from a time of war between men and machines which followed a nuclear exchange that left billions of people dead, first. In Terminator 2, John Connor (the commander-to-be) is about 12 years old, and his mother (Sarah) is feverishly trying to prepare him for his fate, even as she tries to stop the factors that will lead to the nuclear war and the entire terrible future that made all this necessary. The machines now send a superior, more intelligent, shape-shifting cyborg (T1000) into the past, to kill John himself. Meanwhile, future-John reprograms the ex-evil Terminator (T101) from the original film, and sends him into the past to PROTECT John against the T1000.<br><br>That's your basic plot. It does involve travel into the past, so it immediately presents a time-travel paradox which can't really be resolved. In order to even try watching this movie, you MUST LOOK PAST THE PARADOX. If you don't, this movie has zero credibility, and is not worth your time.<br><br>What happens after the two terminators appear in the past is a wild ride rife with macho action, dark reflection on the nature of man, and a few rays of hope, here and there. Schwarzenegger (the good terminator) and Patrick (the bad one) make for such effective foes that the times they meet on-screen are completely breathtaking (and odd, given that you repeatedly see the relatively slim T1000 through Arnie through a wall or two). Hamilton, as Sarah Connor, is a wonderful character -- tough beyond all belief and completely focussed on preventing the nuclear war and ensuring John's safety, yet clearly a little out of her mind with paranoia and anger; amazingly, you see actual character development (specifically, when John and T101 arrive at Dyson's house to prevent her from doing what she wants to) in her otherwise 2-dimensional character. And Furlong, as John, is not bad himself as the extroverted kid who's confused by the fact that everyone except his mom tell him his entire upbringing was based on a lie. The bit players all do their jobs well, particularly Earl Boen who plays the semi-sadistic mental hospital warden that stands between Sarah Connor and her son (until the T1000 makes a chilling entrance).<br><br>With these players set in motion, it's up to the script to deliver the real substance of the movie. (One often sees great performances in mediocre films... here the story transcends the performances -- an impressive feat.) The script delivers. The film is absolutely filled with great, classic moments (I counted TEN all-star ones during my last viewing), and they're evenly spaced through the movie. I mean, who doesn't cheer (at least inside) when Arnold steps out of the biker bar, fully clad in leather when \"Bad to the Bone\" music starts to blast? The guy absolutely bleeds coolness. And the T1000 absolutely bleeds evil. But, with so many great moments, you'd think the pacing would be a little uneven... not really! The film shifts from place to place with an ease that makes perfect sense, never giving you the time to start being a little nitpicking jerk, always driving forward, but always doing so thoughtfully and with attention to detail.<br><br>Of course, this wouldn't be an action movie without some action. There's plenty of it, and it's perfectly done. The CG effects for the shape-shifting T1000 were cutting-edge for the time, and still look great (whoever said differently below is simply incorrect) -- even if they're completely commonplace today. The stunts are completely insane in scale (at one point, a helicopter flies under a highway overpass; at another, a motorcycle jumps from the 2nd floor of a building into a flying chopper). (Probably, only the Matrix and the Lord of the Rings movies compare in terms of the level of stunt insanity.) And the gunplay is delivered in perfect Cameron-Schwarzenegger style (as opposed to the slo-mo John Woo-style) -- you'll see lots of heavy automatic and explosive weapons, and you'll see them used well. The film is violent, and somewhat bloody, but ALL of the mean-spirited violence is dealt by the evil characters, not the ones you root for (Quentin Tarantino fans: sorry). And then the truly amazing scenes that bypass acting are shocking and memorable -- just wait until the nuclear detonation sequence.<br><br>I'm not sure what else you would want in a movie. Probably moral content, and the movie has a very clear pro-human, anti-war message. The message is a bit stale, and the delivery IS, at times, a little heavy-handed (and some moments with the T101 seem just a bit unrealistic, towards the end), but the movie has heart, and that you cannot deny. Plus, it simply rocks. 10/10","user":"red_core","rank":[791,974]},{"title":"Movie that everyone should see!","rating":10,"date":"13 March 2008","review":"Greetings from Lithuania.<br><br>WOW! The best word that describes this movie is \"wow\"! Not only to say that this is the best Action movie of all time, this is probably one of the greatest movies ever made . The people in my country watched this film when there where limited VHS cassettes at all. And again, my favorite Director did an timeless epic-masterpiece. Yes, an epic. Every scene in this movie is beyond the perfection. The timeless plot. Groundbreaking effects. Unforgettable \"Hasta la vista, baby.\" .<br><br>Perfect direction for a sci-fix action film. When the action starts, you're in for the ride of your life. There never be the same movie like T2. What else I can say about this film? A Must see for everyone.","user":"851222","rank":[135,159]}]