[{"title":"Good for a night in, but hardly true to life","rating":8,"date":"13 May 2005","review":"Fifteen and Pregnant is a typical 'Lifetime Network' Movie. Girl gets knocked up, family in turmoil, family gets over it, girl has the baby, movie skims over the gory details of teen motherhood.<br><br>Kirsten Dunst plays a teenager still in high school who gets pregnant by her loser boyfriend. She has a friend who was a teen mom and offers Kirsten's character 'real world' advice. The movie ends after Kristin's character gives birth and leaves many realities of being a single teen mom out of the movie. All in all, it's a good story that focuses on the relationship between Kirsten's character and the father of the child and how her family triumphs over adversity. The story is more of how her family, her friends, her relationship with her boyfriend are all affected by the pregnancy and her personal struggle with her feelings and the other characters regarding the pregnancy.<br><br>It's a good movie to see once if you like LMN and Lifetime Movies.","user":"sweetpuppylove","rank":[5,5]},{"title":"Good Movie To Show TeenAgers","rating":21,"date":"21 February 1999","review":"This is a pretty good movie and an excellent movie to show to teenagers who thinks they are ready for a baby.<br><br>Fifteen &amp; Pregnant stars Kirsten Dunst (Interview With The Vampire) as Tina, a 15 year old girl who thinks she has the perfect life.  Parents she occasionally gets along with, a lot of friends to hang out with, and a boyfriend she loves and who acts like he loves her back.  Then the unexpected happens.  She gets pregnant.  Then her whole life is changed forever.  Her mother played by Park Overall (Empty Nest) doesn't want to give it up for adoption but isn't too thrilled with the idea of her keeping it either.  Her father, who is trying to be forgiven for an affair is supportive of Tina, mainly cause he doesn't really know what else to do. Her brother and sister are embarrassed by her.  Her so called boyfriend is more like a wolf in sheep's clothing.  She has a friend, who is single and a little older than her and has a baby.  Her friend can see Tina has no idea what she's getting herself into.<br><br>As I've said, the movie is a good movie to show to a teenager who thinks they are ready for a baby.  The performances are good, especially from Park Overall and Kirsten Dunst.  I only have two problems with this movie.  First is that none of the characters are very likable.  Even Tina the main character.  She's a real bitc* to anyone who looks at her wrong and I had a hard time feeling sorry for her and feeling anything for her really.  I wanted to slap her a few times.   Park Overall's character is also a bit hard to like.<br><br>The second thing I don't like is that the first hour and a half of the movie is very believable but during the last 1/2 hour it loses its realism and goes for the happy ending where everyone is suddenly happy and everyone is one big perfect happy family.  It's as if the past hour and a half never happened and everyone changes personalities overnight.<br><br>Grade wise I'd have to give it a C+ for lack of sympathy for any of the characters and the ending.","user":"Celine-4","rank":[9,11]},{"title":"A great film","rating":8,"date":"11 June 2006","review":"I watched this film whilst on holiday in Tenerife last year. I had to stay in and look after my then 18 month old daughter whilst my partner went down the pub with his friend. The film really hit reality for me. I was 17 when i fell pregnant and 18 when i gave birth to my daughter so a little older than Tina Spangler in the film but i could relate to all the emotions, hopes, the gutted feelings, the ups and downs that Kirsten Dunst played so well. When her friends turned against her, it was exactly what happened to me. But i soon found out into motherhood that you grow up quickly, you make new friends and have new prospects but best off all you have somebody to lavish all your love and attention on. I do not regret having my daughter and although i think this film would be fantastic to show to younger people to show them how hard pregnancy and parenthood can be, i don't think it would put teenagers and young mums off becoming a parent full stop. It was good to know that other people can understand and relate to teenage pregnancy and to make a film out of it was perfect.","user":"Kayley-Duffill","rank":[7,9]}]