[{"title":"The best of Van Damme, a cult classic underdog martial arts film ever made!","rating":10,"date":"30 December 2015","review":"Lionheart (1990) was a real street fighter movie, It was also one of my favorite best Van Damme childhood movies. Beside Hard Target, Kickboxer, Universal Soldier, Bloodsport, Death Warrant, and Double Impact. This is in my opinion the best Van Damme movie since Bloodsport. I Love this movie to death, the movie, is sorta a spin off of Rocky, but it is completely different from that. This film has a heart, it is an underdog action drama about a men, who goes in to the gladiator fights and uses his martial arts to raise money, for his brother's family. <br><br>Lionheart is about a legionnaire who escapes from France to come to US after he find's out about his brother who drug dealers torched him, on a fire alive and that he died. To support his family he goes in to a street fights into a illegal full contact sport for money. Definitely Van Damme's best promising action movie. I love this movie, this is the second movie I saw on VHS when I was a child. It is my childhood movie and I enjoy this movie so much to death! <br><br>\"When the streets are a jungle...there can only be one king.\" <br><br>Jean-Claude Van Damme stars as a soldier drawn in the world of modern day of gladiators fighting for the amusement of the rich in this fast-moving action thriller. Upon receiving news that his brother in Los Angeles is seriously injured Lyon Gaultier (Van Damme) deserts the French Foreign Legion from a remote outpost in North Africa. Fleeing from two of the Legion's security force who have orders to bring him back at any cost. Lyon relecutantly turns to the illegal, bare-knuckles underground fighting circuit to raise the money he needs to help his brother's family. This riveting action-adventure combines the raw power and charisma of Van Damme with the exciting world of no-holds-barred street fighting.<br><br>That is the main basic plot about this film. It does involve gladiator underground bare knuckle fights. Lyon the character Van Damme played wasn't only a Lionheart, he was also a good hearted human been. There wasn't any sex scene in this movie, Lyon gave money to a homeless mom and her daughter who where living on the streets. He never wanted to take any advantage of any woman. This is the first time Van Damme played a Legionnaire, 8 years later he started in Legionnaire (1998) in which Peter MacDonald (Rambo III) directed. Legionnaire was another Van Damme movie I grew up as a child. Honestly I like that movie and I love Lionheart to death! <br><br>Van Damme is the king of the lions for me! The fight against Attila is one of the most epic fight scenes, I've ever seen. That fight to me personally felt a realistic. The punches and blood felt real. Another thing: I had no idea that Ashley Johnson who played Nicole Gaultier, Lyon's nice turned out such a beautiful babe! I didn't know she even played in Mel Gibson's What Women Want. She is the same year born as me, and she is gorgeous, wow. Brian Thompson played again a villain in here, but different type of a villain in this movie. He played Night Slasher in Cobra (1986) my favorite Stallone action flick. The man is very underrated actor, just like Gary Busey he is very underrated of playing the villain characters. <br><br>Of all Van Damme's tournament movies this is one of the best up there with Bloodsport and Kickboxer. I love Kickboxer. I put Lionheart between Bloodsport and Kickboxer because of the awesome fight scenes, multiple fighter each different from each one another, Attila was a great final fighter. I love Tong Po fight more but this and Sandman fight in Death warrant comes very close. I love the soundtrack at the end fight. A Van Damme classic. This movie get's a 10 by me as a Van Damme classic action martial arts film, I have always enjoyed this movie.","user":"ivo-cobra8","rank":[83,92]},{"title":"One of Van Damme's better, more human films.....","rating":7,"date":"16 September 2004","review":"This is one of the few films by Van Damme that stand out in my mind when I think of his 'career highlights'. All of his films are formulaic actioners, but Lionheart is one of his better films. His character is more layered here, which makes this more of a drama than most of his others. We as the audience can feel for his character and, as a result, root for him as he tries to evade his past and help what family he has left. A nice little action film, with Van Damme forced to act a little here. For his capabilities, he is convincing as Lyon. Harrison Page is very good in the film as the ex-street fighter turned confidant, and almost steals the show. A highlight of Van Damme's career.<br><br>*** out of **** stars.","user":"lotus_chief","rank":[51,56]},{"title":"Great Film","rating":7,"date":"13 June 2002","review":"Van Damme is at his best here, it's a good film that moves at a steady pace and is almost like a  Rocky/Street Fighter type film. The characters are played well and the right actors and actresses are picked for the right roles. Van Damme's trainer is great and the silent Van Damme is defiantly the best. The plot also unwinds at the right times and at the right pace. You should give this film a go.","user":"johnnyboyz","rank":[42,46]}]