[{"title":"milestone of childhood","rating":7,"date":"26 January 2013","review":"This movie has defined generations. Kids loved it because this dude who was a good sports player got to play with these loony tones which is what the movie was all about. Its not about MJ, its not about Bugs Bunny, its not about a deep storyline or memorable characters. Its about fun and cartoons,which barely ever make sense, if you remember. Its great fun for the young folks out there, with animation that really is worth watching. Its entertainment for the entire family, combining real life with cartoons as its never done before. I love it, ill always love it. Looks like i have to add a few lines for this review to be accepted and posted. I really have nothing else to add, go ahead and watch it without expecting nothing more than fun and entertainment and you will get far more then you expect.","user":"hedin_88","rank":[28,29]},{"title":"Simply Fun","rating":10,"date":"23 June 2001","review":"If you're looking for intelligent, high-brow comedy...what is WRONG with you, this is a LOONEY TUNES MOVIE!  Sheesh...this film is nothing outstanding, but it is simply fun.  I'm sure that Michael Jordan enjoyed star billing, but as is usually the case when your co-star is a cartoon rabbit with more than 50 years of experience behind him (and one of the best catch phrases in cinema), he is up-staged by Bugs Bunny.  Oh, not to say that Jordan turned in a poor performance.  Thank goodness this guy at least seems to have a good sense of humor.But there's some simple, pure enjoyment in watching this film.  I got a kick out of the big basketball game, and found the sequence with Bugs and Daffy retrieving Michael's lucky boxers to be a riot.  Yea, the plot is pretty hare-brained ('scuse me, Bugs...duck-brained;D), but it's nothing unworthy of Looney Tunes.  Don't ever forget that-this is a Looney Tunes film.  They got away with using anything for a plot, and this movie is in the same tradition.  It's like asking a movie about Beavis and Butthead to be artful and dramatic.  Looney Tunes represent the goofy side of animation, and this film adheres well to that philosophy.  I recommend this for any fan of Looney Tunes...oh yea, if your a sports fan, you should enjoy it too.  I, a mild basketball fan, really enjoyed myself.","user":"Rebochan","rank":[65,80]},{"title":"90's cult!","rating":8,"date":"4 January 2015","review":"Film unmissable. MJ and Bugs Bunny together in a fun and film unique: the films of my childhood. Despite the years watching Space Jam is always nice, because there are few films that can merge reality with the 'animation. Moreover, the presence of a legend sports like Michael Jordan makes this movie a must for any basketball fan, also the film is full of quotations and sports references that make it a real gem. The story is very simple but well managed: a group of aliens to steal players NBA their talent, by doing so challenge mj and looney tunes in Basketball: at stake is the freedom of the animated characters and Legend of the Chicago Bulls.","user":"fabio-albe","rank":[11,12]}]