[{"title":"Hormone Hell","rating":10,"date":"25 May 2008","review":"I am not a doctor, but I I have been teaching psychology for 20 years,and what I think is that she had both a bi-poler disorder (manic depression) and also severe gynecological trouble. She mentions she was perfectly fine after she hit menopause, which says a lot. Remember Tom says she has manic highs and then bad depression? Maybe the bi-polar disorder was somehow caused by the hormone imbalance? What broke my heart is that he was so appalled by her bleeding on their wedding night, which in turn crushed and panicked her. Sorry fellas, sometimes we have no control over these things, and if you are married to a woman for any time at all-you just get used to the little jokes mother nature plays. We know that stress and loneliness only make mental illness worse, and hormonal problems worse too. She was very ill and violent, but I feel Tom turned cold and selfish toward her, which made all of her problems worse. Also remember she purposely misses the \"monkey on a greasy pole\" (catch the symbolism?) mental fitness question, after pleading at Tom with her eyes, but he just looks away.","user":"mdcordova-1","rank":[10,10]},{"title":"The thunder speaks to Tom and Viv","rating":7,"date":"9 November 2001","review":"The film starts with a passionate embrace between Tom and Viv on the innocent setting of an Oxford punt. For the next quarter of an hour you may think that this will be an ordinary, merchant ivory type film about an upper-crust gal and her american beau writing away their cares in the dreaming spires of Oxford. However the idyllic setting and the gentle breezes soon fade into nothingness and before long you are forced to comprehend the tortured soul of one suffering from mental hysteria and the immediate effects of that on those who are subjected to the outbursts. Miranda Richardson's performance as the highly strung wife of one of our most famous poets, takes this film to another level. Although the story is essentially a simple love story why it sits apart from the rest is purely down to the fact that Tom suffers Viv's  neuroses silently like the true English gentleman he has become. Devotees of T.S. Elliot may find that the film is superficial in its reference to his work and that the focus is centered on Viv. Yet at the end of the film I was left with a heightened awareness of what and who might have propelled him to write the way he did. This bitter-sweet film tugs at the heart strings just so.","user":"spoonarhythm","rank":[34,40]},{"title":"Vivienne Haigh-Wood and T.S. Eliot","rating":7,"date":"1 May 2006","review":"Michael Hasting' play of the same title, was seen in New York at the Public theater in 1986. Edward Herrmann and Kate Nelligan played the leading roles. In a way, Mr. Herrmann bore a resemblance to Tom, something that in the film, William Dafoe, an excellent actor, stands in sharp contrast with what the real Eliot looked like. Having seen both the play and the film before, we took another look recently when it was shown on cable. <br><br>Brian Gilbert, the director, showed a sensitivity to the material. He had the advantage of using locales where the real Tom and Viv lived in England, thus producing an immediacy and intimacy that serves the film well. <br><br>Tom, was a man that loved his adopted country. He was a man in awe of the culture and traditions. In fact, he adopted them as they were his own. His entry into that world in which he wanted to belong came to him courtesy of Vivienne Haigh-Wood, an upper class young woman who had her share of physical problems that plays greatly in this story. Viv's problems exacerbated her marital problems with Tom, and her family. Evidently, her condition could have been helped if the doctors that treated her would have gone in another direction, as it's pointed out toward the end of the film by a physician that clearly understood her malady.<br><br>The film is worth a look because of the excellent Miranda Richardson's portrayal of Viv, a woman she captures well for our benefit. This is one of the best appearances by Ms. Richardson on the screen. William Dafoe's Tom gives the impression of being a complicated man. Rosemary Harris is another joy in the film as Viv's mother Rose. Tim Dutton and Nickolas Grace have some good moments in the film.<br><br>\"Tom and Viv\" will not disappoint because Brian Gilbert's fine direction.","user":"jotix100","rank":[25,29]}]