[{"title":"Brilliant coming of age tale","rating":10,"date":"31 July 2004","review":"I didn't know anything about this movie before I have watched it because it was never released in my own country, as well as book was never published. I am not a big fan of Mel Gibson, I thought that he is just average but too overrated actor. So you can understand why I didn't expect too much from this movie. But now, I want to apologize to Mr. Gibson. In this overlooked masterpiece he proves himself incredibly good both as an actor also as a director. The story was absolutely great, realistic and touching. Relations between two main characters  former teacher and young student boy (perfectly played by Mel Gibson and Nick Stahl) were shown as great as it possible. It was for sure best Mel Gibson performance ever. Young Nick Stahl acting also looked incredibly good as Chuck Norstadt. All supporting casts also did a very good job in their roles Director and whole cast team brought to us incredibly powerful atmosphere of total misunderstanding in Chuck family and in the whole town. People can't understand and worst of all they don't want to understand other people, who are not like all ordinary people in their small town. If you're not like all  you're odd and nothing more. This movie teach us never judge people only by appearance and groundless suspicions, teach us always look inside the people. It was very strong, powerful and important messages. All dialogs were very well written and very memorable. In addition to this cinematography and soundtrack were very good.<br><br>So, I consider The Man Without a Face as a stunning excellent film, best Mel Gibson film, one the best of the year and one of the best movies I've ever seen. If you're a Mel Gibson fan or simply love films with excellent story and perfect acting I highly recommend this film. Thanks a lot Mel and all people involved in this masterpiece.<br><br>My grade 10 out of 10 or A+++<br><br>Thanks for reading and sorry for my bad English. Feel free for mailing me about any of my posts and comments here.","user":"Juni78ukr","rank":[59,62]},{"title":"For those with an open mind...","rating":8,"date":"27 September 2003","review":"A disfigured face as a result of a tragic accident, and unresolved suspicions, result in a life of hermitage for Justin McLeod.  His past life as a teacher becomes reawakened by 13 year old Charles, who is on a mission to become educated well enough to pass a military school's entrance exam, and he pleads with McLeod to become his tutor.<br><br>McLeod's dark past and Charles' unrelenting motivation become unlikely allies as the two of them begin a relationship born of the common thread that each are misunderstood by others.<br><br>This is an outstanding movie, which is much misunderstood by many viewers and reviewers alike.  It's a simple case of an adult taking an interest in and making a difference in a young man's life.  The movie is even more poignant because McLeod loses the safety of the anonymity he had worked so hard for, when he opens his mind and heart to young Charles.<br><br>I have read all of the reviews on this site for this movie and object to those who attempt to review both the movie and the book at the same time. The movie should be reviewed here, and the book at a site for reviewing books.  To do both at one time is akin to going to Burger King and ordering a Big Mac.<br><br>You don't need to be a Mel Gibson fan to love this movie, but you do need to have an open mind and an unfettered agenda.  This is a powerful performance by actors Mel Gibson and Nick Stahl, one that will leave your heart happy and your mind engaged.<br><br>Both thumbs up from me for this movie.","user":"glentom1","rank":[51,54]},{"title":"Great film about true friendship","rating":10,"date":"30 April 2002","review":"This movie is in my eyes an outstanding example of what films should be like. Nick Stahl and Mel Gibson show their immense ability to act in such a convincing way that this movie can be quoted as the movie with the most impressive story of true, honest and deep friendship. Nowadays, films are often judged concerning the special effects and the action, and classic movies slowly diminish. This film is unique because of the simple fact that the number of movies dealing with a topic like that, a topic that requires the knowledge of classic acting, unfortunately goes down.<br><br>Nick Stahl, whom I haven't known before, and who is allegedly in the cast of Terminator 3, acts impressive and convincing. It doesn't happen often, but I was moved to tears, for the true friendship between Norstadt and his teacher gives the audience the message that real friendship, the belief in the future and your own self-confidence can help you to solve every problem.<br><br>Congratulations to Mel Gibson and Nick Stahl, movies like this one, carrying such a pure message of life, preserve the issue of classic films: Move the audience, give them something to think about..... and let them feel the magic of films like this one. Watch this movie, and you'll know how to define friendship. Greetings from Austria to all imdb.com users!!","user":"Andreas_N","rank":[32,34]}]