[{"title":"Not Bad at All","rating":7,"date":"1 May 2005","review":"I was actually quite shocked to see the only comment say this movie was very bad. My husband and I had a pretty good laugh with this one and were quite entertained. It's not going to be everyone's taste but if you like slapstick mingled with a bit of stupidity it's right up your alley. I will agree that it is no National Lampoon (Animal House) but it does follow in the same vein as the \"Vacation\" movies though. Chevy and Dianne made a great couple and have a great sense of timing that is so important to a good comedy. Chevy's character similar to \"Vacation\" develops from an disrespected head of the house to a respected Father. Don't pass this one by.","user":"sonjasjunk3","rank":[14,18]},{"title":"DysFUNctional family Robberson arrests stake-out.","rating":7,"date":"31 May 2002","review":"This is a truly funny film that the whole family can watch, and enjoy. Amazing!  Mom cooks enough food for a White House reception, the kids are mostly normal except the youngest, who is channeling Bela Lugosi as Dracula, and Dad can't get a bagel without cream cheese on it. The cops are standard film cops except that Jack Palance is even more overpowering than usual. His best line (you have to be there) is \"Never throw a cat at me again.\" He never yells, although he has plentiful provocation. This is refreshing; we laughed through the whole movie.","user":"Gretta-2","rank":[11,14]},{"title":"Is this comedy about the family or the stakeout?","rating":22,"date":"22 January 2011","review":"\"Cops and Robbersons\" is a pleasant enough comedy with Chase playing a Clark Griswold-type character. I found the movie funny and charming. But the movie doesn't seem to take its story very seriously. For example, Chevy Chase goes next door to \"use the bathroom\". Of course, he's really there to snoop. This, of course, I expected. In a movie about a stakeout, especially in a comedy, I expected a lot more to happen. Chase goes through the guy's wallet (why exactly, I do not know), ruins his mattress (again, I do not know), then merely gets caught. But this guy (Osborn) doesn't seem particularly suspicious. Then chase tries to roll his cigarette, which apparently, is supposed to be funnier than it is. Is this the best the filmmakers could come up with? And I though Jack Palance was wasted in a thankless role as a cop who mostly smokes, and makes small talk. And it's never explained why we don't see much of his partner. As for the ending, it doesn't quite take off, probably because it takes Chase forever to come crashing in. But still, I enjoyed the movie because it is entertaining.<br><br>*** out of ****","user":"raisleygordon","rank":[4,4]}]