[{"title":"Possibly the most powerful & disturbing film ever made","rating":10,"date":"9 December 2004","review":"I challenge any parent who has been questioned over the care of the children or any person who has been unjustly accused of neglect as I have have once been, to sit and watch this disturbing powerhouse of a film. I paused it twice during my original sitting and had to take a moment to deal with what I was being confronted with once again. Rarely . . . yes VERY RARELY does a film or a movie engage me to this point. I have seen several Ken Loach films and I live in admiration of this artist/man, but yet I wasn't prepared for what I sat and watched. I give this 10 out of 10 and am shocked that it hasn't been recognised further by any awards society such as \"The Bafta\" and \"Academy Awards\".<br><br>Chrissy Rock, I take my hat off to you to have the guts to give all that you gave for your performance, the the actor that played \"Jorge\" . . you have delivered a standout performance. Ken Loach, you are my hero.<br><br>Indeed I stand by my title, possibly the most powerful and disturbing film every made. Magnificent. Ambitious. It delivers.","user":"Rainsford5","rank":[18,20]},{"title":"Wow.","rating":9,"date":"14 September 2000","review":"My jaw was on the floor throughout this film. I was amazed at the intensity of Crissy Rock's performance and I was aghast at all of the horrible things that she had to endure. Vladimir Vega's subtle work as Jorge should be given an equal amount of credit. The emotional honesty in this movie is amazing and I had to pause the VCR a couple of times because I was so shaken up. Definitely worth your time, and an excellent introduction to the work of a worthy director.","user":"Cobbler","rank":[24,28]},{"title":"an incredible performance!","rating":27,"date":"27 November 1998","review":"Chrissy Rock gave an unforgettable performance in this little seen film. i highly recommend anyone to go out and rent it. another great but \"little seen\" film is \"Once Were Warriors\". my advice is if you go to the video store to rent a couple movies, and are interested in how movies should be made,search for these 2 titles,and you'll see your trip to the video store was well worth it!","user":"adomono","rank":[6,6]}]