[{"title":"A Modern Cultural Obsession","rating":9,"date":"29 September 2007","review":"The assassination of JFK has been told in every possible way through every available medium. Oliver Stone managed the unimaginable transforming and almost folk tragedy, through a mix of drama and cinema veritè, into a riveting mystery thriller with the paranoiac style of a man who's in touch with paranoia in a quasi permanent basis. Unnerving, frustrating and spectacularly satisfying. Kevin Costner manages to be convincing as the center piece of the conspiracy theory. We believe the whole damn thing because we see it through his logic. Sissy Spacek, as his wife, represents most us and she does it brilliantly. Tommy Lee Jones and Kevin Bacon are a pleasure to watch. Donald Sutherland, Jack Lemmon, Walter Matthau and even John Candy, Sally Kirkland and Vincent D'Onofrio deliver little parts of the puzzle without ever becoming distracting. Gary Oldman is a chilling dead ringer for Lee Harvey Oswald. For film lovers, for history nuts, for pop culture fanatics and for conspiracy theorists, this is a must.","user":"pacific-oconnor","rank":[117,154]},{"title":"Past the controversy","rating":3,"date":"3 July 2004","review":"In the time since I first saw the film \"JFK\", I have found myself inexplicably drawn to the events in Dallas, TX on November 22, 1963. I have researched online and in libraries to learn the truth of these events, and I would say that my outlook on those matters has changed substantially. But underneath that, and the controversy that developed from it, there is one universal and almost indisputable truth regarding the film: JFK is simply an excellent movie. And no difference of opinion can refute this.<br><br>I have seen my fair share of films over the years, I'm not a cinema maniac by any means. But I think I can judge a quality product when I see one and that's simply what this picture presents. It is, as Tom Wicker of the New York Times said at it's release, propaganda; but the same can be said for every film by Michael Moore... of whom I'm NOT a fan... but they are still strong pictures. <br><br>JFK runs the difficult task of presenting fact, fiction, conjecture and opinion, twisting them all to present the increasingly difficult to dispute conclusion that Lee Harvey Oswald did not act alone (and according to director Oliver Stone, did not act) in the assassination of President Kennedy. <br><br>The films accomplishments though, past this controversial thesis, are many: 1.) Kevin Costner turns in one of the greatest performances of his career. While his accent is stronger than Garrison and the physical resemblance not astonishing, Costner three dimensionalizes a character and lives in it throughout the film. <br><br>2.) An impressive and versatile cast is used superbly. The film is loaded with quality stars such as Kevin Bacon, Tommy Lee Jones (in an Oscar nominated role), Gary Oldman, and Joe Pesci (who share an intense and crucial scene); as well as character actors and actresses such as Michael Rooker, Sissy Spacek, and Jay Saunders. Stone even navigates a dramatic turn from the late comedy great John Candy and utilizes Hollywood legends Ed Asner, Jack Lemmon, Walter Matthau and Donald Sutherland superbly.<br><br>3.) With the possible exception of the lone gunman theory, every possibility of truth is explored, at least in dialogue. Because the case has never been fully elaborated on no one can say for certain what the truth is; Stone presents all views while advancing his theory.<br><br>4.) The film is a masterwork of editing. It won the Oscar for film editing in 1991, and deserved it. I once read in Entertainment Weekly that a normal film has roughly 200 cuts in it; there are more than sixty in the opening minutes alone here. Even more impressive when you consider the variety of film used. <br><br>JFK is not absolute fact, it does not truly pretend to be. By Stone's own admission, Laurie Metcalf, Michael Rooker, and Kevin Bacon play composites or dramatized characters, not the real thing. But standing alone as a movie, JFK is untouchably excellent. And if it does force you to question, as Costner's Garrison asks in the closing moments \"of what is our government made?\", then it's all for the better.","user":"Strangef8","rank":[187,258]},{"title":"One of the best and most important films ever made!","rating":9,"date":"9 March 1999","review":"Oliver Stone's epic film which follows the real-life events of New Orleans District Attorney Jim Garrison is a monumental movie event.  It should have been named the Best Picture of 1991 instead of The Silence of the Lambs.<br><br>Everything about this film is perfect and it shows that when an intriguing story comes together with all other elements of filmmaking that are executed brilliantly, the film works on so many levels.<br><br>First off, Stone's direction is as good as it gets.  He has an incredible passion for the subject, knowledge of the art and relationship with the camera.  All of his footage goes together seamlessly and makes the 3 h 08 min running time blow by.  He gets a strong performance out of the entire ensemble cast especially Costner, Jones, Oldman, and Pesci.<br><br>Scalia and Hutsching's editing is a work of art and tells the complicated story with incredible precision.  Richardson's cinematography lights up the screen in both colour and black and white.  Both of these technical aspects of filmmaking are molded into sheer artistry by these three men who have all deserved their Oscars for this film.<br><br>John Williams' score is one of his best (right up there with his Indiana Jones and Star Wars).  The script is intelligent, thought-provoking, mesmorizing and heart-wrenching.  Costner's closing speech to the Jury is finer that Nicholson's in A Few Good Men, McConaughey's in A Time to Kill and Jackson's in Pulp Fiction.  It is Stone and Sklar's best work.<br><br>The subject matter is incredibly controverial and subjective but Stone's delivers it with such emotion and raw power that his alternate myth to the Warren Report seems factual.  The film is an investigation into the human spirit and how the vigour and dedication of one man and his team of associates can rise above the highest powers of the world and encode a message into the minds and hearts of millions.  John F. Kennedy has countless achievements and qualities as a president which makes his life and term one of the most incredible and worthy of deep study.<br><br>Oliver Stone's JFK should go down in film history as one of the most important American films ever produced.  Watch it with an open mind free of prejudice and predisposition and you will find yourself wanting to go to the library and learn more about this global tragedy.","user":"Casa2000","rank":[259,367]}]