[{"title":"A terrific movie about friendship.","rating":10,"date":"17 March 2000","review":"I loved this movie from the first time I saw it, but it wasn't until I sat through it the third time that I figured out why.  It is clever, exciting, and funny and is shot in the middle of the breathtaking scenery of the American Southwest.  However, the thing that makes it special is its illustration of pure friendship.  It may be difficult for some men to cross the gender boundary and connect with Thelma and Louise, yet doing so is critical to appreciating the film.  If you can make the connection then you can get its message -- we all need a friendship like the one Thelma and Louise had.  This movie will strike a deep emotional chord.....if you aren't afraid to let it.  And if you happen to be too emotionally closed off to appreciate what I think the movie says about friendship I think that you will still enjoy the characters, acting, action, and humor.  It is a ten out of ten.","user":"ruth.boaz","rank":[147,203]},{"title":"A Must-See","rating":14,"date":"14 June 2004","review":"\"Thelma and Louise\" made a huge splash when it was released and has since become a part of the pop culture lexicon. In it, a mistreated housewife and harried waitress stumble into an out-of-control - but totally liberating - crime spree. As bold and relevant as ever, it remains a vastly entertaining must-see.<br><br>Callie Khouri's screenplay is a feeling, funny classic and director Ridley Scott lends this road movie epic scope, seeking out the beauty in open spaces.<br><br>Both leads - Geena Davis as Thelma and Susan Sarandon as Louise - give fine performances. Thelma and Louise become fully realized human beings who share a powerful and authentic friendship. Their transformation into two outlaws is also made entirely believable by the actresses.<br><br>And what about the men? Harvey Keitel is charming as the sympathetic lawman, Hal, and Michael Madsen's turn as Louise's boyfriend Jimmy is wonderfully nuanced. Brad Pitt also leaves a strong impression as the winsome blonde thief J.D. It's easy to see why this film made Pitt a star.<br><br>\"Thelma and Louise\" is a film of rare cultural resonance, to be sure. Yet while undoubtedly provocative, this movie is also alot of fun.","user":"sparklecat","rank":[107,151]},{"title":"More than an exercise in male-bashing","rating":8,"date":"8 June 2002","review":"This is an important commercial film aimed at blue collar women who feel victimized by both society and the men in their lives. Directed by Ridley Scott, who directed the science fiction classics, Alien (1979) and Blade Runner (1982), Thelma and Louise is an on-the-lam chick flick (with chase scenes), a kind of femme Butch Cassidy and the Sundance Kid (1969), somewhat akin to Wild at Heart (1990) and Natural Born Killers (1994) but without the gratuitous violence of those films. Ridley Scott walks the razor edge between femme-exploitation and serious social commentary. Incidentally, the script is by Callie Khouri who wrote Something to Talk About (1995) and Divine Secrets of the Ya-Ya Sisterhood (2002) which should give you an idea of how men are depicted here.<br><br>Susan Sarandon is Louise, a thirty-something Arkansas waitress with an attitude and some emotional baggage, and Geena Davis is Thelma, a cloistered ingenue housewife with a yearning to breath free. Both do an outstanding job and carry the film from beginning to end. The characters they play are well-rounded and fully developed and sympathetic, in contrast to the men in the film who are for the most part merely clichés, or in the case of Darryl (Christopher McDonald), Thelma's boorish husband, or the troll-like truck driver, burlesques.<br><br>I have never seen Geena Davis better. Her unique style is melded very well into a naive woman who never had a chance to express herself, but goes hog wild and seems a natural at it when the time comes. Sarandon is also at the top of her game and plays the crusty, worldly wise, vulnerable Louise with tenderness and understanding. Note, by the way, her pinned up in back hair-style, directly lifted from TV's Polly Holliday (\"Kiss my grits!\") who appeared as a waitress in the seventies sitcoms \"Alice\" and \"Flo.\"<br><br>Harvey Keitel plays the almost sympathetic cop, Hal Slocumb, and Brad Pitt appears as J. D., a sweet-talking twenty-something who gives Thelma the script for robbing 7-11s as he steals more than her libido.<br><br>This movie works because it is funny and sad by turns and expresses the yearning we all have to be free of the restraints of society and its institutions (symbolized in the wide-open spaces of the American Southwest) while representing the on again, off again incompatibility of the male and female heart. The male-bashing is done with a touch of humor and the targets are richly deserving of what they get. The ending is perhaps too theatrical and frankly unrealistic, but opinions may differ.<br><br>Best and most telling quick scene is when Thelma phones Darryl to see if he has found out about their escapades. Weasel-like, he is trying to help the cops locate them, but he is so transparent to her that all she has to do is hear his voice. \"He knows,\" she says to Louise and hangs up.<br><br>Best visual is when the black police helicopter appears suddenly, menacingly like a giant fly beneath the horizon of the Grand Canyon. Also excellent were the all those squad cars lined up like armored battalions aimed at the girls on the run.<br><br>I also liked the scenes at the motel with J.D. and Louise's boyfriend. They were beautifully directed and cut, and very well conveyed by Sarandon and Davis, depicting two contrasting stages in male-female relationships.<br><br>See this for Geena Davis because she was brilliant, vividly alive and never looked better.","user":"DeeNine-2","rank":[117,179]}]