[{"title":"Tense, unsettling, original, intelligent, short, cheap.","rating":3,"date":"3 November 1999","review":"This film is not a feature film.  For a start, it is not feature length, also, it is not shot on film.  More importantly, it does not have what feature films have these days: star actors, special effects, exotic locations, explosions.  Instead, seeing B.W.P. is seeing something else that a cinema can be: a place where people can share an intimate experience created by a few people on a tight budget.  I would be glad of its success if only for that reason.<br><br>The first section of the film appears at first to be amateurish and slow. In fact, it is very deft, and very efficient at what it does.  It tells the audience everything it needs to know about the characters and situation, and nothing more.  Also, it gets the audience into the habit of viewing the film's format: alternating between black and white (very grainy and poorly focussed) film, and the washed out colours of shaky pixilated video.  The film makers managed to set up a rationale for why the film is so cheaply made.  Three people hike into the woods for a few days to shoot a documentary, with borrowed equipment, and are in the habit of videoing everything for the hell of it.   They cannot carry tripods, steadicams, dollies, large lighting rigs, or the like, so everything we see is lit either by raw daylight, or by a single light fixed to the camera, which illuminates just what is within a few feet of the lens.  The film creates its own excuse to be cheap.  This is intelligent.<br><br>The acting and script are both excellent.  The well-cast actors are presumably playing pretty-much themselves, and are convincingly naturalistic, and neither too likeable or too dislikeable.  The slow route into hysteria is well documented.  Rather than simply having a character say \"We're lost!\", we see many scenes which show the trio getting more and more hopelessly lost, and more annoyed with each other for this.  By the time they are thoroughly lost, the audience shares the despair.<br><br>My friend and I, after seeing it, both felt a little sick.  I put this down to my having been tense for a hour, he put it down more to motion sickness. The jerky, badly-framed camerawork is hard on the eye and stomach, but I applaud the director for its uncompromising use.  Similarly, no compromise is made with the dialogue.  Some of it is very quiet and must be listened for, some is technical jargon, which is left realisticly unexplained.<br><br>One of the great strengths and weaknesses of the film is the editing.  It is good in that it does much to heighten the tension, with many key moments lasting just a little too long for comfort.  Each time the characters find something nasty, the viewer is made to want the editor to cut soon to the next scene, and the fact that he doesn't adds to the sense of being trapped, as the characters are.  The problem with this, though, is that one is left wondering about the motives of the fictional editor.  In truth, of course, the film is edited to create these effects, and to entertain, but the film's rationale is that these are the rushes of a documentary put together posthumously by someone other than the film's original creator.  Why, then, would an editor piecing together such footage, edit for dramatic effect rather than for clarity?  Why would he keep cutting back and forth from the video footage to the film footage, when neither shows any more information than the other?<br><br>The film is stark.  After one simple caption at the start, all that follows is the \"rushes\".  I wonder if the film might not have been improved with an introductory section which documented how the rushes were found and edited. A programme was made for television which did this.  Perhaps a portion of this might have been added to the film, making it more complete, and more believable (and proper feature length).<br><br>While I applaud the fact that young original film-makers have managed to create a mainstream hit out of a simple idea, well-handled.  I dread the possible avalanche of inferior copies which may come.<br><br>Most horror films these days are created not for the audience, but for the makers.  The departments of special effects, make-up, model-making, animation and so forth all try hard to show potential future employers what they can do.  The result is that nothing is left for the audience to do, since everything can be seen and heard, and the viewer's imagination can be switched off.  Today, it is possible to see pigs fly on the screen, and so film-makers show off and show us a formation of Tamworths, which is something which will look impressive in the trailer.  To show us less is to make our minds fill in the gaps.  This way, we create our own terrors, perfectly fitted to ourselves.  The ghastly face I see in my head, is the ghastly head which I find scary.  The ghastly face I am shown may be one I can cope with quite easily.  If I see a believable character screaming in hysterical fear at something I cannot see, my own brain creates demons for my night's dreams, demons far more mighty than anything CGI graphics or a latex mask could portray.<br><br>This film will stay in your thoughts for some while.","user":"Lloyd-23","rank":[318,449]},{"title":"Generation Xers head into woods; we view excellent results","rating":8,"date":"17 July 2000","review":"I saw this film last night, LONG after all the hype and reviews were made about it. I settled in with the right mood for any film: no expectations. If you expect too much, you may be let down (take note for any Kubrick film). I watched the entire film without interruption and came out with a great feeling. \"The Blair Witch Project\" is one darn good movie.<br><br>Many critics and moviegoers complained about the film for its length, its amateurish photography/editing, and its lack of adequate acting. I feel these things MADE THE MOVIE. First, the film has to be at most ninety minutes long: any more, and it would be too long and boring. Second, the amateur video take gives the audience the feel that they are actually in the woods, listening to the rippling water of the creek, snapping branches under their boots, and hearing things go bump in the night. I greatly admire the use of two video cameras (one black-and-white, the other color) to denote which character is shooting the film. Lastly, the incessant screaming of whiny Heather, the constant complaining of average-joe Mike, and the Dudley-Do-Rightness of Josh make for great acting. Yes, these are regular people and up-and-coming actors from your local community theater, but YOU KNOW THEM. You've met people like them.<br><br>The biggest complaint, however, comes from the film's supposed \"lack\" of scary moments. This film reminds me of the classic horror film \"The Texas Chain Saw Massacre,\" and though not as gory and as shocking as that film, \"The Blair Witch Project\" shows just enough fright in the group's search for a way out of the woods, stalked by people and/or things they may never understand. In the older film, the long interval between opening credits and first gory act of violence is about thirty minutes long; it is even longer here, but the suspense/fright (just as in the older film) begins right from the opening credits: you just don't see it until the film's over. These are three people out to make a documentary in the woods with handheld camcorders--these are REAL PEOPLE. And GREAT ACTORS. Heather whines a lot and screams and reminds you of the girl you hate so much you fall in love with her. Her screams sound real, her cries are genuine, and she is DEEPLY DEEPLY sorry for bringing the others into the woods in order to film her documentary.<br><br>I really dig the beginning. It seems so real to me I may delve into my old home movies for nostalgia. Heather and Josh pick up Mike, then go to the store for supplies. This opening sequence really packs a punch. These are three Generation Xers out for a camping trip. We all know what happens to them, but we're glued to the screen, intent to know what actually happens.<br><br>The interviews give us some detail into the Blair Witch legend, but most of the audience is too busy thinking about the actual trek into the woods that they don't listen. This is wrong. Listening is good. The interviews, which also sound real and not rehearsed in any way, are like movie reviews: the critics tell you what they saw, but mostly they don't want to ruin it for you...unless they hated it.<br><br>And that's what I'll do. I won't ruin it for you. 8/10.","user":"deadkerouac","rank":[264,401]},{"title":"Sorry we couldn't supply the eye candy most of you are so used to.....","rating":10,"date":"1 December 1999","review":"I think I know why Blair Witch has generated as much negative as positive responses.  It FORCES YOU TO BECOME INVOLVED IN THE MOVIE GOING EXPERIENCE!<br><br>Wow.  What a concept.  Instead of sitting there like the passive sponges most of us become when going to the movies we are actually expected be become involved.  Take a leap of faith/belief or whatever and delve into this movie.  Without the overpowering F/X and music score most movies rely on to 'scare' you, if you still have an imagination left what is implied becomes a hundred times scarier than anything offered up by Hollywood in the last 30 years.  The hardest thing in movies is to scare you.  Not make you jump out of your seat with 5000 watts of sound blasting at 400 decibels (ever seen the 1999 version of the Haunting?  Event Horizon? - every potentially tense scene is preceeded by dead silence then the Blast).  Wake up people!  Blair Witch is the horror movies we have been needing for a long time and I'm glad someone finally had the guts to make it.","user":"blackheart","rank":[508,794]}]