[{"title":"It still reduces me to tears. . .","rating":15,"date":"15 June 2003","review":". . .and even heaving sobs.<br><br>When I saw this in 1996 at the theater, I started crying about 15 minutes in and never stopped.  I haven't been able to watch it since then.  I decided to buy the DVD and see if I coudl get through it without so much crying. ..well, almost.<br><br>For me, the emotions start pouring over me when I empathize with all of Nick's loving friends, including his former lover Brandon, who are somewhat supportive of his decision, yet really not ready to let him go quite yet.<br><br>As someone else mentioned, the wink that Nick gives Brandon, signalling his forgiveness of Brandon for his selfishness and lack of understanding, just does me in.  From that moment on, and up until the end, the tears keep running down my face.<br><br>By the way, what a great cast for such a moving film!  Eric Roberts and Gregory Harrison are exceptional, and they get great support from Lee Grant, Bronson Pinchot, Margaret Cho, Erich Segal, the late Roddy McDowell, and the rest.<br><br>I think I'll watch this DVD whenever I'm feelig cynical and weary of the events taking place in this world of bigotry, hatred and war.  At least then I can have a good cry about something that really matters:  love and affection from one's nearest and dearest.","user":"bekayess","rank":[21,23]},{"title":"Touching and powerful drama","rating":10,"date":"4 January 2004","review":"Brandon Theis (Gregory Harrison) and Nick Stark (Eric Roberts) have been lovers for years. Then Nick is diagnosed with HIV. Brandon promises to not leave him---but eventually does. He can't handle the HIV. A year later Nick is told he will die very soon of lesions in the brain. Rather than slowly become a vegetable and wither away, Nick decides to commit suicide. He invites all of his friends to a 2 day party--at the end, he'll take the pills and die. Brandon finds out and attends the party. But does Nick want him there and will Nick be able to forgive him before he goes?<br><br>Strong, powerful movie. I saw it in a theatre in 1996 and cried my eyes out. I saw it 2 years later with a friend and we BOTH cried our eyes out! Saw it again tonight--cried again. This drama is harrowing at times and brings about questions about love, death with dignity, suicide, HIV...etc etc. But it never gets too maudlin and is always fascinating.<br><br>\nRoberts is just superb as Nick. Strong, handsome, refusing to wither away. He also approaches his HIV condition with strength and humor--as he should. Lee Grant is (sadly) wasted as his mother. Harrison is so-so as his boyfriend. Usually he's sort of stone-faced but there were a few moments that the looks on his face made me break down. There's one scene of him and Roberts just looking at each other across the room--you can see the love, fear and hatred in their faces--it's just great. And Harrison really delivers during the last 30 minutes of the movie.<br><br>There's a huge cast in this movie--Margaret Cho (hilarious); Marlee Matlin (wasted); Olivia Newton-John (just great); Bronson Pinchot (overdoing the bitchiness a bit); Bruce Davison; Roddy McDowall. There's the problem--there are too MANY characters! I'm still not sure who McDowell was and Sally Kellerman shows up looking great but--who is she? We're never told. Also, the party scenes are scattershot--the camera seems to linger around catching certain characters and snatches of their conversations. I also have a hard time believing that anyone has this many friends and they all keep quiet about him committing suicide. Still--problems aside this works.<br><br>I think this film hit too close for director/writer Randal Kleiser. Supposedly he went through the same things with his lover. When this movie was released he couldn't promote it. It came (and went) very quickly. That's really a shame. It's a strong, powerful movie that should be seen by everybody. And Roberts gives out one of his best performances. The scene when him and Harrison kiss is heart-breaking.<br><br>Well worth catching--an excellent drama. Just bring plenty of tissues--you'll need them!","user":"preppy-3","rank":[24,29]},{"title":"An emotional roller coaster even for the toughest man!","rating":10,"date":"14 December 2004","review":"This movie has to be one of the saddest films ever made. It's right up there along side \"Steel Magnolias\". I myself cried 30 minutes into the movie. Eric Roberts gives an all out performance as a gay male who decides to end his own life after he realizes he is losing his battle against AIDS. His character decides to have one last big party surrounding himself with family and friends. His ex-lover returns for this one last party to try and make amends. With the constant playing of Dolly Parton's \"I Will Always Love You\" you watch as this man says his last goodbye's and readies himself for his departure. Even though surrounded by friends and family it gives you a strong sense that in the end we still all die alone. Truly a masterpiece and a must see! Just make sure to keep the tissues close by.","user":"socoluva25","rank":[15,18]}]