[{"title":"Ullman Matches Allen","rating":9,"date":"9 March 2006","review":"I doubt if many people share this sentiment, but this is my favorite Woody Allen movie simply because it does what Allen usually sets out to do: makes me laugh. I'm not a big fan of Allen's films but he and Tracey Ullman make a great pair in this 95-minute farce. Ullman has to be one of the most talented ladies to never achieve real movie stardom. She matches Allen laugh-for-laugh in here and, in some respects, even steals the show.<br><br>Other than Allen's penchant for using the Lord's name in vain, this has a real classic-film feel to it, one of those old bickering spouse films but with more modern-day humor. Allen and Ullman trade some very funny insults, and there are many of these quality gags. Ullman is just plain hilarious as the bimbo-like \"Frenchy.\"<br><br>Add a gigolo (Hugh Grant), a couple of inept crooks, a couple of old-time Elaine favorites, Strich and May, and a pretty funny premise and you have some good entertainment and an underrated Allen film.","user":"ccthemovieman-1","rank":[35,48]},{"title":"Closer to Old-School Woody in spirit, but not execution","rating":7,"date":"20 May 2000","review":"\"Small Time Crooks\" is the latest movie from Woody Allen, and it will likely be seen by the same people who go see all of his other movie (myself included) but will likely not branch out far from there.  It's funny, and Allen fans will enjoy it, but it's certainly not an outstanding comedy.<br><br>Allen plays Ray, a schlub living in New York who concocts a crazy scene to rob a bank.  It involves a cookie store, a tunnel, and lots of drilling.  It also stirs up one of the two out-and-out hilarious sequences in the movie. <br><br>\nAfter the digging sequence, the film takes an unexpected turn (which I will let you discover for yourself), and the section immediately following the \"One Year Later\" card is the best of the film.  Sadly, the brilliant media satire and perfect lines are not repeated again in the film. for the remaining hour.<br><br>A lot of people have commented how this is Woody getting back to his roots. Certainly the film starts off like a lot of his early works, and the premise certainly shares a good deal with Take the Money and Run, but I would not put Small Time Crooks on the same level as that film, one of my favorite comedies.  While it's certainly a lighter film than his later works, Allen just doesn't have the same bizarre gags and total disregard for reality that the early works had.  That insane-genius-laughing-at-us-all energy is missing.<br><br>Still, the film looks great and the cast is especially good.  I'm sorry we didn't get to see more of Michael Rappaport and John Lovitz, who sadly only appear in the first portion of the film.  <br><br>Again, the movie isn't bad, it's just no Take the Money and Run. Recommended for Woody fans, but I wouldn't say expect the old master here, rather expect an older master doing his best to relive those early greats.","user":"Mr. Pulse","rank":[19,25]},{"title":"pleasant but time-marking comedy","rating":6,"date":"6 January 2001","review":"Though essentially a time-marking throwaway by writer/director Woody Allen, `Small Time Crooks' provides so many gems of performance that one can overlook the film's derivative plotting and overall lack of comic drive.  In this film, Allen more or less abandons his customary obsession with big city neuroses and middle-aged angst in favor of a more straightforward, plot-driven comedy, paying homage in its patchwork and eclectic story to any number of earlier well-known theatrical and cinematic works. <br><br>\nFor example, the first half hour of the movie plays like a stateside version of the 1950's Italian comedy `Big Deal on Madonna Street' as a team of bumbling, far-from-intelligent small time crooks, led by ex-con Ray Winkler (Allen), sets up a cookie store as a `front' so they can drill a tunnel into a bank a mere two or three shops down the road.  Then the plot of the film suddenly shifts gears when that plan falls apart and the gang hits pay dirt with the surprising success of the cookies that Ray's uncultured but well meaning wife, the former topless dancer Frenchy (Tracey Ullman), is assiduously baking and selling.  The highlight of the film comes in the form of a brilliantly satiric pseudo-60 Minutes report in which Steve Kroft himself chronicles the meteoric rise that this ragtag collection of accidental entrepreneurs takes from obscure small business owners to multi-million dollar corporate giants  a report that pokes affectionate fun at the clichéd rags-to-riches theme so essential to our concept of the beloved American Dream.   <br><br>With this plot switch, we leave Madonna Street and head into `Unsinkable Molly Brown/Pygmalion/Educating Rita' territory as the vulgar, uncouth Frenchy realizes that, even with all her suddenly acquired wealth, she cannot possibly gain true acceptance from the elite cultural snobs she so desperately wants to impress without a little assistance from her own personal Henry Higgins, who arrives in the form of an art dealer named David played by the suave Hugh Grant.   Thus, as Frenchy branches out and begins to open herself up to new cultural experiences, the couple begins to drift apart as Ray comes to crave the return to the simpler life of spaghetti and meatball dinners he knows they have left far behind.<br><br>Had Allen been able to sustain the cleverness and bite that inform that `60 Minutes' segment throughout the length of the entire film, `Small Time Crooks' might have emerged as more than just the mere piece of entertaining puffery it ultimately is.  Indeed, we find ourselves laughing only occasionally and often at jokes or sight gags that would barely register a chuckle in one of Allen's more sophisticated, more edgy and more character-driven works.  Special note must, however, be made of some of the actors, prime among them Ullman and the always brilliant Elaine May who, as Frenchy's adenoidal, utterly befuddled and endearingly obtuse cousin, returns to her `A New Leaf' roots and provides some of the sweetest comic moments in the film.  Unfortunately, Michael Rapaport, Tony Darrow and Jon Lovitz, as members of Ray's gang, though they all three give outstanding performances, aren't given enough screen time to really let their talents for comic characterization take flight.  Hugh Grant is essentially Hugh Grant  which is to say that he fulfills the requirements of his part without having to stretch his thespian muscles too much.<br><br>The success or failure of a comedy is ultimately determined by how often it is able to elicit laughs from the person watching it.  Given that criterion, `Small Time Crooks' rates no better than a mild recommendation (though there is one very funny scene involving safecracking near the end of the film). Yet, if for no other reason than to relish a number of its dazzling performances, `Small Time Crooks' certainly earns at least a casual once-over from any Allen devotee.  Guess we have no choice but to mark time right along with him!","user":"Buddy-51","rank":[21,30]}]