[{"title":"Sometimes the best movies...","rating":14,"date":"14 March 2004","review":"...are the small ones.<br><br>Mike Leigh worked with his relatively small cast (five main cast members and about four supporting cast members), improvising characters, devising scenarios and plots, and came up with this; one of his earliest masterpieces.<br><br>The plot is simple enough. A couple of days in the life of a working class London family. There isn't really a plot as such. A couple of fairly deep issues are dealt with, such as eating disorders and depression, but other than a few moments, all we are doing is watching a family live their life: a strong hard-working mother (Alison Steadman); a weaker easily-led by his mates father (Jim Broadbent); and their twin daughters: Natalie (Claire Skinner) - resourceful and kind-hearted but with a strange tendency to wear men's shirts and down pints - and Nicola (Jane Horrocks) - screwed up, rude, irrational and painfully insecure in both her looks and her intelligence.<br><br>The performances brought out by this form of filmmaking are superb - as they are in all of Leigh's movies (Secrets &amp; Lies, Career Girls and All Or Nothing are all worthy of viewing, but especially Secrets &amp; Lies). However, Alison Steadman is the standout (perhaps for no other reason than she has the most screen time), the driving force that brings all the family together. The scene in which she finally cracks and loses that nervous laugh to tell Nicola a few home truths and break down the barriers that Nicola has put up between herself and the rest of the world, is so beautifully written and terrifically performed that it is a shame that Steadman in particular was not Oscar-nominated.<br><br>Only one or two criticisms struck me. One was a slight lack of development of the other daughter. What exactly DOES make her tick? Am I merely stereotyping by assuming she is supposed to be a lesbian? Or is she just happy being so masculine in her dress-sense and mannerisms - (she isn't even offended by a client who calls her a 'good lad')? We never find out, because the film focuses a little more on her sister. It certainly appears that her mother suspects her daughter of being gay, but for some reason the subject is never brought up.<br><br>Similarly, a couple of loose ends are never tied up. The caravan and the restaurant in particular. But I guess we have the prerogative to make our own endings up haven't we, so that's a good thing in many ways.<br><br>I think at the end of the day, people will either like all of Mike Leigh's films or none of them. And I'm in the former group. His work is beautiful and always touching.","user":"cwej1","rank":[45,49]},{"title":"heartbreakingly real...","rating":10,"date":"19 November 2006","review":"this is another one of those movies that i loved so much the first time i saw it, i cried in the theater, went home, came back the next day with a friend in tow. <br><br>unlike the other movies i did this with (raising Arizona, after hours), the person i saw it with actually got the movie the first time, and loved it as much as i did. yes, naked and Topsy turvy got all the praise, but this is my favorite Leigh movie. it is just so...sweet.<br><br>i would talk about this movie years after seeing it saying that it was so heartbreakingly real, if you cut the screen, it would bleed. the was something so compelling about everyone in this movie. someone said they were pathetic, but i couldn't say i saw it like that. they were just flawed people doing the best they could. to me that is so beautiful. for years i would wish that America had a real working class director like mike Leigh. someone who showed people struggling. we need it so very badly, as the aftermath of Katrina can attest to. we forget our poor over here.<br><br>the funniest thing was i wold watch this movie when i got depressed, and it made me feel less alone. it cheered me up.","user":"itspoop","rank":[23,26]},{"title":"I know these people","rating":8,"date":"10 May 2003","review":"Another reviewer has commented that this could be a fly-on-the-wall documentary rather than fiction. That hits the nail right on the head. I live some 5 miles from Enfield (where Life is Sweet was filmed) and this is completely true to life. No car chases, no martial artists, no expensive explosions, just life going on and (in the main) being fairly sweet. Everybody knows a Patsy who has a \"little deal\", everybody knows families like this one, everybody knows an Aubrey who never *quite* makes it. Mike Leigh knows what he's talking about, and it's enough to make a highly enjoyable movie that's worth seeing many times. I don't fancy Aubrey's \"Saveloy on a bed of Lychees\", though!","user":"tony-walton","rank":[24,28]}]