[{"title":"Things to learn from batman and robin","rating":3,"date":"29 July 2008","review":"1. As a director it is VERY important to get a close up of Batmans ass going into the bat suit. This is to help the audience know that bat suit protects all vital areas.<br><br>2. Superman does not want a partner because partners tend to want cars that chicks dig.<br><br>3. Mr. Freeze, despite being a professor, has very a very limited vocabulary, which includes ice puns or sayings.<br><br>4. Professional henchmen, mob etc. will gladly wear hockey mask and tights to match their bosses criteria for wardrobe.<br><br>5. Heavy metal doors are the best for sky boarding, skydiving etc. and are known for their crisp clean accuracy and precision.<br><br>6. Mr. Freeze, despite being unable to survive without sub cold temperatures, frequently smokes cigars.<br><br>7. As a villain it is IMPORTANT to wear fuzzy slippers in front of your men and force them to sing songs like frosty the snowman etc. This helps ensure discipline and fear.<br><br>8. Diamonds are typically used today as a source of energy for such things as power suits, weapons etc.<br><br>9. Batman and robin, despite being busy with thugs mob bosses etc., have no problem making a appearance at foundations, benefits etc.<br><br>10. Batman now has his own bank complete with credit card.<br><br>11. Both batman and robin suits come standardized with hockey skates<br><br>12. In terms of momentum, if you are riding down a statute, building etc. going about 70 mph, you will be are able to stop dead in your tracts, regardless of such scientifically proved concepts as speed, velocity, gravity. <br><br>13. Batman and robin typically fight over love or other emotional problems while fighting villains, thugs etc. This helps the villain understand that batman and robin have feelings like everyone else.<br><br>14. Gangs today are all themed based. For example, one gang will all wear fluorescent colored clothes. This is done for fear and intimidation while showing the victim that themes and paint can be useful tools in your opponents mind. <br><br>15. Shopping carts are typically found in prison. <br><br>16. Officers, Despite being hit with a vapor that causes your lungs to freeze, are highly resistant and are known to survive.<br><br>17. If you see a person get hit with a freeze gun DO NOT run, instead look at the person with the gun and either scream, jump at them, or charge towards them. Although ineffective, this causes the user to have momentary fear.<br><br>18. As a girl/guy, despite having no formal training in combat, as long as you put on any variation of a bat suit, your skills will improve by a recorded 100%.<br><br>19. Vines can be used as a whip and administer the same amount of damage <br><br>20. Despite having years of detective skills and deductive reasoning, batman has trouble identifying people who change their hair color , stop wearing glasses (Poison ivy) and people who wear mask large enough to cover the eye area (see Batgirl). <br><br>21. Concentrated sunlight from a powerful satellite, cannot be used to melt thing layers of ice on a mirror. Hand held lasers are the best for such problems.<br><br>22. Through years of fighting together, batman, robin and bat girl have learned it is best to use language as a junior higher such as \"watch and learn little boy\" \"the heat is on\" \"chicks dig cars\" <br><br>23. Mr. Freeze, despite wanting to destroy the world, carries antidotes in his suit. Typically, most antidotes also come in a cool blue color.<br><br>24. Most prisons still allow villains to wear battle suits despite being in prison. This is to ensure the prisoner is comfortable in his new surroundings.","user":"axopnk","rank":[90,109]},{"title":"an especially bad movie","rating":1,"date":"7 May 2001","review":"I've rated several hundred movies on IMDB, and overall, I go easy on them. Most of the so-so ones get a 5 or 6.  A movie has to be pretty bad to get a 4 or 3 from me.  And movies with a 2 are simply, awful, awful movies.<br><br>I have saved the rating of 1 exclusively for Batman and Robin, for I'm pretty sure no movie could possibly suck more.<br><br>Normally, when I walk into a theatre with low expectations for some movie, this gives the movie an advantage since I've basically lowered the bar for it.  I held low expectations for Jurassic Park, but ended up being surprisingly entertained.<br><br>Batman and Robin failed completely to meet even the rock-bottom expectations I held for it when I saw it.<br><br>The script is a complete wreck.  The jokes are an insult to your intelligence.  The acting isn't especially bad, but then again, very little is required of the actors.  The action sequences are confusing and incoherent.<br><br>If you're a Batman fan, then you will hate what Joel Shoemaker did in this film.  His bastardization of Bane pretty much kills any possibility of a Knightfall-based movie.  If you're not a big Batman fan, you'll just hate this movie just because it's so freakin' stupid.<br><br>Any pros?  Well, I've read some reviews that say the sets are beautifully constructed.  Personally, I thought the sets were ok, but hardly anything special.  Nothing that couldn't by done with lots of construction paper and elmer's glue.<br><br>So, no, there aren't really any pros.","user":"Gambitt","rank":[397,544]},{"title":"Quite Possibly the Worst Movie Ever","rating":1,"date":"24 February 2004","review":"Don't get me wrong, the old Adam West Batman TV show was certainly funny, and given the times, a more accurate representation of what Batman was trying to be wouldn't have succeeded nearly as well. But the show still betrayed all the emotion and grimness of Batman's themes.<br><br>In Batman &amp; Robin, Schumacher seems to be getting back to those roots. He treats the entire Batman franchise like a joke. Even if it was funny, this would be betraying the name of Batman. But here, seeing as it's NOT funny, it only succeeds in becoming the worst of the Batman movies, and, arguably, the worst films ever created. And I'm taking into account Plan 9 From Outer Space, Gigli, and You Got Served.<br><br>George Clooney just plays George Clooney. Which is the road he usually takes, but this suave, dashing, and charming Batman seems more like Mystery Men's Captain Amazing than the crimefighter of legend.<br><br>There's Chris O'Donnell, the angst-ridden Robin trying to break out of Batman's shadow. The only thing he ever really does is act like a child.<br><br>Alicia Silverstone. Wow. I seriously wonder what makes someone say, \"Hmm, who should we get to play Batgirl . . . I know! Alicia Silverstone!\" No offense to Alicia, but she's out in right field on this one. Her tough-girl performance is sprinkled with reminders of her Clueless days. But all that aside, she actually does very little.<br><br>Now, onto the villains. Uma Thurman, who we know CAN act, is hamming it up to ridiculous proportions. First, when she's playing the nerdy Dr. Pamela, she exaggerates that to a level I thought impossible. And then she inexplicably turns into an extremely sexualized villainess whose plan, by the way, would kill all the plants she advocated protecting.<br><br>Arnold seems like the worst possible choice for Mr. Freeze. I mean, of all the Batman villains I could see him playing - Bane, for christ's sake - Mr. Freeze is not on that list. He possesses none of the emotionless, calculated, and cold (no pun intended) sociopathy which makes Mr. Freeze such a good character.<br><br>And then, all that aside, they're handed ridiculous catch phrases and cliches they're expected to say with any level of sincerity? At one point Mr. Freeze says \"chill out.\" Of all the ways it sounds, menacing is not among them.<br><br>Seriously, I'd have more respect for Schumacher if I discovered that he hated Batman, and had intentionally ruined it with this garbage. Then, this might actually be just his own personal joke. Instead, it borders on a travesty of good cinema. I only wish that 0 stars was a selectable option at the imdb, for this film ALONE.","user":"Nephalim","rank":[499,695]}]