[{"title":"greatly misunderstood story, completely underrated classic","rating":22,"date":"22 November 2004","review":"Having watched this film more times than I can remember and reading the comments left so far I feel that a major message of this film has gone completely overlooked. Even as a complete golf addict, I can look beyond the obvious inspirational story and see than the focus is on Junah's battle with faith, and why does nobody mention that Bagger Vance is a guardian angel? I'm not a religious person so please don't get the wrong idea but is it not obvious at the end when old Hardy Greaves dies and Bagger appears on the horizon? \"I'm right here with ya, I've been here all along...\" And please Junah's trauma was caused by WW1 NOT WW2 - it is 1930 (WW2 did not start until 1939!) OK,the direction by Redford is fantastic with the portrayal of the characters done (and acted) extremely well. Will Smith and Matt Damon play the roles brilliantly, especially Smith. Perhaps Damon seems a little young to be a veteran at times though, but all the same-flawless. Theron, physically, looks perfect for the role but, like Damon, not a woman assumedley in her mid-thirties. I only wish more money could have been spent on this film and it would have been made into the epic it deserves to be. Far more than a simple, soft inspirational story. One must look beyond to see the real message, oh and if your not a golfer, you might not completely 'get it'.<br><br>Film 8.5/10 Story 10/10","user":"asexpected","rank":[107,131]},{"title":"Will Smith and Matt Damon playing golf for two hours, much better than it sounds","rating":7,"date":"22 October 2007","review":"The thing you have to bear in mind when watching The Legend of Bagger Vance is that sports movies, by their very definition, tend to match the atmosphere of the sport they depict. Football or Ice hockey movies for instance tend to be loud, bombastic and flashy, just like the games themselves. Basketball movies meanwhile often rely on the street/hip hop connection and are just as loud, but with a slightly more gritty edge to them, provided you completely forget about the atrocious Space Jam. Bagger Vance on the other hand revolves entirely around golf and consequently, is a lot quieter, slower paced and gentle than its brash genre cousins, but it nevertheless possesses a charm and subtlety that is quite endearing.<br><br>Told completely in flashback, the film's story involves Matt Damon's depressed World War One veteran Rannulph Junnuh taking part in a highly publicised golf tournament against two established (real life) professionals - Walter Hagen and Bobby Jones. At first things don't look good, Junnuh hasn't played the game since getting back from the trenches and is a slovenly drunken washout and despite having the support of the townsfolk, nobody really expects him to win. And then he gets a new caddy in the shape of Bagger Vance (Will Smith).<br><br>At this point I imagine alarm bells are ringing in your head. Will Smith must mean wise-cracking, one-liners and the word 'damn' being stretched out so that it consists of two syllables right? Well you'll be relieved to know that Bagger is a pleasant change of direction for the normal Smith stereotype. Relaxing on his heels and working his acting muscles instead of his action hero ones, Smith is the undeniable soul of the movie. His eminently likable charm is still there, but he relies more on home spun wisdom and gentle prodding to help Damon back into his game, rather than calling him a honkey and effecting a cocky swagger. Playing off against him, Matt Damon is suitably vulnerable and insecure but is overshadowed a bit and with the exception of Junnuh's two rivals, the rest of the cast might as well be superfluous. Thankfully, Junnuh's redemption and Vance's easy going friendship is enough to carry the film and the story, while corny, is just as charming as the title character.<br><br>Elsewhere, director Robert Redford once again shows off his knack for beautiful cinematography. As most of the film takes place on golf courses you're never too far away from some gorgeous scenery and the contrast between the vibrant green vegetation and stunning blue sky makes Bagger Vance a feast for the eyes. Given the film's somewhat slow pace, it also makes this an ideal choice for a wet Sunday afternoon where you'd like to go for a walk and appreciate the countryside but are unable to thanks to the rain.<br><br>That said, Bagger Vance still has its faults. The writing is a bit hackneyed and anyone who doesn't like cheese would do well to stay away. Junnuh's love interest sub-plot with golf promoter Adele Invergordon (Charlize Theron) meanwhile feels tacked on and unnecessary, as though somewhere along the production line someone decided that if Junnuh was to fully come to terms with himself he'd have to get it on with a sweet country belle. The positives outweigh the negatives though and if you're in the mood for a relaxing, slow paced movie with a lot of subtleties that not everyone will appreciate, you can't really go wrong with Bagger Vance. This is a film to watch with your feet up, the house clean and a big mug of hot chocolate in your hand. And refreshingly enough for a sports movie, it doesn't feature a scene where a big crowd begins cheering wildly while over-the-top power ballads play in the background, that alone should be enough to raise an eyebrow or two.","user":"ExpendableMan","rank":[41,52]},{"title":"This movie is about Redemption","rating":19,"date":"19 November 2001","review":"It has been a long time since I have enjoyed a movie as much as I did this one. We all watch movies for a lot of reasons besides the obvious reason of \"entertainment.\" While THE LEGEND OF BAGGER VANCE does it in a most charming and entertaining way it is all about Redemption. Each of us faces adversity in our daily life and how we face it marks the quality of the life that we live. Junuh has faced personal demons for more than ten years since he fought in WW I. The \"Loss of his swing\" is more than an athletic loss that he refers to. He has lost his faith in himself and his ability to face life after his return from the war.<br><br>The role of Bagger Vance, ably played by Will Smith, was not as God like as the character described by Steven Pressfield in his book from which this film was adapted. In the movie Vance had the ability to help people think beyond the obvious and to reach back for something special. In Junuh he helps reinstill a personal belief and an appreciation of life. In the Pressfield book, Vance WAS a God.<br><br>All of the roles were well played and the young boy playing Lemmon in his youth stole the show. It was also good to see Jack Lemmon in his final movie role. I thought it was an interesting coincidence that Lemmon's final role was in a mystical movie just as Burt Lancaster's was in THE FIELD OF DREAMS. The score was also especially moving and the music fit the movie to a \"T.\" This is a different kind of movie but still qualifies as a \"feel good\" movie. We don't always have an opportunity to go back and take a second stab at life and that is the beauty of this movie.<br><br>It is a wonderful thing to be able to go back and make amends for mistakes we have made in our lives and to come out on the other side as a better person. That is what Junuh was able to achieve and that made me feel very good when the credits rolled. For those of you who thought this was a golfing movie that is not the case. It is a movie about life and the chance to make a fresh start which is always important for those who struggle to overcome adversity.","user":"rittmeister","rank":[27,33]}]