[{"title":"I never knew light could be so disturbing.","rating":9,"date":"31 January 2003","review":"Usually, when a director wants to set a dark mood, he or she relies on shadows and gloom in the camera frame.  Here the exact opposite has been achieved through the perpetual midnight sun which throws the descent of Jonas Engstrom into madness all too clearly.  At first the effect is subtle, but as the picture continues and there is never any nightfall one begins to feel the same bone-deep weariness and lethargy experienced by the protagonist.  I watched it for the first time late at night and it completely threw me off my sleep cycle for the night.  Most powerful.<br><br>I speak neither Swedish nor Norwegian, but I didn't find the subtitles a hindrance at all--indeed, I much prefer subtitles to dubbing every time. I found that I had to work harder to notice everything that was happening on screen, which was a welcome change from the constant \"eye candy\" that seems to be the norm coming out of the movie business these days.  All of the performances were understated yet brilliant, especially, of course, that of Stellan Skarsgard.  I was particularly intrigued by the opening title sequence, showing the murder through the eyes of the murderer in a disjointed and confused sped-up manner, and this point of view is a foreshadowing of how both Engstrom and the viewer will feel by the end of the picture.<br><br>I have not seen the remake yet, and I'm not sure that I want to do so. The Hollywood movie business never seems to know when to leave well enough alone.  I'll be able to make a better recommendation when or if I get around to the remake.","user":"keenan-1","rank":[67,69]},{"title":"Fascinating thriller with a brilliant performance from the woefully underrated Stellan Skarsgard.","rating":20,"date":"20 April 2003","review":"I was REALLY impressed by 'Insomnia', the directorial debut from Norwegian Erik Skjoldbjaerg. If this movie is any indication of his talents he is one writer/director to watch! I have yet to see Christopher Nolan's Hollywood remake of this movie but I would be extremely surprised if it manages to equal it, let alone top it. (And I absolutely loved 'Memento') At first you think you're going to see something you've seen a hundred times, a mismatched \"buddy\" cop movie or your standard serial killer mystery, but the movie quickly enters unfamiliar territory and manages to subvert expectations. Apart from Stellan Skarsgard ('Breaking The Waves', 'Ronin') the cast was unknown to me, but they are all first rate, and I couldn't say there was a bad piece of acting throughout. But Skarsgard, a woefully underrated actor, steals the whole show with an utterly brilliant and compelling performance that shows a depth rarely seen by Hollywood actors, especially in thrillers. 'Insomnia' is a fantastic movie that I cannot fault. The less you know about it the better. Whatever you do, SEE this movie! Highly recommended, especially for those sick and tired at how most thrillers made these days are so predictable and formulaic. It doesn't have to be so, and 'Insomnia' proves it!","user":"Infofreak","rank":[38,41]},{"title":"A thriller with a twist","rating":7,"date":"4 October 2004","review":"Erik Skjoldbjaerg's 1997 film 'Insomnia' starring Stellan Skarsgard is a fine example of the rich films being offered by the foreign film market. Skarsgard plays Jonas Engstrom, a disgraced detective who, with his partner, travels to Norway to help a small town solve the murder of a 17-year-old girl. Due to the atmospheric conditions (there is 24 hour sunshine) and recent events, Engstrom is suffering from a severe bout of insomnia, which is causing problems with his work and psyche. <br><br>Not having seen Christopher Nolan's remake, I didn't know what to expect from the story, so I was pleasantly surprised by the unconventional progression of the storyline and the various twists within the script. I have only seen Skarsgard in a couple of films, but he is always fantastic, as he is in this film as well. There are few actors who can keep a straight face, yet still manage to convey complex emotion, and Skarsgard is one of them. He walked through his scenes with a somberness that is reminiscent of most M. Knight Shymalan heroes; powerful, yet weary. Skjoldbjaergs's direction is absolutely beautiful. The colors are quite sharp, and most scenes are expertly framed  most would make gorgeous still frames.<br><br>I plan to see the remake of 'Insomnia' eventually, but whether you have seen it or not, I would recommend catching the film that inspired it. 7/10.<br><br>--Shelly","user":"FilmOtaku","rank":[32,35]}]