[{"title":"Underrated","rating":8,"date":"17 October 2005","review":"This movie doesn't get enough credit. I found it in a DVD bargain bin after never even hearing about it on cinema, which is a great pity. Jean Reno is in a different role for a change, and he excels - his comic timing is perfect, and together with Applegate and the dumb slave, you are left wishing you could see more of them. You also develop a real hate for Applegate's boyfriend. I laughed solidly the entire way through at the way the characters battled to fit in with modern living standards. Everything from the concept to the jokes, even the graphics, is done really well, and I would highly recommend this to fans of sci-fi comedies or even romantics. 8/10","user":"the_extremist","rank":[55,63]},{"title":"A Toast to the French!","rating":7,"date":"12 November 2007","review":"Many of the comments here are the usual gripes about remakes. Well, I've never seen \"Les Visiteurs\" so I'm just looking at this film on its own, and I must say that I was greatly entertained.<br><br>Of course, it's a lightweight plot, but Reno and Clavier sink their teeth into the time-travel jokes and manage to be endearing as well as thoroughly crazy. (Especially Clavier, whose scenes among the rich folks reminded me a lot of the Three Stooges' many dinners with the snobs.) Christina Applegate is sincere and appealing, her boyfriend and his bimbo are appalling, and the Chicago scenery is GREAT! (I have to admit my prejudice in that regard, having lived there for many years.) Considering that the remake was done by the men who made the original film, what's the problem? Think of what it would have been like if it starred Adam Sandler and David Spade, for instance. Zut alors!","user":"LCShackley","rank":[15,16]},{"title":"Absolute fun","rating":9,"date":"17 November 2002","review":"One of the funniest of the offbeat, little advertised movies I enjoy the most. Underrated and under appreciated by American audiences, slowly making its way to cult status, this tale of a French nobleman and time travel, at the hands of a slightly daffy sorcerer, played by Malcolm McDowell takes place mostly in Chicago. A twist on the \"I am my own Grandfather\" theme brings the nobleman face to face with distant Granddaughter, who he saves from a decision she would have lived to regret. This is a remake of the French film, \"Les Visiteurs\". Jean Reno shows his talent for comedy and wit. Thankfully he and Christian Clavier teamed up for the remake. Clavier was allowed to develop a little in the American version. The rest of the cast are enjoyable, and bring together a tight, clean story. Worth the video rental. Good clean fun.","user":"lrallen1","rank":[20,23]}]