[{"title":"The most famous adventurous true story of Africa..","rating":8,"date":"20 March 2007","review":"...Well according to Hollywood anyway, since \"The Ghost and the Darkness\" actually takes lots of liberties with its story, about the two man-eating lions of Tsavo. Quite odd since it presses in the beginning that everything you're about to see in this movie, no matter how unbelievable it seems, has truly occurred. Oh well, just a good and clever marketing trick, lets leave it to that. No way they can pull off a trick like this now days in the days of Internet, were with only a few clicks you can look up an historical event. Of course the biggest difference between the truth and fiction is the Remington (Michael Douglas) character, who never existed in real life and also the looks of the lions, who in real life were not maned. But oh well, are these movie changes bad or not believable? No, it strengthens the story and makes it all even more interesting to watch.<br><br>I've always loved watching \"The Ghost and the Darkness\". It's a great adventurous movie with action in it and some good characters, all set in a beautiful environment. <br><br>The story is perfectly adventurous and action filled. It's all the more amazing knowing that the story has actually occurred in real life, over an hundred years ago already. The movie and its story is kept simple and allows its images and characters to tell the story.<br><br>What I like about the movie is that it fully treats the 'Ghost' and the 'Darkness' (the nicknames of the two man-eating lions) as movie characters. It shows them as smart thinking creatures and not simply just as 'monsters', even though they kill for pleasure (at least in the movie they do). <br><br>The movie is definitely helped by its environment and atmosphere. The beautiful African land serves as a perfect backdrop for the movie and also works quite claustrophobic, since the movie is for most part set at just this one location (the railroad and bridge building-site). Also the great Jerry Goldsmith musical score suits the environment and perfectly adds to the atmosphere of the entire movie, as does the cinematography from Vilmos Zsigmond. <br><br>Michael Douglas plays a good role and actually shows with this movie how versatile he is as an actor, though his role is definitely smaller than he is credited for in the movie. As also the producer of this movie he obviously claimed to become the top-billing actor of the movie as well. In fact the main part of the movie is being played by Val Kilmer, who plays his character in a way like we're used of him; a humble way and he doesn't try too hard to impress in his role, which also leaves room for the other actors to shine and of course allows the story to be told best. Surprising to see that the movie also had actors in it, that would later turn into big well known names such as Bernard Hill and Tom Wilkinson, in some good roles. Also Om Puri gives a nice performance.<br><br>A perfectly fun and simple adventurous action movie. This is high quality entertainment.<br><br>8/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[46,53]},{"title":"\"These Lions . . . Don't Act Like Lions.\"","rating":10,"date":"8 April 2006","review":"It is 1898 and charming, cretinous Captain of Industry Beaumont has hired Col. John Patterson,eminent engineer/bridge builder to complete a bridge spanning the river by Tsavo, Africa. <br><br>Arriving in the continent he has dreamed of forever, Patterson meets his project. There are problems with it: Competing French and German rivals, Ethnic hatred among the crews and, on Patterson's first day there, a worker is attacked by a lion. He goes to \"sort it out\" by shooting the beast with one shot; gaining the admiration of his crews, lifting spirits, adding motivation to complete the bridge, and unleashing a nightmare<br><br>Only weeks after the shooting the camp is suddenly besieged by a pair of giant man-eating lions. Their first \"kill\" is Mahina (Henry Cele), considered the strongest man in the camp. This serves to unnerve every man on the project, including Indian rabble-rouser Abdullah, who doesn't like Patterson from the start. Nerves jangle and fray as the lions repeatedly and relentlessly attack and attack and attack! They strike under the cover of night AND during the heat of day; They kill not for hunger, not for sport, but simply because they like it. Men are dragged from their beds and mauled to death in the tall grasses; the hospital becomes a blood-bathe; Laborers aren't safe as the beasts leap out and snatch them from their work. Everything is falling apart and Patterson is at his wit's end as Beaumont arrives to make matters worse. And still the lions attack and attack and attack.<br><br>Enter Big Game Hunter Charles Remington who is as determined to destroy the lions as the lions seem determined to eat every man in camp.<br><br>This is an under-appreciated, well made, well scripted nail biting adventure. It boasts solid artists on both sides of the lens: William Goldman penned the script, Gail Anne Hurd and H. Kitman Ho are two of the producers who know how to spend the budget wisely, the great Vilmos Zigmond is responsible for the mesmerizing African cinematography. Stephen Hopkins directs with great vision and skill and the actors are uniformly solid and believable in their roles. Val Kilmer plays Patterson with an understated, simple and elegant performance; Tom Wilkerson is the charming snake of a boss Beaumont, Brian McCardie gains the viewers sympathy as a youthful, innocent, and doomed Angus Starling, John Jani is the stalwart Project Manager Samuel, Bernard Hill the irritable/irritating Dr. Hawthorne, Om Puri is the creepy, sarcastic Abdullah (\"You are white. You can do anything.\") and Michael Douglas, also an Executive Producer  he got the money  plays hunter Charles Remington, removing the sweet edges of his Romancing the Stone role to create our renown hunter.<br><br>Hopkins not only knows how to build tension, suspense, and terror, but when to let us relax and how to fill that time. The quiet moments are never dull. They let us empathize with these men, their characters get to develop and we bond with them and their nightmare. Zigmond (Close Encounter of the Third Kind) uses deep oranges and blacks for the African locale, except during a daylight lion hunt and cave exploration when he switches to bright sunlight, vibrant greens and sharp browns as if to show us that even a travelogue holds a nightmare. It is near Hitchcockian.<br><br>Rolling underneath the film like summer thunder (or the breathy growl and snarling of our killer lions) is Jerry Goldsmith's pounding, tribal driven score, which accents the mood and gives further dimension to the narrative. Listen closely, you can hear him using tonal motifs he developed for Star Trek: The Motion Picture.<br><br>As the hysteria builds and the men frenzy, many explanations are offered for the appearance of these animals: Are they the spirits of medicine men come to exact revenge; Or demons sent by the devil to keep Africa unsoiled; Or have they come to claim John Patterson? Is it to helplessly watch as they strip away the layers of security around him until he is exposed and defenseless against their teeth and claws? It is no coincidence that Kilmer is photographed at times slack- faced and full on and LOOKS like a lion himself.<br><br>Once this film starts, I can guarantee you that you won't be able to take a snack break, bathroom break, or even think about dozing off. It is that good. And remember this: You can see the preserved bodies of these two giant man-eaters at the Field Museum in Chicago, Illinois because this incredible story is TRUE.","user":"stevenlshoup","rank":[71,86]},{"title":"Something You Can Sink Your Teeth Into","rating":10,"date":"17 February 2006","review":"I always found this to be an outstanding based-on a true story adventure film which holds your interest throughout. It features some great suspense and the story is fascinating. It's always been ranked among my top 50 movies. A good surround system doesn't hurt here, either.<br><br>Stan Winston, one of the best special-effects men in the business, lent his talents to this film while Val Kilmer and Michael Douglas are more than adequate in the starring roles and the African with the freckles (sorry, I don't have his name) is really a likeble fellow.<br><br>Except for the first one, the lion attack scenes are not gruesome and the filmmakers did a nice job a having just the right amount of action and lulls. Neither is overdone. This film has never been given much due but I've never shown it to anyone who didn't thoroughly enjoy it.<br><br>This movie scared me so much I stopped hunting lions. It's just not fun anymore.","user":"ccthemovieman-1","rank":[78,99]}]