[{"title":"The essence of an 80's slasher film","rating":9,"date":"28 April 2006","review":"I like this film, and am not afraid to admit it. In fact, it ranks among my favorite slasher flicks of the 80's. Note, I didn't say the BEST of the 80's-I said one of my favorites.<br><br>In my mind, this film captures perfectly the essence of an 80's slasher film! Violent, over the top gore, cheesy dialog and acting, and an ominous setting all make this film stand as a model for a decent slasher flick.<br><br>In an unique plot, a young boy accidentally shoots and kills his mother on his father's birthday. The father never forgives his young son, and years later, he sends him a letter telling his son that he needs to go to their beach house to close it down. The son decides this would be a good getaway for him, his girlfriend, and two other couples. Unbeknowst to them, the father is waiting at the beach house with an array of garden and fishing instruments ready for use on the teens.<br><br>To get the full effect of this film, you HAVE to see the unrated version. This is crucial, as the rated R version cuts out much of the gore and the lighting is terrible. To say this is a gory movie is the understatement of the year. The unrated version holds nothing back, and this film contains one of the most disturbing deaths (the fishhook!!) in slasher flick history. I also like the dark, foreboding mood of the flick. The deserted beach fronts makes for a spooky, tense setting.<br><br>This film is often criticized for the acting and cheesiness of the dialog; in my opinion, those things come with the genre. Overall, I would recommend this flick to any horror fan, particularly younger ones who have been turned on to the genre by recent flicks such as \"Hostel\" and \"Wolf Creek.\" You will see where many of the current slasher flicks got their roots. My bold rating 9 out of 10.","user":"FrightMeter","rank":[19,21]},{"title":"A worthy rental for a night of harmless and memorable cliches!","rating":22,"date":"22 December 2001","review":"My guess is, if you're reading this review, you're already aware of those movies that are indeed so bad they're actually quite enjoyable. Well, THE MUTILATOR is a prime example of such a flick, at times comical and on the odd occasion impressively gruesome.<br><br>It opens grimly with a tragic and fateful accident. A young boy - who we later find out is called Ed - who's cleaning his father's rifles, accidentally fires one of them, killing his mother instantly. Daddy arrives home , and lets just say that he doesn't seem like the forgiving type!  He slaps the kid round the face and points a loaded shotgun at him forcing the petrified child to flee from the house. We are then left with an effectively chilling scene showing the dad looking clearly disturbed, pouring whisky into the corpse's mouth before downing some himself.  Fast forward ten years and Ed is now a wise-cracking teen. To make matters worse he's made himself some stereotypically cheesy early eighties friends that all look like they make up the perfect ingredients for a good old fashioned blood bath! Before long they're all of to close down Ed's dad's secluded beach house , and guess who's ominously creeping about armed with a chainsaw and watching them...<br><br>Ok, ok so there are certainly no Oscar nominees here (Watch out for Mike played by Morey Lampley, he's a real budding thespian!), and at times the film can seem to drag a bit - mostly in what seems like hours of character building.  But what saves this surprisingly gory (in it's uncut version) little flick from becoming a total loss is how at times it manages to generate a genuinely macabre atmosphere. This is most evident when the maniac dreams of slicing his infant son's throat with a battle axe, or when he impales the heads of his victims on to spikes in a rack as if they're some kind of trophy. All the other trademark cliches are included: the clearly asthmatic killer (heavy breath, a virgin final girl, a dopey sheriff, an axe, chainsaw, pitch fork and even a giant fish hook!  Mark Shostrom's gore is also a lot more visible now (in the UK prints) thanks to VIPCO's extreme version and a much more lenient censor!<br><br>So all in all not brilliant but not rubbish either, a worthy rental for a night of harmless and memorable cliches!","user":"RareSlashersReviewed","rank":[19,24]},{"title":"Surprisingly bland","rating":4,"date":"17 July 2007","review":"Every once in a great while I absolutely agree with IMDb's rating of a movie...this is one of those times. The Mutilator isn't particularly bad. It's not particularly good. It just sort of is. I know the holiday/sleepaway camp slasher flick was a staple of '80s horror, but some added a little something different to distance themselves from the pack. Unfortunately this isn't one of those movies. This movie kind of has the look and feel of the first Evil Dead movie but without any of the things that made Evil Dead really stand out.<br><br>Just looking at the cover of this I was kind of hoping for a real exploitation flick...the kind of movie that uses the story only as a vehicle for more gore. Sadly, no. Oh sure...there's some gore but it's pretty limited and only really comes into play towards the end. For the rest of the movie we're forced to watch a very poor attempt at character development which ends up with you still not giving a crap if anyone lives or dies. And far be it from me to split hairs, but I kind of expected a movie called \"The Mutilator\" to feature some...oh, I don't know...mutilation. No such luck. Instead it's just a guy killing some of his son's friends in a (I can only assume) drunken rage for an accident that happened 10 years earlier. Can this guy hold a grudge or what? Oh well...it's not exactly time wasted, but there are much better films of the same era/genre out there.","user":"Heislegend","rank":[15,20]}]