[{"title":"A classic for all time.","rating":10,"date":"18 May 1999","review":"Whoever says they just don't make the quality of pictures today that they used to hasn't seen or is ignoring this film.<br><br>That Emma Thompson is one of the greatest actresses working is no secret. But who would have expected such a miracle from her in the screenwriting department? Some of the most dramatic moments in 'Sense and Sensibility' come from her pen, not Jane Austen's, difficult as that may be to believe. For instance, the scene in which Col. Brandon (Alan Rickman) carries in the ill Marianne Dashwood (Kate Winslet), echoing the earlier scene where Willoughby (Greg Wise) brought the injured young woman home was Thompson's doing. Marianne's illness also is responsible for much more drama in the movie than in the book. And I'm an Austen fan! I can't recall another writer bringing so much good of his or her own to a classic like this.<br><br>I suppose the director, cinematographer, production designer, etc. deserve to share the credit when a movie is this outstanding, but with such a super group of actors on the screen (from top to bottom) it's easy to heap all the praise on them. I had unconsciously (and unfairly) pigeonholed Alan Rickman based on the other role I'd seen him in, the villain in 'Die Hard,' so he was quite a surprise to me. The real bombshell, however, was my first exposure to Kate Winslet. After seeing this movie and Kenneth Branagh's 'Hamlet' I can say I can't remember another young actress who has impressed me so much. And she played these difficult roles by the time she was 20! Many of the other cast members are a part of an excellent group that Thompson and Branagh have often worked with in the past.<br><br>I realized that 'S&amp;S' had become one of my all-time favorite movies when I found myself watching it every chance I got when it came on TV. I think it's bumped 'Raging Bull' off my personal top 10 list.","user":"Hermit C-2","rank":[127,137]},{"title":"A subtle masterpiece","rating":10,"date":"27 February 2001","review":"I saw this movie in a cinema back in 1996 and since that June I have seen it about a dozen times. It is true, that being an ardent lover of the so-called Romantic (as if the 13th century couldn't be Romantic or 17th, but these things are academic nonsense) period I can enjoy even minor pieces of period cinema, however this is most probably the best film set in the early 19th century. Although it centers on the relationship of the two sisters and their respective romantic relationships, it also seems to be a salute to the period itself in its precise description of the English country society. It is truthful to Jane Austen's novel, but Emma Thompson's script is fine in its own right, with many omissions and additions to the novel. The acting is superb, Kate Winslet as the typical Romantic dreamer (sensibility) is breathtaking (try not to be moved when her character wanders in the rain to see the house of her beloved and when she whispers half-deranged: 'Willoughby, Willoughby, Willoughby.') is perfect as is Emma Thompson as the rational but equally tormented older sister(sense). Greg Wise is perfect as the dashing semi-Byronic hero Willoughby and Allan Rickman as the mellow Brandon. To say nothing of the art direction, the music or the fantastic image composition. I would recommend everyone with some sort of emotional subtlety to see this film, for the story, the wit, the period and the imagery.","user":"amadore80","rank":[134,156]},{"title":"Very good adaptation.","rating":10,"date":"30 November 2000","review":"This is one of the best of the recent Jane Austen films, from one of her weaker books. Emma Thompson has done a fine job of the script, not slavishly remaining faithful to the book but not abandoning it either.<br><br>The cast are uniformally excellent. I especially liked Kate Winslet's Marianne and Alan Rickman's Brandon. Emma Thompson's performance is almost good enough to make you forget that she is far to old for the part. The supporting cast are all excellent.<br><br>Ang Lee's direction shows the same skill that it did in the excellent Eat Drink Man Woman and the scenery and costumes are beautiful (perhaps too beautiful).<br><br>This is more romantic and less comic than say Emma, and Thompson's script wisely stays away from the kind of set-piece gags seen in the recent film of Emma. All in all, this is excellent.","user":"pma97dr-2","rank":[80,92]}]