[{"title":"High-flying Kung Fu parody","rating":1,"date":"1 May 2001","review":"HANDSOME SIBLINGS (1992) is a parody of the `flying fu' subgenre of Hong Kong kung fu films of the 1990s. It's all about the ongoing battle for control of the martial arts world-a common theme in these films--yet it has few fights and focuses more on the romantic and comedic aspects of the story, which details the relationship between the two leads, who've been raised by opposing clans to contend for control of the martial world, but who instead fall in love. The leads are played by HK pop star/matinee idol Andy Lau and HK diva Brigitte Lin. The supporting cast of Hong Kong stalwarts includes the always memorable Francis Ng (as the villain), the ever-beautiful Cheung Man (as Andy Lau's estranged mother, who raises Brigitte) and the dependable character players Richard Ng, Shing Fui-On, Fung Hak On, and Ng Man Tat.<br><br>It's all very amusing, with some nice effects and pretty cinematography, but don't go into it expecting a lot of action or a lot of Brigitte Lin, who flies around a bit but has far less to do than Andy. See this only after you've seen such other high-flying Lin masterworks as SWORDSMAN II, THE EAST IS RED, DRAGON INN and THE DRAGON CHRONICLES (which also co-stars Cheung Man), or the similarly themed Michelle Yeoh vehicle, BUTTERFLY AND SWORD.","user":"BrianDanaCamp","rank":[3,4]},{"title":"So so swordsman movie","rating":6,"date":"24 November 2018","review":"Handsome Siblings is a so so swordsman movie that had potential to be a pretty bad ass wuxia flick, but squashed it with too much comedy and too much goofing around. From a technical standpoint, the film looks good and it has great costumes and some crazy action sequences. Andy Lau and Brigette Lin are the stars of the film and are brother and sister who enter a martial arts tournament from rival clans, but end up falling in love instead. Francis Ng gives an impressive showing as the villain here and as such excels in kung fu treachery. Director Eric Tsang besides injecting tasteless humor and rape jokes did a decent job in directing this. This is by no means one of the finer films in the genre, but it at least is much better than the somewhat similar and much worse Andy Lau/Brigette Lin vehicle The Three Swordsman which I recommend to avoid.","user":"dworldeater","rank":[1,1]},{"title":"Chaotic wuxia","rating":5,"date":"18 December 2018","review":"HANDSOME SIBLINGS is a chaotic adaptation of a wuxia novel that was previously adapted by Shaw under the title THE PROUD TWINS. Andy Lau plays the offspring of criminal parents who heads off to a martial arts tournament and finds himself falling in love with femme fatale Brigitte Lin. It's a cheap and cheerful affair, lacking a single decent kung fu fight (despite former Venom Phillip Kwok supplying the choreography) but with plenty of outlandish effects and wirework battles that defy the laws of gravity. Eric Tsang is at the helm here and plays up comedy over realism, and as ever it's a delight to see the likes of Richard Ng, Francis Ng, Wong Yu and Shing Fui-On appear in supporting roles of varying size.","user":"Leofwine_draca","rank":[0,0]}]