[{"title":"Nothing new but still surprising.","rating":7,"date":"19 February 1999","review":"This film may be a very run-of-the-mill, everyday Romantic Comedy but thanks to the performances of Michael J. Fox and Gabrielle Anwar, apart from the singing, it ends up as a deeply entertaining and enjoyable movie to sit back and relax with a loved one over at the end of a tiring week.<br><br>This movie never actually got a video release in the U.K. which has greatly disappointed me and means I have to wait for its repeat appearance on TV in order to add it to my collection.<br><br>Nevertheless, Fox excels yet again and shows why he is one of the few American sitcom stars to make a prolonged impact in the movies in roles unlike his character from Family Ties. Anwar also gives another performance which leaves me increasingly baffled as to why she has not been used more in Hollywood.<br><br>See this movie, it may not have been a hit but it will surprise you with its quality just the same.","user":"Bing-18","rank":[20,20]},{"title":"A romantic comedy that I didn't hate. What the heck? Must be something wrong...","rating":7,"date":"1 August 2000","review":"No, this movie is actually pretty good. It's quick and efficient, it does its job well, but it's not something you're going to think much about ten minutes after you see it (now, now, don't get greedy).<br><br>\nWhy do I like it? Fox. And I don't consider myself a big Michael J. Fox fan, I mean, he was good in Family Ties, but that was a long time ago and he's done some stinkers between then and now. Maybe because the smooth talker consierge he plays in this reminds me a little of Alex P. Keating back in the day. This guy is super-slick, his mind is always going at incredible speeds. One part that will always stand out is the 'ticket trade' scene (How'd this Donahue get in here?). Funny stuff. There are a few good laughs in here.<br><br>Oops, can't forget Gabrielle Anwar. She is just cute as a button in this movie, I want to see more of her (the only other movie of hers I can think of off hand is Body Snatchers). Heck, you can almost forgive her for basically playing a prostitute in this one. If you don't agree,ask yourself this: Would she have taken any of this guys crap if he was a married garbage man from New Jersey and not a married european millionaire fashion mogul? Of coarse not, she's in it for the money. Hell, i'd wear a skirt and put out for that kind of scratch.<br><br>The director Barry Sonnenfeld has an interesting resume of hits (Men in Black) and misses (Wild Wild West) and just entertaining films (Get Shorty). This one is entertaining fluff. It's an hour and a half of your time that you won't regret spending. 7/10 stars. G'night!","user":"Shecky J. O'Pootertoot","rank":[20,22]},{"title":"Pretty Good","rating":7,"date":"27 April 1999","review":"I quite liked this movie ... it wasn't particularly special, basically a rather traditional love story... but it hit in the right places. And Michael J. Fox's character Doug, a concierge being the center of a romance is fresh and appealing. One of the scenes I liked was when he showed Gabrielle Anwar's character, Andy, his dreams ... literally. Everything seemed to come in together ... you really understood then how much it meant to him, and his sharing it with Andy was a wonderful gesture of his love for her. The moment was magical, the best in the whole movie for me. Watch this if you like a conventionally exceptional love story.","user":"YFL","rank":[12,13]}]