[{"title":"A sale is always made...","rating":8,"date":"25 March 2004","review":"I remember when i had a short stint working for this telemarketing company, my boss used to always say \"A sale is made on every call. Either you sell them what you are selling or they sell you an excuse.\" This is the message that this film hammers through: the lure of fast money and the power of persuation; you can destroy someone's life with one phonecall. Now unlike the characters in Boiler Room, im not trying to scam you out of your life savings- so stop reading these reviews and see the movie. You won't regret it. 8/10","user":"tomkasprzycki","rank":[65,81]},{"title":"A very very very good film","rating":9,"date":"1 October 2010","review":"I'll sum this film up in 5 words, 'on par with fight club'.<br><br>This is a great film, every second of this film is worth 9/10. I'll start with the films flaws. Firstly, the main character is very weak, I'm not sure whether it's poor writing or bad acting but he just comes across as an idiot rather than the deep, flawed, entrepreneur that the film wanted to portray. Secondly, even in the year 2,000 floppy disks were an ageing technology, without giving much away there's a scene where an entire companies data is copied to a floppy disk. The film includes a lot of central characters and doesn't provide any back-story for any of them, this wouldn't be so much of a problem if the central character wasn't so weak but by the end of it you feel as though you haven't seen a single character develop or even begin to understood any of the characters but you have just seen a good film.<br><br>Praise: This film is amazing. The film really captures the desires of society and gives them a face. The characters really convey the shallow two facedness you come across every day where they're happy and pleasant until something happens that could even remotely damage their cash flow. Every person you've ever met that wanted to make a quick buck is in this film, the consumerism and lack of social conscience that constantly plagues society is so prevalent in this film. It also approaches the topic of share trading from a much more accessible angle, they don't put much effort into adding the right industry terms or showing scenes of the NY stock exchange - they show the consequences of share trading, the lack of understanding of the average consumer and give you a better understanding of where the money comes from. If you're anything like me then this film takes you on a ride where you are the main character every step of the way until finally you return to life with a much deeper understanding of the desires people succumb to in modern society. This film includes very young appearances by a lot of famous actors, Ben Affleck, Vin Diesel etc. who all pull their weight to give life to the film. I'm explaining the film in a very stale way but I can't help it, it's on par with 'fight club' - you can't explain why the film is good in a way that does it justice, just watch 2 hours of cinema that will improve your quality of life.","user":"yevonwm","rank":[19,23]},{"title":"A must see film","rating":8,"date":"13 March 2000","review":"I don't know all there is to know about the stock market.  I know the basics and that could get me by until I asked people that were much more well versed and graceful when it comes to that side of business.  I do know however that the stock market can be sleazy and deceitful at times and it can also be cut-throat economics.  With this in mind I went into this picture with high hopes of at least a film that would teach me something about a part of life that I knew very little about.  I was also intrigued because Ben Affleck looked like he had the Alec Baldwin role from Glen Gary Glen Ross, that small but explosive role where the seasoned vet comes in and tells eveyone how to sell, when to sell and what the best way to screw people out of their money is..... and hey, what do you know, I was right. Ben Affleck does have a similar role to Baldwin's.   But what I wasn't expecting was the film that was before me.  Boiler Room is one hell of a film and even if you know very little about stocks and bonds and insider trading and what-not, there is still plenty in here to keep you intrigued.<br><br>The actors in here, while not huge by name alone, are quite good and keep your attention.  As I said earlier, Ben Affleck intrigued me the most, perhaps it isn't so much him but the character he plays.  He was the cocky-know-it-all-millionaire-playboy that cares about nothing but closing the deal.  He is greedy, self centered and most of all damn good at what he does.  He teaches the new recruits how to become ruthless and mechanically shut off emotionally.  In his world of stocks, there is no place for feelings of guilt, sorrow or pity.  In his world all you have time for is greed and anxiety.... anxious to cash you next $100 000 paycheck.  Ben Affleck has a small role in the film but it is an effective one. <br><br>Giovanni Ribisi plays the good guy here, Scott Caan plays a young and wealthy broker that uses his wealth and power as a way to let go of his anger by constantly getting into physical altercations.  But in an impressive smaller role, the one who impressed me the most was Vin ( Caparzo from Saving Private Ryan and also the lead in Pitch Black )Diesel.  He plays his character ( Chris ) right down the middle.  He wants Seth ( Ribisi ) to succeed but he doesn't seem as ruthless as some of the other brokers and at the end he does something incredibly noble in the face of imminent doom, and that is what I found compelling about his character.  Most of the other characters are all driven by success and money and show little compassion, but Chris ( Diesel ) does have that side to him and I enjoyed Diesel's performance quite a bit in Boiler Room.<br><br>The story is also quite intriguing and it is both fun and a little horrific to get into the heads and lives of these men as they deliberately try to ruin people's lives in the hopes of bettering their own.  They fraudulently sell normal people bogus stocks to bogus companies and it doesn't matter that the people they are selling to are family, blue collar workers that want so badly to believe the American Dream has just landed in their lap that they believe anything that these total strangers are saying to them over the phone.  And that gives the movie it's edge.<br><br>Boiler Room is the best movie I have seen so far in this new year.  Although the new year is not even 4 months old yet, this is one film that may have a chance to make my top ten list of films for the year 2000.  This is the first film for writer/director Ben Younger and at the age of 27 it looks as though this guy has a good future in the game.  Not that I am comparing Younger to Spielberg or Boiler Room to Jaws, but Steven was 26 when he made Jaws and look where he is today.  Again, I am not saying that Younger is following in those footsteps but it is a great film for a guy that is three years less than 30.  I highly recommend this film to everyone!<br><br>8.5 out of 10.... a great triumph for Ben Younger and all involved.","user":"baumer","rank":[30,41]}]