[{"title":"Unbeatable comedy for the right person in the right frame of mind.","rating":10,"date":"11 January 2002","review":"You can pick up two things from reading other IMDb users' comments about this movie: 1) It's not for everyone so chances are you'll either love it or hate it, and 2) The frequency with which someone adds a comment is slowly increasing over time.  Both these things lead me to imagine that Major Payne has all the makings of a great cult comedy in the truest meaning of that term.<br><br>If I were to offer anyone advice it would be to watch the first ten minutes of the film next time it's on TV.  If the style of humour seems amusing to you, settle in for the ride and you'll probably be laughing out loud a LOT. If it seems dumb and you don't get it, cut your losses, switch right off and do something more productive with your time, that way you'll be spared an experience you won't enjoy.  It's really that simple in this case.<br><br>Me?  I had thought from the trailers it was going to be dumb but it came on TV and I started watching.  Straightaway I was laughing at the narration, Payne's excessively 'war-ey' attitude (\"The sweet smell of mustard gas\" !!) and his voice, which you will also either love or hate.  The Apocalypse Now spoof had me hooked... I suspected it was going to be another one of those parody flicks like Scary Movie or Hot Shots, but was pleasantly surprised at the way it panned out.  The story is by-the-numbers cliched stuff, but it is essentially played with a straight face - there are no winks to the camera. Yet it still works, because even though they don't let on that they know, you still know that the film-makers are aware how cheesy it all is, and in fact I think they are gently sending up all those \"inspirational\" feelgood movies, without being offensive towards them.  This is achieved in part through Wayans' stand out performance, and the blend of realistic (Payne's behaviour towards his charges is apparently mirrored in some real drill instructors) with ridiculous (a 6 year old military cadet??!!)  Also, the director's use of music is inspired - consistently over the top at the right moment (eg \"Respect\") to heighten the humour.<br><br>Standout moments for me were the 'Little Engine Who Could' scene and Payne's \"vision\" whilst waiting at the station.  Already I would like to get a copy of this movie as there were many many quotable one liners I would like to see again - as I said, it has the makings of a cult classic.  I would recommend it unreservedly to someone if I knew they liked this kind of humour; to everyone else... 10 minutes is the cut off point!<br><br>I should just add that although I was in the R.A.F cadets at school, and have a brother in the British army (a Major, no less!!!) I have not been through the 'boot camp experience', yet still found the movie to be very funny.  Bottom line though, I can see it's not for everyone, so use your discretion.<br><br>8/10 for me ? /10 for you","user":"BrickTop","rank":[53,56]},{"title":"One of the most underrated films out there, a true classic","rating":10,"date":"31 January 2006","review":"This is a great film that you can sit back with your children and watch again and again.<br><br>The story is taken from an old Chuck Heston film called Major Benson's Private War that took a serious \"military man\" and put him in charge of a group of children in an ROTC unit.<br><br>Major Payne takes that story and inserts Payne as the 1990s caricature of a Rambo-esq \"killing machine\" - with an over the top slant to make his character comical in nature.<br><br>There are some tried and true story lines here. Payne's 'tough love' motivates the children and helps them to grow...but he also grows as a person through his concern for the children as well as a love interest. The children at first despise Payne for his tough methods, but they learn to respect him. Payne sees emotion and caring as weaknesses early in the film, but he learns to value those. We see that the kids can have discipline yet still be kids, and the adults can be strong role models and be sensitive.<br><br>Wayans's voice and high strung nature may turn some off, but they truly accentuate his character.<br><br>The film has a happy ending where all has turned out for the best.<br><br>This is a film you can watch over and over. Very few of the jokes get old, and you find yourself repeating many of the lines back. A fun movie that has appeal for both young and old.","user":"cpbeau","rank":[20,20]},{"title":"No Payneful puns here...","rating":27,"date":"27 October 2002","review":"This film is a lot better than most would expect, largely because of two factors - the screenplay and the star.  The script, while not particularly original in terms of its narrative, is superb in terms of its humour which is quite dark and dry in parts.  \"There's a monster in my closet\" complains a frightened child.  Not after Payne puts five bullets into the closed door.<br><br>Payne's unconventional character is a riot and the film is balanced just right so that he doesn't become too annoying.  And believe me, he has the potential to become very annoying, especially with THAT voice.  Wayans delivers his dialogue in a manner almost reminiscent TV's The Nanny - nasal and grating.  However, he performs with such dry sarcasm and a fantastic permanent grimace that he is a real stand-out, and ultimately the film probably wouldn't work as well with another actor in the role.<br><br>\nFor light entertainment value, 7/10 for Major Payne.","user":"Chandler81","rank":[19,21]}]