[{"title":"authentic and nostalgic","rating":10,"date":"12 August 2006","review":"I saw this anime after I had been introduced to some other, more prominent anime from Studio Ghibli. If you appreciate a fine subtle authentic slice-of-life story of high school romance, this is as good as it gets.<br><br>Its told from the point of view of a male student. A new female transfer student arrives from Tokyo and the plot moves forward in an interesting way. It never hurries, and feels very matter of fact. By the end of the film lessons are learned and the heart strings are pulled.<br><br>This movie doesn't try to do too much; it simply focuses on the main characters and tells their story honestly. You never feel manipulated as you do with many Hollywood films. The dramatic conflicts are real and interesting.<br><br>This is one movie I treasure.","user":"bellygod","rank":[54,59]},{"title":"Why can't our TV programming be this good?","rating":8,"date":"19 June 2003","review":"TV movie or not, this was an outstanding film.  Terrific direction, animation, and writing.  As others have stated already, it is a film with a great deal of subtlety, so if you think great acting is Julia Roberts screaming at the top of her lungs, then you might not appreciate this film fully.  It ranks among the best animated films I have watched, at least in the top 15 or 20.  It's not quite in the same league as The Grave of the Fireflies, Princess Mononoke, Spirited Away, Akira, My Neighbor Totoro, Whisper of the Heart, Only Yesterday, or a few other excellent anime I have had a chance to see, but it is easily better than 99% of the rest of the animated films out there.  Highly recommended.  At least an 8/10.","user":"breezyweasel","rank":[43,49]},{"title":"Much underestimated TV Ghibli","rating":9,"date":"16 November 2004","review":"The knowledge that Ocean Waves is a TV movie put me off watching this 'lesser Ghibli' until I'd covered the rest of their catalogue. Whilst it may not have the wide appeal of Miyazaki masterpieces like Totoro, Porco Rosso and Spirited Away etc., it's a surprisingly successful film. The subtleties of the relationships and characters are so beautiful and rewarding that the film is elevated way beyond its TV roots. <br><br>In short, if you want a gentle meditation on teen relationships and love, this is as good as it gets. And if you like Ghibli but the subject material doesn't sound too interesting (it didn't to me), it's still worth a look as it might surprise.","user":"Balibari","rank":[45,52]}]