[{"title":"Home Alone 3","rating":6,"date":"17 December 2012","review":"Home Alone 3 tells a whole different story then the original two. Instead of the McCallisters, we meet the Pruitt family and in particular the main character Alex. A computer chip worth ten million dollars is placed into a toy car by our four villains in an attempt to get through airport security. There is a mix up at the airport, and the toy car ends up in the possession of an older woman who gives it to little Alex as a gift. The four bad guys track the car to a neighbourhood in Chicago and break into a series of houses looking for the chip. Alex (who is HOME ALONE with chicken pox) see's the crooks breaking into the houses an calls the cops, only to look like a prank caller each time. The villains looking for the chip eventually realize that little Alex has it and that's when the fun begins - Home Alone style.<br><br>I actually enjoyed Home Alone 3 as a kid and as an adult now. No, it isn't as good as the original films and no Alex Linz is not Macaulay Culkin. But this movie gets points for breaking off from the McCallister storyline. I mean how many times can that family forget the same kid? Young actor Alex Linz who plays Alex in Home Alone 3 does a great job taking on this big role, he manages to not put in an annoying performance like so many child actors can be do these kind of movies. The crooks include three men and one female, and I like that they added a woman into that villain role. They all are good actors and add plenty to this movie.<br><br>The best comedic moments come from the crooks, especially David Thornton as 'Unger'. There are some ho-hum funny moments which fall flat such as the talking parrot and a few scenes with Alex's older brother and sister who \"torment\" him. Another flaw was the actual \"home alone\" bit, and the fact that Alex isn't really home alone as we've seen in the first two films. His mother leaves him for a couple of hours as he recuperates from Chicken Pox, hardly the same as Kevin McCallister went through. And I don't like that it doesn't take place ON Christmas. But those drawbacks don't take away from the whole movie at all. <br><br>Home Alone 3 isn't great, but it takes some risks by moving from the original plot and adds some smarts it with the computer chip story. These aren't your simple criminals like the wet bandits were, they are after far more than some jewellery and expensive silverware. I recommend Home Alone 3 for sure!<br><br>6/10","user":"Toronto85","rank":[29,32]},{"title":"Every 90s Kid Loves This.","rating":10,"date":"21 February 2015","review":"Home Alone 3 caught a bad rap because it has not connection at all with the previous movies with Macaulay Culkin. This should not have been called Home Alone 3, but something else. I wouldn't go so far as to calling it the best in the series, but I do stand by this having the best storyline.<br><br>The general premise about a little kid being home alone and creating booby-traps to catch the bad guys is the exact point of the first two, but it's what's beneath the surface that is the best. A group of bad guys steal an Air Force computer chip and must deliver it to a North Korean terrorist organization. They hide it in a remote control car where it is unintentionally picked up by a retired lady headed to suburban Chicago. Hr taking the bag was unrealistic; in an airport, who doesn't check to see if they have their own bag? Everybody knows some luggage look alike! She gives the car to her 8-year-old neighbour, Alex (Dinz) who just came down with the chicken pox. The thieves get the whereabouts of the neighbourhood, but break into each house hoping to find the car. Alex is home alone and sees the thieves through his telescope and calls the police. Everybody thinks he's crying wolf, but Alex is determined to catch the thieves once and for all. The thieves want to search in the daytime because they know everybody is either at school or working. What if there's people like Alex sick home from school? Or retirees? Then the place not believing Alex is also a bit unrealistic. He notices odd things happening in the neighbourhood ontop of intruders. The thieves are obviously experts, so wouldn't the cops work to plant hidden cameras or something like that? When it goes to classic Home Alone, the traps and slapstick comedy is just as great (sometimes greater) than the first two. Sure there's some unrealistic traps, but the first two had them also. Maybe it is just because I am a 90s kid, but I don't get why this is hated. Alex is just as good a Kevin, the thieves are cool, the story is better than the others. Home Alone 4 and 5 are the bad ones. I mean reeeeaaally bad.<br><br>3/4","user":"powermandan","rank":[40,48]},{"title":"Unpopular Opinion: THIS MOVIE IS GOOD!","rating":9,"date":"9 November 2018","review":"Hi,<br><br>Home Alone 3 would be a really great film if they ( the writer/director/producer) didn't name it \"Home Alone 3\". I saw the 4.4 rating and immediately understood why. Home 1 &amp; 2 were classic Christmas films. Why wait 5 years to complete the potential trilogy? I understand that this film is nothing like the original and that's what people are expecting. If this was a stand alone film, it probably would've been better received.\nEither way, I think its a great film. The plot, the actors, the acting, the comedy, the scenes, all were good.<br><br>(P.S. Home Alone 4 was trash and they were asking for trouble!)","user":"usedforpayments","rank":[40,49]}]