[{"title":"Remember those movies you saw 300 times as a kid?","rating":10,"date":"11 March 2001","review":"You knew it line for line, so did your parents, grandparents, brothers, sisters and any one that came to spend any longer than 2 hours at your house. Well this was one of those movies for me. If I had never seen it before and watched for the first time today, I would more than likely not be overly impressed, but since this movie is one of the things that incaptulates my childhood I can't say any thing bad about it.<br><br>One line summery: I can't remember doing up my shoes for the first time but I remember this movie... and my copy still works!","user":"limesoda","rank":[9,9]},{"title":"I yabba-dabba bid you welcome...","rating":7,"date":"2 December 2005","review":"Admittedly, \"The Flintstones Meet Rockula and Frankenstone\" will only appeal to kids, but it's still fairly interesting. It basically has Fred, Wilma, Barney, and Betty winning a trip to Rocksylvania, where they unwillingly meet Rockula and Frankenstone. You see, the Count is convinced that Wilma is his bride.<br><br>As one might expect, the Count has an accent similar to Bela Lugosi's, while the Monster's speech mostly consists of growling. I watched this movie a few times when I was really young. At that age, I was able to appreciate it, but I can still understand why little kids would. It is worth seeing, especially since Mel Blanc was still doing Barney's voice.","user":"lee_eisenberg","rank":[4,4]},{"title":"A great film for everybody! Highly recommended!","rating":10,"date":"27 June 2007","review":"This film doubled up with \"The Flintstones' New Neighbors\" has been a lifelong favorite of mine from many many years ago when I was little. Having to buy a second copy after the first wore out (finally) a few years before, it wasn't until then that I realized just how much I'd missed this childhood favorite of mine.<br><br>In \"The Flintstones Meet Rockula and Frankenstone\", Fred, Wilma, Barney and Betty, in costume head for Bedrock's game show \"Make A Deal Or Don't\", (and watch as hilarity ensues when a police officer radios in seeing a man with chicken feathers on his head and a daisy driving a car with a bumble bee beside him) in hopes of getting on the show to play for the wonderful prizes. Barney's picked and wins $1,000 but has a choice to either keep it or take what's behind the curtain. Fred heckles him when he decides to keep the money, so the show's host Monty Marble gives Fred the same choice and Fred finds it's not so easy to give up a grand for an unknown prize, but he does.<br><br>The grand prize is a trip to a big monster bash in Rocksylvania at Count Rockula's castle which has been converted into a tourist hotel. Monty allows Barney to give back his $1,000 so he and Betty can go with them. Upon entering Rocksylvania they find it is an extremely creepy atmosphere, and are approached by an eerie man who drives them up to the castle, along the way tells them about Count Rockula who worked in his secret laboratory to create the Frankenstone Monster to scare away the werewolves in Rocksylvania. Count Rockula reportedly hasn't been seen in 500 years, but at any time could come back to life.<br><br>Fred is extremely skeptical about the spooky stories regarding Rocksylvania and the castle, and consider it all a gimmick, even when he and Barney go sliding through a trap door in the castle down to the laboratory and find the Frankenstone monster dormant. Climbing out the window to get back to the party, they leave just before lightning strikes and revives Frankenstone, who in turn enters a secret chamber to awaken Count Rockula. With Fred and Barney exhausted from the trip, Betty and Wilma also retire from the party early to see them to bed, to which they are absent when Rockula and Frankenstone chase all the guests and hotel management out of the castle.<br><br>When Fred and Barney sneak downstairs for a snack, Rockula inspects the bedrooms to see everybody is gone, but finds Wilma in the room where his own bride rested 500 years ago, and mistakes Wilma for the Mrs. Count Rockula, so he kidnaps her. However, even when he finds out she is Mrs. Fred Flintstone, Rockula is determined to make her his bride, even if that means making her a widow. From there, it's a race for everyone to get away from Rockula and Frankenstone, and find a way out of the castle and back to Bedrock.<br><br>This is an excellent cartoon for kids, and parents can enjoy it as well. It is especially perfect for around Halloween for a little spook. Highly recommended if you ever find this video tape available to buy. 10/10 stars all the way.","user":"novastar_6","rank":[2,2]}]