[{"title":"Clever, witty and very sensual","rating":2,"date":"2 May 2010","review":"In this film wealthy prep school student Kathryn (Sarah Michelle Gellar) bets her stepbrother Sebastian (Ryan Phillipe) that he can't deflower the virginal Annette (Reese Witherspoon) before the school year begins. If he fails to accomplish this task, Kathryn gets his Jaguar Roadster; if he succeeds, he gets an evening of pleasure with Kathryn. <br><br>I just finished watching Cruel Intentions and what a pleasant surprise this film turned out to be. I guess the best way to describe it is as a sexy and seductive thriller. The film is very clever and bold but above all, extremely engaging and entertaining. Dealing with this kind of subject...making this kind of film...it's definitely not easy. Usually these kind of films come off somewhat \"fake\" and lame; corny, whatever you want to call it. Thankfully, Cruel Intentions went the other way, probably thanks to the witty and sharp dialogue and a very good direction. <br><br>Ryan Phillippe delivered a terrific performance and so did Reese Witherspoon. I was actually a bit disappointed with Sarah Michelle Gellar, her acting was not very convincing at times to say the least but honestly, the story is so engaging that I was able to overlook that flaw. Another aspect that really took me by surprise was the musical score. Cruel Intentions has one of the best soundtracks I have ever seen in films. There's some great well known songs like Skunk Anansie's \"secretly\" and Placebo's \"every me and every you\", but there's also some fast paced instrumental tracks throughout the film that really compliment the scenes. Overall, a great watch and so much more then a teen film.<br><br>7.5/10","user":"imdbbl","rank":[28,30]},{"title":"A fantastic update about the rules of seduction","rating":9,"date":"14 August 2001","review":"Cruel Intentions was my favorite movie when I was 14, to me it was everything I just wanted to be as a teen, despite how cruel and manipulative Katheryn was, I thought she was the coolest and strongest female character I'd ever seen on film. Now a couple years afterwards I read the book and saw the original Dangerous Liasons with John Malkovich and Glenn Close, I still very much enjoy Cruel Intentions. Like I said, this was just a terrific updated version of the ultimate story of love and betrayal, it was a little Dawson's Creek at times, but from what angle they went at, it was understandable. It had the biggest stars: Sarah Michelle Gellar, Ryan Phillipe, Reese Withersppon, Tara Reid, Joshua Jackson, and Selma Blair. May I say they gave extremely impressive performances, but the best without a doubt goes to Sarah Michelle Gellar, she was just ultimately brilliant as Kathryn Muertiel, the cruelist girl in school who's goal isn't to be the most popular, but to dominate everyone's innocence.<br><br>Kathryn and Sebastion are step brother and sister, they have a partnership together to work the school into a total wave of turning the most innocent into the most corrupted. They also have a love for each other, but Kathryn is the only girl Sebastian can't have, it kills him and she teases him constantly over it. Kathryn asks Sebastian if he could help her corrupt the girl that took her boyfriend, Cecil, a naive young girl who is under Kathryn's wing, but isn't aware of her intentions. But the plot thickens when Kathryn finds out that Cecil is in love with her black music teacher which her mother wouldn't like very much. Then Sebastian finds a girl, Annette, who believes that people shouldn't experience the act of love until they are in love. He and Kathryn make a bet while he seduces Cecil, that if he can corrupt Annette, he gets to bed Kathryn. But there's one problem, he might be in over his head when he starts to fall in love with Annette.<br><br>Cruel Intentions is a great movie with good, strong performances. For what might have been a typical teen movie, this was just a good idea on where the director made decisions on how to make the story real. It's very romantic, heart breaking, and even has it's dark comedic moments for a little breath of air. I will always recommend this film to anyone, it's a great story. I would also highly recommend to watch Dangerous Liasons along with Cruel Intentions, so you have a little bit of a different variety. You'll find yourself a bit seduced with these movies.<br><br>9/10","user":"Smells_Like_Cheese","rank":[69,86]},{"title":"They're old enough to know better and too young to care!","rating":21,"date":"21 February 2002","review":"I have recently been seeing a psychiatrist about a few troubles. In one of his sessions, he bought up about the movie Cruel Intentions, which I absolutely loved. He said he loved the start of the movie where the evil Sebastian says to the Psychologist `You have beautiful legs, I would love to photograph them'. This then sets the tone for one of the best teen films that the world has seen. Based on the movie Dangerous Liaisons, Cruel Intentions goes down as one of my top five favourite films of all-time.<br><br>A sex-obsessed rich boy Sebastian sets out to win his greatest \"conquest\" - a girl who has proclaimed in a Teen magazine that she will wait until marriage to lose her virginity. The teen is egged on by his sister, Catherine, an evil scheming girl in her own right. The two have a wager on whether Sebastian can achieve his conquest. If he wins, he gets a night of bliss with his stepsister, if she wins, she keeps his most prided possession, his Jaguar convertible!<br><br>Well this is a brilliant backstabbing, bitchy, love and hate war movie. I cannot remember a movie like it in my time. The theme of the movie was priceless. Having two rich hobnob kids toying with various people's emotions in their neighborhood was just great. In fact it is not at all silly to think that this does not happen in real life, because if you don't believe that then you are very naïve. <br><br>There are many people who need to be praised for this classic movie. Director Roger Kumble did a great job in bringing this movie to our screens. He added so many little `steamy' pieces to this movie that it was never going to fail. Then you have the producer Neal H. Moritz who also allowed this film to shine. He gave this film all the right production touches, which I can only praise.<br><br>Then you have the wonderful cast that was assembled for Cruel Intentions. The main star for this film would have to be the gorgeous Sarah Michelle Gellar. She was outstanding as the horrible Catherine. Her character while at times was extremely hard to like, she was almost too hard to not want to like. I mean she was every guy's fantasy. Sexually liberated (and not afraid to admit it), then all she wanted to do is screw up all her enemies at the same time. Then you have the patronising and stud man' Sebastian, played by Hollywood hunk Ryan Philippe. His performance in this film was also first class. I thought his character was a lot more likable then Catherine's, but you could sometimes want to strangle him for the way he screws with people, just like his stepsister does, and then still seemingly gets more women dying to be with him. <br><br>Other cast members just help to make this film an extraordinary viewing experience. Reese Witherspoon is fantastic as the pure and innocent, Annette. She helps to balance the sour bitchy side of the cast, with her friendly almost sickening goody goody side. I am looking forward to seeing Witherspoon in the comedy, Legally Blonde, directed by new Australian director Robert Luketic. Selma Blair was also very good in her role as the dumb and very naïve Cecil. The kissing scene that she has with Gellar was one of the highlights of the film, with the kiss being voted the best onscreen kiss a few years ago.<br><br>Then this film has another great side to it, that of the soundtrack. It has so many great songs on it. Placebos tune `Every me, Every you' helps start this movie off, then you get songs such as Colorblind by Counting Crows and the classy, Bitter Sweet Symphony, by the Verve. This would have to be one of the world's most popular soundtracks from where I view it.<br><br>In conclusion, Cruel Intentions is a film I can say I love and that I can learn from. People in real life do use people and do hurt them. I know this because I was involved in such a scenario not so long ago. Nothing was ever happy until it was a fight and scrag. I will go as far to admit that I was confronted with a real life Catherine, a person who was such a goody goody on the outside, but the real person on the inside is a person that loves to cause trouble and will go out of her way to do it. Anyone who is like that is a real low-life in my view. Get swept up in the nasty love triangle, Cruel Intentions'!<br><br>Rating: 5 Stars or 10/10","user":"Old Joe","rank":[170,227]}]