[{"title":"More than meets the eye","rating":8,"date":"15 May 2006","review":"There is more, I think, to this film than most people give it credit for. Sure, it's full of sex and naked people, but it also manages to be erotic and sensual at the same time. It's certainly not the commercialized absurdity that you'll find late night on certain premium channels. More than that, though, is that it's a decent psychological study of a man who's completely divorced himself from reality. Like so many celebs of our time, money and success has allowed him to distance himself from whatever parts of reality that make him uncomfortable. Emily's naive and honest approach manages to reach him. His speech near the end, before the final 'scene,' is really impressive, and Mikey really is a great actor. Sure, Ms. Otis leaves something to be desired, but she's working in a role where her lack of comfort helps the part. Emily is out of her element, just is the actress playing her is, and even if this makes her transparent, it also makes her believable. Jaqueline Bisset is wonderful as always. All in all, if you watch this film without fast forwarding from sex scene to sex scene, you'll see a fairly human story mixed with a sexual journey that I think Zora Neale Hurston would have appreciated.","user":"solimondi","rank":[45,48]},{"title":"A difficult movie to review.","rating":8,"date":"8 December 2001","review":"Back in 1990, people didn't have to deal with the horrible slate of fly-by-night movies that die at the box office after one week. So many movies that would have been rejected by the studio heads for mainstream distribution back then have been allowed in (Glitter, Freddy Got Fingered, Tomcats, Ready To Rumble, the N'SYNC movie, Teen Movie, and 30 lame horror films, etc.), and then throw in the over-hyped blockbusters. Altogether, a good enough reason for a true lover of cinema like myself to stay clear of movie theaters.<br><br>Because of all that, I think this movie deserves to be looked at again. If it was the worst film for 1990, then yes, it's a contender. Carre Otis is very beautiful, but her presence as an actress is awful. She either stands there and looks pretty or delivers small lines in a forced manner. Mickey Rourke, playing the same character he portrayed in the \"pre-quel\" 9 1/2 Weeks, just walks around trying to be cool. Jacqueline Bisset and Bruce Greenwood do a good acting job, but their role in the film are to support the growing sexuality between Otis and Rourke. And yes, the storyline is nothing but an excuse for Zalman King's arty sex coupling.<br><br>BUT, if you compare this film with the drivel coming out these days, then this movie is much better. First, it was highly controversial (for a reason or two). Second, I think the sensuality is very erotic, because of the behind the scenes relationship of Mickey and Carre, or in a lot of the other assorted scenes. Third, Rio is a truly beautiful setting for sin, and the movie depicts it's partying attitude in spades (almost too much). And finally, this movie doesn't lie about it's intentions. If you wanted a sexually charged erotic drama/thriller, it doesn't disappoint. Yes, it's pretty slow, but the it's erotic build-up is very good. Bonus: no fake bodies.<br><br>Bottom line: It's not Citizen Kane, and for 1990 it was terrible, but for 2001-02, it's a heck of a lot better than today's releases.","user":"BlackJack_B","rank":[67,74]},{"title":"Clever comment on Reaganism set in a galaxy of post-transformational liberalism.","rating":2,"date":"1 September 2005","review":"Just kidding, I don't know what I'm talking about. You should see this movie if you like: <br><br>1) Sex <br><br>2) Nudity <br><br>3) Hot babes <br><br>4) Mickey Rourke <br><br>5) Carre Otis <br><br>6) Mickey Rourke and Carre Otis going at it for real <br><br>7) Perfume commercials <br><br>8) Directors trying to make their softcore porn look like art by filming everything sensually and in slow motion, so the film appears to be art-house and \"visually stimulating\" <br><br>9) Really, really, really bad dialogue<br><br>10) Lots of good banging and screwing without a plot <br><br>11) Mickey Rourke playing a total pimp (which is different than just Mickey Rourke - I mean, there's Mickey Rourke, and then there's Mickey Rourke the Pimp, which is even cooler).<br><br>And finally...<br><br>12) Hot female characters who wear glasses and carry around clipboards so the audience believes they are smart and successful businesswomen, when in fact they'd have a hard time calculating 1 + 1. (Also see: Alone in the Dark, Tara Reid's character; or Fantastic Four, Jessica Alba's.) Highly recommended to the appropriate demographic.<br><br>I could kill myself for buying it.","user":"MovieAddict2016","rank":[135,168]}]