[{"title":"Good Suspense -- For the Intelligent Movie-Goer","rating":8,"date":"25 July 2000","review":"I enjoyed this film very much.  It is well acted, and has plenty of star power, with great performances from Roberts and Washington.  The story is compelling, and the cinematography lends itself to excellent suspense. However, many moviegoers (including myself) will find elements of the plot confusing and hard to follow.  There are a great number of characters, and it is often difficult to tell who is who -- most of the \"bad guys\" dress alike and have similar hair, so distinguishing them becomes challenging. This may be a minor flaw in either casting or costume, making the characters somewhat undistinguishable.  However, it also makes the plot quite intriguing, as the intelligent moviegoer becomes entangled at guessing just exactly who is associated with who, and so on.  Still an excellent suspense movie -- if you like other Grisham movies (The Firm, the Rainmaker, etc.) you will like The Pelican Brief.  But be warned: watch the film in an attentive state, and be prepared to think a lot.  If you are a lazy, sit-back-and-relax type of viewer, this may not be the film for you.","user":"KCS82","rank":[78,102]},{"title":"Star appeal lifts a good political thriller","rating":7,"date":"7 February 2006","review":"Another John Grisham novel becomes an entertaining thriller that opens with the murder of two Supreme Court justices. A Tulane law clerk suspects that the killings are too much of a coincidence and suggests that a Louisiana oil magnate and the White House may be involved. Determined to find out the truth, the clerk's research puts her life in danger, which is clear enough when her law professor is killed. Julia Roberts spends most of the film on the run, dodging killers and murder plots. Denzel Washington is a reporter who get pieces of information from an unknown source and eventually Roberts and Washington team up to investigate the assassinations. The film has complicated twists as Roberts and Washington work together to stay out of harm's way as their investigation points its compass at the White House. The supporting cast is great as are all the tech credits and James Horner contributes a nice music score.","user":"NewEnglandPat","rank":[25,30]},{"title":"Hitchcock would have been pleased","rating":9,"date":"23 March 2006","review":"You gotta love Alan Pakula. His Pelican Brief is true to the source material but manages to complement it with artfulness learned from Hitchcock and the events portrayed in All The President's Men (also directed by Pakula).<br><br>The result is a thriller which never has to resort to the hackneyed or the obvious. Even the chase scene in a car park manages to be a little different.<br><br>He has casted brilliantly (perhaps Fletcher Coal should have been older?) but his masterstroke is commisioning James Horner to provide the score. At times sparse and at others boldly chromatic it jangles the nerves as Julia and Denzel duck and weave their way through a maze of unease.<br><br>A great way to spend two hours.","user":"hylinski","rank":[51,69]}]