[{"title":"I heard about this movie, but I didn't know that it would be THIS good....","rating":10,"date":"8 April 2000","review":"I knew what this film would be about before I rented it, but I'm stunned that it would be THIS good. Nothing against \"Saving Private Ryan\" or \"Shakespeare in Love\", but this film should have won Best Picture in 1998 and it was a shame that it wasn't nominated. It's an even bigger injustice that it did not get a nomination for best screenplay or cinematography.<br><br>In the hands of another writer, this movie could have been made as just a parody of 1950's sitcoms like \"Leave It To Beaver\" or \"Ozzie and Harriet.\" But this film isn't about how clichéd those series look decades later. It's about the false nostalgia for a past that never existed. We survived the past and we know that everything turned out all right. Because of this, we selectively choose our memories and weed out the unpleasant ones. That's why the past is sometimes seen as \"the good ol' days.\" Pleasantville does not represent how the 50's actually were but rather an idealization of what people THINK the 50's were---no one had sex, everyone got along swell, and life was fairly easy. Nothing could be further from the truth, and there are many film from that era which show how real people (even in suburbia) actually lived. This film argues that free will and choice is ESSENTIAL to life and that we should embrace freedom instead of fearing it. It isn't just about making out, but having the OPTION to make out.<br><br>Another reviewer claimed that this film was an attack on the 50's, but David and Jennifer could very easily have been dumped in the world of \"The Brady Bunch\", \"Gilligan's Island\" , or \"Batman.\" But setting \"Pleasantville\" in a 1950's sitcom allows for the brilliant metaphor of black and white versus color. Black and white photography is a stylized depiction of the universe, but unless you're color blind it's not the way you actually see the universe. When we first see Pleasantville's citizens, all of them are cardboard cut-outs of stereotypes. As they begin to open up and become real people, color seeps into their world. The catalyst seems to be the willingness to experience new sensations and become vulnerable. Jennifer has slept with lot of guys when she was in the normal world, so sex does not change HER into a color character. On the other hand, when she actually finishes a book (without pictures) for the first time in her life, THEN she becomes colorized. Similarly, David does not bloom into color until he breaks out of his aloofness and defends his \"mother.\" Compare the way he ignores his real mother at the beginning of the film to how he consoles and comforts her at the end to see how much David has changed.<br><br>I could go on and on, but I think you get the idea. There are a lot of films out there that are very entertaining and/or very moving--like \"Raiders of the Lost Ark\" or \"Titanic.\" Movies like \"Pleasantville\" which challenge the audience and force them to think are very rare, and should be treasured by the discerning filmgoer.","user":"Eddie C.","rank":[320,372]},{"title":"A brilliant fairytale..","rating":9,"date":"28 March 2001","review":"I thoroughly enjoyed \"Pleasantville\" from the 'Once upon a time' through the film fading to black.<br><br>The acting was top notch all around, as was the use of special effects; in very few films has colour been used so effectively that it can convey a story seemingly without help from dialogue or music.<br><br>I can see how some people would perceive it as merely another mouthpiece of liberalism, but I watched it twice, and I only noticed it attacking bigotry and censorship.  What was wrong wasn't that these people were living according conservative values, but that they didn't really choose those values in the first place!<br><br>I like the fact that the film was bold, and that it made its point as directly as it contrasted the black and white with the splotches of Technicolour.  While \"Pleasantville\" had little subtlety in its allegory, it was, like any good fairytale, beautiful in its simplicity.<br><br>Nine out of ten =)","user":"nchng","rank":[160,193]},{"title":"floored","rating":10,"date":"16 February 2003","review":"Some critics here are saying the movie takes itself too seriously - but I believe some people are taking it too literally. ... Saying that the topics that are addressed have no impact on society anymore, clearly misses the point. ... The 50s -- or more specifically, 50s TV -- is used as a metaphor, because of the way 50s TV portrayed life in America. ... Thematically, this movie is about \"Living Life\" to the fullest, whatever that means. More specifically, to live life to the fullest -- to truly feel \"alive\" -- you need to take the good with the bad. Sweeping things under the rug and just acting \"pleasant\" all the time, is no way to live. That's what Tobey McGuire's speech at the end to his \"real\" mother is all about. Bad things happen, it's part of life. Having passion brings with it positives and negatives -- but suppressing true feelings for the sake of \"pleasantness\" is an empty life. THAT is the key ... and that \"issue\" is everlasting to the human condition. <br><br>Another point: People fear change. This is universal from the start of time until the end of time. The film suggests that changing and growing as a society and as people -- even if scary -- is good. Just because the 50s were used as a metaphor for that, don't believe for a minute this isn't a universal issue that exists today and forever.<br><br>Another issue common for people critical of this film is the sexual issue. They say that Gary Ross is promoting sexual promiscuity, sex out of wedlock, etc...  Again, I believe it misses the point.  Is Ross suggesting that premarital sex is OK?  Yes, and I'd agree - and I'm sure there's plenty of people who don't agree with that, and that's OK too.  But, again, the sex is just part of the theme - used as a high-profile example to making the overall point about \"openness\" - and not suppressing one's feelings.  Note that the Reese Witherspoon character was already promiscuous, and her transformation was actually something completely different.<br><br>I can't make everyone like this film - I'll just say that, on a personal note, I was so floored by this film, I had to see it again the next day. That had never happened to me before, or since. Ross' commentary goes on to speak of everything I felt about the film when I first saw it. It was great to hear that his reasons for what he did, meshed exactly with how I took it. I had to write him a letter to tell him so - another thing I'd never done before or since.<br><br>This is not a perfect film. I liked its subtlety, but then the racism correlation, and the censorship stuff, got a bit more overt. The courtroom scene at the end is a bit cliche ... and I also agree with one poster who said that, to make the point about taking the good with the bad, we should've seen a bit more about the consequences of their actions.<br><br>\nThose are merely nitpicks in the grand scheme of things. This is a 10 out of 10.","user":"adamw_13","rank":[163,205]}]