[{"title":"Changed at the edges, but the core is still the same.","rating":7,"date":"20 October 2000","review":"Ten years after the first movie, James Belushi, one of the most gifted, and over looked light comedic actors of the last twenty years, returns as Detective Dooley for this movie.<br><br>If you are expecting more of the same from the first movie, you will be disappointed, but this is still a good movie. Realizing that all the Dog vs. Man battle of wills scenarios had probably been used up in the first movie, this one turns slightly more psychological in its approach as it concentrates on a criminal with a fixation with Dooley's recently deceased wife after she rejected his book, and blames Dooley for her death.<br><br>The script may not be the best, but the movie allows both Belushi and Christine Tucci to show their good acting ability, while still retaining enough of the light humour of the first movie to make it work, and the chemistry between the two stars is there for all to see.<br><br>An easy, light going movie, which, while maybe not worth a purchase unless you are a true fan of either the first movie or Belushi, definately worth a watch when it comes on TV.","user":"Bing-18","rank":[7,10]},{"title":"Let's get serious - NOT","rating":7,"date":"9 March 2002","review":"Arrrrrggghhhhhh, some people take life far too seriously!!!  Watch this film for what it is, sit back, relax and have a giggle.  The film does not take itself seriously, so neither should we.  If you like James Belushi, you will like this film.  If he is not your cup of tea - give it a miss.<br><br>I like James Belushi, so I liked this film.  So simple isn't it?? :-)","user":"ahodge","rank":[2,2]},{"title":"Entertainingly funny","rating":13,"date":"13 August 2001","review":"I don't much remember the first K9 movie, which I've seen once. I rented this movie out of pure curiousity and was not dissapointed. It is incredibly entertaining and funny at the same time. James Belushi is solid as a rock as always, continuing to show us why he is so well suited to light comedic movies. At his side is Mac, as Jerry Lee, his canine partner, who is incredibly talented and well trained and is responsible for some of the more funny moments in the film. Another interesting thing about this movie is that the plot is so different from the first movie. Whereas in the first movie it focused on the relationship between Dooley( Belushi) and Jerry Lee, this one focuses on the fact that Jerry Lee is getting old and is about due for retirement and Dooley's reaction to this. As well as that Dooley and Jerry Lee have to contend with a bad guy that has ties to Dooley and wants revenge. Quite entertaining and worth watching. 8/10","user":"The Watchers Apprentice","rank":[7,15]}]