[{"title":"Gets bashed WAY too much, way too unfairly!!","rating":7,"date":"30 June 2009","review":"Ha.......beware of the long rant of a hugely biased Bluth fan...<br><br>Fine, warned ya, didn't I? ^_-<br><br>First of all, I don't really see why people hate this movie so much. I don't see what's so bloody confusing about it....unless people are really that simpled-minded that they can't understand a plot as simple as \"a live-action boy joins the animated world in order to bring back a hero who can save them from darkness and destruction.\" That's it. ........yeah, what exactly is so hard to understand about that?<br><br>And.....they're criticizing the animation? LOL These same people who love American Tail and the Land Before Time are actually criticizing a film WITH THE EXACT SAME TYPE OF ANIMATION!? Seriously, use your common sense, people!! No, rather, use your EYES! It's the SAME!! Okay, fine, the live-action parts MIXED with the animation does look cheap. But it's old!! And of course it doesn't look as good as it did with Roger Rabbit! That movie was one of the most expensive movies ever made in all of film HISTORY!! Bluth didn't have that kind of budget, okay?! Besides, it lasts for all of twenty seconds, so suck it up and fast-forward if you hate looking at it so much, geeze!!<br><br>Don't believe all the bad reviews you have read on here. The animation is not horrible, the characters are not annoying OR ugly, the songs are not bad, and the voice actors are CERTAINLY not untalented! Believe you me, being a fan of animated classics from the time I was barely able to talk to now, (in my 20s) adults can appreciate this movie JUST AS MUCH if not more, than a child can. I have sat through BAD voice-acting, (early dubbed anime, anyone!?) horrible songs, terrible characters, awful, FLAT animation, the whole lot....and Rock-a-Doodle shines like a gem next to these. <br><br>Another reviewer on here just asked, \"Why watch this when you can be in a world with Aladdin, Beauty and the Beast, and Pinnochio?<br><br>My answer is simply this:<br><br>\"Because it's DIFFERENT and I'm freaking sick of those fairy tales that everybody's seen a thousand versions of before they have even reached the age of TEN, damn it all!\". The problem is, everyone's treating this as a Disney film when it's not. It's Bluth. Bluth is not Disney. He never WILL be. And I don't want him to be, either! See, this is why I adore Don Bluth so much and consider him to be the finest animator and director in America. Don Bluth's films are SO different, SO sophisticated, SO unique, SO non-cliché, and above all, SO magical. Yes, \"magical\" is really the best way to describe a Bluth film...and ever single one he's directed delivers the magic...so much that just from watching a couple seconds of random animation, you can immediately recognize that Bluth had something to do with it.<br><br>I will say that Disney can take you on a journey through storybooks...even through history, perhaps...but you still feel like you're just watching something.....artificial? It's meant to entertain, be bright, happy, make you laugh and dance then cry..then laugh some more...and then it's over. <br><br>But what Bluth does.....it's something much more valuable...much more surreal: he takes you on a journey through DREAMS. Yes, watching a Bluth film is very much like being in a dream. It's beautiful...yet bizarre...bright...yet dark...calming...yet terrifying.... Rock-A-Doodle is exceptionally GOOD at being a film that feels like a dream. Its awesome random, wonderful strangeness is right up there with \"The Secret of NIMH\" and my eternally top-favorite, \"All Dogs Go To Heaven\". And I can tell you right now: every single scene feels more memorable than an entire Disney movie. When I watched this movie just last week to relive my childhood, I found out that I appreciated it even MORE and that it was much more enjoyable to watch than the Disney movies that were created around the same time!!<br><br>I can understand that some people don't like this just because it's too...WEIRD for them...which I agree. It IS weird. But see, I love weird. I love bizarre. I love strange. I love being treated as an adult and actually having to use my brain.....during a KID'S film.<br><br>If you're tired of that same-old-same-old protective Disney bubble that doesn't really let you think outside the box and want something really interesting and out of the ordinary, PLEASE give this movie a look. You won't regret it. If you're a Bluth fan, THIS IS A MUST-SEE.<br><br>My rating for each aspect of Rock-A-Doodle:<br><br>Animation: 10 It's Don-freaking-BLUTH Characters: 8 All main ones are likable, unique, and fun. The Duke is a GREAT villain especially!<br><br>Sound: 10 It's a musical of course! Not all the songs are given attention like in most musicals though. Some are very short to give you a short laugh or two and some just serve as background music while main points about the characters are being pointed out to you. This is refreshing for those who get tired of song after song in animated movies.<br><br>Story: 7 There's a plot hole or two, seemingly but based on what's revealed at the end, that's entirely excusable!! (and all the critics totally ignored this!!) <br><br>Voice-actors: 10! Nothing to complain about here! Ganger's (Edmond) childish voice is adorable, Duncan (Peepers) and Deezen (Snipes) are priceless, Reily's (Hunch) hysterical, Campbell as Chanticleer just plain rocks and Chris Plummer should have gotten an award as The Duke because he's outstanding.","user":"chiibiprincess","rank":[13,14]},{"title":"my outlook","rating":7,"date":"7 July 2006","review":"if children's movies were meant to be judged the same way that adult movies are then we would have nothing that children could grasp with there imagination. this film had more or my friends, and cousins glued to the TV than any other children's movie i have seen and i have seen a lot of them. this film has imagination, it has color, it has a good story, it tells the tail of the King himself Elvis Arron Presley in a way. this film was one of my favorites that i ever saw as a child and no one will convince me that it wasn't a good film considering that this film helped me pass time on both good and bad days. it is at least deserving of some credit for the fun filled story contained in it. lighten up people children's films are not designed around being able to entertain people our age as would movies that we would normally comment on. at least i don't treat children's films that way. a good film for children of all ages.","user":"The_Juggalo5588","rank":[17,20]},{"title":"Could have been so much better!!","rating":4,"date":"1 April 2006","review":"First off, I have to say that I really like the idea of Rock-a-Doodle. The basic story of the rooster having to save his farm from eternal darkness and rain by crowing the sun up could have made for such a great movie. But I feel that, as it was, it wasn't nearly as good a movie as it could have been.<br><br>A huge part of my problem with this movie was the main character, Edmund. This kid/cat is so darn annoying. His speech impediment got very old very fast, and it just felt like he was trying way too hard to sound cute. Also, as another reviewer pointed out earlier, he belabored to death the fact that he was \"too little\" to do pretty much anything, which became irritating.<br><br>It was also bothersome that this movie couldn't decide whether it wanted to be a full-blown musical or not. The Chanticleer/King songs were fine, because they were part of the whole singing rooster story. But it seemed that the other random songs were pretty unnecessary. The owls' songs were bad enough, but did they really feel the need to have the bit with the bouncer toads' song?? These random musical numbers felt like they came out of some particularly bad Gilbert and Sullivan operetta. If they really wanted to make this movie a musical, they needed to have some real full-length songs instead of those short musical snippets given to the villains.<br><br>But by far, my biggest problem with this movie is that it's just not very good at storytelling. It was fine that Patou (Phil Harris in his last role!) narrated the story. However, at times, they relied too much on the narration to tell us things instead of showing us. This is especially true in the whole Goldie subplot. Patou told us that a) Goldie was a lot smarter and nicer than she seemed at first and b) that she was really falling for Chanticleer although she was only supposed to fake it. It really would have helped Goldie's character development if there had been scenes where she was gradually acting smarter and nicer. And the movie would instantly have been better, I believe, if there had been a scene showing the moment where Goldie knew that she was in love with Chanticleer for real instead of just having narration. As it was, it felt like Goldie was just tacked onto the movie so that Chanticleer could have a love interest.<br><br>There's a good movie somewhere in Rock-a-Doodle. And I won't deny that it was a special part of many people's childhoods. However, for the reasons above (as well as others I don't care to bore you with), it just didn't live up to that potential, and turned out to be just another mediocre-to-bad kids' movie.","user":"sngbrd39","rank":[25,32]}]