[{"title":"A classic fairy tale!","rating":27,"date":"27 December 1998","review":"I really think people who describe this as a comedy or even a horror comedy are missing the point - it's a classic fairy/folk tale, right down to the theme of the kid having to earn manhood and a \"real name\" by doing a heroic deed. Wicked step-parents, hidden treasure (gold coins, even!), creepy house with secret passages and monsters in the basement, captive maiden to be rescued, innocent villagers held in slavery by evil (land)lords - it's all there!  I know this could be said of a lot of fantasy/horror films, but this one seems to be more clearly derived than most.  Loved it!","user":"angelynx","rank":[90,106]},{"title":"Wes Craven's masterpiece favorite horror film of mine - Home Alone only for adults I love it to death!","rating":10,"date":"26 October 2016","review":"Wes Craven, the director of The Serpent and the Rainbow and Shocker, locks you inside the most terrifying house on the street. The People Under the Stairs (1991) is Wes Craven's masterpiece along side A Nightmare on Elm Street, New Nightmare, Scream, Shocker and The Serpent and the Rainbow. This is a Home alone for only adults. I wish I would see this movie as a child, but sadly I haven't. I never knew about this movie or that it exists. I just realize something Home Alone 2: Lost in New York copied the scene from this movie. When Kevin throws a brick on Marv that scene was copied from this movie in which Fool throws a brick on man's had in the attic. This is a horror comedy that it is well acted, well written and really incredible awesome! I love this film to death! I own it on Blu-ray in my collection and I still love it. This is a great horror movie. Very creative and interesting story line along with characters that are very interesting, at times, very comedic. This movie is one of Craven's best I highly recommend this.<br><br>This film is in my top 10 Wes Craven favorite movies and it is my fifth favorite movie from Wes Craven that I love it to death. Starring Brandon Adams who played Jesse Hall in The Mighty Ducks 1 and 2 movies. Everett McGill from Silver Bullet and Under Siege 2: Dark Territory. I saw this on demand and I thought it was well played out although the parents were just plain freaks in their own way. The story line was just excellent and the settings gave it more of an eerie feel to it, although the children were an excellent addition, the whole beginning scenes really didn't need to be in there.<br><br>Plot: Two adults and a juvenile burglar break into a house occupied by a brother and sister and their stolen children and become trapped. Trapped inside a fortified home owned by a mysterious couple brother and sister, a young boy is suddenly thrust into a nightmare. The boy quickly learns the true nature of the house's homicidal inhabitants and the secret creatures hidden deep within the house.<br><br>I love the story, the idea from richer vs poor, you have a lead that it is a kid Brandon Adams is the star and the hero of the film. That is very unique, it is very unique. In every neighborhood there is one house that adults whisper about and children cross the street to avoid. Now Wes Craven, creator of \"A Nightmare on Elm Street\" takes you inside.<br><br>I love this movie to death: It is different than Home Alone. A young boy breaks in to a house by the landlords to steal the golden coins to support his poor family including his dying sick mom with his partner/ sister boyfriend Leroy (Ving Rhames) unaware the house is full of booby traps and no one get's out, no one ever has. Fool has to fight for his life while it is impossible to get out of the house because he is locked from inside. You have full of booby traps, monsters in the basement, ugly mad dog and two psychos in the house chasing fool which is scary. I think Kevin (Macaulay Culkin) would s**t in his pens, if he would be in this house. A.J. Langer is absolutely gorgeous, awesome in this movie seriously she is so beautiful and gorgeous that my jaw drop. <br><br>I love the scene in which Leroy defends Fool and shouts to Fool \"run Fool\" when brother and sister killed him with a shot gun. It also has a heart. Another scene that I love is after Fool escapes from the house later he learns the secret about the landlords, he comes back to the house for Alice who he gave her a promise. The characters, especially the main hero are decent written by Wes him self. <br><br>This movie is intelligent and really brilliant. You have to put brains in this movie, because it is so intense. Brandon Adams was fantastic as the main hero Fool. Everett McGill as the psycho brother was great and creepy in a lethal, while Wendy Robie was a great psycho sister in the house.<br><br>I also love the music song Do The Right Thing by Redhead Kingpin And The FBI. Wes Craven directed this movie perfectly. His script was perfect and the direction locations were fantastic in the movie. Wes Craven for me was a master of horror and I miss him so much. The People Under the Stairs is a classic horror film and I really do wish I would have watch it as a child.<br><br>R.I.P. - Wes Craven (1939 - 2015) I really miss you and thank you for all the Freddy movies, thank you for all horror franchise and movies like are: A Nightmare on Elm Street, New Nightmare, Scream, The Serpent and the Rainbow, Shocker and The People Under the Stairs. Thank you for all your work Wes. I love you so much I wish you could done more horror movies, I really love them.<br><br>This movie get's my perfect 10/10 for been one of my favorite Wes Craven horror movies of all time. <br><br>The People Under the Stairs is a 1991 American horror film written and directed by Wes Craven and starring Brandon Adams, Everett McGill, Wendy Robie, A. J. Langer, Ving Rhames and Sean Whalen.<br><br>10/10 Grade: Bad Ass Seal Of Approval Studio: Universal Pictures Starring: Brandon Adams, Everett McGill, Wendy Robie, A. J. Langer, Ving Rhames, Bill Cobbs, Kelly Jo Minter, Sean Whalen, Jeremy Roberts Director: Wes Craven Producers: Shep Gordon, Wes Craven, Marianne Maddalena, Stuart M. Besser, Dixie Capp, Peter Foster Writer: Wes Craven Rated: R Running Time: 1 Hr. 42 Mins. Budget: $6.000.000 Box Office: $24,204,154","user":"ivo-cobra8","rank":[35,40]},{"title":"Ambitious, Exceptional, Well-Written Sociological Horror Flick","rating":7,"date":"7 August 2005","review":"Fool is a ghetto kid about to evicted who decides to break into the house of the greedy landlords and steal enough to pay the rent. Big mistake - the landlords turn out to be a loony-toon brother-and-sister act who live in a labyrinthine mansion and literally eat little boys for breakfast. Can Fool get out alive, rescue the imprisoned Alice and save his neighbourhood from the bulldozers ? This is a terrific film, one of Craven's best, and one of a handful of great little horror movies made in the late eighties / early nineties by Shep Gordon's Alive Films company. It works wonderfully on several different levels; it's basically a great horror-adventure film with lots of action and scares, but it's also a weird culture-clash drama, a mythic adventure with a princess to be freed and golden treasure at the end, and even a lefty citizens' rights story. It's gloriously all over the place. The cast are excellent, especially young Adams, who holds the movie squarely on his small shoulders, and McGill and Robie (who played husband and wife on the TV show Twin Peaks) as the thoroughly psychotic Mom and Dad. A great visceral movie with lots of horrible moments - Adams battles with the vicious rottweiler, McGill gleefully chewing bits of Rhames' corpse, the ominous piles of dead flies in the kitchen. The art direction is tremendous; the gigantic, gruesome Bad Place of a house is horrifically cavernous and foreboding, crammed full of crawlspaces, archaic plumbing, ghoulish brickdust and crumbling plasterboard. Full of intriguing ideas and sociological riffs (gun culture, S&amp;M tendencies, incest, racism, class exploitation), this is a movie bursting at the seams with cinematic creativity. Brilliantly written and directed by Craven, this is a fine example of the rare breed of multi-layered movie I adore which is automatically derided by snooty film critics who want to keep entertaining films and intelligent films mutually exclusive - may they burn in hell !!","user":"ShootingShark","rank":[33,38]}]