[{"title":"Hilarious Midgetsploitation from the crazy 70s!","rating":8,"date":"16 February 2011","review":"If you're looking for a cheap laugh, then look no further than this film! I was fortunate enough to find this obscure turkey in the back of an old second-hand store, and upon viewing the cover, consisting only of a picture of Christian Anders looking angry with the title in huge lettering across, reading \"Djævelsk Terror\" (Devilish Terror), and then the description on the back: \"One man alone against a perverted midget and his gangsters\", I had to buy it! <br><br>The story is roughly as follow: The ambitious karate-teacher, Frank Mertens (played by German folk-singer Christian Anders) only wants to run his own small karate-school in peace and tranquility, preaching non-violence in the name of his deceased master, with the help of his secretary Ingrid (played by the Spanish actress Maribel Martín). But with the arrival of the evil, drug-dealing and martial-arts teaching midget Van Bullock (played by Deep Roy of \"Charlie and the Chocolate-Factory fame in one of his very first roles), everything changes. Van Bullock wants to place his own karate-school right next to Frank Mertens' karate-school, but doesn't like the competition, so he tries to buy Mertens out, but he refuses. After that, Van Bullock sends some of his goons after Mertens to beat him up, to no avail. Then he tries more peaceful negotiations, but they fail miserably yet again, and he apparently has no choice but to eliminate Mertens from the face of the earth. Moving his own school to another part of the city, or accepting fair competition is not an option! <br><br>With the help of his trusty, neutered (!) henchman Komo (played by notorious B-movie actor Fernando Bilbao aka Fred Harris), Van Bullock beats his way to whatever he wants, and even scores with the most sexy ladies imaginable, including his mistress Cora (played by the Croatian/German actress/singer Dunja Rajter). But Frank Mertens is the one man that cannot be controlled, so Van Bullock frames him for a crime and Mertens then goes to jail. What happens next is totally ridiculous, as Mertens more or less turns himself into a John Rambo-clone and breaks out of jail, going after the bad guys.. mind you, this was made BEFORE \"First Blood\", so every reference to Rambo is actually non-existent, and the Rambo-films actually should pay THIS film homage instead! <br><br>Overall, this was a pretty bad movie, poorly directed, poorly acted, and (especially) poorly written! But it does have some redeeming points, such as having a couple of German folk-singers in the lead as action-stars, and Deep Roy giving a hilarious portrayal of a hysterical and egotistical gangster-boss. At one point, we see a montage of Mertens training to funky 70s music, and some of his routines are - to put it mildly - a bit bizarre, as in wearing tight leather-shorts with straps attached, and speed-jumping up and down with only his belly touching the floor, etc. The ending of the movie was particularly weird, as Mertens runs around in the woods fighting Van Bullock and Komo, and at the same time also fleeing from the police, practically rendering him an outlaw! <br><br>But when all is said, I have to give this a 5/10, as it was very entertaining, and I laughed quite a lot while watching this. However, I wouldn't recommend this film to people who can't appreciate movies that are \"so bad they're good\", as this one clearly falls into that category.","user":"KnatLouie","rank":[7,7]},{"title":"Cant be more B than this","rating":4,"date":"9 September 2007","review":"he he...this movie is fun. Its so bad you cant believe your eyes. The strange part is that Christian Anders (both music and director)look like he have martial art skills. That training sequence is funny as hell. The bad guy role is also hilarious a dwarf that looks like a child with mustache his name is Van Bullock. He want to buy the place where Christian Anders main character has his training school. Think bad Asian martial art movie and add some German cheese and you have \"Roots of Evil\". This movie is worth seeing cause of the cheesy music the serious acting by Christian Anders. ....................................................................","user":"terjeruy","rank":[8,9]},{"title":"Largely so-bad-it's-good martial arts from Germany","rating":4,"date":"4 November 2016","review":"\"I am going to get a chess set out of the bones of his skull.\" A priceless moment of dialogue from what is for the most part a largely worthless production, ROOTS OF EVIL stands true as the first (and perhaps only) German-made martial arts epic in the world. Filmed in Madrid with a cast of supporting Spanish actors, this marks the one and only major starring role for German folk singing legend Christian Anders, who unsurprisingly penned the film's music and script as well as starring and co-directing. Anders is a Bruce Lee-wannabe film star whose idea of acting is to copy the acting and style of his hero as closely as possible. Sadly, he lacks both the charisma and skill of Lee, instead coming across as a slightly pathetic but nonetheless earnest fighter who attempts to carry the film on his wooden shoulders. It doesn't work, but the effect can be hilarious.<br><br>The plot is clichéd and tired from the very beginning. First off we see Anders training in his own fight club, where we see what a nice guy he is by being friendly to his female secretary and helping out those who are training. Soon enough a dwarf, Van Bullock, arrives in the neighbourhood - a red carpet is thrown from his car - and is dismayed to see a rival karate school in the area where he himself had planned to set up shop. Instead of choosing another location like 99% of people would, he instead tries to get Anders to move elsewhere. When his bribes and offers of power fail, Van Bullock tries harder tactics like sending a squad of goons to the local graveyard where Anders is paying his respects to his deceased teacher.<br><br>After repeatedly failing, he ends up planting drugs in Anders' coat and calling in the cops. Anders is imprisoned in jail indefinitely. At this point the mildly watchable film gives up the ghost completely with a total lack of plot or action for approximately half an hour. Finally, Anders learns that Van Bullock is the one responsible for his incarceration and the death of a girlfriend, so he breaks out of jail (in a scene that would impressive even John Rambo) and interrupts Van Bullock's orgy at his country mansion. The police arrive and force Anders to flee wounded into the woods, where Van Bullock and his bodyguard follow to finish him off.<br><br>The film is poorly-plotted and the story is pretty uninteresting, offering no attempts at humour to liven the leaden dialogue. The action sequences in themselves aren't bad; obviously the fighters aren't as skilled as they would be in eastern productions, but they move along nicely and at least provide something worth watching. Viewers hoping for sex and violence will be sadly let down by this film's politically-correct attitude. There's an orgy, yes, but it has to be the tamest orgy ever filmed - one woman struggles to keep her flimsy dress on throughout and the scantily-clad female cast members aren't really that appealing. The action is virtually bloodless, and the only nasty bit is a double leg-breaking at the climax. One good stunt involves Anders being thrown through a first-floor window and rolling over the roof of a car, a surprisingly well-edited and staged sequence in an otherwise below average production.<br><br>Scenes of Anders training hard dressed in only his underwear are repulsive and much of the film's entertainment value comes from overacting dwarf actor Deep Roy, nowadays an established player in Hollywood. Check out the hilarious climax in which he is tossed unceremoniously into a river by our erstwhile hero! ROOTS OF EVIL has promise and is occasionally hilarious in a so-bad-it's-good way, but long stretches of nothingness test the patience and make it sometimes a chore to sit through.","user":"Leofwine_draca","rank":[4,4]}]