[{"title":"A rich tapestry  2 hours flew by","rating":5,"date":"5 April 2003","review":"The discovery of a skull and a sheriff's badge on a disused military firing range prompts Sheriff Sam Deeds to investigate.  Sam has long lived in the shadow of his father Buddy, himself the sheriff at one time.  However clues point to the fact that the skull may belong to Charley Wade, the corrupt sheriff who `vanished' to Mexico when Deeds challenged him many years prior. However when Sam begins to ask questions that go deeper than the legends, he finds secrets within the border town that hit very near home.<br><br>Having just watched The Hi Lo Country (a modern day western with a sprawling story but focused on one thing), I was put in mind to watch Lone Star again. Lone Star is easily the superior film and is a rich weaving of many characters and stories all around one event.  The one event is the uncovering of an old murder (possibly) and this central investigation holds the attention easily.  Within this investigation and the lives that Buddy affected we are shown a lot of subplots  some followed through, others just giving us enough background to understand the characters.  All of these work very well and as a result you don't feel like the film is wandering when it moves away from the investigation by Sam.  The subplots are so well translated that we are given a lot of back story to complex characters in a very short time.<br><br>For the script to be able to create so many characters that feel real and that have meaningful things going on is impressive.  That it makes them all work is amazing and is due to Sayles both writing and editing.  As director he is great as well, avoiding the washed out desert feel many `Mexico related' films have and instead goes for richer colours that reflect the rich mix of communities that are in his story.<br><br>The acting is faultless all round.  No one actor stands out regardless of screen time simply because no one goes over the top and everyone realises they are playing part of a story  even Cooper (realistically the nearest thing to a lead actor) plays it down rather than taking the film over. Morton is good even if his character is the least connected to the investigation, McConaughey is strong despite being little more than a cameo, likewise with Kristofferson.  McDormand has a small role but is very impressive as Deeds' ex-wife.  Elizabeth Peña, so often dumped with almost token Espanic roles is given a real good part and works with it well.  I could list them all, however if any one person stands out it can only be Sayles himself  he takes all the strands and brings them together.  I watched a 90 minutes comedy earlier the same day that had dragged.  At 130 minutes this simply flew  it is that engrossing.<br><br>Overall some will find it too slow, too character driven, sadly some will just not sit through a good story if that's all there is to it (all!).  I think this was reflected in poor box office at the time (comparatively poor anyway).  But those who have seen it will generally love it  if only more people would watch it!  A final word on the film  the ending is shocking and sensationalist on paper and a lesser man would have made a big deal out of it.  Sayles simply ends the film softly and leaves us the audience to take what we will from it.  Low key from start to finish  I can't praise it enough.","user":"bob the moo","rank":[74,79]},{"title":"The sins of the fathers come back to haunt","rating":31,"date":"31 January 1999","review":"John Sayles' direction of this film reminded me of Hitchcock in that I was always aware of the director's style and I enjoyed it every bit as much as the acting and the story. Like \"Godfather,\" this is a tale of families and how the sins of the fathers cast their shadows over the generations. To illustrate the connection, Sayles will slowly track his camera from a conversation in one part of a room to another part of the same room where characters who lived 25 years earlier are conversing. The years have passed, we realize, but all the characters, even the dead ones, are in this together. The technique may sound strange, but it works magically. And another thing: I've always thought Kris Kristofferson was a better singer than actor, and a better songwriter than singer. But in this film he turns in an outstanding performance as a very very bad Texas border town sheriff who disappeared years ago and whose bones have just turned up in the desert. At least we think those are his bones, and to solve the puzzle, the current sheriff, son of the man who became sheriff when Kris disappeared, must dig further than he wants into the town's secrets. And once again, knowing how the film ends makes subsequent viewings just as fascinating as the first.","user":"Bill-308","rank":[53,56]},{"title":"Sayles' Masterpiece","rating":10,"date":"13 December 2000","review":"I just bought this movie on DVD and watched it for the first time in a couple of years, and once again it amazed me. While most scripts stumble recklessly from one hackneyed plot device to another, \"Lone Star\" flows like a steady, winding river, never letting the viewer see too far downstream. The spine of the film is Sherrif Sam Deed's investigation into a thirty-year-old murder, yet this story is quickly absorbed by many finely scripted subplots and an overall theme on the futility of trying to escape history.  While most directors can't help but show off when using flashy camera movement  and jumps in continuity, Sayles employs such a subtle directing style that his leaps in time and location are seamless.  Sayles fleshes out his script with subplots on racism, national pride, censorship, generation gaps, politics, social revisionism, and on and on.  Most directors don't tackle this many topics in a career, yet Sayles juggles them all in one film without jamming them down the audiences' throats.  If the subplots in Sayles' \"City of Hope\" were connected like a series of dominos, here they are gently woven together like a colorful, well-worn Southwestern quilt.  The love story between Chris Cooper and Elizabeth Pena is both wistful and steamy.  The film's social conscience is compelling.  The father/son conflict between Otis and Delmore Payne (Ron Canada and Joe Morton) feels totally realistic.  The dialoge is concise and insightful. Fate hangs over every character and every moment.  Plus \"Lone Star\" has one of my favorite \"final scenes\", one that perfectly sums up the ironies of the film.  It is simply one of the best movies I have ever seen.","user":"ProfessorFate","rank":[102,111]}]