[{"title":"Life is beautiful. But...","rating":9,"date":"9 July 2000","review":"The French writer-director Bruno Dumont achieves something rarely accomplished since TAXI DRIVER and ERASERHEAD: a way of looking at the world entirely afresh. Unlike those movies--or the recent, Expressionist CLEAN, SHAVEN--Dumont doesn't distort the physical world, make it elastic or dreamlike. But he somehow makes us feel the world is being recorded by a very wise child from another planet. Everything, absolutely everything, from human behavior to wind rippling over a field of grass, is seen as never before. Ezra Pound's injunction to \"make it new\" is stamped on every frame.<br><br>Pharaon is a slow-witted police superintendent who is anything but pharaonic. He had a girlfriend and a baby, now dead. (We are not told how.) He is friends with Domino, a big-boned, sensitive, slatternly woman next door, and Joseph, her handsome beau, with whom she seems to never stop having sex. In their small town, a little girl has been raped and murdered. Pharaon pursues this case, as he pursues a sort of inarticulate love for Domino. Along the way, a light dawns in Pharaon--a dreadful light. He becomes sensitive to the suffering of all living things--a pig hurt by the suckling of her young, all the way to a motorist getting a beating outside police headquarters. The effect this has is to create a kind of moral schizophrenia in Pharaon: he can filter out nothing. Like an overlap of Raskolnikov and Prince Mishkin, Pharaon takes both the world's sin and sufferings on his back.<br><br>But this gives only the barest outline of the experience of L'HUMANITE, which is not about its plot. Indeed, the relationship of Dumont's handling of the materials of cinema to the story itself is unique in my experience of narrative moviemaking. Like Abbas Kiarostami in his recent work, Dumont uses the landscape not to illustrate the story, but to propose a dialectic against it. Where the landscape acts as an argument for life in Kiarostami's TASTE OF CHERRY, here it does something else. It vibrates with feeling. In its childlike gaze at the hardness of people and things, L'HUMANITE tries to get at the shifting feelings underneath--the emotions and sensations so elusive there are no words for them. The movie proves that literary means--finding names--are unnecessary. Dumont finds aural-visual-rhythmic means to voice those emotions.<br><br>His techniques can be daring, appalling. Pharaon, gradually overwhelmed by the world's thousand and one cruelties, starts to spontaneously embrace (relative) total strangers, in scenes one can imagine giving audiences giggles. Dumont doesn't care. <br><br>L'HUMANITE is the kind of movie that, while you're watching it, you feel can drive you crazy in places, but which you know you'll live with and re-play in your head for the rest of your life. And Cannes naysayers to the contrary, all the performances in this movie--all of them, down to the tiniest--are perfect.<br><br>A note: I would like to thank the other people who wrote about L'HUMANITE on IMDB. With no other movie have I felt I learned so much by reading other people's responses, and particularly noting the details they chose to underline. For the authenticity and unabashedness of everyone's responses, I am truly grateful.","user":"nunculus","rank":[52,65]},{"title":"Not for everyone maybe, but for me.","rating":29,"date":"29 March 2000","review":"It is said that Humanite is not for everyone. And i would surely support that claim since I am a steward in the Tel Aviv Cinematheque and had to get up, about every two minutes to open the door to someone sneaker.<br><br>Still, I managed to get quite a clear impression of the film which is in my opinion a superb one. Although many people find themselves puzzled by the characters (virtually everyone in the show i attended came out of the cinema looking almost personally insulted by the film) i think that if you know and love Dostoevsky's books you won't find them so hard to understand. Pharaon is simply Prince Mishkin. He is assulted by the bluntness and cruelness of existence and the crime he tries to solve - but is overwhelmed with humility, love and compassion to the world. While his friend make love in a way that seems almost like a rape he makes love to the world, to the clods of the earth. When he rides his bicycle his upper body seems to be moving as if he was making love. But most of all he feels diligent compassion to the world and it's assaulters. The film shows the violence everywhere. Pharaon sees this violence and with his deep gaze manages to disarm it (with protesters and with Domino). I think that Pharaon is a really great acting performance. Pharaon like Mishkin in Dostoevky's notebooks 'sees not in the faces of people but in their hearts.'. The investigation taking place is like an investigation of the inner self. Of the human soul, of humanity. It's a category against Humanity and Pharaon's who is the categor manages to find compassion to humanity. Its sort of like an 'apocalypse now' in rural france.","user":"ido_h","rank":[33,42]},{"title":"An involving and disturbing film","rating":12,"date":"12 May 2003","review":"\"The power of cinema lies in the return of man to the body, to the heart, to truth\" - Bruno Dumont<br><br>In L'Humanite, by Bruno Dumont (La Vie de Jesus), Pharaon de Winter (Emmanuel Schotte) is a Police Superintendent called upon to investigate the murder and rape of an 11-year old girl. Flaunting almost every cinematic convention, the film is not about solving a crime but a 2 1/2-hour poem of mood, time, silence and spirit. Set in northern France in the director's hometown of Bailleul, the characters are unglamorous members of the working class. Dumont devotes long stretches of the film to simply observing Pharaon going about his life: eating an apple, tending his garden, watching a soccer game on television, interacting with his mother, or being a friend to his neighbor Domino (Severine Caneele), a rugged factory worker and her obnoxious bus-driver boyfriend Joseph (Philippe Tullier). He is an unlikely cop, a passive, stoop-shouldered, and empathetic man who would sooner kiss a prisoner on the lips or stroke his neck as browbeat him. Pharaon sees the suffering of the world and wants to hold it in his hands and stroke it. Schotte's performance is so expressive that his best actor award at Cannes was criticized because most people thought he wasn't acting, just being himself. <br><br>As the film opens, a man is walking in the distance alone across a grassy hill. Suddenly as the camera moves in for a close-up, he collapses in the mud and just lays there for a while. Is he dead or alive? Did he commit the crime? In the next scene, he is sitting in his car listening to harpsichord music and we discover that he is a policeman talking in a barely audible voice to his superior. The film cuts away to the battered body of an 11-year old girl, her torn and bloody vagina graphically shown as the police gather. Pharaon maintains the same anguished, enigmatic look on his face throughout that makes us uncertain if he is the murderer or the Second Coming of Christ. We know very little about him except that he \"lost\" his wife and child a few years ago, but it is never made clear whether he lost them or they lost him. Signs of passion or involvement are rare but come with a sudden ferocity, as when he is walking across the crime scene and starts to scream at the top of his lungs, a sound drowned out only by the passing Eurostar train. <br><br>L'Humanite is an involving and disturbing film that you cannot feel lukewarm about. It is profoundly moving but often agonizingly slow and virtually unwatchable in some of its graphic details (you may never want to have sex again after watching these mechanical exercises). The climax of the film is as perplexing as the beginning with an ambiguous resolution that I'm not quite sure what to make of. What I do know is that I felt as vitally alive watching this film as I did the first time that I saw Leolo by Jean-Claude Lauzon. L'Humanite is a breath of fresh air on the turgid cinema landscape and Dumont is as honest and challenging a director as I've seen in quite a long time. His film continually forces us to question what we are looking at and, as the title suggests, keeps bringing us closer and closer to the core of what makes us truly human.","user":"howard.schumann","rank":[20,25]}]