[{"title":"Don't look at the votes rating","rating":8,"date":"1 October 2001","review":"This is actually a very funny movie, one of Steve's funniest movies - up there with Father of the Bride. All the characters, Dan Akroyd, Phil Hartman, even an appearance by Chris Rock make this an extremely enjoyable movie.  The Hover Tank was hands down the funniest part.  Steve is full of laughs in this movie and acts out the character of Sergeant Bilko superbly. I have watched this movie at least four times and I was still laughing all the way through.  This is in fact one of my all time favourite comedies. I have never seen the original and perhaps my judgement of this movie is therefore altered.  Yet if you have never seen or even heard of the original and you like Steve's work then you will surely like this.  Don't look at the votes rating I'll give this 8/10.","user":"Numero Uno","rank":[60,74]},{"title":"Funny!","rating":5,"date":"5 August 1999","review":"This movie was under-appreciated in its theatrical release.  In fact, it's a rarity these days.....a lightweight comedy that doesn't insult your intelligence.  Some critics carped because it wasn't like the classic TV show, but it would have been hard (and foolish) to try and duplicate the genius of Phil Silvers.  Steve Martin does a fine job of putting his own unique stamp on the character of Ernie Bilko and he's surrounded by a good supporting cast with many familiar faces.  The story isn't the most intricately plotted in the world, but it doesn't have to be.  The gags and one-liners come fast and furious and there are plenty of laughs. <br><br>\nA pleasant comedy that's good for all ages.","user":"G-Man-25","rank":[31,38]},{"title":"Very funny movie for people who possess a sense of humor","rating":9,"date":"4 March 2009","review":"Seems to me like most of the negative votes come from fans of the original show.<br><br>I am glad I never saw it, because I think this is one of the funniest movies I have ever seen. I love Bilko's character. Martin plays a charismatic, scheming yet kind hearted con artist.<br><br>I love his comic timing in this movie. It's definitely my favorite Steve Martin role.<br><br>I think part of the reason I like Martin, is for the same reason I like characters like Bugs Bunny. He always comes out on top, and is usually in complete control of a situation. I love that type of role - who does not want to be more like a Sgt Bilko?<br><br>I thought almost every scene was funny. I liked pretty much every actor in it. It's not for serious people. I sometimes wonder why serious people bother to rate comedies at all - some people were born with no sense of humor, from what I can tell.<br><br>For those people who dislike (or are bored of) put down humor, sex humor, or gross out humor, this is none of those (Not that I don't mind some of that, but a change of pace is always welcome.)<br><br>It's a politer, lighter, silly humor almost cartoonish, in a good way.<br><br>I have seen this movie at least three times, and still laugh at it.<br><br>So if you are not a fan of the TV show, I think you will like this in spite of the shockingly low review of this movie.","user":"imdb-21622","rank":[26,32]}]