[{"title":"Run-Of-The-Mill Slasher Sequel, But Pretty Entertaining.","rating":6,"date":"4 June 2007","review":"\"I Still Know What You Did Last Summer\" follows Julie (Jennifer Love Hewitt), who is still suffering from the memories of her friends' murders by a vengeful fisherman who she and her friends had accidentally hit with their car and disposed of his body, thinking him to be dead. Her college friend, Karla (Brandy Norwood) wins tickets to the Bahamas via a radio station contest, so she, Karla, Karla's boyfriend, Tyrell (Mekhi Phifer), and a friend Will, head off on vacation. Meanwhile, Ray (Freddie Prinze Jr.), Julie's ex-boyfriend, has an encounter with the fisherman again, and heads to the island to save Julie. But soon enough, bodies begin to pile up on the mostly-deserted island (which is currently in it's storm season) all around Julie and her friends, and it seems the fisherman has returned.<br><br>I considered the original \"I Know What You Did Last Summer\" to be a fairly good slasher movie that evolved during the late '90s. It had a nice revenge-laced premise about teenagers who had to pay the consequences for their mistakes at the hands of a psychotic fisherman, and it was very well done in comparison with most slasher movies of that era. This sequel popped up only a year later, and while it may be very unoriginal, it's still entertaining. In terms of story, the idea was well put together, and the tropical, stormy Bahaman island was the perfect setting for this film to take place, and a nice change from the gloomy coastal town the previous film was set in. I knew a sequel was coming, after the first film succeeded well with audiences, it was nearly inevitable. The violence factor is much more gratuitous in this sequel, it's gore galore for this movie, which wasn't surprising. It seems that way for a lot of horror movie sequels.<br><br>Also, being no surprise, this film is almost beyond cliché-ridden. Typical horror set-ups, scares, and character stupidity is present throughout the course of the movie. It's unrealistic a lot of the time, and there are plot holes everywhere, so in that sense, it's a bit of a mess. But on the other hand, despite all of the unrealistic events, I have to admit that this is an extremely entertaining movie. Jennifer Love Hewitt and Freddie Prinze Jr. reprise their role, and Brandy Norwood and Mekhi Phifer play her lively friends. Jennifer Esposito (whose career hadn't quite taken off yet) also plays a worker on the island who the gang teams up with when the fisherman begins to off the island's population. The acting was nothing more than average at best, but it was tolerable (nothing too bad, I have seen much worse). But besides, what can you expect from this type of flick? The film ends with one of those \"gotcha!\" jump scares quite similar to the ending of the original, and puts a close on this series (unless you count the 2006 direct-to-video sequel that follow this) on a rather silly but fitting note. The entire movie is a little far-fetched, but so what?<br><br>Overall, I'd advise anyone who is tired of your run-of-the-mill slasher movies to avoid \"I Still Know What You Did Last Summer\" like the plague, because I can guarantee that they will be sorely disappointed. But for those who enjoy some cheap horror entertainment every once and awhile, this clichéd little slasher sequel is an entertaining way to spend a couple of hours, but don't expect to take any of it seriously. 6/10.","user":"drownnnsoda","rank":[18,22]},{"title":"Pretty much a run of the mill slasher stalks teen flick.","rating":15,"date":"15 November 1998","review":"The first \"I Know What You Did...\" film had a plot to go with the stalking and the suspense. The follow-up film has no story, just your standard slasher stalks and kills teens....as well as anybody else in the film.<br><br>However, that said, it still was fun to watch, although maybe a little too graphic for my taste in a couple of spots. Unlike many of the other posted comments, I found Brandy's performance to be very natural and entertaining and of course Love Hewitt is nice too look at too.<br><br>The Mekhi Phifer character was too much of a boor and I kept hoping he would get the \"hook\" sooner than later. The surprise twist at the end did catch me off guard although others have commented that they figured it out in advance.<br><br>The movie supposedly takes place on a Bahamian island. Having visited the Bahamas many, many times, the first view of the so-called Bahamas in the movie was a little bit of a shock since these previously perfectly flat islands had now grown mountains and hills along with rock formations jutting out of the ocean. And then when I saw the \"Bahamian\" resort I was further shocked to see that Mexican architecture had been exported to the Bahamas.<br><br>It seems the film makers should either have gone to the Bahamas or made the location in the film be Mexico, where it was actually filmed. Of course Mexico has no remote, lightly populated islands like the Bahamas does so I guess that wouldn't have suited the story. And the Bahamian government probably wouldn't let them film there due to the potential bad impact on tourism.<br><br>Despite these quibbles, the movie held my interest and had enough eye candy to keep me watching the screen. I would rate this movie about a 7.5 on a scale of 10.","user":"33Ford","rank":[28,40]},{"title":"depressing what passes for a horror movie these days","rating":3,"date":"3 July 1999","review":"Don't bother.Unless you are very easily entertained and have not seen any decent horror movies to compare this to. I would say the first one was OK, having seen it in the theater with a screaming audience made it more fun, but not in my list of top 20 horror movies. This sequel makes the first one look like a masterpiece. I figured out who the killer was about 15 minutes into the movie. The only slightly amusing part was Jeffrey Combs, who starred in the classic Re-Animator and many Stuart Gordon films. He is amusing but too good for crap like this! I Hope they at least paid him good money, the poor guy. Also, why did she flip out when she was locked in the tanning bed? The killer turns the heat up all the way...first of all, it isn't possible to turn it up enough to \"cook\" someone, especially in about 5 seconds. Oooooo, a tanning bed. I'm shaking in my shoes! No suspense, no nothing, and the ending was OK but made no logical sense. Of course there will be a third movie that will start out with her waking up from a bad dream that is the end of this one. Yeah, and I had a bad dream that I wasted 3 bucks an 90 minutes of my life watching this crud. No wait, that was real! Aaaaaaiiie!","user":"Rusty-61","rank":[11,14]}]