[{"title":"Chan and Tucker, the best comedy duo","rating":8,"date":"21 February 2020","review":"This martial arts movie was action packed and funny. Chris Tucker and Jackie Chan make a great team in this movie. Jackie Chan brings the action and Chris Tucker brings the comedy. The fight scenes are awesome and it has a great story to it. I recommend that people should see this movie if you haven't yet. You'll enjoy it.","user":"MR_Heraclius","rank":[37,38]},{"title":"A great Hollywood Comedy-Action flick","rating":19,"date":"19 December 2006","review":"This movie is pure comedy from the beginning to the end. You will have a good laugh thanks to Chris Tucker in his role of Carter, a clumsy LA cop. The city of Los Angeles is spectacular and is a great scenario for this entertaining movie. Jackie Chan at its best kicking asses everywhere with an outstanding humble attitude. I think Americans love Jackie Chan because he's so nice and great person.<br><br>The main reason why I like this movie is the wonderful duo they play, constantly arguing, while walking around exciting California, USA, about everything, but in the meantime they are loyal partners. The great diversity there is in America singles out in a city like Los Angeles when we go through Chinatown. And fortunately, the movie brings us out there. Interesting cultures melt into a huge variety of ethnicities that make anything possible to happen. This is why America is so interesting and wonderful and we from abroad love her as a beautiful land.<br><br>All in all, this is a worth-seeing Hollywood movie and probably you would like to watch it several times!","user":"fernandez_1989","rank":[54,59]},{"title":"Chris Tucker at his best!","rating":8,"date":"5 November 2003","review":"Chris Tucker and Jackie Chan, the best comedic duo since Lethal Weapon bring us Rush Hour. A classic action movie that brings great action as well as awesome comedy that makes you laugh every minute. Chris Tucker has always been one of my favorite comedians, even before I saw Rush Hour, so it was great to see him in Rush Hour. I know a lot of people find him annoying, but I thought he was just so funny. He showed off his talents in Rush Hour. Not only him, but this is the film that is making Jackie Chan into a world wide super star. His stunts are simply incredible. Rush Hour is one of those very fun action/comedy movies that I'm sure you'll enjoy if you love movies like Lethal Weapon or 48 Hours. The story was just pure entertainment and really kept me on the edge.<br><br>Lee is a body guard to the Chinese ambassador and is also a close friend, he also is a teacher to his daughter, Soo Yong. The ambassador goes to the United States with his daughter, but she is kidnapped by an evil man of the Chinese Consol. They want 50 million dollars in return, but the ambassador thinks that Lee should be involved, so he sends for him, but the F.B.I. doesn't want him near the case. So they hire L.A.P.D. screw up, James Carter, to babysit him. But together, the fastest hands in the east meets the fastest mouth in the west, they must learn to work together despite their complete opposite personalities and get the girl back.<br><br>Rush Hour is a guaranteed classic down the lines somewhere, I'm sure. It's already spawned a sequel and it's been a success. Chris and Jackie are such a great team, I was really impressed with their chemistry. My favorite scene is where Lee plays \"War\" by Edwin Starr in Carter's car, and he doesn't know how to say the lyrics correctly, and Carter shows him some moves, it was such a classic scene that brought me down to the floor laughing. I highly recommend Rush Hour, it's all in good fun and it'll give you more than a few good laughs.<br><br>8/10","user":"Smells_Like_Cheese","rank":[104,119]}]