[{"title":"Seriously what is up with the low rating,I thought it was fantastic.","rating":9,"date":"18 April 2014","review":"Mighty Joe Young tells the tale of a young woman who's an owner of a giant gorilla named Joe and his environment is in danger. So Charlize Theron's charcther and Bill Paxton's charcther decides to go to Los Angelus so Joe can have a normal life as a bunch of poachers are out to get him as they killed Theron's charcthers mother when she was just a baby. <br><br>Overall the story to this is very good,the music is very good and the cast is also very good. I saw it a few times before on TV and it was on Film 4 today. I may never know why this got a low rating cause I seen nothing wrong with it. Overall I really enjoyed this movie and I also was shocked that the gorilla wasn't a real gorilla AT ALL,he was a animatronic created by Rick Baker.Awesome effects.<br><br>My verdict watch it.<br><br>9/10","user":"lisafordeay","rank":[14,14]},{"title":"Grouse Gorilla","rating":5,"date":"5 April 1999","review":"Mighty Joe Young is a big, big gorilla who gets time in L.A. escaping poachers who are after him in his home hill in Africa. This is a remake of a remake of King Kong  (1933), which was made in 1949 as the original Mighty Joe Young.<br><br>This latest version is a remarkable computer and animatronic invention, justly nominated for this year's Academy Awards. He really is whiz bang and totally believable as a creature on the screen.<br><br>His best friends are Jill played by the very attractive Charlize Theron and Gregg played by Bill Paxton in a pretty light weight film for him considering some of his previous films (One False Move, A Simple Plan).<br><br>But take note too of Naveen Andrews who plays the screwball jungle tour guide. He was remarkable in The English Patient and Kama Sutra. Oh well. The bills have to be paid.<br><br>Mighty Joe Young is a Disney film aimed squarely at the fairly young, complete with the fairly gruesome bits that today's TV bred ankle biters demand. So what's in it for the oldies.<br><br>Well there's Charlize Theron who's pretty gorgeous. And then there's a truly spectacular scene when big Joe climbs up a burning (yes burning!) Ferris Wheel at a L.A. amusement park at night and rescues a little boy.<br><br>But my favourite bit was Joe violently wrecking a car bit by bit because the car alarm is sounding. His self satisfied grin as he sat on the quietened nuisance was one that made me wish that I could also rock Ms Theron to sleep.","user":"Steve-176","rank":[26,30]},{"title":"Fantasic effects that are very realistic","rating":12,"date":"12 September 1999","review":"This update of \"Mighty Joe Young\" features incredible visual effects. They are so seemlessly blended into the picture that Joe seems more than real.<br><br>\nBill Paxton is great as usual. In fact, most of the cast is pretty good. Charlize Theron is both tough and sexy. She worked better with Paxton than the contrived relationship he had with Helen Hunt in \"Twister\".<br><br>I watched this movie with my kids and they loved it too. Definately a thumbs-up as a family movie. I recommend it.","user":"GEM-20","rank":[14,16]}]