[{"title":"Good time at the movies (w/plot summary)","rating":7,"date":"20 February 2001","review":"Plot summary: Franklin Hatchett (Tucker) is a small time con man who instantly becomes famous (or infamous depending on how you look at it) after he escapes from prison.  Mistakenly wanted for murder by the police and wanted for robbery by a gang of crooks, Hatchett's only hope to clear his name and get out of this mess is a television reporter named James Russell (Sheen).<br><br>This movie was just a good time.  After seeing Rush Hour with Chris Tucker and Jackie Chan, I wanted to go back and see earlier comedies with Chris Tucker in a starring role.  (I already saw Dead Presidents, The 5th Element and Friday, but they either weren't comedies or he wasn't a starring character.)<br><br>Again, this movie was a good time.  It doesn't deserve to win any awards, but it's just fun to watch.  The entire cast offers great performances, while it's always good to see Paul Sorvino perform. While Tucker's character isn't exactly the nicest guy, the audience feels bad for him.  The audience is made to feel that he does what he does because he has to.  In his situation, I don't think many people would do otherwise. While he does take things to extremes, the movie wouldn't be as fun if he didn't.<br><br>I would recommend this movie to any comedy fan, \"buddy movie\" fan or fan of the actors.","user":"mcomer","rank":[27,36]},{"title":"Chris Tucker + Charlie Sheen = Brilliant","rating":7,"date":"24 June 2009","review":"A Classic Action Comedy. This in my opinion is Chris Tucker at his best. From the opening scene to the end, Chris Tucker is hilarious. From the funny looking hair cut to the cussing and singing, he reminds you of Eddie Murphy in Beverly Hills Cop. Charlie Sheen also does an impressive job. The action scenes are not spectacular, but it does a good job.<br><br>Money talks is a good blend of Guns/Explosions and laughter. If your a fan of 48 Hours, Nothing To Lose or any other Action Comedy, Money talks is a must see. <br><br>7.4/10","user":"lil_mexx31","rank":[12,16]},{"title":"Hilarious","rating":2,"date":"2 June 2002","review":"Chris Tucker and Charlie Sheen are excellent and hilarious in this great movie.  Almost all of the jokes that Chris Tucker made I laughed at.  He proved once again, after Friday fame, that he is a great comic.  Charlie sheen does really good in this one, too.  <br><br>Overall the whole movie is a great comedic flick and I definitely, definitely recommend this to the average person.  Rating 10 out of 10.","user":"SMLA11","rank":[29,48]}]