[{"title":"A very pleasant adaptation. And Northam is a real find!","rating":10,"date":"26 February 2002","review":"By no means my favourite Austen novel, and Paltrow is by no means my favourite actress, but I found the film almost totally delightful. Paltrow does a good job, and Cummings, Stevenson and the one who plays 'Miss Bates' are all absolutely terrific. The period detail is not alienating; the feel of the movie is just right, in fact. But the real 'find' is Jeremy Northam as Mr Knightley. There could not be more perfect casting, IMO. I hated Mr K in the novel, but found him wonderfully human and humane in the film. Northam's good looks and smiling eyes are no hindrance to enjoyment, either! Highly recommended. AnaR","user":"AnaR","rank":[70,75]},{"title":"Well done, Emma, well done!","rating":10,"date":"18 February 2005","review":"I was so impressed with Doug McGrath's film version of the Jane Austen novel \"Emma,\" and I loved the music score by Rachel Portman so much, that when I went to the video store one day and discovered the two had re-united for \"Nicholas Nickleby\" I immediately rented it without any other consideration.<br><br>I have read the book, and for those overly-critical fans of this Jane Austen adaptation, I don't know what else McGrath could have done to more perfectly capture the spirit and major plot elements of Miss Austen's work, especially given the limitations of a two hour movie (which some have complained about being too long!). And as far as Gwen Paltrow's accent is concerned, I must confess I wasn't too familiar with her when I saw this at the theater initially, and I was absolutely convinced at the time that she was an English actress!<br><br>I am taken aback by those who criticized the film for its lush scenery. That is one of the things I enjoy and look forward to seeing in period pieces set in the English countryside. The film's beautiful backgrounds are a major contributor to its appeal and success. If your idea of escapist fare is something bleaker, then perhaps you should rent something like \"Death Wish III!\"<br><br>The English country settings are as attractive and charming as the cast, and combine with the story and soundtrack for entertainment that makes you not tire of repeat viewings. McGrath is a wonder at choreographing the interplay of subtle expressions that are so essential in conveying the complicated romantic intrigue that occurs in this story.<br><br>This refreshing movie could also be a clinic on how enjoyable a film can be minus sex, violence or even a villainous antagonist. The story is often amusing, endearing, and at times, quite touching.<br><br>I have seen many competent Jane Austen book adaptations but this is without question my favorite.","user":"Whythorne","rank":[79,89]},{"title":"Jeremy Northam - a delectable Mr. Knightley","rating":9,"date":"5 April 2002","review":"Emma is a true romance.  If you love the soppy stuff, charged with wit and folly, you will love this movie!  Its true to the novel, which is very important, with a few twists added for pleasure.  Gwen is not one of my fave actreesess but she does justice to a role that required everything that she had to offer in spades.  She shines in a role i think no other actress could have done proper justice to.  <br><br>Jeremy Northam, as the hero.  how shocked are you?  I never looked upon him as overtly handsome but heck!  What the right role can do for you!  He looks so good as the sensible, regal Mr. K, that i am literally looking at him in a new light.  He makes and excellent romantic lead.  The charm and character that he brings to his role is wonderful!<br><br>Ewan McGregor, Greta Sacchi brings in the rest.  a good cast.  A good movie. If you are a fan of Jane Austen, see this movie, along with Pride and Prejudice - AND MOST IMPORTANTLY, buy the books.  It enhances the movie to heights that are extraordinary","user":"sweetrupturedlight","rank":[31,34]}]