[{"title":"Solid And Curiously Touching Modern Noir","rating":9,"date":"1 November 2003","review":"ROMEO IS BLEEDING is a fascinating and unusual hybrid of highly personalized old fashioned 40s noir and ultra-violent stylized 90s crime drama. It's the kind of movie they never make anymore, with an unappealing protagonist, an entirely corrupt universe where justice and virtue won't triumph and a heartbreaking ending which basically guaranteed it would never be a commercial hit. Obviously some were put off by these things, accounting for the low rating this minor masterpiece sleeper has. Bur that's part of why I love it!<br><br>While there is significant \"man's man\" violence and the obvious titillation from Lena Olin, this movie is at its heart a pure noir cautionary tale carefully structured to get us to the amazingly powerful payoff, which tops all. The writer (Hilary Henkin) is obviously knowledgeable about her 40s and 50s hard boiled repertoire and fills ROMEO with references and touches which students of the genre will enjoy.<br><br>But the center of this movie is Gary Oldman. His blisteringly desperate performance as a corrupt cop at the end of the long slide to oblivion defines the movie and is both hypnotic and disturbing. His voiceovers are a worthy throwback to the old Raymond Chandler raps voiced by Bogart or Dick Powell or Robert Montgomery. This isn't a nice or likable character but Oldman is believably relatable as he inexorably tries to \"feed the hole\" with his greed and inevitably circles the existential drain.<br><br>Lena Olin is at her menacing best; this is surely the role which landed her the gig as Sidney's subtly venomous mother in ALIAS, and she takes full advantage of the over-the-top femme fatale characterization with deadly verve. Oldman and Olin share a bizarre chemistry which is fortunate for the script, because Olin's repeated seductions of Oldman (where he basically knows she is luring him to his doom) would never have worked if the actors didn't bring it to life on the screen. There aren't a lot of actresses who can out-menace Gary Oldman but Lena Olin absolutely pulls it off.<br><br>ROMEO IS BLEEDING is not perfect. Roy Scheider's mafioso character is strangely caricatured and sticks out in a world otherwise occupied by three dimensional players. Scheider tries hard, too, which is a shame because it's just not there in the role. Lena Olin's brazen escape from police custody defies plausibility in the extreme. Gary Oldman is seemingly not quite properly motivated at all times. Nevertheless, the searing denouement to this movie burns all of these concerns away because it is one of the most unexpectedly poignant and heartrending in the last quarter century of noir. If you have a pulse, you will well up at the end, and probably think about a longing that you left behind at some point in your life against your wishes. 9 / 10","user":"secragt","rank":[64,73]},{"title":"You Can Dig One Grave, Or You Can Dig Two...","rating":9,"date":"10 April 2003","review":"One of my favorite lines from \"Romeo Is Bleeding,\" an overlooked tribute to film noir. Jack Grimaldi(Oldman)is a crooked cop that rats info to the mob about the whereabouts of mob witnesses. He is also a louse of a husband, cheating on his wife(Sciorra)with a waitress (Lewis). Life, in his view, is good, especially when he gets the money from the mob, which he uses \"To feed the hole\" in his backyard. Then, one day, his life slowly goes on a descent to hell when he is assigned to watch over the deliciously wicked Mona(Lena Olin, who should have gotten an Oscar nod for this performance). Mona makes a proposition to Jack: Help her fake her death and he will be paid VERY well. The problem is that the mob, led by Roy Scheider, wants Jack to wipe her out, or they will wipe him out. What happens to the characters in this film is what makes this a very intense film. The scenes between Olin and Oldman are hot enough to burn a hole in your television screen. This is a must see film that you have to have in your collection.","user":"domino1003","rank":[36,41]},{"title":"Outrageously Entertaining!","rating":10,"date":"13 October 2005","review":"Probably everyone has one favorite movie that they consider \"their own\" because few, if any, of their friends share their admiration for it. Mine is this one. I just love this film.<br><br>It is only one out of over 5,000 movies have either rented or purchased that I watched back-to-back nights after seeing it for the first time. A dozen viewings later, It's still just as good, if not better. It is, start-to-finish, the most entertaining crime movie I have ever watched.<br><br>Being of fan of film noir, those wonderfully-narrated crime films of the '40s and '50s, Romeo Is Bleeding is right up my alley. I may be wrong but believe this whole film is simply a parody of the film noirs: an outrageous take on those movies with an over-the-top villain (Lena Olin, the most fascinating female I have ever come across on film), along with over-the-top characters, action scenes, dialog and narration. It's a wild, fun - albeit sick - ride, not to be taken seriously (which a lot of people did and then thought it was too goofy). Evidence of this film-noir spoof is in the dialog, with a number of fantastic dark-humor lines, many delivered by Olin. One has to see this a number of times to catch all the humor in here. Kudos to screenplay writer Hilary Henkin for her work.<br><br>Oldman is superb and its the glue that holds this unique story in tact. His narration, including the exaggerated inflection in his voice, is fantastic. I appreciate the American accent this British actor used, too. Olin, as Russian hit- woman Mona Demarkoff, she is one character I guarantee you will not ever forget. Roy Scheider, Annabella Sciorra, Juliette Lewis, Michael Wincott and others - cameos by Dennis Farina and Ron Perlman - all deliver great performances with lines that, well,....as I said, are outrageous. <br><br>If you love the old film noirs, please check this movie out and remember it's tongue-and-cheek.","user":"ccthemovieman-1","rank":[69,83]}]