[{"title":"Why must Hollywood meddle in things it doesn't understand?","rating":6,"date":"14 May 2001","review":"I say this making no pretense at completely understanding the Irish conflict myself (you'd have to ask someone with experience of Belfast for a more authentic take on the situation), but the irresponsible way the troubles were used here as a backdrop to what is supposed entertainment staggers me.  It isn't as if it needed this detail; the terrorist could have been from any unspecified organisation.  In the incompetent handling of sensitive issues that the makers really have no idea of, the production team involved in this really have let themselves down.  Brad Pitt realised this too late and henceforth disowned the film, a fact which made me admire and respect him even more.<br><br>   For this I wanted to hate the film, and yet found myself unable to. Beneath the misbegotten attempts at 'political comment', there is a decent little thriller struggling to get out.  Pitt is great as the terrorist (dodgy accent aside) and Ford is as reliable as ever in the role of the honest cop.  Director Pakula keeps the story moving at all times and stages the action well.  Despite all these pluses, I constantly felt uncomfortable at the ways in which the script tried to manipulate my sympathies.  While it's not quite enough to make me downgrade the film on an enjoyment level, it loses big points from an ethical perspective.  Shame on you Tinseltown.","user":"Howlin Wolf","rank":[106,149]},{"title":"Attempts to work on several different levels, and works on none of them","rating":4,"date":"18 September 2009","review":"\"The Devil's Own\" is one of Hollywood's periodical ventures into the murky world of Irish politics. Harrison Ford, who stars here, had five years earlier starred in another such film, \"Patriot Games\". There is, however, a difference between the two films. \"Patriot Games\" is an action thriller which simply uses the Northern Ireland situation to provide a motivation for the bad guys; they happen to be Irish Republican terrorists, but they could equally well have been Islamic militants, or Russian spies, or Mafia hit-men, and it would have made little difference to the film. \"The Devil's Own\", by contrast, aims for something more ambitious. <br><br>The two main characters are Frankie McGuire, a member of the Provisional IRA on a mission to New York to purchase weapons, and his landlord Tom O'Meara, an Irish-American police officer. For about two thirds of the film Tom does not know that his lodger is an IRA man; indeed, he does not even know the young man's real name as Frankie is using the alias Rory Devaney. Tom is only enlightened towards the end of the film when he discovers in \"Rory's\" bedroom a bag containing millions of dollars. (Are the IRA so amateurish that they would entrust the money for their arms deals to a man who then leaves it under the bed in someone else's house?) <br><br>His discovery of the truth puts Tom in a difficult position. On the on e hand he disapproves of violence so cannot allow Frankie to go ahead with his plan to buy missiles for the IRA. On the other hand, he does not want any harm to come to the young man, so tries to protect him from the FBI and MI5 agents who are on his tail. (It is quite possible that the British security forces might set up hit squads to hunt down IRA men, but it seems highly unlikely that such squads would be permitted to operate on American soil with the full knowledge and cooperation of the US authorities). <br><br>There is also a sub-plot involving Tom's attempts to cover up for his partner Eddie, who has shot dead a criminal who was running from him. Tom tells his superiors that the man was armed, although he had already thrown away his gun before being shot. <br><br>I felt, however, that this sub-plot was never properly integrated into the main film. I was not surprised to discover that the film went through several rewrites after the original script was discarded, as it had the feel of a film written by a committee. Each member of the committee, moreover, appears to have had his or her own agenda. One member wanted to make an action thriller, a second wanted to make a political commentary on the Northern Ireland situation and a third wanted to make a character-driven psychological drama exploring Tom's ethical dilemma in having to choose between the demands of friendship and his obligation as a police officer to uphold the law. Eventually the chairman, who had the casting vote, ruled that the film would be a mixture of all three approaches.<br><br>There is, of course, nothing wrong with a film which attempts to work on several different levels. The trouble with \"The Devil's Own\" is that it doesn't really work on any of them. As an action thriller it is too slow moving, with most of the action crammed into the opening and the ending. As political commentary it is too obviously slanted towards a pro-IRA position with a misguided attempt to make Frankie a sympathetic figure. (That is perhaps only to be expected from Hollywood, particularly in its pre-9/11 period. Americans who approve of this should ask themselves how they would react to a British film which tried to glamorise Timothy McVeigh or the Unabomber). As a psychological drama it is dull and the Eddie subplot is never successfully integrated with the main action. <br><br>The film was turning out so badly that one of its main stars, Brad Pitt, wanted to leave the set and was only restrained from doing so by the threat of an injunction. Rather surprisingly, therefore, Pitt's performance is one of the better things about this movie. (His Irish accent, too, is quite convincing). He is certainly better than his co-star Harrison Ford who actually described this film as one of his favourites. Although Tom O'Meara is a role of the sort in which Ford normally excels- a decent, solid family man confronted with a crisis- his performance here is a dull, stodgy one, and not one of his best. <br><br>Overall, the film is a disappointment, despite its two major-league stars and its major-league director. This was the last film to be made by Alan J. Pakula before his tragic death a year later in a road accident. Pakula was responsible for some excellent films, notably \"Sophie's Choice\", so it is a shame that his career did not end on a higher note. 4/10","user":"JamesHitchcock","rank":[29,39]},{"title":"Inaccurate","rating":3,"date":"1 March 2003","review":"This film is just a second-rate thriller which uses Northern Ireland as a convenient backdrop to add colour.  Unfortunately, the portrayal of Belfast and the terrorists and intelligence community is stereotypical, romanticised and hugely inaccurate.  The gun battle at the beginning is just ludicrous and from then on the film becomes a showcase for nauseating Irish-American 'culture,' all blarney and dreaming of the 'oul country.  The acting doesn't help as Ford sleepwalks and Pitt can't maintain the accent.  It is possible to make good thrillers set in Northern Ireland which do not dodge the politics and have sensitivity, but none of them have been made by US production companies.  'Harry's Game' is by far the best example, devastatingly accurate closely followed by 'The Children of The North' and the black comedy 'Divorcing Jack' more recently.  See these and give this Hollywood rubbish a miss.","user":"glennwalsh44","rank":[91,138]}]