[{"title":"An offbeat horror mood piece","rating":8,"date":"30 May 2008","review":"Troubled young Grace MacDonald (well played by ravishing redhead Brooke Mills) works as an assistant for itinerant carnie faith healer preacher Reverend Jesse Bundy (essayed with tremendous rip-snorting gusto by Michael Pataki) and can't get over her obsession with finding her long lost father. Grace eventually runs across her pop Timothy MacDonald (a fine, robust performance by Edmond O'Brien), but he turns out to be crazy, overprotective and dangerous. Or is Grace just imagining that her dad is still alive? Writer/director John Hayes relates the compellingly quirky story at a leisurely pace and does an expert job of creating and maintaining a creepy, surreal, dreamlike atmosphere. Paul Hipp's bright, lush cinematography and Jaime Mendoza-Nava's spooky, melancholy score further enhance the pervasive mood of abstract eeriness. Moreover, there's nice supporting performances by Paul Prokop as Grace's kindly, concerned fiancé Dr. Patrick Bundy, Marc Lawrence as a sinister undertaker who works as a pimp on the side, and Arthur Franz as a helpful psychiatrist. Despite a heavy languid air and the often murky plot (a grimly sober narrator occasionally chimes in to give the oblique story some much-needed coherence), this intriguingly ambiguous picture somehow manages to cast a strangely hypnotic spell on the viewer. An interesting oddity.","user":"Woodyanders","rank":[9,9]},{"title":"Flawed but definitely worth a look","rating":15,"date":"15 September 2008","review":"A young girl grows up in an orphanage, always insistently believing that her father will someday come and get her. She's eventually adopted and as a young adult goes to work in the circus-like act of her revivalist preacher foster brother (Michael Pataki). She dons a skimpy costume and does a dive off a high platform, supposedly representing the fall into hell. While the good preacher/foster brother has a little bit of a thing for her (located in his pants), she also has a boyfriend, a local sawbones. But she refuses to sleep with him, prompting him to finally give into the temptation of a pretty female medical student. In one town the revivalist act comes to, she hears news of her father. But after going to see the the local pimp/town mortician (don't ask) played by Marc Lawrence, she arrives to find her father (Edmond O'Brien) dead on a mortician's slab. She cries and wishes him back to life, and he suddenly arises and murders the mortician. Later she ends up living with her (dead?)father in a deserted house on the outskirts of town (where she does bizarre Irish jigs why he plays the squeezebox to entertain the occasional visitor). Unfortunately, his murderous ways also continue.<br><br>This movie is a lot like \"Toys Are Not for Children\" or the director John Hayes' own \"Baby Rosemary\" (which was basically an urban XXX version of this PG-rated rural Gothic film). Like those movies, it's a surprisingly touching film of a young girl's longing for an absent father that results in adult sexual dysfunction and eventually outright psychosis. There's obviously something wrong with the girl--she sees her room in the abandoned house as being warmly decorated with a canopy bed, for instance, when in reality it's a bleak and barren room with only a filthy mattress. This might be more of a \"Repulsion\" type film than a undead type film. I'm really not ruining anything saying this, however, because the film itself includes an annoying voice-of-god narrator who ruins ANY mystery or suspense by explaining EVERYTHING for the viewer. This is the one crippling flaw in what is otherwise a pretty good film.<br><br>Michael Pataki was a regular in John Hayes' films including his best one, \"Grave of the Vampire\". O'Brien and Lawrence were long-time character actors (the latter ironically later directed and starred with his own real-life daughter in \"Pigs\", a similarly downbeat horror film about a sexually dysfunctional and murderous father-daughter pair). As for Hayes, there is a great interview and retrospective of the career of this obscure but interesting 70's low-budget auteur in British writer Stephen Thrower's excellent tome \"Nightmare USA\". This is a flawed film, but still definitely worth a look.","user":"lazarillo","rank":[16,18]},{"title":"Pure strangeness","rating":8,"date":"27 June 2019","review":"Arrow Video's American Horror Project is dedicated to \"its mission to unearth the very best in weird and wonderful horror obscura from the golden age of US independent genre moviemaking.\" The second volume - the first had Malatesta's Carnival of Blood, The Witch Who Came from the Sea and The Premonition - lives up to that bold challenge.<br><br>John Hayes began his career producing and directing short subjects, even getting nominated for an Academy Award for 1959's The Kiss. In addition to those roles, he often wrote his own films and occasionally appeared as an actor in movies like The Shaggy D.A. and his own End of the World.<br><br>After his initial full-length movie, The Grass Eater, he made Five Minutes to Love, a Rue McClanahan (yes, from The Golden Girls) starring film all about Poochie, a woman who lives in a junkyard. Also known as Hollywood After Dark, it was picked up by exploitation godfather Kroger Babb. He also directed Jailbait Babysitter and several adult films, such as Pleasure Zone and Hot Lunch.<br><br>Hayes is probably best known for two movies he made in 1974: Grave of the Vampire and Garden of the Dead. Hopefully, people will soon add this film to that list, as I absolutely loved it.<br><br>\nGrace (Brooke Mills, The Big Doll House, The Student Teachers) grew up in an orphanage where she dreamed of the day her father would return, forever living outside the other children around her. When she grows up, she goes to work with her adopted foster brother Rev. Paul Jessie Bundy (Michael Pataki, amazing as always), who has turned his father's church into a circus. For her part, she wears a sexy costume before jumping off a high platform into water to symbolize Satan falling into Hell. He also uses her to faith heal others - indeed, the movie was made as The Faith Healer - while hiding his lust for her.<br><br>She's already dating their other foster brother, Dr. Patrick Bundy, yet refuses to have sex with him. He gives up and starts dating another medical student. If this seems strange that brothers are at war over their sister, well, stay tuned.<br><br>The church makes it to a town where she hears word of her father (Edmond O'Brien, who started his career as a magician trained by next door neighbor Houdini before appearing in plays at Orson Welles' Mercury Theater and films like The Man Who Shot Liberty Valance, Seven Days In May and The Wild Bunch). This brings her to the combination funeral home/brothel of an undertaker (Marc Lawrence, who was in a ton of movies, but I'll always think of him as being in Night Train to Terror) who has her father dead on his mortuary slab. She wishes him back to life and he rises to murder the undertaker in a completely frightening scene that creates one of several breaks in the film with reality.<br><br>The one issue I have with the film is that its narrator reveals the big twist early. The destroyed house on the edge of town that Grace lives in isn't the comfortable home that's in her mind and her father doesn't exist. Who knows what the people who came there to see her dance to his squeezebox songs really saw.<br><br>This movie is the kind of crazy film that I text people about in the middle of the night because I don't believe that it can be real. But it is - it gloriously is - and now I'm here exclaiming that you should go out of your way to see it.<br><br>In 1976, Hayes directed Baby Rosemary, which is an adult remake of this film. That's probably one of the few - if only - times I can think of when the same director created a XXX and mainstream version of the same film, albeit six years apart.","user":"BandSAboutMovies","rank":[5,5]}]