[{"title":"My Ultimate Guilty Pleasure- how do you assign a rating to that?","rating":8,"date":"24 April 2006","review":"This movie is my ultimate guilty pleasure. It's inane, manipulative, has hyperactive cutting, a ton of glaring inaccuracies (pointless to even discuss or debate), and probably 29 other glaring faults. And why in every dramatic slow-mo emo shot are there 3 helicopters flying in unison overhead? What's the point of having 3 helicopters flying really close together? Who cares! It looks cool. If one day I am having a heartfelt talk with my daughter, I hope there are 3 helicopters flying overhead to really 'bring it home' (and Aerosmith performing in the background.)<br><br>Despite it all, I still love watching this movie. Anytime it is on TV I can watch it 'til the end. Bruce Willis does a great job doing his Bruce Willis 'thing' (smart alecky tough guy), and the supporting cast is really great. Steve Buschemi in particular gets the best lines. An awesome assortment of ragtag castoffs (spitting funny one-liners) must save the world- who would have thunk it?<br><br>I think Armageddon was actually conceived by suits in a studio office (no really, I read that in a magazine), which is I guess another strike against it. Yet only a bunch of suits could come up with a 'high concept' like this (so high it's basically a parody by itself.) And only a director like Michael Bay could make it. He's far more suited to these types of movies, rather than big historical epics like PEARL HARBOR (which I really, really disliked.)<br><br>I read somewhere once that this movie is as close as Hollywood gets to pure cinema, in that it is basically completely divorced from reality of any kind. Is that good or bad? I don't know. I do think if you're going to ditch convention and any semblance to reality, you may as well go all the way. It's better than having something that is a confused mess that tries to be different things (Pearl Harbor.) There will be no 'it could really happen!' here.<br><br>So after all this, believe it or not I am going to give this movie a big fat whopping 8. Why? Because IMO it unabashedly succeeds at what it tries to set out to be, whatever that is. That makes no sense, since I am basically saying by all logical accounts this movie may actually suck, yet I am giving it a 8. But hey I loved this movie.","user":"madmaxmedia","rank":[376,461]},{"title":"One of Those Guilty Pleasures","rating":7,"date":"13 June 2017","review":"After discovering that an asteroid the size of Texas is going to impact Earth in less than a month, NASA recruits a misfit team of deep core drillers to save the planet.<br><br>The real mystery surrounding this film is how it got released by the Criterion Collection. Both this film and Michael Bay's \"The Rock\" received the Criterion treatment at one time. And while both are very enjoyable films, do they really belong with Criterion? I feel that by merely being released by them, there is an added importance stamped on the film.<br><br>But as far as guilty pleasures go, this is a fun and entertaining film. I could do without the romance angle, but the idea of blowing up an asteroid before it hits earth (which assumes a lot of questionable science) is just classic science fiction, here given more legitimacy and budget than ever before.","user":"gavin6942","rank":[12,13]},{"title":"Fun, Action-packed movie.","rating":8,"date":"15 May 2003","review":"This movie seems to be a movie that many people love to hate.  I don't see why it has such a bad reputation.  It is meant to be an Action/Adventure/Sci-Fi movie, and it definitely lives up to this.  It is what it is. Many people have tried to compare it to Apollo 13, but that's like comparing apples and oranges.  They are entirely different fruit. Apollo 13 is based on a true historical event (Docu-drama), while Armageddon is an Action/Adventure/Sci-Fi movie.  It has plenty of action and adventure, a lot of humor, and a bit of romance.  Is the story realistic? Not hardly, but name ANY Action/Adventure/Sci-Fi movie that is.  That's why they call it Science FICTION... For those who criticize this movie, nothing will change their minds. However, if you HAVEN'T seen Armageddon, take a chance, watch with an open mind and try not to let all these negative reviews spoil your enjoyment of a really fun movie.  Remember, a movie is meant to ENTERTAIN, and Armageddon does just that, if you let it!","user":"XJoey","rank":[224,322]}]