[{"title":"If Ever A Movie Could Be Called \"Unique,\" This Is It!","rating":8,"date":"22 March 2006","review":"I wonder why this isn't a movie that people know? After all, it is definitely unique and fun to watch, and how many films do you know that are a combination 1940s film noir and horror? Man, this is a real \"curiosity piece.\"<br><br>It's Los Angeles and 1948 and everyone, except the hero (Fred Ward) is using magic, occult witchcraft-type stuff (which this reviewer hardly endorses). Ludicrous, yes, but fascinating and funny in parts.<br><br>Too bad this isn't out on DVD because the colors and atmosphere just ooze 1940s. It's also simply great entertainment. Juliane Moore looks gorgeous and Ward is likable in the lead role. He has the authentic look of a private eye, and I like the idea that he has more morals than all the other characters in the movie combined.<br><br>If any story can be called truly \"unique,\" this is one of them.","user":"ccthemovieman-1","rank":[41,45]},{"title":"Greatest movie that's never seen","rating":10,"date":"5 October 1998","review":"This is such a fun movie, everyone I've shown it to has tried to swipe my rather beat up copy...   If you're a fan of hardboiled detectives, the works of H.P. Lovecraft, horror mixed with comedy, Fred Ward, or watching movies in slow motion to find all sorts of cool stuff going on in the background, then this film is for you...<br><br>Sadly, you CAN NOT PURCHASE this film, unless you find it used. HBO only released it to video rental stores, even though it's lesser sequel is available just about anywhere. To make matters worse, all tapes come with a Macrovision copy block. Bummer...<br><br>So, if you can find it, grab it quick, before someone else does!","user":"Hokum-2","rank":[21,22]},{"title":"The best...?","rating":9,"date":"19 August 1998","review":"Damn near close.  The idea of a private eye going it alone in  world where magic reigns supreme is probably the ultimate extension of film noir and the hero-as-outsider.  This movie captures all the charm of the Bogart 40's detective flicks and 80's type supernatural/horror F/X.  It also adroitly mixes humor, horror, hard-boiled detecting, and mystery, with great performances from Fred Ward, David Warner, Clancy Brown, Alexandra Powers, Raymond O'Connor, and Julianne Moore.","user":"Gislef","rank":[23,25]}]