[{"title":"It just didn't seem to fit","rating":7,"date":"29 August 2001","review":"Don't get me wrong this was not a bad movie, I just didn't think that it fit somehow. It didn't seem like a sequel or the \"missing middle chunk\" of the beloved cartoon. The first film, to me, seemed to have been set in the middle to late fall, I can stretch my imagination and see it possibly being November but not December. I think they could have made Forte' much more interesting and menacing and Fife was cute, but I think the real kudos goes to Haley Joel Osment's Chip. Paige O'Hara's Belle sings a lovely song about story books and this little sequence was charming, but still it seemed to lack the essence that made the original so magical. I rarely watch these Disney sequels anyhow due to the animation not being what it's like in the originals. I took a gamble and watched this and it was good, but nothing like the first and finest.","user":"Thornfield2","rank":[17,21]},{"title":"Not as bad as most say","rating":6,"date":"13 November 2008","review":"Beauty and the Beast: The Enchanted Christmas is a sequel to Beauty and the Beast obviously, I wasn't too sure if I had wanted to see this because I thought it was just going to be one of those cheesy Christmas special things. But it turns out that this was just a semi-prequel for the story, just going for the stories in between when the time where the beast was still a beast, Belle was still trying to figure out her place in the palace as well as the servants who are still objects in this story. I actually thought it was a nice addition to the story, now I do think that this was unnecessary, because of course we always have to have a villain to these stories and this one somehow in between all the drama of trying to get the beast to turn into a prince, we have an organ that is trying to break the beast's heart away from Belle, yeah, it's silly.<br><br>Belle is still a prisoner in the Beast's castle. All the servants are trying to figure out a way for them to fall in love with each other, but with Christmas coming up, they look at this as a great opportunity to bring them together. Belle is excited for Christmas, but the beast isn't happy seeing how it's the one year anniversary of his spell being cast upon him. The organ player though is not in the mood to be mortal again, so he decides to figure a way for the beast to steer clear of falling in love with Belle.<br><br>Beauty and the Beast: The Enchanted Christmas is a decent sequel, it's a little silly, but I think it wasn't that bad. It was nice little story to add to the fairy tale, it's for the kids for sure, but it's a nice family film as well. There are some good songs in here as well, also we have Tim Currey who is always an awesome villain. Over all, I'd say to give this movie a chance, it has decent animation, a charming story, and the original voices, how rare is that when it comes to a Disney sequel? But I do recommend Beauty and the Beast: The Enchanted Christmas, it's a nice Disney film, even for the holidays as well.<br><br>6/10","user":"Smells_Like_Cheese","rank":[13,17]},{"title":"A Good Christmas Visit","rating":8,"date":"31 December 2003","review":"For a direct-to-video special, this movie isn't really all that bad.  The animation was crisp and clean enough that I wondered if the theatrical animation department worked on this.  The CG animation of the villain, Forte, was pretty impressive, even though it kind of stood out like a sore thumb compared to the traditional animated surroundings.<br><br>All the voicework is back from the original movie, most notably Jerry Orbach as Lumiere and David Ogden Stiers as Cogsworth.  New characters were well voiced by Tim Curry, Paul Reubens, and Bernadette Peters.  One thing that is definitely lacking in this movie is the quality of the songs.  Most of them are kind of corny, sappy, and disposable.  Compare that with the original where all the songs were magnificent and memorable, and you'll realize that Howard Ashman was definitely missed.<br><br>As for the storyline, this movie provided a nice Christmas story.  Recalling back when they were cursed, the characters detailed their struggle to bring Christmas back to the castle.  I thought Forte was a very conniving and formidable villain.  He added the conflict that made the story more interesting.  It's not groundbreaking material, but it's sweet and nice enough around the holidays.<br><br>So, overall, this isn't Academy Award material like its predecessor, nor was it ever intended to be.  It's a good Christmas story with your favorite B&amp;B characters.<br><br>My IMDb Rating: 8/10.  My Yahoo! Grade: B+ (Memorable)","user":"travisimo","rank":[13,17]}]