[{"title":"One of Lambert's best!","rating":8,"date":"20 August 2002","review":"We all him as the original Highlander and as Rayden in the first Mortal Kombat film, but Christopher Lambert has been around for awhile and has made a pretty impressive number of films (however the quality of many of them is not that impressive).  Though many of his films lack something to be desired he has made some classics and he always brings in a solid \"Lambert\" performance and every now and then he brings in a performance that even surpasses that.  Resurrection happens to be one of those performances.<br><br>The film itself is actually quite good and it is a bit of a shame that it did not get a wide release in theaters, but unfortunately Lambert just can't bring 'em in anymore (however he is a staple in the straight to video market).  The film is a gritty detective story (so NO SWORDS guys) in the style of SEVEN and re-teams Lambert with his Highlander director,  Russell Mulcahy.  What is interesting here is that the film is co-written and conceived by Lambert, which I think is a first for him (though I'm not sure).  What makes this significant is that, Lambert gets to branch out a little and play a character with a little more depth.  Which I'm sure is something he's been longing to do since GREYSTOKE.  Another interesting thing about the film is that it has genius/director David Cronenberg acting in a small part as a priest(That's what I'm waiting for, the Crononberg/Lambert, Director/Actor team-up).<br><br>The film is well shot and acted.  It is suspenseful and even a little more thought provoking than the average suspense/mystery.  It has a twist that I believe works pretty well.<br><br>Well in other words, the film is good.  See it if you can.","user":"jbfichera","rank":[16,19]},{"title":"Russell Mulcahy, eh? He's a funny one.","rating":28,"date":"28 June 1999","review":"Given the opportunity of clambering to the top of the directorial heap on the back of the magnificent Highlander, Mr. Mulcahy instead managed to shoot down his own chances by unwisely having any association at all with the not-quite-so-well-received sequel. Nevertheless, Resurrection, while not exactly a triple-A title, shows that the old dog's still got a few tricks up his sleeve - even if they are being deployed on straight-to-TV efforts these days.<br><br>With old chum Chris Lambert (a man equally cursed in his career choices, and looking very old all of a sudden) on board, the scene is set for another shameless reworking of Seven - which might be an obvious comment to make, but that doesn't make it any less true. While the deadly sins are replaced with the names of apostles, the relentless rain, gloom and gritty gore are still there in force, and the plot's just as threadbare.<br><br>But! That still doesn't make it a bad film, as such. It's decently performed and nicely shot, with a few nifty camera tricks thrown in to break up the free-roaming NYPD Blue feel of the general proceedings, and there are one or two genuinely effective twists encountered along the way (with some glaringly obvious ones to balance them out, unfortunately).<br><br>So it's worth catching, as long as you're not expecting mould-breaking brilliance. One of Lambert's better films, certainly, and an example of the sort of high production values he should be aiming for. So sit back and enjoy... all in all, it's better than you might expect.","user":"Leigh L.","rank":[27,36]},{"title":"More than a rip-off of \"Se7en\"","rating":7,"date":"27 November 1999","review":"While I sat through the first half-hour of \"Resurrection\", all I could think about was how closely it resembled \"Se7en\". It had the same basic theme: two cops investigating a series of brutal (and unsettlingly gory) murders that follow a common theme. I couldn't help but dismiss it as a pointless, direct-to-video rip-off, but soon I found myself strangely immersed.<br><br>\"Resurrection\" is better than I thought it would be. Once the story started rolling along, I was surprised at how well the movie was made. The suspense scenes are first-rate, the screenplay is smart and intriguing, and the acting is well above average. Though it's not a great movie, it's definitely well worth a watch if you're into the serial-killer subgenre. 7/10","user":"Johnnee-2","rank":[11,13]}]