[{"title":"Hypnotic, but...","rating":10,"date":"20 December 2003","review":"...people really need to take another look at \"Natural Born Killers.\"<br><br>The plot: Mickey and Mallory Knox (Woody Harrelson and Juliette Lewis in roles that are a little too convincing) are a husband/wife pair of serial killers whose vicious crime spree across the country has made them into media superstars.<br><br>This movie is a barrage of frightening and surreal images, and is damn near hypnotic to watch.<br><br>I can see where the controversy surrounding this film comes from but what I don't understand is where the hate is coming from.<br><br>1994's \"Natural Born Killers\" has to be one of the best movies of the 90s - its sole purpose on this planet is to showcase America's fascination with violence.<br><br>But lets try to understand the hate.  This movie is here for one reason and I think that we can all agree on that reason.  Oliver Stone is a competent and accomplished filmmaker and most of the hate seems to be directed towards him.  Stone, who is working from a script that has since been virtually disowned by Quentin Tarantino, pretty much took over and shaped the screenplay to his own vision.<br><br>I can understand why fans of Tarantino have a right to be p*ssed off, but I find it extremely difficult to believe that they truly hate the finished product, and the same goes for Tarantino.  Don't get me wrong, I'm a huge Tarantino fan myself, and I'm sure he didn't appreciate Stone re-writing his script, but he should be proud of what was done with it.<br><br>The message, if you can call it that, is that we are obsessed with violence, and Stone exposes our love for it and spits it back in our faces.  To quote Marlon Brando -  \"The horror, the horror.\"  I say to hell with the hypocritical people who find this movie offensive for they are the ones that this movie is truly aimed towards.<br><br>Yes, horrific images are displayed in this movie and terrible things happen to people all throughout, but it's giving us we want, and we hate it.  The hate surrounding this film is extremely misguided.  My high school paper recently did an article about sex and violence on television and one of the supposed outlets of that violence would be our fascination with the war in Iraq and the Jessica Lynch story.<br><br>It said that we are much, much more concerned with the sex (I personally don't think today's teenage girls are THAT impressionable, but who knows?), rather than the violence (which apparently seems to be causing a misguided sh!tstorm of controversy, too, and like the sex, I don't think that people are that impressionable), namely the kind that is seen in music videos and such.  Though the article refused to go into specifics (but we know who the people being discussed are and I'm sure they do, too), it brings me back to \"Natural Born Killers,\" which I think people need to take another look at.<br><br>In this day and age, violence on television is becoming more and more commonplace, and this movie's relevance seems to make its viewing that much more important.  Before we go and continue to bash the hell out of it again, people need to come back and take a look around themselves and watch \"Natural Born Killers.\"","user":"dee.reid","rank":[208,276]},{"title":"good messages get lost in all the raucous","rating":12,"date":"12 March 2007","review":"From director Oliver Stone comes this flashy but frustratingly uneven and unfocused story of a sadistic, recently married couple who brutally butcher random people across the United States as part of their honeymoon. Their heinous acts and eventual apprehension attract the attention of the media and interested viewers all over the world, but instead of punishing them they would prefer to tell their life story. Well-crafted film holds your interest by making social points that are poignant, provocative, at times even satirical, but alas, they're set in the midst of noisy and excessive action scenes that are relentless and headache-inducing, not to mention extremely violent. Cast is good, especially Harrelson and Lewis who make a good match, but they need much more sturdy direction. **","user":"Special-K88","rank":[27,32]},{"title":"Post-script on Hypocrisy","rating":9,"date":"10 February 2005","review":"Natural Born Killers<br><br>Released just long enough ago to be forgotten by today's standard of speed amnesia, this film by Oliver Stone is worth seeing again. The violence in it was sickening just a few years ago, but such things have quickly gotten normalized in our culture's ongoing desensitization. Ironically, this very process of media desensitization is precisely the topic of this film's satire. NBK has since even been the subject of copycat crime sprees, or so the culprits claimed. This is troubling, because while the film works hard to analyze the dubious process by which violent killers are turned into romantic heroes in the mass media, NBK seems unable to escape from the same orbit, ending with the killers as living happily ever after, justified by the brutality of their backgrounds, and morally superior to the prison officials and popular journalists who pursue them. But as a postmodernist satire of media saturation-violence, from wrestling to sit-coms to real crime dramatizations to obsessive live news interviews, Stone's film is a thought provoking exercise that is stylistically mesmerizing.<br><br>As a postscript, several people accused Stone of inciting copycat crimes and called for him to be sued for damages-- which happened. The lawsuit was dismissed. At the least he was negligent, they argued. Interesting to me that the glorification of violence found everywhere in the thriller genre is taken to be safely neutral, while a powerful satire of glorification is condemned as, well, too violent. The last time I checked, this was always defined as \"hypocrisy\". The major contradiction in media culture now is that on the one hand, Natural Born Killers is reviled for inciting violence, while on the other hand, it is reviled for being _too obviously_ critical of media violence in a simplistic and unsubtle manner. But can we have it both ways? No.<br><br>A 2nd postscript on another form of hypocrisy: Quentin Tarantino, the reigning postmodernist \"King of Cool\" who plays with pastiche of pop culture genres, wrote the script for Stone's Natural Born Killers, but then criticized the way the film was directed. Ironically, Tarantino then copied several formal film techniques and innovations straight out of NBK for his later \"Kill Bill\" films. -- with the key exception that Tarantino continues the tradition of glamorizing violence. The Tarantino crowd sees itself as properly aesthetic and cool, far above the ham-fisted Stone! Creepy isn't it?","user":"Erick-12","rank":[113,159]}]