[{"title":"An important movie; wish more people would see it.","rating":18,"date":"18 January 1999","review":"It seems bitterly ironic that a movie about the war in Bosnia, ignored for the most part by the West, should have been ignored by moviegoers. I don't know what happened to the distribution of this movie (perhaps there is an explanation), but I suspect that many movie-goers just don't want to be troubled by the reality of what happened in Bosnia in the years that the movie so effectively depicts -- 1992-1995. It's a crying shame, because this is a powerful, beautiful story that focuses on a British journalist who must learn how to act on his moral outrage. As a former reporter, I empathized completely with his sense of disconnectedness from the terrible events he witnesses. But as the camera moves through the burned-out rubble of the city and its surroundings, the tension builds toward his inevitable actions and makes plain the movie's moral: that even when we feel we can do almost nothing, we should do whatever tiny bit we can. The message isn't heavy-handed; it is intelligently conveyed through top-notch performances from a solid cast (Woody Harrelson is perfectly convincing as the \"cowboy\" American journalist) and a script that does justice to the complexity of the Bosnian situation. Real news footage is mixed quite cleverly with the invented -- so well, in some cases, that it's hard to tell them apart. This isn't an easy movie to watch but it's worthwhile for those many of us who become confused and overwhelmed by the Bosnian situation. It's a powerful reminder, too, that being informed isn't enough; action is imperative. I greatly admired this movie.","user":"vacritic","rank":[38,49]},{"title":"nice, but too confused and missing the point","rating":9,"date":"9 September 2003","review":"At the beginning I should mention that I live in Sarajevo, and I was a civilian in a besieged city, so that explains my perspective from which I was watching this movie, and experience I carry from it.<br><br>Through the whole movie, one thing kept torturing me: What is this movie about??? Is it about Michael Henderson and his moral issues, is it about all journalists and their moral issues, is it about Flynn and his understanding of war, is it about worlds' understanding of that war, is it about Sarajevo, about Emira, about orphans? This movie needs focusing on one goal, because this way I'm left with 100 stories that don't actually fit together and I don't know what I was watching the past 1,5 hours. Pictures of war make their message very clear, but then its messed up with the story that tries to cover too many things at the same time. So is it fiction? Well, no. Is it a documentary? Well, no, not that either...<br><br>Most places shown in the move are totally wrong. Characters keep jumping from one end of the city to another in matters of seconds, some events that really happened are shown in wrong places, many times characters enter streets that in real life were sniper alleys etc. (meaning no way one could get near and stay alive), military checkpoints are mostly in the wrong places and so on, but one can forgive details like that.<br><br>Welcome to Sarajevo is trying to show you how it was, living in Sarajevo under siege, but its constantly missing the point and showing the wrong things. If you want to know how it looked like, watch a documentary.<br><br>To date the only realistic movie about Bosnian war is No Man's Land, and that would be my highest recommendation. Other than that, Lepa sela lepo gore is worth watching.","user":"kicco","rank":[27,34]},{"title":"A powerful tour through hell on Earth","rating":9,"date":"3 August 1999","review":"What \"Welcome To Sarajevo\" did was open my eyes and help me realize how fortunate I am. Sarajevo was a peaceful, metropolitan city not unlike many cities in North America. But it is no longer. It's almost too easy to clear your mind of the strife going on in other parts of the world. Sometimes we feel guilty for being so fortunate. Sometimes we feel horror at the news reports of inhuman atrocities. And most times we shut out the reality of it as it is rarely affecting us in a personal way. <br><br>This gripping tale of war-torn Sarajevo is told through the eyes of British reporters. It will probably shock, jar and depress you, but it will most certainly increase your sense of global awareness, and instill a better appreciation of the liberties that most of us have taken for granted. Images from concentration camps hauntingly mimic those from fifty years ago.<br><br>This film is based on an amazing true story of one man's personal involvement and promise to rescue one refugee child and the great lengths to which he must go to deliver her from a war zone.<br><br>I caught this film in its limited theatrical run following its inclusion in the 1997 Toronto Film Festival. I exited the theater with my wife in a staggering awe-struck state. No one could fully communicate what it would be like to live in a war zone, but this film gives you a potent taste without pulling any punches.<br><br>What this means is that most people will likely find it difficult to recommend this film to friends. It's not an uplifting tale, but it is an extremely important one, and I feel privileged and fortunate for having seen it.","user":"ToldYaSo","rank":[32,43]}]