[{"title":"Skillfully crafted, and exciting","rating":8,"date":"30 July 2009","review":"I am curious to know how many Steven Seagal fans walked out of the theater after the first twenty minutes demanding their money back. It is a good thing that Exectutive Decision does not direct its attention towards Seagal. Instead it chooses to focus on suspense and thrills which is exactly what it offers. It is slow and ominous, even claustrophobic at times. The plot stays consistent, never getting too thick, and it keeps you focused, Which is good enough for me.<br><br>It will be hard to watch Executive Decision today and not think about 9/11. Islamic terrorists from Algeria highjack a 747 flying from Athens to D.C. they have loaded a nuclear weapon on board, and they are giving the US government until landing time to free one of the leading Islamic terrorist they have in custody, or they blow Washington. A small team of soldiers are sent out in a small aircraft, which will latch on to the jet and allow them to board in secret. With them is intelligence consultant David Grant, who knows that there is a bomb on board and what it is capable of. confined to the labyrinth of tiny corridors and storage cabins, our heroes have only a few hours, to find the bomb, defuse it and take out the terrorists, without being seen.<br><br>This is the directorial debut for Oscar nominated editor Stuart Baird, and he does a sensational job of crafting tension. It is not until the climactic twenty minutes where Executive Decision lets out all its energy. Baird really takes his time, and just occasionally it feels like the story could use a little tightening, but not too much.<br><br>The movie is not meant to be mind enriching, but in a way it does make you realize, how much we took freedom and safety for granted, before 9/11 occurred. If that disturbs you, than perhaps you should not see this movie. Anyone else who wants to be thrilled and on the edge of their seat should watch this one for sure","user":"Samiam3","rank":[35,37]},{"title":"Does most things right","rating":8,"date":"2 June 2015","review":"This is a great 90s action movie. It has the exciting moments, the interesting plot and the mixture of characters that the period's action movies all tried to have. But at the same time, it downplays the one-man heroism that is often a big part of them (looking at you, McClaine!). The movie refers to this with the character played by Segal.<br><br>The most important part of this movie is the team. Early on people tries to break with the team, but mostly everyone is on the same page throughout the movie. At the end of the movie, one character kind-of goes against his team, but the focus is also on trusting one's teammates, something that the other guys does during this moment.<br><br>If you want a quintessential 90s action flick, this is a good pick!","user":"peefyn","rank":[14,14]},{"title":"Escapism with a touch of reality","rating":8,"date":"4 July 2005","review":"I saw this in 1996 and thought it was extremely entertaining--an action movie with emphasis on suspense over shoot-em-up thrillers and explosions. Seeing it again, after the events in the past 4 years, is a different experience. Some of the fictional dialog has actually been quoted by fanatics in the news. I had the same reaction with Black Sunday with Robert Shaw. A movie meant as pure escapism is now more like \"what if.\" Executive Decision does ask you to suspend disbelief several times, especially near the end. I would rank it up with Air Force One, which came out a year later and delivers the same type of \"suspense over explosions\" entertainment. And this film deserves extra kudos for making the ones that save the world a bit on the \"misfit\" side (Oliver Platt, John Leguizamo, Joe Morton, BD Wong, and yes, even Kurt Russell). Another nice slimy role for late character actor JT Walsh. And David Suchet makes a scary villain. Like the best villains (Alan Rickman from Die Hard comes to mind), he can be charming and terrifying at the same time.","user":"Katz5","rank":[52,63]}]