[{"title":"Grindhouse action at it's finest","rating":7,"date":"5 May 2008","review":"If your cup of tea is martial arts action, then this film is for you. It has lots of action, female nudity, more fighting, some ridiculous Japanese character in black-face, fighting on the rooftops, drugs, burning houses, more nudity, more fights; it just goes on and on.<br><br>Somehow there is a point to all of this, but it just seems like Sister Street Fighter's Greatest Hits. A thin story about using chemicals to smuggle gold and a friend forced to be the mistress of the kingpin is just an excuse to have fights. Many of the fights are pretty lame, with the loser going down quickly. But, hey, it's great 70s grind-house fun and the hokeyness is just part of that.","user":"lastliberal","rank":[2,3]},{"title":"The best one of the sequels","rating":7,"date":"7 February 2009","review":"The third installment of \"Sister Street Fighter\" is hardly surprising at first sight. Koryu (Etsuko Shihomi) comes to Yokohama to bring a young girl to her mother and soon gets to fight lots of gangsters. Of course they use the child as a hostage, or rather a bait to get hold of Koryu. Of course they believe Koryu defeated, but then she returns alive and kicking. And of course there is a mysterious stranger again... But after 50 minutes or so I realized this is not a bad sequel, it might even be the best one. Etsuko Shihomi, with the experience gained meanwhile, is a much more confident star of the show. \"Return of the Sister Street Fighter\" shows some of the best locations and even adds something new. The killer with the poor card trick is an obvious homage to Lee Van Cleef in Leone's westerns (the hanging scene on the hill continues that perfectly), while his boss reminds me of an eccentric Bond villain - even making the same mistakes, such as letting the hero escape when he easily could have killed him, or her in this case. I voted 8/6/8/7 for the 4 \"Sister Street Fighter\" movies.","user":"unbrokenmetal","rank":[1,1]},{"title":"Kurata steals the show","rating":6,"date":"11 January 2020","review":"Our girl does her forms demonstrations over the opening credits. The story starts on the streets of Hong Kong. Our girl is sent to Yokohama to investigate a person's disappearance. First, there is a street fight. On arrival in Japan there is another street fight.<br><br>These opening fights are choreographed to appear as what the audience would expect a street fight to resemble. However, most real fights end up on the ground. Ground fighting was rare to see in early 1970s movies. Otherwise the fights looked good. Another thing, if I arrived at a fight on a motorcycle I would keep my helmet on. In the movies, though, you want to show your face.<br><br>Yasuaki Kurata also appears in this movie. He seems to have replaced Sonny Chiba, He offers his service to the bad guys to kill our girl, similar to the last movie. Things get complicated and he ends up stealing the show. He was the best part of this movie.<br><br>The third of this series and it is starting to get thin. I still rate it above average for the year and genre.","user":"ckormos1","rank":[0,0]}]