[{"title":"Take your mother to see it - but don't ask her to stay over.","rating":7,"date":"22 August 2006","review":"Very few people make bad films on purpose.Mr Stallone is nobody's fool. These statements should be self-evident.Therefore if SOMMWS is so bad why did a reputable director and a canny star have anything to do with it?The answer is that it isn't a bad film at all,when I saw it the cinema audience gave every appearance of huge enjoyment,many of Miss Getty's one - liners induced such laughter that Mr Stallone's rueful responses were often inaudible.I believe the trouble lies in the fact that many critics refuse to accept that Mr Stallone is in fact quite an accomplished light comedian as well as being an action star of proved bankability. As an LA detective having his mother over for a visit he is able to play against type in this fish out of water comedy.As mother,Miss Estelle Getty seizes a rare big screen opportunity and makes every line count.She is an innocent abroad in big bad LA,blithely going where wise men fear to tread. SOMMWS is not ground - breaking stuff,but it is old - fashioned funny. You could take your mother to see it - but don't ask her to stay over.","user":"ianlouisiana","rank":[19,20]},{"title":"The Actors Made this Movie","rating":6,"date":"1 February 2007","review":"I had to give this movie a 6 out of 10.<br><br>The story was corny, the plot was predictable. The supporting cast was lacking. This is not a thriller or an intelligent movie. It is a B comedy., at best. <br><br>But the interaction between Stallone and Getty was fantastic. They play their roles to perfection as anyone from the Northern New Jersey area can attest. They were believable. They were hysterical.<br><br>I would watch this again, just to watch Stallone and Getty play the mom and son role so true to life. They made us cringe. We really felt for Stallone as the son. They made us laugh non stop.","user":"KarenMarieS","rank":[51,59]},{"title":"\"Listen to your mother!\"","rating":5,"date":"14 November 2000","review":"I have little to say about this movie other than it is nowhere near as bad as I'd been led to believe. Actually quite amusing in places, it will strike a chord with anyone who has an interfering mother (and God knows I have!) as Estelle Getty invades Stallone's life.<br><br>I fail to see the reason for all the bad spirit directed at this film. The incidental music is a little repetitive and it's admittedly a one-joke plot. But it is a fairly good joke, and would have made for a superb hour-length TV movie. Unfortunately it's a 90 minute cinema film and so doesn't maintain its momentum all the way through.<br><br>I've seen people criticise the film for Stallone not getting to be \"funny\" in this movie. I mean, have you heard of a straight man?? Sylvester's contribution to the comedy is his underplayed reaction to his mother's obsessive behaviour. What do you expect him to do, dress up and tell jokes?<br><br>Admittedly, the surprisingly violent aspects of the film don't sit well, and it's hard to laugh at Getty when she's just shot a man and splattered his blood all over an airplane runway. Another problem is that her chemistry with Stallone isn't as pin-sharp as it could be; the two leave notable pauses in between lines. Maybe a few more takes could have honed up the reaction time, but generally it's fine, and Stallone really makes an effort to make it work.<br><br>Not an all-time classic, certainly, but a pleasant enough film to pass a Sunday afternoon. Just don't listen to the nay-sayers, watch it yourself and make up your own mind. 5/10.","user":"The_Movie_Cat","rank":[27,32]}]