[{"title":"Touches places in the soul never dared to be reached before","rating":12,"date":"12 December 2003","review":"Other reviews I have read here do a great job of summarizing the plot and key elements of this film.  I just want to reiterate, first, how incredible the cast is.  Working in a plot that demands attention to and awareness of subtleties, *every* actor, on down to the smallest part, puts forth flawless performances, and are directed brilliantly.  If I was John Turturro, I'd have calmed it down a little, but if he did that, he wouldn't be John Turturro. :)<br><br>Isabella Rossellini is given the strongest role of her career (I mean, in *Blue Velvet*, she was scorching and daring, but she was played as a bit of an archetype and dream figure, and not as a woman struggling through a life crisis in quite so identifiable a way).  Rather than fall prey to playing her role as an insensitive wife who doesn't understand the extraordinary passage her husband is undergoing, she is given the chance to really be a hero in her own right.  She could *never* understand--but she tries to--and gives extraordinary credibility in a role of struggling to give what she can as Jeff Bridges' Max Klein hurtles himself into his obsessive self-made universe from his ordeal and survival.  When it's clear she can no longer do that, she becomes a noble warrior to fight for her own sanity and that of her son.  The procession of her character is flawless and every moment feels right.<br><br>The interplay between Rossellini and Rosie Perez is played out with unexpected honesty, restraint and brilliance.  Perez' Carla has her own parallel situation, with a husband who completely can't understand why she won't exploit the situation for all she can get in court (a great early small performance from Benecio Del Torro).  He is, like Rossellini, troubled by the bizarre and nonobvious intimacy that has developed between his wife and Jeff Bridges, two people whose lives might never have ordinarily crossed.  Perez is, as has been mentioned elsewhere here, devastating. Her grief over the loss of her son is sustained and utterly utterly credible.<br><br>This brings us to Jeff Bridges.  Man, oh man, this is his career masterpiece performance--arguably the greatest leading acting role of the 1990's.  He *gets* what writer Rafael Yglesias and Peter Weir are narrowly aiming for here, and it's something no other movie has approached that I've seen. It is--the instantaneous and seemingly lifelong bond that develops between those who have been through a life-changing crisis, and how that can completely absorb them to the exclusion of *everything* else in their lives. What sounds like a subtle point here is **nailed** by Yglesias and Weir, and I can't imagine another actor who could have gotten what that feels like.  I know from personal experience--mine was nothing like a plane crash--but the phenomenon that this movie ventures to explore that I just described, which may seem like mostly bizarre behavior shifts in Bridges' character to those who haven't experienced what I'm talking about--is in fact as real as love, fear, or passion itself.  What Bridges realizes in putting together Max Klein is that he's *utterly* lucid--he feels as though he sees things as clearly as he ever has in his life and *never* wants to let that clarity go to revert to a more \"rational\" way to confront the trauma he has gone through.<br><br>Others have mentioned the \"why didn't this get bigger press\" issue.  The studio was quite nervous that this was an art house movie and didn't promote it as heavily as they might have.  It actually did quite well at the box office initially and early advocacy for Bridges and Weir to get Oscars were definitely out in the review stream, but this had the misfortune of being released *just* before a little movie called *Schindler's List*, which summarily grabbed the cinematic spotlight and completely eclipsed everything else at the Oscars.<br><br>Director Peter Weir himself considers this his greatest work and was greatly stung by what he considered the slight it was given by Hollywood and the public.  In many ways it has shaped a cynicism towards Hollywood he has had ever since, and it would be five years before he'd find it in himself to direct another film.","user":"wayne-112","rank":[80,84]},{"title":"jeff bridges at his best","rating":21,"date":"21 July 2004","review":"Jeff Bridges has been called the most underrated actor of his generation, and 'Fearless' speaks to the truth of such a claim. Equally overlooked is Australian director Peter Weir, who, like Bridges, was snubbed by the Academy Awards for 'Fearless.' The film was almost totally ignored by the Academy, perhaps due to the fact that 1994 was the year of the historical/political epic--'Schindler's List,' 'In the Name of the Father,' and 'The Remains of the Day' were the big winners that year, casting a bit of a shadow over a film about a rich white American suffering from PTSD.<br><br>Based on the novel by Rafael Yglesias, 'Fearless' is the story of Max Klein, a successful San Francisco architect who survives a horrific plane crash. Among the casualties of the crash are Klein's partner and best friend and the only child of Carla (Rosie Perez), a young Puerto Rican woman from Oakland who blames herself for her son's death. Prior to the accident Max suffered from an acute fear of flying; when the plane goes down, his fear becomes so intense that he accepts death. When he survives the crash, he suffers from a form of post-traumatic stress syndrome in which he can no longer feel fear because subconsciously he has already faced death. His condition creates a rift between himself and his family, a gap he tries to fill through a friendship with Carla, who is similarly afflicted with PTSD.<br><br>Bridges gives a tour de force performance as Max, who is simultaneously heroic (he leads other passengers to safety believing he is guiding them out of the plane into heaven) and contemptible (he is unspeakably cruel to his family and leaves his wife temporarily to pursue a relationship with Carla).<br><br>He's not sure whether he's alive or dead, and he is frequently drawn to test his fear and uncertainty through ludicrously dangerous stunts like dancing on the edge of a skyscraper's roof or walking calmly into speeding traffic. It's an unflinching and emotionally honest portrayal of a psychologically damaged man unsure that he has the strength or will to be healed. <br><br>Equally stunning is Rosie Perez as Carla, a devout Catholic who believes that her baby's death is a punishment from God and is nursed back to normalcy by the agnostic Max. <br><br>Other supporting actors are also captivating: Isabella Rosselini as Max's wife Laura, who loves her husband desperately but is unable to cope with Max's alienation from her and their son Jonah; Tom Hulce as an overeager but well-meaning attorney suing the airline on behalf of Max, his partner's family, and Carla; John Turturro as a psychiatrist specializing in PTSD hired by the airline to help the survivors cope with the after-effects of the tragedy; and Benicio Del Toro as Carla's husband, a poor carpenter who can't help but feel giddy about the possibility of making millions off of his son's death. Perhaps most moving is Deirdre O'Connell as the widow of Max's partner--the scene in which Max arrives at her home to confirm that her husband did not survive the crash will break the hardest of hearts.<br><br>The film is brilliantly directed by Weir, who captures the surreal nature of Max's condition masterfully.<br><br>'Fearless' is not an easy film to get through, perhaps even moreso in the wake of 9/11. The subject matter is emotionally wrenching, and its presentation is utterly unsentimental. Max is heroic, but he is also a victim, and Bridges' performance captures the tension between Max's newfound love of life and his near-psychotic need to continually face and overcome his fears. It's a tear-jerker, and it's certainly haunted by the ghosts of the dead, but it's well-worth watching if only for the pleasure of seeing one of the best actors in the business at his best.","user":"eht5y","rank":[97,104]},{"title":"great character study","rating":11,"date":"11 October 1999","review":"I had heard about Fearless for a long time and was never in the right mind to see it. It's the story about how survivors of a plane crash cope with life afterwards, their neuroses, fears and personal demons. It is a quiet film, so quiet that one can barely hear the inner tremblings of the main character.<br><br>He is a survivor without fear. He has summoned up a supernatural lack of fear towards life and psychological health now that he has survived a plane accident. In times of crisis, he has the ability to block fear and to live on adrenalin alone. He has become in the eyes of the other plane passengers, a hero and an inspiration.<br><br>But even though this lack of fear is his saving grace, it is also threatening to jeopardize his life. He copes with the nightmares and emotional traumas with  the same reaction that helped him along on that fateful day. But in real life, this way to cope is unhealthy and even dangerous. One must live afraid to be a normal person. One must worry about finances and loss of love.<br><br>The film is imperfect, as any great film should be. There are slow moments and perhaps a little too much pop psychology. (But the film is as subtle as it gets). There are marvelous character touches, such as a lawyer trying to file a lawsuit who keeps apologizing for his greediness. (The film exposes the genuine dilemmas of trying to compensate victims and their families).<br><br>Perhaps the most amazing scene is a reenactment of the plane crash itself. I won't give anything away about the story, but the scene is hauntingly beautiful; it shows the overwhelming force of the wind and the earth ripping apart the fusilade and all the parts of the luggage and cabin that humans normally deal with. It is a violent, horrifying scene and a horrifying memory, but for the main character, he can imagine it with the appropriate distance and  without the pain. This accident was the defining moment for his life, and after that scene, we realize how amazing it is that he and the rest of them could have survived, and how fragile their life was in the face of overwhelming force.<br><br>This story imagines a disaster and how useless it is to be afraid of a force more powerful than any individual (and that is the main character's profound insight).","user":"rjnagle","rank":[51,55]}]