[{"title":"Quite superb... captures PKD's visions well.","rating":8,"date":"13 February 2006","review":"I have no idea why this movie is such underrated. Yes, Gary Fleder is no Steven Spielberg or Ridley Scott. He doesn't have the excellent imagery or visual wonders of the other directors' films. But at the same time, he has been more faithful to the original short story than Scott or Spielberg could have been. He has added only one major twist which made the film rather more interesting. And one major credit of the film is that it could capture quite obviously the feel of paranoia that's been the mainstay of Philip Dick's most stories.<br><br>Gary Sinise is always pleasure to watch on screen. And in this case his performance is flawless. D'Onofrio plays the tough security officer with enough passion. Madeline Stowe is rather frigid in her role.<br><br>In short, 'Impostor' is a gripping tale with solid plot and enough substance. A must see for every genre fan, regardless of the fact that one of the greatest sci-fi writer has penned the story.","user":"shanfloyd","rank":[74,83]},{"title":"\"Those who deny the existence of robots may themselves BE robots...\"","rating":9,"date":"26 October 2002","review":"The previously posted comment for this film would have successfully steered me away from it... If I weren't such a huge fan of \"Criminal Intent\" (Vincent D'Onofrio) and \"Monk\" (Tony Shalhoub) that I had to see it anyway.<br><br>I wondered throughout the movie, \"Is this guy (Gary Sinise) a robot or NOT???\" The sets and direction (not to mention the performances of Gary Sinise and Vincent D'Onofrio, which were intense) sucked me in. D'Onofrio makes a fabulous driven investigator. Shalhoub's role was small, but I was too busy grooving on the plot to care. My one regret in the performances is that Madeline Stowe didn't have much to do, except alternate between the roles of a stereotypical uber-doctor and a limpid, grieving wife. The one scene that hints at her acting talent occurs when she confronts her husband at the abandoned park.<br><br>Granted, the film does start out like it's going to be typical sci-fi schlock, but once it was past the first 15 minutes, I almost forgot it's science fiction.<br><br>The bottom line: This movie WORKED for me! 9 / 10 stars","user":"kdm042","rank":[43,48]},{"title":"Superior Sci-fi Film","rating":7,"date":"13 January 2003","review":"Like Total Recall, Impostor was based on a short story by Phillip K. Dick. (Dick's stories were also the inspiration for Blade Runner and Minority Report.) In my opinion Impostor is a solid science fiction film.<br><br>\nThe core of these stories by Dick has to do with the nature of reality and Impostor is no exception. If we have memories implanted in our minds, how can we tell what is real and what is an artificial memory? Added to this in the movie is the change in a society that comes from years of war. Can we have freedom and human rights when anyone can be a spy? This combines two great traditions in sci-fi; illusion vs. reality (Total Recall) meets taking over our minds and bodies by an alien power (Invasion of the Body Snatchers).  <br><br>Add to the great story concepts is superior acting by Gary Sinise and Madeleine Stowe. The supporting cast is good with Vincent D'Onofrio playing a complex character. Is he a villain? Nothing is as it seems.<br><br>\nWith all of these positive comments, I cannot give the film a 10/10. This is a low budget film which first started as a short film and grew into a feature. While the story of Impostor IMHO is superior in some ways to Minority Report and much better than typical sci-fi, the lack of money for Impostor shows. <br><br>The director, Gary Fleder is no Speilberg, Ridley Scott or even Paul Verhoeven. Sometimes the pace of the film seemed to need tighter editing. The script in the central part of the film could have used more work to learn more about this world. And the music was just ok in supporting the action and emotion of the film. <br><br>Still Miramax was right to decide on making this a feature film rather than a short subject or straight to TV film. Impostor has some great sci-fi story ideas and good performances. 8.5/10","user":"BB-15","rank":[59,68]}]