[{"title":"Satisfying and mischievous adaptation of Roald Dahl's childrens' classic..","rating":20,"date":"20 May 2003","review":"The Witches is the rarest thing you'll ever see: a black comedy for children. Adults just assume that kids don't have the level of wit and sophistication to appreciate sly and sarcastic humour, but here that theory is challenged with a vengeance and this film proves itself to be a wickedly entertaining, knowingly cruel pantomime.<br><br>The story finds a young boy named Luke moving in with his Grandma following the death of his parents. She lives in Norway and is something of a witch expert. Pretty soon, she has filled his mind with tales of witchery and caution. Grandma falls seriously ill and is advised to go to the English seaside to recover, accompanied by Luke. Whilst there, Luke uncovers the fact that the RSPCC meeting in the hotel is actually a front for a society of witches. He is captured by them and metamorphosised into a mouse, but still comes up with a plot to wipe them out.<br><br>This film is enormous fun, punctuated by offbeat performances (Huston as the Grand High Witch of All the World is terrifying and funny in equal measure) and splendid puppet work. The story uses the moral that children should \"never talk to strangers\", but enhances it with the  ingenious and disturbing premise of witches being responsible for evil acts towards children. The story has real pace and purpose, and constantly turns up another surprise or twist just when you think you've figured out what's coming next. The supporting performances are very nicely judged (Atkinson as the snooty hotel manager, Zetterlig as the wise grandmother, etc.). All in all, this is a must-see kids' flick for kids and adults of all ages.","user":"barnabyrudge","rank":[55,60]},{"title":"i've always thought this was a great movie","rating":10,"date":"10 March 2005","review":"i've always thought this was a great movie since i was little, it was one of those movies that you'd go over to see at your grandma's on Halloween, just scary enough for a kid, where the'd be afraid, but not usually enough to give nightmares(although i can remember having a few from this- those with very small children be warned!) i felt that the tales that the grandmother spins are the tantalizing part of the movie, with them being treated as a joke in the beginning, but then going on to, not only back them up, but to show that they actually happened. i feel that this was a very well put together movie, and Anjelica Huston as the grand high witch gives the movie a special flavor, like she was meant to play the role. If i talk much more i'll end up giving the thing away, so i'll leave you with this- it's a wonderful movie for kids, and, for hose adults who haven't seen it, when watching, keep in mind that this is a children's movie:) enjoy!!","user":"ryanmcirish","rank":[53,58]},{"title":"One my favorite childhood ... and present.. movies!","rating":10,"date":"17 July 2004","review":"This is a movie which is highly underrated. It is a fantastic adventure about a young boy and his wise grandma who go on vacation along the English coast. Unknowlingly running into Grandma's most feared enemy- the Grand High Witch. When Luke accidentally crosses paths with the Grand High Witch and her Witch minions, it is up to him, Bruno Jenkins, and Grandma to save all the children of England! <br><br>Anjelica Huston does a marvelous job at portraying the snobbishly aristocratic Eva Ernst as well as her unmasked counterpart, the evil Grand High Witch. She definitely steals the show in this one, although Mai Zetterling does give one that warm nurturing feeling as the wise but kind grandma. And Jasen Fisher did a good job as well.<br><br>Not only is the acting good, but the special effects.. or should i see puppets and makeup.. are marvelous! The grand high witch without her face mask is really a terrible sight! And the little mice, really puppets opposed to the technological computer created special effects, really work out great and give a more earthy feel non animated animal movies.<br><br>If your an adult and your looking for a nail biting psychological thriller your looking in a very wrong direction. But if you are looking for a classic, fun, adventure for all ages- I suggest you watch this. I give it an A+!!!!!!!!","user":"parkguy505","rank":[38,42]}]