[{"title":"Tough in the trenches.","rating":21,"date":"21 April 1999","review":"In some ways I felt as though I'd died and gone to heaven the first time I saw Riff Raff, an out and out honest look at working class men of varied, and sometimes dubious, backgrounds connected through their work on a construction sight in London.<br><br>The cast of characters defines the term 'mixed bag'. I couldn't help but think of a half dozen or so Archie Bunkers on the job site, each one with their own set of priorities, talking about the most important thing in the world, to no one but himself. It all brings a smile to my face.<br><br>Our closest look is at Stevie (Robert Carlyle of \"The Full Monty\"), a former petty thief, who works with a crew converting condos for the nouveau riche, while he's forced to break into an abandoned building just to find a place to squat.<br><br>Director Ken Loach expertly focuses on the lower class in Britain (witness his brilliant 1999 feature-\"My Name is Joe\") where the honesty laced with humor of his viewpoint tends to provide humanity to an otherwise ignored sect. To shine a bit of light on an otherwise dismal existence as it may.<br><br>Loach's characters are never overly redemptive: they don't hit the lottery; aren't left millions by a dead aunt; or marry a rich suitor. And the ending here is a bit short, trite. But they usually come through the film a little stronger having weathered their travails, feeling a little better about themselves. I dare say we come through feeling a little better about ourselves as well.","user":"Doctor_Bombay","rank":[19,20]},{"title":"A Truly Remarkable Film, ver close to home (literaly!)","rating":18,"date":"18 June 2003","review":"I first saw this film, drunk one Friday after a heavy nights drinking after work on a building site. I was then a bricklayer - a job I had done for over five years. Watching this film, it dawned on me that this was filmed in the part of London where i lived. I could truly relate to it and I would have sworn that the actors had themselves spent their lives working on sites it was so realistic. Go to any site and you will see at least one character who you could say directly related to a charater in this film. The safety aspect has been cleaned up a lot now but back then, sites were a dangerous place to work. Accidents were common and the end scenes were not in any way unrealistic.<br><br>The thing that did it for me was the portrayal of the working class of Britain. The sentiments were all there, the humour, the desparation, the sense of wanting to rise above the rest and the shattered dreams. They are all here. I would say that if anyone from abroad wanted to study the character of the British working class then they MUST see this film. It is tough, gritty and full of humour...a truly remarkable piece of film that is sadly neglected.<br><br>\nBuy it, Rent it, Steal it, Borrow it...whatever you do SEE IT!","user":"vikingraider1","rank":[39,45]},{"title":"Powerful 1980's Thatcherite comedy-drama that is well worth watching.","rating":8,"date":"21 October 2004","review":"It is rare that a drama is anything about your life or any part of it. I apologise is your job is searching for serial killers or on your way to becoming a world sporting champion after overcoming cancer, but what we have here is a little bit of (UK) working class reality. Trust me I was there and so was the late writer Bill Jess.<br><br>(Jess died shortly before this film came out.)<br><br>I worked on a building sites at weekends as a 15 year old and although I have no pictures or film to remind - at least I have this and the buildings that I helped construct.<br><br>I have met all of the people under the loop here (not always on building sites though) and, to be quite frank, it is all a bit frightening. However I lived in a predominantly white district so I had no experience of on-the-job multiculturalism, and that is the only part I cannot really comment upon or relate to.<br><br>Robert Carlyle is a genius at portraying the British working-class. Maybe he is the real thing, in part, but he seems able to transform himself physically as well as mentally. I have never seen him overact in anything and he has had plenty of opportunities. He even takes on impossible parts like Hitler!<br><br>Here he is a Glasgow jailbird, squatting in London and hoping to make a few quid on the black economy. He hooks up with a girl that claims to be a singer and poet, but is actually only in to hard drugs. He deals with the situation the best he can using the only language he can.<br><br>London is the 1980's was one of the cheapest places in the world to live. You wanted a flat? - get a crowbar - here's your flat! Well for a short while before the heavy mob show up. That is how the rock group The Police first got to live in our capital city!<br><br>(Today building sites are full of foreign workers - some legal, some not - that don't squat but live in the back of vans parked on or near the site.)<br><br>Strangely, Ricky Tomlinson became a actor after being banned from building sites due to his political activities. In 1973 he sent to jail (see his IMDb bio) in an episode that shows British justice at its worst: Charging someone with a serious offence and then trying to get a guilty plea in return for a lesser charge. Ricky - being a man not a mouse - didn't fall for it. Others did, making it look extra bad for him.<br><br>He later went to be a popular man on TV and British film and will earn over a million dollars from his autobiography \"Ricky\"!<br><br>What makes this film even more frightening is the dramatic conclusion. Something similar (although not quite as serious) happened where I worked - although not while I was there. <br><br>In a coincidence that would make a TV script writer blush I was with the boss of the said firm in a van and we passed the subject in the street. \"He got very lucky,\" said Mr Boss-man waving from the van, \"he landed on his head and that is what saved him.\" It was pure Ken Loach moment, so I hope he is reading this.","user":"Pedro_H","rank":[20,23]}]