[{"title":"Edge of the seat","rating":9,"date":"1 August 2009","review":"Samuel L. Jackson is probably one of the most awesome actors that ever lived, and his pure uncut awesomeness is captured perfectly in this well thought-out thriller. He's angry. He's looking for justice. Don't get in his way. The plot moves at a breakneck pace, and the length of the running time will probably go completely unnoticed because the direction looks so compact. This movie is over two hours long? I really have a hard time believing that. It just flies by, even though most of it happens in and around one location. With a build-up this exciting, the conclusion is usually a disappointment, but even that's not the case here. This is a rush of adrenaline captured on celluloid.","user":"Sandcooler","rank":[17,17]},{"title":"An intelligent, taut thriller","rating":11,"date":"11 May 2002","review":"Just when you think he's cornered, he thinks of a new strategy. Samuel L. Jackson portrays Lieutenant Danny Roman, police hostage negotiator. When he's framed for a crime he didn't commit, against his fellow police officers no less, he knows that the only way out is to bring in an equally tough negotiator, Lieutenant Chris Sabian played by Kevin Spacey, who's from another precinct and who therefore could not have been contaminated by the bad elements within his own force, which buys him the necessary time to bluff and blindside while he finds the clues he needs to prove he's innocent. Chicago is taken hostage along with the few people he retains as bargaining chips, and we are taken along for the ride. This was a masterful job of film-making from beginning to end. The characters and story were flawlessly developed. We don't precisely know who's guilty or who's innocent. Roman conducts his interrogation and trial while he negotiates with the police outside, some of whom are working overtime to eliminate Roman before he figures it all out. This all occurs right under the noses of the FBI who are in way over their heads and don't have a clue who's guilty or innocent, just like the rest of us watching. Along the way, we get to witness Roman lecture his underlings about the finer points of negotiations while he himself has just become a hostage taker. \"Never say no!\" he barks with effective zeal. And he tests his bewildered pupils continuously, who fail continuously. Only Sabian is smart enough to understand what's going on in Roman's mind. The strategy is shared by two men who think alike, who are under stress, and have an innate instinct for lie detection. The screenplay was terrific. The cinematography was effective. The acting of Jackson and Spacey exceptional. And the supporting cast, particularly bad-guy-turned-good-guy Paul Giamatti who provides great comic relief, was outstanding. If you're in the mood for an intelligent, taut thriller, The Negotiator delivers... 9/10.","user":"Arthur-23","rank":[102,116]},{"title":"Strong, Intelligent movie-making","rating":9,"date":"8 August 1998","review":"The Negotiator presents us with both of two things in a summer full of flicks only containing one or the other: ambition AND intelligence.  It doesn't have any qualms with taking a far-fetched concept and treating it with absolute seriousness, but unlike most movies that are willing to do this (especially some recent ones involving very large asteroids and very large lizards), it is able to pull it off by combining a tight script with strong, strong acting.<br><br>If this were a perfect world, Jackson would deserve an Oscar nomination for his performance here.  There's no way on Earth he'll get it, of course, but he's given the difficult role here of playing a guy who has to convince the guys downstairs that he's a psycho, while convincing the guys he's kidnapped that he's innocent, and he does a flawless job of it.  No easy task, especially when you consider the fact that he's got to throw in the occasional gunfight.  At least he'll probably win the MTV award :)<br><br>What results is a skillfully made film.  I enjoyed it.  It made sense but kept me guessing, the action was intense but still followed logical patterns, and the ending was not a disappointment.  An altogether fun experience.","user":"Shaf-2","rank":[73,88]}]