[{"title":"One heck of a creepy film....perfect 'sleazy' talent","rating":8,"date":"3 September 2007","review":"I first saw this film in '96 shortly after it came out. My then-bf's dad rented it cause it was a thriller. Back then I didn't know what an Indie film was. Regardless, this one shines a very different light on Reynolds' talent. From the stereotype ladies-man, machoism his fans have long known him for, he takes a few steps back here to a darker, more sinister role (less, later on as 'Boss Hogg'). He starts out as the hunky car mechanic..... coming to the aid and rescue of Mia Sara and daughter. But obviously somethings not all there when he cons an engine prob, offering Sara a call from his own house. Only to \"kidnap\" her and her young daughter to become companion and house slave to his demented wife (Dickinson). Creepy. There are several moments of ill-found passion where he bullies Sara, and at one time, nearly rapes her, only due to the ghost of his wheelchair-bound demented father....and a hidden, grotesque family secret.....revealed in all hellishness at the end.<br><br>A must see.","user":"prfrmr","rank":[6,8]},{"title":"I enjoyed it!","rating":21,"date":"21 June 2001","review":"Burt Reynolds finally goes completely insane in this direct-to-video psycho-horror flick about a deranged father who'll stop at nothing to protect his family secrets. Mia Sara is quite good as the hapless victim and disturbed child Jill (Candy Hutson) is entertaining.There are also some gruesome parts such as Cassie's fingernail coming off. Most people have gave this film bad reviews but i enjoyed it and would definately consider watching it again.","user":"twisted_sista","rank":[8,12]},{"title":"4 stars for Burt's toupee","rating":4,"date":"2 October 2019","review":"This film is not good. The acting is awful, the pacing is awful, it's only redeeming quality is Burt's toupee as the only reason I kept watching was to see if it would actually jump off his head. Don't get me wrong, I love Burt Reynolds but I can only assume his star was waning by the time this came along.\nThe main problem I have with this is that I have no idea what it is. Thriller? Horror? Comedy? Absolutely no clue. The only thing I do know is that it's not good whatever it's supposed to be. I'm just sad to see Mr Reynolds doing his best in this Turkey.","user":"sforrester-3","rank":[2,2]}]