[{"title":"\"The cinema has given us its foremost tragedy.\"","rating":12,"date":"12 December 2002","review":"I start with this quotation from French philosopher Jean Paul Sartre, as it exemplifies how strong emotions were in the social turmoil that this film revived in 1963, 30 years and a world war after the real life crime committed in France by the Papin sisters. Or rather, how the breaking of three taboos at once, incest, lesbianism, and workers revolt, always stirs a turmoil of passions.<br><br> André Malraux imposed the showing of this film at the Cannes Film Festival 1963, after a public declaration of support from a large number of French intellectuals and artists, amidst a major uproar and social criticism. The followers of the Surrealism movement took the Papin sisters case as paradigm of class revolt, and a signal that a social revolution was already taking place. Romantics saw in these grisly murders the emergence of absolute Evil, like Lautréamont in `Les Chants de Maldoror'.  Philosophers engaged in the socialist movement wrote passionate texts in defence of those maids, like Jean-Paul Sartre in `Le Mur', and Simone de Beauvoir in `La Force de l'âge'. Jacques Lacan,  in `Écrits', will develop his first scientific essay on psicoanalysis, following the Papin criminal case. Jean Genet wrote `Les Bonnes' (English translation, `The Maids') pages that are still considered a must on the sombre aspects of humanity, and creating a sacrificial arena where death is preceded by its simulation - something that movie director elevated to the title of his film, `La Cérémonie'. An earlier made-for-television film by Michel Dumoulin, `Les Bonnes', is lesser known. Recently, two remakes brought controversy among critics again, in Europe and the United States: Nancy Meckler's `Sister, My Sister' (1994), and Jean-Pierre Denis' `Les Blessures assassines' (2000).<br><br> However, this older film or Genet's play are still recommended, by their treatment of the subject, and the dramatic intensity they reach.","user":"Artemis-9","rank":[16,24]}]