[{"title":"Consuming Passions","rating":3,"date":"3 December 1999","review":"Roman Polanski again explores the depths of the human psyche in Bitter Moon, a magnificent epic tale of obsessive lust and the oh-so-familiar winding course of a passionate romance gone sour.<br><br>Bitter Moon centers around a familiar Polanski theme, that we are capable of being both torturer and victim, and usually both simultaneously.  For anyone who doubts the validity of much of the past century of French intellectual thought, from the likes of Andre Gide, Foucault, and others, see this movie. For anyone who has been in a painful twisted relationship, see this movie. You will understand it.  Some of it might be hard to stomach but that is the nature of truly great filmmaking.<br><br>A beautifully crafted movie, almost lyrical at times, Bitter moon is set in contemporary Paris but is told in a series of long complex flashbacks superbly narrated by Oscar (a terrific Peter Coyote) to Nigel (Hugh Grant as the usual British prat), both passengers on a  cruise ship to India.  Nigel and his wife Fiona, played by Kirsten Scott-Thomas, are on a holiday to enliven a stable but stale marriage.  The couples become embroiled through the lurid tale of Oscar and Mimi's (Emmanuelle Seigner) love affair. Emmanuelle, Polanski's real-life wife, is superb and her incredible performance takes her from sumptuous beauty to complete wreck, a performance that deserves far more praise than was received.  The lack of attention to her performance in this movie is no doubt due to the notoriety in the puritanical American press of her husband.<br><br>As a whole, Bitter Moon may not be Polanski's best film but some periods of the movie represent his very best work.  Throughout, limits are pushed to the brink of tastelessness but Polanski masterfully pulls back just in time. The direction is complex and highly sophisticated and the movie arouses a range of emotions from dread to empathy to disgust to hilarity.  The story line is far too complicated to synopsize appropriately in this review. Bitter moon is a great film, one of this reviewer's top 10 for the 1990s. Another must see!  A word of caution, however, Bitter Moon is not a good date movie.","user":"dragon-90","rank":[90,99]},{"title":"Polanski doing what he does best","rating":8,"date":"21 March 2005","review":"Bitter Moon once again sees the master of the macabre, Roman Polanski, doing what he does best. With echoes of his earlier film 'Knife in the Water', Bitter Moon is a story of lust, revenge, betrayal, dependency and most of all; love, wrapped tightly around a coil of taboos and sexual perversions. While not as good as some of Polanski's other works, Bitter Moon still stands out as a highlight of his filmography and is certainly a lot better than many people have reputed it to be. The film follows two very different couples on a cruise ship; An English couple, Nigel and Fiona and an American cripple, Oscar, who is married to the French seductress Mimi. After meeting Mimi in the ship's bar, Nigel becomes entranced by her and later meets her husband and proceeds to learn his and wife's story...and it's not exactly pretty. With this movie, Polanski has obliterated the barriers of decency, and sometimes even makes you, the viewer, uncomfortable due to the goings on. And that's the mark of someone that knows how to handle his audience! <br><br>The acting in the movie really is first rate and there isn't a weak link there, especially not within the four leads. I'm no fan of Hugh Grant, in fact I hate the man, but he's exactly the right casting choice for this movie and it's almost a shame that he went on to make lots of rubbish movies after it. The two women, played by Kristin Scott Thomas and Emmanuelle Seigner are well done in terms of the characters and the acting, but it is Peter Coyote who steals the show as the abominable Oscar. His character in this film is the sort that actors can really get their teeth into, and Coyote bites down hard in this movie. Polanski's direction is excellent as usual and the gritty style mixed with the great director's edgy camera-work help to create a claustrophobic environment that allows Polanski to perfectly portray his characters' mindset. The themes on display are impressive, and in spite of the fact that it oversteps the mark on several occasions, Polanski's film always feels real and the lesson in the love that the film teaches is duly noted. Bitter Moon is a film that will get under your skin and stay there and not only that but there's enough happening to ensure that this is always a fun watch. Recommended viewing.","user":"The_Void","rank":[53,62]},{"title":"eerie life, arcane love","rating":10,"date":"21 March 2004","review":"when i first saw this movie in 1992 i found it shocking by its erotic scenes and burn-out love story. i noticed it was a good movie, but that was the end of the story.<br><br>now i bought it in dvd and saw it for the 2nd time. it's a masterpiece.<br><br>everything blends perfectly in this film: 1990's paris, the colours of the film (etalonage), the excellent vangelis's music score, the evolution of a love story, the roles played by the 2 couples...<br><br>emmanuelle seigner is great playing the role of a nymph and a sorcerer, peter coyote is magnificent playing the part of a regular guy who gets insane, hugh grant becomes a perfect boring middle-class british bourgeois and kristin scott thomas her discreet wife looking for action.<br><br>one of the best amour-fou stories, along with louis malle's \"damage\". as rui wrote before, a must see.","user":"strindbergman","rank":[68,84]}]