[{"title":"Underrated, underviewed.","rating":9,"date":"28 October 2004","review":"People either love or hate this film. It seems to me that, for those who hate it, there is too much going on in the scenes. The dialogue is often open ended, and the action is at times frenetic so that the viewer isn't sure where he/she should be focusing attention. That, I submit, is the true beauty of this unusual movie. It has an over the top realism that makes it a rewarding film to watch multiple times. There are so many layers in the dialogue and the acting, so many subtleties between characters, that you can watch it many times and still be noticing something new. This may be billed a comedy, but it is filled with heartbreak and tragedy, betrayal and disappointments. This is not a run of the mill feel good holiday movie. I think those who rate this movie poorly, in some way, miss that. I hope Jodie Foster directs again. She's immensely gifted.","user":"treedcub","rank":[80,93]},{"title":"torture","rating":9,"date":"20 May 1999","review":"\"Nobody means what they say on Thanksgiving, Mom.  That's what the holiday is all about.  Torture.\" - Claudia<br><br>That is my favorite line in this, one of my favorite movies.  This is a holiday at anyone's home: a congregation of people you love beyond comprehension and hate beyond belief but are bound to by blood.  There are so many wonderful and true moments in this film both funny and dramatic, that I cannot possibly name them all except to say that these moments, even the one between the sisters near the end, are what we give thanks for even if they are painful.  Yes family gatherings are dreaded, but once they are over we are happy to have attended, because somewhere amidst the chaos we remember why we love these people, where we came from, who we are, and what is truly important in this life.  coming to realizations such as this inevitably involves torture. we would much rather not think about it... this movie forces us to. Great movie.","user":"chicklet-2","rank":[51,59]},{"title":"\"The Very Thought of You\" reminds us of the joy in life.","rating":9,"date":"20 May 2003","review":"What I like most about this movie is the atmosphere it creates: the anticipation of returning home during the dreariness of the season's weather, the hustle and bustle of the holiday, the conflict between the loneliness and yet the quiet peace of waking to the first moonlit dusting of snow.  There's always such a buildup to that big day, and then it's over, and, as one titled scene suggests, \"now what?\"<br><br>But what touches me about this movie is what it has to say about love. \"The very thought of you\" is more than a song at the movie's end, it's a theme that permeates the movie: such as when the father watches the home movie of his children, illuminating one of the pivital moments of his life that was only seconds in length, but brings his life such joy and meaning.  The movie reminds us that it is \"the very thought of you\" that brings joy to us all.","user":"jmaret","rank":[40,46]}]