[{"title":"Hmmm, not the best Disney movie I've seen.","rating":21,"date":"21 December 1998","review":"Well, I'd give this a 6 out of 10 because I love Christmas, but really the plot was fairly thin and wasn't this same idea run through in John Hughes \"Dutch (aka Driving Me Crazy) - kid doesn't want to go home (for Thanksgiving in that movie), but then he has all sorts of adventures on the road on his way home and learns his lesson, etc, etc.<br><br>The only problem with this movie is that, unlike \"Dutch\", I honestly didn't feel that JTT had learned his lesson at all, he was still a scam artist at the end. Disney should really learn some lessons from John Hughes / Chris Columbus, they really know how to make a kids live-action movie!<br><br>I was so disappointed because it sounded like a really fun idea, but turned into the plot of a so-so TV movie.<br><br>It's worth seeing, but go on cheap Tuesday, or with free tickets, you'll feel less ripped off!!","user":"Cassie-7","rank":[13,17]},{"title":"An oldie but a goodie","rating":8,"date":"5 December 2018","review":"It's just an all-around warm film with laughs and love for those into Christmas movies.","user":"justin-w-nadolski","rank":[3,3]},{"title":"A really cute film that anybody can enjoy","rating":8,"date":"11 March 2014","review":"A manipulative college student named Jake initially decides to change his tickets from going back home to something else. When he learns that his dad is bribing him with 1957 Porsche, Jake quickly changes his mind. There is only one catch. He must be home by 6 PM. On the eve of going back home with his girlfriend Alley (Jessica Biel) , Jake gets kidnapped when a scheme goes wrong, thrown into the middle of the desert. Jake's main rival Eddie (LaVorgna) ends up driving Jessica home in lieu of Jake. What follows is a string of misadventures for Jake, while he attempts to not only get his girlfriend back, but get home in time as well.<br><br>I love this movie and I'm not ashamed of it. I watched it countless times as a teenager and it was one of my favorites. I have many fond memories of it. When I was a teenager, I had the biggest crush on Jessica Biel. I used to envy Jonathan Taylor Thomas in this movie. Now that I'm older, I don't feel the same way. This is the first time I've seen this movie since 2003. That's a long time to go out without viewing a movie, even after seeing it many times. A couple of nights ago, I decided to put this on. I was curious to see how it would hold up, now that I'm older. It may not be Christmas time, but I was in the mood for something fluffy that would make me smile a lot. I can gladly say, this movie still manages to do the job. This is a movie that anybody can enjoy at any age. It has plenty of laughs as well. Allie's \"I'll have to slug you\" line cracks me up every time. I also howl at the restaurant scene, where Jake tries to get a couple back together. We even get some subtle sexual jokes about Santa. \"Someone else is going down Santa's Chimney?\" It may be family entertainment, but it's not afraid to throw some jabs and take a risk. Jonathan Taylor Thomas is fun as the lead. He makes a great weasel and I never fail to smile at his antics. He definitely had plenty of charisma for his age. Jessica Biel is beautiful, talented as well. I highly doubt you'll see her talking about this movie, but she was solid as the love interest. Adam LaVorgna plays a good slime ball. Gary Cole is a tad wasted as the Dad, but he was good too. <br><br>This is excellent family entertainment. I don't care what anyone says. This is a good movie that has a really good message behind it. What do people expect, an Oscar winner? You can watch this one at any time of the year. Don't be warded off by the low rating<br><br>8/10","user":"callanvass","rank":[3,3]}]