[{"title":"Very scary and realistic movie. As real as it gets.","rating":10,"date":"3 August 2006","review":"Beings that this was Leonardo's first leading role, he was very impressive as Jim Carroll. The movie also stars Lorraine Bracco, Marc Wahlberg, James Madio and Patrick McGaw as his mother and sidekicks respectfully. As an ex-addict myself, I could relate to his story and everything he went through. The movie was so real it brought up a lot of old memories that I thought I had forgotten. I wish every young person was made to see this movie as it takes the fun and games out of even recreational drug use. Not even the strong survive. I give it two thumbs way up and my sincere thanks to Jim Carroll for fighting off his demons to write \"The Baasketball Diaries\".","user":"bobi1369","rank":[100,110]},{"title":"Best anti-drug movie I have ever seen","rating":10,"date":"25 July 2000","review":"This is a very good depressing movie.  But, you can't make a good anti-drug movie without making it depressing.  DiCaprio is brilliant.  Arnie from What's Eating Gilbert Grape, Richard from The Beach, and Jim Carroll from the Basketball Diaries are about Leo's deepest characters.  He is an excellent actor.  The scenes that get you the most are the withdrawal scenes, and everytime he confronts his mother in the movie. This movie deserves a 10","user":"ferreira0665","rank":[60,71]},{"title":"A comparison","rating":10,"date":"13 May 2003","review":"I can't believe that Requiem For A Dream is on the top 250 list but this isn't. I never thought this movie would be so incredibly underrated! This was the only movie that made me completely swear off drugs. The characters are so young and vulnerable and you get to see them slowly fall into this world of drugs and violence and be completely swept away.<br><br>\n In Requiem For A Dream, the characters start out doing some harder drugs and you barely get to see where everything goes wrong, it just seemed to be like that all of a sudden. The characters aren't as likable and I thought it ended a bit abruptly leaving us no knowledge of what is to become of the characters. I have to give it props though for some brilliant scenes like when they all go into the fetal position at the end. <br><br> Basketball Diaries on the other hand gets you involved and attached to the characters. You get to watch them throw away their basketball careers and their lives. The part where Lewis is going through withdrawal is so real and horrible. And after he goes through all that pain, he throws it away and goes straight back to the drugs. This movie is so incredible, I really wish more people would see it and think the same.<br><br>Shay","user":"shay_loves_hayden","rank":[133,169]}]