[{"title":"Not as funny as when I first saw it, but still good","rating":7,"date":"3 July 2003","review":"After seeing the movie about 7 or 8 times, some of the laughs have worn out, but I still have fun watching it.  You can't completely negate a movie that involves a desperate man who tries to gain back the love of his fiance by jumping out of a plane dressed like Elvis.  The flying Elvises concept is definitely an original touch, but there are others as well.  I like the running gag involving Robert Costanzo suspecting that his fat, ugly wife is cheating on him with Mike Tyson because of obviously doctored photos of her and Iron Mike.  There's also that great scene with the 5-year-old Elvis impersonator, who's actually quite good.  Anne Bancroft makes a brief but funny appearance at the beginning of the film.  Peter Boyle also has a funny cameo as Chief Orman, an Indian Chief who has a love for showtunes.  James Caan gives his usually savvy performance.  I could've done without the cliched fat henchman character, who basically repeats everything that Caan says and bumbles all over the place.  Nicolas Cage is over-the-top as the paranoid Jack, but his overacting works in the context of the film, and he's often very funny.  And finally, who can resist a film with tons of Elvis songs in the soundtrack?  <br><br>My score:  7 (out of 10)","user":"MovieLuvaMatt","rank":[19,24]},{"title":"Funny and original","rating":31,"date":"31 October 2001","review":"Like in \"Guarding Tess\", I think this is where Nicolas Cage is at his best, although this one takes the cake as far as his comedies go.<br><br>A well-written, well-acted all around, original movie with some truly hilarious moments and enough drama and complexity to make it a solid, worth-your-while experience.<br><br>James Caan is perfect as the love-stricken gangster, and his object of affection, Sara Jessica Parker, is also great as the fiance who slowly begins to come around to his advances. (She's also quite easy to look at I might add).<br><br>Everything goes wrong for Cage, as he races across hell and high water trying to catch up with the girl he wants to marry, but of course wacky high-jinx ensues.  Hey, if nothing else, you can't go wrong with Las Vegas and Hawaii as your two main locations.  A very good, funny film.","user":"thirdi","rank":[22,30]},{"title":"a fun and enjoyable romantic comedy","rating":7,"date":"3 April 2005","review":"SPOILERS THROUGHOUT POST:<br><br>This was a really fun movie. I watched it solely because Nicholes Cage, one of my favorite actors was in it, so I thought it couldn't be that bad. And I was right. It was actually better then I thought it would be.<br><br>There isn't any way to describe this movie except a lighter, funnier, sappier version of Indecent proposal. While indecent proposal the book, was great, the movie was pretty bad. This however, was a really fun time from beginning to end. Cage and parker make an adorable screen couple and James Caan was absolutely great. This movie hooks you, in the first five minutes, and retains a fun atmosphere throughout. It doesn't hurt that the two main settings for the movie are Las Vegas and Hawaii. The movie will make you want to visit both places. It is also peppered with unforgettable funny characters amidst two great settings, one a non stop party(Vegas) and one stunning peaceful island beauty(Hawai).<br><br>What's also great about this movie is it is actually unpredictable in a few places and I don't say that lightly because there are not a lot of romantic comedies that can do that. Give you the warm fuzzies-oh yeah most of them do that no problem, but it's the rare romantic comedy that can leave you guessing.<br><br>For me, I didn't know, at first, who parker's Betsy would actually end up with. Cage is at first, presented as a jerk who yells almost non stop through the first part. And Tommy actually appears to be, if a little questionable, genuinely attracted to Parker. And the two have chemistry as well. So I wasn't quite sure which road the movie would choose to take.<br><br>That Tommy ultimately becomes much nastier then he was at first presented was, to me, at first a disappointment, and didn't seem to go with what I'd seen so far, but the end made it worth it as this tops many romantic comedies with it's Completely over the top yet somehow appropriate, ending. The sky diving sequence was thrilling, not to mention how fun the Elvis impersonators were. This movie is an easy 7, maybe even a bit higher(7.5) and is a movie I'd completely recommend, it's fun, it's funny, it's pretty, and it's well acted. Makes a great summer's late night watch and should be rated a bit higher on here.","user":"triple8","rank":[14,18]}]