[{"title":"Dracula: Dead and I'm loving it!","rating":8,"date":"18 November 2003","review":"Mel Brooks, one of my favorite directors of all time, he's delivered some of the most memorable comedies: Young Frankenstein, Spaceballs, The Producers, High Anxiety, Blazing Saddles, Robin Hood: Men in Tights. He now brings us Dracula: Dead and Loving it, one of my favorite guilty pleasures. I know there is a bit of hate for this movie because a lot of people say that Mel lost his touch and this isn't as funny as his older films. Let's face it, Mel peeked pretty early in his career with Young Frankenstein, which is one of my favorite films of all time, but everyone is naturally going to compare every film that he made at that point with his greatest movies. But if you seriously are telling me that there was not one scene that you didn't laugh at then you need your funny bone checked.<br><br>The year is 1893, solicitor Thomas Renfield travels all the way from London to Transylvania to meet an important client. As he nears the end of his journey, the sun sets, and the stagecoach driver refuses to take him any further. Kindly villagers plead with him to turn back, but Renfield explains that he is expected. Renfield arrives safely and meets Count Dracula, a charming but rather strange man who is, of course, a vampire. Dracula signs the papers finalizing the purchase of Carfax Abbey in England, and Renfield retires for the night. He wakes up when two Brides of Dracula come gliding seductively in. Dracula then casts a hypnotic spell on the suggestible Renfield, making him his slave. Dracula and Renfield soon embark for England. He goes ashore, leaving Renfield behind. When Renfield is discovered alone on the ship, he is confined to a lunatic asylum. Dracula introduces himself to his new neighbors: Doctor Seward, owner of the asylum where Renfield is being held, and a believer in enemas as a sovereign remedy for mental illness; Seward's assistant, Jonathan Harker; Seward's beautiful daughter Mina; and Seward's ward, the equally pretty Lucy. Dracula flirts with Lucy and, later that night, he feeds on her blood. The next day, Mina discovers Lucy still in bed late in the morning, looking strangely pale. Seward, puzzled by the odd puncture marks on her throat, calls in an expert on obscure diseases, Dr. Abraham Van Helsing. Van Helsing is convinced that Dracula is a vampire and that they must destroy him before he gets to Mina next.<br><br>Dracula: Dead and Loving It may be a bit silly at times, but seriously, you can't help but laugh. It's certainly a lot better then most spoof movies today. How could you not love Leslie Nielson as Dracula? He was so hilarious, but who truly stole the show? Peter MacNicol as Reinfield, I can't tell you how hard he made me laugh, if one laugh supposedly makes you loose 3 calories, I think I lost 15,000 calories with just his scenes. Reinfield being seduced by Dracula's brides, him trying to save Dracula's coffin on the ship from hitting the walls back and forth, him sneaking under Lucy's bed sheets to peak at her, to the ending, actually every scene with him is non stop laughs. I don't care what people think, I'm not comparing, I think this is a very funny movie and is just a blast to watch, if you don't laugh while watching this movie, you're not invited to my parties, you party pooper! <br><br>8/10","user":"Smells_Like_Cheese","rank":[75,80]},{"title":"Stake on target","rating":8,"date":"5 April 2009","review":"Mel Brooks's scattergun approach to comedy has a number of misses. Spaceballs was OK at parodying its genre. This film is far more sophisticated and well played.<br><br>The successful jokes are on the culture of Victorain times with references to an engaged couple who after 10 years have suddenly held hands being condemned as immoral, prostitutes, lechers and the like. <br><br>Into these cultural and successful observations Brook's introduces Leslie Nielson doing a great impression of Bela Lugosi's Dracula with the difference that his powers are incompetent.<br><br>Seeing the Lugosi movie will give you the basis to appreciate the sophistication of this film.","user":"lanejo15","rank":[22,23]},{"title":"The most underrated comedy in my DVD arsenal","rating":9,"date":"12 July 2004","review":"\"Dracula: Dead and Loving It\" is a movie that seems to define what someone either really likes or dislikes about a comedy, and more specifically a parody: gags.  For me, the gags herein worked, there were reasons for their having been used and therefore makes it funny to me.  The storyline didn't stall, the gags weren't desperate for laughs, and the acting was exactly what was needed: the comedic touch.  <br><br>The casting choice to have Steven Weber and Amy Yasbeck, both veterans of the TV series \"Wings\", was brilliant because the chemistry between their personalities was proven and honed before the movie.  The choice of Leslie Nielsen for the titular role was dead-on.  Someone that has the wisdom of centuries (decades, whatever), is cunning (a la the Naked Gun series), and above all, never gives up (until turned to dust).  Mel Brooks, having proved his comedic prowess with films like \"Young Frankenstein\", comes through in the role of Van Helsing.  Even the incidental characters seem to have a reason to belong and flow in the movie, like Essie, the guardian of Mina, or Martin, Dr. Seward's right-hand man of the sanitarium...<br><br>Martin:  \"...the patient in the west wing?  He's havin' a conniption fit.\"<br><br>Dr. Seward:  \"Oh.  Give him an enima.\"<br><br>As stated, the movie will most likely be quite funny or very dull, depending on what the viewer expects from it beforehand.  Being that I like a good slapstick comedy (and I do), the performances above all are what were able to pull me in.<br><br>FOOSH-TAA!<br><br>\"Dracula: Dead and Loving It\" gets 9 of 10 stars","user":"guerillagorilla","rank":[91,108]}]