[{"title":"The simplest may be the most beautiful!","rating":9,"date":"5 October 2003","review":"Everything in this movie is beautiful! The scenery is, the actress is, the whole story is. Although it's a very very simple love story, you can feel the internal beauty that the director want to express if you can calm very down to see it. Sometimes while seeing it, I even think the plot is no more important. All you should do is to feel the beautiful things in it. Takako Matsu is famous most because of her lovely performance in many Japanese soaps. However, we can still see her excellent performance in this movie. Meanwhile, Shunji Iwai shouldn't be forgotten. He is a very gifted young movie director. He is simply an artist. You can know more about Japan movies after seeing his works. Frankly, I love this movie completely due to Shunji Iwai and lovely Takako Matsu.","user":"henryand","rank":[23,24]},{"title":"One Hundred Everyday Views of Tokyo","rating":14,"date":"14 February 2012","review":"I was very recently exposed to this filmmaker and utterly captivated by another one of his films, so that alone ensures I'll want to see everything by him at some stage. He seems like one to follow and devote serious time to: a vibrant new voice that embraces damaged worlds with the gentle ardor of Zen. He makes the films Mizoguchi ought to have made but for drowning still reflections in overbearing dramatics.<br><br>This is even more sparsely arranged than that other film. Once more the point is that it's seemingly about nothing, purely episodic life from a teenage girl's journey into young adulthood and love. Once more the point is that there is no solid core to explain from, only glimpses from a floating world. Nothingness permeates, but a sweet, Buddhist nothingness that is pregnant with life.<br><br>The world is still new that she enters, the mind is clear, fresh. There is a lot of idle perambulation but no vexation. Solitude that is sweet enjoyment of the present moment. Being that is still magnificent in its simplicity.<br><br>Against this backdrop the smallest gesture rings far and wide with meaning, say a smile beneath a red umbrella for the joy of being able to freely smile or the feeling of being wet but safe. It is the best cinematic Zen I know of.<br><br>Spontaneous joy without pleasure. A world that makes sense because the senses are open, receptive. Astute viewers will pick up a connection to old landscape compendiums from the Shogunate era, the title of this post is a reference to one; those were intended for tourists passing through Edo, but were the training ground for cinematic perspective, more deeply intended for the travelling eye.<br><br>On a technical level, I believe this was solely conceived as an exercise where the filmmaker got to work out a few shots and atmospheres he had in mind: spring rains, clear evenings, bird's eye views, calligraphic sweeps, many worlds fleeting from the windows of a speeding train. A lot of that paid off in Lily Chou-Chou, there in a longer form.<br><br>This is small but full and ripe, a rare thing. I'm even more eager to follow his work.","user":"chaos-rampant","rank":[10,10]},{"title":"Filled with the subtle meanings that help us grow.","rating":10,"date":"30 September 2007","review":"For those who can remember or those who have yet to discover, the first few weeks at college away from home can be the most unsettling, scary, and challenging time of our life, yet few films have chosen to dramatize this commonly shared experience, preferring instead to dwell on outrageous varieties of anti-social behavior. In April Story, a 1998 film, Shunji Iwai continues his sensitive interpretations of the difficulties young people face in stepping gingerly into the adult world. This 68-minute film has little plot and no big events, only the small struggles of daily life that are filled with the subtle meanings that help us grow.<br><br>Set amidst the blossoming of the spring flowers in Japan that signal the start of the new Japanese school year, April Story, aided by a solo piano and the beautiful cinematography of Shinoda Noboru, has a calming and meditative effect. For the shy and innocent Uzuki Noreno (Takako Matsu), however, coming to Musashino University in Tokyo from rural Hokkaido may be the psychological equivalent of landing on the moon. In the first week alone, she faces the not too delicate questioning of fellow students about her background and why she came to college, the loneliness of being away from home for the first time, and the confusing time of signing up for classes and studying such strange topics as Investment in the Japanese Economy and Cultural Anthropology.<br><br>Although withdrawn, Uzuki is adventurous enough to join a Fly-Fishing Club at the urging of her only friend Saeko Sano (Rumi), but is embarrassed when she confuses one Brad Pitt movie for another in a discussion with the group leader. One of the loveliest scenes takes place when the newly recruited club members stand in an open field and cast their fishing rods rhythmically into the air. Uzuki's exploration of her surroundings brings daily trips to the local bookstore (where she is intrigued by a bushy-haired young clerk), an encounter with a harassing gentleman in a movie theater, and the inviting sounds of a street band. Fearfully, she reaches out to her neighbors but achieves little result. It is only late in the film that the real reason for her attending this particular university emerges and in a heavy spring rain that paints the city with a refreshing glow, the magic of first love begins to unfold.","user":"howard.schumann","rank":[11,13]}]