[{"title":"Underrated pure fun popcorn Action film!","rating":7,"date":"7 May 2016","review":"Jurassic Park III (2001) is a pure, fun, popcorn, Action Film and the third entry of the Jurassic Park trilogy. It is an awesome underrated Action flick a million ways better than the new movie Jurassic World (2015)!!!!!!!! <br><br>The third entry of Jurassic park Trilogy is very underrated solid action flick. I will take third Jurassic Park III movie over Jurassic World! Just like a pure, fun, popcorn, Action Film, I will take this one. They brought Sam Neill back as Dr. Alan Grant back. The film was a rescue mission, it was fast paced and it was short than the second flick. I still love The Lost World: Jurassic Park equal as the first flick Jurassic Park, but this flick grow on me and I love it and I have changed my mind. I love this flick I love it to death. I will rather watch this flick than forgettable Jurassic World! I love this flick to death and it is my third favorite film in the Jurassic park trilogy. As the first time I saw this film, I wasn't fan about it, but I keep watching it and I liked it, this movie grow on me. The film was fast paced, it went really fast around, it was an action film, it wasn't an epic adventure like was the first movie Jurassic Park (1993) it was actually an action flick an a rescue mission. <br><br>Plot: Adventure runs wild when renowned palentologist Dr. Alan Grant agrees to accompany a wealthy adventurer and his wife on an aerial tour of Isla Sorna, InGen's former breeding ground for prehistoric creatures. But when they're terrifyingly stranded, Dr. Grant discovers that his hosts are not what they seem, and the island's native inhabitants are smarter, faster, fiercer and more brutal than he ever imagined in this heart-stomping thriller.<br><br>The film was directed by Joe Johnston who also directed The Rocketeer, I haven't seen that flick in ages yet, The Pagemaster, Jumanji and Captain America: The First Avenger that I am fan of that film. After the success of Spielberg's Jurassic Park, Joe Johnston expressed interest in directing a sequel. Spielberg instead gave Joe Johnston permission to direct the third film in the series, if there were to be one. I don't think the director did a terrible job, I think that this movie more lacked on a script writers, so is not Joe Johnston fault for directing this film for using more CGI in the film.<br><br>I love Sam Neil as Dr. Alan Grant and I love that he goes on an Island Isla Sorna, where man is up against dangerous predators in the ultimate battle for survival. This movie takes no prisoners and pulls no punches. It takes the idea of the original, puts an interesting twist into the plot, injects it with good FX, good acting and a decent budget, and you have something far superior to the original.<br><br>I like all- new dinosaurs and the special effects CGI, more practical effects are in there, they did not bothered me or that it was directed from someone else and not Steven Spielberg himself. I like the CGI in this film.<br><br>A wealthy couple with Dr. Alan Grant (Sam Neil) land on a island Isla Sorna and all the mercenaries are killed off, I like that in the film that the mercenaries are killed off. <br><br>This film is very quickly paced, is not boring film and it is not a dull movie, it does not drag a long, is very interesting to me and it is a good action film. Jurassic park III is MILES way better to me than Jurassic World, I will rather watch this film than the new one. The first time I reviewed this film I hated it, but now I loved it a lot.<br><br>I am fine with the FX of the Spinosaurus, I like Spinosaurus, I thought it was pretty cool. <br><br>Btw the kid in this movie wasn't annoying and I think he really did a good job, he was smart and recourses, he was useful in this movie, he survived that length of time by himself &amp; saved Alan against Spinosaurus, so yea I like that and I like this film. I don't think it was terrible or forgettable at all. <br><br>I really did not like that Laura Dern can't return with her character in a cameo scene, but still I liked that they made her a happy married woman with the kid and I still like that Alan and Ellie are still in contact together, that is decent in the film. <br><br>Also Michael Jeter from Drop Zone (1994) as a mercenary is in here, John Diehl from Miami Vice is in it and Bruce A. Young from The Sentinel and Basic Instinct (1992) is in it, as a third mercenary. <br><br>Overall: The ranting for this film I am giving is an 8.5/10 I love this film and In my opinion is the last good Jurassic film, a very hated and underrated. <br><br>Jurassic Park III is a 2001 American adventure science fiction film. It is the third installment in the Jurassic Park film series. The film stars Sam Neill, William H. Macy, Téa Leoni, Alessandro Nivola, Trevor Morgan, and Michael Jeter. It is the first film in the series not to have been directed by Steven Spielberg, nor based on a book by Michael Crichton (though numerous scenes in the film were ultimately taken from Crichton's novels Jurassic Park and The Lost World).<br><br>8.5/10 Grade: B+ Studio: Universal Pictures Starring: Sam Neill, William H. Macy, Téa Leoni, Alessandro Nivola, Trevor Morgan, Michael Jeter, John Diehl, Bruce A. Young, Taylor Nichols, Laura Dern Director: Joe Johnston Producers: Kathleen Kennedy, Larry Franco Screenplay: Peter Buchman, Alexander Payne, Jim Taylor Rated: PG-13 Running Time: 1 Hr. 32 Mins. Budget: $93.000.000 Box Office: $368,780,809","user":"ivo-cobra8","rank":[71,94]},{"title":"Not as good as the previous JP's.","rating":6,"date":"11 June 2003","review":"Jurassic Park 3 was a shorter and less entertaining of the three. I thought this sequel might be good because JP2 was good but I was wrong! I have picked some notes while watching this movie. Usually Jurassic Park films are 2 hours long, this one is some 40 minutes less! and does not quite contain the same fun and horror it did on previous jp's. DR. Grant returns which is a suprise. It didn't have it's entertaining parts though i must admit. JP3 had amazing special effects, most probably the best out of the three. I have heard that Jurassic Park 4 will be released in 2004. Should I say this one will be a bad sequel as well?","user":"mosquito1985","rank":[45,61]},{"title":"Jurassic Park 3 is as Inventive as it's title.","rating":6,"date":"1 July 2015","review":"Jurassic Park 3 was released four years after the Luke warm reception of Spielberg's (underrated) The Lost World. Spielberg opted to not return to helm another Jurassic film, and directing duties were passed over to Joe Johnston. Jurassic Park 3 see's the return of Sam Neill as Dr. Alan Grant, from Jurassic Park. Laura Dern also returns as Ellie Sattler, but sadly in a less prominent role. <br><br>The story for JP3 is quite simple, Grant is lured by \"adventurous\" couple Paul, &amp; Amanda Kirby, played by William H. Macy &amp; Tea Leoni, to fly over Isla Sorna, with Grant acting as their guide, for money. However the Kirby's are not rich, and lied to Grant so he could help them find their missing son Eric, who wen't missing weeks ago in a parasailing accident near the island. Of course things go wrong, the plane crashes leaving the Kirby's, Grant, his colleague Billy, and a few others stranded on the island. JP3 can only be enjoyed as a trilling dinosaur spectacle, but there isn't much of anything new, or interesting.<br><br>There are some positives aspects in this film, Sam Neill is a fine actor, and he brings credibility to the film, and is still believable as the Grant character. While the rest of the characters aren't all that fleshed out, the film is well acted, with William H. Macy, and Sam Neill being the standouts. There's a few new dinosaurs, Spinosaurus being the main one. Spinosaurus is a neat dinosaur, and the roar for Spinosaurus is also well executed, and is distinctly different sounding from the now famous T- Rex roar. The animatronic dinosaurs/CGI are once again well executed by Stan Winston's team, and Industrial Light &amp; Magic (ILM). JP3 is the first film in the series to combine CGI dinosaurs along with practical ones in the same shot, and the blending between the two is well done. The Spinosaurus attack on the river is a thrilling scene, taking place in water, which hadn't been done. There is also a thrilling Pteranodon sequence, offering a ariel attack which hasn't been seen yet in the franchise. The scene is dimly lit, with fog, and creates the best sense of suspense in the movie. The music in the scene is probably my favorite bit of new music in the film. John Williams didn't score JP3, instead composer Don Davis best known for his work in The Matrix films, provides the music, and does a good job, creating new music that still fits stylistically within the franchise.<br><br>Though there are positives in JP3 there are many negatives as well. One of the biggest ones I had was the screenwriters not having Grant, and Ellie as a couple. Instead they have a friendship type relationship, and Ellie has a child (with some random guy) who call's Grant \"the dinosaur man\". It just seems stupid to not have Grant be with Ellie after the events of the first film. Grant's character arch of not wanting children changes after he saves Lex, and Tim, and is seemingly ready to settle down with Ellie, which now seems wasted. The dumbest thing about it is it adds nothing to the characters, or the overall film, and was a stupid decision on the writers part. Grant has a dream on the plane nearing the island, and turns to see a raptor that says \"Alan\". The scene is very cheesy, and really is just plain silly, right up there with the gymnast scene in TLW. The Spinosaurus T-Rex fight is neat, but having the T-Rex (a fan favorite) lose, and die, just didn't sit right with many fans, myself included. <br><br>The characters (while well acted), aren't all that interesting, or all that likable, the Kirby's put peoples lives in danger to find their son, and Billy, decides it would be a good idea to steal raptor eggs to help fund their research back home. There are also many continuity issues in the film, like why the island doesn't look the way it did in TLW, or why the raptors look radically different (some have feather-like quills on their head) from how they did in the pervious films. Where the Spinosaurus was during the events of TLW is suspicious too, the only clue given in the film is when Grant says that Spinosaurus wasn't on Ingen's list. Perhaps the worst part of JP3 is it's ending, which feels insanely rushed, and anti-climantic, almost as if the filmmakers said \"This is going on too long, lets wrap it up\", but with a runtime just over 90 minutes, the abrupt conclusion seems strange, with the previous films being over two hours long. <br><br>Jurassic Park 3 despite is faults, and there are multiple ones, is still an enjoyable flick for what it is, but it's a huge step down in terms of story, and character, and is just an unnecessary edition to the franchise. The story isn't very interesting, or inspired, and the only thing new in the film are the look of the raptors, and a few new dinosaurs. It's explained during a dinner scene with Grant, and Ellie that the raptors were far more intelligent than imagined, and could talk to each other, but much of this could be assumed in the previous films. Spinosaurus makes for a cool looking successor to T-Rex, but seems more like a movie monster than an animal, compared to T-Rex who while running around chasing/eating people, had moments in both Jurassic Park, and The Lost World that showed a naturalistic side of them, like caring for the infant T-Rex. The only real advances in Jurassic Park 3 are technical ones, but effects aren't what makes a film great, it's the story, and characters that drive a film, and that wasn't strong enough in this entry of the Jurassic Park series.","user":"jaredmartin-464-711711","rank":[25,33]}]