[{"title":"This movie helped save my life!","rating":10,"date":"11 December 2000","review":"I Mean that literally!<br><br>I was going through a rough time in my life, and Encino Man was the only thing that could make me laugh!<br><br>Brendan Fraser was terrific, and I even learned how to like Pauly Shore after this movie...who up to this point I couldn't stand!<br><br>I saw it 8 (yes, that's EIGHT) times at the theatre in a four week period when it was out, and have watched it dozens of times since on video. Despite it's absurd premise, the movie worked for me, in the relationships that developed between Link, Dave, and Stoney, and the little family the three of them made.<br><br>It's goofy, it's at times stupid..and it's all around FUNNY! Just one of those little movies that if you will allow yourself to put reality on hold for 90 minutes, it can and will charm the socks off of you.","user":"SyxxNet","rank":[71,83]},{"title":"The Ice Man Cometh....Dude.","rating":6,"date":"6 June 2004","review":"Encino Man is a comedy influenced by the wackiness of the grunge generation. The young cast, which stars Astin, Shore, and Fraser, is likely to be a major draw for teenagers and younger viewers, who will likely enjoy this movie. <br><br>The story is pretty goofy. Dave (Sean Astin) has major plans for putting a swimming pool in his backyard to at least get some popularity points with the neighborhood teens who could lounge by the water in the blazing California summer sun. But, when he's breaking ground, he digs up a block of ice with a casualty of the Ice Ages, primitive fellow who he and his hip buddy, Stoney (Pauley Shore), clean off and try to disguise him as a regular American teenager. Needless to say, a lot of mishaps arise out of this. But eventually, the grizzly Link (Fraser), is a pretty popular kid at the high school, and one that Dave thinks will help him get popular, too, in that popularity-by-association kind of way. <br><br>Matt Wilson, a jerky jock (Michael DeLuise) interferes with Dave's plans to just try and pass off Link as a normal exchange student. Already p***ed with Dave and Stoney for getting friendly with his girlfriend Robyn (Megan Ward), and with their increasing popularity--especially Link, who Robyn has a little crush on. Matt figures out Link's real identity, and it's a question of whether anyone will believe his story that Link is really from the Ice Ages. Not even the school's most popular jerk can get off easy with a line like that.<br><br>The cast and this silly story make it an enjoyable comedy. Teens are likely to enjoy Pauley Shore's scenes as the happy-go-lucky hippie throwback friend, Stoney, as he just seems like such a nice, giant goofball who can really have fun with this material. It's also pretty funny to watch a fellow from the Ice Age trying to adapt to modern teenage life, much like the historical dudes did in Bill &amp; Ted's Excellent Adventure. It's even got some sweet tunes on the soundtrack. So loosen up and enjoy it already.","user":"vertigo_14","rank":[25,28]},{"title":"Fun entertainment when your brain shuts down","rating":7,"date":"15 January 2004","review":"I'm not sure why, but still to this day I love to sit down to Encino Man. I think because I just loved it as a child and it's like that blankie you can't get rid off. Also, you need those comedies that you can just sit down too and just have fun and relax. Yes, it has Pauly Shore which granted can be scare-E! :D But he's actually amusing as well in the film.<br><br>We see a very young Brendon Fraser as Link the caveman, yes, he doesn't have much to work with the grunting and such. But he was just priceless in that club scene and the seven eleven with Pauly. He's also just so cute and lovable when he sees Dave and Stoney getting into a fight and he pulls David back screaming to him \"Family!\". It was actually touching, I'm serious. Sean Austin plays Dave, he's come such a long way and in my opinion is the most successful child star to not get hooked on drugs or let the industry take him over. He does such a good job as the pretty self centered and insecure but nevertheless lovable guy who wants to get the girl. Pauly plays Stoney, a well, I think he's somewhat of a stoner. :D But he's pretty funny in the film with some of his lines. Come on, I think we all dug him in his day.<br><br>While yes, Encino Man is not Oscar material, it's just a fun time to sit down and enjoy with your friends. So, a 5.0? It's just a movie, let go and grab the popcorn for a few laughs. If you didn't laugh at that scene where Link speaks Spanish to the Hispanic gang members, you have some serious issues.<br><br>7/10","user":"Smells_Like_Cheese","rank":[17,20]}]