[{"title":"What a difference a few seconds can make?","rating":28,"date":"28 April 2004","review":"The romantic comedy, 'Sliding Doors', is a great look at how quickly a person's life can change in a matter of moments. By taking one path instead of another, forming a tantalizing 'what if?' In fact this movie gives the impression that some things are meant to be known, while some things are not.<br><br>London publicists Helen, is effortlessly sliding between parallel storylines that show what happens if she does or does not catch a morning train back to her apartment. Love. Romantic entanglements. Deception. Trust. Friendship. Comedy. All come into focus back and forth, overlap, then surprisingly converge in one of the great romantic comedy films in years.<br><br>\nSliding doors is one of the best films that Gwyneth Paltrow has done. It has it all, humour, anger, sadness, love, compassion and a lot of lying. This movie is most special for the way the two storylines overlap, making this a very original movie. Paltrow's performance is grand as the 'hurt Helen' or the very 'naïve Helen', depending on which parts of the film you are watching. Some of her lines are priceless. Paltrow has had a very celebrated career in acting and of late singing and deserves all the accolades she gets. It was also refreshing to watch her in the murder thriller 'The perfect murder', along with screen legend Michael Douglas.<br><br>\nYet there are some other great performances in this film. John Hannah was exceptional as the sensitive and understanding 'James', who is helping the 'hurt Helen' back to being her 'old self'. Then you have the cheating boy 'Jerry' played by John Lynch, who was using the 'naïve Helen' to live out a very adulterous and selfish lifestyle. It was very funny to see the way he handled the situation with Helen actually. Then to top it all off, we get a great performance from Jeanne Tripplehorn, who was Jerry's girlfriend on the side, who gives Jerry a very difficult time in both parts of the story.<br><br>\nThis film also has an impressive soundtrack. With acts like Blair, the Brand New Heavies, Dodgy, Jamiroquai and the Space Monkeys. Yet there are two very famous parts to this soundtrack. One is Elton John, who is given a bad mention in the movie, when Jerry is caught in a most precarious of positions while playing the Elton John song, 'Honky Cat'. However the best song on the whole soundtrack comes from the band Aqua, with the tune 'Turn Back Time', which suited the film perfectly. The film clip to this song is also very good.<br><br>Sliding doors is one of those feel good movies, which can also make you feel sad as well. It shows how difficult life can be in a relationship and how important relationships can be as well. It also proves that relationships are extremely hard work and you need to find someone who you trust and love and that you get the same feelings back in return. If you want to see the good and bad sides of love take a look at this romantic classic.<br><br>CMRS gives 'Sliding Doors': 4.5 (Very Good- Brilliant Film)","user":"Old Joe","rank":[77,93]},{"title":"Undoubtedly one of my favourite films","rating":9,"date":"2 February 2005","review":"Gwyneth Paltrow plays Helen Quilley, she works in Public Relations and is dating an idiot who is cheating on her (come on guys, would you?) After losing her job she heads home early, and the film then follows two Parallel realities, that cross over and intertwine in a very clever manner, that adds a great deal to the movies quality.<br><br>One way, she gets home and finds him cheating, and the other way she is mugged and her boyfriend gets away with it, at least for now.<br><br>In this wonderfully charming romantic comedy, great performances from, Paltrow, Lynch, Hannah and Tripplehorn plus a good script and some good laughs all add up to a movie i simply don't tire of. I can't quite put my finger on what it is, i just love it.<br><br>9/10 and a must for Paltrow Fans","user":"mjw2305","rank":[59,78]},{"title":"Unique and Natural","rating":8,"date":"11 November 1999","review":"This film is a lightweight comedy/drama with a unique story. Although Gwyneth Paltrow plays the same character in both aspects of the story, both Helens seem completely different. The flow of the story seems quite natural and the cast does a wonderful job going through the twists and turns of their characters lives. It's a chick flick with none of the sap.","user":"vibeke-2","rank":[37,49]}]