[{"title":"Vastly underrated, charming movie","rating":9,"date":"31 December 2001","review":"As a kid, I used to watch reruns of the original \"Maverick\" -- and so I looked forward to seeing this one when it came out in the theaters.  I was NOT disappointed!  Mel Gibson's Maverick is a bit more goofy than James Garner's, but is every bit as charming, sly, and entertaining.  A number of excellent cameos provide some comic relief, especially Danny Glover near the beginning of the movie.  But by far the best casting is reserved for the original Maverick, James Garner, who is cast in a featured role, and who has surprises in store for darn near everyone.  Most movies remade from old TV series ignore the stars that made them popular enough to BE remade -- kudos to the producers of this film, who apparently know better.<br><br>Other roles are filled capably; the biggest surprise for me was Jodie Foster, whom I normally dislike on screen.  She is very impressive in a rare comedic role, and thankfully discards her repetoire of facial tics for a much more natural performance here.  The plot is kept pretty simple until near the end -- and the end has a great twist, which I won't divulge. Suffice it to say that your time will be well spent, and you'll want to revisit Maverick country more than once.","user":"Captain Ed","rank":[94,105]},{"title":"Richard Donner sure knows how to make an entertaining movie!","rating":8,"date":"15 October 2004","review":"After making entertaining movies such as the \"Lethal Weapon\" movies, \"The Goonies\" and \"Scrooged\", Richard Donner the man behind all those movies, brings us \"Maverick\", an excellent and fun 'modern' western with a fun story and entertaining characters played by veteran-actors who seemed to have lots of fun working on this movie.<br><br>The best thing about \"Maverick\" is the 'fun' feeling that this movie has. You can tell that the actors worked on this movie with lots of pleasure and fun. Mel Gibson is a wonderful and fun leading man as Bert uhmm I mean Bret Maverick. The cast is filled with many other big names such as: Jodie Foster, James Garner, Graham Greene, Alfred Molina, James Coburn, Dan Hedaya, Margot Kidder and Danny Glover in a fun cameo.<br><br>The story is really strong and full with fun twists and plenty of comical situations. Yes, \"Maverick\" is a real fun 'no worries' movie. Truly one of the most underrated movies.<br><br>8/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[69,77]},{"title":"Simply brilliant","rating":9,"date":"7 September 2001","review":"This is one of those rare movies you can watch over and over again without getting tired of it. Forget what some people have said about Jodie Foster, she is absolutely perfect as the apparently-dumb-but-smarter-than-she-looks blonde, and the chemistry between her and Mel Gibson is superb. Also perfect are James Garner as the marshal, Graham Greene as the harassed native chief, and Alfred Molina (the Englishman who is so good as an Iranian in Not Without My Daughter and a Cuban in The Perez family) as the \"Spaniard\". The writing is simply brilliant, one of William Goldman's best - how anyone could describe it as \"virtually plotless\" just staggers the imagination. The direction and cinematography are superb. A special treat is the Lethal Weapon reprise with Danny Glover.","user":"hitchs","rank":[56,66]}]