[{"title":"The benchmark for all sci-fi films to come","rating":10,"date":"19 September 2000","review":"The story of a reluctant Christ-like protagonist set against a baroque, MTV backdrop, The Matrix is the definitive hybrid of technical wizardry and contextual excellence that should be the benchmark for all sci-fi films to come.<br><br>Hollywood has had some problems combining form and matter in the sci-fi genre.  There have been a lot of visually stunning works but nobody cared about the hero. (Or nobody simply cared about anything.)  There a few, though, which aroused interest and intellect but nobody 'ooh'-ed or 'aah'-ed at the special effects.  With The Matrix, both elements are perfectly en sync.  Not only did we want to cheer on the heroes to victory, we wanted them to bludgeon the opposition.  Not only did we sit in awe as Neo evaded those bullets in limbo-rock fashion, we salivated.<br><br>But what makes The Matrix several cuts above the rest of the films in its genre is that there are simply no loopholes.  The script, written by the Wachowski brothers is intelligent but carefully not geeky.  The kung-fu sequences were deftly shot -- something even Bruce Lee would've been proud of.  The photography was breathtaking.  (I bet if you had to cut every frame on the reel and had it developed and printed, every single frame would stand on its own.)  And the acting?  Maybe not the best Keanu Reeves but name me an actor who has box-office appeal but could portray the uneasy and vulnerable protagonist, Neo, to a T the way Reeves did.  But, come to think of it, if you pit any actor beside Laurence Fishburne, you're bound to confuse that actor for bad acting.  As Morpheus, Mr. Fishburne is simply wicked!  Shades of his mentor-role in Higher Learning, nobody exudes that aura of quiet intensity than Mr. Fishburne.  His character, battle-scarred but always composed Morpheus, is given an extra dose of mortality (He loves Neo to a fault.) only Mr. Fishburne can flesh out.<br><br>People will say what they want to say about how good The Matrix is but the bottomline is this: finally there's a philosophical film that has cut through this generation.  My generation. The Wachowski brothers probably scribbled a little P.S. note when they finished the script saying: THINK FOR A MOMENT ABOUT YOUR EXISTENCE.  What is the Matrix, you ask?  Something that's closer to reality than you think.<br><br>Either that or it's my personal choice for best film of all-time.","user":"mambubukid","rank":[918,1]},{"title":"A watershed moment in film-making – and what a kick-ass masterpiece","rating":10,"date":"26 July 2014","review":"** May contain spoilers **<br><br>There aren't many movies I watched in the theatre twice  let alone on the same day - but immediately after the credits had rolled (and still pumped up by 'Rage against the Machine'), I queued up for the next screening of 'The Matrix'. I was so blown away by that film, I feared - and probably rightly so - that I hadn't caught every detail of what I'd just seen. I later found out that many of my friends had had a similar reaction to the film, and I know virtually no one who liked the film and didn't watch it at least twice. It's simply one of those rare films that are so rich you just have to watch them several times.<br><br>In structure, style and concept, 'The Matrix' was ground-breaking; it marked the first time the visual style of Manga comic books and Anime such as 'Akira' or 'Ghost in the Shell' had been successfully translated to a live-action film. Apart from 'Blade Runner', which has a totally different mood and pace (but is also a masterpiece and visionary film-making), there simply hadn't been anything even remotely like it. The jaw-dropping action sequences have such a raw, gripping energy they feel like an adrenalin overdose, but unlike most action films, they never overshadow the story; on the contrary - they enhance it and make complete sense within that universe.<br><br>As for the story itself, I think this is one of the most original, fascinating Sci-Fi tales you'll likely ever see on screen. Clearly inspired by Japanese Anime and Manga yet also by authors like Isaac Asimov or Philip K. Dick, the story about humanity's war against its own creation, machines of an artificial intelligence that have evolved to the point where they have become the dominant 'species' and vastly superior to their creators, could take place in the same world as 'Blade Runner' or 'The Terminator' - albeit several hundred years later. But there is also a mythical, even religious undercurrent to the story; the themes of a prophecy, a \"liberator\" or even a \"messiah\" make 'The Matrix' transcend the Science-Fiction genre and become even more unique.<br><br>'The Matrix' was a watershed moment in filmmaking  in every respect  and even though two inferior sequels have left a bit of a stain on the film, they can't distract from what an uncompromising and hugely influential masterpiece this is. Sci-Fi movies that were released after 'The Matrix' have tried very hard to achieve a similar look and tone, but the original still owns them all. 10 stars out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[191,238]},{"title":"Immensely entertaining, intriguingly philosophical and just about one of the best films ever made!","rating":10,"date":"2 December 2005","review":"Writing a review of The Matrix is a very hard thing for me to do because this film means a lot to me and therefore I want to do the film justice by writing a good review. To tell the truth the first time I saw the film I was enamored by the effects. I remember thinking to myself that this was one of the most visually stunning films I had ever seen in my life. Also having always been a comic book fan and a fan of films that were larger than life, the transitional element of the story was very appealing to me and this probably heightened my enjoyment of the film very much. It wasn't until some time later (and after having seen the film a few times more) that I started to think about the film. I recognized the Christian elements quite quickly but it wasn't until I wrote an actual 15-page essay on the film that I tapped into some of the philosophical and religious elements and that made me appreciate the film even more. I won't say that I have recognized all elements because the film is quite literally packed with them.<br><br>Acting wise the film works excellently. I won't say that there aren't any issues because there are but overall the acting is pretty flawless. Keanu Reeves plays the main character, Neo, or Thomas A. Anderson and while he is not the perfect actor I think he does a pretty good job in The Matrix (and the sequels). He doesn't have the longest of lines which was probably a deliberate choice from the directors and it works because this gives him a better opportunity to work on posture and facial expressions and I must say that overall his body language is very good. Very clear and well defined. Laurence Fishbourne plays Neo's mentor Morpheus and he does an excellent job of it. His lines flow with a certain confidence and style that makes his character somewhat unique and interesting. Carrie-Anne Moss does a good job as well and succeeds in looking both cool and sexy in her leather outfit. Joe Pantoliano, a critically underrated actor does a brilliant job of bringing his character, Cypher, to life. I can't say much about him because his character is pretty essential to the plot and I certainly don't wan't to spoil it for anyone. Gloria Foster appears in a relatively small role that will have greater significance in the following films and she does a very good job. The best acting is provided by Hugo Weaving, however, in his portrayal of Agent Smith. It is really something to watch him act out the changes in his character. Agent Smith gains some human traits like anger, sense of dread, hate and eventually even a sly sense of humor (mostly in the sequels). Two thumbs way up to Weaving who has created one of the finest screen villains of all time.<br><br>Effects wise the film is simply stunning and it deservedly was awarded the Oscar for best effects (and was regrettably cheated out of a nomination in the Best Film category) ahead of even Star Wars. The reason that I think The Matrix deserves the Oscar for best effects is simply that the effects in The Matrix are more innovative than the ones in Star Wars. Just take a look at how many times the effects have been spoofed and you'll probably agree. The effects also help in the symbolism of the film and in creating a very dystopian atmosphere not unlike the one seen in Blade Runner and this works brilliantly. The film looks beautiful at all times and today 6 years later (my God has it already been 6 years?) the effects still hold their ground against new science fiction films. Add the effects to the brilliant editing and you have a visual masterpiece on your hands. Very well done.<br><br>The reason that I think The Matrix is more reviewable than pretty much any other film is the story and the philosophical and religious elements of the story because with every viewing I catch something I didn't see the previous time I watched it. Without spoiling the film I think I can mention a few of the more obvious elements. Obviously the film draws on the Messiah myth as Neo is a clear reference to Jesus with the analogy of his name (Neo = one, as in The One) but also hidden in his other name, Thomas A. Anderson. The first part of his last name, Anderson comes from the Greek Andros meaning \"man\" and combine this with the second part of his last name \"son\" and add a little creativity you will come up with the combination \"son of man\" which was a title Jesus came up with about himself. Also the first time we meet Neo a man calls him (and I quote): \"You're my Saviour man. My own personal Jesus Christ.\" It doesn't get any more obvious than that. Aside from the Christianic elements the film also gets its inspiration from Budhism, Gnosticism (Gnosis = knowledge) but is also inspired by Plato and his analogy of the Cave and Jean Baudrillard's essay, Simulacra and Simulations. Explaining these elements would make this review go on forever so aside from mentioning them I will not comment on them further.<br><br>To all the people who doubt the profound nature of The Matrix I can only give one advice: Free your mind and watch the film again. You won't regret it. If I had to choose a favorite all time film my choice would probably fall on either The Matrix (obviously I don't expect people to agree but if they do thats great) or The Lord of the Rings: The Return of the King and I recommend it to all fans of sci-fi and people who like philosophy.<br><br>10/10 - on my top 3 of best films.","user":"MinorityReporter","rank":[565,744]}]