[{"title":"Extremely Sexual Adaptation of Anais Nin's Book","rating":25,"date":"25 May 2000","review":"\"Delta of Venus\", director Zalman King's erotic adaptation of<br><br>praised writer Anais Nin's book, is a lush, sexy, dramatic film. It's 1940 Paris and young aspiring writer Elena Martin begins a hot affair with smut author Lawrence.  One night Elena catches Lawrence in the arms of another and leaves him, then she supports herself as a nude model and begins writing erotica for a wealthy male patron.  But she can't write about it until she experiences it first.  I highly recommend both the book \"Delta of Venus\" and the movie version as well.<br><br>\"Delta of Venus\" is UNRATED for strong sexual sequences, graphic nudity, and for some language.<br><br>NOTE:  \"Delta of Venus\" is available in a slightly cut R Rated version that omits one minute of sexual footage, and an UNRATED version that restores the cut minute.","user":"Ride-3","rank":[33,35]},{"title":"If you've read the book, this isn't for you.","rating":18,"date":"18 September 1999","review":"Delta of Venus, a collection of short stories by Anias Nin, was one of the first popular works in female erotica.  The film is loosely based on the story behind the collection.  It fails in trying to incorporate other stories from the collection.  The film doesn't fail to be interesting, however.  It may drag in the middle, and the dialogue may be a little on the obnoxious side, but it succeeds in being one of the most erotic films I've seen to date.  The actors/actresses are simply gorgeous, and the sex scenes are among the hottest and most tasteful.  If you're a fan of erotica in general, I suggest you check this one out.  If you're looking for a good transition from literature to film, however; you may be looking in the wrong place.","user":"skywalk-4","rank":[18,19]},{"title":"Tinto Brass meets Story of 'O'","rating":8,"date":"22 June 2002","review":"I don't think you can pack more into a hour and a half movie, without it exploding.  This film has politics, romance, sexual awakening, war, art, anti-semitism and lots of sexy gorgeous nude woman (especially, if you like red heads) in a wonderfully photographed \"epic\".  The only thing wrong was that Audie England should have kept her mouth shut.  Her face and body are sheer cinematic poetry, but she just did not seem to be able to say any words with any conviction.<br><br>If you prefer your sex during the rise of fascism in a romance country, this film is a must have!  Of course, you must see the un-rated version.  The sex does really contribute to the plot.<br><br>P.S.  Don't waste your time on Titanic!  This movie is light-years ahead of it.","user":"rlcsljo","rank":[27,30]}]