[{"title":"The Woody Allen formula can be enjoyable even without him","rating":13,"date":"13 April 2004","review":"Gwyn and Matt have finally gotten engaged and it looks like she will get what she wanted - a happy marriage just like the rest of her family. However as she looks around with clear eyes she realises that all her family are involved in bad marriages and affairs.  As a result she begins to get cold feet, worried the same will happen to her.<br><br>From the style and music of the opening credits right through to the to-camera conclusion that mirrors the `need the eggs', this film is like a tropical version of Annie Hall with a female playing the Woody Allen role! Even if it is not a total mirror, it is impossible to watch this film without seeing Allen's influence all over it.  So immediately large sections of the audience will want to turn off, however I love Allen so am happy to give this a shot on that basis alone.  As a film, it's plot is just a collection of messy relationship through which Carrie, sorry, Gwyn learns lessons.  It isn't substance rich but that's the point - instead it is quick and rather witty, never sitting still for very long but being quite fun with it.<br><br>The cast also helps as they do some very fun turns despite some weaknesses. Parker is good and her New York personae certainly seems to fit the material.  Bellows is rather bland for the role but there are some great little bits from Banderas, Farrow and Mazursky.  It's always good to see Pollack and Piven but Campbell demonstrates why she hasn't moved into a successful film career by reading her lines with all the emotion of iron (although she looked great in the beach-shoot scene).<br><br>Overall this is a fun little film that is quite slick if you are a fan of Woody Allen's relationship neurosis films.  If you're not then you'll probably do well to avoid this film.","user":"bob the moo","rank":[14,16]},{"title":"Mature comedy","rating":9,"date":"18 February 1999","review":"I found this movie extremely enjoyable, with a knockout performance by Sarah Jessica Parker and a nice jazzy soundtrack. Parker creates an interesting character, which is difficult in a movie like this because a lot of it is her reactions to everything going on around her. The supporting cast is also first-rate.  My only gripe is the title of the movie, which is meaningless.","user":"Boyo-2","rank":[10,12]},{"title":"Makes me lose my faith in user ratings","rating":8,"date":"14 August 2000","review":"I always have used viewer comments and user ratings as guides to what I want to see with near 100% success, but luckily did not rely on the rating and some of the flame comments that this flick received.<br><br>The soundtrack is excellent, the mood is Miami, the Allenesque milieu is perfect for those attracted to it and not limited to urban New York backdrops for its appreciation.<br><br>Sarah Jessica Parker is outstanding, Banderas sends himself up perfectly as does Mia Farrow.  Other supporting cast is very strong, script is well-written and sparkles in places.  I can only attribute the relatively low rating to those that don't like Woody Allen movies; they surely would not like this.","user":"Michael-166","rank":[20,28]}]