[{"title":"Why we go the movies...","rating":24,"date":"24 May 2002","review":"What an incredibly brave and honest look at relationships. I've have never seen a film so precisely and brilliantly capture this kind of emotion and transfer it to the screen the way Before Sunrise does. What a crime that neither Ethan Hawke or Julie Delpy was nominated for any major acting awards, actually screw that! What a crime it was that they didn't both sweep every major acting award altogether and that Richard Linklater didn't get any recognition for the screenwriting or brilliant directing of his wonderful actors! Loved the ending (as much as it pained me at the same time), loved how after it all they go back and show every location that the couple shared together. Loved how the dialogue never wavers, never addressing the relationship directly but allows us to indirectly see a geniune bond forming through the body language, facial expressions, and the dialogue, ooooohhh the dialogue. Every bit of it plucked right from those top ten late night conversations we've all had with close friends whether it was serious or in jest. And respect to Linklater for keepin it real, the movie was rated R cause of a couple minor swear words? Could of easily been removed without really desecrating the film but he keeps it in anyways. Screw you hollywood, your 'romantic comedies', your Freddie Prinze Jr.'s, your 'take the glasses off the girl and now she's pretty' movies. This is real romance! This is what I come to the movies for, to think, to be provoked and to be swept away by the magic that only cinema can provide. Before Sunrise has single-handedly reminded me about why I goto the movies......","user":"Look Closer","rank":[527,570]},{"title":"Love Still Exists.","rating":10,"date":"14 August 1998","review":"This has to be one of the most sincere and touching boy-meets-girl movies ever made. While \"Rebel Without a Cause\" and \"Say Anything\" deliver nice portrayals, this movies strips down useless subplots and Hollywood divergences. This movie focuses purely on watching the budding of a beautiful romance. You never doubt for a second that the film will lead towards the romantic pairing of these two people. You almost immediately sense the synergy and the chemistry between Jesse and Celine, and it is simply pure joy to watch them find it. This movie is mostly all dialogue -based. But, every conversation between these too is greatly intriguing. What makes this pairing so romantic is how real it is. How in all that conversation, while often having no real bearing on anything critical, you can sense the nuances as these two become more fond and trusting of each other. This is exactly they way you would dream that you meet that special someone. And what makes it so true is that it is not even too fantastic to believe. This could be what would happen if you had been confident enough to strike up a conversation with that person you noticed somewhere random. And what puts the icing on this film is the magnificent backdrop of Vienna in which this film takes place. It just adds to the feeling of romantic nirvana that the film suggests. And no matter how many times I watch this film, I don't think I will ever tire of that.","user":"Sickfrog","rank":[355,396]},{"title":"The beauty is the simplicity of magnificent human emotion.","rating":8,"date":"8 March 2000","review":"'Before Sunrise' is not a film to be scrutinised, nor studied. The absolute beauty of it lies in its perfection as a simple love story - of two lives suddenly thrown together in the midst of reality, and the ensuing night of simple love that follows. Every individual at some time in life dreams of the connection that is portrayed in this film between Jesse and Celine, and few ever find it. 'Before Sunrise' simply and elegantly demonstrates how the most fundamental passions of human emotion can envelope two complete strangers.  The beauty of this film is that the story is the most important element. The ending is both provocative and emotional - scenes of the night previously seen in darkness are now portrayed in lonely daylight as the sun rises and the story closes on these two characters.<br><br>I saw this film by accident one night late on television. I have never forgotten it. So well is it made that the audience never question if this could ever really happen in life, reality being so absolutely characterised in it.<br><br>'Before Sunrise' is simply the story of two strangers bound in Vienna's lonely night splendour - one night of love in all its glory, one superb piece of film making.","user":"lady_writer","rank":[264,297]}]