[{"title":"One of the best underrated action thriller movies from Sylvester Stallone my personal favorite","rating":10,"date":"4 November 2015","review":"Cliffhanger (1993) is one of the best Action thriller heist movies of the 90's. I love this film to death! It is one of my personal favorite movies. Besides the Rocky and Rambo which are Stallone's most popular stuff I would put Cliffhanger right above those! I absolutely LOVE this film!!!! Gabe Walker is awesome I love it. I would put this movie over Rambo III and Cobra because I have enjoy it more than those two films. I don't like Rambo III it is a bad action movie. I love Cobra but Cliffhanger beats Cobra and I love Cliffhanger to death It is my childhood movie. <br><br>This is the finest action movie of all time and it is a perfect 10 it deals with no CGI but real climbing, real action sequences. Dangerous stunts that people could have died. Even for a $70,000,000 budget movie the action and the stunts are well done for the 90's. <br><br>Renny Harlin made an awesome job on this movie. The movie is awesome. It has slow motion running jump! The action sequences in this movie are fantastic! It is actually the first best favorite Action that Stallone did, I love this film and it is my childhood film I love it. One of the most Stallone hit and the most successful Stallone film! This movie is filmed in the real Rocky Mountains and not a CGI or computer crap the stunts are real and insanely crazy. I watch this movie with my dad on Blu-ray 3 years ago and I really want to say thank you to Stallone for making this movie. I have enjoy it and even my dad did enjoy it and it is really my favorite memories on my dad so thank you Stallone. <br><br>Is one of my first best favorite movies ever. Why I love this movie and I put it above Cobra? Simply because the whole movie is about thrills in the rocky mountains during snow time. Renny Harlin's 'Die Hard 2' was cool, and he gave the world 'Cliffhanger', one of the most awesome action movies ever. That's right, 'Cliffhanger' rules, and we all know it. Stallone uses his mind and not his muscles, a machine gun or a hand guns to defeat terrorists. He uses his mind, he is rescuing people and he try's to save his friend's life, who is held hostage by terrorists. They are thrills, suspense, avalanche and action all over the place in the Rocky Mountains. And I seriously love this Action thriller. The opening scene where the girl is hanging on the line for her dear life, still makes my hands sweaty. And When Gabe Walker couldn't saved her, I really felt pain and I mourn with Stallone's character. Cliffhanger was actually the film I grew up with it. It is a stone cold classic action film a film that I will always cherish! <br><br>Mine favorite is Cliffhanger and almost no one puts Cliffhanger into their favorite best action movie so I put it as my Top 4 best Stallone action movies out there. Sly's best out and out action film. It is a superbly enjoyable movie with some interesting characters, solid performances and Renny Harlins direction is stylishly assured. Stallone is rarely this interesting in his action films and he certainly looks the part in terms of the action scenes. This was one of the best action films of the year and one of the most thrilling and enjoyable of the 90's, a definite genre classic. As a Stallone fan this is one I look back on with fond memories. Plenty of superb action and Sly in prime action man form. Action lovers appreciate this film because it has all the hallmarks that make a good action film. The film looks great and there is great support from Janine Turner, Michael Rooker and John Lithgow. On the airplane, the plane heist up in the air from plane-to-plane airborne transfer, a money transfer stunt was filmed in the USA as such a stunt is illegal in Europe. The stunt itself cost over $1 million to film. <br><br>Cliffhanger is a 1993 American action adventure film directed by Renny Harlin and starring Sylvester Stallone and John Lithgow. <br><br>I love this film to death beside Rambo movies, it is one of my favorite trills action movies. It is Die Hard in the mountains. I love the music theme from Trevor Jones, he write and made a perfect music score that fits to the film. <br><br>The basic plot story is about A botched mid-air heist results in suitcases full of cash being searched for by various groups throughout the Rocky Mountains. It is die hard movie in the mountains.<br><br>This movie is what it is, a perfect 10, because it takes the vision of one of the most imaginative directors on Earth. It is way to underrated and it is my personal favorite Stallone action movie.","user":"ivo-cobra8","rank":[100,121]},{"title":"Action Classic!","rating":8,"date":"23 July 2004","review":"Sly's best out and out action film. It is a superbly enjoyable movie with some interesting characters, solid performances and Renny Harlins direction is stylishly assured. Stallone is rarely this interesting in his action films and he certainly looks the part in terms of the action scenes. This was one of the best action films of the year and one of the most thrilling and enjoyable of the 90's, a definite genre classic. As a Stallone fan this is one I look back on with fond memories. Plenty of superb action and Sly in prime action man form. Action lovers appreciate this film because it has all the hallmarks that make a good aciton film. The film looks great and there is great support from Janine Turner, Michael Rooker and John Lithgow. ****","user":"supertom-3","rank":[71,91]},{"title":"The majestic mountains are a magnificent character in the film!","rating":7,"date":"9 July 2007","review":"Wracked with guilt after a lot of things felt apart on that ledge, an ace mountain rescue climber Gabriel Walker (Stallone) comes back for his girlfriend Jessie (Janine Turner), while over the cloudy skies where the weather looks a bit threatening, a spectacularly precarious mid-air hijacking goes wrong and $100 million taken from a Treasury Department plane get lost in the middle of nowhere followed by a crash landing <br><br>Stranded off the snowy peaks, and needing mountain guides to win back the stolen cash, the high-trained hikers make an emergency call asking the help of a rescue unit <br><br>Unfortunately, Gab and Hall (Michael Rooker) have to team up to arrive at the scene of the crash unaware that the distress call was a fake, and a bunch of merciless terrorists led by a psychotic (John Lithgow),are waiting for them only to find out a way off the stormy mountain with the dumped cases of money <br><br>With breathtaking shots, vertiginous scenery, dizzying heights, perilous climbs, freezing temperatures, \"Cliffhanger\" is definitely Stallone's best action adventure movie","user":"Nazi_Fighter_David","rank":[50,63]}]