[{"title":"Erotic with an big E","rating":10,"date":"29 August 2006","review":"This must be one of the most erotic films ever made,if you like this , you must see the rest of Tinto Brass movies. Claudia Koll are playing an excellent roll, and she is SO sexy This film are very erotic , without going over the fine line between erotic and porn. I have seen and have most of the Tinto Brass erotic movies that are made , and I must say that I like that kind of movies where the ladies are natural and not filled up with silicon. So if you want an erotic ,sexy,hot movie, just get one of Tinto Brass and your evening will be saved. I have seen a lot of other erotic movies form all over the world, and I must say that I liked the erotic movies that came out in the USA in the 1970 was more erotic than the movies that are coming out today. todays movies have no humor.","user":"Anthons","rank":[41,55]},{"title":"Tinto's entertaining but one sided on affairs.","rating":6,"date":"28 April 2019","review":"I've seen most of Tinto's films and this one follows the same mold..... Wife cheating, but the husband should be understanding because she loves him. It's interesting that Tinto never has the husband respond with affairs of his own. If Pollo had told Diana it's fine we'll have an open marriage.... There are some sexy ladies at work who want my body... Would she be understanding?\nClaudia Koll handled her part well, but Pollo could have been better cast. Tinto's films are a step up from most soft-core.","user":"shoe20","rank":[6,7]},{"title":"horrible male lead","rating":3,"date":"14 February 2006","review":"call me crass, but i preferred the higher titillation factor of \"Cheeky\", another anally fixated comedy from tinto brass...<br><br>although \"all ladies do it\" has some witty moments (when compared to say, \"cheeky\"), they are destroyed by the hateful dubbing... i'm sure this movie has more appeal in its native language... next time someone transfers this to a boxed set, USE SUBTITLES! there are not enough genuinely erotic or explicit moments... it teases, to be sure, but the centerpiece of the movie is distinctly uninviting... a huge carnal disco on the outskirts of town, with enough freak factor to fuel the warhol factory... unfortunately, the synthesis of 80's dance music and bopping italians may make for some good laughs, but little excitement...<br><br>the story is virtually identical to \"cheeky\" and \"monella\"... the bored wife of an \"uptight\" man (in brass world, anyone who doesn't get excited by his wife cheating on him) is intrigued by all the sexual tension around her, and decides to live in a state of hedonism... she does maintain that she reserves her love for her husband, but it takes awhile for him to come around to the idea...<br><br>the main male character is horrible to watch... during the sex scenes, he grits his teeth, strains his neck muscles, and basically freaks out... not something you'd like to witness...<br><br>once again, brass uses all his trademarks... mirror shots, overheads of black and white corridors, seduction in the toilet, urination, plenty of derrière, and laughable philosophy... normally i would smile and accept his vision of an impossibly ripe world, but this movie somehow disappoints, even with low expectations... some crisp and bold colours though... tinto could make a fortune filming washing powder ads...","user":"fog-9","rank":[24,42]}]