[{"title":"A gentle introduction to Buddhism","rating":21,"date":"21 January 2000","review":"If you suspend your need for believable characters, this film does have moments that take you to another world where good and evil are at odds and how one man, Prince Siddharta (Keanu Reeves), deals with the inner demons that reside within us all.<br><br>The scenes in which you learn about the life of Prince Siddharta are beautifully done.  We get a Buddhist primer of sorts, and learn about the trials that Prince Siddharta had to go through on his quest for enlightenment.<br><br>As for the rest of the movie, well, it just dragged in a lot of places and the characters just were not all that believable.<br><br>If you know little or nothing about Tibetan Buddhism and would like to get a sense of it without getting into heavy dogma and spiritual practice, this movie is a nice intro.","user":"fulano-2","rank":[33,36]},{"title":"Nothing wrong with slow.","rating":10,"date":"10 January 1999","review":"I certainly disagree with the commentary that calls this movie plotless.  I agree that it's slow, but what's wrong with slow? Roger Ebert put the movie down by calling it 'Buddhist Sunday School.' True, the Buddha parts are simplistic, but then so is the original Buddha story.  Slow, thoughtful, peaceful, subtly stimulating, and with a plot to end all plots-- the one-ness of all individuality. I much prefer this to the more recent Kundun, which tries to tell essentially the same story.  In fact, Scorsese rips this movie off dreadfully, even to the same wiping out of the sand pattern at the end.","user":"wcb","rank":[47,53]},{"title":"worth watching...","rating":7,"date":"13 February 2000","review":"This was a very enjoyable movie.  If for nothing else, it is worth watching for the beautiful scenes.  I was fascinated watching Keanu as Siddhartha. He really seemed to lose himself in the role. I would really recommend this movie when you are in the mood for something gentle, beautiful to look at and at the same time, providing an interesting insight into the Buddhist world.","user":"becarooh","rank":[31,34]}]