[{"title":"Fantastic Four","rating":6,"date":"24 February 2020","review":"Competent entertainment, and a fun feuding dynamic between youngish heroes not quite ready for the limelight, but it's basically just the Marvel Origin Story Template applied once more. Jessica Alba can't act, but Julian McMahon as Dr. Doom is one of the better villain performances in this stable.","user":"MR_Heraclius","rank":[37,39]},{"title":"Captures a time when superhero films were more joyful","rating":7,"date":"13 August 2015","review":"Fantastic Four is one of the last superhero films, that I can recall, that wasn't insufferably bleak or incredibly serious to a point where any shred of humor was seen as obtuse to the film's narrative. Yes, Christopher Nolan's Batman trilogy is an indisputable breakthrough in superhero films, but it also made the seriousness of superhero films standard, something that would follow into the late 2000's and early 2010's as Marvel built up The Avengers. Fantastic Four reminds of the quirkiness superhero films were once predicated upon, and while it may get a bit too corny at times, and its focus can never really settle, it's also a very commercial film that satisfies on some level of entertainment when it gives every card in its deck a fair time to shine.<br><br>We open by looking at a physicist named Dr. Reed Richards (Ioan Gruffudd), who is convinced evolution was triggered millions of years ago by stray elements of cosmic energy in space, some of which will pass near Earth very soon. His pal, astronaut Ben Grimm (Michael Chiklis), works by his side on this potentially revolutionary discovery by helping him convince their old classmate Dr. Victor Von Doom (Julian McMahon), the CEO of Von Doom Industries, to allow both of them access to his private space station to further experiment with the effects of these cosmic energy particles. While Doom agrees, he winds up walking away with most of the profits that this experiment will bring, affirming Reed's desperation to make his project work.<br><br>Still, he persists on and brings his close friends Susan Storm (Jessica Alba) and her brother Johnny (Chris Evans) along for the ride. However, when a trip to outer space goes awry, exposure with the cosmic energy results in the four receiving deformities and enhanced human abilities that have never before been seen: Reed possesses the ability to stretch every limb of his body, Susan has the ability to disappear and reappear at her leisure, Johnny can have his body engulfed in flame simply by reciting the phrase \"Flame on!,\" and Ben turns into a hideous, orange rock monster.<br><br>Following the four's mutations, writers Michael France and Mark Frost focus a great deal of their time on the agony that these mutations bring, particularly The Thing, who experiences his wife leaving him shortly after revealing his deformity. While this agony is a solid angle (one I'd argue necessary in most superhero films), too much of the time is spent profiling The Thing and not enough on the remaining characters of the film. Reed and Ben, who are ultimately the film's main focus, wind up monopolizing too much of the picture, and any time we see Johnny is when he's right in the middle of making a smug comment or being his typical, womanizing self.<br><br>The action in Fantastic Four has a colorful commercial look to it, brilliantly bold and very vibrant in a way that makes many of the scenes pop with life. It manages to achieve a comic book aesthetic without resorting to picture-in-picture editing. One particularly involving scene takes place on a suspension bridge, where The Thing is seen pummeling everything in his sight and the remaining three members of the team must resort to either relaxing him or protecting drivers and innocent bystanders.<br><br>The goofiness in Fantastic Four, however, in an age of dark superhero films that come with slick aesthetics and brooding characters, is a delightful change of pace. Yes, there is a point when one wishes director Tim Story, France, and Frost would command a tighter grip on the seriousness of the writing, but the pulpy fun of Fantastic Four, in addition to the effects and the neatly choreographed action, keep it a moving, satisfying spectacle that is more than just colors flying around on screen, trying to find their place.<br><br>Starring: Ioan Gruffudd, Jessica Alba, Chris Evans, Michael Chiklis, and Julian McMahon. Directed by: Tim Story.","user":"StevePulaski","rank":[28,32]},{"title":"\"A few days in space, what could possibly go wrong?\" (minor spoilers)","rating":7,"date":"16 August 2015","review":"Following a failed experiment in space, a group of astronauts gain super powers following exposure to radioactive energy. This exposure gives the astronauts different super powers and doctor Reed Richards (Ioan Gruffudd) is attempting to find a way to reverse the effects of the radiation on his team. However, Doctor Von Doom (who has also been exposed to the radiation) has his own agenda and is intent on using his super powers to try to take down the Fantastic Four.<br><br>Given its rather modest 5.7 average user rating I wasn't expecting much here and was actually fearing the worst. However, whilst watching this film I was surprised by how enjoyable I actually found it. The story has quite a lot of depth to it and most of the focus is on how the team cope with the way that the radiation has caused life-changing alterations to their DNA. Johnny Storm (Chris Evans) relishes his new found gift and does everything he can to make sure he's in the limelight - this makes sense as he's painted as a rather arrogant individual right from the start. Evans puts in a good performance and despite the arrogance of his character he does still have some likability about him. On the other end of the spectrum, we've got Ben Grimm (Michael Chilkis) whose DNA has been permanently altered by the radiation due to the fact that he received the most exposure to it. There is a very tender scene with his character at the start of the film where he goes back to see his wife and she can't handle what has happened to him and basically has nothing further to do with him (it seems bizarre that she doesn't even ask what has happened to him and doesn't seem interested in standing by him or helping him out - what a b*tch). Chilkis is also excellent here and gives a nicely balance performance with a character that is ugly and gruff on the outside, but has a real heart of gold on the inside. Alba and Gruffudd make up the other two characters in The Fantastic Four (Sue Storm and Reed Richards respectively) and sadly their characters are not quite as interesting as Ben or Johnny and their performances for me weren't quite as strong. Despite this though, the film provides many funny moments (mostly between Ben and Johnny) and the wonderful camaderie and rather interesting story and exploration of their super powers made this a winner in my book.<br><br>The only weak link with this film lay with Von Doom (Julian McMahon) as the villain of the piece and his motivations; he seems to lose it and go berserk because he's jealous that something is going on between Sue and Reed. OK, that's fine, but why then decide to try and kill Ben and Johnny when his issue is with Richards and Storm. Despite a good turn from McMahon, I never really took to him as a villain as I felt that jealousy alone was a rather thin and flimsy reason to justify his barbaric behaviour.<br><br>Taking everything into account this is a good film. It's fun, there are some interesting characters here, the exploration of their super powers are interesting and of course the special effects are incredible. It's definitely worth a look.","user":"jimbo-53-186511","rank":[15,16]}]