[{"title":"OK Fluff","rating":6,"date":"30 July 2005","review":"As another example of an average premise and equal execution \"Made In America\" doesn't disappoint. Whoopie Goldberg and Ted Danson star as one-time customers of a sperm donor bank that has mistakenly given them a very curious daughter. Entering her mid-teens, their daughter Zora (played affably by Nia Long) discovers she is the product of their unintentional love. While Sarah (Goldberg) wanted a strong, tall black man, she would have settled at least for the last part. Instead, she is introduced to Danson by her intuitive daughter after she uses her friend (played by Will Smith) to steal sperm donor records.<br><br>The rest of the film is pretty much by-the-book. Father and Mother fight, get along, date, daughter gets weirded-out, parents save daughter from bad decision and hug....fade to credits and cliché song.<br><br>In between:<br><br>The movie IS worth watching. I give it crap because it's fairly by-the-book but it's not awful. When I first saw this film I was a fan of Danson from \"Cheers\" and Goldberg from her one-woman show and guest spots on Star Trek: The Next Generation. I remember being pleasantly surprised by both. Danson is an accomplished actor, best in \"Pontiac Moon\", and stretches his comedic skills here. Goldberg, on the other hand is best here in dramatic moments. She is warm and vibrant with splashes of real brilliance but it's not enough. It's not that she can't do the comedy at all, she is an incredible comedian, the script just doesn't give her enough to do besides be shrill and clumsy with a smattering of nice. Her few scenes with Danson are worth the time spent watching and make up for their tabloid headlines at the time. As for Smith's performance, this early role wasn't much different than most. Every minute on screen he is a joy, still in his \"Fresh Prince\" mode here he certainly doesn't disappoint. Nia Long is the real find here. If one person from this film should have been given a better shake than anyone it is her. She is vibrant, funny and worthy of the people she shares the screen with. That says a lot.","user":"Hammer1310","rank":[14,15]},{"title":"A perfect Sunday afternoon movie","rating":7,"date":"16 September 2004","review":"I really like this film. It's been on British T.V. almost as many times as Mary Poppins and I'm always glad to see it. There is a chaotic comic chemistry between Goldberg and Danson, but they don't egotistically dominate the film, allowing the charming and funny performances by Nora Long, Jennifer Tilly, Will Smith, Peggy Rea and others to shine. I particularly like Tilly's character, a new age airhead, and her new boyfriend, played by Fred Mancuso, who between them, make stupidity lovable. Everyone gets a fair chance, and they all make the best of it. <br><br>Formulaic as it is, Made in America is about racial identity, which is a difficult subject to address in such a frivolous form as romantic comedy, but it manages to more or less avoid cringes and concentrates on the laughs, only giving as much time to story as is necessary to keep everything moving on. Against the odds and thanks to the superb cast this is a good natured film. It harks back to the optimism of the early nineties, and seems strangely innocent, eleven years on.","user":"peter-856","rank":[13,15]},{"title":"Watchable and sometimes charming comedy","rating":7,"date":"16 July 2003","review":"The movie seems to work better than the premise might suggest. The three leads - Goldberg, Danson and Nia Long, have a nice chemistry between them. Nia Long being particularly lovable as 'their' daughter. There are some good gags in it, although the movie is not overstuffed with them. The decent, heartwarming plot (just the right amount of twists) handles the race aspects with an exemplary ease.<br><br>Jennifer Tilly's bit-part was funnier and more successful than Will Smith's.<br><br>\nMade in America is hardly a classic but is worth watching if you like a little maturity in your comedy.","user":"mark1504","rank":[16,24]}]