[{"title":"A Great Movie for Anyone Who Plays Ball at Any Level","rating":10,"date":"17 January 2005","review":"I recently watched this movie for the first time, and as a 19 year old black male it spoke to me. However, I can see this being a film that everyone can appreciate. Especially now, with Lebron James and other upcoming HS athletes, you really see the other side of life that only they know.<br><br>This movie detailed the life of the #1 basketball star in HS, and the issues he deals with before he announces his plans for the future, further complicated by his father's contingent release from jail.<br><br>A GREAT movie, don't let the votes fool you, it's not a 6.5/10, more like 8.5.","user":"thekino","rank":[51,63]},{"title":"A flawed film that still flies.","rating":4,"date":"4 May 2003","review":"My two favorite Spike Lee movies are \"Clockers\" and \"He Got Game\" and they share similarities: both are about  guys trying to keep integrity amidst characters whose primary motives are to persuade him to leave the path.<br><br>\"He Got Game\" gets the edge because I love basketball and because I'm a sucker for well done father-son conflicts. The basketball parts of this movie are absolutely brilliantly shot. Most sports movies share two commonalities: completely ridiculous storylines and actors who throw like sissies. He Got Game avoids both.<br><br>Okay, some parts of the story are hoky, but allowable. But what makes this movie work, similar to \"Clockers\" is that you get sucked into a main character whose nobility is tested at every turn. Will Jesus Shuttlesworth make it through the maze or fall prey to it? And will he be able to recognize that his father is not just one more flesh peddler? It makes for good drama. But above that, the basketball scenes just completely rock. They're examples of absolutely masterful cinematography and editing. In fact, the movie has some of the best montage sequences every put on film. Seriously.<br><br>Denzel is excellent in this movie. He plays a Jeckyll and Hyde and plays both sides well. This conflicted character was very easy to root for. (I can identify.) NBA perennial All-Star Ray Allen, while more than a little stiff at times, holds his own as a non-actor in a dramatic role.<br><br>He Got Game is a flawed piece of work: parts drag, it's not without its hokiness, and the subplot with Denzel and Jojovovich didn't quite fit. But the essential storylines work and play true: you believe in a conflict between father and son and you root for a high school basketball player who requires the wisdom of an adult to avoid the flesh peddlers. Kudos to Spike for not trying to hit us over the had with his message, but letting it unravel naturally.","user":"ericb336","rank":[37,45]},{"title":"A fascinating performance by Denzel Washington in a solid film.","rating":8,"date":"4 November 1998","review":"Denzel Washington has one of his greatest charcaters in Jake Shuttlesworth in this compelling film by Spike Lee. Jake is a man serving a life sentence for the accidental murder of his wife during a domestic dispute. The dispute centered around Jake's aggressive coaching of his young son Jesus who he is obsessed with turning into a basketball star. As the film opens we learn that Jesus (effectively played by Ray Allen) has indeed become a high school basketball star and is being now aggressively pursued by University teams and commercial agents. In a somewhat fanciful, yet unfortunately believable plot device the Governor promises Jake early release from prison if he can convince his son to go to Big State.  Much of this film is amazingly well executed my only regret comes around some of the gender politics of the film (many of the female characters are underdeveloped and/or cartoonishly stereotyped). This is particularly unfortunate because the film has so much to say about the intersections of patriarchy/economic injustice/racism that I wish Spike Lee could have been a little more consistent with his development of the women characters (one notable exception is a brilliantly realized performance by Milla Javovich as a prostitute that rooms next to Jake). This said the film is still an important accomplishment and should be seen.","user":"Rigor","rank":[22,27]}]