[{"title":"What's the Big Deal?","rating":3,"date":"3 August 2003","review":"I've heard so many critics and average joes ripping into this flick like it was the first sign hailing the antichrist. The movie is simple, yes, but damn funny. Maybe I'm just not caught up in my own pretense to enjoy a simple movie. Yes, there are times when I crave something more sophisticated, but this movie still has my friends and I rolling in the aisles. Give it a chance and you just might like it. 7/10","user":"lost4wurds","rank":[91,113]},{"title":"Genuinely funny movie","rating":8,"date":"3 August 1998","review":"David Zucker has directed one of the most enjoyable comedies of the year with this goofy farce. Yes, it's a matter of acquired taste and depends upon a wealth of sophomoric gags, but it is consistently funny throughout unlike some recent comedic efforts. The film is loaded with all kinds of jokes ranging from the blatantly obvious to the more subtler kind that you must pay attention to everything in the frame or you'll likely miss them. Like his previous efforts which include \"Airplane!\", \"Top Secret!\", and \"Naked Gun,\" the humor flies out almost every second. There are so many moments that work, it's easy to overlook the few that fall flat. What sets this movie apart from other pale imitations in the spoof genre is that it has an actual story line. While others have depended upon making fun of too many famous scenes in almost random movies (take \"Mafia!\", please), this film tells a new story with likable characters. It touches upon sports films in general as well as satirizing the real sports industry instead of lampooning any specific movies. Even for people who don't care for \"South Park,\" its creators, Matt Stone and Trey Parker, make a good pair of leading actors with natural chemistry. The film also makes extremely effective use of cameos of athletes, sports announcers, and other celebrities, especially a hilarious bit with Robert Stack of \"Unsolved Mysteries.\" By the way, stay through the credits for a final joke with Bob Costas and Al Michaels. All in all, Zucker has achieved, in words perhaps applying to the movie's mix of sports, a home dunk.","user":"Mr. Gore","rank":[58,72]},{"title":"Indecently hilarious!","rating":1,"date":"1 June 2004","review":"I once watched Baseketball, got hooked and since then I watched it like 50 times. It is one of the films I cannot ever seem to grow tried of. I don't know what it is about it, but it is somehow so complete in its rough form.<br><br>Obviously, it doesn't hurt that there is plenty of nude (and amazingly gorgeous) women in the film (Victoria Silvstedt; WOW! is the only word that springs to mind!!!), but also because it is so delightedly respect-less towards just about anyone or anything.<br><br>All I can say to this flick is, if you like South Park, you'll LOVE this one! In fact, anyone with a sense of humour should enjoy this one!<br><br>7/10","user":"filmfreak-5","rank":[55,71]}]