[{"title":"And you thought your Father had problems...","rating":8,"date":"13 October 2007","review":"Wow, this is a must have for Japanese horror fans, and can you believe it, banned for all those years. Outstanding story involving a man finding his way back to his origins, which include his Father making malformed men, and ladies. My favorite, the goat women. This is quite a gruesome horror film from 1969 or so, that got banned in Japan, and therefore restricted everywhere. Don't worry, it's available now, and you need to see it, before it disappears again. Great DVD too, as it contains a commentary from some historians that will bore you to death. It did me at least, but nothing could damage my affection for this excellent shocker for the times. You thought your Father had problems, wait until you meet this dude. I like this one, it is decadent, gruesome, and has some naked girls. And should I forget, a pretty shocking depiction of the result of malformed men. Yes, Malformed Men, you have been warned.","user":"Indyrod","rank":[9,10]},{"title":"Bizarre attempt to mix horror with Butoh dance","rating":6,"date":"21 September 2007","review":"Postwar Japan gave birth to probably one of the most consistently weird dance forms, Butoh. It rather hard to describe except that the processions of anguished clay caked naked bodies and rag covered transvestites makes me think of a nuclear holocaust. Since Japan is the only country with any experience with the horrors of a nuclear holocaust, it isn't surprising.<br><br>We open with a dazed man in the middle of a cage of naked crazy women in a mental institution. We soon learn that he's an inmate as well. He is haunted by an odd children's lullaby. That night a strange bald man tries to kill him but instead our hero kills the bald man and escapes. Our hero hears the unusual lullaby and finds a circus performer who seems to come from the same remote place on the coast. He makes his way to the coast and finds out that a rich man who looks exactly like him has just died. He digs up the body and switches clothing becoming the dead man mistakenly buried too soon. Our hero then attempts to discover the strange secrets of the dead man's family while trying to imitate the deceased.<br><br>After watching this production I am very interested in why this film has been banned in Japan for so long. There are plenty of films that are WAY MORE DISTURBING, disgusting or horrifying from Japan, some made the same year! The most likely part is the second half of the film when the Butoh dancers are given plenty of screen time but much of it is mystifying to me rather then disturbing. The couple of torture scenes are rough but not worse then anything I've seen from any pinku film.<br><br>Anyway the film is quite good for the first half and starts to fall apart during the second half. It seems the the director and his camera person really didn't know what to do with the Butoh dancers. We get a number of very striking Butoh scenarios, poorly filmed (compared to the excellent filming in the rest of the film), that go by with the main characters just gazing on in disbelief. No real connection to the plot.<br><br>An interesting experiment.","user":"ChungMo","rank":[12,15]},{"title":"A Doctor Moreau... that's Japanese.","rating":8,"date":"8 September 2004","review":"It's funny that Ishii says he was not familiar with the Moreau storyline because this flick looks so much like a crazy adaptation for it. Not an intense feature but one that will serve you very memorable freaky and somewhat psychedelic moments that, out of the wild context, will remind you of all the Japanese contemporary horror everyone yells for (think Ring, Dark Water as much as video games like Siren and Project Zero...). Very poorly written plot, but who cares when they're served such crazy visions and a final I would place in my top 10 of mindblowing movie endings - but that's just me... That's a very hard to see movie, and well worth seeing if you get the chance.","user":"Elvoid","rank":[16,23]}]