[{"title":"Better than people give it credit for","rating":7,"date":"6 August 2005","review":"When Pocahontas originally came out, Disney's wave of recent hits came to a crashing halt. The film was labeled as racist or at least insensitive to Native Americans and the goodwill that Disney had established with its audiences quickly evaporated. You could say they have never been the same since. <br><br>The \"fearsome foursome\" that is The Little Mermaid, Beauty and the Beast, Aladdin, and the Lion King has no equal, except perhaps the last four Pixar movies. Pocahontas is not, unfortunately in that \"club\" and never will be. Disney spent the next four to five years trying to recreate the \"magic\" with films like Hunchback, Hercules, Mulan, and Tarzan. Unfortunately, none of those films had the surprise and \"good feeling\" of the earlier Disney hits, and except for maybe Mulan, none of those films, as films, were as good either. And although Pocahontas is and was the point where the schizm occurred, in retrospect, it's a pretty damned good movie. So what went wrong?<br><br>First, it wasn't the Lion King. They could have put out something \"safe\" after the Lion King, and it still probably would have paled in comparison to what was then a great big giant behemoth of a movie. That movie earned over THREE HUNDRED MILLION in its theatrical run in 1994 - not as common then as it is now - thing was a juggernaut. Pocahontas, following on the heels of this bad boy, was not going to live up to expectations. <br><br>People blamed the fact that it was about PEOPLE and not animals, and that it was based on ACTUAL history rather than a fairy tale. THEN they blamed the fact that the history part of it was botched and that the film's portrayal of Native Americans was at best insensitive, racist at worst. <br><br>I'll grant you that making Pocahontas' mentor a talking tree and having her learn English \"instantaneously\" because she listened to her heart is a wee bit ridiculous, but racist? Come on. The message of the film - that love can conquer hate - is anything but racist and if anything, the film shows the \"Indians\" in a more human light than the English, who are their usual, stereotypical pig-headed selves. <br><br>Here's what else is good about the movie: The SONGS. Remember 'Colors of the Wind'? Could there be a better song about reconnecting with nature and valuing the earth more? We NEED this song right now, especially, with the world seemingly sliding ever more into a consumerist \"bliss,\" what better than to see some beautiful chick running through the forest teaching that rugged white man how to value LIFE? And what the hell is wrong with that I ask? <br><br>And what about some of the other songs? The one about the RIVER BEND and making choices - good stuff. And the whole montage ending song that repeats SAVAGES SAVAGES BARELY EVEN HUMAN from both sides - showing that BOTH SIDES misunderstand each other. It gives me chills when Pocahontas is running and you see the war superimposed behind her and she sings \"HOW LOUD BEAT THE DRUMS OF WAR!\" - makes me want to cry! Don't we need this now I ask you?<br><br>But, by far the best thing about this movie is - the animation. It is absolutely GORGEOUS. The design for this film is sumptuous, with mostly blues and a seamless style that never gets in the way and illustrates the action (and the feminine nature of the film) so beautifully. Compared to the dreck that is the HUNCHBACK - that film is ugly as sin - and the absolute HIDEOUSNESS of Hercules - the animation in that is strictly straight-to-video, Pocahontas absolutely ROCKS. Only Mulan, with its chirpy story and colorful style match up to the grandeur of this one. <br><br>While Pocahontas didn't have the grand ending that the Lion King had (it was a downer, remember?), the story bucks tradition by making it about people instead of animals, and its' message outweighs the \"historically inaccurate\" complaint. What movie IS historically accurate? Disney took a chance with this one and they got BURNED, which is why they went back to doing \"safe\" crap like Hunchback, which tanked anyway. They should have done the SCARLET LETTER or something like that - really start pissing people off. How about the MARQUIS DE SADE? There's some history for you!<br><br>Watch Pocahontas again without the weight of expectations. You'll be surprised by how good it really is.","user":"Jisk","rank":[251,297]},{"title":"Even better 10 years later!","rating":10,"date":"12 June 2005","review":"Recently I started watching this again with my 4yr old son and fell in love with it all over again! The music is outstanding (I especially love the \"Colors of the Wind\") and the entire movie is a visual treat! I know many have complained that the movie is a European version of an event and demeaning to American Indians, but from what I've read, Russel Means (voice of Powhatan) was happy with the final product and its portrayal of Native Americans. Whether or not it is historically accurate, it is great entertainment and I believe the overall message of peace and acceptance between peoples is timeless good advice. All in all, a great addition to the Disney catalog of movies.","user":"irishgrl-1","rank":[73,90]},{"title":"Beautiful... In Every Sense of the Word","rating":9,"date":"18 November 2015","review":"During the famed \"Disney Renaissance\", a period that started in 1989 with the release of The Little Mermaid and continued through the entire 1990s, Disney was creating modern classics with every film they released. In the midst of this revolution came Pocahontas, a rousing animated musical, directed by Mike Gabriel and Eric Goldberg. Pocahontas is something of an outlier in the Disney cannon. It is not a cutesy, kid-centric fairy tale a la Disney classics like Snow White and the Seven Dwarfs or Beauty and the Beast. What Disney's 33rd animated feature is, is a sensational movie musical, and one of Disney's most technically accomplished works.<br><br>Pocahontas, in typical Disney style, takes a well-known tale and molds it into an easy-to-digest story set to music. In this case, for the first time at Disney, the story is not entirely fictional. Here's where some people come down on Pocahontas. No, it didn't stay completely true to what really happened with John Smith and the real story of Pocahontas, but it would be a much lesser movie if it had. Pocahontas, the movie, is based on the legend of Pocahontas rather than the reality. The decision to romanticize the legend is a no-brainer. This is Disney after all. We expect strong archetypes and accessible drama.<br><br>The story begins with English settlers setting off for Virginia. Their leader, Governor Ratcliffe (David Ogden Stiers) comes in search of gold, John Smith (Mel Gibson) comes for the adventure of a lifetime. Back on the New World is Pocahontas, a young Algonquin princess voiced by Irene Bedard, who is set to be married to the tribe's dashing bachelor, Kocoum. It's all very predictable Disney stuff. The settlers are mostly just boisterous, gold-lusting, brutes, The princess is weary of getting together with the jock character, and there's only one man who understands her. We've heard it before. Even so, the story is handled with care and the familiar elements are welcome for the most part. The unfamiliar elements, chief of which is a surprisingly mature and complex love story between John Smith and Pocahontas, are where Pocahontas' plot stands out from its Disney siblings. There is more to this film than surface layer romance. Complimenting the dramatic story of betrayal and acceptance is a poignant message about coexisting peacefully with each other and the world around us.<br><br>The story is as moving as any other Disney classic, but what makes Pocahontas a notable Disney Renaissance landmark is its animation and music. Hand drawn animation had been around for a half century before Pocahontas, and stage musicals a hundred years before that. It's a wonder then, that somehow Pocahontas still manages to be a jaw-dropping example of both. I don't think the film gets the credit it deserves as one of Disney's best drawn films. The animators, led by the legendary Glen Keane, do things with animation that were game-changing, even by the high standard set by the world's leading animation studio. The character designs are expertly idealized, accentuating facial features and movement without ever crossing the line into cartoon. The backgrounds are even better. The untouched beauty of the American landscape is given scale, depth, and an expressionistic dynamism. It all comes together in the musical numbers. <br><br>Music is always a matter of taste, but for me, every song down the line in Pocahontas worked in a big way. I honestly cannot think of another musical that can make that claim. Every musical, animated or otherwise, has at least one dud. It's a rule. Pocahontas breaks tradition. The rhythmic \"Just Around the Riverbend\", the wonderfully wicked \"Mine, Mine, Mine\", and the grand, Oscar-winning spectacle that is \"Colors of the Wind\" are all rousing, bombastic, and sweeping pieces of music. The songs are up to the quality of the very best Broadway musicals, and the animation only improves the numbers. The explosively vivid colors and spacious movement that go along with the songs are artistry of the highest kind.<br><br>There is a surplus of talent and passion in every fiber of Pocahontas. When all the pieces come together, the story, the animation, and the music, Pocahontas is remarkable. It's a film of craftsmanship and quality. While kids will no doubt enjoy it, it's not made \"for\" kids. Like the best Disney movies, Pocahontas appeals to anyone who loves music and appreciates the warm touch of hand drawn animation. Add to the sights and sounds, some of which were enough to literally take my breath away from me, a timeless message of acceptance and stewardship of nature, and what you get is a classic, Disney or otherwise. Show this movie to your kids, watch it yourself, just see it. Pocahontas is in a word... Beautiful.<br><br>92/100","user":"jaredpahl","rank":[42,51]}]