[{"title":"Based on a true story, but fictional...","rating":3,"date":"3 November 2004","review":"I first saw \"Anastasia\" in the theatre the last day of November, 1997, the year it came out. I was eight, the year she is in the prolouge. Ever since, I have been interested in the story of Anastasia Nikolaevna Romanov, her life, and her untimely death.<br><br>While I know the movie is not historically accurate, I don't care! The movie is fiction after all- based on a true story (of Anastasia's rumored escape and women who claimed to be her), loosely, mind you- but perhaps it is not as unlikely as it seems: when the remains of the Romanovs were discovered back in 1991, Alexei (her brother,the Czarvitch) and one of the Grand Duchesses were missing. And with age analysis of the bones, scientists believe that the missing daughter is in fact Anastasia, and not one of her sisters, Olga, Tatiana, or Maria. But who really knows what happened?<br><br>My opinion of the movie is that it is wonderful. It draws you into the world of the lost Russian Princess, to a time that is \"far away, long ago\", that doesn't exist anymore.<br><br>The music and animation are stunning, and the photo research of St. Petersburg is amazing! Take the Catherine Palace and the magnificent gate you see, as well as the city itself. The 3-D animation is amazing; you look like you could reach out and touch it! The music is truly magical; \"Once Upon a December\" (especially Deana Carter's version)<br><br>is haunting yet beautiful. I own the soundtrack- I listen to it frequently<br><br>to help me relax.<br><br>But what I love best about the movie is the romance that occurs between Anya(Anastasia) and Dimitri. It starts out as a con, a trick for money, and turns into a love story. I think it shows that people really do have good in them, and that true love really exists. It's also heartwarming to think that a young boy who saved the girl he liked (princess or not) later helps her restore her identity and find a true place (in this case, happily together with him).<br><br>\"Anastasia\" is really my favourite movie of all time, even though now I'm almost 15. I'd recommend it to anyone, and advise historical literialists to look beyond the fiction and let yourself be taken on a \"Journey to the Past\" with the romance, comedy, and magic of this story.","user":"kittykatze","rank":[126,145]},{"title":"Better than I remembered","rating":8,"date":"12 April 2011","review":"The last time I saw this, I thought there were maybe too many songs in it that distracted the feel from the movie. But now that I've seen it again, it's clear that the songs are well written, along with the storyline.<br><br>This is not based on a true story, only loosely on a few rumors that the real Anastasia survived the killing of her family. The heroine Anya is like a Disney princess who is desperate to find out who she is and where she belongs, after suffering from amnesia following the separation of her family. The villain is the brilliant Rasputin, back from the dead, intent on extracting revenge on the Romanovs, thus starting the Russian Revolution. Dimitri and Vladimir at first are looking to find the ideal Anastasia look alike in order to get the riches from her real mother in Paris.<br><br>A lot of Bluth's films revolve around a journey and a couple involving some history on Russia. I really enjoyed the songs that played over the end credits, \"At the Beginning\" and \"Journey To The Past\" sung in her own way by Aaliyah, the beautiful angelic voiced R&amp;B singer who left way too soon.<br><br>Brilliantly animated for its time and enjoyable for adults, Anastasia remains a classic family film.","user":"Avwillfan89","rank":[22,23]},{"title":"A classic for all ages","rating":9,"date":"17 March 1999","review":"Let others carp about the disservices to history:  this Anastasia rises above its flaws to offer an engaging, emotionally resonant story of a girl's search for identity.  Within its historical, quasi-factual context, the film presents a situation almost everyone can relate to--that of trying to find one's place in the world.  Orphaned Anya's quest for her past (and, consequently, her future) strikes universal emotional chords:  singing \"Journey to the Past,\" she sets out with both trepidation and hope to find her identity and her place in the world.  The haunting, poignant \"Once Upon a December\" sequence, one of the finest scenes in any recent film, is unforgettable, as we watch Anya's yearnings take the form of a ghostly dance with memories of a vanished life.  And the final reunion where hostility melts gradually into acceptance, is one of the most moving and satisfying moments in film. Everything about the film bespeaks loving attention and quality:  the magnificent animation and design re-create lavish Russian and Parisian locations (complete with recognizable artworks and cameos by celebrities of the '20s), and the screenplay balances action, humor, and genuine emotion. Villain Rasputin is clearly aimed at children, and some of the repartee between Anya and unlikely hero Dimitri may seem jarringly anachronistic, but viewers of any age should still enjoy this timeless coming-of-age story.","user":"Oriel","rank":[76,89]}]