[{"title":"Hope in Times of Despair","rating":9,"date":"4 October 2007","review":"Anthony Minghela's (writer/director) Cold Mountain is a carefully constructed, sensitive, and intelligent drama set in the social context of the confederacy during the civil war. It deals with the politics of the war in a very subtle and realistic manner. While it accurately depicts the brutality and inhumanity of that war, it also does something that many films related to this period do not handle effectively - Cold Mountain studies the southern context from the inside out, and portrays changes among the non-slave owning common people wrought by the war. Almost uniquely, Cold Mountain does not over-generalize southerners, northerners or anybody else.<br><br>The film surfs through genres as needed - never presenting a dull moment. It is a romance, a war story, an action-adventure and historical fiction, all nicely woven into one.<br><br>The story centers on Inman (Jude Law) and Ada Monroe (Nicole Kidman), who are smitten with each other for very simple reasons. As this young romance begins to bud, Inman enlists in the confederate army, taking with him a book Ada has given him and a photograph of her. Ada's character is one of the most brilliant aspects of the film, which is important because the audience experiences this film from a third person perspective, but the story is clearly hers from the beginning to the end. Ada is an intelligent southern belle and daughter of a liberal minister. She begins the film as a daddy's girl skilled in many of the arts that southern women who have been surrounded by servants most of their lives were expected to learn. In other words, as she admits to Ruby Thewes (Renee Zellweger), she is a master of everything useless.<br><br>Ada's father passes on, and she is left to manage his modest estate by herself. With no experience of this sort, she struggles, and survives by holding the memory of Inman close to her heart. Ruby enters the picture as a tough young woman who has been raised by a drunk and negligent father. Ruby has all the skills and abilities Ada lacks, and as they become inseparable business partners, they grow to love one another as best friends. Inman's experience is radically different, but something of a mirror image. During his participation in the war, he sees many friends killed for causes they don't really believe in, and decides to desert. Nobody he meets comes to his rescue as he begins the thousand mile walk back to Cold Mountain and Ada, and most of those he meets die.<br><br>The bulk of the film takes place during Inman's long walk, following both of the protagonists as they live, learn, grow and change. An on-going act of will borne of desperation preserves their intense passionate love. For Inman, it is his only source of hope in a world of pure desperation. For Ada, it is very much the same thing, but also a symbol and remnant of the old south - a world which is rapidly passing.<br><br>The cinematography is powerful and breathtaking. There are beautiful shots of Appalachian landscapes which give the film a strong sense of history. The script and editing are also extremely strong - emphasizing the broad class and educational differences reflected in the ante bellum southern dialects of the middle and lower classes. With the cast of this film, nothing short of perfection should be expected. And the cast, mostly, rises to the occasion. My one criticism, however, relates to the accents adopted by Kidman and Law's characters. An Australian and a Brit probably should not be expected to accurately reproduce southern American speech, but there are a few occasions where these two exceptionally gifted actors produce distracting vocal slips. I admit my oversensitivity to this, and can say with some confidence that it won't bother most people. Zellweger's performance is outstanding and she creates a character I will remember into my senescence.<br><br>Very highly recommended.","user":"mstomaso","rank":[63,75]},{"title":"A chilling vision of a tragic era","rating":8,"date":"22 August 2005","review":"'War movie' is a Hollywood genre that has been done and redone so many times that clichéd dialogue, rehashed plot and over-the-top action sequences seem unavoidable for any conflict dealing with large-scale combat. Once in a while, however, a war movie comes along that goes against the grain and brings a truly original and compelling story to life on the silver screen. The Civil War-era \"Cold Mountain,\" starring Jude Law, Nicole Kidman and Renée Zellweger is such a film.<br><br>Then again, calling Cold Mountain\" a war movie is not entirely accurate. True enough, the film opens with a (quite literally) quick-and-dirty battle sequence that puts \"Glory\" director Edward Zwick shame. However, \"Cold Mountain\" is not so much about the Civil War itself as it is about the period and the people of the times. The story centers around disgruntled Confederate soldier Inman, played by Jude Law, who becomes disgusted with the gruesome war and homesick for the beautiful hamlet of Cold Mountain, North Carolina and the equally beautiful southern belle he left behind, Ada Monroe, played by Nicole Kidman. At first glance, this setup appears formulaic as the romantic interest back home gives the audience enough sympathy to root for the reluctant soldier's tribulations on the battlefield. Indeed, the earlier segments of the film are relatively unimpressive and even somewhat contrived.<br><br>\"Cold Mountain\" soon takes a drastic turn, though, as the intrepid hero Inman turns out to be a deserter (incidentally saving the audience from the potentially confusing scenario of wanting to root for the Confederates) and begins a long odyssey homeward. Meanwhile, back at the farm, Ada's cultured ways prove of little use in the fields; soon she is transformed into something of a wilderbeast. Coming to Ada's rescue is the course, tough-as-nails Ruby Thewes, played by Renée Zellweger, who helps Ada put the farm back together and, perhaps more importantly, cope with the loneliness and isolation the war seems to have brought upon Ada.<br><br>Within these two settings, a vivid, compelling and, at times, very disturbing portrait of the war-torn South unfolds. The characters with whom Inman and Ada interact are surprisingly complex, enhanced by wonderful performances of Brendan Gleeson as Ruby's deadbeat father, Ray Winstone as an unrepentant southern \"lawman,\" and Natalie Portman as a deeply troubled and isolated young mother. All have been greatly affected and changed by \"the war of Northern aggression,\" mostly for the worse. The dark, pervading anti-war message, accented by an effective, haunting score and chillingly beautiful shots of Virginia and North Carolina, is communicated to the audience not so much by gruesome battle scenes as by the scarred land and traumatized people for which the war was fought. Though the weapons and tactics of war itself have changed much in the past century, it's hellish effect on the land is timelessly relevant.<br><br>Director Anthony Minghella manages to maintain this gloomy mood for most of the film, but the atmosphere is unfortunately denigrated by a rather tepid climax that does little justice to the wonderfully formed characters. The love story between Inman and Ada is awkwardly tacked onto the beginning and end of the film, though the inherently distant, abstracted and even absurd nature of their relationship in a way fits the dismal nature of the rest of the plot.<br><br>Make no mistake, \"Cold Mountain\" has neither the traits of a feel-good romance nor an inspiring war drama. It is a unique vision of an era that is sure not only to entertain but also to truly absorb the audience into the lives of a people torn apart by a war and entirely desperate to be rid of its terrible repercussions altogether.","user":"oschaefe","rank":[112,147]},{"title":"It's the lasting effects of war on the idividuals...","rating":11,"date":"11 December 2003","review":"Anthony Mingheller's astounding film cleverly sweeps the audience into the horrors of war at its beginning.  He then introduces his two principle characters who would gradually move the audience into their world wrought by war and hardship. We watch as the characters begin to unravel their internal tortures and their need to subdue their isolation to face their regrets and hope for the future.  This is an absolutely fabulous movie that portrays the stunning performances of its stellar cast of actors and the overwhelming raw landscapes that are kept in sync with their events and moods.  Observe the stages of emotional changes in the characters. So amazingly and magnificently captured at different camera angles, from scene to scene against the cold, mountainous countryside!<br><br>This film isn't throwing off longwinded dialogue and lengthy physical encounters between Jude Law's Inman and Nicole Kidman's Ada to reveal the meeting of two souls searching for a meaningful existence.  Yep, it's that brief and silent stare of Inman as he confronts the graciously low-keyed, prim and proper Ada that explicitly puts their sensory awareness of each other so powerfully on screen.  As the events flow, I was completely mesmerized by the Inman character watching him transcend to his sense of isolation and his developing disillusion with his world. On the other hand, I couldn't take my eyes off the immaculately well-bred and gorgeous Ada as she succumbs into a scrawny hapless damsel in complete distress.  It's fascinating to watch the couple adapt to situations beyond their control and to study the emotional and behavioral attitudes of two human beings altering at such opposing magnitude as a result of one war.  Observe how the once popular Inman slips into desolation in the battlefield, becoming even more tormented from his world as he meets up with some very strange characters. Will he ever find solace with these characters, or with Ada at the end? Will Ada, while feeling alienated from her new abode, at the beginning of the film and with the death of her father, be able to battle her insecurity to become spiritually enlightened and physically capable with the help of her new acquaintances?  Is she able to embraces what the farmland has to offer her? And will Inman be capable of escaping what the gruesome battlefield has come to mean to him?  This film lays out an enormous ground for the examination of the effects a war on different individuals.<br><br>The film continues to remind the audience that Ada and Inman are bound together by their haunting memories of one another.  That, indeed, is beautifully captured by the expressions on Law and Kidman's faces. The symbolisms, throughout the film, are plentiful and brilliantly ascribed, allowing the audience to join the dots to the destinies of the couple. Even crows, clearly suggesting doom and destruction, never fail to demonstrate the dark instincts that trouble a man's soul. And those women Inman meets in his journey seem to trigger the expectation of the audience to see him drawing closer to the woman he loves and to home.  Even these characters, encountered by Inman, provide a picture of how different people react to the war. But will war ultimately bring peace and safety to its protagonists? This film is a masterpiece that will provide much food for thought.<br><br>Renee Zwellweger is phenomenal in her boisterously loud 'Ruby' role. She brings another aspect of the American woman that's so different in breeding from Kidman's Ada.  Both are educated in their different cultural way of life.  What can Ada learn from Ruby, the frontier woman who sees the 'hands and knees' toiling as the only way of survival in her community? Zwellweger provides the comic relief that's much needed for this powerfully intense film.  She's superb in her role as the beacon of strength and hope for injecting a meaningful existence of living. Unlike the soldiers or the hypocritical Home Guard authorities that use guns to destroy their enemies, Ruby uses her hands-on skills to beat the odds of survival. It's uncannily delightful to watch her interacting with Kidman's character. She, Law and Kidman are definitely worthy of being recipients of the Oscar statuettes. They exhibit their superb non-stop performing talents in this film with their onscreen appearances. The Q&amp;A session with Brendon Gleeson (who plays Ruby's father), has prompted me to want to go see this movie again - to watch closely how the strength of the film's womenfolk can make a difference to the human beings' survival instincts.  I want to study again how hellish wars are for destroying and crippling, not only the physical, but the mental aspects of the masculine race.  And Gleeson does drive home an interesting question: When these mountain folks `volunteer' to fight a war, how come they should be penalized as deserters if they were to decide to opt out of it?<br><br>This film is a MUST-SEE. It's beautifully crafted, assembled, and absolutely mesmerizing in all aspects of filmmaking techniques and style. The music score and soundtracks are so appropriate locked into the events and the moods of the characters. And the film's title? It does project its allegorical appeal.<br><br>A+","user":"janyeap","rank":[137,186]}]