[{"title":"The antidote to all your troubles, \"1900\" will sweep you away","rating":20,"date":"20 September 1999","review":"It is at a time like this I wish I could expand my vocabulary to better articulate the virtues and qualities of such a fine film. I also find I'm bursting to talk about this film that I regrettably saw alone. I don't want to spoil it for anyone, but desperately want to share it with everyone.<br><br>\nThe talented star of \"The Legend of 1900\", Tim Roth, presented this film along with Clarence Williams III. His encouragement to the audience was that if anyone was the sort who liked to pick apart at films and critique their lack of realism, they should just leave now. He touted this wonderful vision from the director of Cinema Paradiso, Giuseppe Tornatore, and likened the film to a \"dream\". He also said that if anyone had seen his own film, \"The War Zone\", that \"1900\" was the antidote for it. I was slated to see \"The War Zone\" the next day, but that was fine by me. I managed by a sheer stroke of luck to get into this Canadian premiere and found it to be absolutely extraordinary and the best film I'd seen so far of the Toronto International Film Festival.<br><br>It seems as though mere moments after the initial credits, that the wonderful storytelling and incredible music combined with stunning visuals almost had me moved to tears. While I'll admit that I'd be seeing films all day, no film in my recollection had such an impact so quickly.<br><br>The story is one of an abandoned baby who is found on a ocean liner by one of the ship's crew. He is unofficially adopted and named \"1900\" for the year in which he was born. At a very early age the boy demonstrates an extraordinary gift for piano playing which is only strengthened in his passing years. The boy grows up with no official identity, into a man having never taken a step off of the ship onto dry land in his whole life. The young man, played by Tim Roth is encouraged by his dear friend to leave the boat and pursue a life of fame and fortune as the great pianist he has become. 1900 declines, explaining simply that everything he needs is on the boat.<br><br>Well, that should be enough to intrigue you; there's much more of course, but I've no desire to spoil it for anyone. I must encourage everyone to see this film, I can hardly imagine anyone being disappointed. It's for music lovers, dreamers, romantics and film buffs everywhere and my greatest hope is that it will be seen by many, many people, especially those I know and love. And after seeing the film, and hearing Tim Roth's words echoing in my mind, he was absolutely right. It is like a dream, a wonderful dream that I wished would never end. And for a future prediction, I see this film as a Best Foreign Film Oscar nomination for 1999.","user":"ToldYaSo","rank":[125,141]},{"title":"Legendary","rating":8,"date":"8 September 2001","review":"As its pianist, this film could be bound for success, but the fact is, it remained relatively obscure. I can't understand why did a movie with this deepness and feeling end up in oblivion. Because, if there are some beautiful movies, this is one of them, from the moment that fantastic Ennio Morricone score begins until we witness the tear-jerking finale. An epic story from tip to toe, we journey through the original story of a man who becomes a pianist on board the boat where he was born. And as he grows, so does the fascination by the others in his art and the questions whether he should take that leap overboard and become a \"normal\" person. A brilliant movie, from the man who brought us \"Cinema Paradiso\" and made us all cry, this won't disappoint you, and it's worth by Morricone's score alone. The sequence where the piano floats freely through the dance hall is anthological. A legend of its own.","user":"Dockelektro","rank":[114,131]},{"title":"A lovely film that has a heart","rating":8,"date":"24 January 2005","review":"On the first day of the twentieth century, an infant is discovered in the coal room aboard a luxury liner. The worker (Bill Nunn) who discovers the child on The Virginian names him 1900 or more accurately Danny Boodmann T.D. Lemon Nineteen-Hundred. Eight years later the boy loses his \"father\" in a ship accident but discovers an amazing ability to play the piano and a legend is born. It is indeed The Legend of 1900, a fable by Giuseppe Tornatore (Cinema Paradiso) based on a dramatic monologue by Italian novelist Alessandro Baricco. The story is about a musical prodigy who spends his life aboard a ship, sailing back and forth between the U.S. and Europe, entertaining the passengers with his unique talent but never sharing it with the rest of the world.<br><br>The film is narrated by Max (Pruitt Taylor Vince), an American saxophone player whom we meet at the beginning as he tries to pawn his trumpet. On leaving the shop, however, he hears the only recording 1900 ever made, a master that he had broken into pieces but that was later restored. When he finds out that the master came from a ship about to be demolished, he rushes to save 1900 whom he is sure is still aboard. In the process, he tells his story to convince others that 1900 exists. Through flashbacks we learn about 1900 and how he navigated his life from stem to stern. The question throughout the film is whether or not 1900 will abandon the ship and set foot on land? There is a hint that he might do so after he meets a beautiful young woman (Melanie Theirry). She inspires him to compose a beautifully expressive love song while gazing at her through a window, but the only thing that remains is the last copy of the record and an enduring memory.<br><br>The Legend of 1900 creates its own world and I confess it is one that I got lost in. This is a lovely film that has a heart. It is sentimental without question but is redeemed by the glorious music by Ennio Morricone, beautiful cinematography by Lajos Koltai, and a terrific jazz piano duel between the adult 1900 (Tim Roth) and Jelly Roll Morton played by Clarence Williams III. 1900's world has clearly defined limits and he is fearful of venturing beyond. Land represents for him a place without boundaries, where people can get lost, a place without beginning or end. To me, The Legend of 1900 may be a metaphor for people who find a comfortable niche for themselves in life and are afraid to take risks to see what the possibilities are. In many cases, as with 1900, the world will never know the contribution they might have made.","user":"howard.schumann","rank":[61,69]}]