[{"title":"\"For Carl\"","rating":10,"date":"30 March 2000","review":"Reading other peoples' reviews, I see a split 50/50 argument where one side loves the movie and the other hates it. I am not one bit surprised, due to the importance of the film, and I feel this is proof that Contact is one of the most powerful movies of the decade. Like the reaction from the civilians to the machine, a movie with this much heavy firepower is likely to get both loathing and praise from its viewers. I for one praise the film, for its toughness and sensitivity, symbolism and passion, and the fact that it is a rare science fiction film, a gem which was released in a time where scientific intelligence in film has become a nothing short of a joke as the wonder of the universe has been ignored and the mystery of alien life have become a neverending trail of movie villains.<br><br>The film of course centers around the science vs. religion theme, the oldest and most frightening of all school debates. Instead of taking the more independent path the book takes, the film takes the more sensitive on the science vs. religion argument throughout the film by telling us that science and religion points to the same direction (the \"pursuit of truth\") but are misunderstood when studying the nature of their WAY of finding the truth (science uses evidence and answers, religion uses love faith). At the end of it all, the film lets us know that if science and religion stops colliding with each other and starts to combine and compliment each other (listen to Ellie's final words in her testament) the human race might achieve things we can only dream about now.<br><br>A perfectly refreshing film, with lots to say, great acting and directing, sound and special effects. Robbed by the Academy.","user":"abettertomorrow","rank":[525,609]},{"title":"Absolutely brilliant; unequivocally, completely amazing in every way.","rating":23,"date":"23 February 1999","review":"N.B: This is a very long monologue because I adore CONTACT to bits.<br><br>I loved the irony present in Contact, as well as its religious imagery and its attention to fine detail.  To see the universe in that opening scene was breath-taking, and the reason for it all coming out of Ellie's eye becomes blissfully apparent in light of the end, for her journey was just as much a physical as well as an emotional and spiritual one.  The photography was superb, alternating  between expansive sweeps of the landscape and the universe, and close, intimate shots of the characters, symbolising the potential for the unknown' as well as an equally important knowledge of all that is familiar  contact with our own people.<br><br>The irony manifested itself in how Ellie, who denounced Palmer's ability to possess complete faith in God, ended up being the advocate of such a faith, though of a different strand; she could now appreciate Palmer's passion. Remember that Biblical verse that when paraphrased reads something like: `The man who is not willing to give up his life will lose it, but he who is willing will gain it'?  This religious imagery correlates to how Drumlin lost his life in pursuit of personal acclaim, while Ellie, who admitted that she would freely give up her life in pursuit of life's tormenting questions, gained it in such a memorable and satisfying way.  She found inner peace, having made contact with two intelligent races; one of the skies, and one of her own kind.  The dried up cliché alluding to aliens: `We are not alone' begins to take on a new meaning in a multitude of dimensions in light of this brilliant movie.<br><br>I read this wonderful blurb' about Contact, and I think this following line delineates the film, and why watching Contact became such a defining film for me: `[Ellie's] personal voyage will take her beyond theory, beyond knowledge , beyond experience, to the realization that true vision is ultimately the union of fact and faith.'  This duality of life and true fulfilment which arises from the reconcilement of contrary beliefs is surely a theme of the film: evinced through the conflict created by science vs. religion, fact vs. faith, vision vs. reality.<br><br>Carl Sagan's novel was also a fulfilling pleasure to read.  I thought that the message in pi was an absolutely crucial element of the book, the implications of such a message being that there is an all-powerful force' behind the universe, which brings order to disorder, and such a force' we might call God.  So possibly, C.S's novel did prove the existence of God. Maybe the recurring C' pattern in the film, (the quadruple' system Ellie saw near Vega, the sands in her father's hands and that which she holds in the end), is indicative of such order  that no matter how large or small an event, i.e, whether a message is written in the sky or in the palm of one's hands, order is present, and implies a powerful force guiding the universe.<br><br>I am incapable of seeing many, if any, faults with this film  I truly cannot understand why anyone would think it contrived or the same as something as brain-numbing and gung-ho as `Armageddon'. It is truly an intellectual film with meanings at many levels  and so thought-provoking!  Perhaps Matthew McConaughey's representation of Palmer Joss was a little unbelievable, and the thrice-repeated `It's an awful waste of space' phrase that connected Ellie to her father and Ellie to Palmer can be seen as a tad too sentimental on the one hand, but on the other, it serves to punctuate the potentiality of the physical universe, and the human mind, which, in C.S's case, conceived this book.  Jodie Foster is magnificent, but then again, isn't she always? The extraordinary passion Ellie exhibited was admirable  her innate sense of wonder balanced by a stabbing loneliness, born out of the premature departure of a dear parent.<br><br>I love Contact because of its poignant humanity, the sense of wonder that resonates so strongly throughout the film and indicates the strength of that wonder which inspired C.S in the first place, and because it searches for meaning so idealistically, while still, necessarily, maintaining the sometimes harsh realities of life (personified by James Woods' unsympathetic and skeptical Kitz).<br><br>To those who hated the ending, you obviously missed a crucial component of the film, that of possibility and potentiality.  To have Ellie return with tangible evidence of alien existence would demolish all the credibility that Robert Zemeckis attempted to create by showing the current American president referring generically to the event of the message being discovered, the decision to build the machine, etc.  The ending was crafted in such a way as to enable a choice by the viewer/reader to be made  just like how C.S equally respected those in his book who chose to pursue a path of science or religion.  We, the audience, are allowed to decide what really happened, and this makes Contact an almost interactive and therefore a more intimate experience.<br><br>Contact has something to say to everyone, and has real meaning that cannot help but whisk viewers and readers alike to some thrilling place.  To those who thought the film predictable, and had not previously read the book, I would say that you must be VERY creative if you managed to anticipate all that Contact had to offer.  But for everyone who was as much inspired by this magnificent film as I was, here's the most important lesson to be derived from both the book and the film: `For small creatures such as we the vastness is bearable only through love.'  This enlightened message, dreamt up by Carl Sagan, makes me even more convinced that a book critic who said of Carl Sagan: `with terrestrials like him, who needs extras?' is exactly right.","user":"Juzai","rank":[438,531]},{"title":"No film has moved me more than this one, ever","rating":9,"date":"5 November 2004","review":"This, for me, is a masterpiece. I have enjoyed it more with each viewing.<br><br>Carl Sagan was a great man. He promoted science in the way it should be, portraying the profound mysteriousness of our universe with humility, and without dogma. In his book, the Demon-Haunted World, he quoted Einstein:<br><br>\"All our science, measured against reality, is primitive and childlike -- and yet it is the most precious thing we have\".<br><br>Contact conveys this simple message in a subtle yet immensely powerful way. The performances are some of the most compelling I have seen, particularly by Jodie Foster and David Morse.<br><br>Just magnificent.","user":"SteveHevetS","rank":[406,501]}]