[{"title":"Decent spoof","rating":7,"date":"28 January 2002","review":"I've seen the movie about nine or ten times, so naturally many of the jokes--which I found hysterical at first--aren't that funny anymore.  But I don't think they could've done a much better job at spoofing high school flicks like \"Dangerous Minds,\" \"Lean on Me,\" \"The Blackboard Jungle\" and \"To Sir, With Love.\"  There are lots of witty moments that hit the bullseye.<br><br>The jokes are not over-the-top, nor are they filthy and vomit-inducing like many recent spoofs.  It's from the writers of \"The Naked Gun\" and the talent really shows.  <br><br>Jon Lovitz is funny, like usual.  Tia Carrerre has never looked hotter, and serves as great eye candy.  Louise Fletcher is appropriately creepy as the principal, who is sort of like a female version of Joe Clark--she also roams the hallways with a baseball bat.  <br><br>The young stars like Guillermo Diaz, Mekhi Pfieffer, Natasha Gregson Wagner and Brian Hooks are very good and their timing is just right.<br><br>I would probably praise this movie a lot more if I submitted this comment after my first viewing, but trust me--it's very funny!  But, like many broad comedies of this kind, it's not as enjoyable on repeat viewings.  After having seen the latest spoof, \"Not Another Teen Movie,\" I'm able to appreciate this film a lot more.  This is a spoof with wit and structure, and even has a few subtle in-jokes:  the school is titled Marion Barry High. You get it?  <br><br>My score:  7 (out of 10)","user":"mattymatt4ever","rank":[21,24]},{"title":"Predictable comedy.","rating":6,"date":"28 February 2003","review":"Although it was co-written by David Zucker, this comedy is more conventional than, say, the \"Naked Gun\" series; it doesn't have the same rapid-fire, relentless pacing. However, it does have a number of successful gags (when the teacher enters the ghetto area, his car radio will play ONLY rap music), and, of course, the gorgeous Tia Carrere....wow!   (**)","user":"gridoon","rank":[16,20]},{"title":"You're Gonna Lovitz","rating":8,"date":"4 January 2006","review":"Jon Lovitz is possibly the most under-rated Saturday Night Live alumnus. While Mike Myers, Adam Sandler and others have gone on to bigger things, Lovitz has primarily been background fodder for the other ex-cast members. And he's good at this, but he's also good on his own - as this movie proves. High School High was the best school movie parody of its time (before \"Not Another Teen Movie\"), taking \"Dangerous Minds\" and making a plot we should actually care about and enjoy. And we also have Tia Carrera (not to be confused with Asia Carrera).<br><br>Lovitz plays a history teacher who wants to turn a school full of unwanted students into a fleet of tomorrow's best and brightest. With help from his street smarts and an intense chicken race scene, he might just accomplish his goals. But, oh no, what happens when a rival gang steals the tests or the class valedictorian turns to dealing drugs? You're just going to have to watch and see. Recommended (unless you don't like Lovitz, but then you have no sense of humor anyway).","user":"gavin6942","rank":[19,25]}]