[{"title":"A Real Showcase For Eddie Murphy","rating":8,"date":"2 July 2006","review":"A general nasty tone to this comedy prevented me from rating this a \"9\" or a \"10,\" but it does have a ton of laughs, courtesy of Eddie Murphy. He's at is best when he's at the dinner table playing everyone but the kid. That is one of the funniest scenes I remember from any 1990s comedy. <br><br>His humor is very crude in here (another PG-13 rating that is ludicrous) but very funny in spots, too. With that kind of humor, it's easy to go over the line of \"good taste\" which he does on occasion. Overall, however, Murphy is remarkable as all these characters. I believe he plays seven in all. This is probably his biggest 'showcase' ever on film, demonstrating his comedic talents.<br><br>Even though this has a childlike-romance-type feel to it, and a nice message about bias against fat people, there are so many raunchy and downright nasty lines - mainly at the comedy club or the dinner table - that it's certainly not recommended for kids. This is a LONG way away from the original Jerry Lewis movie. Still....for adults, this movie provides a lot of laughs.","user":"ccthemovieman-1","rank":[35,37]},{"title":"big laughs","rating":25,"date":"25 April 2002","review":"In order to gain the affections of a sexy colleague, and more importantly feel better about his overall self-deprecating image, shy, grossly overweight genetics professor Murphy takes an experimental serum that transforms him into a charismatic, testosterone-driven hunk. Things go quickly awry however when he starts to lose his own identity and battle his alter ego for complete control. This Jekyll &amp; Hyde formula is familiar but it's elevated by fresh, consistent laughs, clever and innovative gags, terrific make-up/special effects and a delightful performance from Murphy who's absolutely hysterical as he portrays each member of his family. Lots of fun. ***","user":"Special-K88","rank":[13,13]},{"title":"Commenting on the comment \"fatism\" below","rating":9,"date":"23 June 2000","review":"As a fat person myself, I encounter prejudice every day. Movies are especially bad, because it is still considered okay to make fun of fat people. Most skinny people just assume that we're lazy. They think that we have the potential to be as thin as is considered \"normal,\" but we just are too lazy to do anything about it. That is absolutely false (not that the skinnies would ever buy that, but I can at least try).<br><br>Anyway, to get to The Nutty Professor, I found it to be one of the most sympathetic portrayals of fat people ever put on film. The only one that tops it is James Mangold's Heavy, although the protagonist's weight wasn't all that was harming his well-being. <br><br>The Nutty Professor did have some physical comedy involving fat that one could take as funny, but I never felt that the jokes were  degrading. The main reason that I feel this was so sympathetic was that, though he experienced life as a skinny stud, he did decide to be a fat man at the end. One can chock this up to formulae, but something that Sherrman Klump said at the end really touched me: \"I could try to lose weight, but I'm always going to be a fat man, and you're just going to have to live with that.\" I think that a film where the screenwriters  who were bigoted would have said something like, \"I'll lose weight without this stupid formula.\" That's not what happened, though, and I'm glad for that.","user":"zetes","rank":[54,62]}]