[{"title":"A Spielberg Cult Classic Film and a great science fiction action adventure film of all time.","rating":10,"date":"10 October 2015","review":"Jurassic Park is a 1993 American science fiction adventure film directed by Steven Spielberg. It is the first installment of the Jurassic Park film series. It is based on the 1990 novel of the same name by Michael Crichton, with a screenplay written by Crichton and David Koepp. The film centers on the fictional Isla Nublar, an islet located off Central America's Pacific Coast, near Costa Rica, where a billionaire philanthropist and a small team of genetic scientists have created a wildlife park of cloned dinosaurs.<br><br>Jurassic Park is the second Steven's Spielberg Classic cult Film. A great science fiction/action/adventure film. This film is great edge of your seat action sequences. It has a wonderful cast with wonderful performance of their characters. John Williams music score is excellent the same like is in Indiana Jones films. Beside Raiders of the Lost Ark is the second Best classic movie in the franchise. Jurassic Park (1993) was nominated for 3 Academy Awards for Best Sound, Best Effects, Sound Effects Editing and Visual Effects.<br><br>I love this film to death! It is been 22.years since we got this awesome adventure dinosaurs flick. I know a couple of friends of mine that love this film including me. It is a cult classic film and It has a heart. We have Tyrannosaurus Rex chasing the group, Velociraptors chasing Tim and Lex after they are reaching the visitor center and they are in inside the main kitchen. Dilophosaurus killing Nerdy. We also have Triceratops in it and Brachiosaurus. They are other dinosaurs used in the film: Gallimimus, Parasaurolophus and Alamosaurus they both had a cameo scene in it.<br><br>The special effects creating the dinosaurs by Stan Winston are FANTASTIC! The dinosaurs were created with groundbreaking computer-generated imagery by Industrial Light &amp; Magic and with life-sized animatronic dinosaurs built by Stan Winston's team. To showcase the film's sound design, which included a mixture of various animal noises for the dinosaur roars, Spielberg invested in the creation of DTS, a company specializing in digital surround sound formats. Stan Winston and his team did a great job animating live Dinosaurs on a screen. Steven Spielberg did a wonderful job directing this film, it is definitely my second best childhood film from Steven Spielberg. The first best film would be Raiders of the Lost Ark (1981) which I love this film to death. The screen play written by Michael Crichton and David Koepp did a great job and the plot of the film was just awesome.<br><br>The plot: During a preview tour, a theme park suffers a major power breakdown that allows its cloned dinosaur exhibits to run amok.<br><br>The crew cast all did a wonderful job of acting. The acting of this film was terrific and believable.<br><br>Sam Neill as Dr. Alan Grant, a leading paleontologist did a wonderful job portraying his character. He act the character like he was written on his skin. Laura Dern as Dr. Ellie Sattler, a paleobotanist. did a wonderful job like how she cared about an ill Triceratops. I was really surprised how the character cares about an ill dinosaurs that she barely know and she wanted to help him was out stating! Laura Dern for me in this film was a heart and a key watching this film of how a good hearted person she is. Jeff Goldblum as Dr. Ian Malcolm, a mathematician and chaos theorist was really good in his acting and his character. Richard Attenborough as John Hammond, InGen's billionaire CEO and the park's creator was awesome playing his character. It is really a shame Richard Attenborough died last year and he isn't with us anymore. Ariana Richards and Joseph Mazzello as Lex and Tim did a wonderful job portraying John Hammonds grand children. I didn't know Samuel L. Jackson was in this film I really didn't know that. The whole cast was awesome in here.<br><br>Music by score by John Williams is fabulous and fantastic I always love this song to death.<br><br>There is everything in this film I love. How Dr. Grant, Lex and Tim are fighting to survive when they are trapped alone in the park. How tough and strong they are they don't panic and screaming they are fighting to come back save home. Lex and Tim are cornered by a pair of raptors inside the main kitchen. In one of the most terrifying scenes in the entire film, the raptors stalk through the dark kitchen, searching for the kids. Eventually, Lex and Tim manage to lure one of the raptors into the freezer and lock it in, but the other raptor chases them out of the kitchen. The scene was the most memorable to me and terrifying. Another terrifying scene is when Ellie discovers Ray's severed arm in the maintenance shed and she sees the raptor that eat Ray try's to eat her, that also scared me a lot. After the power was cut off on the electric fences and the kids with Alan are climbing over the fences and the power is turn back on by Ellie and Ray the fence electrifies Tim and he fly's down off the fence. The scene was awesome but also terrifying and real.<br><br>I'm not sure what else you would want in a movie like this?! It is a perfect 10. I love this film to death! I love this film to death!! The action sequences are also awesome, the plot, the cast everything is great about this film.","user":"ivo-cobra8","rank":[154,167]},{"title":"Criminally Underrated By IMDb!","rating":10,"date":"22 November 2011","review":"Simply one of the greatest films of all time. How on Earth it is only rated as 7.9/10 I'll never know.<br><br>It has a great plot, structured of course around Michael Crichton's equally brilliant novel, and the graphics are absolutely superb. Jurassic Park, along with the sequel 'The Lost World: Jurassic Park', had Dinosaurs that were actually convincing. Of course, there was some artistic license involved - certain behaviours of the animals were exaggerated or entirely fabricated - but that in no way detracts from the film. They are certainly better than those in the comparably average third instalment in the franchise, 'Jurassic Park III'. Living in the 21st century (or 20th, as it were) this film gave us a recreation of these creatures that was genuinely believable.<br><br>For all their fancy graphics and obscene budgets, films such as 'Avatar' will never compare to the likes of Jurassic Park.","user":"bluemoonrising26","rank":[98,107]},{"title":"A Groundbreaking, Heart Stomping, Dino Sized film","rating":10,"date":"5 September 2005","review":"In the year 1993, Hollywood saw something unlike anything else, the film Jurassic Park. Never before 1993 had dinosaurs been so breathtaking and realistic on the silver screen.<br><br>The plot is very original. A group of scientists cloned dinosaurs, and are about to open an amusement park where people can see the dinosaurs. The creator John Hammond(Richard Attenborough) invites a group of people, along with his grandchildren, to see the dinos and enjoy a relaxing time at the park. Could anything go wrong, at the time it doesn't seem like it, but something else is going on. Employee Dennis Nedry is planning to steal dinosaur embryos. In order to do this, he causes a security breakdown so he can get the embryos and escape. He isn't the only one that can escape, as hungry dinos also escape. After this, everyone on the island is in danger, and loose dinosaurs are everywhere. That is where the fun in Jurassic Park comes in.<br><br>This is an underrated movie according to the IMDb ratings. It isn't even in the top 250. Today, people don't appreciate it as much, mainly due to the fact that other movies like it have been made. Growing up in the 90's, this was one of my favorite movies. As a kid, I only watched it to see the dinosaurs, as I didn't understand a whole lot of it. Today, I realize how great the plotting and suspense are.<br><br>This spawned two sequels. The second one wasn't bad, but the third wasn't very good. I would recommend seeing the second after this, but the third is passable.<br><br>The story is great, how at first we see how the magic was created, and then later we see the magic turn into a disaster, in which everyone's life is at stake.<br><br>The special effects are still good today, but they were revolutionary for back in 1993. The acting is good, and the ensemble cast is great. All of the action sequences are perfectly executed, creating plenty of suspense and tension.<br><br>Younger kids may get scared by this, as I remember a lot of young kids being scared by it in 1993. If kids aren't scared by dinosaurs, they will probably enjoy the movie.<br><br>I highly recommend Jurassic Park. It is quite underrated in my opinion, it deserves more credit than it gets.<br><br>Watch this at all costs if you have somehow missed it and see what everyone was amazed about back in 1993.<br><br>Enjoy","user":"FrankBooth_DeLarge","rank":[350,406]}]