[{"title":"A brilliant film with a sad story (and I don't mean the plot)","rating":10,"date":"1 July 2009","review":"The Thief and the Cobbler, created by the animator responsible for Roger Rabbit and the Pink Panther, was a beautiful film. That is, if it ever were completed properly. The film is probably the big inspiration for Disney's Aladdin, which was just as great. The animation is so brilliant, not even the likes of Disney or Don Bluth could top it. It's a film you'd have to feel bad for, since it took up to 26 years to make and seemed to fail and get butchered.<br><br>It's about a cute mute (at least he should've been) named Tack, a cobbler, who might compare to Jo-Jo in the Blue Sky version of Horton Hears a Who. The other main character is the swamp-coloured, cheeky, silent thief (at least he should've been silent). He is crazy for gold stuff as Scrat from Ice Age is crazy for acorns and he stinks so much that his flies follow him everywhere he goes. Tack falls in love with the pretty Princess Yum-Yum, daughter of the lazy King Nod (the inspiration for the Sultan), which gets the blue vizier Zig-zag angry. Zig-zag is the inspiration for the Genie and Jafar who can say anything in rhymes and is voiced by Vincent Price. The most important thing the characters need to take care of though the Thief is just too greedy to know about is the set of three golden balls above the tallest minaret. If the balls were taken away, the dark, half-blind army of One-Eyes will attack.<br><br>I've seen the three main versions; the Recobbled cut, the Allied Filmmakers version and the Miramax version. First, I am going to talk about the Recobbled cut. This cut is made by a big fan named Garrett Gilchrist of a fan company named Orange Cow Productions. He compiled footage and original sound tracks he collected from all versions of the film and people who worked on the film, no matter if it's unfinished, low quality or animated poorly by Fred Calvert. He also included classical music to make it a little more epic. It could possibly the best fan edit ever made.<br><br>10/10 for the Recobbled cut.<br><br>The Allied Filmmakers/Majestic Films version, The Princess and the Cobbler, was released only in Australia and South Africa. It was taken away from Richard after Warner Bros. rejected it and completed quite badly by television animator Fred Calvert and the Completion Bond Company. Fred added extra animation that looked as if Don Bluth animated it (some of the extra animation was produced at his studio), dialogue for Tack and crappy songs that made it quite a rip-off of Aladdin. Fred also changed the plot by mixing up scenes a little. The Thief was still silent, only making a few gasping, grunting or chuckling noises, and Zig-zag kept his great Vincent voice.<br><br>3/10 for The Princess and the Cobbler.<br><br>Miramax picked up Fred's edit, called it \"Arabian Knight\" and ruined it. They turned what could've been a masterpiece into a masterpiece of crap. They cut some scenes out because they thought they were too disturbing or long, added more repetition, gave Tack the inappropriate voice of Matthew Broderick and gave everyone who couldn't talk some annoying thought talk that distracted from the great animation. The thief, voiced by Jonathan Winters, spoke about everything he could see and thought that he was in the real world of the present day by speaking present day references (\"Nobody lives like this except college kids.\") and pop culture references (\"I'm going to Disneyland!\"), and he wouldn't shut the hell up. Nor would anyone else. The edit overflowed with dialogue, with tons of grunting voices and more usage of \"What?\" from King Nod. And that's right; Phido and the other animals could actually thought-talk as well. What, did Jim Davis suddenly take over the production? This isn't a Garfield TV special. What were they thinking? Did they care about the original's creator? It probably inspired the butchery the Weinstein Company did to the film version of The Magic Roundabout when they added cuts, random flatulence jokes, pop culture references and moose dialogue.<br><br>0/10 for Arabian Knight.<br><br>So the only version of this film to watch is the Recobbled cut. Don't waste your time with the other versions. A true-to-the-story restoration of the film was put on hold when Roy E. Disney left The Walt Disney Company so that the company could be totally butchered, but Garrett Gilchrist hears that the Disney restoration has been continued, so there's hope yet!","user":"FreakinFilmFreak93","rank":[29,30]},{"title":"shame on Miramax","rating":1,"date":"11 June 2003","review":"Richard williams started this ambitious animated film way back in 1968. Working with him were some of the original Disney animators such as Art Babbit and Grim Natwick as well as Ken Harris and Emery Hawkins from Warners. The film was originally self financed by Williams with money coming in from his animated commercials. After winning an academy award for Roger Rabbit he got the film financed externally so it could be completed.  This turned out to be a bad decision because after going over budget the investors got nervous and pulled the film from him, having it completed by someone else. The film had about 10 to 15 min left to complete when it was taken out of Williams hands. Instead of just completing the film, the person in charge of the completion decided to re-work the film to make it more \"mainstream\". He replaced much of the original scenes with song segments and farmed out the animation . The resulting film was released in a few different edits. On called \"The Princess and the Cobbler\" in Australia and one called \"Arabian Knight\" in the US by Miramax. The Miramax version is much worse because they added constant narration and voices to characters who were intended to be silent. After Disney purchased Miramax, it's version ended up on home video under the original title \"The Thief and the Cobbler\".<br><br>Richard Williams \"Work Print\" which is the work in progress version is the only way we can tell what this film could have been. It has not been released, but can be found as a bootleg.","user":"gpont","rank":[49,53]},{"title":"Edited \"Thief and the Cobbler\" misses the magic","rating":9,"date":"9 June 1999","review":"Here at last is the long-awaited theatrical release of Richard Williams' \"The Thief and the Cobbler.\" Begun in the late 1960s but not brought close to completion until after Williams created \"Who Framed Roger Rabbit?\" in 1988, it was conceived as an exercise in expression through animation, with an amazing roster of animation legends new and old [Art Babbit, Grim Natwick, many of Disney's and ILM's new masters] passing in and out of the project over many decades, all widescreen and 60s-groovy, baby. But now it comes to us at last, and it's really not all that good. The reason? Miramax, a subsidiary of Disney and perhaps fearing the very obvious parallels to their own \"Thief\" remake, \"Aladdin,\" has cut the film to shreds. Not only have they added three truly awful songs, deleted one character [the witch, now just an eye], and removed much of the original's best shots, but the rather nice original soundtrack has been replaced with a crass, narration-heavy butchery that adds constant voice to Williams' great silent characters. Those who know anything about the original will consider this a hack job. But see it anyway, if only for the still-groovy animation and to see where \"Aladdin\" came from. Now why wasn't Disney sued for this? A great work, by one of the great masters, and please Miramax, your version sucks, so let's see the original sometime soon, ok?","user":"TygerBug","rank":[22,23]}]