[{"title":"Among the best in the Shaw Brothers catalog.","rating":10,"date":"10 August 2011","review":"\"As the saying goes, 'A tiger may be old, but it never gives up it's ambition.'\"<br><br>The 14 women of a family seek revenge for their treacherously murdered husband/father/brother/son/nephew/grandson in this old-school martial arts flick.&nbsp;<br><br>Their forces are outnumbered and their enemy is vicious, but the women of The 14 Amazons (great title, by the way) are totally bent on vengeance and protecting their country from the bloodthirsty ruler of West Hsia and his 5 sons. Watch it for the impressive large scale battles and several really cool scenes (human pyramid/bridge FTW!) Who doesn't like to see a bunch of women being crafty, heroic bad***es? The camera work during the battles is great, and the movie as a whole is surprisingly gory, violent, and occasionally hilarious, too. Even the frequently used miniature sets and models are very well done (though they are understandably noticeable to today's viewer). A great job is done making several members of the large cast memorable (my personal favorite is Yang Pa Mei). Plus, the enemy soldiers all wear uniforms that make them look like Santa Claus, which is just pure bonus win.&nbsp;<br><br>Any Shaw Brothers fans will have a grand ole time with this one. It's one of my favorites that I've seen.","user":"lewiskendell","rank":[10,12]},{"title":"Excellent Shaw Bros war epic","rating":8,"date":"16 May 2010","review":"After a proud soldier is brutally cut down with many arrows on his birthday, his wife and her family not only learning of this but also told they can do nothing by a corrupt official prepare to take all the women and many loyal men to seek vengeance and defeat the much larger male army that killed their hero. This is a terrific Shaw Bros flick not only in story acting and action but in filming on great locations with camera work that shows some great shots of countryside mountains and a terrific dam breaking sequence that engulfs part of the army of bad guys. The great cast of tiny but fierce Chinese women are not only martial artists but excellent with both spear and sword. The men who are loyal to them go so far as to sacrifice themselves to give the women a victory. Both sides are not only incredible fighters but smart and crafty in their battle plans. I really enjoyed this movie and I think anyone who wants a top notch Shaw Bros film will too. A must see.","user":"joeshoe89","rank":[6,7]},{"title":"Shaw does a historical epic - with great success","rating":7,"date":"11 December 2016","review":"THE 14 AMAZONS sees the Shaw Brothers doing a historical epic, with great success. The tale is another version of the popular 'General Yang' story which has been propping up Chinese cinema for decades and begins when the heroic character dies in battle against an overwhelming Mongol force. Given that the male bloodline of his family has almost entirely died out, the wives, sisters, and daughters of the family decide to band together and lead their forces out for revenge.<br><br>The result is an action-packed story that's all about the battles and as such comes across as a fast and frenetic tale. The build-up is just as engaging as the later action sequences, and kudos to the director for managing to create individual characters amid the large-scale nature of the action. The high budget available to Shaw at this time is apparent in the huge amount of extras and costumes while the outdoor filming gives this film a truly epic look.<br><br>Cast-wise, the film features just about every notable female star from the studio during the era, with the exception of Cheng Pei-Pei. The women are very effective and convincing and of course hold their own in the action stakes. The male performers are effective too, with Lo Lieh relishing his villainous role and Yueh Hua as chivalrous as ever. You can even spot Eric Tsang and Yuen Biao in tiny roles if you look carefully. The battle sequences are bloody and brilliant, and there are many inventive moments (like the classic 'broken bridge' set-piece) to keep you watching. THE 14 AMAZONS is another Shaw hit and a genuinely great movie.","user":"Leofwine_draca","rank":[2,2]}]