[{"title":"\"Sadako? You did this?\"","rating":10,"date":"21 October 2003","review":"In 2002, Dreamworks released a movie on American theaters called THE RING, by Gore Verbenski. It expanded to great lengths around the world. People claimed they had never been so scared while watching a movie in their entire life. Critics had mixed opinions of it, most for the better. But while the entire world was screaming to THE RING, others decided to reach out for the original version that Dreamworks decided to \"hide\" while THE RING was in it's theatrical run. The 1998 Japanese phenomenon RINGU (a.k.a RING.)<br><br>\nBased on a 1991 novel by Koji Suzuki (claimed as the Japanese Stephen King) RINGU tells the story of reporter Asakawa Reiko (Nanako Matsushima), a middle-class Japanese single mother. Her latest story is the investigation of a mysterious urban legend that circulates around high schools about a tape that kills whoever watches it seven days later. She learns that five teenagers recently died from a heart attack at the exact same time, and that they were all friends who spent a vacation on a cabin resort exactly one week before. It becomes up close and personal when she finds out one of them was her recently deceased cousin Tomoko (Yuku Takeuchi.)<br><br>\nReiko eventually tracks down and watches the mysterious tape, and in one of the movie's many chilling moments, receives a strange phone call confirming that the urban legend is true, an element that reminded me of the 1992's similar CANDYMAN. She finds help from her ex-husband Ryiuji (Hirouyuki Sanada), a psychic with paranormal powers (an element obviously removed from the US version). Both Reiko and Ryiuji examine the tape carefully and realize it was shot in a nearby volcanic island. With only a few days left, they travel to the island where the dark, disturbing truth remains hidden, waiting to be discovered.<br><br>Taking liberties from the infilmable novel, director Hideo Nakata (DARK WATER, CHAOS) and screenwriter Hiroshi Takahashi (DON'T LOOK UP) were able to create what is perhaps one of the most impressive horror films of recent memory, challenged maybe only by the less-subliminal AUDITION. Nakata's direction already explains what makes RINGU so unique: The absence of music, limited photography, simple camera movements, and no cheap jump scares. The fear in RINGU comes from skin-deep slow burn. If you are looking for jumps, watch the American remake instead. Which brings us to the infamous RINGU vs. THE RING internet battle: A pointless one.<br><br>The 2002 remake had more technological resources and a stronger desire to freak out the audience. Director Gore Verbenski decided not to copy the original and went for a less subliminal more artsy Dario Argento dreamy approach with a Nine Inch Nails vibe and a David Fischer love for rain. While THE RING improved on the upcoming flaws of the original, it had problems of it's own. Not wanting to change the subject, let me tell you the Japanese version is the one to see. The problem is that most people who watch the recent remake will hate RINGU, and vice-versa.<br><br>\nUnlike THE RING, RINGU avoids CGI shocks and cheap jump scares like a plague. You won't find any suspenseful moments, chases, or any physical struggles between the cast here. While the remake scared you with fast zooms, weird camera tricks, and inhuman freaky bursts of weird noises, RINGU scares you with it's lack of... sadism. A good example are the videotapes. The videotape seen in THE RING is a Nine Inch Nails video, in a good way, with very weird supernatural images and weird gross-out quick glimpses. The original's videotape is shorter and maybe even weirder. It shows you different but equally impressive images that belong to a David Lynch nightmare while a \"scratching\" noise is heard on the background. A noise that was unfortunately omitted in the remake. The Japanese tape can be either laughable or scary depending on the mentality of whoever watches it.<br><br>\nBut what makes RINGU the phenomenon that it is today is the character of Yamura Sadako, who turns out to be pulling the strings. Not wanting to spoil the plot, I will just say that never since Hanniball Lacter has a character with such little screen time terrorized the audience as good. The American doppelganger Samara was badly used in the remake. While what made Sadako scary was that she was pure evil, the remake's screenwriter Ehren Kruger tried to turn her into a Batman-like repressed character that you are supposed to feel sorry for. This terribly reduces the impact of \"the scene\". Which leads me to \"the scene\" itself. If you ask anyone who watched either version what \"the scene\" is, they will probably know. Let me tell you that \"the scene\" is done much better in this version. I will go as far as saying \"the scene\" is hands down one of the scariest moments in cinematographic history, very close to the shower scene and the climax of DON'T LOOK NOW. The remake tried to hard with it's own \"scene\", adding CGI effects, quick cuts, and many other gross-out elements that the original didn't need.<br><br>\nBut RINGU is not without it's flaws. Either the fact that I am not Asian, or maybe that I am not familiar with psychics, but the whole Ryiuji character left me wishing for more. Maybe the subtitle translation didn't make it clear enough, but I couldn't connect to that way he always had an answer to everything. Not that Sanada's performance is lacking. He steals the scene and carries out most of the movie. Remember Bruce Lee in GREEN HORNET? Maybe not, but that is Ryiuji here. And Matsushima is equally good, although she is given less to do than her American counterpart Naomi Watts. I will give credit to the US remake by eliminating the psychic subplot. I won't forgive the fact that Ryuji's American counterpart is a pointless and boring sidekick which is what ironically gives Watts her chance to shine.<br><br>RINGU is still a superior horrifying experience that you will not easily forget. Forget the sequels (RING 2), forget the spin-offs (RASEN), the rip-offs (FEARDOTCOM), or remakes (RING VIRUS and THE RING). It all rounds up to here. Be sure to watch Nakata's equally good DARK WATER, which is already getting a remake on early works. Oh, the humanity...<br><br>\n*phone rings*<br><br>(4.5/5)","user":"fdpedro","rank":[166,191]},{"title":"In a word terrifying","rating":10,"date":"11 December 2004","review":"**CONTAINS MILD SPOILERS**<br><br>Ringu is an unassuming little movie that my boyfriend and I rented from the local DVD store knowing little about it other than it had inspired a recent Hollywood remake.<br><br>The first thing which accosts you when watching this film, is it's lo-fi documentary-style reality. Ringu has the look and feel production wise of a TV movie, but this only adds to the objective of it, to terrify.<br><br>The story unfolds of an everyday Japanese single mother, the backdrop is nothing unusual but this is required as the bizarre begins to unravel before the eyes of the watcher. The woman has a child whom appears to be a strange little boy, and in many ways he parents her in her hectic schedule. Her ex husband is an amiable fellow, though he has an annoying quality to any female whom observes him which one assumes is the reason for the couple's politely handled split.<br><br>The story takes a turn for the more macabre when a videotape emerges which is shrouded in urban myth. The short synopsis is you watch the tape and die within seven days of doing so. A group of teenagers inexplicably die, one of which is the niece of our leading lady. Being the plucky reporter that she is, she begins to investigate the eerie tape initially by watching it herself and embroiling her ex in this grim fairytale by seeking his counsel, on technical matters relating to the tape itself. The two find themselves in a race against time to discover the secret of the tape when their son watches a copy that was made. <br><br>The bogeyman of this psychologically rattling outing, is Sada- a child or a demon?, perhaps a freak of nature? No answer is given and the viewer is left to their own conclusion and speculation. This reliance upon the viewers observational conclusion is what makes Ringu a truly adult horror movie above all others, we are not told what to think or moralised. Ringu simply displays the evidence on the nature of Sada, and leaves you to suppose whether she is a tortured victim cast from society, or simply a demon and nothing more.<br><br>If the objective of any horror movie is to scare, then Ringu succeeds with flying colours. Everything about this movie is genuinely disturbing and unsettling. From the mythology of the tale to the ghastly contorted faces of the corpses that Sada, the demon of the story leaves in her wake.<br><br>The grainy gritty production plays and builds upon anybody who dares to watch. The bittersweet relationship between the two leads encourages us to care about them and their plight. The story piques the curious child in all of us, and dares us to look when we should not, and tamper with things that are beyond our understanding.<br><br>The absolutely heart ripping and bone chilling climax to this movie is unmissable. You will not be able to stop watching, but be wishing that you could rip out your eyes simultaneously!<br><br>This movie is a quiet and unpretentious if imaginative little piece from Japan, which displays something that Hollywood has lacked in the horror genre in many years. The director has a true innate gift for knowing exactly what it is that we can not put our finger on that horrifies the human mind. This film is very Japanese, and I cannot imagine it doing well when converted to Hollywood form.<br><br>Ringu is a movie made to be watched on your TV at home, exactly the way I did renting the DVD from your local store. This plays upon the very nature of the story. The TV is something we all think of as safe, it's in all our homes, and it is exactly this that adds such an overtone of terror to this particular film<br><br>As an additional note, my boyfriend was flicking through the extra features on the DVD and came across the cursed video clip, and proceeded to watch it. I couldn't, I left the room. This fact serves as the best conclusion that I can muster as to the brilliance of Ringu. It is not to be missed, but do not watch it alone!<br><br>10/10","user":"sandi_glendinning","rank":[90,113]},{"title":"Unsettling","rating":9,"date":"12 March 2004","review":"Everyone knows the story by now: there's a videotape which, when played, reveals a discordant string of disturbing images including a circle of sky seen from below and a man looking down from above, the word \"Eruption\" written over and over again and moving of its own accord across the page, a hooded figure pointing at some unseen accused, a woman brushing her hair before a mirror and, last but not least, a well standing alone on a neglected patch of land. The video ends and the phone rings...but there is only an eerie silence on the other end. In seven days, the viewer of the video is dead, their heart having suddenly come to a stop for no apparent reason. One such victim is a seventeen year old girl, and it is up to her aunt, hotshot newspaper reporter Reiko, to solve the mystery of the strange video.<br><br>Like the American remake \"The Ring,\" Ringu is not a perfect film. It leaves more than a couple of unanswered questions and may move too slowly in some parts to hold the attention of horror film fans who are used to a bloody slaughter scene every seven minutes. But for fans of good, spooky, old fashioned ghost stories, \"Ringu\" has a lot to recommend it.<br><br>One of the things I appreciated the most about this movie is the complete and utter lack of gore. There's not a drop of blood to be found in this film, which makes the sight of so many dead bodies, their faces frozen in hideous screams of horror, all the more effective. The character of Sadako also has more of an impact than the child from the remake. Sadako never speaks, her face is never seen (but for one hideous, floating eye) and her presence is solid, unlike her static-y American sister. Sadako's emergence from the TV screen in the films final moments is worth waiting through the rest of the movie to see; it is a truly creepy moment which looks to have been filmed backwards as Sadako creeps with jerky, inhuman movements across the floor and up, swiveling to face her victim. That scene haunted me (no pun intended) for two full nights of broken sleep...mostly because Sadako seemed so terribly human, as sad as she was frightening. You pity her before you see her merciless side, and this throws the balance way out of whack. <br><br>Unsettling, to say the least.<br><br>This is a film about dread, about knowing that something dark and terrible is waiting for you and not knowing how to stop it. You can only wait and hope for the best...but the wait itself is the real horror, and the unseen unknown is the most frightening monster of all.","user":"Gafke","rank":[41,49]}]