[{"title":"The two greatest fight scenes ever !!!","rating":14,"date":"14 July 2000","review":"I have to disagree with a lot of the comments. This is a great martial arts movie !! The fight scenes are few and far between, and the plot a bit convoluted -- but the quality of fighting is  absolutely superb. Tsui Hark has managed to restrain himself and just get some really kick-ass moves out of Jet Li and Donnie Yen (the later movies in this series are just way too fantastical for a classic kungfu movie). I have seen almost all of Jet Li's movies (and several of Donnie Yen's) and I will have to say that the two fight sequences between Li and Yen are the best ever filmed. I found myself skipping over the rest of the movie just to see these two scenes over and over again. Their techniques were simply marvelous...(It was refreshing to see David Chiang, an old favorite of mine back in the 70s, though). How they ever filmed it boggles the mind. \"Fist of Legend\" and \"Tai Chi Master\" may have more colorful fighting, and the latter may be a better overall movie, but the true afficionado (and I have been watching these kungfu flicks for about 30 years) will really appreciate the quality of fighting here. Tsui Hark has distilled the essence of HK kungfu movies into these two scenes.","user":"cheahcw","rank":[15,16]},{"title":"More dreams of China and a few comments of \"Sino-centrism\"","rating":10,"date":"16 July 2002","review":"Another excellent entry into the series dealing with China coming to terms with foreign influence and an uncertain future, infused with romance, humour and some outstanding choreography. The well-drawn cast includes Dr Sun Yat-Sen which brings some historical credibility, but adds irony as well, since Dr Sun's idealism may have been misplaced. Oh yeah, its got some great fighting in it too...<br><br>I find previous accusations implying racism in this film to be misguided and deeply ignorant. The Wong Fei-Hung series highlights the historical turmoil felt in China from external trade interest and internal political pressure. Foreign characters are shown as both villainous and sympathetic (just like the Chinese characters). OUATIC II portrays the xenophobia of the White Lotus Cult as a Very Bad Thing, and the confusion at western objects and inventions varies from the hilarious train sequence to the superstitious fear of the camera. It's self-mockery, but it's bittersweet. If anything, Tsui Hark is implying a loss of innocence. <br><br>If the foreign powers are portrayed in a negative light, it's because our presence in China was motivated by greed and imperialism. Hardly the most noble of motives. But then nobody's perfect, and China's human rights record is less than great before and after the revolution.<br><br>I'm staggered that anyone could be so utterly stupid as to ascribe Nazi overtones to a film which goes so far to portray nobility, humanism and honour. Anyway, great film.","user":"Fox in Socks","rank":[13,14]},{"title":"Makes The Matrix look like a TV movie","rating":9,"date":"9 October 2001","review":"Two of the finest martial artists still working in action cinema (Jackie Chan in my opinion lost skill in favor of gimmick in the late 1980's) the always incredible Jet Li and the fantastic Donnie Yen (New Big Boss, Iron Monkey, New Dragon Inn) combine with the director who almost single handedly re-invented the genre Tsui Hark and arguably the greatest action choreographer of all time Yuen Woo Ping (crouching tiger, iron monkey, the matrix)to create a powerhouse of a martial arts movie.  What it lacks overall in action it more than makes up for in the fight sequences that do take place.  Jet and Donnie is a mouth watering prospect and they do not dissapoint.  I dont care if wires were used, it takes someone extremely special to perform like these two guys do and you can do little but watch in awe.<br><br>The plot is pretty thin so I wont waste time going into it. I will merely say, see this movie, just to experience and appreciate what Jet Li can really do, before hollywood softens him up even more.  The fight with the leader of the White Lotus Cult is almost forgotten between the two showdowns with donnie, but wow, just incredible","user":"Jellygoose","rank":[16,18]}]