[{"title":"Excellent Low Budget Action--No Matter What The Star Says","rating":16,"date":"16 January 2005","review":"It has always amazed me how the star of this film, Fred Williamson, has gone to such great lengths to badmouth this flick and the work of his former friend, writer-director Larry Cohen. I've read it and I've heard it on DVD audio commentaries--\"Hiring Larry for Original Gangstas was a mistake,\" Williamson says. Yet he has nothing but praise for his own work as a writer-director.<br><br>Is the Hammer on crack, or what? This is a very slick, very cool little low budget action flick that shows the old time stars to great advantage. Cohen did a great job. In fact, if you took all the good parts from every movie that Fred Williamson produced and directed himself and put them together, the film you'd end up with would still be 1/100th the film this one is (of course a compilation of \"good parts\" from Hammer's self-directed flicks would only be 15 minutes long).<br><br>I love Fred Williamson. His pre-1976 movies like \"Black Caesar\" and \"Bucktown\" are classics, and I like him as a performer. I'd LOVE to see him work in more mainstream movies, as a lead. But the man has only been in three halfway decent films in the past quarter century: \"Starsky and Hutch,\" \"From Dusk Til Dawn,\" and \"OG.\" And \"OG\" is the best of the three in my opinion. His self produced-directed efforts, his Italian-Euro cheapazoid flicks--they ALL rank as some of the absolute worst movies of all time.<br><br>So, don't listen to the star of the show, just watch the movie. \"Original Gangstas\" is a solid flick.","user":"curtis-8","rank":[20,21]},{"title":"A sense of place - recommended for town planners and architects","rating":12,"date":"12 June 2003","review":"This movie is correctly graded as a B picture. And yet it is more: an honest hommage to a real, existing town in the throes of death. Before I picked up Original Gangstas as a cheap video cassette, I did not know that the town of Gary existed. I didn't even know a town like Gary could exist (this proves once more: maybe we Europeans are kind of naive in the ways we evaluate the US's wealth and power and its effects.). Now I know better.<br><br>There is a certain similarity between this film and Jules Dassin's legendary documentary/crime movie The Naked City of 1948. Both use a style that wants to \"tell a city\". With the title credits the town is introduced to the viewers, with aereal footage, ordinary street scenes and a voice-over that tells something about the history of the town and a few selected buildings (the bakery, the cinema etc.). It is really educational. Very good location shooting gives a vivid impression of the specific urban wasteland. Gary becomes a real place. I also had the impression that the mood of the people who are forced or willing to live in present day Gary is accurately recorded: A mixture of anger, shame and - above all - fear. People are desperate, they don't see a future and the affiliation of youngsters to a gang appears for many to be the only way to survive.<br><br>In the story the main character played by Fred Williamson (also the producer and a Gary native who certainly put some very personal feelings into this movie) descends on the town as an aging \"knight in shining armour\". He assembles his old, middle aged buddies (plus Pam Grier!) and stages a war against the gangs. I did not care much for the story and its action scenes with unvariably high death tolls, but I must admit that this movie realistically highlights in a specific place a specific problem that is disquieting and difficult to solve.","user":"manuel-pestalozzi","rank":[15,16]},{"title":"Why is this film so disappointing?","rating":11,"date":"11 February 2004","review":"This film does not work.<br><br>It has great potential and the theme of abandoning your roots frequently pops up -- giving potential for further plot development which most action films do not even approach. However, this all-star cast of blaxploitation veterans making their first film together rarely jells.<br><br>\nFor instance, Fred Williamson, who produced, seems to have forgotten that there were other great actors from that era. 90% of the film is him strutting around, pontificating on how bad the neighborhood has become and why don't the cops/neighbors/politicians/whoever do something about it. He saw fit to put Jim Brown in as co-star, but Brown serves as little more than a bodyguard, punching the whey out of a few people and (in his one big solo scene) threatening a young thug. Richard (\"Shaft\") Roundtree and Mr. \"Superfly\" himself -- Ron O'Neal -- are given glorified cameos. In fact, the introductory scene with O'Neal is shown completely in long shot. Why didn't the director do a few closeups? You can hardly tell it's O'Neal. That's just sloppy direction (either that or they didn't have permits to shoot on city streets and shot this on the sly).<br><br>Other great character actors -- Robert Forster, Charles Napier, Wings Hauser -- are featured but have little to do but act like cartoon characters. Whoever wrote this film should have given thought to the reasons why the best blaxploitation epics worked. <br><br>Not a complete failure but overall a major disappointment considering this is the first and only film these stars have been in together (no chance for a reunion with O'Neal's recent passing). <br><br>** out of *****","user":"chas77","rank":[13,17]}]