[{"title":"Emilio+Charlie=Funny","rating":7,"date":"6 February 2005","review":"This somehow forgotten movie is pretty funny by todays standard.Not that the comedies today are that smart really... Brothers Sheen has nice chemistry together and delivers many funny and memorable dialogues.A hoot is also Vietnam-vet Keith David,this guy is one bad dude...You've seen this before,but the script is not that bad and the movie moves along in a pleasant pace.The villains are also portrayed as idiots and the cops as smart asses,who will get what they deserve by time. This is easy entertainment and you don't remember it for that long,but it's a pleasant journey while it lasts-just don't think too much.","user":"kimnil80","rank":[34,36]},{"title":"Hilarious movie...one of the best of the '90s","rating":10,"date":"23 August 2003","review":"People who dismiss this as juvenile humor or another stupid buddy comedy are totally off the target. Emilio Estevez's screenplay is quite an intelligent story with a number of colorful characters. Real-life brothers Estevez and Charlie Sheen have EXCELLENT chemistry together - their comic timing is perfect, and the scenes where they're just hanging out, talking about their plans to open a surf shop are a true highlight.<br><br>Another true highlight is Keith David. This is, without a doubt, his finest performance captured on film. Playing the rough boss's brother-in-law Louis, who is employed to keep a watch on the mischevious garbagemen pals, David is just perfect. Hearing him lecture about \"another man's fries\", his Vietnam days \"in the jungle\", and his speech to the cops are just all priceless moments. It's one of the funniest marriages of actor and role - and Mr. David just plays it all so well. Watch him snap at the pizza man who's \"seen too much.\"<br><br>All in all, \"Men at Work\" is a delightful, crowd-pleasing comedy that is able to make me laugh far more than the types of films that are heralded as \"excellent comedies\" like \"Dr. Strangelove\" and \"Annie Hall.\" Give me this any day.<br><br>And Charlie, you may put this down...but in all honesty, this is your finest work to date, even ahead of comedic roles in \"Ferris Bueller's Day Off\" and the two very good \"Major League\" movies. It's lightyears better than the low points of \"Spin City\", too.<br><br>\"Men at Work\" is highly recommended, and is one of many films on IMDb whose low rating you can completely disregard. Or don't disregard it, but then you'll just be even more pleasantly surprised by the ensuing hilarity.","user":"DoobieKeebler","rank":[49,57]},{"title":"A Guilty Pleasure At Its Finest","rating":9,"date":"29 November 2001","review":"This little known movie written and directed by Emilio Estevez is near the top of my all time movie guilty pleasures list.<br><br>Estevez and Charlie Sheen play two garbagemen who stumble upon a plan by Maxwell Potterdam III (John Getz) that involves dumping hazardous waste into nearby harbors, thus destroying the underwater environment in their area. The city councilmen is also involved in this scheme.<br><br>However, this is all a loose plot for the hilarious shenanigans that ensue with Carl and James (Sheen and Estevez), their \"observer\", Louis (Keith David), and a couple of unlucky cops.<br><br>Keith David comes close to stealing the show from Estevez and Sheen with his character of Louis, a Vietnam vet who still suffers from a bit of shellshock. He sees everything through the eyes of war, and this makes for some hilarious sequences, particularly when the friendly pizza delivery man is kidnapped.<br><br>All in all, this is mindless, but funny entertainment. It is funnier than 90% of the comedies made these days, and many have never seen or heard of this film.<br><br>It should be noted that the VHS tape is out of print (although Amazon.com did release it as an \"Amazon Exclusive\", but it is now on special order). It can still be found at some rental locations, but has also yet to be released on DVD (I believe MGM has the rights to the film, but I'm not positive). Here's to hoping we see a DVD sometime soon!<br><br>Grade: A","user":"Redfoot9681","rank":[25,29]}]