[{"title":"A childhood favorite, and a misunderstood classic","rating":4,"date":"4 July 2013","review":"Ah, heres a movie I remember fondly from my childhood. Man I had it all, the toys, the McDonald's happy meal toys (not to mention those cool large plastic McDonald's cups my mom bought me) the sega video game, the trading cards, the t shirts, the batmobile candy dispensers, all kinds of neat merch based on the movie. of course in retrospect, this is not at all a kids movie, despite the fact its batman and was aimed at kids who bought happy meals. but that doesn't mean its not a great movie. not every superhero movie has to cater strictly to the kids. nevertheless, my 6 year old self was too in love with batman to care about how dark it was, I still loved anything and everything having to do with my favorite superhero and I must have watched this movie, along with the other 2 movies (1989 batman and batman forever) a zillion times on video.<br><br>here's the premise. Batman truly does Return in this sequel to the 1989 mega hit, and this time hes better then ever. hes got some new toys (like the electronic self-targeting Baterang), vehicles and even has 2 new classic villains to contend with.<br><br>penguin is a classic Tim Burton character in this one, but that can only be a good thing. in this movie, Burton makes the characters very ambiguous. is the penguin really half animal, half human? is cat woman part cat, part woman? these questions never really get answered. personally, i don't believe they are part animal at all. the penguin is all human albeit a VERY deformed and ugly one, and is only called Penguin because of his deformities. Catwoman is always human but the whole \"9 lives\" thing makes it ambiguous whether she has supernatural powers or whether shes just very lucky. its debatable. Batman is the only normal guy in this. in fact, Keaton being the calm cool hero both as Bruce Wayne and batman, grounds the movie and keeps it together whereas the 2 villains are completely crazy and psychotic nut cases. it seemed Keaton didn't have it all together in the last movie, he had a a lot of demons to fight with, but by the end you got the feeling he found his purpose in life, now that hes got a bat-signal and the law on his side. so naturally, in this one he seems more together and knows what hes doing. its the villains who are not together and have all these obvious mental problems, so much so that they actually make batman look normal. if it was anyone else playing batman, it wouldn't have worked. but Michael Keaton has a unique screen presence that when he puts on the bat suit, he literally IS batman and lets face it, no one before or since has had the manly swagger that Michael Keaton had as batman. he was a bit older, getting some greys, was this sort of gruff everyman but has this seriousness and \"normal guy\" look that makes you take him seriously as batman. other actors who have played batman seem too pretty boy or hand picked and thus don't feel real. Keaton is like the everyman normal looking 40 year old gruff guy and he demands you take him seriously. this is a very artsy film, compared to its blockbuster brother from 1989, which was basically a cut-&amp;-dry blockbuster action/adventure. but it really didn't have any emotion or depth to it, despite Keaton's sincere efforts. Thats where Returns comes in. all the characters are very interesting and in a way, they all echo Batman. Catwoman is the dark vigilante side of him, while the Penguin shows what Bruce Wayne could have been if he turned bitter against the world. <br><br>I've heard many ppl say that this batman film is not really about Batman himself, and that too much attention is given to the villains, but i will say again, its not a bad thing, and doesn't ruin this film. batman himself is really not a very interesting character when you think about it. hes essentially a guy who's see's his parents get killed as a kid, he trains for X years, then decides to becomes batman for revenge purposes. OK. thats it. there's no more to it really. certainly not something i want to watch for a whole 2 hours. i really didn't see a point in making a whole movie about his origin a couple years ago, i think it was a waste. i was always kinda hoping they would bring back the Burton style of filmaking for batman movies, or maybe even get Burton back to direct. but alas, we got something that felt like a lesser version of the 1989 film. sad. but hey, we always have the Tim Burton films to enjoy. those, IMO, captured the real batman, beyond the facade of \"comic book\" movie looks (which, in Burton's case, is actually a good thing). as far as i'm concerned, Burton is the only guy to have directed Batman movies. hes the only one who i believed truly understood batman, as you can see in his various films. the other directors never really...got it. they just don't get batman. they only got him as a character, thats it. but Burton KNEW batman, he understood his plight in life, and the darkness inherent in the material. thats why this is to me, the best, and most personal, Batman film. it shows batman, and his villains, at there most raw. they are all hurt individuals, and thats what makes this film so powerful. this is what a batman film should be. serious, witty, playful, phycological, and DARK. while still retaining the comic book style that we all expect. this film also paved the way for the wonderful Batman: The Animated Series, which also shares Tim Burton's dark, Gothic look and feel from both of his Batman films. it even uses the same theme!","user":"LaPfieffer92","rank":[9,11]},{"title":"Utter crap","rating":1,"date":"30 March 2010","review":"This movie is by far one of the worst super hero films ever, it's on par with Superman 4. Bruce Wayne just sits in his study waiting for the Bat Signal to call him (and what the heck is up with all those reflectors mounted on Wayne Manor? I guess the next time the house needs a roof repair the secrets out). Tim Burton has a way of making humanity look disgusting and he want way over the top in this stink fest. Here are some of the major issues. Batman punches through the floorboards of the almost indestructible Batmobile. He easily rips through his bullet proof outfit to, yet again, reveal his secret identity (and notice the lack of black eye makeup). I don't know what to say about the penguins other than WTF?!?! And a secretary who gets thrown out of a window, gets bitten by cats, and suddenly has the ability to perform acrobatics, is a great fighter, and is a master with a bull whip. This movie was supposed to come out at Christmas time, but in need of serious reediting in order to make it look like something beyond the level of a 3rd grader with a camcorder it was pushed to the following summer. They should have worked a little harder. <br><br>This movie was not a Batman movie. It was Tim Burton fixing something that was never broken. Thank God Batman Begins came out to show the world how Batman should be done. Realistically and serious.","user":"donstamegna","rank":[165,289]},{"title":"Oh, so very very bad!","rating":1,"date":"25 November 2006","review":"Spoilers<br><br>My brother woke me up out of a much-deserved nap to tell me how great this movie was and that I should go see it immediately. And by that he meant at the theater. When I finally did, I waited until 2:00 in the morning to call him up and tell him at length how much it blew. Penguins for pall bearers? I have never taken my brother seriously as a movie critic since then. Any time he says, \"Trust me,\" I bring up this movie and throw it in his face. <br><br>And do they have to kill off the villains in EVERY Batman movie? Go rent the Batman movie with Adam West where they dehydrate the United Nations guys. http://www.imdb.com/title/tt0060153/<br><br>It's better. Oh, can't find it? That should tell you how good Batman Returns is. Blegh!","user":"aschachte","rank":[119,205]}]