[{"title":"A movie to make your jaw drop open","rating":4,"date":"4 August 1999","review":"Now I have witnessed the third truly great film to have come out of America in 1994.  One that can hold its own, and more, against such films released that year as \"Pulp Fiction,\" \"Natural Born Killers,\" and \"Vanya on 42nd Street.\"  It's called \"Fresh,\" and I'll go out on a limb to say it's as powerful an urban drama as any other I've seen in my life.<br><br>There are no fancy cinematic magic tricks going on in this film, aside from an instance of superimposed images that is so simple it almost seems like a throwback to old silent dramas.  There are no choreographed gun fights, no switching film stocks to produce psychedelic effects, nothing like that. Not to say that these things cannot be used appropriately and judiciously to enhance the effect of a particular film, but \"Fresh\" is stripped bare, and must depend on its performances, direction, and writing alone.<br><br>For starters, a young Sean Nelson delivers a performance that puts the lion's share of veteran actors to shame.  He's completely lacking in self-consciousness, almost like he's unaware that the camera is on him for nine out of ten of the shots in \"Fresh.\"  His character, for which the film takes its title, may be the smartest youth in motion picture history for whom genius is not a gimmick or a joke (i.e. \"Good Will Hunting,\" \"Real Genius,\" stuff like that).  Watching him, you see a wise old actor in a teen's body; he does not \"act\" any emotions or thoughts, but merely feels them and thinks them.  He seems to embody bits of screen legend:  a little Bogart stalwartness there, some of Jimmy Stewart's quiet charm here, and most of all Morgan Freeman's ability to communicate much while doing or saying very little.<br><br>That'd be just enough for most movies, but Nelson is backed by a choice supporting cast: the two most recognizable names are obviously Samuel L. Jackson (Fresh's chessmaster/alcoholic father) and Giancarlo Esposito (the slimy, high-living drug dealer Esteban), and both are perfect in award-caliber performances.  Two lesser known actors, N'Bushe Wright (Fresh's junkie sister Nichole) and Jean LaMare (as Jake, the hot tempered low-man-on-the-totem-pole employee of Corky) are also terrific in key roles.<br><br>The screenplay, by director Boaz Yakin, is doggedly unpredictable, but in retrospect it all makes perfect sense -- nothing in the movie pushes the bounds of credibility.  I've seen truckloads of thrillers, most of them are wearily proficient at making you guess what's next.  None but a few, however, kept me guessing WHEN to guess, or surprised me with such affecting emotional developments.  None but a few moved along with such self-assured grace and style.  \"Fresh\" knows its territory, the time and place it's set in, and it provides characters who talk like they do in real life -- not ones that sound like they're in a movie where they talk like they do in real life.<br><br>The use of violence is admirably restrained.  Most of it takes place off camera, silhouetted, or cut away from quickly.  The two scenes of bloodletting, when they are shown to us, are literally heartbreaking.  Not only does \"Fresh\" keep us off guard on a psychological level, but on an emotional one as well, something few films ever think of doing.<br><br>If I were to offer one criticism, it would be that the chess metaphor was pressed just a bit too hard by Yakin (though the final scene is devastating):  we already know that this kid is thinking like a master strategist, we don't need quite so many shots of him playing the game in his room.  That's a small quibble, though, because the chess metaphor is entirely appropriate, and Jackson's early speech about the game is an ingenious device.","user":"Jaime N. Christley","rank":[46,54]},{"title":"Your queen is just a pawn with some fancy moves, nothing more.","rating":10,"date":"24 March 2005","review":"Fresh is one of those movies that you never see coming. From the opening credits until the end, it provides you with this deep, gritty, yet utterly realistic portrayal of a youth's mind on the streets. While our normal society will shrug a struggling African American living in the ghetto as someone without the intelligence to go forward in life. It is a sad reality in which we live, but it is a thought that goes through suburbia's minds. This film proves the age-old saying that you should never judge a book by its cover. What begins as a normal urban drama quickly unfolds into this tightly woven crime story where we have this unexpected hero that arrives from nowhere to pull of this incredible feat. With perfect acting, the right combination of drama and action coupled with suspense, and a story that literally keeps you glued to your seat until the very end, it surprises me that more people haven't discovered this cinematic gem and attached themselves to it.<br><br>To begin, Sean Nelson is brilliant. I have not seen better acting from a young adult in my entire film life. Dakota Fanning comes close, but Nelson's emotion seems to be raw and uncreated by Hollywood. His reactions and passion behind his eyes is intense and compelling at the same time. You cannot watch this movie without keeping your eyes glued to this kid. I am very surprised that he has not done more roles that would be able to showcase this young protégé's talent. He interacts well with the other actors as well, giving us this rare glimpse into a world that many of us may not be familiar with. He takes us away from the clichéd child abandoned on the streets with nothing to loose and gives us faith in the family structure and bonds that are created between humans. Sometimes I think we forget this as we watch our televisions, buy our cars, and spend our money. There are important aspects in life, but at times our ideas of that can be skewed. That is what I love about Sean's role in this film. He defines himself early, and allows us to see his change clearly throughout the film. He begins as wanting to have a lot of money and power to using what he has earned to save his family and his friends. There is something redeemable about that which isn't shown as much in films today.<br><br>Add to the brilliant work of Sean Nelson are a couple of actors that really played well of the emotional child. Giancarlo Esposito, N'Bushe Wright, Jean-Claude La Marre, Ron Brice, and the unquenchable Sam Jackson are just a few. Nelson's ability to play off Jackson's intensity with the greatest of ease is just another glowing example of the power behind this film. You can honestly see where Fresh's talent began with the strong father/son dynamic that director Boaz Yakin has created. Yakin has crafted this beautiful story of a child's inner demons and desires with the greatest of ease. As a director, he has pulled more emotion out of these children than I have ever seen with any other child actors. Where he takes his story is bold and realistic. The dirtiness and grime of the streets contrasted with the intelligence of this child was nerve racking and intense. I loved it. Yakin had to be proud of himself to find such a great cast to work with as well as create this story that could be enjoyed by audience throughout the ages.<br><br>Finally, I would like to comment on one of the most important themes of this film that I didn't realize until closer to the end. Chess is a huge element in this film, and at first you will not see this, but by the end it will hit you like a brick. The power that Jackson brings to this young boy's mind simply by teaching him the strategies of chess is insurmountable. While I thought that Yakin was just trying to define the father/son relationship with this game, there was so much more going on underneath the top layer that I wasn't expecting it from this small title. I think that is what impressed me so much.<br><br>Overall, this film is great. It is boldly honest and originally beautiful (in repetition of myself) that needs to be re-released or remembered time after time. I am so glad that I discovered it and cannot wait to show it to friends and family. It is nothing short of the perfect film! <br><br>Grade: ***** out of *****","user":"film-critic","rank":[33,39]},{"title":"Boy in the 'Hood","rating":10,"date":"28 January 2005","review":"Boaz Yakin, the enormously talented writer/director of \"Fresh\" has done the impossible, a real movie about real things that offers a sharp contrast with other films about the subject we have seen before. Mr. Yakin working with what appears to be a cast of non professional actors, mainly, presents a gripping tale of life in the ghetto that will probably be a classic in this genre.<br><br>If you haven't seen the film, please stop reading now.<br><br>Fresh is the young boy at the center of the action. We follow him as he runs illegal drugs for the dealers of his area. Fresh comes from a broken home where the mother is not around and the father is absent from the picture. His kind aunt Frances has gathered about a dozen youngsters in the home she shares with her mother, who is the grandmother of all of them. In spite of the poor surroundings, this is a decent home.<br><br>Fresh probably learned quickly in his young life he must be a step ahead of the drug dealers and their henchmen in order to survive in that world. It's a heavy trip for a young child to deal with in his own life and still have a head in his shoulders. What Fresh does, of course, is illegal, but this is a determined young man that is looking for a better future in spite of what he sees around him.<br><br>Fresh loves to play chess. We watch him win games in Washington Square Park over more skilled players. Sam, his absent father, is a master of the game. Sam teaches his son the game and how to think the way the champions do. Sam is a highly intelligent man who has had the misfortune of falling victim to the bottle. His son, admires him but bears a resentment against him for abandoning him and Nicole, his sister. One thing is sure, Sam always wins when he plays Fresh. Only after all the big events at the end of the film, Fresh beats the old man up. In doing so, we see tears coming out of him because maybe then, Fresh realizes the enormity of the events he's been involved in, and the fact that his father, in yelling at him, perhaps shows the boy how much he cares for him.<br><br>There is a scene in the film involving pit bull fighting that will make, even the coolest viewer cringe. Fresh's dog wins a match, but it is a menace that has to be put to sleep. The scene where Fresh hangs the dog by his collar is one of the most horrible things we watch in the movie. Fresh is venting his frustration at a dog he clearly loved, but now he cannot keep. <br><br>The acting by all the principals is first rate. The only problem is that sometimes some of what he hear in the dialog is incomprehensible because of the use of street slang most of the viewers don't know. Sean Nelson makes a perfect Fresh. He is one of the most natural actors we have seen in a while. The lack of formal training works out as we watch a portrayal that is devoid of any mannerisms, or other cute poses that someone with more experience would have done with this role.<br><br>Samuel L. Jackson makes another incredible appearance as Fresh's father Sam. Mr. Jackson's take on this man is an excellent example why he is on of the best actors working in films today. Giancarlo Esposito as Esteban, the nasty drug dealer, adds another great role to his brilliant film career. <br><br>Adam Holender, the cinematographer, has given the film the right look. The dreamy scenes where Fresh is seen looking toward Manhattan at different times of the day, is pure poetry. This is an important movie dealing with an important subject. Thanks to Mr. Yakin, we go into that world that, for some of us, might as well be in another continent, but never right here in another part of town!","user":"jotix100","rank":[19,22]}]