[{"title":"Insanity. pure insanity","rating":26,"date":"26 March 1999","review":"Tromeo And Juliet is a funny movie.  It's a good movie.  It's a cool movie. And even a perverted and violent movie.  But above all it is a weird movie. Bill Shakespere wouldn't just roll over in his grave if he saw this he'd probably spin like a top.  There's a lot to be said for a movie that has a person in the credits under the title \"stunt nipple\".  The found a peanut bouncing head is hilarious, but not as funny as the guy picking up his brain and futily trying to put it back in his head while crying. The religious hymn of \"Job We Gather At The River\" each time someone dies brings happy recollections of the opening moments in The Wild Bunch.  This is definately a good movie.  Watch it sober your first time around however.","user":"PIST-OFF","rank":[11,11]},{"title":"Shakespeare on acid? Possibly.","rating":7,"date":"31 March 2006","review":"A very bizarre bringing to the screen of William Shakespeare's tragic love story.<br><br>The Que family and the Capulet family have a long running hatred of one another which often results in violence. The hatred has something to do with a film company and the fact that everyone is pretty much crazy. In the middle of all of this insanity are Tromeo and Juliet, literature's most famous \"star crossed\" lovers that fall for each other at first sight and problems arise when they realize whose family the other belongs to.<br><br>The film follows the basic plot of the original play remarkably well and key scenes even use the original, or close to original, lines. But the infamous Troma bizarreness pervades the film from beginning to end. That makes for a movie that is definitely not for all tastes, but it is nonetheless pretty inventive. Tyrone (Tybalt in Shakespeare) has a particularly funny death scene. 7/10<br><br>Many differently edited and rated versions exist. Each contains violence, profanity, drug use, and sex, all with a big dose of bizarreness.","user":"BroadswordCallinDannyBoy","rank":[18,23]},{"title":"So amazing I had to watch it again","rating":10,"date":"26 September 2003","review":"This movie is truly unique. It really captures the spirit of the play, but makes it entertaining to the modern generation. The romance between Tromeo and Juliet was believable, and erotic, not pulled off by many adaptations. It is also so funny I was almost crying with laughter.<br><br>\nLike with most Troma its in your face, taboo subjects, gore and sex, and yet add in some really good acting and a Shakespeare plot. You really have to see this movie to believe it!<br><br>There are some hillarious jokes in the credits (best credits I've seen since Hot Shots) loads of Troma in jokes as well as general satire and shakespeare refs. And Lemmy from the house of Motorhead narrates. I lent this movie to a friend and had an almost impossible job of getting it back. Troma at its best, this film really is a gem, and goes in my top 5 favourite movies of all time. <br><br>Though its not the sort of film you'd watch with your mum, and might offend some people. For anybody bored with run of the mill cinema, with a wacky sense of humour you MUST SEE THIS FILM.","user":"vampiremovies","rank":[17,24]}]