[{"title":"I was franks baby in this movie","rating":10,"date":"30 August 2013","review":"My name is Carlie Dougher. I was in this movie. The little baby on the porch, frank's daughter in the movie. I was wondering if I made a comment if maybe I would be put in the cast. I mean the \"kid on swing\" was. Haha :) <br><br>Since I must write a minimum of 10 lines I mine as well give a review. I was 14 when I was finally able to watch this movie due to the violence and it being rated R.<br><br>My parents finally allowed me to watch the full film not just the beginning where I'm in it for a good 3 minutes or so lol. Iv watched it so many times and show all my friends it's such a cool movie and it never gets old not to mention is funny as hell and it's definitely a nail biter. It's a good movie on a rainy days. It's one of those movies you wont want to end.","user":"Carliedougher","rank":[95,102]},{"title":"One of the best thriller of 1993. ***1/2 (out of four)","rating":9,"date":"21 July 2001","review":"JUDGMENT NIGHT / (1993) ***1/2 (out of four)<br><br>By Blake French:<br><br>Although many critics mauled \"Judgment Night,\" I rank the film as one of the year's best thrillers. It proves when filmmaker's examine feasible situations of horror, the product grabs us by the throat and pulls us in. \"Breakdown,\" the high-octane suspense masterpiece of 1997, worked remarkably well because its concept and characters felt authentic and real. \"Judgment Night\" finds terror in another circumstance that feels real-we empathize with the characters and believe the environment because what happens to them could actually happen to such people in real life.<br><br>The main character is Frank (Emilio Estevez), a family man who's ready for a night out presumably after months of caring for his pregnant wife. He is going to a boxing match with his two good buddies, Mike (Cuba Gooding Jr.), and Ray (Jeremy Piven), and his little brother, John (Stephen Dorff). They're traveling in style; Ray, an excellent negotiator, sweet talked his way into borrowing a luxurious motor home for the evening.<br><br>\nAs the four big kids travel to their destination through Chicago, a big traffic jam halts their progress. Ray decides to take a shortcut through the city's gang territory. They accidentally hit a man crossing the road, check to see if he is badly injured, and things go down hill from there.<br><br>\nInitially, Ray doesn't call the police because he's had a lot to drink and doesn't want to spend time in jail for involuntary manslaughter. The person he hit turns out to be a young gangster running from his boss, with a coat full of cash he's stolen. The boss (Denis Leary) eventually catches up and punishes the kid by shooting him in the head. Ray, John, Mike, and Frank witness the murder, and the boss does not want any witnesses.<br><br>\nThe rest of the movie places the four characters in one terrifying situation after another. They find cover in a freight train full of greedy homeless people, an apartment where nobody will lend a helping hand, the rooftop of a high building, the sewers, the streets of the windy city, as well as other buildings and a shopping center. The villains always find the foursome, no matter where they hide. When you are in the gritty parts of Chicago, life is cheap. Many people reveal their cover for just a few dollars.<br><br>The screenplay flows unusually smooth. The film does not involve any unneeded subplots or distractions-every character and event plays an important part in moving the story forward. \"Judgment Night\" is very focused, lean, and suspenseful. So many thrillers these days forget that action and violence provides relief from tension; fist fights and shoot-outs alone do not captivate viewers. \"Judgment Nights\" really knows how to build tension and then relieve it with some startling violent sequences.<br><br>\nMany reviews have mentioned the film's obvious areas of stupidity. I agree that the villains might have not revealed their identities to so many side characters. Otherwise, all of these characters are very believable. Frank, Mike, John, and Ray are real people who are in real danger. The villains kill one of the four early, and for once he's not the black guy. This establishes the merciless threat of these bad guys and that any of the characters is equally vulnerable to death. I was on the edge of my seat throughout most of the movie.<br><br>Stephen Hopkins directs \"Judgment Night.\" This is his best work yet. He never puts the movie on auto pilot like many thrillers do. This plot is character driven all the way through. Yes, it's just another cat-and-mouse chase film-it does not offer any deep satisfaction, nor does it examine deep, thought-provoking issues-but this genre is seldom as effective. After watching \"Judgment Night\" you will think twice before taking a shortcut.","user":"Movie-12","rank":[31,32]},{"title":"Surprisingly Entertaining Thriller!","rating":9,"date":"5 May 2001","review":"This movie was on late one night and I watched it due to the fact that Cuba Gooding Jr., Emilio Esteves and Stephen Dorf was in it. What emerged was a surprisingly good thriller great acting And the plot was quite good. Also Dennis Leary was a standout as the ruthless gangster.<br><br>All in all ****1/2 out of *****","user":"Colto","rank":[38,43]}]