[{"title":"Inventive and weirdly funny throughout, but touching, too, and Zellweger amazes!","rating":8,"date":"1 May 2010","review":"Nurse Betty (2000)<br><br>This is a sleeper, a dark comedy with enough inventive twists to call to mind The Truman Show but with a greater sense of reality to hold it down. Renee Zellweger is flawless as the naive, sweet, but utterly detached young woman named Betty who is addicted to a soap opera called \"A Reason to Love.\" This seems sweet enough, but her husband is a jerk (totally) and things start to spiral, and get dizzy, as reality even for the viewer starts to shift ground.<br><br>Not that you are ever confused about what is happening or who the good guys are. The good guys are not Morgan Freeman and Chris Rock, for sure, as this unlikely and comedic father and son duo get involved, incidentally at first, in Betty's strange inner and outer life. A chase of sorts ensues, the soap opera becomes reality, and then reality becomes soap opera. And it's really hilarious and inventive and fast paced.<br><br>Is it a total work of genius? Probably not. Maybe Charlie Kaufman would have added another twist in there (I'm not sure how), and certainly some of the side characters could have seemed less cardboard, or less awkward as actors. But Zellweger is unbelievable (really, your jaw might drop at how convincing she could play her mental blindness, and her awakening, of sorts). And Morgan Freeman is his usually convincing and engaging self. <br><br>The utterly disgusting violence of one 20 second scene might turn off some viewers near the beginning, but if you can keep watching, the movie gets better from there. Much better.","user":"secondtake","rank":[16,17]},{"title":"For The Adventurous Only","rating":25,"date":"25 March 2002","review":"People keep asking \"is this a romantic comedy?\", \"a black comedy?\", \"a violent thriller?\".  If you're the kind of person who is not comfortable with a film unless you can safely store it into one of five or six comfy little categories, move on (or as Jack Black says, \"go to the mall!\").  To quote Roger Ebert, \"audiences lobotomized by one-level stories may find this confusing\".  It's really a sweet little comedy that breaks a number of 'sweet little comedy' rules, by introducing real terror and a few (count 'em - 3) scenes with a bit of gore.  Like Jonathan Demme's minor masterpiece, SOMETHING WILD, we are taken out of a safe little world (Kansas, literally) to another dimension.  This dimension is part Oz and part grit.  Oz is the fantasy life of the main characters (for Zellweger it's Kinnear, the fictional doctor on a soap opera, and for Freeman it's Zellweger, who he sees as a sort of modern Doris Day).  Intertwined with the fantasy is the frighteningly realistic fact that Freeman and his son Wesley, are hit men. What hit men do ain't pretty.  I'm personally relieved that this is not a cute comedy with 'widdle cuddwly' hit men who are really not so bad because after all, their violence is bloodless: we can overlook what they do. UH-UH!  We are not left off the hook that easily!  On the other hand, Morgan Freeman is an authentically charming guy, and in many ways, this film contains some of the most sparkling romance (real and/or imagined) that's been seen on the screen in a long time!  This indeed is a film that breaks many conventions while celebrating others, but be forewarned, this is not a safe, cuddly film.  You're not in Kansas anymore!","user":"Zen Bones","rank":[31,38]},{"title":"Great casting, acting, and original screenplay","rating":8,"date":"27 September 2000","review":"Neil LaBute takes a dramatic turn from his first two films, In The Company of Men &amp; Your Friends and Neighbors, with this funny and original thriller/comedy/road movie.  When Betty (Renee Zellwegger) witnesses the brutal murder of her no-good husband (Aaron Eckhart), she develops a bizarre sort of amnesia, and flees in his car, not knowing that there is large stash of drugs in the trunk.  Morgan Freeman and Chris Rock are the hit men who follow her.<br><br>What Betty is chasing, besides a new beginning (although she can't remember the old life) is her beloved, Dr. David Ravell (Greg Kinnear).  Only problem: Dr. David isn't real, he's a soap opera character on the show `A Reason To Love' and he's really an egotistical actor named George McCord.<br><br>To say any more regarding what develops would be too much, but Nurse Betty is certainly original.  Its hit men are, like the hired killers of Pulp Fiction, are violent yet philosophical, its take on soap operas terrific spoof material, and its acting is the best feature of all.  This has to be one of the best cast films in recent years.  Renee Zellwegger is perfect for Nurse Betty, with the constant gleam in her eye that pushes her in her quest.  Morgan Freeman brings his constant state of grace to the role of a killer at the end of his career, and Chris Rock is his partner, a man of rage and great impatience. Greg Kinnear is at his comic best as the vain actor/soap opera doctor.  There are also great supporting performances from actors such as Emmy-winner Allison Janney (The West Wing), Harriet Sansom Harris (Frasier's agent Bebe Glazer), and Kathleen Wilhoite (Chloe on ER). Actually, the supporting cast is a Who's Who of television best character actors.<br><br>A unique film that is funny one moment and chilling the next, Nurse Betty is a mix of great acting, casting, and a terrific screenplay.","user":"fleagles","rank":[30,37]}]