[{"title":"An absolutely incredible film!","rating":10,"date":"2 May 2002","review":"Simply incredible. Never before have I seen a 3 hour movie that didn't seem like 3 hours. I read the Lord of the Rings very recently and I was surprised at how similar Peter Jackson's vision was to my own.<br><br>Now about the omissions and alterations. I'm not a crazed fanatic who gets worked up over every little detail. I didn't mind Arwen's inflation and I'm actually glad Tom Bombadil was scrubbed (I felt Tom Bombadil was an unnecessary addition to the book). Despite these minor changes, the screenplay stays extremely close to the book and flows very very well (and the prologue was a nice touch).<br><br>The acting was flawless. As I've read many many times in other reviews, McKellen doesn't play Gandalf, he IS Gandalf. Wood, Mortensen, Holm, Astin, everyone was fantastic. My hat's off to Sean Bean who delivers an excellent performance as Boromir, a character who's intentions are good but wrestles with the corrupting power of the Ring. Bean portrays it VERY well. Oh, and Andy Serkis does a PERFECT Gollum voice. It's EXACTLY as I imagined it myself.<br><br>The special effects were incredible, the cave troll, the balrog, Gollum, and Sauron's Eye all looked amazing. I was also very impressed by the seamless shrinking of the vertically challenged characters.<br><br>What's wrong with this movie? I have no idea... I thought everything was perfect. MY biggest gripe is having to wait an entire year to see The Two Towers!","user":"NRGWasp","rank":[160,169]},{"title":"Great","rating":10,"date":"15 February 2020","review":"It is my firm belief that the standard versions of The Lord of the Rings should be jettisoned in favour of the extended editions universally. Sure, the near 4 hour runtime is a tad steep, but for an absolute masterpiece like this, it's work every second and the first act of undoubtedly the best trilogy in cinematic history!","user":"MR_Heraclius","rank":[50,51]},{"title":"Wow!","rating":11,"date":"11 December 2001","review":"Breathtaking.  Unique.  Captivating.  Enchanting.<br><br>Within minutes of the start of this first chapter of an undeniably epic trilogy, the audience was left gasping at the intensity of the images on the screen.  And we had nearly three hours to go.<br><br>The scope of Tolkien's masterpiece may have eluded film-makers for decades, but director Peter Jackson makes good on his promise: he has not only brought us the tale of Frodo and his bold companions, he has brought us Middle Earth.  And believe me, it is BIG.  Sweeping vistas and hang-onto-your-seat camera shots send us zooming through the towering cities and citadels of Tolkien's imagination.<br><br>But even more impressive than the stunning visuals and sound-effects-like-you've-never-heard-before are the actors who breathe life into the characters.  Ian McKellen's portrayal of Gandalf is nothing short of awe-inspiring, and Elijah Wood's Frodo is one of the most unexpectedly captivating performances I've seen in a long time.  The despair, terror, and determination of the Fellowship is all there, in spades.  I left the theater aching...from tensing every muscle during the fight and flight sequences--the breathless and compelling kind we haven't seen since Spielberg gave us a desperate charge onto the D-Day beaches of Normandy.<br><br>Those unfamiliar with Tolkien's world may quickly find themselves lost in it, but happily so.  The depth of his creation cannot be grasped in a few hours, and it doesn't need to be; the struggle of good against evil explodes on the screen, and leaves little room for complaint.<br><br>The movie ended with a stunned audience sitting on the edges of their seats, feeling somewhat bereft.  We were exhausted, but no one wanted to wait a year for more.<br><br>Jackson's ambitious first chapter is truly unlike anything you've seen this year.  George Lucas and Chris Columbus take note: this is how you deliver on a cinematic promise.<br><br>For everyone else: don't you dare miss it.","user":"minionlost","rank":[299,340]}]