[{"title":"A truly subversive movie","rating":10,"date":"28 March 2000","review":"I was not a fan of South Park before I saw BL&amp;U, nor was I a fan of movie musicals. Well, I'm still not a fan of musicals, but I'm a fan of *this* musical, and am grateful to Parker and Stone for demonstrating that it's still possible to make a great movie on one's own terms.<br><br>For this movie, unlike the usual feature-length adaptation of a pop culture phenomenon, not only lives up to its pedigree, it wildly exceeds it. Yes, the movie does recycle many of the show's jokes, but it does so in new yet relevant contexts that keep the material funny if you are familiar with the South Park world. If you aren't familiar with that world (as I wasn't before seeing the movie), the gags are simultaneously accessible yet often subtle.<br><br>Subtle? Yes, many of the gags are. Indeed, one of the pleasures of owning a copy of the movie is having the ability to review the movie, in slo-mo if necessary, and discover throwaway sight gags that one has missed in the delirium of watching this anarchic satire the first time through.  (And if you have the DVD, you can add subtitles to catch many of the songs' often elusive lyrics.)<br><br>Then there's the music. What is it about movie musicals that attracts great satiric minds? Not since Pynchon's \"Gravity's Rainbow\" has a work of art so subversively exploited the conventions of the movie musical as South Park. From the droll opening strains of Mountain Town, to the Disneyesque \"Up There,\" to the Les Miserables spoof, \"La Resistance,\" South Park simultaneously sends up the genre while paying homage to it, and still finds room to use the songs to score delicious points against its myriad targets.<br><br>One last thing: this movie is not cynical. Beneath the scatological humor, the cartoon violence, the scathing portrayals of Wynona Ryder et al, and the backdrop of adult xenophobia, sexual repression and political opportunism, is a sensibility that exalts childhood as an island of honesty and idealism, if also of id-like impulse and frequent selfishness. In this they share space on the shelf of great satires with \"Candide,\" \"Gulliver's Travels,\" \"Tom Sawyer\" and especially \"Huckleberry Finn\"--classics that, like BL&amp;U, also exposed the hypocrisies of the adult world \"through the eyes of a child.\"<br><br>Elvis Costello once sang, \"I want to bite the hand that feeds me/I want to bite that hand so badly/I want to make them wish they'd never met me.\" That BLU was shut out at the Academy Awards (having only garnered a nomination for the relatively tame \"Blame Canada\", which lost, appropriately enough, to the execrable Phil Collins) only vindicates the film's take-no-prisoners send-up of nearly everything that annoys in this suffociatingly focus-group-tested, PC-policed, cynically sentimental, violence-ridden, love-starved modern world. See this movie, and see the persistence of hope and possibility sparkling like a diamond amid the pop culture detritus of a quiet little red-necked, white-trash, strait-laced, mesuggeneh, US mountain town.","user":"Tresy","rank":[177,200]},{"title":"Must see for fans  but funny and clever enough for a wider audience","rating":2,"date":"2 November 2002","review":"In the quiet little town of South Park Stan, Kyle, Cartman and Kenny bride a tramp to sneak them into an R screening of the new Terrance &amp; Phillip movie. They emerge foul mouthed and with attitude as a result of the movie and, while repeating a stunt in the film, Kenny is killed and sent to Hell. Kyle's mother leads a movement against the Canadian comedians that results in their arrest and sentencing to death.  Meanwhile in Hell, Satan and his lover Saddam Hussain prepare for the killing of Terrance &amp; Phillip  the sign of the coming of the new time where Satan will rise again to rule the earth.  Can Stan, Kyle, Cartman and Kenny save the comedians, stop the censorship movement that blames society for bad behaviour and prevent Satan and Saddam from destroying the world?<br><br>I suspect those that hate this movie are generally those who hate the TV show, where those who liked it may not be those who watch the show.  I'm a fan of the show but I not such a fan that I blind to the lack of consistency at times in the show  some episodes are dumb and lack wit, trading on swear words and forced jokes.  However I fell in love with this movie from my first time seeing it.  The film is funny in the same sort of silly juvenile way that the series is.  It has the same strange sense of humour  witness Conan O'Brien having a `Judas' moment and throwing himself to his death!<br><br>However on top on this it is imaginative.  How many other crude films would do it as a musical.  I'm not saying that this makes it more worthy than gross out comedies like American Pie etc, but it is cleverer.  The musical element adds to the film and helps it's stretched running time.  The songs are all catchy and are better than some of Lloyd-Webber's stuff!  They are choreographed well and just feel funnier due to the situation and the lyrics!  For example Satan's song `Up there' is excellent but hilarious because of who's singing it and the sentiments he's expressing!<br><br>The irony of the film is not lost.  The accusations levelled at the South Park Movie are those that the mothers in the film level at Terrance &amp; Phillip.  The story actually answers it's own critics while telling the story!  It's not perfect and it does go a bit over the top and maybe begins to think that it is cleverer than it actually is.<br><br>The voice work is as excellent as always and Parker and Stone carry this the whole way home.  Guest stars add some interest but really all I need is Cartman et al and I'm set!<br><br>Overall I am a South park fan and I really enjoyed this.  Not just because of the elements of the show that are reproduced here but also how clever it feels (even if it isn't always as smart as it wants to be).  This isn't a cheap TV spin off into a movie this is a film that is imaginative and funny. Haters of the show will hate this but this may win you over if you thought the TV show was juvenile and a waste of time.","user":"bob the moo","rank":[86,96]},{"title":"A hell of a funny film, but with a message.","rating":7,"date":"2 July 1999","review":"When you have the reputation that Parker and Stone do, it is hard to get rid of the sterotypes that have been drawn around you.  You are forever stuck in the mold that has been bestowed upon you.  But perhaps sometimes when stigmas of that nature are forever embedded with your name and reputation, it actually gives them more leeway to make a statement that is political in nature.  As long as they disguise that statement(s) with all that made them popular in the first place, they can get away with it.  So now, if I said that beyond the non-stop vulgarity and infinite humour that this film contains, is a film that has an important message camouflaged in animation, would you believe me?  Would you care?<br><br>First off, this is the most profanity laced film I have ever seen in my life, and that includes early Eddie Murphy efforts.  But the profanity in this film had me in stitches.  Honestly, that was almost not just a figure of speech either.  I laughed so hard that I almost banged my head on the on the person in front of me.  Remember how absorbed you were at the horror of war at the beginning of Private Ryan?  Well if you had to parallel the two and replace horror with humour, that is a safe comparison.  This film is so ******* funny and I really enjoyed it on that level.  I can honestly say that I haven't laughed so hard since Office Space.  The profanity goes a bit overboard at times but I think that was on purpose.  Some of the humour is a bit gross ( seeing Sadam's rubber propalactic was funny but a little sick at the same time ) but I think these guys wanted to see how far they could go. And they went very far and they dared the MPAA to censor them even more, and hey, I was very entertained.<br><br>But on the political side, there are a lot of dicey issues that are covered here.  Censorship for one.  It's funny because we as Canadians and Americans have some of the same ideologies and one of them is free speech.  But if that is what we want, then we have to be willing to go all the way.  You can't pick and choose what is more free and more appropriate than something else just because it is not politically correct.  Free speech means free speech.  Free to express your thoughts in an open forum.  This film tells us that free speech is free as long as you don't offend the masses.  It also says that in MPAA's world it is okay to see blood and guts and intestines and brain tissue ( many of those films get an AA rating ) but profanity dictates that an R or an X is required to see the film.  That really is silly.<br><br>The film also touches on racism in the armed forces and it shows how brain washed Americans get when there is a conflict with an opposing nation.  It doesn't matter that perhaps some of the issues at hand are clouded and misunderstood, many  people stand behind their government to the very end. Kill em' all in the name of the Constitution.  There are also some stabs at religion and being gay and a plethora of other issues.  A particular scene with Bill Gates is funny.<br><br>Parker and Stone have given the finger to the ratings system in America and I think people will like it.  They have also given much more credit to the Canadian armed forces in this movie.  If the U.S. ever went to war with us, it would probably be over in a day or so.  So thanks for making us look at least competetive.  That was cool.<br><br>It may be weird to read a review of this film and have comments about politics in here, because it really is a funny movie and I was in a good mood when I left the theater, but there is more to this movie than just humour.  To accomplish that and still be known as the guys who made fart jokes and the F word popular is quite a feat.  This film is there to enjoy but it is also there to ask some tough and interesting questions.  Enjoy the film, but listen to what it has to say.  That is, besides the F and S word, listen to what it wants to say.<br><br>**** One last observation and that is, when I was in line for the film, a lady and her five year old daughter were in front of me.  When they asked for South Park, the cashier asked if she was sure because there is a lot of profanity in the film.  The lady reassured her that it was fine.  Her daughter can listen and watch but knows not to repeat.  That is responsible parenting.  Teach your kids right from wrong and hope they turn out well. That's all you can do.  And I applaud that parent for doing so.  She may never know who I am but I will remember her for quite some time.  Maybe if more people were like that, there wouldn't be such a fuss about profanity. After all, they are just words.","user":"baumer","rank":[169,198]}]