[{"title":"When everything turns out wrong, you got to run.","rating":10,"date":"12 February 2002","review":"This is one of the movies that get better every time you see them. It's packed with so many original and unconventional ideas that you always find a new detail. As in Sabu's subsequent movies (I didn't see \"Unlucky monkey\" yet, but the other ones are as great) failure, chance and humanism play great roles. The cutting and Montage is inventive and artistic, without the movie being an \"art\" picture, but a highly entertaining one. When comparing it to \"Run, Lola, Run\" you have to keep in mind that \"Dangan Ranna\" was made some years before and was shown on German TV as early as 1997...so it's more probable that it served as inspiration for Tom Tykwer's movie, and not the other way around. Complementary to the other reviews I have to add that I like the acting and the ending very much. This movie is a lot of fun in many ways, and it manages to deliver a message without being annoying or pretentious.","user":"Alex Klotz","rank":[6,6]},{"title":"For the rush of Sabu","rating":31,"date":"31 July 2011","review":"This director makes films which never cease to amuse, entertain, or make me think long after first viewing. Dangan Runner (Non-Stop) is where it all started.<br><br>The story is simple. Sabu's characters are interesting in the fact that they are far from perfect and deal with everyday problems which lead to events of grand proportion. Tomorowo Taguchi (Yasuda) is great as our main character (I wouldn't go so far as to call him a hero which is great in this case) who totally puts a spin on the term packing heat (I never caught this till watching this a 2nd time; an ode to Sabu's subtle humor). Rather than relying on long dialogue, the story is a blast to watch as they reveal the characters' situations and how they get caught up in this dilemma. Diamond Yukai is good as the rocking, hazed out Aizawa. The music plays a great role in Dangan Runner as it establishes moods at a breakneck pace. Shin'ichi Tsutsumi makes his Sabu debut and it's apparent why the director chose to work with him in later films. Tsutsumi has this screen presence where he successfully conveys what his character is going through without saying much dialogue. Plus, the image of him sprinting with a blade in hand carries quite an impact. Right from the get go, you can tell Takeda means business even if he's going through yakuza troubles of his own. Ren Osugi is great in his brief, yet vital role as he gives Takeda some helpful insight. Look for Sabu himself (it's very tough not to miss him!). Oh, the actress who plays Midori is a dead ringer for Maggie Cheung, isn't she??<br><br>The cinematography in Dangan Runner is fantastic. There are really great shots of modern city life ranging from busy streets, narrow alleyways, construction zones, and pachinko parlors. One awesome shot is on the bridge just right after sunset resulting literally in a purple hazed sky. I noticed one theme in the film is looking into one's self and reaching that point of self realization, coming to realize where you are now, how you got there, and deciding what to do next. The characters here are furiously looking for the answer for each of them and it's through the journey that they find it. Being an avid runner, I can relate with the benefits of running, how it helps with forgetting everyday problems, reflecting on what's on your mind, and at the end, I come out with a great clear headed feeling. Like I mentioned, Sabu makes very thought provoking films.","user":"InzyWimzy","rank":[3,3]},{"title":"Run Yasuda Run","rating":8,"date":"9 November 2000","review":"An entertaining and substantive film, Non-Stop has drawn deserving comparisons with \"Run Lola Run\".  The film quickly develops into a chase sequence, during which the viewers learn about the three main characters through flashbacks and daydream sequences. The chase serves not as as a fast-paced climax, but as a journey that makes up the majority of the film.  During the \"run\" we see the characters grow and momentarily forget about their dreary lives, about the \"macho\" roles they've bought into, and eventually forgetting about why they started running in the first place. Much like fighting provided a \"clarity\" for the characters in \"Fight Club,\" running provides this film's characters with a means to step away from the false values that we all allow society to create for us. Their running serves as way to truly taste life from an unclouded perspective, and all three find some level of clarity and joy in the process.<br><br>My appreciation and enjoyment only wavered slightly in the ending of the film, where instead of learning from their experience, the characters seem to revert to acting out those false macho roles I thought they had escaped from through their journey.<br><br>Still, the only true problem with this film is that it wasn't distributed outside Japan sooner.","user":"deproduction","rank":[3,3]}]