[{"title":"The best anti-Hollywood film ever made by Hollywood","rating":8,"date":"23 July 2003","review":"Griffin Mill is a young hotshot producer who everyone bows and scrapes to because he has the powers to get a movie made. However he starts getting bugged by a dissatisfied writer which leads to all kinds of  deadly intrigue.<br><br>Just when I thought Altman had gone totally off-the-boil he suddenly jumps back with his most perfectly realised film. While hardly unapplauded on its release (and in short retrospect) this is a movie that will be regarded by future generations as a classic. It is so smart, sassy, funny and has a beginning, a middle and an end. The kind of tragicomedy that gets the best of both worlds.<br><br>Robbins is perfect as the lead. He doesn't do much or emote much. As Robert De Niro once said \"most people don't show their emotions, they hide them.\" Occasionally we get behind the shield of human indifference, but only occasionally. We don't like him much - nor should we - but he is not so bad that we can't bare him. Indeed he is merely someone whose selfish world gets out of control. Whoopie Goldberg makes the most of her unlikely casting too.<br><br>The appearance of stars in guest parts adds a bit of icing, but that is all. I loved Altman's directions to the stars who had to play walk-ons (who else could have got that?) \"remember, you are responsible for who you are on screen. You are playing yourselves!\"<br><br>The sexy Scacchi plays the love interest with great skill. While just a muse she is a far better actress than most and this shows in her short screen time. Shame she hasn't more involvement in the main plot.<br><br>Like breaking a car down in to its competent parts, taking The Player apart only leaves an ugly mess of oil and metal. Together it drives a tight little film that has insight, drama and comedy. I would hesitate to call this a masterpiece, but it is a mini-masterpiece that however farfetched never reaches the point of being totally unbelievable.<br><br>The pay off at the end is one of the best belly-laughs any film buff could ever get. I doubt I will see a better film about modern day Hollywood in my lifetime. Like Pulp Fiction, a film that is as enjoyable the second time of viewing as the first.","user":"Pedro_H","rank":[78,90]},{"title":"A movie for movie fans","rating":17,"date":"17 September 2007","review":"During Robert Altman's \"The Player\" the criteria for a good Hollywood movie are established by the lead character: \"Suspense, laughter, violence, hope, heart, nudity, sex, and happy endings, mainly happy endings\". If you look close enough you'll find all of them in the film, as well as some in the film within this one. \"The Player\" is a scathing, smart, and funny attack on the Hollywood studio system and doubtless one that will be enjoyed more by those who have prior knowledge of the studio system, or are simply just movie fans. This film is packed with cameos, specific references to film history and only a truly dedicated movie fan could catch all of them.<br><br>The film opens with an eight minute long continuous shot which follows the lives and discussions of several executives and other personnel at a movie studio. This shot establishes several important characters as well as the cynical tone of the film (we hear a pitch for \"The Graduate 2\" set 25 years after the original among other ridiculous discussions). It also pays tribute to Orson Welles and Alfred Hitchcock, even mentioning Welles' \"Touch of Evil\" and its similar opening shot as well as Hitchcock's \"Rope\". Soon we meet Griffin Mill, a studio executive whose job is basically to hear pitches and either approve them or turn them down. His job isn't to pick the good movies, it's to pick the moneymakers (later in the film a character talks about \"The Bicycle Thief\", a product of Italian Neo-Realism and says: \"that's an art film, it doesn't qualify. We're talking about movie movies\"). One of the writers Mill turned down starts to send him threatening postcards and he assumes this person is David Kahane (Vincent D'Onofrio), so he tracks him down and semi-accidentally kills him, leading to a rather typical police investigation into the matter. Mill begins a romance with Kahane's widow, further adding to the convoluted Hollywood thriller plot.<br><br>In a wonderfully funny subplot Mill approves a pitch for a bleak, dark drama in which an innocent woman is sent to the gas chamber. The pitch is for the film not to include a happy ending and also 'no stars, only talent'. The subplot is developed alongside the main plot and used mainly for pure comic relief (nothing in \"The Player\" is serious drama, but the main plot is played straight and is mainly satiric in its ridiculousness, mostly avoiding big laughs in favor of more subtle humor). Over the course of the film the criteria for a good Hollywood film are all met. There's suspense (suspense in the Hollywood sense), laughter, violence, hope and heart (we manage to feel supportive of Griffin Mill even though he's mostly heartless and cruel), some nudity thrown in for good measure, and even an utterly idiotic sex scene which of course has nothing whatsoever to do with the plot. The brilliant double-ending is played for laughs and remains one of the best I've ever seen.<br><br>The screenplay by Michael Tolkin (who also wrote the book) is pitch-perfect in its balance, it manages to be satiric without descending to farce and scathing while remaining good-natured. The acting is excellent all around, particularly from Tim Robbins, who is perfectly capable of a strong performance (see Clint Eastwood's \"Mystic River\"), but plays his role here like any bland lead in a Hollywood thriller. He doesn't even bother emoting for the majority of the film, which only makes the satire stronger.<br><br>With \"The Player\" Robert Altman returns to form and makes a worthy addition to his impressive filmography (which includes films like \"Nashville\", \"Gosford Park\" and \"MASH\"). The film is funny both in a traditional manner and also in a dark, satirical manner. By including all of the elements of typical Hollywood in his film Altman has crafted a crowd-pleaser as well as a tribute to film and film fans everywhere. One of precious few films that are truly perfect.<br><br>5/5","user":"ametaphysicalshark","rank":[57,67]},{"title":"The Truth About The Hollywood Dream Machine","rating":10,"date":"28 April 1999","review":"Come next year, when I am trying to devise a list of the best films of the 90's, Robert Altman's \"The Player\" will be near the top of my list. This film skillfully creates a central plot around Griffin Mill (Tim Robbins) (who hears about 125 movie pitches per day), a studio executive who is being threatened by a writer whose script or idea he likely brushed off. But what is even more brilliant about \"The Player\" is everything going on peripherally to the main plot; all the references to studio techniques of film-making, foreign film movements, homages and Old Hollywood vs. New Hollywood. The film is multi-layered, yet everything that we view falls neatly into the formula which Hollywood film-making survives by. What we see in the duration of \"The Player\" would potentially make a perfect pitch for a movie. This may sound confusing, but watch the entire film, and you will immediately know what I mean.<br><br>The film begins with a stunning homage to Alfred Hitchcock's \"Rope\", an approximately eight minute long take where the camera moves freely around a studio encountering many people in the midst of their everyday routines. For example, we come across a couple discussing how Hollywood film is now much like MTV \"cut, cut, cut\". One of the characters even uses the example of \"Rope\" to illustrate his point. \"Rope\" is approximately a ninety minute film that appears to have been shot all in one take. Of course, it wasn't done in one take, as reels of film at that time were only ten minutes long. If one watches the film very closely, it can be determined where the cuts are made.<br><br>In the duration of the same take, we encounter Griffin Mill conducting business in his office. People walk into his office pitching movie ideas. It is here that we begin to learn about populist Hollywood film-making. Ideas, not stories or scripts are pitched to executives \"in 25 words or less\". Almost always, the ideas thrown out are based on previous films (e.g. \"someone always gets killed at the end of a political thriller\") and even combinations of previous films (e.g. \"It's Pretty Woman meets Out of Africa\"). When we see the usual films that are released into theaters each week, it is not difficult to believe that this is the way in which they are conceived. The usual Hollywood formula entails sex, violence, familiarity and most important of all \"happy endings, a movie always has to have a happy ending\".<br><br>\"The Player\" is filled with loads of Hollywood stars, most of them playing themselves. Jeff Goldblum, Malcolm McDowell, John Cusack, Angelica Huston, and Burt Reynolds to name a few. Many of them are encountered at restaurants during lunch and at night time Hollywood gatherings, where the topic of conversation is always movies. Near the beginning of the film, Griffin suggests that he and his lunch guests talk about something else. \"We're all educated adults\". Of course no one says anything. Their lives are so indoctrinated by Hollywood, they do not know what else to talk about.<br><br>Right from the beginning Griffin receives numerous postcards threatening his life. He begins to suspect a certain writer and goes to his house one night to confront him. The man turns out not to be home, but there is an incredible scene where Griffin talks with the man's girlfriend on the phone while voyeuristically watching her through the window. This is an extraordinary symbolization of the voyeuristic essence that goes along with watching a film, or the notion of scopophilia to be precise. The idea behind the concept of scopophilia is that the cinema constructs the spectator as a subject; the beholder of the gaze, who has an intense desire to look. The cinema places viewers in a voyeuristic position in that the viewer watches the film unseen in a dark room. While Griffin is watching the girl as he speaks with her, it is night time and he remains unseen to her. This scenario metaphorically represents the theater and the film.<br><br>In the duration of Griffin's conversation on the phone, he finds out that the man he is looking for is watching \"The Bicycle Thief\" in an art-house theater in Pasadena. This film in itself represents the first contrast to Hollywood that we see in \"The Player\". Vittorio DeSica's \"The Bicycle Thief\" was part of a movement that lasted from 1942 to 1952 called Italian Neo-Realism\", whose other main exponents were Rossellini and Visconti. Rossellini called neo-realism both a moral and an aesthetic cinema. Neo-realism, to a great extent owes much of its existence to film-makers' displeasure at the restrictions placed on freedom of expression. This film movement is quite different from the modern Hollywood formula of film-making. When Griffin first meets the man he suspects is sending the postcards, he suggests that perhaps they could do a remake of \"The Bicycle Thief\". The man responds with \"yeah sure, you'd probably want to give it a happy ending\".<br><br>Also interesting in \"The Player\" is one of the studio executives suggestions to newspapers as a source for script ideas. This serves to contrast Old Hollywood versus New Hollywood. In the older days of studio film, Warner Brothers (one of the studio's of middle-class America) would produce films with ideas seemingly drawn from real life or from the headlines of major newspapers. This gives us the sense that often Hollywood is stuck for original ideas, so ideas from the past re-circulate themselves.<br><br>I have touched on only a few of the many interesting references that run peripherally to the main plot of \"The Player\". The great thing is that even if you do not catch all the film references that I have been discussing, it is still enjoyable. When I first saw the film, I was really young and did not know much about movies, but yet I enjoyed it thoroughly. Now, it is one of my favorites. I definitely recommend it to anyone who has a keen interest in film.<br><br>**** out of ****","user":"Doc-134","rank":[113,140]}]