[{"title":"A masterpiece in every sense","rating":9,"date":"20 May 2007","review":"I find myself re-reviewing this film here because IMDb dropped my original review for some inexplicable reason. I have seen \"The Elementary School\" a dozen more times since my original notice appeared and my affection for the film has not diminished. On the contrary, it has grown enormously. I find it hard to discuss something I am so passionate about because words fail to convey my enthusiasm and desire for others to experience what I experience when watching it (which is impossible, of course, but I persist, anyway).<br><br>It's not necessary to know that the film is written by and based on the childhood of Zdenek Sverak, a respected Czech writer, comedian, and teacher whose son, Jan Sverak, directed. It's not necessary, but it explains why this film is so incredibly emotional and heart-rending.<br><br>Sverak's script is about storytelling, and how we sometimes embellish for very good reasons. To offer hope, perhaps? A school teacher, Igor Hnizdo, played with impeccable restraint by Jan Triska, takes control of a rowdy class of miniature hooligans (I mean that affectionately) by giving them the respect afforded an adult. In time, the boys develop great fondness for this man and learn a bunch of important lessons along the way. This flippant synopsis barely suggests the dramatic riches to be found in this dazzling piece of cinema. The story is seen through the innocent gaze of a young boy (Václav Jakoubek) who believes he is his dead brother's \"replacement\". A disappointment to his stern father (Sverak himself), the lad eventually discovers a path in life that diverges from his father's ambitions for him, but he finds peace with the Old Man, nevertheless.<br><br>The performances in this film are brilliant because the characters are so vividly painted with Sverak's words. Marek Endal is superb as Rosenheim, the over-sized school bully and delinquent poster boy, who suffers a rude awakening when Igor Hnizdo wakes up to his shifty ways. Rudolf Hrusínský, one of the greatest actors ever born (and who was so fantastic in \"My Sweet Little Village\") is hilarious and pitch perfect as the dottery old Schoolmaster whose public address system is forever on the blink. Vanek, the tragic ice cream man, is played with utter sincerity by Rudolph Hammer, as is the fakir Radzi Tamil (Petr Cepek). Even Jiri Menzel, the director of \"My Sweet Little Village\", cameos as a good-natured gynecologist. All of these colorful, real characters contribute towards an overall feeling that we have been part of a grand, intimate adventure of the heart.<br><br>An extra dimension to the film is its glowing erotic edge, which I will leave to the viewer to discover.<br><br>A rich musical score accompanies the many non-verbal montages and Jan Sverak's striking direction and camera movement keep all elements in a controlled spin. Outdoor location lensing and superb indoor lighting, by FA Brabec, is some of the best you will ever see.<br><br>I certainly love this film, perhaps more than most people, so I urge you to seek it out.","user":"fertilecelluloid","rank":[24,27]},{"title":"A delight","rating":9,"date":"19 December 1999","review":"A delightful little movie that makes you feel good inside after watching it. I saw it the first time at a movie festival in Pisek in what was then Czechoslovakia in the summer of 1991 and when I see it now it's like going back there again.<br><br>Advertised as a movie for children in the newspapers, I beg to differ. Children will enjoy it but it is also suitable for a mature audience.<br><br>Kind of similar to Lasse Hallström's My Life as a Dog.","user":"Mattias","rank":[22,28]},{"title":"Sweet, funny but also dark.","rating":9,"date":"19 August 1999","review":"Igor Hnizdo (Jan Triska) arrives as a new tough teacher to work in the elementary school in a small Czechoslovakian town just after the WWII. The movie reflects many of the dark aspects of the Czechoslovakian history. They're being told with a lot of sense for humour but in fact are not so funny because of the historical facts. Scholars are growing within the time background of the 1945  (end of the war) and 1948 (Communistic overthrown) which makes otherwise sweet and funny movie somehow dark from perspective that you know how bad future lies in front of them.","user":"Jan-94","rank":[16,21]}]