[{"title":"For a B-flick, better than you'd think","rating":7,"date":"12 December 2004","review":"Most of Christopher Lambert's filmography reads like a guide to B-movie hell. I got conned into watching this by a friend years ago, and will be forever grateful. The story is solid, Lambert turns in an almost-acceptable performance, and most of the rest of the cast does well. My favorite thing about the movie is the (by martial arts flick standards) realism. The gaijin does not miraculously learn to swing a sword like a samurai in a matter of weeks, months, or ever. The action sequences are exciting and fairly well-executed (by 1990's b-movie standards, at least), particularly a ninjas vs samuri scene on a Japanese bullet train. Some of the characters have a bit of complexity, there are a few little plot twists, and the character interaction is often believable. They also answer that age-old question \"who'd win a fight between a middle-aged ex-athlete with a few months of kendo training and a ninja who's just lost an arm and leg\"? (Lamberts's character is a former fencer turned businessman, but that bit's cut out of the home video/DVD version, as is the monologue by Kinjo the ninja, which helps to serve---in part, at least, as an explanation as to why this movie, set in Japan, has almost an entirely Chinese cast). If you're in the mood for an fun, entertaining, semi-intelligent B-action flick, I whole-heartedly recommend this one. <br><br>Oddly enough, the writer of \"Pretty Woman\" wrote and directed this flick, which may explain why my wife liked it, too. Of course, the same guy did a flick called \"Cannibal Women in the Avocado Jungle of Death\".","user":"pclem70","rank":[33,36]},{"title":"A ninja movie as it should be","rating":7,"date":"7 October 2008","review":"People should realize there is a difference between ninja movies and action movies. They aren't necessarily one and the same. And this, my friends, is a ninja movie. Sure, there are fights and violence to be found, but they don't give a 'Hollywood' feel to it. Especially the train scene comes to mind, where the ninja's decide to kill everybody in order to leave no witnesses. It's calculated, and it gives a sense of murder and terrorism to it instead of action. The victims aren't generic enemies, they're real people. A lot of care is put into the realism. Cops show up after a murder scene to investigate. How often have we seen a ninja movie where ninja's or people are killed, without that ever happening? The whole movie involves ploy and strategy, leading to the fight scenes. Christopher Lambert receives sword training and his enemy is wounded before the final fight, to give Lambert a realistic underdog chance to win. There's nothing 'romantic' about his training like, say, Van Damme in kickboxer. Lambert is scared and clinging to every edge he can find to live, whilst most of the samurai consider him worthless.<br><br>I first went into this movie expecting an action flick, and was disappointed. Then, I watched it again, and realized it was great. The movie deserves credit for staying true to the formula.","user":"bastiaan0740","rank":[10,10]},{"title":"American confrontation...","rating":7,"date":"31 July 2006","review":"Christopher Lambert stars as a businessman who witnesses the slaying of a woman (Joan Chen) who he had just slept with, when the ninja (John Lone) is spotted face and all, the ninja stops at nothing to kill Lambert and it's only a rival ninja clan which teaches Lambert how to defend himself and win in a sword fight, Sean Connery of course is nowhere to be found this time. Lambert has a weird charisma about him, he really isn't that strong of an actor but for some reason he is able to get us to watch him and his screen presence almost always makes his hero generally more interesting than a musclebound action star who projects little sympathy. Lambert comes off rather vulnerable and the villains he's up against are no slouches either. They are ruthless SOBs, for instance they actually slaughter a train of innocent by standers all because they don't want any witnesses. This includes old people, children, mothers you name it they bit the big one. In theaters this was an experience which shocked a lot of us and the crowd I was with, were prepared for brutal action. The Hunted works as a Ninja actioner and is generally better polished than almost anything made in the 80's. It's slick, brutal and overall a fast paced actioner which in the end, is all we ask for.<br><br>* * * out of 4-(Good)","user":"fmarkland32","rank":[13,14]}]