[{"title":"An excellent film that is both interesting and disturbing.","rating":10,"date":"12 August 2000","review":"Every thing about this movie is unique, right down to the 16mm film that they used to shoot it. Even though it was filmed in 1992, it has the look a an early 80's film. I defy you not to think about A Clockwork Orange as you watch it.<br><br>Some people have said that the film glorifies skinheads. I would have to ask those people, WHAT FILM WERE YOU WATCHING? This film presents skinheads and their society and says this is the way it is. It does not glorify, nor does it jump on a soapbox. Not to tip anything off, but by the end of the film I don't think there are going to be too many people saying \"being a skinhead is a wonderful life.\" In fact, I think that is why the film is so good. The subject matter is not black and white, it is very gray. Skinheads exist for a reason, they do things for a reason. The reasons might sound immoral to us, but the world is made up of different types. In fact, most of the movie deals with Hando (Russel Crowe) trying very hard to hold his skinhead bunch together. However, the destructive nature of the characters is  bringing about the destruction of their lifestyle.<br><br>The performances in this film are great. In particular, Daniel Pollock is great as Davey. I was very saddened to hear that he died right after this movie. He is often silent during the film, but his facial expressions are very powerful. For anyone that is interested in examining some of the darker groups that wander around this world, Romper Stomper has a very interesting one for you to look at.","user":"markguszak","rank":[117,132]},{"title":"Definitely Worth Seeing","rating":9,"date":"2 November 2003","review":"Romper Stomper takes great pains for an accurate depiction of the skinhead culture; the dress is perfect (except for the roles of the females of the crew) as well as the music; the overall movie captures the culture very well on those factual bases, and on the artistic fronts and aspects of the film the portrayel is also enjoyable, accurate, and sparks great thought.<br><br>The film demonstrates some very well-done action sequences; the thuggish violence that is seen throughout the film is very well crafted, and done in a manner that I found to be pleasing to anyone who likes realism (nothing cartoonish or over the top -- just shear teeth-clenching violence).<br><br>On top of the action sequences is a relatively intriguing story; however, the plot is  never fully developed and there are certain parts of the story that interest you very much, yet you do not get to find out more. The film is very much worth watching though it has its' flaws. A very good film, overall, that gives you good action and some things for you to think about.<br><br>Mostly this film ought to be lauded for its' graphic depictions and its' attempts at accuracy (which greatly supersede most films). It is a very beautiful demonstration of Australian cinema (and proudly so) that is greatly underrated and underviewed. I advise anyone to watch this film.","user":"jmverville","rank":[65,74]},{"title":"haunting....","rating":10,"date":"17 September 2012","review":"There is so much good stuff going on in this one.<br><br>The look of the film: It's gritty, and while you can tell it was lower-budget, the film reeks of quality in terms of the shots/overall cinematography. 16mm really did nothing but add to the realism of this one.<br><br>The story:It's chock-full of interesting characters. Some good. SOme evil. And some that want to go from one side to the other, but can't.<br><br>The sound: Amazing. The music is powerful. Especially in the final scene where the music will stay with you for long after the credits end.<br><br>The acting: First rate across the board. These people could have been real for all I know.<br><br>This film will divide audiences because of it's subject matter, but it's one of the best, lesser-known, low-budget foreign offerings you're likely to see. The current 6.8 rating is an absolute travesty. I was expecting to see about 7.8, and that's why I decided to write this review.<br><br>This is a disturbing film, and one that I can highly recommend.<br><br>It IS better than American History X.<br><br>86/100<br><br>You Might Like THis if you Liked: American History X(good, but not as good), THe Boys Next Door(perhaps the last time a low-budget, dramatic film disturbed me this much - not as good as this though), American Me(not quite as good as this), Boyz in the Hood(better), Tzameti 13(not as good).","user":"witster18","rank":[14,14]}]