[{"title":"I'm not like everybody else;so I'm not everybody else!","rating":8,"date":"16 June 2002","review":"This movie takes a melodrama plot,gives it a black humor cum non politically correct lines treatment,then pushes it to absolute limits:actually,one thinks of what Etienne Chatiliez could have done after \"la vie est un long fleuve tranquille\",hadn't he taken refuge in harmless comedies.Hélène Vincent's presence (the bourgeois woman in Chatiliez's debut) accentuates this feeling.<br><br>\"Bernie\" came aside as a shock, in the humdrum field of contemporary French cinema.IMHO,it's better than \"pulp fiction\" because the director took a lot more chances than Tarentino:no stars,shoestring budget,and a \"nasty\" spirit everywhere.Bernie ,a thirty years old orphan,leaves the orphanage for \"life outside\".This is the beginning of a wholesale massacre in which nobody will escape.It leaves nobody unscathed:neither Mickey or Donald ,nor the birds or the dogs;neither the rich,nor the poor;neither the parents,nor the children;neither the video stuff clerks,nor the florists;neither the junkies nor the dealers;neither the garbage/rubbish chutes,nor the transformers...<br><br>The last fifteen minutes with the hostage-taking are more conventional,but the director manages to concoct an almost dreamlike conclusion,in direct contrast to the rest of the story.<br><br>A story of paranoia ,a story of madness,of absurd logic,\"Bernie\" is all this and more.Bernie feels the society he discovers is dangerous:THEY come to bring you down,to kill you ,to throw you in the garbage chute;the enemy is definitely the OTHERS,so he launches a pre-emptive strike,by shooting everybody in sight,eating the Tweety Pies,closing the garbage chutes with sticky paper.His dream is to live in a safe world,with the parents he's found again (you should see the parents:the father,Donald ,a tramp,the mother,a prole turned bourgeois ,who called her son Mickey (sic))<br><br>No one will be immune to this aggressive Voltaire's \"Candide\" ,Bernie (aka \"John Fitzgerald\" aka \"Mickey\").","user":"dbdumonteil","rank":[16,21]},{"title":"Albert Dupontel at his best","rating":8,"date":"21 May 2003","review":"Absolutely hilarious, a must see for those who liked \"c'est arrive près de chez vous\" (Man bites dog), even though I still rank it a tone under, Bernie is a very funny, dark and absurd movie just like Albert Dupontel always makes..... Do not rent it if you are easily shocked, because the jokes tend to go quite far...","user":"o_cedar","rank":[9,12]},{"title":"Shovel violence is funny stuff.","rating":7,"date":"6 September 2008","review":"French cinema is a weird thing. And this is a movie that fully gives that weird french vibe that you may or may not be looking for. I search it out like a fox, so I'm glad I got to see Bernie.<br><br>The story of a slightly retarded man, who is now venturing out of the orphanage which he's called home for his entire life. With money he's saved up and a quest to find his parents....he's pretty much on a collision course with disaster. And that's just your impression. Bernie eventually does meet his parents and things quickly get out of control. Seriously out of control.<br><br>Bernie is a bizarre film. It has loads of dark humor, with a really interesting and kinda realistic idea. I know of a couple handicapped guys who've gone out to live on their own. But those dudes weren't as \"out there\" as our pal, Bernie. Wreckless driving, extreme violence are two things Bernie brings to the outside world with him. Which is humorous, but at the same time, questionable. Basic life lessons are to have good morals, and a major one is to be kind. Ya know, violence is a bad thing. I guess he just never learned that. Or I missed something.<br><br>Nevertheless, Bernie is a one-of-a-kind flick that some people have said is even better than Pulp Fiction.....not sure where that relation comes from. Were they made the same year? Anyways, it is a strong film like PFiction, and it's pretty entertaining, but it also feels like it's trying too hard in a way. Also I didn't really care for the characters, even Bernie. I would have loved to actually care for Bernie on an emotional level, but alas, I didn't. But for anyone who enjoys dark comedy, Bernie should be on your to-see list.","user":"ElijahCSkuggs","rank":[5,6]}]