[{"title":"Surprisingly good!","rating":8,"date":"17 August 2006","review":"I liked this film a lot. Juliette Lewis and Austin Pendleton did a very good job in this movie. Also William Hurt acted O.K.. Some movies in this genre are predictable, but this one wasn't. <br><br>The 4th Floor is Josh Klausner's first movie. I must say he did a very good job. The movie is certainly not a masterpiece, but it is very exciting! Pay attention to the last scene of the movie. Some of the music is very good!<br><br>I recommend this movie to everyone!<br><br>I learned a new word in this movie: I'm only going to give the first and last letter, because I don't want to spoil. The word is \"P..S\". People who saw the movie, will know which word it is.","user":"NoName1989","rank":[26,32]},{"title":"Truly scary movie","rating":10,"date":"11 July 2002","review":"I was looking last night in my video shop and found this in the really cheap area and thought hmmm the story line looks ok, straight to video so I thought what the hey i'll get it out and see what it's like.<br><br>I strongly reccomend watching this film alone with the lights out. The film itself is nothing special no big special effects, but I still found it quite scary. The feeling of being alone and lack of privacy and conspiracy all seem like powerful points to this film. A definite Rosemarys Baby comes through with the strange characters all being possible suspects and the building itself almost feeling alive very shining. (Note the lens on the room 4's door).<br><br>The films has it all frights, the bad guy is truly crazy and the twist at the end leaves a nasty taste in your mouth.<br><br>If you have seen all the new releases definitly give this a try. I can't promise high budget but can promise you the creeps","user":"skelly-4","rank":[25,31]},{"title":"There's Hell beneath your feet on the 4th Floor","rating":6,"date":"10 June 2004","review":"Effective and original little thriller set on the island of Manhattan about a young woman terrorized in her rent-controlled apartment by unknown forces that want her out.<br><br>Juliette Lewis, Jane Ehelin, is at her feisty best as the victim of this horror drama who won't let herself be driven out of her apartment as the terror below her that at first is just annoying begins to turn deadly. The movie \"The 4th Floor\" has a lot of false leads as to who the person or persons are that are terrorizing the hell out of Jane. If your very attentive you'll notice something almost at the beginning of the movie, that is repeated in the films final sequence, why all of this is happening to her. <br><br>After her Aunt Cecile was killed from a fall down the stairs of her building it was found out in Aunt Cecile's lease that she put Jaen on it as co-occupant to her apartment. Jane was all set to move in with her boyfriend Greg Harrison, William Hurt, a local TV weatherman in the house that he just bought in the New York city suburb of Westchester County. Jaen instead canceled her plans in order to move into that empty and very affordable apartment in the city. As soon as Jaen moved in things began to happen all originating from the 4th floor, the apartment just underneath her. <br><br>The director and writer of the movie \"The 4th Floor\" leave a lot of red herrings as well as yellow and orange maggots and white and gray mice to what is behind all this and you almost suspect everyone in the movie that Jaen comes in contact with. The ending is quite a surprise because even when it comes it still may keep you hanging as to what was the reason for tormenting Jaen and driving her almost mad and out of her brownstone apartment. The very last scene in the movie really explains it all. <br><br>Besides Juliette Lewis William Hurt is very good in an unusually small but important role so are Shelley Duvall, Martha Stewart, no not the Martha Stewart in the news. There's also Austin Pendleton, Mr. Collins, as Jaen's neighbors and a very good performance by Tobin Bell the locksmith and next-door neighbor of Jean who knew a lot more to what was happening in Jane's building then what he let her on to. <br><br>Tension-pack and really creepy movie that will make your skin crawl as Jaen is slowly constricted by the four walls around her as the terror, that's a lot closer to her then she thinks, closes in on her for the movies surprising as well as really weird and shocking conclusion.\"The 4th Floor\" is a lot better then you would, or I did, expect from many of the negative reviews that it got and is well worth seeing.","user":"sol1218","rank":[21,26]}]