[{"title":"A Woman's Perspective","rating":10,"date":"9 July 2005","review":"This is one of my favorite movies, and the comments of fans on this site notwithstanding, I think it was underrated. From the first time I saw it, it exemplified a personal theory that women (until very recently) rarely see men at their very finest, and that is unfortunately often (obviously not always)in battle. The courage, commitment and humanity that this movie portrays, on both sides of the conflict, moves me to tears every time, and the humanity is key. I don't know enough about the battle to point out any glaring historical inaccuracies, but the acting was exemplary across the board, with Jeff Daniels outstanding. The battle at Little Round Top is one of the finest movie scenes I've witnessed. I particularly like the expressions of respect and awe on the faces of Chamberlin's men when he tells them to \"fix bayonets\". What's striking is that there was no \"good\" choice; there was a clear and compelling objective in a much bigger picture, and this schoolteacher rose to the challenge, and his men went with him. This movie conveys a lot-through the long philosophical discourses and the action-about how people behave when they are inextricably joined with other people, for a cause that they don't fully understand, charged with a responsibility that no individual should bear, and with the desire mainly to return to the way things were before. It conveys a lot about true leadership and sacrifice. It conveys that individual choices and motivations always impact others, sometimes on huge scales. Guys, I don't know if you can convince your wives/girlfriends to cuddle up with this film, but I would make the attempt; there are obviously very ugly things that people did to each other in this and any conflict, but if I ever got a sense of the nobility of men and their push in this world, it was from this film.","user":"Holly26547","rank":[41,43]},{"title":"An amazing battle picture","rating":5,"date":"5 March 2002","review":"A film that runs longer than 'Lawrence of Arabia' and only covers three days of action sounds a long haul but it is not. As someone who is both British and interested rather than an expert on the Civil War I found 'Gettysburg' very satisfying. The prologue makes the objectives of the two armies clear and the 'updates' in the form of dialogue between the commanders mean the viewer doesn't lose sight of the course of events. The battle scenes capture the \"terrible beauty\" of combat, conveying terror, claustrophobia and violence without being too horrific.<br><br>More important, the film makes the most of the remarkably rich characters who took part. My only hope is that Col. Chamberlain was as intelligent, humane and courageous in life as Jeff Daniels's performance. This is just one example, and there are many men one would like to know more about as a result of seeing this.<br><br>The one question I was left with came from Martin Sheen's portrayal of Lee. I know Lee had been unwell before the battle but Martin Sheen seems strangely remote from events, with a glazed look in his eye and high-pitched 'other worldly' voice. Is this fair and accurate? At least Lee has the moral courage to say \"It's all my fault\" when he sees the result of Pickett's Charge. I don't remember Douglas Haig saying that after the first day on the Somme in 1916.","user":"vaughan.birbeck","rank":[19,19]},{"title":"Gets Better Each Time","rating":10,"date":"2 November 2003","review":"Utterly superb dramatization of the turning point battle of the Civil War. A clash so enormous in scale that whoever won, was destined to win the war. Brilliantly directed and screenwritten with top notch moving performances by all. Almost makes you understand why so many people are into those reenactment things. <br><br>I think to fully appreciate the more intelligent war films, you almost have to know the battle in detail going in. The movie uses dialogue to try and explain whats happening, but its extremely hard to conceptualize without the aid of graphics. I'm not saying you won't enjoy this film without a firm grasp of the battle details, only that you will enjoy it much more if you are able to do a little reading beforehand. Either way, see it. I am truly amazed by the depth of feeling all these guys were able to put into this project. Daniels and Berenger, in particular, give Oscar caliber performances. A total home run.","user":"glgioia","rank":[79,87]}]