[{"title":"a TRULY unique film","rating":9,"date":"27 October 2003","review":"BBB is unique amongst unique films. i havent sseen a film that mixes such taboo subjects as rape, incest, and psychological abuse and uplifting mesaages such as love, compassion, and being an individual, and makes such a great film. this film will take you on a rollercoaster of emotions, you will feel uplifted, joyous, and two minutes later disgusted and dirty. while the ending is a bit corny and predictable, the film still leaves you feeling satisfied overall. it is truly hard to convey into words this film, so go see it if you can find a copy, its worth the effort.","user":"jzathajenious","rank":[61,66]},{"title":"Love of life","rating":10,"date":"15 December 2006","review":"I saw this film for the first time years ago, and it never left my mind. I have since seen it many times and for each time i see something new, or something i missed. It's an ongoing story, that changes side by side the changes i go through, while going through life. The film is dark, it's very in your face. Strong images and a deep sadness is present for the most parts of the plot. But it has another more interesting side, and that is the naive and curious mindset of Bubby. how he deals with life, and how i learns and how he imitates life, is a lesson learned for everyone. To me it's all about being able to adjust, to create, even when all you have is shattered. There is a way in every situation. It may not be the common way, it may not be normal, but what ever path you find, is right for you. The people in the film are real, there is no glamour. Yoy believe their story, even if you only get little sneak peaks of how things used to be. I would call it a feel good movie. Some people might say that is a very strange thing to say about Bad boy Bubby. But Bad boy Bubby is a very strange film as well. A 10 it is.","user":"batcheeba","rank":[33,35]},{"title":"Crazy, insane, black, funny, terrifying, weird, SUPERB.","rating":10,"date":"21 February 2001","review":"This film changed my life. No, really. It was a Friday night, and the parents were away. I was on my own in front of the television, and Channel 4 (UK + Irish viewers will know of it) was showing Bad Boy Bubby as part of some cult film season. Well, to cut a long story short, I was glued to the screen for the duration of the film (I drooled and stared at it during the commercial breaks) and when it was over, I realised that the dinner was entirely burnt. Not a particularly relevant story, you may think, but note that the television was IN THE KITCHEN, mere feet from the oven. That's how good this film is. It features possibly the greatest crazy monologue ever committed to celluloid (the pub/microphone scene), two of the most disturbing murders in any movie I've seen (and I've seen thousands), one of the most unsettling relationships I've seen, and an unbelievable central performance. This film is darker than dark, and stranger than Eraserhead. Just as Bubby is on his own throughout the film, so is the viewer. Alone, confused and disturbed beyond words.<br><br>And I've never thought of the Salvation Army in the same way since.<br><br>10/10","user":"mogwai-1","rank":[110,129]}]