[{"title":"One of the finest movies of the decade.","rating":10,"date":"17 July 1999","review":"Gattaca is a brilliant under-rated piece of cinema that the not-too-distant future will, in retrospect, see it as one of the more outstanding movies of the nineties.  It is prolific, stylish, thought-provoking, and one of the few recent science fiction movies that totally foregoes special effects and does it well.<br><br>There is nothing about Gattaca that I didn't like.  It is a subtle piece of art that reminds of the writing of Ray Bradbury.  Technology (the core element of science fiction) is only the backdrop for the story of a man who goes against all odds, including his brother, and overcomes those odds.<br><br>Make sure you watch it more than twice.  There are many subtle details that you'll miss if you don't (ie, Gattaca's doctor asks, \"Have I ever told you about my son?\" not even five minutes into the movie, and childhood Vincent falls down holding a toy rocket...) and it's these small details that create a tapestry of cinematic artistry.<br><br>The soundtrack is phenomenal.  The sets are noir and stylistic, and (thankfully) instead of trying to present a realistic physical future Niccol instead vies for the FEELING of the future:  constrained, restricted, and patterned.<br><br>Watch it before it's cool to have watched it.","user":"johnbee-2","rank":[535,585]},{"title":"Thoughtful Science Fiction","rating":7,"date":"15 February 1999","review":"Gattaca is in many ways the best film I have seen about prejudice. Just as people have been judged for centuries by the color of their skin, Gattaca predicts that in the future there will be a more subtle discrimination. It being a science fiction film helps make it more effective by allowing us to feel the emotions of the characters with little of our own history getting in the way. A haunting musical score goes well with the feeling of the film.<br><br>Ethan Hawke as Vincent does a fine job showing the pain of someone whose life is limited before he even tries. But just as interesting were the supposedly superior characters; Vincent's girlfriend, brother and double who suffer from the lie that genetics can perfectly predict a person's life.<br><br>The film that Gattaca most reminds me of is Blade Runner. They are both about genetic engineering gone very wrong but Gattaca takes a very different approach. The problems are more subtle in Gattaca involving our own desires for success for ourselves and through our children. Amazingly, Gattaca is a good science fiction film with a small budget, few special effects and mostly filmed in existing modern buildings.<br><br>After seeing this film for a second time I liked it even better as the plot seemed more plausible. If you would like to see a sci-fi film that is based on interesting characters and situations and not explosions or special effects, try Gattaca.","user":"BB-15","rank":[361,400]},{"title":"Uses science fiction to explore ideas, and reveal some depths of the human spirit","rating":10,"date":"2 July 2001","review":"\"There is no gene for the human spirit.\" This is the TAG line of the movie Gattaca, a film that searches deep within the heart of man. This is one of Ethan Hawke's strongest performances as a man who refuses to trust the odds, and relies on fate and sheer will to achieve his dreams. He borrows the body of a man without dreams, played by Jude Law in his best performance to date as well. Law simply captures every scene with his sly intelligence and deeply darkened soul. He has no illusions about life, or himself, and he is the perfect counterpoint to Hawke's unrelenting dreamer.<br><br>The performances only enhance, however, a wonderful script by first time writer/director Andrew Niccol. It deals with science fiction and the future in the best way, by exploring ideas. He quickly and easily presents a future not unimaginable, and truly existing in a \"not-too-distant future.\" Genetic engineering is happening today all the time in areas outside the human species, and sometimes within. How long will it take before the gloves are taken off and science truly starts to decide the type of people humanity will become? What issues will be addressed when that time comes? Niccol addresses many of them already, mostly dealing with the discrimination that would probably take place in society. The most subtle and yet important question he asks though is whether a man is truly the sum of his genes, or could his spirit somehow carry him beyond all expectations? Such thoughts are dealt with through intelligent characters given intelligent diolague and placed with intelligent situations. It is interesting how such a thoughtful picture can be at time a real thriller to watch as well.<br><br>Gattaca is one of my favorite movies because it is not afraid to address important issues that are truly current in modern day society, and do it with great thought and heart. It wisely stresses the subtle theological questions of whether man ought to tamper with God's work, and whether the result would be a better society, or a better humanity.","user":"taishi81","rank":[204,234]}]