[{"title":"Revenge-movie with a sinister edge!","rating":9,"date":"6 July 2006","review":"Karen is a normal woman living a normal upper class life with her husband and her two daughters until one day she calls home on her cell phone, and Julie (her 17 year old daughter) answers. Julie is preparing for her sister Megan's 6th birthday at the time of the call, and Karen is still talking to her when someone suddenly breaks into the house and attacks Julie. Trying to get another cell phone in order to call the police for help, Karen rushes home as fast as she can, and is devastated by what has happened. Julie was raped and murdered. After Julie's killer, Robert Doob,a supermarket deliveryman is unfairly released. Karen takes on a somewhat different perspective on life. She devotes her life to hunt down the man who killed her daughter and in order to find him, Karen has to descend into a world she never knew existed. EYE FOR AN EYE is a very dark film about obsession and revenge and the price everybody involved has to pay. It's not the kind of film that tries to deliver a vision of hope, but rather a sinister world of cynicism. The only escape for Karen (and everybody else) seems to be the kind of love Karen shows for her daughter Megan, her husband and her friends.","user":"cal_ripley999","rank":[52,65]},{"title":"Sometimes you just have to do things yourself","rating":8,"date":"29 November 2003","review":"Karen is a mother who has just lost her daughter to a brutal rape by a man, Robert Doob. When the court lacks of evidence that he did it, he goes free. But Karen isn't done with him yet; she will do whatever she can in her power 'til there is justice for her daughter and another victim of his.<br><br>I loved \"Eye for an Eye\", it's a terrific movie that is very well acted. I know it kind of looks like a movie for Lifetime or U.S.A., but nevertheless it's a great movie that should really be given a chance. I cried during this movie, during the scene where Karen is on the phone with her daughter, Julie while she is being raped by Robert. All she can hear is her daughter's screams, cries for help, and her last scream. Nobody on the street will help this poor woman who is screaming for the police to get to her house. I just can't imagine that ever happening, when I saw this movie with my mom, she held me close and started crying as well. Nobody wants that feeling and Sally did a great job on showing the fear in her eyes and the total feeling of no hope or being helpless. <br><br>Yes, it's a little over done and dramatic, but it's very real and I felt that it captured what every person has felt they wanted: justice for victims. How do you live when a person you loved so much is murdered and the person that did it got off because they had bad parents? Or they had a bad incident or just feels insane for a few minutes? How crazy is it? I think that's what got me close to the film, though I have not had a close family member murdered, I think we can understand the pain and confusion these people go through in the movie. I loved Karen's line to Mack \"Do you believe in the death penalty?\", he says \"For that guy, I do\" referring to Robert and Karen looks at him and asks \"Why? Because it's just or you want revenge?\". Despite it being a trick question without a satisfying answer, I think we have all felt that way.<br><br>Keifer Sutherland, man! I love this guy, he is one my favorite actors, because he is a methodist and is not afraid of taking chances. He as Robert Doob, I didn't want to believe it was him because he is so brutally convincing as this vicious and evil character that will brutally rape women and young girls. That scene where he is with Karen's little daughter, Megan, in the playhouse, was so incredibly suspenseful and I couldn't breath. Keifer did do great, just too great that scarred me. Ed Harris did great as well as Mack, Karen's husband. He tries so hard to put the family back together after the shattering aftermath of Julie's death and wishes Karen would come back to herself with Megan.<br><br>\"Eye for an Eye\" is a great movie that should be given a chance. The rape scenes are very disturbing, I warn you. You might need a strong stomach, especially for the scene I described with Karen on the phone with her daughter. The ending is a little short and felt rushed, but I would always recommend this for a watch.<br><br>8/10","user":"Smells_Like_Cheese","rank":[40,54]},{"title":"Make sure you have a Strong Stomach for this rape scene.","rating":7,"date":"1 October 2007","review":"This movie has been reviewed into overkill by many others on this board, so I will spare you another home-viewer's two thumbs down. However I would like to state that I am EXTREMELY surprised that no one has commented about the actual rape scene itself. I can remember watching this as a kid on Lifetime, and years later still remembering that scene to a chilling degree. In most cases for rape scenes, (at least the ones aired on television) they only get from the waist up in the shot. In this particular scene, the camera is aimed straight ahead at the rapist in a sitting position on the floor with the young girl laying out in front of him. Although there is no nudity involved, the scene is VERY graphic in nature. I don't know how in the world they got that girl to play out the scene so well, but I could actually feel her pain, as depicted in her face and screaming from being ripped apart. It was enough make me sick my stomach then as a child, and now as an adult.","user":"dbkari","rank":[41,56]}]