[{"title":"Great","rating":10,"date":"23 February 2020","review":"Very beautiful and cinematic movie with lots of classic scenes.Also extremely sad at times.Absolute 90's classic.","user":"MR_Heraclius","rank":[50,52]},{"title":"Titanic masterpiece: an emotional and visual thrill ride","rating":10,"date":"31 August 2015","review":"Titanic is one of my all time favourite films. I'm a 24 year old guy who has probably not cried in front of anyone since I was a kid, but this movie plays on my emotions more than almost any other. <br><br>We all know the ship will sink (does that even qualify as a spoiler?) but the build-up to this event - the smugness and over- confidence, assurances of it being \"unsinkable\" - tease the audience, almost to the point where you're like 'is it really going to sink?'<br><br>I thought the performances of everyone were magnificent: I cared about the characters and their lives on and beyond the ship. Taking the time to introduce everyone and weave their stories together was masterful, even beyond the main characters, like Fabrizio and Murdoch the First Officer and countless more. It was heartbreaking towards the end when you see the panic gradually set in, and it slowly descends into total chaos. You remember Jack telling Rose all the places he's going to take her to and you imagine their love- filled lives together. The Irish mother telling her children the fairytale, resigned to their fate. The violinists trying to maintain a spirit of composure amidst the carnage. And the music! Wow. I cried for all of this. And especially right at the end when you see the photos of Rose's life, knowing she's fulfilled her promise and survived, living a full life, probably never having met anyone she loved as much as Jack all those years ago.<br><br>Visually pleasing in every way, dramatic, musically astounding, great acting and above all a fantastic story make this an undeniably iconic, enduring film. A romantic-drama unlike any other. It deserves higher than 7.7.","user":"otr91","rank":[68,75]},{"title":"Amazing in 1997, 2005, 2015, 2030, 3010 & forever more a Masterpiece!","rating":10,"date":"20 January 2015","review":"You can watch this movie in 1997, you can watch it again in 2004 or 2009 or you can watch it in 2015 or 2020, and this movie will get you EVERY TIME. Titanic has made itself FOREVER a timeless classic! I just saw it today (2015) and I was crying my eyeballs out JUST like the first time I saw it back in 1998. This is a movie that is SO touching, SO precise in the making of the boat, the acting and the storyline is BRILLIANT! And the preciseness of the ship makes it even more outstanding! <br><br>Kate Winslet and Leonardo Dicaprio definitely created a timeless classic that can be watched time and time again and will never get old. This movie will always continue to be a beautiful, painful &amp; tragic movie. 10/10 stars for this masterpiece!","user":"katherinegranada995","rank":[67,75]}]