[{"title":"\"The whole world's on fire, isn't it?\"","rating":10,"date":"11 February 2008","review":"My all time favorite film. Still gives me chills. It's easily one of the most amazing films I've ever seen and it also features perhaps one of the greatest soundtracks ever. They way, the music hits the scenes is just absolutely astonishing.<br><br>In essence, The Last of the Mohicans is an epic adventure/romance set against the panorama of a frontier wilderness ravaged by the French and Indian War.<br><br>Director Michael Mann brilliantly captures the essence of the era ( 1750's)-the hand-to hand battles, the scalping's, the harsh life in the wilderness, etc. But, I especially love the way that the film depicts the perspectives of each of the groups and the people involved. Whether they are competing for military superiority, referring to the French General Montcalm ( Patrice Chéreau ) and the British Colonel Munro (Maurice Roëves) or the simple existence of peoples in their homeland, the viewer is given a true sense of their mindset in the midst of a great conflict.<br><br>Even the story's main antagonist, Magua (wonderfully portrayed by Wes Studi) draws us in.<br><br>The always amazing Daniel Day-Lewis stars as Hawkeye, rugged frontiersman and adopted son of the Mohicans. Day-Lewis, with flowing mane and heaving pecs, makes a virile but sensitive hero for the screen and Madeline Stowe is Cora Munro, aristocratic daughter of the proud British Colonel Munro. Stowe manages to find in Cora a fiery balance between sensitivity and strength. One can't help but feel fascinated and/ or captivated by her dark eyes and flowing dark hair.<br><br>Generally, the film tells the story of Hawkeye and Cora Munro, two people who meet across cultural and class barriers, and are presented serious new challenges.<br><br>But the film has so more. For example, the contrasts between the two brothers ( Hawkeye and Uncas) and the two sisters ( Cora and Alice). Hawkeye being the more daring and outspoken from the start. He dares to approach the dark haired Cora when he was drawn to her, where as Uncas (Eric Schweig) never openly reveals his attraction to Alice ( Jodhi May). Besides, those short simple looks and glances.<br><br>But then again, do we really need lines? No. Both Schweig and May have very few lines, but it is their eyes, that are saying everything... Case in point, that sequence in the cave, where Uncas pulls Alice back from the falls and holds her.<br><br>All in all, I have to honestly say that the last 40 or 50 minutes or so of this movie, are just completely off the hook. I'd wager it might start along the lines of hearing that huge Huron war party cry as the British Army retreats from Ft. William Henry. This leads to Hawkeye vow to rescue Cora no matter what in the scene that takes place behind the waterfall. This is a scene that has been copied and mimicked by many others ( notably Tom Cruise in M1-2) but the way Day-Lewis delivers the line \"You stay alive, no matter what occurs! I will find you. No matter how long it takes, no matter how far, I will find you\" simply makes you believe him.<br><br>Another amazing sequence would be when our heroes are running up the hill to save Cora, Alice, and the British Maj. Duncan Heyward (Steven Waddington) after they've been captured. For whatever, reason the Directors Expanded DVD emits the haunting Clannad song, \"I Will Find You\". Why this isn't heard during the scene is beyond me.<br><br>I've watched this film way too many times now, but easily it is the last 15 minutes that are the most powerful and emotionally devastating. For instance, just watch the way the sequence of music starts with Duncan shouting \"take her and get out\", you know that something serious is going to happen and Duncan is doomed......<br><br>Or the scene of Uncas's and then Alice's shocking deaths. I've always viewed the later scene as the first time Alice takes control of her own destiny and chooses not to be a victim. She finally snaps out of her shock-induced haze and takes action. Her choice of suicide is made from a place of strength.<br><br>But it is also the more quiet of moments that simply resonate. For instance, when Chingachgook ( Russell Means) speaks about being the Last of his tribe.<br><br>A film that truly resonates. No matter the age or the mood.","user":"shhimundercoverdamnit","rank":[64,68]},{"title":"Absolutely thrilling. One of my most fav...","rating":21,"date":"21 July 2004","review":"The Last Of The Mohicans<br><br>\tThis is turning out to be one of my most favourite romantic epics of all time. I know most people do not see this as romantic as it is a classic battle movie. As a matter of fact, seeing the trailer and the posters left me with the impression that this is indeed a war movie, what with the battle scenes and all; something along the lines of `Braveheart'. But upon seeing the movie, I was awed by the unexpected change in genre. The movie is a masterpiece, and all the actors and actresses certainly do amazing jobs. Daniel Day Lewis is simply amazing as Hawkeye. Though I usually try to read some of the more interesting books based on which movies are made, I haven't read the book in this case. But I sincerely doubt whether the book can be as good. Plus, I am told that the movie and the book have little in common.<br><br>\tMadeline Stowe is stunning as Cora Munro, and Jodhi May was certainly impressive as the frail dependent younger sister. Nathaniel, or Hawkeye', is the adopted son of  Chingachgook, played by Russell Means, whose real and lone son Uncas contributes to the team's claim of being the last of the Mohican clan. The British recruitment of Militia from its colonies during a time of war against France brings about a certain unrest. And it is further deepened by the character of Magua, who is a Huron warrior bent on a personal vendetta against British Colonel Munro, and his family. Magua is bent on the utter destruction of Colonel Munro and his two daughters, hence wiping his seed from the earth'. Chingachgook and his two sons become entwined in between all this. To top that, Nathaniel falls in love with Cora and their love story takes the show from there. It is sensually and emotionally stimulating, and we as the audience feels engulfed in the mastery.<br><br>\tThe love story I liked better was the one played in the background, an story that is absent, yet strongly felt throughout the movie. I am referring to the love story between Eric Schweig's character, Uncas and Alice Munro, played by Jodhi May. It is the subtleness and the overtone-nature of the love that builds in us a sense of involvement. To the best of my memory, they never spoke a word to each other, but the passion is strongly felt. And the climax really takes us to another level of appreciation.<br><br>\tWes Studi is probably the fiercest villain I have seen on screen. His mere presence builds an acute level of intimidation. The character portrayal is flawless, and the casting done is excellent. I do not believe that anybody, anybody at all, could have replaced Wes in this movie. The fierceness, the anger, the viciousness, the the everything required to build up the character He has done all that. Probably his best performance yet.<br><br>\tThe music is sort of unconventional. Usually, the pace of the music is in sync with the pace of the action on screen. But in this case, the same slow music floods the scenes whether the pace on-screen is fast or slow. If I had heard somebody else say that, I certainly would have thought that it would not be effective. But amazingly, this unconventional approach works. And how! The music is probably the most addictive feature about the movie. After the first time I saw it, the music lingered in my mind for a month. All my waking moments, my mind was echoing that brilliant piece of work. I am a very very huge fan of Hans Zimmer, but I doubt if even he could have done a better job.<br><br>\tI have seen the movie eight times to date. And I will definitely see it again. The climactic scene is so moving that I have lost count how many times I've seen that.","user":"lethalweapon","rank":[247,284]},{"title":"Restoration of Dignity to Native Americans, Long Overdue","rating":8,"date":"18 October 2005","review":"James Fenimore Cooper's trusty old nineteenth century novel 'The Last of the Mohicans' has provided a surprisingly sound springboard for a film that tries and succeeds in restoring a profound respect for the Native Americans. Yes, it is a story about the Indians and their culture desecrated by the arrival of European entrepreneurs and colonists all relating to Hawkeye/Nathaniel Poe (Daniel Day-Lewis), who as a child was taken by the Mohawk tribe and raised by wise Chingachgook (Russell Means) with the graceful skills and philosophy of the Native Americans. And it is through his eyes that we are brought into the universe through the eyes of the Indians.<br><br>The story is well known and needn't be elaborated once again. Suffice it say that Hawkeye becomes the scout who leads British family Munro including Colonel (Maurice Roëves) and his daughters Cora (Madeleine Stowe) and Alice (Jodhi May) into upstate New York and along the way find altercations with the French and with the Huron Indians, especially one Magua (Wes Studi) whose loathing for Munro's devastation of his village drives him to vengeance against the entire Munro family. Hawkeye and his ally Uncas (Eric Schweig) protect their lieges while steadfastly holding to the honor of their heritage. And of course during the harrowing events Hawkeye and Cora fall in love and Hawkeye takes great risks against his own life to ultimately defend Cora and her family.<br><br>Yes, there are many battle scenes, great reenactment of the scenery of the novel, and villains in all camps that provide the stormy progress of the novel. But it is in the quiet moments where Chingachgook speaks about the Great Spirit, the sanctity of nature, and his waiting to join the Great Council in the sky as the last of the Mohicans that the film's power is best communicated. The acting is very fine and the cinematography is splendid. This is a film worth seeing, one whose 117 minutes fly by leaving the viewer with a renewed respect for Native American philosophy. Grady Harp","user":"gradyharp","rank":[111,127]}]