[{"title":"Filmmaking at it's Best","rating":20,"date":"20 April 2003","review":"As someone who loves good filmmaking, I rate this film among the best I've ever seen in all areas of the craft. Some of the criticisms of this film are hard to fathom.<br><br>The screenplay has the tight conciseness of a well-honed play (which this essentially was derived from) and doesn't fail to prick at the emotions and the intellect of the viewer. The photography, the casting and the editing all click together quite admirably.<br><br>However, I always marvel at the negative, emotionalized responses to otherwise superb films such as this by those who seem to miss the entire point of a movie like \"Sling Blade\".<br><br>I did not see a political message about abortion, or a justification of murder or even a backhanded putdown of the rural people of Arkansas. (Many of the characters were locals, by the way.) Some viewers are setting themselves up to be against this film since they are wearing their own feelings on their sleeves and fail to see the subtle layers of the story. They are seeing only the reflection of themselves on the surface of the water, rather than the complex world below.<br><br>Theater and film are rooted in images and characterizations designed to help us explore the human condition. It was once said that Tolstoy's voluminous novel \"War and Peace\" could be summed up in a single sentence thereby negating the need to write the book. Art is not a fast explanation, but a captivating and thought-provoking trip that hopefully forces us to think about our own motivations. Taking a one-dimensional view of this film might lead one to believe that Karl Childer's central message is that we should all eat biscuits smeared with mustard.<br><br>\"Sling Blade\" excels at the job of making us examine the terrible choices life gives us by providing a set of characters who interact in a moving, curious and revealing way. It is not reality nor is it political, but a method by which we can look at our own individual realities.<br><br>Others who seemed disenchanted with this film out-of-hand are those who found it \"slow\". Helloooo! This film is SUPPOSED to be slow and agonizingly so. It is carefully walking you to the conclusion, step-by-step, so you can squirm uncomfortably at the overall foreshadowing. It ain't an explosion-a-minute John Woo filmmaking and it certainly isn't light comedy, though it induces a surprising number of smiles.<br><br>This is a film that makes us look at true evil in the form of J.T. Walsh, Dwight Yoakum and Robert Duval's characters and compare it to the pure goodness of the damaged creature portrayed by Billy Bob Thornton, whose own brutalization leads him to seek justice in his own imperfect way.<br><br>To help those out who didn't \"get\" this film, I might recommend that you consider Thornton's character to be an amalgamation of Herman Melville's innocently homicidal protagonist in \"Billy Budd\" and Mary Shelley's sad monster Frankenstein. These characters, like Thornton's Karl Childers, were dramatic vehicles for the purpose of making us think. They did bad things but we were forced to view them compassionately because they reflected our own conflicting traits.<br><br>Don't read things into a film that aren't there, but don't ignore the interesting elements that are. Get those wheels upstairs turning and start enjoying intelligent filmmaking instead of merely seeking an excitement fix!","user":"stepjohn54","rank":[219,235]},{"title":"emotionally shattering","rating":9,"date":"5 February 2000","review":"\"Sling Blade\" is an emotionally exhausting picture which establishes Billy Bob Thornton as one of our very best actors, writers, and directors.  This story of a mentally handicapped man committed to a mental hospital for a childhood double murder, and his attempt to make it in the outside world, avoids the usual stereotypes about the closed-minded townsfolk and their prejudice against someone like Karl Childers, Thornton's character. <br><br>\nIndeed, upon his release Childers is given a mechanic's job and befriends a young boy, his widowed mother, and her gay best friend (played by an unrecognizable John Ritter).  Unfortunately, the mother's drunken, violent boyfriend - Dwight Yoakam in a dark, effective performance - cannot accept Karl getting in the way of his relationship, and Childers must ultimately defend his new \"family\" the only way he knows how.<br><br>The tragedy of \"Sling Blade\" is that Childers is a basically gentle soul whose abusive childhood - his father (Robert Duvall in a cameo) and mother made him live in a shed behind the house - and marginal intelligence have made him unable to function without violence.  More importantly, deep down Childers knows this; he knows he cannot function as a free man, and simply cannot protect the ones he loves without violence.  The result is one of the most sympathetic characters I have ever seen in a movie.  This film is one of the great movies of the decade.  (9/10)","user":"dpenny","rank":[68,72]},{"title":"Absolutely Amazing!","rating":10,"date":"18 April 2005","review":"I can't believe it took me so long to finally see this movie and I must admit I had never seen any work by Billy Bob Thornton. Without a doubt, Sling Blade is one of the finest pieces of work ever put on film. Billy Bob's performance as Karl Childers is absolutely riveting! I found myself completely fascinated by this character. The entire ensemble of characters are superbly cast. The child actor who plays Frank is talented beyond his years. This story unfolds in many layers, with friendship and love woven between bigotry and cruelty. It begins with a somewhat horrible description of the double murder of Karl's mother and her lover, but yet is tastefully done with words, no cheap views of blood and gore. It shows how the lack of parental love and understanding can form an individual, but also how the human heart can still have the capacity to be open, as in the relationship between Karl and Frank. You'll feel completely drawn into this little family with its pain and problems.<br><br>This is a masterpiece of superb acting, writing and directing! If you haven't seen it yet, please don't deny yourself the opportunity of viewing one of the most amazingly touching movies you will ever see. Even in the company of great performances by Tom Hanks and Dustin Hoffman, I think Sling Blade leaves Forrest Gump and Rain Man in the dust!","user":"wdmickel","rank":[147,165]}]