[{"title":"A funny and charming film.","rating":3,"date":"3 March 2001","review":"I just love to read some of the negative comments on a film like this.  This is a movie about a Las Vegas headliner who is called to help deal with unruly kids at a Catholic school. You were expecting maybe Schindler's List? When did it become such a crime just to enjoy a delightful movie packed with talent all geared toward entertainment?<br><br>And what talent.  Whoopi Goldberg, Lauryn Hill, Jennifer Love Hewitt, Kathy Najimy, Maggie Smith, James Coburn, Michael Jeter, and more.  It's adorable and it handily meets its goal of being entertaining.  All I can say is that I pity people who have become so jaded, or are so concerned with being cool, that they can't enjoy such a funny and charming film.","user":"budmassey","rank":[70,81]},{"title":"I love this film!","rating":7,"date":"3 August 2006","review":"As someone who is more into edgy, thriller movies, I would just DIE of embarrassment if anyone I know knew how much I love this film! I don't know why, because it is an eternal cheese-fest, but it is such a feel-good film. I love everything about it from the Whoopi Goldberg and Lauren Hill to the corny storyline. OK, so it's certainly no masterpiece, but it's also no Teenwolf 2 either. I think this is an underrated gem and deserves more than the 4.5 rating it has received. It's worth watching just to hear the amazing voices of some of the individuals involved. I think everyone has a cheesy film they secretly love, and this is definitely mine - just don't tell anyone!!!!","user":"Mis_Behavin","rank":[23,27]},{"title":"Excellent comedy about sticking together","rating":10,"date":"23 November 2005","review":"SISTER ACT 2: BACK IN THE HABIT, in my opinion, is an excellent comedy about sticking together. It really made me feel good and smile, especially when Deloris (Whoopi Goldberg) performed her solo act at the beginning of the movie. Also, the soundtrack is really good, too. The best things about it, in my opinion, are the musical number. My favorite song of the movie would have to be either \"Ain't No Mountain High Enough\" or the St. Francis Academy's rendition of \"Joyful, Joyful.\" In conclusion, if you like Whoopi Goldberg films, I highly recommend this movie. You're in for a good time and lots of laughs, so see this movie today.","user":"Catherine_Grace_Zeh","rank":[25,31]}]