[{"title":"Excellent, underrated, Bates is brilliant","rating":8,"date":"24 March 2005","review":"Somehow this gripping, brilliantly-acted thriller was overlooked and underrated when it was first released in 1995, but it's probably the best movie ever made from a Stephen King story.<br><br>Kathy Bates has never been better. Her acting is so strong, deep, and subtle, it's outrageous that she wasn't even nominated for the Academy Award. I think it's because the film was released early in the year and was out of theatres already when the nominations were made. She's better here than about ten Oscar-winning actors I can think of, put together -- a one-woman textbook of how to act for the screen.<br><br>Bates won an Oscar for MISERY, but she's better here, because the story and the character are more interesting, complex and challenging. With flawless technique, and great depth of feeling, she delivers one of the finest screen performances of the 1990s.<br><br>Okay, the denouement's a bit strained, and there's a sprinkling of stilted, hokey lines (Stephen King was never good at writing believable dialogue, and his addition of forced scatology and cussing doesn't make it any less stilted.) But overall the complicated story, which flashes back and forth over a period of twenty years, is extremely well-told. The constant shifting from past to present is never confusing -- an achievement in itself!<br><br>This film never found its audience, somehow, and even some critics missed how good it was. I notice Maltin's book now raves over the film, giving it 3 1/2 stars, the same rating he gives to THE SILENCE OF THE LAMBS. The violence here is more psychological than bloody, but DOLORES is every bit as good a thriller as LAMBS, and Bates, quite frankly, can act circles around Jodie Foster.","user":"fwmurnau","rank":[92,99]},{"title":"Very successful film","rating":8,"date":"10 November 2004","review":"Kathy Bates made quite an impact, so to speak, on the movie-going public with her bravura performance in another Stephen King adaptation, 'Misery.' But showy (and fun) as that role was, it wasn't really much of an acting part--the real heavy lifting in that film was done by James Caan in his quieter, subtler role as the object of Bates's affection.<br><br>In 'Dolores Claiborne,' Bates finally gets a King role fully worthy of her range and subtlety. She pulls off the age transformations beautifully--I actually wondered at times whether young Dolores or old Dolores was closer to her real age. She still gets to have fun with King's trademark Maine dialect ('Now you listen to me, Mr. Grand High Poobah of Uppah Buttcrack!' is a line that gets me every time), but she never goes too far, and her every gesture tells of her great loves for her daughter and her friend, without ever exaggerating or sentimentalizing them. It's a remarkable performance, and the actress is probably right to remember it as her best role.<br><br>The rest of the film into which the performance fits creaks a bit in places (the final melodramatic scene at the hearing is pretty hokey), and it's complicated somewhat by Jennifer Jason Leigh's performance, which may be *too* good--her Selena comes off as so angry and selfish that we don't particularly *want* her to reconcile with her mother. But overall, the film's an artistic success, done in a classic American style, and using the simple but effective device of changing the color scheme to ease us from the present to the past. <br><br>The supporting cast more than stands up to Bates, too. Judy Parfitt is all too believable as Vera Donovan, especially in her younger incarnation--those of us who grew up in tourist towns are very familiar with this kind of harpy queen who comes to town and sets up shop for good. But the part isn't a simple caricature--those tears of anger and pride that Vera cries for Dolores and her daughter feel very real indeed. Christopher Plummer, with his mushy red nose and schoolteacher's diction, overdoes it a bit, perhaps, but it basically goes with the character he's been given. And David Strathairn's Joe St. George surely deserves a high place in the canon of Stephen King movie villains. Strathairn makes him as bad as can be, and yet there's occasionally a playful touch that *almost* makes us see why Dolores married him in the first place.<br><br>In the end, a rather underrated film, successful on many levels. 8.5. out of 10.","user":"kintopf432","rank":[81,88]},{"title":"What Is Past Is Prologue...","rating":23,"date":"23 May 2004","review":"Few Stephen King works of fiction translate well to the screen. Horror elements are best left described rather than shown - so that the darkest recesses of our own imaginations can fill in the details. The horror visions of others may or may not affect us the same way - more often than not, they fall short of true terror.<br><br>But DOLORES CLAIBORNE is the exception - a masterful condensation of the Stephen King novel of the same name. More compact and deeply psychological than the novel, the film focuses almost exclusively on telling the story (in both present-day AND multiple flashback story lines) of Dolores Claiborne and her daughter, Selena.<br><br>Charged with murdering her wealthy but crippled employer, Dolores (Kathy Bates) is reunited with her estranged daughter, Selena (Jennifer Jason-Leigh). Sullen, brilliant, but deeply disturbed by a past that still obviously haunts her, Selena returns to the lonely and isolated Maine fishing village to help her mother face the legal and familial issues raised by the murder accusation.<br><br>We learn that Dolores had previously been suspected of killing her abusive and alcoholic husband. The same detective who had been unable to press the case 17 years earlier is now assigned to the new investigation. And as his work proceeds, secrets from the past reveal themselves, through brilliant use of flashbacks.<br><br>The acting by all concerned is first rate, with Bates giving probably her finest non-Oscar-nominated performance. Jason-Leigh is spot-on as the psychologically damaged and cynical Selena - more a victim than even she knows. Christopher Plummer is excellent as the detective.<br><br>Taylor Hackford's direction is absolutely brilliant - as is the use of color saturation and creative scene blending and transition to move seamlessly between present and past.<br><br>This is an outstanding film - well worth the Oscar nominations it received (as well as those it did not!). HIghest rating!","user":"GayIthacan","rank":[60,65]}]