[{"title":"Okay, I'll Come Clean...","rating":22,"date":"22 December 1999","review":"I finally gave into my curiosity and rented \"Wing Commander\" last night... and I found myself kinda... you know... liking it.<br><br>It is NOT great cinema or great science fiction -- everyone likes to climb all over this movie for scientific errors and not being close enough to the Wing Commander games.  Well, scientific inaccuracies don't bug me (I'm an English major!), and I never played the Wing Commander game.  Maybe that's the secret to enjoying this movie -- if you take it completely on its (meager) merits, it's not all that bad.  It's nowhere near as good as classics like \"Star Wars\" or even somewhat similar films like \"The Last Starfighter\" or \"Starship Troopers,\" but it entertained me.  I dunno, sometimes you don't need your horizons challenged, you just want to sit back and watch aliens get blow'd up real good, you know?<br><br>I consider this a guilty pleasure.","user":"Shield-3","rank":[55,69]},{"title":"A fun ride, not a serious one. A must for all fans of the game.","rating":7,"date":"14 March 2004","review":"The film has been critically panned and it bombed at the cinemas. But it's actually a pretty good film. Yes it isn't technically the best, nor is it scientifically plausible. And for devotees of the games it kinda screws with history, but for all that it is a good ride. You watch it and appreciate it. Saffron Burrows is great. David Warner and David Suchet excel in their (small) roles. It's a shame John Rhys-Davis and Mark Hamill don't reprise their roles, but their replacements do well enough.<br><br>You get caught up in the story, and the visual effects are fantastic, aided by good acting with the actors working well together.<br><br>So overall I would recommend this film. Don't expect it to be fantastic, but just enjoy it. It's a fun film and a worthy addition to Wing Commander lore.","user":"morbelle","rank":[35,45]},{"title":"Not The Best But Its Definetly Not Boring","rating":8,"date":"29 July 1999","review":"People are way too hard on this movie.  The acting is better than average and action is awesome.  This alone makes up for the weak plot and so so special effects.  And it moves at  such a pace that it is impossible to be bored unlike Star Wars Episode 1 where I sat through that entire pod race scene wondering when it was going to end.  I'm not saying that this is better than Star Wars but I could watch this movie over and over which is something I couldn't say for Star Wars.  (***/****)","user":"schrimp","rank":[31,40]}]