[{"title":"It beats Murphy's Law!","rating":8,"date":"20 September 2007","review":"Here's a martial art film I say is a real keeper. \"Martial Law\" is fine, fast, and running and it's full of great action. Chad McQueen(Steve's son) plays a cop who teams with Cynthia Rothrock who also can kick some serious butt. I like it when she does that over the head kick that's really stealthy. David Carradine plays the sinister crime boss, Dalton Rhodes. It was amazing when he does that lethal palm strike to the heart of that huge guy. When done right, it can kill. Unfortunately, Sean's brother Micheal(Andy McCutcheon) fell the powerful impact of it when he was working for Rhodes. I liked the scene where Sean(McQueen) and Billie(Rothrock) took on the thugs, and Billie does the split and did some repeated groin punches on one the thugs. That's enough to make Johnny Cage jealous! I also like the confrontation fight between Sean and Dalton. It was great to see Dalton get a taste of his own blow. That blow is only good for defense, not for fun among friends. This movie is a lot of fun, and it's a keeper in my book! 3 out of 5 stars!","user":"GOWBTW","rank":[7,9]},{"title":"Passes the time","rating":6,"date":"26 March 2006","review":"The plot is unsurprising, just a framework to hang on martial arts action. There is some emoting but it doesn't get in front of the action. Chad McQueen as the lead was bland and the great Cynthia Rothrock has a thankless role in support. David Carradine is an under rated actor and unfortunately played in a lot of films like this, roles he could sleep walk through. The film does have Philip Tan (with great London accent) as chief henchman though to add some spirit.<br><br>The fight scenes are OK. It is always pleasant to see La Rothrock kick some butt and she has a fierce fight with Tan near the end of the film that completely overshadows the simultaneous fight (they are all at an airfield, you know, one of those that never have any staff to see lots of men mown down by gunfire and call the police) between Carradine and McQueen. With a bit of imagination low budget martial art films can be really good. This is not one of them.","user":"hengir","rank":[3,3]},{"title":"Martial Thespianism","rating":9,"date":"9 February 2002","review":"Chad McQueen is perhaps one of Hollywood's most underappreciated actors. While his performance in Martial Law is not his best, it is one of the most tender, in that he plays  a street-hardened cop torn by the death of his brother. McQueen brings together  a fine blend of toe-jamming action and heart-wrenching drama. His sexy co-star Cynthia Rothrock, also comes from the \"west coast\" drama scene. An accomplished actress through out college and beyond, she lends her acting talents to this fine film. If you've never seen her in the off-Broadway production of \"Hair\" you haven't lived yet. This movie is a powerful blend of action and drama.","user":"Dragofan","rank":[3,4]}]