[{"title":"A Classic Thriller","rating":10,"date":"12 December 2008","review":"I have to say I didn't expect this. I didn't have great expectations when I saw this. Especially considering the cold reception given to it by critics and audiences alike. But it is one of the most original Hollywood thrillers ever.<br><br>The story is about an investment banker named Nicholas Van Orton(Michael Douglas in one of his best roles) who is greedy and self centred and who lives alone in his huge mansion. His brother(Sean Penn) gives him a card telling him to contact the company and it is his birthday present to him. What follows is absolute edge of the seat stuff and it shows David fincher at a time when he made some of the finest movies ever seen in Hollywood. In the midst of all this, he meets a waitress named Christine. Revealing more might spoil the movie for you as it is a fun roller-coaster ride with many twists and turns.<br><br>What impressed me about this movie was the atmosphere throughout the movie. It is classic David fincher with the dark tone and great background music. The camera work is excellent especially in the scene where his father falls down to his death. These scenes also show another side to Nicholas van orton and indicate why he became the way he is. He starts out as a one dimensional guy but then when faced with crisis he shows so many sides. I feel the game is more a character study because it shows the myriad changes in his behaviour throughout the movie. Rather than depending on gimmicky twists and quick editing(which is the popular way of making movies today), The Game depends solely on atmosphere and the strength of its performances. Deborah Kara Unger gives a great performance as a character with shades of grey. She is the perfect person for this character with her mysterious look. Sean penn as usual gives a great performance but unfortunately he doesn't have much screen time.<br><br>Another aspect of the movie is the dark humor. Michael Douglas gives certain comments with a deadpan delivery that makes it even more humorous. In many ways the Game can be described as a satire on society and how people forget the most important things in life when pursuing success. It is interesting how facing a crisis brings out the most basic emotions in people and how it changes people is the basic theme of this movie. We experience the same emotions as Nicholas and thus it becomes a ride where we don't know the truth till the last moment.<br><br>I had tears in my eyes at the end and the credit should go to the direction and the music. The slow motion sequence at the end is also well done and this has got to be one of the best endings of all time.<br><br>10/10","user":"Lucabrasisleeps","rank":[140,166]},{"title":"Glad he's not my Brother","rating":8,"date":"7 March 2004","review":"What an amazing thriller, it's totally original, i've never seen anything like it before. The casting of Michael Douglas and Sean Penn was inspired and the story is compelling to say the least.<br><br>Nicholas Van Orton (Douglas) receives a strange birthday gift from his brother Conrad (Penn) A game, that's the gift, a game that plunges him into a living nightmare; a conspiracy (or so it appears) Life or death, true or false; The Game poses many questions and is steeped in mystery and tension from the moment it begins.<br><br>All the questions do get answered by the end, and the surprise ending caps off this thriller excellently.<br><br>Terrific entertainment 8/10","user":"mjw2305","rank":[55,63]},{"title":"An intelligent tale from start to finish.","rating":9,"date":"5 March 2001","review":"Let me just tell you that, as a middle aged film buff, I have seen my share of flicks, good and bad. Very few rate as high as \"The Game\" in entertainment value. \"The Game\" is most definitely one of the \"most fun\" movies to hit the silver screen in a long time. Filled with plot twists and turns, this film takes the movie-goer on a psychological roller coaster ride from the tile screens to the final credit roll.<br><br>\"The Game\" is truly an intelligent tale, sort of a brain teaser that you get to watch and listen to, with a time limit. You have just 128 minutes to solve this, and chances are, like me, you'll be hanging on the solution to this puzzle until the very end.<br><br>The script was well written by a writer who clearly understands the needs of an adult audience. Yes, we like our fun but we like to exercise our brains once in a while also. And let there be no mistake about the great performances offered here by Michael Douglas and his co-stars. I was engrossed by all and couldn't take my eyes of the screen.<br><br>There is plenty for everybody here. Fun for all. A big winner in my book and definitely on my list of all time favorites. Get it and enjoy the ride!","user":"The Record Guy","rank":[321,400]}]