[{"title":"the third installment was still pretty good","rating":5,"date":"19 May 2013","review":"The effects were still great, the acting worked, and I liked the characters... but it was missing something.I don't know what but it was. I still recommend it of course and I decently enjoyed it. Critters 3 was not as much horror and more funny but it still worked. The critter effects have slightly changed but still basically the same. The critters are now more slimy and darker in color. It was great to see Charlie return again Leonardo DiCaprio did a great job in his role as Josh. Having a critter main protagonist was interesting and fun, and I liked the development in the other critter's characters also. It was very slightly off beat but fun to watch and entertaining. To sum it all up it was not as good as #2 but stayed true to the original.","user":"kandrakole","rank":[6,6]},{"title":"Very cheap  but some trashy fun to be had","rating":29,"date":"29 July 2002","review":"A young family stop off at a lay-by on their way home.  At the lay-by they meet bounty hunter Charlie who warns them about something living in the woods.  However that `something' has just attached it self under their mobile home and hitches a ride back to their tenement block where the critters cause havoc amongst the residents.<br><br>Lets be honest  no one say to be shocked to discover this is a cheap little film that doesn't have too much going for it.  The plot is the usual  people hunted by critters  stuff, this time in a building so it's like Die Hard with aliens.err no!  The story doesn't matter as the action is what counts.<br><br>Sadly the action is poor  it's not really gory and the critter attacks are always more funny than thrilling.  There is no real excitement or tension and it's all a bit predictable  take a guess who'll live and who'll die  the cute kids or the evil landlord?  See!  The one thing it does have though is a sort of humour  the critters have senses of humours and are cruel and some of this is amusing.<br><br>However the comedy is nowhere near the one it aspires to  Gremlins, and really the funniest bit is how silly the whole thing is. Needless to say the acting is poor  some people can't even be mauled convincingly.  But it's interesting to see DiCaprio's debut, even if he looks about 9 years old!<br><br>Really this is a bit of dumb fun that is daft and slightly shoddy.  It's may just pass the time but there are much better horror/comedies out there if you want them.","user":"bob the moo","rank":[11,13]},{"title":"Little sharp-teethed stand up comedians","rating":4,"date":"22 November 2011","review":"The DVD-cover suggests that - following two episodes set in the remote Kansas countryside area - the Krites will now be spreading fear and terror in the big city, but the truth is they never get any further than running amok in a ramshackle old apartment building and frightening a handful of its tenants. Part three in the series is an okay time-waster, but very forgettable and obviously lacking the joyous and charming spirit of the first two films. It sometimes seems that, with entering the 1990's, it suddenly became impossible to make cheesy &amp; light-headed horror like they did in the 1980's. Oh well, at least number three is still a dozen times better than the truly awful fourth installment, which was shot back-to-back with this one and takes place in outer space. \"Critters 3\" particularly marks the further and irreversible descent of the franchise into comical territory. Mainly due to the eccentric design of the monsters – courtesy of the amazing Chiodo Brothers – the series bathes in a light-headed and silly atmosphere, but the two previous films nevertheless found a better balance between the comedy aspects and genuine horror. Here, the little supposedly ravenous and evil creatures almost look like tiny stand up comedians. They giggle non-stop, eat beans and fart, watching cooking programs on TV and entertain themselves with food fights. Meanwhile, a bizarre posse of low-keyed tenants (among them THE Leonardo DiCaprio in his very first long-feature film) attempt to escape the Critter-terror through fleeing to the roof. Why they just don't go out via the front door, I don't know Don Opper reprises his role as bounty hunter Charlie, and he seems to get more imbecilic with every episode. I don't really feel like mocking DiCaprio's appearance because, in all honesty, he gives a good performance and depicts a likable teenage character.","user":"Coventry","rank":[7,8]}]