[{"title":"a masterpiece, plain and simple","rating":10,"date":"29 December 1999","review":"I'm 25 years old.  I have no children.  So why am I praising a 'kid's movie' which nobody saw?  Because I have never seen a film pack the emotional wallop 'The Iron Giant' provided.<br><br>The film's plot is similar to 'E.T.' - a young boy meets an alien robot from outer space, who is stranded on earth, and runs afoul of paranoid government agents.  Not to knock the Spielberg film, but what makes 'The Iron Giant' the better film is that the young boy is the teacher.  It is he who has to teach the Giant about the beauty of life, the difference between good and evil, and choices we have to make.  The Iron Giant, it turns out, is a weapon, who has to struggle against his own nature.  The film has an obvious (and timely) gun control message, but its real message is about the choice we make when dealing with other people.  We can use our powers for good or lash out at everyone around us.<br><br>I dare not give away the climax.  All I will say is that it features a sacrifice absolutely breaktaking and emotionally shattering (albeit somewhat blunted by the ending).  The animation is gorgeous, Michael Kamen's score is perfect, and the film beautifully evokes the 1950s.<br><br>Sadly, poor marketing kept audiences away in droves.  All I can say is, to heck with the box office gross.  Despite Warner's appearant desire to pretend the film never existed, the word is getting around about what a magical film this is, and I have no doubt it will join 'It's a Wonderful Life' as a film which bombed in theatres but became a classic over the years.  See it now, so you can say you discovered it before everyone else did.","user":"dpenny","rank":[323,357]},{"title":"A delightful surprise","rating":11,"date":"11 August 1999","review":"\"The Iron Giant\" is the kind of animated film you wish there was more of. It respects the audience's intelligence, it has genuine emotion without resorting to schmaltz, and best of all it balances fantasy (well, science fiction) with believability.  I think Warner Brothers animation has out-Disneyed Disney by adding thoughtful writing to clean, understated animation.  What a concept!<br><br>The story is deceptively simple: Iron Giant falls from the sky at the dawn of the Space Race and befriends a young boy.  But within that framework we get a double story, one for the grown ups and one for the kids, but the message is essentially the same one: paranoia and violence begets violence. I appreciate very much, as others who have commented, that no one burst into incongruous song and that there were no cutesy animal sidekicks.  I should add that there were no clever yet implausible plot twists, nor were there any stock characters.  The bad guy gets a little overheated, true, but he is never the embodiment of all things evil.  The townspeople are your average small town Americans, not bumpkins.  Mom is, well, mom-ish, caring but neither shrewish nor prone to whimpering outbursts.  And our hero is plucky but not annoyingly precocious.<br><br>A BIG plus for this film is how well it weds the computer animation to the hand-drawn animation, a feat that the Big Mouse hasn't mastered yet.  Even as recently as \"Tarzan\" it is glaringly apparent what parts are computer graphics and which aren't, and the contrast is very distracting. \"The Iron Giant\" makes a virtue of streamlined animation that draws your eye to the beauty of its color and motion.<br><br>It was a very VERY distinct and unusual pleasure to be treated to a film such as this.  Give us more . . . please!","user":"Gouda-3","rank":[144,159]},{"title":"The Best of Two Worlds: Adult and Kid","rating":10,"date":"9 August 1999","review":"All too often, \"family films\" are only infantile, simplistic formulas with a few self-referential and pop-culture jokes thrown in to try and keep adults awake.  But then along comes  something like \"The Iron Giant\", which is sophisticated enough to demand respect while maintaining a mythic and pure-hearted tone that actually does appeal to the kid in everybody.<br><br>\"The Iron Giant\" is refreshingly non-Disney in no end of ways.  Characters seem real and chosen to fit the story, instead of being a superficial reshuffling of an old formula.  The animation definitely has its eye-popping moments, but there are also scenes of great wonderment, pathos, and humour that only top-drawer animation can convey.  The Giant itself is a great character, who only becomes MORE interesting as the film continues (another huge break from Disney).  No scene is wasted in this film, either; every set piece, even the really funny ones, helps either to establish the \"world\" of the movie, or to advance the plot.  At no time do you feel that you are merely waiting for the story to crank up again.<br><br>\"The Iron Giant\" is funny, exhilarating, and touching as well.  It's sad to see it failing at the box office, as a blunt reminder that the success of films is often in direct proportion to their publicity budget.  Hopefully, though, word-of-mouth will come to its rescue.  Go see it!  Tell your friends!  Then go again!  (Repeat as necessary.)<br><br>P.S.  I find myself comparing the Iron Giant character to Martin Donovan's character in \"Amateur\".  If there is anyone else on earth who has seen both films you may wish to entertain the notion yourself.","user":"Figaro-6","rank":[160,179]}]