[{"title":"A great romance.","rating":8,"date":"28 June 1999","review":"Why this film wasn't in wide release is beyond me.  It had a great cast and a great story and even the trailer for it was funny.  And plus, can't Sean Connery sell a movie all by himself?  This is a true hidden gem of a film and it is one that really should be seen by everyone.<br><br>I won't really get into the details of the film too much because seeing what this film is all about is one of the joys of it.  You watch it and you know there is more to it than the screen play lets on about and it is fun trying to piece clues together to understand what is going on.  It is a mystery in some ways and isn't that what the movie claims to be?  A mystery about love. And as they allude to, love is a mytery anyway.<br><br>My fave characters are Gillian Anderson's and Jon Stewarts.  Their story hits all the right notes and it is easy to relate to them.  They are both cautious people when delving into love.  Both have been hurt but one of them is just a little more relaxed and willing to learn about love again.  And there is one scene where Gillian jumps all over Stewart about some silly issue and this is the area where most movies go the traditional route and they break up, get back together and live happily ever after.  It is a typical concept and it has been done to death.  But in this movie it takes a fresh approach to solving problems and that is it's strength.<br><br>This is a great romance and it is also wickedly funny.  And the way everything is summed up at the end is not only perfect but it is heart warming and it leaves you feeling glad to be in love, or at least willing to fall again.","user":"baumer","rank":[55,63]},{"title":"A very enjoyable surprise","rating":7,"date":"13 February 2003","review":"When I checked this one out on IMDb before watching it I was firstly surprised by the cast: how do you get all those well-known actors in a film which seemed very unprepossessing and might be considered a `sleeper', made by a practically unknown director? Apart from a couple of films in the late 80s and a number of films for video with perfectly unappetising titles, Willard Carroll did not seem to be a promise living up to the great cast he assembled for this film.<br><br>How wrong can you be! An excellent drama with real life issues is presented in a more live theatre style than the heart-tugging overplayed resources of more banal cinema productions. I mean, what bad luck that such a pretentious over-hyped `American Beauty' (qv) for instance, receives an avalanche of undeserved accolades, while this little gem just passes by, relatively unknown. In `Playing by Heart' you have a natural well played-out series of events without any of the overladen bombastics so frequent in American cinema. Excellent interpretations here  among the best I have seen of Sean Connery, and Gena Rowlands is his perfect counterpart. Full marks for interpretation to Gillian Anderson, Jay Mohr, Dennis Quaid, Ellyn Burstyn just wonderful, as is Madeleine Stowe, and Ryan Phillipe; and it is the first film in which Angelina Jolie is not appearing only to show off her indisputable charms, as she is wont, but to play her first really convincing rôle without flashing unnecessarily her anatomy all over the place.<br><br>So, evidently, full marks to Willard for piecing together all these elements to bring out what is indeed a very enjoyable surprise. Most certainly a film to see again. My only quibble is that perhaps the last ten minutes or so did not quite live up to expectations: however I would not say that this factor spoils any of the impressions made during the rest of the film.<br><br>My vote is a little higher than the IMDb User Rating.","user":"khatcher-2","rank":[49,57]},{"title":"Short stories","rating":7,"date":"4 October 2005","review":"Writer/director Willard Carroll, the director of \"Playing by Heart\", has constructed a multi storied film where different narratives are seen completely without any idea how they are connected until the end. This device has been employed by other directors, notably, Robert Altman. Whereas Mr. Altman interconnects his scenes differently, Mr. Carroll, keeps the stories separate, only to have them come together at the end.<br><br>The director was exceptionally lucky in amassing this talented cast to appear in his film. Viewers of all ages will identify with the different stories since they resonate with different age groups. Most comments submitted to IMDb seem to be from young viewers who think the best thing in the movie are Joan and Keenan. While this couple do a good job, there are other good moments involving some of the other couples we see in the film.<br><br>Sean Connery and Gena Rowlands make an excellent couple. Angelina Jolie and Ryan Phillippe do also good work in the film. But Madeleine Stowe and Gillian Anderson have more interesting characters. Same could be said about Dennis Quaid, who makes a mark as Hugh, the tormented man who discovers his wife's infidelity. Anthony Edwards, Ellen Burstyn, Jay Mohr, and a surprising Jon Stewart are among the actors seen in minor roles.<br><br>The film will delight audiences because the film catches one's imagination from the beginning.","user":"jotix100","rank":[27,30]}]