[{"title":"b+","rating":8,"date":"27 April 2006","review":"If a film looks like a B movie and smells like a B movie then in my opinion it usually is a B movie but this film while definitely not an A movie it isn't far off being one. Ben Jordan(Rutger Hauer) is found guilty of stabbing his pregnant wife and spends 15 years in jail. The film begins when he is released from jail ,moves to a small town to start again and is assigned a social worker Laura Matthews (Natsha Richardson).the two form an unlikely friendship and become lovers.While everyone,including the towns chief of police, think he was guilty,Laura has her doubts and after a spot of investigation comes to the conclusion that he is actually innocent. Now we have probably sen this done before and no doubt better but the chemistry of the two main stars carries the film along nicely and the final scenes of the film are very gripping,almost edge of the seat stuff. After the \"The hitcher\" and \"Blade runner\" i would have liked Rutger Hauer to have been a bigger star in Hollywood but his career like that of Lou Diamond Philips,another actor I think should be a bigger star,seems to have been relegated to straight to video movies.. Natasha Richardson is a very pretty English actress that hasn't really been a movie trailblazer but she handles her role,including a quite steamy sex scene,very well and as I said her on screen chemistry with Rutger Hauer carries the film along nicely. Don't watch this film and expect any Oscar winning performances but if you want a neat compact thriller then with this film you can't go far wrong.<br><br>Past Midnight i give a very commendable 8/10","user":"kirk_bones","rank":[13,16]},{"title":"A Better Grade of B Movie","rating":5,"date":"5 January 2003","review":"Whilst this film is not going to re-invent the Suspense/Thriller genre it views as one that could have been an A movie with a little more money and a bit of promotion. Certainly not with a change of cast. The twists, the developing romantic theme, all make this worth your viewing time. Rutger Hauer has his own unique brand of acting and Natasha Richardson can not only act but is rather cute.","user":"chrisCW","rank":[20,32]},{"title":"Nicely done","rating":9,"date":"3 December 2016","review":"I am a Rutger Hauer fan, so when I saw this movie on Netflix, I had it delivered. I was very pleased with the movie. Rutger Hauer delivers a great performance, as usual.<br><br>I do not usually care too much for love scenes. But, the few they had in this movie were great. I chalk that up to the fact that they involved Rutger Hauer.<br><br>I had figured out the killer early on but didn't know what the motive was. The motive took me by surprise. Even though I was sure of who the killer was, the movie was able to keep me in suspense and had me wondering if I was right.<br><br>I thought that the story line was good. There were just the right number of twists and turns. I was very interested in the characters and what was happening with them.<br><br>I was pleasantly surprised to find out that a lot of the writing was done by Quentin Tarantino. It isn't like Kill Bill or any of the others that have massive violence and blood. I am not a fan of Kill Bill, so the fact that this was very different than that was a bonus.<br><br>I was getting worried near the end of the movie that it might not end correctly. I am very particular about movie story lines and endings. Most of the time I am not a fan of unhappy endings, not am I a fan of movies that leave you hanging with a bunch of unanswered questions. This wrapped everything up pretty neatly.<br><br>I do not know why so many people gave this movie such low ratings. I think that it is very well done and most definitely worth watching.","user":"gjenevieve","rank":[4,5]}]