[{"title":"deeply unpleasant movie with a star performance","rating":19,"date":"19 May 2004","review":"'Bad Lieutenant' is not an easy film to watch.  The lead character on the surface has no redeeming virtues - he's corrupt, he's sexually and morally deviant, he is really and truly on the slide.  A nun's rape is supposed to awaken his conscience in some way and affect him so deeply that he almost gets to be a decent citizen, but for the bleak and empty ending. <br><br>\nAll this would be so much hogwash if it wasn't for the stunning lead performance of Harvey Keitel, certainly taking his acting talent right to the edge to give us a nothing-held-back portrait of his character.  There are several scenes of great power (and one or two which are deeply repellent); certainly this isn't a film you can easily forget when you've seen it.","user":"didi-5","rank":[66,78]},{"title":"Rough content, but beautifully bleak and harrowing","rating":9,"date":"26 April 2005","review":"People are probably right enough when they comment that this entire film essentially hinges on Harvey Kietel's impassioned performance as the corrupt and deeply troubled lieutenant of the title. Which shouldn't necessarily be taken as a shortcoming - an engrossing lead is the one key thing that any one-man character study like this needs in order to flourish, after all. Whether sobbing, howling or clenching his jaws in anguish, or else hanging his head and sipping liquor in silence, his acting here is always raw, convincing and utterly compelling; the kind of portrayal you'd be hard-pressed to take your eyes off. The exact identity of his character is never revealed, but the title informs us he's a 'bad lieutenant', a label seemingly confirmed by his tendency to indulge in substance abuse, work up heavy gambling debts and even, on occasion, pull over a couple of young female drivers and use them as motivation for his own self-pleasure. Very lurid, and yet the way that Kietel plays him also makes feel completely human. He conveys such pain and desperation behind his each and every immoral action that they never come across as nearly as shocking or vulgar to watch as they are harrowing. It's this alone that enables 'Bad Lieutenant' as a whole to reach the true extent of its potential - what could easily be read off as a plethora of fury, drug-taking, masturbation and full-frontal nudity in practice translates very aptly into a sad and striking depiction of a despondent man who's lost his ability to see goodness in anything in life, and who's sinking ever deeper beneath the weight of all those answers being continuously sought in the wrong places. As you've probably worked out by now, this isn't exactly the balmiest movie you could spending your time with (might be wrong, but I don't think there's a single light-hearted moment to be found in the entire screenplay), but if you can bring yourself to look past the sourness on the surface and instead feel sympathy for this bad lieutenant, as Kietel's involving performance invites us to do, then you'll find some considerable power lurking in its bleakness.<br><br>So, while it's Harvey Kietel who really (and rightly) brings things together in 'Bad Lieutenant' and makes it the affecting near-masterpiece that it is, it would be unfair of me to completely overlook Ferrara's role in this equation. He's provided the context against which our centrepiece man must function - a world so run-down, sombre and nihilistic that trying to find redemption round here seems not only impossible, but practically pointless. The mood is well-set by the ever-overcast skies; killing, rape and robbery are rampant, and the Lt isn't exactly given a great deal to aspire to in his day-to-day life. Kietel and his character are admittedly the only things here that come off as particularly outstanding - the vast majority of supporting characters are really all just part of this one big daunting backdrop, with dialogue, screen time and development kept to a strict minimum in each case - though personally I look at this as being more of an additional strength than as a weakness. That everyone else around him always seems so distant only increases the overall feelings of detachment and isolation that draw us deeper into the Lt's outlook.<br><br>Christian faith and symbolism are pretty integral to the overall themes of this movie, but even being non-religious myself I find I can still get a good deal of emotional investment in it. It delivers its underlying issues - of non-judgement and the potential for goodness in even the most repellent of sinners - with acute precision, as reflected in the investigation concerning the raping of a young nun which the plot loosely revolves around. While this heinous crime only serves to strengthen the Lt's belief in the general depravity of the world around him, the nun herself has found solace in her refusal to condemn those who wronged her, viewing them instead as victims as their own confusion and despair. There are of course some fairly sharp parallels between this scenario and the Lt's own personal predicament, which any viewer who's really come to feel for him will recognise - as displeasing as some of the things he himself gets up to may be (and the way he incorporates further crime into his efforts to uphold the law), there's that challenge lying at the centre of every scene as to whether or not we're really in any position to pass judgement upon him. All things considered, is it truly a bad lieutenant that he is at heart or just, well, a sad one?<br><br>I don't imagine that everyone will quite take to the conclusion this eventually leads to (and which I'm not going to give away here), but considering just how weighty a lot of the issues it addresses really are, you never get the impression that Ferrara ever intended to come up with a cut-and-dried solution of any sorts. Instead, he and Kietel have put together a polished and powerful piece of film-making that, though it deals with some pretty disagreeable and, at the time at least, controversial subject matter, is so rich in great acting (well, one great performance, but it's easily worth the input of an entire cast) and slick atmospherics that it becomes entirely captivating. In the end, it's the surprising amount of depth and emotional muscle that it carries, and not the notorious reputation that it garnered, that 'Bad Lieutenant' really deserves to be remembered for - and remembered I hope it always will be. Another great in early 90s cinema.<br><br>Grade: A","user":"soymilk","rank":[95,118]},{"title":"I know there is no plot however...........","rating":8,"date":"9 June 2000","review":"All right let's get this out of the way. This is not a great picture. In fact I will bet 98 percent of the public would find it absolutely repulsive. Make that 99 percent. Hell, even I didn't understand it the first time I saw it. But what I realized the second time was brilliant method acting. And that ladies and gents is what makes this film shine. There is no solid plot, no supporting characters, and no reason to feel anything but disgust for Harvey Keitel. However, you find me another actor who could have dug as low as Keitel did or take as many chances and I will bet you that it will take more than the time to cook a frozen cardboard pizza. It is hard to view a soiled life like Keitel was leading without being on the road yourself which wouldn't be pretty. The backdrop of a baseball series and Keitel losing chunks of money made it even crazier. Again I have to say absolutely great acting. Keitel has so many good scenes that this may be a career role for him. I give him a multitude of credit for taking the chance to play a totally unlovable character. Watch this movie at your own risk and know going in that this is an outlier in the sense of normal movie making. Don't bother grabbing a flashlight or even a spotlight and trying to find a plot. There isn't one. Just sit back and watch Keitel spiral down like a squirrel who missed the branch.","user":"Corleone-29","rank":[46,57]}]