[{"title":"A Powerful Film","rating":9,"date":"21 July 2001","review":"This film is truly excellent. Not only does it feature superb location and music, but it is also an unforgettable story. You soon learn to look past the idea of \"animals can't talk\" and see how wonderful it really is, and you don't need to be young to enjoy. So powerful, it will bring you to tears.","user":"LT-10","rank":[19,19]},{"title":"A Film That Will Make an Impression","rating":10,"date":"2 January 2005","review":"For the horse lover, Black Beauty is a tragic tale in which the sensual beauty of horses is artfully depicted. It will pull at your heart strings, make you smile from ear to ear, cry honestly, and desperately want to take a trip to the barn.<br><br>For the music lover, Black Beauty is an emotional ride in which the music all too well toys with the human soul. The music is so delicately composed, performed, and chosen for the movie that it is worth seeing just to enjoy the soundtrack.<br><br>For the critic, Black Beauty is an endearing story laden with green actors and a plot directed toward the youth. The green actors allow the film to be honest and emotional, however. And the youthful plot allow the earnestness and sensuality to create an even greater effect upon audiences of all ages.<br><br>For the average viewer, Black Beauty is a film worth watching. It is a film that will make an impression. It will not go down in the Hollywood hall of fame, nor will it be recollected by high and mighty of movie making. It will, however, stand the test of time as a film loved and cherished by the few who have seen and loved it.","user":"jlyon-3","rank":[32,34]},{"title":"Beautiful, Moving","rating":8,"date":"7 December 2002","review":"Black Beauty is, (at least in my opinion,) one of the most underrated films of all time. It seems to be widely ignored, for the reason that it doesn't seem to be targeted at any specific age group or audience. For the people that pass it by because it seems boring, or another childrens book adaptation, try it, it really is a wonderful picture. Anyone who likes animals, period pieces, or stories of courage and love would especially like it. The costumes, carriages and scenery are beautiful. And the horses! This movie is a horsepersons dream. The scenes featuring the horses were breathtaking...colts racing over green grass, a filly and pony trotting together, their sinewy legs moving together in smooth rhythm, an elegant black stallion rearing up; they were all absolutely beautiful. My favorite scene was the scene in which Beauty is being broken -(being taught to carry a rider). The wonderful line - \"But once I discovered that he and I, that the two of us could become one, this business turned out to be perfectly glorious!\" - the music swells, and the horse takes off, racing across the green, and everything else turns to a blur. (I get goosebumps thinking about it!)Kudos to the voice of Black Beauty - I don't know who it is, but he really made the picture. (And the horse, too - he was wonderful, a gentleman.) All in all, a beautiful, moving picture that no family should be without a copy of.(Some parts are sad.) Seven out of ten stars.","user":"amabiliscasa","rank":[34,37]}]