[{"title":"As Much as I Want to Hate This Film, I Love It","rating":7,"date":"6 February 2007","review":"A shape shifting young man (Brian Krause) and his mother (known as \"sleepwalkers\" for some reason) arrive in a new town. But the mother (Alice Krige) needs to feed, so her son Charles must find him a pure young woman. But who will he love more, his mother or the beautiful Tanya Robertson (Madchen Amick)? \"Sleepwalkers\" is a film that has a special place in my heart. I saw it repeatedly on television as a teenager watching our local horror host, Ned the Dead. And while I never thought it was great, I found it entertaining. I place it in the same category as \"Maximum Overdrive\" -- cheesy and fun, though by no means a great film. And look at the cameos in this film! Mike Mayo tears this film apart, calling it \"arguably King's worst film\". He says the \"script meanders through pointless chitchat scenes.\" Director Mick Garris \"doesn't know how to photograph\" and throws in \"close-ups of knees.\" Wow. He has nothing nice to say about this film, giving it a dismal 0 on his one through four scale. I must beg to differ with Mike on this one.<br><br>First of all, King's worst film is \"Langoliers\". Second, I did not notice these pointless chitchat scenes he speaks of. Some of the plot is a bit loose, but nothing is completely pointless. I furthermore do not recall any shots of knees, though if the knees belonged to the beautiful Madchen Amick I think this is forgivable. Mick Garris has made many a bad film, this is true. And \"Sleepwalkers\" is by no means a masterpiece. But I think to lay down such heavy scorn is misplaced and really ignores the \"fun factor\" of this picture.<br><br>Oddly enough, Howard Maxford, whom I almost never agree with, seems to get this one. He calls the film \"silly but quite lively\" and points out the \"nifty effects\" and \"gag cameos\" (Stephen King, Clive Barker, Joe Dante, Tobe Hooper and John Landis). And there you go -- recognition of the fun this film was and still is.<br><br>Ron Perlman (\"Hellboy\", \"Pro-Life\") plays a cop and doesn't get nearly enough screen time. Not sure what else to say about that. Clearly they did not foresee the star power in Perlman.","user":"gavin6942","rank":[64,83]},{"title":"Here kitty, kitty, kitty","rating":5,"date":"26 April 2005","review":"An incestuous mother and son (Krige, Krause) of preternatural origin move to a small town to find a young female virgin (Amick) the son may take the life force of and feed the mother with. <br><br>It's Stephen King, who wrote the screenplay, at his not bad best. Interesting music; I've never heard Enya in a horror movie before but surprisingly it works. As with Ron Perlman, I'd pretty much sit through anything with Alice Krige in it. <br><br>The down side is that although the mother and son are interesting beings the curiosity about them the movie arouses is not satisfied. What are they? A kind of feline lineage is hinted at as they can morph into variations of cat like creatures yet cats are their mortal enemies (a scratch can be fatal). Where are they from? Egypt is hinted at (the origin of the worship of Bast, perhaps). Why are they called Sleepwalkers (origins of the incubus/succubus/vampire mythologies)? <br><br>Despite the questions raised and unanswered the film is still an enjoyable gore-fest horror break from reality. <br><br>Worth a rent/buy used, especially for fans of Stephen King's work.","user":"ragana","rank":[17,20]},{"title":"The Cat in the Hat Goes Splat","rating":5,"date":"3 April 2008","review":"Director Mick Garris has commented on how \"Sleepwalkers\" was a troubled production, and one only has to watch in disbelief to see what he means. Before its 1992 theatrical release, I remember the film being heavily hyped as Stephen King's first foray into cinema with a completely original screenplay (and as was true with most adaptations of his work--with or without his involvement--at the time, the reviews were less than sympathetic). Ironically, Garris would become better known for helming TV-miniseries versions of some of King's best-known works (\"The Stand\"; \"The Shining\"; \"Desperation\"), directing right from the author's own scripts. Needless to say, these made-for-TV works outshine \"Sleepwalkers,\" which simply further proves that King's writing style (heavy with internal dialogues and detailed, unspoken perceptions) is better suited to a format that can fully develop his themes and characters. This tale of an incestuous mother/son duo who shapeshifts into bloodthirsty felines, roaming from small towns to dine on virgin prey, is fairly decent for the first 50 minutes--King's use of 'local color' (and the resulting humor) is well-rendered, and Garris does a fine job of creating an atmosphere of mystery and intrigue. But just when \"Sleepwalkers\" seems headed for the zone of good (if not truly memorable) King adaptations, its final third devolves into overblown, ridiculous action sequences (as though the producers chopped away 30 pages of King's script for explosions and shootouts) and a queasy imbalance between absurd humor and sentimental melodrama. The end result hobbles the overall experience--had King's ideas been thoroughly fleshed-out, \"Sleepwalkers\" may have been a solid entry in his filmography...but as it stands, it feels like a lament over what could have been. The cats are incredibly cute, though.","user":"Jonny_Numb","rank":[26,33]}]