[{"title":"Jim Carrey is a hero","rating":8,"date":"21 February 2020","review":"This movie was funny! This is not high brow humor but if you are looking for something crazy and funny with immature humor, this is one of the best. This is Jim Carrey at his best...being wild and crazy.","user":"MR_Heraclius","rank":[39,40]},{"title":"Aaaaaaaaaaalriiiiiiiighty Then!!!!!!","rating":10,"date":"20 May 2005","review":"I'm guessing that everybody knows the story of this movie by now, but for those who might not have had the opportunity to see this great movie, it's quite a simple formula. The Miami Dolphins mascot is stolen and by word-of-mouth advertising Ace Ventura (Jim Carrey) is called into manic action. His job is to find the dolphin and return it before The Miami Dolphins' crucial game.<br><br>Jim Carrey is quite simply amazing, I never stopped laughing the whole way through the movie. This is surely Carrey's best work, even now. OK, Dumb and Dumber and The Mask are very funny movies too, but this takes the biscuit. Everything Ace does made me laugh, from whipping football player's with a towel to get a ring imprint to showing up at a mansion party and being his usual manic self.<br><br>100 laughs per hour, if you have a sense of humour, then this movie is for you!!!","user":"davich86","rank":[156,183]},{"title":"\"Take care, now. Bye bye, then.\"","rating":10,"date":"18 December 2007","review":"In 1994, a year that gave us Forrest Gump, Pulp Fiction and The Shawshank Redemption, Morgan Creek Productions and Warner Bros. Pictures came out with the funniest film of the decade, err, 1994, with the Jim Carrey super-vehicle, ACE VENTURA: PET DETECTIVE.<br><br>Right off the bat, it is a Jim Carrey showcase: chasing missing albino pigeons, rescuing a pampered shiatsu, and making high speed getaways, this all works because it is Ace Ventura, a hilarious, live-action cartoon character who spouts one-liners like an M-16.<br><br>The premise of the film is that the Miami Dolphin's team mascot, Snowflake the dolphin, has been captured and needs to be found in time for the Super Bowl. Ace is hired and the sexy Courtney Cox is made his partner until the dolphin is recovered. With an assortment of funny situations like Ace falling into a great white shark tank (!), a montage of Ace searching for a missing jewel, Ace head banging in a CANNIBAL CORPSE concert, it's all gold, and as you have read, Ace is what drives this film into comedy genius! <br><br>It was a busy and successful year for Jim Carrey, as he came out with another pair of comedy blockbusters, the LOOSELY translated Dark Horse comic THE MASK, and his hilarious buddy comedy with Jeff Daniels, DUMB and DUMBER.<br><br>Thanks to Tom Shadyac for letting Carrey out of the bag and letting this damn funny Canadian strut his lanky stuff.<br><br>It has some offensive, adult-oriented material, but if caught on television, this is nearly perfect family entertainment: as long as you don't mind your kids talking from their a$$es for the next couple months.","user":"ElijahCSkuggs","rank":[67,80]}]