[{"title":"This Is Not A \"Friday\" Film","rating":4,"date":"12 August 2007","review":"If longtime fans of the \"Friday the 13th\" saga have anything to say about it, the people behind this film will burn in the same place as its hockey-masked star. \"Jason Goes to Hell: The Final Friday\" is completely preposterous, out of place and an affront to what had been a dependable horror series.<br><br>Admittedly, director and co-writer Adam Marcus deserves credit for his boldness. He seemed inexplicably convinced that the wheel of the \"Friday\" series needed to be drastically reinvented, even though fans had lined up for basically the same plot eight times prior. But the brainwave of having Jason possessing one body after another alters the very fabric of what made these films good. Suddenly it's like we're watching an \"Invasion of the Body Snatchers\" rip-off. Throw in Jason's newfound grunting, a far-too-heavy plot and a magical dagger (!) and you have something completely unworthy of the \"Friday\" moniker.<br><br>\"Jason goes to Hell\" is also incredibly lazy. All \"Friday\" films, by their very nature, require a leap of faith, but this is really too much. Firstly, this marked the first time that no explanation was given for Mr. Voorhees' reemergence. Were we all dreaming when we watched him get melted down to goo in the sewers of New York City? And what about Jason's rebirth toward the end (the most ridiculous moment of any \"Friday\" film)? How can a little slimy demon be reborn into a man already wearing ripped clothing and a hockey mask? And what about bounty hunter Creighton Duke? It's never explained how he knows so much about Jason and the mythical circumstances surrounding his life. In each of these instances, there seemingly are no easy answers. So rather than be inventive, the writers just threw all of this at us and hoped we would lap it up like thirsty kittens at a milk dish. This sequel completely ignores the continuity of the Jason legend that had been meticulously built up over the years.<br><br>What's equally tragic about \"Jason goes to Hell\" is its insistence on mocking the series. At one point, John D. LeMay's character sarcastically asks a trio of teens headed for Camp Crystal Lake whether they plan to smoke dope, engage in premarital sex and then get slaughtered. Har har. The transformation of Jason into some kind of media star is just as unnerving. Jason is a legend, a mythical figure whispered about in wildly imaginative campfire stories. Yet this movie turns him into a serial killer so well known he makes the TV tabloids and is targeted by the FBI. This is not the Jason we know, and \"Jason goes to Hell\" is not the \"Friday the 13th\" we love. It essentially breaks the fingers of the hand that feeds it.<br><br>The failure of \"Jason goes to Hell,\" both in terms of concept and box office revenue, inevitably draws comparisons to the much-panned \"Friday the 13th Part V: A New Beginning.\" That film drew plenty of boos for its Jason-less gimmick, but at least it had the feel of a \"Friday\" flick. \"Jason goes to Hell\" is substantially worse than any other entry, mainly because it is completely unrecognizable. Like \"Part V,\" it probably would have worked better as a horror film independent of the Jason saga, rather than dragging Mr. Voorhees into a place he has no business being.<br><br>Clearly, Adam Marcus was wrong. The \"Friday the 13th\" wheel did not need reinventing. The failure of this film (and \"Jason X\" years later) shows that fans want a return to simpler times when horny teens in cabins were afraid to look out their windows. As the saying goes, if it ain't broke, don't fix it.","user":"ReelCheese","rank":[77,101]},{"title":"The Worst crime is the murder of a horror icon!","rating":1,"date":"1 May 2005","review":"Let's understand two things about slasher horror from the 1980's: first of all, they had a legacy of saturating their own market, and secondly, they were simple stories born out of the twilight of an ever changing world.<br><br>With this in mind, it would be easy to point out what is wrong with Jason Goes to Hell: The Final Friday- however for the sake of time, it might just as well be easier to point to what's right about it. The answer to that is: NOTHING! All you ever wanted to know about Jason is revealed, and once you know the dark secret, it will haunt you- except for a small matter of cosmetics, the \"dark secret\" is the same as the lemon revealed a short time earlier in New Line's bad \"finale\" to the Nightmare movies. Of course, the only nightmare about that film was having to admit that you paid to watch it- it is much the same with this piece of total garbage.<br><br>Jason, it would seem, is not merely a specter capable of regeneration with a great rage at those who he feels are responsible for both his own and his mother's demise. Oh no, the dark secret is that if you can find someone who shares his father's blood line (cause lets face it, his mother was not born a Voorhees), then you can see Jason finally put to death, or you can see him re-born. Guess what happens here.<br><br>Except the rebirth is anti-climatic because he is nothing more than the same twisted mass of flesh that he was before he was blown apart by bombs and bullets at the beginning of the movie. And apparently genetics has a preference for certain types of clothing, and a certain mask because he is reborn with both.<br><br>In one laughable sequence, you would be forgiven for thinking \"Jason\" (or as I'd like to refer to him as...the Imposter) being reborn meant the world would end, however a mere 10 minutes or so after he was \"reborn,\" he is also summarily killed again with an ancient dagger (who were the camp counselors who ignored Jason as he died...some ancient Sumarian or Egyptian people or something? What's with the dagger that must be used? Why does it look like an artifact) supplied to his niece (oh, this is a long story, and is too tedious and boring to go through right now) who finds the Linda Hamilton in her to terminate the 'terminator.' You'll be in for your just desserts if you think this repulsive piece of junk is worth even five minutes of your time. Of course, there is plenty of blood and gore (as the Friday films always seem to have), and there is also plenty to gross you out- but if you think or feel anything towards the horror icon that made these films successful, you ought to take a pass on this one.<br><br>Even the soundtrack is awful!","user":"andell","rank":[32,44]},{"title":"What the hell?","rating":5,"date":"12 November 2002","review":"The ways of bringing Jason back just get crazier by the sequel, but this is the absolute craziest.  Crazy is too light a word; ludicrous is more like it.  The opening sequence is really cool.  A woman's taking a bath, she flees from Jason, he chases her through the woods and BAM!!!  Beams of light surround him.  That's when we find out she's really an agent and a SWAT team jumps down and shoots him to bits.  Now, Jason's body has literally fallen apart.  Ain't nothing we can now, right?  <br><br>Jason is taken to the coroner's office, the coroner gives him an autopsy and suddenly Jason's heart starts beating.  Then, out of the freakin' blue, the coroner grabs the heart and devours it like a sandwich!  Then supposedly, Jason's soul enters his body and every time he looks in the mirror, he sees Jason's reflection.  Now, once we got to the heart-devouring scene, I was ready to puke--not because it's disgusting, but because of how idiotic it is.<br><br>Now, this isn't a terrible movie, but it's only watchable on an entertainment level.  The story just gets dumber by the minute.  Hell, the previous Jason sequels weren't heavy on logic, but they allowed the audience to suspend a fair deal of disbelief.  Besides, it sucks that we hardly get to see Jason--mask and all--throughout the movie.  <br><br>\"Jason Goes to Hell\" also lacks a certain charm that the other movies had. I'm guessing this was made on a higher budget and the director and producers were actually trying to accomplish things that weren't accomplished in the previous movies.  But this is no more than B-horror trying to disguise itself as A-horror.  There's only one cool death scene that will stick in my mind and that's when the girl is in the tent having sex, she goes on top and her body is sliced in half by Jason.  Not to sound like a sadist, but that was freakin' awesome!  <br><br>My score:  5 (out of 10)","user":"mattymatt4ever","rank":[19,25]}]