[{"title":"Never again will common criminals be licensed to act in the name of this country.","rating":6,"date":"30 August 2005","review":"**SPOILERS** Living a quiet life in L.A as a mild mannered watch repair man Eddie Kaye, Michael Biehn, one evening becomes Superman when he rushes into a burning apartment building saving a mother and her infant from curtain death. <br><br>Eddie doesn't know it but he's really not Eddie Kaye he's Oliver Dykstra and at the same time he was supposed to be dead for years but a person watching the TV news that evening Col. Taylor, Richard Jordan, does. He's was the one who had Oliver brainwashed and given a new name and memory, as Eddie Kaye, and now realizing that he's still alive is responsible for Eddie's being terminated like he should have been years ago.<br><br>High powered action/thriller \"Timebomb\" lacks a cohesive storyline with Eddie on the run with pretty Dr. Anna Nolmar, Pasty Kensit, his psychoanalyst who he got to know while he was repairing her late fathers expensive watch. Always on the run throughout the film the couple are chased by Col.Taylor's mind-controlled goons from L.A to Mexico to Arizona an finally back to L.A at the Duke Hotel for the final showdown between Eddie and the entire Taylor goon squad.It turns out that Eddie, or Oliver Dykstra in an other life, couldn't be corrupted by Col. Taylor &amp; Co. to murder innocent people who the Colonel and his bosses high in government feel are a threat to \"National Security\". <br><br>Discarted and thrown away in a garbage dump Eddie miraculously survived and lived a quite and uneventful life until he came to the rescue of the woman and child in that burning building and since then he life was never the same again. Escaping from Taylor's men to Mexico Eddie realizes why he's a marked man when he sees a newspaper headline about Dean Jordan, Harvey Fuller, who's running for Attoreny General of the United States. Eddie then realizes that that's the main reason that he's to be killed as soon as possible ;to stop him from preventing Jordan's assassination at the Duke Hotel that coming Sunday. <br><br>Better then average action sequences with a wild shoot-out in a darkened and almost deserted porno theater with the porn flick still being projected on the screen as the bullets are flying and bodies dropping, what was the projectionist doing? was he asleep or on his lunch break? The final scene at the Duke Hotel was really something to see with all the light shut off as the assassin team with infra-red eyeglasses zero in on the guest speaker, Dean Jordan, for the kill.<br><br>Eddie saves the day, and Dean Jordan's life, by taking on the entire hit-team and slugging it out with them in the lobby and on the roof of the hotel with L.A police detective Sanchez, Raymond St. Jacques, coming to Eddie's aid just in the nick of time. The movie did touch on things back in 1990 that are very real today about a out of control government feeling that it's above the law and can do no wrong. As long as it has the power to control and intimidate those who dare to criticize or expose it. <br><br>The one thing that really disappointed me more then anything else in the movie \"Timebomb\" was the fact that Robert Culp, who played L.A's communications chief Phllips, was given top billing yet Culp was in less then two minutes of \"Timebomb's\" hour and a half screen time.","user":"sol-kay","rank":[11,11]},{"title":"Overlooked, great film","rating":29,"date":"29 April 1999","review":"When I saw this film, I thought \"Wow, this guy might be the next James Cameron.\" Perhaps a bit of an overstatement, but director Avi Nesher has a sharp, distinctive action style, and a flair for technology and attention to detail. This is a rough, tough action film, with touches of science fiction thrown in. Performances are decent, although Michael Biehn still seems stuck in Kyle Reese/Dwayne Hicks mode. Unfortunately, Nesher went on to do a bunch of straight-to-video films, the interesting \"Doppleganger\" and produced a batch, the only decent one being \"Automatic\" which he didn't direct, but certainly has his style imprinted on it. I'm hoping he hasn't given up on his dream sci-fi project, \"Hammerheads\" which I've heard about years ago.","user":"LuvsFood","rank":[17,19]},{"title":"Straight forward","rating":6,"date":"7 October 2007","review":"In this fairly straight forward, but pretty well done action film, Michael Biehn plays a likable guy working in his own watch repair shop. He suffers from amnesia and soon his past is about to catch up to him. Predictably he wasn't a watch repair man is his \"previous life\" but a lethal assassin.<br><br>The amnesia formula has been done many times, most notably with the blockbuster Bourne trilogy taken from Robert Ludlum's novels, but \"Timebomb\" has its merits. Michael Biehn is a good enough actor to play a convincing human action hero and the plot, while quite routine, delivers suspense and action. The mixing of science fiction into the film is also pretty interesting as it provides a few twists. However, there is enough cliché here to prevent this film from being anything special. Fans of the genre will enjoy it for what it is, others shouldn't even care to look. --- 6/10<br><br>Rated R for violence and profanity. Ages 13+","user":"BroadswordCallinDannyBoy","rank":[8,8]}]