[{"title":"Guilty? Sort of. A pleasure? Indubitably!","rating":8,"date":"21 August 2004","review":"This is my ultimate guilty pleasure.  All my critical faculties tell me it's a trashy action flick with no particular value.  But critical faculties don't mean a thing when chemistry is as kinetic as that between Rourke and Johnson, who for my money have Newman and Redford beat by a mile in one of the best \"buddy\" teamings ever.  Moreover, the movie is beautifully cast down the line and the pace is always great.  Everything from the costuming of the lead characters to the atmosphere in the bar to the performances by Tom Sizemore and Daniel Baldwin are right on target.  But mainly it's Johnson and Rourke's connection that makes the movie.  They're terrific. I've seen this movie several times and it never loses me for an instant. Yeah!","user":"billyweeds","rank":[58,66]},{"title":"This was a typical late 80's early 90's flick..","rating":14,"date":"14 October 2000","review":"This was a typical late 80's early 90's action flick....but its memorable for the title alone...just like all of these action movies THE PLOT IS EXTRA! the dialogue is head and shoulders above anything Stalone or Segal ever said...and the bickering between Johnson and Rourke is genuinely funny.... Above Average Action; Very Good Dialogue (for an action movie)","user":"NYCfilmFan","rank":[47,56]},{"title":"A tribute to a dying sort of men","rating":10,"date":"8 August 2001","review":"It's the kind of movie they don't make any more. Packed with testosterone and huge loads of male pride, Harley and Marlboro set out to kick some ass. I really love this movie because it shows like friendship between men works or at least how it is supposed to work. Even though the two main characters haven't met for years, they know where the other one is and when they come together again it's like they never were apart. They also help each other regardless if it will cost their live because in their mind \"It's better to be dead and cool, than alive and uncool.\" (Harley Davidson) Of course this attitude brings them nothing but trouble but those two take it the macho-way and stand to whatever comes up. And for those who only think it's a modern macho western: \"Back off!!\" Take a closer look and you will see that there is a lot of soul and spirit hidden between the macho talking and behaviour.","user":"BummBumm","rank":[81,102]}]