[{"title":"A beautiful, ageless film","rating":10,"date":"8 February 2016","review":"I adore this movie, it's easily one of my favourites. Another reviewer said that the best time to watch it is in the winter, and whilst I'm happy to watch it any time of the year, I would agree that it seems all the more magical when it's freezing cold outside, and you're snuggled under a blanket.<br><br>I'm glad no other actors were given any of the roles in this film, it wouldn't have been the same. Sandra is adorable as Lucy. She has no sinister intent, she's just swept up in the commotion and in the end, falls in love with the whole family. Her speech toward the end chokes me up so much, it's completely heartfelt. Bill Pullman also shines, he falls for her gradually and their chemistry is so lovely to watch. <br><br>If you want a gentle, unbelievably romantic film to watch on a cold evening, this is the one for you.","user":"bks-508-290401","rank":[33,33]},{"title":"So sweet it's almost delectable!","rating":9,"date":"9 September 2005","review":"You have to be THE most die-hard, unrelenting cynic not to enjoy this movie. I love it when television networks play this film around wintertime because for some reason it doesn't suit any other time of year. In winter you like to have a comfort zone and this film is it! <br><br>It tells the story of lonely singleton Lucy who daydreams of better things while working at a ticket booth and drooling over the secret crush of a local commuter (Peter Gallagher) One morning she saves him from a coming train and while he lies comatose she gets reluctantly cosy with his family. The deceit is understandable and by no means menacing, as it's Christmas the younger brother Jack (Bill Pullman) returns home and subsequently falls for Lucy. <br><br>While you were sleeping is beautiful and sweet in so many ways: You are reminded of the more old-fashioned romances of the 40's and 50's. There is not one hint of sexuality or lust in this as the love blossoms between Jack &amp; Lucy is honest, pure and all together endearing. <br><br>We all relate to Lucy on some level (a dream trip to Paris, Rome or in this case Florence) So it's hopeful to us all when she gets her happy ending. I absolutely loved it!","user":"doherty-elle","rank":[84,93]},{"title":"Sandra Bullock at Her Best.","rating":6,"date":"6 July 2002","review":"Lovely little film that has the lonely Sandra Bullock admiring high-class businessman Peter Gallagher from afar in her toll booth on the subway. Then one day he is attacked by a couple of muggers and Bullock saves his life by getting him to the hospital. Naturally Gallagher is in a comatose state after the attack. A true misunderstanding makes it appear that Bullock is Gallagher's fiance and typical confusion ensues. Now Gallagher's family all believe that Bullock really is his woman. Gallagher's brother (Bill Pullman) is suspicious though, but slowly starts to believe Bullock as well. He then starts to fall in love with her and vice versa. A great romantic comedy that is so pure and well-made that it is near impossible to say anything negative about it. It is not a perfect film, but it is a very likeable movie that delivers what it promises. 4 stars out of 5.","user":"tfrizzell","rank":[80,90]}]