[{"title":"Its a FACT","rating":7,"date":"7 September 2006","review":"FACT 1 - All knives used on the set were donated by Bob Hoskins who at the time held shares in Sheffield cutlery industries.<br><br>FACT 2 - During the cake scene where the woman arises from the dessert, the actress demanded that the cake did not contain any sugar because of a childhood skin condition.<br><br>FACT 3 - Seagal was the directors 2nd choice after Van Damme refused due to filming Universal Soldier.<br><br>FACT 4 - Due to spiralling production costs several of the scenes are actually old archive footage.<br><br>FACT 5 - Seagal designed his own costume for the movie after several attempts by costume designers failed<br><br>FACT 6 - Conflict between Lee Jones and Seagal aroze due to Lee Jones' obsession with calling Seagal, Seagull or Mr Seagull whilst leaving fish around his dressing room.<br><br>FACT 7 - Seagal followed a strict diet of 9 medium raw eggs a day during filming as recommended to him by De Niro after filming Raging Bull","user":"robertrowley1000","rank":[33,35]},{"title":"Steven Seagal's best!!","rating":9,"date":"22 June 2002","review":"This is by far Seagals best film and his only one that you could truly call good. His others range from average to just plain awful, but this is a great action film. Its basically Dies Hard on a boat, but is one of the few successful Die Hard clones. Andrew Davis made this before The Fugitive, and his direction is tense and exciting, whats more he gets Seagals best performance which basically means he is slightly less wooden than usual.<br><br>The plot revolves around this Battleship which is being taken out of use. On its final run, coinciding with the captains birthday, the ship gets hi-jacked by terrorists who plan to use the nuclear weapons on board. Seagal a former Navy Seal, with more medals than a medal shop, is on board as the ships cook, as this is the only position he can occupy in the ship after he was involved in a military blunder previously. Seagal uses his skills to cause problems for the terrorists as he sets out to stop them, aided by Miss July 89 Jordan The played by the sexy and melon chested Erika Eleniak who is certainly there for her looks ahead of acting ability, she is however a cut above Seagal in the acting department.<br><br>The action in this is great, Seagals usual Aikido master class is on display as well as some good gun fights, and impressive stunts. Seagal has always had a bit of paunch but he looks a lot fitter than his recent films where he lumbers about, in his earlier films he actually seems in some sort of shape and actually looks tough.<br><br>Overall this is an entertaining film, Tommy Lee Jones and Gary Busey are in scene stealing form as the bad guys and Seagal is at the top of his game. 8/10","user":"supertom-3","rank":[81,97]},{"title":"This Seagal Flick Took The Cake","rating":8,"date":"7 July 2006","review":"This was a fast-moving Rambo-style action flick (good guys never get hit despite 10,000 rounds of ammunition fired at them) that was very popular. It spawned a very weak sequel, par for the course. Several reviewers here wrote that it is Steven Seagal's \"best movie,\" and I wouldn't argue with that..<br><br>\"Under Siege\" probably was more popular than the normal Segal action flick because of several aspects: 1 - the interesting story featuring the \"lowly cook\" (as Seagal described himself in this film) beating a bunch of terrorists taking over a U.S. Navy vessel; 2 - the over-the-top villains portrayed by fun-to-watch actors Tommy Lee Jones and Gary Busey, and 3 - the fabulous looks and body of Erika Eleniak, who pops out of a cake topless in a sight that every guy who saw this film remembers.<br><br>Jones was just about hitting his acting career peak as he demonstrated the following year with his Oscar-winning performance in \"The Fugitive.\" Busey was the opposite, nearing the end of his run after a starring role as singer \"Buddy Holly\" made him famous. <br><br>This film might be Segal's most successful, or at least in the top three. His star has faded since the new century. Eleniak never made it far past the cake. She played \"Elly May\" in \"The Beverly Hillbillies\" the following year and nothing but 'B' films after that.<br><br>The first part of this movie is far better than the second. It gets out-of-control by the end, as most of these action films do with the violence overdone and with little credibility. But watching the three leads, and ogling Eleniak, always make this film fun to watch for a little while, at least.","user":"ccthemovieman-1","rank":[68,84]}]