[{"title":"Medem's brilliant debut","rating":9,"date":"20 December 1999","review":"With this brilliant debut film, Julio Medem placed himself almost instantly into the ranks of Spain's leading directors, along with Carlos Saura and Pedro Almodovar.<br><br>From the suspenseful footage of barefoot woodchoppers to the sprawling family rivalries to the chaos of war, Medem brings a unique  vision and a sharp edge to this Basque historical saga. His later films are equally masterful, but this is the one time he chooses to grapple with the history of his Basque homeland instead of telling a contemporary and character-centered story.<br><br>The plot can be a bit tricky to follow for those unfamiliar with Spanish history, and the lush beauty of the film definitely calls more for a big screen than for video. I can't make your screen bigger, but as for the history, I may be able to help with what most confuses the typical American viewer:<br><br>The Carlists were supporters of a series of 19th century pretenders to the Spanish throne and constituted an alliance of Basque nationalists with right-wing Spaniards, allied on the basis of Catholic faith.  The Carlists advocated absolute monarchy (against the ruling liberal constitutional monarchy), but were willing to grant the Basque region considerable autonomy.  Later, in the Spanish Civil War, the Basque nationalists allied to the left, siding with the secular Republic (which also offered them autonomy) against Franco's centralizing fascist forces.  Thus to be a Basque nationalist family over the span of this history led to some paradoxical alliances over time.","user":"jmabel","rank":[28,29]},{"title":"Probably the best debut feature since BADLANDS.","rating":8,"date":"3 February 2000","review":"What is most remarkable about VACAS in hindsight is how quickly Medem settled into his unique, thrilling style - elliptical narrative which foregrounds inter-generational families, subjectivity, ambiguity, fate, magic, repetition, doubling; transcendent philosophical concerns grounded in brutal violence, earthy humour, identifiable characters and animal imagery; an astonishing use of colour as both emotional and ironic signifier; a busy, almost cheerful camera style which switches with ease from the panorama to the extreme detail, making great mental demands, but offering even greater rewards.<br><br>VACAS invokes many genres, in particular the historical epic, and subverts them with dark glee, offering a dizzying, disturbing, unpalatable, ornate, sickening, epiphanic classic that might lose its way halfway through, but paves the way for an even greater masterpiece like TIERRA.","user":"alice liddell","rank":[13,15]},{"title":"Medem movie, not as good as always, but good anyway","rating":6,"date":"29 August 2007","review":"From 1875, (second Carlist war) to 1935 (Spanish CIvil War) in Basque Country, we are able to see the relationship between two near families, their discussions, their fight and their envies. All is viewed form the point of view of the cows, so quiet, so peaceful, so able to forgive, while we watch to the humane, their madness their lack of respect for life, their irresponsibility. Though it is hard to digest (too much for my taste) it is clear that it is a Medem's movie: the treatment of time, the sense of quietness in the environment and the development of the story. But we can see a young Medem, not so expert in these tools, and the result is not good as is used in these author, as he was still a noob, but we are able to see that he was a promising talent. Carmelo Gómez makes a terrific triple part and he is the one that builds the movie, everything happens around him and he is able to take the responsibility. The director is able to mix in a curious way the peaceful live of cowman's in Basque Country (and cows too) with the horrors of the war. It is not the best Medem's movie (well it is the worst he has done), but, being his opera prima, it is a pleasure to watch to it. If you are able to digest more or less correctly his films, you should not let pass the opportunity of watching this one, although it is not as good as \"Tierra\" or \"Los Amantes del Círculo Polar\"","user":"dcldan","rank":[6,6]}]