[{"title":"Sad","rating":1,"date":"4 December 2006","review":"This feature length episode is - apart from the equally dreadful \"The Last Vampyre\" - the worst adaption of a story by Sir Arthur Conan Doyle. One really wonders what was going on in the producer's mind wasting Jeremy Brett's rapidly diminishing energy and life-span for this crude story, especially after having been so faithful to the spirit of Doyle's works before. The theme of Holmes' dreams depicting exactly the events to come stands in stark contrast to his previously stated belief in rationality, facts and logical deduction. One can't help feeling the scriptwriters took to Holmes' former vice of drug abuse. Sad and unworthy of Jeremy Brett's talents.","user":"metropolnik","rank":[49,72]},{"title":"To call this episode \"weird\" is an understatement...","rating":5,"date":"26 January 2010","review":"This two-hour version of a Sherlock Holmes story that has been embellished with a number of new ingredients and sub-plots taken from other works of literature (most notably, the mad wife from \"Jane Eyre\"), is an extravagant waste of time for the viewer.<br><br>I came upon this after the first ten minutes and from then on tried to make sense of the proceedings. This was nearly impossible until I watched at least an hour of it to get to the main thread of the story. Even then, the plot is all over the place with rambling, incoherently staged scenes that seem to lack any sense of continuity. It's as if the editor had a jumbled mess on his hands and didn't know how to put the pieces of the puzzle together.<br><br>Of course, Sherlock has no such problem. With the thinnest of hints, he manages to solve the entire case using implausible practices. The weird underpinnings of the story are too improbable to bear much scrutiny.<br><br>Let's just say the settings are fine, the atmosphere proper and the acting is first rate except for Jeremy Brett who seems to be giving his all to an overbaked role that makes Sherlock Holmes look as though he needs a lot of clinical care. Brett looks pale and distraught most of the time, clearly not in the best of health with his asthma hurting his ability to draw his breath at times. Too bad he had to waste so much energy on a badly constructed episode that seemed endless.","user":"Doylenf","rank":[19,27]},{"title":"Whatever Happened to THE ADVENTURE OF THE NOBLE BACHELOR?","rating":1,"date":"12 November 2008","review":"This episode of the Jeremy Brett \"Sherlock Holmes\" series was the worst in terms of being a bloated two hour reconstructed story. Despite good work by Brett, Edward Hardwicke, and Simon Callow, it again demonstrates how the writers of a screenplay can wreck the work of a better writer.<br><br>THE ADVENTURE OF THE NOBLE BACHELOR appears in the first collection of Sherlock Holmes short stories, THE ADVENTURES OF SHERLOCK HOLMES. The story details how Holmes and Watson get involved with tracing the whereabouts of a young American woman, the daughter of mining millionaire, who was about to marry one Lord Robert St. Simon, a man of impeccable breeding and background - one of the most available high profile aristocrats in the marriage market. The young woman (Alice Doran) disappeared at the chapel where the marriage was about to commence. The police (Lestrade in charge again) are suspicious of the antics of a former girlfriend of Lord Robert, who may have threatened the missing bride. And then there is also a mysterious man who was seen near her hotel on several occasions. Holmes, in the end, is able to figure out what exactly happened, although it does not please his client. <br><br>Now Lord St. Simon appears to be a well-mannered, self-important jerk in the story, but he gives no indications of being the conniving monster that was created by the scriptwriters. They turn him into a violent version of Edward Rochester, with a still living wife hidden in the ancestral house, in squalor (similar to Bertha Mason Rochester in the attic in JANE EYRE). He is a fortune hunter who marries and gets rid of wives (so why not the first one?). The conclusion of this film is about as far off base as one could get from the short story, which ends on a friendly note.<br><br>When he wrote THE NOBLE BACHELOR, Conan Doyle was making subtle comments about a trend of his time.<br><br>SPOILER COMING UP:<br><br>Alice turns out to have been reunited with one Francis (Frank) Hay Moulton, a young American who prospected near her father in California, but had no luck. Mr. Doran (when he struck it rich) would have nothing of Moulton, pulled Alice away to Europe, and decided to buy a title for his daughter. It was very common in the \"Gilded Age\" for multi-millionaires in America to marry into French or British aristocracy. The best recalled marriages were of Consuelo Vanderbilt to the Duke of Marleborough, and of Jennie Jerome to Lord Randolph Churchill (the latter producing Winston Churchill). Anne Gould married Count Boni de Castlelaine. The trend continues to this day (Jackie Kennedy Onassis' sister Lee Bouvier becoming Princess Radziwell of Hungary). But it was at it's height in the 1890s - 1920s. <br><br>Conan Doyle was poking fun at this ridiculous right of passage of a new snobbish American aristocracy, and showed that Lord St. Simon really was not worth the trouble (when he learns the truth St. Simon will not congratulate the Moulton's on their marriage). Conan Doyle ends the story with Holmes demonstrating a better approach to good international relationships, in a memorable comment suggesting that one day the memories of the idiots who caused the American Revolution will fade and Britain and the U.S. may yet be reunited again.<br><br>As I have said before, Conan Doyle could write the heads off of some screenplay writers.","user":"theowinthrop","rank":[16,24]}]