[{"title":"A must see film","rating":10,"date":"23 October 2000","review":"I'm here to write a small human spin on the film Gia. As this film claims, Gia WAS different things to different people. I know because I met Gia in Philadelphia when we were both 16. I casually knew her from her father's hoagie shop because I went in there often to eat. When I chose to go to college in Philadelphia a few years later, I dropped in occasionally at the shop and I always said hello to Gia's dad to ask how she was doing as a model. He was so proud of her and what she was accomplishing in New York and all over the world. He always had that picture of her in Cosmopolitian above his cash register and he let me look at it. I just knew Gia would do well. Years pass, I move to the West coast. In 1982, I'm in New York and I heard she was right up the street from where I was, and I wanted to stop by to say \"Hi\" but never got the chance, I was too busy in meetings and never thought about it again. It wasn't until 1990 I heard she died, and the way she died and it tore me to pieces. So tragic to someone many of us thought from our generation, our backgrounds, our area \"had made it.\" In 1998, this movie was done and I thought done as good as it could be. I know there were those closer to Gia that knew more and didn't appreciate it, but I did, and I miss her. Angelina Jolie did some very serious acting to bring this part of Gia's life to the screen. The movie was of theatrical quality and its a shame it didn't get that release. But thanks to this movie, there was a great deal of Gia's life I knew nothing about after 17 years old. But the ending was what touched me, because that is how I will remember Gia, and wish for everyone to remember her as well, even with the rough and gritty content contained in her life brought to screen. This is a hard must see for those who think a model's life is exciting, it can be, but they will also learn its nothing without the love of your parents, stable friends and relationships and the love of yourself - no matter what yourself may be.","user":"lambiepie-2","rank":[194,218]},{"title":"Unforgettable","rating":15,"date":"15 August 1999","review":"This movie turned out to be a very unexpected favorite of mine.  Angelina Jolie stars as the late Gia Marie Carangi,  an Italian American woman who rose from a humble Philidephian beginning to worldwide fame as the first known \"supermodel\",  and whose short-lived career spanned from the late seventies to the early to mid eighties.  Jolie is super-impressive as she portrays the highs and lows of Gia's fame:  strutting through a crowd of admirers,  the look on her face saying,  \"I'm GIA,  and you're nobody!\"; endulging in glamour drug of the moment,  cocaine;  fiercely proclaiming her love for Linda (Elizabeth Mitchell),  right in front of Linda's boyfriend; tearfully begging her visiting mother (Mercedes Ruehl) to stay with her, then hurling obscenities at her while throwing her baggage out of the apartment;  and quietly and gracefully accepting the most tragic news about her health,  just as she's finally getting her life on track.  This movie deals very frankly with Gia's sexuality and there is some nudity and scenes of sexuality,  but looking past the sex and the drugs and the tough exterior she displayed (especially when someone took her knife away from her),  you see a very lost,  fragile person.  Gia is almost childlike in her disillusionment about the fashion industry,  and you feel it in the way she fantasizes about a \"normal\" life with children,  the way she feels like people regard her as a \"piece of meat\" with no brains,  and the way she is so truly hurt by a fellow model calling her hateful names in a jealous rage. I think this movie is something that should be seen by people of all ages, regardless of its sexual content,  because it carries a strong anti-drug message as well as a touching story we can all identify with even if a lot of us are not blessed with the kind of glorious physical beauty Gia was blessed with.","user":"PeachHamBeach","rank":[99,112]},{"title":"Haunting portrayal","rating":5,"date":"5 October 2004","review":"I rented the unrated version from NetFlix. <br><br>Gia is a powerful movie. It is two stories intertwined into one: the life of a confused teenage girl, looking for love and acceptance, and of the modeling industry and its effect on the emotions and egos (no matter how large or small) of those in front of the camera. As a woman who worked within the industry several years ago, I could relate to the confusion that Gia felt. <br><br>Angelina Jolie gave the viewer an excellent portrayal of a lonely teenage girl who was trapped inside an adult woman, her only comfort being her lover and later, her drugs. <br><br>The performances of the actresses were on target; the message was clear. A haunting movie worth purchasing.","user":"dont_blame_me","rank":[52,58]}]