[{"title":"Who can, loving animals, not melt over Buddy?","rating":10,"date":"6 January 2013","review":"The first of the 'Air Bud' series is as much wonderful as it is horribly underrated, truly a 90's classic. It has a dignified place in the list of the greatest animal movies as well. In many ways it is a depressing movie but it's also heart-warming, touching, feel-good and tons of fun. There's more to it to like, though. Cinematography is really beautiful and pure. The soundtrack is just perfect for this film. The boy and his devoted four-legged friend make a marvelous team and have a perfect chemistry.<br><br>Even though the film's title obviously refers to the dog, his name is actually Buddy - that is, once he ends up in the hands of Josh Framm. Even as the movie starts, the little we see is enough to realize how horribly the clown treats his dog (constantly yelling at him, threatening him and hitting him hard with the newspaper). It is heartbreaking to see that. Fortunately, this horrible man accidentally loses him and he finds Josh Framm (a, I assume, 12-year-old who is loving and caring but very shy and silent and currently under depressive mood). They quickly become best friends, as Josh gives him the treatment he deserves. Buddy is a very special dog alone, but he has a special secret that makes him even more special: he can play basketball (even more amazing, better than humans can!).<br><br>Even though the clown is a horrible person, he doesn't have that much of a role. He is not someone I sympathize with and he certainly isn't funny, although it is hilarious when his truck falls apart and he can't stop it and accidentally drives it into a river.<br><br>Larry Willingham's father is a jerk. Even though Larry unfairly picks on Josh, at least he isn't too bratty and is funny at times. But Larry's father, that guy is such a jerk, although not overly annoying. Coach Joe isn't especially sympathetic because he is very impatient and temperamental, but he goes too far when he throws basketballs at Josh's peculiar friend Tom with aggressiveness.<br><br>The movie is focused more on Josh and Buddy, who are the most likable characters of the movie. Kevin Zegers is flawless as Josh Framm. Buddy the Dog is amazing as Buddy (may this wonderful dog rest in peace, wherever he is now). Brendan Fletcher does a good job as Larry. So does Shayn Solberg as Josh's good friend Tom. The late Eric Christmas is hilarious as Judge Cranfield.<br><br>Title in Portugal: 'Air Bud'.","user":"bts1984","rank":[11,11]},{"title":"Of all the movies I have watched, this is the only one that has made me Cry","rating":10,"date":"7 January 2006","review":"This is the kind of movie that will be remembered forever. This movie was done perfectly and I have no negative thoughts about it. They chose the absolute best music for this movie and I don't think anyone could have chose better. It needs to be remembered, they should make it on a special edition DVD. Even though they have come out with tons of Air Bud movies after this, the original one will always be the best. The Sadest part in the whole movie is the part when Josh leaves Buddy stranded on the other side of the river. This will always be my favorite movie, and nothing will ever change that. I give Air Bud a 10 out of 10 for great humor, sadness, and music. Great Job!","user":"mrbillybob","rank":[16,19]},{"title":"Buddy and Josh make this movie","rating":9,"date":"29 July 2007","review":"'Air Bud' is one of \"doggy\" movies so much in fashion in its time. And it's surprisingly underrated.<br><br>This is by no means a comedy, although it has its funny moments. It is dramatic, more than anything. In fact, this is often a depressing film but joyful at the same time. <br><br>Unlike its sequels, this one has a clever plot (a sentimental one, I'd say). It's heartwarming, in the line of others like this such as 'Old Yeller', 'Homeward Bound: The Incredible Journey', 'Napoleon' and 'Fluke'.<br><br>Despite the title, the story isn't just about our very dear canine friend Buddy (even if he is the main star). The story also focus on Josh Framm, who is a crucial character, together with the dog. After all, they are destined to be best friends. Josh is Buddy's salvation, but Buddy also plays an important role to save Josh's life. Buddy escapes from his alcoholic and aggressive owner and finds a peaceful life with Josh. On the other hand, Josh gets over depression and shyness thanks to Buddy, which gives the him will to live and brings back Josh's lost interest in basketball.<br><br>That's when the movie's most original thing happens: Buddy can play basketball! That is just amazing! Like everybody else in the movie, to see the dog playing basketball leaves me speechless. That dog has an incredible talent for basketball and even more unbelievable is that he never fails. He's a much better and natural-born player than the humans themselves. He becomes the mascot of Josh's basketball team... which brings them lots of luck.<br><br>The beauty of this movie isn't just in the dramatic story, but also in the friendship between Josh and man's best friend. Plus, Buddy is a Golden Retriever, my favorite dog breed. Golden Retrievers look so friendly and pacific. They are in fact. They are among the world's sweetest and most beautiful dogs.<br><br>But the magnificent scenario also gives beauty to the movie: rivers, green places, a nice village. All of this is very well combined with soft, relaxing and beautiful piano music (like in \"Fluke\").<br><br>Tom is an eccentric boy who always carries minor pieces of garbage to give him luck. It is, however, a bit disturbing to see that Joe coach throwing him numerous basketballs, causing the boy to shake nervously and feel very tired.<br><br>Larry, although constantly picking on Josh, isn't really annoying or stupid. He is more of an arrogant and jealous guy than actually mean. <br><br>Despite having some deeply touching moments, the most heartbreaking moment of the movie is when Buddy crosses the river and tries to follow the river boat which Josh catches. That scene always makes tears come to my eyes.<br><br>As for the cast, Kevin Zegers (a sports boy in real life, just like Noah Hathaway) is wonderful in the role of Josh Framm and Buddy the Dog is simply fantastic as Buddy. I was so sad when I found out that Buddy died. He was a friendly, adorable, beautiful and very talented dog. The little girl who plays Josh's cute little sister (whoever she is) is alright either.<br><br>But I don't like some of the characters at all. Norm Snively is a drunk, abusive man and a loser as a clown. Coach Joe is a jerk and unkind. Larry's father is a jerk and a hypocrite. <br><br>This should definitely be on Top 250.","user":"Atreyu_II","rank":[13,16]}]