[{"title":"The Lizard King","rating":9,"date":"17 June 2004","review":"We all know how legendary The Doors were and still are, and sooner or later someone was going to make a film about them. Might as well be Oliver Stone. Given the subject matter, Stone was able to go off the deep end with his imagery here to the point of making one have an epileptic seizure OR think they just dropped some acid. Either way, it's great to watch in my book.<br><br>The film is flawed in that it's not titled correctly. It's not about The Doors, it's about Jim Morrison and basically just the wild and crazy side of him. That's ok I guess, Morrison was The Doors. Many have criticized Stone for not depicting Jim in the proper light, but given how many people knew him it had to be an almost impossible task to please everyone as everyone knew him differently. I think we all can attest to this through the friendships we have with our friends. Some know us as one way, and some know us as another. I respect Stone for trying and feel sorry for him about the flak people have given him as I know he is a very talented director. I think his intentions were spawned out of true admiration and that he made this film for himself and to pay tribute, and not to win any awards. More of this can be found on the Special Edition DVD from Stone himself.<br><br>\nEven if one does not enjoy the trippy qualities of the film such as I do, or any part for that matter, one could not avoid admitting how well Val Kilmer portrays Morrison. It's simply amazing and is one of the best performances that I can bring to mind, and is the best example of how to literally become someone else, bar none. He doesn't act like he's Jim Morrison, he becomes Jim Morrison. He is Jim Morrison. This is no doubt helped by the uncanny facial similarities the two have. Not only that, most of the singing that's in the film was done by Kilmer himself and even a few of the original band members admitted that they honestly could not tell the difference between their two voices. Even if you hate Val Kilmer, this performance jumps in your face and screams for respect while trying to strangle you.<br><br>As mentioned earlier, some do not like the film for several reasons. One is that it makes Jim look like a monster and that it only glorifies his wild and uninhibited behavior. Two is that it's basically just one big acid trip into bits of history about the band. For one, Oliver Stone said it best....when you have to condense a person's life, a legend at that, into two measly hours you must take the highlights. Everyone lives longer than two hours, even Jim. We all know Jim was crazy, and with so many of the insane stories Stone heard while trying to piece together the script for this, a lot of what he heard was simply what you see. The wild and crazy side. As a result, what we're left with is not an accurate depiction of The Doors or of Jim Morrison. It is entertaining, yes, but it is not accurate. I think it could have been done perfectly, but it would have been excruciatingly difficult...and still not everyone would like it. And as far as the trippiness of the film, well that's Oliver Stone for you. We saw the same thing in Natural Born Killers a few years later. I personally like the style of it and felt that it was in place here but that's just my opinion. The '60's, drugs, and rock and roll equals trippy.<br><br>Overall a decent attempt at one of the most difficult subjects to cover, legends. And even though it's not entirely accurate and even though Morrison is one of my idols and he deserved a little better, I do enjoy the film greatly. The film should have been named Pandora's Box.","user":"Manthorpe","rank":[117,139]},{"title":"Val Kilmer's Magnum Opus","rating":8,"date":"20 May 2008","review":"The Doors is unapologetically a film about sex, drugs, and rock n' roll. For 140 minutes we follow Doors singer Jim Morrison from his days as an aspiring film student at UCLA to his death in Paris in 1970 at the age of 27. Writer-director Oliver Stone based the story of the film on some 150 transcripts detailing the life and character of Morrison. The result is far from flattering. The Doors paints a picture of a man enamored with death, his own inevitable demise more a relief than an agony.<br><br>Death stalks Morrison wherever he goes from a young age. As a child driving through the New Mexico desert with his family, Morrison happens across the site of a car accident littered with dead and dying Navahos. We watch the young Morrison endure what seems to be a sort of possession rite by spirits of the dead natives. Years later he'll profess to be a shaman and from what we see on screen, he might well have believed it to be true. Native American spirits dance alongside Morrison as he sings on stage. Whether these were real or simply an acid fueled hallucination is left deliberately unclear by Stone. Likewise, a death-like character (Richard Rutowski) shadows Morrison throughout his life as a rock singer. Whether this indicates Morrison saw death as a friend, was actually accompanied by Rutowski (who was a real life friend of Morrison), or was simply hallucinating remains ambiguous. What is clear is the following: in his great desire to self destruct, Morrison drank whiskey like water and spent an inordinate amount of time on precarious ledges outside Hotel windows thirty stories up.<br><br>Kilmer's performance as Morrison is easily the finest of his career. Raw, nervy, deliberately off putting and confrontational, moments of sobriety are few are far between for this insecure egomaniac. At times I didn't feel as though I was watching a portrayal of a character long deceased so much as a documentary. From threatening suicide repeatedly to quarreling constantly with police at concerts, scenes of bad behavior are many but moments of insight are few and far between. This doesn't seem a shortcoming on behalf of director Stone so much as an accurate depiction of the highly acidic Morrison as he truly was; this was a man who didn't want to be understood. This was an artist on the constant edge of oblivion; an iconoclast who refused to be loved and was close to intolerable whenever possible. Of course it's less than a pleasant experience following the venomous creature that Morrison became for the film's final hour as he goes from alcohol induced nervous breakdown to drug fueled indecent exposure, but I for one appreciate Stone's refusal to Hollywoodize the life and death of Morrison. Kilmer abandons completely all instinct for self preservation on screen, submerging himself in a performance that can only be described as his magnum opus.<br><br>Meg Ryan leads the supporting cast as Pamela \"Morrison\" Courson, Morrison's longtime lover and common-law wife. Ryan seems lost in the role but thankfully spends a minimal amount of time on screen as Morrison was a firm supporter of the \"free love\" social movement. Indeed, he spends more time with journalist and witchcraft enthusiast Patricia Kennealy (Kathleen Quinlan), an amalgam of several Morrison lovers who suffered through his frequent alcohol and drug induced impotence. A very fine Michael Madsen is wasted as actor Tom Baker, a friend of Morrison's whose relationship is grossly underdeveloped. The only performance among the supporting cast worthy of praise is that of quirky character actor Crispin Glover in a cameo as Andy Warhol, a scene that is absolutely spellbinding.<br><br>Some may criticize The Doors for glamorizing a life of excess; this film gives younger viewers the idea that drugs and promiscuous sex are fun, critics may charge. Those who would are missing the point entirely. As are those who would interpret this film as the cautionary tale of a life wasted. Little about the character we view on screen is glamorous. It seems no accident that Morrison died as he did. This was a man obsessed with death; his demise seems more a moment of wish fulfillment than tragedy. My only significant criticism of the film is that the title is certainly a misnomer; this could have easily been titled \"The Jim Morrison Story\" as there is not a single scene on screen without the eccentric singer while the remaining members of the band are relegated to obscurity. Call it art imitating life once more.","user":"b_buddy1","rank":[30,34]},{"title":"A refreshing cinematic breakthrough in an era in which cinema seems all but forgotten!","rating":9,"date":"3 December 2000","review":"This film is truly a gem.  The Doors is easily the best film of the rock n' roll genre and at least one of the most important films of its era. Though I am not an Oliver Stone fan I must give credit where it is due.  Stone really does a terrific job with this film, and shows what he is capable of when he actually knows about the subject he is attempting to comment on. A few of the scenes in the film are almost exact recreations of actual events. However, the magnificent thing about this film is that it manages to recreate a certain amount of reality while simultaneously realizing that for a film to possess its own vitality it must transcend the preexisting reality, move beyond the surface, beyond everything that is obvious, and express and explore something deeper.  Val Kilmer delivers a powerful performance in which he almost seems to be channeling the energy of Jim Morrison, and though I've seen many of Meg Ryan's films this is the only one I can recollect where she does such a good job that she makes you really forget about her and focus on the character.  The cinematography of the film by Robert Richardson (Platoon, Wall Street, Born on The Fourth of July, Natural Born Killers, Casino, Bringing out the Dead, and many more) is bold and unique making the film one of the most distinct visual films I've ever seen.  This film is truly one of a kind, and breaks through into new cinematic territory, giving priority to the visual aspects of the film in an era where there are so few films that even give much consideration to the single most important aspect of the motion picture.  The genius of this film is that it is visual-audio as opposed to audio-visual and is more concerned with expressing something than simply impressing the audience.  The Doors is a refreshing cinematic breakthrough in an era in which cinema seems all but forgotten.","user":"famsmith","rank":[88,118]}]