[{"title":"Terence Hill rides again!!!","rating":3,"date":"3 October 2003","review":"Don't expect a huge budget or flashy camera work.. This is a mild take on \"Lucky Luke\" the famous Comic/Cartoon. Luke is played by Terence Hill, that Trinity guy. This is good for the entire family since Hill keeps up his tradition of films without violence, sex, &amp; language. Try finding that these days..  It is great to see Neil Summers as Lukes Deputy Sheriff. Summers played Squirrel in My Name Is Nobody (Remember the scene in the bar where the fella is shooting glasses before they hit the ground.. always grinding his teeth..). Good stuff, Good music too.. The late Roger Miller provides the opening theme, the narration, &amp; the voice of Jolly Jumper while the ending credits has a Arlo Guthrie song. I know a lot of people will not like Lucky Luke, but it's not for everyone, but if you are looking for something for the whole family to enjoy or if you are a big Terence Hill fan it is worth watching.","user":"AriSquad","rank":[28,34]},{"title":"One of my fav Terence Hill movies.","rating":9,"date":"23 August 2009","review":"I don’t really understand all the negative comments about this movie. First off, how do you expect to make a serious impression out of a comic book that didn't even take itself serious? This movie is not to be taken serious, it’s a comedy. (com•e•dy n. pl. com•e•dies 1. a. A dramatic work that is light and often humorous or satirical in tone and that usually contains a happy resolution of the thematic conflict. b. The genre made up of such works. <br><br>2. A literary or cinematic work of a comic nature or that uses the themes or methods of comedy. 3. Popular entertainment composed of jokes, satire, or humorous performance. 4. The art of composing or performing comedy. 5. A humorous element of life or literature: the human comedy of political campaigns. 6. A humorous occurrence.) <br><br>I read all of Morris and Goscinny’s work when they were at their best. In addition, there was always with a twinkle in their eyes creating this hero what he is today.<br><br>IMHO Terence Hill makes a great job capturing that from the comic books and here for those that think Morris made a mistake. (All the movies he was in had an angle with tongue-in-cheek perspective). Why would they continue their collaboration if he (Morris) had not approved of Terence Hill and the screen writing. Terence Hill doesn’t take himself to serious and that shows in his movies. No cussing or questionable “nude” scenes, just pure good old fashion fun. As a movie buff I enjoy a good movie and I don’t judge how and who and why this and that is awful or faithful to whatever the source of a movie. I watch a movie to be entertained without to have to dissect every move or scene I see. This one is great, full of humour and with a tongue-in-cheek kind of way. Life’s too short to grumble about how bad this is etc. Enjoy the show, grab a bag of popcorn and kick back in your favourite chair or couch and just have fun.","user":"Mr_GrowlTiger","rank":[13,16]},{"title":"Just watch the 1971 animated version instead...","rating":5,"date":"28 September 2018","review":"Created in 1946, Lucky Luke, the \"cowboy-who-shoots-faster-than-his-shadow\", is the product of a generation raised by the most iconic ambassadors of American cinema: westerns. \"Luke's father\" Morris knew his classics and every adventure was the opportunity for a fun exploration of one of the many pop-culture aspects of the genre: desperadoes, pioneers, stagecoaches, Indian wars etc. Like I said in my \"How the West Was Won\" review, you could learn as much about the Old West with Lucky Luke as with John Ford. Yup! <br><br>So here we are in 1991, when it's the Belgian cowboy who inspires an American movie. Now, should we say \"finally\"? It's impossible not to get some \"full-circle coming\" vibes and \"loop closing\" delight in the fact that Morris finally made his poor lonesome cowboy get back to his roots... but let's face it, \"Lucky Luke\" is as American as hot chocolate. As one of the most successful alumni of the French-Belgian school of comic-books (like rivals Asterix or Tintin) its satirical humor can only mock foreign archetypes in a way that would appeal to a European audience. Maybe Terence Hill was too \"European\" for Lucky Luke.<br><br>Indeed, Hill is a popular actor who's made a name for himself thanks to his streak of buddy movies during the 70s-80s with Bud Spencer, together they've made millions of people laugh over the world and it's precisely for the relative 'innocence' and 'childishness' of their action-packed \"Laurel-and-Hardy\" style that a parody of Lucky Luke could have worked for the European public. It could work with Americans on one condition, wherever to go, you've got to fully get into that area. If you go for plain parody, you adopt the \"no-holds-barred\" Mel Brooks style, if you want to have your Western Spaghetti with a comedic al dente, you make a lighthearted 'Leone'. <br><br>But if you go the \"Spencer-Hill\" way, at least make sure your Hill is good. And Hill isn't quite good. He's like playing the straight man in a movie without any clowns until the second half starts and by the time the Daltons make their memorable entrance, we've endured a gallery of bland supporting characters supposed to be foils for a Lucky Luke who didn't look any more fun. There's a serious problem when you're more entertained by the voice-over or the stereotypical Chinese laundryman than the film's own hero. Hill played Lucky Luke like a man caught in the middle of strangers, afraid to ask where the bathroom is, while holding a \"big one\". <br><br>And not only Hill didn't look happy but I'm not even sure he enjoyed doing the film. I wouldn't blame his acting rather than the fact that he was 52, not quite the epitome of his youthful good looks and he used to be quite good-looking. The clothes didn't help either, it's even the first thing that struck us in the theater (yes, I have a pretty vivid memory of this film as one of the first I saw on the big screen). As a kid, I was thinking \"but this isn't Lucky Luke, why is he blonde? Old? Where is the black vest, yellow shirt?\" but even without these superficial elements that bothered my Dad too (he also grew up reading the comics), the film could have worked. But it didn't. Gene Siskel said \"with a great casting, 80% of the movie is there\", with this film, you have a good counter-argument.<br><br>Lucky Luke is more fun to watch during the entire opening credits song than the whole movie. I liked his training with the shadow and his faces with the gopher (and when the shadow outruns him) and I reckon the song is quite catchy, if the film was as good as the credits, it could have afforded to be a cult-classic à la \"Johnny Dangerously\". But there's nothing funny, intimidating or even badass about Luke, he's just standing, posing, making shots so badly edited they wouldn't have made the cutting room of a 30s second feature, not to mention his dubbing voice slightly above Kung Fu movies' level. When he doesn't act, he rides, he sleeps and rides again, the narration of Jolly Jumper is less a fun device than a yawning antidote. <br><br>There are a few good things about the film, I liked Nancy Morgan as Lottie Legs, the Dalton are rather fun with Ron Carey who plays a Pesci version of Tuco, which gets close enough to Joe Dalton and Fretz Seberg was quite a satisfying Averell. When the Daltons pop up, the film's energy is enhanced... for a little while. Joe Dalton finds the town boring and it sounds like a self-referential comment, the Daisy Town in the film doesn't leave much to be interested in... until the Natives' part. But even I, with my mind as open as Fort Alamo, as someone who enjoys the caricatures in Goofy cartoon's \"Californyer's Buster\" or \"Blazing Saddles\", I was cringing many times. It's less for the caricatures than the fact the actors weren't even good... as I said, if you want to go for the caricature, do it frankly and responsibly, not shyly, doesn't work with Americans... doesn't work with any audience actually.<br><br>The 1990s wasn't exactly a great decade for Lucky Luke. In 1991, the new animated series came out and despite a relative faithfulness to the albums' spirit plot-wise, it lacked the zany energy of the 80s Hanna-Barbera version. Then after what I consider his last great album \"The Daltons' Amnesia\", the trait of Morris, worsened by age, was going more and more uncertain until he indulged to a practice which I believe is the antithesis of creation: reproducing frames in the same page. I don't think I bought any album made after \"The Dalton at the Party\" in 1993. <br><br>In that unfortunate lackluster context, the movie didn't improve things; and it's quite fitting that its funniest running gag is an interrogation mark over someone's head.","user":"ElMaruecan82","rank":[5,5]}]