[{"title":"can this be - Holmes in love?","rating":6,"date":"6 July 2003","review":"The stand-out sequences from 'The Master Blackmailer', for me, are the ones between the brilliant Jeremy Brett (in disguise, naturally), and Sophie Thompson.  Could it be the great detective has actually fallen for a lady?<br><br>This aside, there's a intricate blackmail plot involving Robert Hardy (excellent), and plenty of opportunities for Holmes and Watson to get themselves in awkward situations before solving the mystery.<br><br>Probably the best of the feature-length episodes, and a fine example of the work Brett and Hardwicke did to immortalise Conan Doyle's characters for the small screen.","user":"didi-5","rank":[27,33]},{"title":"The best, from the best","rating":10,"date":"23 September 2001","review":"Jeremy Brett is simply the best Holmes ever, narrowly edging out the great Basil Rathbone of course, and this is probably the best adaptation of a Conon-Doyle short story.<br><br>A length adaptation includes some new plot strands that fit in well to the surrounding drama and heightens the hatred one feels for Milverton.<br><br>Excellent performances all round, especially from Robert Hardy, and both Brett and Hardwick fully rounded and comfortable in their roles makes this a superb piece of drama.","user":"meglos","rank":[19,26]},{"title":"Screen version of Sherlock Holmes reaches its zenith in Jeremy Brett's portrayal of master sleuth.","rating":10,"date":"18 January 2006","review":"After seeing Jeremy Brett as Sherlock Holmes, no actor should ever display such conceit as to imagine that he could ever come close to Mr. Brett's portrayal of \"one of the most interesting characters in literature\". Jeremy Brett IS Sherlock Holmes and in my opinion there can be no other. The great actor Basil Rathbone is,I must admit, a close second but, is still second. One might make the argument that Mr. Rathbone's screenplays were inferior to the absolutely top notch productions afforded Mr. Brett and to this I would agree. However when all is said and done Jeremy Brett will always and forever be the only actor to truly \"become\" Sherlock Holmes. The book should be closed on this subject and we,the public,left to enjoy Mr.Brett's unique performances.<br><br>Bill Rogers <br><br>(sonarman65@yahoo.com)","user":"sonarman65","rank":[17,23]}]