[{"title":"What is everyone's problem with this film?","rating":8,"date":"22 March 2001","review":"I am glad to say that I have this picture on video now, and it is still one of my favourite movies. I think the film brilliantly captures how a radio station (or a stage production even) can be controlled chaos at times.<br><br>This film was unfairly maligned in my opinion. I like the murder mystery/comedy genre. At times, it can be badly done, but here it is very well-handled. Brian Benben, Mary Stuart Masterson and the squad of celebrities who cameo, handle their scenes very well. My only real complaint would be that Christopher Lloyd and Michael McKean have very little to do.<br><br>But the plot twists and the resolution both pay off excellently and Mel Smith directs the piece with panache. There are also several great musical numbers thrown in as well. I give this film 8/10.","user":"bannonanthony","rank":[42,45]},{"title":"Affectionate","rating":19,"date":"19 March 2004","review":"Unfairly and almost universally trashed, this is a charming and atmospheric imagining of a hectic night in the life of a Chicago radio station whose ambition it is to go national.  The sponsors are a tough sell, nothing is going as planned, and everything is pure chaos, compounded by a mounting tally of murder victims.<br><br>\"Radioland Murders\" is one of the noisiest and busiest live-action movies I've seen, literally wall-to-wall in every frame with rapid-fire slapstick and pratfalls, and it does not quite work as a comedy, but even as a comedy, it's breezy and pleasant in the face of its frenzied pace -- not unlike an old Warner Bros. cartoon of the Merrie Melodies variety.  Better, though, it works as a nostalgic notion of old-time radio.  The staggering gaps in logic and plot are meant to be ignored, as this is fantasy; it embraces the idea of radio in its heyday as the missing link between paperback adventures and television, requiring the listener's imagination to do half the work, while television requires none of it.  The movie amounts to what could likely be a 9-year old listener's visual projection of what he's hearing on the radio.<br><br>It's technically dazzling, too, with the lens darting into rooms, out of windows and around the action becoming its own frenetic participant, and there's some breathtaking shots of the exterior of the station, often accentuating its height and distance from the city street far below.  Brian Benben and Mary Stuart Masterson might strike the same one or two chords throughout the movie, but they're likable, as is this movie.  And Scott Michael Campbell is very funny as Billy the pageboy, a kind of wide-eyed Quentin Tarantino of the radio age; fast-talking (everyone in the film is fast-talking, actually) and easily distracted (the look on his face as he accidentally barges into the ladies' dressing room and becomes mesmerized by the sight of the topless actresses is priceless), his entire grammar and understanding of life is derived from the radio shows of which he has encyclopedic knowledge.<br><br>Finally, \"Radioland Murders\" closes with some wistfully ironic thoughts (the movie is mostly free of contemporary irony, with the exception of this and an unsuccessful line about warning labels on cigarette packs) about television (best summed up by three uniformed cops hypnotized by a cathode ray tube) and the immortality of radio.  A movie more about myth than story, \"Radioland Murders\" is written in the scattershot style of the radio programs depicted.  It might merely be a sanitized and moderate entertainment (particularly when viewed against something like \"The Hudsucker Proxy\"), but it's affectionate, features lively music, looks great, and is completely innocent.","user":"MichaelCarmichaelsCar","rank":[33,37]},{"title":"Extremely Undervalued","rating":7,"date":"15 July 2006","review":"If you're looking for a serious mystery--or for that matter, a serious anything--don't watch this movie.<br><br>If you just want a fun movie that you can watch again and again, this one is for you! It takes place in the studios of radio station WBN on the night of its national debut. The station managers, directors, writers, and actors, already stressed with the debut and pleasing the affiliates, are shocked when a trumpet player in the orchestra is poisoned and killed. The station crew then has to keep the programs going while the police investigate and the writers go on strike. After more murders are committed, writer Roger Henderson, the innocent prime suspect, has to simultaneously evade the police, rewrite scripts for shows about to air, and solve the crime to prove his innocence.<br><br>There are some discrepancies and parts I'm sure critical people split hairs over. Don't expect a masterpiece, just some good fun.","user":"TheMrFrog","rank":[24,27]}]