[{"title":"An underrated film","rating":8,"date":"10 September 2005","review":"A few of the people making earlier comments missed the point of this film. The disease described wasn't AIDS-like, it was AIDS. I suspect a few viewers may be too young to remember the near hysteria of the mid to late 1980s that had otherwise rational people calling for all HIV positive people to be permanently interned.<br><br>Clearly the writer(s) of Daybreak wanted to illustrate one possible future in which fear was allowed to win out. This has a strong message to send us in 2005 too.<br><br>The love story was central to the movie as a chain is created from Ellen to Torch to Blue. Ellen was passionate about saving people. Neither Torch nor Blue started that way but took up the cause when the one they loved fell to the all powerful authorities. The lack of decisive ending, other than the continuation of the resistance, shows that not all problems are easily solved and can be nearly wrapped up in a 1.5 hour movie.","user":"robert-705","rank":[21,26]},{"title":"Cuba and Moira shine","rating":18,"date":"18 January 2001","review":"This is a very excellent and overlooked HBO movie.  Set in the future where HIV positive people are sent to live in concentration camps and probably exterminated in the near future.  Cuba and Moria Kelly are excellent as the lead characters.  There's also a really hot love scene between Cuba and Moria, which is interrupted by a kid. This is a very excellent movie of what might happen in an intolerent Texas future.","user":"zaur-2","rank":[22,28]},{"title":"Promising Beginning Lost in the Melodrama","rating":5,"date":"24 September 2011","review":"In a near future in New York, the (north) American society is ruled by a totalitarian government. In order to control AIDS, the HIV positive citizens are tattooed with a P on the chest and sent to quarantine. <br><br>When the teenager Blue (Moira Kelly) accompanies her best friend Laurie (Martha Plimpton) to a government clinic for examination, they are advised on the street by the boy Willie (Amir Williams) to not go to the place. While in the waiting room, Blue and Laurie witness the treatment of the staff to an old lady and they decide to get out from the clinic. They are chased by security guards but Willie brings them to his brother Torch (Cuba Gooding Jr.) that hides and protects the girls. <br><br>Blue learns that Torch is the leader of an underground movement of resistance and the government quarantine is a sham and the patients are left to die in starvation. Blue falls in love with Torch and joins the movement. When Torch is arrested by the police, he is submitted to a test and finds that he is positive. He is sent to quarantine and Blue tries to find a way to meet him.<br><br>\"Daybreak\" is HBO film with a promising beginning, with a society controlled by a fascist government and a group of resistance that helps the sick people, giving dignity to them. The idea of resistance against a government is not original, but is usually engaging. Unfortunately there is a twist and the story changes to an annoying melodrama between the negative Blue and the positive Torch. My vote is five.<br><br>Title (Brazil): \"Amanhecer Sem Futuro\" (\"Dawning without Future\")","user":"claudio_carvalho","rank":[10,12]}]