[{"title":"Can be amusing for kids at least","rating":5,"date":"11 July 2007","review":"I first watched this live action Disney flick shortly after it came out in video in 1997. It was around the time of my eleventh birthday, and I was very pleased with the film, enough to watch it more than once. I don't know exactly how many times I watched it, but definitely several times. Years later, after seeing that the IMDb rating for \"Jungle 2 Jungle\" was low, I finally watched it again, for the first time in I don't know how long, and like I expected, it no longer meant much to me.<br><br>Michael Cromwell is a commodities broker in New York. It has been years since his wife, Patricia left him, and he now has a new fiancé, but before they can marry, he must go down to the Amazon (where his first wife now lives), to make the divorce official. While there, Michael learns that he has a son, who is part of the primitive tribe that Patricia now lives with! His name is Mimi-Siku, and while Michael is stuck on the island, the boy turns thirteen, the age which he is considered a man in this tribe. Mimi is assigned by the tribe's chief to go to New York and get the fire from the Statue of Liberty, so Michael reluctantly takes his son home with him. Mimi-Siku has always lived very primitively, and has never experienced city life, so while in New York, he is bound to unintentionally cause trouble! <br><br>Watching \"Jungle 2 Jungle\" after my adolescent years had come and gone, I didn't find it very funny at all. I smiled a few times (mostly the parts where Richard Kempster, Michael Cromwell's co-worker, played by comedian Martin Short, throws fits) but if I ever actually laughed, it was very slight, and if I saw the gag again, I probably wouldn't laugh at all. For the most part, I kept a straight face, and found most of the movie quite simply boring. There are also some jokes that are a tad embarrassing, such as Michael Cromwell lying awake in his hammock on the island while others around him are constantly farting in their sleep, and quite a few embarrassing quotes that are supposed to be funny.<br><br>It appears that Tim Allen has starred in a lot of movies that haven't been too well received. \"Jungle 2 Jungle\" is one of those movies, and right now, I can understand why. Overall, this is a mediocre Disney feature in my opinion, though many consider it lower than that. After enjoying this movie when I was eleven years old, then watching it again after growing up and not thinking much of it, I would say that it's definitely for the younger folk, and for adults, there are definitely comedies of this kind (ones about someone living a primitive lifestyle somewhere in the world and coming to a city for the first time in their lives) that are much more likely to impress you.","user":"Electrified_Voltage","rank":[14,21]},{"title":"Painting by genre numbers in a pointless and largely enjoyment-free film","rating":28,"date":"28 May 2006","review":"Michael Cromwell is a successful New York stockbroker looking forward to his marriage to a successful fashion model. However before he can do this he must finalise the divorce from his wife, who left him about 12 years ago. Unfortunately she lives on a tropical island off the coast of Brazil and he finds himself stuck on the island with her. If that wasn't bad enough he learns that the pale, 12 year old member of her tribe (Mimi-Siku) is actually his son. In order to avoid looking at the morality of her not telling him about this life, the story then requires Mimi-Siku to go to New York for reasons too boring to explain and \"laughter\" ensues and Michael learns some lessons that we all saw coming from a mile off.<br><br>It is rare for me not even to have the energy to type a decent plot summary for a film but for this one I make an exception. Part of the problem is the fact that the plot manages to be embarrassingly predictable from start to finish and provides nothing of value along the way. This is only made worse by the lack of laughs and the regular scenes of Mimi-Siku failing to fit in, one of the most embarrassing of which sees him dancing with his father on the street. It is a string of obvious scenarios all run together just as you'd expect and there is nothing of any interest developed along the way. There are plenty of \"wild fish out of water in big city\" films already kicking around and this offers no reason to add this to the list of the ones you've seen.<br><br>The cast are equally lost in the midst of all this stuff and resort to mugging and overplaying at every opportunity. Obviously Allen was going to do this anyway since this is what most of his films tend to be like. Martin Short does the same here and at least gets one, maybe two laughs as a result  which is more than Allen. The clearly well-off and white Huntington is hilariously poor as the boy of the film, he doesn't convince in any part of the film and is a big part of it being embarrassing. The rest of the cast have little to do and even a turn from Stiers adds no value.<br><br>Overall a roundly poor film that takes the \"wild fish out of water in city\" genre, ticks as many boxes as it can, writes lots of predictable and weak scenarios and places them all within a story that is so poorly developed that you pretty much know where it is going from the very start. No laughs and no interest  it might work as noisy nonsense to distract children but it has no value past that.","user":"bob the moo","rank":[8,12]},{"title":"Good Movie","rating":10,"date":"10 August 2004","review":"My opinion on Jungle 2 Jungle is not as harsh, the movie was cute. The fact that it was a remake isn't my complaint because it is really hard to find movies that haven't been remade from other foreign or alternative films. I give movies at least one chance. Tim Allen is, as usual, comedic while being a bit on the crazy side, but still funny in all the ways you would want him to be, if you like him. You are also introduced to Leelee Sobieski in her feature film debut (she had been in TV movies, but not really big movies till Jungle 2 Jungle came out). The movie in general is a great family flick, one that everyone can enjoy. I believe that is should be given at least one chance, so go out and rent this fun movie.","user":"ebot_00","rank":[8,12]}]