[{"title":"The 50's like they never showed them in the 50's!","rating":8,"date":"29 December 2000","review":"I first heard about this movie from a friend who knew of my love for the 50's rockabilly era, and I must admit I had my reservations. David Arquette, the kooky 1-800-CALL-ATT guy, as a tough, ultra-cool 50's rebel? I didn't think it could possibly work. Then I watched the movie, and discovered just how well casting an actor against type can work. Arquette truly brought Dude Delaney to life, and he was also fortunate enough to be surrounded by a perfect supporting cast. I especially liked O'Neal Compton as diner proprietor J.T. and the always-dependable William Sadler as Sarge, although John Hawkes, as lovable 'freak' Nixer, stole every scene he appeared in. Salma Hayek did a good job of making me alternately love and hate her Donna. Overall, I thought Roadracers was a lot of fun - quirky, exciting, funny, and with a great rockabilly soundtrack that had me dancing in my living room. Bravo to Robert Rodriguez - go, cat, go!!!!","user":"GirlwonderReturns","rank":[17,22]},{"title":"Wild, cool and funk-ay!","rating":8,"date":"17 November 2000","review":"Wild, cool and funky, \"Road Racers\" is a gem of a movie.  The quintessential \"wild-assing\" picture, and I disagree with Maltin that there was too much violence.  Only five minutes right at the end?  The rest of the violence was mainly verbal, and I felt for all the characters, including \"Teddy Leather. The real crook in the movie was his father, the police chief, and in the end there were really no victims.  Life Happens, and in the end Dude gets it together and does NOT end up like his father.  Hidden plot complexities make this film watchable well over one time.<br><br>Nicely done!  Rent it on video some night if you like wild, crazy, unpredictable and humorous.  This movie is \"Grease\" for grownups.  If you're a smoker, make sure you can smoke wherever you see the movie, everyone is smoking constantly throughout the picture.<br><br>Hurt only by its low budget... some of the cuts in the car chase scenes really bite.  But you could tell David Arquette really had some fun with this role.  8/10.","user":"The_Core","rank":[12,16]},{"title":"The coolest Dude","rating":10,"date":"12 February 1999","review":"Nothing even comes close to this masterpiece. No wonder Tarantino's favorite director is Robert Rodriguez. The cars, the grease, the music, the Dude, Salma Hayek, the ambience, the...the...the...I'm speechless","user":"Aridriel","rank":[13,19]}]