[{"title":"Inscrutable, yet interesting study....","rating":9,"date":"4 June 2006","review":"of Jean Michel Basquiat and the art world of the 80's. Granted, the film is a bit abstruse, and some viewers have complained about the music tracks (actually Basquiat's own music from his band); but it does serve to show the disaffected life of an artist, who seemed to gain fame, money, and fair-weather friends, despite himself.<br><br>Jeffrey Wright is very understated, but believable as Basquiat. Apparently he and his father were estranged, until he became famous. Then everyone wanted something from him. Not just another story of fame and its vices, however; because the film does NOT show his life as glamorous, indeed once he has \"made it\" we still see him dining at Lutece, people critiquing, being unaccepting of him as a person. Perhaps in real life this was one of the sources of his insecurities, and reason for his drug addiction. Certainly, if one believes even half of what is written about the NY art world- it cannot have been a forgiving place.<br><br>That aside, the film also has some interesting cameos, David Bowie as Warhol is excellent, Dennis Hopper as the Zurich art dealer, Bruno Bischofsburger is very believable. An amusing cameo with Christopher Walken as a James Lipton character; a pretentious interviewer. The only annoying performance was Parker Posey, as gallery owner Mary Boone, who perhaps portrayed this person too close to the mark.<br><br>Keeping in mind that Basquiat was under age 30 when he died, this story is credible. An artist who rose too fast, was used and discarded- apparently in real life Basquiat had a tendency to be generous, and gave away many of his paintings. There is one scene where he is beaten up so two street people can take steal a \"SAMO\" inscription on a piece of metal.<br><br>The visuals are also noteworthy, while an earlier review critiqued the surfboarding sequence, I find that a preferable segue to Basquiat's need to escape; apparently he owned a good deal of property in Hawai'i and spent time there as well.<br><br>The scenes with Claire Forlani are also effective, Basquiat's some-time girlfriend, we see her as a waitress, then a junkie, then a cleaned-up version, going to Columbia. The NY street sequences are realistic, It is not glamorous (though the accompanying jazz music is). It shows the schizophrenic nature of NY; Lutece, a homeless person sleeping outside, a man selling stuffed animals on the street, and Bruno Bischofsberger(Hopper) who mistakes Basquiat for a homeless person, trying to clean the windows on his Mercedes. Very realistic.<br><br>I highly recommend this film; it does not glamorize the story, and while it may not be completely accurate, it rings true, and portrays a life many artists may wish for, until they get it. 9/10","user":"MarieGabrielle","rank":[35,38]},{"title":"Basquiat - an inspiration.","rating":9,"date":"18 March 2004","review":"I thoroughly enjoyed the movie 'Basquiat'. It is a subtle portrayal of a complex character, beautifully acted by Jeffrey Wright. It would have been easy for the film-makers to go over board with this movie. Basquiat sure did have the character to allow that. And the fact they didn't feel the need to do that, is why I like this movie so much. It'd been easy to concentrate more on the drug taking, on his immense paranoia, and on his lively lifestyle that went beyond Andy Warhol and Madonna. And doing that would have probably got the movie more hype, attention and plaudits. Instead the makers of this movie just give glimpses of his life and merely suggest a whole lot more, and this works well. It's a movie that goes along more at a stroll than a run, and grows in stature and depth as it does so.<br><br>But, the 'problem' if you can call it that, with 'Basquiat' is that you need to know this man's art, and this man's character to really enjoy and appreciate this movie. And that's why I think it maybe doesn't get the sympathetic reviews or attention it deserves. If you didn't know about this man's life before seeing the movie, then I don't know what you could take from the film.  And if you watch it without knowing about him and his art, then I can imagine it wouldn't really hit the mark.<br><br>What makes this movie beautiful in it's subtlety is that it does great justice to the wonderful talent and nature of Jean Michel Basquiat. And if you love his art, then do watch this movie, it's well worth it.<br><br>\n9/10","user":"kickice","rank":[41,51]},{"title":"Genius or exploitation?","rating":6,"date":"14 August 2006","review":"\"Basquiat\" is a film with an agenda. Far from being a neutral stage upon which the life and emotion of the artist is played out for us to observe, this film wants to make a point about the art world, casting Basquiat as Oliver Twist. If you are looking to find out what drives an artist you are not going to find it here - unless the answer is money. The filmmakers did not go very far into the head of their subject - either that or he was a very shallow and vapid person. I did not get the feeling from this film that Basquiat was a true artist; rather, he came off as an opportunist who figured out how to capture the mechanics of bad abstract impressionism and pass himself off as one. Then a lucky break, combined with silly art collectors who have way too much money and not enough of their own thought processes, multiplied by a guilt ridden population of white people flush with 1980's cash, combine to equal the phenomenon of Basquiat.<br><br>I am not saying that this is (or is not) the truth. In the world of art there are no truths anyway. What I am saying is that this is not a neutral biography. It may pay to do a little bit of research into Basquiat before watching the film. As for myself, I admit to watching it only because I was bored and nothing else was on. I knew vaguely the story, and who Basquiat was, but had no opinions of and no real knowledge about him. Since I am not the type of person who forms his opinions on any subject based on information from only one source, I did some research into Basquiat after the film before coming to any sort of conclusions. What those conclusions were are irrelevant as far as this review is concerned - but what does concern me are the many people who undoubtedly had their opinion about Basquiat fed to them by this film and who now consider themselves educated on the subject.<br><br>As far as the film itself, it is not bad. Not great, but not bad. It had a certain feeling to it. But it is hard to get beyond its portrayal of the subject, as he is the reason for the film. As noted, Basquiat comes off as an empty headed and shallow individual without a lot of talent or original thought who likes to use drugs and drink a lot. The film's Basquiat seemed not to care much about art, that it was an afterthought to him. He was shown as a dabbler - dabbling in music too but not doing much or giving it much effort. Perhaps that is the truth, I don't know, because overall the film is more a study of art and what constitutes it and gives it value than a biography of an artist - and postulates that today's art is more about the name than the actual piece. The same thing that is given away for free by a homeless man who lives in a box can be worth six figures if the right people decide that it should. I also felt that he filmmakers relied on cliché' a bit too much for my liking. The scene that sticks out in my mind is the one where Basquiat was on a schoolyard basketball court with his buddy, who was trying to get him to play. Basquiat was totally inept at the game and had no desire to play whatsoever. The filmmakers were obviously trying to demonstrate either one or both of two things - that Basquiat was so much of a cerebral artist that he was incapable of physical sport, or that Basquiat was a black man who could not play basketball. Whatever the case, the scene was painful to watch. It was ham-fisted imagery at its worst. A well done scene with some good conversation and emotion could have sent the same message intended in the schoolyard - actually could have done it better because as blockheaded as the schoolyard scene was, it still did not send a clear and defined message.<br><br>The acting in Basquiat was for the most part serviceable, with David Bowie turning in the most inspired performance as Andy Warhol. Bowie brought a subtle warmth and humanity to a person who is often portrayed as a cold cartoon character. Although Warhol was clearly intended to be an exploiter in the film, Bowie managed to show him as a person who felt that Basquiat was a true friend and not just a paycheck. This is an Andy Warhol who cared about people, and who could have his feelings hurt just like anyone else. This is not the stereotypical movie Warhol, playing with people like the proverbial chess pieces. This Warhol genuinely admired the work of his protégés. And David Bowie would know, wouldn't he? He was there. I got the feeling that Bowie took the part to make a statement about Warhol - as if he was annoyed by younger filmmakers using the stereotypical Warhol image in an exploitative way. I felt that he was subversively reading the lines between the lines. Good for him.<br><br>This film is more a commentary on the art world, on racism, and on exploitation than it is a biography. I would say that it is better to look at it this way, for as a biography it is biased and somewhat mean-spirited. Remember the first line of this review? It seemed to me that the filmmakers were saying that Basquiat was bereft of talent and inspiration - that he was a bum and a drug abuser who got lucky. Perhaps he was, but I'd prefer to make up my own mind. So it would pay to know a bit about the subject before watching - this Basquiat is a light dessert, not the main course.","user":"jse126","rank":[26,34]}]