[{"title":"Engrossing Revolutionary War tale, though not historical","rating":7,"date":"13 April 2006","review":"Being Canadian, I probably know fewer details of the Revolutionary War than the average U.S. viewer, but note that many seem absolutely outraged at the historical untruths of this movie. When I watched it, I personally found it quite captivating but always have enough sense not to get my history from Hollywood. Since my viewing, I've looked up some info and note various inaccuracies such as misplaced characters, exaggeration of British atrocities, inaccurate torching of a church with townsfolk inside being burned alive, and depiction of American owned slaves being freed to serve in the Continental Army. (Apparently, it was the British who promised to free them if they joined their forces, but later reneged.) My apologies if my facts aren't straight. <br><br>It's the FICTIONAL story of a widowed South Carolina farmer, Benjamin Martin, who is disgusted by his past supposedly heroic deeds during the French Indian Wars. He has resolved to avoid participation when the Colonies revolt against Britain and stay home to protect his seven children. However, he witnesses atrocities against his two older sons, Gabriel and Thomas, by the cruel British Colonel Tavington. Gabriel, the oldest, has joined the battle against the Redcoats early on, been captured, and sentenced by Tavington to hang. Thomas, the second son, attempts to free Gabriel as he is being taken away, only to be killed by Tavington right in front of his father. This forces the reluctant Benjamin into the fray, organizing a local militia group of farmers and ex Indian fighters who will tie up the British until the French arrive.<br><br>Mel Gibson gives a moving portrayal of the father who is driven into a battle he sought to avoid in order to protect his family from the British. For me, his personal and family story is the essence of the tale. Just as one would expect, Benjamin Martin comes across as very sympathetic and heroic. Apparently this character is sort of a composite of possibly three different real men of that era. <br><br>The film has wonderful period costumes, though also (like Gibson's earlier Braveheart) more than enough violence for my taste. However, it did bring to life for me the Revolutionary War, unfortunately in a purely fictional rather than historical way. Though I enjoyed this picture, it seems to have taken a lot of liberties with the truth. The movie should therefore be considered strictly as entertainment, not a history lesson.","user":"roghache","rank":[92,121]},{"title":"Good but ........","rating":10,"date":"10 July 2000","review":"The Patriot is technically a good movie.  Nicely made with good characters, good acting, a strong storyline and fabulous cinematography.<br><br>But, to say this movie distorts history would be an understatement.  And that is extremely sad in a movie that sells itself as an accurate portrayal of events during the revolution.  The Patriot, unfortunately, crosses the line and try's to portray as 'actual fact' a film which is predominantly fictional.  Hence, the 'real life' equivalent of Benjamin Martin actually used to scalp Native Americans in his spare time (a fact neatly overlooked by the director).<br><br>This 'rose tinted' view of history is at its worst during the church-burning scene where a British Army officer ordered the murder of many innocent civilians by locking them in a church and setting it alight.  This event never took place and yet, thanks to The Patriot, a whole generation of Americans will believe that the British Army actually committed this horrendous act in South Carolina -- when in fact history shows that it was not the British Army that burned a church full of people in 1776 but the Nazis that did during WW2.<br><br>As a Brit, I don't so much mind Hollywood always portraying us as the 'bad guys' -- after all it is American money making these films -- I'm more concerned that some Americans actually believe what they watch.  This is especially true in movies like The Patriot which 'pretend' to be real.<br><br>It's a shame that in such a technically competent movie, which pays such attention to minutiae detail like the costumes, that something as significant as the accuracy of the screenplay could have been so grotesquely overlooked.","user":"Zal-5","rank":[275,406]},{"title":"Thoroughly entertaining","rating":10,"date":"4 September 2001","review":"I have been a Mel Gibson fan since his very good Mad Max and his horrible Summer City. I loved this movie and it is in my top ten favorites of all time. Mel is very believable as Benjamin Martin who fights only after he looses one son to death and one son to the army. Heath Ledger plays Gabriel Martin who goes to fight for his country despite his father's protests. I know that not all of the facts are historically correct but this is a movie and did not claim to be a history lesson. The period is portrayed very well and the battle scenes are so well done that you almost feel you are there. This movie is very graphic in the battles and if you do not like the sight of blood and other realistic battle scenes then this might not be the movie for you. I watched the entire movie and did not realize the length. I was so engrossed in the plots.","user":"karier13","rank":[32,42]}]