[{"title":"Disney never made anything more touching than this!","rating":14,"date":"14 March 2002","review":"Why would Aaron Fleming of Northern Ireland throw up at this movie? My theory is that you never had a warm childhood Aaron and nothing magical has ever happened in your life. It wasn't made for viewers such as yourself. I think TRAINSPOTTING might be more your line.<br><br>I'd go further than saying that Ted Danson was \"good\" in this - it is by far his best movie (with the possible exception of GETTING EVEN WITH DAD). As discredited, financially strapped and harrassed Dr Dempsey, Danson is bundled off to Loch Ness to disprove Nessie's existence. Not only does he fail in his task, but he finds something even yet more unlikely - the unconditional love of a little girl and her innkeeper mother played with feisty gusto by Joley Richardson. I would defy any true romantic to withhold a tear at the end of this movie...easily one of the most touching films of all time. Proof if such be needed that one can make a beautiful family movie with not a single swear word or offensive scene. <br><br>The very briefly glimpsed \"beastie\" is heart-warmingly portrayed, never more so than during the closing credits to a backdrop of Rod Stewart's \"Rivers of My Heart.\"  Veteran Ian Holm just about steals the show as the Laird and \"keeper\" of the secret. The scene on the bus when he opens up Dr Dempsey's envelope is worth the price of the theater ticket alone!<br><br>Saccharine?  manipulative?  unrealistic?  Yeah? well so was ET!","user":"uds3","rank":[42,47]},{"title":"Enchanting","rating":8,"date":"9 January 2002","review":"I like this movie. It maybe be lukewarm and saccharine as everyone else thinks, but it is far superior to all those Fifties and Sixties lake monster pics. Ted Danson does a wonderful acting job outside of \"Cheers\" and the special effects are magical. the whole production has a rather Disney feel to it as it makes you believe in magic and takes a different realistic view of one of the world's biggest mysteries. This movie does the same thing \"Harry And The Hendersons\" did for Bigfoot.","user":"aesgaard41","rank":[22,25]},{"title":"Great gentle story","rating":9,"date":"22 May 2006","review":"Okay, it's not exciting but it's still a great film - ideal for 'pleasent' viewing. The cast are brilliant, especially Joley Richardson and Kirsty Graham as mother and daughter - although it is a little unfair to imply that these two alone make the film watchable; others (Ted Danson, Ian Holm, &amp; James Frain) really do help to make this a great film. The story is slow and gentle, making it great for a quiet viewing session. The special effects are limited which allows for the storyline to show through and, even though the end is a little predictable, It's still good to watch right through to Rod Stewart's brilliant closing song. Go for it, I watch it over and over when the mood takes.","user":"johntheminiman","rank":[18,20]}]