[{"title":"Decent movie","rating":6,"date":"26 February 2009","review":"Motivated by my other weeks viewing of The Last Boy Scout (8 out of 10), I decided to follow up with another Damon Wayans film, this one directed by Peter MacDonald, the same man who did Rambo III of all films (quite a genre leap!). It is basically a middle of the road Romantic-Action-Comedy date film, the type that were churned out by the truckload during the early 1990's. R rated, so it dates this film a little bit, as the romantic-action-comedy genre is almost 100% exclusively a PG-13 genre for at least the last 10 years. <br><br>The film stars a moderately funny Damon Wayans (not his best) as a street wise guy trying to get 'mo money' by applying for a minimum wage desk job, as well as snag a girl. But things are never that simple, and his supposedly boring low paying job leads him into the middle of a laughable crime plot. The film also co-stars his annoying, goofy and much less funny younger brother Marlon Wayans (who always reminds me of a C-list celebrity in the Eddie Griffin style). I didn't recognize any of the other cast. The movie was written by Damon Wayans though, which is worth noting. <br><br>This is an average film at best, not unenjoyable, but certainly forgettable save for a couple funny scenes (very much in an In Living Color skit-com style). Every date movie cliché is here too, including the up-tight boyfriend, the fat and lovable comic relief, and the crime-caper sub-plot. Worth viewing only once for Wayans' Brothers fans, but otherwise not worth a DVD/VHS effort. But if it is on TV, check it out.","user":"Erich8192","rank":[6,6]},{"title":"decent","rating":9,"date":"11 February 2005","review":"I can't agree that this is a bad movie. I think it's funny and has a certain charm to it (thanks to incredible Stacey Dash and Damon Wayans). It's not The Thin Red Line but what did you expect? I expected a light and entertaining movie and that's exactly what it is. Nothing more nothing less. I would give it a 7 note but Stacey Dash deserves 2 more points:). For her alone this film is worth watching. But beside of her it has a nice romantic plot, the action plot isn't too sophisticated but it's enjoyable. The movie is a bit like a fairy tale(again thanks to Stacey Dash) but that gives it a lot of charm and I always enjoy watching it. I would highly recommend it if you want something light and easy for the evening.","user":"milosz_m","rank":[9,16]},{"title":"An all time fave!","rating":24,"date":"24 April 2001","review":"This movie is one of my all time favourites!  If you enjoyed the humour from In Living Color, then you will really appreciate this movie.  The movie is so enjoyable to watch because it has a bit of everything in it-action, comedy, romance and of course with the Wayans brothers you are sure to have good time!  I liked seeing Damon's softer side towards Stacy Dash, and Marlon's jealousy towards his brother's relationship with this girl. Also, the nightclub scene is a riot!  Overall,it is a great movie to watch, especially if you are a fan of the Wayans family, plus it has a wicked soundtrack as well!","user":"michellejenni49","rank":[7,12]}]