[{"title":"Antwone Fisher","rating":17,"date":"17 September 2005","review":"This is the ONLY movie I've ever been moved to write about. I rarely even watch movies let alone offer opinions, but this movie is exceptional in so many ways. The acting is powerful and believable (duh.. it's real..), and the entire story is totally captivating. I was watching on satellite and had to endure commercials, and it was sheer torture waiting for the movie to resume.<br><br>This has to be one of, if not THE finest film ever made. Congratulations to EVERYONE, especially MR. Fisher. I'm a 55 year old guy that teaches in Cleveland and I never thought I would cry, but there I was with tears streaming down my face, all alone in my living room late at night. This story should be told and retold for generations to come. Thank you Mr. Fisher, Mr. Washington, and everyone else. This was a life-changing experience - not a movie. God bless you all for putting this together. I just can't figure out why this movie is not huge forever. Well, I suppose I can hazard a guess, but I truly hope I'm wrong - I think we all know what that guess is...<br><br>Thanks again - not just for the movie, but for the most powerful message possible. If you haven't seen this movie, SEE IT NOW! You won't be sorry, but if you don't see it, you'll be missing the experience of a lifetime. BJL","user":"b_blocke","rank":[81,97]},{"title":"A classic `grab at your heart' story about a troubled young man's life and search for happiness.","rating":14,"date":"14 July 2003","review":"The protagonist, Antwone Fisher is played by the up and coming young actor, Derek Luke.  Luke is a young sailor, filled with rage, easily provoked, and often unable to control his emotional outbursts.  His temper soon earns him several mandatory sessions with a naval psychiatrist; played by Denzel Washington (he also directed the film).  Early on, their personalities clash, but eventually Washington unlocks the two sources of Luke's anger-an abusive childhood and a pervading fear of being abandoned.<br><br>The film takes us on a journey of Luke's life, one marked by periods of intense loneliness and sadness while being driven by a constant search (an obsession) for family.  It is through Luke's life that we learn that perseverance can carry us through the periods of darkness and eventually deliver some form of happiness<br><br>By counseling and befriending Luke, Washington enables him to deal with his lifelong sadness and move on. When the film wants to grab at your heart, it succeeds with good writing and convincing performances by Luke and Washington.  In a graphic abuse scene from Luke's childhood, Washington artistically and gutterly insures that we not only empathize with Antwone, we personally experience his helplessness.  This scene, which showcases Washington's directorial skill, places Luke in a full frontal position, trembling, with the whites of his eyes looking directly at the camera (the viewer).  Anyone watching the screen can't help but be mesmerized by the abject fear in Luke's eyes.<br><br>As the film progresses, Washington, the director, introduces two minor twists to the plot.  The first highlights Luke's reluctance to trust as he begins dating for the first time.  This sub-point is purposeful and displays the infinite lingering effects of Luke's childhood on his adulthood.  The second involves martial (family) problems within the psychiatrist's life which, while ironic, is never developed.<br><br>Much like his performance as a compassionate lawyer in Philadelphia, Denzel Washington's screen presence in Antwone Fisher commands our attention and emotions, leaving few dry eyes in the theater. This film's writing, direction and acting exposes our souls and grabs our hearts.","user":"skomormj","rank":[39,46]},{"title":"An incredible film I recommend to everyone","rating":10,"date":"9 September 2004","review":"An adaption of the book 'Finding Fish'. This story is about a troubled young sailor Antwone Fisher (Derek Luke) who tells the painful story of his past to a psychiatrist Jerome Davenport (Denzel Washington). A brilliant debut performance by Derek Luke and an always stunning performance by Denzel Washington.<br><br>This movie was incredible on so many levels and I was disappointed that it didn't win an Oscar, I think it was because it was released at a bad time that's why it was overlooked. I strongly recommend this film to everyone, you'll be touched by his story and it really does make the audience become empathetic with this young man that is Antwone Fisher.<br><br>If you like inspirational true stories, then watch Antwone Fisher.<br><br>Thank you","user":"ChavRose06","rank":[36,44]}]