[{"title":"Underrated, Very Funny","rating":8,"date":"5 March 2004","review":"\"Slums\" is one of the more underrated films of the 1990s. It seems to rub some people the wrong way for unclear reasons, but I found it to be touching and hilarious from start to finish. Perhaps I'm just a sucker for Alan Arkin, whom I've always liked, and see on screen all to infrequently. More likely I was impressed by the witty script, deft direction and solid cast. I especially appreciated the spot-on portrayal of Southern California during the mid-70s, which just happens to be the era when I migrated from \"back East\" to Los Angeles. Fortunately, we weren't as hapless as the Abramowitz family, who throughout this film are trying desperately to hang onto the ragged edge of the good life.<br><br>This is one \"coming of age\" story that you don't need to be a teenage girl to enjoy.","user":"Ignatious J Fathead","rank":[29,33]},{"title":"Nifty Little Movie That Never Got Much Attention","rating":6,"date":"20 February 2005","review":"THE SLUMS OF BEVERLY HILLS (3 outta 5 stars) I figured this was going to be just another silly movie about the trials and tribulations of spoiled rich kids in Cali. Actually it's a pretty good coming-of-age story circa 1976. Vivian (Natasha Lyonne) has just grown breasts and now considers herself deformed. Her dad (Alan Arkin) is a divorced man of almost-retirement-age who has never been able to provide a stable home for his kids and keep dragging them from place to place like nomads (and presumably keeping one step ahead of bill collectors). One brother is a struggling actor and the other is too young to really fit in anywhere. In a desperate attempt to make ends meet Arkin takes in his troubled 29 year old niece (Marisa Tomei), charging his rich brother a fee for keeping an eye on her. So they all move into a small, cheap Beverly Hills apartment block and try to cope. Very funny moments... punctuated by some heavy drama and some unexpected twists. One of the better roles that Alan Arkin had had in recent years... proving that he hasn't lost his touch as he's gotten older (unlike many other comic actors of his generation). I have never been much of a fan of Marisa Tomei but I liked her a lot in this movie. The scenes of her and Lyonne conversing in their \"secret language\" are priceless!","user":"hokeybutt","rank":[16,19]},{"title":"This movie is cinema distilled to its truest and purest essence","rating":10,"date":"8 August 2004","review":"Now, I am a middle aged male movie buff, and although I like and have watched lots of movies, and all kinds of movies, comedies are not that high on my list, generally speaking.  When I read the tv guide, it said this movie was a comedy. So I tuned in, expecting to not be too excited about the movie. <br><br>I tuned in about 10 minutes after the start of the movie, and gave the movie my partial attention.  But within 2 or 3 minutes, this movie had my full attention. I could see right away this one was something special. It comes as close to depicting a genuine species of lower middle class family life as I have ever seen.  It is a real gem. <br><br>And it is not really a true comedy, although it is quite funny sometimes. It sort of defies definition or categorization. Sort of wry and humorous exploration of the dynamics of a typical struggling, lower-middle class family.<br><br>No fancy camera angles. Not a special effect in sight (and I have enjoyed many movies with fancy camera angles and special effects--I am no snob). But this movie is cinema stripped to its bare essence. Just pure script and acting. And what a script. <br><br>Marisa Tomei is incredible. She should have won the Oscar for this one.<br><br>See it!<br><br>BTW, I cannot believe the lady who scripted and directed this one has not gone on to do more directing or writing!  What a waste of talent!","user":"anonreviewer","rank":[23,32]}]