[{"title":"Unique, subversive masterpiece","rating":15,"date":"15 December 2013","review":"This film is about the ignorance of conquerors and the fact that war makes fascists of us all. Now that doesn't sound like a lot of fun, does it. But guess what: it is fun (by the truckload - at least if you have a pitch-black sense of humour and you do realise what this film is and what it wants to achieve).<br><br>Paul Verhoeven was a master at making Sci-Fi films which worked both as perfect mainstream popcorn cinema and as very intelligent social commentary on the direction - he felt - society was headed. And despite the fact that the over-the-top satirical elements and highly political undercurrents in his two previous sci-fi extravaganzas Robocop and Total Recall were only appreciated by a few critics at the time, those two films became huge hits at the box office: because they also offered great action, amazing special effects and overall great entertainment.<br><br>My guess is that Verhoeven felt encouraged by that success, and so with Starship Troopers, he didn't just sneak in some subversive parts: he went full-blown satire. Sadly, that didn't go down too well with audiences and critics alike; apparently most viewers didn't get the film at all (the - seemingly - good guys wear Nazi uniforms? What the heck?). Verhoeven even got accused of being a fascist, and it took the director's commentary on the DVD to finally make it once and for all clear what Starship Troopers is about and what the writer's and the director's intentions were. <br><br>I wonder whether the studio execs realised what Verhoeven was up to with that film; maybe the director just took their 100 million dollars and ran with it. The result, in any case, is a unique oddity that I personally feel is on par with films like District 9 or even Stanley Kubrick's Dr. Strangelove. It's a masterpiece. And much like another glitch in the Hollywood machine, David Fincher's Fight Club, films like that rarely get made (and not with such budgets), because more often than not, they end up as flops.<br><br>Apart from the underlying themes, on the surface Starship Troopers also has a lot going for it: amazing effects that still hold up very well and insanely intense battle scenes with more blood and guts than even the meanest gore-hound could wish for. So no matter how it came about that a studio ever green-lit this and gave Verhoeven a 100 million dollars - I for one will forever be grateful for this unique subversive masterpiece. My vote: 10 out of 10<br><br>Favorite films: IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[211,247]},{"title":"Better -- and more disturbing -- each time I watch it","rating":28,"date":"28 July 2004","review":"This movie never fails to generate strong reactions, both positive and negative.<br><br>Much of the negative criticizes the wooden acting, soap-opera beautiful stars, and unreasonably military tactics that lead to an enormous human body count.  <br><br>But that misses the whole point.  The actors and plotlines are supposed to be caricatures of themselves.  We are presented with a seemingly utopian society, where everyone is beautiful, the world is united under a single government, and patriotism is rampant.<br><br>The further the movie goes, the more the viewer realizes just how horrific this supposed utopia really is.  Patriotism is exploited to trick young men and women into going off to a pointless war.  The beautiful people are mercilessly chopped to pieces by their insectoid opponents.  And the united world government uses its control of the media to brainwash the public into supporting this bloody war.<br><br>Yes, the Nazi symbolism is a little heavy-handed.  But that's the whole point -- the intertwining of this \"perfect\" society with such a deeply evil subtext is supposed to be disturbing.  What's even more disturbing is how close to our recent (American) history this movie truly is.  Yes, it's a caricature, but it's a caricature of a very real and frightening phenomenon.<br><br>How different are the government propaganda ads in Starship Troopers from the \"Loose Lips Sink Ships\" campaign or the \"10% for War Bonds\" posters in 1940s U.S.?  How dangerous is it to have a society where everyone looks the same, thinks the same, and acts the same, even to their own death?  This is the message behind Starship Troopers, and it's a chilling one at that.<br><br>And for me, it works.","user":"obiwan26","rank":[717,936]},{"title":"Best satire since Dr. Strangelove","rating":10,"date":"23 July 2003","review":"Starship Troopers is a subtle and insidiously subversive movie that proved frighteningly prescient in the wake of post-9/11 uberpatriotism.  Both Heinlein's book and Verhoeven's film are valid and interesting political statements at opposite ends of the spectrum.  Heinlein's novel was criticized as fascist at the time of its publication, and for all his obvious talent as a writer I'm inclined to agree.  The movie is as much a sendup of the original novel as it is a satire of jingoist American politics.  It really is a shame that despite the squeaky-clean heroes plucked straight from the soaps, the Mormon extremists, the multiple-amputee mobile infantry retirees and the propaganda shorts masquerading as news, the vast majority still seems to regard Starship Troopers as a stupid action movie and, for some reason, absolutely refuse to consider that it might be something more.<br><br>10/10","user":"DeadpoolX","rank":[692,926]}]