[{"title":"An imaginative awesome the best stylish action film ever made!","rating":9,"date":"30 October 2015","review":"Blade II (2002) is the vampire superhero action horror sequel film to the original film Blade (1998). We have a kick ass sequel to an R rated kick ass first movie you go the mix of Daryl Dixon who still looks the same and a ball headed Hellboy Excellent!!! Blade II is an awesome movie!!!! Not only does it takes 4.years for this movie to come out since the last movie, but we see Wesley Snipes returning as Blade and he Is awesome!! I love this film but I love the first one way more. It is my second favorite in the Blade trilogy series. <br><br>So in this movie Blade is on a search for a Whistler, who is now a vampire in this movie. He tracks him down, he finds him, than he meets up with this group of vampires called the Bloodpack. They need his help to track down Nomak (Luke Goss. and he has basically an ability to turn vampires in to Repears that can hunt both vampires and humans. <br><br>So, yea...That's your basic plot. There are a lot of twist from here and now, but it is AWESOME! Because Wesley Snipes knows all those martial arts, they are nice to look at, and since it is 2002 we now got in to the phase, where the fights scenes are awesome and the choreographer says something once heavy handed, you will see bloody violence right away when the character turns in to an CGI model and it is shown trough whole movie, you can really see that, specially old dude drops kicks, kicks Blade right in the face and goes in to an CGI character, you can kind a see that, kind a weak, but does it track down from the movie? Hell to the no! This movie is awesome!!!!! The beginning of the movie, in the first 10 minutes, Blade already kills like 25 people. That's how it is done, just like in the first movie! He killed like 50 or 60 people from the very beginning of the movie it is AWESOME!!! <br><br>Whistler (Kris Kristofferson) is a bad ass! He is amazing bad ass! Norman Reedus like I said before still looks 12.year old boy, he is still Daryl Dixon, he still has the same hair style, the same look stubborn on his face and he looks like damn, don't you age boy. And you voice is going now heavy now todays world, but don't you age. Ron Perlman is awesome, he loves to make you hate him, but you can't hate him because he is Ron Perlman, you just laugh at him, because he is such a bad ass and he is such a an awesome, he is so awesome! Where is Hellboy III. Even in Alien: Resurrection (1997) Ron Perlman was standout in that film, come on, the man is just AMAZING! The effects in this movie is pretty good too, besides the fight scenes when they turn the CGI character however, but that's okay I can kind a forget about it because Spider-Man (2002) come out the same year, of course they also did do the same thing, yea, I guess you have to live, with that back than, I'm pretty sure they can do better now this days. Choreograph and everything, Guillermo del Toro takes over, this movie has director, David S. Goyer returns as the writer in this movie. David S. Goyer is a good writer, I have to give him that, he is an awesome writer! How do you make Blade even a more bad ass, than he already was? I think that was possible, it is possible. This movie it is possible and it is awesome! <br><br>Wesley Snipes has that charm back again, he has that to be a bad ass, but it has that humor aside Blade II, like in the strip club or whatever they were at. Ron Perlman really was about to shoot Blade and Blade had him track down at his gun and he sit like smiling, Wesley Snipes your gold boy your Gold!!! Without the doubt, the acting in this movie is awesome, Effects are awesome, Action is awesome, story is awesome, Cinematography it is kinda even a bad ass, you actually feel bad for one of the characters, tough she was cute, I am just saying. In the end of the day Blade II is one of the best sequel ever, you have to watch this movie!!!!! <br><br>Guillermo Del Toro is endlessly imaginative when it comes to creating new style, action, and ideas for the vampire mythology. Now the plot doesn't have much character development, but it has just enough interesting twists to keep you interested as well as entertained. And like I said, if you are looking for a movie with brains, this movie should meet your criteria, but if you appreciate brawn, this will blow you away. <br><br>The sword-wielding warrior Blade (Wesley Snipes - \"Demolition Man,\" \"White Men Can't Jump\") returns to fight the Reapers, a new race of super vampires hell-bent on annihilating all other vampires before destroying the entire human race. Blade aligns himself with a high-powered team of vampires to defeat an evil greater than either has ever battled.<br><br>9/10 my second favorite in the Blade trilogy my number one will always be Blade the first one.","user":"ivo-cobra8","rank":[91,98]},{"title":"Nonstop big screen action","rating":10,"date":"14 October 2002","review":"You've seen Blade.  You know the story.  Now sit back and immerse yourself in this non-stop action movie.<br><br>The pace at the beginning is Guyver, with a little Fist of the North Star and Tenchi thrown in.  I think it was inspired from Anime.<br><br>I missed the Tai Chi sword forms in Blade, but we've got some Wing Chun instead.  It's all good.<br><br>There's no time for romance, or humor, just friendship, moral courage and action.  The lighting, background music, visual and audio effects are all excellent.<br><br>I've seen this movie on DVD but the effects are diminished.  You really need to see this movie on the big screen preferably with DTS sound.","user":"Keith-35","rank":[13,14]},{"title":"Great","rating":9,"date":"27 March 2002","review":"There are some types of movies that you walk into expecting a lot of killing,a lot of swearing and snappy dialogue. Blade II is this kind of movie, and it is great. The plot is great, (albeit a little predictable)and some of the computer graphics are extremely noticeable, but altogether this is a great action movie. So many people die a body count would be impossible. The second to last fight scene is unbelievable. Blade puts the icing on the cake when he vertical suplexes the last security guard through a plate glass floor. The music lines up perfectly with the fighting, and I was very impressed with the way the Reaper looks and feeds. A GREAT SEQUEL TO A GREAT MOVIE!!! Looking forward to a trilogy!!!","user":"mahlbowski","rank":[29,38]}]