[{"title":"Effective Screwball Comedy","rating":8,"date":"21 December 2005","review":"\"The Whole Nine Yards\" is surprisingly effective screwball comedy that reminds me of such classics as \"Bringing Up Baby\" though with way higher amoral body count. <br><br>At first the actors seem to be each in a parallel movie, with Matthew Perry doing physical slapstick comedy, Bruce Willis deadly serious, Rosanna Arquette just nasty, Amanda Peet being her \"Jack and Jill\" character (one of my TV guilty pleasures) and Natasha being like a super-model.<br><br>Then something clicks in and it just gets funny and I couldn't help laughing and laughing.<br><br>I hope Michael Clarke Duncan gets to keep those fancy suits, because it must be hard to get ones to fit him; with \"Green Mile,\" this performance impressively shows his range.<br><br>(originally written 3/19/2000)","user":"noralee","rank":[45,54]},{"title":"Gee, everyone is so sensitive to a mob comedy!","rating":7,"date":"29 May 2001","review":"Judging from the comments below, I guess being a hitman is not much to laugh at...and the term 'black comedy' doesn't come to anyone's mind? Does that extend to the fact that without George Raft going after Jack Lemmon &amp; Tony Curtis in \"Some Like It Hot\", they would have no reason to meet Marilyn, get on a train to Miami, etc. etc. ??<br><br>Of course its not funny in real life that people get killed. But this comedy starring Bruce Willis and Matthew Perry is very well done and had me laughing about it even when it was over.  It was so over the top and so overpopulated with killers and gangsters and contract killings that at times its hard to remember what's going on and who is out to kill whom, but it does not matter at all since its all in fun.<br><br>I do not like either of the leads, generally speaking.  I liked about five out of all Bruce Willis' movies and Perry I've seen on his tv show and enjoyed him but never really thought about him much.  In this they are both very well cast and when they strike up a friendship, its believable.  Willis does not do a 'goombah, fuggetaboutit' attitude or accent, thankfully, even though his character has an Italian surname, and does not mug for the audience at all. <br><br>Amanda Peet is very funny as a wanna-be hitwoman and a fan of the real killers, and Michael Clarke Duncan is also very funny. <br><br>\nOnly downside is Rosanna Arquette - bad casting choice here!  Maybe someone owed her a favor.  Ironically, she is not one of the people who has a contract out on her, though God knows she's annoying enough for one.","user":"Boyo-2","rank":[58,74]},{"title":"The Whole Nine Yards Of Fun!","rating":7,"date":"11 September 2007","review":"I rented The Whole Nine Yards a few days ago, and just watched it this morning, I'm such a huge Bruce Willis fan, I don't see him that often in comedies, so I was curious how this would work. But after viewing this film, I have to just say that this movie was just so funny! I couldn't believe how much it made me laugh, I know it's such a dark subject, but it was pretty cool how they just turned into a zanny comedy. Bruce Willis and Matthew Perry were just the most perfect choices, they were like ying and yang. Matthew as this guy who just is scared of everything and finally has something at the end to say where he has control and Bruce couldn't have been a more perfect choice as the cocky and yet charismatic hit man who could be threatening but yet the most likable guy in the world. The story was just very clever and worked so well with the cast.<br><br>Nick is just your average guy, he is a dentist and a very likable guy, but he gets walked on quite a bit, especially by his wife who he feels like he owes her family, so he won't divorce her. But one day, a new neighbor moves in, Nick notices him pretty much off the bat, it's Jimmy \"the tulip\" Tudeski, the famous hit man who has killed 17 people and also ratted out his boss. He's on the run from his boss in Chicago and has a ransom on his head. Nick actually likes Jimmy, but his wife, Sophie, says to turn him in and get the award. He goes to Chicago and falls in love with Jimmy's wife, Cynthia. When Nick comes back home to Canada, he learns from Jimmy that his wife has gone to hire a hit man to kill Nick. But Nick also learns that Jimmy wants to kill Cynthia, Jimmy's boss wants to kill Nick, Nick's receptionist is also a hit woman, pretty much everyone wants to kill everyone.<br><br>That's pretty much the best way to sum up The Whole Nine Yards, but trust me when I say that this is such a fun movie. I really had a good time watching this movie, Bruce Willis was just so great. But I have to admit that Amanda Peet's performance floored me when she was just admiring Bruce's work and getting advice from him on what her first hit should be like. She was just so adorable while being deadly. So please, I would recommend this film, it's a dark comedy, yes, but it's all good, just learn to let go and have fun if you're very sensitive on the subject.<br><br>7/10","user":"Smells_Like_Cheese","rank":[26,31]}]