[{"title":"awesome, honest flick...","rating":9,"date":"7 October 2005","review":"I've seen just about every gay movie out there, and 'edge of seventeen' is by far one of my favorites. The one word that best describes it is 'honest'....but it's also nostalgic, funny, wonderfully simple, yet beautifully complex. The viewer can start off enjoying how accurately it captures the mid 80's, especially the excitement and uncertainty that Eric, the main character, is experiencing. Then, as the story unfolds, each new development that Eric deals with as he comes to terms with being gay is so well done, so honest and nontheatrical, that it feels almost like a documentary. The movie's got a huge heart. Don't miss it!!!","user":"JrML66","rank":[35,37]},{"title":"This is my life!","rating":10,"date":"4 April 2006","review":"I saw this movie many moons ago, but have not been aware of this medium for commenting on it. <br><br>I adore this movie, it was my life. Eric's discovery of his sexuality one summer while working at Cedar Point in Sandusky Ohio is almost exactly how I discovered mine. I thought as I watched it that someone had stolen my journal, wrote a script about it, and then silently returned it without my knowing. Eric's first love. His making friends at a bar he was not old enough to be in. His developing style, in the way many of us did in the 80's, bad hair and worse clothes, but great music.<br><br>I could relate to this movie on so many levels. I think that any gay man that found himself in the 80's should watch this film and see where they fit into it. If this movie doesn't remind you of yourself, it is sure to remind you of someone you know.<br><br>Loved it!","user":"ianmichaels","rank":[31,38]},{"title":"HONEST, SMART & SEXY","rating":21,"date":"21 April 2003","review":"Anyone who grew up gay in the 70s and came out in the 80s can relate to some aspect of this wonderful film. The music, the clothes, and the look are perfectly recreated. The performances are honest, tender and intimate. The awkward conversations and situations only add to the realism. The complexity of Eric and Maggie's relationship is truthful and very emotional. Eric's internalized homophobia  is something most of us go through...especially when we are not ready to \"come out\" to our parents and ourselves. I can recall dressing outrageously and experimenting with my hair to make a statement just as Eric does and then denying that I was gay.<br><br>Yes, some men are portrayed as \"queenish\" and \"promiscuous\", but that's because some real men are.  QUEER AS FOLK should be this good.<br><br>Chris Stafford shines, Tina Holmes is incredible, Andersen Gabrych is seductive and Stephanie McVay is the mom we all wish we had. The fabulous Lea Delaria belting out \"Blue Skies\" is an added bonus. Looking forward to more greatness from the talents involved here.<br><br>A great gay companion piece to THE LAST AMERICAN VIRGIN.","user":"dougprinz","rank":[20,25]}]