[{"title":"Light and low on plot but an enjoyable little film with charm","rating":10,"date":"10 June 2003","review":"Three hours before his wedding and Roland is nowhere to be found.  His best friends, Mike and Slim, are both stressed trying to work out where they could be when they both get pages from his ex-girlfriend.  They go to her house to find him drunk and experiencing doubts.  As they drive around, sober him up and dry clean their suits for the wedding, they take time to uncover why he has doubts and also take a trip down memory lane and where they grew up in Inglewood.<br><br>Having seen several films on the trot where race is used to `comic' effect in a string of endless racist jokes it was refreshing to sit and watch a film where the cast were almost 100% black but the story was not told in relation to the colour of it's characters.  Instead the story is a straight story of childhood memories and it could easily have been any culture telling it.  Of course there is a thread of black culture running through the film but it is simply there as opposed to being the focus.<br><br>The story is slight and not totally together but it is interesting.  The reasons for Roland's doubts are not made totally clear by the end of the film and there is a suggestion that it is really just a frame for the memories to occur within.  This isn't too bad as the memories are really more of the story than the modern day trigger is.  Both strands work quite well as long as you don't expect too much, it has a gentle humour that is pleasant and enjoyable and both strands seem to be able to carry it.  The `to-camera' narration was a bit of a risk that I thought it didn't totally carry off but, happily, after the first 10 minutes it is pretty much absent for the rest of the film.  Some of the strands don't totally come to a close and the fact that the main plot (Roland going missing on his wedding day) is mostly a side issue is a distraction but not to a detrimental point.<br><br>The cast are all pretty good.  Epps is a good lead and is a likeable character.  Diggs is good looking but he doesn't act as well as he can for much of the movie  his `drunk' acting is pretty poor although he gets better as he sobers up.  Jones is a bit of a comedy figure but does his job well despite being the least developed of the three.  The teenage actors all carry themselves well, although in this modern tabloid world of hysteria it is a little uncomfortable to watch two young teenagers have sex (although I was relieved to find that the sexy one of them, Malinda Williams, was actually 24 when she played a 14 year old).  The women are all very good looking but have lesser roles as the males take the meat of the story  Tamala Jones is good and Epps' co-star from Love &amp; Basketball (Sanaa Lathan) joins him for a brief role.<br><br>Overall it is a very light film that has a plot in a very basic sense but is really more of a nostalgic trip down the teenage years that is told with honesty and humour.  It may not resemble any life I ever had but there were themes I could relate to.  Slight but fun and, after seeing National Security, Undercover Brother and Bringing Down the House (where race is used for humour, rather than being a side issue) The Wood was also a breath of fresh air.","user":"bob the moo","rank":[16,17]},{"title":"Pleasant Surprise","rating":9,"date":"17 July 1999","review":"The Wood has not received very much attention and PR that many of the other movies have, but it should.<br><br>The movie is about three best friends who grew up in Inglewood California (hence the title - The Wood). The movie actually takes place on the wedding day of one of the friends and two hours before the ceremony, the groom is a no-show. The other two friends manage to track him down and proceed to bring him back.<br><br>As they bring the groom back to the wedding, the three begin to discuss old times and throughout the movie, flashback is used to show these experiences. Younger actors are used to depict the current friends and their past experiences are shown to the audience. The acting by all the characters is superb and the flashback technique is used beautifully.<br><br>The movie shows the relationships develop over the years through the eyes of one of the characters (Michael) and the humor is sprinkled throughout the movie in well placed and well timed deliveries. This is a very endearing movie that everyone should see but unfortunately, in a summer of either blockbuster or toilet humor movies, this one may get overlooked. For anyone who gets a chance, see this movie. Overall rating 9/10.","user":"Rhino Rover","rank":[10,10]},{"title":"A simple film","rating":7,"date":"11 February 2006","review":"This is the type of film that you can just sit back and enjoy. The male leads(Diggs, Epps and Jones) have chemistry as well as their young counterparts. The plot is simple and easy to follow. Roland(Diggs) is about to get married, but chickens out and goes over an old girlfriends house instead.Then Mike(Epps) and Slim(Jones) are sent over there to go get him before the wedding. While getting him sobered up, Mike reminisced on when they first met. This movie is better than movies of the same theme(The Best Man, The Brothers, etc.) because the male leads are more likable and less one dimensional, although Rolands reasons for not wanting to get married aren't explained enough. Also, the girl that plays young Alicia is way too old for the role.<br><br>Bottom line, the narrative by Epps is good and it's not riddled with stereotypes. Also, the 80's soundtrack is great and this is an entertaining movie. 7/10","user":"jaronnimo","rank":[8,8]}]