[{"title":"It wasn't terrible","rating":7,"date":"7 August 2002","review":"...but it wasn't great, either.  An okay, light-hearted, feel-good comedy. Had a little too much TV-sitcomishness about it, and the main character lady was a little too neurotic, and her husband was a little too suspicious in a TV sitcom sort of way.  But all of that was just \"a little\" and overall it was fun to watch.  Mind you -- we caught it on cable -- I wouldn't have wanted to rent it!<br><br>I give it a B-","user":"jeffrey-46","rank":[7,9]},{"title":"Formerly forbidden fruit on which I fondly remember feasting","rating":9,"date":"21 December 2006","review":"I remember when I was around the age of 14, this movie used to be on once in a while... on basic cable! Every time it was on, I always watched and enjoyed every single minute. To this day, I still do.<br><br>This movie was the reason I wanted to learn how to play the harmonica... not to mention why I got into wearing flannel.<br><br>Let's face it: I'm a born romantic and I was hooked from the first watch.<br><br>I have it on VHS (which by the way, was a very difficult find) and I refuse to lose it.<br><br>I give this underrated great a 9 out of 10.","user":"Tenchi64589","rank":[8,12]},{"title":"Actually shallow - here's why I still give it 9!","rating":9,"date":"27 February 1999","review":"So how can I? The movie is rather shallow and all the scenes involving the kids are annoying, but you don't have to care about it. I remember having watched it several times always laughing and loving it. The main character is played by Harley Jane Kozak, who is really hilarious. Her character is almost neurotic but really very funny. Elizabeth McGovern is not really good, but you can still enjoy the pair. Bill Pullman is wonderful at his own very special terms, as he always is (or at least was before he starred in ID4) and Brad Pitt is also wonderful in this comedy. It was shot before he became this world-wide sex symbol or whatever and his role is the one of a pitiable, sensitive and slightly intellectual boy who has to bear quite a lot - of the gags. He's really likeable and laughable. I don't say that I didn't like him in other movies, but - check this out, OK?!<br><br>Though there is much cliche in the movie, the tone of most jokes is really different from common jokes. They all seem new and unique, so again: very good laughs.<br><br>And as I already mentioned, most of them are due to Kozak. Her crazy character offers so many opportunities for nice gags and the movie allows itself to exploit these opportunities. For example in dream sequences, both weird and lovable... in a way they're a class of their own.<br><br>Maybe it's a question of one's personal inclinations, but I can't see why one should not at least altogether enjoy \"The Favor\". 9 out of 10.","user":"DomiMMHS","rank":[8,13]}]