[{"title":"Roemello's Way","rating":10,"date":"2 January 2009","review":"I have always loved this film and will always love this film till my dying days. It reminds me of a time when Black cinema broke the mold with the stories that were told and how those stories were told. Sugar Hill is a well written and well acted tale film noir drama that never got the respect it truly deserves.<br><br>Roemello(Wesley Snipes) wants to break free from a world of crime but is constantly dragged back in. He cant live a normal life or have a girlfriend in it because something bad is always happening around him. His brother Raynathan(Michael Wright) is very high-strung and causes some of Roemello's problems plus he has to deal with his drug-addicted father A.R.(Clarence Williams III).<br><br>Wesley Snipes best performance is Roemello Skuggs. This movie proved beyond the shadow of a doubt that Wesley can act as well as play a serious role. Michael Wright is good as Raynathan even though he can get buckwild at times. Clarence Williams III is excellent as their drug-afflicted father A.R. He was always a great actor that never got enough credit for great roles such as this one, Hoodlum and Deep Cover. Theresa Randle is is pretty good as Roemello's girlfriend Melissa. She is innocent in the sense that she is not numb to death and violence and actually feels pain upon seeing something like for instance a dead body. Melissa is gorgeous as well as likable. There are also some strong performances by Abe Vigoda and Ernie Hudson.<br><br>I love the setting of the movie as well as the cinematography. Director Leon Ichaso has an eye for scenery and you can see that as you watch this movie. Its a shame that the movie didn't do well and the director never did another movie again. I would have liked to see another movie from him.<br><br>In short Sugar Hill is an underrated masterpiece. No self-respecting fan of Black Cinema should be without a copy of Sugar Hill.<br><br>PS: don't allow these trend-following cookie-cutter review writing craven sheep that run amok on IMDb dictate to you what is a good film. As far as they're concerned any film that doesn't make the Top 250 is not worth viewing. The opinions of spineless puppets are absolutely worthless.","user":"Newsense","rank":[11,11]},{"title":"Very powerful, dramtic movie!","rating":9,"date":"21 June 1999","review":"Sugar Hill is an intense movie that exposes the harsh reality of drug addiction and drug dealing. Roemello(Snipes) and Raynathan(Wright) are two brothers who are drug dealers in Harlem. Snipes and Wright gave great performances. Sugar Hill has a lot of drama and suspense and it is very realistic. The film has al ot of great monologue, And the message is very clear: \"Don't Do Drugs\".","user":"K-Ci","rank":[16,19]},{"title":"this is how it's done...","rating":27,"date":"27 April 2003","review":"I really felt this story starring Wesley Snipes and Michael Wright.  It really shows the struggle of two brothers up to their present point in time, of how they were exposed to the drug game at such an early age from the death of their strung out mother to the crippling of their father thanks to the mafia.  It was such a real story that sent out a strong message that got through to me - it's kind of a good guy/bad guy hood flick with a strong crime element and brutal murder scenes.  Wesley Snipes is great as the hustler w/ a conscience but it was Michael Wright who delivers as the trigger-happy older brother who will murder just about anything that tries to invade his...<br><br>Sugar Hill is a movie that packs a wicked punch...great movie - in urban cinema this is easily a classic","user":"whoTheFuqRyou","rank":[9,10]}]