[{"title":"One of the best Movies ever made!","rating":10,"date":"24 October 2012","review":"The X - Files The Movie is the best one in the entire series. I have Seasons 1 - 9 all on DVD and i bought recently the movie on DVD too. I watch the movie so far twice and i absolutely love it so so so much. The series is awesome but the movie is best one ever so far i love it so much. The movie was shot on a lot of locations the same as the story follows. The movie continue the run from the end of the fifth season where Season 5 end it and The X - Files got close. The movie begins here. The story follows Thirty-seven thousand years ago, a deadly secret was buried in a cave in Texas. Now the secret has been unleashed. And its discovery may mean the end of all humanity. When a terrorist bomb destroys a building in Dallas, Texas, FBI Agents Fox Mulder and Dana Scully are drawn into a dangerous conspiracy surpassing anything they've ever encountered. With the dubious assistance of a paranoid doctor (Martin Landu), Mulder and Scully risk their careers and their lives to hunt down a deadly virus which may be extraterrestrial in origin - and could destroy all life on earth. Their pursuit of truth pits them against the mysterious Syndicate, powerful men who will stop at nothing to keep their secrets safe, leading the agents from the cave in Texas, to the halls of the FBI, and finally to a secret installation in Antarctica which holds the greatest secret of all. Terry O'Quinn also stars as Darius Michaud FBI Agent who leaves that terrorist's bomb explodes in the building so they can cover the truth about the deadly alien virus. Chris Carter &amp; Frank Spotnitz are awesome writers with story and amazing job by Rob Bowman as the Director of the movie. David Duchovny and Gillian Anderson are amazing as FBI agents Fox Mulder and Dana Scully. The movie is the best i am glad that William B. Davis is also here as Cigarette Smoking Man and The Well-Manicured Man portrayed by John Neville are also here. Gosh i miss John Neville so so so much in Next Seasons in The X - Files. The Lone Gunmen are also here is mayor part in this movie. So far i have seen only the first seven seasons. Did not see the Eight and Nine Season yet but i will start watching it. The X - Files series are so awesome but the movie is the best one of all X - Files. I can't wait to see someday second movie The X Files: I Want to Believe. I heard some badly critics about that movie and some fans were really disappointed, i hope i wan't be. The X - Files movie is really awesome the best one best one. I vote 10/10.","user":"ivo-cobra8","rank":[87,90]},{"title":"Not just for X-Files followers.","rating":7,"date":"19 June 2002","review":"To start off with, I do not watch the TV show, so I'm coming from a place of ignorance when it comes to The X-Files: Fight the Future. However, even without knowing anything about the characters or story lines, I found that I enjoyed this movie a lot, and will probably now start watching the shows reruns. <br><br>The movie starts off tens of thousands of years in the past, where an alien life form is roaming in underground caves. Fast forward to the present, and that same life form is unearthed by some kids in Texas. No one knows what killed this boy, and the firemen sent down to save him. Or maybe, someone does know. Enter Special Agents Fox Mulder (David Duchovny) and Dana Scully (Gillian Anderson). A seemlingly unconnected terrorist bombing is linked with the mysterious deaths in Texas, and lead Mulder and Scully all over the world to figure out this global conspiracy. Who knows about this alien life form? And why are they trying so hard to keep it a secret?<br><br>\nFrom what I've been told, a lot of the regulars on the TV show make an appearance in the movie. But as I said earlier, even without knowing who these people are, the movie itself is good enough to stand on its own. What I found I liked the most, and the reason I'll start watching the show, is the interaction between Duchovny and Anderson. After 5 years together, these two work perfectly as a team. They know each other so well; you feel the chemistry and tension between them. The supporting cast was strong, and I liked the idea that an entire alien race is being hidden from the world by a bunch of old white men. The story itself, while again from what I hear doesn't really conclude any plot points from the show, nor start any new ones, manages to stand by itself. The scenery was terrific, especially the opening sequence in the underground caves. What I was disappointed with was it seemed as if Duchovny was in the movie a lot more than Anderson. It was as if he was the star of the film, and she was a supporting member. The story seemed to revolve around him, and she was there to play off of. I wish that Chris Carter (the series writer and creator, and screenwriter for this film) would have made her more of an equal. The other problem I had was that while the plot was good, at times it wasn't explained as much as it could have been. The reason for the cover-up wasn't made as clear as it could have been, at least in my mind.<br><br>\nWhether you're a fan or not, The X-Files: Fight the Future is a good way to spend a couple hours in a nice air conditioned environment.","user":"chrisbrown6453","rank":[86,100]},{"title":"Good Jump to the Big Screen.","rating":6,"date":"6 July 2002","review":"Well-paced and well-crafted, \"The X-Files\" is a surprisingly good movie that does not try to get cute and go away from the things that made the series such a national phenomenon. David Duchovny and Gillian Anderson seem out of place working with bomb squads and doing other mundane duties after their department is shut down by the government. However the two feel that something really major is up which involves alien colonization on Earth and a vast government cover-up that goes through the highest places in the U.S. political realm. A good screenplay and solid direction make \"The X-Files\" a first-rate film from a very good cinematic year. 4 stars out of 5.","user":"tfrizzell","rank":[61,80]}]