[{"title":"One of the best (and also most underappreciated) films of the 90's","rating":8,"date":"24 August 2018","review":"\"Strange Days\" is a unique science fiction and mystery film. Set in Los Angeles during the last two or so days prior to the new millennium, the cast is helmed by Ralph Fiennes as the charming, brave, but shady Lenny Nero. Lenny is a former LAPD officer who loses his job for mostly unknown reasons. He then becomes a black market hustler who sells people's recorded memories for profit. For the most part, these recorded memories are either violent or sexual in nature.<br><br>Angela Bassett does a great job complementing Fiennes' \"Lenny\" character in her role as Macy, Lenny's close friend who makes a more legitimate living as a limo driver and security specialist. Lenny and Macy soon become embroiled in a murder mystery involving corruption within both the LAPD and the music industry. This seemingly ever-deepening mystery also involves Lenny's other close friend, Tom Sizemore's character \"Max\". Max is a private eye who, despite seeming to be very well-intentioned, is just as shady as Lenny. Juliette Lewis rounds out the cast as \"Faith\", Lenny's troubled and devious rock singer ex-girlfriend.<br><br>\nBesides the awesome and well-acted performances, what made this movie stand out to me is just how on the nose some of the background references are in it. References to an economic collapse, increasing gas prices, and strained relations between the police and minorities make this a very odd foreshadowing of the actual real-life future.<br><br>\nIn conclusion, great acting, a very deep and interesting storyline, and great cultural references make this a very highly recommended film.","user":"tdh_fbi","rank":[30,33]},{"title":"The Most Underrated Of Cyberpunk Noirs","rating":8,"date":"11 February 2018","review":"Probably one of the best big-budget sci-fi films to never reach a big audience. Written and produced by James Cameron and expertly directed by Kathryn Bigelow, this film is more noir than actual sci-fi - although the sci-fi elements are important. With a great cast and an amazing atmosphere throughout, this is one not to miss for fans of thrillers, film noir, sci-fi and especially the subgenre knwon as cyberbunk. 8 stars out of 10.<br><br>In case you're interested in more underrated masterpieces, here's a list with some of my favorites:<br><br>imdb.com/list/ls070242495","user":"gogoschka-1","rank":[43,50]},{"title":"Terrific science fiction offering.","rating":17,"date":"17 May 2003","review":"Strange Days is a truly astonishing science fiction offering, part scripted by James Cameron and directed with relentless panache by maverick lady-director Kathryn Bigelow. It presents a depressing and bleak, yet worryingly probable, view of the near future, and hooks its story threads upon the impending millennium eve celebrations. Although December 31st, 1999, has been and gone since the making of this movie, it is a credit to the makers that this film still offers a plausible viewpoint about where the world might be at in the next decade or so.<br><br>Ralph Fiennes seems initially miscast, but soon wins over the audience as Lenny Nero, a sleazy racketeer who sells \"memories\" captured on some form of disk, similar to virtual reality but recorded from real experiences rather than computerised ones. He is desperately trying to get back with his ex-girlfriend Faith (Juliette Lewis), but she doesn't want him as she has hooked up with a music producer named Philo (Michael Wincott). Lenny acquires two disturbing tapes, one showing the rape and murder of a woman, the other showing a racially motivated slaying, and before he knows it he is on the run from the culprits who want to kill him before he exposes their crimes. The only person he can trust is his best friend, lady bodyguard Mace (Angela Bassett). To complicate matters further, his ex-girlfriend Faith seems to know something about the disks, and may either be involved in the crimes or at great risk from those responsible.<br><br>Bassett is the real star here, in the role of a lifetime as a morally strong and physically stronger heroine. Lewis plays the same old white trash girl she has played many times, but at least she has the experience to bring total conviction to the role. The production values are incredibly high, especially the party at the end which seems to realistically convey an entire city celebrating in the streets. The plot unfolds slowly, but this is a strength rather than a criticism. Each new development slots into place beautifully, and the audience is given time to get into the characters and the situations (which, in too many movies, we are not allowed to do since the pace is often too frenetic).<br><br>Strange Days is challenging and aggressive and frequently disturbing. It is also inventive and exciting and ingeniously staged. It is simply a terrific science film which any devotee of the genre absolutely must see.","user":"barnabyrudge","rank":[117,155]}]