[{"title":"The lore and past life of Young Girls of Rochefort","rating":8,"date":"22 November 2013","review":"It was 25 years since Jacques Demy made Young Girls of Rochefort in (yes you guessed it correctly) Rochefort, a small harbor town which has little to boast off other than this famous and wonderful French musical was made there.<br><br>So Varda is invited to the celebration of the big day (well 3 months) in the life of the inhabitants who have seen the film countless time and regard it as one of the high points in their history. Streets are named in honor of this film, the town is painted in the colors of the film and people dress up like the characters of the film.<br><br>Varda interviews people who took part in making the film, people who stood at the sidelines and watched (and felt like this was a huge and wonderful party) and the shop keepers who had never made as much money.<br><br>We often forget how much a film can mean to the local people where it is filmed, especially if it is filmed in a small unknown place. The film is magical but its life does not stop there. It casts its spell over a town which thrives on those memories of Catherine Deneuve and Gene Kelly danced on their streets and become a part of its lore, an extension of its life. It is this past life Varda captures so well in this documentary.","user":"thao","rank":[7,8]},{"title":"An iconic film 25 years later","rating":9,"date":"19 February 2019","review":"Les demoiselles ont eu 25 ans (1993) is a French film shown in the U.S. with the title The Young Girls 25 Years Later. The movie was written and directed by Agnès Varda.<br><br>The Young Girls of Rochefort, directed by Jacques Demy, became an iconic movie after it was released in 1968. Twenty-five years later, the people of Rochefort held an extravagant event to celebrate the film and its positive effect of bringing Rochefort out of its \"Sleeping Beauty\" slumber.<br><br>Director Agnès Varda is Jacques Demy's widow. Although she didn't participate in the movie directly, she was there taking photos and videos.<br><br>Many of the film's stars returned to Rochefort, including Catherine Deneuve, and Jacques Perrin. Composer Michel Legrand was there as well.<br><br>Varda is too good a director to only focus on stars. (The camera just wants to follow Deneuve, but Varda won't let that happen.) Varda presents interviews with bit players and extras. In the film, Deneuve and her sister Francois Dorleac were supposed to be twins. (They were sisters, but not twins.) Some twins were used in the films, and they are interviewed. Two of the school children, who were both extras, met again years later, and eventually married.<br><br>In 1993, tourists still came to Rochefort to see the places where the filming took place. (By coincidence, 2018 was the 50th anniversary of Young Girls. I wonder how many people still remember it.)<br><br>Demy was a brilliant director who made films that were different from those made by other French directors of the time. He often said he was trying to imitate the Hollywood musicals of the era. However, how many Hollywood directors would transform the appearance of a city by painting more than one thousand shutters to match the color scheme of a movie?<br><br>This is a movie worth seeing, although it would work better in a theater. You'll enjoy it more if you can see The Young Girls of Rochefort before you see the documentary.<br><br>This film apparently can't be purchased separately. However, it's easy to find a Young Girls Criterion Collection DVD, which contains this movie as a supplement. That way you'll be able to see the Young Girls first, and then follow with Agnès Varda's documentary. It's definitely worth making the effort!","user":"Red-125","rank":[1,1]}]