[{"title":"Feel Good Movie","rating":9,"date":"7 April 2005","review":"I LOVED this movie. Not as great as \"50 First Dates\", but it's definitely a repeater, especially on a rainy day or with a group of girlfriends. Yes, the plot was \"cute\" and maybe even unbelievable, but what's so bad about a feel good movie. Drew as Josie and her romance with the teacher is so sweet and brother baseball wannabee adds to the movie's good feeling. With all the junk out there, what's so bad about a good movie the whole family can enjoy? Without being embarrassed while watching with your kids! Drew is an awesome actress that really seems to be unappreciated for the most part. This is definitely one of her best roles!","user":"JANETC-3","rank":[59,78]},{"title":"High School Do Over","rating":7,"date":"12 August 2008","review":"Never Been Kissed gives Drew Barrymore the chance to do something that maybe 70% of us would like to do. Go back to high school and make some necessary corrections. Actually the first time for me was bad enough and at my age I doubt I could pull it off the way Drew does.<br><br>Of course the reason could also be that once we leave high school it's like leaving a cocoon and we have to deal with the great big unfriendly world out there. I've known a few in my life who would go back and stay if they could. In fact there is a Law and Order episode which explores the dark side of this same situation. A girl looking young enough to pull it off, goes through high school at least three times and kills the person who stumbles on her secret.<br><br>With Drew though it's an assignment. She's a copy editor for the Chicago Sun Times who yearns to be a reporter. Publisher Garry Marshall who plays the part like Donald Trump took over the Sun Times gets this brilliant idea and just sees in Barrymore a young enough looking person to pull off the masquerade. <br><br>High School the first time was bad enough. Drew was not the most popular then and she's not doing better the second time around. That is until brother David Arquette also goes back to school and helps her over the rough patches.<br><br>Of course this raises a whole lot of issues for Drew, peer pressure from two sources, job and school. What's a girl to do?<br><br>Never Been Kissed is a light and charming comedy which to its credit skips over the opportunity to be crassly exploitive and gives us some good entertainment. Drew is very funny and sweet and her performance in moments of stress for her character moves nicely into pathos. Michael Vartan as her English teacher is the kind I wish there were more of in the education field and Leelee Sobieski and Jessica Alba play a pair of the empty headed cool kids that Drew tries so desperately to hook up with.<br><br>Still it doesn't inspire me to return to Midwood High School.","user":"bkoganbing","rank":[14,16]},{"title":"Love this film!","rating":10,"date":"6 April 2005","review":"This is a truly hilarious film and one that I have seen many times. Drew Barrymore is brilliant as Josie Geller, as is David Arquette as her brother. You cringe with embarrassment at the thought of her returning to high school as the film is a reminder of what high school was really like! Her outfits are wacky and weird, and it brings back memories of those who dressed a bit differently! The gorgeous Michael Vartan was adorable as the teacher (wish there had been teachers like that when I was at high school!) and Josie's boss is fantastic. This is a film you could watch again and again, with a fabulous sound track! One for all those at school in the 90's to watch!","user":"wee_linziuk","rank":[52,73]}]