[{"title":"An okay entry to the series but extremely watered down.","rating":12,"date":"12 October 2011","review":"At this point the CRITTERS series has pretty much lost its flare, this entry seemed to have taken itself more seriously because there was virtually no humor where the other films each had a fair share, the Crites never once shoot their trademark darts so the writers seem to have forgotten to add that small little detail and there is very little excitement because there's barely anything that happens.<br><br>On the plus side the acting was good all around and the script wasn't exactly terrible but the fact that this film leaves out certain key elements like I mentioned before is probably the film's biggest downfall, because for a film that has three others to live up to, this was rather disappointing.<br><br>The only thing that kept the film from being a total waste was the good performances by the cast, its not a bad movie and its mainly and okay entry but fails to reach any of the previous films due to the fact that several notable elements were left out.","user":"jhpstrydom","rank":[9,9]},{"title":"Could've Been Better!","rating":4,"date":"10 April 2012","review":"Don Opper, Brad Dourif, Angela Bassett and Terrence Mann star in this 1992 sci-fi/horror sequel. This sequel picks up where the previous film ended with bounty hunter, Charlie (Opper) finding 2 last Critter eggs. He gets a message from bounty hunter friend, Ug (Mann) instructing him to put the eggs in a pod to launch into space. Charlie does, but accidentally gets locked in and is cryogenically frozen with the eggs floating in space. After 53 years, The pod is found by a team of salvagers and they get a message from Counciler Tetra/Ug who thanks them for finding it and tells them to dock at one of his company's stations where they will be rewarded. He tells them not to interfere with the pod which gets opened with Charlie and the eggs getting thawed. After 2 members are killed, Charlie learns it's the future and helps the remaining members, Albert (Dourif), Ethan (Paul Witthorne) and Fran (Bassett) fight against more hungry aliens. Soon, Charlie and the others meet Tetra/Ug who's corrupt and wants the eggs. Charlie learns that Ug has changed and the film ends in a climatic showdown. This final installment could've been better and the main thing I didn't like was that Ug was bad. Brad is great as usual and probably one of the only good things about the film. I still recommend this if you're a Critters fan.","user":"gwnightscream","rank":[6,6]},{"title":"Pretty bad.","rating":4,"date":"14 July 2008","review":"During my childhood time I have seen the first three \"Critters\" movies and enjoyed 'em.They were fun and entertaining horror comedies perfect for adventurous horror loving kids.I have never seen \"Critters 4\",so I finally decided to check it out.My verdict:forgettable and pretty bad flick with strikingly low body count.The script by Joseph Lyle and David J. Schow is both predictable &amp; clichéd,the plot rips off \"Alien\" and \"Star Wars\" and the sets look bland and murky.The tone of the film appears to be deadly serious throughout making it slow and dull.\"Critters 4\" was apparently so low budget that the filmmakers couldn't afford any optical effects;the ones taken from \"Android\" look seriously dated.4 out of 10.One to avoid.","user":"HumanoidOfFlesh","rank":[15,19]}]