[{"title":"Maybe the best in the series, though that's not saying much.","rating":5,"date":"21 March 2016","review":"Leprechaun is another one of those horror franchises that goes on and on, sequel after sequel, new cast and crew every time, all that jazz, but unlike its fellow horror franchises like Friday the 13th and A Nightmare on Elm Street, Leprechaun doesn't even try to be good. They're all unconscionably dumb. Self-aware, but dumb. There isn't even a thread of a narrative to connect the movies other than there's an evil leprechaun who speaks in ridiculous rhymes and needs his gold and will kill anyone in his way to get it. But for any fan of camp, Leprechaun may be the horror franchise for you. And I'm using horror in the absolute loosest sense of the word because I got more shivers down my spine watching Jack and Jill than I did during any of these movies. What puts it in the horror category is simply the fact that it's an evil entity that likes to kill people, and there's bountiful gore and T&amp;A. <br><br>Having said all that, Leprechaun 3 is probably the best in the series. There's something oddly fitting about the Leprechaun running around Vegas using real magic to fool gamblers and phony magicians, which makes for some entertaining developments. The cast is passable. Discussing the acting in a Leprechaun movie is as fruitful as analyzing the intricacies between Adam Sandler's Jack and Adam Sandler's Jill (I don't know why Jack and Jill is my go-to comparison but sure, why not). But overall, it's passable; a huge improvement over Leprechaun 2's acting which was just infuriating to watch. The movie actually has a plot, too! One of the Leprechaun's gold coins falls into the wrong hands and goes from person to person in a casino, granting the holder whatever they wish for. Again, story-wise this is by far the most practical of the Leprechaun movies.<br><br>What prevents this from being a great movie is the fact that it's vehemently stupid. I know that's the point, but there were moments where Leprechaun 3 felt like a legitimately decent movie. I enjoyed where the plot was going, the Leprechaun was throwing some classic one-liners, the deaths were highly amusing, but then it would shift gears and focus on a particular character or subplot that no one cares about and it would kill its momentum. If the whole movie focused on the main narrative of the coin going 'round and 'round the casino and the Leprechaun having to go through hurdles to find it and kill every poor sap in his path, it would've been a good movie. But they throw in crap like the Leprechaun now has werewolf powers so if he bites someone, they'll also turn into a leprechaun. Also before the Leprechaun actually gets to the casino, the movie is really boring. It's like ten minutes of the Leprechaun antagonizing some random store owner and spitting out stupid dialogue for the sake of spitting out stupid dialogue with no advancement to the plot.<br><br>Truthfully, I enjoyed this movie. A lot more than I thought I would actually. The first Leprechaun was decent, just barely, because Jennifer Aniston was great eye-candy. The second one was an abomination even by camp horror standards. This is one of those instances where the third time really is a charm. I mean, it's not much of a charm, but it accomplishes what it sets out to. It's amusing, it's ridiculous, basically the quintessential stoner horror movie, and it reaches the potential that its predecessors missed. Now, is it a good movie? Get the f*ck out of here. You know it's not. But is it a fun watch? Sure it is, especially if you're under the influence of a foreign substance. Even then, as far as campy horror movies go, you could do a lot worse than Leprechaun 3. You could do a lot better, too.","user":"lnvicta","rank":[21,21]},{"title":"Low-Class Fun Comedy-Horror Flick","rating":6,"date":"6 April 2006","review":"This gets decent marks only for one reason: it's entertaining. Other than that, it has no redeeming value, is classless, has poor acting and even poorer dialog....but sure was fun to watch a couple of times.<br><br>The Leprechaun (Warwick Davis) has some very funny lines and rhymes and is the undisputed star of the show. There are a lot of special effects used for both comedy and for horror. This is the third of about four of these type of films, and the only one I thought worth keeping, mainly for the laughs. Eventually, the quality of the tape was so bad I canned it. Maybe I should check out the DVD, which was subsequently released.<br><br>Lee Armstrong provided the female lead role and she was a pretty woman but obviously not much of an actress and few people have heard of her before or since.<br><br>If you want something stupid but entertaining, a good mix of horror and comedy, this little dirty Leprechaun should fill the bill....but only this edition. Don't bother with the rest in the series.","user":"ccthemovieman-1","rank":[26,29]},{"title":"The Best and the Worst One so far","rating":14,"date":"14 April 2004","review":"\"Leprechaun 3\" is simultaneously better and worse than Lep 1 &amp; 2.  It pulls this off by have a terrible \"Act One\" (the first 45 minutes), but an entertaining \"Act Two\" (the last 45 minutes).  I'm sorry, but with the exception of the Leprechaun character, Mark Jones cannot write convincing dialogue to save his life.  I felt bad for actor John Gatins (playing Scott McCoy), who as the young college kid was saddled with some of the most unconvincing dialogue... well, ever.  It was almost unwatchable, this \"Act One\".  Then the story changes in \"Act Two\" with \"Scott\" getting infected with the Leprechaun's blood, and after that it's nothing but a good time.<br><br>One cool thing is that this time, Warwick Davis gets to speak nearly all of his dialogue in rhyme, and in \"Act Two\" he's downright funny at times. Davis really carries these films, without him they'd be unwatchable.  With him, the Leprechaun has a destructive charm that's just fun to watch.","user":"alexduffy2000","rank":[14,17]}]