[{"title":"A Divine Comedy","rating":9,"date":"22 October 2000","review":"There have been so many romantic comedies produced that it is difficult for a film to break out due to the depth and breadth of the competition.  This is one that does.  This wonderfully funny romantic comedy takes a fresh approach, portraying a romance involving not one, but two men of the cloth. They are not even of the same cloth as one is a Catholic priest and the other a Jewish rabbi.  The girl of their dreams is also the girl of their youth as the three were best friends in grammar school.  Now, after many years of separation, Anna (Jenna Elfman) returns and both men fall immediately and madly in love with her.<br><br>The film is chock full of religious humor and sharp-witted dialogue that keeps you grinning between guffaws.  The romance is syrupy sweet and the actors have such great chemistry that it is easy to believe they have been friends all their lives.  Edward Norton produced, directed and starred in this gem and he shows himself to be adept at spinning a magical yarn with very few flaws.  This was Norton's first directorial effort and it bodes well for his future on the other side of the lens.  His work with the actors was marvelous, and his pacing of the film was excellent.  The film flowed very pleasantly from scene to scene and kept the viewer amused and immersed.<br><br>The entire cast is terrific.  Norton plays Father Brian Finn and is funny and affable in the role.  Rabbi Jacob Schram is played by Ben Stiller, whose comedic star is on the rise.  In this film, he outdoes his wonderful performance in `There's Something About Mary' with a character that is just as amusing but more complete, with greater range.  Anne Bancroft is also fantastic as the rabbi's mother.  She has the New York Jewish mother routine down pat, right down to the accent.  A dynamite performance. <br><br>\nThe real news in this film though, is Jenna Elfman.  She lights up the screen with her enthusiasm and her charming girl-next-door beauty.  She is dynamic, hilarious, sensitive, sexy and lovable and pretty much steals the show.  After her terrific performance in `Edtv, she proves once again that she is a talented actor and comedian.  One can only hope that the popularity of this film gives her access to more and better parts.<br><br>This fabulous romantic comedy is highly entertaining and enchanting.  I rated it a 9/10.  It is especially funny if you happen to be Catholic or Jewish.  I highly recommend it.","user":"FlickJunkie-2","rank":[46,60]},{"title":"Edward Norton continues to impress","rating":10,"date":"9 April 2000","review":"Only this time Norton is not only in front of, but also behind, the camera.<br><br>Keeping the Faith is a funny, romantic and very smart romantic comedy.  The three leads are charming and believable, the supporting cast is outstanding, the script is insightful and fresh, the technical credits are polished, the musical selections are energetic, and the tone is so consistently enjoyable that I have to say it's my favorite romantic comedy since Jerry Maguire.<br><br>Stiller proves again what a surprisingly strong romantic lead he is and carries the whole film, Norton is consistently one of the best actors working and here takes a role like no other he's played before, and Elfman is a real revelation: she's never been this beautiful, confident and intelligent before.  She makes it very easy to see why both a priest and a rabbi would fall head over heels in love with her.<br><br>Keeping the Faith works in every way a romantic comedy should but works on an even higher level thanks to a refreshing incorporation of religion and spirituality.  It is in no way heavy handed or dogmatic (or judgemental) in its approach to the subject matter, simply believable and interesting, it's a part of who these characters are.<br><br>If you like romantic comedies this is a must see, but anyone who can appreciate a solid story, strong characters and two hours of movie bliss will enjoy this film.","user":"Geoff-10","rank":[36,47]},{"title":"Good comedy/romance","rating":7,"date":"24 September 2001","review":"This is a pretty good film and I think it hits perfectly the things we all want in life. Great friends and significant others. It is just a beautiful film which I must say (for a comedy) and a Ben Stiller film is pretty jokeless. Good acting, good directing a good story and good everything. There was one thing that was great though. The way Edward Norton used Faith in this film. Never have I seen so much depictions of Faith in a film and actually enjoyed it. I don't believe in church and stuff, but these two clergymen are way beyond cool, they ROCK!<br><br>\nMy favorite in this one is undoubtedly Jenna Elfman. She is so cool and cute. I mean there are so many beautiful women in Hollywood, but man one look into those shiny, glittery eyes and I'm sold. She has just so much natural glow about her it really is amazing. GOOD CHOICE!!! I can only beg producers to use her more in quality productions, she's pretty, she can act and she's very likeable too.<br><br>\n7 out of 10","user":"stamper","rank":[37,49]}]