[{"title":"La cité de la joie!!!","rating":8,"date":"13 April 2002","review":"Having \"discovered\" Alain Chabat only a couple of days ago I didn't know if I would like this film, despite all the other good comments it got. This is because I don't speak French. I watched the French version with English subtitles, because it wasn't available with German ones. And I can deeply assure everyone who thinks about seeing this piece of art: Do it! It's hilarious, wild, crazy and above all French! After only five minutes into the film I had tears of laughter running down my cheek. I think nobody will fail to notice the huge amount of jokes in this film, if you know any French or not. Most of the comedy is of physical nature, there are of course some puns but never mind. Just go and see it. Or better buy it instantly as you will want to see it over and over again! I promise!","user":"missmarmite","rank":[22,30]},{"title":"the city of laugh: a successful comedy","rating":28,"date":"28 August 2002","review":"This is \"Les Nuls\"'s first movie and if it isn't a masterpiece, it's an enjoyable comedy. Odile Deray is the press attaché for the film \"Red Is Dead\" but the film is so dumb that reporters don't want to promote it. However, the projectionist is killed and due to this it creates a great publicity around the movie and meanwhile murders go on. Then Deray is asking a cop (Serge Karamasov) to protect not only the projectionists but also the main star of the film: Simon Jérémi.... Alain Berbérian and \"Les Nuls\" have made a funny film which is full of clever visuals and ringing brainwaves; the best example is the murder of the fourth projectionist when \"Les Nuls\" are adding the sound effects to the scene themselves! Moreover, the comic of the film is very fanciful and there are some useless elements but it's because they are useless that they are funny. For example, we learn Patrick Bialès's whole life (the main inspector of Cannes) but it brings nothing to the plot! The screenplay, in spite of several weaknesses, is inspired and full of numerous details and sentences that score the bull's eye.<br><br>The movie is well made thanks to its actors too and I am under the impression that they, voluntarily, don't take themselves seriously , especially Gérard Darmon who is irresistible in his first appearance when he answers the reporters in several languages! Even famous French actors have got a small role (Tcheky Karyo, Daniel Gélin, Jean-Pierre Bacri and Eddy Mitchell are in the projectionists' roles)! At last the film is obviously a parody of horror and detective films. I think about \"Psycho\" when the projectionists are killed. To sum up: a fanciful but efficient comedy and if you watch it for the first time, you might be disappointed. You have to watch it several times to appreciate it. It happened with me.","user":"dbdumonteil","rank":[13,18]},{"title":"A really funny typical French comedy","rating":8,"date":"20 January 2001","review":"La cité de la peur is a really funny movie. It's funny because of the good acting, the solid script. The scenario itself is a joke. I'm writing this comment in English but could have done it in French, since many gags must be impossible to translate, so you definitely should understand French. This movie shows the particular sense of humour of \"Les Nuls\", a group of humorists, which I do like. To my mind, it's the best French comedy since \"Le père Noël est une ordure\", which will make you laugh from start to end.","user":"hbbio","rank":[14,23]}]