[{"title":"Excellent revenge film with good performances and solid direction!","rating":10,"date":"18 May 2006","review":"Like many of you, Id never heard the title Lady Snowblood before Kill Bill came out, so when I watched Kill Bill and saw Tarantino mention this film as one of his biggest influences, well I knew I would have to check it out sooner or later. So did Tarantino really rip off this flick or what? You bet your double edged sword he did! <br><br>The story is about this couple who get mugged by these four thugs. The husbands gets the ax by the killers and the wife gets raped by all of them many times. When the lady kills one of the killers and slays him she ends up in jail pregnant with a bastard child. When the child is born the mother dies, but not before whispering into the childs ear that her only purpose in life will be to kill those who were responsible for the death of her family. That little girl is raised by a Kung Fu master and ends up being Lady Snowblood. A creature living only to avenge those who murdered her entire family.<br><br>I wont say Tarantino isn't a genius on his own right the guy is one of my favorites, but when he gets inspired he sure knows where to get his inspiration from! There's many images lifted right off from this movie. Lets see the most notable of all rip offs is Oren Ishii who is no doubt molded after Lady Snowblood herself. Right down to her underground gangster deals and her ugly past. Right down to wanting to avenge her parents deaths. She chops heads and slices and dices like she means it! Blood sprays out in huge amounts in the same way that it sprays in Kill Bill, as if you just opened a sprinkler system to water your lawn. There's the four or five people that she has to kill which pop up in her mind every time she sees them, exactly the same way as in Kill Bill. And I mean exactly the same way, all four bad guys looking down at the camera as if the camera was on the floor! Lady Snowblood has a list of people she has to kill, I mean the similarities are astounding. But still, it didn't really bother me since I was enjoying this damn movie so much! The story is what really pulls you in. Its a fantastically woven revenge film to the Nth degree! I mean the level of hatred thats transferred onto Lady Snowblood when she is a child and the horrible things that happen to her spawn one of the most hatred filled characters that I have seen in a long time. Just like Beatrix Kiddo, Lady Snowblood (aka Yuki Kashima) stops at no ones plea of mercy. She executes her revenge no matter what circumstances have occurred or changed from the time of her parents death. Basically its a you did it now you pay for it kind of story. But with some wonderful characters and complications along the way.<br><br>There were many excellent things about this movie but the most pivotal of all was the flawless direction brought on by Toshiya Fujita. I mean this movie was like ahead of its time or something. Or maybe thats just the way movies were made in the seventies and it raised to such cool levels in a natural way. But this film has all these visual gags and tricks that could have only been spawned from that glorious era known as the 70s. Many scenes show that this director took special care in making this movie special, like those scenes with Lady Snowblood walking in the snow with her dress filled with the blood of her victim.<br><br>So even though this movie gets pretty gory and violent, visually Id say its very elegant. The music is also incredibly good, mixing traditional Asian music with this great theme song that Tarantino took from this very movie and placed it in his. The song adds an incredible emotion to the film, specially when you know what it says. Also of special notice is the movies excellent performances! From the whole cast we get nothing but credibility and sincerity in the acting. There's an excellent scene in which Yukis mother is giving birth and dying at the same time and the dialog and performance she gives was really something! If there's something I have to say that I didn't like its that the blood looked too red and too liquid. I mean, I know blood is liquid but not like water. Blood is thick and sticky and on this movie the blood looks a cartoonish red and flows like water which rested a couple of notches of credibility. But thats really nothing, the film is damn near perfect for me. Also don't go in expecting a Kung Fu movie cause this isn't a Kung Fu movie its a revenge movie. Don't get me wrong, there's swordplay involved and lots of violence. Decapitations, bodies split in half, hands cut off. But not necessarily any Kung Fu fights involved. So, lots of gore and slicing and dicing, but no Kung Fu.<br><br>In conclusion, a very very kick ass film. This is were Kill Bill was born and Kill Bill was as good as it was because it was already ripping off an truly excellent film. So, yeah, Id say go out of your freaking way to get this movie as soon as you can and enjoy one of the coolest revenge films to come out of Asian cinema. Lady Snowblood will get revenge on you if you don't! (Corny way to end my review, I know) Rating: 5 out of 5","user":"spacemonkey_fg","rank":[53,63]},{"title":"Don't let \"Kill Bill\" ruin this flick for you...","rating":30,"date":"30 April 2004","review":"Unfortunately this film's only getting the attention that it deserves because of Tarantino's \"Kill Bill.\" Fortunately, this film is getting the attention it deserves because of Tarantino's \"Kill Bill.\" This is the double-edged sword of sample-based art. Is it theft, or an homage? Does it help, or hurt the classics? While Tarantino did lift a number of images, a few characters, countless plot devices, and one memorable song from this film; it is impossible to lift the experience that each film offers. Besides, would this film be crawling from the dark, fuzzy depths of the bootleg video without its newfound attention? From the opening scene in the all female prison, we are grabbed from our worlds and thrust into the dynamic Japan at the end of the nineteenth century. Ultimately Toshiya Fugita's 1973 film is about the victims of profound social change, and how sometimes the only way to erase victim-hood is to pass it on to those that have done you wrong. Yeah, \"The Bride\" goes through quite a bit for her revenge, but Meiko Kaji's character is literally born from death, with the express purpose of carrying out revenge for a family she's never met. While it's hardly addressed openly in the film, Kaji brings a subtle uncertainty to her character's motivations and actions. This depth not only grants humanity to the character, but by making her more believable, Fujita and Kaji raise the stakes. If she can fail, will she? Will she decide her parents revenge is not her own? Or will she embrace her destiny and proposed purpose? Don't get too worked up over how much and what \"Kill Bill\" sampled from \"Shura-yuki-hime.\" Instead, remember that the samurai (chambara) genre is like any genre; without sampling it wouldn't exist as a genre. Fugita's samples: \"Chushingura\" Kuniyoshi's ukiyo-e (woodblock prints), \"Sword of Doom,\" every film by Hideo Gosha...","user":"Akahige","rank":[54,67]},{"title":"Beautiful and iconic revenge tale","rating":7,"date":"26 July 2013","review":"In 1874 Japan, a woman gives birth in a prison. Almost a year before, the woman, Sayo (Miyoko Akaza), her husband and son are attacked in a village by four criminals - Okono (Sanae Nakahara), Banzo (Noboru Nakaya), Tokuichi (Takeo Chii) and Gishiro (Eiji Okada). The husband and son are murdered in cold bold, and Sayo is taken by Tokuichi to work for him. After Sayo murders him, she is sent to prison, where she has sex with many guards in the hope of becoming pregnant, to give birth to a child that can avenge her. That child is Yuki (Meiko Kaji), who after receiving years of training from a priest, becomes Lady Snowblood, a lethal assassin whose only thirst is for revenge.<br><br>While this may sound similar to countless martial arts or samurai films to come out of Japan and China during the 1970's, there's something profoundly different to Lady Snowblood. While it certainly offers scenes of outlandish violence (the blood spurts from the body like a gushing fountain), director Toshiya Fujita, taking inspiration from the manga Shurayukihime, seems more interested in building the foundation to the sweeping story than having scene after scene of flying limbs. Separated by title-carded chapters, the film makes a point of giving us a decent story to each target, subtly interlinking the stories to make sure they flow, rather than simply jumping from one person to the next.<br><br>What also separates this from others of similar ilk on the grindhouse circuit is the cinematography by Masaki Tamura, which is nothing short of beautiful. I promised myself I would try and get through this entire review without mentioning Quentin Tarantino's Kill Bill (2003-2004), but it's not hard to see why he chose to steal (sorry, it's 'homage' when its Tarantino doing it) the same setting and colour palette. Every scene is wide and lovingly crafted, and when the violence ensues, it turns out that red on white is truly stunning. It may not have the outlandish violence of, say, the Lone Wolf and Cub series (1972-1974), but this has a calm yet quick slash of a sword, rather than an extended sword fight, and the film is clinical in that aspect to say the least. While the pace may be often too slow, this is still a satisfying revenge drama featuring one of the most iconic character of its genre.<br><br>www.the-wrath-of-blog.blogspot.com","user":"tomgillespie2002","rank":[12,14]}]