[{"title":"A Must-See for All 20-Something Males","rating":10,"date":"5 January 2004","review":"Let me preface this review by saying that this is my favorite film of all time.  I'm not saying it was the best, most artistic, original, or most innovative...but it is my favorite.  It's a movie about a 20-something man getting over a nasty break-up, living in Los Angeles.  Pretty simple stuff, but the honesty in the film is amazing.  This film boasts the most realistic, and interesting depictions of male friendship I've ever seen. Some might simply pawn this movie off as a buddy flick, but it goes so much deeper than that.  Mikey (Favreau) deals with insecurity, rejection, depression, an overwhelming feeling of inadequacy.  Something almost everyone can relate to.  And, as an audience member, you live and die with the poor guy.  The supporting cast is very strong, popping in and out as the assortment of friends populating Mikey's social life.  Each is trying, in his own way, to get their buddy out of his post-break up funk, which meet with varying degrees of success.  Swingers is chock full of laugh-out-loud moments, and oft-quoted lines (\"Our baby's all grows up!\") that could very easily lead to repeated viewings of this masterpiece.","user":"Zuhalter","rank":[103,128]},{"title":"This place is dead anyway!","rating":10,"date":"11 April 2003","review":"Money! Having lived the life of Mike, this movie hits home. No gig, no girl...no self esteem... Hangin with the boys. Who hasn't been there? A virtual plethora of one liners and quotes for guys (this is definitely a guy flick) in their 20's and 30's. Who hasn't left a relationship only to wallow in guilt and self doubt. Especially when you find out the ex is seeing someone else. Add to this the inability to land a decent paying gig, living alone in an unfamiliar town, and having bunch of condescending clowns as your support group and its no wonder that poor Mike was about to return to Queens with his tail between his legs.<br><br>The best part of this film is the self transformation of Mike from the pitiful whiner holed up in his apartment for days after Sue tells him what a loser he is, to the Bear spotting the Bunny (literally) from the other side of the bar. Though Mike is constantly hearing and taking advise from his posse...ultimately, it is himself who shows that through his own experiences (ball room dance lessons with the ex) and his own strengths of honesty, charm and charisma that he proves he is indeed, money, and lands him the beautiful baby Lorraine. \"It is so on\" as the hilarious Trent (scene stealer Vince Vaughn) first spots the pensive conversation between Mike and Lorraine. (Heather Graham) The looks on Trent's and Sue's faces are priceless as they spy Mike and his beautiful baby working the dance floor to Big Bad Voodoo Daddy's \"Go Daddy O\". I don't think I have ever seen Ms Graham look better that she does here...<br><br>\"It didn't occur to me\" Mike replies to Trent in the final scene when asked why he didn't call the ex back. Amazing what a little confidence (and a dance with a hot blonde) can do for guy!<br><br>This is a hilarious movie about real guys (you have known somebody like every character in this film!) set against the surreal back drop of the then-hip LA swing scene in the mid 90's doing what they do best....10 out of 10","user":"Harrpoe","rank":[58,74]},{"title":"Best movie ever","rating":10,"date":"25 February 2004","review":"I saw that someone commented this is the perfect guy movie. I'd like to add that it's not just for guys. The characters in it are just as easy to relate to for girls. If you think girls don't pathetically chase after guys the same way the men of Swingers were going after girls, you need to get out more.(Not meant to be an insult.) My favorite character in it (though I love them all) is Rob. His insecurity is cute, but of course he's also a loyal friend. You can't beat that. And I love the goofy quote. \"Hi, Mom. I'm goofy. Send more money.\" That's great! This is one of those movies that I love to watch over and over again. I will never get sick of it. Plus my husband (then boyfriend) introduced me to it so of course I love it. He even picked me up from my classes once by yelling, \"Hey, do you know where all the high school girls hang out??\" from across the street. This movie was incredibly funny and deserves a lot more praise than it gets.","user":"MaraJade27","rank":[78,112]}]