[{"title":"Gets Better Every Time I See It.","rating":10,"date":"17 May 2002","review":"Please forgive the length of this first paragraph, but it is needed to explain my opinion of this film. I never saw this film in the theater; it looked a little silly to me. One day a few months later it came on pay-per-view. Due to a technical glitch the cable company unscrambled the pay-per-view channels all day long. It also happened to be raining and generally miserable out, so my buddies and I decided to watch this movie. We had three pay-per-view channels, and one of the channels showed a single movie all day long. Guess which movie it was.<br><br>The first time we watched it, we thought it was goofy, even stupid, and didn't really care for it. However like many teens, we mindlessly watched it again . . . and again . . . and again. We watched this film all day. \"Why?\" you ask; because it truly gets better every time you watch it.<br><br>I think the reason is because this is a stupid film, and when you first watch it, you're too smart for it. Eventually though the IQ points seep out of your head, and you're able to fully enjoy this great movie.<br><br>The bottom line: Watch this film at least 5 times, not necessarily back-to-back but it helps. It will grow on you. Even if you don't like Farley, watch this film for Chris Rock. Rock's performance is perfect, despite being too small of a role. Farley's performance is perfect as the bumbling but good-hearted \"Great White Ninja.\" Even the chicken's performance is perfect. If you find the concept of a fat, white ninja involved in an Asian gang war mildly provocative, check your brain at the door and enjoy.","user":"MrBark","rank":[37,44]},{"title":"Enter The Moron (this is a good review)","rating":6,"date":"11 October 2002","review":"It's hard for me to review this movie without prejudice because to me, Chris Farley is the funniest person I have ever seen.  Even though my adoration of the late comedian precludes me from giving a impartial rating of this movie, I can at least admit that this isn't one of his best efforts (I still loved this movie, it's just not my favourite Farley flick).  Nevertheless, I'm going to take the easy way out and say: Come on, take it for what it is, a Chris Farley movie.<br><br>Farley plays Haru, an orphan adopted at birth by a clan of ninjas.  He is raised under the pretenses that he is the Great White Ninja. Needless to say, his development is much anticipated by his teachers .  Unfortunately, to the dismay of everyone, he grows up to be overweight and klutzy. While the ninja graduates are out celebrating, Haru finds himself alone at the retreat when a mysterious woman (Nicollette Sheridan) enters looking for help.  Believing Haru to be a ninja, she hires him to spy on her boyfriend, an assignment he accepts with great enthusiasm.  Hot on the boyfriend's trail, Haru witnesses a murder and eventually ends up in Beverly Hills. Surviving on dumb luck and a designated guardian ninja, Haru never gives up on his task.<br><br>Like I said before, this isn't Farley's greatest contribution to his comedic resume. But make no mistake, this is a funny movie.  Farley's bread and butter is his propensity to bumble and stumble in any given situation - walking into poles, falling down stairs, crushing coffee tables, etc. Since his character is expected to be agile and sleek, the comedy in \"Beverly Hills Ninja\" is that much funnier.  The exact same formula worked for Farley's SNL character Barney, the Chippendale's hopeful.<br><br>Many critics felt that, by this time, Farley was a one-trick-pony whose act had nothing more to offer than jokes involving head and groin injuries. Perhaps his choice in films were poor but to don't deny him the recognition of his talent is unfair. Watch the movie and you'll see Farley display all the qualities of a great comedian: intelligence, timing, pathos.  He was a tremendous talent and I will miss him very much.","user":"sittler","rank":[32,42]},{"title":"One of the funniest movies ever!","rating":10,"date":"16 April 2003","review":"Relax! Laugh your butt off!!! It's Chris Farley!!!!! Reading through other comments posted here, I notice that people are using five or six big paragraphs to review this. There's really not enough about this movie to be spending so much time reviewing it. Don't see this movie hoping for a great story or accurate ninja fighting action, or compelling drama like some of the commentors here seem dissapointed with. Take the stick out yer bum and relax. Just enjoy Chris Farley at his best. Few movies have ever made me laugh harder. I'm not an aged 8-14 male.","user":"Jar1239","rank":[44,60]}]