[{"title":"An absorbing experience","rating":9,"date":"9 April 2001","review":"\"A Single Girl\" is an absorbing experience. Nothing really happens and there's not much dialogue, but it's completely engrossing. It's about a morning in the life of a hauntingly beautiful woman, Valerie, who's at a crossroads in her life. It's filmed in real time, meaning there are no cut-aways that skip time. If Valerie needs to get somewhere, we watch her walk to that place. There's no narration or \"traveling\" music. It's as if we are Valerie. What makes the film work so well is the wonderful, subtle performance by Virginie Ledoyen.","user":"walward-2","rank":[17,19]},{"title":"Virginie Ledoyen in a star-making performance","rating":30,"date":"30 July 2006","review":"A SINGLE GIRL (Benoît Jacquot - France 1995).<br><br>A little known gem with the beautiful Virginie Ledoyen in the lead. I have a special relation with some films and this is certainly one of them. I first saw it - not long after it came out - on Dutch public television in my final year in high school. I thought the girl in the main role (Virginie Ledoyen) was the coolest girl I ever saw and the film always stuck with me. Later on, largely due to her performance in this film, she would become a big star and continued to be in the limelight and even played alongside Leonardo DiCaprio in THE BEACH (2000), so that's probably why I kept remembering her role in LA SEULE FILLE.<br><br>For a large part, the film plays in real time as the camera follows Valérie on the day she finds out she's pregnant. She starts a new job in a hotel as a maid. Her day-to-day routines are followed, her various encounters with the hotel guests and her intermittent meetings with her boyfriend at a nearby café. He doesn't know how to handle the situation, he doesn't have a job and cannot seem to make up his mind about anything, let alone this situation. He is a bit of a loser. Off course Valérie is in the toughest spot but somehow she never ceases to lose control or overview of the situation. She is on screen all the time as the camera follows her constantly while she walks down the corridors of the hotel, in the elevator, walking down the streets. Even though she has an attitude, is arrogant and acts a bit too wise for a girl her age, she remains absolutely fascinating throughout the film.<br><br>The lack of plot hardly mattered to me, because it's compensated by Virginie Ledoyen's radiant presence. This is the perfect example of a film where one actor or actress completely makes it work.<br><br>Camera Obscura --- 9/10","user":"Camera-Obscura","rank":[16,18]},{"title":"tense, beautiful, touching film","rating":20,"date":"20 February 2004","review":"Valerie tells her boyfriend she's pregnant, he's not sure what he wants. She's mad, but hoping he'll somehow turn around. The unsettled uncertain back and forth is very real. She seems better than the boyfriend, but doesn't quite know it. <br><br>Then off to work at a new job in a hotel. Rhythm varies with the headlong speedy movement of work and occasional moments grabbed for a nap or a smoke. Tensions with staff and guests make you worry about this young girl: any situation could explode. She seems calm outwardly, but you gradually get a sense of the roiling interior. Will she crack under the pressure? Mysteries--why is she so cold to the black co-worker? Racism? Worry? You're not quite sure. At moments things loosen up, the girl shows attitude to the point you think she might get fired. Can she be that tough, that self-confident? In a way, yes. She turns out to be an amazing character who almost thinks she's ordinary, though she knows the men are after her like a pack of wolves. She's young, you worry for her, but she can take care of herself. In the end she seems awesomely, unfathomably self-sufficient.<br><br>This movie seems to be about female power. A good pairing would be with Sautet's A Simple Story, about an older woman also outwardly ordinary (though beautiful) but with amazing contained power, a kind of integrity beyond any men she encounters.","user":"eyeseehot","rank":[10,11]}]