[{"title":"Sequel Slightly Better","rating":8,"date":"6 October 2006","review":"Here's another example of the sequel being slightly better than the original, at least in my humble opinion. However, the original (\"Honey, I Shrunk The Kids\") was nothing super, not something you'd call a \"classic.\" It was \"pretty good.\" This one is \"good.\" <br><br>It had more laughs and less irritating kids. There is still the stupid teen romance, but not emphasized as much as in the first movie. The little kid in here, who is turned into a giant, is cute and affable and his giggle is fun to hear.<br><br>The first 40 minutes of this film are the best. It gets a little too silly after that. At the end, Disney succumbs to the craze of the early '90s: having a woman punch out a man. In this case, it was nice mother (Marcia Strassman.) Give me a break!<br><br>The special-effects were okay but not totally convincing. In fairness, it's not easy trying to produce the effects of a 100-foot child walking down the streets of Las Vegas, but they've still come along way from the days of \"The Attack Of The 50- Foot Woman\" in 1958. However, there is still room for FX improvement.<br><br>Overall, some good laughs in the film and - with one exception - likable characters.","user":"ccthemovieman-1","rank":[22,33]},{"title":"Honey, I Stunk the Script","rating":5,"date":"12 May 2006","review":"The lovable Szalinskis are at it again. In this inferior sequel to Honey, I Shrunk the Kids, Dad blows up his little son to the size of a redwood. It is enjoyable enough in the beginning but after a while the filmmakers run out of ideas about what to do with a big baby. As with the first film, Moranis brings a lot of energy to his role and Strassman still looks cute but the other kids and the nosy neighbors are missed. The plot line about Moranis' wacky boss just gets out of hand and by the time the action moves to Vegas, the whole plot becomes tiresome. It may have helped if they had a cuter kid play Adam or if they had him do some funnier things.","user":"kenjha","rank":[13,18]},{"title":"Really not that bad for a sequel","rating":7,"date":"22 March 2010","review":"I don't mind sequels, some are great like Home Alone 2 and Empire Strikes Back, some are nothing special but can be an improvement over their originals like Garfield 2 and others that belong in the garbage like Home Alone 4 and NeverEnding Story 3. This sequel really isn't that bad, at this point I don't think it belongs in either of these categories but in a category titled \"a sequel that isn't as good as the original, but a sequel worth watching\". It is very daft, even more dafter than Honey, I Shrunk the Kids, with a very silly final 20 minutes and the pacing at this point in the film isn't as strong as it was in the first 40 minutes, which was fun, fun, fun personified. Still, it is very entertaining for a number of reasons. It is nicely filmed, with a good soundtrack and some fun gags and physical comedy. But it was the performances that made it worthwhile. Rick Moranis reprises his role as Wayne and is immensely likable as always, and Marcia Strassman is great as Diane. Daniel and Joshua Shalikar are very cute as Adam, who has a nice, funny little laugh that doesn't grate, thank goodness. The other kids give appealing performances once again, the teen romance is evident here and is rather sappy, but hey I can live with that. Overall, for a sequel, this is really not bad. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[8,11]}]