[{"title":"* * * out of 4.","rating":8,"date":"8 August 2002","review":"Due to a computer error Alex (Lara Flynn Boyle) accidently gets assigned the same dorm rooms as two guys, Stuart (Stephen Baldwin) and Eddy (Josh Charles). Stuart a sex crazed drunk frat boy is in lust with Alex, however Alex is in love with Eddy and Eddy in turn thinks he may be in love with Stuart! <br><br>Considering the title and the premise one would not expect to see a smart film that never bashes its characters, but instead fully develops them in an a thoughtful, original manner. This film manages to do just this. Lara Flynn Boyle is both sexy and extremely funny. Josh Charles turns in a tender, compassionate performance. Film could have just easily come off as gratitous, but instead it is sexy and fun.<br><br>Rated R; Sexual Situations and Profanity.","user":"brandonsites1981","rank":[36,38]},{"title":"For its time, groundbreaking","rating":8,"date":"18 May 2004","review":"Due to a computer mix up female Alex (Lara Flynn Boyle) has to share a dorm apartment with two men--sex-obsessed Stuart (Stephen Baldwin) and nice, quiet Eddy (Josh Charles). She begins to fall in love with Eddy but he reveals to her that he's gay--maybe (he's still a virgin). They all become fast friends and make a pact NOT to have sex with each other. But Alex is still in love with Eddy--and Eddy is very attracted to hunky Stuart...<br><br>Almost perfect comedy/drama. For its time, this was groundbreaking. This was a rare Hollywood film that brought up gay characters and issues and did NOT ignore them or \"miraculously\" make the character straight. SPOILER ALERT!!!!! It is revealed that Eddy IS gay and is happily with a boyfriend at the end of the movie! I remember seeing this in a theatre and being stunned in 1994. NO Hollywood film had ever done that before (letting a gay character stay gay AND be happy). Even today that's a rare occurrence--back in 1994 it was unheard of. For this alone this movie should be better known. END SPOILER ALERT!!!<br><br>Sexual politics aside it's also a damn funny movie. The characters are believable, the dialogue is frank and VERY adult (this is NOT for kids) and the movie moves quickly--never a dull moment. Boyle was young (24) when she made this. Her performance is great and she looks incredible (unlike now where she looks seriously anorexic); Charles is letter perfect as Eddy--you see has pain and conflict as he comes to terms with his sexuality; even Baldwin is good! His character is an obnoxious jerk but he has his sweet moments and really pulls them off. But it's his character that prevents me from giving this movie a 10. His character IS a real jerk and his sick jokes and comments really wore me down. Also there is a scene between him and Charles which is just bristling with homo eroticism--and the film stops it. I can accept that though--back in 1994 a mainstream audience couldn't have dealt with two guys going at it.<br><br>Sadly this film bombed in 1994 (a bad ad campaign didn't help matters). This Definitely deserves rediscovery. Exceptional film that deals honestly with college kids and sexual politics. Well worth seeing.","user":"preppy-3","rank":[30,32]},{"title":"One of the best romantic comedies I have seen.","rating":10,"date":"8 April 2004","review":"I saw this movie almost 10 years ago already for the second time and I liked it as much as before. The three main characters develop such a funny and friendly relationship throughout the movie that you just have to like them. Especially Josh Charles as Eddy (formerly admired as Mr. Knox Overstreet in Dead Poets Society) is a hell of a performer. He has something very special in his acting and I simply think he is remarkable. Lara Flynn Boile is no doubt a goddess with respectable acting abilities and even Will Baldwin, who plays a very flat but funny character, pleases the audience. As a group they even go beyond and the result is a romantic comedy with lots of sex appeal, laughing, friendship and even some seriousness. The script is very good and I can recommend this film to anyone over 16. My tip though: Don't watch it alone. It's much more fun with company. Have fun!","user":"Trashcan","rank":[21,23]}]