[{"title":"The Movie & the Music","rating":10,"date":"17 June 2002","review":"Only a few of the previous comments on this movie has mentioned the use of music. Just like in Trois Couleurs Bleu, the music of La Double vie de Véronique is very indivisible from the film: the visual and the auditive form a united whole and also elements of it are directly part of the story. And when it comes to music made for film, Zbigniew Preisner's powerful score for this one is as good as it gets.<br><br>When there is little dialogue, it is not just the images and expressions on Irène Jacob's face that tells the story, but also the powerful strains of music intermingled with it.<br><br>Even with just these elements in place, it would be a movie worth seeing, though obviously a narrative based in little extent on dialogue and with less emphasis on a clear-cut story than your average American movie is unfortunately lost on some of the earlier commentators.<br><br>And even this seemingly sparingly laid out narrative reveals itself to the careful watcher to be a rich tapestry of symbols, metaphors and hidden meanings. Kiéslowski, just as in his other movies, demands participation of the viewer, and the one who expects passive entertainment has found the wrong film to watch.<br><br>Krzysztof never liked discussing meaning when it came to his movies, but liked keeping that up to the viewers, and few other directors have ever been able to lay out more food for thought and fruitful interpretation than him.<br><br>I saw the Three Colours trilogy before seeing Véronique, and the many similarities, both musical and in visual narrative, makes it feel like it almost belongs together with those three to form a quartet. In some ways it has more in common with Blue than Red and White do. <br><br>Had Juliette Binoche also been cast in the role of Véronique, as I understand that Krzysztof originally had intended, the similarities had been even greater. She was, however, occupied with shooting Les Amants du Pont-Neuf at the time I believe, and so Krzysztof opted for the less experienced Irène. I don't think the film is any worse for it: she is brilliant, and not just a pretty face as some people put it, but a very intelligent and aware actress as anyone who has seen her interview for the Red DVD release should discover if they haven't already.<br><br>In short: a wonderful film, wonderful music, great acting. But not a movie for everyone.","user":"artistico7","rank":[86,101]},{"title":"Review for The Double Life of Véronique (no spoilers).","rating":10,"date":"4 January 2005","review":"Krzysztof Kieslowski's The Double Life of Véronique (originally titled La Double Vie de Véronique) might be the best film in the late director's accomplished oeuvre. Perhaps most lauded for his monumental Three Colors trilogy, Kieslowski first explored themes of duality, synchronicity, and fate in this cinematic reverie. Irène Jacob, also the star of Red, handles a double role as two women cut from the same metaphysical cloth -- the Polish Veronika and the French Véronique. Her presence as both women is at once whimsically childlike and sensually melancholic; relentlessly alluring, it is easy to see why she became Kieslowski's muse. Jacob is perfectly fluid in the shift between characters, an embodiment of ideal femininity, as dreamlike as the tone of the entire film.<br><br>Actor and director are symbiotic, relying on hazy, autumnal ambiance and mood for narrative, utilizing a subtle minimalist approach to dialogue. This is fine art, unlike heavy-handed Hollywood productions. The tone is consistently ambiguous -- emotionally resonant, to be sure, but beyond a vaguely somber, wistful undercurrent, the movie allows the viewer to fill the \"empty space\" with his or her own thoughts and feelings. It's a true testament to Kieslowski's mastery, and few films are ever so transcendentally sublime.<br><br>The lack of this masterpiece's availability on DVD is a sad affair. There are rumors of a release in 2005, but for fans of movies like Amélie hungry for something with a little more depth, The Double Life of Véronique comes most highly recommended -- even if you have to search high and low for a copy on VHS.","user":"theantitype","rank":[100,121]},{"title":"On the suffering of Christ.","rating":29,"date":"29 December 2005","review":"St. Veronica, often called the patron saint of photographers, was, according to legend, one of the women who followed Christ to his crucifixion. At one point she handed the weary savior a cloth to wipe his face on. He did so, and when he handed it back to her, there was imprinted an image of his face on the cloth. The name Veronica, indeed, is a corruption of the Latin \"vero icon\" - the true image (yes, a contradiction in terms, I know). When Kieslowski's Veronika is unknowingly walking to her death, that is, to the audition that will lead to it, the French Veronique unknowingly photographs her from the bus in the Krakow square, while frantically trying to get snapshots from the ongoing riot.<br><br>Veronika, of course, ends up straining herself too hard singing, and because of her heart condition, snuffs it while singing those beautiful lines from Dante's Paradisio, about the ascent to heaven. Veronique, in turn, for some reason realizes that she has to give up her own singing career, and, seemingly without a single moment of regret, instead dedicates herself to teaching the music of Van den Budenmaier to untalented, bratty schoolchildren. There is little doubt, after watching the movie, that the Polish Veronika did indeed, somehow, die so that the French Veronique might live.<br><br>The opening sequence of the movie also contains the outline of Christ's life. Veronika is shown \"the star that will start Chrismas Eve\" (oh, the horrifically nonsensical astronomy we teach our children... but I digress. ;-) ), and immediately afterwords we are taken to France, where the child Veronique is being told about the leaves of spring. Christmas is the birth of Christ, while spring is the time of Easter, and his suffering and death.<br><br>So, is this, indeed, Kieslowski's very radical, and breathtakingly beautiful, take on the story of the suffering of Christ? Discuss, class. ;-)","user":"buster-crashtestdummy","rank":[61,72]}]