[{"title":"De Niro And Crystal Are Good. Yes...Yes They ARE","rating":10,"date":"16 September 2000","review":"Robert De Niro and Billy Crystal square off in `Analyze This,' a satirical look at `family' life from director Harold Ramis.  After witnessing a hit on a colleague outside a restaurant (and narrowly escaping the same fate himself, thanks to the need of a toothpick), mob boss Paul Vitti (De Niro) finds himself overcome with panic attacks.  He sweats, cries at the drop of a hat, and can't breathe.  With a vital meeting only two weeks away, he realizes he needs help, quickly, and sends one of his men, Jelly (Joe Viterelli), in search of a `shrink.'  Coincidentally, Jelly has just been rear-ended in traffic by Dr. Ben Sobol (Crystal), who just happens to be a psychiatrist.  And Jelly has his business card. \tUnable to discourage the adamant Vitti, Sobol acquiesces and agrees to treat him exclusively for two weeks, though he is less than enthusiastic about being pressed into the service of a well-known criminal; even less enthused, however, is his fiancee, Laura (Lisa Kudrow).  The ensuing repartee between Vitti and Sobol, served up with snappy dialogue and impeccable timing, takes this comedy, artistically and otherwise, to the highest level.  De Niro and Crystal are absolutely outstanding, infusing their characters with every possible nuance, while successfully avoiding the stereotypes that lesser actors may have relied upon here.  The two play so well off of one another that the humor virtually seems to explode spontaneously.  All the while, the likable Kudrow more than holds her own with her co-stars, proving, unequivocally, that there is so much more to her than just being a great `Friend.'  Credit must go to Ramis, as well, for keeping things on an even keel throughout. \tThere's funny scenes aplenty in this film, especially the ones in which the loyal but somewhat thick-headed thug, Jelly, or the winsome Laura take part. The most memorable, though, is one in which Dr. Sobol dreams that he is Don Vito Corleone in the movie `The Godfather,' when he is shot while buying some fruit.  This is parody at its finest.  Written by Ramis, Ken Lonergan and Peter Tolan, and with a supporting cast that includes Chazz Palminteri (Primo), Richard C. Castellano (Jimmy), Kyle Sabihy (Ben's son, Michael) , Molly Shannon (Caroline) and Elizabeth Bracco (Marie Vitti), `Analyze This' will keep you laughing and `doing lines' (`You...you're good, yes, you are...yes, you are!') long after the credits have faded from the screen.  I rate this one 10/10.","user":"jhclues","rank":[32,37]},{"title":"This is a must-see, light-hearted and ever so funny movie which will lift your spirit up","rating":10,"date":"6 June 2008","review":"I don't even know where to start. I don't want to tell you much about this film because I don't want to spoil it for you by giving you account of the funny scenes. Moreover, that would be quite impossible anyway as the film is simply funny all the way through. Sure I have my favourite scenes, one in particular, which make me laugh just thinking about them. Seriously, this is a comedy with a great story and many laughs. As a matter of fact, I really laughed all the way through, from start to finish.<br><br>I want to recommend you to lighten up and simply relax when you decide to watch it. Let go of any expectations or judgements. Simply watch and let the movie entertain you. It might seem as an obvious thing to do but it is easy to slip into that judgemental and critical feeling however subtle it might be, which will spoil any movie for you not just this one.<br><br>I highly recommend this movie if you want to lift you spirit up for whatever reason as this movie will do it for you. It is my favourite and I do hope that it will be your favourite too.","user":"beruska-m","rank":[14,15]},{"title":"Good mixture of comedy and crime-action","rating":8,"date":"18 February 2000","review":"I was looking forward to seeing ANALYZE THIS for many reasons. One, Billy Crystal is one great and funny comedian. Two, Robert De Niro is the king of crime-action movies. I mean, ever saw THE UNTOUCHABLES? Three, the storyline did seem like a very good idea that had never been done before. And four, I love Lisa Kudrow. I was not disappointed with this movie. There could have been more, but it is surely worth seeing. There were only a few instances that I started to really laugh, but there were plenty of good and funny jokes, as well as some good touches of mobster-like crime.<br><br>Ben Sobol (Billy Crystal) is a family psychiatrist who has a son and is engaged to the beautiful Laura MacNamara (Lisa Kudrow). He gets into a car accident with a dim-witted man Jelly (Joe Viterelli), who happens to be the right-hand man to Paul Vitti, (Robert De Niro) the most powerful mobster in New York. This leads to Vitti seeking the help of Sobol. Vitti gets into very emotional moods and anxiety attacks. He refuses to admit it because he doesn't want to show weakness before a big meeting with the heads of the mob group. Sobol must help Vitti realize his problems with his father, as well as try to survive among the gangsters.<br><br>The plot is very original and cool, but the unlikely mixture of crime and comedy might leave a stale taste in your mouth. The curse words in this movie can get a little out of hand for a comedy, but that's because of the crime added to it. They did not bother me at all, in fact I thought it was funny and pulled of very well, especially in scenes between Crystal and De Niro.<br><br>Billy Crystal and Robert De Niro work great together. Both do very good jobs at their performances, even though De Niro's crying scenes seemed a little fake. The one at the end was getting better, but they still looked forced. The gorgeous Lisa Kudrow, although probably a bit under-played, did a good job too. I also think Joe Viterelli did a good job as the stupid, funny mobster. He certainly looks the part of a mobster, and I think the comic touch in his role was pulled off well.<br><br>There were a few plot holes, however, such as the one with Billy Crystal's character having problems with his father. This is, arguably, used to further the plot between De Niro and his father, but it is never resolved for Crystal. There are also a few jokes that didn't work, but the jokes that do work completely make up for them. This movie is different from your average SNL-alumni comedy movie, but it's full of funny jokes and characters and is certainly worth a rent.","user":"Xophianic","rank":[13,14]}]