[{"title":"Great comedy","rating":10,"date":"3 June 2004","review":"This is a great comedy, highlighting what it was like to live next door to racist bigot. But also shows that both main characters are actually as bad as each other. Based on the hit ITV comedy, this is very politically incorrect. And its all the better for it, comedy after all is to entertain. The movies only real drawback is there isnt much of a plot. However the cast are as great as usual. Jack Smethurst and Rudolph Walker make one hell of a team, playing off each other in a oneupmanship kind of way.It's been many years since i saw this movie and last week was finally able to buy it on dvd. The fact that the movie still contains genuine laugh out loud moments, means that i can recommend this movie, just like i would of back in the 1970's.","user":"filmbuff1970","rank":[13,20]},{"title":"Good comedy","rating":7,"date":"7 June 2004","review":"Good comedy of a popular television series that ran in England in the 1970's. a Somewhat controversial in its day,kept the British viewers glued to their television sets. This popular series is now available on DVD in the United Kingdom. Individuals who have region-free DVD players can order these DVD episodes from the video on-line shops in the U.K. People whishing to watch clean violent free entertainment will probably enjoy these DVD episodes. Video tapes of Love thy neighbour are also available. Jack Smethurst,Rudolph Walker,Nina Baden-Semper,and Kate Williams are the main actors in this series. Rudolph Walker appeared in the popular series,The blue thin line about 25 years later. He has also appeared in several episodes of the popular British police series,The Bill. After this series began in England,the U.S.A.and Australia produced their own versions. After a few episodes in the U.S.A. the series was cancelled. The Australia version was quite popular in Australia.","user":"RLARKT199","rank":[7,15]},{"title":"Stupefyingly crass expansion of a guilty pleasure","rating":1,"date":"23 March 2005","review":"I admit to a secret admiration of the original Love Thy Neighbour TV shows - mostly because they exhibit the kind of exuberant brashness and bad taste synonymous with so many programmes of their era - but I'd be lying through my teeth (very uncomfortable position) if I pretended that this big-screen spin-off is anything other than an abomination. The opening scenes of wanton vandalism are not only pointless but baffling as well - it's never explained why the film opens with a tracking shot of people trashing each other's houses - and nothing improves from there. By the time the film unearths the oldest joke in the book - the horrible dragon of a mother-in-law turns up unexpectedly to stay - is followed by the crashingly obvious revelation that she's developing a soft spot for the black neighbour's father, moving her bigoted son to ever greater depths of self-righteous, ignorant rage, most discerning viewers will have switched off. Take that as a warning, unless you're keen on cheapskate spin-offs with terrible acting, static direction and the overall comic flair of a burning orphanage.","user":"world_of_weird","rank":[8,18]}]