[{"title":"Introduction to the New Flesh","rating":22,"date":"22 October 1999","review":"Movies in the last years have become more uniform, more streamlined, particularly in the US. As a result, the film market is full of sleek, entertaining movies that the whole world goes to see, but these movies have nothing but harmless baby teeth. Fortunately, people like Lynch or Cronenberg still do movies that may be considered defective by most people, but that bite into the flesh with pointy canines. The Naked Lunch has very sharp teeth indeed. It's supposed to be an adaptation from a William Burrough's book, which doesn't make sense anyway. It starts as the story of a failed writer whose wife becomes addicted to an insecticide powder... It goes downhill after this relatively sane and normal beginning. It's a ride, a drug-induced nightmare full of horribly funny visions (the sort of visions that artists used centuries ago to represent hell). Anuses talk. Aliens sip alcohol in bars. People get impaled. Typewriters turn into bugs. Liquids ooze. You may say it's flawed, or disgusting, or ridiculous, or boring. I saw it with someone who absolutely hated it. But the fact that this person still keeps talking about it 8 years after seeing it says a lot about the Naked Lunch, at a time when we tend to forget blockbusters a few hours after watching them. The Naked Lunch is here - in your mind - to stay.","user":"gtran","rank":[104,119]},{"title":"Twisted Film concerning twisted minds","rating":10,"date":"20 November 2003","review":"Naked Lunch seems to be just totally incomprehensible upon first viewing. However, after watching it again, you start to understand more and more. Upon multiple viewings, you really get a feel for what's transpiring before your eyes.  The ultimate message is that it is really just a metaphor for heroin addiction, even though it's so much more deeper than that.  It's an intricate study of a man, William S. Burroughs, who was a heroin addict, and among other things one of the most significant Beat authors ever.  The film delves deeply into the psyche of Burroughs and takes you on a trip in his mind and your own.  There are touches of reality and many flashes of paranoia, and it is all done with style and grace.  Seriously one of the best films about an author, Naked Lunch will certainly stand the test of time against other films which may seem at first entertaining, but lose their luster upon multiple viewings.  Whereas, Naked Lunch, in my opinion, never will.  10 out of 10.","user":"hohumdedum2","rank":[106,125]},{"title":"And Here I Thought \"Fear & Loathing\" Was a Trip","rating":10,"date":"22 July 2005","review":"\"Exterminate all rational thought. This is the conclusion I have come to\".<br><br>So says Bill Lee, the central character of David Cronenberg's adaptation of William Burroughs' bizarre novel \"Naked Lunch\". The film takes the novel, replaces the characters with Burroughs, his family, and his friends, and then gives them all the names of characters from the book anyway. Once you sort that conundrum out and stop thinking rationally you can begin to understand the film. But only begin. I don't think there is any way to fully understand \"Naked Lunch\".<br><br>Bill Lee is an exterminator who, along with his wife, has become addicted to bug repellent powder. One night, while on a bit of a bender, Bill accidentally shoots his wife, Joan, in the head during a game of William Tell. Following this, he uses the powder to go on a seemingly endless trip, ripe with sinister cabals, talking bugs, and journalistic endeavors.<br><br>What the film theorizes is that this is actually the tale of how Burroughs wrote the book \"Naked Lunch\". Indeed, Burroughs did shoot his wife the way Bill does in the movie, but one wonders if Burroughs actually went on the trip we see in the film. \"Naked Lunch\" is akin to \"Fear and Loathing in Las Vegas\" in it's over-the-top depiction of drug use as literary inspiration. \"Naked Lunch\" is actually a bit weirder to me than \"Fear and Loathing\", but I guess that's the same as saying one Queer Eye Guy is gayer than another. How can you be sure and, in the end, what's the difference? I'll skip over trying to compare Burroughs' trip to Dr. Thompson's. I think my brain would explode if I tried.<br><br>David Cronenberg, cinematic master of the macabre, struck gold with \"Naked Lunch\". Here we have one of Cronenberg's most fully realized fantasies. It's sick, disturbing, and confusing and, in these ways, it almost reaches the level of \"VideoDrome\", Cronenberg's true masterpiece and the most outright disturbing film I've ever seen. The creatures that Cronenberg dreamed up (based, of course, on Burroughs' warped ideas) are incredible. The seven-foot-tall Mugwumps (modeled after the physical appearance of Burroughs) creeped me out, and the half-beetle/half-typewriter creatures with talking sphincters are some of the grossest creatures I've ever seen on screen. These are things that Cronenberg delights in.<br><br>Peter Weller finally escaped from the shadow of \"RoboCop\" with this film. Ironically, the characters are similar. Both Robo and Bill Lee are monotone speaking, emotionless people. The difference being that Robo is made from forklift parts held together with duct tape and glue and Bill is human. Or at least I think he is. Nothing is certain in \"Naked Lunch\". Weller captures William Burroughs expertly. Judy Davis shows her range in the dual role of Joan Lee, Bill's wife, and Joan Frost, Bill's imagined lover. Joan Lee is drug-addled and loose; Joan Frost is uptight and needs to be taught how to be free. Davis makes the two women so different that it's almost impossible to tell it's the same actress in both parts.<br><br>If you like Burroughs, see this film. If you like Croneberg, see this film. If you want a simple, pleasant film...stay far away. :Naked Lunch\" is a pornographically perverted look at the complexities of drug abuse and the difficulties of the writing process. I don't use the word pornographically lightly. This is as extreme a movie as I've ever seen, especially coming from the Hollywood system. It's icky, it's gross, it's disturbing. It's also a masterpiece.","user":"CSM126-1","rank":[86,106]}]