[{"title":"This is hard medicine -- definitely NFE (not for everyone)","rating":8,"date":"2 January 2000","review":"The 1998 Danish Dogma film \"The Celebration\" (Festen) is another hard medicine movie, intense drama about family strives and  incest. The Danish film shows the intensity through dialogs and character reactions. Tim Roth's film cuts to the chase and shows the vivid horror of the actual act. Tim does not skirt around the subject. He takes the subject right on and tackles it directly and really shakes up the viewers. It's raw emotions -- nothing sentimental. The actors are in their natural appearances with not much make-up: Tilda Swinton you see her with the pregnant creased skin-folds of a tummy inelegance; the two teenagers (Lara Belmont as Jessie, Freddie Cunliffe as Tom) in their casual demeanor/slouching poses; Ray Winstone as the seemingly unsuspicious father who looks like any man of the house, full of himself and chatting incessantly (in a way, an indication of certain insecurity and self-doubt?). <br><br>We don't get to see the predator's face much. Director Tim Roth wants the focus on the heinous act vs. personal faces, which could be anybody who has had such traumatic experience at home. Home is where the trust and warmth of a family together should be. Through Tim's delivery, we see the coldness and frustration the two teenagers face, esp. Tom the son, who discovered the wrongful act accidentally and felt confused and unable to talk to anyone about it -- his sister, the victim, just as confused and unable to talk about it. The different levels of fear that each member of the family has A poignant film, with explicit scenes sensitively choreographed, demands viewers attention to the tough subject at hand. We can't turn away -- the inevitable merciless truth presented in our face on the screen. It's a bold attempt. This film calls for attention to the subject of incest and its traumatic consequences beyond imagination. Roth succeeded.","user":"ruby_fff","rank":[46,51]},{"title":"One of the best of the 90's","rating":10,"date":"15 March 2005","review":"Strange, opaque and deeply unsettling, the War Zone is the only way a film about a topic as horrifying as incest should be. Tim Roth, realizing that the family of the film is too far gone to elicit much empathy from the audience, simply tries to convey the story as truthfully as possible. With crushing results.<br><br>At the beginning of the film, we're introduced to a nameless clan: a genial father (Ray Winstone), a mother exhausted from recently giving birth (Tilda Swinton), a sullen teenage boy (Freddie Cunliffe), and his strikingly beautiful older sister (Lara Belmont). All four have recently moved from London to the remote, seaside village of Devon, leaving the two kids feeling isolated and adrift.<br><br>What follows for the next hour or so is a brilliantly confusing experience--Roth presents a series of odd quirks about the family that makes the audience question what is merely eccentricity and what hints at something darker. Why, for example, does the family walk around naked most of the time? Don't those siblings seem slightly too \"affectionate\" given that they're teenagers? What exactly does the boy see his father doing with his sister in the bathroom that bothers him so? All of this mystery leads up to an absolutely harrowing scene which leaves no mystery as to the dynamic between father and daughter. More emotionally explicit than physically so, the scene is rightfully regarded as one of cinema's more horrible acts of on-screen violence, yet doesn't feel gratuitous in the slightest.<br><br>This film is as sparse as possible, with almost no inflection or melodramatic effects. Scenes are generally shot in long takes with a static camera (gorgeously framed in widescreen). There is little excess dialogue, and almost no music. Often we are placed into the middle of confusing scenes that are open to numerous interpretations. We more or less have to come to our own conclusions about what is going on. The teenagers are as inexpressive and introspective as teenagers in real life, which makes there unexpected emotional outbursts all the more powerful.<br><br>Why Roth hasn't made any other films is beyond me. He has a lean, cinematic sensibility which is unmatched by any other actor-director. I hope he gets an opportunity to use it again soon.","user":"cedric_owl","rank":[73,86]},{"title":"A captivating work of art.","rating":9,"date":"6 December 1999","review":"A film dealing with the subjects of rape and incest could easily be sensationalistic and, consequently, undermine the very issues it supposedly tackles. It is, therefore, highly commendable, and testament to Tim Roth's skill as a director, that the War Zone does not cheapen its plot by doing this, but instead, provides a sensitive, dignified and beautiful treatment of the devastating effects of a father's depravity on the rest of his family, and, indeed, on himself.<br><br>One of the most striking aspects of the War Zone is the stunning and epic cinematography. Filmed in Devon, on the southwest coast of England, bleak, grey skies, the vicious sea and jutting cliffs frame the desolation of the central characters of the movie: Tom, the son, and Jessie, the daughter. The former, a withdrawn teenager, is devastated when he unwittingly discovers the secret relationship between his sister and father, and struggles with hatred and horror for them both, as he endeavours to find out the depths of the depravity he is privvy to. Jessie is equally, though differently, affected by the actions of her father. As she attempts to hide the truth from mother and brother, while also in turmoil over her own part in the secret, she feels a burden that manifests itself in moments of self-loathing, anguish and despair. However, the true depths of these emotions are never laid out for the audience, never portrayed in such a way that they could simply wash across our path and be discarded; they are merely hinted at, shown in fleeting moments. The fact that the protagonists in the film are being tormented by the events they are part of is obvious; it is left up to the individual to interpret and imagine the depths of the feelings being felt. This subtlety serves to add realism to the film, and also heightens the harrowing effect of it, as the events and feelings hinted at, or partly displayed, are absorbed and twisted by the mind of the viewer, almost contaminating him by forcing him to do the work in fully comprehending the goings- on in the family; making him empathise with Tom.<br><br>Although the emotions and feelings the characters in the film undergo are shown in an equivocal manner, several scenes are, in contrast, stark, with events lain bare to the audience. Again, this could be a point at which the War Zone sensationalises the subject matter. However, even the supposedly shocking scene between Jessie and the father is portrayed with sensitivity through the dignified direction. Indeed, in a film made as the War Zone is, it would undermine the very realism of it to avoid showing what goes on between the father and daughter. It is a movie that endeavours to show the realities of abuse in a family, and to gloss over an aspect of this would lead to an unfulfilling exploration of the subject. To re-iterate, though, it is testament to the skill of Tim Roth, that while not hesitating to show the full horror of abuse on screen, he does so in a way that does not cheapen the feelings of those  involved. Indeed, there is almost an air of gentleness in several of the more harrowing scenes; despite stark images being portrayed, one feels they are being shown in a highly respectful manner.<br><br>The War Zone is, in sum, a beautifully artistic piece of cinema. The cinematography, solemn, despairing music, slow yet strong direction, and fine acting contribute to a film that, though harrowing, is highly rewarding and enjoyable. I think the fact that it offers no answers or \"satisfying\" resolution to the events it has portray is again something the serves to add realism to the subject matter. After all, abuse is not a topic to be resolved without reducing it to trite concessions to viewers keen not to be forced to realise that some facets of life are not rounded, with simple answers and easy reprieves, but jarring and jagged, with no answers, resolution, or simple end.","user":"Ruvi Simmons","rank":[47,54]}]