[{"title":"Brit Wit Rom Com in one of London's most famous districts","rating":26,"date":"26 June 2007","review":"After reading the synopsis, 'Notting Hill' sounds like just another melodramatic Julia Roberts rom com. Fortunately, that ain't the case. 'Notting Hill' is fun, sweet, intelligent and  well, simply said, very entertaining. London's Notting Hill does seem like a street you'd like to walk on.<br><br>While the storyline itself is larger than life, the characters are real. There is no overt melodrama. We can see that Curtis put a lot of heart and some Brit wit humour into the writing. After meeting William, Anna, Spike, Max, Bella and Honey, we, as audience, really connect to these very interesting characters and care about them. The table discussion in Honey's birthday scene shows how all the characters connect. While a nervous Anna, is new to the group, we see that she eventually gets a hang of them and feels comfortable enough to talk about herself.<br><br>Hugh Grant isn't anything different from his other rom coms. Julia Roberts is brilliant. I never liked any of her romantic comedies (e.g. Pretty Woman, I Love Trouble, Something to Talk About etc) but 'notting Hill is an exception. She gives a subtle portrayal as hugely famous but very vulnerable Anna Scott and does full justice. This indeed is one of her finest performances. Rhys Ifans as Spike is standout! While Tim McInnerny, Emma Chambers, Hugh Bonneville and Gina McKee (love her) are excellent. McKee's comedy is extremely subtle and her character is one of the most appealing. She underplays her part with tremendous grace and maturity.<br><br>All the actors share a very warm chemistry that just keeps adding on to its quality. The relationship and friendship between the characters is shown in a very sensitive way. While Spike and William are roommates who just seem to get along, we know that they like each other. Also William is about to cancel a date with the world's most famous actress to attend his sister's birthday party. The relationship between Max and Bella is beautiful.<br><br>Additional credit must be given to Coulter's amazing cinematography and the visuals. Watch the scene where Thacker is walking through the market and we see the weather change (indicating the passing time). There's a beautiful soundtrack that recites the moods of the scenes. And last but not least, thanks to Roger Mitchell for putting it all together to tell us this sweet entertaining story.","user":"Chrysanthepop","rank":[62,68]},{"title":"20 years later and still excellent","rating":10,"date":"24 April 2019","review":"This movie is 20 years old, but it's still the most enjoyable movie I've seen in ages. Why can't they make movies like this again?","user":"thandi-lamprecht","rank":[38,41]},{"title":"Sparkling fairy tale romance, film star meets ordinary bookseller","rating":8,"date":"16 March 2006","review":"Whether or not realistic, this is a wonderfully touching fairy tale like story of the romance between two people of unequal social and financial standing. The beautiful, rich, and famous American movie star is superbly captured by the incomparable and always endearing Julia Roberts, who brings such a wonderful vulnerability to her roles. Hugh Grant is perfect as the shy, stammering, bumbling, unassuming, obscure, and not very affluent London bookseller, who shares a flat with his zany, weird roommate, Spike.<br><br>The tale revolves around the world's most famous actress, Anna Scott, who visits a Notting Hill travel bookshop and thereby meets the very ordinary British bookseller, William Thacker. Improbable as it might seem, the two fall in love despite the fact that Anna already has a 'significant other' in the form of the obnoxious star, Jeff, who treats her poorly. Alas, Anna and William's romance is of course subject to hounding by the ubiquitous media, making the course of true love definitely not run smooth.<br><br>Just an aside, but did the screenwriters get Hugh Grant's character's name from the Victorian novelist, William Makepeace Thackeray? It seems quite a coincidence. Ha, ha. Anyway, nice name...<br><br>The film does a marvelous job conveying what must resemble Julia Roberts' own fishbowl life, subject to constant media scrutiny and innuendo. She must have identified strongly with the character she was playing, not only the media nuisance but also the failed relationships so common among film stars. Her hounding by the paparazzi is also of course reminiscent of that plaguing the late Princess Diana, and of course, sadly, resulting in her death.<br><br>The portrayal of William's friends is very touching here, as their reaction transforms from understandable awe at socializing with such a famous star, to accepting and treating Anna as basically an ordinary person and good friend. The viewer gets a sense of how much this response, this genuine friendship means to Anna. One of William's friends is a disabled wife in a wheelchair. Her normal, ordinary life and attitude are well captured and would be well received, I believe, by viewers with physical disabilities.<br><br>The love story is beautifully depicted. The sadness of Anna's failed past romantic involvements is conveyed, and despite the fame, her vulnerability as being really just 'an ordinary girl in love with an ordinary boy'. The portrayal of William is touching, as he copes with all the media attention, sees the actual person behind all that fame, wealth, and glamour, and tries to give Anna the genuine security and the 'ordinary life' she so desperately craves. A fabulous, moving, and ultra romantic film with a relevant message regarding modern society's perception and treatment of its movie stars. We can all learn a lesson here.","user":"roghache","rank":[15,15]}]