[{"title":"An awesome modern Danish movie","rating":9,"date":"7 August 1999","review":"Reviewing a movie like this is a tough one, to say the least. The action takes place in inner-city Copenhagen, Denmark, and knowing the background culture and language of this location is a very large part of being able to fully appreciate this film.<br><br>The story starts out as a relatively normal one about a bank clerk who averts a bank robbery, mostly by chance, is interviewed on national telivision, yet somehow still manages to bore his girlfriend enough for her to dump him, all in the same day. It then takes a surreal twist as the wife of the now jailed bank robber barges into his apartment and gives him a guilt trip about why he couldn't just have let the bank robber take the money so she could get the expensive operation she needs for them to be able to have a much-wanted baby. The bank clerk is mightily confused by all this, and approaches his criminal brother with ideas of robbing one of the bank's cash-transport vehicles (in a rather special way) and helping the bank robber of of jail in order to reunite them and make things well again.<br><br>This is when one discovers the true nature of the film.<br><br>The bank clerk's brother is basically a complete psycho with his own very special right/wrong codex (at one point he tells us how in China it is ok to eat dogs, and that it's up to oneself what is right and wrong - hence the title). As things progress, it becomes clear the movie is quite un-serious, and it becomes very easy to just sit back and enjoy the bizarre and often twisted situations that arise.<br><br>Two young chain-smoking chefs working for the criminal brother deliver the much-needed comical relief, responding to the brother's orders of dumping yet another corpse out in the Danish marsh with lines like \"But.. but we're just cooks\"!<br><br>It is impossible to really do the movie justice with any form of narration. Much of the action would sound very disturbing if retold, but when seen along with the characters' expressions and in light of the whole movie, including the refreshingly unexpected ending, it is hard to take very seriously.<br><br>The dialogue of the movie, reminiscent of classics like Pulp Fiction and Lock, Stock and Two Smoking Barrels, is what really shines through. As the story unfolds and becomes more and more far-fetched, each line of dialogue becomes a stand-alone punchline in as of itself, leaving most audiences (at least the ones I've been with) roaring with laughter.<br><br>Kim Bodnia of \"Nattevagten\" (1994), \"Pusher\" (1996) and \"Bleeder\" (1999) fame delivers yet another stunning performance as the psycho criminal brother who puts his version of family values above anything else in life (including the lives of anybody else in his way) - just like the rivaling gang of ethnic heritage do in the film.<br><br>A must-see for anyone with an appreciation for twisted humor, especially if one is in a position to appreciate all the references to the background culture - though probably a bit hard to swallow for some (read: reserved) people.","user":"Gnug315","rank":[55,61]},{"title":"WOW! A philosophical gangster comedy!","rating":12,"date":"12 September 2004","review":"I have seen both IN CHINA THEY EAT DOGS and it's prequel, OLD MEN IN NEW CARS, and I have to say that this is the best of them. Where OLD MEN is a little more formulaic and recognizable as an average crime comedy, CHINA has fantastically bizarre elements that surprise and alarm. It's amazing how comical death can be if handled in the right way. <br><br>The film does bring up genuinely philosophical questions of right and wrong that, in my household, spurred interesting discussions about morality vs. social norm.<br><br>By the end of the film you most likely will be thinking about the same things and hoping that in your last hours you too will be able to avoid the men in the funny pants.","user":"filmjunkie333","rank":[42,47]},{"title":"In China They Eat Dogs","rating":8,"date":"20 September 2010","review":"Action films are not the most prominent type of Nordic cinema, but not entirely unheard of either. A good example is the Danish black comedy In China They Eat Dogs that was eventually followed by a prequel Old Men in New Cars in 2002. The story deals with Arvid Blixen (Dejan Cukic), a mild-mannered bank clerk who is dumped by his girlfriend for being too boring. After unexpectedly preventing a bank robbery, he comes to re-evaluate his uneventful life and decides that he wants to be a criminal instead to help out the robber Franz (Peter Gantzler) whom he inadvertently sent to prison. With the help of his ruthless restaurant owner brother Harald (Kim Bodnia), his cooks Martin and Peter (Nikolaj Lie Kaas and Tomas Villum Jensen) and the hapless kitchen assistant Vuk (Brian Patterson), Arvid gets involved in a spectacular downward spiral of crime, after which nothing will be the same again.<br><br>The movie doesn't allow itself to be bound by the limitations of realism and maintains a very dark comedic mood throughout. A lot of the appeal comes from the unusual nature of the characters: the gang members are not sharp-tongued gangsters like in many regular heist films, but instead rather shy and easily manipulated. Awkward silences take the place of clever insults and snappy comebacks – the chemistry between the team burns quietly. The comical Martin and Peter, the unlucky, naive Vuk and the timid Arvid end up in increasingly uncontrollable situations where bodies start piling up and the direction of things slips out of control but everything is taken with confused Nordic reservedness, adding up to a pretty unique and quietly funny story. Interspersed with the main scenes are clips of a foreigner named Richard (Lester Wiese) narrating the story to a bartender (Jesper Christensen); the story lines are tied together in the bizarre supernatural ending that nevertheless oddly manages to fit in the film's casual state of mind effortlessly.<br><br>The action scenes are well created, especially the epic armoured van robbery, and the surprisingly brutal violence is only softened by the politically incorrect dark humour bubbling under the surface. The title\"In China They Eat Dogs\" is related to the theme of the relativity of morals; the will of a timid man wanting to be bold and true to himself in the midst of unpredictable twists of life is not left unrewarded at the end, but since everything is seen through thick satirical glasses, nothing can be taken too literally. To sum up, the movie successfully plays with the conventions of crime cinema and moral expectations of the audience, creating an enjoyable little movie that is both over-the-top and down-to-earth at the same time.","user":"random_avenger","rank":[13,13]}]