[{"title":"overlooked gem shows what a modern war really is","rating":9,"date":"29 March 2000","review":"It's hard to really adequately describe this movie.  Let me try.<br><br>For starters, in spite of the advertisements, it's not merely a remake of \"Kelly's Heroes\".  Yes, we are in a postwar situation, where a bunch of Americans are trying to \"recover\" gold stolen by the enemy, but that's the end of the similarities.<br><br>\"Three Kings\" does an excellent job of showing just how gonzo modern warfare has become.  You've got unemployed reservists going to the Middle East for kicks fighting Saddam, who uses gas attacks, electric shock torture and other atrocities to fight the rebels.  Thrown in the mix are a U.S.-educated Iraqi whose businesses were destroyed by the Americans, a bunch of rebels and refugees living in bunkers, a CNN-type correspondent facing the threat of younger reporters, and Mark Wahlberg's character finding a cell phone in the Iraqi bunker and using it to call his wife in the U.S.<br><br>The movie is extremely funny at times, graphically violent at times, but always on target.  It provides a lot of insight into how non-Americans view the U.S.  I cannot think of another major movie which showed people in a third-world country as modern people without patronizing.  Even the soldiers shooting at our heros, gassing the refugees, and torturing Mark Wahlberg's character are shown as human beings.<br><br>Somehow this movie got lost last year amongst all the hype for \"American Beauty\".  \"Three Kings\" looks to have much more staying power. George Clooney continues to shine in yet another under-appreciated performance.  For somebody with a Hollywood legacy, he really seems to have pushed some of the wrong buttons in Hollywood.  I cannot think of any other explanation for why he has yet to achieve the acclaim his performances deserve.","user":"Rick-34","rank":[125,157]},{"title":"Russell steps up to the big leagues","rating":10,"date":"5 October 1999","review":"In 1994 and then 1996, David O. Russell proved himself to be one of the few original voices in American comedy with his films SPANKING THE MONKEY and FLIRTING WITH DISASTER, respectively.  He could have continued in that vein, but instead he seemed to be going mainstream with a studio film, starring George Clooney, Mark Wahlberg, and Ice Cube, which seemed to be an action/adventure set in the Gulf War, at least if you only saw the trailer(which left me going \"Huh?\").  After seeing the film, it's clear to me that Russell is now one of the major talents to emerge from the 90's, as this is a masterpiece.<br><br>As I mentioned before, the trailer was confusing, but while the movie is clear, Russell(who re-wrote a script by John Ridley, though there's a lot of contention over who exactly did what) makes clear from the beginning his intention to throw curves at us whenever he can, starting with Wahlberg asking as he draws his sights on an Iraqi soldier, \"Are we still shooting at people?\"  He shoots the soldier anyway, and is immediately remorseful when he sees the soldier was holding a white flag.  The movie goes from there to soldiers who, although in a celebratory mood, are still somewhat puzzled as to why they're there, a reporter(played well by the underused Nora Dunn) who can't help but talk in cliches, a tanker which, when shot, turns out to be holding milk, and Iraqi refugees who thought Americans were going to liberate them from Saddam Hussein and now are suffering because of it.  It's this attitude which makes the otherwise normal-sounding plot - Clooney, Wahlberg, Ice Cube, and Spike Jonze play soldiers turned thieves who end up with a conscience - play as anything but normal-sounding.<br><br>Another thing which helps is the photography(I forget the guy's name, but he also did THE USUAL SUSPECTS).  Far from the clear-looking photography we got in the telecasts, this is rough, dangerous, and, just like the plot, constantly putting us off our guard.<br><br>Finally, the performances.  Clooney I think has long been underappreciated not, as most people assume, because he's a sex symbol, but because he, like Harrison Ford and others of his type, make it look easy.  There's nothing easy about his character here, and Clooney doesn't take the easy way out here.  He doesn't coast on his charm and try to make the character likeable, but goes through the journey his character does, and even without a lot of dialogue(at the end, his face when he signals to Wahlberg and Ice Cube says all we need to know, as does their nods back).  Wahlberg is fast becoming one of our better actors, and this proves it.  He even finds comic potential where you wouldn't expect any.  Ice Cube has had a mixed career since BOYZ IN THE HOOD, but this ranks up with that performance.  Finally, Jonze has been criticized for playing a hillbilly stereotype, but the key is how he's more like a lapdog hungry for affection rather than just plain white trash, and he plays it as such.  This is the best film I've seen so far this year.","user":"SKG-2","rank":[85,109]},{"title":"Funny, shocking, thought provoking and honest.","rating":9,"date":"25 March 2000","review":"A film for anyone who ever relishes the triumphal note of western war films, who gets carried away by the moral high of being on the winning side.  For those who saw the good in the Gulf War, saw how many people America helped and was proud to live in the Western world.<br><br>Three Kings is an anti-war film.  Its opening scenes are not the declaration of war, but soldiers celebrating its end.  Then coming to grips with its consequences.<br><br>Of course, Saddam Hussein is depicted in the customary role of the villain, but then so is George Bush whose abandonment of the Iraqi people he had called to rise against Saddam is illustrated with examples of human suffering - emotional as well as physical.<br><br>Don't get the idea that this is a bleak and 'worthy' film, in many ways it is, but it does it with such style and black humour - that forces you to laugh even while being disgusted or perturbed - that it is eminently watchable.  But still edgy, I was pleased to see one couple walk out (though they might just have gone to the toilet, who knows, I was absorbed by the film and didn't pay enough attention).<br><br>Director, David O Russell, ensures that the film never gets carried away with action scenes - bullets have consequences (good and bad) even when fired by an all-American soldier.  There is some stunning cinematography. Particularly shocking to me was when Iraqi soldiers fire at a tanker. Nothing's more shocking than the unexpected and dramatically understated (I didn't see the trailer, though I believe that scene was actually in it).<br><br>There are some interesting cinematic devices in the film.  The next time that sepsis comes into conversation I'm sure anyone who has seen the film will call to mind scenes of a bullet travelling through the body.  I've seen less violent films than some people, but have been swept away by their power many times - become blasé about bullets and cinematic death.  I've seen it all too often before to care about nameless victims that stand in the way of the power, wit, and understanding of the hard-bitten, long-serving soldier, wielding a justice in the shape of a gun.<br><br>Russell claimed to make every bullet count in the film, and in one memorably calm scene of confusion and crossfire, he certainly does.  The style of the film however doesn't detract from its content.  Three Kings doesn't have pretensions of addressing difficult issues by showing the manly, serious face of George Clooney looking a little concerned after killing a few dozen of the enemy.  It has intelligent dialogue and moving scenes of confrontation between the opposing ideologies of the Americans and their 'allies' and 'enemies' alike.<br><br>Not the best date movie in the world.  Funny, shocking, thought provoking and honest, 8.5/10.","user":"Gem-22","rank":[82,114]}]