[{"title":"I know two people who like this movie!","rating":8,"date":"24 April 2005","review":"Lighten up! This movie IS FOR KIDS! My 9 year old daughter and her Chinese mom really enjoyed this. The admittedly fake storyline (which could have been stolen from any of about nine million family wildlife movies) is overcome by the sheer personality of the panda cub and the terrific scenery. There are very few movies that depict either pandas or the beautiful Chinese panda reserves. The movie also shows the American contribution to the preservation of the pandas; the Chinese government wasn't doing much at all until American naturalists got involved in the 70's.<br><br>Kids will enjoy this and you crabby adults will survive it.","user":"yawn-2","rank":[16,20]},{"title":"The Good & Bad Of 'Amazing Panda Adventure'","rating":4,"date":"23 November 2006","review":"GOOD - There is some wonderful Chinese mountain scenery in here, really beautiful. The pandas are \"cute,\" too, as expected. They are always fun to watch.<br><br>BAD - Instead of this being about the pandas, the kids in here (or the screenwriters) make it more about themselves. Included in their scenes are some incredibly stupid dialog. Just as insulting was a big scene near the end where the children physically fend off the adult poachers. Yeah, right. In between, we get the normal plug for New Age \"mountain spirits\" and the like.<br><br>OVERALL - Entertaining but the kids in her are very annoying at times.....too annoying for a second viewing.","user":"ccthemovieman-1","rank":[11,15]},{"title":"A wonderful film that would enlist peoples' sympathies for the Giant Panda population","rating":10,"date":"11 October 2008","review":"I do remember 11 years ago (or so I don't know) seeing the trailer for this film, and I wanted to see at theaters - but I didn't get a chance. But when it came out on video, I got it as a Valentine's Day gift from my Mom. When I watched it, I really loved it; though I can remember I had only watched it a couple of times long ago - until now that is.<br><br>The film starts when 10-year-old Ryan Tyler goes to China during his spring break to visit his zoologist dad Michael, who has been working on a project to rescue the dwindling panda population. But there was poacher trouble and Ryan, along with young assistant/translator Ling decide to rescue an adorable panda cub, which has been \"animal-napped\" and they must return him to its mother, whom Dr. Tyler rescued from a trap and brought back to the reserve to care for. Braving hardships and facing unexpected adventures, the two youngsters learn to love and respect for pandas as they gain maturity and tolerance for each other of course.<br><br>Like I said (a million times), I was shocked by the negative reviews/ratings I would see on the web, I mean I love films about human/animal relations; this film has heart and a little humor. And I think films like this one would enlists peoples' sympathies for the Giant Panda population.","user":"ja_kitty_71","rank":[3,3]}]