[{"title":"I think Alex Proyas had a stroke of genius in the making of this movie. One of the most original dark sci-fi movies I've seen in a long time.","rating":9,"date":"15 June 1999","review":"John Murdoch (Rufus Sewell) wakes up in an eerie hotel, naked and in the bathtub, with no memories and blood on his forehead. (I couldn't imagine a more strange and frightening experience.) The ring of the hotel phone breaks the silence-- a strange man on the other end tells him he must leave because there are people looking for him. Many events such as this one unfold in Dark City, where \"man has no past... and humanity has no future\".<br><br>Dark City has been passed over by so many critics it's depressing. I think that it should at least have been up for \"original screenplay\" or SOMETHING at the Oscars to reward Alex Proyas for his fantastic vision. I fail to see why so many people label this movie \"noir\" like it's BAD or something. Being dark and twisted is not a crime, and despite some other people's comments, this movie is NOT just for the trenchcoat-wearing masses (or if it is, maybe the rest of you can learn something from Goths). If you like sci-fi, dark plots and having reality be so well distorted that you don't realize it IS, so you will love Dark City. (People who have seen the Matrix BEFORE this movie MUST see it, it is very similar in these three respects).<br><br>I gave it a 9 out of 10 ONLY because I thought the ending fight scene was a bit weak. Great for a fight scene, but because the rest of the movie focuses on John Murdoch's quest to discover his past and the eerie, ominous happenings in the city, the climax seemed hastily thrown together, as if the crew all of a sudden remembered they had a deadline to meet and could no longer continue the plot in the previous fashion.<br><br>The visuals in this movie were absolutely stunning. The effects were NOT used to substitute for the plot, like other movies such as Starship Troopers, Lost in Space and Alien: Resurrection. They were used only as needed and were breathtaking. The editing is NOT as choppy as is rumored, it only lends to the power of the movie. There are some heart-stopping images in Dark City. Watch for the Strangers' clock, views of the city and John's memories.<br><br>Proyas takes ideas and ambience from many other movies but integrates them all neatly into Dark City. Gotham City is clearly seen as is Metropolis and other influences such as Ed Hopper's \"Nighthawks\" dominate in the diner scenes. The forty-ish era (yet strangely futuristic) city is known to be populated, and yet it is ominously empty (hence one of Hopper's main themes, isolation in large cities). (It's especially quiet at midnight, hehehehe... ;D ) This 40's era ambience together with the sci-fi fantasy undercurrent makes for a very interesting feeling while watching.<br><br>I'm happy that Kiefer Sutherland, Richard O'Brien (of Rocky Horror fame) and William Hurt agreed to do this movie, it gave Dark City just that much more validation in the USA (I wish things weren't like this, but they are). Kiefer Sutherland is absolutely wonderful and convincing as the doctor/scientist Dr.Schreber, and Rufus Sewell is a properly confused yet determined John Murdoch. Many critics say that William Hurt's character, the detective, and Jennifer Connelly's Emma Murdoch could have used a little more development, but I think part of the point of Dark City was that you don't really know who people are (not to mention yourself). Richard O'Brien and his character's whole race creep me out every time I see the movie, but he's especially frightening and a strange character. I had to resist the urge to talk like a Stranger after seeing the movie a few times.<br><br>Trevor Jones, one of my favorite movie composers, did the score for Dark City, and I must say it's very apropo. The deep, bass vocals and frantic themes are some of my favorite aspects, but \"Memories of Shell Beach\" is a haunting, beautiful song as well. Some of my other favorite scores by him are the Dark Crystal and Last of the Mohicans.<br><br>Altogether, I think Alex Proyas had a stroke of genius in the making of this movie. One of the most original dark sci-fi movies I've seen in a long time. It deserves its place with the Matrix, 12 Monkeys and others, pioneers in a field so changed (usually for the worse) since Star Wars and since earlier sci-fi classics. I hope these won't be the last of a (dare I say it?) dying race of movies that have true creativity and originality.","user":"nitehawk-8","rank":[404,460]},{"title":"Underrated Brilliant Film.","rating":10,"date":"14 February 2005","review":"Dark City is all about a man who has incredible powers but doesn't realize it. Everyone is under the control of mysterious 'strangers' who are injecting them with false memories/altering their reality. This man (Rufus Sewell) finally confronts these men in a battle for the city.<br><br>This is one of those films that inspires you to learn more about sci/fi. The whole movie is cold, dark and it never lights up for a minute. This movie is an underrated brilliant sci-fi film and it bares a resemblance to 'The Matrix', but was made before it, so there is no denying that Dark City must have been an inspiration for The Matrix.<br><br>The story is complex but develops itself as a frequently entertaining thriller. It is thought provoking, which is a lesser thing you'll find in films today. You'll sit there thinking about life after viewing this film. It can easily been our future if we head down the road we are on.<br><br>The performances are all very good, specially the three lead men. Rufus Sewell plays the confused lead, William Hurt plays the film noir detective and Kiefer Sutherland is the quirky side switching doctor. Don't forget Jennifer Connellywho plays the role with great expertise. Alex Proyas much like The Crow has created this Gothic world where the sun never rises and inhabitants live in darkness. The sets and costumes are beautiful. The acting is top-of-the-line, with Sewell in the lead part. Everyone does a great job.<br><br>The villains in this film, THE STRANGERS, are creepy and will send chills down your spine every time you see them in their long black coats and hat. The costumes for them are perfect and could not have been done better, they live in the world underground and you see the different lifestyles between them and the people they control, yet live above them.<br><br>The thing that amazed me the most would be the cross between the 1950 to 1980's, it was brilliant, the set pieces were perfect for this film. Every time I saw the buildings changing, I was in amazement. Everyone that took part in this film should be praised, this is a film that should get more attention from the general public, but is overshadowed by films that like to put more action then story in it's plot.","user":"Matt_Layden","rank":[170,211]},{"title":"A fantastic science-fiction masterpiece!","rating":6,"date":"6 February 1999","review":"An absolutely brilliant and nightmarish production!  DARK CITY is an enriching and surreal experience, full of beautiful images and powerful symbolism.<br><br>John Murdoch (Rufus Sewell) wakes up one night, resting inside a bathtub. He look around, realizing that he is inside a hotel room.  In a state of shock, he finds a bloody corpse lying near his bed. Then...reality sinks in. He discovers an appalling revelation which he cannot accept. He is wanted for murder on six separate accounts.  How does all of this fit in when he thought of himself as a completely sane person?  He does not believe he was responsible for these murders, but the cops think otherwise as they chase him down... Next, a swarm of humanoid creatures known only as the \"Strangers\" have summon him.  For unknown reasons, Murdoch happens to fit into their intricate schemes for conquest...<br><br>This is just scratching the surface of the premise for Alex Proyas' moody and engaging film, DARK CITY.  DARK CITY is a very vivid film with an original concept. As the story expands and the main character must go into the heart of the matter, he learns that there's a conspiracy going on \"mixing and matching\" different identities together into one whole. The Strangers are the masters...the inhabitants are their puppets...and the city is their playground...<br><br>DARK CITY essentially has gorgeous photography, capturing aspects of the entire city where imagination paints the picture and provides the details. This film relies a lot on imagery and the fantastic production values are laced with a perplexing storyline that keeps the viewer's eyes glued to the screen. The eye-catching, stylish future noir designs a visionary world, evinced in the setting of the Big Apple itself, New York City during the time period of the 1940s. Dark City's visual backgrounds enliven a difficult and incomprehensible plot to comprehend and the special effects create an astounding experience, traveling into a vortex of mankind's phantasm.<br><br>DARK CITY, in addition to the superb background settings, allows for character development as well. The audiences grows greatly in a moment of eagerness as they want to determine what will happen next to the characters in this film. As always, the cast is wonderful. Rufus Sewell is excellent as John Murdoch, convincing as an ordinary man on the run from both the law and the strangers. Jennifer Connelly is sensuous and appealing as Murdoch's loving and concerned wife. William Hurt plays his cards right as a straitlaced NYPD inspector, Frank Bumstead, who keeps pursuing John Murdoch.  As  an  eccentric   psychiatrist,  Dr. Daniel Paul Schreber, Kiefer Sutherland conveys a confused doctor who shares a frightening connection to these Strangers.<br><br>DARK CITY is splendid viewing injected with a theme about the loss of identity and the destruction of individualism in order to create an ideal society.  DARK CITY is an unforgettable, breathtaking visual experience! This film is enriched with layers of characterization, a plot where there is more than meets the eye, and venturous special effects.  DARK CITY is recommended viewing with the lights out!  A  thoroughly  cogent flick which keeps you guessing what is going on.  DARK CITY is a fine treat for the eyes and mind.  This is one journey where you reach the point of no return!<br><br>RATING: *** out of ****.","user":"ChoiBaby","rank":[151,194]}]