[{"title":"Great!","rating":8,"date":"4 December 1999","review":"\"Chasing Amy\" is a clever and engaging urban love story that just exudes with Kevin Smith's gritty humour. The film's examination of sexuality, and everything involved with it, doesn't for one second sound untrue, even when it makes sure that everything being pointed out is expressed frankly and colourfully. It's not everyday we get a story of a heterosexual man falling in love with a homosexual woman, and although the concept could easily have resulted in a disaster of a movie, \"Chasing Amy\" manages to layer everything almost flawlessly. There are no predictable pitfalls in this film, and nothing is wrapped up in a neat little package. We are offered a group of characters that are likable but flawed, who don't always get, or give, what we would usually expect. I have to say, I never knew what was going to happen next, it manages to be consistenly offbeat without being unrealistic. Ben Affleck and Joey Lauren Adams have incredible chemistry together, perfectly displaying all the emotional complications a relationship as eccentric as theirs would have. Jason Lee was also outstanding in his role of the vaguely jealous best friend. The only thing that bothered me about this film was there was too much YELLING!! and it was slightly uneven at times. But generally I liked it a lot, and I'm just thankful that Kevin Smith is producing such fine work like this, it is truly a refreshing escape from Hollywood's formulaic sap.","user":"Adrian-32","rank":[93,126]},{"title":"The Best Love Story of the Year","rating":10,"date":"2 February 1999","review":"\"Chasing Amy\" has to be the best love story of 1997.  It was emotional, gripping, funny, sad, heartwarming, and had some great jokes.  How could anyone deny that this screenplay was anything less than original, or perfection.  Absolutely intoxicating.  The performances were right on and the writing was magnificent.  Kevin Smith is, without a doubt, one of the best new writers.  With this movie he goes to a whole new level.  \"Clerks\" was great, and I think I'm one of the five people that enjoyed \"Mallrats\", but \"Chasing Amy\" takes the cake.  Nothing else came even close that year. That movie should have made a star out of Joey Lauren Adams.  She gave the BEST performance in 1997 and was robbed of an Oscar nomination, as was the script.  The scene outside of the ice rink is more than enough to show just how good she was.  And anyone who can watch that ending, the you don't know if you should cry or jump for joy ending, and not feel something, is heartless.  The movie was great.  It is one of my personal favorites, and will always be.","user":"Tanner-3","rank":[86,121]},{"title":"Not to be missed!!!","rating":16,"date":"16 May 2001","review":"My all-time favourite film!  Kevin Smith creates such truly endearing, eccentric, quirky characters, and then manages to cast actors who seem destined to play their roles.  Joey Lauren Adams steals the show (we need to see more of this brilliant gem!), and the Jason Lee / Ben Affleck dynamic is really powerful - all of the actors appear so natural and comfortable, and Jason Mewes is a gift from God (and that's coming from an athiest!). A beautifully written conversational comedy that very gently uncovers the hypocrisy surrounding gender relationships. This film goes way beyond the 'acceptance of sexual preference' cliche, and instead concentrates on the insecurities that all human beings are born with - gay or straight!  Mr Smith, you are  truly a genius!!!","user":"TaniB","rank":[51,70]}]