[{"title":"I love this sequel and my second favorite in the trilogy!","rating":9,"date":"31 October 2015","review":"Teenage Mutant Ninja Turtles II: The Secret of the Ooze (1991) it is a worthy follow up top the original classic action film Teenage Mutant Ninja Turtles (1990). This sequel is way improvement over third film and both of reboot films. It is my second favorite film in the trilogy and it is almost good as the first movie! I love them both to death and it is an excellent sequel.! It is my childhood film and I grew up with it. The first one was dark and awesome kick ass film, my favorite childhood film of all time, this sequel is good on the same level as the first is, just the first one is the best and far way better than all the films about Ninja Turtles were made! <br><br>After the big success over the violence in , Teenage Mutant Ninja Turtles the movie makers \"dumbed\" down Teenage Mutant Ninja Turtles II: The Secret of the Ooze, making the turtles more funny, less weapons and less fights. The TMNT star in the greatest movie of the 1990's, maybe even HISTORY! Our \"Heroes in a Half Shell\" must battle the Foot, and that dastardly devil Shredder to save New York. This movie shows that on rare occasions a sequel can be as good or better than the original! The Turtles look awesome and Keno definitely adds to the excitement of the movie! You have to give props to any pizza delivery guy that knows martial arts and can kick it with the Turtles. <br><br>We learn more of the origins of the turtles as well as meet a few new characters who help the turtles out. Raph's voice/actor replaced unfortunately, his personality lost. He angers for no real reason. This is Donnie's movie, he gets to be a geek, which worked. His original voice talent also replaced due to Cory Feldman's issues back then. The story would have been a lot more enjoyable without the horrible \"Ninja Rap\" and Vanilla Ice, that sequence ruined the movie for this viewer. Tokka &amp; Rahzar are adorable. It got a little too much like the cartoon with \"super Shredder\" and the more laughs than drama that the first movie had. Jim Henson's Creature Shop designs where outstanding which the animatronics did work for the film as well as its predecessor. I love Jim Henson's Creature Shop! <br><br>Teenage Mutant Ninja Turtles II: The Secret of the Ooze is still my favorite childhood memories film that I have always enjoyed and I always will. There isn't any drama in it, which I like it, there is a lot of comedy in it a lot funny moments, less sadness in it. Raphael, Leonardo, Michelangelo and Donatello are awesome!!!<br><br>One problem I have I wish that, they had Casey Jones instead in it and the music soundtrack could have been better. I wish there would be Corey Feldman's voice in the movie from the first movie. <br><br>I enjoy this film it is more entertaining and fats paced and I still love it!!! I love The sequel to the original movie. I love the fight scenes with the foot clan, and with thieves in the beginning of the film! GREAT opening sequence when the TMNT fly over Keno and kick butt in the toy store. Awesome storyline to connect their origin..... to the Ooze and TGRI. A new April ( although Mrs Turco did an alright job) I still wish there would be Judith Hoag in it, she was a lot of better than Paige Turco was. Those are the main problems with the film I have. <br><br>The Turtles and the Shredder battle once again, this time for the last cannister of the ooze that created the Turtles, which Shredder wants to create an army of new mutants.<br><br>Teenage Mutant Ninja Turtles II: The Secret of the Ooze is a 1991 American live-action film based on the Teenage Mutant Ninja Turtles characters published by Mirage Studios. It is the sequel to the 1990 film, Teenage Mutant Ninja Turtles. <br><br>The rating I am giving is a 9, it is not that good like the first one was but it is still good and it is my childhood movie.","user":"ivo-cobra8","rank":[19,21]},{"title":"Go Ninja Go Ninja Go!","rating":7,"date":"15 January 2004","review":"Good times once again as we return with our turtles in a half shell, Teenage Mutant Ninja Turtles II: The Secret of the Ooze is the popular sequel to the very popular and successful movie Teenage Mutant Ninja Turtles. We had some minor changes to this film, while the first movie was a success, parents complained of it's dark nature and mild cursing. So this film was a little brighter and family friendly, while it drug the film down a little for some odd reason I still loved this movie. Not only me but some of my other friends loved it as well, I don't know if it's because we grew up with this film or whatever, but we still have so much fun watching it despite it's cheesy themes and the fact that Vanilla Ice makes a cameo with the ever infamous Ninja Rap that he knew the lyrics and dance too before he even knew the song existed.<br><br>The Turtles have been forced to live with their friend the news reporter April O'Neil because the Foot Clan know the whereabouts of their lair in the sewers. While the Turtles are looking for a new home, they encounter a pizza delivery boy named Keno, who is trying to fight off a band of robbers by means of his skill as a martial artist, where the Turtles intervene on his behalf. The Foot Clan, no longer as large as it was in the first film, have retreated to a large junkyard, where Master Tatsu, Shredder's second in command, attempts to take control of the gang, but is challenged by Shredder himself. Shredder was thought to be dead. He now appears physically deformed and obsessed with obtaining revenge, to achieve which he sends a Foot member to pose as an intern at the news network and trail April. April is shown making a report on the efforts of an industrial organization known as TGRI to neutralize pollutants that have resulted from their experiments. Splinter, seeing the report on television, shows the Turtles and April the canister of \"ooze\" that had caused himself and the Turtles to mutate into their present forms, revealing that it was made by the TGRI. The Turtles infiltrate the TGRI offices to seize a sample of the ooze, only to encounter Tatsu and the Foot. Despite the Turtles' efforts to stop them, Tatsu and the Foot escape, taking the last canister of ooze and Professor Jordan Perry with them. Shredder later instructs Perry to use the ooze to transform a snapping turtle and a wolf into monsters, creating the characters Tokka and Rahzar.<br><br>Teenage Mutant Ninja Turtles II: The Secret of the Ooze is silly and over the top, but it's still a really fun movie and has all the action and good times the first one had. I absolutely loved the scene where the turtles try to trick Tokka and Rahzar with the donuts, inside the donuts are the cure to make them small again, but of course they don't fall for it after a while and the turtles have the butts handed back to them, big time. I also love the little flaw where the last film Shredder is crushed in a garbage truck, he comes back to life, but he becomes super Shredder where nothing should kill him at all, except for a bridge that falls on him and the turtles, but the turtles manage to survive, lol. It's all good though, this is just a fun movie and I'll always watch it, besides you have to keep that Ninja Rap alive.<br><br>7/10","user":"Smells_Like_Cheese","rank":[40,53]},{"title":"Superb but lacks darkness like the original","rating":9,"date":"10 August 2005","review":"The sequel to the smash hit 1990 TMNT, starts off greatly with an introduction to a new character (Keno) and has a great pizza scene showing how the city loves New York pizza as well as metaphorically showing the viewers watching that this indeed is a turtles movie...The opening music is great and is perfect for the city scene.<br><br>The plot is not as well thought out as the original but still does the turtles a good name for them...I still feel they rushed it a little seeing that the movie was in production right after the 1st movie went into theaters...I seem to feel the super shredder was the turning point in the franchise, meaning that it went from a sort of Tim Burtan feel with TMNT 1, and ended up with a corny kid focused feeling with the introduction of the super shredder..and the ninja rap didn't help either..all though I thought it was cool....I just wished secret of the ooze was more of a dark TMNT movie....which the 1st movie held on to strong.<br><br>The addition of Professor Jorden Perry and the whole TGRI company was a great idea to explain the chemical spill and the mutation the turtles went through. His mature nature and serious tone helped the movie maintain a sense of maturity as well as stability in the plot.<br><br>The acting was great in this one as well and the comedy was just as good as in the first movie. Although Corey Feldman did not voice Donetello in this one, the replaced voice actor was great...I even might say that the actor that voiced Don in TMNT 2 is just as good as Cory Feldman's voice acting in the 1st and 3rd movie.<br><br>IN conclusion, TMNT: Secret of the Ooze is a great sequel that is both funny as well as serious and is a great movie for any age. The only thing that bothered me was that is was slightly too focused on the youth audience and didn't stay 100% with the original's dark atmosphere.","user":"enjoiskaterguy","rank":[27,36]}]