[{"title":"Trash ...","rating":1,"date":"11 December 2018","review":"Total trash movie ,don't waste your time and don't fall for false reviews\nbad acting , crappy script and totally no fun .","user":"MR-Katt","rank":[8,10]},{"title":"Three stars for the hair minus one for the sea sickness","rating":2,"date":"12 December 2018","review":"I heard of a handheld camera action before.. I never before experienced a crew simulate a full blown storm on open sea with a camera that had no tripod. Seriously the frame jumps a clear 30 CMs up and down while viewing ALL THE TIME!<br><br>Pretty impressive in some of the driving scenes.. How the heck did they get the car out to open sea?<br><br>The production values are very low.. Most of the budget was clearly spent on the poster. The acting.. I guess its on par with the standard C fare movie.. Below B grade for sure..","user":"IamJustTellingyouWhatIthink","rank":[6,7]},{"title":"Fun Retro 1990's Supernatural Cop Thriller","rating":9,"date":"8 December 2018","review":"From what vault did this film emerge?\nThis movie is a total throwback to 1990's action hero flicks.\nLethal Weapon meets Arnold Schwarzenegger with a dash of Jerry Lewis humor for good measure.\nThe imperfect grainy picture and sound lends itself to the retro grindhouse movement made popular by Quinten Tarantino &amp; Robert Rodriguez. There even appears to be miniature special fx work, which by todays measure seems all but gone in a world of digital creation. All special fx seem era appropriate. (in other words to not expect the latest high tech, expect what you would have seen circa 90's)\nThe musical score is surreal. Big orchestra music pieces intertwined with a few newer aged rock and roll songs to pump adrenaline.\nCar chases, there are good ones! Classic cars. Who ever heard of a Dodge Challenger convertible? There is one starring in this film. :)\nBurt Ward? yes, the boy wonder, Burt Ward of the 1960's Batman &amp; Robin. If you are a fan, he's here!\nTotal cult classic type movie.\nDo not expect political correctness. Do expect nostalgia, fast cars, funny or not so funny one liners and classic Good vs. Evil Fun.\nI recommend.","user":"Tim-DAX","rank":[11,21]}]