[{"title":"Enjoyably dark telling of the fairy tale","rating":29,"date":"29 November 2002","review":"On a trip home, Lord and Lady Hoffman's coach turns over and is attacked by wolves.  Lady Hoffman gives birth to her child in the midst of death and Lord Hoffman brings her up alone.  Years later Hoffman remarries to Claudia  but his daughter Lilly and her fail to hit it off.  Claudia blames Lilly for keeping the memory of his first wife alive and for the death of her own child at birth.  She tries to kill her but she flees into the forest where she is taken in by a gang of miners.  However Claudia uses magic under the guidance of her all seeing mirror to strike at Lilly again.<br><br>I wasn't sure if this film had ever even seen the inside of an UK cinema but I decided to give it a go anyway and I found it to be enjoyable even if it felt like a pantomime without the comedy dame and a really big budget.  The plot was quite intriguing to one who has only ever know the cartoon version, but it is close enough to that tale to be instantly recognisable.  The dark, adult edge to it adds in some ways but at times it feels like it's trying too hard to be nasty.  The film isn't too long which helps it have a brisk pace about it and it tries to skip from one reasonable exciting scene to another.<br><br>What really makes it worth watching is Weaver giving a really good performance as Claudia.  She portrays a human face gradually being led into worse deeds by the lies of her mirror.  She avoids hamming it up and is very enjoyable to watch.  Neill is very much on the sidelines but another familiar face doesn't hurt.  Keena isn't quite up to the role for me.  She is good but when the danger comes she is really only a scream and not a character.  The miners (7 dwarves) hold a few faces in Bellows and Glover but really they are either monsters or wear their \"good guy really\" badges on their sleeves from the start.<br><br>Overall this darker version is worth watching just to see a tale closer to the original version rather than the cartoon from Disney.  Some of it feels like it doesn't have a good plot (the action scenes after the middle tended to blur together for me) but it holds together pretty well.  The main reason for watching is a strong central role for Weaver.","user":"bob the moo","rank":[31,35]},{"title":"Very Good Horror/Fantasy Film That Deserves Wider Recognition","rating":8,"date":"21 January 2005","review":"This is a more horror-oriented version of the classic Brothers Grimm fairy tale \"Snow White and the Seven Dwarfs\", in which Snow White, in this case named Lilliana, or \"Lila\" (Monica Keena), has to deal with a psycho stepmother, named Claudia Hoffman (Sigourney Weaver) here, and ends up living with the seven dwarfs, or in this case, one dwarf and seven \"rogues of the forest\".<br><br>Snow White as a horror tale sounds like a good deal, and for the most part, it is when it comes to this film. However, there were a couple flaws that brought down my score to an 8 out of 10, but overall, this is a very good movie, well worth watching.<br><br>Let's get the flaws out of the way first--there are only two. The first is that some of the performances can tend towards melodrama, especially since director Michael Cohn does his best to ensure that no humor enters the proceedings. It's a very slight flaw, however, and is barely enough to subtract a point. On the whole, the performances here are very good, especially Keena and Weaver, and they are the focus of the film.<br><br>The more serious flaw is that a number of important developments in the plot go unexplained. There may have been an assumption that the audience is so familiar with the source material that they would be able to figure out these leaps, but most of the audience will only be familiar with filmic versions of Snow White, especially the Disney version. Questions such as \"How did she awaken? Why did she spit the apple out?\" are most easily answered by those with a familiarity with the original Brothers Grimm story. However, that's probably not a huge percentage of the film's audience. Having to piece together some of the plot is enough to draw the viewer out of the film's world a bit, and in conjunction with the melodrama, was significant enough for me to subtract two points.<br><br>But this film does a huge number of things right. It's clear from the opening scene, where Lilliana's parents are on their way home, riding in a carriage through a menacing forest. Vicious wolves, perhaps looking for food, attack, and the carriage goes tumbling down a hill. Lilliana's mother, pregnant and close to giving birth, is fatally wounded, and her father, Friedrich Hoffman (Sam Neill, playing a character undoubtedly named after E.T.A. Hoffman, another famous 19th Century fantasy writer), at Lilliana's request, cuts the baby out to save it, thereby also killing the mother. Although this isn't graphically shown, we do see blood pouring down the snow, which is another reference to the Grimm text, and this leads to the titles.<br><br>That kind of horror material occurs throughout the film. Make no mistake, this is not your typical family fare. We have hints of incest, cannibalism, rape, shrines to dead babies that later come back to life, and so on. Horror fans who also love more straightforward fantasy, such as myself, will love it, and in a way, it is much more consistent with the tone of the typical Brothers Grimm story (although the script is as far removed from this particular tale as Disney's is). Anyone with a more \"sensitive\" constitution should probably avoid the film, or at least make sure that they don't begin watching with preconceptions of a live action version of Disney's film.<br><br>Despite its flaws, this is a gem of a horror film--horror is \"dark fantasy\" after all--and deserves to be more well known.","user":"BrandtSponseller","rank":[50,59]},{"title":"Superb adaptation of soapy tale","rating":8,"date":"7 May 1999","review":"Although I liked Disney's version of the Snow White tale (and still keep it as the classic example of fairy-tale screen- handling), still I was positively struck with this adaptation.  Now here's the version no-one would have dreamed of ever seeing. The all-innocent victimised princess has been turned into a proud little brat who despises her step-mother from the very first time she sees her; the mean, scheming, mirror-gazing step-mother was changed into a lady doing her best to be accepted by her husband's intolerant daughter - only after miscarrying her son does she turn into the stereotype of evil; the adorable seven little dwarfs were metamorphosized into seven miners, some of whom really hate the girl.  Best of all the Prince charming has been erased and the silly \"Mirror mirror on the wall, who's the fairest of them all?\" likewise. Anyway the film is a masterpiece from beginning to end - the highlights being the spells cast by the maddened step-mother.  Being a gothic horror movie, it still has some spurts of really dark humour, such as Claudia saying, \"Mmmm...  Delicious!\" when eating the supposedly cooked Lilly; and \"I have brought someone to keep you company\" (to the crucifix). The on-location shooting is very adequate and the superb performances from everyone make this a movie worth watching and appreciating.","user":"Johnny B","rank":[47,57]}]