[{"title":"The Most Underrated Film of the '90s","rating":10,"date":"4 April 2006","review":"The reviews for \"The Devil's Advocate\" were not too kind, to say the least. But what did the critics refuse to see in this? With movies nowadays being nothing but flashy, over-the-top, masturbatory, CG-fests, \"The Devil's Advocate\" holds up like osmium.<br><br>The cinematography is good because it's quite understated and that's a virtue in today's cinema. The acting, while containing pretty lame Southern accents, is still pretty good. Even from Keanu, dude.<br><br>Sorely forgotten in it's day, the script tells a very deep, original and interesting story, with lots of development, respect for the characters, delicate pacing, and a head-spinning ending. The movie is solely about the people and their struggles. Fear takes hold of the audience through the dialogue.<br><br>Think of \"The Devil's Advocate\" as Woody Allen trying his hand at a horror/thriller and succeeding. This movie never makes you jump, but it puts you in a general state of discomfort through it's atmosphere. As with all memorable supernatural dramas, this one handles its spectacle with discretion and grace.<br><br>Isn't that what we hope to see when we watch any movie? 10/10","user":"boognish-6","rank":[237,275]},{"title":"All Quality Elements of a Magnificent Movie!!!","rating":9,"date":"2 July 2006","review":"I watched this movie on DVD. It will be enough for me to mention that there had been no other movie where I'd had to pause the play in mere awe at the magnificence of the storyline! At a point, It was as if I could see my jaw on the floor praising in thorough amusement the brilliance, relevance-to-our-daily-lives, deepness of message, sophistication, great portrayal, top-of-the-class creativity, marvelous acting/directing/screen writing all having come together in a movie, which called for a rating of 9 out of 10 and no less, certainly, undoubtedly.<br><br>Al-Pacino's acting is to no surprise as brilliant as ever, exuding confidence, proficiency and clarity as always. Keanu Reaves leaves a great master-play in his work, meeting up to the acting skills required in displaying a character of wisdom, success, love and perhaps, of vanity. Charize Theron too puts up a play of passion in its right.<br><br>But what amused me more than all were the great and fantastic script-lines thrown around. All very meaningful and interesting indeed. The whole movie got me stunned and fixed at the edge of my desk seat, but the favorite part for me has to come at the end, where the theme of the movie comes to words and finds a chance as of clarifying itself in one the most brilliant ways I as one have ever seen possible! Recommended for everybody willing to enjoin on a meaningful story and a blend of excellent plays... surely a 9/10.","user":"EdwardsMovieKit","rank":[147,172]},{"title":"this is how you make a thriller","rating":12,"date":"12 April 2002","review":"Stylish, sexy, suspenseful thriller stars Reeves as an accomplished southern lawyer who's never been beaten; he travels to New York City to take a job with powerful legal mogul Pacino, but his once ideal life is soon turned upside down as he's plunged into a surreal, demonic world of lust, temptation, and vanity. Slick writing, direction, and an array of startling scenes, breathtaking effects, and dazzling performances make this an imaginative thriller quite unlike any other. Reeves gives one of his finest performances to date, aided immeasurably by a wild, wickedly over-the-top performance from Pacino and a first-rate supporting cast. Not for all tastes, but highly watchable indeed. ***½","user":"Special-K88","rank":[173,206]}]