[{"title":"Bad Reviews Indicate Really Frighting Concepts and not Bad Movie","rating":8,"date":"29 July 2014","review":"I was actually really surprised at the ratings of the film, so I looked at many of the reviews before putting mine down. Maybe I was missing some pretty horrible aspects to the movie. So I watched the movie again and I read the reviews. I think one of the interesting things was that people rated this movie really low because they didn't like the concept of an evil child or they added, there was no WHY concept to the reasons why the character did the things he did. <br><br>I think I was mostly surprised at the \"Why\" concept. Did people really not understand that this kid felt really powerful controlling the fate of others? It was quite clear that the mean kid did not like being undermined. It was in my opinion very well introduced. At first, his enjoyment in his actions were very minor due to his first time. It seemed to me that the first time he performed his bad deeds to his brother, he might have actually been scarred or stunned. Because for a while when little Frodo enters the scene, nothing has actually happened to indicate he is a terrible child. Its not until his mother treats Frodo like her own child that Macually starts to use his will to force things the way he wants. I see similarities with how kids these days press their parents into getting what they want. <br><br>I think its important to recognize the scene where little Frodo goes to the therapist and asks her about why someone could be bad for no reason, just because he likes to be bad. I think this is where people kind of go, \"yeah, this movie is flawed, there's no such thing.\" But remember, little Frodo wasn't looking down the staircase at his mother hugging another son. Its all about perspective. It can be concluded that the bad son is probably the spoiled child, and acts up in extreme ways to get what he wants because it worked before. We have two polar characters. One character is completely helpless and his fate is controlled by the other characters in this movie, where there is Culkin, whom has deep control of his life and his wants. <br><br>On another note, kids doing horrible things to animals or killing other kids is not a unheard of concept. In fact, there is evidence to suggest that there are certain mentalities that cannot be explained but diagnosed with mental disorders. People in our age have been brainwashed into thinking that kids are completely innocent in the world. Which is funny when you reflect how many times in your younger life you have laughed at someone and probably made them feel really bad, even though you didn't want to. As kids we actually hurt others more than we'd like to admit, we just choose not to admit it.","user":"cubsckc","rank":[47,51]},{"title":"Dark insight into sociopathic children","rating":6,"date":"27 March 2006","review":"I think part of the reason why 'The Good Son' is barely remembered is because it deals with a side to humanity that no-one really wants to accept in that not all children are sweet little innocents, pure as the driven snow. It's not very comfortable watching a film that shows sociopaths-- people born without the ability to feel guilt and empathise with others-- are born, not made and their dangerous traits are apparent even in childhood. 'The Good Son' revolves around Mark, a motherless boy of twelve who is sent to stay with his Uncle Wallace, Aunt Susan and two cousins, twelve-year-old Henry and six-year-old Connie. At first, Mark revels in the visit that takes his mind off his recent bereavement but he soon starts to realise that Henry is a sociopath whose parents are blind to his dark, violent side. It is a film that pulls no punches in just how malevolent Henry is and how easily he will pick off anyone who dares to interfere with his twisted sense of fun.<br><br>Macaulay Culkin was excellent as the angelic-looking Henry whose boyish cuteness hide his true nature and his performance here proves he could have been one of the few child actors who graduated into a successful young adult actor had his personal life not been such a mess. It really was chilling seeing the child I was so used to seeing in comedies being so emotionally cold. But it is Elijah Wood's Mark who gives the film heart. Young Wood, only eleven years old when he filmed this, delivered a great performance as a young boy faced with the awful truth and desperate to stop Henry while juggling his grief over losing his mother. The scene where Mark is convinced Henry has poisoned the food is a perfect example of how Wood portrayed Mark's desperation, hysteria and helplessness in the face of his cousin's evil.<br><br>However, one of the flaws of the film is that is a bit choppy, jumping from scene-to-scene without giving you a feel for the other characters, which is a shame because this is one film where you do need to have an understanding of just how Henry's nature affects all those around him and how he gets away with it all. I read the novelisation of the film by Todd Strasser before seeing the film so it's all the more noticeable for me. The book not only gives greater insight into Mark's budding fraternal friendship with Connie and his need to seek a mother in Susan but it also shows Susan's growing awareness to the monster Henry is and how she feels when she is made to choose between Mark and her murderous child.<br><br>Overall, this film is enjoyable enough for a psychological thriller (although a few TV detective shows have done this idea in a slicker way) and it is nice to see a film that doesn't take a softly-softly attitude when dealing with the matter of children who kill. However, the ending was a bit of a cop-out as there could have been so many other avenues to explore had things ended differently for Henry (what should be done with sociopathic children? How do decent, loving families deal with such a child?). Those who do expect a bit more from their films will probably be disappointed.","user":"cosmic_quest","rank":[32,40]},{"title":"A REAL CLIFF HANGER OF A FLICK !!","rating":10,"date":"22 April 2004","review":"This film kept my eyes glued to the screen from beginning to end.   Macaulay Culkin,(Henry Evans),\"Party Monsters\",'03, gave one of his best performances and really showed his great talents which made you hate him through out the entire picture. Henry had to share his home with a young boy who had recently lost his mother and was in deep depression, he was the son of David Morse,(Jack),\"Hack\",TV Series, 02, who had to leave him with his brothers family.  All hell breaks loose after the two young boys get to know each other.  If you viewed the film the \"Bad Seed\", you will have some idea what the story is about.   It is a real nail biting film and makes you crazy trying to figure out just how the story will END!   If you love Macaulay Culkin, this is his best FILM !","user":"whpratt1","rank":[46,64]}]