[{"title":"Frustrating film","rating":22,"date":"22 May 2001","review":"You can't help but like Crowe's gleeful portrayal of a schizophrenic nano-bot serial killer in this ridiculous film, and with futuristic fascists, pervey programmers and a bucket loads of virtual reality cyber nonsense, this should really be a winner in the style of The Demolition Man or the Robocop series. But where other films in the genre have used such tools as wit and plot to keep the more intelligent of the viewers amused, this film, um, hasn't.<br><br>The script is terrible. The acting (excluding Crowe, who only gets away with it thanks to a camp smile and some fortunate direction) is wooden. And the plot is illogical and frustrating.","user":"james_cunnington","rank":[35,46]},{"title":"Worth a second look","rating":22,"date":"22 August 2003","review":"In the near future, Parker Barnes (Denzel Washington) is an ex-cop who has been sent to prison for murder.  The circumstances surrounding his crime are disheartening and elicit empathy.  Now, he is offered a chance at freedom from prison.  Parker must hunt down and destroy a murderous cyborg, SID 6.7 (Russell Crowe), who is menacing the general public after jumping out of a virtual reality program.  The chase takes on many twists and turns as SID terrorizes, shoots and kidnaps victims in his path.  Can SID be stopped?<br><br>It may not be a science fiction masterpiece, but this film is worthwhile and intriguing.  A second viewing may be required to truly understand and appreciate its complex plot.  Then, too, the marvelous special effects enhance the look and feel of the film.  It is not Denzel Washington's finest hour (he is adequate); however, Russell Crowe is positively gleeful in his portrayal of the ultimately designed killing machine.  There are some humorous moments, somewhat lessening the overall dark and somber tone. On the down side, the ending may be a little too pat and leave a few loose ends untied.  Recommended for science fiction and action movie fans who are on the lookout for lesser known films that may satisfy them for an evening.","user":"inkblot11","rank":[30,43]},{"title":"It Had A Lot of Potential","rating":6,"date":"24 April 2008","review":"Virtuosity is by no means a great movie or a good movie. It is barely above average. That though is because of Russell Crowe's character: SID 6.7 who possesses over 150 serial killer personalities. He is just supposed to be used to train police but he escapes from his virtual reality to the reality. That sounds pretty interesting and this premise could be taken into many different directions especially since he is such a complex character you could go so many different way going about to make this film. Though this movie did not take the worst direction it did not take the best one. This movie went for pure action and no real drama or meaningful message. Now that is OK but it lacked in doing this because of the: The directing which was average by Brett Leonard. He made this into a very exciting TV movie which it is not. He had two very talented actors in Denzel Washington and Russell Crowe yet he was not able to generate the excitement and fast pace feeling that is needed to make a good action movie.<br><br>The writing is also at fault too. The writing was not great here. It seemed to have a lot of overused themes such as the cop trying to retain the high status that he used too have and also the idiot cops getting in the way. That is also OK but the dialog made this interesting idea into a movie that was not so unfamiliar. Not much originality in here despite having such a unique character. That is always the script's fault whenever this happens. The writing and directing just made this movie so frustrating to watch.<br><br>You cannot blame the acting. You could see that Denzel Washington, already an established actor at that time, and Russell Crowe, not established, really tried to push this movie forward. Yet there was little to work with which made them look really average.<br><br>This movie could have been much better if it was made more into a action/drama about the our inner battles. Considering that SID 6.7 had 150 personalities the storyline of his character could have made him have a battle within himself. Now this was done to a minor level which really annoyed me. They are many other ideas or methods that could have really made this movie something but of course this did not happen. It went for cheap effects, an over used clichéd storyline with a little bit of a twist. That may work for some people but not for me.<br><br>I'am giving this movie a 6/10 rating because it had so much potential.","user":"alexkolokotronis","rank":[33,49]}]