[{"title":"A Surprise: 'Dr. Giggles\" Is A Funny Guy","rating":8,"date":"3 January 2007","review":"This was a surprisingly entertaining B-type film with a lot of good lines by \"Dr. Giggles\" (Larry Drake). \"Dr. Giggles\" is a mad doctor who has this high-pitched giggle when he kills people, which is frequently.<br><br>It sounds hokey, and it is, but it's done with great tongue-in-cheek humor. Actually, that's what I think this is: a takeoff on grisly horror movies. Drake's Ines, mostly doctor clinches, are very funny and his face is strange enough so that he fits the part. The rest of the cast is Hollywood-typical teens. <br><br>This movie is well photographed, too and with nice color sand some good camera angles. Nothing outstanding but definitely a \"sleeper,\" something much better than anticipated.","user":"ccthemovieman-1","rank":[28,29]},{"title":"Amusing.","rating":8,"date":"22 October 2001","review":"Dr Evan Rendell or Dr Giggles from the title wonderfully played by Larry Drake is,along with officer Joe Vickers(Bobby Ray Shafer)from \"Psycho Cop\" series,one of the funniest psycho killers ever created on film.\"Dr Giggles\" is an enjoyable slasher film filled with gore and black humour.The film is well-directed and acted and is simply fun to watch.It's quite suspenseful at times,and some of the killings are rather unpleasant(like when he castrates one guy)and grotesque.Recommended for horror fans.","user":"HumanoidOfFlesh","rank":[15,17]},{"title":"Very dated, but entertaining and creepy","rating":28,"date":"28 September 2003","review":"I rented this movie one night from the B-list video store in town, more or less for lack of anything else to do. I expected it to be really lame, and boring, but was pleasantly surprised to find that it was actually quite good.<br><br>A mental patient who believes that he is a doctor escapes the psych- ward, and returns to wreak murderous havoc on the town that he escaped from as a child after the \"townsfolk\" stoned his demented physician father to death.<br><br>Typical of the horror genre, there is the young, innocent heroine, who saves the day, and her not-so-innocent friends who aren't so lucky.<br><br>What sets this film apart is that it is original and creative, considering it came out before the Scream flicks. There are some really good, unusual death scenes. Not gory, but unique. It is also very creepy, and it moves fast, and never really drags. Holly Marie Combs is very good in this movie, and you actually care what happens to her character.<br><br>Bottom Line: A fun, humorous, creepy film to watch.","user":"Nympho3278","rank":[7,7]}]