[{"title":"The most underrated basketball movie ever","rating":28,"date":"28 August 2004","review":"This movie deserves more credit then critics should give. This movie had an all star cast as the up and coming Marlon Wayans,Tupac Shakur,Leon,Duane Martin,Henry Simmons,Bernie Mac,and the lovely Tonya Pinkins. Each actor played their part magnificiently and it was hip,touching,and realistic. The beginning was a little off when Leon dreamed of his best friend's death and then focused mainly on Duane Martin's basketball skills,and him trying to get into Georgetown University. Marlon Wayans was the comic relief in the film who's been released from prison. Bernie Mac was the homeless man who was interested in basketball but never made it. Tupac was the ruthless street hustler and the coach of a dirty playing basketball team. There were other former R&amp;B stars who starred in the movie but only had small parts. To wrap it up in a nutshell Above the rim to me is one of the most memorable urban basketball movies I've ever saw.","user":"IrockGswift","rank":[26,29]},{"title":"A Hip-Hop Classic","rating":15,"date":"15 April 2003","review":"Can you believe that this movie was made over 10 years ago? It is very hard to believe but this movie has stood the test of time and it is highly regarded as one of the greatest basketball/hip-hop movies ever made. Here you have a star studded cast which features Duane Martin, Tonya Pinkins,Marlon Wayans,Bernie Mac,Leon and the late great rapper/actor Tupac Shakur(2Pac). Here you can see why Tupac was highly respected not only as a celebrated gangsta rapper,but also a great actor with an impaccable skill and broad range and here in this movie you see why. A film that is not to be missed. Rating:***** five stars.","user":"raysond","rank":[18,21]},{"title":"Tupac's greatest performance","rating":16,"date":"16 March 2002","review":"This movie has a real street feel to it,and it shows the meaning of true friends and how difficult some kids have growing up in world with drugs and crime. One of my favorit movies in this genre,and this movie also contains some real cool basketball scenes.","user":"martymaster","rank":[13,16]}]