[{"title":"A classy piece of work","rating":8,"date":"9 January 2004","review":"Forget all the explosions, car chases, crazy villains, special effects... The Thomas Crown Affair is not an action movie. It´s not even a thriller. Instead, it´s a well-done cat-and-mouse movie that´s smart, entertaining and very sexy. If you had to use one word to describe the film it would have to be sophisticated. The movie might appeal more to mature audiences as both the leading man and the leading lady are over 40 years old. Pierce Brosnan can obviously do other roles beside James Bond, but the role of Thomas Crown is at least somewhat similar to 007. Both guys \"enjoy women\" and are very suave. Overall, Brosnan gives a solid performance and is overshadowed only by Rene Russo who simply oozes sexuality and class. She is simply perfect in her role and though she´s twice as old as I am I find her a real knockout. Not only is she extremely hot, but also a very talented and charismatic actress. A perfect combination! The classy dance scene between Brosnan and Russo belongs to the most sexually-charged scenes in history and the following love-making scene manages to be both sexy and stylish. Usually nude scenes in Hollywood movies seem somehow \"uneasy\", but in this movie the scene is done in real style and with sensual music the atmosphere is sizzling. Who would want a disposable bimbo like Britney Spears when you could have a real class-act woman like Rene Russo? I would also like to mention Bill Conti whose simple yet refined music is simply outstanding. Just listen to the music during the scene in which Crown and Banning go glider flying... You can just close your eyes and listen to this wonderful music. Now I have to find the soundtrack for this film! I guess I should mention that I´ve never seen the original Thomas Crown, but now I don´t even have to bother as its updated version is a true pleasure to watch. I have nothing negative to say about it so just go get this film on DVD and enjoy!","user":"Old Crow-2","rank":[107,134]},{"title":"\"Thomas\" is the \"Crown\" Jewel for your collection... SEE IT!","rating":9,"date":"4 May 2001","review":"This DVD was an impulse buy, pure and simple.  My wife and I like Pierce Brosnan, and I have enjoyed Renee Russo's other works, so what did I have to lose?  Only my mind!  This film was positively one of the most enjoyable, nail-biting, suspenseful romantic capers ever made.  <br><br>A remake of the steamy 1968 Steve McQueen flick updated to the sleek and self-referential 90s, \"Thomas Crown\" features Brosnan as the title character - a bored billionaire businessman in the business of \"acquisitions\".  For a thrill, he heists an extremely valuable Monet from the New York Museum right under the noses of security guards, cops, and about a thousand unsuspecting museum-goers.  Renee Russo is the very sexy, very worldly Catherine Banning, whose insurance company underwrites the painting - and she is determined to get it back at any cost... But the cost just may be her soul as she woos, and then falls under the spell of the enigmatic Crown.  Will Russo discover the location of the Monet?  Will she rat out Thomas Crown? Or is Crown manipulating her affections like Bobby Fisher manipulates the pieces on a chess board?<br><br>What we have here is a high-speed chase film whose vehicle is clever dialog, rich and exotic direction, and more than a little sexual tension!  Brosnan, as Crown, is ever the cool Brit charmer whose every word and action are as calculated as the movements of a Rolex.  Russo smoulders every time she appears on screen.  And when the two of them get together, the chemical reaction is pure dynamite.<br><br>Dennis Leary has a nice bit as a streetwise NYPD detective on the case, who dispenses advice to Russo's Banning, and watches her begin to spiral out of control.  His role here most likely resulted in the deserved attempt at a television series on ABC (\"The Job\").<br><br>The action in the film moves exotically from caper to cover-up and back with dizzying speed... All the while, we are kept guessing about the motivations of the two lead, and find ourselves eagerly anticipating their next move. When the final checkmate comes, we are left totally bewildered, befuddled, and baffled... which is most-likely the director's intention!<br><br>On all levels, \"The Thomas Crown Affair\" will steal the hearts of men and women alike... but for different reasons - Men can enjoy the action and thrill of the chase, and Crown's ability to win over the most beautiful women and his attempt to get away with the ultimate heist... Ladies can marvel at the suave Brosnan and his life of extreme wealth, and all-the-while wonder if he will betray her, or if she will betray him...<br><br>I will not betray you... I ain't saying!","user":"koconnor-1","rank":[91,115]},{"title":"Original reworked right.","rating":23,"date":"23 June 2003","review":"Obligatory comparison to the first film: The first Thomas Crown Affair really wasn't that great with its split screens that would make even Brian De Palma sick. Like other films from that era of history, it's lost some of its shock with time but unlike true classics, Thomas Crown Affair has lost a lot of its charm. Worth a viewing, but not worth worshipping.<br><br>Only vague concepts carry over from film to film, really. The same basic plot curve, same basic events, same basic characters, except everything is retold and reinterpreted from a different point of view. And I much prefer John McTiernan's interpretation despite the more glaring plot holes such as 'Why didn't the security tape reveal who set the briefcase in the gallery to begin with?' Theoretically the culprit could've been caught then and there, but then there'd be no movie. <br><br>The caper's execution is rather spectacular, far more entertaining than the original's, though much less likely to happen. But who cares, really? McTiernan directed this as a film you can't take 100% seriously anyway. This is a fun cat and mouse movie, not a documentary.<br><br>The premise-an art theft-strikes me as more interesting than the original's robbery; besides, how many films have bank robberies? How many films steal art? It's something different.<br><br>The characters and their portrayals are colorful and interesting, walking a thin line of camp but never pushing it too far. This movie isn't about 'Everyman' nor is it meant to. It's about a billionaire who gets his kicks out of high stake gambles and wages-how do you do that without a larger than life portrayal? <br><br>I particularly liked the ending sequence, as goofy, perhaps corny as it is, it's still fun. Especially the music selection, Nina Simone's Sinnerman, a well chosen track. Bill Conti provides the underlying score, which proves quite unique having a slightly bouncy 'piano recital' quality to its first few themes. Very fitting for the museum setting. It's a CD worth purchasing for the sake of variety alone. <br><br>In the end, Thomas Crown Affair works not because of the film's subjects or its characters . . . it works because of -how- it portrays everything. Its tone is fun and relaxing, and it never tries to take itself too seriously. After all, we are at the movies and not a training seminar . ..","user":"jaywolfenstien","rank":[69,92]}]