[{"title":"Underrated sci-fi action flick - Defending an Underrated Sequel","rating":8,"date":"12 April 2017","review":"Why does this film get's so much hate? Why do I keep hearing that Robocop 3 is better than this, that Robocop (2014) remake is better than this. I don't understand that and I never will. I mean is this good as the first film? no of course not, is it worthy sequel? yes it is! This is an entertaining action film yes. It R rated blast it is yes. I do wish that this movie would come out over the summer I do really miss this kind of action films. Robocop 3 and Robocop remake are not and will never be better than this sequel. I grew up watching this movie it defines my childhood. This was really my first film of the trilogy before I even watched the original. I was entertained in here we have RoboCop VS RoboCain monstrous robot who is addicted to drugs, has mass a machine guns annihilation people blowing up cop cars, killing cops, van's, ambulances. Killing news people, this big battle between Robocop and RoboCain fantastic.<br><br>RoboCop 2 (1990) is rated R! RRRRRRRRRRRRRRRRRRRRRRRRRRRRR not PG-13 It Is violent, action gore adrenaline sci-fi flick not for kids. I am defending my favorite sequel that has Peter Weller and Nancy Allen in it! I don't wan't to see Robert John Burke or even Joel Kinnaman who suck dicks in the whole movies! I love this movie to death the end is the best at all. In this movie RoboCop jumps on a back of a monsters addicted robot, rips his brain out, smashes in to the ground to the pulp. <br><br>Plot: RoboCop 2 is the 1990 sequel to RoboCop. Peter Weller returns as the cybernetic law enforcement officer, who now battles an even more sadistic gang led by a deranged killer known as Cain (Tom Noonan), while mega-corporation Omni Consumer Products prepares to take private ownership of Detroit and unveil a new, more powerful law enforcement unit. <br><br>This is a prototypical \"good\" action movie -- intense, perfectly executed, original action, shown to the tune of a forgettable and occasionally insulting story.<br><br>I am giving an 8/10 -- an outstanding score. And the gunplay is delivered in perfect Miller style (as opposed to the slo-mo John Woo-style) -- you'll see lots of heavy automatic and explosive weapons, and you'll see them used well. The film is bloody you can see how the gang cut's Robocop to pieces and it is bloody. There was a kid Hob in the film and no he wasn't annoying, he did a good job playing the bad guy. Not annoying kid and I think he did a good job. Robocop shot a guy in the eye. <br><br>Nancy Allen as Lewis has much to do like she drives an armored SWAT van the one they used in Die Hard and smashes in to RoboCain, she shots three bad guys, she kicks ass. RoboCop saves a baby.<br><br>I don't mind the music score everyone complains about Leonard Rosenman and his music score. I know they should use Basil Poledouris music score but they used different music score and I never mind it, I thought it was an okay song. <br><br>The film was directed by Irvin Kershner (The Empire Strikes Back and Never Say Never Again) from a story written by noted graphic novelist Frank Miller. Irvin Kershner did an excellent job directing this sequel I know that Paul Verhoeven suppose to direct this movie but he never direct sequels before and he wasn't sure if he should do it, Hollywood needed a sequel so Irvin Kershner went to directing it. This is his last movie and it is really a shame he is no longer with us anymore R.I.P. Irvin Kershner.<br><br>They don't make movies like this one today! I wish I would had sci-fi action movies like are this one today!! I really wish! This is a solid damn sequel that has an action scenes while RoboCock (2014) has no action scenes they can't effort it, it is a PG-13 rated family film. I have this movie on Blu-ray screw Robocop 3 and the remake I will watch this movie. I love action movies this is an action movie that's how they do it right! Is Tom Noonan better bad guy than Kurtwood Smith no. But he does an excellent job as the evil bad guy and he is a cult leader.<br><br>I know Peter Weller and Nancy Allen were disappointed with how the movie come out and they don't care for this movie. But honestly it was a pretty damn good entertainment, I wasn't bored with it. I would be proud on this movie. <br><br>Rambo III (1988), Missing in Action (1984), Cobra (1986), Predator 2 (1990), Blade: Trinity (2004), The Matrix Revolutions (2003) are so fun underrated action films that are getting so much hate and bashed this days for it, that is horrible. I still love them all. <br><br>RoboCop 2 is a 1990 American cyberpunk action film directed by Irvin Kershner. Set in the near future in a dystopian metropolitan Detroit, Michigan, it is the sequel to the 1987 film, RoboCop.<br><br>It's a good continuation of RoboCop story. There is nothing new here , but it's well executed. In the end it's one of those rare satisfying sequels. They do there own stuff they don't copy the original film just like Predator 2 they do their own stuff and i love that. Sue me I love RoboCop 2! I give it 8/10 it doesn't deserve the hate!","user":"ivo-cobra8","rank":[104,113]},{"title":"Much better than I remembered.","rating":10,"date":"25 January 2018","review":"Irvin Kershner, who also directed probably the best Star Wars film \"The Empire Strikes Back\", does homage to Verhoeven's directorial style in this first sequel. Apparently Frank Miller wrote the original script, but Kershner didn't use much of it, but Miller hung around anyway.<br><br>We see many of the original actors return, especially in the OCP offices. The Newsbreak anchors. Also, many new faces. Who cast this? It is a veritable assembly of character actors who had been in \"Star Trek: The Next Generation\". The Kid from the opening Robo Drug Bust scene, \"Hob\" (Gabriel Damon) who taunts Robo, played opposite Michael Dorn in \"The Bonding\". Mark Rolston who was also in 'Aliens\", was in \"Eye of the Beholder\" and also one episode of Star Trek Continues. Stephen Lee \"Duffy\" was the target of an Alien Assasin in \"The Vengeance Factor\". Jeff McCarthy was \"Roga Danar\", a supersoldier who Troi befriends. Maybe there are more TNG Alumni. Most likely, these are the actors Central Casting used back in 1990 when this was made, and we can virtually date when a film of series was made simply by the guest stars and extras.<br><br>Tom Noonan, from \"Manhunter\", is \"Cain\", a guy who makes Dope that makes Dope look like a weenie roast, and he's nasty. Noonan always plays great crooks, and he eventually becomes something worse for the final act of this film. <br><br>But what boggles me is that as sequels go, this isn't that bad, although not quite as good as the original. From the start is has some of the same elements that made RoboCop great. But you never know what's going to be a hit or not. This film has much of the look and feel of RoboCop, but for some reason it didn't go over. Of course there are plenty of problems and weak spots, but it is interesting to watch this in relation to the Original RoboCop and the reboot RoboCop from 2014.<br><br>Again, most of this was practical effects, but in 1990 some primitive CGI was used here. If you don't get caught up in the problems with this film, it does become part of the 3-film Robo story, concluded in Robo 3 with a different actor than Weller.","user":"XweAponX","rank":[8,8]},{"title":"And now...a word on nutrition","rating":10,"date":"10 February 1999","review":"RoboCop 2 is probably the most under-rated and most harshly criticized sequel in history (tying with Predator 2, which came out the same year). Because of a few missing elements from the first and a slightly more cartoonish approach to the violence, the critics and public alike were not pleased and opinions and feelings toward the franchise nosedived with the just plain awful RoboCop 3.<br><br>Don't con yourself out of a good movie though. RoboCop 2 still has the same savage sense of humor, cynical social commentary and character pathos of the first film. It's a hyper-realistic vision of an America populated by gun-loving psychos, a democracy owned by big business and the poverty-stricken addicted to drugs dealt to them by peddlers believing themselves to be the second coming of Christ.<br><br>Far-fetched could be the typical way of describing it. Completely-over-the-top would be more appropriate. Empire Strikes Back director Irvin Kershner chucks in as much sadistic violence, deafening gunfire, endless destruction and loss of human life that the film just begs you not to take it so seriously.<br><br>Some of the blame was placed on writer Frank Miller for the film being more cartoonish than the original. I don't think this is very fair. I read Miller's original script when I was in high school and it is rather different and, dare I say, unfilmable. RoboCop 2 himself was not Nuke Lord Caine, the psychotic hippie with delusions of Godhood. He was called Kong, a psychotic cop who pretty much killed everybody he came across. Sgt. Reed and the Old Man died too, and there wasn't much humor. Screenwriter Walon Green was hired to doctor the script and much of what appears on screen is actually his work. Frank Miller's original ideas are pretty much just left as the framework for the whole movie and some of his story was recycled into RoboCop 3 (don't blame him for that one either). Miller was obviously upset with this but was still a good enough sport to appear in the film (keep a lookout for him playing Doctor Frank), though he vowed not to work in Hollywood again for fear of being taken advantage of. Until Robert Rodriguez promised to make good on his Sin City graphic novels.<br><br>Verhoven may be gone but Irvin Kershner tries hard to deliver the same mix of mirth and magic and actually does get it right. Basil Poledouris' brooding score is also gone (it returns in RoboCop 3) but new composer Leonard Rosenman creates a wonderfully heroic and upbeat theme that suits the film more than Poledouris' moody, tormented score to the first.<br><br>There have also been many complaints that the humanity of RoboCop and his relationship with Lewis was neutered along with too many other ideas fighting for screen time. I get why most would be annoyed by this but you have to remember that films need to be economic when it comes to length. If every single idea was fully explored and fleshed-out RoboCop 2 would have been 4 hours long. In my opinion each thread has just enough for keen viewers and fans to appreciate. Lazy viewers only see what they want to see and I feel that this has led to many of the negative reviews the film has been met with (which usually comment on how \"offensive\" the character of Hob is-sheesh, gimme a break). And don't give me that the \"humanity\" of the first film is gone. Murphy has not resigned to being a machine. He lies to pacify OCP. Pay attention to the very last line of dialogue in the film if you want proof.<br><br>Filmed once again in Texas, Houston this time, you really have to feel for Peter Weller walking around in that Robosuit. It must have weighed a ton and he'd be sweating bucketloads inside. There is a particular scene in the film where Murphy is tortured into near-death/destruction that is very hard to watch. But it does lead to him getting a brand-new makeover and those crazy new directives put into his head. The bit where he lectures the Little League kids and scolds the youngsters playing by the leaky fire hydrant (after quoting some very suspicious philosophy) is hilarious.<br><br>RoboCop 2 is a great movie. Despite harsh critisisms of the script and story and some slightly dated stop-motion effects it's a brilliant sequel that lives up to expectations. Do listen to the nay-sayers. I don't know what kind of film they were expecting.<br><br>And thank you for not smoking!","user":"CuriosityKilledShawn","rank":[108,150]}]