[{"title":"What is peoples problem?","rating":8,"date":"8 April 2015","review":"I honestly don't see why people are so upset whit this movie. Yes, there is talking dinosaurs, but how are you supposed to understand them otherwise. Mute dinosaurs walking around wouldn't be interesting at all and remember, this is a kid's movie. And yes, the animation might not be as good as in Jurassic Park, but this is a fully animated movie, JP used a mix of animatronics and CGI inside an otherwise live action movie, and in a interview I saw, Spielberg (or if it was a special effects guy, I don't remember) said that they would use the animatronics when ever possible and only cover up rigs and refine movement with the computer 'cause the CGI models looked like crap in comparison the robots. And yes, the story has been used before, but so has the story in most films we're watching today, only in varying degree and in different mixes and it's not like Disney is known for their originality story wise. As good as everyone of their Classics are based or inspired by other works.<br><br>Personally I love this movie. The CGI is still good, and at times more realistic than many rushed animations we see today, the characters are fun to follow, unlike Land before Time were they were unbearable and made me hate the movie (even as a kid the first one was never my favorite) despite a similar story to Dinosaurs', which I by the way like, and the moral of it is a really good one.","user":"felix-bergman","rank":[21,22]},{"title":"A Dinosaur Classic","rating":23,"date":"23 July 2008","review":"I am quite surprised at so many negative comments people have made. It's just a movie and one that is sheer entertainment. People seem to have a problem with the way violence is portrayed but I liked how the directors portrayed the brutally and the honest way death was portrayed. Thankfully, it's not excessively sugar-coated and there are some very sad scenes but it beautifully ends on the note of hope. I liked the way Leighton and Zondag told Enriquez's written story but I thought that some of the situations weren't developed. For example, how does Aladar adjust to the lifestyle of the dinosaurs considering that he was raised by lemurs. Most likely it may have been due to time constraint but nonetheless the current adventurous story of migration and survival is engaging and moving. Aladar's selfless attempts to save the dinosaur's are touching to watch as it reflects how the kind-hearted Plio raised him. The characters are enjoyable and the voice cast, that includes talents like Alfre Woodard, Joan Plowright and Ossie Davis do a fine job. D.B. Sweeney too does a very good job voicing Aladar. The animation is very detailed, giving the characters and setting a very authentic look. Even though the slight stop motion takes away from the realism, this is only a minor quibble. Newton Howard's score flows well with the story. 'Dinosaur' is sheer beauty and a pleasure to look at. It's a dinosaur classic and it's become one of my favourite dinosaur films.","user":"Chrysanthepop","rank":[48,54]},{"title":"Beautiful!","rating":8,"date":"7 October 2005","review":"This movie was shear pleasure to watch. The movie looks visually absolutely stunning and the animation is done nicely. It's true eye-candy and entertaining as well.<br><br>The movie has a typical adventurous story and feeling and is at times spectacular as well. Especially the beginning is impressively spectacular. There are some nicely done action sequences that are at times tense as well. My only true complaint of the movie are the characters. There isn't really any character development in the movie and we never really get to know the character or care much about them, this is probably mainly due to the short running time of the movie. Also of course the story itself is somewhat predictable but that doesn't take away any of the fun or entertainment value of the movie.<br><br>Dinosaur fans will enjoy this movie as well, unless you're one of those persons who complains about the accuracy of the movie. This movie is entertainment, not a documentary.<br><br>The musical score by James Newton Howard fits the movie like a glove and in my opinion he delivers one of his best and moving scores, in his career.<br><br>There is much hate for this movie but quite frankly I can't see why. If you simply take the movie for what it is, you'll have a good time watching it. It's beautiful, adventurous and at times truly spectacular.<br><br>8/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[53,63]}]