[{"title":"An excellent family entertainment achievement, with the keyword family, not just kids.","rating":9,"date":"17 August 2002","review":"The smash hit 1995 film Jumanji- based on the children's book- is a great family film. The plot of the story involves a young boy named Alan Parrish who in the 1960's finds a supernatural board game, that was buried underground in the 1800's. Alan is instantly drawn into playing the game, and Sarah-a girl who lives close to him- also joins in the game. After the powers of the game transport young Alan into the jungles of the board game, no one believes Sarah's story of what happened, and everyone suspects foul play. <br><br>Now in 1995, a girl named Judy (Kirsten Dunst) and her younger brother Peter have been drawn into the game after finding it in the attic of the old Parrish house. When they play however, Alan (Robin Williams) is released from the jungle accidentally when one of the kids rolls a certain number on the dice. Now, with the powers and creatures of Jumanji released, they must finish the game. But to do so, they must find Sarah (Bonnie Hunt), because now it is her turn to roll the dice. After finding her, they must hurry before the town they live in is destroyed and before they all die!<br><br>Jumanji is great family film, packed with - at the time - great graphics (that now look like a computer game). While some hate this film for being too terrifying for young children, people have forgotten what the rating PG means-PARENTAL GUIDANCE-NOT all ages. So with this in mind guidance is suggested for scary scenes, but I think any child over 3 can enjoy this film. It has no gore or attacks really. Sure, there're some mildly scary scenes, but look at Harry Potter  I think more kids I heard of thought that was scary than Jumanji. Another great thing about Jumanji, is that like Shrek and such films, adults can enjoy it as well. It's not one of those films where you have to suffer through, like many movies coming out today. I think movies like Jumanji are the best of their kind. <br><br>The acting was great, and Robin Williams is perfect for the role of Alan Parrish, and Bonnie Hunt and him had good chemistry. Kirsten Dunst in this film was further shaping her acting career, to appear in such films now like 'Spider-Man' and the teen movie 'Bring It On.' I honestly forget the name of the kid who plays Judy's brother Peter, but he was okay. I don't think he was great though. Okay, but not great. I doubt as he gets older he'll get a film career much past his teen years. <br><br>So if you want some good, family fun seeing a movie, rent Jumanji. And remember, PG = Parental Guidance, not All Ages, so do use discretion is your kids don't like mild terror, but I doubt you'll have to, especially on video (I'll admit the theater added some more terror). It's not as terrifying as Ebert stated in his review. With all the movies he's seen, I think he's way off mark. He compared Jumanji to being as suitable as Jaws was for children, but big news Ebert, Jaws WAS rated PG. Anyway, I hate when people think of Jumanji as a 'should be PG-13' because it's not. It's great family fun with loads of laughs, jungle animals and creatures, and just plain hilariousness! 4/5 stars. I loved Jumanji, and I DEFINITELY recommend it to families.","user":"MovieAddict2016","rank":[66,71]},{"title":"Jumanji a great classic movie of the mid 1990's","rating":7,"date":"6 April 2013","review":"I have not seen this movie in more then a decade perhaps even more so it was pretty new to me again. Sure I remembered a few things here and there but I didn't remember the amount of CGI for a movie made in 1995 or how well the story was.<br><br>The CGI is of course very dated compared to now but for its time this movie was amazing! The story for a movie that revolves around a board game is a very interesting concept and very well told. The acting by a young Kirsten Dunst and comedic Robin Williams and the rest of the cast is very well done.<br><br>This is a great movie and if you have children between the ages of 7 to 13 I would bet they'd like it too.","user":"picturetaker","rank":[16,16]},{"title":"Maybe The Best Ever For Just Pure Entertainment","rating":10,"date":"17 February 2006","review":"Among the thousands of films I have viewed, this movie would rank near the top for sheer entertainment. That's not saying it's the best-made or most intelligent or scariest or funniest or features the best effects, etc. etc. But combine all those and you have a film that's tough to beat when you're looking for 100 minutes of escapist fun.<br><br>The film features some wild computer-enhanced special effects that were new to its day, but now about 10 years later, it's no big deal. In fact, some of it, such as the lion, look pretty hokey compared to the stuff that's out there now. To me, it was story that was the lure, anyway, not the special effects.<br><br>Because it's so much fun, this is one of the fastest-moving films I've ever viewed. The time flies by. It's not to be analyzed or given much thought, because it's so ludicrous. You just go along for the wild ride in this fantasy-adventure and get a bunch of laughs and thrills along the way. That's one of the big attractions of this of film: the excellent combination of adventure and comedy.<br><br>Are there annoying things in this movie? Sure. To me, it was Bonnie Hunt's occult beliefs and too many OMGs and the overdone character of the hunter (Jonathan Hyde). Other than that, I loved the film the first I saw it and every time afterward. I've probably viewed this movie as much as any, simply because it was so entertaining.<br><br>Robin Williams, David Alan Grier and the two kids, Kristen Dunst and Bradley Pierce, were all great people to watch and share this adventure with. <br><br>Now THIS is entertainment!","user":"ccthemovieman-1","rank":[165,194]}]