[{"title":"Double Slam-bang-best-action packed martial arts Van Damme film!","rating":10,"date":"30 December 2015","review":"Double Impact (1991) was my favorite childhood Van Damme movie, beside Bloodsport was this movie my favorite. I grew up with this film I love this movie to death! Bolo Yeung was also in this movie as Moon, Zhang's killer. <br><br>The fight at the end between Van Damme and Bolo Yeung was the best just like was in Bloodsport. The story was adrenaline action packed and Van Damme played double role in here and he did an excellent job as Alex and Chad two different characters. I always loved this movie and I love the action and the fight choreographer from Jean-Claude Van Damme, I like his spin kick and his martial arts in this movie. Van Damme fights the same guy from Bloodsport. I love this movie a lot, it is bloody full action packed fire guns.<br><br>What I love in this movie is a great supporting cast, Geoffrey Lewis was a great support cast as Uncle Frank who raised Chad. Alonna Shaw as Danielle Wilde was a great as Alex girlfriend. Their was one imaginary sexy scene that really did not mean anything. Corinna Everson as Kara as Griffith's bodyguard was terrific, here we first time see a women who is a villain in a action movie. In the 90's I don't remember seeing any women been a villain. Corinna was a perfect choice for playing Kara. Philip Chan as Raymond Zhang was awesome he was even in John Woo's Hard Boiled and Bloodsport. The movie it self reflects more on Van Damme's life: Chad was really Van Damme, he was raised in Belgium in this film his character was raised in Paris, but with Frank they moved to America. Now after 25.years they come back to Hong Kong in which they track down Alex, together they avenge their parents death. Alex is a bad ass in this movie. He looks so scary, that even I wouldn't dare to cross his path. I love Van Damme in two roles he is great. I have enjoyed this movie a lot and had a lot of fun.<br><br>The contrast between the two characters of Chad and Alex is amazing. The happy go lucky playboy and the brooding street fighting bad ass. You really do get the feeling that there's two Van Dammes in the world and they're right there on screen together. And Chad is one my favorite JCVD characters he's ever played. I love the action sequences, the gun play, the fights and the story that works. In my opinion this movie is very underrated. It was my childhood favorite movie and it always will be.<br><br>I am giving a 10, because the movie has a good action and nice martial arts, but it also does have a plot hole that I don't like.","user":"ivo-cobra8","rank":[79,89]},{"title":"Great Jean Claude Van Damme Film!","rating":10,"date":"13 March 2004","review":"Every time I view this film, I enjoy the great photography of Honk Kong, the beauty of the country, excitement of the night lights and the forbidden areas of the dark back streets and its perils!    Claude Van Damme (Alex Wagner) gave the audience a double take every time he made a fantastic martial arts endeavor.  His great supporting actor was the veteran actor, Geoffry Lewis, (Frank Avery),\"Mind Games\",'03, whose main goal was  to protect the twin boys who were almost killed as infants and see that they obtained the wealth that belonged to the both of them.  The gals in the picture add some hot steamy scenes, especially in the Boiler Room!   If you are not a Jean Claude Van Damme fan or do not like the great acting of Geoffrey Lewis, this is not the film for you. You will probably like the \"Terminator Films\"!","user":"whpratt1","rank":[54,64]},{"title":"Superb action","rating":31,"date":"31 July 2000","review":"Double Impact is one of Van Damme`s finest moments on the actionfilm-arena. It delivers what it must to succeed, namely tons of great fighting scenes, which is what Van Damme-movies are all about(well, almost).  If you want to rent an old action-flick, Double Impact is one of the best movies Van Damme has ever done! 9/10","user":"action-6","rank":[34,40]}]