[{"title":"The best fighting movie ever made!","rating":10,"date":"26 August 2000","review":"It's an absolute shame that a movie this awesome isn't even available  in print anymore, considering all of the other crap that is being re-released on DVD. It's also a shame that this movie, along with all of its contributors, have never received any notice (with the exception of Billy Blanks). And I'm being serious. Sure this is a b-movie, but how can anyone who's seen it overlook how much fun it is to watch? _The King of the Kickboxers_ is incredibly entertaining, and that's the whole point of any movie, with or without a compelling plot and acting.<br><br>Everything about this movie is awesome. The dialogue is corny and the acting is campy, but how can you complain? This just gives you something to laugh at. Most mainstream viewers will cringe at the poor acting and turn away from this movie, not even realizing that it can be funny.<br><br>Those people will then miss out on the incredible fighting scenes, which are quite frequent. There isn't a single movie out there with moves as cool as the ones here. You'd never expect to see stuff like this anywhere other than in your imagination, but somehow, the fighters managed to throw attacks at lighting speeds and launched multiple kicks in mid-air without landing (not even Michael Jordan gets this much hangtime)! All the scenes are fast-paced and beautifully coordinated, with camera angles that really get you into the action.<br><br>Even the limited music is excellent. It is not only pleasing to listen to, but effectively helps to set the mood of the scenes. It can give you a creepy feeling at times, and is best used in the final fight scene where the drum beat kicks in to get you into the mood of the action and later as it shifts to a triumphant tone, you can't help but cheer for the good guy as he makes his comeback victory.<br><br>And finally, the plot is perfect for this type of film--simple and limited. Most of the movie is dedicated to the action scenes, while plot developments painlessly interrupt to help support the characters so you can develop feelings about them. The whole movie had the feel of a video game. The protagonist battles through his enemies and works his way up to reach who is ultimately the bad guy and defeats him. The bad guy even has his own finishing move (an awesome one at that) that the good guy must look out for. This is all just like a video game; another reason why I love this movie!<br><br>This is by far the best fighting movie ever, and I've seen quite a few of them. And after serious consideration, I've concluded that this is one of the best movies ever made in any genre. Do whatever you can to see this movie. And if you've already seen this movie but hated it, do me and yourself a favor and watch it again, this time with my review in mind.","user":"elianator","rank":[22,28]},{"title":"Shameless rip off but utterly forgivable!","rating":8,"date":"19 February 2010","review":"The makers of this film are certainly no strangers to films that are \"Inspired\" by mainstream others. The company's earlier effort \"No retreat No Surrender\" was meant to be a take on the Karate Kid and this film is no different. Let's just get this out of the way now.......it's a Kickboxer rip off! In fact it goes beyond rip off in places with some parts and locations being nearly identical to the Van Damme film, it really is shameless!<br><br>Fortunately, Seasonal films are no slouches when it comes to fight scenes and here's where you start to forgive them for being such blatant pilferers. The Fights are truly spectacular, choreographed with such precise flow, speed and with such immense power. This film is a direct descendant of No Retreat No Surrender which was the first film to use western actors set in America with an Oriental production team and like it's ancestor it really is quite something. Gone are the traditional, slow movements of the 70's Kung-Fu films which were so akin to Shaw Brothers films at the time and in their place there is rip roaring torrents of brutal martial arts action.<br><br>Billy Blanks as Khan is a great, nay tremendous and utterly terrifying bad guy and it's always great to see the amazingly talented Keith Cooke (who almost steals the show here) but Loren Avedon is as hammy as ever despite his great fighting skill. Of course that's half the charm of these films and that statement is meant fully as a compliment. It certainly has captured the feel of Van Damme's Kickboxer although it doesn't match up to it in terms of polish or drama, but the fights more than make up for it!<br><br>Be like me, buy both and enjoy both!","user":"BrickNash","rank":[7,8]},{"title":"Cheesy kung-fu fun from Hong Kong producer N.G.","rating":2,"date":"2 July 2004","review":"The King of the Kickboxers (1991) was another U.S./Hong Kong co-production from N.G. and the other folks at Seasonal Films.  Like most of N.G.'s productions, the kung-fu films that usual come from Seasonal are cheesy with a heavy dose of high energy fighting.  That's what I like about his films.  He doesn't even try to be serious or make an attempt to elevate the source material.  This film is no exception.<br><br>\nAn arrogant fighter is given an assignment to find out who's making \"real\" kung-fu movies in Thailand (like Mexico where life is cheap).  He's also intrigued by the mission because of what happened to him the last time he visited Bangkok. Whilst in Bangkok he learns about the presence of a vicious Kickboxer (Billy Blanks).  Not only does he get a free trip to Thailand but he can settle an old score.<br><br>\nFilled with many references to Kickboxer and parodies of other Seasonal Films productions.   King of the Kickboxers is a very entertaining film.  The film-makers and the actors seem to be having a whole lot of fun making this one.  So sit back and relax.  When watching this video gem remember \"It's only a movie!\"<br><br>\nHighly recommended!<br><br>A","user":"Captain_Couth","rank":[8,10]}]