[{"title":"a letdown...","rating":25,"date":"25 September 2004","review":"My wife and I found this movie in the bargain bin. The first thing we noticed was that there aren't any likable characters. The maid is the only person with a personality who could act. The father was neutral, but not likable. The security guard was the worst. I was hoping for more historical details too, but it focuses on a boy who is having trouble with bullies. It's the end of the movie and we're saying to ourselves, \"Why did we watch this?\" Yes, it's kid friendly. The Coronado character (played by Cheech) is OK. If you like him, at least that part will be enjoyable. His ghost scenes are fairly well done. As for the movie's lesson...Dad's...pay attention to your kid. I'd give the scenes with Cheech a 7, but the movie itself needed better actors and more humor.","user":"zxrap","rank":[11,17]},{"title":"\" If you must look for Treasure, don't look any farther than your own family \"","rating":6,"date":"2 April 2013","review":"Out of the fruit full mind of noted author Mark Twain comes this comic based story called \" Charlie's Ghost Story. \" It relates the yarn about a Archaeological father who devotes most of his spare time seeking the skeletal remains of one Spanish explorer Fransisco Coronado (Cheech Marin). In doing so, he woe fully neglects his son Charlie (Trenton Knight). The boy could sure use his father's help as he is daily being picked on by bullies at his new school. To substitute for his father, Charlie discovers a friend in the visiting Ghost of the Spanish Conquistador, Fransisco De Coronado. His one request to the boy, is to have his earthly remains be buried in Hallowed ground. This does not sit well with his father who spends his time digging them up. Aside from the bullies at school, Charly get to meet other new friends, like a cute neighbor girl. The film is one you'd expect to see on the Disney channel, but despite the talents of Cheech Marin, the movie is light on entertainment and the hilarity one would expect in a family movie. Still the film is entertaining for the children, but not much else. Recommended for the youngsters. ****","user":"thinker1691","rank":[2,2]},{"title":"Oddball kid's flick","rating":4,"date":"23 September 2018","review":"CHARLIE'S GHOST STORY is an oddball and low budget children's ghost story directed by and starring none other than E.R. actor Anthony Edwards. He plays the father of a young boy suffering the machinations of a bullying gang at his local school. Meanwhile, his father's archaeological work leads him to take some newly-discovered bones to the local museum, raising up a Conquistador spirit in the meantime. Said spirit is played by none other than Cheech Marin on over-the-top form, and he becomes friendly with the bullied kid. Despite the presence of interesting supporting actors (Linda Fiorentino, Daphne Zuniga, J.T. Walsh) this is generally a letdown, feeling very pedestrian and run-of-the-mill.","user":"Leofwine_draca","rank":[0,0]}]