[{"title":"A worthy part of the Tremors saga","rating":6,"date":"16 September 2003","review":"The Tremors movies are not to be taken seriously and Tremors 2 is no different. It's a fun, light-hearted monster movie that you can sit back and enjoy. Fred Ward and Michael Gross return from the first movie.(Kevin Bacon not making a comeback shows a little elitism on his part I think. What, are you above Tremors now Kevin?) Both characters lend a hand in making this a good film. The film takes the Graboids a little farther up the evolutional chain this time, and the effects are still good for the small budget. Bottom Line: If you liked Tremors then you'll like Tremors 2.","user":"chvylvr80","rank":[25,29]},{"title":"For those who couldn't get enough of the original","rating":6,"date":"20 July 2005","review":"The original Tremors, released six years earlier, is a prime example of how monster movies ought to be and it was immensely popular amongst critics as well regular audiences. A sequel was inevitable and it's actually surprising that it still took 6 years before they had it finishedNormally; filmmakers exploit a successful franchise much quicker than this! I think everyone agrees with the statement that this second entry can't possibly live up to the original but, as far as the quality of sequels go, \"Tremors II: Aftershocks\" is a fairly pleasant B-movie that you definitely won't regret seeing. It's obviously meant to please the enormous fan-base of the first movie, since it features the exact same type of humor and similar special effects, but at least it tries to add something new to the story of the giant carnivorous worms. Several years have passed since the big fat \"Graboid\"-hunt in Perfection, Nevada and good old Earl Bassett (the cool and charismatic Fred Ward reprises his role) is asked to come to Mexico because a new plague of worms has already killed (and eaten) the staff of a large petrol field there. Reluctant to risk his life again, Earl eventually decides to come to the rescue, accompanied by his old and trigger-happy friend Burt Gummer (Michael Gross) and a fresh sidekick named Grady. The three learn that Graboids are a superior breed of monsters, since they evolve and rapidly work their way up the food chain. The biggest thing missing in this film is Kevin BaconWell, not so much his persona but the duo he formed with Fred Ward in the original! Christopher Gartin tries hard enough to be a good replacement but it's just not the same. No offense to him, though. There still is some delightful B-movie dialogue going on between Fred Ward and Burt Gummer and the monster effects are more than satisfying. Two more straight-to-video sequels followed and they're really not that bad, neither. You just need to be a massive fan of the original. In case you thought 'Tremors' was only so-so, none of the sequels are meant for your eyes.","user":"Coventry","rank":[26,32]},{"title":"As far as sequels go, not bad","rating":30,"date":"30 December 1999","review":"Tremors 2 is not a bad movie. It simply lacks whatever made the first movie so special. The story is okay but it could of used more work. Having Fred Ward and Michael Gross back helped this movie a lot. I was disappointed to find out this was released direct to video. It has the potential to be a big screen release and could have made more. Overall, Tremors 2: Aftershocks is a okay movie. If you've seen the first movie, you might as well see this one.","user":"Op_Prime","rank":[19,23]}]