[{"title":"Sheer entertainment!","rating":10,"date":"23 June 2001","review":"Corny... YES.... Cheesy... YES...<br><br>Still, this movie is highly entertaining. After renting it one day just for the sheer hell of it, I was dying of laughter!! I bought it the very next day! Paxton's comedic skills shine here, in what is a TRUE black comedy... If you are looking for something out of the ordinary to watch, with the potential to floor you with laughter, this is the movie for you! Low budget and all, it is definite entertainment!<br><br>Enjoy!","user":"CBronson1","rank":[15,16]},{"title":"Two words: Bill Paxton. Two More: Enough Said...","rating":10,"date":"26 November 2002","review":"The Vagrant tells the story of Graham Krackowski (the always magnificent Paxton), who moves into his new home only to be terrorized by an unruly homeless vagrant that lives across the street in an abandon lot. That's it, but that is all this film needs because Paxton, director Chris Wallas, and the rest of the cast turn a simple plot into a memorable laugh-scare fest. And like most film buffs would agree, finding the right mix of horror and comedy is not easy to do, and even when it is done, it's hardly ever done right. Not in this case however...<br><br>A subplot deals with Paxton up for a promotion at his suit-wearing executive job, as well as his girlfriend flying into town for a visit. With just the right amount of time spent on each to add to the story, the focus remains however on Paxton and his unwanted guest.<br><br>What begins as simply an inconvenience to him, escalates into an all out war of head games, wit, and eventually murder, with Paxton losing his girl, his job, and untimately his mind in the process. But what makes the story truly compelling, is that the audience is left in limbo throughout most of the film as to if all the happenings are indeed caused by the vagrant or by Paxton himself?<br><br>Now I'm not one to spoil a good whodunit, so I will leave that rock unturned for those who haven't had the privilege of seeing this little charmer. Because when it is all said and done, the ending has more than a few surprises.<br><br>So don't be left out in the cold like our antagonist, and rent this wacky masterpiece before its too late. And remember, if you ever find a book on the toilet of the house you are looking to purchase, think twice...","user":"jasonc13","rank":[20,23]},{"title":"Interesting movie","rating":6,"date":"25 September 2005","review":"At times, I was wishing that Bruce Campbell played Bill Paxton's part. But I do like a good dose of the Paxton when I can get it, and I definitely got a different kind of role from him in this movie. Not the greatest thing in the world, but it definitely reminded me of something that would make a great short story or novella. Especially with the degrees of paranoia exhibited by Paxton's character. Also, it felt as if the writer didn't know where to take such a simple premise so it kind of goes all over the place for the second half. The movie starts in one area and ends in another. No real direction. But the back story was nice. For a film of this caliber, I wasn't expecting any reasoning.<br><br>It's also good to see Ironside and Bell in something together beyond Total Recall.","user":"Dick_Valpak","rank":[9,10]}]