[{"title":"Can you trust your best friend and how far will you go for them","rating":15,"date":"15 October 1999","review":"Although I go to the movies regularly, I didn't see a trailer for this film, and the few reviews I read beforehand suggested it would appeal mainly to women under 35.  Being neither, I could have been excused for missing this film, which would have been a shame, because I enjoyed it. The acting from Danes, Beckinsdale and Pullman was excellent and a pleasant change from watching films where special effects try to substitute for quality acting. Brokedown Palace is one of the few films I've seen this year where I haven't been able to correctly predict the outcome half way through.<br><br>\nFor me this was more than a repeat of the \"tourist taken advantage of by nasty local/foreign low life\" film.  While it is clearly a cautionary tale of the risks of travelling abroad, it is also very much about trusting your friends and the extent you are willing to make sacrifices for them.<br><br>\nIt is also a reminder that in any country, justice is dispensed by people with power, and the extent that truth features in the dispensing of justice is largely at their discretion.  The film correctly portrays that crying \"I'm an American citizen, I have rights\" rarely sees an immediate release from jail and humble apology from the local police, nor does enlisting the help of the US embassy result in a company of marines landing at night to storm the jail and rescue you.<br><br>Brokedown Palace is one of the few films I have seen this year which I intend to see again.","user":"RichardJ","rank":[63,68]},{"title":"Cold, hard truth","rating":17,"date":"17 August 1999","review":"I'm a little surprised by the negative criticism this film is attracting.<br><br>I'm old enough to be the father of the two main characters; they seemed like accurately drawn teenage girls to me. And I've probably hung out with both of their fathers before. I've been to the Far East. I've stayed in both better and worse places than the girls stayed. I had the pleasure of seeing the inside of a police station after I was robbed. I'm glad I had no more direct exposure to the local judicial system than that; that was more than enough. Everything in this movie seems awfully familiar to me.<br><br>I think \"Brokedown Palace\" represents something pretty close to stark realism. It certainly reminded me of Asia.<br><br>Of course it's true that the attitudes of the girls often don't do much to improve their situation. But they are meant to be an example of what not to do overseas. And the portrayal of some of the Thais did make me uncomfortable. But then many of my own personal travel anecdotes don't paint a complimentary picture either.<br><br>This is a cautionary tale. An unfortunate consequence of too many people having too much money to spend these days is that you will find unescorted, unprepared, \"streetwise\", naive young people popping up in places where they have no business being. And when that happens, you end up with situations mirroring this movie.<br><br>I suspect people choose to denigrate this one because they are too embarrassed to accept how true it is, and how vulnerable they would be if placed in similar circumstances.","user":"Varlaam","rank":[132,148]},{"title":"Worth my cash.","rating":8,"date":"5 June 2004","review":"I saw this film at a store in the cheap section. I actually vividly remembered seeing the commercials and trailer for it years ago. I thought \"What the hey' and bought it, basically because the plot sounded interesting and Claire Danes has always been someone of talent in my eyes (this was also before I became a huge Kate Beckinsale fan).<br><br>So it's about two girls who sneak off to a vacation in Bangkok, get busted for narcotics (which they are innocent of) and then are sent to a Thailand prison. The film follows what will happen to them and at times questions their innocence.<br><br>Both Claire Danes and Kate Beckinsale give great performances, and the plot of this film wraps itself up unconventionally, and raises some nice moral discussion questions.<br><br>I think this is a solid good film, but there could have been some improvements. It could have been longer...it would've helped to solidify these characters and more insight into the politics of Thailand's justice system would've helped.<br><br>Nevertheless, other than that, it's a good film with some great performances.<br><br>P.S. For all you pop-culture junkies be on the lookout for a two-minute role by Paul Walker. I didn't even notice him the first time I saw the film.","user":"TheBabblingFool","rank":[29,32]}]