[{"title":"ok here is my take on what the movie meant - SPOILERS","rating":16,"date":"16 July 2001","review":"SPOILERS ---- What amazes me is how many of you viewers are so quick to condemn this movie because you just don't get it.  Do movies always have to wrap things up into tight little packages for them to be workthwile? Personally, I prefer movies that require you to think a little after it is over to allow you to come up with what you think is the real meaning to all of it.  Under Suspicion is that kind of movie.  It was pretty obvious to me that the movie wasn't as much a murder mystery as much as it was about a man struggling with his own personal demons, in particular, the loss of the love of his life and his obsession with young women.  If you've ever been in a relationship that ends poorly but you still are in love with that person, you might understand.  It is quite obvious to me that Hackman's character is in love with young (very young) beauty.  That is his flaw.  His stumbling during the investigations is a direct result of his attempt to hide that flaw and to reveal very personal things about his life and relationship with his wife.  His obsession about young women is why he had the photographs of them and why he knew one of them.  By telling the truth, he would have to reveal this obsession.  His wife has her own problems, that is the green monster he was talking about - jealousy.  She knows him too well that she fears that as she ages, she will lose him to younger girls.  She allows this obsession of hers to take over her reason and let's it destroy her relationship with her husband.  In the end, Hackman's character is a lost puppy, weak and pathetic, because he is unwilling to let go of a lost love as he still loves her deeply and is in denial of the fact that she won't come back to him.  He is holding on to that shred of hope that she will realize the error of her ways and love him again.  But she can't do that. In the end when he finally realizes that she actually believes in his guilt and helped to find the \"evidence\" against him, he finally realizes and accepts that she will never overcome her jealousy and come back.  So, he has nothing to live for and he confesses, mostly to get back at her I think.  By confessing, he will ruin her too as she will lose all social standing she has, etc.  And I think there is some self-pugilizing too.  I think he may also be trying to punish himself for being such a fool for her and for his obsession with young women.  The interrogation may have convinced him that he was wrong for having this obsession, so his confessing accomplishes both - punishing her and himself.  In the end, she realizes her mistake and even contemplates suicide, but decides to try to make up for it and come back to him.  He, however, actually has made some progress by finally being able to let her go and rejects him.  She ends up losing in the end and he gains some self respect.  At least that is where I think the movie goes.<br><br>A couple of small points that people are making.  I am not sure why Puerto Rico was picked.  Except maybe to add some irony by injecting an exotic locale.  I don't think that choice is necessarily a good one, not necessarily a bad choice either.  But it doesn't work well and it may have been the director's choice not to exploit that.  Maybe the book got into it deeper.  Also, the friendship between Freeman's character and Hackman's obviously took place much earlier in their lives.  It appeared to me that they had really be estranged for a long time leading different lives, his in the wealthy, social world, Freeman in the working class world.  They knew a little about each other, but not the details.  I do think they could have expanded on this a little more for development though. <br><br>\nOverall, I think this is a very good movie and worth seeing if not for Freeman and especially Hackman's performances.  Hackman doesn't often do a movie where he plays a vulnerable character.","user":"joebarrus","rank":[67,72]},{"title":"A potential spellbinder and one of Hackman's best performances","rating":8,"date":"2 January 2001","review":"Most of this dialogue-intensive film takes place in an office in a Puerto Rican Police Department with a top detective (Freeman) grilling a wealthy attorney (Hackman) about the rape/murders of young girls. Featuring outstanding performances by both principals and technical and artistic excellence, the film's story unfolds piecemeal as it scrutinizes the Hackman character with painful deliberation while holding out the \"whodunnit\" carrot until the very end. More mature audiences with an appetite for this type of film are likely to find \"Under Suspicion\" a spellbinding tour de force by Hackman.","user":"=G=","rank":[66,80]},{"title":"Ending \"explained\" in detail (Obviously spoilers).","rating":8,"date":"25 November 2003","review":"Okay, I commented on this movie once a few days ago, encouraging viewers to go and watch it and not try to learn too much before seeing it, so as not to tarnish their perceptions. So many are troubled by the ending and don't understand. No doubt, it makes you think and doesn't hand over instant satisfaction or relief from the conflict. Does life always. Well, here's the importance and brilliance of the ending. Henry is like many of us. Little parts of our lives taken out of context or thrown into the wrong context could leave us having to \"explain.\" More than one part, public embarrassment, a mixture of betrayal and enough suspicion could put you in Henry's shoes. To highlight. The dog. The dog ran with him like most times. But he didn't meet the dog like usual, rather the dog met him on the trail. Even Henry first recalled it happened like always until he really remembered it hadn't. But the dog was there and the dog found the girl. The dog's owner says otherwise. Camille. Nothing really happened with Camille. But now, like the dog, it looks suspicious to investigators. His wife always thought so and made it part of Henry's nightly problem before this ever surfaced. Something so familiar to him, he blurted out a denial before his wife ever brought it to investigator's attention. Now they make it their business to discover all they can about this from her, and get her side naturally. Henry visited websites, innocently like many of us, but now the police see the pornsites he looked at while he believed things were private and now he must explain. He is a prolific photographer. As photographer's always do - he shot many rolls of indiscriminate film and not surprising (by itself) captured some of the victims at some point. The victims were public people (which is part of why they became victims) and Henry had an abundance of pictures related to these scenes around him. All this suspicion and pressure, and his wife and the \"lengths she went to\" as Henry said, when learning she dug through his darkroom and discovered photos he didn't even realize he owned. Then she gave them to the police. He stands as the only one saying aside from all this, he didn't do the murders. He looks at the mirror and tells his wife to \"come in here and face me.\" Given all his thoughts and feelings, even he decides to go along with everyone. He gives up. Doesn't care. He's the last one to join the parade. It all played out and he tosses his hand. Begins his false confession which is fueled by facts he learned from listening to the interrogators over the last few hours. (He never suspected his wife did the murders as some have said). Then an undisputable circumstance rears it's head and suddenly everyone pulls the weight of suspicion away from Henry. For the first time they are on his side. He's \"free\" but really far worse off than he ever was because of all the things he realized about his life. He's has to accept who and where he is, whether deserved or undeserved. As viewer's we became an integral part of directing suspicion towards Henry, we too began thinking and agreeing about his guilt. We too, wanted to find the shred of evidence that made him \"100% guilty.\" It isn't there, nor was it ever - just like Henry said. The character's in the film are deflated, confused and unhappy with the ending - just like you are!!","user":"rarematters","rank":[38,46]}]