[{"title":"Underrated gem enjoyable my favorite sequel in the \"Scream\" franchise series","rating":10,"date":"18 February 2018","review":"Scream 3 is so underrated and bashed from fan boys. I love this film to death I enjoy this film I have watch it with my dad. It is an underrated gem my personal favorite sequel in the \"Scream\" franchise series. It is an improvement over the second one. Sidney Prescott is a such a bad-ass, you have for the first time in the movie an explosion you see a house been blowed up. The plot and the story is set the first time in Hollywood. I love that it is an original story, it does not copy the second or the first film, it doesn't mess with the first two movies. It does finish the trilogy and brings an ending conclusion to the franchise. I enjoy this film, I love this film to death. Wes Craven did a great direction debut. Ehren Kruger replaced Kevin Williamson thank god and he did much better job to make an original story and make an conclusion to end the trilogy. <br><br>I love with what happened next with the characters: Sidney now is a crisis counselor, I liked that. Ghostface returns he has unfinished business with Sidney and he wants her back. Dewey Riley is now working as an film adviser In Hollywood. I love his character, this time around David Arquette was better actor in this movie. I love that they did something new with his character, he wasn't annoying, he wasn't useless, he was good. He shot with a hand gun and killed the killer on the end, a real hero in this movie. Patrick Dempsey as detective Mark Kincaid was great he was likable and I have enjoyed him. I love his character. I love Jenny McCarthy as Sarah Darling she was believable. The movie was not dull, lame, or repainting the same story again, it had less humor, more horror, mystery and action it was mixed it had that what the second movie didn't had. <br><br>The story is set three years after Scream 2 Sidney Prescott (Neve Campbell), who has gone into self-imposed isolation following the events of the previous two films is drawn to Hollywood yet again she returns again to face the past and find out who is responsible for her mother's death. The new Ghostface begins killing the cast of the film within a film Stab 3 and has a score to stale with Sidney Prescott. Dewey Riley and Gale Waethers are trying to find out who is responsible for the killings. Gale has an unlikely sidekick Parker Posey as Jennifer Jolie. Courtney Cox is excellent as always as Gale Weathers. <br><br>10/10 I personally enjoy this sequel it is my favorite sequel in the franchise. Lance Henriksen is in this movie too and he is believable. I love the setting, the story and I love Sidney she is a bad-ass and I love happy ending, I love the trilogy to death and I love this movie to death sue me!","user":"ivo-cobra8","rank":[100,123]},{"title":"Ghostface is Back AGAIN?","rating":4,"date":"9 November 2012","review":"Yes, that masked psycho with the \"Scream\" mask has returned for a third round of murderous rampaging. The first victim of his wrath is duo film survivor Cotton Weary (played by a pre \"X-Men\" Liev Schrieber) when he fails to reveal the whereabouts of the reclusive survivor, Sidney Prescott (Neve Campbell)who is now hiding on an isolated estate as a crisis hot-line operator. When the murderer begins to leave pictures of Sidney's deceased mother, Sidney is soon drawn to the set of \"Stab 3\" (based on her experiences from the previous films)alongside her fellow survivors, reporter Gale Weathers (Courtney Cox-Arquette) and retired officer Dewey Riley (David Arquette). Other players such as Parker Posey, Emily Mortimer and Scott Foley as members of the film-within-a- film join the three original cast members (with a brief cameo by Jamie Kennedy as Randy Meeks with posthumous advice to survive a trilogy). However, this third installment lacks the real scares that unnerve audiences in the first two films. You can easily predict the timing of the phone calls and the murders. If you want actual scares, then watch the first and/or second film.","user":"Aly200","rank":[7,7]},{"title":"Not as effective as the original \"Scream,\" but still produces enough scares and thrills. *** out of ****","rating":7,"date":"18 February 2000","review":"SCREAM 3 / (2000) ***<br><br>Starring: Neve Campbell, David Arquette, Courteney Cox Arquette, Parker Posey, Patrick Dempsey, Scott Foley, Lance Henriksen, Matthew Keeslar, Jenny McCarthy, Emily Mortimer, Deon Richmond, Patrick Warburton, Liev Schreiber, and Carrie Fisher Directed by Wes Craven. Written by Ehren Kruger, based on characters by Kevin Williamson. Running time: 116 minutes. Rated R (for strong horror violence and language).<br><br>By Blake French:<br><br>\t\"Scream 3\" is not as satisfying as the original horror masterpiece \"Scream,\" but what can we expect from the final chapter in a slasher trilogy? The first film was a superior horror thriller--one of the most loved slasher movies of the past decade. That was a picture with some hard standards to live up to. However, Wes Craven, director of the trio, accomplished another success with the sequel of \"Scream.\" Usually this kind of movie would fade into the Hollywood recycle bin by now. But \"Scream 3\" still produces chills, thrills, and lots of surprises--even though we have been receiving the same kind of story for the past four years. This film is marginally passable, although the most flawed film of its series, that fairs as recommendable, but not substantial in quality. <br><br>\tThe film's opening once again provides the audience with a pre-credit murder sequence that is almost the highlight of the entire production. The \"Scream 3\" writers take advantage of one of the movie's old and important characters to arrange this very effective, and scary, sequence.<br><br>\n\tThe setting is several years after the second film. The small college town of Woodsboro is where we are placed. Neve Campbell again stars as Sidney Prescott, a tormented young woman who was the target of the killing sprees in the past. She has attempted to move on with her life with her father, and has an anonymous hotline operation that offers assistance to those in need. Also, television reporter Gale Weathers (Courteney Cox Arquette) has experienced a big career jump, now working for a network called Total Entertainment. While the wrongly accused murder suspect of Sidney's mother, Cotton Weary (Liev Schreiber), has his own trashy TV talk show.<br><br>\n\tThe central presence that connects the events here is the production of \"Stab 3: Return to Woodsboro,\" a movie the characters are creating that follows a horror trilogy based on the terrors experienced by Sydney. The masked murderer may or may not be found on the set. Besides police Detective Kincaid (Patrick Dempsey), and the arrogant bodyguard Stone (Patrick Warburton), concluding the list of suspects, there is Dewey Riley (David Arquette), a former cop who is now an advisor for \"Stab 3,\" Roman Bridger (Scott Foley), the film's director, John Milton (Lance Henriksen) the film's producer, as well as acting counterparts Sarah Darling (Jenny McCarthy), Tom Prinze (Matthew Keeslar), Angelina (Emily Mortimer), Gabe Tucker (Deon Richmond), and Gales's reciprocal (Parker Posey).<br><br>\tCertain plot points lead our suspicion to believe one of several characters is the killer. We are fooled again, however. But does the killer's identity really matter here? As long as we receive a speech on why he or she is responsible, we would be satisfied and any of the character's could have been the killer. None of the characters have any shape or construction. We care only about the order that the victims will be picked off at, not about who hides behind the ghost mask. The identity is actually pointless when the slasher is finally revealed. <br><br>\tOnce again, a key success in \"Scream 3\" is the scary sequences that build up momentum and thus work well, usually where the slasher kills his victims. What makes these scenes so effective is how we know that characters are three dimensional; they put up a firm fight for their lives, unlike victims in most slasher films. However, the plot seems to revolve around the murders, instead of the murders branching off from the story. \"Stab 3\" seems to be a central presence to connect the film's somewhat desperate through line. <br><br>\tSome of the plot points are fun and revealing. We see a videotape of a past character describing the possibilities of the movie's final outcome. This event programs our imaginations to suspect the unexpected. The plot does desperately attempt to fill in missing pieces of the previous screams, however, showing some signs of contrived foreshadowing. Each scene moves the story forward, though, replenishing the plot with freshness and ability around every abrupt corner. <br><br>\t\"Scream 3\" is a close call, and is given somewhat of a mixed review, but I still am giving the movie a marginal recommendation. It contains more startles, more surprises, and more effective scary material than most slasher movies.  Although I believe it was a wise move to make this film the final installment of its series.<br><br>Brought to you by Dimension Films.","user":"Movie-12","rank":[49,67]}]