[{"title":"The life story of the man in the chair","rating":6,"date":"31 October 2012","review":"Most of the movie is about Stephen Hawking's life rather than Stephen Hawking's ideas. It's more a biography than a document about the science behind time. For a title 'a brief history of time', it's rather talks about anything about time at all. The movie forget to add the subtitled in the book in which the movie based on. It should had the subtitled \"From the Big Bang to Black Holes\") added to it. A Brief History of Time was supposed to explain a range of subjects in cosmology, including the Big Bang, black holes and other super-string theory, to the non-specialist thinker, but the movie doesn't follow that. Although they share a title, the film is a biographical study of Hawking, and not a filmed version of the book. While the movie gives a great insight of the life of Hawking and how he end up in the wheelchair. The movie doesn't mix the story of his life with that of his research that well. The theories come out of nowhere like the Big Bang and leaves while we move back to the story of Hawking's personal life, then back to another theory and then back to the story. It doesn't seem intertwined. I would rather have the movie address the subject using examples of Hawking's life rather two different subjects trying to share screen time. While the choice of topics is well balanced and gives you an interesting introduction into the modern view of our universe. The movie is a bit outdated with its facts. In particular the introduction of sometimes contradictory models explains how physics works the evolution of ideas. Yes, since we live in a static, (which means a fixed or stationary), Multiverse. Space and Time are illusions, according to scientific principles. Each of our now's, are like a succession of snapshots, that we chose with our free will to form probabilities, to make our reality. According to Quantum Mechanics, nothing at the subatomic scale can really be said to exist until it is observed. Until then, particles occupy uncertain \"superposition\" states, in which they can have simultaneous \"up\" and \"down\" spins, or appear to be in different places at the same time. The mere act of observing somehow appears to \"nail down\" a particular state of reality. Because our concept of time means ever thing has to be moving in linear fashion, it is very difficult to fathom that time and space are illusions but since science proves that they are illusions, everything is static and eternal. Ultimately, this documentary postulates the theory that there must have been a beginning of time (and the universe), but then suggests that perhaps that the universe is indeed eternal in origin without a point of creation in some oval shaped model he showed, as opposed to the classic point model where the laws of time and modern science breakdown and the dawn of time. Watch Lawrence Krauss's lecture for a much more complete/contemporary cosmological painting. Still an interesting personal perspective of Hawkin's experience but the audio quality is terrible though. The other people sounds like they are speaking through a computer like Hawking. After a while, it's get really annoying. Still it was very interesting movie.","user":"ironhorse_iv","rank":[7,7]},{"title":"Could have been much better.","rating":4,"date":"20 July 1999","review":"As a physicist, talk about blackholes and cosmology gets my heart racing. However I found this presentation too slow and not packed with enough information for the interested layman (who is most likely to see it). If you have more than a passing curiosity in this sort of stuff, go to the library and check out some books. You will find they explain current scientific cosmologies with far more detail while at the same time filling you with more of a sense of wonder than this movie does. Also to set the record straight: Hawking is NOT considered the \"greatest mind\" or the world's \"smartest person\" as commonly asserted even among the user reviews here at the IMDb. Hawking himself has commented that \"It is rubbish. It is just media hype. They needed somebody to fill the role model of disabled genius. At least I'm disabled.\" To be fair, he is probably a genius but among history's greatest scientists, people like Einstein, Newton, Gauss, and many others easily are even more highly regarded. This is not to disrespect Hawking who is a undoubtedly a great scientist but rather not to disrespect others who have done even more than he has. Anyhow, see the movie if you are truly into science. But if not, I think it would be boring for you.","user":"MyOpinionIsFact","rank":[37,50]},{"title":"Interesting Look","rating":6,"date":"29 November 2008","review":"A very fine and intriguing documentary from Errol Morris about the life and work of physicist/celebrity Stephen Hawking, who revolutionized the way we think about the universe in his monumental book of the same name. The film is really divided into two stories, the life of Hawking as he struggles to overcome his paralysis, and the brilliant work he achieved in spite of his physical limitations. One gets the impression that had Hawking never became ill, he wouldn't have been as compelled to carry out the kind rigorous intellectual work that he of course did carry out, and (he himself notes that he was quite bored with life prior to his paralysis). Morris does a fine job with the material; the first half hour of the film suffers from a dry PBS feel, but the aesthetic and intellectual intensity takes off from there, the film never digresses into a mere sob story. Morris nearly always keeps the material more intellectually intriguing than it is uplifting and sentimental.","user":"rbloom333","rank":[5,5]}]