[{"title":"Fair Italian horror, classic/modern blend","rating":8,"date":"9 September 2000","review":"You can't help but go into Wax Mask with a little trepidation. First time director, written by an aged Luci Fulci and Dario Argento (who also produced), both of whom have had a less than impressive careers as of late. That said, Wax Mask is not a disappointment. It isn't a great film, but an entertaining one.<br><br>The plot is liberally adapted from the classic Gaston Leroux story, also used for classic horror film House of Wax. A young girl sees her father killed by a metal handed maniac. Flash to 12? years later, she begins to work at a local wax museum that specializes in recreations of murders. We actually dont see much of the museum, just a few sculptures down one heavily draped hallway. A metal handed figure begins to go around town injecting and abducting prostitutes and children. All the while, the wax museum keeps a steady supply of figures that appear really lifelike. You know the story. A newspaper reporter begins to investigate the disappearances and takes a shine to the girl. Everything begins to point to the wax museum and its curator/mad inventor and his goons. The finale is ridiculous, but short enough to not ruin the film with its awkward turn.<br><br>Stivaletti handles the film pretty evenly. You can tell he learned a lot about atmosphere in his years working for Argento, Bava, and Soavi, but Stivaletti doesn't showcase any revelatory talent, just competent skill. Italian horror films are always style first, general substance in the plot or performances is always secondary to the mood and movement. The film is paced well, and doesn't pretend that we all won't know who the killer is, after all this is well tread territory.  The setting (early 1900's) and score are a welcome change, since Italian horror usually stays in modern times. Stivalletti makes use of heavy colours, POV, flashbacks, CGI, as well as old horror imagery like the gothic buildings, and a mad doctor laboratory with bubbling serums in tubes, and electrified levers. The lead actress is beautiful, sultry, wide eyed, and willing to take her top off. The hunky reporter is very lame and unappealing. He attempts to be suave, but he is just a dork. Miscasting him as the hero is the films real lowpoint. The curator is good, he doesn't overplay his part, not a drooling maniac, just threatening enough.<br><br>Italian horror fans should find it a satisfactory film, nothing to astound you, but not overly disappointing, either. Other horror fans may be wary, but it does have a genuinely nice blend of old and new schools of horror. As far as Italian horror goes (where one must often not expect much in the acting and plotting department) it gets a B-. As far as standard horror it gets a C.","user":"iaido","rank":[16,17]},{"title":"Top recommendation!! Sergio Stivaletti single-handedly proved here that Gothic Horror still lives!","rating":8,"date":"19 February 2004","review":"I rarely ever see this film mentioned anywhere and I think it's a darn shame. Sure, it isn't that original or ground braking since the plot is more or less similar to House of Wax' `starring Vincent Price, but the whole fable is transferred to a wonderful gothic setting which fits the story real well. A terrific portrayal of Paris at the beginning of the 20th century is what makes this movie so compelling and beautiful. The basic plot is based on a fable by Gaston `Phantom of the Opera' Leroux but  and more importantly - the screenplay is a combining of the immense horror powers of both Dario Argento AND Lucio Fulci For those who know their way around the Italian horror industry, I don't have to confirm that this guarantees a true shock-fest! The blending of these two wicked masterminds results in both breath-taking suspense and violent, gory massacres. The film is a non-stop series of terrifying and nightmarish events but these happenings are constantly being mixed with gruesome, detailed make-up art and visual effects. The absolute highlight of this is the slow motion transformation of an innocent girl into a wax statueHorrifying, tense and brutal all in one. The name of director Sergio Stivaletti might not ring a bell, but that doesn't mean he's a first-timer in the field. He made his name as special effects and make-up guru and he repeatedly worked with Dario Argento, Lamberto Bava and several other Italian horror-meisters. `Maschera di Cera' is his debut (and so far the only effort) as a director. Unfortunately, the high quality level of this film can't be kept up till the end, the grand Terminatoresque finale is abysmal and almost destroys the tense atmosphere that was build during the entire movie. Also, the dubbing is God-awful At some times, you'd really beg for the characters to shut up and replace the lines with a little more of the magnificent Gothic music that is used. You have got to love the music in this film! Last but not least, The Wax Mask introduces a couple of ravishing female beauties. Romina Mandella and especially Valery Valmond both are stunning goddesses. This last one seemed to have disappeared off the face of the earth after shooting this filmI'm considering emigrating towards Italy to go search for her.<br><br>\nPS: Maschera di Cera was released shortly after Fulci sadly passed away. Therefore this film opens with the words `Dedicated to Lucio Fulci', which I think is brilliant. Honor this man, he was a genius","user":"Coventry","rank":[22,26]},{"title":"Good fun","rating":28,"date":"28 April 2001","review":"If you are familiar with italian horror, you get exactly what you expect here. Adequate to terrible performances, atrocious dubbing, gaudy visuals at the expens of characters you actually care about and imaginatively staged murders. However, this film was better than i expected, since director Stivaletti is primarily a make-up man and tried his hand at directing here for the first time. The (I suspect limited) budget is used well with varied locales for the different scenes, nice art-direction and costumes and crisp camerawork. Pace is well maintained throughout the movie which distracts you from some of the less obvious plot-holes. The waxmaster himself does quite a good actingjob, not hamming it up. As for \"the good guys\", the leading lady is adequate but at bit dull. Our supposed \"hero\" is however damagingly miscast and comes over as a complete bore. As is usually the case with italian horror, the visuals are at the fore here with rich colours (which of course includes crimsonred blood), lovingly filmed and accompanied by a good and appropriately romantic score. The finale, as a few others have stated, is quite bad but fun in a way with some terminatoresque touches that are unexpected, to say the least. And the murders, surprisingly few, are competently put together with a sufficient amount of gore to satisfy fans. Overall, entertaining and good fun, if you dont expect \"Citizen Cane\".","user":"jangu","rank":[16,19]}]