[{"title":"Decent flick but WAY over-dramatized","rating":6,"date":"8 September 2005","review":"I have always been a big fan of the novel \"Thinner\", by Richard Bachman (Stephen King). It strays from the typical horror/gore plot, and focuses a lot more on issues of class warfare and social injustices. I have always seen this book as the story of a WASPy rich white lawyer having his bubble burst and being forced into a sort of compassion for the Gypsies and drifters of this world.<br><br>This movie was decent, not great. If you're going to watch it because you liked the book, be warned that almost every major plot event has been exaggerated and \"Hollywood-ized\" to the point of ridiculousness.<br><br>For example, instead of Richard Ginelly being the gentlemanly and sophisticated Mafia don from the novel, the movie portrays him as a bloodthirsty maniac who can't be stopped once he's started his \"work\". I noticed this in the film adaptation of \"Shawshank Redemption\" as well.. It's a shame that filmmakers feel that the average moviegoer won't enjoy subtlety or sophistication. They obviously feel that they need to whack us over the head with their films in order to get their points across.<br><br>Rent this flick if you're a fan of movies like \"Sleepwalkers\" or the more recent films in the Hellraiser series... definitely entertaining, but unfortunately, not something I can take completely seriously.","user":"PenalColony","rank":[18,20]},{"title":"Thin on scares, fat on laughs!","rating":7,"date":"17 February 2012","review":"I didn't know what to expect from \"Thinner\". Firstly when I saw it in the \"What's On TV\" magazine I thought of it as a serious horror film, that sounded quite eerie. You know, a man slowly getting thinner and thinner, and then of course it's Stephen King which is never a bad thing, and then it had 4 stars and so i thought that this film could have potential! But then I look at IMDb's rating and it's very below average so I was wary. Thankfully I was relieved when I turned it on and the first thing I saw was this clearly slim man in a ridiculous fat suit and I laughed.<br><br>I pretty much laughed all the way through. There's no denying that \"Thinner\" (unintentially or not) is a very funny film. You only have to look at the man and laugh at those incredible hamster-type cheeks! The fat suit is hilariously bad, not a patch on the one that Eddie Murphey wears in \"The Nutty Professor\". The man's facial expressions also had me rolling down the aisles (well, 'the sitting room') in every shot his eyes were wide and gleaming like he's just seen a massive slice of cake! His smile was also hideous. He looked like \"The Joker\" out of \"Batman\". Even when he's eventually thin, he still wears those awful eyes and smile. The guy's a slug.<br><br>The special make-up effects are very special indeed. A film like \"Thinner\" relies on the make-up effects. That's what made David Cronenberg's \"The Fly\" so amazing. Yet, the effects on \"Thinner\" are almost as bad as the fat effects. One man has terrible rubber boils over his face and his hand looks like a dinosaur stump. The 'thin' effects are also quite horrendous too. Thanks to \"Thinner's\" visuals you're always sure of a laugh. I can't tell if we're meant to be taking this film seriously or not.<br><br>And then there's the awful screenplay that always seems to fight for the chance to see Mr.Lawyer literally stuffing his face with food. Though, it doesn't help that all the actors are terrible, with the gypsy looking like 'Grandad' out of \"Mrs Brown's Boys\" only with hair more luscious. Every character is a stereotype and the actor's seem to live up to that. No one asks questions like, \"Why have you bought home a pie?\" They just accept that and eat it.<br><br>In all seriousness, \"Thinner\" could have been a horror classic rather than a horror cult classic. It could've been a chilling fable of greed and the price you pay for it. Instead we get a hugely entertaining film that offers no scares what so ever. \"Thinner\" is a hard film to rate because critically it's awful, but then again I had a ball watching this film and would happily watch it again. \"Thinner\" never bores, and the ending is actually pretty good. For guaranteed laughs, don't miss \"Thinner\".","user":"asda-man","rank":[23,27]},{"title":"One of the Better King Stories","rating":7,"date":"9 December 2010","review":"Billy Halleck (Robert John Burke) hits an old gypsy woman with his car, and with the help of his lawyer and judge friends gets away without even a traffic fine. Unfortunately for him, he cannot use legal maneuvers to get the gypsy curse off of him! <br><br>Stephen King has one of the worst track records for film adaptations. For every great film (Green Mile, Shawshank Redemption, Shining) there are some real piles of rubbish. And any number of films in between. This one, luckily, is closer to the good end. Some have pooh-poohed it, but I found it pretty enjoyable.<br><br>Beyond the main story, which was average, the film comes alive due to Joe Mantegna's portrayal of Richie Ginelli. Mantegna, who you may know from \"Criminal Minds\" or as the voice of Fat Tony from \"The Simpsons\", is pretty great as violence incarnate. When he unleashes his vengeance on the gypsies, you almost have to feel bad for them, as you admire his tenacious bloodlust.<br><br>I have heard people complain about the ending, which apparently varies from the novel. I have also heard that the novel has more intricate subtleties that the movie overlooked. I do not have the novel, so I cannot comment on that, beyond saying that I really enjoyed the ending. I can't say what it is, but I found it very appropriate.<br><br>Burke's Clint Eastwood voice may be a bit dramatic, but I did not mind... oh, and Kari Wuhrer appears, as well... though does little more than provide a dash of sex appeal.","user":"gavin6942","rank":[22,26]}]