[{"title":"The Saints Come Marching In!","rating":21,"date":"21 August 2003","review":"The Boondock Saints is one of the most pleasant surprises I've had in my years of watching indies, and it proves conclusively that you don't need a massive budget to do a terrific action film!<br><br>Two blue-collar Boston Irish brothers (Sean Patrick Flanery and Norman Reedus, who are both terrific!) rid their favorite pub of an influx of Russian gangsters, and soon decide they are on a Mission from God to execute all the 'heavy hitter' criminals from the city. While this makes them local heroes, it also sets sympathetic detective Willem Dafoe on their trail.<br><br>The story is reminiscent of the 'Death Wish' series, without the glossy superficiality of the Bronson films. At times funny, at times disturbing, it never loses momentum, with a twist ending is both satisfying and thoroughly insane! <br><br>While the violence is graphic, the story is character-driven, and never allows the executions to overwhelm the plot. You actually like the brothers, and may be hard-pressed NOT to root for them, even if you do feel a bit guilty about it!<br><br>The Boondock Saints is a fabulous film, one that deserves your attention!","user":"cariart","rank":[311,427]},{"title":"Take it or Leave it.","rating":31,"date":"31 March 2004","review":"You've either seen it or you haven't; you either love it with a fiery passion, or curse it for ever being thought up. Boondock Saints is one of those films that people just can't seem to be apathetic about.<br><br>I happen to be one of the those who love it with a firey passion. I thought that Willem Dafoe's character was fantastic and created a gay man unlike the stereotypes of \"Queer Eye.\" I also thought Duffy's was well suited to the tone of the movie, and created several fascinating shots that I love as a film student. The credit sequence strikes me as brilliance; the film raises a lots of questions of where the line between good and evil lays and about perceptions of God. The writing made me laugh, the music made me shiver (the opening sequence is The Blood of Cu Chulainn--fantastic if you like that genre), and the characters made me care. On a purely shallow feminine note: just as straight boys have twin fantasies, so do I with a pair of fraternal Irish twins...thank you Troy, thank you.<br><br>Of course then there's the opposite side of the coin. Allowing yourself to be immersed in the story takes some huge suspension of belief. Common examples: Conner jumping off a building and not breaking bones--possible, but unlikely, and the boys falling through the air duct after magically taking a coiled rope, untying it and getting tangled in it enough that when caught would hold their weight allowing them to shoot every major boss in the Russian Mob--yeah, I don't buy it either, but it's extremely cinematic! Some people would point to that and say \"divine intervention! God loves them!\" Yeah well, God loves us all, but you don't see people flying off buildings because of it--well you might, but you get my drift. So my point is that, while I love this movie, I could very easily see where someone else wouldn't.<br><br>If you haven't seen it; you should. Give it a chance. Don't listen to anybody else before you do. Hell, if you haven't seen it why are you reading this? Go rent it, burrow if from your friends, whatever; watch it and form your own opinions and then join in some huge fight on the message boards. Good fun can be had by all, whether you loved or hated it.","user":"ScarlettWeasel","rank":[143,194]},{"title":"A true original","rating":10,"date":"1 September 2002","review":"This film had the sad history of being blackballed in the United States due to the incident at Columbine...which is a real shame, because it is a treasure...written and directed by Troy Duffy, Boondocks is set in Boston...it is the story of fraternal twin Irish boys (Connor and Murphy McManus) who work in a meat packing plant...when their friend, Doc, is being stiff armed by the Russian Mafia, the boys and their friends step in to help...and away we go! Two of the most interesting characters in the film are played by veteran actor William Dafoe, and a newcomer to the silver screen, David Della Rocco. Dafoe's character is Paul Smecker, a gay FBI agent specializing in organized crime...Rocco plays an Italian Mafia package boy who is a close friend to the Irish brothers...the central theme of the film is the indifference of good men...Connor and Murphy are not indifferent, and after helping their friend, Doc, the two embark on a crusade to rid the streets of Boston of criminals...with the assistance of their comical and zany friend, Rocco...This film had positive elements on all sides...humor...a moral message...and incredible actors...you will no doubt find yourself repeating the many memorable quotes from the film...I am a woman, and not at all into your typical \"shoot 'em up\" guy films...this is not another one of those films...it has become an underground \"cult\" sensation...See it...you will not be disappointed!","user":"Ledare","rank":[376,534]}]