[{"title":"Mindless fun, a romance of bickering journalists","rating":6,"date":"12 March 2006","review":"Well, I wouldn't exactly describe this as a timeless classic, a thought provoking movie, or one of the legendary love stories of the silver screen. Still, it's a fun romance and an entertaining way to spend a couple of hours.<br><br>The tale revolves around two rival Chicago reporters, one relatively novice, Sabrina Peterson, the other the more seasoned, well known Peter Brackett, who are both hot on the trail of a train derailment story. Of course competition between them is intense (and so at times is the chemistry) as the two exchange false leads, fibs, barbs, and witty repartee. Lots of predictable action, chases, and mystery as to the identity of the bad guys.<br><br>The lovely, always endearing Julia Roberts plays the journalistic sharp cookie, Sabrina, with Nick Nolte convincing in the role of her rival, Brackett. At least the pair are not hopping into bed within the first half hour (in refreshing contrast to most modern films), leaving a little time for storytelling and character development.<br><br>This is definitely describable as a \"flick\" (for guys or chicks); its spirit is in keeping with its title. Personally, I'm a great Julia Roberts fan. This isn't her best picture but, nevertheless, it's quite watchable.","user":"roghache","rank":[5,5]},{"title":"Formulaic, but fun","rating":5,"date":"16 August 2004","review":"That this film fails on so many levels and still remains watchable, if not actually enjoyable, must be a credit to someone involved in the production; it's just not immediately clear who.<br><br>There are three main problems with the movie.  One, the attempt to graft the noirish elements onto a hi-tech industrial-intrigue plot, which results in an uncomfortable mix of pulp culture from two generations: the hardboiled detectives of the '40s thrust into the realm of today's potboiler mystery bestsellers.  Whereas the earlier style was streamlined, and relatively simple and focused, today's genre authors seemingly compete for who can make the most convoluted plot with sidetracks, red herrings and subplots galore. This contrast leaves the film trying to go in two directions at once.<br><br>Two, the relationship between the leads is never quite satisfactory. Roberts and Nolte are just not cut out for their cut-out roles, and while they try gamely,  it's tough to buy them as reporters who bicker, and almost impossible to imagine them falling in love, even though its obvious from the first reel that this is where the story will take them.  Three, the film is far too long, and it becomes a chore to maintain attention and interest in what happens.<br><br>On the plus side, there are some redeeming features.  The plot plays its cards close enough to its chest that some elements of the ending come as an untelegraphed surprise.  The comic touches are successful enough, especially in the bickering between the two as they try to out-do each other in getting the scoop for their respective newspaper.  The camera work and editing employ some tricks to freshen up some scenes and the cuts between them.  The only problem here is that once the same trick is employed more than once or twice it becomes a little tiresome.<br><br>We're left with a very standard piece of work, but one that works just hard enough to keep it relatively entertaining but not quite memorable, even for Nolte and Roberts fans.","user":"NxNWRocks","rank":[10,12]},{"title":"average \"formula' movie, not really bad or unwatchable just unremarkable.","rating":5,"date":"14 November 2003","review":"I love trouble isn't awful or outstanding, it's simply a by the numbers, at times pleasant movie that is extremely predictable but isn't a bad choice, particularly if your a Roberts or Nolte fan.<br><br>I love trouble doesn't stick out in my mind at all as either great or awful and I suppose I enjoyed it, moderately. It's not a must see but is worth seeing on a rainy day as there is absolutely nothing about it that's dreadful.<br><br>This part mystery part romance relies on Nolte and Roberts to carry it and if they had been exceptional together the by the numbers and predictable factor may not have mattered. But unfortunately, Roberts and Nolte certainly don't have much chemistry and they've both been better with other leads playing opposite. There are some fun moments in this and as mentioned, it's not really bad or dull as much as utterly predictable in every way, but it's not a movie where the chemistry of the two leads or the storyline will stick in one's mind after.<br><br>There's nothing wrong with predictable sometimes but as predictable movies go I have seen much much better.This is probably about average or so.","user":"triple8","rank":[4,4]}]