[{"title":"Neither The Book Nor A Bust","rating":6,"date":"19 May 2005","review":"Like \"Citizen Kane\" and \"The Man Who Shot Liberty Valance,\" \"Midnight At The Garden Of Good And Evil\" is a movie about a writer trying to get a simple story, and finding himself with more than he bargained for. John Cusack is the writer, John Kelso, and his explorations of Savannah, Georgia offer some mystery and fun, though the result will be flat for those who already know the story from reading the best-selling book.<br><br>\"Better to be on the edge of a party, don't you think?\" a young woman named Mandy (Alison Eastwood) asks Kelso at one point. It's a pertinent question. Alison's father Clint and screenwriter John Lee Hancock try to accomplish much the same effect here, dancing at the perimeters of things, showing conversations where words can not be discerned. Many times we see Kelso looking in on some social function from the outside, like at a cotillion for black debutantes or bridge games at the Married Women's Club, a bit adrift but interested in the games people play.<br><br>At the same time, Kelso becomes quite close to one Savannah resident, Joe Williams, an art dealer whose homosexuality is an open secret until he comes out of the closet by shooting his boy-toy. Kevin Spacey's performance as Williams is rich and fun, his accent not note-perfect but well-tailored to his polished delivery. The way he lazily smokes his cigars as he moves through a party, dabbles in lowcountry voodoo with Jesuitical zeal, or even eats gumbo in prison is a study in an actor's sense of the wholeness of the role.<br><br>While many book fans savage this with the comment \"It's not what I read in the book,\" I take it in stride. John Berendt didn't carry this thing down from Mt. Sinai either – most notably by presenting the killing as something that happens after his arrival rather than before he played with the facts in the book. So when the film gives us a romance between Berendt's stand-in Kelso and Mandy or invents connections between the Williams story and the others in the book so the secondary characters can appear in the main story, it kind of works in an offbeat way.<br><br>What doesn't work is the pace. The film goes on for over two and a half hours, and feels longer. Eastwood obviously approached this project with enthusiasm for the book, and especially for the music of Johnny Mercer which is prominently featured. But the comedy feels labored, the depiction of Williams' trial too unshaded in its sympathy for the defendant, and many of the performances, like that of Jude Law as the dead loverboy, seem underbaked.<br><br>Two good performances are delivered by people who had real-life roles in the book. Sonny Seiler, who defended Williams, plays the judge in the trial and gets to tell himself when he's out of order. The Lady Chablis, who I never cared for much in the book, has an engaging vulnerability on screen. Even when the story screeches off track by focusing on her character, she makes the logic gaps less bothersome with her playfulness.<br><br>I even liked Alison Eastwood, who does a good accent, looks the part of Mandy, and makes the film's most egregious detour from the book seem less of a violation. Not a stunner, but her languid delivery and drooping eyelids are very sensual in the everyday manner she presents us with, a half-promise of something good reaching out to you in the dark. In that way, she recreates the spirit of the book quite wonderfully. Pity her father didn't always do the same, but this is an entertaining film more often than not.","user":"slokes","rank":[67,84]},{"title":"Another lesson in movie making by Clint","rating":10,"date":"23 March 2005","review":"A stylish and haunting film-noir thriller, \"Midnight in the Garden of Good and Evil\" is another lesson in peerless film-making by Clint Eastwood. John Cusack makes one of his most positive performances and skips the usual charming giddiness he is famed for. The storyline never ceases to surprise you and neither do the characters. Spacey's Jim Williams is one of the most fascinating villains ever and Spacey again delivers a perfect performance. More solid work comes from Allison Eastwood, Jude Law and Lady Chablis, the humorous treat of the film.<br><br>The most mystic and chilling scene is in the middle of the film, when Williams and Kelso visit Minerva, the scene which gives the movie its name. The climax is also incredibly well written and directed, one of the most suspenseful ever. A bravura work from a man who has long since learned how to make perfect film noirs. A highly enjoyable and recommendable movie.10/10","user":"ereinion","rank":[87,111]},{"title":"Good Lord, I can't take my eyes off Kevin Spacey","rating":8,"date":"13 April 2005","review":"Like every film Clint Eastwood makes, \"Midnight in the Garden of Good and Evil\" is fascinated by the mystery of masculinity: what it means to be a man, and what you have to do to be the kind of man you think you need to be -- whether that's a father, a member of a cultural group, or the ideal man in a certain social situation. Two highly-acclaimed recent Eastwood films -- \"Mystic River\" and \"Million-Dollar Baby\" -- mildly disappointed me by sinking into oversimplification and predictability. Possibly Eastwood's directing hand is more interesting when less \"self-assured,\" because 1997's \"Midnight in the Garden of Good and Evil\" follows these questions down less well-defined, and thus less predictable, paths. Maintaining a scrupulously neutral eye, the film recounts a complex tale of murder, involving characters who are recognizable types on the surface but carry deep difference underneath. It unfurls a slow, rich, and troubling narrative which answers the mysteries of its crime premise even as it opens much more difficult questions about the very things that murder stories are supposed to make simple: innocence, guilt, motivations, affection, and its characters' so-called morality.<br><br>Thanks in large part to a literally mesmerizing performance by Kevin Spacey (I'm riveted every time he appears on screen) and a well- balanced turn by John Cusack as the sympathetic investigating reporter, who charms us even as he maintains a total and focused receptivity to new information and strange events, the movie fills its two and a half hours with a slow-paced and carefully balanced story that brings us into the suffocating green world of Southern Gothic, with its all its mannered refinements, thick silences and passionate secrets. There's something in this film that would have pleased Tennessee Williams or Truman Capote, those cool-eyed investigators of the closeted South. John Berendt's nuanced book, Spacey's restrained, smoldering performance and Eastwood's lucidly hands-off direction have created a strange, slow gem of a film. It's not a gem appreciated by everyone, but two years before Spacey's turn in \"American Beauty\" struck a chord that resonated with the wider public, \"Midnight in the Garden\" asks similar questions in a context that is, at the same time, more precise, more exotic, and equally American.","user":"life_on_screen","rank":[54,67]}]