[{"title":"How to create something out of nothing? Ask Mark Andrus and Jim L. Brooks","rating":10,"date":"19 April 2000","review":"Really, how to make something original, fresh and odd out of absolutely nothing except a few characters? Using characters, only characters and nothing except characters. That's the simple formula Brooks uses in all of his work, but, for me, he has never created so much charm, warmth and sensibility as he did in `As good as it gets'.<br><br>Characters write the screenplay in this movie, and everything that happens - happens because of what they are. They are nothing special  they are ordinary people we meet in the street every day and that have the same problems a lot of other people have. This movie presents the example of how much you can pull out of that. And if that is written as well as it is in this case, not even a happy ending can bother you. Because, in real life, shown here, what is the end?<br><br>Everything is good and warm in this movie, everything is fresh and vivacious, understandable and well performed. Jack Nicholson brings one of the best performances of his career, that terrific Helen Hunt finally got a chance to show how skilfully an actor can connect naturalism with the laws of the camera performance, and Greg Kinnear shows the most convincing emotions coming from a gay character I've ever seen.<br><br>The relationships between the characters are created in the way that you can't predict anything that's going to happen, eventhough you know in advance what could come out of their mouth and what kind of attitude they'll have in a certain situation.<br><br>You can simply feel the progressive collaboration that occurred between Brooks and the actors and the mutual understanding they developed, and it's not often that you see that kind of artistic superstructure shining on the screen so much as it does here.<br><br>I find `As good as it gets' complexed, vital, intelligent, emotionally deep and studied, fresh, original, amusing, cheerful, funny, and one of the best films of 1997.","user":"matanovi","rank":[198,238]},{"title":"As Good as Romantic Comedies Get","rating":10,"date":"18 October 2004","review":"\"As Good As It Gets\" boasts a splendid, delightful combination of wonderful, zesty acting and a remarkably bright and effective screenplay. Jack Nicholson is pitch-perfect as the obsessive-compulsive curmudgeon Melvin Udall, who possesses some of the strangest and most curious tendencies ever concocted by screenwriters; his Udall is so human, so heartfelt, so genuine, and so whimsical and Nicholson perfects him to such a degree that not a moment of his screen time is unwanted or uninteresting: in my valid opinion, this is Nicholson's best performance of his career, and one of the most reverent performances in film history. What an engaging, enthralling story: an troubled, insecure man helps a troubled, insecure waitress (troubled and insecure in different respects), and the two form an unlikely relationship from being distant acquaintances (Hunt even exclaims that Nicholson is crazy in their most uncomfortable moment in the film) to practical soul mates (Nicholson to Hunt: \"I feel that I'm the only person that knows that you are the greatest woman alive\"), through a series of misfortunes, self-explorations, and mutual bondings. Kinnear's character Simon has the distinct purpose in being both the bridge and the divider of Nicholson and Hunt's relationship, and he identifies with his character with compassion and understanding, as he has frequently been wronged throughout his existence. The most curious aspect to a story such as this, involving such unduly, diverse characters: a miserable recluse, a zesty, yet insecure waitress, and a sensitive and insightful, yet wronged homosexual, is that in their distinct differences, they share many of the same problems, and these problems eventually bring them all together, although hardly in a civilized manner. I appreciated practically every element in this wonderful, delightful masterpiece of exemplary romantic comedy, in its indelible acting (Oscars well deserved), its whimsical, touching screenplay (This was neons above \"Good Will Hunting\"'s quality) and its comforting morale, that despite all of the great odds in life which prevent us from being happy, we can perhaps find it within ourselves to take that one important step in reversing our fortunes, in \"stopping with taking pills\" and to allow our lives, and our desires to shine and be realized, as this story depicts life. The best romantic comedy, certainly the best film of 1997, and one of the greatest films of all time, \"As Good As It Gets\" succeeds in practically every entertaining and endearing cinematic respect. **** out of ****","user":"CurtMan@LVCM.com","rank":[139,175]},{"title":"Way to go, Jack!","rating":19,"date":"19 December 1998","review":"Jack Nicholson is simply phenomenal.  Yes, I will give credit where it is due and congratulate Greg Kinnear, Helen Hunt, and Cuba Gooding, Jr, on their fine performances.  They are talented.  But I am mesmorized by Jack's intricate facial expressions and inflection each time I see this movie.<br><br>Critics panned this movie for being totally unbelievable.  I would have to agree-why would Carol fall for Melvin?  Why does Melvin change his ways after so many years of acid-tongued insults?  I don't know.  I know people who disliked the film because Melvin was such a you-know-what.  Personally, I love the evil retorts he hurls at any innocent bystander.  Maybe it's a sick pleasure, but Nicholson's delivery is perfect and I couldn't help but laugh as he takes on everyone.","user":"Star-47","rank":[75,96]}]