[{"title":"From the twilight of a legend gone too soon....","rating":22,"date":"22 February 2002","review":"Many of the titles featured in this Internet Movie Database represent films that for various reasons are welcomed with scorn regardless of the good intentions of their creators. One such film is David Kirschner's \"The Pagemaster,\" created by him as a means to share with his two daughters, Alexis and Jessica (both of whom, by the way, have cameos in the film), the wonder of reading. The story was born out of a clandestine visit by David, Lexie and Jess Kirschner to the New York Public Library's Center for the Humanities (the Headquarters Branch). Both Kirschner girls were little back then, and Dad ran Hanna-Barbera at the time. But what those two chldren took out of that visit was a spectacular sense of wonder --- and, consequently, that's how their father developed the idea for \"The Pagemaster.\"<br><br>Some 3 1/2 years later, the result of David's concept stands as a spectacularly imaginative adventure where the joy of reading is made manifest within the simple space of 75 minutes. What a lot of people grumble about, as far as this film is concerned, is the fact that this was Macaulay Culkin's penultimate appearance as a child actor. There were many in and out of Hollywood who wanted to see his career implode; and part of that, as we all know by now, was due to the bitter divorce and custdy battles between his parents. That, more than anything, was the lynchpin of the disgust most of us had for this kid.<br><br>And what of the film itself? Well, the story of Richard Tyler still enchants me, if it doesn't anyone else. Who wouldn't want to have adventures with three delightful book characters representing their namesake genres --- Adventure (Patrick Stewart), Fantasy (Whoopi Goldberg) and Horror (Frank Welker)? Not only that, encountering both Jekyll and Hyde (Leonard Nimoy), Captain Ahab (George Hearn), Long John Silver (Jim Cummings) .... and a fire-breathing dragon --- and taking them on any way you can is perfect fodder for an 11-year-old constantly fearing the world around him.<br><br>\nOne particularly funny line in the film comes in the live-action prologue, co-starring Ed Begley, Jr. and Mel Harris as Richard's parents. Alan, the father (Begley), recalls to his wife Claire (Harris) the day he signed his son up for Little League Baseball: \"...he drove everybody crazy with statistics about how you can get a blood clot just by being hit on the head with a ball. 'Did you know that shin-splints can lead to blood clots in the legs?' Claire, he brought in a medical journal! Nobody wanted to play after that! And now, I'm building him a treehouse in a tree he refuses to climb!\" Looking back, it's not how Begley utters that line, but rather, it is the way he delivers it that makes me laugh.<br><br>And then, there's James Horner's delightful score, punctuated by the central theme tune --- recorded as a single by Capitol recording artist Wendy Moten. Entitled \"Whatever You Imagine,\" the song, with lyrics by the indefatigable Barry Mann and Cynthia Weil, was even nominated for a Grammy, which, alas, it didn't win. But the tune was eventually embraced by yours truly; and has since been adopted as Blackwolf the Dragonmaster's personal song.<br><br>These are just some of the special memories I have about \"The Pagemaster.\" But of course, it is the Pagemaster himself, voiced and spoken by Christopher Lloyd, who drives home the story's central point. It is he, more than anyone else, who gives Richard Tyler the strength he needs to confront his own fears, regardless of the world around him. The result, of course, is that, by the time our tale ends, Richard becomes a stronger and better person --- all thanks to the magic of books. I sincerely believe that, given the current popularity of the Harry Potter and Lord of the Rings books, the wisdom of the Pagemaster is paying off, long after the film has been forgotten. After all, without books, we couldn't take on the imagination in our own way fearlessly. And that, I think, is as much reward as a young person needs in this world. 'Nuff said.","user":"pirate1_power","rank":[62,68]},{"title":"I honestly don't understand the 4.8 rating, for I thought this movie was terrific!","rating":10,"date":"31 August 2009","review":"The Pagemaster in my opinion, was a wonderful film, and I do think the 4.8 rating is too low. I have seen much worse movies, that are rated higher than that. Sure it's not Disney, but it is a good family film that I guarantee if you give it a chance that the whole family will love. The animation is not so bad, perhaps a little dated and rushed, but I've seen worse, and the dragon was excellent. The music by James Horner was beautiful, very fitting with what was going on on screen, very reminiscent of Land Before Time and Once Upon a Forest, and Whatever You imagine was amazing. The story tells of a young boy named Richard, who is serious and fearful of everything, until an unexpected visit to the library changes his life forever. I loved the story and the clever and diverse references to the literary giants, like Treasure Island, Jekyll and Hyde and Moby Dick, and the message of the film about facing your fears that doesn't preach. Macaulay Culkin is excellent here as is Christopher Lloyd, and Patrick Stewart (rousing and witty), Whoopi Goldberg (sugar and starch) and Frank Welker (in a fine Igor impression) expertly bring the snappy screenplay to life. I loved the witty banter between Adventure and Fantasy, and the librarian's rant about the different literary genres. And I don't think it is Macaulay Culkin or Christopher Lloyd's worst film, Culkin's was Richie Rich, Lloyd's was My Favourite Martian. All in all, a terrific film, with a 10/10. Bethany Cox","user":"TheLittleSongbird","rank":[30,34]},{"title":"A nostalgic childhood favorite of mine holds up today after 20 years have passed","rating":10,"date":"29 December 2014","review":"Hello. This is gavin.thelordofthefuture and this would be a review of a film that I've seen twenty years ago when I was a kid. The story about an 11 year old boy with statistics named Richard Tyler who stumbles upon a library during a thunderstorm and enters it. After meeting an old librarian, he goes to the fiction section and sees a mural with four pictures, but little did he realized that he gets transported to a world where every fiction story comes to life and sees a wise old sorcerer called the \"Pagemaster\". Then, his adventure begins and meets three fiction books named Adventure, Fantasy, and Horror and together, they must encounter haunted houses, pirates, and monsters in order to help get Richard back home.<br><br>Why am I reviewing this in the middle of a Christmas break? Well, let's just say that I've been watching this since I was a child and seeing how it has been 20 years, that's why I made that risky decision. Now, is there anything that I don't like about The Pagemaster? Well, let's just say that the only nitpick I do have is the animation. Don't get me wrong. It's beautiful and is very creative in it's making of the world of literary including Dr. Jekyll/Mr. Hyde, the pirates led by Captain Long John Silver, and the Dragon in the climax of the film, but as time went by, it became a little dated to me.<br><br>Anyway, everything else still holds up. The story is very engaging with very clever writing and the morals about facing your fears and using your imagination doesn't preach on you as it is done perfectly. Also, it has some very good characters and they still hold up to this day. Macaulay Culkin is likable as Richard Tyler, Christopher Lloyd relishes his role as the librarian Mr. Dewey and The Pagemaster, and the three talking books, Adventure, a swashbuckling pirate book with Patrick Stewart's solid pirate accent, Fantasy, a sassy, but caring fairy tale book who pulls off some nice humorous moments while being wise thanks to Whoopi Goldberg, and Horror, a fearful Hunchbook and also has some funny bits with the famous Frank Welker, known for voicing animal creatures in other animated films. The other characters are also good with cameos from Leonard Nimoy as Dr. Jekyll/Mr. Hyde, Phil Hartman as one of the pirate crew members Tom Morgan and Jim Cummings as Long John Silver.<br><br>The pacing is very brisk and doesn't come to the point where it would bore me to death, but the best part about The Pagemaster is the music score from James Horner, one of my favorite music composers. To some, it does copy music elements from his other scores from Star Trek II and others, but to me, it has a nostalgic value to it. Why, you may ask? <br><br>Well, the reason why I brought this up is because it does a solid job interpreting the theme song \"Whatever You Imagine\" that plays throughout the movie and has been stuck with me since my childhood ended. That piece of music alone is what made me watch this film over and over again.<br><br>Overall, The Pagemaster became one of my childhood films and today, it still holds up. It has an engaging story, some likable characters, some clever writing, and some really beautiful music. As those aspects stayed with me in my memory, this deserves a gold trophy of recommendation as a film that is worth watching to some who hasn't seen it yet. Check it out and relive your imagination!","user":"gavin-thelordofthefu-48-460297","rank":[10,10]}]