[{"title":"See it, then decide","rating":9,"date":"15 August 2002","review":"It's a depressing fact that the moviegoing public is being brainwashed by critics to hate everything involving Kevin Costner. When released in 1997 this breathtaking, thought-provoking epic was largely ignored and limped to a box office gross of $14 million, thanks to some vicious reviews.<br><br>Lest we forget, Costner made the magnificent Dances With Wolves, but that was in the days when we were told it was okay to like him. His directorial follow up is every bit as good.  He knows about directing.  He coaxes great performances from his casts. He has real vision and takes chances. Like Michael Cimino, his efforts are belittled and mocked while directors with clearly less talent are applauded.<br><br>So to all those people who stayed away in droves and screw their faces up at the mention of this film, I say watch it before you criticise it. Don't rely on some magazine writer to tell you who's good and who's not. Your brain is there for a reason.","user":"tony etchells","rank":[444,533]},{"title":"Well... I am glad to see that I am not the only person who liked this film","rating":8,"date":"19 February 2000","review":"I truly do NOT understand why The Postman was attacked as viscously as it was by the film media (there films much more worthy of the Golden Raspberry Awards in 1997).  I loved this film and was very impressed with the loving amount of dedication that it demonstrates on the part of the actors, writers and director.  This was a GOOD movie: it had a strong and intelligent story; excellent and interesting characters; and real feel for the post-Apocalypse genre.  I felt that Kevin Costner's everyman act worked beautifully in this film and created a sense of reality for the character and of his situation. <br><br>\nAs far as the sci-fi novel by David Brin, this film exceeded it in every way possible.  Where Brin had to rely on cheezy sci-fi standards (like supersoldiers) to resolve his story, this film does using only two men, both frauds, and both with radically different understandings of what constitutes a proper society.  That is what made this film great (and I rarely use the term great), that this film was essentially an examination of America and what America means.  It was a parable of sorts about the types of men Americans are and what they are capable of (notice that the head bad-guy had a traditional, classical education, while Costner did not; he appreciated these things but they were not at the center of his belief system... I wonder why).  <br><br>While I do not agree with every aspect of this film (I am a Medievalist and a Platonist, so I don't necessarily feel the same way about the Western Canon that the film-maker may have), I still find it to be a beautiful reflection on the psyche of the American everyman.  America has a tradition of rejecting the absolutist ideals of the past in favor of the pragmatic relativism of today, and I think that this film is a parable of the divorce of America from the traditions of Europe.  <br><br>Overall, this is a complex and entertaining film and I highly recommend it to anyone interested in examinations of American culture and tradition, perhaps as a double feature with Citizen Cane (I am not, however, claiming that the Postman was as good a film as Citizen Cane, only that they have a similar theme... what does it mean to be an American?).","user":"A-Ron-2","rank":[265,321]},{"title":"Don't listen to it's critics, see the movie for yourself and come to your own conclusions.","rating":7,"date":"20 September 2003","review":"A Far better movie then it's critics make it out to be. \"The Postman\" is a good solid film about the end of the world and the chaos and confusion that follows with the unwitting soul that destiny choose to bring those who survived the apocalypse back to a better life and promising future. <br><br>Corny yes but in a positive and constructive sort of way. With the cast of Kevin Costner on down giving the film the sort of believability that you just don't see in most of the \"End of he World\" movies that have been projected on the silver screen since \"Things to Come\" back in 1936.<br><br>\"The Postman\" unlike most \"End of the world\" movies carries through the entire movie, which is almost three hours long, a positive and uplifting theme that you rarely get to see in these type of films. The ending of the film, call it corny it you will, was really moving without being obnoxious like it could have been had it been made by a lesser talent then Kevin Costner.","user":"sol-kay","rank":[213,267]}]