[{"title":"Face/Off","rating":9,"date":"5 March 2020","review":"This is an epic action movie with everything and more: plane explosions, a jail break, boat chases, the latest scientific advances, and of course, the white doves flying off before a gun fight. It also has the premise of putting on someone else's face, which is an insane plot twist, which somehow turns out amazing. Also, if you don't already appreciate the gem to American cinema that Nicholas Cage is, prepare to be blown away.","user":"MR_Heraclius","rank":[39,44]},{"title":"One of the greatest action films ever made","rating":8,"date":"29 July 2004","review":"John Woo knows, if anybody, how to make good, stylish action. And that's exactly what this film is; good, cool, stylish action. The plot is great; fairly psychological and quite interesting. It has a fast(and remarkably even) pace, I don't think more than 30 minutes passes at any point in the movie without a giant action scene. All in all, I'd guess there are about four or five major shootouts, and two chase scenes which are each several minutes long(without getting repetitive, fortunately). The acting is excellent; every single major part is well-played. John Travolta, Nicolas Cage, Joan Allen, Alessandro Nivola, Gina Gershon, Dominique Swain... all give great, entirely believable performances. The best are definitely Travolta and Cage, though; fantastic, truly stellar performances. The characters are all well-written and credible, right down to the most minor one. The action is cool and very stylish, in every single action-scene. The theme of the film is great; of course, the story is completely unlikely, with the face-switching and all, but once you get past that, once you suspend disbelief, you'll most likely enjoy the film thoroughly. The script is excellent, plenty of action, drama, and thriller parts. Also, you gotta love the sharp contrast 3/4's into the movie, with the kid listening to sugary pop-music, while people are shooting intensely at each other. Great film. I recommend it to any fan of John Woo, Nicholas Cage, John Travolta and action films. 8/10","user":"TBJCSKCNRRQTreviews","rank":[162,233]},{"title":"An Action Classic That Will Never Lose Its Appeal","rating":9,"date":"23 July 2005","review":"I consider John Woo to be one of the greatest action movie directors in the world,and \"Face/Off\" proves just that.However,the element that makes this film one of the most intense and spectacular action movies to ever come from Hollywood is the presence of two tremendously talented actors,both of whom are my favorites.Yes,when you have John Travolta and Nicholas Cage together in a movie ,the results are bound to be over the top. John Travolta plays Sean Archer,a dedicated FBI agent who survived a murder attempt by notorious criminal Castor Troy six years ago. However,tragically his son died instead of him and since than Archer is relentlessly chasing Troy.Nicholas Cage plays Troy,and the film begins with a spectacular chase where we see the sheer intensity generated by both these great actors,and you realize that this is not going to be just another action flick. Troy escapes,but his younger brother Pollux Troy(played by Alessandro Nivola) falls into Archer's hands,along with a floppy that contains the blueprint for a bomb to be detonated in downtown L.A. Pollux refuses to reveal the location of the bomb and then a desperate Archer is given an option that is so spine-chilling that Archer refuses immediately.Realizing soon that he has no other choice,he decides to do what he is asked to-to exchange his face for Troy's, and what's more,to alter his entire physical attributes,so that he can go to the prison where his brother is being kept,and fool him into believing that he is Troy and get the location of the bomb from him.The plan seems to work until the moment Castor realizes what has happened,puts on Archer's face,and sets out for revenge.He fools the FBI,fools Archer's wife and sleeps with her and just when one thinks that this is too much,the real Archer escapes prison and it's payback time. Both Travolta and Cage play their roles perfectly,and they do a fantastic job playing each other too. The rest of the cast simply fades away in comparison,and who cares ? Dominique Swain as Archer's rebellious daughter looks good on screen-but that's about it.Joan Allen as his wife is not too impressive either.Gina Gershon as Troy's lover seems much more real in comparison.John Woo provides the film with a novel and flawless script,and some of the best action sequences ever filmed.This film is an absolute must for any action fan,and definitely the best Woo ever made.","user":"gatsby2244","rank":[108,159]}]