[{"title":"Firing Blanks & a little romance","rating":8,"date":"17 April 2000","review":"I love this film! Starring John Cusack, England's patriotically-named Minnie Driver, plus Dan Ackroyd, Alan Arkin &amp; Joan Cusack, Grosse Pointe Blank' is funny, clever, action-packed &amp; has a great eighties soundtrack.<br><br>John Cusack - as the film's protagonist Martin Blank - is superb, &amp; virtually carries the whole movie. He plays an assassin who started out working for the U.S. Government but has now gone freelance, having managed to rationalise his cold-blooded killing. He is an amoral, sharp, ruthless killer, but also vulnerably human, neurotic, conscience-ridden, tender &amp; romantic. Despite these ostensibly impossible personality contradictions, you never once question that his character is real, you can't help but like the guy, &amp; never stop hoping that things work out for him. Pulling this off is a remarkable achievement &amp; Cusack does it brilliantly.<br><br>\nHe reluctantly accepts a commission that takes him back to his hometown, Grosse Pointe, coincidentally at exactly the same time as his old High School reunion. While there he visits his childhood sweetheart, local DJ Debi (Driver), for the first time in 10 years  when in a fit of madness he had ditched her on their prom night to run off &amp; join the army. As neither she nor anyone else had heard anything from him since then, her feelings about this are understandably rather mixed!<br><br>Blank visits his institutionalised Mum &amp; the family home, which to his great distress is now an Ultimart', &amp; eventually convinces Debi to go with him to the reunion. His reacquaintances with his former schoolmates are very funny &amp; even quite touching, &amp; are sure to strike a chord with anyone who's ever been to one of those things.<br><br>Meanwhile various other assassins, chief of which is Blank's rival Grocer (Ackroyd  brilliant as ever) are out to kill him. Their reasons are many &amp; varied  mainly involving an Assassin's union', secret Government operations &amp; a dead dog (yes, really!). As you can probably guess, these are not the sort of things that are conducive to a successful High School reunion, &amp; mayhem ensues.<br><br>Grosse Pointe Blank' is extremely funny, full of deadpan, twisted humour - mainly from Cusack, but ably supported by Ackroyd &amp; Arkin. I particularly liked the running gag of Blank's response to the inevitable \"what do you do for a living?\" question: a completely matter-of-fact \"professional killer\", which of course not one person takes seriously. I also loved the hilariously neurotic exchanges between Blank &amp; his hounded shrink (Arkin), who ends every conversation with \"Don't kill anyone!\" There's also a lovely little story involving a pen...<br><br>The film is also a great action flick - it has some brilliantly choreographed &amp; executed gunfight &amp; hand-to-hand fight sequences  in fact some of the best I've ever seen. Cusack looks, or at least is made to look, like a pretty decent athlete himself. The finale is a real tour-de-force, &amp; for me sums up the movie itself: a great gunfight, clever &amp; hilariously funny.<br><br>This film is wonderful from start to finish  if you haven't done so already, see it now!","user":"Greg Lord","rank":[119,134]},{"title":"Consistently surprising and entertaining","rating":10,"date":"22 February 1999","review":"One of the complaints about movies these days, and justifiably so, is that they're predictable.  This movie is not predictable, and I never thought I'd be able to say that about a movie with four credited writers.  Every time you think you can guess where it's going, it throws a curve.  It was also very funny, which is nice because good comedies are becoming a rare species. John Cusack continues to show what a great actor he is as hitman Martin Blank.  He doesn't wink at the audience, saying, Oh look, I'm a hitman, but plays him as normal, with the right amount of misgivings and tenacity. Minnie Driver is quite good as the woman he's still obsessed with (although she was good in GOOD WILL HUNTING, she should have been nominated for this performance), and Alan Arkin and Jeremy Piven were good, as ever, in support.  The surprise, however, is Dan Aykroyd.  Just when I was prepared to write him off forever, he comes through with a great performance here. The soundtrack is terrific too, avoiding the cliched 80's songs to provide a fresh, and compatible, score.","user":"SKG-2","rank":[98,119]},{"title":"I'm drawing a complete...","rating":8,"date":"8 January 1999","review":"Good movie. Particularly the part where John Cusack is using the frying pan to put his point across to the bad guy on the kitchen floor. It's hard not to belly laugh. I thought it took cues from 'Blue Velvet', with its uncommon blend of humour and ultra-violence.<br><br>I read that parts of the dialogue were contributed by Cusack and a couple of [real-life] school friends, though cannot confirm this. It's believeable though - for example when he meets the legal guy propping up the bar at the re-union. His offering of the pen, the aside that Cusack should 'read the cap' and asking to use the funny quip - 'they all seem kinda related' - must have been based on a real person. Too sad to be fiction.<br><br>Minnie [cab] Driver, Joan Cusack and Dan Ackroyd personalise their performances very well. The support cast were excellent too. The music was an oddly enjoyable mix and the fight sequence with the pen was the most realistic (and exhausting) I'd seen. It was the attention to small detail which swung it in the end though. Cusack's buddy's coke-fuelled, paranoid banter was spot on (\"Jenny Slater, Jenny Slater\") as was the burning the fingers on the furnace, to name just two random details. The effect of this, is that they all add up to a movie which you can enjoy watching many times. And that makes it a rare gem.","user":"Noir-5","rank":[76,95]}]