[{"title":"Good Little Movie","rating":8,"date":"15 October 2004","review":"Ah, 1998 Bill Clinton was still in the White House, the Gulf War had no sequel, gas was under $2.00 a gallon, and a kinda-known actress was in her pre-J. Lo/Jenny from the Block/Bennifer/media whore phase.<br><br>Back when she used to have a little (now she has a lot), Jennifer Lopez was actually enjoyable in Steven Soderbergh's 'Out of Sight.' I saw this in the theater when it came out and remember thinking it was one of the better films I'd seen that year. I watched it again last night on DVD, and I have to say that it still holds up. Clooney is finally given a worthy vehicle, and he and Lopez have actual, undeniable chemistry on the screen. The supporting players (especially the incomparable Don Cheadle) are perfectly cast. Soderbergh effortlessly knocks this one out of the park.<br><br>One critic gave the film two and a half out of four stars and claimed 'Out of Sight' was in need of a 'shot of adrenaline,' but I have no idea where he's coming from. When you think of all the bad movies that are released in any given year, you'd think you'd appreciate something like this.","user":"dcshanno","rank":[125,149]},{"title":"See? J.Lo CAN act!","rating":1,"date":"1 June 2002","review":"Chemistry so hot that they ignite the screen. Too bad it didn't ignite the Box Office, but Out Of Sight is one movie both George Clooney and Jennifer Lopez can feel damn proud of. Maybe it's the fact that George's criminal character is *actually* funny and multi-dimensional. Maybe it's the fact that the storyline actually has a story to it - and an interesting one at that. Hell - maybe it's just that J.Lo walks around in skimpy outfits - curves flaunted - and likes to kick butt. After much consideration, I must concur: it's equal parts to all 3.<br><br>Strong performances by Clooney (Jack) and Lopez (Karen), as well as George's Ocean's 11 co-star Don Cheadle. Witty script and likeable characters with a satisfying and plot-twisting ending. What more can you want? Did I hear you say Jennifer Lopez naked? Yeah well, you won't get that here... but it's good all the same!","user":"David, Film Freak","rank":[35,41]},{"title":"Yes, that's right...this movie is \"Out of Sight\".","rating":9,"date":"15 December 2004","review":"When released in 1998, \"Out of Sight\" was Steven Soderburgh's most mainstream film to date, after he burst onto the indie scene a decade earlier with \"Sex, Lies, and Videotape\". Based upon the novel by Elmore Leonard (\"Get Shorty\", \"Jackie Brown\"), the movie tells the tale of odd couple Jack Foley (George Clooney), a career criminal, and federal marshall Karen Sisco (Jennifer Lopez). After a unique first encounter, their paths continue intersecting, with various degrees of intent, to comprise the bulk of the story.<br><br>Similar to the Soderburgh-helmed \"Ocean's Eleven\", \"Out of Sight\" blends the standard apples and oranges of genres into a delicious smoothie. This is a drama, minus the driving intensity, light-hearted enough to pass as a comedy. It's a comedy, but not of the HAHA sort. The humor lies in things like Clooney's glances, JLo's relationship dilemmas, the paradox of Ving Rhames' self-righteous thief, and the sheer absurdity of Don Cheadle's gangsta. It's also a romance and a cop-and-robber story, but neither love nor crime is the whole point. All of these pieces unite to form a fantastic puzzle of a picture.<br><br>The tasty complexity is further deepened by the non-linear storytelling technique. Flashing backward here and there throughout the film is a good choice because the viewer can only fully understand the previous events with the 20/20 vision of hindsight. Plus it eliminates what could have been a painful first half hour of exposition, instead spreading the backstory through the rest of the film.<br><br>The stylistic singular color palettes for different locations that Soderburgh later used magnificently in \"Traffic\" are present here as well. From bright sun-drenched Florida to the ice cold blues of Detroit, this technique serves as virtual atmosphere, allowing one to determine the geography even without the convenience of titles. In a non-linear film like this, that ease in recognizing time and place facilitates comprehension of what is happening when. Unique among Soderburgh's work (to my recollection) is the film's use of occasional freeze frames. Stopping the picture for just a second or two, Soderburgh gently identifies poignant moments, obvious or not, allowing an extra moment to deservedly linger on them.<br><br>With the high technical accomplishments, the acting almost doesn't matter, but the slightly understated method works wonders. Clooney is his usual suave self, complete with snappy dialogue and a cornucopia of confidence. In a role that \"Enough\" can only dream about, JLo almost looks like a real actress (joke). She is absent her too-common ditziness and easily holds her own, despite being a tad too glamorous. Rhames, Cheadle, and Albert Brooks are their usual solid selves, playing parts both similar and drastically different from their wheelhouses. Everyone seems to have perspective in their parts, not utilizing excessive gravity or levity, but rather hitting the appropriate notes as they inhabit their roles to perfection. Ultimately you believe all of these actors in their parts, even if JLo's skirts are entirely too short for a federal agent.<br><br>Like \"Ocean's Eleven\", \"Out of Sight\" is a very good film, merging quality in all aspects of film-making into a fully enjoyable two hour experience. The main themes of crime and love are basic, so the movie doesn't soar to remarkable heights. But if you're looking for a brilliantly made film that you might have missed on its theatrical run, espy Out of Sight and settle in for a quirkily involving night. If you saw it a few years back, check it out again to see Soderburgh's foundation for his own excellence.<br><br>Bottom Line: A wholly absorbing movie that serves as a film-making clinic of brilliance. 8 of 10.","user":"Pavel-8","rank":[90,113]}]