[{"title":"One of Steve's finest","rating":7,"date":"11 August 2007","review":"Okay, that may not sound much, but after seeing Segal's recent outings I can look back at films like this with a certain nostalgia. This was made back in the day when Segal was in shape, did his own fight scenes and the film makers in question didn't have to resort to using lame CGI and camera tricks during action scenes. It has an edge that is just lost in these hideous later outings (the kind where an overweight, 54 year old man jumps from a moving train with 2 pistols and wipes out a squad of heavily armed thugs).<br><br>This time Segal is under the guise of DEA agent John Hatcher. He \"retires\" from the job shortly after loosing one of his colleagues in a deal gone wrong. Hatcher goes to visit his sister and niece to try and 'find his old self', whilst visiting he also encounters an old friend and military partner Max(Keith David). Hatcher and Max soon run into a bunch of ruthless Jamaican drug dealers who have moved in on the area, and their voodoo practising leader SCREWFACE...<br><br>Que violence galore!!<br><br>Expect bone breaking violence from this film, as Hatcher and Co. shoot, beat and tackle their way through the posse in order to save Hatcher and his family's lives-who have been \"marked for death\" by the gang. I would say this is one of Segal's most violent movies, and that is saying something.","user":"Jakethemuss","rank":[15,16]},{"title":"\"Who do it... the white boy Hatcher?\" A decent action film from Seagal back when he made good films.","rating":7,"date":"30 October 2007","review":"Marked for Death starts as undercover DEA agent John Hatcher (producer Steven Seagal) decides he has had enough of his job after his partner Chico (Richard Delmonte) is murdered in a botched up drugs bust. Hatcher retires &amp; heads to the town of Lincoln heights in Chicago where he grew up &amp; where is sister Kate (Bette Ford) &amp; his niece Tracey (Danielle Harris) live. Hatcher also meets up with his old friend Max (Keith David), there is a big drug war taking place in Lincoln Heights as Columbian drug lord Tito Barco (Al Isreal) &amp; Jamaican drug lord Screwface (Basil Wallace) fight for control. While in a pub a shoot-out between the Columbians &amp; Jamaicans takes place &amp; Hatcher steps in, he instantly becomes a target of the Jamaican dealers &amp; not only do they make the mistake of shooting Hatcher's favourite bar up but they target his family &amp; shoot his niece which makes Hatcher very, very angry...<br><br>Originally shot under the title Screwface this early Steven Seagal action flick was directed by Dwight H. Little &amp; comes from a time when Seagal films were actually entertaining. The script by co-producers Michael Grais &amp; Mark Victor certainly won't win any prizes for originality, some ex cop/secret service agent/military soldier has to come out of retirement to avenge a family member/friend/injustice by killing everyone in sight. It's a fairly standard Hollywood action film plot which doesn't hold many surprises although the twist ending was quite unexpected even if the makers wasted the opportunity to do something truly different in favour of having it as another excuse for Seagal to kill people. The usual inappropriate message that violence needs to be fought with even more violence is present &amp; although you know it's wrong you can't help but enjoy it in a satisfyingly macho sort of way as Seagal, the supposed hero, kills all the bad guy's in a variety of violent ways. The violence is extreme, some of the dialogue is unintentionally hilarious like when Hatcher confronts a bad guy he eloquently &amp; poetically notes 'I know your a scumbag &amp; a puke, I don't mind that. You give me what I need &amp; I leave here a nice guy. You don't, I'm gonna f*ck you up' &amp; the cheese factor is entertainingly high. It passes 90 odd minutes with the minimum of pain &amp; overall this is a good fast paced gratuitously violent foul mouthed action flick that even has a bit of Voodoo as well, would we have them any other way? Of course not.<br><br>Director Little does a good job, some of the fights are very brutal which were a trademark of Seagal's films back in the 90's. There are some seriously painful looking injuries from broken arms, necks &amp; backs, people beaten with mallets, knifes stuck through throats, shootings, table leg beatings, decapitations, eye gouging, hand severing, naked woman shooting, samurai sword fighting to head smashing fun. The fights &amp; action scenes are well choreographed &amp; there's even a decent car chase too which ends as a car crashes into a jewellery store although where the police are at this point I have no idea. Also, how does Seagal manage to smuggle all those weapons &amp; ammunition into Jamaica? The montage showing Seagal making &amp; testing the weapons was before the shot of the air-plane taking off from Chicago &amp; landing in Jamaica so presumably took place in America, right? Security wasn't so tight back then but it wasn't that bad surely? Besides being very violent Marked for Death also has some fairly graphic gore in it including decapitations, an eye gouging &amp; someone having their hand cut off.<br><br>Technically the film is fine, it isn't going to win any awards for style but it's well made having been shot on location in Chicago &amp; in Jamaica. Marked for Death was Seagal's third film coming after Above the Law (1988) &amp; Hard to Kill (1990) &amp; before his 'masterpiece' Out for Justice (1991), back then he wasn't as fat as these days &amp; he actually looks impressive as he kicks the crap out of everyone in some well stage &amp; excessively violent fights. Unfortuneatly Seagal can't act, either now or back in 1990 when this was made &amp; I still think the pony tail looks gay. The rest of the cast are OK with Wallace as Screwface putting in a surprisingly effective over-the-top performance.<br><br>Marked for Death is a throughly entertaining overblown unnecessarily violent &amp; foul mouthed action film, the sort of film which Seagal was perfectly suited to star in. Sure it's predictable &amp; unoriginal but when a films this much fun who cares? A must for Seagal &amp; 90's action flick fans.","user":"poolandrews","rank":[9,9]},{"title":"A Segal film from the old school","rating":8,"date":"29 September 2006","review":"You can split Segal films into 2 categories, the early stuff (Hard To Kill, Nico) and the later stuff (Fire Down Below, Today You Die). The latter group doesn't usually even get to the cinema but the former has some real action gems. Marked for death is one of them.<br><br>This film has loads of martial arts, Yardies, drugs, black magic, Drive by shootings, people dressed like Aswad, and the big black guy from platoon who escapes from the shootout at the end by getting rotated back to America. One of the things that ruins Segal films is having too much shooting and not enough fighting, But the action is pitched just right here, with still enough shooting thrown in to spice it up. The guys playing the Yardies are fantastic and the dialogue is second to none, in fact for those IDM fans out there Luke Vibert sampled some in 'screwface'. Other than Segal and the platoon guy the only person I recognised was Danny Trejo, Hollywoods default Mexican criminal. This is an action classic folks, watch it or Screwface will give you a thousand deaths worse than mine.","user":"roon_baboon","rank":[13,14]}]