[{"title":"A solid underrated awesome Keanu Reeves Action Sci-Fi Flick!","rating":7,"date":"16 November 2015","review":"Disclaimer: If you are a viewer that mainly prefers art-house-type movies, then you might as well ignore this review. In addition, if you're not able to take a few sci-fi leaps of faith, ignore this review, as well. We'll both be better off.<br><br>Chain Reaction (1996) is very underrated and trashed by critics. I am a big fan of Keanu Reeves and Andrew Davis and I like this film a lot. Before I go into this review I want to talk why I log in and write a review. After watching the new Keanu Reeves movie Knock Knock (2015) I have realized not only how god awful that movie was, but even Keanu Reeves sucked at acting in that movie. In this movie Chain Reaction he at least acted solid and in Knock Knock he did not! He made a fool out of himself and he gave us the worst performance of his life! There was a lot of movies he started it and they weren't that good but they were not awful either. Some people are complaining how god awful Chain Reaction is. Watch Knock Knock (2015) the new Reeves movie and you will see the results. Which is far the worst comparing to Chain Reaction. I rather watch this movie and I am taking Chain Reaction over Knock Knock!!!!! <br><br>I like this film a lot but not because of only Keanu Reeves but because of Andrew Davis, I have enjoyed his awesome Action flicks and even this film is Rated PG-13 and underrated it still doesn't ruing my likeness for seeing this movie again. I have always enjoy it of watching this movie. Rachel Weisz co stars in this movie as opposite of Morgan Freeman and Keanu Reeves. 9.years later Keanu and Rachel teamed back together in Supernatural horror flick Constantine (2005). Overall I like this movie! I believe it is exactly what would happen if technology like this was released. I think this movie was smart and slick even for underrated film. The technology putting in here was really smart idea and it was fast paced. I still don't know what went wrong and why the critics panned this film?. It held together quite well and the action was perfect for the characters. The message is important and timely (was in 1996 as well). Morgan Freeman does a superb job.<br><br>Chain Reaction is a decent film to watch and, ironically, it's topic is even more current now than it was back in 1996. Conspiracy theorists will love it. Morgan Freeman and Keanu Reeves make an excellent pairing and when you add such veteran character actors like Fred Ward and Brian Cox, you simply cannot go wrong. Rachel Weisz, while she's a great addition to this movie, seems like an odd pairing with Keanu Reeves. All in all, if you're looking for a great action movie, popcorn movie and conspiracy movie all rolled into one, you simply cannot go wrong with Chain Reaction. This mid 90's action/thriller from the director of The Fugitive and Under Siege features a post Bill &amp; Ted alum Keanu Reeves and Morgan Freeman. Fairly new Rachel Weitz and some other good character actors. Chain Reaction fills the hour &amp; 40 min void with thrilling action and semi-suspenseful drama as this typical cat &amp; mouse game plays out. Government conspiracy or cover-up or perhaps both are involved within this flick. <br><br>A student machinist finds himself caught in a maze of murder, government cover-ups and hi-tech espionage while working on a ground-breaking scientific experiment. Eddie Kasalivich and Lily Sinclair are part of a team of scientists who have developed a revolutionary new source of energy. But no sooner have they finished celebrating their triumph, than their lab is destroyed and the head of their team killed. Named as the main suspects, Eddie and Lily quickly realize their only hope lies with Paul Shannon, a powerful and foundation head, who may or may not be on their side.<br><br>That is the basic plot of this movie. It does involves of two students been a fugitives for a crime they did not commit. I am giving this movie a 7/10 it is not a perfect movie the best or one of the greatest movies of all time, but it is still solid and fun to watch!<br><br>Chain Reaction is a 1996 American action film directed by Andrew Davis, starring Keanu Reeves, Morgan Freeman, Rachel Weisz, Fred Ward, Kevin Dunn and Brian Cox. <br><br>7/10 Score: B Studio: 20TH Century Fox Starring: Keanu Reeves, Morgan Freeman, Rachel Weisz, Fred Ward, Kevin Dunn, Brian Cox Director: Andrew Davis Screenplay: J. F. Lawton, Michael Bortman Story By Arne L. Schmidt, Rick Seaman, Josh Friedman Producers: Arne L. Schmidt, Andrew Davis Rated: PG-13 Running Time: 1 Hr. 47 Mins. Budget: $50.000.000 Box Office: $60,209,334","user":"ivo-cobra8","rank":[14,14]},{"title":"A very enjoyable 90s flick in the same vein as The Fugitive....","rating":7,"date":"6 October 2012","review":"Simply put, one of my favorite movies of the 90s, because I'm a big fan of the Fugitive. This plot follows it adds a bit of a new age spin on it. Enjoyable flick with very good actors and a cast that features Keanu Reeves, Morgan Freeman, Fred Ward, Brian Cox, Rachel Weisz and many others, highly recommended if you're a fan of the Fugitive or U.S. Marshalls!<br><br>The story is about a chemist &amp; his friend suspected of murdering their mentor and Reeves &amp; Weisz receive help from a friend of their fallen colleague and they try and find out who is trying to frame them for murder. Much like The Fugitive, which ironically is done by most of the same crew and features some of the actors from that film, it's a great flick to pass the time on.","user":"koffeenkreame41-1","rank":[22,24]},{"title":"Actually","rating":8,"date":"16 September 2004","review":"Actually, the above poster is incorrect. Reeves is a machinist in this movie who is helping the scientists build the parts not a scientist. And that matters in this movie because Reeves actually does pretty well for once as an actor. <br><br>The concept of the movie isn't a new one, an industrial-military conspiracy to control technology because the masses aren't \"ready\" to deal with it yet. Freeman actually played the most interesting character. He kind of flip-flops throughout the movie and you're not sure what to think of him until the final scene.<br><br>Regardless, it wasn't the best movie nor the worst movie ever made. Reeves acted pretty well and the writing was semi-believable. If you're looking for a fast paced movie that you don't have to think too much on - this movie isn't a bad rental to see.","user":"DreamPilot","rank":[57,69]}]