[{"title":"An Early Look At 'Pistol Pete'","rating":7,"date":"5 July 2006","review":"This is about as clean a story as you could find: a nice story about the famous basketball player \"Pistol\" Pete Maravich in his earlier days. An incredible talent, Maravich went on to star at LSU and then in the professional NBA.<br><br>This particular story centers around young Maravich as an eighth-grader playing basketball for his high school team. The first half of the film was fascinating as actor Adam Guier was very credible exhibiting Maravich's tremendous ball-handling skills for a kid his age. There also is some nice photography in here.<br><br>The second half of the movie became a little too Hollywood-cliché ridden. I wish they had gone into Pete's college and pro career and ended with his conversion to Christianity before his untimely death. It could have been a very powerful movie instead of just a nice after-school-type TV film. (Just reading another review here, I am glad to learn some of that material is included in the DVD. My only look at this was on tape about a dozen years ago.)","user":"ccthemovieman-1","rank":[15,16]},{"title":"Great Movie and inspirational","rating":8,"date":"4 July 2006","review":"The guy from Chicago doesn't know what he's talking about. He is probably looking for special effects and watches too many star wars flicks. The movie is a great family film and I was captivated from beginning to end. The young Pete has a lot of talent too. The movie should motivate kids to shoot for the impossible and dreams can be realized as well. The movie was heartwarming and I liked the characters very much. The DVD also contains actual clips when he was a player and also has Pete's testimony as a born again Christian. He shares his faith and this is what is important to him. There are many other clips or extra's that give you a feel for what the man has accomplished and to understand how great an athlete he was.","user":"cs0424","rank":[13,15]},{"title":"Deserves more recognition","rating":22,"date":"22 October 2004","review":"Great film, and Adam Guier really acted well, showing the great determination of Pete, along with the talent of the writers and directors, who really made you feel like you were part of Pete's story. It is not a well known film, but this does not mean it is bad, or obscure or anything like that. It really inspires me and it can be easily watched over and over again. I will never get tired of this film.<br><br>It is a fantastic piece of cinema that I think deserves more recognition than it gets. I would recommend it to anyone, even non-basketball fans. If you ever get a chance to see, rent or buy this film, don't pass it up, I promise you, you will not regret it.","user":"Fidgetjnr","rank":[12,15]}]