[{"title":"Walter Gibson Should Be Proud","rating":23,"date":"23 April 2001","review":"This movie was the best effort to bring this unique hero to the big screen. Granted, although I like her in general, Penelope Ann Miller was not as strong a Margo as I would have liked, otherwise, I thought this was an outstanding achievement.  The look and feel are perfect and I loved how they made sure many of The Shadow's regular crew made their appearances... Shrivey, Roy Tam, Burbank.<br><br>The main reason I wanted to comment on this movie, however, was because of the question raised by Patrick in London about why Baldwin's nose changed shape when he became The Shadow.  Lamont Cranston's hawk-nosed profile was one of the most famous trademarks of The Shadow.  Alec Baldwin, however, does not naturally have that kind of look (to be honest, Lee Van Cleef may be the only movie actor in history with the correct look to have been able to portray The Shadow without resorting to make-up or special effects). Personally, I thought it was a brilliant touch to make that profile an illusion which Cranston utilizes when he becomes The Shadow.  It makes it more believable that no one would be able to figure out he is The Shadow.  A profile as distinct as Cranston's traditional look would make it difficult to believe that no one could put two and two together... kind of like believing that no one could figure out that Clark Kent is Superman just because he wears glasses.  To me, it was just one more thing that elevated this movie above the usual superhero genre flick because it showed an appreciation and respect for the source material that Hollywood is not necessarily known for.","user":"Falkeep","rank":[73,77]},{"title":"A misunderstood gem","rating":10,"date":"17 July 2000","review":"This movie got poor-to-middling reviews when it was released in 1994 but I still hold out hope that it eventually gets its proper respect in TV and Cable reruns, because it's a terrificly entertaining film.  Maybe it just takes a certain frame of mind or background to enjoy this movie, but I absolutely love it and frequently go back to it when I want to see how a dark, edgy, and FUN movie is done right.<br><br>Alec Baldwin is excellent as Lamont Cranston/The Shadow.  Baldwin has never achieved the commercial sucess many predicted for him and this movie perhaps shows why; Baldwin doesn't play a straight protagonist.  The movie begins with Cranston as a hedonistic warlord in China and then jumps to his reformed Shadow persona is 1930's New York, and it is Baldwin's performance, which teeters between serious and funny, nice and cruel, that bridges the gap.  <br><br>Russell Mulcahy and crew did an excellent job creating a 1930's-noir feel to the picture.  One of my friends complained that the movie sets were \"too obviously fake\", I think he missed the point.  They re-created the feel of a 1930's movie set, not the 1930's itself!<br><br>The movie is a bit campy at times but thankfully maintains the dark edge of the Shadow character, who has no qualms about killing or maiming his opponents (hey, this guy was a bloodthirsty killer in his previous life, you think he's going to forget how to use that power when he changes sides?). John Lone does a nice job as the Shadow's opposite number, Shiwan Khan.  The supporting cast is excellent as well (Jonathon Winters, Ian McKellan, Tim Curry) with perhaps the exception of Penelope Ann Miller, whose character and performance were rather annoying, but I can live with it.<br><br>Overall I give this movie a BIG thumbs up and recommend it to anyone that enjoys fun movies.  I've gotten a mixed reaction from friends I've recommended it to but I think this is the kind of movie where if you like it all, you'll love it.","user":"Snatchy","rank":[127,140]},{"title":"Excellent adaptation, highly enjoyable","rating":2,"date":"2 December 2000","review":"I don't really understand the bad rep this movie has gotten.  Sure, its not \"high art\" (then again, Shakespeare, Dickens and Herodetus weren't meant to be, or perceived as, high art when they were written).  What The Shadow was, and remains, in my eyes, is one of the best super-hero adaptations ever (the best until X-Men came out, in my opinion).<br><br>I'm not terribly familiar with the old radio drama Shadow, so I can't speak as to the details, but the feeling, the essence of the movie fits with what I've experienced.  Much more importantly, it stand out well on its own.<br><br>Special effects play a major part, but are not of the over-played.  Action is well done, and acting is acceptable, though rarely outstanding (the Shadow's cabbie Shrebnitz is an engrossing exception).<br><br>What really makes this movie stand out is the layering.  Plots, characters, backgrounds, all are complex.  The movie's basic plot is well-paced, occasionally a bit slow, but it makes up for it with the incredible wealth of details it packs in.  Watching the movie, one gets the sense of an incredible amount of backstory for each character (little things, like the family life of some of the Shadow's agents, barely glimpsed, or even just the complex web of those agents across the city), or that around the corner there lies a world to explore.<br><br>This movie can be difficult to classify, which may lead to its unpopularity. Clearly its not a drama, not is it a comedy, nor even entirely an action. Scifi or fantasy are both possible descriptions, but they fail.  The Shadow is comicbook style, in the truest sense of the genre.  Complex characters, pull-pounding action, some jokes, some drama...it all mixes together.  If you can get a bead on the style, its a very enjoyable movie, far ahead of most other super-hero films (Superman, Batman, the Phantom, etc.)<br><br>I recommend watching it, but only with an open mind.","user":"lethalweasel","rank":[60,65]}]