[{"title":"Location of \"Another Stakeout\" in British Columbia","rating":3,"date":"3 November 2007","review":"Having just seen \"Another Stakeout\" for the first time since 1995, I decided to check out the online info about the locations that were used in the movie and, so far, haven't seen any credit given for the island off the BC coast where most of the filming was done. It was filmed on beautiful Bowen Island, a 15 minute ferry trip from Horseshoe Bay, just to the northwest of Vancouver. The initial scenes involving driving off the ferry were done in Snug Cove (they substituted the name 'Bainbridge Island'), and most of the exterior and interior shots were on the south side of the island in an area called Fairweather where, as you saw or will see in the film, the homes are gorgeous and perfectly suited for the plot (however meager you thought it to be). I've seen a number of comments about the filming having been done on an island in Puget Sound. A lot was shot in Seattle, but the majority was on Bowen Island - I should know - I was living there at the time. Just thought I'd set the record straight. (You can see the homes used for filming clearly on Google Earth, if you're interested.)","user":"joycehm2004","rank":[9,10]},{"title":"Excellent","rating":10,"date":"12 April 2008","review":"Where to start... I genuinely appreciated Rosie O'Donnels performance in this film. Totally believable. The action scenes were epic, and I think influenced a lot of movies that came after it... specifically buddy cop sequels. The jokes were hilarious and the comedic timing was perfect. It was the first time I've seen a storyline like this in a story about cops. So that was very refreshing for me. Richard Dreyfuss and Emelio Estevez... A duo that you wouldn't expect to see on film... But wow... Total chemistry!! Line after line was just gold for me. I highly recommend this movie. I've told all my friends about it and they agree.","user":"ryan-george-2","rank":[22,36]},{"title":"Another Stakeout deconstructs a genre and reinvigorates modern cinema!","rating":10,"date":"17 April 2008","review":"The first time I saw Another Stakeout was on opening night back in 1993. I had just gone through a nasty divorce and was living out of my Saturn. And I was floored by this movie. As the final credits rolled I applauded so loudly and hard that I bruised the bone in my left palm and several movie goers murmured \"He must be drunk...\" I finally stood up and yelled \"You're drunk and stupid if you didn't get this masterpiece.\" I didn't leave the theater and sat there through three more consecutive showings. And I haven't looked back ever since.<br><br>And with the exception of the one time I had a stroke while watching Another Stakeout and wasn't discovered for two days while I stared at a paused image of Dreyfuss and Estevez, I have enjoyed all 428 times I have seen this movie.<br><br>This film isn't just funny, action packed and filled with characters we can relate to, it's a world we find ourselves wishing we could live in rather than the dark and nasty one we currently reside in. And though we quote the movie and dress up as characters from it every Halloween the sad truth is that the world doesn't work like Another Stakeout. When you watch someone through a window of their home you don't end up falling in love and there isn't a buddy next to you to crack wise with. The police show up and people yell and cry... <br><br>Ordinarily I say \"to each his own\" when it comes to opinions about movies, but if you don't like AS 2 then you're not worth a cup of feces with a cigarette butt in it.","user":"ajbleed","rank":[22,39]}]