[{"title":"88\" of therapy!!","rating":8,"date":"18 November 2001","review":"\"the bad stuff is easier to believe. you ever notice that?\" - vivian<br><br>ok, so pretty woman is a romantic movie, its cliched, its corny, its sappy. but hey, beyond all that is a special movie with some very special performances. julia roberts as vivian ward is absolutely adorable, one of the most lovable characters of alltime. and those long legs help - like she says - \" 88\" of therapy for the bargain price of $3000\"<br><br>the movie has many memorable lines and if you fall in love with the movie you will go back to it again and again. this is easily the best romantic comedy movie of the 90s. though many movies have hence tried to recreate its charm, nothing has quite succeeded to replace this movie as the pinnacle of the genre.<br><br>and this ofcourse is high praise from someone who hates the genre. the story ofcourse is very predictable and cinderella like. however this is beautifully told and the on-screen chemistry between the very dashing richard gere and julia roberts is simply sensational. an absolute must for fans of romance, comedy, any kind of light hearted movies or for those who are big fans of julia or richard. watch this movie.<br><br>an enjoyable 8!","user":"m_madhu","rank":[93,119]},{"title":"I admit it, I'm a sucker for a \"pretty woman!\"","rating":5,"date":"5 August 2004","review":"No, I don't \"follow\" the reviews of \"autumnshowers\" (the preceding reviewer), but I read his/her (?) account of this movie and found it utterly pretentious and completely wrong. Before I begin with MY review of \"Pretty Woman,\" I have to warn you, I'm biased:  This movie is one of my Top Ten Movies of All Time.  Why, you ask?  1)  Julia Roberts in a star- making role.  2)  Richard Gere, who must've realized somewhere during filming that he was playing second fiddle to a young woman in a star-making role.  3)  Jason Alexander at his smarmiest best.  In his eventual obituary (a LONG time from now, we hope!), they'll probably recap that he once slapped Julia Roberts silly in this movie (I know, HISSSSS!!!). 4)  Laura San Giacomo in yet ANOTHER great supporting role.  5)  Hector Elizondo (a fixture in movies directed by Garry Marshall) at his all-time scene-stealing finest.  I love to watch this movie (I've seen it between 50 to 100 times - I know the dialogue by heart) just to see the looks on Elizondo's face when he shares a scene with Roberts.  They run the gamut from reproach to pity to acceptance to admiration and finally to warm respect.<br><br>                                          {SPOILER WARNING}<br><br>The scene at the end of the movie in which Elizondo (as hotel manager, \"Barney\" Thompson) kisses Roberts' hand, when she extends it for a handshake, and says, \"come back and see us, again, sometime,\" never fails to tug at my heart.  I mean, these two have  really gone through some character development, together.  In Elizondo's final scene in the movie, he agrees to return a necklace and matching earrings, given to him by Richard Gere, to the store he borrowed them from.  Elizondo opens the jewelry box and says, \"it must be difficult to part with something as beautiful as this.\"  Of course, he's not talking about the jewelry, he's talking about Julia Roberts who parted company with Gere (reluctantly) the day before.  This sets in motion the BIG reconciliation scene on the fire escape of Roberts' seedy apartment.  Yeah, I know, this movie is about as believable as the Red Sox winning the World Series, but - to me - it's a veritable delight from beginning to end.  No matter how low I feel, this movie ALWAYS brings a smile to my face.  So, WHAT'S so wrong with that?  As a matter of fact, Cinemax is showing this movie TWICE, tomorrow - at 6:15 a.m., and again at 4:00 p.m.  I'll be in the viewing audience, too.  Why?  \"It's the best!\"  I know what you're thinking:  WHY doesn't he just tape it?  Well, I did.  However, I like it better when I know OTHER people are watching it at the same time as me.  You know, like sitting in a movie theatre?  The best part is knowing that at least some of these people are watching for the first time. How I envy them!","user":"bheyer","rank":[16,18]},{"title":"The Last Gasp for 1980s Style Flair.","rating":25,"date":"25 August 2003","review":"Pure Hollywood fluff story that is so smart and sports such a dynamite cast that it becomes one of the more wonderful films of the period. \"Pretty Woman\" is pop culture at its finest as Julia Roberts (in an Oscar-nominated, icon-making role) is a prostitute on the mean streets of Los Angeles who gets a big financial break one night when she meets up with cold, but lonely business guru Richard Gere. They immediately create a bond and have a night of passion which soon becomes a week-long partnership with Gere and Roberts posing as love interests (and of course $3000 is involved as well). Could it be possible that Roberts, a lady with a heart of gold in spite of her background, is just the thing Gere has been needing in his life? A trumped-up adult-oriented version of \"Cinderella\" is probably the best way to describe \"Pretty Woman\". The old Hollywood story gets a glossy new look thanks to director Garry Marshall (doing arguably his finest film-making work). Gere and Roberts make for one of the more attractive pairs the cinema has ever seen. They just shine beacons of light on one another it seems. The fact that both are very good performers definitely enhance their appearances though. A smashing soundtrack and that vivid 1980s style (even though this was released in 1990) make \"Pretty Woman\" one of the big winners of the last few years. 4 stars out of 5.","user":"tfrizzell","rank":[64,83]}]