[{"title":"You just might like this feel-good film, or maybe not depending on...","rating":7,"date":"3 August 2001","review":"Over 54% of IMDB viewers rated this movie at least 7 out of 10, and 25% rated it 10 out of 10. So a lot of people do like this movie! If you do not expect a reality-based movie, with an intellectual script and complex plot, and if you just view this film with a light-hearted shallowness in order to have some fun, then all is fine. For the guys there is plenty of eye candy, especially in the R-rated version, but this is not simply a cheap C-grade sex movie because there is actually a nice message about love and romance and if you are open to this then you will feel good at the end of the film.<br><br>Ami Bluebell Dolenz is amazingly cute and beautiful, perfect for the role of a genie. Her middle name fits perfectly and is probably every man's dream woman. There are some stupid lines and bad acting (but not from the main characters) and overall it is a good flick, especially for the guys and for women who do not feel threatened by seeing so many gorgeous bodies.<br><br>The addition of Pat Morita (from 'Karate Kid' fame) and Vincent Schiavelli (the subway ghost in 'Ghost' and so many other films) puts this film up a few more notches. Unfortunately the video cover for this film portrays it as a cheap sex film, which you may find it to be if sexy bodies plus light comedy are an unpleasant combination for you. For the rest of us, we can have a few laughs with a few romantic dreams.","user":"nz man","rank":[11,12]},{"title":"cute little comedy","rating":6,"date":"16 October 2000","review":"A guy loses his apt, his job and his woman all in the same day..to top it off he sees his dream girl, a supermodel, and she blows him off..He takes a walk on the beach to get away and stumbles upon a genie, played by Ami Dolenz (daughter of Monkee Mickey Dolenz) named Jeanie (how unique!) She grants him everything he desires in order to win over the supermodel who ditched him..but the genie soon finds herself falling for her master...Will her love win out over his lust for the supermodel? This is a suprisingly good film for its plot and premise..its no comedic masterpiece but it has some funny moments and a coherent plot along with a good performance by the pretty Ami Dolenz. On a scale of one to ten..6","user":"goya-4","rank":[7,7]},{"title":"Not bad","rating":6,"date":"25 September 2004","review":"Not too bad of a film. The premise of a genie that grants you unlimited wishes is a tough topic, considering there are things like paradoxes and such, but if you over look that, and just accept the film as a fun \"beach\" movie, you won't be disappointed. The Genie is a very likable character, and casted very well. The lead, Dean Cameron, is a complete loser, but his innocence is what makes him so likable. It's a cute love story, with unexpected amounts of nudity, and a happy ending... what more would you want from a film starring Dean Cameron?","user":"Dudleytown","rank":[7,8]}]