[{"title":"best film version I've seen","rating":7,"date":"15 June 2001","review":"This is the best film version of the Lewis Carroll story that I've seen. Other versions usually employ comedians as actors and their performances are always way over-the-top. This version is really amusing because the dialogs are so deadpan serious. Sort of Pythonesque. I think that is how Lewis Carroll intended it to be done; that is how I read the books. I love the dialog between Alice (Kate Beckinsale) and the White Knight (Ian Holm). They are both so intense and sincere about discussing such very silly topics and that is what makes it so amusing. Kate's reactions to many of the inane things that happen is so subdued. It's perfect.","user":"Abadeo","rank":[36,39]},{"title":"A 'wonderful' little interpretation...","rating":9,"date":"8 December 2000","review":"I really enjoyed this adaptation.  It was far and above better than Disney's attempt to turn what is already a children's book into a 'kiddie' film.  It was, with very few exceptions, very true to the book, despite the difficulties associated with converting Carroll's unique style to a screenplay.<br><br>Something I've always felt critical to adapting both Alice stories is her precocious nature.  There is truly no way a child actor could handle the scope of Alice in any film.  I thought moving the story to an older Alice was wonderful.  And Kate Beckinsale's performance in that capacity was outstanding.  She brought to life the very childlike innocence and naivete of Alice while dealing so very well with interpreting Alice's very opinionated, stubborn and whimsical personality.  And visually, she fit the role perfectly. :-)<br><br>The quirky nature and self-interpretation in this film is a wonderful way to introduce children to a complex and bizarre children's story.  I can only hope that it will be available on DVD someday.","user":"gluebben","rank":[18,20]},{"title":"Great introduction to the book","rating":8,"date":"9 March 2001","review":"I taped this for my four year old daughter, who is obsessed with the Disney version and was watching it twice a day if I let her.  This was a charming, wonderful change.  The actress playing Alice is fantastic, she is really like the character, even though she is an adult.  I was shocked that she was also Darlene in \"Brokedown Palace\" ...she really can play a wide range. This movie is very aesthetically beautiful to watch.  It's fun watching humans play the animals and picking out who is whom.","user":"JulietV","rank":[20,23]}]