[{"title":"Snipes and Harrelson Redux.","rating":6,"date":"12 June 2005","review":"Popcorn is the word that most describes this action-comedy movie from Joseph Reuben, the man who directed other standard fare like SLEEPING WITH THE ENEMY, TRUE BELIEVER, THE STEPFATHER, DREAMSCAPE, and most recently, a notorious bomb called THE FORGOTTEN.<br><br>So let's see how I can dive into this pool without hitting a hard surface. This is a \"buddy-movie\" in which two uber-American guys of very different temperaments and backgrounds share a bond that goes beyond anything they might go through. One of the two is by default a loose cannon and drives the plot with his antics. There may be some tension when a corrupt high official threatens the loose cannon. Add a sexy new co-worker into the mix (which becomes the focus of their intense, male attraction) and basically you have a story that has been of late the norm in the Hollywood popcorn machine.<br><br>Now, trying to cash in (I believe, I could be wrong) on their previous outing WHITE MEN CAN'T JUMP, Woody Harrelson and Wesley Snipes play not buddies from the 'hood but foster 'brothas' (if we can believe this baby) who are closer than a cuticle is to a finger even though Snipes has to act as older brother to a rebellious and unpredictable Harrelson: and on that note, neither is miscast. Snipes does convey steel while Harrelson gives off his just-under-the-surface danger, especially when he grins at smarmy boss Robert Blake in one subway scene.<br><br>Pitching in for the Latina female is Jennifer Lopez who, without being as angry and nasal and in-your-face as Rosie Perez, actually manages to be engaging though this is early in her career, before she decided to punch out and play her (bland) self once she became the trademark known as J. Lo. She all but steals her own pat scenes, especially in one tense exchange she has with Chris Cooper playing a not-so-nice fellow who pushes people onto subway platforms, a reality among New York strap-hangers.<br><br>But trying to over-analyze this film in terms of shots and composition and visual technicality would be like trying to compare one grain of popcorn to the next: there would be no difference, no relevance in taste, texture, and all that is left to do is munch down. That the action scenes on the subway platforms (for anyone who is actually acquainted with riding the subways in New York City) are as implausible as ever and only convey the type of hyper-masculinized action that makes superheroes of its actors, but who really cares? It's fluff, entertaining, mindless, inane, and that's just what people going to see this type of film expect.","user":"nycritic","rank":[26,30]},{"title":"What's with all the bad reviews?","rating":17,"date":"17 March 2002","review":"Reading the reviews below this seems to be a love-it-or-hate-it kind of film. Regardless of whether you 'get' the story and the rapport between Harrelson and Snipes, you can't overlook that this is a well made film.<br><br>I've only seen it twice, once when it first came out on video, and again in the past week. I didn't think it was that remarkable when it first came out, but when I watched it the second time around, I found it highly entertaining and well executed. Granted, it's not the best film ever but I don't think it's deserving of a lot of the bad reviews given here.<br><br>As a film it succeeds, and if you've never seen it before, it's worth checking out.","user":"stevewest-1","rank":[44,61]},{"title":"That's what we live with!","rating":21,"date":"21 August 2002","review":"Personally speaking, I don't quite know what to make of this picture. I saw it again on late night cable the other night and I was laughing hysterically throughout. Wesley and Woody play two brothers (!) who work as transit cops. Woody's a gambling junkie with a huge debt on his back while Wesley plays the straight man who's getting a little tired of constantly having to bail his brother out. Desperate, Woody plans to hijack the Money Train that rides along to each station, collecting the night's collections. Folks, believe me when I tell you that it actually gets more ridiculous. Add to the mix a pyromaniac token booth bandit, a pre-lobotomy Jennifer Lopez, Robert Blake in a performance so hammy that you can almost smell the bacon coming from your tv, action sequences that are unabashedly ridiculous and you have yourself... Money Train. My favorite moment comes when Robert Blake, after having been informed of the possibility of civilian casualties if the hijacked Money Train continues to speed ahead on the local line, responds with the now-classic line, \"That's what we live with.\" I was laughing so hard that tears were squirting out of my eyes. This movie is utterly ridiculous yet strangely riveting. Wesley Snipes plays his usual cocky, confident self and it seems to me that he won't accept a role these days unless he gets to kick someone in the face. Woody Harrelson looks like he smoked one too many blunts in this one. I actually prefer his character here over Wesley's and that's not saying much. Jennifer Lopez looks damn good but I can't help but think how stupid she is in real life. I really don't know where else to go with this review other than to recommend watching it. You might like it but not because it's quality stuff but because it'll cheer you up, it's so bad. Actual rating ** out of ***** but on the laugh-o-meter I'll give it a full **** out of *****.","user":"Mr Parker","rank":[22,34]}]