[{"title":"A Wonderful Family Movie!","rating":9,"date":"25 May 2003","review":"After Grover(Kyle Howard) and his younger sister Stacy(Amy Sakasitz) find out that their parents, Janet(Jamie Lee Curtis)and Ned Beindorf(Kevin Pollak) are getting separated and maybe divorced they decide to lock them in the basement so that they can figure things out. But during school, Grover tells his friend Matt(Mooky Arizona)what he did to his parents and the school bully T.J.(Russel Harper)hears them and decides to lock his parents in Grover's basement too, along with Matt's parents and Brooke's mother too. Brooke is played by Jennifer Love Hewitt and she plays a popular girl in school on who Grover has a big crush on. I thought this was a wonderful family movie. It was very funny and I think it can be enjoyed by both kids and adults. All the actors do a good job and it's just a very entertaining movie. A lot of people have complained and said that this movie was very unrealistic and things like that would never happen in real life but c'mon, what movie is really realistic and things that happen in movies usually don't happen in real life but you should enjoy movies such as these while you still can. Anyways, I would give House Arrest 9/10.","user":"Darkest_Rose","rank":[9,10]},{"title":"Cut little comedy","rating":16,"date":"16 October 2000","review":"I don't know why a lot of critics attacked this movie. What is there to attack? That's the problem with critics, they're always way too serious. Lighten up! No one said this would be Saving Private Ryan. It's not even Honey I Shrunk The Kids, but it's still cute. <br><br>I mean think about it, at one point (well, more than one) in our lives we all just wish we could lock our parents in the basement. The acting is not superb but it's cute and the kind you would expect from a movie like this. The one person I will hand it to is Jennifer Tilly, who really stole the show as Jennifer Love Hewitt's teen-like mother. Not bad at all, though not near to becoming one of the best. This movie will soon be forgotten but if it ever comes on TV watch it.","user":"White Dolphin","rank":[18,23]},{"title":"good actors make it worthwhile","rating":25,"date":"25 November 2002","review":"After learning that his parents are getting separated, a sensitive, idealistic teenage boy is so shocked and distraught that he recruits his younger sister to help lock them in the basement in the desperate hope that they'll actually talk out their problems and come to a rational solution. It starts out as a good idea, until his friends bring over their parents and lock them into the basement as well. Film's premise is far-fetched and protracted, to be sure, but it benefits from a talented cast (especially Howard), believable characters, and a good sense of family values. Not easy to take seriously, but meaningful and not bad for what it is. **½","user":"Special-K88","rank":[10,12]}]