[{"title":"Out to Sea-Go Down to the Sea in Ships to Catch this One ***1/2","rating":8,"date":"22 March 2009","review":"Walter Matthau and Jack Lemmon, both of whom are sadly missed, proved once again that they were a team dedicated to their craft of bringing hilarious moments to the screen. This film is just another example of this.<br><br>This time out they play two brothers-in-law who land on a ship as dance instructors on board.<br><br>Of course, their boss is a perfectionist and miserable person named Gil Godwin who just enjoys harassing these boys. It's hilarious how Lemmon gives a quick lesson in dancing to Matthau and how the latter dances a riotous rumba with the boat's owner Rue McLanahan.<br><br>Too bad that fellow dance instructors Hal Linden and Donald O'Connor are given so little to do but their parts call for that. Matthau falls for Dyan Cannon, on board with her fellow gold-digging mother, the usual outrageous Elaine Stritch. Unknown to them, Matthau has no money either. The widower Lemmon falls for Gloria De Haven, looking lovelier than ever.<br><br>The film belongs to Matthau and Lemmon and will serve as a further tribute to their illustrious careers.","user":"edwagreen","rank":[17,19]},{"title":"A good movie","rating":6,"date":"6 May 1999","review":"I found this movie to be quite good. Although some people call this movie the \"Grumpy Old Men And The Sea\" it is hilarious at the right moments and soft at others. Matthau and Lemmon are two great actors and if you like one or both of them, be sure not to miss this film.","user":"FilmCritic-3","rank":[7,7]},{"title":"Out to Sea (1997) ***","rating":7,"date":"2 July 2004","review":"A competent comedy that delivers the laughs for fans of Jack Lemmon and Walter Matthau. I suppose this film was made for those who enjoyed the two GRUMPY OLD MEN films, as there seemed to be a bunch of these buddy team-ups spotlighting the comical duo in their twilight years. The idea is a sure-fire one: Matthau, a bumbling gambler who's thousands of dollars in debt, connives his unsuspecting friend Lemmon into taking a free cruise with him where they can meet rich old ladies; the catch is, they've been signed on as Dance Hosts and Matthau can't dance. OUT TO SEA is a funny film, and not all of the chuckles are to be found courtesy of Lemmon and Matthau. I found Brent Spiner (best known as Data from STAR TREK: THE NEXT GENERATION) to be very humorous as the snobby ball-busting dance coordinator. As the prissy boss of the two aging actors, he manages to match them in the laughs department. Though the film doesn't really need any, there's also a a love story or two to be found here as well, involving Dyan Cannon (who looks pretty fine for her years). *** out of ****","user":"JoeKarlosi","rank":[16,19]}]