[{"title":"Another classic from Leslie Nielsen!","rating":7,"date":"27 June 2003","review":"I read another reviewer's comments about Wrongfully Accused, and I am continually amazed at how many people judge movies like this as though they are meant to be serious cinematic endeavors. Leslie Nielsen's films, literally, are jokes, and if you can't take them that way then maybe it would be better if you didn't watch them. I only say this here rather than just to that reviewer because I think it's worth pointing out that, in case you couldn't already tell, this movie is a parody and is meant to be laughed at. <br><br>I am perfectly willing to admit that it is peppered with scenes that fall completely flat (the sex scene with the sports commentary in the background is a prime example) and much of Nielsen's acting is absolutely awful (also note that much of this is also a parody of similar bad acting in the movies that are being spoofed in this movie, such as The Fugitive and obviously some of the James Bond films), but again, you really need to keep in mind what kind of movie this is. <br><br>Besides, there are also plenty of truly hilarious scenes. I can't help cracking up at the train peeking around the rock at Nielsen as he tries to escape, or the scene where he bends down to get his foot out of the railroad tracks and is hit in the forehead by the crossing gate. This scene was also screwed up, because that crossing gate was down across the track rather than a road going over the tracks, and it stopped rising just above Nielsen's head. But who cares? Comedy is a surprise, if you just saw what was expected it wouldn't be funny!<br><br>I can't say that Wrongfully Accused promises a cerebral workout or any moving social commentary, but if you look at the cover of this movie and expect something like that, maybe you should stick to the kid's section at the video store, because you are probably a little out of your league. The rest of you should be able to find some things to laugh at in this movie. Just enjoy it for what it is, because there are really only two things that frost my butt, a snow cone about that high, and IMDb reviewers that can't take a good joke!","user":"Anonymous_Maxine","rank":[60,68]},{"title":"A Fun Movie For Film Buffs","rating":9,"date":"28 February 2006","review":"Since \"The Fugitive\" is one of my all-time favorites, this takeoff on it was fun and enjoyable for me to watch. Hey, sometimes it's best to laugh at ourselves and the things we like. For much of it, this movie was laugh-out-loud funny.<br><br>It helped not only to know \"The Fugitive\" story well but also \"North By Northwest,\" \"Casablanca\" \"Titantic,\" and many, many other films, both classic and modern-day. The more familiar you are with movies, the more of these \"inside\" jokes are going to make you laugh.<br><br>Being a movie buff, a lot of these gags connected and made me really have a good time watching this Leslie Nielsen farce. Be warned, parents: this is not a family comedy. There are tons of sexual innuendos, so typical of today's comedies.","user":"ccthemovieman-1","rank":[43,49]},{"title":"Joy Ride","rating":10,"date":"21 August 1998","review":"Spoofing THE FUGITIVE, Leslie Nielsen takes us on a wild ride that combines the Three Stooges with the Marx Brothers and includes quick stops at CASABLANCA and THE MALTESE FALCON, then north by northwest to MISSION IMPOSSIBLE, BRAVEHEART, and TITANIC. As the ads say, this isn't a movie -- it's all movies. And it's well worth the trip. Nielsen is in top form.","user":"mermatt","rank":[46,55]}]