[{"title":"Toe Curling Passion!","rating":26,"date":"26 June 2001","review":"White palace has a great sexual dynamic, clearly Susan Sarandon's character (Nora Baker) is a sexually charged self confident woman who is at least 10 years or so older than James Spader's character (Max Baron). This movie shows how deep attraction and passion can change people's lives (perhaps for the better) and overcome class/personality and age differences.<br><br>The first and perhaps most noticeable aspect is one of the hottest and more believable seduction scenes in a movie, where Nora shows a raw animal passion for Max rarely shown in movies (and when it is is shown in an unfavorable light, e.g. Single White Female).  Susan Sarandon pulls off this challenging scene with great passion AND dignity.<br><br>The May/December romance with the older lady is shown in a healthy light (not like say The Graduate).<br><br>But more important than the age dynamic, is the deep attraction between Nora and Max, which goes strongly across traditional cultural differences.  Max is a compulsively organized widower, neat and decidedly upper-middle/upper class.  Nora is more impulsive, living a less ordered existence and is lower/lower middle class.  Max has conditional love for Nora, trying to change her (unintentionally acting judgemental?) by trying to help her out (e.g. buying her cleaning supplies as a \"gift\").  Nora teaches Max about life, and passion.  This movie has a much more interesting love story than say \"Pretty Woman\".","user":"foolishewe","rank":[47,50]},{"title":"A unique relationship is put to the test","rating":10,"date":"5 August 1999","review":"Wonderful romance and character study between two people who live on the opposite sides of the tracks.Two strong but stereotypical people pair up and evolve into very un-stereotypical unit and try to function in a hostile enviroment. The acting in the movie is so good it surpasses the diologue. The loss and love Spader communicates with just his eyes is a sight to behold and Sarandon projects a dichotomy of neediness and strength.<br><br>This movie contains one of the best endings in movie history, right up there with Green Card.  A truly uplifting movie that conveys joy, hope, and victory. What more can a woman ask for? And James Spader is a hunk!!","user":"Lady-Lee","rank":[25,26]},{"title":"Unlikely but hopeful romance","rating":4,"date":"4 September 2002","review":"It was interesting to me that it was more of a problem that she was such a slob than that she was significantly older than him.  If anyone can carry off a believable and appealing older woman/younger man romance to a mass audience, it's Susan Sarandon.  No other actress combines her ripe, open sexuality with such an accessible and self-assured personality.  She makes sexiness respectable.  James Spader does less well, not so much because of a faulty performance, but because he seems unable to break through a preternatural reserve.  It served him well in \"Sex, Lies and Videotape\" but a little more emotionality is called for here.  The sex scene when he is writhing in the throes of passion and finds a half-eaten sandwich under the bed is hilarious, not to mention the pivotal scene when he gives her a dustbuster as a gift.  The future for this couple might seem unlikely, but I don't think it's any less likely than that of most movie lovers.","user":"budikavlan","rank":[21,23]}]