[{"title":"Derivative, but fantastic, see it","rating":10,"date":"9 March 2001","review":"I really get p***ed off at movie critics sometimes. This is one of those times. I have insomnia, see what's on TV, check the rating (1 star out of 4) and almost pass it by, but decide to watch it for the camp value.<br><br>Why did critics hate this? Why do they in general hate movies like this? The film immediately reminded me of \"The Harder They Come\", \"Pusher\" (Nicolas Winding Refn's fantastic Danish film), \"Laws of Gravity\", \"Kids\", \"Clerks\", \"Mean Streets\", \"Zebrahead\", \"The Killing of A Chinese Bookie\", \"Boogie Nights\", \"Rome, Open City\" and \"The Bicycle Thief\".  Why does it seem that film critics love neo-realism if its 'white', but usually hate it otherwise.<br><br>If you're a fan of these kinds of movies, give this one a chance. Unfortunately, with the unfavorable judgment from up on high that this film received, I doubt anyone will read these words. Darn critics. I don't usually insinuate things like this, but I have to wonder if a racial aspect is at play here, that maybe xenophobia deflected a lot of critics from giving this one a chance.  Oh well, I loved it in any case.","user":"JPhish","rank":[55,65]},{"title":"Classic Hip Hop/Rap culture movie! Excellent!","rating":8,"date":"28 July 2002","review":"Despite any other negative reviews I truly enjoy this movie!  The plot line parallels Scarface very closely but is done in such a different way that the movie has a feel of its own.  The acting is excellent, and not just for rappers.  All the performances in the movie can hold their own without any pretext.  The plot in fast paced and intricate with twists, turns, ups and downs.  The language is graphic but not unrealistic for the type of characters portraited.  All in all this movie is entertaining from start to finish and all of my friends that have watched it with me have enjoyed it (even those that don't like rap at all).<br><br>8 out of 10","user":"iolaus08","rank":[22,25]},{"title":"A noir musical for the new millennium.","rating":9,"date":"10 October 2001","review":"I expected \"Belly\" to be a self-indulgent, expanded version of the gangster rap videos that gave Hype Williams the power in Hollywood to make a feature film. I was right, but what I didn't expect was for it to be so good. I was mesmerized by \"Belly\" from the opening sequence of choreographed violence and music. Critics of this film should look to its film roots - film noir - movies that grow from the underground crimeworlds in America, that pleasure us with their money schemes, guns, and drug use. \"Belly\" has this, and more style than I have seen in any movie in recent years. It has dazzling visuals, and a respectable plot that borrows from \"Scarface\" among others. The acting is respectable, and I didn't see the movie as a piece of media to exploit the careers of its stars, I found it to be a good piece of cinema that legitimizes Nas, DMX, Method Man, Taral Hicks, and Tionne Watkins as actors. The music is great, notably the D'Angelo's \"Devil's Pie\" that shows crime being played out. The cinematography is stylized and beautiful. The dancing in Jamaica, the shootout in the strip club in Omaha, the opening sequence, the climax with the reverend where the issues that the film may be exploiting are addressed and in my eyes therefore considerate. Its a shame this film was so overlooked by critics. I think within it lies the future of both the gangster movie and the musical.","user":"GoatPoda","rank":[38,46]}]