[{"title":"Really good and full of powerful performances - underrated if a bit flawed overall","rating":6,"date":"6 December 2004","review":"This movie made a fuss when it came out because there were claims that its author had lied about it being \"based on a true story.\" As a result it become a sort of infamous title and people cared less about the film's content and more about its \"accuracies.\"<br><br>Well, frankly I don't really care about whether or not the story is true because I know things similar to this _do_ happen - children are abused and using this as a backbone for a revenge film may seem a bit inappropriate but it is handled with care by director Barry Levinson and the highly talented ensemble cast treat it with caution.<br><br>Robert De Niro gives a convincing performance as the Catholic priest who is a father-figure to a bunch of disillusioned Brooklyn youth. After they accidentally injure a man during a rebellious incident they are sent away to a juvenile facility where they are sexually and physically abused by the evil warden (Kevin Bacon). Years later two of the boys (now grown men) take revenge on Bacon and kill him in a public area. They are sent to trial but not all is what it seems - representing the case is someone involved with the past and there are some other interesting twists along the way.<br><br>The abuse isn't really the subject of this movie - instead the \"what if a trial could be rigged?\" question is more prescient. (Think \"Runaway Jury\" meets \"Deliverance.\") The cast is fantastic - De Niro, Dustin Hoffman, Brad Pitt, Jason Patric, Minnie Driver, Bacon, et al. It's a movie buff's dream come true! If only Al Pacino had popped up....<br><br>De Niro has been given a bad reputation lately as a \"sell-out\" - but he provides a really deep and multi-layered performance here. It's too bad people forget about this movie along with some others he made around the turn of the decade because a lot of them were very good. This is one of them.<br><br>Levinson (\"Rain Man,\" \"Diner\") is sometimes a bit too heavy on schmaltz in his films and that's the reason many people (myself NOT included) disliked \"Rain Man.\" However here - for the most part - he abandons this and presents the material with a good touch. It's atmospheric and dark - it feels a bit like De Niro's \"A Bronx Tale\" and \"Diner\" colliding together.<br><br>Overall this is a really good film that is not without its flaws but is still engaging and surprising and underrated - a must-see for any self-respecting film buff.<br><br>4.5/5","user":"MovieAddict2016","rank":[127,154]},{"title":"Excellent","rating":9,"date":"24 August 2003","review":"I really liked this movie. Great acting, great direction, great plot!<br><br>As another reviewer pointed out, the movie indeed has 3 parts. before,at and after the correction center. All three parts are equaly gripping. Except that the part in the correction center is very dark and disturbing.<br><br>Brad Pitt shines in a small role he  has. So does Jason Patrick. Hoffman has his ususal confused charisma. Rest of the supporting cast is excellent too. Especially the denizens of hell's kitchen. Kevin Bacon looks realy menacing. But the person who realy shows his caliber again is de niro. He has one of these rare \"non-swearing\" roles of his. There is a scene where Jason Patric tells the story of the abuses they faced, and the camera focusses on Robert De Niro's face. Only thing changes is his eyes, from sharp and focussed at the first, you see them widening and then you see some trace of tears. Great! This scence reminds me of Omar Shariff standing on a balcony while soldiers start mayhem on the streets, in Dr. Zhivago.<br><br>A good care has been taken in getting child stars and adult stars look pretty similar.<br><br>Only thing li'll bit out of the place is constant referance to Count of montecristo. The revenge in the book is \"sweet lasting revenge\" where in this movie its straight shot. But heck! this is real life!<br><br>the last night the friends spend together is also really touching.<br><br>\nmy rating 9/10.","user":"booksmooviesnwhisky","rank":[134,163]},{"title":"Hell's Kitchen's legacy","rating":10,"date":"4 November 2005","review":"A classic. The story is complex and very sophisticated. The cast is sheer brilliant and hardly to surpass. Here we get first-class entertainment in combination with suspense and a variety of themes that are fairly well known to anyone, just as revenge, justice, murder, abuse, atonement etc. The kids do a fine job, really. They add tremendous depth to the deeds and to the behave of the grown ups. Their genuine and sure-handed performances grant the movie a considerable amount of emotional recognition and chain anyone who soaks up and identifies with the storyline and the characters. The very end closes the circle and makes us aware of how quickly our lives can fall apart. Thrilling and suspense is guaranteed. Very recommendable.","user":"Andreas_N","rank":[83,104]}]