[{"title":"Pacific Heights is Educational","rating":9,"date":"7 January 2005","review":"Pacific Heights is required viewing in all Apartment Management courses in San Diego County. It is a chilling tale of decent but uneducated and unprepared new owners with a dream unknowingly up against a seasoned player in the professional renter game. This viewing requirement is one of the tools used to introduce starry-eyed management newcomers to the harsh and not-so-easily apparent world of the sick, the dangerous and the sue-happy portion of the rental market who will try to get the management stripped of all their personal assets and possessions, fired and possibly jailed, who work diligently to get the owner's property away from him/her, and who have no objection to going down as long as they can take others with them. Great movie.","user":"rinkedo","rank":[56,67]},{"title":"Keaton shines as the villain!","rating":8,"date":"15 January 2005","review":"Prior to this film,we only saw Michael Keaton in comedic,and good guy roles.In Pacific Heights,he proves to us that he is not afraid to turn on us and be the bad guy.Keaton is excellent as Carter Hayes,the worst kind of no account,as he knows how to stay just out of reach of the law. The character is very similar to that of Max Cady in Cape Fear,though Cady is the far more memorable of the two.Carter Hayes is a nightmarish tenant wreaking havoc on the lives of his helpless landlords,wonderfully played by Melanie Griffith and Matthew Modine.I consider this film to be an overlooked classic that never really got the attention it deserved,perhaps because no one wanted to see Keaton,particularly after his Batman success,as a villain.Those looking for a modern day \"Hitchcock-esque\" thriller will find a winner here.Thumbs up!","user":"SmileysWorld","rank":[34,40]},{"title":"Flawed, but good enough","rating":7,"date":"5 September 1999","review":"This film didn't completely win me over like I was hoping it would, but some solid acting, a good premise, and a few clever scenes made it worthwhile. There was never anything particularly suspenseful about the film, and you pretty much know who will win by the end, but the loathesome Michael Keaton character helped to keep me interested throughout.  There were also a few things that especially annoyed me, including the terminally stupid Matthew Modine character, but this movie just has too many positives for me to dwell on the negatives.  It's by no means perfect, but it's an effective thriller nonetheless.","user":"Tito-8","rank":[20,25]}]