[{"title":"A picture of true beauty","rating":10,"date":"21 March 2001","review":"I cannot recommend this film strongly enough.  This story celebrates the timelessness of love without cynicism or irony.  It portrays a relationship in all its many forms: moments of joy, frustration, passion, tenderness, tragedy, and even a bit of insanity.  Fielding Pierce and Sarah Williams are the two politically-minded lovers. While they share very similar political goals, their means of achieving those goals are vastly different.  Fielding is the ambitious golden boy, campaigning through the political machine in an effort to affect change by working within the established system.  Sarah is the rebel outsider, who believes real change will never be accomplished within a corrupt system, leaving political revolution as the only alternative.  The film never passes judgement on which is the nobler or the more effective method.  Rather, it chooses to portray Fielding and Sarah as two people whose love for what they believe in is second only to the love they have for each other.","user":"wildgoose77","rank":[40,44]},{"title":"2000's hidden gem is also its Crown Jewel","rating":10,"date":"30 March 2001","review":"Never mind `Traffic'. Forget `Gladiator'. To find 2000's finest, most nail-on-the-head perfect film, you'll need to look a little deeper. A small film that only enjoyed limited release in theaters and isn't getting much attention on DVD either, is Keith Gordon's latest, `Waking the Dead'. <br><br>\nBack in 1992, there was another under-appreciated independent film called `A Midnight Clear' that had the misfortune of being released alongside the likes of `Unforgiven' and `Last of the Mohicans'. For reasons I can't fathom, this brilliant film seemingly did nothing to help Gordon's career. His budgets stayed small, but he continued looking for the most daring and fascinating material. In 1996,  he released `Mother Night', another war-themed film, only this time set in the aftermath of WWII.<br><br>\nWith `Waking the Dead', Gordon outdoes himself. He casts Billy Crudup as Fielding Pierce, an ambitious Coast Guard officer who'd like to be president--and he means it. His world is turned upside-down when he meets Sarah Williams (Jennifer Connelly), who just wants to feel like she `lives on the planet'. Fielding and Sarah could not be more different, yet they cannot live without each other. Each is the antithesis of the other, which dooms their relationship and intensifies their love at the same time. <br><br>\nThe film begins with the announcement of Sarah's death, and continues pulling you back and forth in time. Employing this storytelling technique and maintaining the momentum of the story is a difficult task. While we see Fielding wrestle with her memory, we're shown the powerful connection these two had during her life. <br><br>What's more, Fielding begins to see visions of her. Some of these visions are so real, he begins to believe she's alive. The hauntings come just as he begins campaigning for the U.S. House. It begins to affect his life and threatens his campaign. The question of whether Sarah is really alive is the dramatic carrot Gordon dangles in front of us. It's then we realize that she was his conscience in life and remains so in death. Gordon pours it on right until the very last frame. He gets the best performance of Connelly's career out of her, plus a jaw-dropping performance out of Crudup that's worthy of an Oscar. Whoever was in charge of plugging this film for awards nominations must have fallen asleep at the wheel (though I see it did win an Independent Spirit award for its script).<br><br>\nThat this film or others in the same situation get no recognition is definitely for the best. The more popular a film becomes, the more idiots that come out of the woodwork to second-guess it. So best to leave it to be discovered by those willing to seek it out. It is 2000's crown jewel.<br><br>\nGrade: A (but only because there isn't a higher grade)","user":"mercury-26","rank":[52,59]},{"title":"I will keep this review short","rating":15,"date":"15 January 2008","review":"This is one of those films that you watch and contemplate later in your life. As far as losing someone you love, and how that effects every major decision you will ever make for the rest of your life, this film is the most realistic portrayal I have ever seen. Billy Crudup was meant to play Fielding in this movie. This movie is haunting and is just one of those little movies that falls through the cracks but is never forgotten. A stunning movie directing by none other than the director of A Midnight Clear, another terrific film. If you are reading this you should seek out this movie or just buy it online. I give Waking the Dead 9/10.","user":"necron99","rank":[12,12]}]