[{"title":"Why Lyne's Lolita is Controversial","rating":13,"date":"13 August 1998","review":"When the 1997 version of Lolita was widely censored in the US, many asked why the reaction was so strong to this film.  After all, the novel was published in the US in 1958, Kubrick's film version appeared in 1962, and we hear more shocking tales of sexual depravity every day on the daytime talk shows.  But after seeing Lyne's brilliant version of Lolita, I can see how he manages to breathe fresh controversy into this familiar story.  Lyne's lascivious lens eroticizes Lolita's every movement and pose.  The viewer is forced to see her through the eyes of Humbert and to feel his obsession and desire.  We are co-conspirators in his crime, and at the end we share his shame.  Rather than shocking us (and having us pull away in revulsion), Lyne draws us in and makes us face the Humbert in ourselves.  This is an incredibly powerful film.","user":"CLPyle","rank":[252,294]},{"title":"Unfilmable?","rating":4,"date":"21 August 2009","review":"This is not at all a bad movie and is surprisingly faithful to the book. At times I suspected some scenes had been inserted to appease a contemporary sensibility but, on checking, I found they were all in the book.<br><br>I generally prefer this Lolita to Kubrick'e version, but both versions raise an interesting question.<br><br>It is a presumption of cinema that any novel can be satisfactorily filmed. Lolita casts doubt on this.<br><br>The problems can be illustrated by a small, but crucial, change that both films make to the book. When Humbert first meets Lolita she is 12. In the movies she is 14 and is played by actresses who were 15 and 16 respectively.<br><br>Objectively, this change shouldn't matter: under age is under age. In practice it does. When you see a 14 or 15 year-old, you can see the woman she is about to become. When you see a 12 year-old you can only see the child. Raising Lolita's age makes Humbert seem less perverse than Nabokov intended and James Mason and Jeremy Irons both make him too sympathetic.<br><br>All Nabokov needed to write Lolita was a typewriter and some paper. To film it, Kubrick and Lyne needed a young actress. Jodie Foster, Nathalie Portman and Lindsay Lohan all show that it would have been possible to find a 12 year-old actress good enough to carry the movie - but should she be asked to? If it was absolutely necessary to have a 12 year-old in order to make this movie, then most people would say: \"Don't make it then\".<br><br>But this is only part of a wider issue.<br><br>Nabokov wanted to put readers inside the head of a paedophile without them endorsing his actions: empathy doesn't necessarily imply sympathy. His first attempt was The Enchanter (which gave us the word nymphet). It was written in the third person. Nabokov was unhappy with it and it was only published after his death.<br><br>Lolita was written in the first person and that changed everything.<br><br>The book is Humbert's own testimony. He wants to present himself as a sensitive aesthete: a romantic lost soul surrounded by dull, uncomprehending Philistines. He charts his seedy obsession in elaborate, over-ripe 'poetic' prose, trying to draw the reader into his self-delusion, but we soon come to doubt the truth of what he is telling us. He can't help letting us see through his self-serving narrative to glimpse the murky reality that lurks beneath. Lolita is in real distress and is being profoundly corrupted by this unhealthy relationship.<br><br>Humbert's nymphet fantasy soon starts to crumble before the reality of a troubled, wilful, increasingly manipulative child. Then he finds himself haunted by the ominous shadow of Clare Quilty, who we come to realise is his dark alter ego (Humbert's doubled name is a fairly obvious clue to Nabokov's intentions). Humbert is the doomed romantic he wants to be seen as: Quilty is the evil sexual predator he really is. Inevitably, it is Quilty that wins the battle for Lolita.<br><br>Eventually, Humbert emerges from his pubescent fixation and has a relationship with an adult woman, so when he finally meets Lolita again he is able to see (and love) her as a real person. But it is too late. At this point, there is nothing left for him to do but finally kill off his evil doppelganger and then die himself.<br><br>The point of Lolita, therefore, is not just in the the events it depicts, but in the particular way it depicts them. It is not only a story: it is a specific literary device. I think this presents an insoluble problem for a film-maker.<br><br>I doubt if there is a cinematic equivalent to Nabokov's mendacious first person narrative. Cinema only really works in the third person and is a very literal medium: 'the camera doesn't lie'. When Hitchcock used a misleading flashback in Stage Fright people were outraged and even film critics, who should have known better, complained about the deception.<br><br>Kubbrick and Lyne can both show us that the real Lolita is a far cry from Humbert's idealised nymphet but we are always seeing the disturbing reality itself, rather than that reality filtered through the haze of Humbert's prevarications.<br><br>Kubrick tried to defuse the problem by playing up the humour. The first hour, in which Shelley Winters's Charlotte vamps the stiff, repressed Humbert to his considerable discomfort, mines the humour of embarrassment. Then Kubrick lets Peter Sellers loose to do a series of virtuoso comic turns. They are great, but overload the picture. Kubrick's Humbert is constantly being harried and badgered and in the end is less a sexual predator than a hapless victim. I don't think the movie works and Kubrick seemed to agree. He often talked about remaking it.<br><br>Adrian Lyne uses the voice-over to give us more of Humbert's oily verbosity and he can be much more frank about the true nature of this deplorable relationship. But, again, we are spectators of events as they actually occur, rather than as Humbert wants us to see them, and the greater frankness only compounds the problems. Although his version is better in many respects than Kubrick's, it is even more uncomfortable to watch.<br><br>Because of the nature of the medium in which they were working, Kubrick and Lyne both ended up making The Enchanter, not Lolita.<br><br>I am not suggesting that it was wrong to make these movies. Film-makers should be free to tackle any subject that intrigues them - and it is not a crime to fail. It is just that the problems inherent in some books are so great it is unlikely there will be any solutions to them. Perhaps there are some challenges that film-makers should just decline.<br><br>I suspect Lolita is one of them.","user":"keith-moyes","rank":[66,85]},{"title":"Lost Narrative Folds","rating":12,"date":"12 August 2000","review":"The Author would be dismayed, and precisely because the story is so faithful to the book. But the story in the book was incidental, just something on which Nabokov could hang his layered challenges to concepts of narrative. The narrator is crazy, overly colors and outright lies. The story never fully exists in the book at all, and such as it does one can never be sure what is true and what imagined. Humbert is a made up name (as are all names) and clearly the narrator makes up most of the elements of his own character as well (European, Professor, Author... obviously a joke by the narrator on Nabokov).<br><br>In this film, everything makes sense, exactly the opposite of the reason the book exists. This is a beautiful film, with lovely detailed cinematography, good acting and great score, and all to solidify something that Nabokov created such that it could not be so. I believe that Peter Greenaway could make a good film of Lolita, and that he would have the courage to make it confusing and unerotic and unresolved. Why does Dolores' fate have to change in the film's epilogue? Because it ties up every last loose end. On Christmas Day no less!<br><br>(The real scandal is not that audiences/censors are shocked by prurient subjects, but that they take one of the greatest literary achievements ever and make it \"explainable.\" Is this the only thing we can accept?)<br><br>But take the film on its own presumption that the book's story is what matters. This Lolita is too old, too pretty and sexy, too controlling. Irons is clearly narrowly channeled here and he is smart enough to know it: his frustration with the unimaginative stance of the film translates to a frustrated Humbert. I think Melanie is just right (just because HH calls her a cow means nothing). HH's violence with his previous wife should have been mentioned; her running away with the Russian cabbie is as much a setup for the Lolita fixation as the childhood dalliance, and better justifies the angst of loss. There should have been a few butterflies, and some explanation about the play: that it was written to allude to that first night at the hotel.<br><br>I highly recommend the audio tape version of Lolita. It is read by (guess...) Jeremy Irons! What he brings to the audio tape is the voice and phrasing of a man in a cell continually going over things in his own mind, embellishing and exaggerating and confusing and speculating and sometimes not at all sure about any of it. He brings this same voice to the voiceovers in the film, but it conflicts with the images which purport to represent a narrative stance of \"real truth\".","user":"tedg","rank":[112,157]}]