[{"title":"I love the ending!","rating":3,"date":"3 February 2002","review":"I must say, I'm not what you would call a liberal. I'm a Democrat, but I don't consider myself one of those \"limousine liberal\" -- re: rich, white middle-class people who have never endured poverty in their live, and yet somehow can \"feel\" for those currentlys uffering. Yeah, right!<br><br>All that side, this is a wickedly funny movie and completely unpredictable. I love the intense scenes with the cop and when the liberals start to contemplate rather they should kill or not kill their dinner \"guests.\" it's just great stuff!<br><br>Imagine, all these \"tolerant\" liberals sitting around judging people on what they say and starting to actually LIKE killing. Pretty soon they're killing because of the power of killing, not because they want to \"rid the world of evil\" -- which, ironically, they've become, since they're knocking off everyone and their mom, including the cop, who is just doing her job.<br><br>As the saying goes, \"I can't tolerate intolerable people!\"<br><br>And stay for the ending. It's a KILLER! Ron Perlman is GREAT.","user":"http-www-nixflix-com","rank":[18,24]},{"title":"Wicked black political satire","rating":8,"date":"7 August 2002","review":"This is a wicked black political satire of some left-wing intellectuals who decide to strike against right-wing \"extremists\". It has an excellent cast, especially with Courtney B Vance, Ron Perlman, and Cameron Diaz (who is a real surprise).<br><br>It also has a brilliantly witty script, like a 90s Oscar Wilde or George B Shaw with more sharper bite. I thought the setup and the climax were particularly effective, especially at handling complex political questions with an easy-to watch and a very engaging approach(which I have to say IMHO is rare for American movies). A totally professional production all round. This is the way smart independent films should be, and it's a shame not all of them are this clever or perceptive.<br><br>Obviously not meant for all tastes, but if you're fairly open-minded and like intelligent dark satire, this is a real treat.","user":"BadWebDiver","rank":[26,37]},{"title":"Made me think, might make you think too! great movie!","rating":10,"date":"18 January 2005","review":"A fantastic movie demonstrating the self righteousness of people on the far left and right of the political spectrum: \"I'm right, your wrong, end of story\". It's very rare that a film which might be described as a political dark comedy shows the faults of people on the right and left who know that they're always right and it demonstrates that there's really no right or wrong (the homophobic priest wishes to kill all gays, but then the students kill him. Who's right and who's wrong? I suppose it depends on who YOU agree with.). I'm left of centre on many domestic social issues, but this movie made me stand back and think \"am i sure I'm always right?\". People to the far left or right believe in themselves so much that this movie wont change their views, but I treat people people with conflicting views with a bit more respect today. Fantastic movie!","user":"allmighty_miller","rank":[43,65]}]