[{"title":"Will forever remain one of the greatest best action movies of all time!","rating":10,"date":"15 November 2015","review":"Speed (1994) is one of the best action movie ever made!!!! It is one of my personal favorite Keanu Reeves action movies. I just wish they wouldn't made sequel because it doesn't even compare to the first one. Speed 2: Cruise Control can't hold a candle to this movie. For me the sequel never happened. I only own this movie in Blu-ray collection and that is all. I love the theme score in the beginning of the movie and I love music at end of credits. I just love this movie, alongside with The Matrix, Johnny Mnemonic and Point Break is one of my favorite action film of Keanu Reeves. <br><br>This movie is one of those films that is worth of watch and money. It seems like now this days, action films force themselves into a wickedly strange plot to try to be the next sixth sense and put more money into each explosion than into any actors. This is a film that you just love everybody in the movie because the acting is great as well as the original story line. Sure, its no Oscar winning type of film, but if your at home looking for a fun film to watch, SPEED is the right movie for you. Keanu Reeves &amp; Sandra Bullock's chemistry really made this movie work. This movies Is a badass! It is directed by Jan de Bont the same director who directed the god awful sequel. This movie is just great, it is Die Hard on a bus. Speed is simply similar to other sequel movie like are Die Hard With A Vengeance (1995) that come out one year later, when Sandra was handcuffed on the train and Keanu was saving her, the same cuffing scene was later used in Die Hard With A Vengeance. McClane been on a train that explodes and goes off the barrels out of an incomplete stretch of track and crashes, the same scene was used from this movie. Die Hard With A vengeance borrowed out some scenes from this movie including China Town line. <br><br>I still love both of these movies, they are both great action films of the 90's and one of my all time favorite Keanu Reeves movies. Speed is a classic in modern terms and one of Keanu Reeves best performances. This movie had me on the edge of my seat from the opening scene. One of the iconic movies of the 1990's, Speed is a highly entertaining, slick and polished action movie. It's a benchmark movie of its genre that was high in tension and excitement without the unruly gore of a 1980's action flick. The story itself is very good; it has some important depth to it that missing from most action movies. The cast is rock solid; Keanu Reeves was perfectly cast as Jack Traven, a smart, agile but reckless police officer with a tendency to disobey orders and creates inventive solutions to get the job done. Jeff Daniels plays the sympathetic, wise polar opposite partner, Harry Temple, well. Dennis Hopper chews the scenes excellently as the charismatic and twisted maniac of villain. Sandra Bullock Annie couldn't be more likable and innocent. Joe Morton's character as the Chief is lively enough to support the lead and the rest of the cast is definitely solid.<br><br>The movie is a near perfect one for me. It's like a minor terrorist who knows the police force and knows how to work w/ bombs which is really cool. Not only that Keanu Reeves makes an awesome cop and they have a great cast and supporting cast. Dennis Hopper makes a great villain, Sandra makes a great tough girl, and Jeff makes a great partner. I love the plot and the length of the movie. First starting off with a bomb on an elevator and then on a bus. And since it revolves around the bus ride the entire time they do a good job with adding little problems they must overcome to ensure the bus does not explode, such as sharp turns and getting on an unfinished bridge so they can stay over 50 mph.<br><br>Jack Traven (Keanu Reeves), an LAPD cop on SWAT detail, has a fearless nature and a keen understanding of the criminal mind. That, and some luck have kept him alive. But Jack's luck is being put to the ultimate test. An elusive bomber-extortionist Howard Payne (Dennis Hopper) is seeking vengeance after his latest ransom scheme is thwarted. Payne gives a personal challenge to Jack: A bomb is rigged on a city bus, which will detonate if the speedometer drops below 50 MPH. Poor Annie (Sandra Bullock) gets shoved into the driver's seat, while Jack does his best to save the day.<br><br>That is the basic plot, it is a slick film about a young cop who must prevent a bomb exploding aboard on a city bus by keeping its speed above 50 mph. and stop a terrorist by executing his plan. I am giving this movie a 10/10 it hell deserves it! I have fun watching it and I still love the score of the films. Great solid action flick of Keanu Reeves I love it!","user":"ivo-cobra8","rank":[68,78]},{"title":"Thoroughly entertaining","rating":8,"date":"1 March 2005","review":"Speed is one of my favorite action movies of all time, just a notch below contemporaries like Terminator 2 and Die Hard. The premise is so simple that it's almost a parody of movie pitches (Homer Simpson's line was \"I saw this movie about a bus that had to SPEED around a city, keeping its SPEED over fifty, and if its SPEED dropped, it would explode! I think it was called 'The Bus That Couldn't Slow Down'.\"). Fortunately this film came to be much better than the sum of its parts, and it's deservedly remembered as one of the most entertaining films of the 90s.<br><br>What distinguishes Speed is its humanity, due in no small part to the character of Annie (Sandra Bullock). The best example of this is the moment when Annie, while driving the bus, thinks she has struck a baby stroller. She becomes so distraught that she lets go of the steering wheel, never mind the fact that she is in charge of driving a bomb-laden bus through the L.A. suburbs. It's one of several moments that draw us into the film by helping us identify with the characters, and it's all the more elegant for its simplicity. This movie isn't complex, but it doesn't claim to be.<br><br>There is a certain irony that Speed succeeds so well on a human level, since Jan de Bont is not generally considered an \"actor's director\". He started as a cinematographer, and even when he talks about directing he discusses technical aspects and seldom mentions working with actors. Nowhere was this more evident than Speed 2, which pretty much killed his directorial career. Given that, it's all the more remarkable what he pulled off in the original Speed, as everything seemed to come together for him.<br><br>The overall performances really serve this picture well. Keanu is at his best (which is to say, mediocre), Sandra launched a career based on this movie, and Dennis Hopper did a wonderful job as the sardonic villain. Plus he has one of my favorite bad-guy lines of all time (Traven: \"You're crazy.\" Payne: \"Poor people are crazy, Jack. I'm eccentric.\").<br><br>8/10","user":"jeremyglick","rank":[78,94]},{"title":"All out 90's Cheese (The Best Kind)","rating":8,"date":"19 October 2018","review":"Generic? Yup, Contrived? Of course, Fun? Absolutely! A brilliant first time Watch I can't lie, Fantastic all round performances and brilliantly tense action sequences there's not much wrong with this piece of film here and I can't recommend it enough, the original (and best) of over the top action ala 'The fast and the furious' franchise it's totally worth a watch, nothing but fun!","user":"thomasjay-52277","rank":[10,10]}]