[{"title":"One of the Most Original Films Ever Made","rating":10,"date":"9 April 2007","review":"'The Truman Show' epitomizes strong and original storytelling on screen. This film is emotionally engaging, didactic, witty, dramatic and very unique. For those unfamiliar with the concept, Truman Burbank has never left his ideal home town of Sea Haven. What he doesn't know is that his entire environment is a materialized set and he is the ignorant star of a reality TV show of epic proportions.<br><br>Taking this entirely original concept, writer Andrew Niccol and director Peter Wier take the viewer into territory uncharted by anything in film history. Thus, the plot is entirely unpredictable but still flows along expertly. The tightness of the screenplay and the immaculate pacing of Peter Wier contribute largely to this film's brilliance.<br><br>The acting performances are amongst the best I've ever seen. Jim Carey is superb as Truman, effortlessly conveying his fears, desires and personality. Ed Harris is excellent as the reclusive creator of the production. In addition, the entire support cast appears synthetic enough to let the audience know they are \"acting\" for Truman but in some scenes let their \"genuine\" feelings shine through. The ensemble simply cannot be faulted. Carey was hardly done by not to get an Oscar nomination for his performance.<br><br>The music and visuals are top notch. The cinematography has a reality TV feel that is clever but never intrusive. The shot selection is of the highest quality, particularly in the movie's final sequence. Muscially, this film is incredible. Phillip Glass is a dream on the piano, perfectly evoking the mood for each section of the narrative. The two combine excellently during the scene in which Truman breaks his routine for the first time. During the sequence, Truman makes subtle changes to the bland routine he follows compliantly every day. The emotion of the music when combined with the apparent simplicity of Truman's actions makes this scene one the most powerful I'v ever experienced.<br><br>This film is an absolute gem. It effortlessly combines everything a classic film should have. It has comedy, drama, strong character development, atmosphere, originality, superb visuals, a superb score, tight writing, raises interesting moral questions as well as providing insight into the human condition. One cannot watch this spectacular film without wondering how a human would react when put in that kind of situation. It touches on our sense of adventure, desire for conformity and the courage we require to question the life we are presented with. 'The Truman Show' does all this in the most accessible and compelling fashion. One of the greatest films of our time.","user":"Mark1988","rank":[105,110]},{"title":"An unassuming film that is thought provoking on so many levels, well acted and thoroughly enjoyable however you come to it","rating":29,"date":"29 October 2004","review":"Truman Burbank is an ordinary guy in an ordinary little seaside town of Seahaven Island where nothing really happens. Everything is clean, everything is perfect, he knows people but never really connects to anyone. The one woman he ever really loved is not his wife and has long since left for the other side of the world where he longs to visit but feels he can never go. Paralysed by his fear of water since seeing his father die on a boating accident, Truman still feels he is missing something. A strange light falling from the sky, a man who reminds him of his dead father, a strange radio broadcast and the feeling that the world really stops when he shuts his eyes all combine to make him feel something is wrong  but what is it that he seeks but feels he cannot find?<br><br>When I first saw this film it was with my girlfriend (who would then become my wife, then ex-wife!) and I remember how she and our friends felt a little bit cheated by the film that they had expected to be yet another wacky Jim Carrey comedy. In fairness to her and the others, it was easy to do this at the time  who would have thought that Jim Carrey would be able to act  certainly not the marketing department that sold this film on the basis of it being a hilarious film as opposed to the thoughtful and rewarding film it turned out to be. The plot can be viewed on so many levels that it is honestly easier to leave it to each viewer to take what they will from it. On the most obvious level it satirises the media, the emotional façade of television and (the increasingly relevant) look at reality shows. To others it will say as much about God, the empty drone of life and the things that we all desire. Of course to others it will just be a comedy with general comments to make  and there is nothing wrong with that whatsoever; in fact the multi-level approach works to make it appeal to many audiences.<br><br>Starting as a comedy, I am always taken by how well the film moves to become more and more interesting but yet never loses sight of those audience members who have come for the basic story. Hence it delivers an enjoyable and engaging central narrative that, plainly put, makes for a comic and involving yarn  we grow to care for Truman and this makes the ending an emotional and satisfying one even if some viewers will bemoan the fact that (to them) it appears 'open ended'. That it is also a very thought-provoking affair is only a bonus, with the satire working on many levels. Of course by seeming to tackle so many subjects and issues in such a short running time, the film never really gets its teeth deep into any one of them but this is not a major problem because it leaves us to do that in our heads after the film finishes.<br><br>The cast is roundly superb even if the majority of them are in minor roles. Of course it is easy now to look back at Carrey and accept that he can act straight but at the time it seemed so unlikely and few felt it was a good casting choice. Of course, seeing the end result it is clear that he can and he delivers such a great performance that he really makes the film work.<br><br>He is comic but yet serious, sympathetic but not worthy of pity  it is a great delivery and one that basically meant that I now look at his Ace Ventura stuff as the 'other' category and see his acting as his real work (6 years ago that was vice versa). Carrey carries the film, being on screen for almost the entire film but he has good support from Linney, Emmerich, Krause and others who play it well despite being stuck in the necessary stiff and unreal roles. The controller etc roles are all well played and feature a collection of well known faces including a great support role from Harris through to roles for Giamatti, Shearer, Baker Hall and a few others. It may be Carrey's show but the support certainly helps.<br><br>Overall this is a great film that can be appreciated as much for what it is on the surface (a great little comic story) as it can for the issues that it hints at all the time. There was a time when some viewers may have looked to a Carrey film to be a load of mugging an crude, basic laughs but this was the film that saw that change. Thought provoking, funny, entertaining, short, enjoyable and well acted throughout  well worth seeing and well worth coming back to several times.","user":"bob the moo","rank":[363,396]},{"title":"Genius","rating":10,"date":"12 June 1999","review":"I asked a friend to describe The Truman Show.  He said, \"No, it's not a comedy, well...not exactly.\"  I didn't quite understand until I watched it myself.  Truman takes on a tone quite different than any parody/comedies I've seen lately.  The point (the media and its destructive powers)  is subtlely relayed through dark humor, and you don't feel like the director is smashing you over the head with his morals.  Peter Weir demonstrated his artistic genius in Dead Poets Society and here as well. The soundtrack is great, Ed Harris is stellar (what were they THINKING at the Academy?) and for once I actually liked Jim Carrey. His performance wasn't ribald for once. The final scene--I will not reveal it--is a majestic, long-awaited finish to an intellectual movie. Some people will insist that it was boring or pointless.  Those are the same viewers who prefer slapstick, obvious humor to the subtle layers presented here.  This is a thinking person's movie.  If you can't see the underlying message here, of course you won't like it!","user":"Altaira","rank":[356,393]}]