[{"title":"M.Depardieu est formidable,naturellement...................................","rating":7,"date":"20 October 2008","review":"I have a problem with the movie snobs who consider Americans to be uncouth semi - literates unable to appreciate the subtlety of the more sophisticated Europeans,les Francais,les Italiens...just about anybody from le continong to whom English is a foreign language.If the humour in \"My Father the Hero\" is different from that in \"Mon Pere ce heros\" it is because the French sense of humour is different from that of the American.Not better,not \"more clever\",just different. If you think it is crass for Hollywood to \"borrow\" from the French cinema just consider how much the French cinema has borrowed from Hollywood in the first place.Where would Belmondo and Delon have been without Bogart?Truffaut without Hitchcock?Jerry Lewis - not known for his subtle and cerebral style is idolised in France.Go figure........ Monsieur Depardieu is exceptionally good as the hapless divorced father of a precocious 14 year old daughter on holiday in the Bahamas together. Unbeknowst to him,she presents him to the other people at the hotel as her lover so as to make herself more interesting to a boy she has her eye on .Not surprisingly,complications ensue. There are \"hommages\" to \"Green Card\" and \"Cyrano de Bergerac\" amusingly inserted and M.Depardieu goes along with it all very good - naturedly. He does a good Maurice Chevaler impression with \"Thank Heaven for little girls\" which is in fact funny and rather poignant as his audience,all of whom believe him to be the lover of a 14 year old girl,get up and leave two - by - two as he warbles away,blissfully unaware of what is happening.When he turns round at the end of the song to acknowledge the expected applause the expression on his face is priceless. Without him the movie would be very average indeed.With his huge shambling figure dominating the screen it is a lot of fun.No pecs,no six pack - just a real proper human - type being.Formidable!","user":"ianlouisiana","rank":[12,12]},{"title":"my comfort food of a video.","rating":10,"date":"15 September 2010","review":"This movie, to me, is comfort food to my soul. I can't explain it. It's not an Oscar worthy picture, but there's a certain type of sweetness at the core of this movie, that seems to reach out and grab you. It's one of those movies that you break out and watch while you eat a quart of ice cream and cry over a long, tiring day. And somehow the movie manages to reach you. Maybe it's the way each character interacts. Or the wonderful island music that kind of takes you away. It has an innocence that touches you. A charm that many movies have lost. Maybe because it's such a simple story, it's not trying to hard to disarm you, so you get to enjoy the entire thing for exactly what it is. A cute, simplistic, coming of age romance. Three thumbs up ;]","user":"madicyn","rank":[21,25]},{"title":"Great Movie for Fathers and Daughers","rating":10,"date":"28 March 2006","review":"What a great movie this is. I found it full of the delightfully unexpected pain of being a single father of a teenage girl. And it is set in a tropical island 'paradise'as well. <br><br>Gerard Depardeiux brings his special European flair to this story about a divorced father of a teenage girl. They are on holiday together and she begins to add to the excitement on the island in many unexpected ways. But you will need to see the film for yourself to see all the hilarious situations they find for themselves.<br><br>There are a few cult classics which all teens should see. This movie should be added to the list. In addition to Dirty Dancing, Ferris Bueller's Day Off, Bill and Ted's Excellent Adventure, Rocky Horror Picture Show and Animal House, My Father the Hero should be required film study. Watch it as if you had a teenage daughter and you'll be rolling with laughter. Watch it with your teenage daughter and prepare to be laughed at for months.","user":"Docrgl","rank":[21,27]}]