[{"title":"Indifference to violence","rating":7,"date":"2 June 2005","review":"John Carpenter's remake of the 1960 original has little to add but it's more violent and explicit. The plot is the same; 10 women get pregnant simultaneously during a group pass out. Several years go by and the children all look similar and stick together. They appear to be anything but normal and once they start killing the residents of the small village it's clear they have to be stopped.<br><br>Carpenter is really a master of suspense and some scenes work remarkably well, however this is not one of his best films. Not much happens here and the film drags a bit, plus the inclusion of a government intervention and a possible world wide epidemic of these children does little to further the film. Still, Carpenter manages to create a decent amount of suspense and uneasiness by playing on the film's simple premise; that little children are the evildoers here. The soulless stares and glowing eyes are enough to creep you out. The social statement about people (and children) becoming indifferent to violence is a valid input, since the film couldn't really go for the same underlying meaning as the original, which was made during the cold war; the children personifying the threat from the east penetrating the west.<br><br>An average John Carpenter film is still a lot more interesting than most other horror films out there. Village of the Damned is not one of his best but it's a good film nonetheless.","user":"ODDBear","rank":[57,75]},{"title":"Good Old School Film-making","rating":7,"date":"16 November 2005","review":"John Carpenter, a respected director among the horror genre enthusiasts, gives us a remake of the classic 60's sci-fi /horror movie. Many people consider it the weakest Carpenter movie, but now, almost 10 years later, it's easy to notice why this movie was considered a failure in it's time, and certainly it's easier to appreciate it for what it is: an old school horror movie.<br><br>A year before Scream gave new life to the genre, this movie told the story of a small village lost in the rural areas of the U.S. where something strange happened one afternoon when the entire town fell unconscious. By strange circumstances 10 women got pregnant that day, but only 9 children survived. The remaining children look all the same and behave in strange ways, creating horror in town. All this while a government team studies them.<br><br>Christopher Reeve stars as the father of the leader of the children, Mara. Co-star Kirstie Alley as the government scientific in charge of the study. To be fair, the acting of the children was superb, while the acting of the adult characters was somewhat weak. Reeve steals the show, and Alley just seems out of place.<br><br>As I wrote before, the whole movie has that early 80's feeling, and I would dare to say that it feels as something made for TV. Not necessarily a bad thing, but it's probably the main reason this movie is not very popular. This old school style maybe was not very attractive for 95's audience, Carpenter would go in a better direction once reunited with Kurt Russell in 96's Escape From L.A.<br><br>I have not seen the original movie yet, so I came to it without any expectation, I can't say I ended pleased, but I found it entertaining, although quite slow at times.<br><br>It's worth to notice that it has beautiful cinematography, and even when it may be a flawed effort, it's worth a rent. It's one of those movies that takes it's time to grow on you.<br><br>7/10","user":"jluis1984","rank":[31,41]},{"title":"Different Remake and Feel of the 1960 Black and White film.","rating":8,"date":"20 June 2005","review":"In the quiet small town in Southern California. Something terribly goes wrong in the small village of Midwich. After an unseen force invades a quiet coastal town. Ten woman mysteriously find themselves pregnant. Local Doctor (Christopher Reeve) and an mysterious government scientist Dr. Susan Verner (Kristie Alley) decide to help each other. When the woman simultaneously give birth... and the reign of terror begins.<br><br>This is a remake of the 1960 Classic film. The new version is directed by John Carpenter (Escape From New York, Escape From L.A.). Carpenter gives this version with much more explicit violence. Although the original was much more eerie but Carpenter manages to top several key scenes from the original. One of the Highlights of this remake is the Strong Performances by Reeve, Alley, Linda Kozlowski, Mark Hamill (as a Priest!), Thomas Deeker as David and Lindsey Haun \"The Leader of the Emotionless Children\".<br><br>The Remake does look better in Color than the 1960 Black &amp; White original. This new version was a Box Office disappointment. The film plays better on Video than it did in Theaters but it is a must see in Widescreen, especially Gary B. Kibbe's terrific cinematography. Carpenter cut several scenes before the film's release. Scenes like 9 infants getting up together in the same time (Which is a Babies Puppet F/X from K.N.B EFX Group), 8 Children Attacked and Probably Killing Three Other Children. There is good visual effects by Industrial, Light and Magic. Carpenter Co-Composed the film's music.<br><br>DVD has an sharp anamorphic Widescreen (2.35:1) transfer and an terrific-Dolby Digital 5.1 Surround Sound. DVD Features are the Original Theatrical Trailer, Bonus Trailer from Other Films and Production Notes. It would have better if the DVD has an audio commentary by Carpenter and Deleted Scenes. We might have these features on a Future DVD but highly doubtful from this Underrated film. One of the few underrated film by John Carpenter. Panavision. (****/*****).","user":"hu675","rank":[41,58]}]