[{"title":"Nun better....","rating":9,"date":"14 October 1999","review":"TIDBIT - Bette Midler was the original choice for the lead in \"Sister Act\".<br><br>That may have been cute (a Jewish nun?) but in choosing Whoopi, \"Sister Act\" gives itself a shot in the arm with an incomparable comic talent and insures every scene with Deloris/Mary Clarence is a highlight unto itself. <br><br>\nAfter witnessing a Mob hit courtesy of her boyfriend (Keitel), casino lounge singer Whoopi hightails it to her local police where a helpful cop (Nunn) puts her in the Witness Protection Program and before you can say \"holy, holy, holy\", sends her to the last place in the world anyone would think of finding a second-rate lounge singer. <br><br>Once the church, nuns and choir music with a Motown beat are all introduced, things pick up steadily.  All the nuns are funny (especially Najimy as the eternally sunny Sister Mary Patrick) and there are so many good scenes to be had thereafter (the bar scene, the first choir practice, the blossoming of Sister Mary Robert (Makkenna), etc.), that you can't help but smile, even if you're tired of nuns as a springboard for comedy.  <br><br>And there's something about the music: the gospel-tinged soul songs like \"My God\", \"I Will Follow Him\" and such lift your spirits and are infectious in their own right.  The last scene in the movie is quite moving, truth be told, and lets you in on a secret... God moves in mysterious ways.<br><br>Amen.<br><br>Nine stars.  These \"Sister\"s rock!","user":"Mister-6","rank":[55,66]},{"title":"Still holds up in 2019","rating":9,"date":"18 November 2019","review":"Just watched this on Disney+. Music is still great and jokes are cute and funny. Great watch and family friendly","user":"bigbadbassface","rank":[10,10]},{"title":"A Great Movie, for a very different reason...","rating":8,"date":"17 April 2005","review":"This is, indeed, a comedy. It is mostly funny, though it won't have anybody rolling in the aisles. This movie is terrific, but not because of the acting or directing...what this movie does is demonstrate the possibility of positive change. If you allow yourself to suspend disbelief about certain aspects of the plot, you'll discover that you can relate to and understand the struggles the sisters go through. They are universal--every human being has been in some dysfunctional, stuck or dying organization. Everybody knows what it feels like, and everybody wishes that they could do something about it. <br><br>I think every member of every church, synagogue, mosque, house of worship, civic organization, school, committee, and/or organization of any kind should be tied to a chair and made to watch this movie. It's a paean to possibility, and a wonderful encouragement to those who believe that life could be better than it is.","user":"spankymac","rank":[38,45]}]