[{"title":"The Big Tease parallels Craig's experience: Spoiler Alert","rating":9,"date":"29 October 2005","review":"I loved \"The Big Tease.\" I have watched it several times, and find it more entertaining each time. I recently read a quote of Craig Ferguson's in a Reel.com interview, saying that the movie somewhat parallels his experience in Hollywood. He said, \"it is an exact mirror image of the show business that I know. I believe that the story in the movie is my story in America,\" and when asked how Crawford's experience in America paralleled with his own, Craig replied, \"It's exactly the same...it is very similar to my own experience. That is where the story comes from.\" I watched the movie today for the first time since reading these comments, which Craig made about 7 years ago, and find that there are more similarities than he could have foreseen at the time. Part of the sharp satire on insider Hollywood revolves around getting a break because of whom you know. In the movie, Crawford comes to L.A. as a well-established hairstylist in Scotland (the \"Red Adair of hair\"), and manages to connect with the right people, beginning with Eamon the limo driver and Candy the publicist, which in turn leads to a series of connections with other key people and opportunities: an amusement park animal costume fur-dressing gig, the continuing antagonistic yet crucial interactions with Monique and Stig, a lunch date with Drew Carey that takes Crawford's credibility to the next level, and a meeting with the Senator who finally allows him to compete in the W.H.I.F Hair-Off. Throughout these events and introductions, Crawford must pay his dues, often feeling humiliated in the process, yet always managing to make the best of the situation. I don't pretend to know all the details of Craig's rise to fame, but he was already an established comedian well-known in the U.K., then came to the U.S. and obscurity. After paying his dues here and there, he got a break as Mr. Wick on \"The Drew Carey Show.\" Drew Carey is the equivalent of Candy in this movie, giving stability to Craig's career, and enough required time on the set but not in front of the camera to begin writing, thus marking his breakthrough into the roles of writer, producer, and finally director with the critically acclaimed \"I'll Be There.\" Craig Ferguson's big break as host of CBS's \"The Late Late Show\" is similar to Crawford's walk-on success in the competition for the Platinum Scissors award. Craig has not yet been crowned the king of late-night, but I have a feeling that some of the other late-night hosts are feeling very much the same as the other three Hair-Off competitors, wondering, \"Who is this Scottish guy, and who could have guessed he had so much talent?\" One interesting scene in particular shows the obvious pride Crawford feels when he finally obtains his H.A.G. card, a pride which Craig will soon share when he obtains a U.S. passport upon becoming a citizen of his adopted country. The parallels to Craig's current situation are easy to see, and I think that \"The Big Tease\" may portend the huge success that Craig has yet to attain in Hollywood and with the ranks of late-night fans. Like Crawford, Craig is determined to reach the pinnacle of his profession, and he has forced industry insiders to sit up and take notice of him. Just like Crawford, Craig was born to this.","user":"dshenderson","rank":[14,15]},{"title":"Great movie!!!","rating":26,"date":"26 April 2003","review":"I love this movie so much.  It has such a funny plot line and the writing is so good (Craig Ferguson, the star, wrote it).  This is one of the best faux documentary movies I've ever seen.  I think it also has a sweet little story about fulfilling your dreams and I love the ending.  I'm also a big fan of Craig Ferguson's other work, like Saving Grace.  If you liked this, I would reccomend that as well.","user":"ShamrockBiff","rank":[14,15]},{"title":"worthwhile, funny little film","rating":25,"date":"25 July 2001","review":"If you stick with it this is a very funny film.  Don't be put off by the plot - a misguided Scotsman attempts to crash a mythical hairdressing Olympics.  It's a very human comedy about identity and self-worth.  Filmed in a documentary style, which takes a few scenes to get used to, it really only hits its stride when the hero Crawford lands in the US.  From there it works very well, tilting at various American showbiz windmills.  I saw one of the co-stars, Mary McCormack, recently in \"High Heels and Lowlifes\", and surfing her name in the database reminded me of this little gem.  If it's in your local video store, and you enjoyed Spinal Tap or Local Hero, you should try it.","user":"steven.gough","rank":[12,13]}]