[{"title":"This movie is really underrated","rating":8,"date":"9 March 2009","review":"This movie I know people did not really enjoy. But in a way it is underrated. Because it does really get Mickey back in the show (which Rocky IV stayed away from). I got sad towards the beginning when Rocky goes back to the old neighborhood one night and goes to Mickey's gym and at the end when Rocky is thinking back to what Mickey was telling him in the first two. It also really does have a father son theme in it. I felt sorry for his son. Tommy Morrison did a good job in playing his character. All the Rocky movies to me are the same because they all have there specialties. So yea in a way this movie is underrated and actually really sad.","user":"jlivesay2010","rank":[20,21]},{"title":"Give it a chance.","rating":7,"date":"15 April 2006","review":"For some reason or another, certain movies achieve a reputation as being worse than they actually are. Rocky V is one such film that is affected by the  as I call it  Phantom Menace syndrome. This refers to Movies that are interesting in their own way but fail to live up to the hype or expectation of previous instalments, or simply do not follow the formula that everyone derided for being too predictable anyway. For me, Rocky V is the best of the sequels to the 1976 original, as it does not follow in the Rocky tradition of simply having a bigger guy to fight than in the previous film. Rocky IV was a great spectacle but it was more comical than anything to think that an entire Russian government could be funding one over-sized boxer who could kill a man with one flurry of punches, not to mention turn a blind eye to illegal doping. The fifth instalment in the anthology goes back to the more personal story of the character, and deals much more realistically with the aftermath of loss and the twisted nature of professional prize fighting.<br><br>Stallone recruited his own son for the role of Robert (Rocky's son) and the result is one of the best father son relationships ever committed to celluloid. The scene where Rocky realises that he has been a negligent father and must make his peace with the boy is affectionate and heartfelt and could never been as realistic without the real life history behind these two people.<br><br>OK, there are some flaws and I am not too naive to suggest this movie is worthy of an Oscar. The casting of Tommy 'The Machine' Gunn could have been better as real life boxer Tommy Morrison sometimes appears wooden and is never really threatening enough to Rocky for the final fight to have any tangible tension. Similarly, aside from the final tune of Elton John's 'The measure of a man' the music does not measure up to the awesome and inspirational anthems that have accompanied previous instalments. Any Flick in the early nineties that used rap music as its primary soundtrack has ultimately dated for a modern audience.<br><br>My advice would be to watch this movie in full before you judge it. There are some sad moments in this fall from grace story as well as few goofs in terms of weak acting. But it's not as bad as people say and as the sixth instalment nears completion it's about time everyone got back into the Rocky spirit for one more round.<br><br>A good film. 7/10","user":"jonnyabomb","rank":[137,167]},{"title":"Unfairly overlooked in the Rocky Series.","rating":8,"date":"6 March 2013","review":"Rocky V is deemed to be the worst film of the series and Stallone himself gave it a 1 rating in an interview here in the U.K with Jonathan Ross.<br><br>Whilst i understand Stallone's frustration with how the Rocky saga ended at the time. Rocky V is not a viewing experience without it's rewards.<br><br>Rocky's trip down memory lane to an empty Mickey's gym has to one of the standout scenes in the entire series and whilst the writing isn't on par with Rocky or even Rocky Balboa, you get the sense that Rocky V is back to basics and this is how it life would be if Rocky was a real everyday person and shows the struggles of how he and his family have to adjust everyday life, and how Rocky struggles to reclaim the life he once had, and the father/son relationship that deteriorates, due to Rocky spending all his time trying to live his life through his new protégé.<br><br>Whilst the eventual climatic final street fight between teacher and trainer might not be on a Drago or Creed level, you still find yourself rooting for Rocky and hoping he can fix what he has unknowingly broken.<br><br>Ignore all the reviews that it's poor continuation of the Rocky saga. It tries to get back to basics and for the most part succeeds.<br><br>My advice, give it a chance.","user":"sonofjorel316","rank":[40,46]}]