[{"title":"The best awful film in the world","rating":10,"date":"2 June 2006","review":"You know those films that are blatantly awful but you can't help but love them? Well that's what Evil Ed is, possibly the best awful film in the world. The sound is rubbish, the dubbing is crap, the screenplay is nonsense and the special effects are pap. However, I can't help but love this film dearly and I have recommended it to at least 50 people over the years. Sam Campbell (or the guy who plays him) should be featured on the Actor's Studio series as he is that memorable. Possibly the greatest movie villain not named Tony Montana. Seriously, if you don't expect a lot then you won't be disappointed. Keep a light-hearted approach to watching this film and you'll soon rate it a ten afterwards.","user":"simon_tyers","rank":[15,17]},{"title":"Intellectual? No. Funny? Yes!","rating":21,"date":"21 January 2003","review":"I didn't really rent this movie expecting a intellectual, philosophical movie. I expected a funny, gory splatter film, and I got just what I asked for.<br><br>Edward works for some television studio and cuts out violent stuff from movies and such. That's his job. But when he gets to watch an entire film series of \"Loose Limbs\" and cut out blood and gore. But after awhile he can't handle it anymore and simply goes insane. He starts to see visions of monsters and persons from the films, and in his dreams a bandaged figure tells him to start killing off the \"unpure\". It just so happens that everyone seems to be unpure. After this Ed goes after several persons in his murderous rampage, including his wife, his daughter, a delivery guy, two thieves and a SWAT team.<br><br>The film can be pretty damn gory at times, yet hilarious beyond boundries. Like the doctor scene! Holy crap, that scene is so damn hilarious its just... Hilarious! Its sick too, by the way.<br><br>Edwards boss (Samuel Campbell is his name, a homage to Bruce Campbell and Sam Raimi) is also pretty funny with some funny lines. But Edward is the one with the real one-liners! THey are truly unforgivable!<br><br>\nAnyway, I cannot praise this hilarious movie enough. It gets 8 out of 10 from me!","user":"m0rg16","rank":[11,15]},{"title":"Swedish splatter movie","rating":9,"date":"9 August 2001","review":"This movie is like nothing before in the Swedish movie making business. This is the first and maybe the last swedish splatter movie and therefor a must have for splatter fans.<br><br>This movie is not as gory as Peter Jackson's Bad Taste and Braindead,but this one also got some gory scenes. This is a low budget movie and that explains why there isn't so much gore and spesial fx. The budget was actually only 250 000 swedish kroner. Even though the budget was low they have still managed to make a good splatter/horror movie.<br><br>The things that make it funny is that it parodies many famous horror movies like The evil dead,Gremlins and  many more It starts of like a normal movie and it takes a while before it really gets entertaining. And at the end is the best gore scenes.<br><br>This is a good contribute to the splatter genre,and a milestone in the swedish movie history.","user":"martymaster","rank":[9,12]}]