[{"title":"A little gem","rating":17,"date":"17 April 2000","review":"If you are a Russell Crowe fan like me you owe it to yourself to go rent this early example of his work, which deservedly won many Australian film awards in 1991.  The plot centers around 3 people - Martin (Hugo Weaving), blind since birth and distrustful of the world, his manipulative housekeeper Celia (Genevieve Picot), and Martin's young friend Andy (Crowe), whom he meets early in the movie.  Martin feels that everyone lies to him, even his mother, because he is blind and \"because they can.\"  He takes pictures of his world in order to have \"proof\" that what people are telling him is true. Andy is the person he recruits to describe his photographs to him.  The acting is first rate and the movie is in turn sad, funny, dark, and heart warming.  In the end, Martin learns that although no one is perfect, sometimes you just have to trust in love.  Highly recommended!","user":"Kay-54","rank":[20,20]},{"title":"Early Crowe - total brilliance!","rating":6,"date":"6 June 2002","review":"Aussie Films are much like the Ford Motor Company. They're either a world beater - or mainstream mediocrity! This little offering is the Shelby Mustang of 90's movie-making.<br><br>Weaving is spellbinding (FORGET Agent Smith of THE MATRIX) as a blind photographer who has this unshakeable belief that people lie to him because of his blindness. His world revolves around photographs that others must visually interpret for him. He has a housekeeper that wishes she could do more than housekeep and the day he meets Andy, a dishwasher at the local restaurant, is the first day of a new beginning...but for who?<br><br>Suffice to say, Crowe as Andy shows all the portents of future stardom simply by being Russell Crowe. He is superb without really doing anything. For just a three character film, this is spellbinding stuff (much like THE INTERVIEW). <br><br>No more need be divulged. I would simply say this is one of the best films I have ever seen. It deserved every award it won. This is a 10! See it!","user":"uds3","rank":[34,36]},{"title":"Seductive, compelling, thought-provoking...","rating":10,"date":"12 October 2002","review":"This deliciously enticing bit of cinema from Down Under revolves around the activities of three people: A mistrustful blind man, a desperate, love-hungry woman, a misguided young man, and what happens when these three paths intersect.<br><br>Martin is a misanthropic blind man, whose unshakable mistrust of humanity compels him to compulsively take photographs of everything around him.  So deeply-rooted is his paranoia that he believes his own mother rejected him because of his handicap, and so deceived him in her descriptions of the world.  Martin took a picture--his first--of a garden his mother customarily described to him, as evidence that she had lied.<br><br>Martin's paranoia that anyone might be lying to him has shaped the rest of his life, growing up to become uncompromising and fiercely independent. He behaves callously in his only human interaction--with his rancorous housekeeper, Celia.  Celia is obsessively, possessively in love with Martin. But their relationship is a prickly one, marked with cruelty and malice on both parts.  Martin, aware of Celia's desire for him, uses the knowledge as a weapon--tormenting her by keeping her on, but rebuffing her attempts. In return, Celia spitefully rearranges the furniture so Martin will run into it and exploits his dependency on her to boost her own ego.<br><br>Years later, Martin is still a photographer, but now he wants someone he can trust to describe his first photo to him, thus giving him the 'proof' of a long-dead mother's love.<br><br>This someone happens to be Andy, a dishwasher at a local restaurant.  But when Andy threatens to become too great an influence in Martin's life, Celia, feeling her territory has been violated, sets out to discredit Andy--using her sexuality to control both men.<br><br>\"Proof\" could all so easily have slipped into melodramatic theatrics, but the film skips nimbly along the line, managing to evade all potential traps. Most of the credit is due to the adroit, agile script and the outstanding performances from the cast.<br><br>Jocelyn Moorhouse, the film's director and writer, has the innate gift of comprehending, capturing, and conveying the human condition so aptly, so that the audience is deftly drawn into these characters' lives.  The film doesn't rely on a contrived plot to induce interest; these ordinary characters are intrinsically fascinating simply because of who they are.<br><br>The acting is superb, making for a fabulous ensemble piece.  Hugo Weaving renders a thoughtful performance as Martin, convincingly portraying a man who has closed himself off so effectively against the possibility that he might get hurt, that he has cut off the possibility of feeling.  Genevieve Picot is likewise excellent, marvelously calculating, yet vulnerable as Celia.  And Russel Crowe radiates an already unmistakable and irresistible charisma on-screen in this early role as Andy.  His easy-going, honest, bloke-next-door charm is utterly appealing--a far cry from later roles in \"L.A. Confidential\" and \"Gladiator\", showing his incredible acting range.<br><br>This diabolically clever, enormously witty, and refreshingly original film can be hilariously funny at some times, genuinely heart-rending at others, and an all-round brilliant bit of cinema.  Well-worth a look.","user":"tintinnabulationess","rank":[53,59]}]