[{"title":"Stallone's Finest performance","rating":8,"date":"7 December 2001","review":"Copland is one of those film that gets better and better the more you watch it. The story is gripping and the acting in straight from the top drawer and top of the performances is from Sylvester Stallone. Not normally known for his acting ability, Stallone pulls out his finest performance .To say he is the best in this film is a massive compliment considering the company he performed with in Copland. Robert De niro , Harvey Keitel and Ray Liotta all put in memorable displays , of which you would expect but Stallone still stands out. He plays the sheriff of a sleapy town called Garrison who's occupants are all members of the New York police Department.Because of an accident while saving someones life he is unable to pass the medical to get in the NYPD therefore as a sheriff he is not respected amongst the population of the town.He learns that an influential group of cops are crooked and are planning to kill to save their own necks. Totally Gripping. 8 out of 10.","user":"CharltonBoy","rank":[130,139]},{"title":"Finally, a role that shows Stallone's true talent","rating":8,"date":"28 May 2001","review":"Many people see Silvester Stallone as just another action movie hero who can't do anything but that. However, unlike other action movie stars, (Schwarzenegger, Van Damme, Seigal etc..) Stallone made his breakthrough with a movie that wasn't really an action movie at heart. He gave forth an excellent performance in Rocky and set a standard for himself that just seemed to fall and fall as his career progressed. He starred in cheesy action movie role after cheesy action movie role until finally people began associating him with nothing but that. Now finally, over twenty years after Rocky, Stallone comes back and shows people that he can be more than an action hero if he wants to. Stallone's performance in Cop Land shows vulnerability, anger, admiration, fear and many other emotions that were rarely present in any of his movie except Rocky. I'm sorry to say that I was one of the many people who took Cop Land for granted when it came to theaters simply because I didn't believe Stallone could do anything but cheesy action movies. Today, I finally rented it out of pure curiosity and was shocked at how far I was from the truth.<br><br>Cop Land is a very well made film about a small town that corrupt New York City cops have made their haven. Stallone plays the sheriff of the town, Freddy Heflin, who wanted to be NYPD but couldn't due to a hearing disorder. When Murray 'Superboy' Babitch (Michael Rapaport) shoots and kills two drugged up teenagers when he mistakes a steering wheel club for a gun in a high speed chase, his friends come in to help him. But their far-fetched plan starts to come down on them when Moe Tilden (Robert De Niro) from Internal Affairs begins investigating Superboy's alleged suicide. Things begin to go seriously wrong from here and Freddy is caught right in the middle. I thought that Stallone would have been upstaged by all his great co-stars like Harvey Keitel, Ray Liotta and Robert De Niro, but I was wrong. Stallone comes out perfectly as an aging cop with smashed dreams faced with a moral dilemma he doesn't know how to solve. In many ways he idolizes these big time New York cops but he knows that many of the things they do are wrong. In many ways Stallone's performance is far superior to that of his co-stars as he exhibits more depth and character development than any of them.<br><br>Cop Land is a somewhat unknown gem that many people overlooked for the wrong reasons. If you have any interest in the genre I would highly recommend it. Cop Land is probably the second best police murder/crime drama I've seen, only behind L.A. Confidential. At times the story has something to be desired and unlike L.A. Confidential is drags in some parts but the fantastic performances by every cast member more than make up for these minor flaws. I give Cop Land 8 stars out of 10.","user":"Predator-11","rank":[94,101]},{"title":"My God! Stallone can act!","rating":7,"date":"5 January 2000","review":"Sylvester Stallone is excellent in this slow-moving, absorbing film about cops on the take. Sly goes through what must be one of the longest slow-burns in movie history as the dumb, passive sheriff who only has his job thanks to the grace of crooked cop Harvey Keitel and protects him and his gang because of it. When it finally dawns on him, as it was inevitable it would, that he's been played for a fool, the results are explosive. It's well written, with a strong storyline, great dialogue and excellent performances all round (especially from Robert de Niro, Keitel and Ray Liotta). But it stands or falls  on Stallone's portrayal of the central character, and he rises surprisingly majestically to the occasion. A very restrained, sensitive performance in a cracking good film.","user":"fiozinho","rank":[140,156]}]