[{"title":"An interesting, original and engaging retelling of a classic story!","rating":8,"date":"12 January 2005","review":"Guillermo Del Toro's stylish and original take on the vampire legend is one of the most strangely overlooked and underrated films of the 1990's. It's films like this that make me want to watch films - films that are fresh, unpredictable and so rich in symbolism that it has leaves lots of room for discussion. Del Toro was little more than an amateur director at the time this made, but in spite of that he's more than given the professionals a run for their money. Every scene is adeptly filmed, and the way that Del Toro makes contrasts between locations and the two central families is a pleasure to observe. The way that the film switches language from English to Spanish and back again is indicative of the fact that this is a rich tapestry of contradictions and one that makes intelligent comments on many subjects, from obvious ones such as addiction, to more concealed ones, such as a commentary on family; stemming from the way that the roles of child and parent become reversed when our hero becomes afflicted with the vampire-like curse.<br><br>For the story, Del Toro has taken the classic vampire theme and mixed it with essences of mechanics and the human lust of being able to live forever. The story follows Jesús Gris, an antique dealer that lives with his granddaughter Aurora and wife Mercedes. One day, our hero happens upon a mechanical scarab that latches itself onto his palm, causing him to bleed. Jesús slowly gets addicted to the mystical scarab, but there's someone else that wants it and will stop at nothing to get it. The mythology of the scarab is told in a great opening sequence that sets the viewer up for an intriguing and original horror story. The film retains the intrigue that it sets up in it's intro for the duration, and Del Toro ensures that his audience is always left guessing and wanting to see what comes next. The film works due to interesting characters that the audience is able to feel for, and is constantly interesting by the way that Del Toro handles the contrasts that the story presents.<br><br>On the whole, this is a fabulous horror story that takes an existing legend and makes it it's own. This is exactly the sort of film that cinema needs more of; and it's not one that film fans will want to miss. Highly recommended viewing.","user":"The_Void","rank":[78,95]},{"title":"Fresh, original horror film","rating":21,"date":"21 December 1999","review":"I can't think of many 90's films that will be remembered as classics of the horror genre, this film is an exception.<br><br>When you think of Mexican horror, you no doubt think of the El Santo Vs. the Aztec Mummy type films made in the 60s, don't get me wrong, I like them too. In interviews, director Guillermo Del Toro has said that his influences come more from American and British horror (such as the classic Universal and Hammer horror films) than from Mexico's horror tradition.  Still, the film does have a distinctly Mexican sensibility, especially with it's abundance of Catholic imagery.<br><br>First time director Del Toro, cinematographer Guillermo Navarro (who would go on to do great work for Robert Rodriguez and Quentin Tarantino, among oth ers), and production designer Tolita Figuero create a very unique, interesting look for the film.<br><br>All of the actors are great, especially veteran Argentinian actor Federico Luppi, who plays the main character Jesus Gris, and Luis Bunuel's favorite Mexican actor Claudio Brook, who plays Dieter De La Guardia.  What really makes the film for me is it's quirky sense of humor and odd characterizations, I found scenes toward the middle of the film to be hilarious.  The effective, subtle, score by Javier Alvarez also adds to the mood of the film.<br><br>The film also manages to be a very different kind of vampire story than usual, It makes me think a little bit of the \"Wurdulak\" segment of the great Mario Bava's film Black Sabbath.  Vampire films of late have become very tiresome, it's nice to see someone take a different approach.<br><br>I think Guillermo Del Toro is a talent to watch for.","user":"Eviljomr","rank":[46,59]},{"title":"Interesting and imaginative","rating":6,"date":"6 August 2000","review":"Some of the most imaginative films originate in Mexico.  This one is no exception.   When Jesus Gris, an old antique dealer opens the base of an ancient statue, a golden object in the shape of a large beetle drops out. This mechanically activated object can clutch a human arm and inject a magical fluid which can prolong life.   The early scenes, when the camera moves about the treasures in the antique shop, set the atmosphere and draw us into the story.   Each piece seems to hold a special secret.   When the mechanical beetle suddenly grabs at the old man's forearm, we can feel the excruciating pain as he screams out and we see the pointed legs piercing his skin.   Then follows the injection by the scorpion-like tail.  Terror reigns until he dislodges the device.  (What a relief!).   Now wait for the miracle to happen!   Excellent make-up on the main character as this horror story unfolds makes it almost believable at times.   The sincerity of the acting between the old man and little granddaughter who plays about the shop makes for a really warm and loving relationship.   (Where do they find such wonderful child actors?).   Evil is portrayed by the cruel Dieter de la Guardia and his henchmen who set out to steal this ancient invention of the alchemists.   Much of the excitement of the film is provided by a chase through upper rooms and rooftops (real edge of the seat viewing!).   One of the most unforgettable scenes is the close-up view of the whirring golden cogwheels inside the device.   They make a cruelly fascinating and threatening sound as they wind up to do their mysterious work.   Movie-goers who have a horror of hypodermic needles should perhaps give the film a miss but you brave ones will enjoy the age-old theme of searching for the secret to eternal life.","user":"raymond-15","rank":[32,41]}]