[{"title":"Deleted scene?","rating":8,"date":"8 October 2005","review":"I just bought the DVD of this film and was surprised to find that a graphic scene was removed from the early moments. I remember from seeing the movie in previous times (on television) that when Laura and Martin come home from the party, he begins his little \"love-making\" session. We see from Laura's expression that her husband is really raping her. This scene is not on my DVD; it ends right after Laura drops the bowl of strawberries. Why was the scene taken out for the DVD? Perhaps there are enough other clues to Martin's true nature but it is odd that this scene, which is one of the first to clue the audience in to the menace of the situation, is missing. The implications of Martin's favorite music and the Pavlovian horror it instills in Laura is somewhat cheapened by the deletion of the rape scene. I know that there are sometimes different edits of films when they are released on television, but I would have expected this sex scene to be taken out for TV, and not for the DVD!","user":"JumeirahSun","rank":[22,26]},{"title":"Let's answer some of those questions","rating":8,"date":"13 July 2007","review":"I love this movie! I read the book and have seen it many times. I note that the same questions keep appearing over and over. I think by now I am qualified to answer them, or to at least give my opinions.<br><br>**Why does Laura choose to 'flush' her ring down the toilet instead of taking it off while she is in the ocean or pawning it?** Because she is symbolically ridding herself of Martin and their dysfunctional marriage. She is in a hurry to get out of the house and never stops to think that the ring might remain in the toilet bowl. Under the circumstances, would you? <br><br>**How did the lady from the YMCA get Martin's work number? And after Martin said he didn't know what she was talking about, why did the lady continue to give Laura's life story?** Martin was a successful Boston businessman. Laura took swim lessons at the Y in Boston for several months and apparently got to know some of the women fairly well. Her name and her husband's name were undoubtedly well known by the time she finished her swim lessons and moved on. It probably only took a look in the Boston phone book to find Martin, as Laura had nothing to hide at the time of the swim lessons (except the bruises, which she explained away) and surely mentioned where he worked, or he had an individual listing. The lady was certain she had the right person when she was talking to Martin, so unfortunately she developed diarrhea of the mouth and provided Martin with too many details.<br><br>**Why was the ring still in the toilet when Martin cut his finger months later? Didn't he use the toilet in those months? Or does he have a serious digestive problem?** I am surprised so many people overlooked this: the house at the Cape was the Burneys' weekend/summer home. Martin Burney worked in Boston, and they had a house there where they lived during the week. When his wife \"died\", Martin immediately closed up the Cape house - hence the coverings on the furniture when he returned months later - and moved to their house in Boston. Guess he didn't have to pee before he left, or he used one of the other bathrooms in the house.<br><br>**How did Laura get a house under an alias without a driver's license? What...in Iowa you don't need identification to buy a house or a car? And where did she get the money?** Laura did not BUY a house, she rented it, and for very little, in cash. She apparently bought a used car. As we saw when she returned to the Cape house after faking her death to collect her things and run away, there was a big wad of cash in her travel bag. I don't remember all the details from the book, but obviously she had been saving money all along. She worked part-time at the library in Boston (after her 8:00 a.m. swim lessons, one presumes), so had her own money as well as whatever she could save from the money Martin gave her for groceries, etc. Money talks, in Iowa like anywhere else! <br><br>**Just because Laura didn't want to have sex with Ben, Ben asks \"Oh my god, what did he do to you?' How the heck does he know that anything happened? What does he have as evidence besides the facts that he called her in a crowd and she didn't respond, and she had a bruise on her head? That's a pretty great assumption to make.** Ben was a perceptive, intelligent guy. He knew right after meeting her that something was seriously wrong in her life and that she was hiding her identity for a reason. He put things together pretty quickly, but figuring out that she was running from an abusive man wasn't exactly rocket science with all the clues she gave out.<br><br>**And the thing that really makes me mad. She hears a noise so it must be her husband. Instead of calling the cops or running out of the house...she goes and checks the cabinets to see if all of the cans are neatly arranged. I know that this does happenbut if your husband was in your house, what the heck would make you think that he took the time to arrange your cabinet and he's not just going to kill you?** The man had been terrorizing her for four years. She was paranoid. She wasn't thinking clearly and was doubting her sanity. Call it Suspense Movie Syndrome - just gotta look in that dark room/closet!","user":"hawk-58","rank":[69,93]},{"title":"By-the-numbers thriller is boosted by good performances.","rating":6,"date":"8 December 1999","review":"I think most people tend to overlook how well-done the first 20 minutes of this movie really are. Ruben carefully builds a creepy atmosphere, relying on brief glances, moments of silence and quietly expressive performances (especially by Julia Roberts) to help the viewer understand that, behind the image of a perfect couple, something is really wrong. Unfortunately, after Roberts escapes from her husband, the movie turns into a strictly by-the-numbers thriller, where you can predict almost every development of the script. It's a visually polished movie, though, and the very good performances give it a strong psychological center that keeps it above-average.","user":"gridoon","rank":[52,69]}]