[{"title":"Could've been an absolute bomb, but somehow magically works perfectly!","rating":7,"date":"30 April 2001","review":"this film is ridiculously unbelievable, thin on plot, shamefully predictable, historically inaccurate in so many ways...yet it all works! The combination of modern music to medieval setting should be awful, but no, it works! The costumes are totally wrong for the period (on purpose I'd hazard to guess - at one point Angelina Jolie lookalike Shannyn Sossamon is wearing a hat &amp; dress outfit that looks startlingly similar to a costume Julia Roberts wore in Pretty Woman...) but it works! Heath Ledger is an Aussie (what happened to the black hair he had in 10 Things I Hate About You! I didn't recognize him!) and Alan Tudyk is a Texan, so their accents should have tanked! But they didn't, just a few slippages a la Mel Gibson in Braveheart or Jonny Lee Miller in Hackers...<br><br>This film is funny, fast-paced (certainly didn't *feel* over 2h...), well constructed, hilariously tongue-in-cheek (From the We Will Rock You opening scene to the Nike swooshes on the armor I couldn't stop laughing!) It certainly has its problems (including some *horribly* cheezy lines - most on purpose but that doesn't make them any less horrible! and an evil Hollywood ending - including a Bravheart-like scream of defiance in the final joust that made me cringe...) but those problems are overcome by sharp wit and consistent amusement. The actors were obviously enjoying themselves, and the action was beautifully blended in with the rest of the film. None of the jousting scenes were too long (like, say, the race in Phantom Menace...) and all were shot in such a way as to make them really exciting!<br><br>And I have to laud Paul Bettany who was an incredible and incredibly amusing Geoffrey Chaucer...even though he looks eerily similar, IMO, to Thom Yorke...)<br><br>Kudos to anyone who recognizes Laura Fraser (the blacksmith) from Man in the Iron Mask...<br><br>Overall: A great watch. I went in expecting little and came out extremely satisfied. Not the best film of its kind, but a head above most. And the blending of contemporary style and music and characterization with the medieval story/setting is really well done. It really shouldn't but it does work! 7/10.","user":"kergillian","rank":[219,255]},{"title":"Makes Braveheart Look Historically Accurate","rating":9,"date":"15 November 2002","review":"I first saw \"A Knight's Tale\" by chance.  A few of us had decided on an ad hoc visit to the local cinema and selected \"A Knight's Tale\" simply because it sounded the least \"teen\" movie on the bill.  We slapped down our cash and took our seats.<br><br>The movie began...<br><br>A crowd of peasants are assembled to watch the jousting.  And they're singing \"We Will Rock You.\"<br><br>My initial response was \"God, this is going to be bad.\"<br><br>But as the movie continued, it suddenly dawned on me - I wasn't hating the movie at all!  On an intellectual level, I should have been booing and throwing stuff at the screen but there's something about the sheer verve and energy of \"A Knight's Tale\" that just drags you in on an emotional level.<br><br>\nA clever script with many modern references, a good cast of likeable characters and a fantastic soundtrack (the reveal of \"Golden Years\" is particularly good) all add up to make \"A Knight's Tale\" one of the most entertaining mainstream movies I've seen in a long time.<br><br>Normally I hate \"popcorn\" movies - not because I consider them \"low brow\" or an insult to the intelligence, but because they're shallow, tired and lack soul.  Yet \"A Knight's Tale\" is different.  No, it won't change your life and it won't make you ponder your place in the universe.  But it will entertain you.<br><br>If you're looking for an \"old fashioned\" good vs. evil movie with a twist, or your copy of \"The Princess Bride\" is wearing thin, check out \"A Knight's Tale.\"<br><br>8/10","user":"Iok","rank":[122,140]},{"title":"Entertaining","rating":9,"date":"3 February 2005","review":"This comment is to counter those who have issue with modern rock and other time problems being in this movie. This movie was designed to entertain. It was NOT a historical piece and nowhere does it claim to be one. This is the story of a boy who aspires to be more than what society set out for him. The movie uses odd references to history's great figures and humor to bring its story across to the viewer. So I say that, for those of you who cannot enjoy a piece of entertainment due to its well placed use of anachronisms, I strongly suggest you stay away from any of Shakespeare's works. (Not to say that this movie was on level with Shakespeare...) The makers of \"A Knight's Tale\" set out to entertain, and did so dutifully.","user":"Danny_kahn","rank":[204,248]}]