[{"title":"Beautiful Imagery in a Mountain Temple, Slow Story","rating":7,"date":"2 November 2007","review":"Made at the same time as the ghost film, \"Legend in the Mountain\", \"Raining in the Mountain\" is in some ways a more traditional film for King Hu. His aesthetic is old fashioned in some ways and more akin to the New Wave of Mainland China. Regardless he tries to experiment and that's what makes a King Hu film fascinating to watch.<br><br>An ailing temple Abbot has summoned his best laymen friends to assist in the choosing of a new Abbot from among the monks. One a businessman brings along a woman and a servant. Another, who is a general and district governor brings along a shady lieutenant. Both friends seem to have ulterior motives in their visit and that turns out to be the theft of a rare scroll kept in a storeroom. In addition, another friend of the Abbot arrives. He is an elderly man who, despite being a layperson, has a deeper understanding of Buddhism then most monks. Oddly, he is accompanied by dozens of women who carry his palanquin. Finally, by coincidence, a convict is delivered to the temple to be reformed into a monk. The cast of characters is assembled.<br><br>First off, for all fans of King Hu martial art extravaganzas, there are only three fight scenes in the whole film, the first being at 50 minutes in, a second short fight about fifteen minutes later and the third extended fight about 1 hour and 40 minutes in. They are all well done in King Hu's abstract but lively style. There is more going on in this film than an excuse for action. <br><br>It takes about ten minutes before we have any idea about the story of the film. Up until then it's a series of attractive shots of mountains, fall foliage and eventually the temple while the businessman and his entourage travel. The photography in this film is great from beginning to end. The Chinese traditional inspired music is very good as well. The story is good despite some plot holes and some predictable twists. The Buddhist philosophy and the dialog were very interesting to me.<br><br>Overlong at 2 hours and missing dramatic tension at the climax, it's still an above average film from Taiwan. I am not sure what the \"raining\" in the title refers to since it's bone dry for the entire film except for one shot at the beginning.","user":"ChungMo","rank":[17,17]},{"title":"Raining in the Mountain","rating":9,"date":"24 August 2010","review":"Sometime during the Ming Dynasty in China, the elderly abbot of a remote Buddhist monastery is aware of his impending death and trying to decide which one of his monk disciples would be the most suitable to become his successor. To help him decide, the abbot has invited three guests to the monastery: a wealthy merchant Wen (Yueh Sun), a powerful General Wang (Feng Tien) and a wise scholar Wu Wai (Chia-hsiang Wu). The first two have more on their minds though, as both are after a priceless scroll of wisdom that is hidden in the monastery's library. Wen is assisted by two master thieves, the female White Fox (Feng Hsu) and a quiet man called Gold Lock (Ming-tsai Wu), while Wang has the local police chief Chang Cheng as his sidekick. The monks of the monastery also have their own ideas regarding the abbot's decision, and many schemes and clashes follow when everybody pursuits their own personal goals.<br><br>Director King Hu's calm, beautiful style becomes evident immediately during the first scenes of the film where Wen and his assistants are walking towards the monastery; the gorgeous scenery, grandiose music and flowing, long costumes all set the mood for the whole story. The large monastery itself looks wonderful too and provides an excellent backdrop for the plot that is about to start. Among the best scenes is White Fox and Gold Lock's long run through the yards and hallways to the library, all the while avoiding the monks by quickly jumping out of sight and hiding in whatever place is available when anybody passes them. As all this is presented with little dialogue and only accompanied by highly atmospheric percussion and zither-driven music, the whole sequence ranks among the most suspenseful I've seen in a long time.<br><br>Even though the film may have been advertised as a martial arts tale, the fighting is rather sparse (the first clash only occurs 50 minutes into the story and the action properly gets going only at the very end). The stylized ending battles in the autumny forest are excellent though and more than enough to satisfy any wuxia fan. Besides the fights and the sneaking sequences, the huge group scenes with hundreds of monks at the front yard look marvelous too. The film's dynamic direction, camera work, mise-en-scène and cinematography are so consistently jaw-dropping that it is really difficult to find anything to criticize in the film; everything is in perfect balance. The comedic scheming of Wen and Wang, the complaints of the disgruntled monks, the wire-work during the fights, the bright colours everywhere... just magnificent.<br><br>The underlying theme of Raining in the Mountain is the importance of giving up any feelings of greed in the spirit of Buddhism. Wen and Wang's obsession about the supposedly priceless scroll doesn't help them to achieve happiness, while the abbot repeatedly mentions that the scroll's power lies in its written message, not in the object itself. With so many thoroughly enjoyable details in one movie, the two hours of its runtime practically fly by when watching the film. In brief, Raining in the Mountain is heartily recommended to anyone with even a faintest interest in Asian cinema.","user":"random_avenger","rank":[8,8]},{"title":"One of the all time most stunning movies comes from China's greatest director.","rating":2,"date":"2 March 2006","review":"It's amazing that a film as accomplished as this can fade from the collective memory - or at least the IMDb as a representation of it.<br><br>At a time when the Hong Kong industry was churning out its most popular product to a schedule, their greatest director King Hu took his crew off into a remote area and filmed this and LEGEND OF THE MOUNTAIN both featuring his elegant star and producer to be Hsu Feng.<br><br>Don't let anyone kid you that this is a work of art removed from the crass commerce of the Shaw Brothers and the rest but it is one clearly more seriously undertaken in the same tradition of the swordsman film.<br><br>They build up to the acrobatics in a way that gives them, if not plausibility, at a least suitable place in the film. The one piece if violence - White Fox murdering the lieutenant - is neatly turned into a grim joke. Plausibility is also derived from the detail of monastery life. No kung fu monks here. The inhabitants are spooked at the thought of working for a living too.<br><br>However this and the robbery plot are secondary to the beauty of the wide screen imagery, with each position in a camera movement a perfectly judged composition. The viewer carries away a sense treat memory of fabric, stone, foliage and water inhabited by attention getting characters.","user":"Mozjoukine","rank":[17,21]}]