[{"title":"Atmospheric and well acted, a bit of a sleeper.","rating":7,"date":"15 May 2009","review":"Kevin Costner in his early days managed to convey a rawness to his characters that was seldom seen after he made \"Dances with Wolves\" and became a successful producer. Films such as \"No Way Out\" (1987), \"Bull Durham\" (1988) and of course \"Revenge\" (1990) showed him when he was trying to establish his career and you could feel the actor at work rather than the movie maker.<br><br>In \"Revenge\" Costner plays US Navy pilot Michael \"Jay\" Cochran who is retiring after 12 years in the service. He seems to have lost direction and wants to take some time out for himself. He plans first to go and see his old friend and Tennis partner Tiburon \"Tibby\" Mendez (Anthony Quinn) who is a powerful mob boss in Mexico. Exactly why they are friends is a little unclear but it seems that Tibby owes Jay a debt for saving his life at some point in the past. Once Jay arrives at the Mendez Hacienda he meets Miryea (Madeleine Stowe) Tibby's wife. Instantly attracted to one another and although initially fighting the chemistry between them, they begin an affair, which comes with massive consequences.<br><br>This film has elements of \"The Wild Bunch\" (1969) to it and the location shooting in Mexico adds so much to the atmosphere and tensity of the story. There are seamy and claustrophobic qualities to many of the situations which are enhanced beautifully by the background. The acting is nicely understated, Costner manages to display a barely restrained anger throughout the second part of the film and Anthony Quinn is convincing as the superficially charming but totally ruthless mobster. Madelaine Stowe is OK as the female lead but struggles with a Mexican accent and seems a bit uncomfortable with the innocence that her character is supposed to portray.<br><br>\"Revenge\" was commercially unsuccessful but is one of those movies that deserves to be seen. Costner, being an actor of limited range, was always best at these type of roles. When he behaves rather than acts, you get to see the best of him.<br><br>If I have any complaints, I believe the denouement of the story, although certainly interesting, doesn't quite fit. The build up to it promises something more of a violent showdown and the character of Jay would seem by this point to be poised to take his \"revenge\". Perhaps the downbeat finish was done to avoid \"going Hollywood\" with a big finale and as i mentioned it is certainly effective, but leaves a general feeling that there is business still to be done.<br><br>An interesting and entertaining movie that is well worth viewing.","user":"RedRoadster","rank":[44,49]},{"title":"Highly underrated","rating":7,"date":"12 March 2000","review":"I'd avoided this film for years, despite being a huge Costner fan, because people had described it as nearly unwatchable.  On the advice of someone on the internet, I gave it a shot, and what a surprise! Although it'll never be one of my favorite films, it's certainly worthwhile, a highly engrossing (albeit graphically gory) trip through a wide and shifting range of emotions.  Quinn gives his best performance since \"Zorba,\" and Costner and Stowe are extremely good. The photography is extraordinary, and Mexican music has seldom been used so effectively.  I'd recommend it to anyone with a strong stomach.  The love scenes, by the way, are romantic AND sexy, a rare combination.","user":"billy-7","rank":[43,55]},{"title":"Clichéd, pulpy source material elevated by fine filmmaking and performances","rating":7,"date":"7 April 2015","review":"As spotty as Tony Scott's filmography was, it's easy to forget how good he could be. This is my first time seeing REVENGE and I must say that I was surprised by how emotionally involving and artfully directed it was, despite relying on a number of genre clichés. Kevin Costner plays Michael \"Jay\" Cochran, a 12-year Navy veteran who has just left the service and goes to see his friend, Tiburon Mendez (Anthony Quinn), in Mexico. While there, he ends up falling in love with Tibey's (as his friends call him) beautiful, young wife Miryea (Madeleine Stowe). When Tibey finds out about this, leaves Jay for dead and throws Miryea away in a whorehouse. The remainder of the film is Jay going back to rescue Miryea. Hopefully I haven't given too much away, but the film is 25 years old and there has to be a statute of limitations on spoilers, even if they're small. Since I liked more than I disliked, I'll just get the negative stuff out of the way first. I mentioned earlier that this film relies on genre clichés. One such example, and very key to establishing the central character relationship is the history shared by Tibey and Jay. Apparently, they were hunting buddies and Jay saved Tibey's life one time, so now Tibey is in debt to Jay. That's something that's been done to death in countless films before and since, but it wouldn't be such an issue if that wasn't the extent of it. It was just hard for me to buy that a Navy pilot would have it in so good with a Mexican power broker/kingpin. I also thought the romance that develops between Jay and Miryea was rather cliché, even if it was well-performed. And to be fair, this movie has some great performances in it. Kevin Costner was his usual likable self, and veteran actor Anthony Quinn was great as his world-weary foil. Madeleine Stowe did fine, but isn't given much to do besides be the damsel in distress once confined to the whorehouse. Now, on to the positives (the rest). This is probably one of Tony Scott's best-directed films, and came a decade or so before he started using his much ripped-off MTV shooting style. There were some really artful shots, e.g., a fire being reflected in sunglasses or beautiful shots of the Mexican terrain. Even the sex scenes were shot well. I also really liked the score, which struck a fine balance between melancholy and tension. But most of all, and despite the clichéd elements, the characters were well written and developed, and the performances really elevated the rather pulpy source material. Overall, REVENGE is an artful, occasionally thoughtful action thriller that probably deserves more attention than it got/currently gets. It might have a shaky dramatic foundation, but it's definitely worth seeing for what's built around and on top of it.","user":"brchthethird","rank":[7,7]}]