[{"title":"Sadly Prophetic","rating":8,"date":"11 February 2018","review":"It might not qualify as a masterpiece, but this film is so criminally underrated I just had to write this short review. The Siege is a dark, sadly prophetic, gripping thriller with an amazing cast. For reasons I will never understand this film was accused of having a racist message (probably by people who hadn't even seen it) although its intention very clearly is to convey anything but. But check it out for yourself; Denzel Washington and Bruce Willis are so good in this that their performances alone already make the film worthwhile. 8 stars out of 10.<br><br>In case you're interested in more underrated gems, here's some of my favorites:<br><br>imdb.com/list/ls070242495","user":"gogoschka-1","rank":[72,78]},{"title":"Eerily prescient.","rating":21,"date":"21 August 2004","review":"This film, made in 1998, is so close to the reality of Sept. 11, 2001 that it sends chills down your spine.  Although events played out differently, so many elements in the film are near-mirror reflections of the reality.  The attacks are carried out by Islamic extremists, whose core network were trained by the CIA, their attacks were dramatic and centered on New York City, there was little cooperation between, the FBI, CIA and military, and Arabs and Arab-Americans were rounded up in large numbers, or were subjected to harassment and violence.  The images of bodies and debris are no less shocking than the sight of people jumping to their death from the World Trade Center.  Torture was employed by US soldiers, in pursuit of terrorists.  With all of that said, even had the attacks of Sept. 11th not occurred, this would still be a tremendous film.<br><br>Director Ed Zwick and actor Denzell Washington team up once again for a great one-two punch.  Denzell brings great humanity to his role as an FBI agent, charged with counter-terrorism operations and investigations.  He is aided by Tony Shalhoub, who delivers another great performance and some of the best lines.  Annette Benning displays her talent as a CIA operative at the heart of the whole crisis.  Roger Deacons adds his wonderful cinematography, and Bruce Willis turns in a fine performance as an over-zealous army general.<br><br>The film delivers a cautionary tale about extreme reactions to terror and the loss of freedoms that can result from acting in anger, rather than with reason and law.  The rounding up of citizens, as depicted in the film, and the declarations of martial law, are not that far away from the provisions of the Patriot Act, which violates First Amendment rights, the right to privacy, and the right to due process.  The film suggests that by giving up these rights, or stripping them away, we become the very thing that our enemies claim we are. It suggests that that may be the terrorists true aim.<br><br>This is not a crystal ball prediction of 9/11; but it is a fine thriller. The filmmakers did their homework and got quite a bit right.  They also extrapolated things to an extreme, but not an implausible one.  However, they delivered an excellent film, and one that should be seen and studied.","user":"grendelkhan","rank":[154,181]},{"title":"Still stands up","rating":7,"date":"20 November 2003","review":"I remember hearing about this film before its release.  It had caught a great deal of flack for its use of Arabs and Muslims in particular as violent extremists.  Even at that time I knew that the protests against this film were nothing more than politically correct nonsense, as even then the only trans-oceanic terrorists that existed were of the fake-Muslim variety that today we hear about every hour.<br><br>When I saw the film, I was impressed by the fair nature of the film, in that it portrayed the truth:  these extremists exist in the overwhelming minority of Muslims, and that it is unwise and unfair to paint them all with the same brush.  With a very good script, excellent performances and exciting action pieces, I was impressed.<br><br>Jump ahead a few years, and we see what we have learned.  This film was not just an intelligent story.  It was a warning sign.  It examined things that people did not want to talk about.  It examined things that people thought it more politically correct to ignore.  It portrayed events realistically and in fact far less devastating than what was possible.  If there is one thing that can be learned by examining a film such as this in retrospective of recent events, it is that our species chooses to ignore that which it does not want to accept.<br><br>Those who do not learn from their history are doomed to repeat it. Perhaps there are other subjects we should stop being so PC about and actually talk about instead of worrying about \"how it will look.\"","user":"Surecure","rank":[179,214]}]