[{"title":"You must watch this film at least once.","rating":10,"date":"2 April 1999","review":"This is an incredible film documenting the American nuclear weapons development program, from its first stages to the end of atmospheric testing in the early 1960's. The music is haunting, and the film of the nuclear explosions will leave you spellbound. You reach the end of the film haunted by the power of the nuclear devices, yet you want to see more. This movie is a \"must-see\". Everyone in the whole world should watch it at least once, and understand the power we have unlocked in the nucleus of the atom. Fortunately this film doesn't attempt to put a political spin on the use or development of nuclear weapons, but seems to document them very objectively. The viewer is left to determine whether or not the nuclear arms race was worth it.","user":"NetHead-2","rank":[39,43]},{"title":"A fascinating and visually stunning history piece","rating":10,"date":"3 November 2003","review":"This ranks as one of my all time favourite documentaries. Trinity and Beyond's wealth of information is only overshadowed by its visually stunning presentation. Beautifully crafted, this film is not only an informative documentary, but truly is a work of art. It is perfect in every regards, from the laborious undertaking of restoring all of the test footage, to the insightful presentation of interviews, to the excellent choice of William Shatner as narrator (something he has a true talent for), to the beautiful musical score. I have absolutely no trouble recommending this film to anybody.<br><br>Reading over the negative reviews in this forum, I think that many people who dislike it have missed the point. Sure, we have all seen images of buildings being blown over and vehicles destroyed, but never before has it been presented in such a comprehensive manner and in such a way as we see the actual progress of nuclear weapons.<br><br>Watching this film, you see the development of nuclear weapons in a way where you can finally get a grasp on exactly how powerful the explosions are. Watching the first Kilotonne detonation of TNT, and then following the testing of every device from that point on, this is the most comprehensive view of exactly how far along nuclear weapons have come. Showing a 10 Kilotonne explosion followed by a 10 Megatonne is not nearly as impressive or understandable in terms of perception as when you see every step along the way as well.<br><br>This is a must-see, not only for anybody who wants an understanding of what nuclear weapons are truly capable of, but for anybody who appreciates beautiful film-making.","user":"Surecure","rank":[32,38]},{"title":"Money well spent--A terrific documentary","rating":10,"date":"8 December 1998","review":"A superbly written and well-produced documentary on the history of American nuclear weapons.  Impressive for the quality of archival color footage, William Shatner's competent narration, and the film's haunting musical score.  Chronicles nearly every U.S. nuclear test program, from Trinity to the end of atmospheric testing in the late 50s.  Also includes footage of the Soviet's 50-megaton \"super bomb\".<br><br>Trinity and Beyond carefully avoids overwhelming you with meaningless dialogue.  Instead, Shatner introduces each chapter sparingly, then allows you to sit back and absorb the spectacle of the explosions while listening to the score.  The result is a perfect blend of sight, sound, and historical background. Overall, a terrific documentary and a definite must-buy for the history buff in your family.","user":"Iceman-35","rank":[25,31]}]