[{"title":"Asian documentary","rating":8,"date":"31 July 2005","review":"Since there aren't many comments of this film I decided to give one. Since I was, and still am, fascinated with the life of Bruce I started to see a couple of documentaries of him. This documentary captures his life very well although it's from an Asian point of view. No surprise since it's an Asian documentary. You see former gung-fu teachers speak, his house in Kowloon, his family history, etc. If you are interested in this, this documentary is the best out there. Especially interesting, and unique to this documentary, is the 15 minutes of footage of his funeral that you see in the beginning. No other documentary I've seen has this. It's fascinating to see. You see a lot of famous Asian faces you don't see in other documentaries, like Bolo Yeung and a very young Sammo Hung.<br><br>What I've learned, seeing a couple of Lee's documentaries, is that there isn't a best one. 'The life, the legend' focuses a lot on his life in Hong Kong, 'A Warrior's Journey' focuses more on the message Lee was trying to pass on and 'The Immortal Dragon' focuses more on his life in America. All combined gives you a pretty good picture of the life Lee had. The BEST documentary still has to be made in my opinion.","user":"Roy Teng","rank":[14,15]},{"title":"bruce lee, the man and the legend [spoilers]","rating":10,"date":"7 July 2003","review":"this was made in hong kong by golden harvest. It starts off showing a lengthy 15 minutes of footage from bruce's funeral. showing the streets packed with thousands of mourning fans, basically everyone who knew bruce lee with the exception of run run shaw and betty ting pei is here, everyone bows to bruce in a bronze coffin, before his coffin is brought out. then after the funeral, we see bruce's house in kowloon tong, showing loads of bruce's possessions, like his stereo, paintings, weights and even his dog. then we see very rare pics (only seen on this documentary). followed by bruce's lee's former masters talking about bruce. later bruce himself is talking about the concepts of the movie: game of death. The best bit is where it shows loads of pics of bruce flexing all put together like an animation. He's bearded and topless and as always looks harder than steel. again, it shows pics of bruce in his cantonese period costumes. followed by some more film clips near the end.<br><br>must have documentary, 10 of 10.","user":"lionel2","rank":[8,8]},{"title":"Not bad but not comprehensive.","rating":6,"date":"11 August 2018","review":"This must have been the first documentary on martial arts legend Bruce Lee. It was filmed not long after his untimely passing and before the release of \"Enter the Dragon.\"\n This isn't without merit but a lot was omitted. No mention of Bruce Lee trying to make his own version of \"The Silent Flute,\" (would have been interesting to see) no reference to how Lee came to form Jeet Kune Do and scant details about his rebellious childhood. Rather disappointed by all this. \n The photos of him testing for various film roles for a proposed project with the Shaw Brothers in 1972, are quite interesting. Judging by the above, Bruce Lee looked a natural for Asian period martial arts movies. If only it could have come true..........\n There are some good clips from his films but my favourite is when footage of the original version of \"Game of Death\" is shown. Superb.\n Documentaries like \"I am Bruce Lee\" and \"The Legend\" are a lot better though.","user":"alexanderdavies-99382","rank":[0,0]}]