[{"title":"A film that tackles blackmail and race relations in the LA sheriffs office","rating":26,"date":"26 December 2000","review":"This was a great low budget police film about corruption in the LA sheriffs office. The film revolves around a young black cop, who stumbles onto a corruption case invovling police brutality towards minorities. The film also highlights just how easy it is to get blackmailed by people who are supposed to be on your side. THE GLASS SHIELD while lacking the stigma of bigger films like LETHAL WEAPON, tells a human tale about a cop and his female partner, however, I feel Lori Petty's role could have been bigger. There was another part of this film that touched on something briefly, sexism on the law enforcement circuit. The trailers for thisa movie suggest it was edited heavily and that the character played by Ms. Petty played a significantly larger role in that version. The logical direction for this film would to have been having the black cop and the woman police officer piercing the layer of corruption together in lA. A great film that tells a stroy from a african american point of view. The film also highlights the conflict within the african american/black community towards police and police brutality and how it is hard for even them to sometimes accept black police officers. An interesting film with a interesting and powerful premise. Don't expect a 600 rd. shoot out with \"yuck yuck\" laughter and Riggs and Murtaugh in this one...expect substance.","user":"LONE SOLO: CRITIC","rank":[16,19]},{"title":"An Excellent Film","rating":7,"date":"7 May 2000","review":"Being that I was only thirteen when this film came out, I vaguely remember the promos for THE GLASS SHIELD.  As usual, the Hollywood establishment misrepresented this film during its release and I fear no one saw it, and those who expected 1) Ice Cube to have a huge role or 2) Lori Petty to get naked were severely disappointed.  (I think this came out very close to CLOCKERS, too, which might have confused some people.)<br><br>\nI've been hearing a lot of underground talk about Charles Burnett, lately, so I picked up this film (thinking it was a usual cop-meets-gangsta film previous to my knowledge that Burnett directed it.)  I must say that it is an excellent, incisive picture that manages to duck every convention one expects from Hollywood.  I was reminded of IN THE HEAT OF THE NIGHT, but this was without the Mr. Tibbs-like over-the-top innocent; JJ (an excellent Michael Boatman) is truly a real character, with real guilt and real problems.  Ice Cube plays his role well, and Lori Petty is good, but it is the creepy fraternity of mustachioed white cops that makes this film truly frightening.  They are bad, but not outright evil; they are, instead, men too pumped up on the power of the badge and the sidearm and the encouragement of their peers.<br><br>This is a riveting film with less than two \"action\" scenes; the tension exists instead in the idea that terrible violence awaits every character at every turn, and when the higher-ups descend to the levels of insane criminals, we realize the significance of the title, and the vulnerability of peace.<br><br>Highly recommended.","user":"Craig-32","rank":[16,19]},{"title":"Still relevant, still excellent","rating":10,"date":"24 May 2005","review":"I just saw _The Glass Shield_ for the first time since it was released theatrically. I'm very glad to say it hasn't gone stale with time. Despite the violent overtones, the film is a subtle and compelling parable on race, power, and sex in the US. It won't satisfy anyone with the attention span of a fruit-fly or a fetish for blood and guts, but it gets under your skin (so to speak) if you pay it the slightest bit of attention.<br><br>As a side note  this is one of the very few feature films chosen by the Whitney Museum of American Art for its biennial surveys of contemporary art (there was another film that year as well, _The Hours and Times_, also excellent).","user":"kid_clementina","rank":[17,22]}]