[{"title":"The BEST martial arts movie EVER","rating":10,"date":"13 September 2000","review":"This is it.  The single greatest Kung Fu movie ever made.  This is the ultimate Kung Fu movie with the ultimate Kung Fu star, Jackie Chan.  His entire career has culminated in to this one, great opus.  Jackie performs feats of physical agility that will blow your mind, despite being about 40 years old when he made this movie.  The story is about the fabled fighter Huang Fe-Hung who encounters corrupt industrialists that are exporting some of China's greatest historical treasures to increase their profits. Naturally Fe-Hung takes up the fight against them, and faces the deadly Ax Gang and finally a dangerous Tae Kwon Do stylist in the movies eye popping final fight scene.  (That Tae Kwon Do fighter is actually Jackie's real life body guard.  He stepped in as the chief villain because Ho SUng Pak hurt his ankle and was unable to perform the complicated fight sequences required.)<br><br>Fe-Hung doles out justice throughout the film with his unique fighting style, drunken boxing, despite ridicule by his opponents, insisting that drunken boxing is inferior.  Needless to say, Jackie proves them wrong.<br><br>Historically speaking, the real Huang Fe-Hung did not use drunken boxing at all.  In fact, he was a practioner of the much more effective style of Kung Fu called Hung-Gar.  And his exploits can be alikened more to the Jesse James of America's old west.  But Fe-Hung was more commonly found fighting for the underdog and battling tyranny.  However, of all the innumerable depictions of Huang Fe-Hung \"DRUNKEN MASTER 2\" is by far the best.<br><br>This movie can be described as a \"Big Budget\" Kung Fu movie, done in a very traditional period style.  The cinematography, direction, action sequencing, writing, and story line are all TOP KNOTCH.  There has never been a Kung Fu movie made that is \"better\" than this one.  And there has never been better fight choreography.<br><br>As you might well expect, there are some breath-taking stunts.  And this is the movie that has the fire stunt responsible for Jackie's skin graft on his arm.   He did not get burned so severly until the THIRD take!  He wasn't happy with the first two.  And if that is not painful enough to watch, then check out the fight against the Ax Gang, when one member gets knocked of the up-stairs portion of the restaraunt and slams into a cross beam before smashing in to the floor.<br><br>If you are looking for the best martial arts flick ever, this is it.","user":"jake-179","rank":[72,81]},{"title":"Easily one of the greatest martial arts movies in any place or any time","rating":10,"date":"24 September 2000","review":"Well, Jackie Chan has had an interesting career. On one hand, he's made some classics like Project A and Dragons Forever. On the other hand, he's made some less-than-spectacular movies like Crime Story and First Strike. This movie is easily his best film ever...and also one the best martial arts movies ever made. He revisits the role that made him famous: Wong Fei Hung, the drunken master. The plot deals with smugglers trying to steal China's treasures, but in the end it isn't important. The fights are what matters, and Chan fights like a son of a gun. There are some excellent traditional fight scenes like him fighting Lau Kar Leung and one w/ a Choy li fut stylist. There's a memorable fight against an Ax Gang (Ax army is more like it). The finale, where he takes on the smugglers led by a super kicking Thai boxer, is probably the greatest fight scene choreographed. This movie doesn't cease to entertain. A must see for any fans of action, martial arts, HK movies, or just Jackie Chan himself.","user":"drngor","rank":[54,60]},{"title":"With Jackie Chan behind the production and the time to perfect it, Legend of Drunken Master winds up becoming a martial arts legend itself","rating":9,"date":"28 February 2007","review":"To describe Legend of Drunken Master is almost impossible. It has so much, it does so much, and it delivers in so many ways, you cannot really describe the experience. Legend of Drunken Master stands as Jackie Chan's best film, and arguably the greatest martial arts film in history. That's right Bruce Lee fanatics, it tops most/arguably all Lee films. Surely Lee had the strength and the power; but did not have the ensemble cast that Chan had, nor did Lee have any fights that can top the ones the Drunken Master engaged in throughout the 105 minutes of this kung fu madhouse.<br><br>With a decent plot, good acting, and a dash of humor to go along with the frenzied action, Legend of Drunken Master is one of those rare complete martial arts films that do more than just throw fights at you. Honestly, there has yet to be a perfect martial arts film. Whether its bad acting, a weak plot, too much focus on action, a pointless romantic story attached, or way too over-the-top substance, there hasn't been a martial arts film worthy of being up there with the best films in the modern era. Jui Kuen II (as they call it overseas) is the closest to the complete package as you can get.<br><br>We start the film off with Jackie Chan as the tough yet uncontrollable young kid by the name of Wong Fei-hung who accidentally takes a seal from British smugglers. The smugglers, also involved in overworking Chinese men in a factory resembling slave-like sweatshop of some sort, want the seal back. In the meantime, Wong's controversial fighting technique, drunken boxing, has been met by disapproval of his father, and wants him to refrain from ever using it. Drunken boxing also has a lot of competition and shun from others in the community. Chaos follows as soon as the British and their henchmen find out who has the seal, and vow to do whatever it takes to get it back and to spread fear in the community.<br><br>The plot isn't groundbreaking, but its something different than the average martial arts film. While it still contains the themes of family, honor, respect, and dignity contained in most Chinese movies of this genre, the preservation of Chinese art is a concept not used often. Nonetheless, it works, as we see the traditional values of the Chinese being threatened by the more modern mechanisms of the Europeans. There is also a major issue with honor, as Wong's father is morally against drunken boxing, and hates it when his reputation is damaged even a little. The acting involved with the tension amongst Chan and his family is at times a bit overblown, but for the most part gets the job right.<br><br>Jackie Chan is one of the few actors/actresses in modern cinema history that can both be taken seriously and lightly. We see Chan at his playful side, especially when he is drunk. But, take away the smile, watch him pose, and you will fear him. Seeing that look in his eye right before a major fight starts can send shivers down your spine, as you know he will not back down easy, and will use whatever technique necessary to take you out. His physical appearance isn't exactly intimidating, but his agility and amazing ability to be balanced and whip out an insane combo of punches and kicks remains to be matched by anyone else out there. The best of Chan is here in terms of acting, usage of props, and kung fu. Don't let his usage of props fool you, he can engage in a brutal victory without the use of any objects. Few Jackie Chan films prove this, but Drunken Master has its share of fights without any other objects floating around.<br><br>The fights are what Chan is best known for, and the fights are where the film excels towards jaw-dropping levels. From the first fight, involving swords and extending from underneath a train to a nearby house, to the final fight that lasts over 10 minutes without exaggeration; Drunken Master will wow you, will keep you on the edge of your seat, and will make you almost jump back in amazement. Hollywood does not have enough patience to spend four months on one fight alone, which is why we don't see fights in action films like the ones seen here. The final fight, involving a well-trained kicker and Chan at his drunkest stage is easily one of the best fights in historyit's so well choreographed, so well-timed, and so brilliantly executed, that it deserves a spot on one of modern film's greatest achievements. Raising the bar for generations to come, the last fight mixes speed, agility, humor, combos, fast movements, and unbelievable stunts. In truth, all the clashes prior do the same, but this one puts all the others to shame.<br><br>Bottom Line: Missing this film would be a travesty, especially if you enjoy a good martial arts film. This time its not Chan alone that makes the film; we have a good cast of characters and fighters, a decent plot, and never really drifts into an unbelievable level unlike most action movies of today. This is Chan at his absolute best; and this is famed director Chia-Liang Liu at his best. Almost a complete package in terms of quality and substance, Legend of Drunken Master is as close as you can get to martial arts perfection; and remains the greatest martial arts film of all-time.","user":"diac228","rank":[28,30]}]