[{"title":"A lot of unfair criticism.","rating":7,"date":"30 May 1999","review":"I cannot believe how many negative responses this film has had.  In Perth it is showing this week on television, and the TV guide labelled it the worst film of the week.  What is wrong with everyone?<br><br>This is just a light, fluffy movie with some genuinely funny moments. Michael Keaton would have had a nightmare of a time in this role(s). Imagine having to act with three other guys who aren't there.  The beauty of his acting is, you can tell which clone is which.  It's almost as if there are four different actors, al a Jeremy Irons in Dead Ringers.<br><br>I agree Andie MacDowell isn't anything more than eye candy, but she hasn't got a lot to work with.  This is Michael's film, which he shares with the excellent visual effects.  I don't understand how anyone couldn't enjoy this film.  Maybe those people can watch The English Patient or A Passage To India for the hundredth time.  Enjoy!","user":"claybo76","rank":[73,76]},{"title":"underrated","rating":8,"date":"23 February 2005","review":"I have seen this movie thrice and each time it still amuses me. Michael Keaton playing three clones plus the original was really intriguing and he plays it so well. I was really disappointed to see that th overall rating is currently in the 5 area and even more when I found out Siskel and Ebert gave it two thumbs down. I like this movie. I find it funny, especially Michael Keatons portrayal as a feminine Doug and a \"special\" Doug, who really gives the movie most of its comedy. I give you that it was predictable but I really don't care. If it makes you crack up, it is a good movie, and this is no exception. <br><br>Andie McDowell does a fine job too. She might not be talking to three of herself as Keaton was but she was a good opposite to him. THe scenes with the kids are true to life, which also make me laugh.<br><br>I overall enjoy this film every time I see it and find myself quoting it the next few days. If your looking for a good laugh, this will feed your appetite.","user":"Creedbeans","rank":[55,60]},{"title":"A solid and hilarious comedy","rating":7,"date":"7 February 2000","review":"Though nowhere near as good as Groundhog Day (director Harold Ramis's previous movie) this is still a solid comedy with several big laughs. Though its situation of a man cloning himself in order to make his life more manageable would have been an interesting one to play with a serio-comic focus, Multiplicity  - despite some token moralizing - is pretty much content to play its premise for wacky farce. As such, however, it does an expert job: the timing in the scenes is impeccable and the interplay between the main characters is sharp and memorable. This is especially amazing since the \"main characters\" here are almost exclusively played by Michael Keaton. His ability to not only delineate between the four versions of himself, but also to play each of these \"selves\" off convincingly against the others is nothing short of superb. In my mind, this represents a much more awesome achievement than does Eddie Murphy's similar multiple role-playing in The Nutty Professor - and here it's not just pointless showboating (there was no reason besides vanity that Murphy had to play every member of his family), but absolutely intrinsic to the movie's success. Essentially, the film rides on Keaton's ability to do precisely what he does as well as he does. Multiplicity represents his funniest film work in years, and perhaps his best ever.<br><br>A couple of scenes in particular stand out as howlingly funny set pieces - such as the one in the restaurant and the one where the clones are left alone with Keaton's wife, played by Andie McDowell. It's a shame her character wasn't at least a little bit more sketched in by the writers (compare this, for example, to her wonderfully three dimensional role in Groundhog Day) - it might have made the film a little fuller. In fact, none of the supporting characters are really given much to do here, making it solidly a one man show. But what a show! With Keaton truly hitting every comic grace note available, you don't really have much time to notice or care about the lack of secondary characters. I have seen this film four times and it has yet to lose one iota of its hilarity or charm. Hey, how much more can you demand from a comedy?","user":"krumski","rank":[38,41]}]