[{"title":"Despite a weak ending this is a surprisingly creepy Hollywood horror","rating":21,"date":"21 October 2002","review":"Rich but eccentric millionaire Steven Price is looking for the ultimate scares.  He invites a group of people to spend the night in the former Vannacutt Psychiatric Institute for the Criminally Insane  where the inmates revolved in a orgy of violence against the cruel regime of Dr Vannacutt.  The one who does spend the night will get $1million dollars. However it soon becomes evident that not all the scares are set up by Price himself.<br><br>This remake of the old 1958 movie sees the plot expanded and made a lot more creepy and enjoyable.  In fact the end point of the original is only the halfway mark of this one.  The plot may not be imaginative but the delivery is very good for this type of film.  I'm not a big fan of horror or this type of Hollywood slasher movie as I find them too obvious and not scary. However here the gore is well used and the general creepy mood wins the film.  The movement of the deceased Dr Vannacutt is very creepy and is much better than some of the gore.<br><br>Sadly the final 20 minutes feels it needs to reveal a bigger evil and the secrets of the house are brought to life in boom of CGI beasties.  At this point it reverts to form and because just another Hollywood creature feature and it is a bit of a let down.  However up to this point it works very well and it's real creepy.<br><br>The cast are all pretty good and do `camp' when necessary but don't take away from the terror that's coming later.  Rush plays nicely to the camp in his homage to Price's role in the original.  Jensen, Diggs, Gallagher and Kattan all do well and the cast do better than the scream queens that usual inhabit these films.<br><br>Overall the film starts like any other Hollywood horror but the clever direction, creepy music and imaginative visuals of Dr Vannacutt all create a creepy feel to the film that is better than the gore that also comes.  The final section slides back into standard fare with the old CGI evil coming to get us  but up till then it's surprisingly good stuff.","user":"bob the moo","rank":[72,93]},{"title":"Who Wants to be a Millionaire?","rating":6,"date":"6 May 2001","review":"Asylums.  Crazy people.  Insanity.  Mental therapy, mental hospitals, mental patients have been used time and time again in horror fiction and horror films.  Why?  I'm not sure;  maybe, it is the normality of being like those that are insane which brings a more genuine horror  to us.  Whatever it is, House on Haunted Hill certainly uses all the mental derangement cliches to full effect.  I could easily pan this film by saying(and rightly so) that its predecessor, the original House on Haunted Hill directed by William Castle, is a far superior film.  That Castle's film was filled with better acting, better timing, and easily a better script.  But I liked this film, which is not really a remake entirely.  It has many elements that are not in the first film;  most of them centering around the mental aspect aforementioned.  The house in this film was once an asylum where people...thousands perhaps..were brutally butchered in the name of mental good health.  The house is scary.  Empty corridors, large, vast rooms, incredible special effects all add to the frightening aspects of the film. The biggest problem with the film is that much of it just doesn't add up in terms of making sense of the plot.  The film fortunately is more special effects driven than plot driven, and at least is able to deliver the goods in that arena.  The acting is pretty good with all the leads really doing quite a good job.  Geoffrey Rush gives his best Vincent Price impression(pencil-thin mustache and all) delivering lines with bravura gusto.  The other exceptional standout is Chris Kattan as Watson Pritchard. Kattan is just wonderful in the role showcasing his obvious talent.  As far as great horror films go...this film is adequate, yet very thrilling, exciting, and entertaining.  If you are like me and love the old one...just look at this film as a totally different entity.  It is.  One thing is for sure...it is one heck of a rollercoaster ride!","user":"BaronBl00d","rank":[30,37]},{"title":"I don't understand why the the rating is so low.","rating":7,"date":"17 April 2019","review":"Okay sure this movie is a remake and obviously not as good as the original. but its actually a really well done movie, definately deserves a better rating than 5.6. i really enjoyed it!","user":"marlieH","rank":[11,12]}]