[{"title":"Stunning performances all round","rating":10,"date":"31 March 2004","review":"The Addams Family are one of the more recognisable families in TV history. With that in mind, let's skip the introductions and get straight to the chase.<br><br>The performances in this movie are superb. It's a black, black comedy, and as such, it requires a certain kind of actor. The kind who has the right look, the perfect comedic timing, and the ability to deliver lines so deadpan it almost hurts.<br><br>Raul Julia, Anjelica Huston, and a young Christina Ricci somehow ALL manage to deliver. They're truly a delight to watch, delivering the most macabre lines without even coming close to cracking a smile, yet having me in stitches every time. Even Christopher Lloyd, playing a far more energetic character, manages to bring in a maniacal edge to the performance. I don't think there's an actor in the movie who doesn't understand the role they play.<br><br>The script is great material for them to work with too, extremely witty, rarely if ever falling on it's face, and complemented with some fantastic sets. And let's not forget the music. From the legendary theme tune, to the harpsichord jingles accompanying the visual gags, to the booming organs during the heavier moments, it's spot-on. The whole movie works as one to capture *THE* Addams atmosphere, macabre as it's ever been.<br><br>Sure, there's a plot too, but while it drives the movie on, you'd watch this movie for the wonderful theme, not for an intriguing plotline.<br><br>It's a classic, and you're doing yourself a disservice if you haven't seen it, or if you think you're too sensible for this kind of movie.","user":"ScarTrek","rank":[89,97]},{"title":"An amusing film from the popular TV series \"The Addams Family\"","rating":8,"date":"28 November 2003","review":"\"The Adams Family\" is a very funny film that is very under rated. With a great all star cast you get just what you expect, a great comedy. The TV show was already funny enough, and then the movie came and I was on the floor laughing. It's fun to see a happy dysfunctional family. No, I'm not talking about \"The Osbornes\". All the characters are great and you really get into it. If you can tell me that you honestly did not get one laugh from this film, there is something very wrong with you. Because it is a very funny film. I would recommend this to anyone. It's a good watch on any day.<br><br>8/10","user":"Smells_Like_Cheese","rank":[48,55]},{"title":"Gothic Kookiness","rating":8,"date":"30 January 2006","review":"Charles Addams' dark characters get the film treatment in Barry Sonnenfeld's THE ADDAMS FAMILY, which is something of a cross between the actual New Yorker comics and the 1960s television show. Not trying to lean too far to either, the movie stays at a safe plane, even incorporating a vague plot involving two grifters, Gordon and Abigail Craven, posing as Uncle Fester and a renowned psychiatrist (Christopher Lloyd and Elizabeth Wilson) who are in cahoots to rob the Addams of their fortune and house. The problem arises when Craven seems to go against his take-the-money-and-run attitude and when the Addams themselves appear to enjoy every minute that they're being taken advantage of. It suits the dark humor well, because since the Addams live in an alternative universe of their own creation in which dark is light, repugnant is beautiful, pain equals pleasure, death is life, and chaos equals order, it leaves the door open for many of their Gothic eccentricities to pull the rug over Lloyd and Wilson over and over again. It's clever, although its only problem is the \"needing to introduce the characters we all know\" setup which like in all movies based on comics or television shows, looks obvious.<br><br>But despite this, everyone is uniformly excellent. Raul Julia and Anjelica Huston lend their looks to embody their cartoon counterparts and are the romantics at the heart of this decidedly perverse story. Christopher Lloyd is also great in his representation of Uncle Fester. But hands down: the one who walks away with the entire movie is Christina Ricci who plays Wednesday as if she were living the role day by day. There's a sadistic gleam in her eyes and her voice that not many child actors have and I think that any other actor of the time that this film was made would have been unable to fit into this difficult part. Other than that, the tone of the movie is perfect: as dark as it wants to be, but never letting its Gothic setting drown it in an inescapable mire. On the contrary, we're constantly aware that this is a typical American family who lives upside down and who are happy in being so even when we gawk and cringe at their oddities.","user":"nycritic","rank":[31,35]}]