[{"title":"Entertaining and Thought-Provoking.","rating":10,"date":"15 January 2004","review":"Of the 250+ films I've seen and rated on IMDb, only one other (Schindler's List) is as good as American Beauty. A film like this not only entertains while you're in the theater but also drops subtle questions in your head about the nature of human behavior and the gulf between fantasy and reality. After watching this movie, viewers will think long and hard about their own lives as well as the lives of people around them. The movie spells out the social disillusionment phenomenon everyone experiences but can't really grasp.<br><br>American Beauty reminds us that, like Lester, we really have no idea what we really want. We're not rational creatures as economists assume we are. Our instinct might lead us to perform one action, yet our brains might tell us to perform the complete opposite. We may lust after material belongings, yet how do we know we will still treasure those material belongings once we obtain them? Lester may lust after Angela, yet once he feels her in his hands and finds out the truth about her sexuality, an entirely different feeling comes over him.<br><br>Ricky Fits, the drug-dealing boy next door, is able to look beyond conventional notions of attractiveness and find beauty in non-promiscuous, solemn girls as well as in plastic bags floating in the wind. When many criticize the movie, they say, \"Where's the beauty in a plastic bag?\" And that's the point. We live in a world of aesthetic subjectivism. What one person finds attractive, another may find repulsive, yet the urge is there for people to assume aesthetic absolutism. \"It's just a plastic bag! How can there be beauty in it?\" Well, a human being is just an aggregation of tissues, bones, and blood. How is that attractive? It depends on how you look at it. Reality is shaped by perspective.<br><br>Some people criticize the Ricky Fits character because he records his life experiences on tape and doesn't actually experience them. But time moves inexorably in one direction. Time cannot be stopped. In a physical sense the past and the future don't exist. We are only conscious in the present. Everything we do, everything we achieve, every bit of happiness we experience -- they are all eventually buried in the past by time. Recording subjective beauty is a means by which one can attempt to salvage beauty from the past into the present because time eventually destroys all beauty. If you don't believe me, walk into a pre-school and then walk into a nursing home. Remember that all the old men and women in the nursing home were once little kids.<br><br>Another profound element of American Beauty is in the tag line: look closer. An individual's behavior is not independent of his environment. Humans are conformists by nature, and humans will modify their behavior to assimilate into existing social categories. If any individual dares to stray from the category to which he has been assigned, he is shouted down and ostracized. No one can resist the urge to conform, so why bother? Everyone is nice in public, yet on the streets they blare their horns, scream, and swear. Some boys I know pretend to hate American Beauty because on the surface it seems like a \"chick flick.\" They force themselves to watch gory horror movies and show off to others how they can stomach intense violence and excessive sex scenes. In American Beauty, Angela acts like a total slut, as many girls seem to be nowadays. In the end, however, she is not what she makes herself out to be. Colonel Fits tries to act like such a man, yet in the end it's all just a giant facade. Civilization is but one giant movie, and members of society must start acting their parts if they want to belong to this civilization. Otherwise, they're outsiders. Try walking into a job interview without a tie. You'll be thrown out. That is the power of convention.<br><br>What if I asked you this question: What do you want in life? Most people would say, \"happiness.\" But is happiness worth deluding yourself for? Carolyn Burnham shields herself from sadness by adopting a positive-thinking philosophy, a philosophy of self-affirming mantras and harsh self-discipline. Positive thinking may help you attain your goals, but positive thinking also blinds you from reality. Is it wise or moral to change the channel when you hear about mass starvation in Africa so you can enjoy moments of fleeting happiness from a cheap romance movie? Self-help is just a euphemism for self-deception. All humans need some complex fraud to distract them from the harsh and nihilistic realities of life, whether it's religion, money, or even love.<br><br>In spite of American Beauty's greatness, there are problems. Characters are stereotypical, but viewers will hardly notice unless they're ultra-critical. Anyway, exaggeration is essential in satire so that certain points are made obvious to viewers. Furthermore, Alan Ball's original screenplay is slightly edited. The ending is more optimistic.<br><br>Problems aside, Sam Mende's debut movie is one of the greatest I've seen. Not only is it entertaining but it is also filled with interesting ideas. It's an important film for society because there's so much society needs to learn. One boy I knew refused to watch American Beauty because, as he said, \"I'm not gonna watch a movie with a name like that!\"<br><br>Look closer.<br><br>10/10","user":"the-evil-cult","rank":[1,1]},{"title":"An Oscar well deserved.","rating":10,"date":"29 May 2000","review":"This film is one of a kind.  After seeing this film last week, I was left with a hole in the pit of my stomach.  It left many questions in my mind, and most of them cannot be answered. In my view, a film that makes me think after I watch it is second-to-none, and this film certainly delivers in that aspect.<br><br>I was amazed with the vivid imagery in this movie, as well as with the symbolism.  However, what makes this film the best of 1999 is the acting. Kevin Spacey shines as Lester Burnham, and Annette Bening (Carolyn Burnham) isn't far behind.  Supporting cast members such as Wes Bentley (Ricky Fitts), Thora Birch (Jane Burnham), Mena Suvari (Angela Hayes), and Chris Cooper (Col. Frank Fitts) only add to the drama of this film.  I think the most special aspect of this film is how all of the characters intertwine in a way that is believable, yet fantastic at the same time.  I congratulate Sam Mendes for his direction of this film, as well as Alan Ball for writing it.  I don't think it could have been any better.<br><br>Rated R in the U.S. for strong sexuality, language, drug content, and violence, the film obviously deserves its rating.  However, none of the causes for the R rating are overbearing, and all of them add to the plot-line of this film.  While I don't think that this is a film for children, I would suggest that adults should view it with an open mind.  I believe that the traits which many of the characters in this film have are found in many people around the world. Perhaps that is why this film hits close to home for so many viewers.<br><br>While billed by some as a \"comedy-drama\", I don't see anything about this film as funny.  Sure, there are some comedic moments, but by the end, those moments were all but forgotten when faced with the grim reality of the conclusion of the events portrayed in this film.<br><br>If you want to watch a light-hearted film with some elements of comedy and some elements of drama, don't see American Beauty.  But if you enjoy films that make you think, and are entertained by an excellent cast, excellent directing, and an excellent screenplay, this film should be at the top of your list.<br><br>My Rating:  10/10","user":"RueMorgue","rank":[519,616]},{"title":"A deep, wonderful, penetrating film; extraordinary irony in a psychological drama about the American life.","rating":10,"date":"22 March 2000","review":"I have come to see the movie with a certain prejudice.  Everyone saying that it was so wonderful, so touching, so excited -- I usually tend to go with movies that nobody likes.  Nevertheless, this one was a certain exception.<br><br>It is a wonderful psychological drama, a satire about the American community and about the American life; dark, painful irony and cynicism in the descriptions of life and characters; deep sarcasm on types of people in the community, habits of behaviour such as \"...if you want to succeed, you always have to seem successful...\" or \"never stop smiling\", parasites of the community, and, most importantly, the treatment of people who are \"different\", who are \"freaky\" to some extent; and eventually, there is no character in the film that is not odd in its way, although we have to wait for the very ending of the film, to discover this.<br><br>With very deep and accurate exaggeration, (most of) the characters in the movie demonstrate the worst, the darkest sides of their personality, while still remaining very human, very touching and very involving the observer. Everyone can find a certain similarity with characters and persons who he met in his life, in the characters described in the film.  The tragi-comical events, the little pieces of funny, disturbing irony dripping from almost every episode, lead the observer to exploration of the American Beauty -- the beauty in life, and the way that we fail to find it, for all our life; the way we hide our feelings and emotions, even behind sullen walls of our sepulchre.<br><br>The acting is truly brilliant, the episodes are built logically, coherently, the dialogues are deep, thrilling, intriguing; every sentence and every word is deeply constructed, containing profound irony and intelligent elements of humors.  The plot is very intelligently built, constructing a true indication of the sad situation of the American society, and an excellent ground for the actors.<br><br>An amazing movie, strongly recommended.  10/10","user":"SD-4","rank":[418,503]}]