[{"title":"Compelling Portrayal Of The Former U.S. President","rating":8,"date":"22 July 2002","review":"In an overall solid cast, Anthony Hopkins shines in a powerful performance as Richard Nixon in this Oliver Stone film tracing the former president's life from his boyhood in California to his resignation as U.S. President in 1974.<br><br>Nixon is seen as a troubled figure, insecure and paranoid, with few friends. An unhappy childhood, in which he refers to himself as his mother's \"faithful dog,\" in fact does dog him his whole life, as he seeks to please a demanding ultra-religious mother (Mary Steenburgen)who had already died by the time he took office as President, but whose memory and expectations lived on. Nixon is burdened with an unhappy marriage to Pat (Joan Allen) - unhappy largely because of his own obsession with political success - and haunted by the ghost of John Kennedy, who defeated him for the presidency in 1960 and who Nixon could never live up to. Kennedy was loved; Nixon was hated - he could never get over that. A scene near the end of the movie demonstrates his feelings toward JFK as he looks at Kennedy's White House portrait: \"They look at you and see what they want to be; they look at me and see who they are.\"<br><br>Although the movie - as any review of Nixon's life will - revolves around Watergate, it provides a fascinating summary of his life, and of what added up to make him the troubled and lonely figure he really was. There's also typical Oliver Stone material as dark hints of conspiracy extending far beyond Watergate are inserted. Perhaps the most unsettling being a meeting Nixon has shortly before JFK's assassination with some supporters in Texas who are trying to convince him to run for the presidency again in 1964. Nixon protests that Kennedy can't be beaten in '64. A Cuban American present says ominously \"What if Kennedy doesn't run in '64?\"<br><br>A truly fascinating portrayal of a fascinating man, even in the end somewhat sympathetic to Nixon as the film ends with his 1994 funeral service, some comments at that service by President Clinton and a summary of his career by a narrator pointing out his accomplishments. A last note: kudos to Paul Sorvino, who hit Henry Kissinger bang on.<br><br>8/10","user":"sddavis63","rank":[49,52]},{"title":"\"It's The Lie That Gets You\"","rating":25,"date":"25 May 2000","review":"Watergate hardly gets a mention in this film.  We see the 'plumbers' donning rubber gloves, and the president fumbling with a few of his tapes, but detail is almost totally eschewed.  There is no Egil Krogh, no Jeb Magruder.  Kleindienst and Gray are mentioned only in passing.  Cox is fired by way of a spoken TV bulletin, Jaworski is not referred to at all.  We do not see anything of the titanic courtroom struggles, with all three branches of the federal government locking horns.  Though we are told that the American Constitution is self-righting, like a boat immune from capsize, we are not shown how or why.<br><br>     And in this, Oliver Stone is perfectly right.  As it stands, the film is very long, and dense with detail.  There is no room for the minutiae of the cover-up, which in any event would make for a confusing narrative. Stone's subject is Nixon the man, not the edifice that toppled around him.<br><br>     And what a man.  Richard Milhous Nixon is a truly fascinating personality - both statesman and charlatan: ruthless and vulnerable: unable to express his emotions, yet the most emotional of politicians: a man who spent his life in the law and in high office, but who never absorbed the legal and ethical mores of public life.  Genius and crook, bold visionary and spiteful backstabber, Nixon will continue to spellbind biographers for decades to come.<br><br>     \"That's when it starts,\" says Stone's Nixon, \"when you're a kid.\"  The film takes us to Whittier, California in 1925 to see the unloved boy who struggled painfully to earn his parents' approval, without ever quite succeeding.  As a teenager, he levered his way into the school football squad by sheer willpower.  Lacking talent, he doggedly subjected himself to repeated physical battering in the scrimmages, \"a tackle dummy with guts\". This syndrome recurs throughout his career.  Always susceptible to scathing criticism, never quite commanding respect, Nixon never the less kept ploughing back into the melee when wiser, lesser men would have quit.  It is hardly surprising that the years of punishment should have left psychological scars.<br><br>     Nixon's hatred of John Kennedy had more than one source.  He was devastated by the defeat in the 1960 presidential election, but not simply because of disappointment at losing, or even because the Kennedy victory carried the odour of fraud: bitterest of all for Nixon was the realisation that the Kennedy people had played hardball more effectively than the Republicans.  Nixon had been out-sharked, and it hurt.  On a more profound level still, John Kennedy was everything that Nixon could never be.  He was a smooth, handsome prince among men, exuding poise and confidence, a patrician imbued with the habit of authority.  To Nixon, the perpetual outsider, the quaker geek who looked shoddy and disreputable, Kennedy seemed to have the dice unfairly loaded in his favour.  JFK was an East Coast bright boy and war hero, fabulously wealthy and impeccably well-connected. Nixon owned nothing and knew nobody, and was all too obviously 'on the make'.  The great witch-hunts, of Hiss in the 1940's and Ellsberg in the 1970's, are manifestations of the chip on Nixon's shoulder, the fathomless bile that he directed at East Coast college boys.<br><br>     Nixon always imagined that he was hiding his pain from the world, whereas in fact it was on global display.  His nervous little laugh at moments of emotional crisis was so false, so gut-wrenchingly inappropriate, that the onlooker could catch a glimpse of the man's tortured soul.  Hopkins captures the wretched laugh with devastating effectiveness, both in the scene where Nixon is confronted by a hostile man in the TV studio audience, and when he solemnly promises that none of the president's men will go to jail.  In the \"Checkers\" broadcast and the presidential TV address on Watergate, Nixon tries to assure the camera that he is not a crook, and on both occasions he has the exact opposite effect, confirming to the viewer that that is precisely what he is.  Nixon seems incapable of examining his own conscience: there is a hard core which his rational mind cannot penetrate.  Maybe that is why Stone has him referring to himself in the third person throughout the film.<br><br>     'They' were always out to get Nixon, without it ever being made clear just exactly who 'they' might be.  The imperative for this deeply paranoid man was always to be braced, ready for the coming tackle, or to organise pre-emptive strikes against 'them'.  Obstructing justice and tampering with evidence were, to Nixon, self-defensive steps that did not need to be justified.  It was obvious that such things had to be done.  The mystery at the heart of Watergate - why a president so steeped in criminal conspiracy should tape-record his own intimate conversations - makes sense when viewed from Nixon's end of the telescope.  He had to have the goods on his own men, ready for the day when they turned on him.  It goes even further.  This emotional cripple could not bare his bleeding soul to anyone, so his tapes became his confessional and his confidante.  Stone's film repeatedly shows Nixon in his awkward arms-extended, double V-sign pose.  It is not by chance that it looks like a crucifixion.","user":"stryker-5","rank":[66,72]},{"title":"Oliver Stone's best film","rating":10,"date":"1 February 2000","review":"I'm not normally a fan of Oliver Stone (in fact, I've NEVER liked an Oliver Stone picture before)but this one just blew me away. The reason I usually don't like him is that, though he is a great technical director and visual stylist, his scripts are heavy-handed and one-sided to the point of absurdity. But not here. In fact, the script is perhaps the most impressive element in this whole movie, not only for how ambiguous and even-handed it is in dealing with Nixon as a character, but also for the brilliant way it moves around in time. It starts with Nixon, feeling embattled in the White House in 1973 as the Watergate hearings are upon him, and uses the device of him listening to his secret tapes to jump back and forth to previous eras, flawlessly moving between past and present to give an impressionistic, kaleidoscopic overview of the man's life, instead of following the staid and ho-hum linear approach most movie biographies take (most recent example: \"Man on the Moon\", the bio on Andy Kaufman which was a snoozer in spite of a great performance by Jim Carrey mainly because of the dry boring, \"This happened. . .And then this happened\" approach).<br><br>Another reason to see this film is the brilliant, absolutely overwhelming lead performance by Anthony Hopkins; his Nixon may not look or sound exactly like the 37th president (but come on, except maybe for Ed Sullivan, who does?) but he embodies his qualities - strengths as well as weaknesses - to such an enormous degree that he simply BECOMES Nixon, at least for the three hours the movie is on screen.<br><br>I have to say, though, I was not nearly as impressed as every one else (critics and general audiences alike) seems to be about Joan Allen as Pat Nixon. It's nothing against her performance, she did fine, it's just that as written, the part is rather weak. In fact, I was much more bothered about the liberties the filmmakers took in fleshing out her character than in all the political events; it's like, whenever they wanted to have someone blast Nixon or act as his conscience, they'd trot out Ol' Pat, giving her some of the most embarrasingly \"speechified\" moments in all of the movies - almost none of their scenes together ringed true as husband as wife; it was more like Nixon sitting across from the Filmmakers' Conscience. In fact, she's angry at him so often in the film you have to wonder, what exactly does she love about the man? The film never answers (or attempts to answer) this question.<br><br>But this one minor quibble is not enough to make me downgrade this film. It is an absolutely stunning achievement by any stretch of the imagination, and it contains some interesting thematic and technical echoes of both Citizen Kane (cavernous high ceiling scenes, a \"March of Time\"-type newsreel on Nixon, a dinner scene between Dick and Pat at a long, impersonal table) as well as The Godfather (the burnished, half-dark half-light cinematography, several \"chamber of power\" scenes in tight, dark and claustrophobic rooms)that I found, in context, to be totally appropriate. It paints both Nixon and the times he (and the country) lived through on a grand and mythic scale that was truly awesome and, once again, entirely appropriate. Yes, it's a film that is at times big, loud and bombastic (because so, after all, was Nixon himself) but, just as often quiet, contemplative and told at an achingly *human* level. The contrast between these two states is what gives the film a good deal of its overall power and, as I've said, I never would have believed that Stone would have been capable of doing the smaller, quieter scenes so well.<br><br>This is a good film to have on tape or DVD, for two reasons. It's so long, and so dense with facts, characters and events, that you're not likely to want to watch it all the way straight through (the first time I saw it was in the theater and though I was held spellbound, I began wishing for an intermission at about the two-hour mark, not so much to stretch my legs but to give my brain a chance to process all I'd seen and heard so far). Also, and more importantly, the videotape includes after the credits two scenes cut out of the final film for time purposes. In both cases, I believe, a severe mistake was made - these are both, I believe, ESSENTIAL sequences; not just nice to have as an additional bargain, but scenes which Stone should have fought tooth and nail to keep in (even cutting out some others if he had to - my vote would have been to excise a few of those Pat Nixon scenes instead). Once scene involves Nixon's visit to the CIA and another a discussion between Nixon and J. Edgar Hoover in the Oval Office. The first scene is a masterpiece of writing and acting (with Sam Waterston as CIA Director Richard Helms, otherwise in no other scene of the movie) and the other is, I think, key in understanding Nixon's motivation to begin taping his White House conversations in the first place (also - an issue which is touched on no other place in the movie). I feel that these two scenes should be edited back into their appropriate places in the movie; seeing them separated from the rest of the film is better than not seeing them at all, but they really belong as part of the entire story.","user":"krumski","rank":[70,79]}]