[{"title":"Andy Sidaris - misunderstood visionary","rating":25,"date":"25 January 2016","review":"Andy just wanted to make movies about radio-controlled vehicles. But he had to pad them to feature length for cinema release, so he added some action sequences and a sort of plot.<br><br>Due to financial restrictions, he could only afford part of the wardrobe budget for the cast, so he was forced to film everyone (everyone who who wasn't fat and ugly, that is) in only the bottom half of their clothes for a lot of the time.<br><br>But if you want to see great footage of radio-controlled speedboats, aeroplanes, helicopters and motorbikes in action, you'll have to sit through scenes of things exploding and lots of topless women. <br><br>Sorry, but that's the cold hard reality of the visionary auteur. Tough it out.","user":"danielemerson","rank":[5,5]},{"title":"this is what made me a Sidaris fan","rating":10,"date":"18 November 2007","review":"I confess to getting this on DVD due to my favorite model Pandora Peaks having been cast in a small role. It wasn't til I started watching it that I saw both Erik Estrada and Pat Morita in it and was surprised to see them both. This is a true roller-coaster of a ride, really all over the place, from the desert to Hawaii to the woods of Louisianna, it really covers a lot of geography from a small production for the video market. Casting buffed guys and sexy gals as secret agents, more or less acting without any support against villains right out of The A-Team or some other 80's show, this had tons of female flesh, explosions, and even helicopters chasing cars. Also, the funniest part is that every agent had time to make love to their counterpart and there were a lot of clothing changes for the women. Likewise, Pat Morita as the villain was hilarious, and his assassins some of the lamest assassins ever filmed.<br><br>But it works for me.","user":"hillbillyfromhell","rank":[6,7]},{"title":"\"You're not by any chance related to that bloke I blew up with a rocket launcher, are you?\"","rating":7,"date":"30 August 2012","review":"Despite having been blown to smithereens by Dona Speir in 'Guns' (the fifth movie in my Andy Sidaris 'Girls, Guns and G-Strings' box-set), ex-CHiPs star Erik Estrada miraculously returns in one piece for the next film Do or Die, albeit as a totally new character, good guy Richard 'Rico' Estevez; Estrada even gets to romp with Speir in a brief sex scene, no questions asked.<br><br>I guess it's what I should expect from a movie franchise in which top-heavy female federal agents squeeze into tiny outfits to take on the never-ending stream of ruthless villains who turn up on their tiny Hawaiian island. This time around, it's none other than Mr. Miyagi himself, Pat Morita, who plays the baddie, a Japanese criminal by the name of Kane, who is so fed up with buxom babes Donna and Nicole (Speir and Roberta Vasquez) ruining his illegal operations that he forces them to play a deadly game of cat and mouse against six pairs of his best killers.<br><br>Their lives in danger, the girls head for the mainland and are subsequently pursued across several states, thereby allowing Sidaris to set his cheesy action set-pieces against a variety of backdrops whilst also indulging his usual obsessions: humongous breasts, high powered weaponry, and remote control scale models (but, rather surprisingly, no men in drag). As always, there are several steamy soft-core sex scenes (a couple of which are surprisingly artful in their execution), some dumb comedy, and a few poorly staged fight and chase scenes (including one with really crap ninjas). Also adding to the fun is the introduction of two new female characters: Pandora Peaks as Atlanta Lee, owner of the film's biggest pair of tits, and Ava Cadell as Ava, owner of quite possibly the most awesome body of the whole series.<br><br>Best of all, though, is the sight of Mr. Miyagi rolling around in bed with his surgically enhanced Japanese babe Silk (Carolyn Liu), the old man clearly using moves that he never dared divulge to young Daniel Larusso.<br><br>I rate Do or Die 6.5 out of 10, rounded up to 7, making it my new favourite of the series so far.","user":"BA_Harrison","rank":[3,3]}]