[{"title":"I Almost Died Of Laughter","rating":10,"date":"3 February 2009","review":"This of course is not a great movie but I just have to give it a 10/10. I have never laughed more in my life. Even the jokes that aren't funny are funny. This film's comedic build up is about the best you will ever see. It doesn't even matter what the punch line is, its how they get to it thats hilarious.<br><br>Now this cast was perfect. Anytime you have Randy Quaid in a film you just know the film is going to make you life just by looking at him. Kingpin couldn't have shown this any better as he plays an Amish man who just happens to be amazingly talented at bowling. Woody Harrelson plays a has-been ex-professional bowler who makes a comeback with managing through Randy Quaid. Together they go on a ride across the country making money left and right. Along the journey they are great supporting comedic performances given by Bill Murray and Vanessa Angel who certainly makes the look of the film more appealing.<br><br>The Farrelly brothers in my opinion give their best direction they've yet to have. Yet it is the writers who so perfectly set up one joke after another. It seems as if the script is so sharp that their are jokes within jokes. The Farrelly brother handle this material so well by virtual unknowns.<br><br>As I have said before this is not a great film but I would highly recommend this if your in the mood of watching something spontaneous. It may not be the most technically sound movie ever made or the deepest but I have never laughed so much in life and that in it self is what comedies are about.","user":"alexkolokotronis","rank":[53,65]},{"title":"This film is rude, crude and very funny","rating":10,"date":"19 November 2002","review":"When this film first came out, I had no use for it. Then I was home sick one day and caught it on cable. I laughed my butt off. This is a crude, rude and down right funny film. It also helped that I grew up near the Pennsylvania Dutch and plenty of bowling lanes. Two seemingly safe areas that the Farley brothers attack it without mercy. Sometimes it gets down right disgusting and many cannot stomach, but overall, its very funny.<br><br>Bill and Woody were funny as anything. The Disco-era beginning makes me laugh like crazy. The commercial Bill Murray does is to die for. This film will offend alot of people, and many references played for humor may make folks feel uncomfortable, but I loved it. If you are easily offended, this is NOT the film for you. But for everyone else who likes rude, crude and deviously funny -- often at the expense of others kinda humor, this is a gem to see.","user":"lambiepie-2","rank":[39,48]},{"title":"Now I Know Why I Quit Bowling","rating":10,"date":"16 August 2005","review":"I say this in a good way: this film captures bowling's underbelly, where even the pro stars sometimes have to supplement their income the old-fashioned way: by taking it directly from obviously weaker bowlers who somehow manage to be convinced to risk their money. Just as poker games are often won with guns, bowling for money has hazards all its own, something I learned even as a junior bowler hustling games after the league on Saturday.<br><br>Roy E. Munson (Woody Harrelson) is such a loser that acting like a total loser is actually called \"being Munsoned.\" The term is named after an incident where some victims of a bowling hustle relieve Roy of his right hand in a gruesome manner which involves bowling equipment. Somehow, even THAT manages to be funny, which speaks to the quality of this film, a film smart enough to have its three main stars on screen for most of the time. The 1979 accident was the result of Roy taking the fall for the hustle engineered by legendary bowler Ernie McCracken (Bill Murray).<br><br>Fast forward to 1996, and Roy stumbles across an Amish bowler named Ishmael Boorg (Randy Quaid), the most talented bowler he's ever come across. He offers to coach Ishmael for a $1 million tournament in Reno, Nevada that can save his family farm, but Ishmael is conflicted (the deepest emotion of the film) because he has strayed from the Amish country. Ishmael's brother is the requisite family member sent to bring the stray relative back home, and Vanessa Angel is extra-hot as the love interest for almost every guy in the film.<br><br>If you think this is a parody of bowling, the joke may be on you. Hang around enough lanes, in certain places, and you just might see these guys or something very close to them. Just be careful if they look drunk and want to play for money.","user":"ray-280","rank":[41,52]}]