[{"title":"More people whould watch this","rating":8,"date":"18 October 2019","review":"Really smart conversation, a Lolita, city slickers, girl, filthy and of course jocks... what more can you want?","user":"grasynjrue","rank":[28,28]},{"title":"Captures the imagination and heart","rating":10,"date":"17 April 2001","review":"It is very rare to encounter a film so devoted to character and this is the greatest strength of Beautiful Girls. Each character has their own personal turmoil and lightness which shines through in a film which from start to finish very little movement of plot is actually achieved, but then again it doesn't need to.<br><br>Small-town sensibilities and community spirit are intertwined with the notions of enigmatic strangers posing in an almost prophetic manner delivering advice upon the populous. Events such as brutal fighting, unashamed drunkenness and references to sex are handled as items which are not derogatory but necessary in a rites of passage kind of way. Each character develops through the film into better individuals of what they once were but not to such an extent as to impose sickly sweet values on the audience.<br><br>Every character is natural and rounded despite some major personality flaws. Timothy Hutton's excellent Willy is at odds with himself over the next stage of growing up, Rappaport plays the goofy yet loveable fool for love, Dillon the lost soul and Emmerich the doting yet somewhat incapable father. But it is in the Beautiful Women themselves where the real essence of the film lies. Uma Thurman is every blonde inch the mysterious and elegant Andera crossing paths with everyone and influencing their lives for the better. Rosie O'Donnell as the brash 'matron' of the group is the perfect foil for Sorvino's insecure personality. The ace of the bunch however is a mesmerising Natalie Portman who even despite being the cast's youngest member is compelling to the point that you can understand Willy's fascination with her character Marty.<br><br>For anyone wishing for comfort on a cold winter afternoon there are very few films with such a strong heart, Demme excels himself by never laying on the sentimentality rather poking gingerly at our own innermost feelings, and coming out with a winner.","user":"keirs-2","rank":[101,111]},{"title":"Beautiful Girls... beautiful movie...","rating":10,"date":"28 October 2004","review":"Easily one of the most overlooked movies considering how good it is. There are several ensemble movies out there, but this movie is definitely one of the best ones. <br><br>The key word in ensemble cast is obviously \"cast\". And this movie has a stellar cast. Timothy Hutton, as Willy, is perfectly cast. Yes, this is an ensemble movie, but it sort of hovers around his character and he carries the movie so well. And to play off him, Natalie Portman is tremendous in this movie. Despite being the youngest cast member, she outacts most of the adults in this movie. Her chemistry with Timothy Hutton is amazing. <br><br>The other cast members, including Rosie O'Donnell, Michael Rappaport, Uma Thurman, and Matt Dillon are also really good in their respective roles. Rosie O'Donnell delivers a hilarious monologue about the differences between men and women and it should not be missed.<br><br>The story is relatively simple... a man going back home to attend his 10 year reunion. But because of the complex characters and their various storys, it becomes much more than just a high school reunion. Its a story about a man finding himself. Its a story about a young girl getting a taste of what love might be, despite it being in an unlikely person. Its a story of a man who has to grow up and let go of the long gone high school glory years. Its a story about relationships, between friends, family and couples. All these tales are interwoven into a heartwarming story. <br><br>This movie ranks as one of my all time favorite movies.","user":"joits","rank":[92,101]}]