[{"title":"7/10","rating":11,"date":"11 November 2004","review":"There's something enormously touching about this film and the way it deals with losses -- Pullman's wife and Casper's mother, in particular. And what's so clever about it is how it uses them as a tool of audience manipulation AND has the evil ghosts use Pullman in exactly the same way that we're being used. This is a smartly written screenplay. The story itself is pretty conventional and predictable: the loner girl gets teased by a popular girl (that nobody really likes) who's out to destroy her; the popular girl has a cute boyfriend that the loner girl has the hots for, etc. etc., story will resolve itself with everyone falling in love with loner girl.<br><br>I can't quite understand why this movie has such a low rating. The only explanation I can think of is that people prefer emotionally \"safe\" movies like \"Toy Story\" (of the same year) that are equally brilliant technically (and have as many references), but don't sacrifice coolness by showing sentimental, sad emotion. It's possible that the movie got marketed incorrectly. The film isn't about spooks; like one of those early, wonderful Tim Burton fantasies (this film also shares with them an outstanding score), the film deals -- quite movingly, I think -- with regaining that lost sense of childhood: that moment where Casper tries to remember being alive is just wrenching. And the scene relates just as profoundly to us: just as he can't remember being alive, we can't, really, remember being kids. I was ten when I first saw this, and it had an effect on me then (Ricci's description of sunny side-up eggs making her gag subconsciously made me avoid anything less than hard boiled for ten years); this is something that I really cherish as being part of my young emotional and visual education, and it stands up today. <br><br>I haven't seen the director's other films, so I have no idea whether this whole thing was a fluke or whether everything just settled in to my particular sensibility, but even outside of the emotion I think the technical aspects, the giant basement set, are enough to keep interest. And even outside of that, the acting is terrific. Cathy Moriarty is an absolute riot. 7/10","user":"desperateliving","rank":[76,83]},{"title":"An all-time family favorite that's very touching!","rating":8,"date":"20 October 2004","review":"Ever since i was six years of age, I've enjoyed this movie. It makes me laugh, cry, and excited! i am disappointed that so many people don't like this movie. it is an all-time favorite of mine. It is sad yes, but it has comic relief from the three uncles that try to be humanlike, Casper, the friendly ghost that knows what it is like to be lonely, for instance me, and same with Kat. I am very touched with this film, for it makes me think about me, lonely and depressed, but it has a positive ending which I really adored! i also liked the amazing effects, that were famous at its, time. Of course now, effects from movies are like The Matrix films and LOTR, but i mainly like this film, because it tocuhes my heart in a both sad and sometimes happy, knowing, someone else is out there for you, even if you are a bit...dead. 10/10","user":"jdkraus","rank":[50,59]},{"title":"For adults too!","rating":9,"date":"1 November 1999","review":"Being 'middle-aged', I suppose I was not the target audience for this movie, but I love it very much anyway.  Kiddies aside, this movie is hysterical, well-acted, and touching too. The effects are great and, to be honest, I can't find a lot to critcize here, which for me is all I can ask of a movie.","user":"Boyo-2","rank":[40,49]}]