[{"title":"Look at the size of that thing","rating":7,"date":"2 September 2007","review":"Independence Day is the sort of film that's best appreciated on a big screen, preferably a massive great plasma television that is so huge you had to cut the roof off your house and get airlifted in by helicopters just to get it in the living room. You should also have the most state of the art surround sound possible, with bass pickups so deep they cause earthquakes on the Eastern seaboard. Not because Dean Devlin and Roland Emmerich's alien invasion flick is a masterpiece of cinematic art or anything, but because it's loud. Very loud. And if the windows in your house don't shatter when the spaceship flies over New York then well, you're just not experiencing it properly.<br><br>Taking the 1950's invasion narratives and pro-tooling them for 90's audiences, Independence Day is an absolute blast of visual flare and gung ho heroism. The plot is so straightforward as to be superfluous (aliens invade, fights ensue) but even so, it remains an invigorating watch purely because of the spectacle it provides. Back in 1996, the sight of that giant blue laser tearing apart lower Manhattan made jaws drop and while it's unlikely to do the same to today's overstimulated audiences, it's still an incredible visual feast. What's more, the ensemble cast makes it surprisingly unpredictable - we all know that the aliens will be defeated at the end, but what isn't so obvious is which characters are going to be alive to see it. Except for the kid and the dog. They're relatively safe bets.<br><br>Watching it now though, it does possess a cheerful naivety in the face of world politics. After all, this was 1996, the Cold War was over and 9/11 a long way off, so the entire world uniting against a common foe without being bogged down with petty arguments and personal agendas still seemed believable. Hell, even the gun-toting Arabs that briefly appear on screen are more than happy to rally behind Uncle Sam in the name of freedom. That's right folks, it's an Americans Save The World movie, complete with a snapshot of British officers drinking tea in the desert and waiting for those silly yanks to get a bally move on and show us what to do.<br><br>Needless to say, this is blockbuster entertainment through and through. The aliens are apparently here to strip mine the planet of all her natural resources, but they're quite happy to put that off for a bit in order to blow things up for the entire running time. Fans of in-depth characterisation, intelligent story telling and emotional engagement with the protagonists are wasting their time, but if you want to watch tourist attractions, jet planes and space craft exploding for three hours, you can't really go wrong. That business about a computer virus bringing down the mother-ship is a bit daft though, not once did they try switching everything on and off again.","user":"ExpendableMan","rank":[208,271]},{"title":"Just a good bit of fun!!","rating":8,"date":"14 January 2010","review":"I don't usually comment on this, I don't like to portray a movie as being good or bad just on my opinion, as everyone has their own tastes and needs when it comes to cinema. But god damn, why do so many people hate this film.<br><br>Firstly, this is not a serious film, it has never happened nor will it ever. This film is just damn good fun to watch...the explosions, the suspense, the cheesy one-liners...its not trying to tell you that aliens are coming to blow the s**t of of us...its entertainment. To all the people here that have said this is the worst movie ever...you guys need need to watch more movies, because if this is the worst movie ever then im Santa clause! To put it simply, this is 2 and a half hours of fun filled, edge of the seat (occasionally have a laugh) action...and nothing else. <br><br>Why cant people just enjoy a independence day for what it is (as mentioned above)...not why its improbable etc etc etc we all know that duh! This film is entertaining, full stop!! and thats all its supposed to be.","user":"stedmpy","rank":[96,140]},{"title":"A Great Blockbuster!","rating":10,"date":"7 August 2008","review":"What's the fuss about this movie? Why does everyone think so poorly of this? Well, in my opinion they compare this film to the Best Picture movies. This is not a Best Picture film, but a very entertaining popcorn film. This tells the tale of aliens attacking Earth and a group of survivors must unite together to destroy the invading aliens. The acting is decent. Will Smith, with a movie career underway, is excellent. Bill Pullman is great as the President. The effects were amazing especially when the buildings were blown up. David Arnold's music score is just fantastic. The theme is still stuck in my head. Overall, this is an excellent film. I rate this film a 10/10.","user":"g-bodyl","rank":[149,223]}]