[{"title":"A disturbing \"what if\" sci-fi movie","rating":5,"date":"5 February 1999","review":"Berlin, 1964, Nazi Germany.<br><br>\"Fatherland\" is one of Ruger Hauer's better recent movies.  It takes a look at what would have happened if Nazi Germany had survived, even if the US had never gone to war with Germany.<br><br>The movie shows the grandiose architectural empire that Hitler had planned to make out of Berlin, as it would look on his 75th birthday.  The special effects are notable more for their subtlety than dramatics, many of the fictional monuments look perfectly natural.  The appearance of Nazi era clothes and uniforms against a sixties era eastern europe looks both plausible and surreal.<br><br>The movie itself focuses on a patriotic cop (Hauer) and an american journalist who look into a series of murders that involved the \"greatest secret\" of the Reich.<br><br>\"Fatherland\" is a better than average drama and at the same a very disturbing look at how history could have turned out differently.","user":"Scott-8","rank":[50,60]},{"title":"Very believable portrayal of \"nice\" Nazi state","rating":19,"date":"19 April 1999","review":"I come from the Channel Islands: the only part of Britain occupied by the Germans during the war, where they ran a \"model occupation\" designed to show the rest of the world how benevolent Nazi rule was. I find this film only too believable -   touches such as the SS becoming merely a police force, whilst keeping the black uniforms, were chillingly real. Everything nasty was \"brushed under the carpet\" whilst presenting a civilized face to the world - exactly what would have happened.<br><br>I thought the ending was indeed unrealistic - Maguire would not have been able to reach the President's car, and a major diplomatic summit would not have been abandoned over one bundle of unsubstantiated evidence; but it was hardly a happy ending, given what happened to March and Maguire.","user":"Ta'Lon","rank":[27,32]},{"title":"Excellent movie","rating":7,"date":"11 March 2005","review":"An excellent speculative drama backed up with actual WWII footage to add realism. I believe that if history had turned out differently, it may very well have happened just as this movie portrayed it. The premise of the Normandy invasion being repelled causing America to pull out of Europe and revert to isolationism, as well as America turning its wrath to and defeating Japan to avenge Pearl Harbor are completely believable and not the least bit hokey. It has an interesting and engaging murder plot, as well as a good amount of suspense as the various players try to reveal the truth about Nazi war crimes and evade capture by the Gestapo. Nazi callousness, like March's colleague about the \"pure-blooded Aryan and a Pollock caught in the act\", the Gestapo chief's nonchalance toward the need of evidence, and the retired actress' anti-Semitic take on America's \"Jewish Problem\", are well played out without overused, propaganda-style vitriol. Hauer's performance as March is impeccable. Miranda Richardson is very good as well. Actually, good performances were rendered by all cast members. This movie is very entertaining and sparks the imagination with one of the ultimate \"what ifs?\". I highly recommend it.","user":"0DegreesKelvin","rank":[57,73]}]