[{"title":"Whatever Happened to Sara Jane? (or Walt Davis for that matter.)","rating":15,"date":"15 January 2005","review":"***SPOILERS*** ***SPOILERS*** <br><br>Not many films that combine gore and sex open with a biblical quote- namely \"Beware of false prophets,which come to you in sheep's clothing but inwardly are ravening vultures\"- then again Evil Come,Evil Go isn't just any film. It's the story of diminutive Southern belle Sister Sara Jane Butler (Cleo O'Hara). Part evangelist, part talentless country and western singer, and all round basket case Sara Jane preaches on the streets against \"pleasurable sex\" especially with them there \"love generation men\". Her motto is 'God is love, not sex' something she hopes to prove by luring randy men back to cheap hotel rooms then butchering them in the name of the Lord. Should we forget about Sara Jane's murderous tenancies there's also a folk song on the soundtrack to remind us that \"Sara Jane, Sara Jane,Sister Sara, you're insane\". Her opening pick-up/victim, a truck driver, rates as one of the vilest characters ever to appear in film and their 'moment' together is hardly the stuff of great romance. Spewing misogynistic dialogue he blows his top when Sara Jane starts singing hymns during sex, and bragging about bedding 4 or 5 women a week, having lots of illegitimate kids and not paying child support proves his final undoing. Sara Jane produces a knife from under the bed and offs the lowlife, Basic Instinct style.<br><br>Arriving in LA, Sara Jane wastes no time in whipping her accordion out for a religious sing song, in front of Grauman's Chinese Theater no less. Her sole convert Penny runs an apartment block in which Sara Jane soon sets about forming \"the secret order of the sisters of subjugation\" (total members:2). Penny's family actually pays for her to keep away from them because of her sexual orientation, which doesn't exactly go down well with Sara Jane either. \"I am a lesbian\" admits Penny \"but I'll stop it\". With that sorted the deadly duo go about luring male swingers back to her flat, with Penny seducing the men (suffering the horrors of heterosexuality in turn) and Sara Jane hacking them to death. Not that much appears to be known about director/actor Walt Davis outside of the films. He directed his first feature Substitution-a soft core sexploiter-in 1969 and worked regularly as a writer and director in the sex industry till the mid-70s,mostly for producer Manuel Conde. The blueprint for Evil Come,Evil Go was clearly Davis' earlier hardcore film Widow Blue-now more commonly known as Sex Psycho-which far from being your average early porno added in a cocktail of violent mayhem and a scene of gay sex (with Davis as one of the participants) and subsequently was deemed unreleasable only belatedly turning up on video in 1995 (its now been withdrawn). Davis retains a handful of ideas from the earlier film (chiefly a couples attempt to dispose of a corpse being thwarted by the arrival of a nosey third party) but keeps the sex scenes a shade away from hardcore this time. Still its all highly sleazy stuff and even the most casual viewing will tip you off it came from a pornographic collective making a stab at straightforward exploitation film-making. The film was in fact produced by Bob Chinn who had initiated John Holmes' 'Johnny Wadd' series,Holmes even has a cameo in Evil Come,Evil Go and the majority of the male actors are moonlighting porn stars like bodybuilder Rick Cassidy and Gerard Broulard who had been in Sacrilege and here turns up for the film's curious -to say the least- non-ending. On the basis of the gruesome twosome that is Sex Psycho and Evil Come,Evil Go it seems fair to say Walt Davis liked sex, blood flying in all directions and perverse black comedy. Its a little too early (made 1972) to have been influenced by John Waters but with its rough home movie look and semi-improvised feel to the dialogue comparisons are there. The two leads would certainly be at home in a Waters movie, particularly Cleo O'Hara with her Warhol Superstar like stage name. You're never quite sure if you're watching acting or slightly disturbed people given a film to run riot in. Some of Evil Come,Evil Go is actually very, very funny, especially when Sara Jane and Penny discover to their horror a couple having sex in their backyard and attempt to cool the ardour by circling the couple whilst playing the tambourine \"how dare you beget in front of me\" and then there's Sara Jane's occasional unchristian 'lapses'- when her attempts to blag a free hotdog from a fast food joint goes sour she mouths behind the manager's backwell something that can't be repeated here. Yet tongue in cheek as the film is, and exaggerated as the acting gets, at the same time there is something frighteningly believable about the dumb well-moneyed Penny who is so easily lead that her lesbian girlfriend addresses her in the manner you would a dim child who goes off with strangers at the mall, and Sara Jane with her impromptu accordion playing, Baby Jane get-up and ambition to have her own TV show could be a guest on Jerry Springer. Targeted towards the H.G. Lewis drive-in crowd and pushing down on all the sex and horror buttons to endear itself to that audience, Evil Come,Evil Go is certainly a film you won't forget in a hurry and just to make sure of it there are no shortage of baffling moments to ponder over after the credits roll. Such as who let a pet cat wander into two crucial scenes, why one character played by Davis himself is listed in said credits as an 'Arizona Pig Farmer' an unusual occupation not even referenced in the film itself, and should we read any deeper significance into the presence of a long haired, vaguely messianic character who discreetly follows Sara Jane around strumming his guitar and singing that song to remind us that Sara Jane is indeed insane. I dare say only Walt himself could tell us what it all means.","user":"gavcrimson","rank":[10,14]},{"title":"Occasionally creeky exploitation does deliver the goods.","rating":6,"date":"3 July 2014","review":"Evil Come, Evil Go has the strongest opening 20 minutes of an exploitation film I've seen for quite some time, with the main character singing a hymn on the way to pick up her first lucky/unlucky victim. When they're laying in bed together the rotten sleazebag berates her for continuing to sing hymns whilst he's \"tryin' to give head\" to her. Amusingly this ultra prude allows him to go all the way before sticking a knife in his back, ending his reign of wanton lust.<br><br>Unfortunately the pace does eventually let up, the numerous fateful sex scenes becoming increasingly dull. Sarah Jane's meeting with a lesbian named Penny does liven things up somewhat, she meekly agrees to assist her puritan rampage which yields several rather tasty murder scenes. The ending is a bit of a let down, but overall I had a fun time with this one and if the premise appeals to you then I imagine you will too. The running time is appropriate given the lack of variety within and prevents things from getting too stagnant. 2 years earlier Walt Davis directed the utterly perverted Sex Psycho, which is a real treat for lovers of cinematic depravity and must have surely been one of the most outrageous films to ever grace a grindhouse at the time.","user":"HumanMillipede","rank":[3,3]},{"title":"jaw-dropping heap of steaming 70s trash","rating":29,"date":"29 February 2004","review":"Sister Sarah is a Bible-thumping evangelist nutcase who dresses like Baby Jane Hudson.<br><br>She travels from one rural American ragdump to the next, vociferating the evils of recreational sex. Between her holy-rolling streetcorner castigations, she pacifies crowds with her mellifluous hymns(not only is she the Lord's golden-throated songbird, she also plays the accordion). By night, Sarah frequents bars, intent on luring \"sinful\" men to their bloody deaths. By-and-by, she takes on a wealthy, brick-ugly lesbian minion...together, these goose-stepping Christian crusaders become a holy force to be reckoned with. <br><br>Craggy little exploitation cowplop is too over-the-top to possibly be sincere...I suspect it has tongue lodged firmly in cheek when it's not lodged firmly elsewhere. EVIL COME EVIL GO is neither fish nor fowl...while nothing about it is exactly praiseworthy, it's generally more rounded than the centroid of its kindred contemporaries. And while the film's underpinnings may be of an erotic nature, it certainly won't serve to enhance xerotripsis for most fellows.<br><br>4/10","user":"EyeAskance","rank":[9,16]}]