[{"title":"The best script I ever read","rating":24,"date":"24 August 2004","review":"In 1992, I was a literary agent at Writers &amp; Artists Agency in Los<br><br>Angeles. In a town where new scripts by unproven young writers<br><br>can't get their scripts read, I was one of the few agents who was<br><br>eager to find new talent. One day, I received a letter from a young<br><br>writer asking me to read his script. The title intrigued me and the<br><br>story he described demanded that I read the script. The young writer's name was<br><br>Steve Conrad and he had just graduated from the University of<br><br>Chicago. The script was \"Wrestling Ernest Hemingway\", and from<br><br>the very first page, I knew I had to represent it. The writing was so<br><br>simple, so poetic, so powerful, so witty and so real that I called<br><br>him before I had even finished reading the script. I was able to<br><br>convince Todd Black, an enthusiastic young producer, to read it<br><br>and his passion matched mine. He sold it to Warner Bros. and<br><br>they made the movie. In a Hollywood rarity, Steve remained the<br><br>sole writer of the script.<br><br>I am so gratified to read the User Comments and to see how this<br><br>little gem of a movie has affected so many people. I am no longer<br><br>a literary agent; I now teach English and History to 6th graders. I<br><br>shall always be so proud that I had some part in bringing this<br><br>wonderful writer and his script to the screen, and that so many of<br><br>you have shared my passion about it.","user":"stipanich-1","rank":[44,45]},{"title":"one of the best films never seen","rating":10,"date":"21 January 2002","review":"The lack of attention this film received is an embarrassment.  This is a fantastic film.  Simple, elegant and true.  Beautifully rendered from all points.  In a just world, Duvall and Harris would have shared the Oscar. No other actors that year came anywhere near what these two accomplished. The fact that neither was even nominated is truly shameful.<br><br>If you were to ask me what it's about, I guess I'd say that it's about life, death, and rebirth, and all the human stuff that goes with that.  Oh yeah, and joy.  About how joy can seem like a distant, unreachable memory, when really it can be as close as the next park bench over--if only we have the courage.<br><br>If you want to experience a quiet little movie that will move you and reverberate in your memory long after, then seek this one out.","user":"forevercotton","rank":[23,23]},{"title":"Excellent, engaging, thoughtful movie","rating":10,"date":"18 June 2000","review":"This movie isn't for everyone. There is little action, no sex, nudity, or violence, no voluptuous bodies, no chase scenes (the fastest anyone goes is on a tandem bicycle), no glitzy special effects. There are very few characters at all; nearly all dialogue comes from the five top billings, and most from the two central characters: the old men played by Duvall and Harris.<br><br>Yet it is one of the most engaging and thoughtful films I've seen in a long time. It deals with aging in a realistic way that isn't morose or gruesome, but instead pulls you into the movie as if you're one of the cast who just doesn't happen to have any lines. You are \"there\" for the entire two hours and you don't want to leave. You quickly care about these people as if they're your own family members, and you move through the movie with them.<br><br>Neither do you want to miss a line. The acting is superb all the way around. Duvall's performance is incredible. I didn't come to IMDb today to write a review; I came to see if Duvall won an academy award nomination for his performance. I'm disappointed that this film appears to have won no awards at all. This is probably more a result of the film's poor box office showing than the quality of the movie (it only grossed $231,700, not enough to even pay the crew, let alone the cast). It's a shame that quality films such as this can't draw enough of an audience to be successful, or to even attract enough attention from Academy members for them to even see it and vote on it.<br><br>If you didn't know that Duvall was in this film, it might take you awhile to even realize it's him. I can't say enough about it, and am not a good enough movie reviewer to do his performance justice. I hope you'll just trust me on this one and rent this film. It's worth seeing for Duvall's work alone. The rest will be gravy.<br><br>But what tasty gravy it is. If you like movies that draw you in and present characters who are real, whom you care about, who change before your eyes in ways you can relate to and understand, then you'll really like this movie. If you like movies that change you a little, that teach you something about life without being at all obvious about it, that don't try to manipulate you, that are sincere, that elicit a range of your emotions without playing you like a cheap fiddle, then you really should see this.<br><br>I'm also disappointed in the movie's rating here on IMDb. I notice that the raw numbers are much higher, but the IMDb special formula has adjusted it significantly downward to factor out \"the village idiots.\" While I'm sure there's a good reason for IMDb's secret adjustment formula and that it is appropriate for many situations, I can't imagine that this is the kind of movie for which village idiots would try to stuff the ballot box. Most people who voted for this movie gave it very high ratings--7 to 10--and I'd recommend that you believe them. Wrestling Ernest Hemingway is a quality movie with broad appeal that will leave you feeling very glad you invested two hours in watching it.","user":"KevinB-2","rank":[31,32]}]