[{"title":"A fairly mixed affair that fails to pull anything off that well","rating":4,"date":"4 August 2006","review":"George Lennox is a bus driver in Glasgow who tries to go about his business in a cheerful, helpful and understanding way. When a ticket inspector takes issue with a young woman over as little as 40p, George helps her out and lets her get away. Later, the Nicaraguan exile finds George and gives him a gift to say thanks, but doesn't stay around any longer than that. George is both concerned for her and attracted to her and keeps pushing, but she withdraws more and more. Messing up her lodgings, George gets Carla a new place and tries to get to know her, unaware of where his relationship with her will take him.<br><br>A hard sell back in 1996 when it was released, not many people paid to see this and in a way it is still a hard sell now, perhaps appealing most to those who will always make the effort to see Ken Loach's work. The reason that it perhaps failed to grab an audience is that the film itself isn't sure what it is trying to do  and as a result is a bit fragmented and split. The film opens in a faltering way and it didn't convince me in how quickly it brought along George and Carla in the first stages. After this their relationship is a bit more convincing as it is brought on naturally as trust grows. At this stage Nicaragua is part of her character rather than the whole story. Gradually then suddenly the film becomes more about Nicaragua and George &amp; Carla's relationship becomes the device to get him (the audience's eyes) into the country to learn all about it. I felt a bit like my interest in the people had been thrown out the window, and the vague attempt to make it about them towards the end didn't convince me. Loach directs with earnestness but he cannot make this work as either a political education or a character piece; varying wildly between being preachy and being touching.<br><br>The cast try hard to find this middle ground and to their credit they do pretty well. Carlyle does well to bring out a real person in George, covering up the question marks early on. He is left a bit high and dry in the second half but does his best. The same could be said of Carla, who is a person in the first half and a journey in the second. Cabezas delivers the role as well as she can and is natural and convincing throughout. Glenn has an obvious role but he is a good presence. The rest of the support cast is solid enough but the problems is with the material, not with any of the cast.<br><br>Overall then a fairly mixed affair that is as affecting as it is preachy. Easy to see why it failed to get much of an audience as it makes for an uneasy mix of ideas that don't really come off  failing to educate much more than on a superficial level and failing to produce a real character piece (that would have been better).","user":"bob the moo","rank":[15,17]},{"title":"One of the best British Films of the Nineties","rating":10,"date":"26 February 1999","review":"It is easy to overlook this Ken Loach film.  Critics had not been so kind about the excellent Land and Freedom as they had been in the past, and Carla's song didn't fare that well either.  It seems difficult to understand why.  The inimicable brand of social realism is there as is the focus on the experiences and emotions of the individual.  There is even the trademark visual in-joke.<br><br>More than any other character in the recent past I cared for Carla.  All performances are exceptional.  What we have here is social realism that expands into political statement and ultimately human tragedy.<br><br>If at all possible, try to see this film.  Carlisle's broad Scottish accent may make it difficult to follow for the non-initiated, but persevere, and you will be rewarded.","user":"Serpico-7","rank":[18,22]},{"title":"This film really surprised me... a real masterpiece!!","rating":10,"date":"26 April 1999","review":"I am a great admirer of Ken Loach, the way he can make you get emotionally involved in the plots of his movies and how he designs his movies so one can fully comprehend the social situation his characters are living.  The atmospheres created by him show us examples of a social realism confronted by modern day people (especially in England).<br><br>When I started watching this movie, I really had no idea of the turn it would take.  When it turned out that \"Carla\" was from Nicaragua, and it was taking place in the time of heavy war, I didn't imagine the masterfulness with which he recreated the events.  Since I live in Honduras, I was very well informed and concerned about the Nicaraguan revolution.  All the scenes, the music and the whole environment really caused a great impact on me.  I could swear I was watching a documentary instead of a movie.  Living near that country and being in contact with its people helped me understand the hardships they went through.  And the situation painted by Loach of how the Nicaraguans felt and reacted about the war was incredibly realistic!!<br><br>Carlyle's character was superb!! He showed emotions that were very pure and sincere not only to \"Carla\" but to the whole situation.  He was just too good a person, he showed us unselfish feelings that nowadays are very hard to find in our society, which is oriented mainly to material purposes rather than spiritual fulfillment.<br><br>This is the kind of humanistic films that should be made to  teach people about the \"real world\" and true, unselfish comprehensive and devoted love. A love that goes so deep that one is willing to do anything for the other's happiness and wellbeing... even if it means letting them go.","user":"Marjorie-4","rank":[19,24]}]