[{"title":"All I'm seeing is Catherine and the laser beams","rating":7,"date":"15 March 2004","review":"That was the coolest part of the movie. I mean, I'm not a guy or anything, but I have to admit she does look sexy. I really enjoyed \"Entrapment\". It had high action and intensity. I saw the film over HBO, I showed my mom and she was in love as well. Although this is not my favorite Connery film, it's still worth a look. The love story wasn't really needed. But you'll deal. Over all, the film is good. It was well directed with some remarkable actors. And remember LASER BEAMS! If you don't like the film, you will definatly like LASER BEAMS! Hehe. I would recommend this to fans of Connery or Jones.<br><br>7/10","user":"Smells_Like_Cheese","rank":[41,49]},{"title":"Star Power Raises Film a Cut Above","rating":7,"date":"24 April 2005","review":"The action races from New York to London to Scotland to Kuala Lumpur, while three intricately plotted and technically executed thefts take place. The action twists and turns, the characters may or may not be what they seem to be, and crosses follow double-crosses. Thus, there is little time for the viewer to be bored or to ponder the implausibility of it all. But, in a sleek glossy film such as this one, logic is not a key factor, it's the look and the action that count, and both of those attributes, especially the look, make \"Entrapment\" an entertaining film. Sean Connery, who plays an aging master thief, can anchor any film that he appears in, and this one is no exception. His presence alone grounds the movie and nearly makes the implausible plausible. However, while Connery is one of a handful of men who have retained their looks and masculine appeal beyond middle age, the likelihood that the luscious Catherine Zeta-Jones, who is at the peak of her beauty here, would fall for him tests the bounds of credibility. Perhaps the romance was written in as a fantasy for us near-codgers and to give us hope. Besides the excellent cinematography of the human scenery, which also includes the dependable Will Patton and Ving Rhames, the lush photography of the Scottish Highlands offers an unsolicited advertisement for the Scottish National Tourist Board. If rooms were available in the luxurious castle that Connery uses in the film, this would have been written there.<br><br>Thus, \"Entrapment\" seems to have everything: beautiful people, solid performances, breathtaking scenery, suspense, and excitement. There is definitely enough here to entertain a not-too-discriminating viewer for two hours. Of course, afterward, one might ponder why all of the expensive high-tech security systems that are depicted in the film quickly fall victim to a pair of thieves who seem more amused with themselves than intense and focused when they are stealing such incredible sums of money. If theft were as easy and casual as Connery and Zeta-Jones make it seem to be, we could all have a lot more fun in life plotting and executing heists instead of commuting and staring at computer monitors.","user":"dglink","rank":[41,50]},{"title":"Good stars, good action, good plot","rating":6,"date":"8 February 2000","review":"One of the best things this movie has going for it is the two stars. Sean Connery is one of the most recognized and appreciated faces in film today. And Catherine Zeta-Jones is one of the most talented and beautiful new faces around today. Mix them into a film with some good action, an interesting plot and some cool gadgets and you've got a winner. That's what ENTRAPMENT is.<br><br>Gin Baker (Catherine Zeta-Jones) seems to be working for an insurance company. She has a certain fascination with Mac MacDougal (Sean Connery), who is an incredibly good thief who has stolen numerous works of art. After a particularly expensive work of art is stolen, her boss Hector Cruz (Will Patton) sends her to track him down, lure him to an extremely beneficial robbery and trap him (hence the title) so the FBI can arrest him. But Gin, who is a very talented thief herself has her own plans. With the help of Mac, and his partner that she doesn't know about named Aaron Thibadeaux (Ving Rhames), she wants to do a robbery with a payoff of billions of dollars.<br><br>The acting in this movie is, of course, excellent. Sean Connery, naturally, does his usual outstanding job, but Catherine Zeta-Jones steals the show. Her close-ups are beautiful, as expected, and she manages to give off a professional, and sexy, performance. Ving Rhames also does a good job as the not-sure-he-can-be-trusted partner of Connery. Will Patton also does a good job, even though his part isn't especially large.<br><br>The plot is very interesting, but the ending is a little confusing. It happens and ends rather quickly, which may make you think \"What just happened?\" You'll understand it a few minutes later, but some will be left with a some what dissatisfied feeling about the end.<br><br>This movie is really pretty good. The actors are good, the plot is interesting, the machinery is nice and the close-ups of Catherine Zeta-Jones' butt are great. Worth a rent, for sure.","user":"Xophianic","rank":[13,15]}]