[{"title":"Awe-inspiring","rating":10,"date":"10 June 1999","review":"Prior to the release of It, The Stand was my favourite King novel. It's a gargantuan effort which weaves a huge cast of disparate characters into an epic tale of the struggle between good and evil on the eve of Armageddon. I used to think about what kind of a movie could be constructed from the novel, even going so far as to pick a cast, but I always knew in my heart that the sheer magnitude of the undertaking would undoubtedly make an effective translation to screen impossible.<br><br>My worst fears were realised when I walked into my local video store one fine day last year and saw a poster for its upcoming release. The words \"teleplay\" struck instant fear into my heart, having been burned before by the made for TV adaptation of It, and when I scanned the cast list I nearly started screaming. Molly Ringwald?!! Rob Lowe?!! As Nick Andros?!! It was horrible, just horrible, and I resolved never to subject myself to the nightmare which I knew waited inside that double-cassette cover.<br><br>But one day I got bored, a few hours to kill before I went out on the town, so I figured what the heck, might as well give it a go, I can always drown my sorrows after it's over. I took the video home, made myself a strong cup of coffee, and sat down to partake of the carnival of horrors which had patiently waited to entrap me.<br><br>The film runs for a tad under six hours. I watched nearly five that day, and only left the last hour until the following day because the sun had set and fellow partygoers were banging on my door. This scene has been repeated by virtually everybody I know who has hired the film, and with good reason.<br><br>The Stand is a tour de force, a film which proves that a good story well told with a capable cast can overcome any censorship restrictions television cares to impose. I just don't know where to begin in my praise of this masterwork. I could praise those concerned for enticing King himself to write the teleplay, thereby ensuring it followed the novel almost to the letter, allowing the characters time to grow, to become real people, people we can love or hate, people we can root for or hiss at. Every major scene is there, lovingly recreated for our viewing pleasure, and it proves that King can claim a keen eye for the visual medium amongst his many talents.<br><br>I could praise the casting, which is as damn near perfect as you're ever going to get. There's Gary Sinise (\"Lieutenant Dan\" from Forrest Gump), who plays Stu Redman like he was born to the role. Molly Ringwald and Rob Lowe actually turn in stellar performances. The characters I'd known and loved - Tom Cullen, Lloyd, Glen Bateman, Larry Underwood - are all there, and when the movie was over I discovered that, however I had pictured them when I had read the novel, it was now impossible to imagine them as anything else. That's perhaps the highest praise which can be afforded an actor, and whoever the casting director was should have a statue erected in their honour. I would also like to mention the superb casting of Randall Flagg, \"The Walkin' Dude\". I couldn't believe it when he first appeared - \"That's not him!\" were the exact words which issued from my lips. The Walkin' Dude was supposed to be evil, fer chrissakes, and this guy looked liked he'd just stepped out of a Levis commercial. However, as the film wore on I realised just what a magical piece of casting had been wrought. Flagg is evil personified, sure enough, but he's also charismatic. After all, how many people, however blackhearted, would follow someone who actually resembled the evil he represented? So we have this good-looking, amiable dude who runs around recruiting his dark army, but there's always something not quite right about him, an edge to his smile, a flash in his eyes. Then, as things begin to fall apart, his true character reasserts itself, and it's even more shocking by virtue of the \"nice-guy\" image which he'd previously worn. Classic stuff, and it proved beyond a doubt why I'm an accountant, not a casting director.<br><br>I could praise the music, which unfailingly matches the mood, and which positively soars during the Wild Bunch-style scenes in which the four chosen ones commence their pilgrimage to Vegas. This is the kind of thing which doesn't take much to do, but which lends an epic quality to the proceedings.<br><br>And that's what really nails this film down as a classic - the little touches which ensure the film stays in the mind long after the credits have rolled. The slow degeneration of Ed Harris' general. Molly Ringwald's understated reaction to the death of her beloved father. Lloyd's realisation that things are falling apart, countered by his knowledge that he's committed, for better or worse. So much could have gone wrong in these six hours, so many cliché's enacted, and every potential obstacle is avoided with the expert skill of an Olympic slalom competitor.<br><br>I urge you to head down to your video store this weekend and rent this film. Take the phone off the hook, draw the blinds, stock up on Coke and munchies and settle in for six hours of unadulterated brilliance.<br><br>It *shines*, friends. I can say no more than that.","user":"Andybh3","rank":[271,325]},{"title":"Great adaptation","rating":10,"date":"14 April 2003","review":"Great job adapting a really long and complex book.  The characters are often very good (Bill Fagerbakke as Tom Cullen and Ray Walston as Glen Bateman, for example), and the storyline follows along that of the book.  Of course, there are some things left out or changed, but that was needed to make the movie only 8 hours.<br><br>This is classic Stephen King, minus a lot of the gore that sometimes he's known for.  It's the perpetual fight between good and evil.  It was great to watch the story of one of my favorite books.  Most of the characters bring such passion and reality to the story.<br><br>As a side note, I would recommend reading the prologue in Stephen King's newest edition of The Stand where he talks about making the movie.","user":"sweetkanake","rank":[55,74]},{"title":"A stand of good and evil","rating":10,"date":"16 June 2002","review":"I don't know if Stephen King is a religious man or not but this movie is the greatest example of good vs evil that I have seen in a movie. There is so much taken from the bible about the final battle of God and Satan and what leads up to it is what makes this movie a true classic. The characters are displayed as humans with many problems but because of the time spent building up who they are, when a number of them die, a pain is felt for their loss. This film contains no superheroes who use their strengths of martial arts, guns or wits to fight Randall Flagg, the person of satan, just the trusting of a God that has a use for them. Dreams and visions inspire them to search for Mother Abigail Freemantle, who is 106 years old, and is used by God to encourage them to travel to Colorado. God can use anybody (mentally retarded Tom Cullen, old man Glen Bateman, old farmboy Ralph Brentner and even a deaf and mute non-believer of God, Nick Andros) in His battle against evil. Satan himself has his chosen ones (crazed trashcan man, secret spies in the camp Harold Lauder and Nadine Cross) to bring destruction to God's chosen ones. The final part as God's two witnesses stand against all of Flagg's evil henchmen, standing \"in the name of God\" is what makes a final battle a true final battle. Two men against hundreds, an impossibility to win but with God on your side, all things are possible. Perfect casting and perfect writing makes this the greatest of all the Stephen's Kings mini-movies. A must see, especially if the odds are against you right now!","user":"jcholguin","rank":[78,113]}]