[{"title":"Underrated","rating":10,"date":"10 June 2000","review":"To me this one is a lot better than the third one, and just about as good as the original. I don't understand why people don't like this movie. Bob Uecker is as funny, if not funnier than he was in the original. Randy Quaid (hey vile thing) is hilarious as an obsessed Indians fan who turns anti-fan. The new characters are very funny and wacky. Also The game at the end is thrilling. All in all underrated, and just about as good as the original. I give Major League II *** out of ****","user":"jaws!","rank":[17,20]},{"title":"I thought there were just as many laughs and it was a decent sequel","rating":6,"date":"26 November 2006","review":"I don't know why the harsh rating, I mean, despite the fact that a few actors were replaced, I thought that Major League 2 was a decent comedy. Separated from the first, I think more people would give it a chance. How could you not laugh at the buddist out fielder? He was hilarious! I liked how they showed that most of the guys changed, it was so human and added a real story.<br><br>The boys are back for the next season, this time Rachel has sold the team to Roger and he is in charge. The boys have all changed though, mainly Rick, who has lost his \"wild thing\" edge. The boys this time want to make it to the world series, but that's going to be hard since most of them have taken their fame to their heads. Rachel buys the team back and the boys finally decide to get themselves together and get to the world series! <br><br>Major League 2 is a good comedy if you just let go of the first one, I know that most don't want to since the first was so original and a great comedy as well, but just give it a shot as it's own movie. It has some really funny moments that I loved a lot. This movie at least deserves to have a better rating than a sorry 4.7.<br><br>6/10","user":"Smells_Like_Cheese","rank":[10,13]},{"title":"Not as bad as some say","rating":6,"date":"4 July 2004","review":"Okay, I admit this film isn't quite as good as the original.  But aside from that, it really isn't as bad as it's being made out to be.<br><br>In my opinion, the biggest flaw was that it was supposed to be the `very' next year, but in reality the movie was filmed five years later.  This really showed with some of the characters.  Rick Vaughn (Charlie Sheen) was a rookie in the first film, but he's obviously not a kid anymore in this one.  When Jake Taylor (Tom Berenger) first stepped out of the taxi at the beginning of this movie, he looked so much older that it was stunning.  And Margaret Whitton (Rachel Phelps) had aged so much and gained enough weight that I literally didn't even recognize her at first.  All of this just took a while to get accustomed to, not to mention Willie Mays Hayes now being played by a different character.  They just casually slipped that in there like we weren't supposed to notice, but I never really could accept this as being the same character that I loved so much in the first film.<br><br>As far as the comedy, it's a bit more slap-stick than the original.  The character of Rube Baker (played by Eric Bruskotter) is likeable, but borderline goofy.  Also, Roger Dorn's character (played by Corbin Bernsen) has transformed from an egotistical bad-boy to a wimpy cry-baby.  I had trouble believing that was the same character as well.<br><br>But all of that aside, I still liked this film pretty well.  It just took me a while to adjust to the changes.  I enjoyed it better the second time I watched it, once the initial shock had worn off.","user":"JABrown","rank":[6,8]}]