[{"title":"A well-acted, non-schmaltzy drama","rating":7,"date":"17 August 2001","review":"What impressed me the most about \"One True Thing\" was how up-front it was when the daughter mentions her mother's cancer at the beginning of the movie. As depressing the subject matter was, it was a refreshing change of pace instead of being blindsided with the revelation about a character's fatal illness 2/3 into the movie (\"Love Story\" \"Terms of Endearment\", etc.). <br><br>Meryl Streep, Renee Zellweger and William Hurt give very strong performances that don't go over the edge. The characters they play seem human; they're not perfect people. (Arguably, one might not say that about the \"Martha Stewart\"-type character Streep plays but throughout the film, I found her character to be noble in a non-sappy way. She's dealing with her plight the best way she knows how.) <br><br>\"One True Thing\" is an observant, unsentimental family drama in which the tears at the end were well-earned.","user":"GMJames","rank":[31,32]},{"title":"A wonderful, wonderful film.","rating":29,"date":"29 October 2005","review":"This is one of my favourite films of all time, no doubt about it. Everything about it is superb. While it may appear to be a film which mainly appeals to women, I think that the men should give it a chance too - a substantial part of the storyline is from George Gulden's (William Hurt) point of view, as the father of the family.<br><br>Through 'One True Thing', we see how a family copes with disease - from everybody's point of view. Although we follow the story from Ellen Gulden's (Renee Zellweger) eyes, it never feels like we're missing out on anything.<br><br>The strongest point of the film is the superb acting. Hurt and Zellweger give very strong, convincing performances, and the supporting cast are also very good; however, it's Meryl Streep who stands out here. I truly believe this to be not only one of her best performances to date, but one of the best ever. Her work in this film is absolutely astounding. She's everything and anything the film could require from her - and then so much more. What she brings to this role is truly magical; the woman is a genius. How she could have missed out on the Oscar that year, I have absolutely no idea.<br><br>There isn't much more to say, except for SEE THIS FILM. It is all at once extremely insightful, moving, humorous and beautiful. You won't regret watching this one.","user":"Lothwesta","rank":[26,28]},{"title":"A Sombre Movie With Good Performances","rating":7,"date":"29 July 2009","review":"The DVD jacket in which this movie came describes it as \"uplifting and humorous.\" Those are not the words I would have chosen - not by a long shot. I would choose a word like \"sombre,\" sometimes even \"depressing.\" Which isn't to say that it's a bad movie. It's actually a pretty good movie, featuring good performances from the leads, with enough uncertainty throughout about what's going to happen at the end that you keep watching. The uncertainty comes from the structure of the movie - it seems to revolve around Ellen's reminiscences of her mother's slow death from cancer, as she is interviewed by the DA. So, we know from the start that something suspicious happened at the end - the questions are \"what?\" and \"who?\" <br><br>Renee Zellweger was very good as Ellen - the somewhat resentful daughter who has to give up her life and job in New York to return home to care for her sick mother. Ellen evolves through the movie - moreso than any other character - as she learns to deal with both the strengths and weaknesses of her parents. Her relationship with her father (William Hurt) is quite interesting. My initial impression was that they were quite close, but the warts in the relationship start to show after a while. Hurt was effective as the detached husband - detached not in an uncaring way, but in the sense of being unable to cope with what's happening to his wife, and seeking escape from it in various ways. Finally, Meryl Streep as the cancer-stricken Kate was very convincing in the role, seeking to live out what remains of her life in the most fulfilling way possible, then dealing with the anger she feels at her increasing debilitation. In a way, watching a family deal with this kind of crisis reminded me a little bit of \"Ordinary People,\" although this movie was far less emotionally intense. So, not \"uplifting and humorous\" (with all due respect to whoever wrote the synopsis on the DVD jacket) but very good in its own way. 7/10","user":"sddavis63","rank":[12,12]}]