[{"title":"Movie Sign!","rating":9,"date":"5 May 2009","review":"Mystery Science Theater 3000, anyone who is a fan of this show is a friend of mine, it's a great show for any movie buff. The reason why the show is so loved is because it does what we always want to do or say during a really bad movie. So naturally the successful show that was created on Comedy Central wanted to do a movie about our favorite sarcastic robots. Was the movie a success? Not so much, but doesn't mean that this movie is bad at all, in fact, it's a great one to watch. My only disappointment? I think was just the fact that this was just like any other episode, there was nothing really too special about it to make it stand out as a movie. Secondly, I've seen funnier episodes than this movie. I'm not dissing the movie, because this is still completely worth the watch.<br><br>Mike, Tom and Gypsy are startled to find Crow deep in the lower sections of the Satellite of Love, pounding at the hull with various digging instruments. He has convinced himself that he can tunnel back to Earth, he tells them. Checking his digging calculations, Crow discovers that he already knew this was inevitable: Look at that, Breach Hull, All Die. Even had it underlined! They return to the Bridge, as Dr. Forrester announces that he is about to make them watch the 1955 classic sci-fi thriller This Island Earth in an attempt to break their wills. In Mystery Science Theater 3000 tradition, we are in for a good ride as they mock this silly clichéd 50's sci fi film with no mercy.<br><br>I do love the film that they picked This Island Earth, while in some sense it is a fun little sci fi classic, probably the first movie that I saw before I ever saw it on Mystery Science Theater 3000, it still is really cheesy and fun to make fun of. I just love at the end where the alien is trying to protect our two main characters away from the monster and for some odd reason he just lightly blocks the two people away from the monster as Mike points out \"ACTING!\", lol! Obviously fans of the show are going to see this movie, it's a little girt to the fans I think in some sense, I wish they had a few more cameos and could've gone a little bigger, but it's all good. For those who don't know the premise of the show, this is a funny movie, the people that I've introduced the show too have mixed reviews, a few loved it a few didn't really like it, so it's one of those movies you'll have to decide for yourself.<br><br>9/10","user":"Smells_Like_Cheese","rank":[27,29]},{"title":"Is he wearing slacks?","rating":5,"date":"5 May 2004","review":"Funny funny movie, although this is my favorite tv show, so I'm biased. It's always nice to see Trace (Crow/Dr. Forrester), who left the show soon after this movie was released. It's nice to see the guys at all, since Sci Fi took the show off the air.<br><br>But I digress. The movie is almost exactly like the show, except shot on better film and with better effects. Jokes abound, and the victim is fairly awful. I thought they would have picked a worse movie to mock, though, as This Island Earth was a relatively harmless piece of 50's sci fi fluff. They have dealt with much more dangerous and evil pieces of celluloid than this one. But a good introduction for the novice Mystie. They can always find out about the horror that is Mandos later. <br><br>The humor has recently been called juvenile and aimed at teenage boys, but I must disagree, as I am a 25 year old woman with a Master's degree in English and still find the show hilarious. The movie is only a taste of the overall genius that is (or was) MST, and if you at all liked the film, immediately go out and get what DVDs of the show are available. It's worth it.","user":"kimmb","rank":[42,49]},{"title":"It may be simple... Even trite... But I've never laughed so hard.","rating":10,"date":"4 October 2004","review":"My opinion: The TV series was usually pretty funny, but had its ups and downs. The movie is just hilarious. They must have been saving this movie for a special occasion and they've honed their timing and jokes to perfection. The first time I saw this with some friends, we had no idea what it was. (It had been recommended by another friend.) From the opening credits to the end we were in stitches. I've never laughed so hard in my life. At a few points we almost had to pause the movie to catch our breath.<br><br>I should note that for the first ten minutes, we were watching the movie in a state of disbelief. We were all thinking \"What the devil is this? This is stupid!\" For us, this quickly passed and we had a great time.<br><br>This movie's not for everyone: If you're the type who likes to get weird, funny movies and hang out until 4:00 am acting goofy your friends, you'll enjoy this movie. If you're looking for a standard comedy, look elsewhere. If you won't take it seriously and just want to have some laughs, you'll enjoy it. If you have ever been referred to as a movie snob, please avoid this movie at all costs.","user":"thood-1","rank":[28,33]}]