[{"title":"The Son of Sam story is an effective backdrop","rating":9,"date":"19 July 1999","review":"I really enjoyed this movie.  The Son of Sam killings are just a backdrop to a slice-of-life story in New York City in the summer of 1977.  I believe that Spike Lee wanted to tell a story about the seventies - the excesses of sex, drugs and the desperation of the times.  He chose a summer that stood out in the minds of the people who lived through it because of the record heat, the murders and the blackout.  The Son of Sam killer was in one sense a strongly contrasting back drop and in another sense an extreme sign of the times.  David Berkowitz was out of control and driven by invisible demons, but that could be said of the main character Vinnie.  The difference between the two could almost be reduced to a matter of degree.  I was struck by the part of the story where a group of friends thought the killer was one of their own because he was into punk rock and same-sex sex for money.  Their misunderstanding of the killer seemed startling in light of what we know about serial killers today, but was dead on for the time.  Spike Lee reminds us with this movie how much damage is done when we allow ourselves to be driven by our ignorance and fear.  He makes us uncomfortable, of course, but the lesson rings so true.  As far as the direction went, I thought that it was classic Spike Lee with a little taken from some other popular young directors, but if someone imitates something good and does it well, I don't complain.  My favorite scene is where the punk rocker character Richie does a porno dance to The Who.  The soundtrack is also pretty good, by the way. I gave the movie a 9 out of 10.","user":"Becky-9","rank":[64,84]},{"title":"Summer of Sam, more like Summer of Sham!","rating":6,"date":"17 June 2016","review":"While, this movie really seize, what life of fear and alienation was like the summer of 1977, in New York City. It didn't really capture, the 'Son of Sam' expect that well. I get that, director, Spike Lee was facing a lot of negative feedback from the family members of the victims who didn't want a film being made which might glorify the killer in some sorts, but I think the movie would had work better, if the film focus, more on the murders case, than anything else. After all, I was really, hoping for a more insight tone about the way, the detectives and the press, were trying to figure out, who this man is. It would had made a very interesting story, similar to the way, 2007's film, 'Zodiac', told its story. Instead, the film mainly focuses on a group of fictional characters in The Bronx that has little to do with the police investigation. Directed by Spike Lee, the film follows local, hairdresser, Vinny (John Leguizamo) as he slowly unravels, into believing that his best friend, punk-rocker, Richie (Adrien Brody) might be the notorious '.44 Caliber Killer' that been, terrorize, their neighborhood, for weeks now. Without spoiling the movie, too much, I think this film plot would had work, if the movie didn't ruin the mystery, by exposing who the killer is, within the first 20 minutes. I believe, the movie would have work best, if they didn't show, .44 Caliber Killer at all, until the end. It could make the events of the third act, seem somewhat believable, and a lot more tragic, than it originally turn out. After all, the film really could had capture, the prejudices and witch hunts toward anything outside the norms, a lot better than they did. It wasn't ambiguous, enough. Another problem with this film, is how many loud &amp; obnoxious unlikeable stereotypical clichés characters, there were. They had no redeeming qualities at all. Plus, there was way too much, annoying and mean-spirited yelling from these characters, for my taste. It's was really deafening, and somewhat numbing. It's weird to find out, that this film was previously known as the most use of the F-word in a mainstream film, until 2013's 'The Wolf of Wall Street' came out. I never really notice, on my first watch. Maybe, it's because, I was trying to drown out, most of the useless dialogue, with 1970s music. However, after watching it, for a second time, I don't mind, the large profanity levels, since most of it, was used in, a somewhat realistic aggression tone that works with the intense subject matter, but I would love, if they just lower, their volume, a little down, at times. I thought my ears were going to start to bleed. About the sexual content of the film, it wasn't as bad, as people make it out to be. It wasn't very pornography. Yes, one of the opening scenes finds Vinny sodomizing his wife's cousin in the backseat of his car, while another scene finds him, and his wife, Dionna (Mira Sorvino) going to 'Plato's Retreat', a notorious swinger club, after they are refused entry into Studio 54, but those scenes were somewhat trim down, compare to the explicit original cut. I think, the only reason, why the MPAA threatened the film with an \"NC-17\" rating, was because of the scenes where a bisexual character was having sex with older men for money. It makes more sense. About the film's drug use, it was indeed somewhat glamorized here, like any other 1970s movie, but at least, the filmmakers were able to show the negative output, of living a life of substance. After all, it may be no coincidence, that Vinny &amp; Ritchie's drug use, cause them, to really distrust each other, leading to a climatic uber violence, encounter. As much, as the real serial killer, plays only a minor role in this two hour and 16 minute film; his scenes repeatedly shooting victims at nearly point-blank range were somewhat graphic and brutal. I just wish, he played, a bigger part in the film, and had more interacts with these characters. Another thing, the delivery of why, he was doing it, was always somewhat laughable. They were could had made, the dream sequence with 'Sam' seem, more menacing than cartoony. Despite that, the acting in this film, was alright for the most part, even if the women character don't really stand out, much. Each person, did what they were supposed to do, even if it was somewhat \"demoralizing\" to their careers. I also love the little cameo from Spike Lee, here, as well. Another thing, I kinda like, about this film, is Spike Lee was trying to expand beyond his previous black centered stories. It really make him, seem, least than one-trick pony. Overall: the film's direction is a mess. It's a highly repetitive film, full of many filler scenes, only there to make, certain New Yorkers, feel nostalgia for the 1970s. The only good things about the film, had to be, the music, costume design and cinematography; other than that, I really didn't like how this fake fictional story overtakes the whole real-life murder fiasco. I really can't recommended, watching this film.","user":"ironhorse_iv","rank":[6,6]},{"title":"Great movie!","rating":10,"date":"14 August 2004","review":"I know I may be one of the three people to say this (Roger Ebert being another of the few), but I think \"Summer of Sam\" is a great movie!  First off, I'm a Spike Lee fan and I do feel that this is one of his best films. I think the problem most people had with the movie was that it wasn't the standard serial killer thriller they were expecting.  If that's what you're expecting, you will be disappointed.  Instead, \"S.O.S.\" is a character study that focuses on the paranoia that spread amongst New Yorkers in the summer of the late seventies, when everyone was suspecting one another of being the Son of Sam.  It was like a modern-day version of the Salem Witch Hunt.  If you were as much as an eccentric, you were a suspect (like in the case of Adrien Brody's character in this movie).  I like movies that focus on characters, and take time to develop them to a point where a feel a deep connection to each of them.  Spike is one of those directors who favors character development over plot devices, and I think that's what makes most of his films work.  The characters and dialogue are written in a very realistic fashion.  It helps that Spike cast mostly authentic New York actors (i.e.:  Adrien Brody, Jennifer Esposito, Mike Starr, Michael Rispoli).  First of all, they don't have to fake their accents.  Secondly, New Yorkers just have a certain vibe that cannot be fabricated.  It also helps that the actors all have a great chemistry with one another.  The cast is excellent all-around, with not one bad apple in the bunch.  I think John Leguizamo gives the best performance of his career.  For a comedic actor, he can surely pull off a straight role with flying colors.  Part of the reason why is because he doesn't try too hard to play the drama, and when there's a scene that gives him a comic opportunity, he takes advantage.  It's nice to see that Brody became famous, after winning an Oscar for \"The Pianist\" (as a side note, he's the youngest ever actor to win a Best Actor Oscar).  If you're anxious to check out one of his good earlier performances, he does a superb job in this movie.  Some people have criticized the use of F-bombs throughout the film--and yes, there are many.  If you're easily offended by bad language, this will be like sitting through a death camp.  But I didn't feel the language was in any way gratuitous.  We're dealing with working-class Italian-Americans from the Bronx, who are involved in things like drugs and prostitution!  Obviously, they're not going to be saying things like \"gosh darn it!\"  This is not like \"South Park\" where there's just profanity for the sake of profanity.  It adds to the film's realism. Finally, I loved the film's lighting style.  Some of the shots are rough and grainy, but it helps intensify the gritty tone of the film.  If you're one of those people who likes slow-moving character studies with great acting, you might share my feelings about \"Summer of Sam.\"  Obviously, if you're part of the summer blockbuster crowd who favors explosions and gross-out gags, this will put you to sleep.  The movie runs at approximately 2 hours and 20 minutes, yet I never once felt bored.  I'm not one of those people with a minute attention span, but any movie that can sustain my interest for 2 hours and 20 minutes deserves much acclaim.  I have nothing wrong with long movies, as long as they're not overlong.  After all, bad movies are never too short and good movies are never too long.  When a movie is this great, you don't want it to end abruptly; you want it to keep going.  (10 out of 10)<br><br>P.S.:  The seventies soundtrack is magnificent!","user":"guyfromjerzee","rank":[57,80]}]