[{"title":"Underrated!","rating":6,"date":"7 September 2008","review":"A 3.0? Really? Have horror fans suddenly come down with a case of collective amnesia in the facts in the case of Tobe Hooper? The same director whose signature traits include a smattering of extreme gore garnished with dark humor? The man who made one of the most influential, landmark films of the 1970s (\"The Texas Chainsaw Massacre\")? I mean, granted, Hooper's career has been frustratingly inconsistent overall, but \"The Mangler\"--easily one of his most maligned works--is an unsung gem that suggests his tongue was planted firmly in cheek, but nobody really noticed. While the concept alone has \"disaster\" written all over it (a feature-film rendering of a Stephen King short story), what Hooper does with (and to) \"The Mangler\" is, really, what should have been done with \"Graveyard Shift\": he tears into the story with the veracity of a mental patient chewing the head off a rag-doll, elevating the absurdist elements to their breaking point, filling the film with (un)intentional humor to counteract the bloodletting, and fleshing out the characters and concept into a satisfying marriage of B-movie bliss. The plot? It's all about an anachronistic laundry facility where an ugly beast of a steam press starts folding the employees into bloody pulp; a pill-popping, chain-smoking local cop (Ted Levine) and his wiccan brother-in-law (Daniel Matmor) suspect foul play on the part of the disabled owner (Robert Englund, once again under a heavy latex mask), but the real reason is much more sinister (Hooper does succeed in making a compelling argument for the ridiculous explanation). While I haven't read King's short story, I will say that the script (by Hooper, Stephen Brooks, and Peter Welbeck) efficiently captures the quirky, small-town mannerisms of his characters, juxtaposed against evil spawned out of the banal territory of Everyday Life. While Hooper is unable to sustain the tricky balance between terror and dark humor that has made \"Texas Chainsaw\" so endearing, he ultimately transforms \"The Mangler\" into a sturdy, clean-burning B movie, buoyed by fantastic performances by Englund and especially Levine (who seems to be operating under the influence of a perpetual hangover).","user":"Jonny_Numb","rank":[24,32]},{"title":"A Humorous-Allegory of the Evils of Capitalism","rating":10,"date":"13 April 2006","review":"\"And did the Countenance Divine Shine forth upon our clouded hills? And was Jerusalem builded here Among these dark Satanic mills? \"<br><br>William Blake, \"Jerusalem\", 1795<br><br>\"We all have to make sacrifices!\" --from the Mangler-screenplay, 1995<br><br>Coming from Stephen King's 1978 collection of shorts, \"Night Shift\", Tobe Hooper brings us his very different-take: a parable of 19th Century, proprietary-capitalism and the nightmare of the American-workplace. This film is what labor-conditions were 100-years-ago, and what they could easily become again if we aren't too-careful. Since the discovery of a slave-sweatshop in El Monte, California a few-years after the release of this film, it isn't so fantastic. Maybe some of us were too-comfortable to \"get\" this film in the Clinton-era. Most people don't get this film at-all, even just watching it on its surface-levels. It's a real hoot! Yep, you can watch it with a beer, and you can watch it with an open-mind thinking about its deeper-meanings, or you can do both. And--shocker!--ALL of them are FUN.<br><br>Tobe Hooper has said for-decades he wanted to do comedy, and he comes close here, which helps this film from being too-oppressive. Ithink Hooper understood the story better than Stephen King--it seems King worked in a clothes-pressing plant like this one in the 1960s, which gave-rise to it, but Hooper has always struck me as politically-radical in his approach-to-horror. The best horror usually has a real subversive-edge, and this is what makes this a good one. Sure, it's hokey, but it has its tongue firmly-planted in its cheek, it is jokey. It also has some sub-themes in the lines, \"There's a piece of me in that machine--and a piece of it in me.\" It speaks well of how people are spiritually-contaminated by our system. The disease is greed.<br><br>If it wasn't for Ted Levine (\"Buffalo Bill\" in Silence of the Lambs) as the bedraggled town-cop John Hunton, Robert Englund would literally steal-the-show here. Tobe uses some great low-shots and wide-angle lens compositions (ala \"Citizen Kane\") that lend the film a great comic-book look, and make Englund shine as a despicable-villain. The irony is, mill-owner Gartley is also a victim of the machine, even robbing him of the ability to walk. He's also half-blind, which makes-sense. The characters are pretty well-drawn, and we learn that Detective Hunton has some baggage left-behind from the death of his wife in a car-accident, years-earlier. The town is run like a virtual-dictatorship by Gartley, who basically represents the \"robber-barons\" of the 19th century (as well as today), completely-uncaring about the safety and welfare of his employees. A man who has lost his humanity. Sound familiar?<br><br>Eventually, an accident occurs where the niece of Englund's character spills her own blood on the \"Mangler\", a clothes-press that must be 100-years-old. Another shop-employee spills her belladonna-laced antacids into the guts of the machine, and it begins taking-victims...and parts. Oddly, all the people Bill Gartley \"owns\" (the Mayor, the Police Chief, Doctors, etc.) have missing-fingers. Of course, the premise of a demoniacally-possessed machine is fantasy, which is what makes the story a parable, but it's fun. Over-time, Detective Hunton finds that the Gartley dynasty has been-sacrificing their own young to the infernal-machine for a century, and now they're \"spreading-the-love\". Don't all employers? Some require the blood of a virgin!<br><br>So, people have been wrong about this one. It's a minor-classic of a bad-decade for horror. The genre has its fallow-periods where interest isn't as-high, and 1995 wasn't exactly a banner-year for horror-buffs. And quit-comparing every film a director does to their most well-known ones, it's emotionally-retarded. This is a solid horror-film, and if it had been presented in the proper-context, would have been better-appreciated. The short-story is good, but this is better, and Stephen King sure isn't Edgar Allan Poe or Lovecraft ferchrissakes. The New Line DVD is great, it has a perfect widescreen-transfer, and even includes the gore that was cut with split-screen comparisons to the theatrical-version. A great horror-film, and a respectable one for Tobe Hooper. Now you can all go and rewatch the original \"Texas Chainsaw Massacre\"--just don't touch-yourself so-much this time. We all have to make sacrifices, after-all. Ignore the other reviews, those people are snobs.","user":"myboigie","rank":[34,48]},{"title":"Not as bad as it's reputed to be.","rating":7,"date":"20 May 2006","review":"Robert Englund is the evil owner of the laundry company who has the ancient steam press that periodically sucks workers into its bowels,turning them into bloody mess.Ted Levine stars as the local sheriff who is called in to investigate the deaths and solve the mystery.Levine discovers the steam press was possessed when a virgin cut her hand into it's gears causing it to come to life.And Englund wants to make his niece the next human sacrifice to unleash the evil.\"The Mangler\" is an enjoyable little flick filled with plenty of gore.It's based on Stephen King's short story in his famous collection \"Night Shift\".Admittedly the plot is pretty silly and there are some huge lapses in logic,but who cares.I wanted grue and this flick provided it in spades.7 out of 10.Much better than crappy sequel that followed.","user":"HumanoidOfFlesh","rank":[14,18]}]