[{"title":"debut full of charm from the experts in subtle comedy","rating":7,"date":"1 January 2005","review":"While \"Bottle Rocket\" is certainly best categorised as comedy this might mislead those expecting the typical composition of one-liners, facetious mocking and exaggerated situational comic of mainstream Hollywood productions.<br><br>Instead the humour derives from the quirky, yet lovable characters, their perspective on life and approach in dealing with the challenges of society.<br><br>The quiet matter-of-fact absurdity present throughout the film will evoke a constant smile rather than burst-out-laughter. This is typical of all Wilson/Anderson collaborations (Rushmore, The Royal Tenebaums) where strong characterisation enables the viewer to develop understanding and affection for the protagonists as the story slowly unravels. In \"Bottle Rocket\" this is supported by strong performances, especially that of Owen Wilson, who proves his actor potential in an atypical role.<br><br>Though not flawless, (there is a lack of narrative urgency at times), this movie leaves the viewer ultimately entertained and charmed.","user":"ej-talbot","rank":[53,62]},{"title":"I normally hate Owen Wilson...","rating":10,"date":"17 January 2004","review":"In anything. But man was he great in this movie. I mean it was such a good performance. This movie is director Wes Anderson's (Rushmore, The Royal Tenenbaums, The Life Aquatic) feature directorial debut. It's about a group of misfit friends that decide to take up a life of crime. The group includes Anthony (Luke Wilson) just got out of the nut house and is searching for himself. Dignan (Owen Wilson, co-wrote the movie with Anderson) is the confident but bumbling ringleader who wants to be notorious but doesn't know how to execute a plan to save his life. And Bob (Robert Musgrave) the driver/look out who just wants a little recognition. The movie follows their misadventures of them robbing a bookstore, going on the lamb, Anthony falling in love with a Motel maid who instills joy back in his life, and Dignan's 'big score' that involves his former employer. The subtle humor and deliveries by the actors make the movie stand out in it's own little version comedy. The characters are losers, but lovable. You can't help but cheer them on even though what they do is illegal. I highly recommend this cool little film. It's an excellent introduction into the wonderful films of Wes Anderson.<br><br>RATING: **** out of ****","user":"obiwan2005","rank":[82,109]},{"title":"A new favourite for me","rating":8,"date":"7 January 2012","review":"I find it really hard to explain to people why I think Wes Anderson movies are so great. There's an air about them that's so wonderful and I always feel really great after I've watched them. When I tried to explain my friend said, \"a bit like the Big Lebowski?\" and I think that's the closest you can come to describing Bottle Rocket and Wes Anderson movies as a whole they're that sort of brand of movie.<br><br>Bottle Rocket is the story of three guys who live in the suburbs who are trying to become criminals and not making a very good job of it. The film starts with Anthony (Luke Wilson) coming out of a voluntary rehab type place and instantly joining his friend Dignan in his very poor attempts to become some sort of criminal. They are joined by their friend Bob, because he has a car, and start by robbing a library. The film really emerges from that moment and takes you on this up beat, weird (but wonderful) adventure.<br><br>Owen and Luke Wilson are really good together, with Owen Wilson probably stealing the show as the completely useless but very endearing Dignan. Bob, played by Robert Musgrave, is also excellent in his role as the lovable loser. The soundtrack is perfect, everything comes and goes at exactly the right moment. <br><br>This was probably one of the funniest films i've seen in a while too. If you like the Big Lebowski you will love this film (my favourite is probably \"Anthony wake up, Bob's stolen his car\"). It also feels a lot longer than it is and whilst that's usually bad, in this case it was fantastic. At 30 minutes I looked to see how long I'd been watching it for and was amazed at how engrossed I was but also how much happens but yet the film manages to feel really slow and relaxed.<br><br>Though I've said Dignan was endearing I guess the movie as a whole is endearing, its such a lovely film, I really don't see how you couldn't like it. Some how this just misses out on being a real classic on a level with Big Lebowski, maybe its because not as many people have seen it or something, either way its definitely in my top ten or top five or something. A must see, go and watch it!","user":"davidgkimberley","rank":[13,15]}]