[{"title":"Surprisingly good","rating":6,"date":"3 June 2003","review":"Considering the critical drubbing this movie received, not to mention the fact that it's by the writer/director of Two Days in the Valley, I expected it to be pretty terrible.  Surprisingly it turned out to be an exciting and occasionally quite funny thriller about two media obsessed thugs from the former Soviet Union who decide to become celebrities by committing a series of murders and videotaping the crimes.  The movie is definitely not without serious flaws: for instance, nobody ever points out that it's almost impossible to mount a successful insanity defense in the US legal system. In a land where Jeffrey Dahmer and New York's highly delusional subway shooter are certified as sane these guys wouldn't have a shot in hell of making their case, and an insanity defence is the linchpin of their whole plan to profit from their crimes.  Movie also ignores the fact that laws have been on the books to prevent criminals from profiting from their crimes by selling their stories since the 1960's.  Also, given the legal and ethical ramifications involved it's hard to imagine any credible scenario under which a news program, even a sleazy tabloid news program, would pay a million dollars cash to an at large murderer for a videotape of one of his crimes and then broadcast the thing live on television.  Obvious flaws aside, 15 Minutes has several shockingly well-staged action sequences, great acting (except for the guy who played Ed Burns' boss--his grating one note performance went way over the self-parody line) and occasional welcome touches of black humor, like the very funny death scene of the thug who fancied himself a film director and manufactures the final shot of his movie for maximum emotional impact.  All in all 15 Minutes is a dark and funny thriller and certainly a lot better than most of the schlock Hollywood churns out.","user":"jhs39","rank":[50,58]},{"title":"Makes you think","rating":7,"date":"5 February 2005","review":"This movie took a severe beating in the press and most reviews, so I wasn't expecting much when I went to see it. However, I was pleasantly surprised, and reassured that my distrust of what the newspaper reviewers think is not misplaced.<br><br>This movie has a cast that includes the supremely talented Robert de Niro, Kelsey Grammar, and Edward Burns. It has some excellent writing and some top-notch acting performances. But its real accomplishment is how it makes you think.<br><br>The increasing relationship between crime and the media is not linear, and the movie does tend to oversimplify at times. In many respects, it suffers horribly from being predictable, although there were instances where it strayed sharply from the \"rules\" of formulaic movies. (Saying any more on that score would give away important aspects of the plot, so I'll refrain from elaborating.) Furthermore, in true Hollywood tradition, the main villains are dumb, completely amoral, and oh, did I mention foreign? The idea might have been to give an outsider perspective on the abuse of American culture, but that angle ultimately just plays into outdated audience prejudices against people who speak with an Eastern European accent.<br><br>Too, the movie has very graphic violence - but not as bad as I'd expected, and not as bad as what is shown in many other movies. Through creative camera angles, many of the bloodiest scenes are only obscurely hinted at, leaving the audience to fill in the pieces.<br><br>Not surprisingly, many entertainment reviewers disliked the movie, because it has the effect of exposing some of the more negative effects of the media. \"15 Minutes\" does not claim that the media causes violence; rather, it explains that the interplay between the two is ingrained in American culture. This movie may not be saying anything original, but it is sufficiently entertaining and thought-provoking to make it worth seeing.","user":"segacs","rank":[75,92]},{"title":"One of the Best Commentaries I've Ever Seen","rating":9,"date":"2 August 2004","review":"This movie is a commentary. It is a commentary of fame, of the media, of America's justice system; and it's one of the best fictional film commentaries I've ever seen. Robert De Niro and Edward Burns star as a cop and a fireman, respectively, searching for two murderers played by Karel Roden and Oleg Taktarov. A few other great actors round out the cast of this medium-paced thriller/actioner with some depth of thought. At the very least it keeps you entertained until its cool ending.<br><br>I would highly recommend this to anyone who's ever watched a newscast, ever seen someone get off on the insanity plea or ever wondered what goes on behind the curtain of the justice system. Just see it.","user":"Krog__","rank":[26,30]}]