[{"title":"Don't let the cover fool you","rating":30,"date":"30 October 2010","review":"\"Kolobos\" opens in someone else's point of view, someone who's obviously out of it, wandering the night-time streets aimlessly. The person is suddenly hit by a car, and when one of the vehicle's occupants gets out to check on the person, we find out that it's a female as she faintly utters the word \"kolobos\". The girl is taken to the hospital where she is operated on before being put in a room to recover. The patient next to her decides to read newspaper ads to her for the hell of it, and one of the ads triggers her to remember everything that has happened to her (we also find out that her name is Kyra, and she has spent time in a halfway house). It's an ad looking for five young people to participate in a groundbreaking new experimental film. They will be stuck in this big, fancy house with video cameras watching their every move. There's just one problem. Something is very awry in this house, and all hell is about to break loose. Could ex-loony Kyra be behind it all, or is there something much more sinister afoot?<br><br>\"Kolobos\" is a film which I passed by many times in the video store and never even thought about checking out, as the cover made it look like yet another DTV waste of space. Later, I saw some raves about the film on one of the boards I frequent, so I decided to finally check it out was promptly blown away. The film's cover art does not do it justice at all! It's easily one of the most atmospheric, downright creepy as hell independent horror films I've had the pleasure of viewing.<br><br>The characters are all well-portrayed, the actors making them feel like real people in search of their own 15 minutes of fame. It's somewhat ironic that Amy Weber, who plays Kyra, actually went on to be one of those flash in the pan types herself. Too bad, as she's actually quite solid here. The authenticity of the characters makes the brutal gore harder to take than it normally would be. The first death in the film, for instance, not only took me by total surprise, but it was disturbing to watch as the victim slowly succumbed. I didn't even like this particular person, but the brutality and realism, both in character and reaction, managed to get under my skin.<br><br>The house makes for a creepy setting, and it oozes a sense of the foreboding right from the start. The film's score also helps, and it should seeing how it sounds quite similar to the masterful music from \"Suspiria\" at times.<br><br>This film took me by surprise and turned out to be one hell of an intense gem in the often generic sea of direct to video horror. It is now a permanent fixture amidst my collection, and I wouldn't have it any other way.","user":"Cujo108","rank":[27,32]},{"title":"Candy Colored Nightmare Fuel","rating":8,"date":"21 June 2019","review":"Kolobos might not be a title you hear thrown out in horror circles very often, because it was dumped into video stores without a theatrical release and given lousy artwork that had nothing to do with the film. This is definitely a small, low budget affair, but there's a lot of thought put into it and it looks absolutely beautiful.<br><br>The entire film is bathed in lighting that would make Argento and Bava proud and the death sequences are fairly imaginative and well done, especially for a low budget film like this. The final twist isn't handled very well and it comes across as a bad afterthought, but everything else is so captivating that I can't even fault it for that.","user":"jeanlevy","rank":[11,12]},{"title":"The (Sur)Real World","rating":8,"date":"12 July 2019","review":"A group of 20-somethings are lured to a house under the guise of doing some sort of Big Brother type reality show and they end up getting killed one by one in various grotesque ways.<br><br>Kolobos doesn't really make that much sense, but it's well made, decently acted, and has a handful of unforgettable images that will stick with you for awhile and I'll take that over a generic, by the numbers Hollywood movie anytime. I suppose you could chalk all the weirdness up to the nightmare logic of the film. In this way, it does resemble a Bava or Argento film. The dialogue, character arcs, and storyline might be a bit flat, but it's never dull and the film looks excellent.<br><br>The ending seems to be the major issue with everyone and I'd agree - it feels tacked on and strange and almost like they were trying too hard to explain everything while, somehow, managing to make everything even more convoluted.<br><br>Besides that, Kolobos is a likable and enjoyable piece of nightmare cinema that comes highly recommended.","user":"tildagravette","rank":[9,10]}]