[{"title":"My son was the little boy in the movie","rating":8,"date":"28 May 2006","review":"I enjoyed the movie because my son Zach was the little boy in the movie. It was the only movie he ever appeared in. (He was actually cast in another movie, but his scene was cut.) He just graduated high school and will begin college in the fall. It is really nice that people talk about his one movie. By the way, on the set Susan Lucci, Gabrielle Carteris and David Charvet were all really nice to Zach and he enjoyed the experience. The movie was filmed in Phoenix, Arizona. Susan's husband Helmut was frequently on the set. In one scene where Zach was in the hospital, he is supposed to be sick. He wasn't acting. On that day, he really was sick. The film is sort of unbelievable, but it was great escapism.","user":"benzachg","rank":[9,15]},{"title":"By the time I got to Phoenix my life went to pieces","rating":5,"date":"18 February 2008","review":"(Some Spoilers) Coming to Phoenix Arizona to start a new life with his wife Cheryl, Gaberella Carteris, and six year-old son Justin, Zach Glicksman, Dan Hiller, David Charvet, didn't realize went he was getting into when he accidentally bumped the fender of Victoria Landers', Susan Lucci, flaming red sports-car.<br><br>Victoria seeing what a prize the boyishly handsome as well as innocent Dan is immediately went into high gear and got his number, or business card, in case her car suffered any damages. Victoria's car was quite all right but Dan's life turned out to be a disaster area with her squeezing every drop of blood, and penny, out of it as well as the lives of both Cheryl and little Justin.<br><br>Being an up and coming contractor Victoria got the hard up, for cash, Dan a job at her palatial estate fixing or improving everything that needed or didn't need improvement on it. What really needed improvement for Victoria was her love life in that she's having a hard time as of late keeping on to her boyfriends. It was \"lucky\" Dan who was the one, in Victoria's devious mind, to spice things for her by having him stolen away from his wife Cheryl. By making Cheryl think that he, not Victoria, was the aggressor in this soon to become wild and adulteress affair Victoria planned to have the reluctant Dan thrown out into the street, and out of his house, with no place to go but back to her!<br><br>It didn't take long for Dan to get under the covers, as well as go skinny-dipping, with Victoria but the price he was to pay for his youthful indiscretion, Dan was only 22 at the time, was the loss of his wife and family. Victoria used everything in her arsenal to not only get Dan in the sack with her but keep him for getting work, as a contractor, to support his young family. Heartless and determined to get and keep Dan all for herself Victoria went as far as putting young Justin's life at risk by having him left alone in the house as Dan and Cheryl went out to dinner to patch up their differences.<br><br>Dan and Cheryl having called for a babysitter, Marissa Hall, to watch over the sickly Justin, he just got out of the hospital, Victoria told her that her father suffered a near-fatal heart-attack and that she's her replacement, a lie on Victoria's part, to get Marissa to leave Justin alone. Calling family services, and of course not leaving her name, Vitoria told them that the Hillers are unfit parents which had them rush over to the Hiller house and take Justin, in tears, away from his shocked and startled parents when they got home!<br><br>As you would expect Victoria's obsession with the handsome and hunky Dan Hiller got him to finally break off all relationships, that included his only source of income, with her. Mad as a hornet, or black widow, by being dropped and made to look like a foolish and love-sick school girl Victoria was not going to let Dan get away so easy. <br><br>**SPOILER ALERT** What Victoria didn't realize was that Dan had the goods on her in an affair that she had years before she ever met him. An affair that lead to the death, or murder, of her lover Judge Reardon who like Dan dropped her like a hot potato. Overplaying her hand Victoria went a bit too far in silencing the very person who can finger her in Judge Reardon's death, and what she's now doing to Dan, in that crime: Vctoria's late lover's wife Charlotte Reardon, Mary Ellen Trainor. That mistake on Victoria's part was all that Dan, and the police, needed to put her away for good but, in knowing that she was beaten in her own game, Victoria ended up doing the job for them!","user":"sol-kay","rank":[2,2]},{"title":"\"The Graduate\" meets \"Fatal Attraction\"","rating":4,"date":"13 December 2006","review":"The plot of this film might best be described as \"The Graduate\" meets \"Fatal Attraction\". The central character is Dan Hiller, a young man working as a builder, who meets, and has a brief affair with, Victoria, an attractive older woman. When his feelings of guilt (he is married with a young son) lead him to break off the affair, Victoria will not take no for an answer and pursues him, attempting to break up his marriage and ruin his career.<br><br>In \"The Graduate\", Mrs Robinson was supposed to be about twenty years older than Benjamin, although in reality Anne Bancroft was only six years older than Dustin Hoffman. In \"Seduced and Betrayed\" we have the opposite situation. Susan Lucci, who plays Victoria, is actually twenty-six years older than Baywatch beefcake David Charvet, who plays Dan, although I suspect that the difference in the ages of the characters is supposed to be rather less. Charvet was only twenty-three when he made this film, considerably younger not only than Lucci but also than Gabrielle Carteris who plays Dan's wife Cheryl, and wears designer stubble throughout, presumably a desperate attempt to make him look slightly less boyish. I doubt if the scriptwriters really intended to imply that Dan had fathered a child while still a schoolboy and that Cheryl was guilty of the statutory rape of a minor.<br><br>This carelessness about casting is only one of the problems with the film. After the success of \"Fatal Attraction\", there was a vogue in the late eighties and nineties for thrillers of this type, in which stranger who comes into the life of the hero or heroine initially seems pleasant and affable but later proves to be a mentally unstable or dangerously malevolent villain. \"Fatal Attraction\" itself is a reasonably good example of the genre, but \"Seduced and Betrayed\", which copies the same basic plot, is much weaker. Glenn Close gave an excellent performance in the earlier film, but Lucci is not in the same class as an actress. She has a reputation as the Queen as the TV movie- as far as I am aware she has never made a cinematic feature- but her performance here does nothing to counter the frequently-held belief that the TV movie is the last refuge of actors insufficiently talented or charismatic to make it in Hollywood.<br><br>She is reasonably convincing as the seductive older woman, looking surprisingly glamorous for a woman only just short of her fiftieth birthday, but when in the second half of the film the script requires her to turn nasty it is evidently asking for emotions beyond her range. The storyline obviously indicates that Victoria reacts to Dan's rejection of her with rage and vindictiveness, but Lucci's demeanour indicates nothing more serious than mild disappointment. Hell hath no fury like a woman slightly miffed with her ex-boyfriend.<br><br>Another reason for the weakness of the film is that Victoria is too obviously a villain. In \"Fatal Attraction\" we may not sympathise with the behaviour of Close's character Alex, but we can at least sympathise with her plight as a woman approaching middle age and desperate for love. Similarly, we can sympathise with the feelings of Rebecca de Mornay's character in \"The Hand that Rocks the Cradle\", a woman who has suffered much and is desperate for revenge. This sympathy gives those films an added depth and resonance, but Victoria is so obviously selfish and manipulative, using her wealth, beauty and influence to snare Dan, that no such sympathy is possible here.<br><br>Carteris is not particularly convincing as Cheryl, and although the youthful Charvet copes surprisingly well with his role, there was nothing here to persuade me that this film was anything more than a routine TV potboiler. 4/10","user":"JamesHitchcock","rank":[3,4]}]