[{"title":"This operation was real. I was \"there.\"","rating":13,"date":"13 February 2011","review":"In 1968, I was the CA NCO (Civil Affairs Noncommissioned Officer) for Co. C, 5th SFG(A), 1st SF, HQed In DaNang, RVN. I was not directly involved with the mission but had a front row seat and the officers I worked under kept me apprised of the progress. These facts might be of interest:<br><br>1. \"Our\" Top Secret operation had two elephants called Bonnie and Clyde.<br><br>2. The elephants were not dropped in slings or standing up as depicted in the movie. They had to be tied down to airdrop cargo pallets. If they were hung in slings, their own weight would have suffocated them. If they had been dropped standing up, their weight would have caused fatal physical harm upon landing. <br><br>3. Two veterinarians were flown from England to sedate and revive the animals. <br><br>4. The purpose was not for a ceremony but for a much more practical reason. A sawmill had been built in the village to help its economy. The mountain trails were much too narrow to use bulldozers to drag the trees to the mill and someone came up with this idea. <br><br>5. The mission ultimately was a failure. The elephants were juveniles (weight!!!) and were much too small to drag the large logs. Growing elephants eat a lot. The village chief complained that the villagers were being forced to travel deeper and deeper into VC controlled territory to collect banana trees for their fodder. I don't know how this problem was resolved.<br><br>The movie was much more interesting and fun, as the actual mission was pulled off without a hitch and had little entertainment value. My credibility could be verified on my website which I am required not to include, but I'll be glad to provide it to anyone who is interested. There is a direct contact link available.<br><br>For those reviewers who chose this forum to again knock a war over 36 years gone, SHAME ON YOU! You have only exposed your own ignorance. As all soldiers in every war , some Americans conducted themselves better than others. As this mission actually went (and as depicted in this DRAMATIZATION), many of us worked tirelessly to improve the lives of the Vietnamese. <br><br>I am most proud of my days in Vietnam when I was privileged to provide food, cooking utensils, clothing and other necessities to peoples displaced by the war. Many good American lives were lost directly attempting to prevent harm to Vietnamese people. I risked my life more than once, not in combat, but in aiding \"common\" villagers in tasks they could not accomplice themselves. My OIC (Officer in Charge) was shot down and killed while attempting to evacuate refugees from a besieged A-Camp. HE DID NOT HAVE TO BE ON THAT AIRCRAFT. <br><br>You are welcome to your opinion and can state it per the First Amendment but, ethically, you should study and actually know a little bit about the topic before you share an opinion. And for Heaven's sake, keep political opinions on political forums. \"Dumbo Drop\" hardly glorified warfare. It just exposed the truth that a little bit of good can be found in most things, even things as tragic as warfare.<br><br>And to the reviewer who doubted that anything funny ever happens in warfare: You too, speak out of ignorance. I spent two years in country and had many genuine good times, often with the fine Vietnamese soldiers with whom I worked.","user":"trickymisfit","rank":[74,77]},{"title":"Dumb Fun.","rating":18,"date":"18 September 1999","review":"Operation Dumbo Drop is one of those movies that despite its' implausible and shallow trappings, is wholely enjoyable.<br><br>The movie is set during the Vietnam War, a setting in time not particularly known for its' lightheartedness. The story concerns a group of soldiers who must replace an elephant from a village where one was originally a war casualty. Sound ridiculous? Well, it is. However that does not stop the completely likeable cast including Danny Glover, Ray Liotta and Denis Leary from appearing to have fun with the movie. While the movie is set up as  children's fare, there are some relatively intense scenes of war which are inevitable given the setting.<br><br>Yet through it all, the story manages to exude humor and warmth which make it easily one of the most pleasant Vietnam-era movies ever. While not necessarily recommended for all kids, this movie is family friendly and entertaining, contrary to popular belief.","user":"Elbow","rank":[21,24]},{"title":"The positive side of Vietnam","rating":5,"date":"11 January 2016","review":"Released in 1995, \"Operation Dumbo Drop\" is a Disney flick inspired by the real story of the US Army supplying an elephant for a village during the Vietnam War. Danny Glover and Ray Liotta star as the two officers in charge of the mission assisted by Denis Leary, Doug E. Doug and Corin Nemec. Dinh Thien Le appears as the boy, Linh, companion of the elephant Bo Tat.<br><br>An NCO indirectly linked to the real operation said the movie was much more interesting and fun than the actual event as the mission was pulled off without a hitch with little entertainment value. Being a Disney flick, the combat situations are \"Yeah, right\" and no one gets hurt, but that's to be expected. Other than this, it's a straight forward dramedy/adventure.<br><br>While I'm generally not into Disney flicks, it's nice to see a more positive side of the war after watching movies like \"We Were Soldiers,\" \"Platoon\" and \"A Rumor of War.\" Believe it or not, there WERE fun, comedic and altruistic occasions over there, every day. Many good Americans perished directly attempting to prevent harm to Vietnamese people. Many risked their lives not in combat, but in aiding civilian villagers in tasks they could not accomplish themselves. Many worked tirelessly to improve the lives of the Vietnamese, providing food, cooking utensils, clothing and other necessities to those displaced by the conflict. Yes, I realize you could argue that they wouldn't be in such a predicament if there was no war, but don't forget that, generally speaking, the South Vietnamese didn't want communistic rule and the conquest-minded NVA were no angels. Look no further than the incredible killing fields of Cambodia.<br><br>I love elephants, so I also appreciate this element. What's most enjoyable, besides the great cast, are the exceptional Thailand locations. Although there are a few eye-rolling parts, like all Disney movies, a lot was put into making this film. It's a fun adventure reminiscent of \"Indiana Jones and the Temple of Doom.\" Unfortunately, there are no key female parts and the \"Yeah, right\" moments are too painful to give a higher rating.<br><br>The movie runs 107 minutes.<br><br>GRADE: C+ or B- (5.5/10)","user":"Wuchakk","rank":[9,10]}]