[{"title":"Good Cast Helps This Pleasant Love Story (spoilers).","rating":7,"date":"20 May 2004","review":"Alfred Molina and Marisa Tomei head up the cast of this pleasant romantic comedy about a former political prisoner and a former sugar cane farmer who leave Cuba for the United States in 1980 on what I presume to be the famous Marielle Boat Lift that brought Cuban exiles to the states (although the boat looks much smaller than it did in 'Before Night Falls'). Having the same last name, the man and the bouyant young woman pose as husband and wife (and later members of an extended Perez family) in order to gain a sponsor who will give them a place to stay and some kind of work.<br><br>But, Juan (Molina) is expecting to be reunited with his wife (Angelica Houston) and grown daughter (Trini Alvarado). His traitor brother-in-law, who was responsible for the twenty years he spent in that dreadful prison, comes to the dock looking for Juan, but is told by the guard that Juan and his wife already passed through. So, Angel (the brother-in-law) is under the assumption that Juan remarried and broke his sister's heart, and now he tells his sister to forget about him. Juan, in the meantime, has no idea about the misunderstanding, but longs to be reunited with his family.<br><br>However, along the way, Juan and Dorita (Marisa Tomei in a fantastic performance) build a friendship, and eventually, fall in love for each other. And his wife (Houston) similarly finds a relationship with a charming cop (Chez Palminterri). Juan and his wife, after so many years apart and finding satisfaction and closeness in relationship, they find it hard to rekindle what they once had. <br><br>It isn't that they're being disloyal to each other. Despite being married, they had been away from each for more than twenty years and could not just pick up where they left off.<br><br>It is a pleasant romantic comedy and has some very funny moments as well as an excellent cast, particularly Marisa Tomei, who pretty much drives the whole movie as the young Cuban female who tries to create a close family (with others similarly named Perez) and searching out something like an \"American Dream.\"","user":"vertigo_14","rank":[17,18]},{"title":"Meet The Perez","rating":5,"date":"5 February 2009","review":"Mira Nair's take on comedy is quite impressive. The director is known for her more intense and dramatic films but here she proves that she can direct a comedy. Though 'The Perez Family' isn't without its share of flaws, it is overall a funny movie with loads of laugh-out-loud moments. The film is about a group of Cuban immigrants who move to the states, one of them is in search of freedom and another in search of his family whom he hasn't seen for 20 years. While the film is essentially a comedy, Nair does tackle some issues that represent the darkness of an immigrant's life.<br><br>The score is energetic and the cinematography is vivacious. The pace tends to drag in some places and near the end becomes a tad too intense. Perhaps Nair could have balanced it off by including more comic punches. The dialogues are wonderful, especially the ones between Tomei and Molina.<br><br>Marisa Tomei has never looked hotter. She is both sensual and hilarious and very convincing as a Cuban wild flower. She was also excellent in the more intense scenes. Angelica Huston too displays a sophisticated sensuality and shows that she too can be funny on screen. Alfred Molina is good but not as effective as his leading ladies. Chazz Palminteri is charming. The late Celia Cruz makes a pleasantly awkward appearance.<br><br>'The Perez Family' is quite a charming and funny romantic comedy that gives us a glimpse of the hardships of immigrant life but also lots to laugh about. Would like to see Nair make more comedy.","user":"Chrysanthepop","rank":[8,9]},{"title":"Exploits the spice of Cuba but is really just a predictable romantic comedy/drama","rating":28,"date":"28 March 2004","review":"When President Carter declared an open door policy to anyone who wanted to escape Cuba and come to America, Castro used this to clear his jails of criminals and political prisoners.  When Juan Raul Perez gets on the boat he hopes his wife will be there to meet him, as she fled to the US decades ago. When she doesn't come he ends up in the camp with everyone else, including the feisty Dorita Evita Perez.  The two need a sponsor to get out of the camp and realise that things would be easier if they were a family.  For that reason they pretend to be married and gradually start putting their fake family in place.<br><br>I was drawn to this film by the cast list and in fairness I should have spotted that this film about Cubans had very few Cuban or even Latino actors in it.  Anyway, aside from that the plot has historical context but I am not familiar enough with it to say if it was accurate or not, although I really don't think it matters very much.  The film tries to fizzle with Latin spirit while at the same time delivering a rather convoluted romantic drama of sorts.  It partly works but the writing isn't great and the film failed to really engage me as it just seemed a little forced as if it had been a good idea once but had had so many knobs added to it that it got a little daffy.  After an hour it settles into the formulaic mould it was in all along, the historical context forgotten and the clichés allowed to flow. If you can't see where this is going then I salute your ability to blindly accept what is given to you.<br><br>Talking of clichés, the casting of so few Hispanic/Cuban/Latino actors was a mystery to me.  Surely it would have been possible to get closer than Italian, which is what quite a few of the main characters appear to be. Tomei was the name that drew me to this film but in turns her role is good and bad.  She has an important role and it was necessary for her to be feisty etc but she overdoes it a little bit - hammy up her Latin cliché at the start for all she is worth; she gets better though.  Molina is another strange choice but he does well in his role and carries some dignity through the film - it's not his fault that the script gets silly in trying to keep him and Huston apart.  Huston is OK but her subplot seems added on to make the ending more palatable to the audience (god forbid anyone should be hurt).  For this same reason, Palminteri is wasted. Cruz is good and Chowdhry is quite funny, but why Gallo even bothered is beyond me - pre-fame I suppose.  SNL's Cleghorne plays a cop and, in the spirit of ethnic clichés, pushes the `oh-no-she-didn't' eye-rolling, `talk to the hand', neck moving black character for all she is worth - when she does it as a joke it is OK but here it just felt like laziness - especially for such a minor character.<br><br>Overall, any Hollywood film with Latinos/Cubans/Hispanics in it is going to force the rhythm for all it is worth and here is no different.  It starts out boasting historical context and spice, falls into a rather convoluted series of plot twists that end up taking the film down a rom-com road to a solution that, although badly delivered, unthinkable and out-of-nowhere, was obvious from about 30 minutes into the film.","user":"bob the moo","rank":[8,10]}]