[{"title":"Traffic delivers a powerful message with impeccable flair.","rating":10,"date":"9 January 2001","review":"Early in the year 2000, director Steven Soderbergh's film, Erin Brokovich, sizzled at the box office  (bringing in over $130 million) while receiving critical acclaim.  Now, with the release of his latest film, Traffic, Soderbergh stands to earn Oscar nominations for Best Director and Best Picture for both of these movies.  It's no wonder, either, as Traffic is one of the most gripping films to hit theatres in 2000.<br><br>Traffic takes on the complex issues involved with the war on drugs in the United States and Mexico from the view of these nations as a whole to the very personal level.  In the film, three  stories unfold to illustrate the near impossibility of ever stopping the drug trade, despite the billion dollars that the US spends each year for just that cause.  While the tales are related, the characters rarely, if ever, cross paths with one another. This is one of the elements that allows Soderbergh to deliver his message so effectively.<br><br>The first story features Benicio Del Toro as Javier Rodriguez Rodriguez.  A cop in Baja, Mexico, he enforces the law and allows the wheels to be greased from time to time.  After pulling off a huge drug bust on the Juarez drug cartel, the powerful General Salazar swoops in to confiscate all of the drugs and the credit.  Later, Javier and his partner are recruited by Salazar to fight the war on drugs by aiding him in bringing down the Obregon cartel that has plagued Tijuana for some time.<br><br>Meanwhile, back in the States, Judge Robert Wakefield (Michael Douglas) of the Ohio Supreme Court is about to be appointed by the President as the nation's new leader in the drug war. For the judge, the drug war is about to become more personal than he could ever have imagined.<br><br>In San Diego, Monty (Don Cheadle) and Ray (Luis Guzman) are two federal agents perpetrating a drug bust on a slimy drug supplier named Eduardo Ruiz (Miguel Ferrer).  The events that follow lead them up the drug food chain to Carlos Ayala, a well-to-do suburban man who has been smuggling illegal drugs into the country from Mexico.   His arrest leaves his pregnant wife, Helena (Katherine Zeta-Jones, who was really pregnant during the film), to fend for herself while taking care of their son, court costs, and a $3 million dollar debt to the drug lords in Mexico.<br><br>Traffic, written by Simon Moore (the writer for the British miniseries, Traffik, upon which this script is based), is superbly crafted and woven. We learn just enough about each character to give us some insight into their motives for the courses they choose to follow.  By the films end, matters are not neatly wrapped up; there is not a fairy tale ending.  This simply adds to the realism of the issues presented within the movie.  Furthermore, the intertwining stories drive home the fact that drugs are closer to you than you think.<br><br>The script is bolstered by the phenomenal, ensemble cast.  Zeta-Jones and Del Toro have both received Golden Globe nominations for Best Supporting Actress and Actor in a drama for their roles in this film.  Don Cheadle is superb in his role.  Michael Douglas gives his usual performance while Erika Christensen does a good job as his daughter.  Topher Grace (of TV's That 70's Show) is excellent as her upper-class, druggie boyfriend.  Dennis Quid's character, while played adequately, is underused.<br><br>The stories were shot using various filters and lenses, neatly separating them as the film went from one to another and adding to the viewing pleasure of the movie. Mexico is filmed through a hand held camera and yellow lens to give it a dry, grainy, shaky look that heightens the feel of unrest involved with Del Toro's situation.  Douglas' story is initially filmed in a hue of solemn, comforting blue.  Zeta-Jones' story is filmed without the use of lenses, suggesting that her situation and actions are the most realistic and achievable of all those presented.<br><br>Despite some dialogue that spouts off statistics and seems a bit preachy, Traffic ranks among the top ten films of 2000, surpassing even Soderbergh's other venture, Erin Brokovich.  Don't be surprised if this film picks up the Oscar for Best Picture.<br><br>By film's end, the message is clear and powerful. The fight against drugs is a long, uphill battle, but it is better than no battle at all.","user":"bigrogges","rank":[70,82]},{"title":"The Real Best Film of 2000","rating":9,"date":"16 July 2001","review":"A dazzlingly complex film, `Traffic' takes a hard, unflinching look at the so-called `war on drugs' that is perfectly clear and uncompromising. Director Steven Soderbergh takes the various viewpoints of the drug culture -- the users, the dealers, the police, and the politicians -- and weaves their differing stories together into a single story that is both deep in its ideas but very simple to understand.  In terms of story, direction, and characters, `Traffic' is easily Soderbergh's best film to date, and one of the best films made in recent years, period.<br><br>`Traffic' takes a look at the world of drugs through the stories and lives of different characters.  Some are loosely connected to one another; some are not.  There is the story of Javier Rodriguez (Benicio Del Toro), a Mexican policeman struggling to keep his distance from the corruption that seems to follow him everywhere; there is the story of Ray Castro (Luis Guzman) and Montel Gordon (Don Cheadle), two DEA agents trying to turn the low-level drug dealer Eduardo Ruiz (Miguel Ferrer) against his drug cartel boss; there's the story of Helena Ayala (Catherine Zeta-Jones), the unsuspecting wife of the drug cartel boss who suddenly learns who her husband really is and what he does for a living; and then there's the new head of the DEA, Robert Wakefield (Michael Douglas), a man so wrapped up in his mission to stop the war on drug, he fails to notice that his own daughter Caroline (Erika Christensen) is becoming addicted to crack.  Much like in the real world, the events of each story directly or indirectly affect the events of the others, leaving all the characters to consider their roles in the drug culture . . . and what, if anything, they can do to change those roles.<br><br>In terms of story, `Traffic' is absolutely brilliant.  I'm still amazed that the film could cover so many plotlines and dozens of characters so effortlessly.  Each story -- whether it's Helena assuming the role of her drug-dealing husband, or Robert canceling DEA meetings so he can deal with his drug-addicted daughter -- is powerful and brutally honest.  `Traffic' isn't afraid to look at tough or uncomfortable issues.  `Traffic', somewhat surprisingly, never preaches, either -- while it's safe to say that the message of the film is essentially anti-drug, it never comes out and outright says that message.  A lesser film would've had some grandiose speech imbedded somewhere in the film denouncing the use of drugs -- not `Traffic'.  It's wise enough to let the viewer take what messages they want from the film, without ever preaching.  (A minor quibble -- did Michael Douglas' character really have to be the new drug czar of the United States? The fact that he was the top law enforcement drug official in the U.S., and that his daughter was addicted to drug . . . well, it seemed a little too far-fetched, and a little too movie-like.  If Mr. Douglas had been playing ONE of the top drug officials in the federal government, instead of THE top official, I would've found his character to be infinitely more believable.)<br><br>Soderbergh's also at the top of his game with his direction of `Traffic'. The film is virtually filmed entirely with hand-held camera, giving each and every scene an up-close-and-personal feel.  There's also a distinct lack of background music, which lets the viewer feel like they're eavesdropping on real-life scenes, and not just watching a movie.  These techniques make for a very personal, intense experience.  Soderbergh also uses a technique he's used in some of his other films (Out of Sight, Erin Brockovich) -- certain scenes are filtered a specific color, to heighten a mood or a sense of awareness of what's about to happen.  The scenes in Mexico featuring the Mexican detective Javier, for example, are all filmed in a very bright, almost disorienting yellow.  It's a technique that can be irritating at times, but for the most part, it serves a bold purpose that truly adds to the film.<br><br>As for the characters, and the acting . . . jeez, `Traffic' is without a doubt one of the best-cast films of all time.  I mean it.  There are no weak links, no poorly written characters, and no badly played characters.  Each and every character adds something significant to the story in `Traffic', and each and every actor is outstanding.  Kudos must go to possibly one of the best ensemble casts of all time.  Three actors in particular stand out, though -- Benicio Del Toro (who won the Best Supporting Actor Oscar for his performance), Don Cheadle (who was actually slightly better than the brilliant performance of Mr. Del Toro, IMHO), and Catherine Zeta-Jones. I'm normally loathe to use the word `flawless' when describing a film, but the casting of `Traffic' was indeed flawless.<br><br>`Traffic', with its unflinching look at drug use in America today, can be uncomfortable at times to watch.  It certainly can't be termed a `happy' or a `feel-good' film.  That doesn't change the fact that it is an amazing, thought-provoking, powerful film -- and without a doubt the best film released in the year 2000.  I can't recommend this film enough.  Grade: A","user":"MadReviewer","rank":[142,186]},{"title":"Soderbergh's best film is a thrilling ride...","rating":10,"date":"19 December 2000","review":"The film more than delivers on every level and is certainly a lock for Best Picture of the year. Soderbergh has been on an astonishing roll, demonstrating exceptional versatility in his choice of genres and tremendous agility in balancing artistry with entertainment. He's been America's most consistently brilliant and unpredictable filmmaker for the last decade, and Traffic is the culminating work of his career. First and foremost, it's a richly entertaining epic that recalls the great works of the 1970s, when directors like Robert Altman and Francis Ford Coppola engaged mass audiences with works of genuine substance. Soderbergh works on a larger canvass than he's ever done before, bouncing several characters and plot-lines against and off each other, so that images and themes rhyme and echo. Although the subject matter is drug trafficking, this is not an \"issues\" movie per se. Instead, it's a profoundly affecting dramatic thriller where the destructive forces of drugs cut across different sections of society. What's most impressive about the direction is how Soderbergh manages to avoid both sentimentalizing and moralizing about drugs. As with Erin Brockovich, there's a graceful absence of self-importance and bombast in the presentation. However, this doesn't mean the film lacks a strong point of view.<br><br>Stylistically, this film represents a major breakthrough. Soderbergh shot the film himself (under the pseudonym Peter Andrews) and Traffic takes all of his past experiments with color, available light, and hand-held work light-years beyond The Limey and Out of Sight. He has created a brilliant style that could best characterized as expressionistic naturalism. His loose hand-held style lends the film an extremely spontaneous realistic tone, but the modifications of color amplify the drama. Each storyline has its own distinct look that accentuates the emotions underlining the film. (The Mexico story involving Benicio Del Toro is told in earthy saturated yellows, the story of Michael Douglas and his daughter Erika Christensen is told in an aquarium blue, while the Catherine Zeta-Jones, Luis Guzman-Don Cheadle story gets a natural available light look). In addition to being visually striking and cool in a completely unpretentious manner, Soderbergh's camera technique transcends mere virtuosity and actually becomes another character in the film. As usual with Soderbergh, the film is edited with musical verve and skill, where time is collapsed and expanded, and characters are seen reflecting on past actions.<br><br>I've been remiss in not discussing the acting earlier. This film has an amazing ensemble cast where everybody is working at the top of their game. However, Benicio Del Toro definitely stands out with the breakthrough performance. I don't think it's accidental that the movie begins and ends with shots of him. He plays Javier Rodriguez, a Mexican police officer caught in a futile and corrupt system, and it's as compelling of a character as Michael Corleone. Del Toro is exceptionally relaxed and subtle, keeping his thoughts and feelings private from the other characters in the films, but sharing it with the camera. Del Toro navigates the audience through a world of impossible choices and moral corruption, quietly simmering with intense conflict just beneath the surface.  Benicio's been an indie stalwart for years, but this film should shoot his stock through the roof. If there's justice in this world, he'll be rewarded with Best Actor Awards aplenty.<br><br>Michael Douglas is also terrific, adding another strong performance to his gallery of flawed men in power. He shows genuine fear and vulnerability in a harrowing scene in which he searches for his daughter in a drug dealer's den. I've never seen Erika Christensen before, but she makes an impressive debut.  Don Cheadle and Luis Guzman (they should star as a team in every movie!) are as loose, limber and spontaneous as ever, providing plenty of comic relief as well as keeping it real. Catherine Zeta-Jones takes a complete 180 from her past roles and admirably plays against her looks, appearing very pregnant while thrown into gritty surroundings. Dennis Quaid is appropriately slimy as a corrupt lawyer.<br><br>Anyway, film geeks and anybody else starved for a genuine piece of filmmaking should breathe a sigh of relief and give thanks that Soderbergh has come to save the day.","user":"xraymonkey71","rank":[83,106]}]