[{"title":"A very bold attempt for a modern open-wheel racing movie","rating":8,"date":"1 November 2001","review":"I love CART racing. I love any form of auto racing. When I first heard that Sly Stallone set production the first auto racing movie of the 21th. century I rose in excitement. I was even lucky enough to be at the Toronto Indy to watch portions of the filming as Champ car replicas roared out of the paddock. Watching this movie, I was treated to some fantastic special effects that were taken to level very close to the 1966 classic Grand Prix. Unfortunately, details of Driven's plot resembled Grand Prix too closely for this movie to be considered a creative attempt. Jimmy Bly(Kip Purdue) and Beau Brandenburg(Til Schweiger) both provided very respectable roles as co-stars alongside Sylvester Stallone playing the aging veteran driver Joe Tanto. The characters were developed enough through the film to understand their unique personalities. I was deeply impressed with how Driven displayed the drivers as understandable of their competitors and respected each other on the race track. I hate how some racing movies turn racing into a reckless grudge match. One of the worst elements in this movie is that only three drivers with the exception to happy go lucky teammate Memo Heguy (Who ran in place of Tanto for races) were shown within a twenty-plus driver field. Actual indy-style open-wheel racing is often much more competitive than shown in Driven. This movie shortfall was probably left over from the Formula One script that Stallone started with. All and all, Driven has weaknesses when comparing it as a great racing movie. But, it was a very suitable movie for family entertainment.","user":"firefox-CWN","rank":[9,10]},{"title":"Eyes for sale... I no longer want them, they feel soiled now.","rating":15,"date":"15 July 2004","review":"Hey, I didn't watch the film deliberately. I live in a house with two batteries and one of them wasn't in the remote and if I ever find the sod I'm justing going to dispose of it in a fire regardless of what the instructions say.<br><br>You know how in real races they sought through the mangled wreckage in search of the remaining bits of the driver after a crash? That's what it's like trying to find a film amongst the last two hours of my life... except in that this case if I find anything still moving I'm going to hit it with a shovel. <br><br>I've experienced pain in my life, I've experienced head injuries, and oddly I suspect that those involved in making this film have too. The only difference is I let my pain out in a long girlish shrieks and they decide to bottle it up and then inflict it on others. <br><br>Here is the plot *SPOILER* <br><br>Things go in circles.<br><br>Not the cars, the plot. Well, the cars might have done but there were so many random changes of camera angle that I was too busy having a seizure and staining the carpet with my froth.<br><br>So basically the plot is goes as follows: Seizure, despair, seizure, disbelief at plot, seizure, why has that man got a very odd shaped head, seizure, someone almost does something of a social nature, seizure, the first hour of the movie turns out to have no relevance to the first hour, seizure, cars driving down street in a hilariously homoerotic display of gurning and head wobbling, seizure, begging for death, seizure, uncontrollable laughter at quite possibly the most crack-inspired moment in film history, at which point I was too busy crying to have any further seizures.<br><br>I should have stopped watching when my hand subconsciously began crawling towards the jumbo bottle of sleeping pills, yet I became strangely fixated by the horror...much like when you see a crazed but very small dog attacking a pensioner. <br><br>The level of testosterone displayed in this film makes Top Gun look like The Muppets Take Manhattan. Eventually I cringed so much that when they loudly announced they were going to \"double-team the field\" I slipped a disc. Women are allowed to do two things in the movie, stand there, and bend over. On a side note, neither of the two main ones seem able to do this well for the five seconds of screen time they have before it gets back to the seizures and I suddenly realize I have a shotgun barrel in my mouth and my toe's heading for the trigger.<br><br>I'd like to comment more on the plot but after a while I started drawing a more interesting film on my eyeballs with a pencil. Mine had Godzilla ripping Stallone in half, their film had some car doing something. Mine is better. Just trust me.","user":"VengefulSquirrel","rank":[43,63]},{"title":"Man, I wanted this movie to be good...","rating":1,"date":"26 July 2002","review":"As a big auto racing fan, CART in particular, I awaited this movie since the mid-90's when it was discussed as a Formula One movie.  However, Formula One wouldn't allow the access that it did for Grand Prix in 1966, so the director defaulted to the North American CART series.  CART allowed unprecedented access to its venues, races, paddock, announcers, drivers, sponsors, etc.  But this movie fails in that it is nothing more than an auto racing cliché.  As a fan, it's hard to rebuff the blood sport aspect of the sport to those who are not fans.  The crashes are incredibly unrealistic, some of the tracks are non-existent and the drivers are paper thin.  The scene near the swimming pool with the blonde vixen doing some sort of goofy water aerobics is pathetic.  The part where Jimmy Bly steals a car (that happens to be filled with fuel indoors and doesn't need an external starter to run) and drives it through the Chicago streets with Stalone in tow is just ridiculous.  And to they get arrested or even prosecuted for this action?  No, they just are forced to convey one of the stupidest dialogues in the history of racing movies.<br><br>The CART series is in serious trouble in real life.  A movie about the excitement of the series, the strategy, the action and the pageantry of racing could have boosted the series back to national respectability. However, this movie just hinders its descent into oblivion with the Can-Am series.  It could have been so much more.","user":"senninha70","rank":[74,114]}]