[{"title":"A great movie about a good person trying to do good things in a bad world.","rating":28,"date":"28 May 2004","review":"This is an excellent movie that surprised me at every turn. It felt like watching someones real life, with up and downs and real decisions. One Good Cop is an uplifting story about a good person with difficult decisions to make. After the death of his partner Keaton and his wife (Rene Russo) are given custody of his three girls. Keaton cannot afford three kids and foster care will split the kids up. The decision that Keaton makes is brutal but for people who are desperate sometimes something brutal is the only solution. I had never heard of this movie before but it has become one of my favorites. Michael Keaton gives a great performance the entire way through. This is a 4 for 4 star movie.","user":"Rome3","rank":[19,21]},{"title":"Keaton Captures","rating":31,"date":"31 January 2004","review":"As usual, Michael Keaton delivers an excellent performance.  Whether the scene calls for humor, pathos or action, he's your man every time.  I watch his face and body language closely in every one of his films, and he is always up to the demands of every role.  He is as good an actor as any of the most celebrated stars, past or present, but is underappreciated.  Also note his loyalty (or that of others to him), in employing the same people for assistance in many or most films. This is a guy who will bring you to tears with laughter or sadness, just in the way he portrays the character. His scene in his superior's office when he thought his career (and life as he'd known it) were over, was excellent - subtle, but he brought out how a person in the position would feel. Yes, this is a light movie, but heavy on quality, because of Michael Keaton.  I'll continue to watch, enjoy and be amazed at his work, time after time.","user":"caroledelm","rank":[18,23]},{"title":"Plenty of Action, but not just a Guy Film!","rating":8,"date":"18 October 2006","review":"In my opinion, this film is one of the most underrated action films of the nineties. Although it received some fairly good reviews by the critics, it was not very well publicized considering the quality cast. I would rate it as one of my top 100 all-time action films. The majority of IMDb voters appear to disagree with that evaluation. I believe this is related to two major factors. The first factor being the lack of hype for the film, as demonstrated by the fact that there were less than 1,000 IMDb votes cast for this film as compared with two other action films released the same year. Backdraft and Point Break each had in excess of 16,000 IMDb votes cast and received significantly higher evaluations. I believe that both of these films are excellent action movies, but I also believe that this film is every bit as exciting as those films and contains some intriguing elements that the others do not posses. The second factor is that many younger male viewers are turned on by non-stop action films with multiple shoot outs or demolition derby type car chase scenes. This film has a few action packed scenes but also takes the time to present a tender family oriented story. The IMDb voting demographics indicate the lowest rating for this film was provided by male voters in the 18 to 29 age group which appears to validate this theory.<br><br>The film tells an emotional police story and explores the personal life of a police detective who struggles to provide a family life for the young daughters of his slain ex-partner. Although primarily an action movie, the film has several heart warming moments as it explores why individuals sometimes do the wrong things when motivated by the right reasons. Michael Keaton as the detective, Renee Ruso as his wife and Anthony LaPaglia as his partner all give strong performances which draw viewers into the emotional drama. Rachel Ticotin's character development is also key to the presentation.<br><br>In my opinion an IMDb rating of between 5 and 9 would be justified for this intense police drama. I personally gave it an 8 out of 10 and would recommend it for male viewers looking for a rental to view with their wife or date. This date night type film, contains elements which should entertain both genders.","user":"VideoJoeD","rank":[10,12]}]