[{"title":"Damn Yankees!","rating":7,"date":"27 August 2006","review":"Poor Al Percolo, he is a man that has brought shame to the Yankees by recommending prospects to the team that don't work out. The team's general manager, Ron Wilson, wants to punish him by sending him deep into Mexico to scout new talent. When Al sees Steven Nebraska pitch in a Mexican league ball game, he realizes this is going to be his redemption. Not only is he a great pitcher, but can that man belt home runs out of the ball park!<br><br>As Al stages a test to show the different major league teams what Steve can do, Steve Nebraska proves to be the man they all have been waiting for. He is signed for an awful lot of money, but he must pass a sanity test in order to join the team. No sweat! Al gets the name of a psychiatrist out of the Yellow Pages, who turns out to be Al's worst nightmare. Dr. Aaron discovers Steve is an abused child that has a lot to deal with.<br><br>Michael Ritchie directed this funny comedy. Albert Brooks contributed to the screen play he co-wrote with Andrew Bregman and Monica Johnson. Mr. Brooks plays Al Percolo, the scout of the title with his usual style that makes him one of the best actors working in comedies these days. Brendan Fraser is Steve Nebraska, a complex man who loves to play baseball, but has too many unresolved issues to deal with. The amazing Dianne Wiest plays Dr. Aaron, who injects a shot of reality into the movie. <br><br>There are some funny moments in the film. One of the best involves Tony Bennett, who is performing in a night club where Steve and Al have been invited by the Yankee management. When Tony Bennett introduces young Steve Nebraska as the next Yankee star, the young man takes a bout and decides to lead the house in a rendition of \"I Left my Heart in San Francisco\". The other great moment occurs when Mr. Bennett shows up to sing the National Anthem at the start of a World Series game and he sees Steve, and he asks him is he is going to have the whole stadium sing.<br><br>There have been other great baseball pictures. This one doesn't try to be one of them. It's just a light movie done for laughs and the mistake most viewers make is to expect it to be what it never intended to be.","user":"jotix100","rank":[9,9]},{"title":"Endearing comedy","rating":8,"date":"19 August 1999","review":"This is an endearing comedy which, as a Brit who knows precious little about baseball, I enjoyed a lot.  The main reason is the performance of Brendan Fraser as the emotionally immature prodigy, Steve Nebraska.  There are elements of his later role as George Of The Jungle here, although George was never this vulnerable or unpredictable.  Dianne Wiest makes for a sympathetic psychiatrist and Albert Brooks is an affable rogue of a talent scout.","user":"williamj-2","rank":[13,14]},{"title":"Great Baseball Movie","rating":9,"date":"7 May 2004","review":"I think sometimes people take some movies too seriously, and this is an example of one of them.  This is a fantasy baseball movie, not something that would actually happen.  Does anyone think that \"The Natural\" was realistic?  Brendan Frasier is great in his role as a child trapped in an adult's body due to an abusive childhood, but who is one of the greatest baseball players ever.  Albert Brooks is also great as the scout whose bad luck suddenly changes when he discovers him in the middle of Mexico, and is so excited about his talent that he ignores the mental problems that Frasier's character has.  However, Im disappointed we never learned more of what was actually wrong with him.","user":"redsox15","rank":[9,10]}]