[{"title":"A Cult Classic","rating":9,"date":"10 November 2007","review":"I never saw \"Death Becomes Her\" when it first come out because of a review I had read somewhere. The review was dismissive and made a lot of sense, so I decided to give it a miss. What a terrible mistake! This is a movie I would love to see on a big screen. The script is so brilliantly clever. Disguised as a silly comedy there is a world of serious themes executed by a knowing cast. Meryl Streep in particular, playing convincingly an actress without talent. I remember the bad review criticized the writers for setting the story in a rainy, stormy Los Angeles when California was going through a drought. Imagine if a comedy about magic potions should worry about the accuracy of the weather. In fact the Los Angeles of \"Death Becomes Her\" feels more like Los Angelers than most realistic movies and it does it with nerve and wit. \"In 12 years in Los Angeles have you ever seen a neighbor?\" screams Meryl to his mousy Bruce. An absolute delight. Other hidden treasures are a cameo from Sidney Pollack and a very funny and very sexy \"76 years old\" Isabella Rossellini. A new cult classic and a total must.","user":"juliereed50","rank":[166,174]},{"title":"Still one of the most Original comedies ever","rating":10,"date":"9 March 2011","review":"The cast is perfect. The acting deserved golden globes all round. Every line is delivered perfectly and every expression is just right. Goldie, Meryl and yes Bruce are all perfect. Meryl's best comedy ever. Goldie is so funny - one of the first fat suit uses. In fact it is Bruce's best comedic role - he is unrecognizable. The dark comedy is so unique and right on the plastic surgery and commentary on the obsession with youthful looks is so spot on. And it is really funny too. Special effects are still astounding even by today's standards. Isabella Rosellini is also very effective in her small role. Every time I have seen this movie over all these years it's still funny and still delightful. A must see and a classic.","user":"phd_travel","rank":[48,49]},{"title":"From The Sublime To The Ridiculous","rating":9,"date":"12 March 2006","review":"There is so much greatness in this unexpected Hollywood comedy that the cheap shots are really cheap and, quite frankly, unbearable. Buried somewhere between the special effects (extraordinary by the way) is one the wittiest satires to come out of Hollywood in many, many moons. Meryl Streep is sensational and Bruce Willis is, I swear, unrecognizable in the best possible way. The movie hits the highest moments when, for instance, Meryl asks Isabella Rossellini how much the magic potion costs and Isabella replays: \"Oh the sordid topic of coin\" sublime, exquisite, funny but with enormous regard for its audience. But when Bruce calls Goldie Hawn to explain the \"incident\" at home he goes through a TV style monologue that seems to belong to a sit-com and not to the elegant vulgarity of this three sad, magnificent wannabees. The dialog, for the most part, is the best in any American serious comedy since Billy Wilder. The structure of the script is flawless and inventive. The costumes are atrocious and certain scenes seem directed by a 3rd assistant. I don't know how to explain it. However, I have it, I own it and sometimes I put it on with my finger in the fast forward. What's good is so good that makes the whole thing really worth it.","user":"bethlambert117","rank":[206,221]}]