[{"title":"Must see background for aspiring animators","rating":10,"date":"9 January 2007","review":"\"Their friendship changed the face of animation.\" What is interesting is that these two were planning on anything but becoming animators much less becoming innovators in the profession. They met at Stanford as college students and took road trips to a distant college to do nudes because Stanford would not allow \"such behavior\" in their art department (imagine that today). Somewhere during these trips a lasting friendship was built between them. The \"painted for dinner and played piano for beer\" along the way on these trips and seem to have made many friends in the places they frequented as well. Their lack of fear, presence of love and capacity to laugh at themselves opened one door after another. I was amused time and again to see them model the characters they created. It was also quite interesting to see how they climbed inside of their characters and brought them to life. It was apparent to me that they enjoyed what they were doing and in-so-doing were blessed to be eternally youthful. I am hard pressed to think of another friendship that would allow two human beings to share so much without petty jealousy getting in the way. Their wives were incredibly understanding about the childlike ways and seemed to understand what a blessing their husbands were, not only to their family, but to the world in general. There is not a country on the face of this earth that has not seen one of their characters, I would suppose. I would also gather that they have touched many millions of young hearts over the years. A young heart, by the way, need not be in a young body. That was apparent in this film as well. I will never see Disneyland the same, because behind each of the characters that I see, I will imagine the facial expressions of these two men. I will remember that one got his best ideas while shaving and developed the ideas while walking on a worn path in his front yard. They did talk about artistic frustration brought on by the fact that they were so involved and connected to what they do. It was also interesting to note that their release from tension was also artistically motivated and expressed through music and model railroading. I thoroughly enjoyed this viewing and will never forget the wisdom chiseled into the faces and depth sparkling from the eyes of these two wonderful human beings.","user":"mtsierraprofgpb","rank":[6,6]},{"title":"The Men that made Disney","rating":27,"date":"27 March 2000","review":"This was the documentary on Oliver Johnston and Franklin Thomas, the two men responsible for what Walt Disney is remembered today- Character Animation. In this film we find out how these two men became friends and how through that friendship raised character animation to the standard it is done today in the movies.<br><br>The good-The documentary goes through the duo's history. It shows some of the classical figure drawings as well as rough pencil drawings of famous Disney characters-Bambi and Pinnocchio included.<br><br>The bad-John Culhane,what a bloated, pompous asshole. I love the work that Frank ad Ollie did in the Disney movies but the way this guys interpreted it was almost to a Godlike degree. I cant stand this guy on film. Supposedly Milt Kahl, one of Disneys best animators, designed the character of Mr.snoops in The Rescuers with this windbag in mind.<br><br>Rent this film to se who is actually responsible for Uncle Walt's fame-and I don't mean Mickey Mouse. Then afterwards, read The Illusion of Life. The quintissential book on Disney Animation written by the same to men who the documentary is based on.","user":"flembot","rank":[6,7]},{"title":"Is it a must-see? No...but it is a very interesting and sweet story about friendship and animation.","rating":8,"date":"4 January 2020","review":"This documentary is about Frank Thomas and Ollie Johnston--two animators from the so-called 'group of nine'. These were the important animators who worked for Disney through its classic days and helped to make the great full-length pictures* that made the studio even more famous. In addition, they were the two surviving members of the group AND were amazingly close friends...among the closest you ever could hear about and this is very touching. The film was made by Frank's son, Theodore--and Theodore went on to make some other touching and interesting documentaries, such as \"Walt &amp; El Groupo\".<br><br>While at times the film seemed a bit vague when it came to the story AND I assume there was much more that I would like to have heard from the guys, it is a delightful film and well worth seeing. And, although Frank &amp; Ollie seemed very elderly in the film, they both went on to live another decade or more after \"Frank and Ollie\" debuted. An amazingly nice and sweet film.","user":"MartinHafer","rank":[3,3]}]