[{"title":"An outrageous English horror film with a difference","rating":7,"date":"4 October 2000","review":"Disregard the many negative reviews of this film below. It is actually an odd little hidden gem. The story is about a man who wins a card game against Christopher Lee, who then gives him his large old house. The man moves into the house with his family, and they soon discover a sinister jester who resides there, the Funnyman.<br><br>This pesky little guy kills people in different ways; some of them are outrageously gory and over the top, and a little bit like Sam Raimi's The Evil Dead. The joker also speaks in a variety of British accents, and takes on different personas, such as a club owner, a footballer, and a few other weird guises.<br><br>The film is low budget and very English, and may not appeal to overseas audiences; but it's a worthy effort considering its budget. If you want a horror film with comical gory scenes, dark humour, sprinkles of English silliness, and something different, check out the Funnyman. You might like it.","user":"Afracious","rank":[21,29]},{"title":"Ignore the bad reviews- They're missing the point!","rating":9,"date":"28 May 2006","review":"The heavy-handed criticism levelled at this film by certain reviewers is mostly irrelevant. This film has merit far-beyond being a simple Freddy Krueger rip-off and is not , i suspect, intended to be that scary. It's British humour of the highest order, and along with this comes the sad inevitability that it will alienate many international viewers. The direction and acting is, for the most part, spot-on, don't confuse this with the crude and meaningless no-talent b-movie drivel that has come to typify the genre. Sure, it's low budget, and it's certainly shallow in the plot department, but the film is all the more charming for such \"shortcomings\", with a brilliantly hilarious and understated script and production values which clearly display a labour of love on the filmmaker's part. I sincerely urge anyone who has a taste for British humour to investigate. If, like many of the critics here, you don't \"get it\", then you simply won't, but if you do, you will absolutely adore this film.","user":"kasimpeter-1","rank":[20,33]},{"title":"Brilliant and Underated","rating":6,"date":"26 January 2004","review":"I was suprised to see how low this film has rated. I guess it's been watched by a lot of people that either don't like horror at all or are too caught up in a particular genre to get this.<br><br>It's very tounge in cheek, which many simple people won't get. However it has the distinction of being one of the few horror comedies around that is both funny and eerie/disturbing. <br><br>The Thelma (from scoobie doo) character was hilarious, especially when she died, and I couldn't help but think of that when that awful Scoobie doo film came out. They should have hired the woman from funny man.<br><br>The relation between Christopher Lee's character and the fates of those in the house reminded me a lot of Hammer Horror. But then you can probably drop Chris Lee into any cheap horror and immediately raise the standard. His minor involvement worked for me. Tim James was brilliant as the killer. His Yorkshire accent along with some of his lines had me convinved it was Shawn Bean right up until the end credits. He is the kind of movie bad guy that you could see spawning endless sequels, and while he may not be on the level of a Fred Krueger he's way above the level of a Chucky.<br><br>The effects, the set and the sound track are all quite cheap, but you don't need a big budget to make a good movie and this demonstrates that.","user":"Fenris Fil","rank":[12,19]}]