[{"title":"Well-done and well-acted family thriller","rating":7,"date":"16 August 2002","review":"River Wild is not really great or thrilling, but it's very entertaining due to the good acting by the entire cast and the beautiful nature scenery. I thought the relationships between all the characters and how they gradually change was the most believable and interesting part. How Kevin Bacon's character first strikes a bonding with the son, in order to win Meryl Streep's trust, and how this friendly atmosphere slowly glides to threat was very realistic. The only really annoying scene was the last one, where one police officer asks the son \"What did your father do?\", to which he replies \"My father saved our lives\". What a heroic, pathetic conversation after having survived such a life-threatening nightmare! All in all, this movie is recommendable, but you shouldn't expect too much.","user":"Star_Red","rank":[35,38]},{"title":"Strong Performances Elevate This 90's Thriller...","rating":7,"date":"22 June 2011","review":"Curtis Hanson's box office hit 'The River Wild' is well-shot and even gripping in parts, but what really stands tall in this thriller and balances the film even when it dips, are the performances by it's talented star-cast. <br><br>The story involves a family on a whitewater rafting trip, who encounter two violent criminals in the wilderness. <br><br>'The River Wild', which has been written by Denis O'Neill, offers some gripping moments, that truly manage to hold your attention. The characters, are nicely presented and executed. But, I would like to point out, that, the writing in the latter hour tends to drag a bit. The film surely could've been shorter by at least 10-15 minutes. And I believe if it had been trimmed, it's impact would have only enhanced. Curtis Hanson's direction, like always, is efficient. Cinematography is Striking. Editing is fair. <br><br>Performance-Wise: Meryl Streep is superb, as expected. She carries the film on her shoulders and delivers with ease in each and every scene. Kevin Bacon makes a really interesting bad guy, and proves his potential as an actor. David Strathaim is first-rate. John C. Reilly is good. Joseph Mazzello supports well. <br><br>On the whole, A decent one-time watch, that offers strong performances to sail it safe.","user":"namashi_1","rank":[12,12]},{"title":"Streep Braves the Rapids...and Succeeds.","rating":8,"date":"16 January 2001","review":"No, I didn't say Gail braves the rapids...but Meryl Streep, not only literally, but metaphorically.  Streep is definitely the actress of our time, and in no small part to her ability to tackle difficult roles of many colors, and do them without breaking a sweat.  Such is true with \"The River Wild\", a predictable, but entertaining river rapids adventure/hostage drama. Streep incorporates her role with strength, humor, and even a bit of vulnerability.  Backed by the menacing Kevin Bacon and the refined David Strathairn (the ultimate everyman...that's a compliment), Streep holds her own in a genre that one doesn't necessarily think of when her name comes to mind.  One tremendous scene involves Streep reminding her captor (Bacon) of the dangers of the upcoming waterfall/rapids system known as \"The Gauntlet\"...Streep whispers determination and threats, promises of anger and doom, directly into Bacon's ears with a quite rage, only to be turned to an edge-of-tears monologue when her family comes to mind.  Bravo to Curtis Hanson's pre-\"L.A. Confidential\" film (1997's SHOULD HAVE for Director and Picture).  The plot itself may have holes, but with the talents of Streep, backed with the reliable cast, \"The River Wild\" packs quite a punch of entertainment and thrills.","user":"howiewins","rank":[29,33]}]