[{"title":"Story doesn't matter - What a journey!","rating":8,"date":"19 December 2000","review":"After reading a number of negative reviews of this film, I went ahead and bought the DVD.  I had read that, although the movie was mediocre, it was the kind of film that's great for showing off your DVD player.<br><br>I am thrilled to own this movie.<br><br>True enough, the story is cliched.  Yet I didn't think about it for a second while I watched the film unfold.  I was completely caught up in everything I saw on the screen.  If it was a slow scene, I just gazed at the beautiful eye candy.  And during the incredibly inventive action scenes, I was surprised to find myself at the edge of my seat.<br><br>There are some who say that the mix of 3d and traditional 2d animation didn't work.  I couldn't disagree more.  There are times when the two styles were a glaring contrast.  Yet, as the movie progressed, the two became as one to my eyes.  I have no problem calling this a revolutionary step forward in animation.<br><br>I loved A Bug's Life and Toy Story.  But this trip, in my eyes blew those films away.<br><br>Finally, though I wouldn't consider this film 'adult' by any means, the slighter darker tone made it much more accessible as an adult viewer.  Every year I sigh when I see a preview for another assembly line Disney film. (Hey, let's dumb down the gothic horror 'The Hunchback of Notre Dame' and give him cute sidekicks!) The look of Disney films hasn't changed in years. (If anything, they look more simple)  This film, as cliched as the story was, was visually inspired.<br><br>The original Fantasia needed no story.  It was an appreciation of music and animation.  Let this be the new Fantasia.  If you want to experience breathtaking and beautiful animation, I couldn't recommend this any more.","user":"kbumbulis","rank":[104,128]},{"title":"A revolution in the world of animation","rating":10,"date":"21 June 2001","review":"I remember a year ago when I went to see this movie. I think of that day as a turning point in my life in how I view animation.<br><br>I am surprised I have not written a review for this movie. After reading through every single bad review by every paid critic on the planet and watching this movie fail because of it (taking Fox Animation with it), I have decided it was about time I added my insight into the pile. Kind of late, but bear with me. I know more now than I did then.<br><br>First off, the storyline isn't what the critics have brainwashed you into thinking. If you are a sci-fi fan, I guess it is easier to grasp. In the wide world of science fiction, this movie seems to have struggled to find originality and found enough of it. Set 1000 years into the future, Humans have discovered an extremely advanced technology which drives a race of almost indestructible aliens to destroy Earth in it's entirety. A teenage boy is left with the power to find the key to bring humanity back before it is killed off forever. When I saw this movie, I had a breath of relief. Finally humanity isn't the all-powerful! The movie puts humanity in the act of a downtrodden, confused, holding-on race manipulated and shunned by other races. The emotion I felt from the story in this film and the characters in it is extraordinary.<br><br>The animation by far is a turning point in the world of animated features. From the start, you can tell the animation is exceptional. Extra time was taken to make the characters lifelike, as well as the environments they are in, the coordinating of colors, and even the shadows from a tree on the character's faces. It's unbelievable. And the 2D animation mixes so well with the 3D animation - it just adds to the thrill of the movie. The scenes in the movie are exceptional - from the ice rings scene with the reflections to the wake angels scene in space.<br><br>The characters are just portrayed so well, like I said. The actors doing the voice-overs put so much emotion into what the characters actually felt, and the characters portrayed it well. There is a nice variety of characters as well, all the way down to the comic relief of Gune and the angry kangaroo-like alien, Stith.<br><br>Overall, this movie just blew me away. I couldn't think for days. The animation, the story, the characters - all of it. And I have gotten others to see this movie, and they agree on it. So next time you are in the video store, not sure what to rent, think about this movie. I guarantee it is in stock and it will change the way you see animation forever.","user":"Tigrin","rank":[131,167]},{"title":"One of the best sci-fi animation ever made. Totally underrated by all!","rating":10,"date":"16 May 2005","review":"This film (To be blunt) is one of the greatest animated sci-fi films ever made. The story is a blast, as are the characters and the visuals are stunning. Unfortunately the movie was highly underrated by critics (But what do they know). Any science fiction fan with half a brain can see this is an intriguing story, and one that the cast is totally committed to. Indeed the actors put on such a excellent performance that you can believe in their plight and really feel for them. Overall this movie is easily able to hold it's own against masterpieces such as Starchaser: The legend of Orin, Fire &amp; ice and other films in the animated sci-fi/fantasy genre.","user":"chrisgiant","rank":[107,138]}]