[{"title":"\"Baseball Is Better Than Life, Because It's Fair...\"","rating":9,"date":"3 April 2001","review":"It may be true that everyone during their lifetime has fifteen minutes of fame, even if in most cases it only lasts about a minute and a half.  And if that minute and a half comes early in life, how far into adulthood can you carry it with you, and when does a healthy memory become an obsession that finally blurs the line between reality and fantasy?  `The Fan,' directed by Tony Scott and starring Robert De Niro and Wesley Snipes, is an intense and disturbing motion picture that examines that moment and the effects it can have on the lives of those either directly or indirectly involved.  Here, the focus is on one Gil Renard (De Niro), a knife salesman in San Francisco and a die-hard Giants fan who is pumped about the acquisition during the off-season of superstar centerfielder Bobby Rayburn (Snipes), whom he believes will bring a pennant to the team.  Once a player himself-- a pitcher-- Renard's life has since been on a downhill slide.  Divorced, he has a young, little league aged son, Richie (Andrew J. Ferchland), with whom he has an unsettling relationship, and at work, his sales have been so poor his job is on the line.  An angry, disturbed individual, Renard has reached a pivotal point in his life; for inspiration, he continually returns to the philosophies of the catcher from his playing days, Coop (Charles Hallahan), whom he considers one of the finest athletes he ever knew.  And as his life continues to deteriorate, his obsessions begin to add further to the imbalance of his perceptions of reality, which finally lead him past a point of no return.<br><br>\tScott's film, of course, has less to do with baseball than it does with how the game itself actually relates to life and the things that really matter. As Rayburn says at one point, `We're not curing cancer here.'  But to those to whom life has been reduced to that minute and a half to which they still cling, the game can be everything.  And it is just that unhealthy obsession that Scott examines in this film, that comparatively insignificant moment that in the obsessive mind becomes an episode of monumental importance that finally distorts any semblance of reality the individual may have left. What's truly frightening is that upon close scrutiny, in Renard there is much with which many viewers will be able to relate in one way or another: The anger, the frustration and perhaps the inability to let go of that minute and a half, even when it threatens to become more than just a pleasant memory, but an unhealthy lifeline to another place and another time that, in reality, may never have existed in the first place.  It's like a search for self-esteem by the has-been-who-never-was, who can neither realize nor accept it's elusiveness.  As Renard says to Richie, `Baseball is better than life, because it's fair.  You hit a sacrifice fly and it doesn't count against your average.'  An ideal that has forever eluded Renard; in his life, he's never been able to `give himself up for the team' and get anything in return for it.<br><br>\tAs Renard, De Niro gives an explosive performance that at first glance may seem to have a bit of Travis Bickle and Max Cady in it-- which in fact it does-- though upon closer inspection, Renard is a unique character.  Those with a disturbed mind may have traits in common, as these characters De Niro has portrayed certainly do; but De Niro has successfully given each of them an individual personality, and when viewed side by side, the differences are readily apparent.  Bickle may be a sociopath, Cady a cold blooded killer; but Renard is a man who was just never able to get a handle on his life and has allowed his obsessions to dictate the choices he has made along the way. De Niro is simply a master of his craft, with the ability to make his characters so real that a performance like this one is often overlooked; this is Oscar worthy work for which he never received the acclaim he was due.  His Renard is so like someone you would run into in your everyday life that in retrospect, it's scary.  But it's the kind of performance we've come to expect from De Niro, and as usual, he does not disappoint.<br><br>\tWesley Snipes, as well, gives a solid performance as Rayburn that is one of his best ever, which is not surprising when you consider with whom he was working.  If you study De Niro's films, you may discover a common thread running through them with regard to his co-stars.  De Niro has the ability to make those with whom he is working better; and it's something that stays with them forever after.  Consider Christopher Walken and Meryl Streep before `The Deer Hunter,' or Ed Harris before `Jacknife.'  Certainly they were exceptional talents before, but they have arguably been better since. And Snipes is no exception.  Nor is Benicio Del Toro (Recipient of the Oscar for Best Supporting Actor for `Traffic'), who gives a memorable turn here as Rayburn's rival outfielder, Juan Primo.  <br><br>\tThe supporting cast includes Patti D'Arbanville (Ellen),Ellen Barkin (Jewel), John Leguizamo (Manny), Chris Mulkey (Tim), Dan Butler (Garrity) and Brandon Hammond (Sean).  A thought provoking thriller that gives some real insight into the cause and effect of the psyche of human nature, `The Fan' is like an open wound that may hit too close to home for some.  And to dismiss this as just a `baseball' movie or another `action' flick would be a mistake, for there is much more here than meets the eye.  In the end, those who pay attention will ultimately reap the rewards it proffers.  I rate this one 9/10.","user":"jhclues","rank":[69,83]},{"title":"It's Just A Game","rating":8,"date":"29 November 2008","review":"Although The Fan has a baseball setting with the late Candlestick Park in San Francisco, it's not a baseball story. It's the dual story of a fan obsessed with baseball and his favorite player and that same player and his performance anxiety living up to the huge amount of money the Giants are paying him.<br><br>The title role is played by Robert DeNiro and a lot of his character is taken from what Michael Douglas had earlier did in Falling Down. DeNiro is the son of the founder of the company he works for, but dad having passed away long ago, the company is in different hands. DeNiro is not cutting it as a salesman of hunting knives (no pun intended) and he's having problems with his former wife Patty D'Arbanville-Quinn over visitation with his son.<br><br>At the same time multi-million dollar acquisition Wesley Snipes is having problems living up to the hype and he's looking like a big old bust. Especially next to new Giant sensation Benicio DelToro who is carrying the team with what looks like a Most Valuable Player season. Snipes is only doing well on one front, his relationship with his young son.<br><br>As his life falls apart DeNiro starts fixating on his favorite player and what he can do to help motivate him. After that this film gets truly bizarre. <br><br>But DeNiro who probably has more disturbed characters under his creative belt than any other actor around today keeps it all real. He's matched by Wesley Snipes who plays a Barry Bonds like superstar who gets a good life lesson by the end of the film.<br><br>In fact Snipes realizes it before the film ends. As he quite realistically says, it's just a game, it's not like we're out there discovering a cure for cancer. The problem is that there are too many out there, fans like DeNiro in sports and in show business who get way too caught up in it.<br><br>Look also for nice performances by Ellen Barkin who has a sports phone-in show and John Leguizamo as Snipes's agent and the wisest guy he has around him.","user":"bkoganbing","rank":[19,23]},{"title":"Underrated. DeNiro plays another great S.O.B","rating":9,"date":"23 November 2007","review":"The Fan is the polar opposite of Field of Dreams and I loved it. Baseball movies have no spine to them whatsoever, they tend to all ways follow the same Pride of the Yankees formula where Baseball is a fraternal sport in which everything is okay. The Fan digs deeper.<br><br>Robert DeNiro plays Gil Bernard an odd knife salesman who loses the visitation rights to be with his son. Bernard vents his rage by following his San Francisco Giants religiously. Gil becomes obsessed with Bobby Rayburn, the Giants' new top paid center fielder. Rayburn believes in jinxes and wants his lucky jersey number back to end a slump. Gil gets it for him by killing his teammate. Gil confronts Rayburn who says his change of luck was due to his not caring anymore. Gil goes berserk and threatens to kill Rayburn's son if he doesn't due a Babe Ruth and hit a homer for him.<br><br>DeNiro represents the Fan who turns to MLB as an escape from real life. His Gil is a tragic character who only lives for the game and focuses on what he could have been and what he wants to force his son to become. We don't necessarily agree with him but we can better see what makes this villain tick.<br><br>Snipes Rayburn isn't a bad guy but he like the A-Rod's of day let's the fame get to his head. He undergoes a perspective change through the film as he questions what the game means to him.<br><br>The Fan is a great dark satire of baseball. We see all the aspects that are there but are so often ignored. The greed of the players and their agents, the sports writers eager to sink their teeth into the slumping hitter, and the fathers who try to pressure their children to live their athletic dreams through them.<br><br>My one complaint about the film is it's ending. It just seems far too over the top and unrealistic. Gil shouldn't have received that much attention at his death, it should have been a private confrontation between him and Rayburn.","user":"DarthVoorhees","rank":[18,22]}]