[{"title":"Simply Nice Feel-Good Film","rating":9,"date":"16 February 2006","review":"This was a very pleasant surprise, a nice movie with one of the simplest \"plots\" you'll ever see yet one that was fun to watch develop.<br><br>There are no nasty characters. They aren't all goody-goodies, either, but they're all interesting people to watch. The story is simply about a pair of cartographers (map makers) who measure a \"hill\" in Wales and much to the displeasure of the locals, it isn't tall enough to be considered a mountain, which is what the townsfolk always considered it. So, the locals work together to build it up so it will qualify to be officially labeled a mountain. Sounds simple and even stupid, but it isn't. Along the way, a romance buds between Hugh Grant and Tara Fitzgerald. There also is some nice cinematography in here.<br><br>Some might find it boring but I didn't. There was just something about this, a charm that made me feel good as I watched it and had me smiling even more by the end. This is a \"sleeper,\" a movie you might pass up..... but don't.","user":"ccthemovieman-1","rank":[51,54]},{"title":"a little known gem of a comedy","rating":9,"date":"27 March 2001","review":"Most people I've asked about this movie have never heard about it and I think it's a real shame. Set against picturesque background of Welsh countryside and leisurely paced this movie totally won me over with its gentle humor and its colorful and beautifully developed characters. I'm not a big fan of Hugh Grant but here he performs quite well. Besides he is not what makes this movie work.<br><br>I just love all the supporting characters - Thomas  Twp and Tara Fitzgerald as Betty and of course the pair of local archnemesis Rev. Jones and Morgan the Goat. I've seen Colm Meany in a few movies and on TV (I think he plays in one of the Star Treck series) and I've never thought much about him as an actor but he is simply hilarious as Morgan.<br><br>So what is this movie about? There isn't much of a plot so without giving anything away I'll just say that it's about a  sleepy Welsh village coming together for a noble cause. What's the cause and would you find it noble?<br><br>Watch the movie and judge for yourself.","user":"bahrom1","rank":[41,44]},{"title":"Well, I'm going to break the tie-- I vote YES.","rating":10,"date":"10 January 1999","review":"Of the two comments so far, one is for, one against.  Can't let that stand! I loved this movie.  Not boring at all.  Loved Hugh Grant (much better than in 4W&amp;aFuneral).  Loved EVERYBODY, even the dour surveyor.  The humor is so subtle and insidious, the acting so underdone, the writing so sparkling, the plot so effervescently predictable in macro, but not in micro.  The film score is wonderful, too, using as it does actual Welsh melodies rearranged into big 'movie soundtrack' full orchestration.  And has there ever been a more beautiful cinematographic masterstroke than the torches on the mountain at sunset?  I think not!","user":"wcb","rank":[44,48]}]