[{"title":"better than some say it is","rating":10,"date":"4 April 2005","review":"Return of Superfly isn't prime \"blackploitation\" because it was made in the late 1980's but it has some entertaining \"blacksploitation\" moments. The way Priest takes out the opposition is fun stuff. The film also has the lovely Margaret Avery who is sexy as ever. Curtis Mayfield, the musical genius behind the first Superfly, also provided music for this one and it is excellent. I was amazed to see the great Samuel Jackson in this too. Nathan Purdee steps into the role originally played by the excellent Ron O'Neil, and he's as cool as ice (maybe even cooler!). I love the idea of a clean living Priest running circles around a younger band of thugs. Priest was always sharp and we learned in the previous Superfly movie, from the great Roscoe Lee Brown, that he'd be even sharper without the drugs. Return of Superfly proves it.","user":"magicinema","rank":[16,16]},{"title":"This movie is bad, thats why its so GOOD!!","rating":31,"date":"31 May 2007","review":"People shouldn't be dissing this movie, cause they are missing the point. This movie is not supposed to be a blockbuster. Its clearly a low budget film, and is a great B Movie. Samuel L Jackson is great in this movie, as well as the soundtrack by Curtis Mayfeild. Some cool editing that captures the 80's feel perfectly in 1990, like when people fly thru windows, or short segway scenes, the sound designers put in cool vocal samples or other strange effects. This movie will be greatly enjoyed by people that appreciate bad movies for their comical end result. This is a great late night movie with friends that have a sense of humor :)","user":"midibullets","rank":[14,15]},{"title":"not quite the same old same old - but entertaining","rating":15,"date":"15 December 2004","review":"All of the Superfly films have entertained me in various ways. The original Superfly starred Ron O'Neil as slick street hustler Priest who \"sticks it to the man\" and leaves New York and heads to Europe. O'Neil gave his best performance as Priest in the second movie Superfly T.N.T., but many Superfly fans disliked that sequel. Superfly T.N.T. was panned and I wasn't surprised when O'Neil didn't return for a third Superfly. Return of Superfly put Nathan Purdee in a tough situation with some fans because \"he's not Ron O'Neil\", but I doubt that O'Neil's inclusion would have improved matters since many of these same fans weren't happy with O'Neil's reprise of the role either.<br><br>In the previous Superfly film we saw a Priest still fresh off the New York streets and trying to adjust to life in Europe. Return of Superfly takes place much later when he's a successful legal business owner who has lived in Europe for many years. Purdee is far more in control than the often confused drug using Priest of the past, but that makes sense. Superfly T.N.T. had pointed Priest in a more controlled direction and Return of Superfly shows that. Purdee's cool head strikes a definite contrast to his drug crazed opponents. Most importantly, Purdee maintains the main character's standing as a strategist and that's what I've always liked about Priest. <br><br>Priest's lady in Return of Superfly is played by the very sexy Margaret Avery and that's a plus. Also the soundtrack features the return of the great Curtis Mayfield whose \"Superfly 1990\" track does a great job of revealing the mindset of the main character since the 70's. I get chills just hearing the man's lyrics for this one! Return of Superfly isn't as inferior as some say IMHO. I had a great time with it. The police car scene had me jumping off the sofa and cheering! Anyone who disrespects the lovely Ms. Avery deserves that sort of treatment in my book. Go get 'em Priest.","user":"videomaniac","rank":[12,13]}]