[{"title":"Smashing stuff - an excellent mixture of brawn and brains.","rating":9,"date":"8 May 2002","review":"The main complaint from those who dislike Patlabor; the movie is that it's too slow and dull. Not to act like the brighter-than-thou intello snob here, but this never even remotely bothered me. Maybe it's because there are enough riveting action scenes to counterbalance the slower ones, or because a lot of the non-action scenes are spent on a believeable build-up to make the finale all the more poignant, while throwing in genuinely interesting issues and fleshing out the likeable characters in a very entertaining way. Or maybe it's because I saw Patlabor 2 first, which makes this first film seem lightning quick in comparison. All the same, I really don't see what there is to complain about. Patlabor takes the time needed to establish a coherent storyline, and the viewer is amply rewarded by a big and very thrilling dose of action in the end, made all the more involving by the intricate prior build-up that we've been following. Even after several viewings, I find myself fully satisfied at the film's end, and perhaps even intellectually stimulated, without this demanding excessive efforts on my behalf. True, this is at times a talky and rather philosophical film, but nothing that the average viewer should find impossible to sit through (that is, unless I'm being too optimistic in my views on general human intelligence and the world really is overrun by bovine straight jocks who's attention cannot last two minutes without massive explosions on-screen).<br><br>Mamoru Oshii's direction style has a reputation of being very slow and broody. From what I've seen of his work, this is quite true. So far, Patlabor is the movie where this style worked best for me, as everything fitted together very nicely, delivering an excellently balanced combo of entertainment and mental fodder (other films by him show his personal touch more clearly but are less 'easily accessible').<br><br>That is far from the only praiseworthy point in Patlabor, however. Animation and artwork are pleasingly solid overall, ascending to excellent levels when the intricately crafted scenes with the mecha come into play. Kudos to the music as well, which does it's thing very nicely. The fast pieces for the action scenes are especially good for the way they're so full of energy. It also does a very good job of establishing the Patlabor universe for the non-initiated viewer. This movie is but one gear in the works of a much larger franchise; Patlabor has spawned several TV and video series over the years, but the viewer is adequately told who is who and where they are to be able to follow the movie without prior experience.<br><br>The clever bit about the Patlabor universe is it's a down-to-earth, credible view of what the world might look like if there was such a thing as giant robots. The robots are not overly fanciful, nor are they even the defining factor in everyone's life. Despite Noah's attachment to her Labor which she named Alphonse, the robots serve as little more than bigger, stronger versions of everyday vehicles and machines, with not one infantile giant laser weapon in sight (that said, their design is very cool, including enough striking elements in their otherwise workmanlike and realistic appearance to be very noteworthy). It's still the little people that make the most difference and are the real stars in the Patlabor world. Top marks for originality, there.<br><br>The same thing goes for the film's plot: after the suicide of a certain Eiichiro Hoba, an increased number of incidents involving Labors gone berserk begins to spread over Japan. Our heroes are a somewhat whacky squad of anti Labor-crime officers (the 'mobile police', who operate with their Patrol Labors, or Patlabors) who gradually unravel the entire plot behind this wave of labor malfunctions, and the true disaster that this is building up to - a disaster of such magnitude that it may well signal doomsday if the one building that will trigger it off isn't destroyed by hand and by Labor in the little time that is left. There's far more to the story than just that - there are the likeable hi-jinks of the heroes along the way, as well as the more broody look at Hoba's motivations that get exposed by a private eye, packed with deep reflections and religious symbolism (a so-called 'Babylon Project' to build a new district for Tokyo over the water plays a large part in the film, to name but one example).<br><br>It probably -is- more of a thinking man's giant robot anime in the end. But this should be noted as great praise, rather than a complaint from those too stupid to appreciate it. Everything is well-crafted, involving and enjoyable enough to make for a very impressive film that can be recommended to everyone except complete numbskulls. I'd almost go so far as to claim that anyone who doesn't realise the great qualities of this film must be out of his mind, but that would be just petty personal vengeance on my behalf. You see, with the way this film is so excellent, stylish and highly likeable overall, I'm afraid I've rather fallen in love with it. Well worth checking out, at any rate.","user":"vkn","rank":[22,22]},{"title":"incredible animated movie","rating":10,"date":"11 September 1999","review":"Japanese animation has become very popular in the past few years.  Somehow, it also gained the notoriety for \"extreme\" sex and violence, though it's a misconception that all Japanese animation is about that.  Yet, animation in general is viewed as a kids only fare.<br><br>I recommend anyone to watch Patlabor: the movie.  It has a very mature storyline.  When I mean mature, I meant well-thought out story that can leave you thinking.<br><br>In the future, giant industrial utility robots called labors are used throughout Japan.  Those in the law enforcement department use labors called Patlabors (patrol labors).  Lately, there are reports of labors running amuck on its own.  From this point we follow the heroes in a detective like story.<br><br>There are no nudity, violence is pretty tame compared to your half-hour dose of Mighty Morphin' Power Rangers (a series also a byproduct of Japan, I know but I'm not here to discuss my distaste for the Rangers) TV show.  What we have is a straight-forward mystery as the story unravels what is going on. It also explores about man and technology and how it's like the Tower of Babel in biblical literature.<br><br>The movie is based on the tv show and comic.  I only got to see a few episodes of the show. The movie, like the show, do not have the robots dominating the story, thus focusing more on the human characters.  Watching the movie, I almost feel like I'm watching a PG/PG-13 live-action movie. Akira and Ghost in the Shell also have a deep story in them, it's not as involving perhaps they were covered so much cinematic effects (and sex and violence?).  Patlabor blew me away in that it successfully simply told an honest-to-goodness story without being covered in so much effects.<br><br>The verdict: 5 of 5 stars.","user":"Yonhap S","rank":[13,14]},{"title":"Anime spectacular","rating":10,"date":"14 August 2006","review":"While I was only about 12 when I first saw this movie, I think it is fair to say that I initially enjoyed the ending scenes (aboard the Ark)due to the labour action- and because of this, I wasn't quite as keen on the second one.<br><br>It's a film that hits on many levels- younger audiences will enjoy it for the robots, while more mature viewers will become wrapped up in the cunning, socio-political plot with more twists and turns then a labour wiring diagram.<br><br>Make of it what you will, everyone will see something differet but either way, its 100 minutes well spent.","user":"plonkman","rank":[8,8]}]