[{"title":"To Care for Those Who Have Borne the Battle....","rating":8,"date":"20 June 2006","review":"There are many good things about this movie. There are a few that are not as \"stellar\" but no matter, when the subject is something as important as this, then that's what counts. (to those like user: Rick Peach that don't get it... read his reviews, and consider the source! This isn't an action movie!)<br><br>This is a movie about how shamefully the Veterans of our Armed Services are treated when it comes to medical care. The term Article 99 refers to when a serviceman/woman is told the care or operation they need will not be considered because it isn't a direct result of anything that occurred while actively serving. In a world where many countries have socialized health care for everyone- you would think here where capitalism rules the day, we could at LEAST take care of the people who have guaranteed our freedom and survival. And that is the message of this movie.<br><br>The way the message is conveyed is what we discuss movies for. The script can be at times overboard and some of Luther's (Keith David) pet phrases are trite, but he is the \"been there, done that\" man of the movie. He's seen it all and like a mascot of sorts, he seems to hang around the hospital ready to assist new patients who are lost in this bungling bureaucratic maze. Enter Travis (Troy Evans) a nice guy who just happens to need a triple bypass. When one of the men who is \"Article 99'd\" goes berserk and drives a pick up into the hospital, we see the main characters start to assert their personalities and their places in the hospital. Travis has a heart attack on the spot and it all unfolds from there.<br><br>Dr. Sturgess (Ray Liotta) is the voice of reason in this very illogical world. He is the head of a group of doctors (Forest Whitaker, Lea Thompson, John McGinley) who are there not for the money, but for \"those who have borne the battle.\" They are joined by a well meaning Dr. Walton (Kathy Baker) a psychiatrist who chose to come to this place from a drug rehab clinic. Although inexperienced in the ways of this \"jungle\" she has her heart in the right place. The evil nemesis in all this is played by the administrator, Dr. Henry Dreyfoos (John Mahoney) who is more interested in counting q-tips than helping to ease the suffering and pain of the people for whom this place was built. His doctors have had to resort to stealing medical equipment and supplies from the departments experimenting on animals. Apparently a monkey can get a pacemaker, but not a Vet.<br><br>Some of the conditions in this hospital are deplorably shocking and terrible. There are the sick and dying and the forgotten. Also, there is the poignant relationship between the new intern, Dr. Morgan (Kiefer Sutherland) and his patient, Sam Abrams (Eli Wallach) as Dr. Morgan slowly realizes how special EACH of these people are. There is a story, a life and a sacrifice behind each bed pan, each IV, each tired old Vet.<br><br>Some of this movie is melodramatic and it may go to some extremes to make its point, but it is worth the watch. The performances by ALL are very good and it's a cast that's to die for. Even the smaller roles (Jeffery Tambor, Lynne Thigpen, Julie Bovasso) are so well cast. If for no other reason, watch it today and remember those who have given the \"full measure of devotion\" for us all.","user":"rondine","rank":[20,21]},{"title":"When truth is stranger than fiction . . .","rating":8,"date":"22 June 2001","review":"the greatest casualty may be due to Red Tape.  Not only does this film benefit from some true TALENT in the acting department, but Howard Deutch does a great job of portraying the sad state of Veteran's Care in the US. No, this does not appear to be \"based on a true story,\" but it is typical of what goes on in the VA Hospitals; as a former Army Medic (now a Service Connected Disabled Vet) I know whereof I speak.  I highly recommend this film!","user":"VernonPope","rank":[21,25]},{"title":"Veterans","rating":8,"date":"16 January 2006","review":"Howard Deutsch's \"Article 99\" is a gripping satire about the Veteran Administration that is in charge of the health care for the men and women that served the country in foreign conflicts and who obviously, have no other means of getting health care. The film is more poignant to watch right now with the problems the country is facing in Iraq because today's soldiers fighting there might have to face the bureaucracy that rules what can, or cannot, be done to veterans without insurance, or money to pay for medical care.<br><br>We meet a group of dedicated doctors at a facility who are real professionals trying to go around the rules a tyrannical hospital administrator wants to impose on them. Thus, they will resort to stealing supplies that are denied to them in whatever form. It's an outrage to even think that medical care is denied to the people that were at the front lines to defend the country.<br><br>Ray Liotta is the best thing in the movie. His Dr. Sturgess is a maverick that can do things that others would not dare to do. Mr. Liotta gets a magnificent chance to shine as the idealistic doctor who will do anything to help his patients. Kiefer Sutherland appears as the young doctor assign to the hospital and has no clue what he has gotten into, but learns fast. Kathy Burke is also good as the doctor who opposes Sturgess' method, only to realize he was right all along. Among the staff we see familiar faces, Forest Whitaker, John McGinley, John Mahoney, Eli Wallach, Keith David, Julie Bovasso, Jeffrey Tambor and others that do ensemble acting in wonderful fashion under Mr. Deutsch's command.<br><br>The film is an eye opener as to how red tape rules a lot of government agencies.","user":"jotix100","rank":[18,22]}]