[{"title":"great acting from the lead, uninspired plot exposition","rating":6,"date":"20 April 2004","review":"If you like serial killer films that like to tax your brain, you should probably give this movie a look (exactly the reasoning I was following when I picked this up at a video store). Chances are, you'll be entertained by what you see. Just don't expect this one to be a nailbiter like Silence of the Lambs or Se7en. This one comes across as more than a little forced, at times, something that can't be levelled against those two superior films.<br><br>The plot setup is as follows. A forensic psychologist (whom we get to see in action in an unrelated case, as an introduction), Dr. Alex Cross (played by Morgan Freeman), is placed in a personal position when his niece disappears, among 8 other women -- two of which are soon found dead in a forest, clearly brutally raped earlier. Cross, a clever guy, soon determines that the other six are probably alive out there somewhere, including his niece. Meanwhile, a young doctor named Kate (Ashley Judd) is herself captured by the rapist/murder/etc. (we see the events unfolding from her perspective). She, however, manages to escape. Dr. Cross and she then try to solve the case, so that Cross's niece may be rescued.<br><br>From here on, we get standard cop thriller fare -- and I'm not saying that as a bad thing, as such stories, when well crafted, are inherently interesting -- with a clear bond (not a romantic one) forming between Cross and Kate. Of course, plot twists abound (you get plenty of surprises about who the killer might be), until the inevitable (and a bit predictable) violent conclusion. Of course, the serial killer seems to be pretty kinky (an important element for a film like this); his depravity is, unfortunately (or fortunately?) never fully fleshed out.<br><br>Through it all, Morgan Freeman does an admirable job. You feel the weight of his intellect and emotion, as he goes about this personal case, even when the script doesn't project this weight itself. It's fascinating to see a professional transcend this material so easily. Freeman makes this film, 100% -- he's not only realistic but also heavily charismatic (without seeming forced, as Al Pacino on late-career-autopilot seems to be). Ashley Judd does a good job, as does the supporting cast (well... the serial killer isn't that great...), though a certain scene where she emotionally tells her story to Cross is way forced.<br><br>There are times, however, when great acting just can't make up for a mechanical script. It's not that the plot is bad itself, it's that it's exposed somewhat mundanely. It seems as though whenever a plot point is determined by the characters, they dwell on it for a bit, until it becomes uninteresting, and then the next plot point is delivered to us. The method of delivery never seems to flow out of the film's preceding movement, and often defies common sense (why would a psychologist be able to pick up a medical reference and easily pick out the drug used on a victim, when the actual medical doctors could not? it's possible but seems a bit too convenient).<br><br>The film's handling of the script is good. It looks good, and sounds good (in 5.1 surround). I still couldn't help but notice that all the tricks one normally sees that are supposed to increase tension and drama are used in this film, too, even when the script just doesn't provide the same tension and drama. (For instance, when Freeman makes a solemn pronouncement about some trait of the killer he randomly decided on, because he's so good.) When this happens, it feels like the movie is going through the motions (no matter how hard it tries, it's just not as hard-hitting or dark as, say, Se7en). Often enough, though, the cinematographer's and director's work fits the screenplay perfectly, especially during the action at the end. The experienced movie goer, however, will probably detect a moment of randomness (watch the camera work during the bar scene with the three detectives, after Jeremy Piven asks Ashley Judd to stay still) -- I'm probably nitpicking here.<br><br>Well, there you go. It's a good movie, but quite cliched, and too often it just doesn't feel right. But if you use it to admire Morgan Freeman's work, you will be entertained. 6/10","user":"red_core","rank":[57,67]},{"title":"Morgan Freeman and Ashley Judd","rating":7,"date":"11 August 2005","review":"This suspense thriller is every bit as good as James Patterson's fine novel and has great chemistry between Morgan Freeman and Ashley Judd. The sole plot is Freeman's search for two serial kidnappers and killers who snatch beautiful and accomplished young women, including Freeman's niece. The two killers try to outdo each other as they seize and destroy their trophy captives. As with most mysteries, this one has the usual red herrings, false leads and dead ends. Freeman is excellent as Alex Cross and heroine Judd is a study in grit and survival and is very effective in a finely nuanced role. The supporting cast is also great in a movie that has a leisurely pace and several great action scenes as it peaks towards its conclusion. The North Carolina location lensing, music score and cinematography are all very good.","user":"NewEnglandPat","rank":[56,69]},{"title":"Dark, suspenseful, fantastic","rating":9,"date":"4 February 2000","review":"I didn't really know much about this movie when I saw that it was coming on HBO. I just decided \"what the hell\" and watched it. Besides, Morgan Freeman is one of my favorite actors. After a few minutes of KISS THE GIRLS, I was instantly glued to the television. It was pretty dark and very suspenseful, but I truly liked it.<br><br>Dr. Alex Cross (Morgan Freeman), a psychologist/detective from Washington DC is sent to investigate a man known as \"Casanova\", who is kidnapping, imprisoning and occasionally torturing and killing beautiful women. His niece is among one of the kidnapped. Along with the help of Kate Mctiernan, (Ashley Judd) who escaped from the maniac, and Detective Nick Ruskin (Cary Elwes), Cross sets out to find and stop the murderer.<br><br>The plot is fascinating and will most likely keep you on the edge of your seat and holding onto the arm of your chair. The acting jobs are very good too. Some parts are very dark and a little disturbing, but it often only helps the story line. Morgan Freeman, as usual, does a great job as the main character. Ashley Judd and Cary Elwes also did impressive performances.<br><br>The ending of this movie is pretty good and rather surprising. Go out and rent this whenever you're in the mood for a little suspense, you won't be disappointed.","user":"Xophianic","rank":[16,18]}]