[{"title":"It's Tom Selleck at his leading-man finest","rating":8,"date":"19 November 2007","review":"Matthew Quigley, a stoic rifleman arrives in Australia in the 1860s a world far away from his home Wyoming He is answering an ad from a British landowner who will use his talents as an expert marksman <br><br>But things don't go according to plan and, at supper, and after we hear these words, \"Nobody knocks me out of my own house,\" Elliott Marston becomes his arch enemy <br><br>Quigley's arrival sets the tone of the motion picture perfectly, coming into a fight with an evil plantation owner before he has even set foot on Australian soil where some genuinely funny moments happened especially when he met Crazy Cora right off the ship <br><br>After a showy display of his talents (continuously hitting a bucket at about a thousand yards) Quigley discovers to his horror that he has been hired for sniping Aborigines encouraged by the local authorities <br><br>Tom Selleck is excellent in the role of a cowboy, exuding natural charm, cool spirit and dignity He perfectly suited to the role of the finest sharp shooter hero with a moral There is a moment when he teaches local Aborigines a secret, and it hits the correct note...<br><br>Alan Rickman is perfect as Marston, the arrogant, clever bad baron who thinks himself the fastest six-gun <br><br>Laura San Giacomo believes Quigley to be a man she once loved and whose name is Roy She has her own tragic past as obviously her romance between Quigley and herself San Giacomo proves to be a lovable heroine <br><br>Director Simon Wincer creates outstanding scenery with the desolate Australian landscapes...","user":"Nazi_Fighter_David","rank":[58,63]},{"title":"If you like the classic western you will like Quigley","rating":8,"date":"28 June 2008","review":"It will surprise many Americans but Australia had a \"wild west\" like America. One can read up on Ned Kelly, for example. And they had a gold rush at Ballarat, in the state of Victoria (near Melbourne, I believe).<br><br>Their Outback, which starts just a few miles in from the coast, is the most desolate and hostile terrain one can encounter. And I have been to some deserts around the world. Kudos to the Aborigines for actually knowing how to survive in such a place.<br><br>So, add this with a hero (Selleck) who comes from Wyoming answering a somewhat vague ad from our urbane villain (Alan Rickman) who is a station (ranch) owner in the outback. Rickman wants a sharpshooter for a job unspecified. When Selleck learns the true purpose for his hiring he decides to right some wrongs.<br><br>It's a classic western of the solitary hero who stands up to evil and defeats it. The Sharps rifle is one of the stars, too.<br><br>And to some of our reviewers who think this shooting is a bit unbelievable, there are a handful of people who can shoot some long distances with just iron sights.<br><br>I have seen them.<br><br>If you like westerns you will like Quigley.","user":"wlb","rank":[12,12]},{"title":"You sure look pretty in the morning sun.","rating":8,"date":"31 October 2001","review":"Underseen western which , after a few theatrical misfires (though I also enjoyed him in High Road to China), gave Tom Selleck a role which suited him perfectly.  A role which, as a previous comment stated, John Wayne would have been right at home in.  It can be argued that this is just a politically correct revisionist western wherein the American witnesses injustices on aborginals in a foreign land and is outraged to action despite the utter mistreatment of native Indians during this same period back home. Some may say it is so, but I prefer to think of Quigley as a man who came to Australia BECAUSE of the injustices he's known back home and is looking perhaps for something better.  Selleck represents, as did John Wayne, the decent and noble side of America, and there is no doubt that this is a man given to stand up and do the right thing no matter where he is, Wyoming or Fremantle.<br><br>This aside, Quigley succeeds most as a light romance amidst the traditional shoot em up scenario.  In fact, the love story is what drives it along most and provides it's most special moments.  During a heartfelt speech beside the campfire, Cora relates how heartbreaking it was for her to have her Husband Roy, who blamed her for the death of their child, put her on a ship to Australia and walk away from her life not looking back.  This is what matters to her most, as it matters to Quigley that she call him by his right name or he won't share his bed.  When presented with their first parting, Quigley leaves Cora and the Aborigine baby in the cave and though assuring her he will return for her he rides away, without stopping to look back.<br><br>This is mere oversight on his part and it leads to the most moving scene in the film, one which never fails to bring a tear to my eye - when they are again about to be parted she asks him \"I'll never see you again, Will I\". He can't say because of what's ahead for him, but he puts his hand on her cheek and says \"You sure look pretty in the morning sun\".  As he mounts his horse and rides off Cora watches after him  wondering, as we are wondering, if he'll stop and look back.  And then he does.  It's one of the most thoughtful and emotionally fleeting moments in movie history.  Too bad it hasn't been seen and appreciated by more people.  <br><br>The musical score, by Basil Poledouris, is also a treat and it hits all the right notes.  His score for Conan the Barbarian is an acknowledged classic but here I think he goes a step better.  It truly is a nice piece of music to hear amid the action and quieter moments.<br><br>Quigley is a very good modern day western.  It won't fail to entertain and it must surely be a film which both men and women can enjoy together. If they made more of these kinds of movies I definitely wouldn't complain.","user":"cutter-12","rank":[85,103]}]