[{"title":"Cute movie for your kids","rating":6,"date":"26 August 2001","review":"This movie is cute for one of those nights with the kids. It is a clean movie that the whole family can enjoy. Of course it is not the kind of movie you would see win any awards or get any real recognition but it is enjoyable and a nice movie for families to watch.","user":"musiqmmker","rank":[17,19]},{"title":"Well, yeah, it was silly, but it was meant to be that way","rating":4,"date":"8 November 2006","review":"The Honey, I Shrunk the Kids franchise was a huge deal and not to mention very famous. I loved Honey, I shrunk the Kids when I was little. It was an original story and had such an exciting plot! The sets were so amazing and the cast seemed like they enjoyed each other's company. Now Honey, I blew up the kid was pretty stupid, so I think they wanted to go back to the story that everyone loved.<br><br>Basically, Adam is a little more grown up now and the mom's are going on vacation to leave their husbands with their children. But when Wayne's favorite item is threatened for the garbage, he wants to shrink it and keep it, but he and his brother get in the way. But when the wives come back after forgetting to give some meds to their son, they get caught in the machine as well, leaving the kids in the house alone!<br><br>The plot is silly, but like I said, it was just a family film that I think some might get a kick out of. The original Honey, I Shrunk the Kids is the best, I think everyone could agree. The third one wasn't so bad, I would recommend this one at least over Honey, I Blew Up the Kid movie, it was at least a little more fun.<br><br>4/10","user":"Smells_Like_Cheese","rank":[10,11]},{"title":"Enjoyable family fun!","rating":6,"date":"30 July 2018","review":"Enjoyable family film from Disney. I like movies of many different genres, from supernatural thrillers to the classics. This pleasant film reminded me of one of the Disney films from the 1960s with a simple premise. Good use of computer graphics to create a \"giant\" cockroach and a Daddy longlegs. Recommended for age 6 and up.","user":"Entertainment-Buff","rank":[4,4]}]