[{"title":"Warning: Dramamine Recommended","rating":8,"date":"4 July 2005","review":"Yes I know. I've heard all the complaints already. \"That's not how it happened\" (as if anybody really knows); \"All of those events could not have co-occurred on the same boat in the same trip\" (as if anybody really knows); etc. etc. Well, here's my answer - it's a movie, just a movie. Don't see a movie to learn about \"what really happened\" unless the film states very clearly that it is a documentary. Films are, like good books, supposed to tell you something true about people, about things that happen, and about life. They're not (even when they're placed in the documentary shoebox) necessarily about what really happened and how.<br><br>The Perfect Storm is a heavily fictionalized speculation concerning the experience of the Andrea Gayle and its crew during the 'storm of the century' in the early nineties. George Clooney and Mark Wahlberg head a fine, under-appreciated cast, as regular yankee fishermen, their friends, and family, living in the Massachussetts town of Gloucester (pronounced \"Glosta\" for those of you from away). Billy Tyne (Clooney) is a once legendary long-line (swordfish) captain who is down on his luck and needs a big catch to bring himself back into the fold. He and his crew set out to find that catch on exactly the wrong day, in exactly the wrong place. The second half of the film is their attempt to get home, and also incorporates Coast Guard rescue action scattered all around the Atlantic during the massive storm.<br><br>Having lived in Maine for years, and having gotten myself thoroughly immersed in the ballads of Ruth Moore and the amazing New England Maritime culture, I have to admit that I was predisposed to like this film, despite all of the issues my fellow reviewers have harped on. And no, I haven't read the book, nor do I intend to. Still, in an attempt to be somewhat objective, I gave it an 8 and I'll give it an above average recommendation, but I will also say that my inclination was to give it an 9 or a 10.<br><br>This film mixes New England fishery and sailor lore, a few scattered facts about the Andrea Gayle Story, and a lot of dramatic license, to tell a story about the heroism of the average American and their families. It is also an homage to the the New England fishing industry and its traditions. Though it is easy to mistake the real life heroes (the Coast Guard operatives who saved so many lives during that storm) for the heroes of the film, the crew of the Andrea Gayle and their loved ones are the real heroes here - in their valiant efforts to save themselves, their boat, and their catch.<br><br>The performances and the script are strong and the characters very well realized (though fictionalized). Wahlberg and Clooney are great. Clooney gives the best performance I have seen him give. Some of the smaller parts deserve special mention - Mary Elizabeth Mastrantonio, Michael Ironside, Diane Lane and John C. Reilly are always very good (or better), but I was unexpectedly charmed by John Hawkes, William Fichtner and Janet Wright.<br><br>It is impossible to discuss this film without talking about the amazing special effects. To summarize, the first time I saw The Perfect Storm, I actually had difficulty sleeping because I felt the bed rocking to the rhythm of imaginary waves each time my eyes closed. Had I seen it in a theater, I am convinced that I would have considered popping a dramamine. Although at times exaggerated, this is the best film re-creation of sea storms I have ever seen. Every scene is thoroughly believable and marvelously detailed, even down to the weird patchiness of an incoming torrent often called \"the calm before the storm\".<br><br>Obviously, I liked this film. And I will give it a strong recommendation with a couple of caveats. First - if you're not somebody who appreciates New England culture and understands something of the kind of humble heroism \"Glosta Men\" (and women) are expected to have, you might not get it completely. Second - if you come to this looking for a story that rings true in the sense of objective history, you have come to the wrong place. Otherwise, sit back with some popcorn and somebody you love, and enjoy the ride.","user":"mstomaso","rank":[173,212]},{"title":"A terrifying adventure with thrilling images","rating":8,"date":"23 September 2005","review":"Based on Sebastian Junger's best-seller, Petersen's motion picture relates the well known true story of six brave fishermen who really fought for survival with all their heart, skill and tenacity The hurricane hits full force just as their ice machine breaks down, leaving the six men onboard with two choices: Let all of the fish they have caught spoil and hang out for a few days till it calms down, or try to salvage their income and pride by navigating 'right for the middle of a monster.' <br><br>It's a film of high drama, tragedy, hubris, and one of Mother Nature's nastiest hurricane on record There is the bad weather, the constant danger of mechanical failure, the perils of controlling a crew of strong and colorful men, not to mention the threat of the fishing itself in raging waters <br><br>George Clooney is excellent as the disappointed skipper who couldn't know the true price of fish, and whose dignity is wounded because he can't find fish on familiar waters...<br><br>The women left on the shore include a friendly rival captain with better luck; a worried woman afraid to lose her man to the cruel sea; a caring mother begging her precious boy to be careful; and a sweet single mom who shows up dockside the next morning to say goodbye <br><br>\"The Perfect Storm\" may be considered one of the great sea movies It is a terrifying adventure with thrilling images: The shark attack on the deck of the Gail; Captain Tyne's exploits while trying to repair a broken mast; the remarkable bravery of a chopper crew riding the scary waves to save three lives trapped on a small luxury yacht; and the mid-air refueling attempt for a rescue helicopter thwarted by strong winds The 'Andrea Gail' was pushed straight into raging waters where the real fish are","user":"Nazi_Fighter_David","rank":[42,55]},{"title":"Not a novel","rating":31,"date":"31 December 2000","review":"Having survived (barely, on land) the \"No Name Storm\" of 1991 on the coast of New England, I assure you this was a true story (I'm mentioning this for the New Zealand poster who said it was adapted from a novel and others who may not realize it really was a *true* story). Obviously, we can't know what was actually said or done once the Andrea Gail lost radio contact (and isn't that true of any movie based on \"historical fact\" - we can only surmise the actual dialog and conversations that may have taken place).  However, the characters were based on the actual crew members and the Coast Guard did have to ditch one helicopter during the storm - from a story I read in People magazine, I'd say the portrayal of the Coast Guard's actions were accurate.  I can't say I liked this movie - perhaps remembering the terror of that night (I lived in a seaside town and the ocean had come over the seawall and was filling up streets 3 and 4 blocks in from the beach) makes it difficult for me to watch this movie as entertainment.  In answer to one post here, Clooney said that the Boston accent is one of the most difficult and he didn't even want to attempt it - Markie Mark is from Boston so it wasn't a stretch for him.  The special effects are phenomenal of course...I just wish it had a different ending.  By the way, the statue of the fisherman at the ship wheel shown at the beginning of the movie is an actual Gloucester landmark (and you can see it on Gorton frozen seafood products which come from Gloucester) - the legend on the base of the monument says, \"Those that go down to the sea in ships...\"","user":"m.p.","rank":[61,89]}]