[{"title":"Almost great modern film noir","rating":8,"date":"16 August 2003","review":"An incredibly amoral and very sexy woman (Linda Fiorentino) is on the lam from her husband (Bill Pullman) after stealing thousands of dollars from him. She travels to a small town and gets involved with a sweet, innocent man (Peter Berg)...but he's just her next victim.<br><br>There's a lot more to it but I won't give it away. The plot is intricate with many twists and turns. The dialogue sounds like it came from a 1940s noir (updated with swearing) but this isn't anything like those movies. This movie has graphic sex scenes and incredibly cruel acts that they could never get away with back then. It also has good acting by Berg and Pullman (who is very obviously enjoying himself). There's also good direction by John Dahl and an excellent score by Joseph Vitarelli which totally fits the tone of the film. But it's Fiorentino's show all the way--she's on screen almost all the time and her performance is superb. She's sexy and evil and actually enjoys using people--notice how she laughs after a few evil acts. Too bad this film premiered on cable--if it were a theatrical film first she would have been up for Best Actress.<br><br>Only two quibbles--at 110 minutes the nonstop evil and cruelty wears you down and I didn't buy a few things that happened at the climax. They seemed really unlikely and spoiled things a little. But those are minor complaints.<br><br>This is a good, evil film noir--well worth catching.","user":"preppy-3","rank":[37,49]},{"title":"Femme Fatale Fiorentino","rating":7,"date":"14 March 2007","review":"Fiorentino has a field day as one of the most despicable women ever to be featured in a film. Her character is tough, self-centered, mean-spirited, and sexy femme fatale who absconds with her husband's drug money and tries to get her ninny of a boyfriend to kill him. The plot is quite contrived and the characters bear no resemblance to real people, with Fiorentino appearing to be a genius in a world of dim-witted men. The acting is pretty good. Berg is likable as Fiorentino's boyfriend, a decent fellow who has to balance his hormones with his morality. Pullman seems to be having fun playing the betrayed spouse. The score sets the right mood.","user":"kenjha","rank":[22,28]},{"title":"Sex and greed equals no romance","rating":8,"date":"28 February 2004","review":"I loved this one because I couldn't get over the heights of carnality and the depths of sociopathic evil the characters were capable of achieving. Linda Fiorentino played perhaps the most despicably rotten, heartless, conniving, using bitch I've ever had the pleasure of watching. Pullman was great as the reaper of retribution intent on giving evil for evil. Peter Berg may have stolen the show with his total inability to say no to his own destruction. It was hard to believe the abyss of stupidity these 2 dopes had the capacity to plumb. Guess that's what happens when the little head takes over the thought processes for the big head, eh? The picture started out a little slow but developed into a real blowout with a jaw dropping finale. All the folks got exactly what they deserved. All of them.","user":"helpless_dancer","rank":[43,59]}]