[{"title":"Mildly Entertaining Sexploitation Picture","rating":2,"date":"2 June 2017","review":"The Cut-Throats (1969) <br><br>** (out of 4)<br><br>Mildly entertaining mix of sexploitation and WWII melodrama as an American Captain leads five soldiers into Germany where the plans are to break into a compound and steal some important documents. Before long one of the soldiers falls in love with a German woman.<br><br>This film is obviously inspired by THE DIRTY DOZEN as we get some rejects going behind enemy lines but you certainly shouldn't be expecting any sort of great movie. No, this film here is pretty much an ultra low-budget sexploitation picture that offers up some rather silly action scenes but the main goal is to show off the various beautiful women who have no problem taking their clothes off.<br><br>The film has a line at the start where we're told we're in Germany but it's obviously not. The California setting is rather obvious and there's not a single second where you're going to feel as if you're in Germany or that it's WWII. The film certainly shouldn't be taken serious as it's clear this was just meant to be the second or third film at a drive-in.<br><br>For the most part the film remains entertaining throughout and it certainly helps that it lasts just 74-minutes. The running time goes by rather quickly as director John Hayes at least keeps everything moving. The performances are pretty much what you'd expect from a film like this but do you want acting or nudity? If it's nudity then there's plenty here with a lot of beautiful women including Uschi Digard.","user":"Michael_Elliott","rank":[3,3]},{"title":"Fans of 60's sexploitation may find it worthwhile.","rating":4,"date":"14 October 2014","review":"Set towards the end of World War II, The Cut-Throats is the tale of Captain Kohler, who, despite his name, is actually an American Captain. He is in command of a rag-tag team of misfits, wouldn't ya know. Apparently these dudes are known as \"The Cut-Throats\" because of their ruthless determination to finish their missions at all costs. Ostensibly, their objective this time is to capture some valuable documents and plans from the Nazis. But the Captain really wants to steal some jewels originally stolen by said Nazis. However, all the men seem to get highly distracted by all the beautiful German women. This causes further complications, but who will come out unscathed from all the sex and violence? And does it even really matter? Depending on your definition of \"action\", this would certainly qualify, but more in the \"eee-rrr, eee-rrr\" (squeaking bedsprings) sense of the word. The WWII setting, despite a couple of shootouts and a lackluster, if prerequisite, throat-cut, is really more of a backdrop for a softcore porn romp. It really could have been set in any historical time period as a pretext for nudity and sex scenes, but perhaps director John Hayes, who is pretty well-known in the exploitation world, especially after being thoroughly profiled in Stephen Thrower's excellent book Nightmare USA, wanted the most sordid and icky setting he could think of, because he was targeting the \"raincoat\" (i.e., perverted) crowd. But still, this is on the relatively tame end of the \"Nazisploitation\" subgenre. In the American sweepstakes, Love Camp 7 (1969), released the same year (what a proud year it was), has it beat.<br><br>We considered not reviewing this one, but we figured, if there was a movie released to video stores with the title \"The Cut-Throats\", we should at least tell people what it is. And that's what it is. The exploitation team of Hayes-Henning Schellerup-David Chase churned out a low-budget sex drama that will be familiar in style to anyone who watches Something Weird-released titles. It even features two performers legendary in that regard: Uschi Digard (perfectly cast as a Nazi secretary) and Sandy Carey. Perhaps the only people that should bother to track this movie down would be fans of those two actresses. Otherwise, there's not a ton to recommend going out of your way for, really. The production values are so low, it makes Hogan's Heroes look like Schindler's List (1994).<br><br>So even though the main guy's name is Kohler, it sounds like everyone's calling him \"cola\", and the end bit has the classic scene where the bad guy says the good guy's name a million times as they search for a final face-off. Director Hayes was no stranger to the WWII drama, having made Shell Shock (1964) a few years earlier. I've actually seen that, because it was released on the great Paragon label, and I endeavor to see anything they've released. From what I remember, that was not nearly as salacious as this. But The Cut-Throats does have an original song, \"The Ballad of Jimmy Johnson\", which, despite what you might think, isn't about those late-night Extenze commercials. Or maybe that is what you think. It might make sense after all.<br><br>Released, appropriately, on All-American Video, The Cut-Throats more than likely won't mean much to die-hard action fans, but fans of 60's sexploitation may find it worthwhile, even though it is somewhat disposable.","user":"tarbosh22000","rank":[5,7]},{"title":"An interesting, but unheard of film.","rating":3,"date":"3 April 2004","review":"This film is a little odd, mixing cowboy motifs with wwII era plot, but is an interesting film with all its plot twists, and of course, lovely ladies bearing it all for the camera. Uschi Digard's small but truly awesome role as the general's daughter makes this film well worth renting or buying on ebay just for her top-heavy erotica scene. Other than that, the action sequences and story are actually well done, however it's obvious this was shot in the states from seeing the monstrous steel towers suspending electrical cables over the valley bellow. Still, an interesting film to check out.","user":"ozzfan2","rank":[6,9]}]