[{"title":"Yet Another Mis-Interpreted Wonderful Film...","rating":10,"date":"28 June 1999","review":"Once again, a film of such glory fell on deaf ears - no pun intended - in  this country. I have spent hours reading reviews on this film, stating how awful it was, because it was not true to the real Beethoven's life.... Well, I believe that early on in my life, I learned about some- thing called \"Poetic License\"....and, in fact, this film IS, basically, a poem. The movie is BASED on a letter that Beethoven actually DID write, to his mystery lover.  No one knows, for sure, who the woman really was.  And, this is simply a beautiful interpretation of someone's dream of who she COULD'VE been.<br><br>This was regarded as an AWFUL thing to do, by many Beethoven authorities - and by people who simply DOUBTED.<br><br>Yet, what went overlooked because of these critics' lack of open-mindedness - was an exquisite blend of glorious music, and SUPREME acting.<br><br>Once again, Mr. Oldman gave a performance like no other actor in the world can quite match.  His style, sensitivity, and<br><br>genius as the Tragic Beethoven, was magnificent.<br><br>Jeroen Krabbe's portrayal of Anton Schindler, Beethoven's friend and champion - was marvelous.<br><br>Johanna ter Steege - who portrayed Johanna, Beethoven's sister- in-law - was exquisite.  Why did they ignore HER?  It would've been nice to have her stay here, rather than return to her Dutch homeland - to become a major motion picture star, as well. She had one special attribute  - she could ACT.<br><br>The sets, costuming, sound, and editing were all BEAUTIFUL. But the film was ignored.<br><br>Above all, however, Gary Oldman's performance ranked among the best in the world - but it, too, was ignored.<br><br>Give the film another chance.  It deserves FAR more than it GOT. It was, simply, beautiful...","user":"studiojudio","rank":[98,110]},{"title":"Oldman Brings Beethoven To Life","rating":10,"date":"19 March 2001","review":"Ludwig van Beethoven was one of the greatest composers-- some would say THE greatest-- in the history of the world.  But what of the man himself?  His passions, his loves?  The humanness behind the genius?  `Immortal Beloved,' written and directed by Bernard Rose, examines the man behind the music in a dramatization focusing on the mystery behind a letter-- written by Beethoven-- found among his effects after his death in 1827.  The letter bears no name or address, but was written to a woman to whom he refers as his `immortal beloved,' with nary a clue as to her identity.  But in his final will, it is she to whom he bequeaths his estate, and it therefore falls to Beethoven's secretary, Anton Schindler (Jeroen Krabbe), to unravel the mystery and discover her identity.  And as Schindler pursues his quest, a portrait of Beethoven, in his most human aspect, emerges. \tReminiscent of the approach taken by Orson Welles with `Citizen Kane,' Rose presents a riveting study of the enigmatic genius that was Beethoven.  He suggests a man driven by passion and ego, who was under appreciated during his lifetime (as great artists often are), and who grew bitter in the wake of the slings and arrows fate so surreptitiously hurled at him.  The great irony of his life, of course, was the deafness that deprived him of the aural beauty of his own creation, an affliction Rose implies was brought about through the brutality of a drunken father who would beat his son about the head and ears (And in retrospect, what a testimony to his genius, that he could write such music in his head without ever hearing an actual note). \tAs Beethoven, Gary Oldman gives an outstanding performance, one for which he should have received acclaim that somehow was never forthcoming.  His ability to create a total character, with such incredible emotional depth as he does here, is astounding.  It's puzzling as to why so many of his performances are overlooked, especially at Oscar time.  Besides this film, consider his work in `Sid and Nancy,' or more recently in `The Contender.' He is simply a tremendous actor who has yet to have his day in the sun.  As Beethoven, he so completely immerses himself in the character that his soul is veritably reflected in his eyes.  You feel the silent world in which he was confined for most of his life, and it allows you to identify with the inner turmoil with which he had to cope and endure without respite.  Most importantly, Oldman makes you feel that unabashed passion that motivated and drove Beethoven on.  It's quite simply a remarkable performance.  Turning in notable performances as well are Isabella Rossellini, as Anna Marie Erdody, one of the women in Beethoven's life who may or may not have been the one to whom the letter was intended, and Johanna ter Steege, as Johanna, Beethoven's sister-in-law and the mother of his beloved nephew, Karl (Marco Hofschneider). \tThe supporting cast includes Miriam Margolyes (Nanette), Barry Humphries (Clemens), Valeria Golino (Giulietta), Gerard Horan (Nikolaus), Christopher Fulford (Casper), Alexandra Pigg (Therese) and Luigi Diberti (Franz). Beethoven's renown today, of course, exceeds even mythological proportions, which often facilitates the blending of fiction with fact.  But with `Immortal Beloved,' whether or not the finer points are historically accurate or not is of little consequence, for at it's heart this is a love story that is engrossing drama that is altogether transporting.  It's a memorable film, highlighted by Oldman's performance and, of course, the music.  And there are a number of scenes, as well, that are unforgettable and demand mention.  One depicting the debut performance of the `Ode to Joy,' and another in which the young Beethoven (played by Leo Faulkner) runs at night through the streets of the city to escape his drunken father (Fintan McKeown), coming at last to a lake, into which he wades to float on his back; and with the camera positioned directly above, looking down upon him, a billion stars are reflected in the water around him.  Then slowly the camera pulls back until the young Ludwig blends with the reflected stars to seemingly take his place among all the brightest lights of the firmament. It's a scene that will leave you breathless and remain etched in your memory forever.  And it's but one of the more astounding moments from an astounding motion picture that absolutely must not be missed.  I rate this one 10/10.","user":"jhclues","rank":[105,125]},{"title":"A favorite","rating":9,"date":"3 October 2004","review":"This is one of my all-time favorite movies! I thought the music was well done, and I don't understand the criticisms I've read in this forum at all. The central idea of the movie is just one man's theory of who the \"immortal beloved\" was. No one knows who it actually was, and most theories I've read disagree with the film. No matter! I thought the premise was interesting, whether or not is was true. What was factual is that Beethoven WAS grouchy (wouldn't you be if you couldn't hear but music was your passion, your life??), and that he had digestive problems. Also factual was that he won custody of his nephew, Karl, and that his relationship with his brother's wife was antagonistic. The other people (countess Erdody, Schindler, etc) were factual people...of course any script written would have to put words in their mouths...big deal. I guess some people just are passionate about what their idea of the truth is (even though NO ONE KNOWS in this case) that they are blinded to the rest. The director is a Beethoven fanatic, and I found this movie to be a loving portrayal. Gary Oldman was absolutely fantastic! He learned to play the piano (spent months doing it) in order to be authentic. Thumbs WAY up on this one.","user":"ArizWldcat","rank":[56,66]}]