[{"title":"Immensely Enjoyable","rating":17,"date":"17 June 2004","review":"Looking at some of the other comments, not everyone is in agreement here, but I have really liked \"Les Visiteurs\". The original is so good, its a pity they had to spoil with the Americanized version - 'Just Visiting' - which is at best an insult on the intelligence of the American viewing public.<br><br>For us that do not understand French, they have done a tremendous job with the English subtitles (translating a kind of 'medieval' French into a comparable type of old English  modern swearwords included). In fact, the job is so well done, that we had a lot of laughs just by comparing the film's verbal antics to the translation. Even though I do not speak French myself, it is quite clear that a lot of effort had gone into this. Sometimes the conversations are fast and furious, so it's worthwhile to see the movie a second time. Even on the second pass, there was a lot to laugh at.<br><br>This is meant to be slapstick and the story is a total farce, so it's hard to see why some viewers apparently expected more. I thought it was well done, and very well executed. Even though this whole thing is intended as a joke, the reactions of the medieval guys are quite believable.<br><br>The movie is a blast!","user":"jordaan","rank":[64,67]},{"title":"My favorite movie!","rating":9,"date":"16 May 2003","review":"When I saw the low rating on this movie, I knew I had to submit a vote because, in my opinion, it make discourage many others from watching one of the funniest movies ever. The plot is very original, a knight and his servant, who were supposed to return in the past only several hours to correct a fatal error in judgment, mistakenly get zapped to modern times. Imagine medieval eyes seeing asphalt and a horse less steel chariot (a car of course) rolling towards them. The men, used to witches and sorcerers, believe it is some sort of devil machine. When the car stops, they promptly attack it. A black man exits and the medievals yell: \"A Saracen, a Saracen!\". I saw this movie in its original language: French. If you can understand French, I very strongly recommend it. This is slapstick at its best. You will want to buy the movie and watch it over and over because you will always discover something else you missed. It is a jewel!","user":"fijocha","rank":[64,68]},{"title":"Brilliant, funny movie, if you speak/understand french well, a medium slapstick comedy if you read subtitles","rating":10,"date":"4 June 2003","review":"I just finished watching the movie, and it was hilarious.  I was laughing outloud at many many points.  However, as my title indicated, it was the original french track that made me laugh.  As is always the case for biliguals, one cant help but listen to the track and read the subtitles at the same time.  Unfortunately, the subtitles do not do justice to the movie.<br><br>There are just too many semantic jokes that play off names and locations that could not be translated and make sense.  That is why in so many reviews there seems to be a sharp contrast in views of whether or not this was a joke-a-minute movie. <br><br>The hollywood remake is awful, in fact,it never really made any sense and and the jokes were far and few in between.  This one makes much more sense, and the meeting of people and their descendants makes for many more laughs.<br><br>The other factor is the acting and casting.  This is just the nature of subtitled movies - one very rarely gets the fantastic acting and language ability of actors when reading the watcher is reading a yellow line, especially in comedy.  Those who listen to the movie in its original french thikn the acting was fantastic, the voice casting (something i think is terribly important in acting [say, could Ashton Kutcher play Maximus from Gladiator, no, a high pitched voice could not do it]) is brilliant, but reading a crummy translation (and it was crummy) wont do the film justice.<br><br>8/10 for francophiles 6/10 for subtitle readers","user":"perfectisolation","rank":[53,60]}]