[{"title":"\"I can't help it. It's in my nature!\"","rating":10,"date":"7 May 2008","review":"When I was a teenager \"The Crying Game\" managed to surprise and touch. I watched it again last night and the magic is still there. Neil Jordan just have the touch.<br><br>A soldier, Jody (Forest Whitaker) is kidnapped by the terrorist group of IRA. He forms a surprising friendship with one of his kidnappers, Fergus (brilliant Stephen Rea) who has \"a killer smile\" but has also a heart. Jody adjures Fergus to go and find his loved one if something would happen to him...<br><br>Neil Jordan has written an amazing script which makes you laugh and cry. The story is very well structured. It is a story of love as an universal thing. This is the philosophy that is very dear to me. Jordan masquerades brilliantly human reflections through well-written characters like Fergus and Dil (Jaye Davidson). Dil's character gets to say the best punch-lines in addition of Fergus. The metaphor of the scorpion and the frog reflects human nature greatly.<br><br>The acting is fantastic. Stephen Rea is always very charming in his subtle way. Forest Whitaker was then just starting but his performance as Jody is touching. Jaye Davidson was a very good finding to play Dil. Miranda Richardson is ice-cold and cool as Jude. Jim Broadbent is funny as the bartender Col.<br><br>What a great movie! 10/10!","user":"native_girl333","rank":[12,12]},{"title":"An amazing film","rating":27,"date":"27 January 2001","review":"The less you know about this film, the better. I won't tell you anything except what a well-written and well-acted movie this is. from the first 15 minutes, which is mainly dialogue between two actors, you are completely drawn in to the film, which has almost dream-like qualities.<br><br>If you were planning to see it just because of the \"twist\" and to see what everyone was talking about, then see it. If you were planning to see it for the amazing script, acting and direction - see it. And if you were planning on not seeing it - see it","user":"force159","rank":[106,130]},{"title":"One of the most shocking and original movies of 1992. ***1/2 (out of four)","rating":9,"date":"29 May 2001","review":"THE CRYING GAME / (1992) ***1/2 (out of four)\t By Blake French:<br><br>\tI admire Neil Jordan for contributing his vastly original ideas to theater screens, as do I admire the Academy Awards, who appropriately rewarded \"The Crying Game\" with the best original screenplay Oscar in 1992. The film also earned nominations for best picture, director, leading and supporting actors, and editing. Jordan's style of filmmaking feels consistent over the years. \"The Crying Game\" offers the usual flavor of Jordan, but also incorporates unexpected, ninety degree twists that change the pace of his story altogether.<br><br>\t\"The Crying Game\" begins in Northern Ireland, where the IRA takes prisoner a British soldier named Jody (Forest Whitaker). Among the team of committed terrorists is the quiet Fergus (Stephen Rea), and the seductive Jude (Miranda Richardson), who guard Jody in an isolated forest shelter. As Fergus continually watches Jody, the two become begin to like one another. Jody knows that his tragic fate nears, therefore, shows Fergus a photograph of his romantic interest, who lives back in London. He asks Fergus to look her up sometime if he ever gets the chance. <br><br>\tThe movie takes a ridged, unexpected turn, and the next time we see Fergus, he is living as a construction worker in London under a new name. He finds the soldier's girlfriend working at a beauty salon. Her name is Dil (Jaye Davidson). Fergus gets a haircut, and follows her to a nearby bar, then the next thing we know the two are deeply in love. But Dil has a secret-and so does Fergus. What would Dil think if she knew her new lover was responsible for her late boyfriend's death? <br><br>\tStephen Rae is the best thing in the movie, interlocking the several separate plots with a concrete narrative. The film takes his point of view, and does so consistently. This is essential, since we learn information as he does-a classic yet extraordinarily effective method of keeping an audience involved. Here, Jordan celebrates a clean story, but reveals information about certain characters that change the entire direction of the story, while keeping the important material in play. That is not easy.<br><br>\n\t\"The Crying Game\" is not for everyone-it's a hard, perverse movie with enough content to warrant several R ratings. The sexual content is unexpected and distorted, but stunningly original. Three minutes do not pass before a character casually utters the notorious four-letter word. Even the violence is aggressive and graphic. \"The Crying Game\" takes no prisoners, so hold on tight and come prepared for the ride. <br><br>\tI think the film could have investigated the relationship between Dil and Jody with more detail. We learn how Jody feels about Dil, but Dil resists sharing her feelings about Jody. Is this done for a purpose? I think so. Neil Jordan is not the kind of director who would leave out massive plot nuggets like this, especially in a movie as deliberate and complex as \"The Crying Game.\" However, Dil feels a little shallow in this area. With a little more emotion and dimension, she could have been even more intriguing. Jaye Davidson does a great job with the character, however, which probably explains why this element of the story has not received many other complaints.<br><br>\t\"The Crying Game\" was certainly one of the most original movies to hit theaters in 1992, and deserved many of its award nominations and wins. Neil Jordan bravely takes us through controversial material, while at the same time, keeps us focused on the main points of the movie. He keeps the audience in his grasp the whole way through-something all directors should strive to accomplish.","user":"Movie-12","rank":[79,100]}]