[{"title":"Makes you want to take up Bird shooting","rating":3,"date":"2 April 2006","review":"'Thunderbirds' was an immensely popular Sixties show that has transcended the years and generations to the point it is still as popular now, with both adults and children alike, as it was in its heyday. So, one would deduce the chance to produce a live-action feature film with a million pound Hollywood budget was an excellent opportunity to revive the series as has been done with 'Spider-Man' and 'The X-Men'. But a terrible storyline and bland acting obliterated this opportunity and it was soon apparent all that was destined for this film was a trip to the bargain bin of the kiddies' section.<br><br>Instead of a film focusing on the five Tracey sons, their father and trusty geek Brain striving to rescue people and protect the world from villains, our hero in this drudge is a malcontent and bratty thirteen-year-old Alan Tracey, fourteen-year-old Tin-tin and ten-year-old brain-box Fermat, son of Brains (yes, Brains' son despite this being a man who could surely never score a woman if he tried; maybe he grew the kid in a petri dish). As one can tell from a run-through of our three lead characters, this 2004 remake 'Thunderbirds' was clearly aimed at entertaining only children under twelve instead of trying to appeal to a broad age-range as those involved in the much superior revival of 'Spider-Man' did. The plot itself was so bland with clunky, awkward dialogue and weak jokes that probably wouldn't amuse brighter pre-teens. The scriptwriter seemed more interested in ripping off 'Spy Kids' (which was at least quirky and original) instead of remaking the show people know and love.<br><br>Although Sophia Myles and Ron Cook were excellent as Miss Penelope and Parker, they only had about three lines between them so their presence was barely felt. Bill Paxton's Jeff Tracey was just boring and there was only the slightest of mention of the other four Tracey boys while Anthony Edwards and Ben Kingsley, as Brains and the Hood respectively, were just embarrassing. The Hood, in particular, is not at all threatening or sinister and instead comes across as a campy, two-bit stereotypical villain as limp as a piece of rotting lettuce.<br><br>Brady Corbet, who plays Alan Tracey, may well be a good young actor but it was hard to see that in a film where he plays a whinging brat who just grates and the same goes for Vanessa Anne Hutchinson as Tin-tin since the most she gets to do is look pretty and be all for 'Girl Power'. Ironically, it is young Soren Fulton's Fermat who is the only interesting character of the film as Fulton delivers a natural and relaxed performance.<br><br>'Thunderbirds' the series will be forever remembered as an excellent show that proves puppets can give solid performances! 'Thunderbirds' the film will be forgotten by most and remembered by a few as one big flop.","user":"cosmic_quest","rank":[35,40]},{"title":"Horrible, horrible, HORRIBLE!!!!","rating":1,"date":"12 February 2005","review":"Johnathan Frakes is a good actor and, when he's not directing a family film, a fine director. But, he really shouldn't have directed this movie, and the screenplay should've been rejected. The director and writers must understand what the original TV show was really about, as well as who the characters were and how they worked. The original series had many episodes with razor-sharp writing using good dialogue and with situations that American producers would never consider using in children's programming, much less a movie, which made the original series so well received by adults. I mean, the Tracys were college graduates and some of them did even drank alcohol and smoked tobacco! And, there were characters who did get killed, although most were bad guys. If they had written it the way that it was originally done, which isn't dumbing things down with poor dialogue, kindergarten humor, and a weak plot, this Universal/Studio Canal joint venture wouldn't have such bad reviews. <br><br>This motion picture is almost pure blasphemy. If you've seen the original Supermarionation series, then you'll know what I'm talking about! <br><br>The first thing that was out of place and annoying were the constant references to Ford Motor Company, even going so far that Lady Penelope was riding around in a disfigured Ford Thunderbird made up to look like FAB-1 instead of using what would've been more appropriate considering Ms. Penelope's station (not to mention being more faithful to the original), a ROLLS-ROYCE FAB-1. She's supposed to be a distinguished member of British society, hence the preference for England's finest make of motorcars in the original series. One other reviewer here indicated that Penelope wouldn't be caught dead in a Ford. He's pretty much right in the context that the idea of her riding in a Ford doesn't work. At least they could have had Penelope ride in a Jaguar made up like FAB 1 since Jaguar is a British car make that is owned by Ford, but NO! They had to use a straight FORD! But the Ford product placement doesn't end there. EVERY single car you may see is a Ford! Even the news flash that is shown on the TV sets in the movie were sponsored by Ford! Ford, Ford, FORD! The predominance of Ford vehicles makes this movie an obvious marketing vehicle for Ford. <br><br>The original series had a design that was futuristic for the 1960s and still remains ahead of its time even today. But, the futuristic design in the original series worked because there was an effort to make the design look practical and functional. This kind of treatment didn't exist in the movie, where everything is stylized to excess, defeating the sense of functionality and practicality. A lot of things that were done in the design of the movie were done strictly for style, many times with no sense of function to give that style a sense of reason.<br><br>The original series relied on good acting performances of the voice talent to overcome the limited expressions in the puppets, bringing them to life in the episodes. The brilliant and lively music score by Barry Gray helped even further to connect the audience with the story, the characters, and how everything came together to help achieve the super objective (a little bit of Stanislavski talk). The movie, on the other hand, had some overly grating performances. Anthony Edwards overplayed Brains to a fault, Bill Paxton as Jeff Tracy just didn't work despite decent acting (one of few), there were better choices for the Hood than Ben Kingsley, and many others that I don't care to mention (it would take too long). Quite simply, the puppets were more believable! Second was the overly generic and underwhelming music score by Hans Zimmer, sounding more like a mix between \"Days of Thunder\" and \"Apollo 13.\" <br><br>And, of course, the Hood. The Hood in the original series had an ability to communicate with Kyrano through a statue of Kyrano as an outlet for ESP contact. But, that was where his extraordinary capability ended. He's a master of disguise and deception, which allows him to sneak around undetected (for the most part, anyways) to gather information of the Thunderbirds vehicles for his own means. He also uses weapons for his own defense, including pistols, and generally collects information using a film camera, although he tried to steal Thudnerbirds 1 and 2 in the 1960s United Artists release of \"Thunderbird 6\" (which was the last Thunderbirds show filmed in Supermarionation and was the second Thunderbirds theatrical release). But, while he is a nemesis of International Rescue, the Hood isn't the villain in every Thunderbirds episode and he tends to avoid direct confrontation with International Rescue. In the movie, he's obviously the main villain, but he and his cohorts seem to act more like morons, along with the Hood having extended mind control ability, including the ability to move objects and move himself into flight for brief periods of time. This totally deviates from the Hood as a character in the original series with one that may leave kids laughing and people familiar with the series scratching their heads in confusion or leaving the theater in disgust.<br><br>There are more criticisms, but the 1000 word limit for IMDb reviews will not allow me to list all of them. So, I will close with the point being made that I didn't enjoy this movie. As a matter of fact, I think it sucks! Having seen the original series and Supermarionation movies (Thunderbirds Are Go, Thunderbird 6), I was hoping for something a lot better than this.<br><br>The original Supermarionation was a lot more sophisticated and elegant than this live action farce. (And that's saying it nicely.) - Kip Wells","user":"sonydude32","rank":[39,46]},{"title":"Unfulfilled potential","rating":30,"date":"30 July 2004","review":"As an admirer of the original television series and despite the 'mixed' reviews, I decided that I would go and see \"Thunderbirds\" (I did debate whether to go for some time but knew that I eventually would).<br><br>I have to say that the film was not as bad as I had feared - unfortunately it wasn't all that good either. I did feel that the film stayed with the \"Thunderbirds\" concept as originally conceived but went off at a bit of a tangent.<br><br>The main problem with this film is that it is a terrible story. The usual rescue activities of the Tracy brothers are confined to the beginning and end of the picture while the middle is devoted to teenage son Alan Tracy trying to outwit The Hood and his cohorts who have seized control of Tracy Island and orbiting communications station Thunderbird Five. The plot is remarkably shallow and a number of opportunities to develop interesting themes (Why The Hood hates Jeff Tracy, the death of Mrs. Tracy, Jeff and Alan, Tintin and Alan) are missed. Deleted scenes on the DVD perhaps?<br><br>The original series of \"Thunderbirds\" never talked down to its audience. It was not afraid of occasionally making social comment or introducing scientific concepts. \"Thunderbirds\" in its 2004 incarnation is incredibly bland and appears to have been made for those with a tiny attention span (key facts about the characters were repeated several times during the course of the movie).<br><br>No-one comes out of this movie particularly well - Ben Kingsley probably gives the best performance as The Hood. I felt terribly sorry for Anthony Edwards (Brains) who struggled to bring anything to his part - the stammer gags were simply embarrassing and pointless. Director Jonathan Frakes (Star Trek: First Contact, Insurrection) does a competent job with the material - it's just a shame about the material.<br><br>I did enjoy most of the CGI, although viewers can see most of this in the trailer. A shot of Thunderbirds 1 and 2 looming over a hospital were particularly impressive and I would have liked to have seen more of the aircraft in action.<br><br>I do hope they have another go at \"Thunderbirds\". If they do, perhaps they could have a decent rescue featured and more made of the Tracy's ingenious machines (perhaps Scott, Virgil, Gordon and John might even get a few lines?). Lady Penelope needs to be a little more resourceful and come out on top occasionally, like her marionette predecessor.<br><br>My advice is that if you have to see this movie, wait to rent the DVD.","user":"nigelchatfield","rank":[19,21]}]