[{"title":"An absurd but smart send-up of our image-obsessed culture","rating":24,"date":"24 June 2002","review":"Released a few short weeks after Sept. 11, Zoolander became the target of \"this is why they hate us\" diatribes. I didn't see it until months later and immediately recognized what I can only hope I would have seen if I had watched it earlier--that this is a superb satire/farce.  There aren't many movies that manage to be both silly and smart at the same time, and this is one. It is not only a send-up of the modeling and fashion industries, admittedly easy targets, but of our whole image-obsessed culture which commodifies love, spirituality, patriotism, heroism just as easily and unthinkingly as it does kitchen appliances. This is not a \"stupid\" movie, even though it is about stupid people and stupid situations. It keeps the targets of its satire within its sights at every moment, never letting that focus flag to pursue maudlin subplots, but at the same time, it is unfailingly hilarious, with marvelous comic acting, sight-gags, sets, and costumes. The screen is just packed with visual jokes at almost every moment. This is not a movie that anyone needs to be embarrassed to watch or enjoy. But it is also just plain damned fun!","user":"ken_gewertz","rank":[98,117]},{"title":"A Classic of the Idiot Genre","rating":18,"date":"18 December 2004","review":"Since Zoolander was released, I think I can safely say that it's become one of the most popular dumb comedies of the past ten years (a decade that was all too saturated with dumb comedies). Maybe it's the tongue-in-cheek attitude, or the clever writing, or the fact that it's immensely quotable (\"I'm pretty sure there's more to life than being really, really, ridiculously good looking\"). But whatever it is, it makes for a terrifically fun movie.<br><br>Ben Stiller is Derek Zoolander, three-time male model of the year, whose brainpower never quite caught up to his really, really ridiculous good looks. After losing his title to up-and-coming model Hansel (he's so hot right now), played by a Zen-ed out Owen Wilson, and the death of three of his model friends in a tragic gasoline fight accident, he goes on a quest to find his purpose in life. Turns out, his purpose in life is as the face of Mugatu (Will Ferrel with the world's best hair)'s new Derelicte fashion campaign--or so he's led to believe.<br><br>The plot is not strong. The characters are not fleshed out. But Ben Stiller keeps Derek's stupidity hysterical instead of irritating, and the rest of the cast adds gimmick after gimmick to keep things running. (Come on, the coal mines of New Jersey? Tell me that's not funny.)","user":"erialc0","rank":[151,190]},{"title":"Zoolander is stupid funny!","rating":8,"date":"21 October 2001","review":"Derek Zoolander is stupid. So is his movie. But by no means, is Zoolander humorless. Directed by and starring Ben Stiller, Zoolander is a very funny movie, if you know what to expect. Based on a character that Stiller created for the 1996 VH1 Fashion Awards, Derek Zoolander was originally intended to satirize the fashion industry. The movie does no less and as a result, has received some very negative patron reviews. Audiences went into Zoolander expecting another Ben Stiller, Meet the Parents-type comedy, and when they got an offbeat movie about the fashion industry's plot to assassinate the prime minister of Malaysia, they didn't know how to react. To enjoy Zoolander, one has to forget all expectations and see the movie for what it is supposed to be: ridiculous.<br><br>Derek Zoolander (Stiller) is the fashion industry's number one male model, but his career is slouching and boy beauty Hansel (Owen Wilson) provides tough competition. Fashion designer Mugatu (Will Ferrell) takes advantage of this and Zoolander's stupidity, and brainwashes him to kill the Malaysian prime minister, after he put an end to vital fashion industry sweatshops. The talented cast and an excellent soundtrack add absurdity to the already farcical plot. Zoolander gives both Ferrell and Wilson the opportunity to do what they do best. For Saturday Night Live's Ferrell that is embracing and developing the demented, while for Meet the Parents' Wilson, it is the chance to play a comedic, confident, character role. Stiller's father and wife also appear in supporting roles, with Jerry Stiller as Maury Ballstein, Derek's agent, and Christine Taylor as Matilda Jeffries, a TIME magazine reporter. Jerry Stiller, like Wilson, always manages to find humor in every role he plays, and in Zoolander this remains especially true. Taylor, being a veteran of the Brady Bunch movies, is not stranger to satire either. Well-chosen and placed music adds laughs and heightens the tone and feel of the movie. With songs ranging from Wham!'s `Wake Me Up Before You Go Go' playing as cruising music for Derek and his male model friends, and Michael Jackson's `Beat It' as the background music for a face-off between Derek and Hansel, any remaining seriousness is diminished. And yet even more surprise and absurdity is added by the many unexpected cast members and cameo appearances. Others appearing in Zoolander include David Duchovny, Jon Voight, Vince Vaughn, Andy Dick, David Bowie, Cuba Gooding Jr., Winona Ryder, and even Ralph Lauren's own male model, Tyson Beckford. I can understand people disliking this movie; it is temperamental. This is the kind of movie that varies depending on the audience and a person's expectation. Generally though, if you keep an open mind and realize that it is not meant to be serious in any way, your view of the movie shouldn't go anywhere but up. Zoolander is absurd, ridiculous, and overall, an incredibly stupid movie. I suggest you see it.","user":"gregherk","rank":[131,165]}]