[{"title":"Gonzo Space Opera,","rating":9,"date":"13 April 2006","review":"Like Stuart Gordon's other venture into science fiction territory, the underrated and ill-fated ROBOT JOX, this is a nifty little film that was plagued by production difficulties and failed to find a theatrical distributor, which is a shame because its quite an enjoyable viewing experience. Everyone in the cast has fun in this , with Dennis Hopper delivering some unexpected and funny bits of dialog, Debi Mazar and Stephen Dorff providing reliable 2nd banana support and Charles Dance having the time of his life with his horny half-metal madman. This Excellent DVD offers a chance to see this little sleeper in a great looking print with a fascinating and funny commentary by the Director. This film delivers exactly what its titles proclaims.","user":"raegan_butcher","rank":[36,42]},{"title":"Stupidly awesome","rating":8,"date":"30 December 2012","review":"The plot: Space truckers run into problems with space pirates, space politicians, and killer robots (who, technically, are not space robots).<br><br>Space Truckers is essentially a low budget, B movie space opera that's a parody of low budget, B movie space operas. It's full of cheesy lines, cheesy set design, and cheesy special effects. In fact, it's such a cheesy movie that it sometimes makes The Rocky Horror Picture Show look like The Godfather. At its heart, this movie is stupid, pointless, mindless, and has nothing to say about the human condition, except that it's funny to laugh at bad movies. If you're a Stuart Gordon fan, that's probably enough for you to enjoy this. As an added bonus, it's got a great cast, including many B movie veterans.<br><br>It can be enjoyed as either a so-bad-it's-good B movie or a clever parody. Like most Stuart Gordon films, it has rather narrow demographic appeal, and people who are not genre fans (or Stuart Gordon fans) are likely to hate it. I love Stanley Kubrick as much as the next film snob, but the world also needs ridiculous movies like Space Truckers and The Toxic Avenger. In fact, this movie is something of a marriage between Troma and New World Pictures. If you're unfamiliar with those studios -- or you dislike their copious output -- I'd strongly warn you away from this film. Space Truckers was reviled by the critics, rejected by audiences, and thought to be unintentionally funny by B movie fans. Well, for the true believers, this is an awesome movie, and nothing will ever convince us otherwise. Such is the cult of Stuart Gordon!","user":"krachtm","rank":[15,16]},{"title":"Amusing.","rating":19,"date":"19 July 1999","review":"I have to respect movies which promise something and deliver exactly that. When I rented this (I was bored tonight) I had absolutely no expectations for some great piece of art, another Star Wars or Aliens.  It was, however, a very cute and often amusing piece of sci-fi satire.  (probably my favorite bit was how the truck's voice was a redneck woman, instead of the usual authoritative british guy)  If you try to take it seriously, of course you'll hate it.  But if you rent it because you want to see a beer &amp; popcorn B-movie, then it's a REALLY good B-movie.  I may have lost 90 minutes of my life and gained no new insights on the meaning of the universe, but I did have a good time.","user":"WizardX","rank":[38,45]}]