[{"title":"Good Bloody Fun.","rating":7,"date":"6 February 2010","review":"Blood, breasts, vampires and Chris Sarandon. How can you go wrong?<br><br>\"Bordello of Blood,\" the second \"Tales From The Crypt\" feature film, supplies the viewer with ample amounts of all of the above, leaving room for little else. What it lacks in story, it more than makes up for in its cheap thrills, and as far as midnight guilty pleasures go, this one is about as good as it gets.<br><br>The story revolves around a good-girl (Erika Eleniak) whose delinquent brother (Corey Feldman) goes missing. Upon hiring a wise-cracking private detective, it is revealed that a local morgue is housing a brothel run by a gang of beautiful but deadly vampires. Armed with super-soakers full of holy water and with the help of a guitar-slinging reverend (Chris Sarandon), the two set out to put the joint out of business once and for all.<br><br>Dennis Miller is essentially playing himself, but keeps the humor pumping through the film's ridiculous premise. Chris Sarandon, likewise, is in top form as the genre hero he truly is. As mentioned before, there's plenty of bare-flesh and red-stuff to go around, and if that sort of thing is your bag, you'll have a blast with \"Bordello of Blood.\" Take it for the cheap thrill ride it is.","user":"Mr_Censored","rank":[11,11]},{"title":"One of my favorite guilty pleasures: a most awesome B-movie extravaganza!!!","rating":7,"date":"24 September 2001","review":"I don't have much of an opinion on this flick.  Because what's there to analyze?  Gratuitous violence.  Gratuitous gore.  Gross-out effects strictly for shock value.  Gratuitous nudity and close-ups of big breasts.  What we have here is a feminist's nightmare.  What we also have is an absolute blast!!!<br><br>I'm sure women won't enjoy this as much and will probably b*tch about the overdose of female nudity, but for all you guys who just don't give a damn and just want to kick back and have a good time:  You will love this movie!! This is like a mix of Wes Craven and Howard Stern.  A supreme guilty pleasure!<br><br>I enjoy deep, artistically brilliant films like \"American Beauty\" and \"Magnolia,\" but there's no reason I can't enjoy a campy, shallow, sleazy horror flick like this.  I don't ONLY enjoy these types of flicks, but I can enjoy it as long as it's done in a fun, tongue-in-cheek, unpretentious manner.  I just want to get that straight.  OK, I'll go on. :)<br><br>Dennis Miller provides great comic relief in his lead role.  Those who are fans of his schtick should look forward to this movie.  The horror sequences, though sometimes cheesy, are great fun to watch.  There's a spectacular sequence at the end with excellent usage of the song \"Ballroom Blitz.\"  There are other great classics like \"All Right Now\" and \"Jailbreak.\"  That's why I bought the soundtrack.  It's awesome!<br><br>So this movie fits the \"guy flick\" stereotype like a glove.  If you're not in the mood for excessive violence, gore and female nudity--don't watch this movie!  Don't say I didn't warn you.  <br><br>My score:  7 (out of 10)","user":"mattymatt4ever","rank":[29,33]},{"title":"Funny...trashy, but funny","rating":7,"date":"25 October 2005","review":"Before I write this interview, I wanted to just explain that I have been a Dennis Miller fan since I was 11 (1994), and he was the only reason I saw this movie. I also think he was one of the aspects of this movie that held redeeming value. In addition, purchased it new for less than $10 a few years ago, and it is in my Halloween movie collection. With that out of the way, I'll start my review.<br><br>Vampress Lilith (Angie Everhart) is brought to life again after a long rest in one of the far corners of the world by Reverend Jimmy Current (Chris Sarandon) and his partner Vincent. The two establish a bordello disguised as a funeral home to attract \"evil\" local young men. The men can \"get stiff among the stiffs,\" but men start disappearing. This disappearance of local young men hits close to home for Katherine Verdoux(Erika Eleniak) when her rebellious younger brother Caleb (Corey Feldman) goes missing. So, she hires a Rafe Guttman (Dennis Miller) a wisecracking, seedy private investigator with good intentions and a quite unusual case--all involving this mortuary with secrets. Rafe and Katherine put themselves into a mystery that crosses the boundary of the living and the dead--rather, the undead.<br><br>This movie, thought quite funny, is a bad movie. That's just how it is. Going into this movie, the title itself is an indication of how trashy or bad it really is. But man, is it a fun trip! I found myself laughing at pretty much all the right scenes and all the right lines. Its as though the lines are tailored for Miller himself, it is perfect shtick for him. Most of the movies he's been in had parts written especially for him, but this was perfect. My first impression of Rafe is that he's a jerk, but I discovered (rather quickly) that he is rather good-natured and good-intentioned, and that he truly wants to help Katherine out.<br><br>There are two scenes I absolutely loathed about this movie--the scene where Lilith encounters Rafe in his office (I turn the channel off or fast-forward the tape), and the opening scene of the movie where Lilith is discovered by Rev. Current and Vincent (this is only watchable once). Otherwise, this movie is quite funny and interesting if you plan on getting into it. My biggest beef (spoiler) is that we don't even meet our hero until roughly 20 minutes into the movie! When you're first billed, doesn't this mean you'll show up earlier in the film? I guess someone missed one of the most important parts of film-making, or at least credit order. But, its OK, really, it's not the worst thing about the film.<br><br>This is essentially a bad movie. I read another review that says that it seems Dennis Miller is letting the viewers know this. He sure is! This is one of those so-bad-it's-funny kind of movies (why it used to be in the horror section of the video store I have no idea). However, Dennis Miller is hysterical in it!! I loved his moments--he had a lot of good ones.<br><br>I liked when he goes to the \"Cunningham wake,\" and watches as the men lift the coffin out of the room, but struggle with it. Guttman, observing the scene, says \"Wow, she really was a heavyweight.\" He does make some of the most classically bad facial expressions I have witnessed in a long time (honestly, after seeing this, I want to know what acting school I have to go to just to learn to \"Act the Dennis Miller Way\"). My favorite scenes are the Super Soaker scene (I won't divulge on this too much, not to spoil it, but it is a classic scene not to me missed), the scene where he sneaks back into the mortuary to investigate, and when Rafe heads into the coffin drop to visit the Bordello.<br><br>So why 7 out of 10 stars? One point deducted for the opening scene, which tends to be long and drawn-out. Watch this once, and you'll understand what is going on. What redeems this film is that after this point in the film, it becomes better, and the plot begins to move a little. One the same point, the entire first twenty minutes of the film is a complete drag. Skip the introduction on the next viewing. Another point deducted for the scene where Lilith encounters Rafe in his office--this scene is just a complete turn-off to me (2, 4, 6, 8--You can watch me masturbate!--yuck). And a third point deducted for the nudity. Yes, I know, it's a bordello, yes, they're supposed to be nude. But, I 'm a female, and I don't take pleasure in watching naked women prance around. But, I'm flexible, so I pushed past that dislike and ignored it. The bad acting isn't even a negative--it adds to the movie's silly nature.<br><br>This is a great Halloween movie, but non-Dennis Miller fans may be turned off by it. Maybe not, I don't know. The acting is pretty bad, but that's the point--it's not Oscar-caliber material. I highly recommend this movie--it has its moments that make is memorable (probably not for all the right reasons, but it tries). Some classic scenes make it funny, and you just may watch it more than once (I have!). Just try not to read too much into it. It really is quite an enjoyable diversion.","user":"AllisonLVenezio","rank":[9,9]}]