[{"title":"One of the scariest movies I've seen....","rating":22,"date":"22 January 2004","review":"David Mamet's \"Oleanna\" is a harrowing, horrifying, gut-wrenching portrayal of two human beings who have entered into - as John, the professor played by William H. Macy declares - an agreement as to certain forms and institutions - and the institution of grading is, though the catalyst for what follows, the least of concerns here....  \"Oleanna\" is set squarely in the midst of contemporary academia, but the issues it addresses are more far-reaching than those pertaining solely to classrooms and the offices of intellectuals. That said, many may have difficulty relating to the characters and to the specifics of the situation in which they find themselves - the drama is more often than not a drama of words, ideas - \"discourses.\"  But these are, ultimately, only the incidentals - or better, the particular manifestations - of what is at root as \"simple\" as a basic communication breakdown: \"I don't understand\" is a phrase uttered countless times by both of the protagonists/antagonists.  And ultimately, this is what \"Oleanna\" is really \"about\": the difficulty - the impossibility?, as it is suggested - for two people to understand each other on the most fundamental level.... The \"plot,\" such as it is, is rather simple: a private meeting between professor and student yields two wildly divergent ideas of what actually took place, and why.  Carol, an intense and troubled young student, is concerned with her apparently miserable grade in a course taught by John, and goes to meet him in his office to discuss it.  Initially, the audience's sympathies are squarely with Carol - especially in light of the brusque, brutal, even cruel manner with which John initially dismisses her.  But slowly, John softens - he begins to see himself in the young girl, and soon he allows his guard to slip - he \"dissolves the boundaries between teacher and student\" and undertakes to help Carol as a fellow, sympathetic human being.... The equilibrium - if in fact there ever is any at all - is not, however, to last for long; the encounter results in a savage power-struggle in which each participant fails to connect with the other and, ultimately self-absorbed, fails to understand the other's position and motives. \"Oleanna\" is really about the consequences, it seems, of abstraction - and Mamet and his actors do a wonderful job of demonstrating the disjunction between the real, human core of individuals and the superficial personae that are variously self-adopted and assigned by the other.  There are several moments where entente seems on the very verge of realization, in which \"feelings\" emerge to bridge the gaps separating the middle-aged, middle-class, white male teacher and the young, lower-class, white female student - but the moments are always interrupted by one or the other of the two participants, through, basically, self-absorbed self-indulgence of immediate concerns - be they material or psychological.  And each immediately falls back into the traditional, comfortable role s/he has been playing. This film troubled me a great deal - both at the time I watched it, and later.  There are, in fact, no easy answers, and the tagline \"whichever side you choose, you're wrong\" has come to seem to me much truer than I at first thought.  The film really is a Foucault-informed meditation on power and discourse - both consciously exercised and unconsciously-assumed.  But ultimately, I think, the film indicates that no solutions can be discovered in the very foundation of the problem - the modern tendency to abstract identity from socio-political and intellectual discourses.  John seems much closer to the truth than Carol - but he is no less wrong for it - for he fails to \"practice what he preaches,\" whether or not he knows it. These issues are \"universal\" in today's post-modern Western world - but perhaps nowhere are they better exemplified, or more serious, than in academia, where words are the foundation of life itself.  As a chosen academic myself, and as both student and teacher, I found this film woefully plausible (in many respects - the fact that even a second, let alone a third and fourth meeting ever took place is admittedly rather incredulous) and relevant; quite frankly, it terrified me.  I can honestly say - even considering my guilty addiction to cheap horror flicks - that \"Oleanna\" is the scariest movie I have seen in years....","user":"dcphillips33","rank":[59,68]},{"title":"Oleanna: the sham promised land behind Academia?","rating":10,"date":"20 August 2007","review":"One writer perceptively suggests that the term \"Oleanna\" was used to describe swampland being sold as prime real estate.<br><br>I think the primary context in which the title \"Oleanna\" is to be understood appears in a \"folk\" stanza preceding Mamet's published edition of the play:<br><br>\"Oh to be in 'Oleanna,'/ That's where I would rather be,/ Than be bound in Norway/ And drag the chains of slavery.\"<br><br>And so, Oleanna is a version of a Utopian promised land, and in the context of the play, the gateway to this better tomorrow is through the halls of Academia. Susan, the victim of her own false expectations of how the university is to transform her existence, repeatedly mentions the struggle she had to endure in order to get into college. For her, academic success is central to her vision of a better life. John, the pedantic professor, also sees Academia as the means to a comfortable, upper middle class existence with his new house, wife, and son. All he needs to do is make tenure, and his future is secured. <br><br>However, John presents himself as an academic bad-boy who debunks the very Academia with which he is trying to secure his comfortable future. This ridicule of the academic process strikes at the heart of Carol's dreams of a better future through education. She quite rightly sees that the professor is trying to have it both ways--playing the academic outsider while trying to kiss-up to the tenure committee in order to ensure his cushy new home in the suburbs. When someone's dreams are threatened, they become angry and strike out, however they can.<br><br>This is a brilliant movie. Anyone working in a high school or university, and anyone contemplating an academic career, needs to watch it, and allow it to soak deep into the structure of the brain. Perhaps that academic career isn't such a good idea, after all. Maybe that utopian real estate is really swampland. At any rate, one needs to be very, very careful when dealing with students.","user":"oowawa","rank":[23,25]},{"title":"The peril of uniformity and conformity","rating":10,"date":"23 July 2006","review":"This is an example of the danger of extreme application of \"political correctness\" in order to defend the \"right\" to mediocrity, to intolerance, censorship and questioning of the establishment. Carol, the student is a perfect example of the kind of personality needed to enforce either a fascist state or a witch hunt. Her arguments used to define sexual assault takes away the intention of the act and substitutes it not even for the appearance of the act but in the perception of the victim. I explain, the act in question can be seen as an assault or as kidnapping (retaining Carol against her will) but the act cannot be sexual; the last scene as well has a murderous attempt but not a sexual connotation and it is a reaction to a false accusation (perjury). The bottom line is that the self-portrayed victim becomes the victimizer by waving the arguments that make her a victim (sexism, racism, humiliation) and she becomes sexist, cruel, humiliating and patronizing in the name of a distorted concept of political correctness. The mere concept of political correctness, is non-sensical if it is only a way to behave but not of thinking.","user":"heriberto-larios","rank":[10,10]}]