[{"title":"Friends? No! Its much more then that!","rating":8,"date":"1 June 2016","review":"This is a tense thriller about an obsessive woman who becomes too enthralled in someone else's life, and even gets herself mixed up in lies, deceit and other bad activities, and the cycle of problems just gets more momentum. The basic plot is that Allison (Bridget Fonda) gets a roommate for her Manhattan apartment (has anyone ever seen an apartment this large in NYC??) after her skirt-crazy live-in lover Sam (played by \"Wings\" star Steven Weber) runs around on her. It's Headra \"Hedy\" (Jennifer Jason Leigh) to the rescue! This is one of my favorite suspense films. The setting is amazing, an old spooky apartment building but a gorgeous sparsely furnished apartment within. There really isn't a lot of violence in this movie, mainly just at the end. It's a good suspense movie, though, which builds and builds. The film is stylish, thanks to Luciano Tovoli (Suspiria) cinematography. Fonda and Leigh give strong performances in this movie. This is an underrated thriller, which is surprisingly clever movie.<br><br>Overall rating: 8 out of 10.","user":"PredragReviews","rank":[9,11]},{"title":"Who needs references these days anyway?","rating":7,"date":"26 August 2011","review":"Single White Female is directed by Barbet Schroeder and adapted to screenplay by Don Roos from the novel \"SWF Seeks Same\" written by John Lutz. It stars Bridget Fonda, Jennifer Jason Leigh, Steven Weber, Peter Friedman and Stephen Tobolowsky. Music is by Howard Shore and cinematography by Luciano Tovoli.<br><br>When it's revealed that her partner Sam (Weber) has been cheating on her with his ex-wife, Allie Jones (Fonda) kicks him out of the apartment and advertises for a female roommate. She chooses Hedra Carlson (Leigh), who on the surface seems to be the perfect roommate. Smoothly helping Allie through her crisis, a real friendship is formed, but it's not long before Hedra starts to exhibit some dark behaviour patterns..<br><br>The early 90s saw the \"Woman from Hell\" back in vogue in mainstream cinema. After the success and publicity of Fatal Attraction (1987), there was a period where you feel that sensible film makers wisely chose to let that particular film disappear from the film lovers memory banks. As it happens, they must have collectively chose 5 years as the cooling off period. For 1992 saw a wave of mad female on the loose pictures released. Led by the publicity gobbling Basic Instinct, films such as The Hand That Rocks the Cradle and Single White Female put bums on cinema seats and reopened the \"Mad Bitch\" sub-genre. Of the three, Single White Female grossed the least, which is strange since it's a better movie than the other two.<br><br>Schroeder's (Barfly/Reversal of Fortune) movie isn't a complete success, there's not enough development of the main characters and there's some unintentionally funny moments. But when it's good it's real good. Reeling off a number of memorable and often chilling scenes, film is further boosted by the psychological smarts in Roos' (Boys on the Side) screenplay. It helps that Schroeder has a knack for pacing, too, where he neatly simmers the plot until the spill over for the big finale. No disappointment there either, a good combination of genre staples is enhanced in impact by some unexpected character developments, and there's moments of genuine suspense to lure the viewer to the edge of their seat. <br><br>It's also stylishly shot by Schroeder and Tovoli (Suspiria/Tenebrae). Allie's Upper West Side apartment is imposing and expansive, with high ceilings, old time plumbing, a clunky lift and a dingy laundry in the basement. It's a different set-up for such a thriller, no picket fence harmony house or beach side residence, this is bustling New York, big spaces, but as it turns out, that means no hiding place. The boys behind the cameras get the maximum they can from the locale by blending imposing and ominous with grainy veneer and filtered light. On the acting front, the girls put great effort into making their thinly developed characters work, with Leigh doing a good line in progressive instability. While Friedman, Weber and a wonderfully naughty Tobolowsky, make the most of their secondary roles. <br><br>One or two obvious flaws aside, this still rounds out as a thoroughly enjoyable thriller. 7.5/10","user":"hitchcockthelegend","rank":[22,32]},{"title":"ALMOST, NOT QUITE","rating":2,"date":"12 March 2004","review":"I love Bridget Fonda and Jennifer Jason Leigh, but, what are they doing here? A shameless rip off of a much better movie \"Apartment Zero\" with Colin Firth and Hart Bochner. As the journey had already been taken, the trip becomes an irritating one. I didn't care about it for a minute. The two actresses are always worth watching, they have the power to attract their audience whatever they're doing. That's partly why, I was so put off by the nonsense they were involved with in Single White Female.","user":"marcosaguado","rank":[83,159]}]