[{"title":"Great thriller","rating":5,"date":"5 April 2001","review":"Perhaps the allusions to Hitchcock are not warranted, but the first time I saw this I was knocked out. DREAM LOVER has a tightly wound plot and fine performances by the entire cast.  Nick Kazan has some great dialogue in here like \"What you think is paranoia is heightened awareness.\"   Some folks might fault Spader's character as very stupid (really, you should find out as much as you can about a potential mate before marrying them!)  Still, this a great neo noir thriller that really goes to show that beauty is often skin deep.  Definitely worth a rent.","user":"brendonm","rank":[30,34]},{"title":"A wonderful, overlooked suspense film","rating":9,"date":"13 October 2000","review":"It's too bad that bigger budget Hollywood fare often obscures movies that are far better such as this. I wasn't expecting a whole lot from this film as I'd not heard much about it, but was totally captivated by it.<br><br>The performances from James Spader and the achingly beautiful Mädchen Amick are first rate, and the script is flawless. A lot of the plot feels like a rehash of Hitchcock, but it's done incredibly well, and hey, if you're going to steal from someone, might as well steal from the best.<br><br>The twists and turns really work, and take the viewer along for the ride as well. You'll find your own mind working along with the script, trying to unravel the mystery.<br><br>It's a shame this film didn't receive more publicity, as all the elements are there for this to have been a real hit. Instead, it remains one of my favorite little gems of a film... one of those that few people know about, but when they see it they think it's a great film as well.<br><br>An added bonus is that the home video version contains a few minutes of extra \"steamy\" scenes that were cut from theaters.<br><br>I think this film is an underappreciated modern-day classic, and I urge everyone to check it out.","user":"briscojr","rank":[44,52]},{"title":"An intriguing psychological melodrama.","rating":6,"date":"5 August 1999","review":"DREAM LOVER is a nicely made, well-acted little film about a man who meets and marries the girl of his dreams but begins to wonder who she really is. This film marks the directorial debut of screenwriter Nicholas Kazan, the son of Elia Kazan.  He did a very impressive job.  The cleverest touch is having a framing device which has a crazed clown at a carnival who explains the major plot developments to James Spader's character and to us as well. Spader plays a very successful businessman who just got a divorce and is very lonely.  But a chance encounter with a beautiful young woman named Lena (Madchen Amick in a very incisive performance) changes that.  She is perfect in every way.  I can't reveal much more story than that.  The plot twists and turns like a pretzel.  It's not always plausible, especially the ending, but it is entertaining all the same.","user":"Pinback-4","rank":[24,31]}]