[{"title":"The B-movie that warped my mind","rating":6,"date":"15 October 2013","review":"First time I saw Mindwarp on the TV, I kinda hated it. Mostly because I thought it was a cheap and gaudy film, made grotesque by the excess of blood and gore, with ideas that were interesting but never profound. Despite disliking the film, however, it stuck with me, partly because it did have scenes and ideas that were inherently interesting and worth watching, and mostly because this is actually one hard film to find on home video. I have never seen a DVD release for this film; it's currently only available on VHS, or, shockingly, as a limited-edition Twilight Time Blu-Ray. That brief showing on TV was my one and only exposure to this movie, up until I got my mitts on Blu-Ray #471 of 3,000.<br><br>To be fair, the movie makes for a fine piece of pulply schlock sci-fi, the likes of which could make for a great comic strip in the Heavy Metal magazine, or a short story in some anthology. As a film, it has some promise; the bulk of it takes place in a nightmarish post-apocalyptic wasteland, full of bloodthirsty cannibals, parasitic fish, and sick cults. This hard-edged adventure is book-ended by a really slick bit of utopic cyberpunk, for even though the world has been nuked, a number of inhabitants spend their time in a virtual dream-world. Sound familiar? It makes me wonder if Mindwarp could have been an influence on the Watchowskis when writing The Matrix saga...<br><br>The film is neat, and its story is inherently sound. What makes it work are its characters; it is interesting to watch the main heroine get a serious dose of reality when she's expelled from her utopic home and forced to confront the harsh realities of a nuclear wasteland. Things come in full circle by the end, thanks to a neat little plot twist, but the overall message never felt right to me (almost an antithesis to The Matrix, which was all about liberation). That's really the only problem I see with the plot: a certain lack of refinement, for despite the key themes of reality and fantasy, and the coming of age, the film seems really small in scale and it seems like some things could have been better.<br><br>The film is as I remember: gaudy and ugly. It's filmed with adequate photography and editing, but most of the settings, props, and locales appear cheap, drab, and somewhat ugly. Even the futuristic scenes in the utopic city are rather ugly-looking. Acting and writing are rather weak all around; Bruce Campbell is a pretty standard hero guy here. Despite a few iffy lines, I was rather fond of Marta Martin. Angus Scrimm steals the show throughout. Music for this film is rather gaudy too.<br><br>To me, this film has always been the pure definition of a B-movie: cheap, ugly, gory, strangely hard-to-find, and strangely somewhat hard to forget. For those who have an interest in such low-grade cinema, or are a fan of the actors, or just want a good piece of trashy pulp sci-fi, Mindwarp should be worth a look, if you can find it.<br><br>3/5 (Entertainment: Pretty Good | Story: Average | Film: Poor)","user":"Al_The_Strange","rank":[11,12]},{"title":"If you can stand the gore, Mindwarp is fun sci-fi.","rating":18,"date":"18 November 1998","review":"I normally hate post-apocalyptic science fiction, but I'll make an exception for Mindwarp.  Despite gratuitous gore and a cast with some weak members, the film manages to be entertaining.  Good use is made of a low budget, and an intriguing (if ugly) world is created.  If you're a science fiction fan, this movie should be at least a little more satisfying than most genre entries.","user":"Whovian","rank":[18,22]},{"title":"Better than expected for a low budget scifi/horror flick","rating":7,"date":"14 November 1999","review":"Chaucer this ain't! Mindwarp is a low budget horror flick that makes no pretensions, and delivers no surprises. Starring the always reliable Bruce Campbell, and a very weak Marta Alicia, the movie is your basic post-apocalyptic romp with monsters, mutants, evil wizards, etc. Higher on the gore content than many of its compatriots, the movie also lacks the tongue in cheek humor that makes some of these flicks fun to watch (Sam Rami's Army of Darkness comes to mind).<br><br>The movie does elicit good performances from Bruce Campbell, who has made a successful career fighting heavily made up extra's in movies and Rami's Herc/Xena series. Campbell knows the score and delivers the deadpan hero mode needed to make these pictures bearable. Surprisingly good back up work by supporting actors Angus Scrimm and Elizabeth Kent, doing something with very little in the dialogue department, also add to the film. The one big problem is the female lead, Marta Alicia, who has obviously forgotten that she is no longer in Grade 10 drama, and delivers her lines in a one note (ie. - whiny) tone. Forgetting that her major role is to scream, look frightened, and lose most of her clothing at strategic intervals, Alicia instead appears to be trying to ACT, mainly by looking annoyed and whining a lot.<br><br>Overall, the flic ain't bad. The writing is better than expected, with several plot twists at the end and even a hint of an Electra complex (shades of Freud) along the way. The special effects aren't, and the budget was obviously stretched in the makeup department, as most of the 'mutants' look like trick or treaters wearing Holloween masks from Walmart.<br><br>I rented this at Blockbuster for 99 cents. That's about the right price.","user":"johnv-3","rank":[17,21]}]