[{"title":"Idolator! Your soul is required in hell!","rating":8,"date":"13 March 2013","review":"New Jack City is directed by Mario Van Peebles (who also co-stars) and written by Thomas Lee Wright and Barry Michael Cooper. It stars Wesley Snipes, Ice-T, Judd Nelson, Allen Payne, Chris Rock, Bill Nunn, Bill Cobbs and Michael Michele. Music is by Vassal Benford and Michael Colombier and cinematography by Francis Kenny. <br><br>New York City, 1986 and crack cocaine is the drug of choice and Nino Brown (Snipes) and his gang, the Cash Money Brothers, are building a violent empire and cornering the market. Enter streetwise cop Scotty Appleton (Ice-T) and loose cannon Nick Peretti (Nelson), who form an uneasy partnership willing to push the law's boundaries to bring Nino down <br><br>The Black Scarface! <br><br>On narrative terms it's basically an urban modernisation of the Scarface story, the themes at work were nothing new back then, never mind in cinema post 1991. That it is predominantly an African American film caused many at the time to call it a Blaxploitation picture for the 90s set, which is unfair, because it has more on offer than that and doesn't shy away from the dramatics available with such a story. True, it isn't pulling up any trees or breaking new ground in the drug/crime order of cinema, but it's incendiary enough to be thrilling whilst never romanticising the lifestyle of the drug gang. It paints a stark world of a drug infested city populated by colourful gang members, hapless addicts and edgy coppers, all sound tracked by pulse pounding hip-hop beats. <br><br>This was Van Peebles' first big screen directing outing and it's a hugely impressive debut. So much so it begs the question on why his subsequent directing career has been something of a none event? Here he delves deep into the realm of neo-noir to provide the picture with many visual smarts and techniques. Backgrounds are often showing oblique angles, colour schemes such as garish greens feature in striking compositions, a flashing red light is used adroitly on a character's face as he struggles to hold his rage, a POV shot of a basketball and the opening of the film with a slow zoom in on a crime about to be committed on a bridge, these are just some of the flair tricks showcased by Peebles. <br><br>While some of the key characters that form Nino's gang are under developed, Peebles does garner a great performance out of Snipes and very good turns from Ice-T and Nelson. Snipes provides Brown with a sinister swagger, yet a charm exudes from him that makes it believable that people would be willing to be led by him. Ice and Nelson are a cool double act, both Scotty and Nick pulse with machismo but are equally flawed as characters. The other important character and performance is Pookie played by Rock, a reformed crack addict now helping the police. Peebles is unsubtle in his handling of the Pookie situation, but it strikes the requisite emotional chord and puts further dramatic worth into an already tense filled thriller. <br><br>It's not as revolutionary as was once heralded, there is some formula familiarity and the finale is telegraphed too easily, but this has energy and style to burn. Making it one of the leading lights of the drug crime sub-genre of neo-noir. It's a damn shame Peebles was never this good again. 8/10","user":"hitchcockthelegend","rank":[14,15]},{"title":"Fast paced ghetto gangsta fantasy with an important message","rating":7,"date":"31 July 2005","review":"Van Peebles directs a great cast in this detached-from-reality film about a truly evil drug-lord with a head for business and murder (Snipes), and a tough, street-wise pair of cops (Ice-T and Judd Nelson) hell-bent on bringing him down. The message is an important one - slogans are not going to win the war on drugs, and the way the message is carried in the film is more subtle than you might expect. The end of the film makes the point very clear, and I won't discuss it because I do not write spoilers. Like many of the more intelligent films made in the early 1990s, New Jack City is also an indictment of the euphoria of the Reagan years - telling the true story of what that time was like for those living from paycheck to paycheck, or trying to live without one, and dealing with the invisible \"war on drugs\" which had little to no effect on anybody in our inner-city neighborhoods.<br><br>Snipes, Ice-T, Allen Payne and Chris Rock give stand-out performances, and the rest of the cast provide excellent support. The film also stars New York City, and definitely has an NYC flavor (seasoned with more than a pinch of Hollywood). The cinematography is a little breathless - not unusual for the genre but in this case a bit extreme. The script is good, but perhaps too dense with rich plot details. And the editing provides a few pacing problems toward the middle of the film which, combined with the over-abundance of subplots, detract from the development of the main themes. The soundtrack is excellent - including a nice mix of hip-hop, rap, contemporary soul, and dance music - all blended nicely with the imagery of the film. Van Peebles style is well developed in this film, but I felt that some aspects of the plot were a little too outrageous for the seriousness of the film's message, and I fear that the message may have been lost on many of the film's viewers.<br><br>Overall, this is a good film. Entertaining and thoughtful, but definitely not for everybody.","user":"mstomaso","rank":[31,39]},{"title":"A must for all fans of Mafia-type movies.","rating":10,"date":"3 January 2000","review":"This is a very stylish movie. All the elements seem to have combined to give it a very distinctive look and feel. The soundtrack is excellent and complements the story perfectly, almost like it is a part of the story. All the performances are great but special mention has to go to Wesley Snipes and the great Judd Nelson/Ice T double act. Okay the plot doesn't really tax your brain but if you are a fan of gangster movies or want a bit of mindless entertainment then you won't go wrong with this film.","user":"fiona-21","rank":[21,26]}]