[{"title":"Ordinary Decent Film","rating":7,"date":"9 January 2000","review":"Based on the real-life figure of Dublin gangster Martin Cahill (his story was also told in THE GENERAL, released in 1998), this fast-moving crime flick has little new to offer, but is worth a look for fans of the genre. Writer Gerard Stembridge takes the main facts of Cahill's life and gives them a slight spin (most especially the latter stages) to create an interesting mix of fantasy and reality. It's not as good as THE GENERAL; Spacey and Fiorentino struggle with their accents; and the finale is a bit much for us to swallow. But, for all its flaws, it's a lively and amusing piece, if destined forever to fall in the shadow of its more illustrious fore-runner.","user":"darren shan","rank":[24,29]},{"title":"Robbers and Cops","rating":7,"date":"5 September 2005","review":"ORDINARY DECENT CRIMINAL has to be one of the more tongue-in-cheek titles Hollywood has devised for a story apparently based on a real life infamous Irish gangster Martin Cahill whose claim to fame was robbing banks and getting away with it while posing as a preceptor of family values! Yet in this reincarnation the plot is suffused with comedy and typical capers and served up by a fine cast on a shaky platform.<br><br>Michael Lynch (Kevin Spacey, always terrific to watch even in uneven films) is a 'gentleman robber', married to two sisters (Linda Fiorentino and Helen Baxendale) whose latest criminal diversion involves the theft of a Caravaggio painting. How he utilizes his cohorts and evades the police headed by Noel Quigley (the extraordinarily gifted actor Stephen Dillane who played Stephen Woolf in 'The Hours'). The cast is good and makes the best of a confusing arc of storyline written by Gerard Stembridge. Director Thaddeus O'Sullivan keeps things moving along but slides into some boring and non-additive variances from the plot and character development that threaten to grind down the film. Tack on a corny ending not in keeping with the real character on whose life the story is based and the recipe for lack of success in the theaters is obvious.<br><br>But keep the expectations low and this film will entertain. Sad that for its distribution in the USA the cover of the DVD lists Colin Farrell as one of the stars (Spacey, Fiorentino, Farrell) which says a lot about PR grossness: Farrell is a VERY minor extra here and should any other actor be listed in top billing it is Stephen Dillane! Not a great heist film but it's always good to see more of Spacey. Grady Harp","user":"gradyharp","rank":[14,17]},{"title":"Not as funny as it tries to be","rating":7,"date":"12 April 2005","review":"Who doesn't like witty, lovable criminals, who out wit every copper and other rival criminals in a heartbeat? That's a crime movie genre, which actually appeals to me: smart dialogs, funny action and so on.<br><br>So, in \"Ordinary Decent Criminal\" we have one of the greatest living actors, Kevin Spacey, who is playing Irish mobster named Michael Lynch, and he's just such a fellow I described. There's also Colin Farrell in a small role as one of the thugs in Michael's gang. Actually rather good acting all around from all of the actors and that's the only reason this movie stays afloat, because the script is not that funny as it tries to be.<br><br>Sure, it has couple of good laughs in it, but most of the jokes feel little forced.<br><br>Direction is pretty decent, not worst thing ever directed, but certainly not the greatest crime movie either.<br><br>Good for couple of laughs.","user":"tomimt","rank":[16,23]}]