[{"title":"Bob Chinn's best -quality romantic porn","rating":10,"date":"10 January 2011","review":"Bob Chinn has cited this as the best film he ever directed and I concur. Right from the classic opening scene spotlighting print model Kitty Shayne (in undoubtedly her best feature role), TROPIC OF DESIRE is a porn film that actually plays like a real movie.<br><br>To be more precise it reminded me of the best of live TV back from the 1950s when John Frankenheimer, Arthur Penn and Sidney Lumet were in their pre-movie prime. Like those old kinescope classics, DESIRE is claustrophobic, set in a whorehouse near Honolulu in 1945 near the end of WW II, but has the hot-house intensity of those studio-bound acting showcases. And the acting is of high-quality, starting from madam played by Georgina Spelvin to her girls including Jesie St. James and Susan Nero.<br><br>There is a sensitive \"first timer\" soldier sequence featuring Eric Stein, who gets the bonus of a second time around with newcomer to the house, played by Dorothy LeMay. Starr Wood is also impressive, and the male actors do a good job, if a bit sentimentalized (notably Ken Scudder, usually more macho than his \"pining for Rita\" role here).<br><br>Very well photographed, TROPIC OF DESIRE benefits from a nonstop soundtrack of fabulous 1940s era jazz tunes -the selection is among the best compilation I've ever heard in a porn film. They set the atmosphere and also contribute to the arousing sex scenes.<br><br>Kudos to Chinn and his oddly unsung classic, a gem amidst his hit-or-miss roster of so many Johnny Wadd programmers.","user":"lor_","rank":[7,7]},{"title":"Above Average Adult Film","rating":25,"date":"25 December 2019","review":"Tropic of Desire (1979)<br><br>*** (out of 4)<br><br>Frances (Georgina Spelvin) runs an infamous whore house in Hawaii and our story concerns a group of sailors who show up to have some fun.<br><br>TROPIC OF DESIRE is considered by many to be director Bob Chinn's best movie and it's certainly a nice little gem. The movie actually contains some good performances, a great production design as well as some very erotic scenes. I was a bit shocked at how entertaining the movie was and how the sex wasn't the main focus in the film.<br><br>I really was shocked at how much detail and development were given to the characters and there are stretches of the running time where nothing sexual is going on. Usually that isn't good in a porno film but the story and characters were so good here that it worked just fine. Of course, there's still a lot of sex on display here and it's quite erotic at time and adds a lot to the story and especially the stuff dealing with a virgin solder.<br><br>As I said, the film offers up some good performances and Chinn really does a nice job in his directing duties. The film certainly isn't going to take a porn hater and turn them into someone who respects the genre but I think fans will have a good time with it.","user":"Michael_Elliott","rank":[3,3]},{"title":"Movie v Porn","rating":8,"date":"29 March 2020","review":"Not the best of movies but, by no means, the worst. Georgina Spelvin was the stand out star, naturally. I suspect it was specifically written for her.\nWhile the overall movie was rather explict, it did not take away from the movie ideal, soldiers and sailors taking advantage of shore leave during WWII, even though it used explict sex as it's modem. As if it never happened.....\nThe nearest neighbour I can think of is Caligula, which featured established stars, (Peter O'Toole, Malcom McDowell, Sir John Gielgud) and an up and coming star (Dame Helen Mirrin).\nIf one is to take like with like, Tropic of Desire deserves to be accepted at least, as a main stream B movie, seeing as Caligula received critical acclaim.\nHad Georgina Spelvin got the breaks she deserved (having appeared in main stream movies such as Sweet Charity, Hello Dolly and Police Acadamy), and had better scripts and direction, I believe she could have been at the top of the B list of actors and maybe even broken into the A list.\nIt is definitely not for all, especially those who cannot stand men and women being men and women however; if one approaches the movie with open eyes, one will not be disappointed.\nI enjoyed the background music, which was of the period. I especially enjoyed hearing Otchi-Tchor-Ni-Ya by Louis \"Satchmo\" Armstrong, which also featured in The Glenn Miller Story. In this movie it was an instrumental, which made it more poignant.\nThis movie is not for all but, it was definitely for me, and open minded viewers.","user":"dcarroll74","rank":[1,1]}]