[{"title":"Much more cleverly funny than advertised...","rating":14,"date":"14 August 2001","review":"I first saw this movie when it came out on video within months of its theatrical release in 1996.  I remember how I laughed much more than I expected.  <br><br>I haven't watched the film until it came out on cable TV recently.  Even though I knew the plot and many of the jokes, I still found myself laughing as hard as when I first saw it.  I was pleasantly surprised that the movie still had an appeal after all these years and many of the actors in the film did a great job without being overly done. Kelsey Grammer, in particular, played a very likeable commander and even though he had the goofiest men under his command, Grammer brought out the best in each of them.<br><br>\nThis movie is much more believeable to watch than any of the Police Academy movies.  Being a former Navy vet myself, the language made sense to me and after watching a super serious thriller like \"U-571\" recently,  Down Periscope still kept within the framework of what is acceptable and believeable within the Navy.  If you haven't seen this film, I highly recommend it for pure entertainment and escapism.","user":"ebe28","rank":[66,67]},{"title":"A very funny and relaxing movie","rating":16,"date":"16 July 2003","review":"Being an ex-submariner on both diesel and nuc boats, I wasn't looking for a true to life Navy movie. I have enjoyed Down Periscope over and over again. Sure, some if not most of the realism of life on a submarine is skimmed over, but this adds to the appeal by creating a simplistic story line that is easy and fun to follow. I swear I knew most of the crew of the Stingray. The excellent cast made for an even more enjoyable movie. I don't want to get into specifics about little things that may not have been correct because that would only serve to detract from what I feel is an excellent movie to enjoy for its entertainment. So sit back, relax and \"Let's kick this pig\"","user":"nabor7","rank":[89,94]},{"title":"Proof that the sum of the parts is often greater","rating":8,"date":"1 September 2006","review":"There was a recent documentary on making movies, that featured a long list of actors and directors talking about what its like to make movies. One common theme was you can have a great script, great cast, the best director and lots of money and still create a bad movie.<br><br>Down Periscope is proof of the corollary to that theory. Not an original or terribly well written screenplay. A few solid actors, but mostly unknowns, and this movie just makes you laugh out loud! It would be easy to just say that Kelsey Grammar carried this movie, but that isn't truly the case. Other character actors, like Rob Schneider, and the hilarious Harland Williams, added significantly to the enjoyability of the film.<br><br>Cast dynamics, or that mysterious \"movie magic\" are really what happened here, creating a film that flows smoothly, has incredibly well executed transitions and line after line of well written and well performed dialog.<br><br>A preposterous premise, lots and lots of technical inaccuracies and just plan silly things that could not happen in the real world, or the real navy, but you just don't care. As a merchant marine myself, I found that the overall feel of the movie, while not plausible, was also not too far off the mark as far as life at sea goes.<br><br>This is a VERY funny movie, a good family film, and, particularly if your a fan, lots of Kelsey Grammar wit, sarcasm and just damn funniness.","user":"Christopher-Peznola","rank":[48,51]}]