[{"title":"PRICELESS....","rating":22,"date":"22 March 2003","review":"First, I liked the script and it benefitted because of the casting too. LL Cool J gives a good performance as \"God\" a ruthless crime lord as well as Omar Epps in a very different role but still manages to keep that street charisma that he has.  Nia Long's character Myra was perfect to draw the line between his police work and his personal life. this also starts Stanley Tucci, Pam Grier, Hassan Johnson and Veronica Webb.<br><br>one of my all-time favorites...<br><br>9.5/10","user":"whoTheFuqRyou","rank":[15,19]},{"title":"imperfect but rewarding film","rating":3,"date":"3 August 2000","review":"Those looking for a rousing shoot-em-up action picture will probably be disappointed by `In Too Deep.'  Those looking for a more low-keyed, subdued and thoughtful study of the realities of life as an undercover cop will, however, find much in this film to admire and appreciate.  Omar Epps stars as a Cincinnati-based rookie cop, Officer Jeff Cole, who goes undercover to nab a major cocaine dealer from New Jersey who calls himself `God,' (played by rapper LL Cool J) and who, Godfather-like, involves himself heavily in familial values and efforts to `help' the struggling members of his blighted neighborhood.  In its exploration of its subject, the film wisely eschews the over-the-top fantasy heroics that afflict so many action films and, instead, tethers itself to the harsh, often ugly realities of the dangerous criminal world in which it is set.  The movie builds much of its drama and suspense by bringing to the foreground the fascinating logistics that go into undercover police work, forcing us to witness first hand the risks, the moral compromises (to be convincing, Cole has to snort cocaine himself, for example) and the psychological ambiguities that invariably accompany the job. <br><br>Cole is a man who has been obsessed from the early days of his underprivileged, slum-ridden childhood with making a difference in a crime-infested world he knows all too well from first hand experience.  This makes him a natural choice for infiltrating this underworld existence since his background has given him the understanding he needs as a point-of-entry. Thus, as he embarks on this new and dangerous career, we see the innate compassion he extends to those caught in the same environment from which he has sprung, an empathy that, in the context of his job, often leads him into a `softness' that clouds his judgment and ends up endangering his life further.  In addition, as he is accepted more deeply into the inner circle of trust that God has set up around himself, Cole begins to question his own loyalties  or so, at least, the offers in charge of him begin to believe. (This, I imagine, is the undercover agent version of the Stockholm Syndrome that afflicts so many kidnap victims, often leading them to transfer their loyalties from their rescuers to their abductors).  <br><br>The screenplay, though it could be sharper and more incisive at times, occasionally achieves substance in its examination of just what happens to an undercover agent's mind when he does indeed get `in too deep.'  In addition, the film frequently achieves moments of genuine suspense, in truly scary scenes involving God's uncontrolled displays of manic violence and torture and in moments when Cole's entire cover seems to have been `blown.' In those moments, LL Cool J hits all the right notes in his performance but, both he and Epps, unfortunately, lack the dramatic and emotional range as actors necessary to make their quieter, more intimate moments effectively credible.  In addition, the dialogue often rings untrue, especially in the conversations among the commanding officers played by Stanley Tucci and, in another weak portrayal, Pam Grier among others.<br><br>With better performances, harder-edged dialogue and slightly more energetic direction, `In Too Deep' might have been a great study of moral conflict set within the context of an exciting policier.   On the other hand, the film could also have been much worse.  As it is, `In Too Deep' respects the seriousness of both its subject matter and its audience and provides a number of powerful scenes - factors for which we are grateful but which also make us yearn for the high quality film that might have been.","user":"Buddy-51","rank":[8,10]},{"title":"Pretty good","rating":7,"date":"7 September 1999","review":"First of all I'll start by saying that \"In Too Deep\" is a watered down version of \"Deep Cover\", but that's not really a bad thing.<br><br>The movie looks, sounds and is acted in a very well put together way. The characters are even memorable, even LL COOL J's \"God\", is really effective. He's a family man, but a notorious and mean gangster all at once.<br><br>The look at what going undercover can do to one's mental well being is a really sharp and involving look. Stanley Tucci, excellent, Nia Long, let her have her own movie,PLEASE!!, Omar Epps as \"J. Reid\", very impressive. And look for Pam Grier, NAS, and a few others.<br><br>A really good African American crime thriller, with heart.","user":"dark 1","rank":[6,8]}]