[{"title":"I'd put it in with the Disney classics","rating":10,"date":"23 November 2003","review":"Aladdin is such an awesome move that still gets me excited to this day, I remember when I was 7 and I saw this in the theater and I just had so much fun. I am such a dork, I still love a lot of the Disney movies that I loved as a kid, but I think the reason that I love Aladdin so much is because this is one of the last Disney movies that was hand drawn animation, the reason I love hand drawn animation is because it feels more personal and that the crew put their heart and soul into it, you can tell by watching it. They got a great cast of voice actors including Scott Weinger from Full House and the always entertaining and hilarious Robin Williams. Robin was just a perfect choice for Genie, he brought a lot of energy to the movie and makes the genie a great character. Who knew that a kid's version of the Arabian Nights tale could be so great? This is a great Disney movie that I guarantee you're going to love.<br><br>On a dark night, when Jafar attempts to access the Cave of Wonders, a magical cave which holds treasures beyond the wildest belief, above all is a magical oil lamp containing a genie is hidden. He and his talking parrot, Iago, learn that the only one who can enter the Cave of Wonders is the metaphorical \"Diamond in the Rough\". Meanwhile, in the palace of Agrabah, Jasmine, the beautiful teenage daughter of the Sultan, must be married before her upcoming birthday, but she rejects every prince she meets, as she wants to be married for true love and not merely for wealth. Later, Jasmine, frustrated with having her life lived for her climbs over the palace walls, and sees the marketplace for the first time, where she meets the street urchin Aladdin and his monkey, Abu, and the two young people are seen to be falling for each other. Jafar uses a machine to see that the \"diamond in the rough\" is Aladdin. Jafar sends a group of guards to capture Aladdin while Jasmine is still with him. Jasmine tells Jafar to release him, but Jafar lies and tells her he is already dead. Jafar, disguised as an elderly man, releases Aladdin from prison and leads him to the Cave of Wonders. They are told by the tiger-shaped head of the cave to touch nothing but the lamp. Aladdin enters the cave and encounters a magic carpet before finding the lamp. Abu tries to steal a ruby and causes the cave to start collapsing, but the carpet helps them to the entrance. Jafar takes the lamp from them and tries to kill them but Abu takes the lamp back and bites his arm, causing him to knock Abu back into the cave just as it collapses. When Aladdin awakens, Abu gives him the lamp which he had snatched from Jafar. After rubbing it, a genie is unleashed, revealing that he will grant Aladdin three wishes. Aladdin dupes the genie into freeing them from the cave without using up a wish. While contemplating his wishes, Aladdin asks the genie to make him into a prince so he can marry Jasmine. Iago later steals the genie's lamp back and brings it to Jafar, who becomes the genie's new master and uses his first wish to become sultan. Jafar then wishes to become a powerful sorcerer, Jafar then keeps the Sultan, the Genie, and Jasmine as his slaves. Aladdin must figure a way to save all of them and make things right again.<br><br>Aladdin is just a great movie that I promise you'll love, it has great characters, beautiful animation, and a terrific and catchy soundtrack that you'll be singing all day. This was one of the rare Disney movies that you pretty much loved ALL the characters, even Iago who is voiced by Gilbert Gottfried, the voice is a bit much but he is great as well. I personally love both the carpet and the genie. Who knew that a carpet could have so much personality? I absolutely adore the \"Friend Like Me\" scene, it was incredible to watch and had terrific animation! If for some odd reason you haven't somehow seen this movie, I highly recommend that you do, this will probably go down in your favorites as well.<br><br>10/10","user":"Smells_Like_Cheese","rank":[98,104]},{"title":"My favorite animated movie.","rating":10,"date":"21 February 2020","review":"From start to finish, Aladdin is timeless classic! Very funny, very exciting and intense, amazing visuals, and excellent pacing! The story is also amazing, as are the characters. Holy crap do the characters in this movie rock! They all play a very important role in the movie. You have Aladdin and Abu as two fearless adventurers/thieves, Jasmine as one of the best and most charming Disney princesses of all time, Jafar as the highly cunning, intelligent, and awesome sorcerer and one of the best Disney villains of all time, Iago, who has to be the best henchman of any villain in any movie (he and Jafar are the best together), and of course, the Genie. From his design to his style to pretty much everything there is about him, he absolutely steals the show! From the moment he appears during the movie, he is just seems so much like the the star of the movie. Robin Williams as the Genie is one of the best performances in any animated movie. Aladdin is such an awesome movie that I can't give it anything other than 10 out of 10","user":"MR_Heraclius","rank":[36,37]},{"title":"This film is so good!","rating":10,"date":"13 May 2005","review":"I grew up watching this film and along with Beauty and the Beast and Cinderella it is one of my favourite Disney films. I love it! Robin Williams is so good in it. He's hilarious. This film isn't just for kids but for the whole family. I think I was about 5 when I first saw it and at 14 I still watch it and so do my parents. I haven't seen the sequels because I heard that Robin Williams wasn't in them and decided that they wouldn't be as good without him. He was made for the part. The songs are amazing. I love singing along to \"A Whole new World\". I'm hoping to get the soundtrack soon. I also love the film because I have the same name as the princess in it! I would definitely recommend it to everyone. You're never too old to watch a classic Disney film.","user":"British_Aussie_chick","rank":[130,145]}]