[{"title":"Speed 2: Snooze control","rating":3,"date":"7 April 2003","review":"Now I liked Sandra Bullock in the original Speed. I even liked her in that film where she went into a beauty pageant. But in this monstrosity, I just wanted to slap her repeatedly and say \"What are you doing!?\"<br><br>She is just dire. Not in acting (well... any more than usual, anyway) but just in the way her character made you want to shake her until she regained some sense. Whoever was responsible for the script needs a good beating here. Unless I am completely mistaken, her character between the events of the first film and this one, turned into a complete and total airhead bimbo.<br><br>Add in Jason Patric (who will never be leading man material) and it seems that only Willem Dafoe was having any fun. Truly awful!<br><br>But it is good to see that ocean liners, which may have to weather tropical storms, apparently have windows made of glass so easy to break that anyone can hurl themselves through them on a whim. Priceless cinema.<br><br>Avoid this one if you liked the original.<br><br>Avoid this one if you expect a thrilling sea drama.<br><br>Avoid this one if you like Sandra Bullock.<br><br>Avoid this one if....well....just avoid it.","user":"Rob_Taylor","rank":[141,168]},{"title":"You'll know why Keanu turned down this crummy sequel when you see it","rating":2,"date":"2 March 2007","review":"I was so curious as to what they would do in the sequel of Speed, I just watched Speed today and absolutely loved it! So, I can understand why Keanu turned down the movie, first off not only the script was bad, but the coincidences were beyond ridiculous of Sandra Bullock being in the same position twice and Jason Patrick?! He was so scared of doing a great movie like The Lost Boys, but yet he couldn't hesitate to do this movie? The movie just lost it's course and didn't work on any level, if it had different characters, maybe, but these great actors should know better and check twice before signing onto these sequels.<br><br>Annie is with this new policeman, Alex, and he surprises her with cruise tickets. He is planning on asking her to marry him, but that is shortly interrupted when Willaim Defoe is now the super duper bad guy. He is upset that he designed the ships computer system but gets no credit, so guess what? He decides the best way to avenge this is to blow it up! But with Alex on board... yup... you guessed it, he's gonna stop William and save the day! Good for him! <br><br>Speed 2: Cruise Control was just a money maker that is truly a fake movie that was really sad. The acting was really bad and Sandra's character went from admirable to just plain annoying. Alex had no character or any sympathy. The explosions were lame and the plot was just beyond unbelievable, poor William, he was probably on medication when he said yes to making this movie. Well, just please stay away from this movie, it'll be a waste of your time.<br><br>2/10","user":"Smells_Like_Cheese","rank":[54,65]},{"title":"Made worse by the knowledge of the brilliant film it succeeds","rating":11,"date":"11 January 2004","review":"Having long since broken things off with her boyfriend, Annie and her new beau plan a romantic holiday on an ocean liner.  When onboard a disgruntled ex-employee of the liner disables the computer controls and sets it on a collision course while he escapes with his goods.  Alex has to take him on and try to stop the ship as it `races' out of control.<br><br>As if Twister hadn't done it already, Speed 2 basically showed us that the potential that was shown by De Bont's debut was clearly misplaced and he has yet to show he was really anything other than in the right place at the right time when it came to Speed.  The smell of desperation is in the air from the very start when Reeves declined to star, although Bullock was more desperate and did it.  This caused Annie to repeatedly state that `relationships built on etc etc never work out', all in an effort to explain it away and help the audience move on.  That the film is constantly harking back to a much better film is a big problem, it would almost have been smarter just to move totally away than to retread.<br><br>The plot is plain silly and never gets close to being involving.  To demonstrate this, I never once gave a rats' ass what was happening - people got crushed by the boat and mangled in it's propellers (unseen) but the film (or me) never care and never lingers.  Likewise the supposed big climax is unengaging and smacks of desperation - bang for buck and all that.  The whole set up never really feels immediate or threatening, even when the boat swings out of control it is difficult to feel terrified as the boat slooooowly goes towards the tanker, worst come to worst people can jump off to safety.  The cruiser setting also is daft when seen beside the bus concept - the vast majority of the audience will ride a bus quite often, very few of us can relate to an ocean liner!  The speed is a problem and it is almost laughable it works so poorly!<br><br>The cast is another problem.  Bullock tries to repeat her sparky performance from the first film - when she manages it, it only feels like an impression, when she doesn't manage it she is cast as a shrieking beauty needing saving. However she also struggles from a lack of chemistry with Patric.  It is a shame as he is an OK actor but not used to a pure action role and not used to not having material to work with.  He lacks charisma and is quite unconvincing.  Dafoe is awful; he drags the film down as much as anyone. His villain is a joke and never threatens in the way that Hopper's did (who managed to be funny and scary).  It is a bad impression all round.  The support cast of `innocents in peril' do much the same as the ones on the bus did, but we care less about them - they are well off and are separated from the action; those on the bus were in the thick of it and `normal' people who we could relate to.<br><br>Overall this is as good a reason for not making unplanned sequels as any - there should be a board to approve all sequels to prevent cashing in!  The memory of the original is cheapen by this nasty film that is uninspiring and unthrilling at best, dull and stupid at worst.  De Bont never gets up a decent head of steam and he shows his inability to inject drama out of his own skill - anyone can point a camera, not everyone can (or should) direct. A dull 2 hours later, I was wondering why I wasted my time with a film that was so clearly all at sea.","user":"bob the moo","rank":[56,71]}]