[{"title":"Magical Fun","rating":13,"date":"13 June 1999","review":"This is a \"fun\" movie, surprising and funny but much more for adults than children- it's too scary and graphic for little ones.  Sandra Bullock and Nicole Kidman give star-powered performances- both deliver the goods here and you'll enjoy it whether you're fans of them or if you're not. They're simply charming and as much as people may want to dislike Kidman for being Ms. Cruise, she again proves she's a star in her own right.<br><br>Forget the critics and the Be-faithful-to-the-book drones, this is a good movie- hip, edgy and sometimes spooky.  If this was a movie made by two unknown actresses, it would be a \"gem\" critics would recommend to audiences, but for some reason with Bullock and Kidman, it gets reviewed on a different scale and ends up short for people.  Forget all that- it's great entertainment with yes, two pretty big stars- but they can't help that so get over it and enjoy the movie for what it is- a real \"gem.\"","user":"heir","rank":[77,91]},{"title":"Loved it","rating":9,"date":"2 May 2002","review":"Normally I don't care for chick flicks, but I can't seem to stop watching this one over and over again.  I was surprised that so many others didn't care for it.  I just loved the sets, the costumes, the women and their relationships, the real magic in the film, the special effects, the child actresses.  This was stuff that women could relate to better than men. Aidan Quinn was the only boring part of the movie.  I wished they'd chosen an actor who was more into the role.  He seemed bored and made his part in the film more boring.  (Also, he mumbles.  Someone should give him elocution lessons.)<br><br>This movie wasn't meant to be heavy.  It was meant to be light, fun fluff, and that it is.  The characters weren't meant to be deep, but I felt the relationship between the two sisters was deeper and well performed by two skilled actresses.  In spite of the fluffiness of it, I enjoyed the two scenes in which we got to sit and relax to the sound of Stevie Nicks' \"Crystal.\"  So what if cars weren't crashing and guns weren't shooting. They weren't supposed to be.  I felt the camaraderie of the moment as the two sisters and their aunts got drunk on \"midnight margaritas\" while dancing to Harry Nilsson's \"Lime in the Coconut.\"  It was just plain light fun. Also, women can enjoy the vicarious satisfaction of watching these women destroy the evil, bullying man who tries to destroy them. <br><br>\nThe end of the film was rather Disney-kiddie-flick-like.  Another ending might have worked better, but it was tolerable because it reminded the audience that the film was all in fun, and not to be taken seriously.<br><br>I usually prefer deeper films, but I thoroughly enjoyed this piece of fluff. Sure it was silly and campy, but it was fun.  A film doesn't have to take itself seriously to be fun.  Bullock, Kidman, Channing, and Wiest are beautiful, charming and wonderful to watch in this flick, and I love watching the four of them over and over again.","user":"lllama","rank":[59,70]},{"title":"A Wonderfully fun movie","rating":7,"date":"7 March 2003","review":"This movie is one of my favorites - I love watching it.<br><br>\nI have to agree with the remarks by AshIsTheGal and Warlen. Nicole Kidman had never been one of my favorite actress either, but I loved her in this movie (as I did Sandra Bullock). The real standouts though were Stockard Channing and Diane Wiest - watching them perform was almost worth the price of admission itself! They are wonderful.<br><br>I don't see this movie as being about magic or witchcraft, the romance between Sally and Gary Hallet or even Jimmy Angelov chasing Gillian (which is a huge catalyst - but not really any more than that). For me, this movie is really about the relationships between sisters and women (the Aunts Franny and Jet, Kylie and Antonia, the Owens' women and the townswomen and of course, between Sally and Gillian - both young and adult).<br><br>All of the actresses had a great chemistry, but I couldn't believe how well matched Sandra Bullock and Nicole Kidman were. I felt that their bond was very believable and I loved watching their relationship to each other (and themselves) grow and mature as they went from being children to adults.<br><br>I certainly don't think that this film will appeal to everybody, and I can see why so many people \"don't get it\", but if you watch it more for the relationships between the women and not so much for the romance angle or the magic I think that you will really enjoy this movie. I thought that the romance and magic were handled very well, I just saw them as being secondary to the real story. Also - it has a wonderful soundtrack.<br><br>I read the book after seeing the movie, and while there are many changes between the two, I really enjoyed both. I thought that the changes made to the movie made for a better movie overall.<br><br>All in all, a very enjoyable movie. I highly recommend it.","user":"praxagora","rank":[28,32]}]