[{"title":"Has 'cult classic' written all over it.","rating":11,"date":"11 March 2001","review":"This movie caught me by surprise: I worked in a video store, and one day we got a preview tape of this movie, prior to its video release. I hadn't heard much about it, so I watched it, and was quite surprised at how enjoyable it was. Since then, I have seen the movie about ten more times (at least), and still get a kick out of it.<br><br>Tremors is basically a landlocked variation on 'Jaws' and those 1950s giant bug movies: the isolated town of Perfection, Nevada (population 16), finds itself under seige by four monstrous, subterranean wormlike creatures, that hunt by sensing vibrations in the ground. The plot revolves around the townspeople trying to outwit and escape the creatures (dubbed 'Graboids'), which are tearing the town out from under them.<br><br>What really makes the movie work is the characters: all of them come across as real people trapped in an insane situation, and all have a lot of charisma, even though the film doesn't have tons of character development. Kevin Bacon and Fred Ward are a hoot as a pair of low-rent handymen who become reluctant heroes. The byplay between the two is a lot of fun.<br><br>Usually movies like this revolve around stupid people doing stupid things, just to raise the body count. Tremors is different: the characters react believably, and do smart things to try and escape and/or kill the Graboids. The creatures too are also fairly smart, and are not just mindless eating machines with no brains.<br><br>Given its premise, Tremors is not a gory or violent film (although it has a couple of minor gross bits), and has a very good sense of humor. The film-makers are aware of their far-fetched premise (a couple of key questions go unanswered), but they treat it with respect and a certain amount of affection.<br><br>Tremors didn't have much life in theaters, but has become something of a 'Midnight Movie' on home video, with definite cult possibilities. Check it out, and don't be surprised if you end up buying it.","user":"Wez-1","rank":[136,146]},{"title":"Surprisingly enjoyable good old fashioned monster movie!","rating":16,"date":"16 October 2002","review":"On paper I would have expected 'Tremors' to suck - a low budget sci fi action comedy written by the 'Short Circuit' guys, and directed by a hack who went on to make 'City Slickers'. It doesn't exactly inspire confidence, does it? But if you put your prejudices aside you'll find that this is a surprisingly enjoyable good old fashioned monster movie. There is humour here, sure, but thankfully the movie doesn't go for a camp, tongue in cheek parody style, something for me that almost never works. The movies real strength is the perfect casting of Kevin Bacon ('Diner') and Fred Ward ('Henry And June') as the small town handymen turned reluctant heroes. They are supported by the left field but inspired casting of 'Family Ties' Michael Gross and country singer Reba McEntire as a couple of gung ho survivalists. 'Tremors' succeeds in what it sets out to be, an exciting and wonderfully entertaining b-grade horror thriller. A lot of fun and highly recommended.","user":"Infofreak","rank":[118,129]},{"title":"The BEST B-movie in the 1985 to 1995 period, if not even longer !","rating":10,"date":"31 August 2007","review":"\"Tremors is a flawless film\" wrote another commentator on this site and he's damn right ! What a movie ! I've missed it in the cinema, because over here in Europe, this maybe played in Vienna in 2 theaters for one week and hardly anybody catched it. But some time later, maybe 1992, 1993 it was shown on TV, some midnight cheapie, I thought, but watching it, it scored bullseye, I was glued to the TV-set.<br><br>Have seen it 3 or 4 times since then and it's an amazing joy to see this again and again and again and ...<br><br>Why ? First the storyline is simply simple &amp; fantastic &amp; brilliant. The perfect homage to the B-movies (you know, Tarantula et. al.) of the 50ies and 60ies. Even better than they were/are.<br><br>Ron Underwood must have seen maybe all these B-flicks, at least most of them, and captured the essential elements of this genre perfectly. There is NOT ONE WRONG SCENE in this, it works, from start to finish, like THE master-thesis for the \"giant creatures are trying to kill us\"- :-)) genre. If Tarantino would have made this, he would be hailed to the hall of fame for it (where he is anyway, but then again, isn't this one mucho better than Death Proof, e.g.?).<br><br>The dialog is extremely casual/leisured/funny, always on the spot. Cleverly photographed, funnily written, without being stupid for just a second.<br><br>What makes this so very special is the relationship between these two slackers, Kevin Bacon and Fred Ward. One younger, one slightly older, the chemistry between them is fantastic, the really seem to have spent all their lives together in the backyards of rural America. Their looks, the dialog, their mimic, all unmatched in the last 20, 25 years of US-cinema.<br><br>TREMORS was Ron Underwood's first feature and none of his later efforts does come even close to it (actually he made just unmemorable schlock later). But this one picture will get him recognition far beyond his earth-days, I bet ! TREMORS poures love &amp; total respect for the genre from every frame ! I bet Ron Underwood, who was 37 when he directed this masterpiece, must have dreamed of making this movie for a decade or even longer, that's why it is so superbly developed, so perfect, so flawless.<br><br>Watch it, love it, watch it again, I bet you will ! :-))","user":"wmjahn","rank":[76,84]}]