[{"title":"Winning performances","rating":25,"date":"25 October 2004","review":"This is a lovely, small film with beautiful performances by Brenda Blethyn and Marianne Jean-Baptiste. It is filled with comical moments that balance out some of the heavier parts of the film. My heart went out to the two lead characters as they struggled to make sense of the mutual bond unearthed by Ms. Jean-Baptiste's character. At once confused, hurt, shocked and afraid, Ms. Blethyn is completely convincing in her role. I was moved by her decision to enter into a relationship with this woman whom she had never before met. Perhaps the fact that Ms. Blethyn and Ms. Jean-Baptiste had never been introduced prior to the scene in which their two characters meet added to the realism of that moment. And Ms. Jean-Baptiste's portrayal of a woman who is surprised by her discovery and not a little disappointed was dead-on, as is her dogged determination to get what she came after. <br><br>If you are searching for a movie brimming with action, special effects, and/or blockbuster stars you need to pass this over. But if you are in the mood for a film that offers winning performances and an entertaining storyline that grows out of human interaction, this is the one you're looking for! \"Secrets &amp; Lies\" is a gem of a movie!","user":"mjn1957","rank":[70,74]},{"title":"A great layering of memorable characters","rating":30,"date":"30 October 1999","review":"It took a second viewing of Mike Leigh's 'Secrets and Lies' to reveal the depth of its genius.  I love character-driven drama, and this film succeeds in creating indelible portraits. Even the social worker is quirky and memorable instead of just furthering the plot and being patently sympathetic.<br><br>I could write quite a lot about Blethyn's riveting performance. How drained she must have been after sustaining a character who seems always at the height of emotional pressure.  Opposite her, Jean-Baptiste seemed as cool and smooth as could be. The contrasts created by these personae even extended to costume and decor.<br><br>I decided to watch this movie again because after a BBC Shakespeare binge I wanted to see everything Ron Cook has been in.  And while the Stuart scene is really somewhat incongruous to the rest of the family plot, Cook's scene as the bitter, drunk 't****r' works for me perfectly.  So do the scenes of photo sessions -- and it's a matter of observing this film in terms of clarity of personal vision.  The occupations of photographer and optometrist seem to lend metaphors of spirituality -- for Maurice, the ability to see people as they are, and for Hortense, the ability to understand how others see the world. The wall of smoke that Cynthia and Roxanne seem to keep in front of them.  The disparity between the images created for the formal portraits and the truth of the personalities in them.  In a distinctly un-sappy way, Leigh has explored the old adage that \"the truth will set you free.\"<br><br>If one reads a paragraph describing the main plot -- the adopted child seeking out her birth mother -- a very clear idea of a movie-of-the-week story comes to mind. 'Secrets and Lies' is nothing like that, and shows a mastery of vision and a cast of great talent.  My roommate agreed, saying he thought this was one of the best films he's seen this decade.","user":"Annyerism","rank":[97,105]},{"title":"Honesty & Integrity","rating":10,"date":"3 June 2004","review":"This is one of my very favorite movies of the last 10, even 20 years.  For me, its greatness lies in the resonance of the story lines, the brilliant acting, (Brenda Blethyn, Marianne Jean-Baptiste and Timothy Spall all turned in Oscar-worthy turns, and the rest of the ensemble were all with them), and Mike Leigh's direction.<br><br>This is a feast of tremendous acting, by a most talented ensemble who really become their characters.  The scenes play out very naturally, and you really feel a part of the story, with special empathy towards - in no particular order - Cynthia, Maurice and Hortense.  As the film builds towards a showdown/climax at the birthday party, you can even take a step back and at least sympathize with Roxanne and even, Monica.  <br><br>This rates 10/10 by this reviewer, who wishes that more directors - if they truly have a good story to tell - will shoot and edit the film in a way that appreciates the audience's intelligence and capacity to feel without being manipulated by a director's avant-garde(??) bag of tricks ...for comparison, perhaps see my scathing review of 21 Grams! What a contrast of styles!!!","user":"wainot","rank":[72,80]}]