[{"title":"Dead Man's Last Words","rating":12,"date":"12 November 2008","review":"Tim Robbins's 'Dead Man Walking' is a brave piece of cinema. Though the film is about a man on death row and a nun's struggle to help him, I liked how he presented both sides of the central theme of capital punishment. This isn't a preachy film about capital punishment being wrong or right as I doubt one's opinion would change on that after watching the movie. But, it's more of a subtle movie that tells the story of two people who form an unlikely friendship.<br><br>This couldn't have been an easy film to make yet he manages to pull it off. Poncelet is a ruthless murderer and in no way does Robbins condone what he has done but he and actor Sean Penn manage to win Poncelet the viewer's sympathy. The execution is terrific. The last scene particularly stands out. We see, in flashback, what had happened while Poncelet meets his ultimate fate. We see how he and Helen make the final connection, we see remorse in his eyes, we see him dying a slow death and at the same time the horror of the crime is exposed to us. We know that what he did is unforgivable but he finally took responsibility for that which allows us to see him as a human being rather than a ruthless killer. This also makes the whole tragedy more astonishing because you just ponder, like Sister Helen, on how such a normal human being commit such a heinous deed? <br><br>Both Sean Penn and Susan Sarandon deliver powerful performances. We pretty much see most of the film from Helen's point of view. Sarandon clearly has put a lot of heart into the role as she skillfully downplays her part showing tremendous depth and pathos. Sean Penn plays his difficult complex character with ease. The supporting cast do well (watch out for a young Jack Black and Peter Sarsgaard).<br><br>The score is mesmerizing, especially the Nusrat Fateh Ali Khan tracks. I also felt that sense of isolation that was brought out in the prison scenes. The terrific writing grips the viewer's attention right from the start. Even though we can predict Poncelet's fate, we are drawn into the fascinating transforming journey of these two intriguing characters.","user":"Chrysanthepop","rank":[49,55]},{"title":"Watershed","rating":26,"date":"26 March 2000","review":"I haven't seen many films that really, truly made me rethink a long-held position or opinion on a thorny issue, but \"Dead Man Walking\" is one of them.<br><br>I read Sr. Helen Prejean's book, upon which this film was based, when it first came out in 1993.  At that time I was utterly supportive of capital punishment -- to quote the script, I felt anyone who committed crimes horrible enough to land them on Death Row was an \"expendable human being, suckin' up tax dollars.\"  I also had personal experience with the issue when an entire family whom I knew in my childhood were slaughtered by a man who is now on Death Row for his crimes.<br><br>As you might imagine, I was disgusted with Sr. Helen's book.  I thought that trotting to death row and holding the hand of some scumbag who'd killed innocent people was about the lowest thing anyone could do, and as a Catholic I was offended by the seeming hypocrisy of it.<br><br>Because I had disliked the book, I never saw the film until about two weeks ago, when I bought a remaindered copy of it in a video store.  I have watched it four times since then, mostly because I am trying to work out my feelings on it.  I am still a supporter of capital punishment, but it's going to be less easy for me to ignore the fact that (to quote again), \"There's nobody with money on Death Row\" -- and quite a few more blacks, now that I think of it, AND the fact that, like Matthew Poncelet's character, the men who are being executed are human beings who have feelings and fears. It's easy to jeer at Matthew on the day before his execution, fretting nervously about whether the lethal injection will \"hurt,\" like a little boy at the doctor's office for a penicillin shot, since his victims' last moments certainly \"hurt.\" What isn't easy is to realize that while the victims of these inmates didn't know they were about to die until it was too late, the inmates themselves have what seems like a blessing at first, but upon deeper examination is the greatest curse:  knowing the exact hour and day they will die, and having to face it day by day, hour by hour, minute by minute.<br><br>I'm sorry if this review offends people who are sincere death penalty supporters.  I still consider myself to be one, but my thinking has been reformed somewhat and I'm more ready to listen to the opponents and try to make compromises; maybe that's what this issue needs more than anything.  I will say finally that ONE part of this film did offend me as a Catholic: the symbolic \"crucifixion\" of Poncelet during the \"last words\" scene.  That was the one place where Robbins strayed from his even-handed approach to the issue -- the only one I could find.<br><br>In all, this was a fine film that made me rethink an explosive issue, and I recommend it highly to anyone debating the pros and cons.","user":"Vibiana","rank":[61,74]},{"title":"Amazingly objective and moving","rating":10,"date":"12 March 2001","review":"I'm astonished how a filmmaker notorious for his political left-wing fervor could make such a subtle, non-sanctimonious picture. If you're for capital punishment, you'll still be for it after seeing this. If you're against capital punishment, you'll still be against it. But whatever your stance is, this movie will, at the very least, make you reflect on why you feel the way you do. There's not one false note in the film.","user":"garpo","rank":[91,124]}]