[{"title":"John Guare's Children","rating":9,"date":"29 June 2005","review":"A writer at the centre of one of the most elegant, entertaining, thoughtful and soulful tales to come out of Hollywood in a long, long time. John Guare's children are based , it seems, on real life people. How lucky for Guare to have found the great Fred Schepsi as their perfect foster father. Will Smith plays a man without identity, choosing one for himself, with such care, with such gusto that everyone remains enthralled, first of all us, the audience. Stockard Channing's Ouisa discovers a new side to her own self in front of our eyes. It is a performance of guts and beauty. Donald Sutherland's Flan is a first for the movies, we've never met a character like him on the screen. The scene in which he listens to Will Smith's Paul explain his thesis is a triumph. We see Flan falling in love. It is chillingly beautiful. Then, of course, the aforementioned Will Smith, he moves with a borrowed self confidence, like his character and it's impossible not to love him. He has the elegance of a Cary Grant and the charisma that we all now associate with Will Smith. I only regret that he didn't go for the kiss. That would have completed the shocking sum of all his parts. I love this film. I love John Guare for writing it. I love Schepsi (he's an old love of mine \"Cry in Dark\" \"Plenty\") The superb editing, the wonderful tangoish score and the work of the production and costume designers makes \"Six Degrees of Separation\" one of the most rewarding movie experiences. On this terrible summer of World at Wars, New Batmans and some other horrors, do yourself a favour. Rent the DVD and stay for dinner at home with the Kittredges.","user":"don_agu","rank":[106,129]},{"title":"'I want life to be experiences, not just anecdotes'","rating":10,"date":"7 October 2005","review":"SIX DEGREES OF SEPARATION is an outstanding play transformed to the screen with dignity but with a script that keeps us in the live theatre instead of in a motion picture. Not that that is a bad thing: the script by John Guare is brilliant. It simply seems a little static, with its marvelous plays on words, repeated phrases, and disjointed movements significant unto themselves but not really taking advantage of cinematic possibilities of flow.<br><br>Essentially the tale of how a married couple who deal art (Stockard Channing and Donald Sutherland - both in peak form) are so caught up in their superficial lives that they are taken in by a handsome young African American con artist (Will Smith) whose various antics bring the couple round to reexamining their shallow existence. Most of the story is related over art dealings and dinner conversations and are peopled by such luminaries as Kitty Carlisle, Ian McKellen, artists Chuck Close and Kazuko, Mary Beth Hurt, Bruce Davidson etc - a really fine ensemble. There are many social comments clustered in this story and it continues to play well after its origins on the stage and fifteen years after the movie was made. This was one of Will Smith's entries into film as well as one of the gifted Stockard Channing's finest roles. Highly recommended for repeated viewings. Grady Harp","user":"gradyharp","rank":[75,93]},{"title":"Absorbing script and performances","rating":8,"date":"5 June 2003","review":"This is the film that made even the most harshest critics admit that Will Smith had real potential as far as being a serious actor is concerned. This is the story of a young gay hustler named Paul (Smith) who knocks on the door of Ouisa and Flan Kittredge (Stockard Channing and Donald Sutherland) and tells them a story of being mugged and also being the son of Sidney Poitier. He says he knows their children from college and remembered they lived there so thats why he came. After a lot of talking and impressing them he cooks them a nice dinner and they invite him to spend the night. They also loan him money but in the morning they find him with another man and they kick everyone out. The Kittredge's talk to their friends and find out that they all encountered Paul as well but were afraid to say something because they were embarrassed. The films title refers to the fact that we all know everyone by six people or degrees. The main focus of the film deals with how this young man made these characters take a good hard look at themselves and the relationship they have with each other and their children. The writing is very sharp and for most of us what is being said onscreen can easily go over our heads. Its a very intelligent script that forces the characters to see things that they seem to take for granted. Directed by Fred Schepisi who has shown a real knack for filming plays before and he also has shown to be very good at making films that are more character oriented. I remember one of his first films from the 70's called \"The Devils Playground\" and was impressed at that time by his direction. What really stood out for me though were the performances. Will Smith seems to tackle this complex script with an all to easy manner. As I watched his performance it was clear that he really understood the script and his character. You don't see that everyday from such a young actor, especially one that has limited training. But for me the best performance comes from Stockard Channing who was in the play as well. She's always been a very strong actress and a very underrated one at that. While watching her character in this film Channing does a wonderful job of allowing the viewer to watch her characters attitude change from the first scene to the very last. It really is Channings film and she received a well deserved Oscar nomination for it. Its one of the best in her career and its the driving force for the film. Casual film watchers may be put off by the sharp dialogue at first but I hope they stay with it, its a very good film about self realization and all the actors here are terrific.","user":"rosscinema","rank":[56,71]}]