[{"title":"Unforgettable","rating":8,"date":"8 November 2004","review":"Lars von Trier's Breaking the Waves is the kind of film that makes me proud to be a film-goer and exceeds anything I could have possibly expected from the man who made Element of Crime. That film had some clever experimentation (and so does this one) but this film is the kind that's beauty and power echoes in your mind hours after you've watched it. This is a flabbergasting work of art that portrays a woman's quest to please God and does so with the complexity and emotional power of a Bergman film (not to mention the fact that the film portrays a woman's intense suffering in world sternly ruled by men with the power of a Dreyer film). If von Trier made nothing else of any merit for the rest of his career, if all he did was make marginally interesting film experiments, I wouldn't hesitate to call him a great filmmaker on the soul basis of this film. Anyway, you get the picture The film stars Emily Watson as Bess, a shy and neurotic girl who is filled with joy to be with her new husband Jan (Stellan Skarsgard who is exceptional). When Jan is paralyzed after an accident at the oilrig he works in, he is in danger of losing his life. He convinces Bess to see other people and Bess wants nothing more than to make him happy and to prove to God that she loves him. After some disastrous complications, Bess is led to believe that she can please God and save Jan's life by having numerous sexual encounters with strangers in town. This sounds like a grungy tale, but von Trier tells it with such humanism and focus on his themes that we never feel like he is rubbing our faces in drear. And Watson is delightful, frightening, and heartbreaking as a woman who will stop at nothing to please those around her. Her one-sided conversations with God (in which she looks up in the air submissively and pleas and then looks down with a deep voice of wrath and scolds) are both funny and sad, not to mention the fact that they reveal seemingly endless amounts of details about who she is. The film is made with a hand-held camera and a visually stunning solarized style. This style does not make the movie; it just adds richness to each scene in the way it gives each face such shadowy texture. In the end, von Trier seems to believe in God but does not believe in the churches that try to codify what he wants. All of this works because of von Trier's passionate desire to understand how one can please God under horrendous terms; the epilogue, that takes the already-great material to a new level and shows how inspired von Trier is, starts with a moment of sad irony and then leaps to the skies with an image that fills the most atheistic person with questions and the more religiously spiritual people with hope. Here is a film that reaches for the stars and makes it there.","user":"butterfinger","rank":[142,171]},{"title":"Second Time Viewing-Still Powerful, Disturbing, Rich","rating":10,"date":"21 March 2004","review":"Director and writer Lars von Trier's 1996 \"Breaking the Waves\" received much attention worldwide when initially released.  Commentary reflected the high degree of polarization this long, engrossing and deeply disturbing Indie film created.  I saw it when it first briefly hit Manhattan theaters and last night I watched the DVD release, reabsorbed in its intricacies.<br><br>Emily Watson's portrayal as young Bess McNeill is the most powerful performance of a career still in the ascendancy.  Bess lives in a small Scottish village by the sea, away from any center of culture or heterogeneity.  She has no job and she appears to volunteer her services as a janitor at the church which her family attends. It is the dominating religious, social and - I suspect - political entity in the area.<br><br>Bess has one friend, a woman who becomes increasingly important both to her and the story, nurse Dodo McNeill, widowed wife of Bess's brother. (Katrin Cartlidge, a truly gifted and beautiful actress, is Dodo.  A tragedy, she died in 2002 of pneumonia barely into her forties.)<br><br>The movie begins with Bess asking, apparently, for permission to marry an \"outsider.\"  She receives, in church, grudging authorization to wed Jan, a worker on an off-shore oil rig (the always interesting Stellan Skarsgard). We're never told how she met him but the church scene immediately and succinctly conveys the fear and, indeed, near loathing the male religious oligarchs have of anyone entering their closed and tightly controlled community.<br><br>Jan and Bess wed in a ceremony followed by a party where some of Jan's hard drinking work pals attend but hardly mingle with the lemonade-sipping locals (there's a very funny chug-a-lug competition that highlights the dividing lines neatly).<br><br>Bess is not only a virgin, she's never seen a naked man before.  Her initiation into sex is rather a success and her love for Jan deepens as rapidly as her new found lust for vigorous and frequent love-making.<br><br>Jan suffers a near fatal accident on the rig and is flown back to hospital. It doesn't take long for the doctors to determine he's permanently paralyzed from the neck down.  Dr. Richardson (Adrian Rawlins) becomes chief physician not only to Jan but to his disconsolate wife who prays for a miraculous recovery while remaining devoted to her husband.<br><br>What happens next is the plot twist that has fascinated many and repelled quite a few.  Jan, knowing that physical intimacy with Bess is impossible, asks her - no, really implores her - to take on any number of lovers AND report back the details of her trysts.  After a hesitant and almost funny start, she complies.  As her sex life accelerates any humor evaporates.<br><br>The results of the ongoing experiment in vicarious lovemaking for Jan and for Bess, sinking way beyond her depth, are disastrous.  She slowly elides into a twisted caricature of the personality envisioned by Jan.  Communal rejection is not far off.  And this in a community where membership in the church is the sole indicium of civic and personal legitimacy.<br><br>Some critics and viewers described Bess as retarded or simple from the beginning.  I found her to be naive and inexperienced, the kind of sheltered person for whom marriage to a man of broad experience and unfettered sexuality is boundlessly liberating.  Bess's inevitable penance does not stem from any interior failing of her's. It's the \"game\" urged on by Jan that exposes her to the venomous wrath of religious fundamentalists whose innate need to condemn and consign to hell (literally and volubly) is beyond Jan's imagination.  Whether his desire that she engage in sexual escapades really reflected his belief that it would make him feel better or whether this was an evolving pathological caprice on his part (and both views have strong adherents here on IMDb and elsewhere), he did not foresee the resulting debacle.<br><br>On several levels von Trier has mirrored, through powerful acting and awesome direction, that small, closed society whose fundamentalist interiority is a microcosm of the hatred that blind, non-humanistic religion often brings (it's easy to see the stern, unsmiling, dogma-obsessed church leader as a modern incarnation of the sixteenth century's John Knox of Edinburgh).<br><br>Von Trier won't let Bess escape as her situation worsens. Dr. Richardson and Dodo first ask and then beg her to abandon her self-destructive and now publicly shocking behavior.  There is a sense of classical tragedy in the painful unfolding of Bess's mental and physical deterioration.  She can't curtail her conduct because of her absolute devotion to Jan and her community can't and won't understand or forgive her.<br><br>The resolution is wrenching but also uplifting with the suggestion that Bess's acts reflect good in a pristine sense.  It's not meant to be realistic but to deliver, I felt, a needed moral lesson.<br><br>\"Breaking the Waves\" isn't for everyone. It does showcase brilliant acting and direction in a fable that has some very uncompromising arguments about a religious dominance which only concerns itself with a believed afterlife, caring nothing about addressing the pains of living and administering to its sufferers compassionately.<br><br>10/10","user":"lawprof","rank":[90,109]},{"title":"Incredible and Powerful Film","rating":10,"date":"15 August 2003","review":"Initially, this story about the marriage of young Scottish woman and a Scandinavian oil rig worker had my eyes glazing over.  I was ready to hit the eject button about 20 minutes into the movie. But I held in there and slowly was drawn in to their lives, their environment, and the ghastly tragedy that confronts them.  <br><br>Lars von Trier is a very patient storyteller, as well as being an eccentric movie maker. In Breaking the Waves, he slowly, very slowly unfolds his drama. The problem is; you have to pay careful attention, and this can be difficult. Von Trier's style, with its hand-held camera, lack of artificial lighting, grainy photography, and lingering close-ups can try the patience. The movie is also long, clocking in at about 2½ hours. But if you see it through, the final half hour will blow your mind, and you will have seen one of the best (and most emotionally powerful) movies of 1996, maybe even the whole decade.","user":"gbheron","rank":[101,124]}]