[{"title":"Woody and Wesley when dey was cool","rating":8,"date":"12 March 2005","review":"Undeniably Hoosiers would get the win, if they ever polled film buffs and critics asking what the best movie is revolving around basketball. Hoosiers, the movie about a failing Indiana high school basketball team being led to success by their new coach played by Gene Hackman and the drunken assistant coach (Dennis Hooper) has enjoyed its fair share of the spotlight. Granted the field of movies about basketball isn't nearly as deep as say movies with plots concerning baseball or boxing, Hoosiers still generally beats out what little competition there is.<br><br>However in my opinion the best movie to ever capture the game of hoops is the criminally underrated and underseen White Men Can't Jump, by director Ron Shelton. Shelton also brought us the more popular baseball film Bull Durham and the golf flick Tin Cup. But I'd argue White Men Can't Jump is his centerpiece. The story revolves around two street court b-ball hustlers. One new in town, smooth, and white (Woody Harrelson), undoubtedly to his advantage. The other man, a black, a veteran of the LA courts, and fast-talking (Wesley Snipes). After Harrelson hustles Snipes the two form an unlikely partnership \"ebony and ivory\" but as always it is on edge and lacks a required amount of trust. <br><br>For a film that was released in the aftermath of the Rodney King beating and the L.A. riots and just before the O.J. Simpson debacle, White Men Can't Jump is surprisingly mature, witty, light hearted and open-minded in its approach to the race issue. Ron Shelton's dialogue is amazingly rapid fire and smart. It bites and certainly has a sting to it, but it's all in good fun. The multi-flamboyant personalities on the outdoor L.A. street courts hustler each other, crack \"yo-mama\" jokes with one another, and try to look better than the other. This is the movie that really put Wesley Snipes on the map and showed that Woody Harrelson was far more than just another face in the \"Cheers\" ensemble. Both provide excellent work in not only playing the characters but also learning how to play basketball and talk like actual street hustlers. There's very few standins here. Both Snipes and Harrelson learned to play the sport as well as any actor could be expected to. Rosie Perez is good as Harrelson's annoying and overbearing Puerto Rican girlfriend. If any one word can describe White Men Can't Jump, that word is \"fun.\" The movie tackles serious issues like hustling, family, relationships, race, life in poverty, and gambling debts. However if Robert Rossen's pool hall film The Hustler presented the dark side of the life, Ron Shelton's White Men Can't Jump shows the flip side of the coin. How hustling can be fun and games. <br><br>Grade: A-","user":"ztruk2001","rank":[53,64]},{"title":"Greed and Basketball. How Can You Not Like This Film?","rating":15,"date":"15 March 2001","review":"Wesley Snipes and Woody Harrelson team up on the playgrounds of L.A. to hustle all comers. The direction is sharp and the cinematography is surprisingly impressive as the mean streets of Los Angeles are caught with striking camera shots. The under-rated screenplay is intelligent, focused, and clever. All in all \"White Men Can't Jump\" is far from being a classic, but it is still a fine film that is better than many think. 4 stars out of 5.","user":"tfrizzell","rank":[41,56]},{"title":"courtship","rating":8,"date":"22 September 2005","review":"A gritty comedy set in some tough LA neighborhoods about two basketball hustlers, one white (Woody Harrelson), the other black (Wesley Snipes). After hustling each other, they finally team up to play in a tournament, where with a combination of skill and trash talk they defeat the two guys who normally would have left them in the dust. The trash talk gets silly at times, while the subplot of underworld characters who are chasing Harrelson for an unpaid debt seems to be there only to explain logically why he hustles in the first place, as if he would do something else with his life. In any event, the games go from Venice Beach to Watts, and the settings are as good as the stars. Especially so are the cheap motels where Harrelson and girlfriend Rosie Perez have to live, and the inner city apartment where Snipes and his wife Tyra Ferrel call home, all of which adds up to a realistic slice of life at the time, which now seems to look quite a bit different. Intelligently written and well photographed, it has laid in the back of the shelves at countless video stores waiting to be rediscovered.","user":"RanchoTuVu","rank":[19,24]}]