[{"title":"Important science fiction","rating":10,"date":"30 March 2001","review":"Ghost in the Shell is a visually stunning animated masterpiece. Japanese animation has always been in a class of its own, so I won't even attempt to describe the incredible attention to detail and beautiful imagery in this movie. In this case the animation is merely icing for what is one of the most important works of science fiction in recent years.<br><br>Every generation has had books and movies that have contributed to our collective understanding of reality. Prior to World War II this included books like Yevgeny Zamyatin's \"We\" and Huxley's \"Brave New World\", and later Orwell's \"1984\". Today most warnings about the future fall into the category of science fiction. Science fiction began to fill this role when Arthur C. Clarke's \"2001\" warned us of the potential for humanity to create intelligent, even sentient computers that could murder their human creators. \"2001\" envisioned computer intelligence imprisoned in the physical body of a computer. Where \"2001\" left off, Ghost in the Shell begins.<br><br>Ghost in the Shell tells the story of a future in which a computer program, Project 2501, becomes self-aware and begins a quest to fill basic needs it feels are qualifiers of being alive by controlling computers and people to achieve its ultimate goals. Whereas the HAL-9000 computer was relatively harmless, owing to its confinement in the Odyssey space ship, Project 2501 is a recognition that the global internet could have dire consequences for all of us. By comparison, this new villain is virtually invincible. But is Project 2501 a villain?<br><br>Most people who have told me that they didn't like this move said that they didn't understand it. Indeed, the story and concepts are very complicated. I have watched it several times and still get new things out of it every time. Roger Ebert called Ghost in the Shell, \"Unusually intelligent and challenging science fiction, aimed at smart audiences\".<br><br>Ghost in the Shell is full of fascinating dialog, such as this diatribe about the cycle of life and death by Project 2501. \"A copy is just an identical image. There is the possibility that a single virus could destroy an entire set of systems, and copies do not give rise to variety and originality. Life perpetuates itself through diversity, and this includes the ability to sacrifice itself when necessary. Cells repeat the process of degeneration and regeneration until one day they die, obliterating an entire set of memory and information. Only genes remain. Why continually repeat this cycle? Simply to survive by avoiding the weaknesses of an unchanging system.\"<br><br>Thus Ghost in the Shell goes beyond simply a prediction or warning for the future: it attempts to contribute to our understanding of reality by breaking existence down into biological terms and making us question, along with the characters in the movie, whether or not any of us has a soul. The characters in Ghost in the Shell are unusually deep and are a refreshing change from the one-dimensional stereotypes we've become numbed by in modern media. Ghost in the Shell would be required reading in many high school and university courses if it weren't for the fortuitous fact that it can be enjoyed in this beautifully animated feature film. This is one of the few movies ever made that everyone should watch at least once.","user":"Hopper-2","rank":[234,260]},{"title":"A stunning and complex cinematic warning","rating":10,"date":"12 November 2000","review":"Ghost in the Shell is a masterpiece.  I would go so far as to say that it's the second best science fiction film I've ever seen (behind 2001, of course), but no one knows about it.  I find it terribly unfortunate that the only American viewers familiar with Ghost in the Shell are anime fans, many of whom overlook the film's complexity and see only its nudity and violence. The movie kind of gets in its own way-- within the first five minutes we see the heroine's nude body as well as a very messy head-exploding scene, and many of the viewers who would otherwise end up enthralled by the film's abundant style and intelligence immediately dismiss it as exploitative anime trash.  Every time I show this movie to non-anime fans I have to explain beforehand that Ghost in the Shell is a serious work of science fiction and that everything in it, including the adult content, is part of the point the movie makes about where our society is headed.<br><br>The film is stylish, artistic, and beautiful.  Masamune Shirow's stunningly believable vision of the future makes the jump from manga to anime remarkably well.  As brilliant as the comics are, I really prefer the film version, which eliminates the nearly pornographic T&amp;A (the film has nudity but it's clearly not meant to be titillating) and all of the exaggerated comic relief which only detracted from the manga in my opinion.  The film's action sequences are strikingly different from the overly stylized symphonies of destruction seen in most action films.  Gunfire, martial arts combat, and car chases are depicted exactly as they would occur in the real world-- without fast music or Armageddon-style hyper-editing or any of the needless cinematic baggage we've come to expect.  But it's the movie's ideas that make it great, particularly in the last half hour, when thoughtful viewers learn what this story is all about-- the emergence of a new kind of life form, an intelligent and self-aware intelligence that can live indefinitely without ever inhabiting a physical body.  The film argues that this will occur within the next thirty years, and the superbly ambiguous ending inspires us to come up with our own ideas of what will happen to humanity once this new life form begins to reproduce.  This is filmmaking that should be seen and discussed.<br><br>And now the disclaimer.  All of the above comments refer to the subtitled Japanese version of the film, NOT the English dub.  Simply put, the dub ruins everything.  A good example is Kusanagi's wry comment at the very beginning of the film.  An officer who is communicating with Kusanagi through a kind of electronic telepathy tells her there's a lot of static in her brain.  In the original Japanese version (as well as in the manga) she replies that \"It's that time of the month,\" but in the dub her comment is inexplicably changed to \"Must be a loose wire.\"  It's completely insane-- do they think that, in a film with considerable nudity and graphic violence, people are going to be offended by a PMS innuendo?  The whole movie is filled with such intelligence-insulting changes; please do yourself a favor and watch the subtitled version.","user":"Speechless","rank":[219,256]},{"title":"It found a voice... and a following","rating":10,"date":"5 August 2004","review":"\"Ghost in the Shell\" is an intricate masterpiece of cyber-punk fiction and storytelling, successfully melding intriguing philosophical ideas with a coherent, well thought-out (albeit) confusing plot.<br><br>Even more, it's a nightmarish vision of a society that's dominated by cyberspace and looking back now, is eerily prescient of today's computerized times. Many of the characters in the film are enhanced, someway or another by machines, to help them get the advantage in a vastly changing society.<br><br>I'll avoid going real deep into the plot simply because there's a whole lot to grasp and even I got more than a little confused trying to follow it. The story is that a team of high-level government operatives are hot on the trail of a notorious computer hacker called the \"Puppet Master,\" who is wanted for various crimes in cyberspace and has taken a particularly fond interest in the team's tough, female cyborg leader.<br><br>Not surprisingly, as with the stigmas surrounding Anime', \"Ghost in the Shell\" is not short of nudity and graphic violence. But it's far from being gratuitous, and does not slow down the movie at all.<br><br>\"Ghost in the Shell\" was one of the first Anime' films to skillfully blend traditional drawn animation with computerized imagery. This helps to give the film a surreal, yet beautiful look. And the dialogue helps sometimes too, with helping to sort out the confusing plot and many of its mythical ideas about personal identity and human evolution.<br><br>This film is also even more revered today, in 2004, since some of this film's core themes helped to develop the plot basis of the insanely popular \"Matrix\" films, and some scenes from \"Ghost in the Shell\" were even homaged to in the first \"Matrix\" movie. The Wachowski Brothers certainly do owe a lot to this movie for the success of their work in America.<br><br>I think that to understand \"Ghost in the Shell,\" it would help to accept that Anime' is much more complex and daring than traditional American animation. Most Japanese animation films, like this one, \"Akira,\" or Mayazaki's \"Spirited Away,\" are on a level of sophistication that will never be matched in America. <br><br>It has been said that the majority of American audiences would be afraid of Anime' because of the many stereotypes surrounding it, but that's why it's boundless - it's been given free reign to use those stigmas to its advantage in developing truly remarkable pieces of art that have gone largely ignored here in the U.S. \"Ghost in the Shell\" could very well be a mere reflection or a parable of a doomed society that's probably already accepted its dark fate. Most American animation would never touch up on this sort of subject matter.<br><br>\"Ghost in the Shell\" is my #3 choice Anime' film (behind \"Spirited Away\" and \"Akira\") because it's so full of ideas and is masterful in telling a dark story about our times.<br><br>10/10","user":"dee.reid","rank":[100,116]}]