[{"title":"Am I the only one who loves this movie?","rating":10,"date":"4 February 2000","review":"The action scenes are top notch. Maybe I'm just a sucker for colorful characters and the bank heist angle is well done. Best of all is Alec Baldwin's character, Doc. Baldwin and the rest of the cast really deliver their lines with panache.<br><br>Bank jobs, car chase, cat-and-mouse in a four story hotel, steamy sex, crazy characters.... what else do you want?","user":"kevdo","rank":[44,53]},{"title":"Steamy, Entertaining Re-Make","rating":8,"date":"2 June 2006","review":"This was a very entertaining, if morally way below par, action movie which consistently keeps your attention with intense scenes. Kim Bassinger probably looked as good as she ever looked which is saying a lot. She has one of the steamiest scenes I've ever seen on a mainline film (my tape was the \"unrated\" version) but at least it was with her real-life husband (at the time) Alec Baldwin.<br><br>This re-make of the 1972 film also has Michael Madsen, James Woods, Mike Morse and Jennifer Tilley - all playing sleazy characters. They are so bad they make Baldwin &amp; Bassinger look like monks. This movie is not exactly Mary Poppins. There's almost too much of a mean edge to it....almost. Perhaps I enjoy ogling Bassinger too much to can this movie for its baseness.<br><br>Whatever, this entertains to the degree that it makes it a very quick two hours. There is no way you could get bored watching this film.","user":"ccthemovieman-1","rank":[46,56]},{"title":"Worthwhile remake","rating":7,"date":"19 February 2005","review":"I recently had the opportunity to watch this movie and the 1972 version back to back (the modern version first). I was amazed at how exactly some of the minute details in the original movie were repeated in the remake. The garbage bin, the locker gimmick, the character of the innkeeper and paint truck owner. It was interesting at how many of the touches were not unnecessarily \"modernized\". (I like that).<br><br>I was able to enjoy both versions. Some people made comments disdaining the remake, but I thought it was a worthy movie, if just because it was a more sexy polished version. --I admit I'm biased, because I thought Kim Basinger was one of the hottest women I've seen in movies (I can't believe she was over 40 when she made the film). Her action/shooting scenes near the end were also very well done. The chemistry between her and Alex Baldwin was also superb, I guess due in some part to the fact that they were (or were going to be) a husband-wife couple in real life too. <br><br>I also liked the movie to enjoy the differences between the actors (and interpretation) within the almost exact same construct. Steve McQueen's more hardboiled tightly wound character to Alec Baldwin's character who seemed to have a more innate gentleness (sort of like being a victim of circumstance). But of course both being pleasingly hard resourceful men. The old paint truck drivers at the end were also great character actors. Nice ending.<br><br>Another interesting aspect of the film was how fit Alex Baldwin and David Morse looked. 11 years has passed since the film was made, but they both (esp. Morse) look a lot younger. The beauty of youth! James Wood and Mike Madsen in distinctive \"enemy\" roles also did what they both do best.","user":"tomiron77","rank":[22,25]}]