[{"title":"Hard, thoughtful film with messages for everybody","rating":10,"date":"27 May 2005","review":"John Singleton's Boyz n the Hood remains one of the best fictionalized and most poignant summaries of some of America's toughest internal problems - racism, violence, poverty, and drug abuse. This is not a hip-hop film, nor a detached and dehumanized story about \"gang violence\" (the great over-simplified scapegoat of the issues treated in this film), its a story about growing up fatherless or motherless in a war zone with a faceless enemy, where people do not value each other's lives at all and value their own lives only slightly more.<br><br>Laurence Fishburn leads one of the best casts of the early 1990s, in his memorable portrayal of Furious Styles, a father trying to raise his son (Cuba Gooding Jr) well in an environment where murder and substance abuse are day-to-day realities - South Central L.A. The film follows his son, Tre, and his friends, from the hardships of childhood in an irrelevant educational system and a neighborhood which doesn't allow kids to be kids, through to the realities of making decisions about the value of life and the development of responsibility and hope as young adults.<br><br>The cast disappears into their characters and brings each one to life in a unique and powerful way. losing the identities of big personalities like Fishburne and Ice Cube is no mean feat. Many of the performances recorded here are award-worthy - Fishburne, Bassett, Chesnutt, Gooding, and Ice Cube are especially memorable. For me personally, this is the film that convinced me that Ice Cube was destined to become a major personality in American cinema. While I had enjoyed some of his music prior to this film, it was here that I was first exposed to his versatility and intelligence as an actor. <br><br>While some may see some of the film's messages as heavy-handed, and others might have issues with the fact that the film deals with so many of the problems of inner-city life in a very 'in-your-face' almost archetypal manner, I find these criticisms impossible to justify.<br><br>This is a great film about real issues, sensitively portrayed and thoughtfully examined. Every American who cares about the vast untapped potential of our people ought to take a long, hard look at this one. These are not 'black problems', they are everybody's problems, and their solutions will require everybody's understanding. I could think of far worse places to begin developing that understanding than Boyz n the Hood.","user":"mstomaso","rank":[123,139]},{"title":"A gripping tale about South Central L.A.","rating":8,"date":"22 May 2002","review":"John Singleton's best film also proved to be one of my favorite movies about life in the streets. Cuba Gooding, Jr. displayed early on he was going to be a respectable actor. The power of the film has yet to be matched as most modern interpretations of street life prove to be violent stylizations. While Singleton has taken a couple missteps along the way, this film still stands up rather well by today's standards. The motives and actions appear realistic, especially Doughboy's thirst for revenge. A good film, which not only helped improve Laurence Fishburne's career, but introduced us to Gooding.","user":"Agent10","rank":[59,70]},{"title":"Place for Race","rating":9,"date":"20 May 2005","review":"Most movies about life in the hoods of LosAngeles, New York City, and other urban areas of the U.S. are discounted as novelty entertainment for audiences seeking sex and violence. Out of an era of gangster rap came a nationwide exposure of the issues within the Black and Latino communities, and directors like John Singleton and the Hughes Brothers follow in the footsteps of the great Spike Lee. The film Boyz n the Hood is an intricate examination of the archetypes and stereotypes of the hood, as well as an introduction to the survivors, both trapped in the violence and escaping the cycle. The film concentrates on a Black community without the interactions between communities shown in Do the Right Thing, another epic race commentary. The direction of the film is fluid and natural, the acting heartfelt and strong, the affect extraordinary. The message of the movie is deeper than White or Italian based gangland movies, because the human aspect and the characters are more solid and approachable, and rooted in highly intellectual and applicable theories on race and violence. This film is a showcase of the radical and moderate themes expressed by Black activists, with Laurence Fishburne's character as the leader and role model of the film. A careful examination of the film reveals a strong message and a strong film. Don't underestimate the power of this film.","user":"mbucky","rank":[44,55]}]