[{"title":"An Excellent use of Sci-Fi as a story telling medium","rating":10,"date":"8 April 2002","review":"While most movies that pit humans against horrendous extra terrestrials end up being cheap imitations of the 'Aliens' series, Pitch Black stands as a fine piece of Sci-Fi, and an excellent movie all around.  Perhaps my favorite aspect of the film is the lighting.  This movie beautifully employs many different colors, shades and intensities of light which set the mood and lend a unique feeling to the film itself, something different than the 'normal' movie lighting we are generally subjected to.  Vin Diesel brings his character to life in an excellent manner, skillfully avoiding the routine portrayal of the hardened criminal.  After all, the film is about Riddick's (Diesel's character) personal journey, so thankfully Vin doesn't drop the ball.  The remainder of the cast (with the exception of the talented and gorgeous Claudia Black) were unknown to me but all turned in marvelous performances, animating the diverse characters with unique quirks and mannerisms.  Pitch Black is a perfect example of making a great film with out the resources of an excessive budget.  The special effects are more than adequate, but at the same time they are by no means the sole focus, as in many high budget 'blockbusters'.  It's a great movie because it uses Science Fiction as a medium to tell an engaging, provoking story, rather then telling a mediocre story to use the flash of Science Fiction.","user":"ParanoidAndroidMarvin","rank":[263,306]},{"title":"How to survive in pitch black?","rating":8,"date":"10 May 2005","review":"Pitch Black is a survival story. It's about how to survive in an hostile, alien world against even more hostile enemies. The task gets even more difficult when the nearest enemies can be found within your own surviving group.<br><br>The plot of Pitch Black is quite usual and has been seen several times before in different variations. But what makes this movie shine above others, is it's well-written characters.<br><br>The group consists of very different people with few more interesting than the others: Jack, a boy with a secret; Fry, a pilot having hard time with her own conscience; Johns, a bounty- hunter with a drug-habit; Imam, a holy man facing the fact that God is sometimes cruel and Riddick, a convict and a murderer learning to value others, not only himself. Characters start to live in the movie. They aren't only paper like in many other movies of this genre. You start to care for the characters, especially for Riddick though that feels quite odd. He is supposed to be the bad guy. In this movie, the line between light and pitch black is very thin. All characters are familiar with both.<br><br>Other thing that works in this movie is the casting. Rarely do actors fit to their roles this well. Radha Mitchell is suitable for Fry. Cole Hauser brings the right amount of cruelness and sense of responsibility for Johns. But the most impressive work is done by Vin Diesel. He does great job as Riddick. In his hands Riddick is quite creepy, definitely very dangerous and also deep character, just as he is supposed to be.<br><br>So, how do you survive in Pitch Black? Keep your friends close and enemies even closer.","user":"NightfallRaven","rank":[143,175]},{"title":"This is a great film! If this is your genre', you won't be disappointed . . .","rating":28,"date":"28 September 2011","review":"I will admit, I was already a fan of Serenity, Riddick Chronicles and all that, so I did go into this film with a bit of predetermined anticipation. On the flip side, I'm not always that much of a Vin Deisel fan, in that he is somewhat mono-dimensional in his range of characters, but for the embodiment of Riddick, he does fit perfectly. As for the story and how it plays out, the pace is good, not too encumbered with gratuitous special effects and all that, but where it does fit, the CGI is well done and appropriate.<br><br>The one really glaring technical defect in this story is how everyone just gets out and starts walking around, breathing in the air without the slightest concern for differences in the atmosphere, microbes and so on, but this is a common flaw that is often somehow glossed over in many such stories, so I can't harp on that detail too much.<br><br>As for Radha Mitchell, she is smokin' hot here, not in a ridiculous or frivolous way, but as her tough, seasoned interplanetary merchant marine ship's captain character \"Fry\", she nails it perfectly. If anything, she very much reminds me of Andrea Osvart (see her as the Hungarian assassin \"Gilda\" in the film \"Two Tigers\").<br><br>Now, if these two ladies ever appeared together in a film, I would drop everything and go check that out in a heartbeat . . . but I digress.<br><br>In any case, I have no trouble with granting 8 stars to \"Pitch Black\".","user":"charles000","rank":[37,44]}]