[{"title":"Interesting Movie with to much exaggeration of the truth","rating":18,"date":"18 September 2005","review":"While I enjoyed the movie and John Goodman's performance, The Babe's weight was never near that of John and made him look like a lumbering athlete, which in fact he was not. While the Babe was not a role model, he was truly a hero ............. then and now.<br><br>He did not make the comments about Lou Gehrig shown in the movie. His problem with Lou Gehrig had to do with a party his wife went to ahead of the when Lou got to the party and Gehrig was upset his wife might have been intimate with The Babe, which is doubtful. Ruth and Gehrig had been close friends until Lou got jealous.<br><br>The Babe was not a bumbler on the ball field, only in life, due to his lack of class, which was caused by the lack of a loving family. He did have a great care for children, due his lack of having that during his upbringing. It was a good movie in terms of many things, but left those who have read the read biographies of The Babe, disappointed with how the so called facts were presented. The Babe will live on long after this movie, which I avoided for many years, due to figuring it was tainted ............. and it was, very tainted. I do have to say I still enjoyed most of the movie. Like many biographies to much poetic license was taken.","user":"rmurch","rank":[19,20]},{"title":"This Went Too Far The Other Way","rating":5,"date":"12 February 2007","review":"This is what modern-day Hollywood does to most icons, to most of our \"heroes.\" It, generally speaking, trashes them, emphasizing the bad in their lives over the good.<br><br>While the 1948 Babe Ruth Story way over-sugarcoated Ruth's story, this new version portrays this sports hero - perhaps the most famous sports personality in American history - to the other extreme, of course. Why can't Hollywood just be neutral on these biographies? Show the good and bad, but be fair about it.<br><br>If you read about Babe Ruth, it's astonishing to find out just how big a celebrity he was in his lifetime: literally bigger-than-life, and the fact so many people know his name and face over 90 years after he started playing Major League Baseball is a testimony to that. Much of what Ruth did was good stuff, especially with kids and charities, but he also had a crude, rough side to him and a life that had more than its share of sufferings. He was, indeed, and complex and fascinating human being. One thing that is outright lie: the plot line as written on the title page here saying ' {Babe) is unheroic to those who know him.\" No, all the old players said for years afterward how much they all liked Ruth, what a great guy he was and generous to a fault.\"<br><br>Ruth's bad points should be pointed out, but this movie dwells too much on the unpleasant scenes which is probably one good reason why it wasn't a hit movie. Hollywood just doesn't get it: people don't want mostly negative stuff, especially about their heroes.<br><br>Anyway, John Goodman did a fine job of playing Ruth. He didn't write the script, so I am not upset with him. Kelli McGillis is a pretty woman and also adds nicely to the film as Ruth's strong wife, \"Clare.\" <br><br>Also, the movie is still interesting, especially if you're a baseball fan. But, as a big fan, I would like to have enjoyed this movie and bought the VHS (now DVD) and viewed it many times .....but it's not fun to watch.","user":"ccthemovieman-1","rank":[30,36]},{"title":"The Babe 1992, I'm stunned to see it rated so low!","rating":8,"date":"4 March 2008","review":"OK you lot, just what is wrong with this film? I know I'm a limey mofo so my baseball appreciation is not on a par with many Americans, I mean I follow the Cleveland Indians purely because of the film Major League {oh and because a dear friend on this site is a fan}. Was the film inaccurate or something? A quick look at the film's board would suggest that all the glorious moments in the film are true, John Goodman is great and seems to fit the bill, and for once Kelly McGillis doesn't drag a film down, I just watched this and I feel suitably stirred in a real good way.<br><br>Did the Yank crowd really turn on him and he then went on to hit 60? The two home run promise to the sick child? Knocking the ball out of Forbes Park 3 times and then quitting? Calling the shot after letting two go by to clinch the world series against the Cubs? Those are just some of the glorious moments in a film that portrays what obviously was a legend on the pitch and a messed up man off it.<br><br>I really enjoyed it and I'm that interested in the man now I may well seek out a biography to read. 8/10 and the rating here is a disgrace in my humble opinion. That is unless I'm not privy to something of course?!","user":"hitchcockthelegend","rank":[11,12]}]