[{"title":"Good, but please see Sailormoon R first","rating":8,"date":"8 September 1998","review":"This movie is highly recommended for fans of the Sailormoon television series. However, for people unfamiliar with the series, I recommend seeing the Sailormoon R movie first out of the three. The plot is more interesting and the villains are more complex/sympathetic than this one. Also, if you are not a fan of ChibiUsa/Rini, this movie is not for you.<br><br>If you are looking for appearances of the elusive Sailorsaturn/Hotaru, you 'll be disappointed- she does not appear in this movie. <br><br>The dream imagery and music, as well the development of Sailormoon's character and her relationship with Chibimoon, are the strong points of this film.","user":"avril","rank":[4,4]},{"title":"Not as good as the others, but still good.","rating":8,"date":"2 January 2005","review":"This movie is good, but watch R and S first. Only true fans will really enjoy this movie. It took me a little bit to like it as much as I do now. When I first saw it (it was the very first Sailor Moon Movie or episode I had ever seen, period.) I thought \"Hmm, it wasn't that great except for the comedy and the final battle...\" I had to watch more Sailor Moon movies and episodes to enjoy this film as much as I do now. But when I first watched this movie, something in my heart told me \"Look kid, you love Sailor Moon now and you know it!\" If it wasn't for that movie, I still would think Sailor Moon looks weird. Trust me, Sailor Moon is a excellent Anime, and if you don't like it you're mad! Like another reviewer said, if you don't like Rini this movie isn't for you!","user":"Wmill22069","rank":[4,5]},{"title":"Not the best of the trillgoy","rating":23,"date":"23 June 2001","review":"Being a fan of \"Sailor Moon\", I clearly was somewhat disappointed with the third installment of the movie series. The biggest being the fact that Saturn did not appear at all, and seeing a fairy falling in love with ChibiMoon left me very confused. Though I shouldn't talk, because all I saw was the dubbed version, (which I was told is a vast improvement over the orignal this time around.)To me, \"Sailor Moon SuperS:The Movie\" is clearly only for those who are hard-core Sailor Moon fans. If your new to the series, I suggest you start with Sailor Moon R. (My personal favorite.)","user":"Jedi2","rank":[3,4]}]