[{"title":"Nice Variation on Old Legend","rating":9,"date":"16 September 2001","review":"I caught this film on video because the trailer wasn't too good. But it did have Eric Idle voicing Devon so I gave it a chance. I loved it. The dragon stole most of the scenes, but the other characters weren't bad either. Kayley &amp; Garrett made a good couple and it was refreshing to see a romance that wasn't based on looks or riches. I wanted them to be together. Bladebeak was amusing and Aydon (voiced by the excellent Frank Welker) was good to watch. Rubere was deliciously villainous. The weakest characters were Arthur &amp; Merlin but the film wasn't really about them so it didn't matter. <br><br>The best scenes were set in the Forbidden Forest where we witness all kinds of weird and wonderful flora and fauna. There are good songs (I Stand Alone, Through Your Eyes &amp; On My Father's Wings especially.) I also cried at several points. Ignore the bad press. Watch it. 9/10","user":"Cylex","rank":[38,48]},{"title":"An underrated good quality cartoon film.","rating":8,"date":"30 August 2007","review":"Genre: Cartoon, Camelot, Adventure with female knight in training.<br><br>Main characters: Kayley, Garret, Devon and Cornwall.<br><br>Actors: Lots of famous ones here! There is Cary Elwes (Garret), Eric Idle (Devon), Gary Oldman (Ruber), Jane Seymour (Juliana), Don Rickles (Cornwall), Pierce Brosnan (King Arthur), John Gielgud (Merlin).<br><br>What happens: Kayley is the daughter of Sir Lionel, one of the knights at the Round Table. The young girl dreams of following in her father's footsteps as a knight. Then, disaster strikes. Lionel is killed :-( and Kayley as well as others mourn for him. Kayley dreams on of becoming a knight...<br><br>My thoughts: This film had good potential. It had good animation, good, heartwarming songs, good characters and lots of good actors. They released it and (on IMDb especially) it sort of flopped like a deflated balloon. What happened?<br><br>Well, I don't know personally. I suppose a lot of people don't like this film for a number of reasons. Yes, the film isn't perfect, but it's CERTAINLY enjoyable and good to watch! It's also good for the children, they are likely to enjoy at least one aspect of the film and want to watch on (just like me when I was younger). They may enjoy the songs, they may enjoy the actors, they may enjoy the characters or the excitement, or they may enjoy the humour. They are most likely NOT to be disappointed.<br><br>Adults are most likely to like the actors. Monty Python fans will hopefully not be disappointed by the performance of Eric Idle. Also here is Jane Seymour (but not Henry the Eighth's wife OBVIOUSLY! :-) ) <br><br>Why this film has gone down so badly is a mystery to me. I hope those of you who have never watched it before will enjoy it as much as I do.<br><br>Recommended to: Families who like cartoon films, people who like any of the actors I mentioned earlier and people who just like the sound of the film in general - enjoy! :-)","user":"Mightyzebra","rank":[34,43]},{"title":"A very,VERY good Arthurian movie","rating":10,"date":"18 September 2007","review":"I was shocked,surprised and flabbergasted by the negative reviews I would see on the web, I thought that this film a very,VERY good Arthurian movie along with Walt Disney's classic \"The Sword in The Stone;\" the MGM live-action classic \"Knights of the Round Table\" with Robert Taylor &amp; Ava Gardner; the musical \"Camelot\" starring Richard Harris &amp; Vanessa Redgrave.<br><br>This film has everything: a very good story, excellent music, and that's one thing I love in a movie is a very good soundtrack; and an excellent voice casting too. I love Kayley, and her desire to carry on the tradition of her father in the excellent song On My Father's Wings was a great scene in the film. I also love song \"The Prayer\" too. The song became popular among artists like the Celtic Woman - I don't understand why a popular song would come from a film that people thought it's awful.","user":"ja_kitty_71","rank":[29,46]}]