[{"title":"Oh, \"Baby\"!","rating":8,"date":"15 December 2001","review":"Dumb laughs are easy to come by.  Dumb characters are even easier.  But when you get a movie that is so endearingly, goofily dumb as \"Baby's day Out\", you can't help but love it!<br><br>The plot is straight out of Cartoon Land, with a low bow in the Three Stooges' direction compliments of scripter John Hughes (surprise!).  Three of the dimmest kidnappers in history (Mantegna, Pantoliano and Haley) make the mistake of kidnapping a rich couple's little baby, who turns out to be far more resourceful than all three of them combined.  And a lot more ruthless.<br><br>During the course of the day, baby Bink (Warton and Warton) leads the dumb bad guys throughout the width and breadth of Chicago and leaves them all bruised, beaten, burnt, plummeted from innumerable high drops and otherwise humiliated (\"we've had the living hell torn out of us by a baby,\" screams Mantegna at one point).  And all the while, we're laughing.<br><br>I saw this in the theatre when it first came out and, I must admit, the entire packed-in audience was laughing hysterically at every single pratfall, gag and slapstick business that occurred.  I love this kind of movie and seeing the great Joe Mantegna take his lumps so valiantly brings a smile in itself.<br><br>It's nice to play dumb once in a while.  And even nicer to witness it.<br><br>Eight stars for \"Baby's Day Out\".  If you like such laughs, it'll make your \"Day\".","user":"Mister-6","rank":[63,81]},{"title":"Ludicrous But Cute & Very Funny","rating":8,"date":"16 February 2006","review":"Credibility-wise, this is one of the most ludicrous movies you'll ever see, but it's fun and I would think almost anyone would enjoy it. It's basically \"Home Alone\" out on the streets and with a baby instead of a small boy.<br><br>A baby goes wandering all over the big city with two kidnappers chasing it. People are everywhere but nobody sees the baby but the bad guys?! Hey, I told you it made no sense, but there are so many laughs in here, so many goofy slapstick routines that work that it's worth your time to check it out. I've seen it a couple of times and throughly enjoyed it each time, as have my guests - from kids to older folks.<br><br>To movie buffs, it's kind of fun also to see Joe Pantoliano and Joe Mantegna playing roles in which profanity is at a minimum, and they are in it only for laughs. It's a long way from most of their roles. Mantegna is especially impressive with his comedy. I was shocked how funny he was.<br><br>The only criticism I had, other than totally preposterous story being a little too far-fetched, is that one scene (at the construction site) went on too long. The movie as a whole would have been better had it been cut about 15 minutes. It's basically a one-joke movie and 99 minutes is too long for that.<br><br>Overall, this is a nice entertainment with a lot of laugh-out-loud scenes. If you get a kick out of seeing a baby constantly laugh, giggle and have a great time, then you'll really love this.","user":"ccthemovieman-1","rank":[42,60]},{"title":"Guilty pleasure, perhaps...","rating":9,"date":"17 May 2009","review":"...but I really love this movie! It's a pity this was released on the coattails of \"Home Alone\", since it's inevitably perceived as a knock-off. But the comparison is really unfair. \"Home Alone\" featured McCauley Culkin as annoying, precocious, and self-sufficient far beyond his years. The criminals who were his foils were reminiscent of The Three Stooges in their ineptitude. The one quality both Culkin and the criminals shared was a being mean spirited to some degree.<br><br>Baby Bink in \"Baby's Day Out\" is a true innocent who survives on luck while remaining adorably unaffected. His criminal foils are more reminiscent of Laurel &amp; Hardy than The Three Stooges - cleverer and more subtle. In this case, the quality shared by Baby Bink and the criminals is innocence and an underlying decency.<br><br>The supporting cast is superb, led by Joe Mantegna in one of his best comic roles.<br><br>If you're not too jaded to appreciate it, I highly recommend this movie.","user":"rbsjrx","rank":[23,31]}]