[{"title":"Pass the Popcorn review","rating":14,"date":"14 October 2013","review":"After seeing Melancholia and Antichrist, and after reading lots of stuff about Lars von Trier and his movies, I thought I understood what kind of director he is. When I started watching his filmography, I was expecting everything, really, because I know people who've seen a lot of his movies and they were always telling me that his films are good, but extremely tough to watch. Especially Dancer in the Dark, a friend of mine said. So when I started watching it, I found out I was unprepared.<br><br>Dancer in the Dark is a movie about Selma Jezkova (Björk), a factory worker from the '60s, who is slowly going blind. She has a genetic disease that she knows her 12-year old son will inherit, therefore she is saving up money so he can get an operation when he turns 13. She's extremely poor, she lives in a trailer she's renting from the town's policeman, Bill Houston (David Morse), who lives with his wife near Selma's trailer, and who is helping her with the money. Her only friends, Kathy (Catherine Deneuve) and Jeff (Peter Stormare) help her as well in her everyday-life routine. Everything starts to go downhill when the policeman doesn't have any more money to give her and, taking advantage of the fact that she's going completely blind, steals all the money that she saved up for her son's operation. That's when Selma starts to 'dance in the dark', both literally and metaphorically.<br><br>Dancer in the Dark is the third film in the so-called \"Golden Heart trilogy\" by Lars von Trier. I don't really know why the trilogy's called like that, but I can assume it's because the main character is a pure-hearted person, whose life gets destroyed by the people that surround him (in this case – her) and by the situations he finds himself in. At least, that's Selma's story. I think von Trier's goal here was to rip your heart out of your chest, squeeze it and make it explode. He took something so pure, innocent and beautiful as Selma, and made her suffer as much as he could. And all that you can do, as a viewer, is just watch the main character perish. I suffered along with the character, and it was really difficult to watch. I usually spontaneously empathise with the character, I try to experience what they're experiencing – and that surely didn't help. At the end of the movie, I was a train wreck, crying my eyes out. But maybe, the movie's problem is just in this.<br><br>The movie wasn't particularly well-received, especially by the critics, and I see why people don't like it. It's not a pleasant movie to watch; everything in it makes you feel uncomfortable, and especially mainstream audiences feel uncomfortable, since the movie is so unconventional. It's filmed by following almost all of the Dogme 95 rules: it uses hand-held digital cameras to create a documentary-style look, with no background music. I didn't mind those characteristics, I actually loved them. What I think we all really agree on is that the real eye-candy of the movie is Björk. Her performance was outworldly, something unique in the history of cinema. Many said that Björk was so convincing that she became the character herself – and I agree with them. That wasn't acting, as her co-star Catherine Deneuve said: that was feeling. And what's even better – Björk was able to use her main talent, music, in the movie as well: Selma is a great musical fan, and she would often daydream, creating musical numbers in her head. In the movie, we would see what Selma imagined. The colors would brighten (this time using static cameras to film), Selma would be singing along with whoever surrounded her, and everything would be cheerful. The result of the combination of Björk's phenomenal voice and incredible acting performance was astonishing.<br><br>But, as I was saying before, maybe the problem with the movie is that von Trier was using this 'destroying something beautiful' to get to the viewers. One could call it 'cheap storytelling', but isn't that the most effective way to get to someone's heart and then break it? Yes, it actually is. So, no, von Trier's masterplan here wasn't genius – he's just doing what he does best. But I don't really care. I don't think it's actually that easy to make someone feel such strong emotions. You've got to choose the right story, with the right characters (main and supporting), the right twists, the right directing, the right screenplay, the right tone and the right actors. Choosing Björk as the main character was a risk, since that was her first acting job. But her sweet, innocent appearance had an even greater effect on the whole movie experience, because it enhanced the beauty that was getting destroyed. I'm certain that the movie wouldn't have been this good without Björk's acting and music.<br><br>So, personally, I loved the movie. I'm all for the emotions, and this one struck me good. But I loved everything about it: its uniqueness in the way it's filmed and directed, the dark but sometimes cheerful tone, the characters and the actors, etc. The above mentioned problem that many had with the movie wasn't a problem for me at all. Maybe it was too raw and harsh, but Lars von Trier really got everything right, in my eyes. Some may call it tedious and overly-melodramatic, but I think it was all done on purpose. The initial slow pace created the right situations and the right tone, and the twists that happened later in the movie felt earned and right-timed. It all felt very real as well. When the final credits started running, and my tears started flowing like crazy, my first thought was \"F**k you, Lars\". But then, it turned into a \"thank you\", because, as a critic said, ultimately, it's a tribute to the power of cinema.","user":"PassPopcorn","rank":[22,24]},{"title":"Odd, bleak, but ultimately transfixing musical drama, pop singer Björk immerses herself completely in this tailor-made role.","rating":9,"date":"31 May 2001","review":"The reviews were extremely black and white for this art-house film.  People were either enthralled or bored to tears by the whole experience.  There seemed to be no middle ground.  Now, that's my kind of movie.  Any picture that can reap awards (Cannes Film Festival) and get lambasted by the general public at the same time will always pique my interest.  In respect, it was a rich, rewarding odyssey, much easier to get through than, let's say, even half of \"8½.\"  <br><br>My initial respect for the unique, uncompromising style of Danish director Lars von Trier goes back to his compelling work in \"Zentropa\" and \"Breaking the Waves,\" both bleak, surrealistic studies of man vs. reality.  His pieces usually center around some innocent, simple-minded, self-sacrificing soul who inevitably succumbs to the cruelties of life.<br><br>I found the central role of Selma (as played by the extraordinary Björk) to be very much the emotional equivalent of Emily Watson's touchingly childlike, near-sociopath Bess in \"Breaking the Waves\" -- blessed and cursed with a naive, soulful purity.  Selma represents one of God's little quirks of nature.  A bespectacled, pathetically infantile little ragamuffin completely out of touch, Selma has somehow survived like the runt of a litter would - through luck, will power, and the extreme kindness of those around her.  An impoverished Czech-born emigré living in a small Northwestern U.S. industrial town during the mid-60s, this luckless creature manages to eek out a meager Airstream-like existence as a factory worker, despite the fact she is legally blind.<br><br>Selma is, amazingly enough, a mother.  Seemingly ill-equipped to care for a child much less herself, she has nevertheless managed to provide for the 12-year-old boy, while nurturing the child as a young girl would her rag doll.  The fairly adjusted boy suffers, however, from the same optic disease as the mother, while the crux of the story revolves around her attempts to save up money for his inevitable operation.    <br><br>The fascination of \"Dancer in the Dark\" lies in Selma's musical world.  With her eyesight failing, her ears become the only sense of joy, falling periodically into bouts of fantasy anytime she grabs onto a rhythm or beat (like machine sounds, train engines, etc.), wherein she becomes the star of her own working-class musical production.  These compelling sequences become mere extensions of her real-life circumstances, i.e., the musical interludes at work will include the factory itself as a set piece and the other workers as her ensemble.  A strange mix of Fellini neo-realism and Busby Berkeley illusion, these daydreams (sparked by Vincent Paterson's inventive choreography and von Trier's purposely puerile lyrics) become her only escape.  Björk's odd musical talent and vocal style may be an acquired taste, but she is so mesmerizing here it becomes a non-issue.  In addition, there are brief moments of levity as a hopelessly inept community theater production of \"The Sound of Music\" goes into rehearsals with the very awkward Selma playing Maria.<br><br>The subordinate cast is equally in tune.  The wonderful, beguiling French star Catherine Deneuve downplays her ethereal beauty as Kathy, Selma's co-worker and trusted friend.  And a strange, maternalistic friendship it is indeed, for this woman seems to have no other purpose in life than to be this girl's eyes and hands, looking out for her practically day and night. Peter (\"Fargo\") Stormare shies away from his ruthless killer image with this touching portrayal of a sensitive, almost pitiable boor who only has eyes for the ungainly Selma.  David Morse is gripping as a seemingly compassionate but despairing policeman whose one desperate act involving neighbor Selma results in tragedy.  Joel Grey has a brief, telling moment near the film's end as a faded musical star idolized by Selma.<br><br>As in his other featured works, von Trier's gritty, hand-held camera work may be dizzying to the point of distraction at first but its overall impact to the stark proceedings is unquestionable.  Moreover, the grueling paces he puts his actresses through to achieve absolute truth borders on misogyny but the rewards are tenfold.  As in the case of Emily Watson, Björk has never shined brighter as an artist.<br><br>A harrowing, refreshingly original piece of filmmaking that should be experienced by anybody who dares to be different.","user":"gbrumburgh","rank":[156,195]},{"title":"A Movie To Break Your Heart","rating":10,"date":"23 August 2000","review":"It feels awkward to attempt to put Dancer in the Dark into words. Von Trier's film is one of those movies that truly change the way we think about cinema and its possibilities, and for such a film, words do no justice. Dancer in the Dark centers around Selma (Björk), a factory worker, who loves her 10-year-old son above everything else in the world. Selma is a happy, innocent creature who enjoys musicals for \"nothing bad ever happens in them\". These elements (mother's love for her son, joyfulness of musicals versus the hardships of every day life) create a whole unlike anything ever seen on silver screen.  Selma is rapidly losing her eye sight, but not her vision: she's the 'dancer in the dark' who is prepared to sacrifice herself to  keep the light in her child's eyes. Very early on it becomes obvious that this story can't have a happy ending. However, once you've accepted it, you can put your mind at ease and see the film as it unfolds from Selma's point of view. And what a view it is! Björk gives a performance of a life time - this little woman with a huge voice is all emotion all the time without ever  appearing overtly dramatic or cheaply sentimental. There's no weak link in the rest of the cast either, Peter Stormare as Jeff, Catherine Deneuve as Kathy and Siobhan Fallon as the prison guard to name but a few. The biggest star is still the director himself; von Trier demonstrates his talent in a superb fashion by both telling a simple story that will most likely break you heart and examining the ever-persistent ills of the life of the lower class of the American society. What about the film's musical character then? This is where von Trier triumphs the most by understanding the very essence of the whole genre - hope; hope that will live in our soul for ever if we'll only follow our heart.","user":"Outi","rank":[187,236]}]