[{"title":"The best one in The Evil Dead Trilogy! THIS IS MY BOOMSTICK!!!","rating":10,"date":"24 October 2015","review":"Army of Darkness (1992) is in my opinion by far the best one of the \"Evil Dead\" trilogy! It is my second favorite film of the trilogy, I just love, love this movie to death!!!! It is my personal favorite horror movie in the Evil Dead series. The best one is the theatrical cut the rest versions are pure crap with lameness. The original cut kicks ass!!! Great movie! This movie is so silly, that it's actually funny. <br><br>I have always loved Army of Darkness and I always will. I love this film to death!!!! I was watching with my dad this film and even he loved it. So yes I proud to say I love this film and I have enjoyed More than the original The Evil Dead (1981) and Evil Dead 2: Dead by Dawn (1987)! This film has funny moments, balance, smart genius creativity, great babes, mystic forces and mystic knights in it.<br><br>Good, bad, I'm the guy with the gun. <br><br>Army of the dead who were actually skeletons were fabulous, the fights were awesome and they and they were highly enjoyable. The film was fast paced from the beginning till the end. I am sorry if you guys love Evil Dead 2 much better than this film, I just love Army of Darkness much better, this film is just a great worthy sequel to their predecessors. Ash is like ably hero on screen and he is one of the most popular hero's till it's days. Army of Darkness is a classic. Sam Raimi, Bruce Campbell, &amp; the special effects masters KNB! You cant ask for more. Great story, funny lines, fantastic looking monsters. I don't care what anyone says I just love this film to death!!! <br><br>What we get in here is a hybrid of sorts with Bruce Campbell once again as Ash the reluctant hero fighting ghouls and goblins (well maybe not goblins) in the medieval times. This third chapter goes for more of the laughs rather then the scares and actually offers up a fun take on the genre mix director Sam Raimi tells. The movie is not as annoying as the previous 2 films and closes out the trilogy nicely. They are a lot of talks of an Army of Darkness 2 and I don't want any sequel to this horror/comedy flick. I thought this film closed the trilogy beautiful. There is a lots of comic relief, over the top cuts, BOOMSTICK!!!!! <br><br>Army of Darkness is my second favorite movie (Evil Dead II, Dark Knight, ARMY OF DARKNESS) and here's why. It follows the character of Ashley (Ash) J. Williams in his journey to the past that is far better explained in Evil Dead II. He is only able to be sent back to his own time (and his job at S Mart) if he finds the Necronomicon (Book of the Dead) which will also free the people who can help him from the attacks of the deadites. Ash has to find the book, get the babe, fight some demons, and get back home...like in the deal. This movie has it all, and some sugar, baby! It is a hilarious, gory, wonderful display of Bruce Campbell's ingenious acting ability, and anyone who says differently is a deadite. It's a film that would make Clive Barker proud. An oddball yet absolutely successful pairing of slapstick Comedy and undead Horror with a medieval setting thrown into the mix for good measure, 1992's Army of Darkness sits proudly near the top of the list of most unconventional yet absolutely entertaining motion pictures in history. Following up on 1981's oft-banned The Evil Dead and 1987's The Evil Dead II: Dead by Dawn (itself a Horror-Comedy hybrid), Army of Darkness represents the most accessible and audience-friendly of the three. Special effects; gore; humor; and of course, Bruce Campbell's over-the-top antics are Awesome!!! Hail to the king, baby.<br><br>Army of Darkness is a 1992 American dark fantasy action comedy film directed by Sam Raimi. It is the third installment of the Evil Dead franchise. The film was written by Sam Raimi and his brother Ivan, produced by Robert Tapert, and stars Bruce Campbell (also acting as co-producer) and Embeth Davidtz. Continuing from Evil Dead II, Ash Williams (Campbell) is trapped in the Middle Ages and battles the undead in his quest to return to the present.<br><br>Beyond in human flesh, inked in blood-and amazingly hard to pronounce-the ancient \"Necronomicon\" (Book of the Dead) unleashes unspeakable evil upon mankind in director Sam Raimi's (Spider-Man) outrageously hilarious sword-and-sorcery epic. Back to do battle with the hideous \"Deadites,\" Bruce Campbell reprises his role from the Evil Dead series as Ash, the handsome, shotgun-toting, chainsaw-armed department store clerk from S-Mart's housewares division. Demonic forces time warp him-and his '73 Oldsmobile-into England's Dark Ages, where he romances a beauty (Embeth Davidtz) and faces legions of undead beasts, including a ghastly army of skeletons. Can Ash save the living from the dead, rescue his girlfriend and get back to his own time? This movie is personal second favorite movie it is 10/10.","user":"ivo-cobra8","rank":[53,60]},{"title":"\"Well hello Mr. Fancy Pants.\"","rating":8,"date":"2 June 2004","review":"Picking up where \"Evil Dead II\" left off in a somewhat altered opening, Bruce Campbell, now a full blown Han Solo smart ass, is trapped in the dark ages and is eventually found to be the one fated to the Deadites after he retrieves the Book of the Dead, which can also help send him back to his own time. But Bruce, being as stupid as he is, screws up the magic words that are meant to keep the Army of Darkness away and he ends up unleashing an army of undead skeletons by accident who are led by his evil alter ego. Now he must use his 20th century know how to save the day or else evil will forever rule the Earth. <br><br>Bruce is back and funnier than ever. No real horror here, more of a parody of a big budget fantasy adventure film. Sadly, a number of great gags were left on the cutting room floor that are generally only seen on extended DVD's and TV showings. <br><br>Hail to the King, baby.","user":"DarthBill","rank":[67,77]},{"title":"Not for the pretentious","rating":9,"date":"4 April 2001","review":"Most people would say you can check your brain at the door before you watch this film, but I beg to differ.  This is genuinely intelligent stuff here folks.  The director, Sam Raimi, reminds us in this film what it is like to have fun.  From the film itself, as well as the DVD featurettes, it is apparent that Mr. Raimi is having a blast doing what he does best.  It shows too.  Granted, there is not much in the line of plot or theme, but these would be totally gratuitous in this escapist piece.  Instead, we are given a fantastic adventure, appropriately tongue-in-cheek special effects, and an ode to The Three Stooges.  The facial expressions of Bruce Campbell alone make this film well worth its 80 minutes.  I don't want to give away a single joke, because the experience is just too much fun.  So, do yourself a favor.  Watch this film without being so hard on yourself.  Yes, you are allowed to laugh.  There can be non-sardonic humor in modern day America. Sam Raimi proves it.","user":"Freddy Riedenschneider Fanclub","rank":[187,225]}]