[{"title":"See This Movie.","rating":9,"date":"2 June 2005","review":"Deep Impact is a well-done and thoughtful film that powerfully delivers the human touch in its pondering of the age-old question: What if extinction was just around the corner?<br><br>Deep Impact is most often compared to its death-comet partner from the summer of '98, Armageddon. Deep Impact is a drama; Armageddon is an action film, and delivers just what we would expect from an action film, namely, over-the-top characters, a simplistic storyline, and an abundance of special effects. Deep Impact presents just the opposite: Characters that are notably human, several dovetailed story lines, and it saves the special effects (which are very good) for the movie's climax.<br><br>Armageddon did better at the box office primarily because it was much more hyped, and because it featured an A-list star (Bruce Willis) while Deep Impact did not. Its enjoyability, though, is very limited: If you are not a fan of the action genre, you will not like Armageddon. Deep Impact is the substantially better film and reaches out to the viewer to a far deeper degree.<br><br>As you certainly know, the plot revolves around the fact that a seven-mile-wide comet is on a collision course with earth, and if it makes impact it will represent an Extinction Level Event (i.e., the death of all life on the planet). Having about a year and a half's notice of this, the U.S. and Russian governments send a spacecraft, the Messiah, to destroy the comet by drilling nuclear warheads into its core and then detonating. The movie focuses on three primary story lines: 1. The young reporter Jenny Lerner (Tea Leoni) and her struggles with her career and her parents; 2. The high-school couple of Leo Biederman (who discovered the comet; Elijah Wood) and Sarah (Leelee Sobieski); 3. The crew of the Messiah.<br><br>All three story lines are done in such a way that the viewer easily sympathizes with the very believable characters. The best done of the three is the spaceship's crew, although the most time is spent with Jenny. They all suffer from the film's only notable problem: The story lines seem somewhat rushed. Considering its broad scope, Deep Impact clearly would benefit from an extra 30 minutes to develop, especially with the underdone angle with Leo and Sarah, but the directors evidently decided two hours was all they could use.<br><br>Deep Impact, as I mentioned, lacks an A-list star, but it does feature superb performances from two of the best supporting actors of our generation: Robert Duvall (Spurgeon Tanner, captain of the spaceship) and Morgan Freeman (Tom Beck, the U.S. President). Duvall is definitely the standout of the film with an A+ performance as Tanner.<br><br>As for the other actors/actresses: Tea Leoni (playing Jenny Lerner) gets the most face time in the film and delivers a believably good performance. Maximillian Schell as Jenny's father is the one notable casting mistake; I'm not sure what they were going for with him, but they could have done better. Venessa Redgrave does well as Jenny's divorcée mother.<br><br>Elijah Wood (now a star but at the time just an up-and-comer) works very well as the teenage Leo Biederman, and Leelee Sobieski as his girlfriend Sarah gives us as good a performance as we can expect, considering how woefully underdeveloped her character is. The film arguably devotes a bit too much time to Jenny and her father and not enough to Leo and Sarah.<br><br>If you haven't seen this movie yet, it should be at the top of your must-see list. The film moves at a good pace (if a bit fast), grabs your attention at the beginning and holds it throughout, and it features a truly exceptional final 20-25 minutes. What stands out most about this movie is its human touch and sensitivity. It manages to probe an impressive array of human emotions in two hours' time, and it will leave you with plenty to think about -- although it probably will not leave you with dry eyes. There are precisely three movies I have seen that caused the room to get dusty around me (if you get my drift), and this is one of them.<br><br>In conclusion: See this movie.","user":"JZeth","rank":[176,246]},{"title":"Superior to 'Armageddon'","rating":8,"date":"26 August 2006","review":"It seems 1998 was the year Hollywood turned to the idea of the world being decimated by objects from outer space to fuel their disaster films. Both 'Deep Impact' and 'Armageddon' were released in that year but while I did enjoy the thrill and special effects of the latter film, I find 'Deep Impact' the superior of the two.<br><br>The film begins when a teenage amateur astronomer discover a comet on a direct collision course for the Earth. The world is then thrown into turmoil has humanity has to accept their possible extinction. While NASA sends a shuttle up with the intention to try to blow the comet to bits, the US government selects people to be saved in a cave they are building to withstand the event. Focusing on various unrelated characters, the film shows how people react differently to the destruction of all that they know.<br><br>The brilliant cast, including Morgan Freeman, Vanessa Redgrave, Robert Devall, Elijah Wood, Ron Eldard and many others, all given great depictions of their characters. It is because of their ability to bring their respective characters to life that 'Deep Impact' stands up so well as it is a very emotional and character driven story, as opposed to 'Armageddon', which relied much more on humour and special effects to sell it. Téa Leoni is the only one who doesn't shine through like her co-stars as her performance is quite bland and doesn't capture her character's turbulent emotions. However, as the rest of the cast give great performances, it's easy to overlook her. And even though there is much attention given to establishing the characters doesn't mean the film skimps when it comes to the special effects. Both the scenes in space and those on Earth when the comet hits the planet are well-handled visually. It features some of the best special effects of planetary annihilation that I've ever seen (and I'm a big fan of these disaster flicks).<br><br>What makes 'Deep Impact' rather unique in terms of disaster films is that it gives a very human side to tragedy and devastation by showing how ordinary people cope in times of crisis but it avoids the trap of being trite and overly-sentimental. It's a shame the film is so underrated then as it is a film that would appeal to sci-fi fans and those seeking an interesting story with strong characters.","user":"cosmic_quest","rank":[137,190]},{"title":"Fantastic and Moving","rating":9,"date":"13 March 2007","review":"Having seen such films as Armageddon and The Day After Tomorrow, I really expected this film to be basically an effects demo reel. Most disaster films fit into this category: their plot is loosely tied together with some major event; humanity is threatened, a group of heroes is sent to try to save the world, and mankind prevails over nature. The rest of the film is essentially nifty visual effects that don't do much to enhance the plot.<br><br>So when I saw the first half of Deep Impact, I was amazed. Apart from a brief montage of special effects in the opening sequence (a car crash that simply screams \"big budget\"), the movie is one of the first disaster movies I've seen that actually focuses more on the human side of the drama rather than the awesome visual effects that computers can accomplish.<br><br>Many times during the film, especially during the latter half, I felt myself touched by the realism that the actors and actresses convey. There are moments when you realize how fragile and precious life is, and that's saying something for a film of this budget.<br><br>While the visual effects are indeed impressive, there are other features that make Deep Impact a necessary film to watch. James Horner's music is strikingly similar to his previous \"Titanic\" and \"Apollo 13\" scores, but it is still hauntingly beautiful and fits the tone of the movie perfectly. Tea Leoni does a good job of portraying a newscaster attempting to cover the events surrounding her while dealing with her own personal emotions, which is undoubtedly a hard act to pull off. Elijah Wood shows his skill years before \"Lord of the Rings\" hit theaters. The other actors and actresses are very realistic and emotional, and the movie flows smoothly with their presence.<br><br>All in all, this movie is not one to be missed. Keep an open mind while watching this movie: don't watch it with the misconception that it's just going to be another one of those big-budget dull blockbuster films that gets churned out every summer. This one dares to avoid the seemingly standard clichés set by other films of the genre, which makes it a truly unique film to experience.<br><br>Score: 9/10","user":"MovieGuy2007","rank":[90,124]}]