[{"title":"So many people like this movie","rating":8,"date":"5 March 2020","review":"A film that by the synopsis should appeal to all teens but it felt like the Writers forgot that, Apart from the ending there was literally no car chases and little action, The plot was ok but even though their task was near impossible they never felt like they were in any problems doing it, It had quite a big cast and they all did their best but I don't think they really needed Angelina Jolie as she offered nothing that was needed and wasn't even used for her sex appeal, The ending was pretty fun as it felt like they saved all their budget on it, With some good chases and a few ok stunts but as I said earlier it never felt like there was any danger in completing his mission and got very predictable, It's not a bad movie but it should of been so much more fun.","user":"MR_Heraclius","rank":[36,37]},{"title":"Great movie - stop giving it such a hard time!","rating":10,"date":"3 January 2005","review":"This movie has taken a lot of stick. It was slated by critics when it came out and was blamed for wrecking Nicolas Cage's career. The thing I don't think people get is that it's not meant to be an epic, Oscar contender of a movie, it's just some brilliant \"Bruck-buster\" action at its best. Fast cars, quick editing and a great soundtrack - it does exactly what it says on the tin. Also, for anyone who likes cars its a pure treat. It has everything: Ferraris, Mercs, a Hummer and lets not forget Eleanor! I think you'd be hard pushed to find a better action movie, and personally, a better movie at all!! Then again maybe that's just me!","user":"carldaly","rank":[191,250]},{"title":"Old fashioned cat and mouse chase with a charm","rating":8,"date":"16 September 2002","review":"This movie doesn't tell you any new truth or treat your refined taste with amazing characters.  It is just an old-fashioned chase movie of the good and the bad guys.  The circumstances and the grand theft of 50 cars over one night is of course out of this world but it doesn't matter because Nicolas Cage and Angelina Jolie charm us out of it.  After watching hundreds of car chase movies in my lifetime I didn't think yet another one would lighten my eyebrow.  I was wrong.  The smart and humorous execution of the car and car/helicopter chases was a great fun to watch; a good honest adrenalin booster.  Perhaps I am little generous but I give it 8/10 for all the fun.","user":"watchhawk","rank":[20,23]}]