[{"title":"Cowboys are my weakness!","rating":9,"date":"19 June 2008","review":"It's funny, but I notice most of the prior comments are from guys, but speaking as a woman, this is by no means just a guy's flick. It's been one of my favorite films since the day it came out. It's got everything- drama, romance, action, and an honest to goodness story. There are even interesting themes, like the moral dilemma that Wyatt finds himself in-- Is he compelled to help fight the Cowboys even though he's \"retired\" and just wants to live out his life in peace? Is there a moral equivalence between killing for justice and killing for retribution? How far can a man go to sacrifice his own integrity and better judgment? Even though the Earps are the \"good guys\", the movie doesn't glamorize violence. Doc Holliday and some of the Earps' other sidekicks (\"Creek Johnson\" and \"Texas Jack\") are obviously pretty shady characters, but at the end of the day, are forced to choose between right and wrong, and they choose correctly. It doesn't get much better than Val Kilmer's performance as Doc Holliday, and I can't for the life of me understand why he didn't get nominated for it. I also appreciate the fact that the love story between Wyatt and Josephine didn't dominate the film and take away from the real plot, ala \"Titanic\". The love story simply served its purpose in helping viewers to better understand the character of Wyatt. Also the friendship between Wyatt and Doc was portrayed tenderly but not wussily. And okay, as a woman, let me just say that there is no one sexier than Sam Elliot. Man alive, if there ever was a person born to portray a cowboy, that guy is IT. If you've never seen a Western, or are not a fan, try this movie. It will make a believer out of you.","user":"princesss_buttercup3","rank":[77,81]},{"title":"I'm your Huckleberry","rating":10,"date":"28 September 2007","review":"Probably the best Western I have ever seen, if mostly due to Kilmer's outstanding portrayal as Doc Holliday. He lacks, in my opinion, much of the gruffness of John Wayne which, although good, gets boring after so many films. The look on Ringo's face when he realises his opponent is Holliday, not Earp, is priceless, and shows you just how great a reputation Doc has that a man praised as \"The deadliest pistoleer since Wild Bill\" is now making excuses not to go up against him. Russel's performance is also commendable, showing a man who has seen too much blood in his life and wishes simply to settle down, but Kilmer simply cannot be ignored as the drunken but suave gambler.","user":"www-soulreaper555","rank":[50,52]},{"title":"For Val, a role of a lifetime","rating":9,"date":"2 May 2010","review":"I wont review the film here as it has all been said before. I did want to praise Val Kilmer's portrayal of \"Doc\" Holiday. Throughout the entire film, his acting and character embellishments are so nuanced and well done that by movies end, we feel his loss in a very personal way. Credit must also go out the the costumers and make-up artists for their contribution to the overall effect of his role. All the way through the film, he looks sickly, pale and world-weary. His mannerisms and intensity of gaze profoundly establish this character as a focal point in this production. But as for what I started this off with, I consider this role as probably the very best for Val Kilmer. It required subtlety and careful restraint and made the viewer believe that we weren't watching an actor merely regurgitating lines and hitting their foot-marks. I, for one, was entranced by the carefully studied body language and facial expressions...the sweaty desperation of a man who sensed his own mortality but strove to enact his own justice for justices sake. This was just very well done!","user":"subego","rank":[25,25]}]