[{"title":"Surreal and brilliant","rating":9,"date":"6 April 2000","review":"What starts out as simple film about four siblings trying to cope with their mother's death, soon becomes a surreal tour-de-force. Peter Mullen pulls off a very tricky script and several changes of mood in the film to create something quite unique. There are some marvellous set pieces in here.   It's a brave choice to use black comedy to highlight the pain of bereavement, but Orphans triumphantly pulls it off.<br><br>It's just a shame the film company buried the film, as this is one of the great British movies of the last few decades.","user":"jack-310","rank":[7,7]},{"title":"their mummy's dead...","rating":8,"date":"20 July 2004","review":"When I checked this film on IMDB, I was surprised. Not by the popular rating, 6.7 out 10 is a good mark but by the number of votes. Only, 368 votes! How can such a good movie by largely ignored by the public?<br><br>Peter Mullan in the world of British cinema is especially known as an actor. We remember his performance in the trendy \"Trainspotting\" (1996) where he acted the role of a heroin supplier. With \"Orphans\", he decided to display his gifts as a director. He chose wisely. His real debut movie is, by any standards a remarkable one. However I am obliged to recognize that for his first direction, the place of the action which the city of Glasgow in Scotland has nothing welcoming. Indeed, most of its inhabitants are narrow-minded or unpleasant. I read a few reviews about Mullan's film and all of them had said that Glasgow's inhabitants are really like this. If it is true, truth is stranger than fiction.<br><br>But also Mullan for his first directing chose a tough topic: what can be the childrens' reactions following the death of their mother? To answer this question, the filmmaker divided his movie in 4 individual parts. Each one focuses on one of the 4 main characters. Thus, we can say the following answer to the quoted question: either with violence (John, the college boy who tries to prove himself as a hard man) either with obstinacy (Thomas, the holier-than-thou chief mourner who wants everything to be perfect for their mother's funeral). As for the two others, Michael and Sheila, they feel especially lost. What Mullan tries to reveal to the spectator is that these reactions are necessary because this painful hardship represents for them the definitive transition in adulthood and maturity. The very last sequence shows the three brothers and the disabled sister together and they seem more united.<br><br>\"Orphans\" is a movie that swings between humor and poignancy, violence and calm with ease. Moreover, the moment when the roof of the church is torn off by the wind gives the film a little surrealist air. In short, it easily ranks among the best British movies of the nineties and it deserves to be better known. At last, given the success of \"the Magdalene sisters\" in 2003, Peter Mullan is well away to become one of the finest British directors of these last years.","user":"dbdumonteil","rank":[13,15]},{"title":"So misunderstood...","rating":29,"date":"29 October 2003","review":"I've noticed that what people seem to miss in their reviews of this fine movie is that the characters aren't really supposed to be likeable.  This is not a Meg Ryan romantic comedy, it's a tough, gritty ultra-realistic portrayal of the poor sections of Scotland's largest city and the people who inhabit them.  I mean really... if you're looking for \"Sleepless In Seattle\", this movie is not for you.  If you're concerned about the language - as some previous reviewers have been - take my advice; avoid this movie and avoid Glasgow.  People really talk like that.<br><br>Mullen, already an accomplished actor both on stage and film, shows that his talent stretches far beyond performance and delivers both in the script and directorally a solid and enjoyably depressing movie with equal laughs and tears.  It puts the viewer on a relentless, unforgiving emotional rollercoaster; up in parts and down the next with little warning and not much time to adjust.  This makes for uncomfortable viewing at times, but therein lies the genius behind it.  <br><br>It amazes me that people waste time on the pointless \"Trainspotting\" when gems like 'Orphans' (and \"My Name Is Joe\") are around.  It's masterful film-making, taking realistic characters and settings down dark and noirish surrealistic scenarios with spot-on performances by all.  If you know Glasgow, you'll see it in all its glory, good and bad, perfectly portrayed on the screen.  If you're not from Glasgow but you have an open mind, don't miss it.<br><br>And remember... every f**ker loves Connolly.  ;)","user":"Spikey-2","rank":[7,8]}]