[{"title":"The hidden gem of 2000","rating":10,"date":"9 February 2019","review":"I saw this movie when it came out, and still love it today. It stood the test of time very well. Can't see how anyone wouldn't like this movie. The special effects are still on par, or even better than, some special effects today.","user":"rdoubleoc","rank":[20,21]},{"title":"Hollow plot and characters but visually fantastic","rating":14,"date":"14 November 2003","review":"Sebastian Caine and his team have worked tirelessly to develop a formula that can not only turn animals invisible but also bring them back to normal at will.  With Governmental pressure on them to show results, Sebastian decides he will be the first human to try the formula.  He becomes invisible for a short time, however efforts to bring him back fail and he finds himself stuck.  As work continues on the formula, the others in the lab begin to notice him becoming increasingly unhinged.<br><br>From director Verhoven the norm is to expect great special effects and violence.  He has also been known to integrate themes and good stories into these mainly effects driven films.  On this occasion however he fails to really do that and is left with a fast paced and enjoyable film that makes up in effects what it lacks in substance.  The plot is pretty basic and never goes deeper  Sebastian's descent into madness is not really a descent so much as a short trip that is not really built to so much as just delivered.  In it's placed though, the effects are really impressive and make the film worth seeing simply because, not only are they great, but they are also used very well in the action rather than just being the film in themselves.<br><br>The cast is OK but don't really have much to work with in terms of material. Bacon is much more interesting when not on screen than when he is.  His character is too thin and he fails to portray any sort of `descent' in his character's behaviour.  Shue is pretty good and seems to enjoy running round with a flamethrower.  The rest of the cast are OK but basically just act as fodder in the way that a normal slasher movie will have actors to be disposed of as the film rolls.<br><br>Overall I really enjoyed this film as it is a very expensive special effects movie which relies on spectacle to keep things moving.  The effects are great and take the mind away from the lack of real substance and the action at the end is very enjoyable.  A really good special effects movie as long as you don't expect anything more.","user":"bob the moo","rank":[77,90]},{"title":"Gruesome, Spine-Tingling, Invisible Man Gone Mad Flick","rating":7,"date":"12 June 2005","review":"A Pentagon science team seem to have perfected a serum which causes invisibility but when the lead boffin tries it out on himself he can't reverse the process. Frustrated and drunk with power, he turns psychotic in the classic H.G. Wells tradition.<br><br>This is a gleefully horrible Invisible Man story, delivered with relish by the ever-tasteful Verhoeven and Bacon as the genius-turned-loonytoon-maniac. As with much of Verhoeven's work it has a terrific unrestrained sense of Boy's-Own comic-book adventure (the secret underground lab where the scientists work is just wonderful) combined with the most horrific and depraved visuals (women in their underwear being groped and attacked by an invisible fiend, animals beaten to death, literally gallons of blood and wholesale slaughter in the last two reels). Whilst the story doesn't ring any new twists on an old idea, the CG special effects by Scott E. Anderson are eye-poppingly brilliant as we see veins and arteries, cardiovascular systems, muscles, tissue, bones and flesh all literally appear out of nowhere. In particular, a sequence where the team bring a gorilla back from the invisible state and the scene where Bacon drowns Devane in a swimming pool, are absolutely breathtaking in the detail and artistic invention of the effects. The film also has a great soundtrack by Jerry Goldsmith and classic horror-movie photography by Jost Vacano. The young cast are pretty much overshadowed by the movie's technical pedigree, but both Shue and Dickens are impressively out of their depth. This is a great fun nasty movie.","user":"ShootingShark","rank":[28,32]}]