[{"title":"So underrated and unappreciated...","rating":8,"date":"21 November 2002","review":"In November of 1999, a very strange thing happened.  An intelligent action film filled with well-drawn characters, an unconventional plot structure, and a storyline that required you to pay attention.  Stranger still, it was a James Bond film, a series widely regarded by the mass public as `fluff' when Bond films have actually been among the prime example of properly done plot-motivated action pieces.  The highly underrated `The Living Daylights' comes to mind.<br><br>But the strangest thing is the critical thrashing `The World Is Not Enough' received.  From Entertainment Weekly singling it out as a reason to overhaul the Bond franchise, to Internet critics (cough Harry Knowles cough) soundly trashing it in long, diatribe-filled electronic pieces.  The fact that Harry praised the previous entry `Tomorrow Never Dies' (or as a friend described it, 12 pages of script and 90 pages of storyboards) as the best entry since `The Spy Who Loved Me' only leads to my conclusion that the critics and movie-goers of today have firmly and finally `checked their brains at the door' so to speak.<br><br>The range of critiques for TWINE is stunning.  I have read dismissals of the first fifteen minutes as nothing more than one action sequence after another, despite the fact that the opening teaser has direct relevance to the storyline and contains more complex plot structure than the aforementioned previous entry, TND.  Claims of it being `boring' and `dull' were often tossed about.  Even the fact that Bond actually expresses discomfort was singled out as a major flaw.  See my above `brain-checking' comment.  But I am not here to make TWINE look good exclusively in comparison to TND, so here goes.<br><br>TWINE had me from the start, from Bond's instant realization of the money bomb.  I knew I was in good hands from that point on.  Indeed, in an era of clumsily handled twists and blindingly obvious revelations, the Electra King twist completely threw me.  I had my suspicions, just as James himself wisely did, but I didn't want to believe it.  Again, just like James.  I could go on for a good half-hour about M's shock when she sees exactly what she and MI6 have created in 007.  His cold-bloodedness has never been on bigger display in recent ventures, save a few select moments. (`For England James?  No.  For Me.')  Make no mistake about it.  Bond is first and foremost a trained killer in this outing, firmly focused on carrying out the will of MI6, even at the cost of.<br><br>The action sequences serve the story for a change, and each carry emotional weight, resulting from character's needs beyond that of eliminating Mister Bond.  Two of the primary sequences are ploys by the main villain, blatant attempts to misdirect rather than outright kill for the sake of killing. Indeed, misdirection and misreading motivations are the primary plot movers. By the end, everything believed by our antagonist neatly shifts into reverse.  And thankfully, the `one-man army' Bond of late is greatly reduced here, pitting Bond against more realistic odds.<br><br>The small moments count too.  The high-backed chairs at the MI6 briefing. Zukofsky's small moment of delight upon seeing Bond's new Beemer sliced in half.  The expertly placed shot toward Renard's head, blocked by safety glass.  Elektra's emotional breakdown when trapped inside the avalanche (but faked or not?)  And Zukofsy's silent communication to Bond to take care of business for him.  Reverence and respect is held for the series' past, even Bond's marriage is referenced as he dodges Electra's query as to whether he's ever lost someone that he loves.   Heck, these days even a lone `Universal Exports' reference would be considered gold, but the writers of TWINE have obviously done their studying.<br><br>If TWINE has any weaknesses, the action sequences are not always staged at the series' prime.  Although the raid on Zukovsky's factory is executed beautifully and is a superb set piece for Bond, some clumsy editing and lensing weakens the ski sequence and the climactic fight on board the Victor II sub.  David Arnold's score is under-mixed; giving the movie a bit too much subtlety in moments the grandness should be spilling into the theater (commercial or home).  And of course, Denise Richards is just plainly miscast for the part of Christmas Jones, which screams for someone of greater maturity.  As someone on the Internet said `Bond girls should have class, not be late for it.'  Can't argue much there.<br><br>In closing, I hope the producers choose to ignore the gnashing of hypocritical teeth and continue on a similar path for the next Bond film. Do not return to a one-set-piece-after-another film.  Have faith (however small) that the audience will wake up.  I know I for one will be there, hoping that the next film will live up to the lofty (if unappreciated) standards of 'The World Is Not Enough'.","user":"jwielgosz","rank":[146,207]},{"title":"\"I thought Christmas only comes once a year.\"","rating":8,"date":"4 November 2007","review":"The film opens with a formidable assassin who had recently posed as a banker's secretary She had given Bond a cigar, before killing her boss in the Swiss banker's office in Bilbao, Spain <br><br>Now, when a bomb blew a hole in MI6's London headquarters, the super spy sped off in the Q boat, ignoring Q's plaintive cry, \"Stop\" Stop! It isn't finished!\" It was Q's fishing boat for his retirement There's a splendid boat chase along the River Thames between 007 and the stunning Maria Grazia Cucinotta, the \"Cigar Girl\"  who worked as a barmaid at the village inn in \"Il Postino.\" Bond was eager to capture her for questioning<br><br>When a bomb planted in a briefcase of money killing British oil tycoon Robert King, M was determined to bring the perpetrators to justice The prime suspect was Renard who had once kidnapped King's daughter, Elektra M (Judi Dench) believed Elektra was next on Renard's list and 007 was assigned to act as her \"shadow\" while she supervised the building of an oil pipeline in Azerbaijan Yet despite his powerful urge to protect her, there was something about this beautiful, cunning, willful woman that aroused his suspicions <br><br>Bond flew to Azerbaijan, where King Industries was building an oil pipeline Elektra gave 007 a 'cold' reception, taking him up into the snowy peaks to the pass where the two ends of the pipeline would soon meet... It was then that unsocial 'visitors' struck <br><br>Sophie Marceau plays the magnate's daughter Elecktra who had once escaped Renard's clutches all by herself Her favorite motto: \"There's no point in living if you can't feel alive.\"<br><br>Robert Carlyle plays Renard, the former KGB hit-man who had set up his own organization and demanded fanatical loyalty He was a murderer, a terrorist, and a kidnapper His only goal was chaos Subordinated who failed him killed themselves rather than face his wrath After Robert King came to see M, she sent 009 to kill Renard 009 caught up with him and put a bullet in his headThe bullet was now killing off all his senses and was impervious to pain Renard was determined to pull off one last coup against the West But his motivations were motivated by blind hatred, or blind love? <br><br>Goldie plays Bull, Zukovsky's shifty, gold-toothed bodyguard He was a menace to his boss and an important Renard spy<br><br>Denise Richards plays Christmas Jones, the sexy atomic scientist overseeing the dismantling of the Kazakhstan nuclear test site Dr. Jones became an invaluable ally of 007's following Renard's theft of a nuclear bomb <br><br>For \"The World Is Not Enough,\" Q equipped Bond with the faster car 007 had ever been entrusted with: the MBW Z8, armed with a radar-guided missile system... <br><br>Robbie Coltrane returns as the duplicitous Russian black marketeer Valentin Zukovsky whose ebony walking gun stick seemed a typically showy affection - but it had its uses... <br><br>A final sad note: \"The World Is Not Enough,\" marked the final appearance of the beloved Desmond Llewelyn, who acted from 1964 to 1995, except for \"Live and Let Die.\" A perfect foil to 007's lighthearted nature Q has been one of the series' most enduring character...","user":"Nazi_Fighter_David","rank":[65,98]},{"title":"My favorite Bond film","rating":10,"date":"30 July 2011","review":"THE WORLD IS NOT ENOUGH has to be my favorite James Bond film. It seems that Pierce Brosnan's Bond films have the longest teasers (pre-credits sequences) in the series and the River Thames chase was a brilliant start, not to mention well-filmed with the London background. The action scene that stands out from them all in the film is the helicopter attack on the Caspian Sea. The plot is very interesting with twists and turns with all the oil involvement, and Pierce perhaps gives his finest Bond performance in his four outings.<br><br>Robert Carlyle makes a chilling villain as Renard (he's already dead and can't feel pain), but the biggest highlight of TWINE is the two leading women: Sophie Marceau and Denise Richards. Marceau is very well-cast as villainess Elektra King and is perhaps the best Bond villainess since THUNDERBALL's Fiona Volpe. Richards is a gorgeous actress and she's very charming and fun as heroine Dr. Christmas Jones. These are two of the most beautiful and sexiest Bond girls in the series; you are going to love both of them.<br><br>With its well-staged action, epic plot, Pierce's wonderful performance, and two brilliant Bond girls, TWINE is a Bond adventure both Bond fans and non-Bond fans will treasure. ****","user":"drewmcd2011","rank":[30,42]}]