[{"title":"Great from start to end","rating":27,"date":"27 September 2000","review":"The third Aladdin film is not as good as the first film, but better than the second. Animation is vastly improved over the last one, but still can't compare to the first. Hey it's a direct to video movie, so it won't get the big budget of a theatrical release. Robin Williams is back as the Genie and is as hilarious as ever. I don't care if he was over done or not, he was very funny and vital to the movie. The songs were much better than people make them out to be. This movie had a great story and was a fitting end to the Aladdin story. Thumbs way up on this one.","user":"Op_Prime","rank":[12,12]},{"title":"A Worthwhile Sequel","rating":7,"date":"6 March 2000","review":"I enjoyed this sequel to \"Aladdin\". Another of Disney's direct-to-video releases, the movie features decent animation, a good story, and music that is pretty good.<br><br>In the story, Aladdin goes in search of his father. Upon discovering him, he finds that his dad is the leader of a gang of thieves.<br><br>I enjoyed the movie and it was nice to see (or hear) Robin Williams providing the voice of Genie again. \"King Of Thieves\" is a great improvement over \"Return Of Jafar.\"<br><br>In the original \"Aladdin\", the animation of the flying carpet was computer generated. Here, it is done with conventional animation. There did not appear to be any extensive computer animation in \"King Of Thieves.\"<br><br>Still, I thought that was okay. This is a made-for-video picture, and obviously it would have been made on a much smaller budget. This was a movie that was meant to be seen on television screens. <br><br>I relish that Disney has made some fine direct-to-video sequels. Most are pretty good. \"King Of Thieves\" is worthwhile. Disney's first made-for-video picture was \"The Return Of Jafar\" (the first \"Aladdin\" sequel). \"Lion King II - Simba's Pride\", and \"Pocahontas II - Journey To A New World\" are others. I recommend all of them.<br><br>Give Disney some credit. These are great additions to my Disney Library.","user":"GEM-20","rank":[14,15]},{"title":"Good enough to watch, but not my favorite Disney sequel","rating":6,"date":"29 March 2004","review":"I know that a lot of people had preferred Aladdin and the King of Thieves over The Return of Jafar, but honestly I thought it was a notch lower. Don't get me wrong, I did enjoy this movie but it was just an alright story. One thing that I really did love about it though is that we do have the original cast back and the animation was really lovely. The problem I had though is that at this time we did have the Aladdin animated series, which was awesome to watch, but this felt like a story that they could have just done on the TV show. Aladdin finally gets to meet his father, but of course this wasn't exactly what he was expecting, maybe he was expecting a Ward Cleaver type of guy, but hey, this is Aladdin after all.<br><br>Aladdin knows his future is being married to Jasmine but can't remember most of his past. But he remembers that his mother died when he was a child and he never knew his father. The oracle, however, reveals that his father is actually still alive. Aladdin chooses his question and asks about his father's whereabouts. The oracle reveals that his father is with the Forty Thieves, trapped in their world. Believing him to be their prisoner, Aladdin tracks them down and stows away into their hideout. He is shocked to find that his father is not their prisoner at all, but their leader: Cassim, the King of Thieves. But, family or not, Aladdin has trespassed in their lair and Sa'luk, Cassim's irate right-hand man is eager to have him punished for it. Cassim, however, suggests that Aladdin instead face \"the Challenge\" - an initiation ritual - where he must defeat another one of the Forty Thieves and take his place. Sa'luk volunteers to fight Aladdin. The two engage one another in a fierce battle which ends with Sa'luk falling into the ocean. Afterwards, this gains Aladdin a place among the Forty Thieves. Sa'luk however, has survived the fall, and makes his own plans for revenge against both Aladdin and Cassim. Aladdin and Cassim bond, and it is then that Aladdin learns the true motives behind the raid and his father's leave of absence from his family: he had discovered evidence of the existence of the Hand of Midas, a powerful artifact that can transform anything it touches into solid gold. Cassim believed that, with the Hand, he could return to his family and give them the life they deserved instead of one living out in the streets, and had instigated the raid so he could capture the oracle's staff so he might question the seer as to the precise whereabouts of the artifact. Only, Aladdin had stopped him. Aladdin convinces Cassim to come back with him to the Palace as his guest and, for a while, he is happy to spend quality time with his son. Cassim meets with Jasmine, Genie and the Sultan, and they immediately take a liking to Aladdin's father. But Cassim may still be up to his old tricks as Aladdin still tries to fill the relationship that he never had with his father.<br><br>So is Aladdin and the King of Thieves worth the watch? Yeah, I did enjoy this movie over all, it's a lot of fun and it was cool to have Robin Williams bring life back into the genie. The animation was really great and I loved seeing the action sequences between Aladdin and his father. The effects that the animators put into this movie was great and very entertaining. Then on top of that, Aladdin and Jasmine are finally getting married! They invited you to come along as well! Well over all I do recommend that if you're looking for a cute family film, this is a good one, I just preferred Return of Jafar a little more, but it's all good, this was still a worthy sequel and a good finish to the story of Aladdin.<br><br>6/10","user":"Smells_Like_Cheese","rank":[34,42]}]