[{"title":"Just don't take it seriously","rating":8,"date":"12 April 2004","review":"Wow, there are a lot of bad votes for this movie here. I thought it was great. It's a Will Smith / Barry Sonnenfeld movie. You can't take it seriously. The humor is perfectly subtle and dry at times, and over the top at others. The storyline is only there to give opportunities for the jokes.<br><br>If you want a serious western, try The Magnificent Seven (or the original, 7 Samurai), Hombre, or some other classic. If you want a light-hearted evening, rent this. Probably don't buy it, but rent it.<br><br>For some reason it says that my review has to be more than 10 lines, so I'm throwing this in to make it work. Really a review for a movie like this doesn't need to be this long, but I guess I'll just comply.","user":"Jonkun227","rank":[225,342]},{"title":"I don't understand the hate for this film!","rating":7,"date":"1 September 2018","review":"If you don't take it too seriously, Its a fun and entertaining film. I don't understand why people hate it so much!","user":"ollie_killick","rank":[25,34]},{"title":"Lame bloated blockbuster","rating":30,"date":"30 April 2000","review":"`Wild Wild West' joins an increasingly long list of big bloated blockbusters, movies made for no possible reason beyond grabbing a quick summer buck yet which, ironically, by their very cynical and slapdash nature, utterly fail to connect with even the least demanding of audiences. The result is a multi-multi-million dollar debacle that leaves studios searching for answers and audiences shell-shocked into seeking out their entertainment along the more audacious pathway of off-Hollywood, independent filmmaking  the single positive outcome of these dull, empty enterprises.<br><br>`Wild Wild West,' like so many films before it, looks to the relics of television's bygone era for inspiration  as sad a comment as any on the dismal state of current movie creativity.  As one not familiar with the original series, I cannot say what justice, or lack of justice, this homage does to its source.  What is evident, judging from the results on screen, is that `Wild Wild West' is, as with most current blockbusters, top-heavy with special effects and as weak in the nether limbs as its legless villain. Straight Westerns being hopelessly out of fashion, especially for a special effects-driven summertime extravaganza, the filmmakers obviously felt that what was needed was a tongue-in-cheek approach to the material, resulting in a bizarre, but completely unfunny amalgam of fantasy and science-fiction gilded onto a Western format.  The disparate styles simply fight against each other, leaving no one in the audience - neither Western nor science-fiction fans - satisfied.<br><br>The alleged plot involves the attempts by James West (Will Smith) and Artemis Gordon (Kevin Kline) to foil an evil Confederate inventor's plan to kidnap all the world's most brilliant scientists and, ultimately, terrorize the  Union and President Grant into submission.  This he attempts to do by creating a giant mechanized spider which is, obviously, a last ditch, desperate attempt on the part of the filmmakers to fulfill the seemingly insatiable demands of the modern audience to be dazzled by impressive special effects, no matter how inappropriate they appear in context.  Here, though, the miscalculation is fatal because even the audience is wise enough to know when it is being had.  Kline and Smith never achieve a palpable rapport despite the usual abundance of lame wise cracks and sarcastic asides designed to make them `hip' and `trendy'   two qualities incongruous to the setting, which again shows the lack of real commitment to the spirit of the project.  There is exactly one clever moment in the film  an astonishingly creative homage to the old RCA logo  that hints at what might have been had the moviemakers been willing to really let loose their anarchic imaginations and aimed for something truly sophisticated rather than simply pasting together a series of confused, poorly written blackout sketches.<br><br>Incidentally, even some of the expensive special effects come across as surprisingly crude, especially many of the shots utilizing rear-screen projection.  Hence, this film strikes out even in the one ballpark in which it might have stood a chance of emerging victorious.","user":"Buddy-51","rank":[119,192]}]