[{"title":"Fantastic, today's Neo-realism","rating":3,"date":"3 February 2005","review":"Whilst watching this film i was struck by how natural and simplistic the film was. A film director and his son travel through Iran after an earthquake has struck to try and see if the boy who starred in his last film is still alive. That is what the film is, observing people on the road, whose lives have been destroyed, people whose lives still go on. Kiarostami presents life in such a naturalistic way that we are sitting in the back seat of the car taking the journey as well. That is the perfection of the this film, the real life, the carnage of life, the people striving for life, all add up to one up-lifting experience. Like Rossellini with a uplifting finale, and minus the melodrama. Kiarostami seeks to capture reality on film in a similar way as the Neo-realists, through humanity and observation, but while the Neo-realists films can be seen as natural, Kiarostami reinvents naturalism as if nature had shot the film itself. Yet another piece of perfection from Kiarostami, not to be missed.","user":"GregSinora","rank":[18,19]},{"title":"9/10","rating":9,"date":"11 November 2004","review":"This is the transition from Kiarostami's films about children into his more adult, philosophically ponderous phase (and his bridging of the gap between characters searching on foot, as in the first of the trilogy, \"Where is the Friend's Home,\" and within cars). As with all of Kiarostami's films, it's just beautiful to look at, not so much the way he films it (although this film continues his favorite shot of action taking place extremely far away), but what is filmed. For this reason I almost feel like I'm blinded by the director's name on the film, giving his films such high marks, because he doesn't really DO anything that you can point to. There is no startling mise-en-scene (the nature exists anyway, regardless of his camera). But he repeatedly and consistently creates a tranquil, pure, loving feeling in me. It has to do with his soul: he's putting it up there every time. Not autobiographically, but tonally. It has nothing to do with words like \"craft\" or \"quality.\" <br><br>The simple gesture of a child wanting to raise a grasshopper is enough for Kiarostami to be considered a great realist, an observer. And his film is a connector of people. It might sound simple to say, but for a Westerner with no real idea of what life is like in Iran -- or better, not life, but people -- the simple depiction of it that shows, \"Hey, they're basically like us,\" is invaluable. That's the difference between artists who share what is and artists who create what isn't. And more immediately, within the film, he deals with the public tragedy as great connector, whether it's an earthquake or an act of terrorism. And for us Westerners whose first real impression of that came with 9/11, this film will ring true -- and be remarkable if we consider that things like this happen over there all the time. (Which possibly explains why our main character never seems all that shocked by anything he sees; when a woman cries for her family, he nods his head, but doesn't seem terribly affected by her tears.) One character here asks what Iran has done to anger God and cause the earthquake, but there is little religiosity in the film. Unlike certain recent American films, this film does not have a tendency toward hand-wringing and overwrought seriousness reaching toward the skies. That scene itself is understated like the entire film. The characters here are not spiritual ciphers. They're utterly practical. <br><br>As with Kiarostami's two greatest films, \"Close-Up\" and \"Taste of Cherry,\" the film becomes brilliant when it breaks from its placid realism into self-reference: the main character pulls out a picture of a boy who acted in the real film \"Where is the Friend's Home?\" and asks strangers where this real boy is, who he says played a role in the film. Is this a real earthquake? Is this actor really harmed? Is this a documentary? Is the main actor playing Kiarostami; is Kiarostami filming this from the passenger seat? Are they really out looking for this boy? But as with those two masterpieces, it's this that borders on insufferable, smirking cleverness on Kiarostami's part that makes me question the so-called honesty of his films. (I find his interviews pretentious and evasive.) Is it possible to be a self-referencing deconstructionist and reveal human truths, not just reveal \"the nature of cinema,\" in an attempt to be the Iranian Godard? This is what lessens my enjoyment of his films, because it lowers my trust. Kiarostami asks a lot of us. \"Okay, admit the first film was openly a film, but accept this as a closed film, until I tell you it's a documentary...\" There are other flaws. It does get \"cute\" at times, as when the main character repeats his son's question at a later time (\"Why is it coming out of a tap?\"). And the boy seems preternaturally wise -- part of the film's \"message\" is not to discount kids' wisdom: the boy questions the validity of the claim that God caused the earthquake, shocking one woman that he and his father come in contact with throughout their travels. <br><br>However, there is so much richness elsewhere (and I'm willing to accept that the layering of the self-reference adds to the film, even if it makes it momentarily annoying) that you can move beyond its flaws (which, honestly, I would accept pretty easily in another film; with Kiarostami you have expectations in the clouds). I'm particularly interested in the way children (and the child experience as remembered or experienced by an adult) are presented on screen, and I'm continually ecstatic that we have Kiarostami contributing to this. (That the main character's son describes one boy from \"Where is the Friend's Home?\" by his eyes is appropriate, as when we see him they are indeed strikingly beautiful.) The film is also an interesting comment on what happens to people after they work -- Falconetti comes to mind. And the ending is already a classic: it's like the swimming pool scene in \"Nostalghia\" in tone. Does what happen happen because the film has to end that way, or because of the human spirit? (This is one of the few scenes where music plays under it.) <br><br>Even though the movie has no end, only a means, it moves forward like a good documentary. Even though time is not indicated (there are few, if any lapses; time is experienced, as in Tarkovsky), it moves along at a nice pace -- not so much in that the story is brisk, more in that we've settled into its own rhythm. There is no \"story,\" only the story of film as experience. Lots of Big statements could be inferred from the film -- it's about an endless journey with no resolution to a place they don't know how to get to (college students, get your pens out) -- but I take it directly. 9/10","user":"desperateliving","rank":[25,28]},{"title":"A Human Look at Iran","rating":7,"date":"20 June 2017","review":"After the 1990 earthquake in Iran that killed over 30,000 people, Kiarostami went to search for the stars of his previous film \"Where Is the Friend's Home?\". This film is a semi-fictional work based on these events, shot in a documentary-style. It shows a director (played by Farhad Kheradmand) on this journey through the country in the aftermath of the earthquake.<br><br>While this is a really beautiful film with a rather simple plot, there is something a bit more than that going on. Of course, it also has something of a \"meta\" feel because the film references another film, thus being both that film's sequel, but also outside of it in a way.<br><br>For Americans, the film also offers a very human look at tragedy. For reasons not entirely clear to me, Iran is seen as America's \"enemy\". This is foolish, given that the problem is the government and not actually the Iranian people. This film makes that perfectly clear, with some of the most innocent, caring folks you would ever hope to meet. Whatever caricature we are supposed to have in mind about Iran, you will not find it here.","user":"gavin6942","rank":[5,5]}]