[{"title":"An exceptional biopic - vivid but highly entertaining, amongst other things!","rating":23,"date":"23 October 2000","review":"Once you became a Bruce Lee addict and begin seeing and reading the numerous different biographies and biopics, you're going to realise that DRAGON has quite a bit of fiction in it - and in the bits you don't really expect it to.  For example, Lee approached Raymond Chow's Golden Harvest production company to make a marital arts movie, not the other way round and Chow isn't even the guy!  Also, due to Lee's 'mysterious' death, the film also doesn't really an idea of how its going to wrap it all up.  Therefore, the film is the perfect example of the word 'vivid'.<br><br>However, what makes Dragon the fine film that it is is that it decides to look at the two lesser-known aspects which dominated Lee's life - his long, ongoing 'battles' with an inner-demon and of course the racism of sixties America.  These are managed and brought to the screen extremely well although to be fair they aren't particularly well developed.<br><br>\nThe highlights would have to be the performances of Jason Scott Lee as Bruce and Lauren Holly as his devoted wife, Linda.  They share a remarkable chemistry together and are certainly a credit to their subjects.  This review probably hasn't made Dragon sound like a very good movie.  Well if that's the case, then please think the opposite.","user":"lawrence-14","rank":[40,44]},{"title":"Cult Movies 52","rating":7,"date":"15 January 1999","review":"52. DRAGON: The Bruce Lee story (action, 1993) A re-telling of the life of legendary martial-arts star Bruce Lee (Jason Scott Lee). From his brief childhood days in Hong Kong, to his days as a dishwasher, martial-arts teacher and eventual cinema superstar in Hollywood.<br><br>Critique: The life and death of Bruce Lee has inspired many a film and documentaries since his death. Most of these accounts center around Lee's 'mysterious' death from a 'brain edema', never developing anything really new of interest, just speculations. Incredibly it took over 20 years for a film to finally put to rest the many theories and innuendo. <br><br>\"Dragon\" is by far the best of the legendary Lee story, not only for omitting the many death scenarios but also for giving us the closest account of the man. Apart from these welcome omissions, the film wouldn't have worked without Jason Scott Lee in the role. He gives a spirited, charismatic performance that captures the zest for life that Lee possessed. It's a long way from one of his first 'extra' roles as an Asian immigrant in the rather forgetful \"Born in East L.A.\" (1988). Scott Lee is totally appealing here, taking on such a legendary figure and making us believe that Lee is truly up there once again on the screen. <br><br>The film's major theme of the \"demon curse\" Lee's family inherited, had a frighteningly real resonance when, after the movie premiered, Lee's eldest son Brandon (for whom the film is dedicated) was accidentally killed on the set of \"The Crow\". This would prove to be his breakout film, just the same way Lee's last film, \"Enter the Dragon\", made him a world wide superstar. This gives the film an added prophetic note that puts it in a category all its own. <br><br>Based on wife Linda Lee Cadwell's book, \"Bruce Lee: the man only I knew\", directed with skillful restraint by Rob Cohen (who also co-scripted). Randy Edelman created the unforgettable musical score (you'll be humming the tune long after you hear it).<br><br>QUOTES: Linda: \"All these years later people still wonder about the way he died. I prefer to remember the way he lived.\"","user":"TYLERdurden74","rank":[48,58]},{"title":"Superb Character Portrayel by Jason Scott Lee","rating":8,"date":"20 January 2005","review":"This film as a stand alone kung fu movie would be worthy of your attention, as it is very enjoyable and well made. The thing that makes it special is Jason Scott Lee's portrayal of the legend that is Bruce Lee.<br><br>He successfully captures his mannerisms, attitude and even his fighting style, extremely convincingly (a truly remarkable feat of acting ability.)<br><br>Although dramatised to heighten your viewing pleasure, the story actually follows the events in Bruce Lee's life and shows us the man behind the martial arts, covering his inner turmoils and personal struggles as well as his famous physical ability.<br><br>A great movie, befitting the legend that is Bruce Lee.<br><br>8/10","user":"mjw2305","rank":[53,65]}]