[{"title":"Another tedious 'corridors underground' horror movie","rating":2,"date":"1 February 2017","review":"Lance Henriksen is the name actor in this Wes Craven produced horror film. Set in an underground desert facility, it follows the events that happen after some government scientists inadvertently create a humanoid monster when they inject a virus into a dying man in order to save his life.<br><br>I have a bit of an immediate dislike of any sci-fi or horror films that fall under the category I can best describe as 'corridors underground (or in outer space)'. These low budget genre films feature characters running away from a deadly enemy in confined locations with lots of corridors. The reason so many of these types of movies are made is that the sets required can be cheaply knocked together. The issue, however, is that the vast majority of them turn out to be very tedious and highly unoriginal. Mind Ripper is another in this line of not very good movies. This one throws some highly uninteresting family melodrama into the mix and needless to say it doesn't add much value. The best moment for me was probably the part where the monster suddenly killed all the sympathetic characters in a frenzied attack; I was thinking at the time that this was quite interesting and a nicely unexpected turn of events. Turned out it was a dream sequence from the monster's perspective. Sigh.","user":"Red-Barracuda","rank":[9,11]},{"title":"You really need to be drunk to enjoy this","rating":30,"date":"30 August 2004","review":"I just bought this as part of a Wes Craven DVD box set (along with Scream, The Hills Have Eyes, and The Last House on the Left) and felt ever so slightly conned. The film is not directed by Wes Craven (he has an executive producer credit) and a dream box set would omit this sci-fi B-movie in favour of Nightmare on Elm Street (I would settle for The People Under the Stairs). <br><br>With that being said, this is an ideal film for watching with a gang of drunk mates after a night in the pub. It's a creature feature in a remote claustrophobic environment and it ticks along quite nicely on a sub-Alien template, taking advantage of all the usual sci-fi horror clichés. The monster is cheap but effective and it is sympathetically played. The rest of the characters are just monster fodder and are badly underwritten, though a father-son theme breaks through to complement the monster-creator theme. Lance Henrikson, the brunette girl in the shower, and the bloke who plays Phoebe's brother in Friends are worth watching. The rest of the cast stink. There are enough gruesome moments to keep a drunken audience's interest. It's also fun ticking off the clichés as they mount up, and laughing at the obvious dialogue. I defy anyone (after a few drinks) not to laugh at the last scene.<br><br>So not a classic sci-fi horror, but an entertaining mess of a movie with redeeming qualities, best viewed with friends and alcohol.","user":"WagonWheelTable","rank":[18,26]},{"title":"Well, Lance Henriksen is in it... that's a plus","rating":4,"date":"13 September 2003","review":"A 'Wes Craven presents' movie from 1995, directed by Joe Clayton and starring Lance Henriksen. A group of scientists save a dying man they find by their desert stranded government outpost by injecting him with their experimental virus, of course, one of their colleagues goes overboard and the virus transforms the man into a near unstoppable monster with them trapped inside. Lance Henriksen plays the morally offended researcher who leaves the project before all this, but returns after receiving a call for help to save the man (pre-unstoppable death machine mutation).<br><br>Deciding to combine two trips in one he brings his family along with him (they're going on vacation afterwards) and proceeds to give them entry to the top secret government facility, thus putting them right in the middle of the chaos within. In case you can't tell, this one relies on the viewer to work with it a little and put aside some petty (see: major and blatant) details.<br><br>Overall though: Watch-able with mild bits of enjoyment. Note: The Outpost is commonly known under the title 'Mind Ripper'","user":"DiesIlla","rank":[9,12]}]