[{"title":"A great children's film!","rating":10,"date":"26 April 2004","review":"When I grew up I watched A Goofy Movie ritually, and it never ceased to entertain me. This is a great children's film and can still relate to today's kids. The humor is enjoyable, the characters are lovable. The music is definitely bearable, whereas with most musical animated films the songs can really grate on the nerves. Perhaps it's just because I practically was raised on this film that I enjoy it so much, but I have given it to my little brother and he loves it as well. It's a great experience for any kid and shouldn't be missed. It's even a little fun for adults, and I am not ashamed to say I still enjoy it as well. A Disney classic! 10/10","user":"stargunner","rank":[43,44]},{"title":"I love this movie","rating":9,"date":"16 April 2002","review":"OK, I'm a grown up man and I love this movie. I know I have kids but shouldn't I want to watch grown up films? Maybe this is actually just a good movie that adults and kids alike can enjoy.<br><br>This is a well underrated full-length cartoon movie about Goofy taking his son Max camping for the summer vacation. You know what Goofy is like from his appearances in Mickey Mouse films and the name Goofy sums it up. To make things more interesting, Max is wanting to be the cool kid in school and his dad is an embarrassment.<br><br>The trek across the States in Goofy's little car and all the madcap things that happen to them reminded me of the original \"Vacation\" film only for kids and a little funnier.<br><br>The music in this film is excellent. Some of the tracks could have been singles in the charts in their own right. Maybe not nowadays though.<br><br>If you have kids then they will love this film. If you don't have kids go to the video shop, hire it out and pretend it is for the kids.","user":"steve-862","rank":[48,51]},{"title":"More Then A Disney Kids Flick","rating":9,"date":"12 February 2006","review":"I remember the old Goof Troop show when I was a kid. It was fun but perhaps a too well \" Goofy\" for me now. It was a cartoon after all, and when I heard about this movie I thought this would be the same. Boy was I wrong.<br><br>This movie truly reaches out for kids, teens, and adults. The whole plot revolves around Max trying to get the girl, making a name for himself, and well not trying to be a complete Goof. So he does what all kids in real life do, well more or less. Basicaly he holds a little surprise concert in the middle of an assembly, with him starring as the schools favorite singer Powerline. Well he gets Roxanne's attention, but also that of his father who thinks maybe he should spend a little more time with his son, making sure Max will turn out to be a good kid.<br><br>(The characters)<br><br>Goofy Its good seeing Goofy trying to be a real parent. To me in Goof troop he was more like Max's older friend. Though Goofy doesn't seem to be as goofy as he was on the old cartoons, this shows something of a better side him. Trying to be a good father, who just wants to be part of his son's life.<br><br>Max Well he's a teen now, and he certainly shows it. Really all he wants is an easier life. Plus to get the attention and heart of that one girl. I think he truly has the most character development of the entire cast. Making things right in the end with his dad and Roxanne.<br><br>Pete/PJ Nice cameo characters, its also nice to see Pete and Goofy acting as better friends. PJ really hasn't changed much but these two truly have some of the best lines in the movie. One thing is I don't get why everyone's all confused on Pete's wife and daughter. He said in the store that he's taking PJ camping to strengthen the father/son bond. So its obvious that Peg and the girl are still at home doing their own thing.<br><br>Roxanne Ahh that popular girl that steals the heart of Max. She seems like an interesting girl however she gets really little screen time, well not counting the visions Max keeps getting of her. I kinda wish she was in it more, so we could learn a bit more of her character. Well maybe if they do A Goofy Movie 3. Big Foot 3 words Funniest Character Ever!<br><br>Music The Powerline songs really have to be my favorite. You don't hear R&amp;B like this anymore. Of course I also like some of the instrumental pieces as well. Not to mention the \"After Today\" these songs really wanna make you dance more then just sing. I'm even thinking about getting the soundtrack.<br><br>This movie really needs to be seen to get its true impact. Doesn't matter how old you are, hey I'm 17 and I think its great. So if your interested in a good family movie, or just want some humor and a good story, then this is the Disney movie for you.","user":"SephsClone","rank":[28,29]}]