[{"title":"Under-appreciated, perhaps misunderstood, unique surreal treat","rating":24,"date":"24 December 2009","review":"I only have a slight idea about Wittgenstein's life and work. Perhaps this is the main difference I have with viewers who hate this film. Unsatisfied reviewers seem to fuss over which things should have been included in a film about Wittgenstein or how his life should be understood or examined. My contention with this approach is that I don't need to agree with a film's views to appreciate it. I appreciate writers' and directors' liberties in interpreting subject matter, especially creative and witty interpretations. <br><br>For fans of surreal and different films, this movie is delightfully and intelligently entertaining. The ton of symbolisms--understated, colorful, clever, cryptic, obvious or not--will make you appreciate the directorial style and the screenplay's ingenuity, and help you understand the philosopher in ways that will not put you to sleep like if you're reading one of his treatises. Breaking the fourth wall with the young Wittgenstein's charming and engaging acting is a treat. The old Wittgenstein's portrayal depicts torture and torment well. An evident contrast exists between the black background and the vivid, exuberant costumes and props--much like the dark life of the protagonist, and the flashy treatment of his life here, but far from flash without substance.","user":"moiestatz","rank":[21,26]},{"title":"Mannerist biopic of Wittgenstein is not very deep but is not heavy either","rating":8,"date":"16 December 2011","review":"British filmmaker Derek Jarman's penultimate film consists basically on literate deadpan tableaux dealing with the life of Austrian philosopher Ludwig Wittgenstein (1889-1951). The late Jarman, who was known for making gay-themed experimental movies, filmed the whole of Wittgenstein in a indoor stage, as a series of mannerist vignettes. If you want to watch this movie to know about Wittgenstein's theories, don't bother. These are dealt superficially and perfunctorily, while emphasis is made on his homosexuality. This movie is not very deep, but is not very heavy either, I think this was a bit of frivolous exercise on the part of Jarman but it is also lighthearted and quite entertaining.","user":"Andy-296","rank":[11,13]},{"title":"Wittgenstein--worth a second look","rating":7,"date":"4 August 2006","review":"I must disagree with other assessments of Jarman's \"Wittgenstein.\" While the film is clearly not for Wittgenstein initiates (a bit of reading about the man is probably helpful before viewing), I can't class it as the rather boring, trivial exercise in biography others seem to feel it is. Jarman's films are always so contentiously received(which is a good thing), so all I can do is offer my own reception of it. First, while biographical details are somewhat slight, I think there are enough to frame at least a gist of the man Wittgenstein, and second, I must disagree that the exploration of Wittgenstein's sexuality is trivial or inconsequential. Biographically, Wittgenstein's sexuality troubled him greatly. Cinematically, I don't think it's irrelevant to follow a scene of Wittgenstein vainly attempting to explain his philosophy to students and colleagues, an effort which leaves him visibly upset and isolated, his back to the camera and his audience, with a scene of him at the movies, breaking his icy, rigid posture and his earlier-expressed desire that his companion and student, Johnny, not spoil the plot of the movie by distracting him with questions, to deliberately end his isolation and grasp Johnny's hand. Yes, Jarman's portrait of Wittgenstein is not of an attractive or really likable man, and Wittgenstein doesn't seem to have actually been one, so his abrasiveness in the film is not disagreeable for me, much as the abrasiveness of Gauguin in \"Lust for Life\" isn't. As for Jarman's allegedly un-daring cinematography, I'm no cinematographer, but Jarman seems to have favored dark backgrounds, long scenes and theatrical stagings in other films, and sometimes manages to produce interesting and subtle arrangements thereby. Perhaps his work on \"Wittgenstein\" was impacted by his encroaching blindness, though I wouldn't suggest writing off the high or low points of the film as the result of his visual impairment. Finally, \"Wittgenstein\" seems to me like a film deserving of a second viewing. Perhaps it's rather pretentious, perhaps it's a little harsh. Perhaps, though, it's also attempting to make some subtle and not-so-subtle commentary on what's important in a life, how that ought to be presented, and from what perspectives.","user":"eyetothescreen","rank":[19,25]}]