[{"title":"Robocrap!","rating":2,"date":"11 June 2006","review":"This highly-disappointing sequel finds our hero going against law and order by siding with a group of down-and-outers who stand to lose their neighborhood because of evil corporate interests. Along the way Robo crashes cars, battles robot ninjas and flies through the air like a six-ton Superman. Alas, none of it can save ROBOCOP 3, a film into which very little real effort seems to have gone.<br><br>When watching ROBOCOP 3, one can't help but think the producers lazily expected the well-established Robocop brand would simply sell itself this time around. Making matters worse, they tried to move away from a more adult-style of action and sci-fi and deliver something you might watch with older kiddies. I mean, robot ninjas??? What is this, Mighty Morphin Power Rangers? This thing even attempts to deliver a do-the-right-thing message, but the whole effort is so muddled and ridiculous it can't succeed (nor should a movie like this even try).<br><br>I am willing to cut movies a lot of slack, but this one's a stinker. No wonder Robo was reduced to a cheap Canadian-filmed TV series following this disaster.","user":"ReelCheese","rank":[90,113]},{"title":"whyyyyyyyyyyyyyyyyyyyyyyyyyyy?????????????","rating":12,"date":"12 May 2005","review":"the first Robocop was amazing, Robocop 2 was a worthy sequel. WHAT THE HELL HAPPENED!? half the cast was comedians, the acting was god awful, the script was stupid. I mean how do you go from solid R rated flicks to a PG 13? Now this film shows the fall of OCP, and many people jumping out of windows or shooting themselves. Ironically that's what anyone viewing this film would want to do. Which is why they don't have theatres on the top of buildings.<br><br>this film should be erased from history, and maybe if they make another robocop call it robocop 3 again, to help people forget about this one.<br><br>-50 out of 10","user":"briangcb","rank":[152,209]},{"title":"Robocop saves Sesame Street","rating":4,"date":"4 April 2004","review":"This is the worst possible turn the series could take. Form the violence in the first movie and the mindless violence in the second, the third movie is suddenly as lame as possible.<br><br>First off, let me say I don't understand why people find this third movie a better movie then the second. Because it tries a story line with a little more thought in it? True perhaps, but that's all it's got going for it. One painfull moment follows the other. I like lists, so let's list some.<br><br>&lt;&lt;!!!As always, SPOILERS ahead!!!&gt;&gt;<br><br>A black woman who's not even 40 calls herself an old woman during the deportation, the deportation itself is a complete fraud (pick out a cop and follow him around. It shows that their instructions were just \"run in that direction and act mean, but for crying out loud, don't hurt yourselves!\"), the laptop reprogramming of the ED-9something, cops who don't know how to defend themselves when they've got guns and the punkers got sticks, robocop who loses every fight he's in, dream sequences on screen like a soap opera (in the first movie they were just a read-out of the brain activity. A lot more real), Robocop obviously not weighting anymore then a normal man these days (2 of the rebels carry him) and the japanese man responsible for the killing can just walk around among his victims, never in danger. And do I even have to mention the flying he's doing?<br><br>Add unmemorable villains and not one engaging action sequence and this movie has really nothing going for it. The decission to have no blood in the movie is almost funny when they have no trouble having a couple of suicides in the story. The story itself, isn't that worth it then, one might say? Let's just say it's impressive how they can make an almost epic theme reminding of the holocaust so incredible boring and unadmospheric. I certainly didn't care for any character, that's for sure.<br><br>At least Robocop 2 had action and humour going for it.<br><br>2/10 (hey, it still is robocop)","user":"mjtonino","rank":[14,16]}]