[{"title":"Excellent movie (one of the best) and very accurate","rating":10,"date":"25 July 2003","review":"This movie is one of the sleepers of all time. I gave it a 10 rating. The story is of the famed 'Bushwhackers' out of Missouri that fought on the side of the South during the War Between the States. The clothing they wore were authentic, the history and why they fought is very accurate and well researched. There was actually one of the battles that did not take place as they depicted... but not bad for Hollywood. The actors were well cast and were either the most brilliant of actors or the director really know how to get the best from them. I suspect it was a combination of great directing, super casting to find the right people and excellent performing by the actors. Not just one or two... this movie really jelled! It has action, romance, suspense, good guys and bad guys (sometimes depending on your individual perspective) and history all rolled into one movie. Even has the future Spiderman and Jewel. And she's good!","user":"americansongs","rank":[48,48]},{"title":"There are no heros ... just great film makers","rating":9,"date":"2 April 2001","review":"Easily 9 out of 10 for a film by director we will continue to grow to admire. But don't watch this movie expecting to be \"entertained.\" Ang Lee takes an objective look at a relatively unexplored aspect of the Civil War. What is beautiful about the movie, like all of Lee's films, is that he doesn't \"side\" with his characters. He creates characters, embodies them with life, problems, and ambiguity ... and endows them with a reality that often hits far closer to home than with which many are comfortable. This film has action, but it is not for the action lover since the violence is deeply disturbing and far from gratuitous ... i.e. like the characters, it is real. And as you would expect about one of mankind's most horrific wars, the violence is horrific.<br><br>But as an exploration of the greater human ambiguity that surely dwelt within the Civil War, it is a masterpiece. Was the war about slavery and an abolitionism? Lee seems quite willing to blur that line made so popular in depictions like the Blue and the Grey. Neither is about idealism, though, as seen in Gone with the Wind. It is about freedom, about the desire to have something which is yours and to fight for it. As you watch the characters, you will ask yourself \"how can they be fighting to preserve slavery?\" The fact is, I don't think they really are, and in that the film shows the problem of why so many were caught up in the maelstrom of the Civil War.<br><br>The fact seems clear that many of the characters we learn about are fighting out of senses of loyalty to \"home\" though they may never have examined what home represents or whether they truly espouse its values. The letter scenes are very moving and yet subtle. Jake and Daniel are other examples of loyalty stretched to the limits. And when the tension finally snaps, and these characters find themselves suddenly \"free\" ... we see the birth of new men.<br><br>All this mixed in with Lee's beautiful incorporation of humankind's environment with breathtaking vistas and frames. Lee has a style which is his, somehow European in its \"art\" (a slow camera, unrushed), Asian in its epic-ness and development of story, and yet somehow familiar and easily accessible to so many in North Americans.<br><br>Relax, let go of your preconceptions about what the Civil War is, what the \"western\" as a genre is, what a war movie should be ... and let Ang Lee take you into a world so fragile, so hard, so real that few of us can comfortably see it.<br><br>In this, Lee continues what he wrought in Ice Storm. Again, the movie is slow paced and without apparent \"direction\" ... a sure sign of Lee's ability to direct without \"imposing\" himself on the story or screen. His direction is amplified by what he brings out of Jewel (yes, the singer), a hitherto unproven actress who puts in an amazing performance.<br><br>A movie for those who love film and are not lovers of the standard Hollywood epic.","user":"dare31","rank":[73,76]},{"title":"Great Movie, Excellent History Lesson!","rating":3,"date":"3 February 2000","review":"The American Civil War was marked with horrible battles that exacted a toll on humanity that numbered into the thousands; however, there were other aspects of this war that took an equally horrendous toll.  The border states in this war were completely divided and often the inhabitants of these states were caught up in desperate struggles for their lives and homes.<br><br>Certainly \"Ride with the Devil\" does not feature the epic battle scenes that \"Gettysburg\" brought to the screen, but it does give an excellent insight as to how everyday people dealt with the total destruction of their lives.<br><br>\"Ride with the Devil\" certainly gives a fresh and unique perspective of the Civil War.  It is to the movies credit that it fully explores the tedium of life experienced by the common combatant who faced moments of tremendous anxiety while in combat and the long dull periods of no action.<br><br>Furthermore, I am really tired of movie critics harping on the dialects and language used in the movie.  Well folks I hate to tell you, but in the 19th Century people generally spoke in the manner that this film depicts.  I believe that the language in the film is one of its finest points.<br><br>Ang Lee went to great pains in making this one of the finest period pieces that I have encountered.  Mr. Lee used hundreds of Civil War re-enactors and took great care in making sure that his principle actors, sets, and scenery looked the part. The movie was filmed in Missouri and Kansas and captures the scenic beauty of this area.<br><br>The actors are of a fine calibre and should be recognized for their outstanding performances.  Considerable kudos should go to Tobey Maguire and Geoffrey Wright.  They both were believable in their mannerisms and dialect. Tobey Maguire is outstanding in his use of period language.<br><br>All in all the movie is great.  Since it wasn't on the big screen long we can only hope that the video will arrive soon.  Sometimes it is refreshing to go and see a movie that is about real people and events that really happened.","user":"secessrwe","rank":[79,84]}]