[{"title":"If you NEED to see Alyssa, this is for you","rating":4,"date":"5 August 1999","review":"Let's face it, this is one of the most famous B-movies ever because of a few nude scenes, not because of a terrific plot.  Yes, Alyssa Milano looks great, but that doesn't mean that this was a good movie.  Really, the film is watchable at best, and the writers clearly were more concerned with getting Alyssa naked than making an interesting story about vampires.  I can't call it a disappointment, since I got what I expected, but it's nothing but a forgettable film that just happens to have some legendary soft-porn scenes.","user":"Tito-8","rank":[65,72]},{"title":"Interesting B-Movie","rating":8,"date":"4 November 1998","review":"This is a B-Movie about some vampires wanting to bring the \"chase\" college coed Alyssa Milano into their fold.  Being a heterosexual male with a normal dose of hormones, I found this movie very interesting.","user":"BrianJG","rank":[49,62]},{"title":"Watch it for Allysa","rating":6,"date":"7 June 2000","review":"Embrace of The Vampire stars Allysa Milano, who grew from a cute little girl on \"Who's The Boss?\" into a stunning young woman with apparently surgically enhanced boobs. She is sexy and always fun to watch whether she's in something good (Charmed) or not so good (Hugo Pool). This movie falls somewhere in the middle. It's not great, but still entertaining.<br><br>Martin Kemp, former pop star, has built a respectable acting career with his role in The Krays and several British TV shows. He plays a cursed vampire who must seduce an 18 year-old virgin or he will die. Milano is the virgin, whose boyfriend is pressuring for sex. Charlotte Lewis and Jennifer Tilly, the most talented performers in this film, are the ones with the smallest roles. <br><br>This is one of the better bad movies I've seen. If you've ever wanted to see Allysa's boobs and butt, you will love this movie. She would be worth watching even if she'd kept her clothes on.","user":"dave fitz","rank":[14,16]}]