[{"title":"one of the most beautifully photographed films of the 90s, though if amazing imagery isn't lacking, plot is","rating":7,"date":"14 June 2007","review":"I always wonder what it might be like to have a film set in a location that is explicitly specific, with this film, as example, the Sahara desert and outlining areas of North Africa, and to not have some kind of Lawrence of Arabia kind of epic story attached to it. It's a challenge for a filmmaker to attempt, and Bernardo Bertolucci did attempt it in 1990 with the Sheltering Sky, based on the book that seems to be massively popular (though un-read by me). Whether he succeeded completely or not will depend on how much the viewer can take seeing characters sort of engulfed by the director and cinematographer's own adoration of the strange and bizarrely exotic locales. <br><br>The story is boiled down, probably more-so than was in the Bowles novel, about a husband and wife (Malkovich and Winger), and their friend (Scott), who go to \"travel\" in North Africa. For what precisely is uncertain, but it is clear that the focal point is that of their marriage failing after years together (both sides sleeping with others, distanced, not altogether honest in conversation).<br><br>But this changes, of course, once Paul gets typhoid and has a fever for the middle chunk of the film. After this, when a change of events occur, The Sheltering Sky gets even more surreal and sensual then before, if still slightly obtuse in how to really relay a good story. And it's not that Bertolucci is whacked out, like with La Luna, as a storyteller per-say. He actually progresses what there is involving the characters pretty well, and Malkovich and Winger are up to the task of playing people who are sort of bourgeois malcontents who get their respective states of mind altered through their travels of the fly-ridden villages and poor towns in the Sahara region. <br><br>But it seems like material, even for someone who hasn't read the book, to be more evocative as prose then as filmed, and the many customs and many little details of the villagers are left as more-so poetic aspirations than things relevant to the narrative. This all being said, The Sheltering Sky may possibly be Bertolucci's most astoundingly shot feature, with it coming right behind Goodfellas as the best cinematography of 1990 (via the great Vittorio Storaro). Shot after shot looks like it could come out of a truly exquisite book, and the dedication to compositions and long shots and how a close-up can be just as meaningful cinematically as a view of the desert, is the best that Bertolucci has to offer.<br><br>But then again, like with Antonioni when he's at his most scatter-shot, without characters who even subtly convey a lot, or with strong enough themes aside from the despair amid an alien environment (to the characters), it becomes the textbook case of style over substance. I'd recommend it, especially to fans of the director and DP, but I can understand the dismay that fans of the book had at the adaptation, despite the convincing performances and (as a given) the wonder of seeing places not seen before, like the not-filmed-before-this-film location of Niger.","user":"Quinoa1984","rank":[16,17]},{"title":"A feast for the senses","rating":5,"date":"5 November 2001","review":"It's hard to understand why this film doesn't get better reviews.  Yes of course it's a reflective arty film where evoking feelings is more important than narrative drive.  The amount of nudity, though in keeping with the story, does perhaps hinder its being taken seriously by some.<br><br>Surely though it succeeds as well as any film has in painting a cinematic picture of the experience of being a stranger in a strange land?  The cultural barriers, dissonances, language, the maze of similar streets - everything comes together to create the feeling of utter helplessness Kit experiences when she tries to get help for the ill Port.  The confusing weird relationships, often only partially depicted in the film heighten the sense of being adrift in life.<br><br>Together with some of the best ever desert cinematography rivaling even Lawrence of Arabia, North African music, noises, characters and colors this film is a rich feast for the senses indeed.  And what a wonderful final voice-over, one of the most deep and thought-provoking lines in all the movies.","user":"scotty12","rank":[66,88]},{"title":"Grand meandering story about aimless people","rating":6,"date":"17 July 2015","review":"American couple Port (John Malkovich) and Kit Moresby (Debra Winger) see themselves as travelers looking for new experiences. They go to Tangier after the war with their friend George Tunner (Campbell Scott) who they see more as a tourist. Port is introduced to a prostitute and is robbed. Kit and George take a train trip. Port is jealous and follows them catching a ride with the Lyles (Jill Bennett, Timothy Spall).<br><br>It's a grand meandering story about being aimless. It's not just about being aimless but there is also a pointlessness about the movie. The location shoots are wonderfully exotic. Malkovich is chewing up the scenes and Spall is being weird. However the movie struggles to find a meaning.","user":"SnoopyStyle","rank":[7,7]}]