[{"title":"A girl in desperate need of a psychiatrist in a town in desperate need of a cardiologist","rating":7,"date":"30 December 2016","review":"From the first scene, little Susan seems troubled and is fascinated with spiders. She considers them her pets. And why not? Mom has all of the warmth and maternal love of one of dad's corpses on a slab. Dad is a mortician and full of love for his daughter. The actress playing mom is pretty stiff in her role (no pun intended) and actually seems much too old for the part she is playing. She is having an affair with her husband's brother, a cop. Susan overhears mom talking on the phone, figures out who she is talking to, and overhears their plans to kill her beloved dad.<br><br>So Susan waits until mom is asleep and puts her pet tarantula on her. Mom awakens, doesn't jump out of bed, just lays there in terror, and then has a heart attack and dies. Mission accomplished. Dad is safe. Susan grows up. Her age is never specified, but it seems that she is in high school because she is walking to school with a backpack. Although, like mom, she seems about ten years too old for the part. By this time Susan has many tarantulas as pets in the basement and she is still the apple of her dad's eye.<br><br>Pretty soon Susan is solving all of her problems with bullies and the kids who broke into the mortuary and killed one of her pets spiders by planting spiders on them when and where they least expect it. In every case they don't run away, they just sit there screaming with the spiders crawling on them and die of a coronary. Never have I seen so many healthy young people die of heart attacks.<br><br>Now that Susan has matured, Dad's lecherous brother begins to have the hots for her, bothering her and getting just a little too affectionate. Blech! The girl is your niece! To make matters worse he's the local DA, and he and the cops are stumped at all of the deaths occurring around town. To make matters even worse he wants to run for state Attorney General. But for some strange reason he sends his brother out to campaign while he shadows Susan with his tongue dragging the floor. Usually voters want to hear from the candidate, not his brother.<br><br>This all comes to a head with the DA committing a terrible crime himself, and Susan wreaking a completely ironic justice upon the guy that for once did not involve her spiders.<br><br>The dialogue is wooden and the acting uninspired. And then there is the case of the high schoolers that look like they are in their 30s and the convenient way all of the victims die at the sight of a spider. However, this is a case of something you just don't see anymore - an independent low budget film with actors so anonymous you wonder why they bothered to give them names in the movie different from their actual names. For several of the players I think this was their only credited role.<br><br>For me, it is an artifact of the last days of drive ins, and for that reason I enjoyed it. It is so authentic, so not mass produced, so something that no movie studio would have any part of today that it is just a guilty pleasure of mine. Your mileage may vary.","user":"AlsExGal","rank":[9,10]},{"title":"A nicely eerie and effective 70's teen revenge drive-in horror outing","rating":8,"date":"23 December 2006","review":"Poor Susan (excellently played by the lovely and beguiling blonde beauty Suzanna Ling). The comely, but weird misunderstood misfit teenage girl lives with her undertaker father in a mortuary. She has an unnatural affinity for spiders. Susan catches her shrewish mother cheating on her father with her dad's own brother. Susan kills her mom by putting a tarantula in her bed. She also sics her lethal arachnid friends on other folks who rub her the wrong way; said victims of her dangerous wrath include a bunch of local hooligans who break into the mortuary to steal a coffin and Susan's disgustingly incestuous and lecherous uncle (a superbly sleazy Eric Mason). Directed in an effectively blunt and basic manner by Chris Munger, \"Kiss of the Tarantula\" makes the grade as a creepy and effective low-budget 70's grindhouse scarefest thanks to Phillan Bishop's eerie synthesizer score, credible acting from a solid no-name cast, an arrestingly brooding rustic atmosphere, a grimly serious tone, Henning Schellerup's gritty photography, a wickedly startling surprise twist ending, and several genuinely unsettling spider attack murder set pieces (the sequence where a handful of libidinous kids doing just what you think in a parked car at a drive-in get assaulted by the spiders is the definite flesh-crawling icky highlight). A shamefully neglected and hence underrated teen terror tale that's well worth seeing.","user":"Woodyanders","rank":[8,9]},{"title":"A pretty girl, teen revenge, and plenty of SPIDERS","rating":6,"date":"18 February 2013","review":"A teenage outcast, unleashes her revenge, utilizing her eight legged friends, in this slow moving and forgettable horror, which will leave you waiting some for what little gore there is to happen. I mean how much harm can tarantula's do. To that small minority of people who love spiders and revenge, we should have that small minority of people watch this. Given that said, it's not a badly made flick, where even a \"Hot Connections\" star shows up as one of Susan's peers, who gets his serve at a drive in. He was falsely coming onto her, then entrapping her as to find out how his friends were killed. Bad mistake as our Susan who slightly resembles Carrie, again unleashes her pets. Another guy gets it in an air duct. Our Susan's got other problems. Her father matter of fact owns a funeral parlor where the wife and the bastard of an uncle are getting it on. Again, enter Susan. The opening always stays with me of Susan smiling the sweetest of smiles (too sweet) to camera. This is used in the last shot too, where Susan herself says \"I love happy endings\". Okay horror fare, but nothing to write home about.","user":"PeterMitchell-506-564364","rank":[6,7]}]