[{"title":"Touching","rating":14,"date":"14 March 2003","review":"A sweet and honest movie. It's definitely a family film. I liked the relationship of having to fill someone's shoes in a sense, because people are so attached to them. Sarandon was awesome of course. She carried her part with grace and the feral intensity of a mama bear. Nothing got over on her and I liked that because she wasn't going to be around much longer. It wasn't about sizing up the competition, but making sure she was the right person her kids could grow up with instead of her. It was heartfelt and real. Great film.","user":"QueenMakeda84","rank":[36,44]},{"title":"A Stepmom review from a fan!","rating":10,"date":"13 April 2006","review":"I loved this movie! If you are in the mood for a tear jerker movie, this is the movie too see. Julia Roberts and Susan Sarandon are remarkable together. This is the absolute best I have seen Julia Roberts act and this movie defiantly brings out her talent. Susan Sarandon can make any movie good. But she delivers outstanding effort to make her character relate to other women who have had the problems that Susan's character faces. This movie is of course a 10 out of 10! Julia Roberts and Susan Sarandon will make you laugh now and then, but they will also make you cry with the difficulties that they face together on screen. Stepmom is a movie you'll enjoy and \"always always\" remember as a movie that filled your heart. So if you haven't seen Stepmom yet...go and see it! You'll be glad that you did.","user":"fanofreba","rank":[25,30]},{"title":"Great movie!","rating":8,"date":"7 January 2000","review":"I'm still wondering why Susan and Julia didn't even get a nomination of the Academy, or the screenplay. This movie is a great movie about jelousy of a mother, that is scared that her children might love someone else as their second mother, and gives such a hard time to that person. And in the other hand, you see that young lady, in love (with the father of those kids), that forgives everything that has been done to her. She was called a bitch a couple of times (the dog scene with Ana, and when she brings the kids at Jackies, and Ana has make up). Was ignored, and even lost her job for those kids. And she forgives all of this, and tryes to like everyone. The world sure would be perfect if everyone would be this way. The problem is that the world has too many Jackies, and not enough Isabels. <br><br>If you are someone that likes to cry, and cry. Watch it. Is one of the sweetes movie ever, talking about peoples feelings, fears, and happynes. Great!","user":"Karok-2","rank":[32,44]}]