[{"title":"Darker than your average action film","rating":7,"date":"19 November 2005","review":"Hyped to the heavens when it first came out as Schwarzenegger's comeback movie, this 1999 film steers the Governor away from his attempts at comedy and collaborations with Danny Devito and back into the sort of action packed carnage that made his name in the first place. However, where the likes of Commando had him portraying invincible supermen with a neat array of guns and one liners to hand, End of Days is considerably darker.<br><br>Set in New York on the eve of Millennium, the film shows a version of the Austrian Oak previously never witnessed. He plays Jericho Cane, an alcoholic ex-Cop in charge of a security squad who finds himself embroiled in a battle to save a young girl (Robin Tunney) from being raped by the devil (a sadly, rather ineffective Gabriel Byrne) and bringing about Armageddon. As you do.<br><br>Cane himself is not the best sort of man for saving all creation either. He is mired in deep depression, has abandoned any faith in God he may have once had and when we first see him, is contemplating suicide. However, saving the girl gives him a drive and determination even when faced with some conflicting views from the Catholic Church about how best to go about this. All of this takes place in a very grim and gritty vision of New York where the rain never stops falling, urban decay is rife and pillars of steam rise from manhole covers. It is a fitting location for the end of all creation to begin and cast a dark veil over the flick.<br><br>Of course, that isn't to say the film is all doom and gloom as there are a few glimpses of just how seriously the makers weren't taking their project (the argument between Arnold and Kevin Pollack in the former's apartment is hilarious). Plus, while the story and characters are all developed to match the atmosphere of impending dread during the first hour and a half, the last twenty minutes are made up of the kind of explosive action that strangely doesn't jar against the grimmer nature of the rest of the film, though the CGI devil at the climax is pushing it a little.<br><br>All in all, an enjoyable romp for fans of the Governator before his attention was diverted by a political career. It compares well to his classic eighties work by trying to do something different and while it may not gel properly in places, for a good 80% of the running time it does a very entertaining job.","user":"ExpendableMan","rank":[105,118]},{"title":"Surprisingly effective horror action","rating":7,"date":"14 July 2002","review":"Peter Hyams' End of Days stars Arnold Schwarzenegger as a fired and alcoholic police officer, who is on the edge of sanity and tries to commit suicide very often. He is now private security guard and traps a mysterious sniper who tried to kill one of his clients. Soon he learns that there are some very bad things going on in the city, and the new millennium is very close..It is the last days of December, 1999.<br><br>I really liked the scare department in this demonic little horror thriller from this talented director and director of photography, Peter Hyams. This film is full of effective and very ominous images and scenery and the film is very dark. I appreciate perhaps most the shots above the city and the twisted use of camera up there. That really creates a feeling of evil and that something very powerful and wicked is \"above the city\" and is about to get power. Hyams once again shows his talent as he has been the director of photography many times earlier in his own films. End of Days reminded me occasionally of Alex de la Iglesia's great horror film El Dia de la Bestia (Day of the Beast), a brilliant mix of black comedy and VERY dark imagery and atmosphere. As incredible as it sounds, this mainstream produced film is that effective, thanks to the talented men behind the camera.<br><br>\nThere are some flaws, too, and the most irritating things is perhaps the cliche ending, which I definitely won't spoil here, but is without a doubt there only to satisfy the audience and create the safe and familiar Happy Ending. If this was made 20 years ago, the ending would definitely have been different; it would've been how the director wanted to, not hot the audience wanted to. That tones the otherwise great and exciting finale a little bit down, but fortunately it is not as syrupy as possible. Another negative thing that I can tell is the editing which is very fast, unstylishly and ineffectively fast and restless. Fast edits can be great elements if used right and with skill, but in this film, they are in my opinion gratuitously fast and too plenty. Just watch the action scenes and count how many edits there are in one minute. The editors should have realized that sometimes - and in this case - less is more. These \"flaws\" are still tolerable especially when I keep in mind how many positive points there are in this film.<br><br>End of Days is also very exciting and fast paced. The train segment is great and especially the clock ticking finale when the millennium is about to change, is very skillfully created and hold my full attention. The finale is pretty similar to the finale in Kathryn Bigelow's own millennium related film, a paranoid and effective thriller Strange Days (1995). In End of Days, there are also couple of genuinely frightening, scary, sudden and loud \"shocks\" that require a movie theatre to fully work. The nightmare sequences are also chillingly original and brought to my mind the great horror classics that even Hollywood sometimes produced. The demon which Christine sees in her dreams is very scary and almost as frightening as the similar character in David Lynch's masterwork Lost Highway.<br><br>As a horror film, End of Days works fine and creates an atmosphere that is so rare in mainstream films nowadays. I didn't have any expectations when I placed the VHS in my VCR, and so I was pleasantly surprised of what I saw and experienced. If we stay in the 90's, I could say that End of Days is kind of tamer version of Day of the Beast and without its comic elements. There are comic elements in End of Days, too, but those are not, fortunately, the usual Hollywood one-liners and stupid bits of dialogue. Gabriel Byrne over-acts occasionally little, but many guys who play devils seem to have this problem! He is almost as \"cool and modern\" devil as Al Pacino in Taylor Hackford's Devil's Advocate, a film which also has great atmosphere but is more restrained and drama oriented.<br><br>End of Days gets 7/10 from me. Great work again Peter!","user":"Bogey Man","rank":[28,33]},{"title":"It Depends On Your Perspective","rating":9,"date":"4 June 2009","review":"End of Days gets a bad rap, but I think a great deal of this is due to its initial premise. It's extremely 'cool' to be anti-religion these days, so big-budget movies with a core religious theme tend to get unnecessarily slammed. I'm not religious myself, but I do often enjoy supernatural and religiously themed stories, due to the themes and issues they frequently explore. So its success all hinges on whether you can accept a plot guided by supernatural religious elements or not. If you can, and you enjoy action movies occasionally, you'll probably enjoy End of Days.<br><br>Arnold plays a depressed ex-cop turned high-level body guard with a suitably tragic back-story. Some people will enjoy his performance, others won't. Again, it depends on how you come to this. If you are expecting a versatile actor who changes personality with every performance, then you won't enjoy it. If you like Arnold, because he is exactly what he is, Arnold, then you'll probably have a ball. After all, who ever hired Charlton Heston or Humphrey Bogart or Christopher Walken to play a part in any way other than the specific way they do? You don't hire such actors because of their chameleon-like acting abilities, you hire them because their sheer screen presence is such that they stand out from the crowd and you enjoy seeing THEM in the role. As such, you either relish those actors in their parts, or you you dismiss them as wooden or bland. It depends on the viewer.<br><br>The director, Peter Hyams (2010, Outland, Timecop, The Relic), has a tendency to enjoy very dark cinematography, and in this case it suits things perfectly. There are lots of scenes lit primarily by flames or torchlight, that set the tone. Meanwhile, John Debney's (Cutthroat Island, Passion of the Christ) score is also one of his best, and probably one the most effective 'demonic' soundtracks since Goldsmith's Omen trilogy. I would be remiss not to mention the effects work as well. Having watched the DVD special features, I was extremely impressed with how much old-style artistry and craftsmanship went into many of the effects. There was a great deal of miniature work involved, which is too often sidelined for less effective CGI these days. End of Days used a careful blend, only really using CGI where necessary.<br><br>End of Days is a great roller-coaster ride of a movie, entirely suited to the date it was made for, and has a surprising amount of depth. Under the action and excitement, it's really a story about the main character's redemption, finding himself again, and discovering a meaning to his life after all he thought he had lost. It's also a classic good versus evil tale. To top it all off, we get a surprisingly touching and moving finale, which perhaps left a lot of people on too much of a downer, yet I found it the perfect conclusion to the story.<br><br>All in all, End of Days is either a love-it or hate-it movie. It's not perfect, but I thought it was an excellent film, and one of Arnold's most interesting characters. If you don't mind religious themes, enjoy larger-than-life characters and adrenaline pounding action, then chances are you'll probably have a fantastic ride.","user":"warren-1976","rank":[30,36]}]