[{"title":"Assassins","rating":8,"date":"13 February 2020","review":"This movie is very entertaining and has appropriate amount of action and suspense. The action sequences are great and the interactions between Stallone and Banderas excellent. If you're a fan of action films, this one is definitely worth a watch.","user":"MR_Heraclius","rank":[36,37]},{"title":"Like most of Stallone's 90's work, it's underrated","rating":16,"date":"16 March 2012","review":"Assassins is a top notch, big budget thriller that is often over looked when discussing Stallone's filmography. Which is a shame, cause it's one of Sly's better films and his performance as an aging burn out hit-man is quite solid.<br><br>Antonio Banderas really steals the show though as the over the top and cocky newcomer who idolizes Stallone's character. Banderas is full of energy and his performance is electric. Miguel Bain is one of Banderas' best roles. An all time great movie villain perhaps.<br><br>Many fans forget about Stallone's solid output in the 90's, Cliffhanger is always mentioned but Assassins seems to be forgotten. It's a slick and explosive action thriller from \"Lethal Weapon\" director Donner. Featuring some great dialog and shoot outs between Stallone and Banderas.<br><br>On the negative side, the film is too long. Running over 2 hours, \"Assassins\" begins to wear out it's welcome. And the love story between Moore and Stallone is too cheesy and unrealistic to be taken seriously.<br><br>Like \"Daylight\" and \"Copland\", \"Assassins\" is one of Stallone's most underrated films from the 90's. An over looked gem that deserves to be seen again.","user":"ManBehindTheMask63","rank":[19,21]},{"title":"In Which Things Get Shot Up Real Quiet-Like","rating":5,"date":"7 January 2019","review":"\"Assassins\" occupies a strange and strangely brief period in Sylvester Stallone's career. In the midst of the over-the-top antics of \"Demolition Man\" and the...over-the-top antics of \"Judge Dredd,\" he made two films about Brooding Men of Action lured into One Last Job where they happen to Fall In Love and wonder What It's All For. Sure, Ray Quick likes to blow things up real good while Robert Rath just has a silenced .22, but now we're splitting hairs. The major difference is that while \"The Specialist\" soon turned into the ridiculous actioner most of Stallone's output embodies, \"Assassins\" tries to be a quieter (literally), more grounded thriller. Sadly, that does not make it a better, or even good, film.<br><br>It does make an interesting first impression, though. The opening scene is striking, a black-and-white montage that feels abstract in its construction - a lot of emphasis on ticking clocks and cloudy skies. It's almost totally disconnected from the movie we end up getting, which only makes it more memorable. Perhaps if things had continued in that vein, it might have been onto something. But then it remembers it's a Stallone film.<br><br>\"Assassins\" is somehow both incredibly simple and far too convoluted for its own good, but the basic premise is a cat-and-mouse game between Stallone's weary veteran Robert Rath and crazy young upstart Miguel Bain for the presumably venerated position of #1 killer in the...country? World? Other stuff happens, like a MacGuffin courtesy of hacker gal Elektra, but whatever. At 132 minutes, the film is far too long for the amount of plot it actually contains, with at least two scenes that achieve absolutely nothing beyond padding. Richard Donner, shepherd of the \"Lethal Weapon\" franchise, is out of his depth here - his action scenes alternate between silly and unremarkable, and his usual flourishes - blurry slow-mo, highly-destructive car chases - feel out of place. He's very much a more-is-more director, which is the wrong approach for this material, and it shows.<br><br>Of course, it all comes back to the script. Reportedly, the original draft by the Wachowski siblings was thrown out and completely rewritten by \"L.A. Confidential\" and \"Conspiracy Theory\" scribe Brian Helgeland, at Donner's behest. If so, Helgeland delivered something that neither plays to Donner's strengths nor contains any of the siblings' quirky flair. For example, in the original draft (which you can find a link to on Wikipedia) there is a chess metaphor that recurs throughout, symbolizing Rath's relationship with his mentor, Nikolai. Helgeland gives this a perfunctory mention - in the middle of a car chase, no less - and it amounts to nothing in the end. A major twist would have been more effective if it made more sense, or wasn't dismissed almost immediately. Half-formed story beats are probably the least of its problems, anyway.<br><br>Acting-wise, it has even more parallels with \"The Specialist.\" Stallone, trying his hand once again at a more dour, repressed version of his usual persona, has the brooding look down, but falters badly when trying to inject a (terrible) one-liner. It's a vague glimpse of his superb work in \"Cop Land,\" but stunted by his attempts to also be the action star. Moore, whose career would soon take off with \"The Lost World\" and \"Boogie Nights,\" is similarly hamstrung by the material she's given. There's none of the depth of emotion she brings to her best roles, but then, Elektra has none of the depth of character that Moore's usual roles do. Hey, you gotta pay the bills somehow.<br><br>No, as with James Woods in \"The Specialist,\" it's the bad guy who wins out. Miguel Bain, like everyone else, is barely a character, but Antonio Banderas infuses him with such manic, live-wire energy that he overcomes the trite dialogue and wobbly tone to be the best thing about the film. To its credit, Banderas is given free reign to go way out to lunch, and while he can't possibly save it, he definitely carries it.<br><br>\"Assassins\" is best considered an oddity in the careers of just about everyone involved. It's not what you'd expect from Stallone, Donner or Moore, and it might be worth seeing as an attempt for each to stretch themselves - though all would have better success with later work. As for Banderas, it's definitely one of his most entertaining turns, though not enough to raise this above a last-resort recommendation. If you're a film enthusiast, compare the Wachowskis' and Helgeland's drafts on Wikipedia, and try to envision the film this might have been. It can't have been any more confused about itself.","user":"jfictitional","rank":[7,7]}]