[{"title":"Demonstrates that Kitano is still a master without the violence","rating":10,"date":"17 March 2002","review":"By 1999 Takeshi Kitano had quite rightly gained a lot of international recognition for his brilliantly constructed Yakuza/Cop stories, but was apparently dis-satisfied that everybody tended to focus on the violence in them. So he decided to make a movie without any violence to remind people that he was a much more rounded talent than that. \"Are you sure about this?\", the world asked. \"Yes\", he replied... and made Kikujiro.<br><br>\nKikujiro is difficult to adequately describe, but the fact that it was allegedly inspired by the Wizard of Oz is a good starting point. The basic premise is a road trip, where Kitano is the unlikely chaperone for a little boy who wants to go and find his mother. After gambling away all the money his wife gives him to take the kid, they have to improvise their transport across the country. Along the way they meet a small but colourful cast of characters, and get to know each other a little bit too.<br><br>\nI'd hesitated about picking this up for ages, and eventually went for a rental rather than a purchase. Kitano minus violence just didn't seem right! But that was definitely an injustice I was doing him, and Kikujiro is a good demonstration that his talents really are much broader. In fact, after watching it there is no doubt that he is one of the greatest director/actor/writer and editor working in the world today. A brilliantly painted story, full of subtly and quirkiness. Awesome cinematography and an incredible soundtrack... truly world class in every respect. Well, to be fair the child actor was a bit stiff, but it seems mean to hold that against the movie. <br><br>Definitely recommended if you haven't already seen it!","user":"simon_booth","rank":[65,68]},{"title":"Takeshi Kitano's most underrated movie.","rating":22,"date":"22 November 2003","review":"Western audiences basically only know Beat Takeshi for his tough guy persona. Japanese audiences have seen many sides to him for a long time, and probably regard him as a comedian more than anything else. Maybe this is the reason why 'Kikujiro' isn't all that well known. Takeshi wrote and directed this movie as a follow up to his most celebrated work 'Hana-bi', but as it isn't a yakuza crime drama, it seems to have been largely overlooked. And that's a damn shame, because it's a very good movie, and anyone who enjoys Kitano's work will enjoy it. On paper the plot looks very Disney-like (grumpy old coot hits the road with an unhappy kid), but hey, this is Beat Takeshi, so what he does with it is always original and surprising. Much of the movie is playful, but then much of 'Sonatine' was too, only 'Kikujiro' doesn't mix that up with the orgy of violence you might expect from watching Kitano's better known movies. However it does have some dark moments that you would NEVER see in a Hollywood film dealing with similar \"heart warming\" subject matter, especially the \"scary man\" sequence featuring Akaji Maro, an actor you might recognise from Tarantino's 'Kill Bill'. I enjoyed 'Kikujiro' a lot, and the more Kitano movies I see, the more I think he is one of the most underrated directors working today.","user":"Infofreak","rank":[42,46]},{"title":"Beat Takeshi's Audacious, Edgy and Heartwarming Road Movie","rating":9,"date":"13 December 2005","review":"In the title role of this highly original 1999 road movie, Beat Takeshi - with his twitching eye and bow-legged shuffle - looks and acts like a cross between Mickey Rourke and Harvey Keitel with a heavy dose of Walter Matthau's sourpuss demeanor (circa \"The Bad News Bears\") for good measure. He creates a truly memorable character - cynically profane, unapologetically insulting, childishly manipulative and somehow likable. As the director and screenwriter of said film, Takeshi Kitano - the same guy - has fashioned something quite unique from a tired premise - a boy's search for his mother and the gruff man who begrudgingly helps find her. What could have been a predictable and sentimental wallow, especially with the indiscriminate use of angels as a pervasive symbol, is instead an idiosyncratic, emotionally adroit film that sometimes simmers on the cusp of violence.<br><br>Yet it becomes ultimately affecting almost in spite of itself. In fact, Kitano does such a resolutely offbeat job that at certain times, the film reminds me of the narrative ellipses and low steady shots that were the trademark of Yasujiro Ozu's home dramas, intermingled with a surprisingly intense Quentin Tarantino-like, in-your-face edginess. The protagonist of the film is really the latch-key nine-year old, Masao, who is on a quest to find the mother whom his grandmother says is \"away working\". With his sad eyes and cherubic face, Yusuke Sekiguchi is perfectly cast as Masao providing the moral compass for the story. Whether he is running with his arms flailing or forlornly playing soccer by himself, he is poignant without being saccharine and completely natural. It is Masao's scrapbook that provides the framework for the film lending each chapter a descriptive title. Every chapter has a distinct character that is, in various turns, playful, hilarious, disturbing, surreal and heartbreaking. Case in point: Kitano is not afraid to use a child molester as first an uncomfortable source of black humor and then as the subject of Masao's nightmare. My favorite scenes come toward the end when Kikujiro organizes a motley crew of misfits to play games with Masao and have them masquerade as Indians, aliens, marine life and even watermelons. The variety in tone between chapters makes for unexpected tonal shifts, but somehow it works and adds to the greater context of the story.<br><br>That Kitano is able to manage a consistent film-making style with a strong visual sense is a credit to the talent behind the camera - not only Kitano's direction, script and film editing but also his artwork showcased throughout the movie, Katsumi Yanagishima's sharply rendered cinematography and Joe Hisaishi's evocative Windham Hill-like score. There are some funny sideline performances from Gidayu Great and Rakkyo Ide as Fatso and Baldy, two bikers who turn out to be the Abbott and Costello of soft-hearted slackers; Nezumi Mamura as a free-spirited drifter; Fumie Hosokawa as a relentlessly perky girl with a talent for juggling; and in the opening sequence, Kayoko Kishimoto as Kikujiro's take-no-prisoners wife. Kitano, however, elicits the most laughs if only for the film's central conceit that he gets away with his infantile gangster behavior. One would think the story would climax when Masao comes upon his mother, but Kitano confounds expectations with every new scene. The DVD really has no extras other than a couple of trailers not related to the film (not coincidentally, one is for Walter Salles' \"Central Station\" which has a similar story structure). I know this film has its detractors, especially among fans of Kitano's bloodier work, but I find it intriguingly ambiguous and thoroughly enjoyable.","user":"EUyeshima","rank":[27,29]}]