[{"title":"A human face to sci-fi","rating":9,"date":"4 February 2005","review":"I don't know why everybody rips this movie. The special effects are very realistic, down to the pink-tinted Martian sky. The plot is plausible (for science fiction), paying attention to many small details that often make these kinds of movies farcical. Most important, it's very existential; humans simply trying to survive against almost insurmountable odds. As the struggle builds, the relationships begin to gel nicely. This IS a movie about human relationships, not Star Wars style hype. I know, there are some weak spots. The opening and closing dialog, Val Kilmer whispering all the way through, some of the dialog, etc. But overall, this movie doesn't try to do too much (unlike the abysmal Mission To Mars), and that's what makes it a success.","user":"tgarrett007","rank":[116,165]},{"title":"Non-exciting but realistic SF movie","rating":10,"date":"10 April 2003","review":"I was amazed when reading so many bad reviews . O.K. there're no spectacular Aliens and we're not blinded by non-stop special effects. The movie has more realism than the traditional Holywood science fiction stuff. Many parts of the Mars mission were based on the NASA reference Mars mission . The Mars explorer spaceship is build in Earth orbit . There're 6 crew-members . Artificial gravity to stimulate adaptation to Martian conditions . AMEE a multi-purpose robot with aerial probe . Cushioned landing . Wearable spacesuits . Other points of realism were the accurate 'fire in space' sequence, and the computer technology used by the crew. Red Planet could have been better, but it's decent compared to most  Holywood products. Moreover,  real science fiction is a very small niche market and will never draw nor encourage a broad audience.<br><br>If you're a fan of science fiction, looking for more realistic spaceflight stuff, watch Red Planet .","user":"PhilCo126","rank":[150,224]},{"title":"Red Planet is a great rainy, Saturday afternoon film","rating":22,"date":"22 October 2001","review":"Whoa there kids!  Red Planet is just a movie and in my opinion a pretty good sci-fi picture.  Yes, it is not 2001: A Space Odyssey or Mission to Mars (which I think was ridiculous).  It is not meant to be.  Maybe the characters are not fully developed but name a science fiction movie where the characters are completely developed.  The movie is called \"Red Planet\" not \"Who are the People Who are Going to Mars to Save Earth?\" and we join the action \"in media res\" which means in the middle of things so character development is not stressed in the beginning.  Good grief.  People throw around scientific, cinematic, and character development flaws with the movie instead of trying to enjoy the suspense of this movie.<br><br>\nYou are stuck on the planet Mars.  No food or water.  Someone on the crew is already dead and another is a little sketchy.  You have a limited time to get off the planet, your friendly neighborhood military robot has decided to play \"Seek and Destroy\", and something mysterious is happening on the surface of Mars involving tiny, bio-luminescent aphids.<br><br>So imagine all of that and you will get an idea of what the writers and director wanted to recreate for the audience.  I liked this movie.  I recognize there are flaws in the movie and possibly the acting but honestly I thought it was a great premise.  Reminded me of the Greek myth of Jason and Argonauts on their quest for the Golden Fleece.<br><br>I would give the movie 4 stars out of a possible 5.  Before you write and tell me how inaccurate or misguided a movie-goer I am realize I have read the classic sci-fi adventures from the likes of Heinlein, Clarke, and Bradbury.  They would recognize the film for what it was: a piece of escape fiction that had its moments of comedy, intelligence, and suspense.","user":"m_ender","rank":[59,94]}]