[{"title":"\"This is pure hell on earth.\"","rating":17,"date":"17 February 2002","review":"\"This is pure hell on earth.\"  Actually, what Tony Todd meant to say was \"This is one hell of a movie.\"  Tom Savini and George A. Romero have succeeded in recreated a classic (which is quite hard to do).  Night of the Living Dead '90 is faithful to the original, but still manages to scare and surprise you by throwing in a few unexpected twists.  Director Savini creates a great atmosphere.  This is one of my favorite claustrophobic films.  It has the feel of an old, secluded farmhouse, and thankfully lacks that Hollywood gloss.  The characters feel real as well.  The cast is perfect.  Tony Todd, William Butler, and Tom Towles are the re-incarnations of the original Ben, Tommy, and Harry Cooper.  And longtime Romero collaborator, Patricia Tallman, revamps her character Barbara for the nineties.  And you gotta love Bill Moseley (\"They're coming to get you Barbara.  They're horny Barbara.\").  All of the classic elements (the feud between Ben and Cooper, the claustrophobia) and a few new ones (a smarter female lead, new ending) make this one unforgettable.","user":"Backlash007","rank":[64,80]},{"title":"Romero and Savini create a horror masterpiece.","rating":10,"date":"29 June 2005","review":"Wanting to re-visit the genre he created, George Romero approached Tom Savini to direct a remake of his 1968 masterpiece, Night of the Living Dead.<br><br>While the film follows the original closely, it does have some important changes. Notably the character of Barbara is no longer a gibbering vegetable but now much more balanced. Other changes help blend the film much better into Romeros Dawn and Day. The use of tools by the zombies for example, is lessened and removed at times, creating more continuity between Night, Dawn, Day and Lands time-line of the undeads abilities.<br><br>Some seem to automatically shoot down the remake in favor of the original, I've watched this version almost as many times as Dawn and Day, and believe the film tops the original in almost every way. <br><br>Although the groundbreaking nature of the original will always remain, Savini's Dead is a without doubt a classic Zombie flick and in my opinion a perfect first chapter in the Romero Dead series.","user":"classmouse","rank":[96,128]},{"title":"An interesting twist on the old formula.","rating":4,"date":"4 January 1999","review":"You can't help but feel a tingle of deja vu while watching the color remake of Night of the Living Dead. It is essential for full enjoyment to have seen the original since the remake takes the same story and twists and tweaks it to bring it into the 90's. People are divided into two camps on this film. They either absolutely hate it or they have been enraptured by the change-up's that it pitches at you. I am of the later camp. At least Barbara (played by the beautiful Patricia Tallman) has enough of her wits about her to point out how irrational everybody else is being instead of being the catatonic victim like the first time around. \"They're so slow. We can just walk right by them.\" She remarks to Ben (Tony Todd) who is adamant about staying in the house. Perhaps this version isn't socially relevant like the first, but it's nice to see that Romero can add a twist ending that can stand on it's own merits, but really is amusing in light of the former movie.","user":"Big Jon-2","rank":[28,35]}]