[{"title":"exploitation at its finest","rating":10,"date":"2 June 2005","review":"to give you an idea of exactly how over the top this movie is heres some of the key elements present:<br><br>bulimia/vomiting lesbianism amputees necrophilia serial murder transvestitism child abuse/torture cannibalism prostitution drugs (crack, huffing paint, drinking in the shower)<br><br>if you like that sort of thing i can practically guarantee this will become one of your favorite movies ever. Natasha lyonne gives easily her best, funniest performance and any fan of her work should stop at nothing to seek this out (although its not easy). same for Vincent gallo. Matthew brite is a sick genius and this is the most perverse, depraved, funny and entertaining film in his catalog.","user":"stefanlockdown","rank":[25,31]},{"title":"Couldn't stop watching!!","rating":7,"date":"21 May 2002","review":"This movie was soo twisted I couldn't help myself...I couldn't stop watching...I hate the friggin title since it has NOTHING to do with the movie, but I've never seen anything like it...I loved the Hanzel and Gretel twist...Natasha Lyonne has become one of my fav actresses...A must see!!!...I cannot believe I completely lived my life for three years without knowing this movie even existed...","user":"xxmoonxx","rank":[18,22]},{"title":"Another twisted Matthew Bright movie!","rating":24,"date":"24 December 2001","review":"'Freeway II' is just slightly disappointing compared to the original  'Freeway', but once again shows that writer/director Matthew Bright has  ideas and attitude to spare. The first movie retold Little Red Riding Hood, this  one takes on Hansel and Gretel. Natasha Lyonne is no Reese Witherspoon,  but her spunky role here as White Girl, and her memorable turn in the  forgotten gem 'Slums Of Beverly Hills' proves that she is more talented  than lame-brained crud like the 'American Pie' series and 'Detroit Rock  City'.  Maria Celedonio had up until this point passed me by apart from a small  role in Schrader's 'Touch', but she is sensational here as the  psychotic necrophile Cyclona.   Vincent Gallo ('Buffalo 66', 'The Funeral', 'Palookaville') has never  been less than mesmerizing on screen, even in his dialogue-less  blink-and-you'll-miss-it cameos in 'Goodfellas' and 'Basquiat', but  portraying the utterly freaky Sister Gomez is one of his most bizarre  moves to date! Gallo seems set on carrying on the scene stealing nut  job reputation of the late legendary Timothy Carey. More power to him!  Gallo even brings along his 'Truth Or Consequences NM' co-star Max  Perlich ('Drugstore Cowboy', 'Georgia', 'Gummo') as Flacco, a mumbling  hunchback. Perlich doesn't completely surpass his similarly gonzo bit  part in Johnny Depp's 'The Brave', but it's great to see him try!  'Freeway II' will appeal to fans of Gregg Araki, John Waters and Bruce  McDonald more than Michael Bay lovers that's for sure! A must see for  trash cinema lovers.","user":"Infofreak","rank":[17,21]}]