[{"title":"Dying young","rating":8,"date":"16 May 2008","review":"Every time this movie comes on television, I sit in my bedroom and watch it from start to finish as if it was the first time I've seen it. It is a film that focuses on a man, Victor (Campbell) dying of leukemia and his internal struggles of wanting to be carefree and wanting total companionship from the Hillary (Roberts), the woman he hires to take care of him. Eventually, Victor wishes that he could be well so that Hillary can look at him in a different light; however, Victor cannot see pass his disease to allow anyone to be in his life including his dad and Hillary. He abruptly stops his chemotherapy to go live life and die; however, he does not seem to be living it since he so competitive and wanting to be better than anyone else. You want Victor to be cured of the disease and you want him to be less envious of the well people and to stop worrying about death and just live, which is the whole message of the film. Don't be afraid of death since we all will eventually die and no one knows exact time when death will wrapped them in his arm, which is a very powerful message. Great acting from Campbell and Julia. Great cast. Please watch this film and formulate your own opions.","user":"one_way1983","rank":[18,18]},{"title":"A love story which stays inside of you long after viewing.","rating":8,"date":"8 April 2001","review":"A love story, deep and consuming. The characters stay with you, like family.<br><br>(I'm not sure what a 'spoiler' might be with a title like 'Dying Young' - so, if you don't wish to know what the movie is about . . . skip this comment!)<br><br>I've survived five different cancers since 1959. I've watched many others die from cancer, mostly because I've been treated in Veterans Hospitals since 1961 which had 'open cancer wards' of forty to sixty beds and we see all there is to see in each other's lives. I've seen this movie in real life, mine and many others' lives and families.<br><br>You will be utterly absorbed by the consummate, intricate writing of Richard Freidenberg's adaptation of the Marti Leimbach novel and the 'invisible' direction - my finest compliment - done by Joel Schumacher.<br><br>Throughout the film you'll be absorbed by the character's lives. How utterly real their pain, how complete their anguish, how deep their fear,how intense their love: both of the cancer victim Victor Geddes (Campbell Scott) and the loved ones - especially the caretaker becoming lover, Hiliary O'Neil (Julia Roberts).<br><br>If the Victor Geddes character had AIDS or Parkinson or Alzheimer's Disease? The audience and reviews would be thunderous applause; nines and tens. But: about cancer? The audience is frightened to give acclaim to cancer, the shadow disease.<br><br>The predictable audience reaction to a cancer victim story is amazing: Viewers fear contagion! In real life - friends, relatives, loved ones are frightened to death to visit a person with cancer; to 'touch' them?, to breath their air?, to be nearby?. That fear is brought to the theater, to the television and to the VCR. Fear is the Bitch Goddess of Cancer and was ever present in 'Dying Yong'!<br><br>I've never seen Julia Roberts (with whom I've been stuck since 'Pretty Woman\") 'disappear into a role' as she did portraying the woman in love with a man dying with cancer. (I didn't see it in 'Erin Brockavich', at least not by comparison). Campbell Scott, playing the cancer sick Vic Geddes, is likewise consumed by the character and is invisible as an actor. There is not an actor before the camera throughout the film . . . just people about whom you Give-A-Damn; about people, not actors.<br><br>This is an amazing film.<br><br>Some might think I am biased because of my having had cancer: Perhaps. But, to see the gut wrenching under current, words which are never said, emotions programmatically withheld, denial and lies issued and ignored even though instantly recognized until there is a no longer any ability to do so was (is) the most profound treatment of catastrophic illness I've ever seen on film. I kept wanting to yell at each character to speak up, shout, get it out, say something!<br><br>(I wonder if those who have not had cancer had that same reaction.)<br><br>I hope that those who see this film will see the magnificence of its incredible love story (in spite of illness!) and feel its adroit kick in the shin rendered against the 'silence and lies' between those about whom you care when ill. This story is about love, about life, not about death.<br><br>If ever an actor deserved to be awarded an Oscar it was Julia Roberts' portrayal of a woman in love with a man dying with cancer in 'Dying Young.'<br><br>See this film: It is an incredible love story! You'll feel happy for all the characters, and, yourself.<br><br>Killiam Tierney","user":"killiam","rank":[29,32]},{"title":"Romantic tearjerker depicts heartbreak of cancer","rating":6,"date":"19 March 2006","review":"This may not be classic cinema, but I found it a moving portrayal of both the suffering caused by cancer to its victims, and the grief to the loved ones who support them. Of course it's also a romantic tale of the relationship that develops between this particular patient and his caregiver.<br><br>The movie chronicles the story of a young woman, Hilary, who, following a recent betrayal by her boyfriend, takes a job as a private caregiver to a rather difficult young man, Victor, suffering from terminal blood cancer. It dramatically depicts Victor's struggles with chemotherapy (the scenes most memorable to me), and Hilary's assistance, with its ever increasing emotional involvement. <br><br>Julia Roberts brings her typical endearing qualities to the role of his nurse, who risks a broken heart by falling for a young man who is most certainly going to die soon. I've never seen Roberts in a role for which she didn't elicit viewer sympathy. Campbell Scott, son of actor George C. Scott, is also convincing as the young leukemia sufferer. My major complaint is Victor's lack of supportive family relationships (as I recall) or apparent faith. The movie could have been more meaningful if he'd had these, yet in addition, loved and needed Hilary. This scenario is dramatic, but it is unfortunate and simplistic that she is portrayed as his sole reason for living.<br><br>Get out the Kleenex, folks, for the entire movie. I liked the ambiguous ending that left the viewer able to cling to the remote prospect that Victor might miraculously survive. Its message of course is the devoted loyalty until death that Hilary offers. Some viewers have mentioned an alternate suicide ending; that would have definitely ruined the film for me.","user":"roghache","rank":[9,9]}]