[{"title":"STRAIGHT TO THE HEART","rating":6,"date":"6 August 2003","review":"I've seen so many negative comments about this film, and I have none...I thought the acting, subject matter and direction was straightforward and thought provoking.  The film's matter-of-fact tone about the possibility of determining orientation force the viewer to deal with the issues presented here, making the discussion intense.  Performances all good here, and we're reminded of the acting power of both Brendan Fraser and Jennifer Beals, who thoroughly impressed me here, not to mention the film's biggest surprise, Garry Marshall, who turns in a really solid performance as their father. Seek this out and enjoy an intelligent, well done film.","user":"frank56","rank":[17,19]},{"title":"Thought provoking","rating":6,"date":"30 October 2004","review":"I saw this film by accident on the TV one day.<br><br>It really started me thinking, in this day of gene mapping and in-utero genetic testing becoming safer. What would happen if they did find a gene that predisposes a person to homosexuality?<br><br>Would parents get tested and what would they do about it?<br><br>This will always be a controversial issue but there are many factors at play not the least, religion, society acceptance, family pressure, and cultural influences.<br><br>How do you go if you are anti abortion but also anti gay? Okay I know in reality that someone who was anti abortion would probably not have the test but this is the kind of issues that get raised.<br><br>Today in many countries/religions homosexuality is not accepted and they are persecuted. Would you if you lived in that area want your child to go through all of that?<br><br>It would be a dilemma. I thought the film handled the issue quite well.<br><br>There was a lot of conflict as you would expect. There was the son who asked his mother that if she had known would she have had an abortion. The feeling I got was that despite the fact she said she accepted him she didn't really and would of preferred a son who was not homosexual, he was then questioning her acceptance of him, also that of his sister.<br><br>I think I would of left the ending hanging to make people make their own minds up but understand this was a daytime TV movie and so had to have a feel good ending.","user":"agategecko","rank":[13,16]},{"title":"A family torn about the possiblities of a gay child.","rating":1,"date":"1 November 1998","review":"This film was touching. It will make people question their beliefs and raises a lot of moral questions. The casting was very well choosen. Bredan Fraser does a wonderful job of playing a gay man torn over his families dilemma of having another gay child. It is a far stretch from his boy next door image.It shows his ability to portray a wide variety of characters. His sister, played by Jennifer Beals, is pregnant with a child that may possibly be gay. Her and her husband find out, through genetic testing, that their unborn child may grow up to be gay. Her family tries to help her decide if she should keep the child. Since David ( Fraser) is gay he causes his family to deal with the issue in a way they are not prepared to do. His family does not want to make this child suffer as David has. It will make you question yourself as to if there are somethings better off not to know. For instance is genetic testing for such things right and what would you do in that situation? I think this movie is worth watching.","user":"bubba-35","rank":[9,12]}]