[{"title":"The critics couldn't be more off-target!","rating":10,"date":"1 November 2001","review":"While I've been enjoying this film for years, I only recently decided to read some reviews for it, and am shocked!  The truth is, this film is a wonderfully comical and charming tale of three Salem witches that are resurrected by a teenage boy, who, with the help of his little sister and love interest, must try to stop them from stealing the souls of children. This movie really sparkles in the representations of the witches, who are all cast perfectly.  Bette Midler provides for a hilarious and almost frightening Winifred (the leader), Sarah Jessica Parker shines as the sexy, dim-witted Sarah, and Kathy Najimy is marvelous as the funny, perky Mary. What makes the film even better is that there are two stunning musical numbers--Midler's delightful \"I Put a Spell on You\" and Parker's hypnotic \"Come, Little Children.\"  Ignore the critics, \"Hocus Pocus\" is perfect not only for Halloween, but for any time of the year!","user":"franko1998","rank":[203,234]},{"title":"**** out of ****","rating":9,"date":"9 October 1999","review":"I don't what the critics were talking about, but I found Hocus Pocus to be extreme fun, from start to finish.  The use of color and the sets is all magical, giving the movie a strange fairy-tale feel.  I also found it to be very funny with great special-effects.  The movie's just plain fun.  The three witches, thankfully, aren't flat and dull.  This movie is scary without being profane (ala Mighty Joe Young) or super duper frightening. A great film that's much better than most Disney live-action films today.","user":"clay-8","rank":[132,154]},{"title":"They'll \"Put A Spell On You\"!","rating":8,"date":"22 May 2005","review":"A traditional \"Halloween Ghost Story\" turns into a real life adventure for 3 kids who break the spell of the Sanderson Sisters. The story is an engaging one and will have even grown-ups pay close attention. The Sanderson Sisters (wonderfully played by Bette Midler, Sarah Jessica Parker and Kathy Najimy), convicted of witchcraft in Colonial Salem, Massachusetts and put to death some 300 years ago, are brought back to life when \"a virgin lights the black candle\". It's up to two teenagers and an 8 year old to stop the wicked witches from succeeding with their sinister plan: to lure the town's children to their witch house and \"drink\" their life-force away from them.<br><br>Bette Midler steals the show when the sisters crash a Halloween party, singing \"I Put A Spell On You\". There are many \"time jokes\" as well, having the 17th century sisters \"confused\" when they experience 20th century life: Blinded by a truck's head lights, they are convinced the sun is rising; they frantically avoid stepping on a blacktop driveway when they are told that it is \"a black lake of death\"; unable to find a broomstick, one of the sisters heads for the sky on a Hoover vacuum cleaner. The jokes are pretty good, and I was entertained throughout the film. I have watched \"Hocus Pocus\" several times already, and will watch it again and again. This is another example of a movie made for kids, but enjoyed by grown-ups as well. Recommended!","user":"mdm-11","rank":[95,111]}]