[{"title":"Surprisingly good...","rating":7,"date":"17 September 2003","review":"Director Albert Pyun is responsible for some of the most inept movies in the history of cinema.  Never mind the action scenes - Even simple dialogue scenes can be mangled and made unbearable with his magic touch.  Therefore, it comes as a surprise that \"Nemesis\" is so eminently watchable. Nice visuals, interesting ideas, evocative cyberpunk mood, good pacing, and a rather shocking grasp of effective action camerawork and editing.  I suspect that another director did most of the work on this one, but I've never been able to confirm.  All I know is that there are action scenes in here that are genuinely good, to the point where you might think you were seeing the work of a young but talented action stylist.  There's even a \"shoot through the floor gag\" that was ripped off wholesale recently for the Kate Beckinsale vampire/werewolf film, \"Underworld\".<br><br>Of course, keep in my mind that this is a B-film.  It's lower budget and the acting isn't that great.  But among B-films, it's quite good.  As I said, the action is way above average in energy and style.  As well, the locations are varied, and it was one of the earliest films to achieve a William-Gibson-esque cyberpunk feel.  If that sounds interesting to you, then give Nemesis a rent.  BEWARE: Do NOT rent any of the sequels.  Pyun regained his usual golden touch for the sequels, producing what may be the most hate-inducing cinema known to man.","user":"ipkevin","rank":[43,49]},{"title":"Slick, Sexy and Fun Sci-F/Action","rating":1,"date":"1 October 2005","review":"Celebrate Oliver Gruner's heyday by watching the B-movie masterpiece \"Nemesis\". It's really pretty good. Gruner may be the poor man's Peter Weller, but he plays his 85% android character with an effective stone face and only shreds of humanity. Tight direction and good special effects also keep it fast moving and fun.<br><br>Gruner plays Alex, an undercover cop/cyborg hunter. He becomes involved in a dangerous (and at times confusing) plot that sends him fleeing through an industrial wasteland in search for answers. I was tickled pink by a story that doesn't count on cheesy, cop-out twists to maintain its excitement, but simultaneously delivers the goods of a sci-fi and action movie. It lovingly references the movies it takes from, also- which include \"Terminator\", \"Robocop\", and \"Blade Runner\" which keep it on the respectable side of generic. Director Albert Pyun creates a slick neo-noir atmosphere which extenuates the story.<br><br>And the action scenes. Oh, the action scenes. Hit and miss Pyun is in top form- using high-tech, but refreshingly not over the top, weaponry and beautiful urban sets. The shoot-outs are imaginative and never redundant or trite. Don't miss the apartment shoot-'em-up where Gruner shoots at the floor spiraling as to create a hole for him to drop down, which he continues to do for two more floors. As if this wasn't cool enough, Pyun uses a Raimi-esquire shot that stays on Gruner's head as he drops through the building. Yes, 10 years later \"Underworld\" implemented this idea in a more popular film, but I hardly think it did so in better form. There are great stunts, focused direction and good acting to keep it unrelentingly fun.<br><br>\"Nemesis\" does need work, don't get me wrong. As Pyun demonstrated in his 1997 disaster \"Mean Guns\", he has a hard time tapping into his characters and material which makes things seem distant, confusing and at times impenetrable. He has a difficulty capturing transitions adequately, which obscures some of the action scenes.<br><br>Most in the audience will be pleased by the film's unlimited sex appeal. The movie creates a fascinatingly erotic connection between the near future and wangled, unrestrained sexuality. Deboarah Shelton is endlessly sexy and gives the movie a raw energy that almost compensates for its distant connection to the material.<br><br>I loved \"Nemesis\". It has a wonderfully distributed blend of science fiction and action. While there may be a brick wall between the audience and any hope of an emotional connection, it is sexy and fun enough to remain a great time.","user":"Nick_Dets","rank":[36,45]},{"title":"Lots and lots of action","rating":10,"date":"10 February 2002","review":"I had never heard of this movie when I first saw it in the store, but the cover looked cool, and the story sounded neat (well, actually I was more interested in the word \"Cyborg\" on the cover) so I rented it. I really liked it! Lots of action and CYBORGS!! The plot is a bit confusing, and you never really get a hang of it since they never fully explain it in the movie, but after several viewings I think the plot goes something like this:<br><br>LAPD Cop Alex Rain is half-human, half-cyborg (don't expect a mean killing machine àlà RoboCop, though) and he has to stop the Cyborgs before they complete their mission to kill all humans one by one and replace them with Cyborg duplicates. Well, Alex Rain goes to some \"low tech, s**t hole called Shang Loo\" (quote from the movie) and does a bit of killing and shooting. Well actually he does loads of killing and shooting.<br><br>Lots of action, and that's always good. The acting is poor, but Oliver Gruner does a good job as our man, Alex Rain! Poor effects, and a better soundtrack wouldn't hurt. But overall its a pretty good movie! 7 out of 10.","user":"evilned-1","rank":[24,30]}]