[{"title":"A Dark Comedy that comes out shining very bright","rating":8,"date":"1 November 1999","review":"When I first saw this movie, I absolutely loved it.  With each successive viewing, I noticed the characters' emotions as they coped with the dirty hand that has been dealt to them and making the most of it.  I also saw the immense bond between the men as they already shared the low-class existence and a rather bleak future but seeing nothing but an opportunity to be rich. And they were all willing to endure the humiliation in front of hundreds of people to achieve it.<br><br>Like M*A*S*H, the Full Monty shows people placed in a harrowing existence with seemingly no end in sight.  Yet the laughs are sprinkled throughout nicely, and even though each man has their own personal fears to overcome, they find strength in each other, which makes the experience all the more fruitful.<br><br>The actors were absolutely top notch, particularly Robert Carlyle.  I was already impressed with his performance from Trainspotting to know that he is very capable of carrying the central figure of the movie.  Peter Cattaneo's direction was inspired, and he knew the right angles to use (check out the scene when the lads were auditioning new members, particularly Guy) for perfect comedic effect.<br><br>I admit that some of the sub-plots needed more fleshing out, particularly between Gaz and Nathan as well as Gerald and his wife.  And as many times as I've seen the movie, I don't know much about Guy other than his love for Singing in the Rain and his obvious natural endowment that took the breath away from his mates!<br><br>The music was terrific as well.  I dare anyone to deny that they had to consciously stop tapping their feet when hearing \"Hot Stuff\" after watching this movie.<br><br>I have been to Sheffield recently, so the movie holds even more personal meaning for me.  And for all those complaining about the accents being difficult to understand, watch it again. It's in English not Chinese!  The accents are part of the charm.  I rate this movie a solid 8.5 out of 10 and worth seeing many times over.","user":"ebe28","rank":[72,78]},{"title":"A bunch of losers make for a winning film","rating":8,"date":"9 August 1999","review":"This is a great black comedy.  A bunch of losers down at the job centre have no hopes of getting a job.  As the film progresses, it picks up momentum as the big date approaches.  Some great scenes of 80's Britain, the job centre, the clubs, the houses with paper-thin walls and low ceilings.  You know what the finale is going to be, but it doesn't detract at all from the enjoyment of the film.  It doesn't get political, as some other commenters have complained, but why should it?  This is about the consequences of 80's Britain, not the causes.  The characters are 100% believable, in their appearances and their behaviour.  The fat one is the sort you see on a Saturday night in just about every city centre pub in England (and at the football matches too!).  A pity some viewers from across the pond couldn't pick up the accents, that's not altogether surprising but consider that this film was probably not originally intended for worldwide distribution and if you had taken the accents away you'd have taken away also a lot of its charm.<br><br>PS: Sheffield, where the film was based, is actually quite a nice town in many areas.","user":"JCR-4","rank":[41,45]},{"title":"\"Excuse me... nobody said anything to me about the Full Monty\"","rating":9,"date":"5 April 2008","review":"I remember this movie when it originally came out. It looked interesting, but I was younger at the time and I wasn't allowed to watch R-rated movies. Later, I finally saw this movie about three years ago on HBO. I laughed my a** off. It was so freakin' funny and I still think it is funny. I bought the \"Fully Exposed\" two disc DVD and I still love this movie. Yeah some people don't understand British humor, but I love it still. I grew up watching Bristish shows like \"Mr. Bean\" and \"Are You Being Served?\" I love those shows and I love this movie, I think it is one of the best comedies ever made. I highly recommend it, you will laugh as hard as I did.","user":"theaxekeeper","rank":[14,14]}]