[{"title":"Redemption and Resurrection","rating":29,"date":"29 May 2004","review":"Warning: Possible spoilers.<br><br>The Fisher King, a 1991 film directed by Terry Gilliam is based on the myth of the same name-a medieval legend that tells the tale of a dying king who through betrayal and tragedy has lost the Holy Grail. Ostensibly the cup Jesus used at the last supper and into which drops of his blood were collected at the crucifixion, it is the only thing that can save him. He knows this but he is powerless to do anything about it, and although it is right in front of him, he can no longer have the ability to recognize it. It takes an innocent fool with unclouded eyes and a compassionate heart to see it and to fill it with the healing water that the Fisher King needs to be restored. <br><br>In the film version, Parry (Robin Williams) and Jack (Jeff Bridges) alternately play the fool and the king, each in retreat from his own reality and each the vehicle for the other's redemption. Their lives first intersect when Jack-a shock jock-inadvertently incites a disturbed listener to commit a horrific act of violence that destroys many lives including Parry's. Parry escapes into madness and homelessness, as in a sense does Jack (though his is manifested through alcohol and a parasitic relationship) and they are each lost in a world of guilt that they are powerless to overcome. It will take each to play the fool to the other's king to open each another's eyes to the possibility of redemption and new life. <br><br>Other characters are interwoven (Mercedes Ruehl and Amanda Plummer aptly play the love interests) but it is Parry and Jack who are both the redeemed and the redeemer in this tale. There are stops and starts and other theological and social messages that are interwoven throughout, but this is first and foremost a story about healing the wounds of others, and the importance of giving over receiving. Through Parry's redeeming act, Jack is redeemed and through Jack's redeeming act, so is Parry. Unable to heal or even see their own wounds, they clearly see the wounds of the other, and like Christ, they provide the bridge to life. The Holy Grail, visible only through the compassionate eyes of the fool, becomes the cup filled with the water of life from which they both take a drink and are resurrected.","user":"terribracy","rank":[67,69]},{"title":"This movie should be on everyone's \"must-see\" list","rating":10,"date":"23 July 2004","review":"A touching yet humorous tale, THE FISHER KING brings together amongst the best performances given by Robin Williams and Jeff Bridges, as well as Terry Gilliam's finest directorial effort.  Solid supporting performances by Amanda Plummer and Mercedes Ruehl round out a great film that ranks among my personal favorites.<br><br>Bridges portrays an arrogant radio shock-jock, who's big mouth and flippant comments send a disturbed listener on a murderous rampage, thus ending his career.  Enter Ruehl as his new enabler girlfriend, waiting patiently for him to drag himself up from the dregs, hoping to catch a ride to the top. Just when Bridges seems to have hit rock bottom, he encounters Williams, a crazed vagrant who thinks he is a knight in shining armor.<br><br>What ensues is a tale of remorse, redemption and rebirth which is made all the more magical by Gilliam's magnificent vision.  Most notable is a scene which takes place in Grand Central Station where the hustle and bustle of the busy commuters dissolves into a spectacular waltz as Williams follows Plummer, the woman of his dreams.  Gilliam's style makes Williams delusions come alive as the character makes the slow journey from trauma-induced insanity to stark, yet hopeful, reality.  <br><br>Every character in this film undergoes a metamorphosis, each learning from the others along the transformation.  It is a beautiful film to watch, and an achievement to all involved that subject matter of such depth can come across with such humor and with such beauty.","user":"LJMTitle","rank":[169,187]},{"title":"Terry Gilliam","rating":19,"date":"19 September 2002","review":"Terry Gilliam has made a lot of good films and a couple of great ones(namely Twelve Monkeys and Brazil)this, though could well be his best.<br><br>Why ?<br><br>For starters there is the cast.Jeff Bridges,officially the most underrated actor of his generation, giving a performance that veers from one end of the spectrum to the other almost imperceptibly.From comedy to tragedy and back again.<br><br>Robin Williams- a great comedian and a better actor than he is given credit for.Fair enough he does tend to go through spells of making films primarily for his kids (Mrs.Doubtfire, Hook, Jack) but when he does decide to buckle down and do a serious role he rarely disappoints (Good Will Hunting, Insomnia, Dead Poets Society).It is with this role though that Williams gives what is the best of his career to date,as Parry. He is undoubtedly insane, but it is not yet too late for him, he justs needs someone to take the effort to save him, and if it had not been for Bridges colossal mistake and subsequent search for redemption, no-one would have done it, and he would never have survived, merely another casualty of another one of Gilliams nightmarish cityscapes. Mercedes Ruehl is perfect as Bridges suffering girlfriend.She thinks of herself as hard-bitten a survivor, and yet she continues to stay with Bridges, trying to prove to herself that she has the strength to change him, to redeem him. She wants to be his saviour, and yet he comes in the shape of a homeless madman, prone to dancing naked in Central Park and seeing floating fairies whilst defecating.The Fisher King is a movie about hope, despair and redemption, and all of the human conditions that fit in between.It contains one of the most inspired,beautiful scenes in recent memory,as Grand Central station transforms from a dingy,noisy concrete hole into a luscious, gorgeous ballroom, simply because of Lydia, Parrys love, the one thing that keeps him grounded in any semblance of reality.The chinese restaurant double- date in which Parry connects with her for the first time is both funny and touching, and makes what comes after even more tragic.<br><br> It is at times tragic,brutal even but it's heart cannot be doubted,and it remains a wonderful success.","user":"mistresswong","rank":[110,121]}]