[{"title":"Fascinating","rating":8,"date":"14 December 2017","review":"This 1954 film from the Children's Film Foundation (CFF) survives now in this version which says it was revised in 1972, although we don't know what was revised.<br><br>Little Jenny (Mandy Miller) breaks her mother's china dog and so decides to go with neighbor's to work in the hop fields to earn money to buy a replacement. Straightforward plot then follows her adventures in the hopfields while her parents try to find her.<br><br>This time capsule shows street signs advertising for families to \"vacation\" in Kent and earn money by picking hops. Film opens with a frenzy of activity as all the families on Jenny's street rush to catch the train to Goudhurst, Kent.<br><br>Jenny hides out with a neighboring family but also has an adventure in an old mill with two nasty ragamuffins who engage in several fights with the hopfield kids. It's never explained where these two boys come from, but they apparently meant to be gypsies.<br><br>Miller is fine as the girl. Several familiar faces in the cast include Mona Washbourne as Mrs. McBain, Hilda Fenemore and Russell Waters as the girl's parents, Harold Lang as Sam Hines, and Dandy Nichols as Mrs. Harris. Among the kids are Melvin Hayes and Leon Garcia as the ragamuffins, and Jane Asher as one of the McBain kids.<br><br>The film was found in a rubbish bin in Chicago, and a film collector in England bought the film sight unseen. The long-lost film finally had its \"premiere\" in Goudhurst in 2002 with several of the film's children in attendance.","user":"drednm","rank":[7,7]},{"title":"Excellent Nostalgia","rating":9,"date":"30 March 2008","review":"I saw this film at the Whitbread Hopfarm in Kent a few years back. What an excellent piece of nostalgia and a perfectly delightful film. Reminded me of Saturday morning pictures 6d admission. The story is of a the London families who spent their \"annual holiday\" at the Hopfields. way that they would stretch out money (even a gift of a china dog) and the subsequent adventure that the children have at a windmill. Mandy Miller ( yes her of Mandy fame) played an excellent part - was probably one of her first parts. Could the owner of this film PLEASE consider releasing it for purchase on DVD. He was so enthusiastic that people should see it when he showed it and today's technology gives him the perfect opportunity to pass on this piece of history. I would give this 10/10 but the picture quality is a little grainy (but nevertheless well restored and acceptable)","user":"j-reed-1","rank":[5,5]},{"title":"Excellent Children's Film Foundation Flick","rating":8,"date":"13 December 2017","review":"When Mandy Miller breaks her mother's treasured china dog, she comes down with a brainstorm and runs away in hopes of a working vacation in Kent without telling anyone.<br><br>Having seen half a dozen of these Children's Film Foundation movies, I thought I knew what to expect: some great scenic photography and some heavy-handed moralizing about how good children should behave -- as decreed by people who no longer remembered being children, had no children themselves, or who believed the lies their children told them. What I found was a very well told story directed by John Guillerman with a frequently subjective camera that evoked very nicely the fears and simple moral narratives of children. If it gets heavy-handed at the end, with a melodramatic rescue from a burning mill, at least the evil-doers are ambiguously repentant -- they never expected anyone to get hurt, really, they were just having a bit of a laugh.<br><br>I doubt the moralisers will be very pleased with this movie. However, I was.","user":"boblipton","rank":[3,3]}]