[{"title":"An Instant Classic","rating":10,"date":"11 February 2018","review":"The music; the way the camera moves; the performances: this amazing ensemble piece takes everything to the next level. Although the influence of Robert Altman and Martin Scorsese can be felt throughout the whole film, P.T. Anderson doesn't copy them but merely uses some of their trademark techniques to create his very own, unique brand of film.<br><br>There are so many creative ideas and standout scenes in this film: I'm sure that, similarly to how filmmakers of Anderson's generation are citing films like 'Nashville' or 'Goodfellas' as their inspiration, the next generation of aspiring directors will be citing 'Magnolia'. The film is not \"just\" a masterpiece, but also hugely influential and an instant classic. 10 stars out of 10.<br><br>Favorite films: IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: imdb.com/list/ls070242495/","user":"gogoschka-1","rank":[107,142]},{"title":"I have never before spent so much time analyzing, discussing, or viewing a film...","rating":10,"date":"12 January 2000","review":"And it is a FILM.  It is no ordinary movie.  As a fan of Boogie Nights, I couldn't wait for Magnolia.  Although its running time has made at least 20 people leave the auditorium, I have stayed for every single second.  The mood and stories and characters keep building and building and building, and when it finally comes down, I feel this immense sense of relief and wonder at how PT Anderson was able to come up with something so clever and intertwining and wonderous, and was able to pull it off.  This \"movie\" is not for everyone.  It is thinking-hat required.  I have also never been so excited to look up Bible verses before. The cast, as you have probably read, is superb.  I have never been so impressed.  This film has \"restored my faith in the filmmaking industry. To see these actors, crew, and the writer/director/genius at work is inspiring.\"  These people obviously love their craft, and one of my friends even said that the cast was \"touched by the hands of God...\" to which I whole-heartedly agree.  He also has said, \"\"This film not only teaches film makers how to make films, but it teaches movie watchers how to watch movies!\" to which I again whole-heartedly agree a thousand times over. Phillip Seymour Hoffman is absolutely outstanding as the only character who is \"normal.\"  His performance has made me smile and shake my fist in the air the three times I've seen Magnolia since it opened.  Tom Cruise is also spectacular.  As with every single last character, every line he utters is important to his character and what it means for the rest of the stories. Another outstanding performance/character is the part of police officer Jim Kurring, played by John C. Reilly.  His character is just so perfect and JUST SOOOOO PERFECT that it makes me smile every time he is on screen. Add to all of this one incredible soundtrack, and you have something that will go down in film history as legend and probably one of the most underappreciated, misunderstood, and definitely underseen films of all time.<br><br>The soundtrack, oh, the soundtrack.  When listening to the songs, I can picture each exact moment as if I was watching the movie all over again, and it brings unexplainable feeling.  Aimee Mann's songs, especially, are a perfect fit to a perfect story and mood. This film is not for everyone, but, if you want to see glorious filmmaking, acting, writing, and characters in action, I HIGHLY suggest you see Magnolia.","user":"McWoop","rank":[382,545]},{"title":"often brilliant, occasionally forced film","rating":3,"date":"3 September 2000","review":"`Magnolia' seems to divide audiences as much as it bewilders them.  Some there are who see it as a brilliant exercise in creative, thought-provoking moviemaking, a film that challenges the notion that modern American cinema is comprised exclusively of formulaic retreads of earlier films or slick, mechanical displays of technical virtuosity, devoid of meaning and feeling. Others view `Magnolia' as the nom plus ultra of pretentiousness and self-satisfied smugness.  Which of the two assessments is the correct one  or does the truth lie somewhere in between?<br><br>Actually, there is much to admire and cherish in `Magnolia.' Writer/director Paul Thomas Anderson has done a commendable job in putting on the screen a relatively unique vision  a qualification I feel forced to make because it does seem patently derived from much of the trailblazing work of director Robert Altman.  Like Altman, Anderson creates a vast canvas of barely-related and briefly overlapping storylines and characters that come together under the umbrella of a single major theme and a few minor ones as well.  Anderson's concern is to explore the concept of forgiveness and to examine the part it plays in the redemption we all seek through the course of our lifetimes.  In this film, dying characters struggle to make amends with the loved ones they will soon leave behind, while estranged characters grope tentatively to establish or re-establish the bonds that must link them to other members of the human race.  Anderson presents a tremendously wide range of characters, though for a film set in the northern areas of Los Angeles, `Magnolia' provides a surprisingly non-diverse sea of Caucasian faces.  However, in terms of the ages of the characters, Anderson's crew seems more comprehensive, running the gamut from a pre-teen wiz kid to a terminally ill man in his mid-60's.  Many of these characters seem to have created any number of facades to help them cope with the miseries and disappointments of life  and much of the redemption occurs only after those masks are stripped away revealing the emptiness and hurt that, in many cases, lurks so close to the surface.<br><br>Thematically, then, Anderson's film is a compelling one.  Dramatically, however, it suffers from some serious flaws.  Many viewers and critics have called `Magnolia' an artistic advancement, in both depth and scope, for Anderson, whose previous film was the similarly dense, moderately freeform `Boogie Nights.'  I tend to disagree.  If anything, `Boogie Nights,' by limiting itself to a much more narrowly restricted milieu  the 1970's porn industry  and focusing intently on a single main character, managed to connect more directly with the emotions of the audience.  `Magnolia,' by being more expansive, paradoxically, seems more contracted.  The pacing is often languid and the screenplay, running a bit over three hours, often seems bloated given the single-mindedness of its basic theme.  Certainly, a few of these characters and storylines could have been dispensed with at no great cost to the film as a whole.  By lining up all his characters to fit into the same general theme, the author allows his message to become a bit heavy-handed and over-emphatic.  Anderson seems to want to capture the whole range of human experience on his enormous (and enormously long) movie canvas, yet because the characters seem to all be tending in the same direction - and despite the fact that the details of their experiences are different - the net effect is thematically claustrophobic.<br><br>The controversial ending, in which an event of literally biblical proportions occurs, feels generally right in the context of this film, though with some reservations.  It seems perfectly in tune with the quality of heightened realism that Anderson establishes and sustains throughout the picture.  On the other hand, the ending does pinpoint one of the failures of the film as a whole.  Given that the screenplay has a strong Judeo-Christian subtext running all the way through it, one wonders why Anderson felt obliged to approach the religious issues in such strictly oblique terms. None of the characters  not even those who are dying  seem to turn to God for their forgiveness and redemption.  In fact, one wonders what purpose that quirky ending serves since the characters are well on their way to making amends by the time it happens.<br><br>Anderson has marshaled an array of first-rate performances from a talented, well-known cast.  Tom Cruise provides a wrenching case study of a shallow, charismatic shyster, who has parleyed his misogyny into a lucrative self-help industry.  Yet, like many of the characters, he uses this façade as a shield to hide the hurt caused by a father who abandoned him and a mother whose slow, painful death he was forced to witness alone.  The other actors, too numerous to mention, turn in equally worthy performances. Particularly interesting is the young boy who, in counterpoint to one of the other characters in the story, manages to save himself at an early age from the crippling effect of identity usurpation that it has taken so many others in this film a lifetime to overcome.<br><br>In many ways, `Magnolia' is the kind of film that could easily serve as the basis for a lengthy doctoral dissertation for a student majoring in either filmmaking or sociology.  The density of its vision would surely yield up many riches of character, symbolism and theme that a first time viewer of the film would undoubtedly miss.   Thus, in many ways, `Magnolia' is that rare film that seems to demand repeat exposure even for those audience members who may not `get it' the first time.  As a viewing experience, `Magnolia' often seems rambling and purposeless, but it does manage to get under one's skin, and, unlike so many other, less ambitious works, this one grows in retrospect.","user":"Buddy-51","rank":[314,454]}]