[{"title":"Extraordinary Film","rating":10,"date":"23 May 2004","review":"The most intense and powerful film I have seen in years. There have been other films before that delved into the Vietnam Vet but nothing compared to this emotionally heartwrenching film, as a typical American suburban family, circa 1972, comes apart at the seams, revealing the scars that Vietnam has left on our all of our collective souls. The cast is A++++ fantastic with all four actors(with Kathy Bates a stand-out) giving riveting performances. What is wonderful about this film is that you take no sides, but understand all four characters and empathize with them, even though all four have divergent viewpoints and needs. There are scenes in here that are so powerful as family secrets and feelings are revealed(such as the confrontation between son and mother) that will have you emotionally drained and in tears of anguish. I actually cried in this film, something I rarely do. The shocking end is a stunner! A much overlooked film that should be seen. I rate this 1996 film a 10/10 a superlative piece. Highly recommended especially in this day and age with again, our country embroiled in a hideous war, our headlines shouting of atrocities and again, our young men and women returning with deep psychological scars, with their deep pain of deeds done in the line of honor. A must see film.","user":"irishcoffee630","rank":[23,25]},{"title":"Wow!","rating":10,"date":"13 May 2004","review":"I was just lucky I found this movie.  I've been taking advantage of Walmart's $5.50 DVDs, because I watch a lot of movies (and very seldom watch television). I graduated from high school in 1968 - so I have family and many friends who served in Vietnam.  This movie really illustrates the pain I've seen in my friends in dealing with what happened to them over there. I wish more people would see this movie - I think maybe more people could understand what happened to our Vietnam vets by watching these excellent actors in the portrayal of one family damaged by that war. The story felt realistic - it isn't mushy, but made me feel what they were going through. I think it helped that Martin Sheen and Emilio Estevez were playing father and son - it made their relationship more believable,","user":"mycroft717","rank":[19,21]},{"title":"Extremely powerful film!","rating":9,"date":"2 June 2002","review":"I caught this movie on TV yesterday.  I had a certain curiosity about it, being that it was directed by Emilio Estevez and starring him and his real-life Dad, Martin Sheen.  I love to see a movie about a father-son relationship that involves a real-life father and son.  Naturally, there's an instant chemistry between Sheen and Estevez, and their scenes of conflict are even more intense, knowing that they're actually related.  Of course, it helps that the two of them are both terrific actors.  I've seen Martin Sheen in intense roles before, but I think this is Emilio's most intense role--being that I mostly recall him from the \"Mighty Ducks\" series--and I was very impressed.  Talent REALLY does run in that family.  And Kathy Bates steals the movie in an Oscar-worthy performance.  She tugged at my heartstrings with every word of dialogue.  Kimberly Williams--the beautiful actress from the \"Father of the Bride\" movies--is also very good, holding her own among a group of talented veteran actors.  <br><br>The movie is a bit stagey, with dialogue that's obviously geared for the stage, but that didn't bother me.  This is not meant to be an action movie; this is a character study.  And for a film that's based on a play, it never gets too claustrophobic.  When Emilio's character, Jeremy, reminisces to his days in Vietnam, we actually see his harrowing memories brought to life. <br><br>\nThe film is extremely powerful and realistic, without being sentimental.  At the end, I expected all the conflicts to be resolved and the family would become hunky-dory, but that's not how it turned out.  The ending made me cry, without resorting to standard Hollywood melodrama.  That proves reality is much more gripping than anything Hollywood can conjure up. <br><br>\nIf you're in the mood for a beautiful, powerful drama with extremely wonderful performances that will knock your socks off...please check out this underrated gem.  Hopefully, one day Martin and Emilio will unite with Charlie, and they will all make a great film together. <br><br>\nMy score:  9 (out of 10)","user":"mattymatt4ever","rank":[21,24]}]