[{"title":"rather disturbing movie","rating":6,"date":"22 October 2000","review":"The acting especially delivered by Jennifer Tilly is surprisingly very good. The plot is rather disturbing but still enjoyable. There are many thrilling moments especially dealing with Tilly's rather psychotic character. All in all it's quite an entertainment, better than what we expected, since we had nothing to do and decided to watch this at the cinema and found out that it's a suspense Stephen King type of movie.<br><br>The story line is about two couple dying to have a baby of their own and tangled in a rather mad confrontation which include kidnapping and murders with a rather interesting background. But i think you better watch this at home...","user":"rishardana","rank":[5,5]},{"title":"Off the wall and hilarious!","rating":19,"date":"19 November 2001","review":"From the outset, 'Hide and Seek' promises more than it can deliver, and left me not only disappointed, but also a little disturbed.<br><br>It storms straight into the story with Anne (Hannah) kidnapped by an intruder. With a series of flashbacks we are told that she was expecting a child, only to be informed at the hospital that she has made a mistake and is, in fact, not pregnant. It transpires that the guy doing the tests is the kidnapper, and he and his wife plan to hold Anne captive throughout her pregnancy, ultimately killing her and keeping the baby as their own.<br><br>There is a glimmer of an original idea behind this, but it is so badly executed that after about 45 minutes it really begins to drag. Obviously, the comparisons to 'Misery' are expected, but if you thought Kathy Bates' performance was over the top, wait until you see Jennifer Tilly! - not so much a woman on the edge, more like 200 miles over it! She sounds like a demented 'Mickey Mouse' (check out the bedroom scene, she even has the ears!) and grows ever more unbelievable, swinging from charming host to psycho killer in a flash. But this show degenerates into farce, particularly in the scene with the 'diaper service'. I was in hysterics! A totally unbelievable character, and therefore lacking in any malice, and providing no suspense whatsoever. The rest of the movie is full of such glaring plotholes that it comes across like a cheesy TV movie, with the whole idea leaving a nasty taste.<br><br>Watch it for Tilly if nothing else. You won't forget it!!","user":"sibisi73","rank":[11,14]},{"title":"Implausible to say the least","rating":22,"date":"22 February 2004","review":"The makers of this movie had to really stretch to make this work. Some things that bugged my partner and I about it: Anne tries to flag down a driver on a lonely country road and the driver DOES NOT STOP! Absurd given the part of the world she is in. Of course they would stop! Also, the doctor doesn't report the suspicious pregnant woman? The diaper service lady doesn't gossip? The husband is brushing his teeth and just stands there half listening to the answering machine? \"Gee, that sort of sounds like my wife. I'd better just stand right here and half listen to it just in case it isn't. . . \" The detective doesn't believe him and hangs up? And the director had to make sure that for some strange reason Anne's chains were abnormally long or the last scene just wouldn't work. Also, how is it that after all the beating and starving and drugging that the baby would be normal? It was just stretch after stretch after stretch. You get tired of shouting: \"Oh, come ON!\" after awhile. I loved Tilly in Bullets Over Broadway, but she's trying way too hard.","user":"ejwestlake","rank":[9,11]}]