[{"title":"Jaglom finally gets it right","rating":8,"date":"4 January 2005","review":"This film is a real triumph for Henry Jaglom. It's his first really mature film. His previous works have been patchy, to say the least. Though never uninteresting, as works of art they are flawed by Jaglom's personal fascinations which might not necessarily be shared by others. He's come a long way since his first movie \"A Safe Place\" where he gathered the likes of Jack Nicholson, Orson Welles and Tuesday Weld, but still managed to produce a confused, over indulgent and basically forgettable film.<br><br>However all is forgiven. Jaglom finally gets it right. The characters are truly interesting, more so of course, if you have an interest in the theater. While keenly critical of the often insufferable egos on display, there's an underlying affection for them all which is genuinely winning.<br><br>Jaglom has assembled a large, varied and extremely colorful cast playing their characters with a level of identification that it's almost like watching a documentary. After these are actors playing actors, or in the case of Jon Robin Baitz, a playwright playing a playwright. And then there's the luminous Viveca Lindfors at the helm. The scene of her watching her past movies on television and commenting on them, has a touching poignancy.<br><br>Lindfors is fascinating to watch. It's a role she must have relished and one far more revealing than she may have realized. While she's wise of life and the theater, she's manipulating, demanding and all in all highly egoistic. Lindfors was a beauty and an undoubtedly very capable actress, particular in her later roles. She made some 100 movies and yet not one of them is in any way remarkable or indeed memorable. Yet to watch her in this semi-documentary role, one senses she has a sense of self importance as an actress not at all related to what was by all accounts a mediocre career.<br><br>\"Last Summer in the Hamptons\" has a sense of celebration about it. While the celebration is the production of Chekov in the garden of wonderful house about to be sold, it's a celebration of the theater itself and the dreams, frustrations and passions of those who are captivated by the illusions and delusions of the theatrical ethos.","user":"grahamclarke","rank":[10,12]},{"title":"Jaglom brings his whine fest to the Hamptons.","rating":2,"date":"14 May 2009","review":"Henry Jaglom is the Woody Allen light (0 calories, 0 talent) of American film. His films (most of which he writes) are filled with unctuous pseudo intellectuals who do a vast amount of talking and very little listening. Filled with self importance they name drop ferociously and go from dull and tiresome conversation into mawkish rages that border on infantile.<br><br>In Last Summer in the Hamptons we are given the same crowd, this time as a theatrical family faced with selling there Long Island estate. Along with friends they all gather at the home for the last performance of the annual summer's end play. Enter your cross section cast of smarmy empty self important characters. The Matriarch, the Hollywood actress, father son playwrights at odds with each other and assorted precocious types age 16 to 60. Jaglom then patches the rest of the film together with mix and match conversations done in mostly two shot with some of the most annoying use of zoom this side of Spike Lee.<br><br>The dialogue which sounds like it was mostly improvised is stilted and flat save for some hammy flourishes by Viveca Lindfors. As Oona the LA actress, Victoria Foyt acts as if she's stranded on a raft in the middle of the ocean, clumsily pausing and searching for words, groping the other actors as if drowning. Given co-writer credit you would think she might have a better grasp of the script.<br><br>The rest of the cast is equally unremarkable because of Jaglom's sloppy inability as a director to get his actors to raise the heat above tepid. It's clear Jaglom's working on a shoestring budget knows a few people in the business and makes the most of what he has. I usually admire scrappy auteurs like Herzog and Fuller who have to sacrifice for their independence, but with that freedom must come form, content and talent, none of which Jaglom displays in this pompous loser.","user":"st-shot","rank":[12,15]},{"title":"Chekov on Long Island","rating":27,"date":"27 July 1999","review":"Henry Jaglom, a film maker as much tied to the New York theater world as he is to Hollywood, writes and directs a story well-keyed to his split loyalties.<br><br>A Hollywood actress about to sign on for her umpteenth reprise of a commercially successful but cartoonish role longs for artistic redemption and a full workout of her instrument. She travels with a friend to a dying temple of private summer theater in East Hampton, New York. There she visits with a legendary actress (Viveca Lundfors) and her extended family as they mount their last summer play before selling their long held homestead.<br><br>The family members are neurotically, hopelessly tied and dedicated to each other - tearing at each other for understanding while upstaging each other. The Chekovian scale and tone of this screenplay are both well met - the dying estate, the large ensemble and tumbling scenic structure. There is much of Woody Allen, Ingmar Bergman, John Cassavetes and Chekov here. The scenes are tightly written, and deftly played - and very likely improvised off and on. Andre Gregory does a funny turn with Victoria Foyt in one wrestling scene. Melissa Leo, drenched in longing as Trish, hits some fabulous peaks. Victoria Foyt as Oona is also strong. Lundfors thoroughly understands her role as a legendary matriarch whose attempts at self-effacement never quite ring true.<br><br>This is a funny, loving look into the foibles of a theater family -- their fatuously ego-driven yet heart rending issues. For theater lovers and mature fans of Ibsen, Chekov, Joyce, Mike Leigh, Bergman or Allen \"Last Summer\" will be satisfying. For others, be forewarned. You may miss the point.","user":"claude-18","rank":[7,9]}]