[{"title":"Every seven years a slice of life","rating":17,"date":"17 June 2001","review":"Fourteen English children from various parts of society, all born about 1957, have their lives looked at every seven years by Michael Apted and his TV camera. This episode brings us up to 1999 and 42 years old. All are still alive and eleven out of the original fourteen are still participating. (Ironically, one of the drop-outs is a prominent BBC TV producer.)<br><br>\nThe two continuing themes are 1) the Jesuit saying `give me the child before he is seven and I will give you the man' and 2) the power of the British class system to determine outcomes. Although the Jesuits suggest that by the age of seven it's too late, some of the kids from lower class backgrounds have done surprisingly well. Nicholas, a Yorkshire dales farmer's son has become a Professor of Physics. Tony, a cockney kid who wanted to be a jockey has finished up owning several cabs. Three working class girls have all finished up with better jobs than their parents though their marital relationships have been rocky. Even the shy son of a single mother has finished up happily married and employed. None of the better-off kids has failed either, though one or two went through rough patches in their early 20s. The three seven year old `upper class twits' (only one of whom still participates in the program) are all professionals and have all succeeded professionally - a QC, a solicitor and the aforesaid shy TV producer. Bruce, a kid with a flair for mathematics, after a varied career, has settled down as a fine teacher in a city high school. They only real stray has been Neil, the dreamy little kid from Liverpool, who after a lengthy period as a down-and-out has popped up as an elected official no less, a Liberal Democrat councillor in the London Borough of Hackney. <br><br>All the subjects tell their stories fairly fluently to the camera, even Paul, a very shy kid who migrated to Australia as a teenager. Several have now lost one or both parents and there have been several failed marriages. Apted is a gentle interviewer but there has obviously been a lot of pain with the gain.<br><br>This is a unique series and the group is not really a random sample (too many toffs and working class kids) but it can be said it shows the persistence of the class system: only one kid has really beaten it, the physicist, and he's left the country. There are no cockney accents in the courtroom except from the witness box. The standard of living in general has increased markedly since the 1960s and `trickle down' economics has ensured that the working class (what's left of them) is better off. Women have done better too, in terms of independence and money, but at a considerable emotional cost in some cases. For them the changes in the social landscape have made it harder than for the boys; the role of women in society has completely changed whereas men plod on much as before.<br><br>The one good indicator of future employment success is education, which is notoriously class-based in England (Scotland is a little different). If the (shy) QC had gone to the local council school instead of Charterhouse it is not likely he would he exercising his tonsils today in the High Court. Tony, our successful cabbie might have become a solicitor if he had come from a different social class. Some of the subjects say that class isn't what it was, but it, and the educational system it operates through, are still pre-ordaining outcomes. Perhaps it's the same in most countries (Paul has noticed a class system in Australia); it's just that the British class system stands out a bit more.","user":"Philby-3","rank":[11,11]},{"title":"Brilliant series","rating":9,"date":"25 October 2001","review":"I can't say enough about this series. I just watched 28 up, 35 up and 42 up all in about a week's time, so there are a lot of things to talk about within the entire series, rather than just in this one particular film. But I'll do my best to focus on 42, since that is the film I am commenting on.<br><br>\nAs a film on its' own, 42 up is probably the most interesting of the series as far as watching the people change physically over the years goes. Each subject filmed at the six different stages appears (except for those that had dropped out of the program) and you get to see how they have transformed over the years. 42 is also great because you also get to see how film techniques (&amp; stock) have evolved over the years along with the people. In the present time, the film looks beautiful and rich in color while each successive film appears murkier and murkier over time until you get the original black and white of 1964. The problem with 42 Up, if you were going to watch just this one film, is that because there are so many flashbacks of people at various stages, this leaves little room for getting to know them better (during a 2 hour time frame). I have talked to people who say, \"I am just going to watch 42 up because they give you all the background stuff anyway..\" I say NO!.....<br><br>For a richer experience, and this is what I did so you can take it for what it's worth, watch 28, 35, and 42 up at least so you can get to know these people fully at each stage. There are crucial things that happen to these people in 35 for instance which does not show up in 42.(Neil!!John!!) I cannot even view each film as seperate, because they all seem sewn together somehow. Taken as a whole, they are amazing to watch..and the suspense in wondering what happened to each over the next seven years is truly there if you start early in the series. So watch some of the others before you watch 42 to get the full effect. <br><br>On to the characters..who are real people. Their stories are so beautiful to watch unfold over time it is truly amazing they were captured at each stage as they grew up. And you can even get the feeling by the end how large their lives really are and that they extend way beyond the borders of the film which the filmmakers obviously knew and luckily never once tried to pretend that they could completely capture the essence of a person on film. You just get tiny snippets of who these people are yet by the end you can't stop thinking about them, they become a part of you. I cannot think of any movie or series of movies where the characters were so richly drawn as these were, especially over the course of time. A beautiful, wonderful series that everybody should own. <br><br>Questions (if anyone can answer them for me) 1) Whatever happened to John???? why don't they even mention him (like they do some of the others who dropped out) in 35 &amp; 42? He disappears after 28! What happened to him??? 2) Are there any other projects going on like this in America or on a global scale? I think it would be a brilliant idea to do this similarly Globally to investigate and compare cultures all over the world! 3)Will there be a 49 Up or was that the end of the series?","user":"Jisk","rank":[15,16]},{"title":"The 7-up phenomenon gets better each time...","rating":9,"date":"18 August 1999","review":"This film and its predecessors are the most fascinating documentaries released cinematically, not because of their breathtaking cinematography, whiz-bang special effects or even revelation of secret or unknown information. What it does offer is a look straight into the personal lives of a group of people with nothing much in common except this series of extraordinary films which every 7 years throw their experiences open to the world. For the most part they are ordinary lives but they are engrossing as only reality can be. There is no gloss applied, no smoothing over of rough edges. Apted has become a friend to many of his 'subjects' and the warmth of their relationship with him comes into the film. In this program, even the effect of the film series on the people in it is examined, so in some ways it is a film about itself. Like a classic serial cliffhanger, at the end one is impatient to see the next instalment, but it will be seven years in production...","user":"Spod-3","rank":[9,9]}]