[{"title":"A wonderful wild ride; sometimes too clever, sometimes not enough","rating":29,"date":"29 April 1999","review":"\"Go\" reads like a very very good sophomore offering by a very very good up-and-coming director. You can almost see a bright future for everyone involved in the film, from the director (Doug Liman) to the screenwriter (John August) to all of the young actors. The script is clearly the winner, with witty dialogue and a convoluted plotline (or plotlines, depending on how you view it) centered around a dozen or so GenX-er Los Angelenos on Christmas Eve. The film slickly moves you from one plotline to the next, as you follow one minor disaster leading to other minor disasters.<br><br>The film being a \"sophomore offering,\" of course, has some drawbacks. Yes, it is tangentially derivative of \"Pulp Fiction.\"  And yes, it does scrounge a bit from this teen flick and that.  In some cases, certain plotlines wrap up too neatly, and in other cases the plotlines don't converge nearly as neatly enough. But what the film may lack in originality it certainly makes up for with style and quirks.<br><br>The real discovery in all this is the cast. Sarah Polly stands out (listen to her mild Canadian accent slip through once in a while) as the world-weary checkout gal who's first and only foray into drug-dealing unleashes a legion of trouble for her. Desmond Askew (wonderfully punny name) is this Pulp Fiction's Tim Roth, glib and cocky as his well-ordered world whirls and crumbles around him in a neatly choreographed disaster.  As the sinister drug supplier, Timothy Olyphant is particularly menacing, exuding equal amounts of danger and innocence, sexiness and insecurity. The characters in \"Go\" never become cardboard parodies of themselves, and they never dissolve into charicatures of themselves for the sake of plot or atmosphere.<br><br>So watch the film, soak in the plot, atmosphere, and the characters.  At the risk of sounding glib myself, by all means \"Go.\"","user":"Gouda-3","rank":[71,80]},{"title":"enough of the \"Pulp Fiction\" comparrisons!","rating":23,"date":"23 October 2002","review":"This film has traces of Pulp Fiction embedded in it, but it's got a little \"Swingers\" and other films to it as well. All in all it's an entertaining movie which ends without epiphany for these characters (like .....). This film has multiple stories but does not try to be alternative and cool. It just wants to work! Sarah Polley (whom I never heard of at the time but follow her work now) was great; Katie Holmes wasn't quite Katie Holmes - and that was good; Fichtner's good; but my favorite was Timothy Olyphant who did a kick-ass job of a charasmatic bad-guy (it was hard not to hate him by the end). I've read the other comments and these people just take this thing TOO seriously! It's not the movie of 1999, it's not \"Pulp Fiction\", it's just \"Go\". I have this movie on DVD and heard Doug Linman's commentary: he sounds like he had a lot of fun making this. I had a killer time watching this. I guess if I came in with different expectations I would've hated it like everyone else on this site!","user":"patrickl-1","rank":[33,36]},{"title":"Unpredictably entertaining","rating":10,"date":"3 July 2000","review":"I don't know what really makes this movie so great. It could be the outstanding cast, the pitch perfect editing, the quick and funny dialog or maybe some other feature of a movie one could possibly like.<br><br>\nThe truth is this movie couldn't been done any better. When I watch a movie I usually come up with lots of things, which could have been done better or at least differently. This time I ended up with nothing.<br><br>What amazes me the most is how they manage to define all the 10+ major characters so well, and they do it in what, less than 100 minutes. Most movies featuring many characters, fall apart cause there isn't enough screen time to present the differences among them, which just leads to a smear of unrecognizable faces. This doesn't happen with this movie for two reasons: A) All characters have at least one scene to really define themselves. B) By dividing the the film into three sub-plots you can easily relate each character to a specific sub-plot.<br><br>The tempo is very fast for 90% of the movie. There are two scenes, which have a significantly slower tempo. Those are the two scenes featuring Katie Holmes and Timothy Olyphant. First in the apartment and later in the coffee-shop. In my opinion those scenes are the best, but there is a lot to choose from so I'm not offended if yours isn't.<br><br>This movie really shows that even simple and straight forward stories, can be both unpredictable and entertaining, if they are told the right way. Add to this a pumping soundtrack, solid editing and an overall great production in an unpredictably entertaining movie, you will agree with me that Go is one of the best films ever made.","user":"Mammoth-2","rank":[47,53]}]