[{"title":"An under-appreciated movie","rating":10,"date":"29 November 2004","review":"This is one of those movies that I can't help but love. It certainly isn't the best movie ever, but Perry and Hayek both turn in wonderful performances. You can't help but like both of them. You care for the characters. And that is something that is becoming more and more rare in today's movies. The supporting cast does a great job as well, especially Perry's real father and Jill Clayburgh as his parents. It probably is the first time Hayek shows that she is a star and can carry a movie (or at least half of it) on her back. Perry brings a great sense of comedy to the movie. Some of his scenes and lines are laugh-out-loud funny. On top of that, the story is just quirky enough (based on a real-life romance) that the entire situation makes you chuckle.","user":"ChrisDickerson","rank":[55,59]},{"title":"Such an underrated film","rating":6,"date":"6 August 2004","review":"Alex Whitman (Matthew Perry) is a New Yorker sent to Las Vegas to oversee a construction project. There he meets Isabel Fuentes (Salma Hayek) and some serious chemistry brings them together for one night. But Alex doesn't see Isabel again until 3 months later, when he learns that she is pregnant. On a whim and a prayer, he proposes. However, there's more to marriage than a Vegas chapel and an Elvis impersonator, as Alex and Isabel soon learn Overall, Fools Rush In follows the same formula of any romantic comedy - Two people fall in love and then a problem arises that breaks them apart for a period of time and then eventually one of them wakes up, the problem is resolved, they say I love you and live happily ever after. - I know, but I still absolutely love this film. There's just something so delightful and enchanting about it. Matthew Perry and Salma Hayek are both so loveable and the story is fresh and vibrant with a big heart. It's one of my all-time favourite movies.","user":"Youre_My_One","rank":[35,37]},{"title":"Fools Rush In...but we get something good from it","rating":13,"date":"13 July 2007","review":"'Fools Rush In' is one of my favorite romantic comedies. Though, I know that many will dislike it but I'd take it anyday over any Julia Roberts rom-com. It's sweet without having too much sugar. It's one I have repeatedly watched and never got bored of. Director Andy Tenant deserves credit for putting it all together.<br><br>It has the unusual pairing of Matthew Perry and Salma Hayek (which really works). Both share a great chemistry and look good together. While Perry's Alex is a little similar to Chandler Bing (except with a much bigger problem to deal with), the actor knows how to make the audience like him. Hayek as the vibrant, stubborn, mean but adorable Isabel is simply brilliant. The rest of the cast provide adequate support.<br><br>The movie is full of light and delightful moments. Though there are certain aspects of culture clash, it is all presented in a humorous manner. Supporting the movie is a wonderful soundtrack, some fine location shots and the funny screenplay itself (which is predictable but doesn't spoil the fun on the way).","user":"Chrysanthepop","rank":[20,21]}]