[{"title":"Superb movie depicting, football, class and violence","rating":8,"date":"21 August 2001","review":"This is quite simply the best football/realistic portrayal of the English working class for some time.<br><br>It pits a middle class suburbanite home owner, a true product of Thatcher's Britain, who curiously appears in a picture on the wall of several offices during the film, against the white working classes, the forgotten men of England at the time.<br><br>The film truly shows that despite all his middle class ideals, he and his friends are still the people they once were, perilously close to the edge and the violence of the impoverished forgotten young male.<br><br>The films greatest strength is perhaps that it stays away from the game of football and sticks very firmly with the soccer hooligan. You cannot ignore this film. Its charecterisation and portrayal of individuals is flawless... no wooden acting here.<br><br>Without a doubt one of the better movies to be made at this time, long forgotten and overlooked, it can actually offers an almost historical insight into the social influences of our history, and goes some way to explaining the origins annd causes of the English disease","user":"DazzaLCFC","rank":[41,49]},{"title":"Cracking British drama that delves into the murky world of the 1980's British Hooligan","rating":10,"date":"22 January 2005","review":"John (Reece Dinsdale)is a smug copper who along with a colleague is assigned to go undercover to delve into the violent world of the football hooligan in 1980's East London. John becomes more and more obsessed and embroiled in this world until it becomes a part of him, which is certain to lead to trouble.<br><br>This is an extremely well made and engrossing film with top notch acting and some highly convincing characters. Reece Dinsdale, Sean Pertwee and Warren Clarke ,the pub landlord Bob, are excellent and ensure that this film is a success. We are presented with restless, dissatisfied angrey working class males whose way of letting out frustration is through football violence against enemy firms.<br><br>I have seen this many times over the years and it is a film I often come back to as it always guarantees excellent entertainment, a good story, great acting and characters. Definitely watch it","user":"tresdodge","rank":[26,33]},{"title":"The best football film I have ever seen","rating":17,"date":"17 September 1999","review":"This is the best football film I have ever seen, yet strangely enough not a single football match is shown. Instead, it deals with the violence off the pitch.<br><br>The story is about four police officers who go undercover to find out who is the ringleader of a group of violent thugs at a fictitious East London football team, Shadwell FC (possibly but not necessarily based on Millwall FC, a real East London team with its own share of crowd trouble). This violent drama shows how easy it is to get drawn into the whole scene, to the extent that the policemen find their mission and dedication to justice is slowly being taken over by their newly found love of Shadwell.<br><br>It is a superb character study, well acted by Reece Dinsdale and Sean Pertwee, among others, although it is Warren Clarke who really steals the show with a superb performance as the ringleader.<br><br>Non-football fans will enjoy this film as well, possibly because of the lack of any football action. It is, for example, one of my wife's favorite films, although her interest in football per se is fairly insubstantial. However, if extreme violence or 'foul' language offends you, avoid this film.<br><br>As an Eastender, I have to say this film is one of the most accurate portrayals of football violence in the area. It is also a far better 'film about football' than other recent attempts such as WHEN SATURDAY COMES or FEVER PITCH. Although it has been out on video now for over three years at the time of writing this, it is still today one of the hardest videos to get out of the video-club in the East End, as it is almost always on loan.<br><br>Enjoy! I know you will.","user":"Tristan!-2","rank":[20,26]}]