[{"title":". This road will never end. It probably goes all around the world.","rating":9,"date":"9 July 1999","review":"This movie isn't about being, or even about being a hustler.  \"My Own Private Idaho\" is about finding a home.  In his finest performance, River Phoenix plays Mike, a narcoleptic street hustler with false memories of a terrific childhood.  Mike wants to find his mother and family, but how or why he left them is never discussed. This is a movie that shows life at the lowest rung, and is very similar to Kerouac's \"On the Road\" and especially John Rechy's \"City of Night.\"  (In fact the line about becoming a fairy is straight from \"City of Night\"). Mike and Scott (Keanu Reeves) are both male prostitutes in Oregon.  Why either of them have drifted into this profession is anyone's guess.  Scott is clearly not gay, but Mike might be and their relationship is what holds the movie together. The film works on many levels, but does have its flaws.  It's faux-Shakespearen scenes make the film drag in the middle.  Van Sant directed the movie like a dream, which is what Mike's life basically is.<br><br>This is a haunting and very sad tale about friendship and finding a home. The performances, especially Phoenix and Udo Kier and Van Sant's dream-like direction are what you remember. \"My Own Private Idaho\" may be a flawed film, but in my opinion, it is one of the very best of the '90's.","user":"BratBoy-2","rank":[159,185]},{"title":"Odd, touching, River Phoenix is intensely brilliant..","rating":10,"date":"10 June 2001","review":"This is the movie that I sincerely hope River Phoenix will long be remembered for. His performance as the narcoleptic and confused street-hustler Mike is so perfect and touching and realistic that it makes me cry every time. Gus Van Sant's films often have a strange aura about them (see Drugstore Cowboy, To Die For) and never has it been more evident than in this oddly affecting road movie/drama. The camera shots of long horizon-spanning roads and skylines, fast-motion clouds, surreal and symbolic shots of houses and rushing rivers provide the film with a strange almost other-worldly charm. Interspersed with the gritty realism of life on the streets of Portland Oregon in the early 90's, and (stranger still) Shakespeare. Some of the plot (Bob and Scott mainly) is based on the Shakespeare play Henry IV (with Keanu Reeves playing the Prince Hal character of Scott, and William Richert playing the Falstaff-like role of \"King-Of-The-Streets\" Bob.) It's a fascinating, touching and very successful blend of styles overall. The big themes (the search for love and belonging) are conveyed in a very interesting and genuinely moving manner. I particularly enjoyed the symbolism and pathos the film flittingly suggests. The performances are uniformly excellent, and this movie remains one of my all-time favourites. One of the greatest (and most unique) indie movies of the 1990's.","user":"xokatyxo","rank":[80,96]},{"title":"An odd but compelling film","rating":27,"date":"27 September 2004","review":"Like others, I had heard about this film, but had never seen it because it can be hard to locate. Finally I rented it from an independent video store.<br><br>I am not familiar with the body of River Phoenix's work, but his performance was outstanding in this film. This makes his untimely death even more tragic.<br><br>The film has its merits and shortcomings. The Shakespearen references are unexpected, and I agree with others that they don't exactly \"work\". They seem too forced. But they do add an interesting texture to the film, elevating it above \"just another social commentary\". <br><br>Keanu's performance isn't as flat as others may lead you to believe -- it's not bad, but it probably could have been better. I think that, now that he is more mature, he is coming into his prime as an actor. In this film, he was still rather young, and for some reason it's hard to take him seriously. Keanu doesn't quite make the transformation that his character requires. River Phoenix, on the other hand, is entirely believable, if not inspired.<br><br>The film is an allegory for a lot of things. Mostly I see it as a commentary on the basic human needs for love and home. Keanu's character can go home any time he wants. River's character is searching for the ghost home of his heart; a home he will never find on a road which never ends.<br><br>It's an odd film, and not everyone would enjoy it or \"get\" it. But if you're looking for something different, thought-provoking, and of course, want to see Reeves and Phoenix (not to mention Flea), then take a look.","user":"keanufan43","rank":[60,73]}]