[{"title":"Brilliant, beautiful, and moving...","rating":15,"date":"15 March 2001","review":"My Stars, my \"One line summary\" sounds camp, but this picture was truly lovely and very moving for me.<br><br>I had seen it years ago, as I am a fan of anything involving period re-creations, but seeing it again recently moved me way past the perfect 1963 backgrounds and the Melmac cups in the kitchen cupboards...<br><br>This review may contain *spoilers*, so Viewer Beware.<br><br>Michelle Pfieffer portrays a woman obsessed with the glamour of the Kennedy family, particularly Jackie, and is thrilled to catch a glimpse of her as the First Couple arrive at Dallas Love Field Airport on November 22 of '63. Circumstances (humorous ones, at that, in the form of fabulously annoying character actress Peggy Rea) don't allow for her brush with celebrity, and of course the assassination crushes her.  Her husband is less than sympathetic as she explains her need to attend the funeral.  She escapes anyway, and catches a bus to Washington.  She meets up with a black man and his young daughter (Dennis Haysbert and Stephanie McFadden) and the journey becomes very complicated indeed.  Intrigue and mystery cloud his initial introduction, however Pfieffer's character is concerned for him, especially for the daughter's welfare.  Soon the trio are entwined, and stubborn ethics keep them from abandoning one another.  This is when they are suddenly on their own, and the story takes off.<br><br>Visually, the mixture is wonderful - the extremely \"white\" and VERY blonde Pfieffer, trying her hardest to look like Jackie even down to her home-made suits, and the curious \"coloured man\" and his silent, somewhat frightened daughter.  Both actors are absolutely excellent as two individuals who become literal victims of their own time.  There are the subtle vocal references to the child as \"a coloured girl\" by Pfieffer, who holds no prejudice but simply talks the way everyone else does; and then the stronger and much more \"controversial\" implications of the man and the woman and any kind of a relationship they may have, however shadowed by the mores of the early 60's, the confusion and upset the World is undergoing due to Kennedy's murder, and even the geographic locales they travel through.<br><br>We are reminded that Pfieffer's character is still a married, albeit unhappily, woman of principle, and that the mere sight of an interracial couple in that time would cause near hysterics - still we WANT them to overcome it all, and the fact that the very human need for love has to be compromised by the times is communicated intensely yet with enough restraint that the characters do not suffer being imbued with too much \"foresight.\"<br><br>\nStephanie McFadden as the 6-year-old daughter is incredible as well, her facial expressions saying so much more than the six or seven lines she speaks in the whole picture.  Her poignant close ups drive the viewer to WILL her to understand, to see what is happening around her, comprehend it, see beyond it, but of course she cannot.  Much of the story is this way, one wants to just clear away the limitations and the social ills and let them all BE.  There are moments of tension (rednecks [they are even credited as such!] that pass the couple on the road and then come back to stir up trouble) balanced by those of palpable relief (a curious, inexpressive old woman and her retired husband, who take the three in for a night).  This is sufficient to provide a realistic level of suspense, even angst, but it is the triumph of overcoming barriers, whether they are bad husbands who just don't know any better, or suspicious and bigoted backwoods policemen, that make for the emotions one experiences while watching.<br><br>This picture left me wondering who and where these brilliant people are, the writer, Don Roos, and dual-producers Sarah Pillsbury and Midge Sanford, and particularly director Jonathan Kaplan.  Why haven't we heard of these folks, and why wasn't this beautiful film hailed in 1992?  Rarely, very rarely, have I seen a picture that left me wanting to personally congratulate the folks directly responsible for it!<br><br>Needless to say, but important to emphasize, production values shine in all forms, as the film contains some spectacular period-recreations of downtown Dallas and other townships, even down to the store-front displays and seas of vintage vehicles buzzing around (Oliver Stone eat your heart out!), and the shockingly realistic Love Field Airport scenes, complete with the obligatory Pink Nubbly Suit on an incredible Jackie K. look-alike, are stunning.  The interiors, the magazines in the racks, everything, is spot on; and the photography is breathtaking, as unpicturesque as a bus in the middle of Nowhere, Virginia, may seem to be.<br><br>A splendid, highly recommended motion picture in ALL regards.<br><br>Multiple stars.  Much praise!","user":"SSposeidon","rank":[22,25]},{"title":"Outstanding drama that deserves a wider audience.","rating":8,"date":"7 April 2005","review":"Michelle Pfeiffer plays a middle-class 60s housewife who idolizes Jackie O. When JFK is assassinated, she leaves her husband and road trips to his funeral to show solidarity with her icon. Along the way she meets a black man (Dennis Haysbert) and his young daughter. She immediately befriends them but realizes they are hiding a secret. Soon she is swept up in their lives and finds herself on the run from the FBI.<br><br>This is the best performance I've ever seen by Pfeiffer. She is practically unrecognizable--her southern accent is perfect and her Jackie O-inspired look is classic. She adds a welcome dose of humor to a film that is often emotionally overwhelming. The movie alternates between adorable and disturbing, but never gets too extreme either way. The plot gets a bit contrived at times, but the movie serves to question the comfort of routine middle-class existence, so it works. I am surprised this is not a well-known film. It is one of the best ones I've seen from the early 90s.<br><br>My Rating: 8/10.","user":"ThrownMuse","rank":[28,34]},{"title":"Love Fields a real sleeper, one of the best small films ever","rating":9,"date":"7 January 2007","review":"I loved this movie! Pfieffer's child-like naiveté is beautifully balanced with the mature competence of Dennis Haysbert's character. This is the first time I'd ever seen Haysbert and I've been a fan ever since. Something about that man...the viewer understands why she falls for him. I ached for both characters. The movie stirs up some feelings about injustice, racism, oppressed women -- a memory of those times but not nostalgia for them. The ending soothes and satisfies all that was stirred up. Love Fields uses only a few people and not a lot of scenery to tell its story, but its quite enough. It is, essentially, a love story -- unexpected, but so right. The period (mid-60's)is well-established and well-maintained. See this movie!","user":"shackel","rank":[15,19]}]