[{"title":"Tupac's best performance","rating":10,"date":"3 January 2003","review":"This is a hip-hop classic that I could definitely relate to being from NYC, and having been in a click of four friends since grade school.  The film has a great pace and rhythm from start to finish, never a dull moment.  Tupac displayed the raw talent and anger that resides in most inner city youth who simply want respect.  Unfortunately respect came at a price, which the film was precisely able to convey, through strong performances by Tupac, and by Omar Epps, as the aspiring DJ, in their first featured roles.  Samuel L. Jackson has a noticeable role as a pool hall owner, and young Queen Latifah does her thing as the Ruffhouse MC.  Ernest Dickerson does an excellent job with capturing the energy of Harlem in an honest way, not dressed as a stereo-typical slum or focused on the historic 125th street, but neutral to lay the groundwork for the true challenges that living in Harlem has to offer these four young men. A classic!!","user":"mate_73","rank":[30,34]},{"title":"Juice","rating":8,"date":"23 March 2004","review":"Juice is an urban drama set in early 90's New York City.  It is the story of four friends who each look to gain respect in the neighborhood one way or another.  Q(Epps), Raheem (Kain), Steel (Jermaine ...), and Bishop (The Late? Tupac)have good chemistry as the group of friends looking to earn some props around the way.  The standout performances were from Tupac and Epps. There are many cameos by famous hip-hop celebrities in the film.  The story is good and there are many memorable lines for those who enjoy this genre. <br><br>The cinematography by Dixon gives you the feel of Harlem during that era. This will go down as a classic hip-hop film with a great soundtrack. All-in-all this film is a must have if you are a fan of the genre, and a decent pick-up if you are not particularly fond of these types of films. <br><br>\nPeace,<br><br>Buggieblade","user":"Buggieblade","rank":[18,20]},{"title":"Great Old School Hood Movie - Tupac and Omar Epps steal it","rating":7,"date":"14 June 2013","review":"Juice is a film about 4 friends growing up in Harlem, it tells the story of how far you will go to get respect and how possessive the need to be respected can be. <br><br>I enjoyed this movie, a good solid hood film. The acting is superb, especially from Tupac and Epps. Really strong leading performances. The transformation of Bishop from the start to the end is played out perfectly by Tupac.<br><br>The movie has a great urban old school feel with a belting hip hop sound track. It's funny, tense, emotional and gritty. Watch this if you are into this type of genre, even if your not, its definitely worth a watch.","user":"MUFCOK","rank":[8,8]}]