[{"title":"A deeply moving story, thought provoking, and unforgettable.","rating":10,"date":"7 November 2004","review":"It is rare that I see a movie as unforgettable and unpredictable as Powder. I am not a man who is easily impressed with special affects, but in this movie the affects always served a purpose instead of covering up the fact that there was no purpose. In an age where movies have become multiple scenes of graphic violence and corny excuses for stories, Powder is refreshing, filled with the meaning of humanity, and moved me to tears throughout the entire film. With most films, I am able to predict exactly what will happen and when. With Powder I could never quite tell what was going to happen next, and the ending was something I would have never imagined would happen and could only be described as extraordinary. There are so many elements to this movie: The paranormal; the challenge to everything we think we know about science and the capabilities of the human mind; the human capacity for cruelty; love and forgiveness; and the hope that our own humanity will one day advance beyond our own technology. Most of all, the raw emotion of this great masterpiece reaches deep into the heart and leaves an impression that stays with you. This is one of those rare movies that you will never forget, a true classic that illustrates truths about humanity that have existed since the beginning of time.","user":"Bryce_Tech","rank":[110,138]},{"title":"Some movies touch the audience; this one seizes the individual","rating":10,"date":"11 January 2005","review":"The movie 'Powder' is a return to innocence. It possesses a spiritual quality that opens the eyes to life. And it lends a soothing note to those questions for which their seems to be more questions and few answers. Sean Patrick Flannery's performance was so powerful that one could actually feel the unconditional love within the heart and soul of the character that he played. The concepts that were brought forward, the passion that came with every dramatic scene, and the sense of realism and truth made it one of the most thought provoking movies of all time. Powder was not based on a true story, but it is, I feel, everybody's true story in some way, and it is as powerful, passionate, and inspirational as any true story I have ever seen. Some viewers may wish to begrudge the apparent perfection portrayed by the lead character. However, his only perfection was the way he searched so deep, often at great personal expense, for the suppressed perfection in everyone, and the hidden perfection in everything. I was somewhat disappointed by how the family quality of the movie was spoiled by the use of language by the school bully. Still, a must see for anybody who enjoys a thought provoking film once in a while. Even if you're a person who would prefer to sit down with a good book, as am I, the movie 'Powder' is definitely worth your time. In conclusion: 'Powder' is one of my favourite movies of all time. Seconded, in my opinion, only to 'The Boondock Saints'; also starring Sean Patrick Flannery.","user":"jaysaze","rank":[93,125]},{"title":"I Appreciated This Film","rating":7,"date":"17 March 2004","review":"I have taken in hand the constructive criticism of others about this film. I've noticed that most people don't like the film because of Salva's criminal record. That's no reason to give it ill-repute.<br><br>The film itself is a little dodgy in parts and could have used some better acting from some of its stars. Sean Patrick Flanery does an amazing job as Jeremy Reed, and I believe he was well-suited for the part.<br><br>\nI didn't like Lance Henriksen's acting at all. I thought that the way he portrayed the character was a little too repetitive and boring. But then again, I don't care for him as an actor anyway. I think he's crotchety, annoying, and outdated; and the characters he chooses to play reminds me of the acclaim that Robert Redford always gets - undeserved.<br><br>The film is about a young man who suffers a birth \"defect\" after his pregnant mother is struck by lightning and killed. OK, I can understand some of this. He is raised by grandparents who soon begin to fear him and show him no emotion - not unlike his father. When his last grandparent dies he is left alone for a short period of time before he is discovered by the police. Our main character is highly intelligent, scared, telekinetic, and has an electric personality, not to mention he's an albino, too.<br><br>A social worker, Jessica, played by Mary Steenburgen is called to take over the boy's case and he is placed in a group living situation in a home. He is placed with delinquents and abandoned children who have no respect for him. I love Steenburgen and think she always does a good part in any film she is in. She's a fine actress, and though she may not be classed as \"dazzlingly\" beautiful, her charms show through no matter what character she plays. She's heart-warming, endearing, and always brings a good sense of love to a film.<br><br>Those who say that Salva's sexual undertones are present in the film can be dismissed right away. I knew nothing of Salva's past when I watched this film for the first time, and I noticed nothing out of the ordinary. Goldblum's character, who is a science teacher and befriends the boy, does a good job of interacting with him. He's not molesting him or harming him by holding his hand and giving him a long-needed hug. If you're assuming this shows sexual predators at work, I think you need to see the therapist, not Salva.<br><br>Also, the scene in which he is looking at another boy who is in the locker room is not about lust. He is longing to be able to do normal things that others do without being ridiculed. If you'll remember, it's the very next scene where they tell him he's a freak who is as \"bald as a baby.\" He just wants to fit in, and it is at this point that I believe he realizes he doesn't.<br><br>Overall, this film does bring a sense of wonder to the viewer. If you sit back and take it all in, Salva is showing us what might happen if we all stop judging one another and start accepting human beings for their uniqueness. He's not trying to make you accept him for being a child predator. He's showing the world that people are ALL different, and if we spent a little less time being so blocked and full of hate, we might come to realize this and appreciate the aesthetic value of the human soul.<br><br>I gave this film a 7 out of 10 because I didn't like Lance Henriksen's performance at all, I thought some of the characters could have come through in the end (Why didn't his love interest stand up for herself against her father? Why were there loose strings here?), and I would have liked to have seen more \"after the fact\" wrap-ups when Jeremy becomes raw energy in the film's climax. Also, why in God's name does Powder have eyelashes if he is unable to grow hair? Huh? What? OK, so Sean does have pretty eyes, but, come on!<br><br>On a side note, for those of you who think that the Deputy Sheriff's character was a \"stereotypical\" cop character, giving the police a bad name...I have relatives who are police in a small town like this one, and you should hear THEM talk over the dinner table. It ISN'T much different.","user":"thedork-2","rank":[74,101]}]