[{"title":"Definitely a Keeper!","rating":10,"date":"19 May 2008","review":"I love listening to the audio commentaries after I've watched a film. It shows me how much the actors or crew members felt making the film. There is a big difference between a film and a movie. A film holds you to your seat because of the quality of the writing and acting. A movie is usually exciting, but it may or may not have persons who can or cannot act in it's line-up. I consider \"The Whole Wide World\" in the former category. I can't say enough about this film.<br><br>The story is simple enough. Vincent D'Onofrio plays Robert E. Howard, arguably the greatest pulp magazine writer of all time. He is the creator of the Conan series of magazine and movie fame. Howard falls in love with Novalyn Price, a woman who wants to be an author, but has no talent. She is played by Renn' Zellweger, who brings fire to this \"mousey\" character. Price realizes her destiny lays in teaching and pursues that course in her life. Zellweger's performance is exceptional as her 5'5\" frame faces down the 6'4\" frame of D'Onofrio.<br><br>D'Onofrio's performance in this film is beyond exceptional. He kept me emotionally attached to the character of Howard through out the film. I cried at the end.<br><br>As one of the producers of this film, D'Onofrio was able to keep the film on track. But something tells me that he believed so much in the film that he took on the problems himself and protected the project. I loved the Greyhound bus, by the way. It was one of his additions.<br><br>This film was Dan Ireland's first major film and he did exceptionally well. He knew the caliber of actors he was working with and let them do their job. The actors also let him do his job as well. Surprisingly in the commentary I could tell that he watched his stars and learned from them <br><br>Like I said, I can't say enough about this film. I rented it from Netflix and have watched it several times. It is definitely a keeper and my order on Amazon is already in the works.","user":"bilborough64","rank":[14,14]},{"title":"A hidden gem","rating":9,"date":"11 August 2005","review":"I found this movie while searching through a reduced DVD bin. But once I saw Vincent D'onofrio in the lead I knew I would not be disappointed; and of course I wasn't.<br><br>He is one of the most talented and underrated actors gracing the indie screen today. Although he has had several big budget roles (MIB-The Cell to name a couple) he is a character actor and does extremely well with character driven films. <br><br>I'd never heard of Robert E. Howard until I watched the WWW and I couldn't think of a better person to introduce him to me than Mr. D'onofrio. The way he portrays his tortured existence and his need for companionship and acceptance was done with such brilliance and conviction, you can really appreciate how much Bob Howard lived inside his own head and yet longed to be part of the world around him.<br><br>Renee Zellweger also turned in a notable performance as Novaline Price. She skillfully portrayed the love, hope and irritation she often had for Bob. Together D'onofrio and Zellwegger not only showed the pain of unrequited love, but the richness of friendship.<br><br>I recommend this film to anyone looking for great acting, wonderful cinematography and a delightful score. Curl up, turn the lights down, and enjoy. I promise the characters will stay with you long after the final credits.","user":"retst2","rank":[33,36]},{"title":"A little giant among films","rating":10,"date":"27 May 2005","review":"This is an easy vote. A real, well acted old time story of star crossed loves. Cutting edge acting by Vincent D'Onofrio as Robert and his girl Rene Z. An emotional, tender, and heartbreaking story. Both actors pull out your emotions and put them through the wringer. Beautifully filmed and the music fits the mood. Vincent was perfect. His intense face, which he uses as an emotional barometer, captures and relays the tortures Robert E Howard experienced. It is how films used to be - memorable. This was Rene Z's first serious work, and I will say she has never come close again in touch the emotional triggers although she is big box office. Her thanks to Vincent on receiving her first Academy awards speaks volumes \" Thank you Vincent for teaching me how to work.\" They were a lovely team together with a special bond both actors created together. I did not want to leave the characters and return to reality. In closing, this \"little movie\" budget wise and distribution wise, is actually a far greater achievement then it's modest budget could foresee. This film should have been dubbed as one of the greats instead of shelved and forgotten.","user":"egret1","rank":[39,44]}]