[{"title":"JUNGLE EMPEROR LEO: New version of Tezuka's \"Kimba the White Lion\"","rating":21,"date":"21 April 2002","review":"JUNGLE TAITEI (aka JUNGLE EMPEROR LEO, 1997) is a feature-length adaptation of the famous comic book story of the same title by pioneer Japanese manga (comic book) writer-artist Osamu Tezuka (1928-1989), a story best known to American audiences by the animated TV adaptation shown in the U.S. under the title, KIMBA THE WHITE LION (1965). This latest film version is a full-blown theatrical animated feature made by Tezuka Productions, which has sought to keep Tezuka's legacy alive with new animated versions of his work (the most recent being METROPOLIS, an acclaimed theatrical feature released in 2001).<br><br>JUNGLE TAITEI picks up the story of Leo, the white lion, in adulthood as he maintains his rule over the jungle and helps his wife, Liya, raise their two cubs, Rune and Rukyo, amidst a land teeming with all sorts of wildlife, many of whom eagerly assist the regal Leo, although the elephants frequently dissent. When a band of white men enters the jungle searching for the elusive Mount Moon, site of the lucrative moonlight stones valued as a potential energy source, Leo has his paws full trying to keep the humans' disruption to a minimum, although he fails to prevent a massive fire. Eventually, Leo decides to form an alliance with the one good human, Professor Hige Oyaji, who sports a trademark handlebar mustache (and was a character in Tezuka's \"Astro Boy\" as well), and decides to help him beat the bad humans, led by the greedy Hamegg, to the site of the stones. Much of this story was originally told in a second Leo animated series, JUNGLE TAITEI SUSUME LEO! (\"Jungle Emperor Onward Leo!\"), a 26-part follow-up produced by Tezuka himself back in 1966, but never aired on American broadcast television. Some episodes of the second series have been dubbed into English and released on tape in the U.S. under the title, LEO THE LION.<br><br>A second plot in the newer film involves Leo's precocious male cub, Rune (a dead ringer for Leo/Kimba as a child), who develops a curiosity about all things human after he explores a vegetation-covered ruin of an airplane and finds a music box which proves to be endlessly fascinating to him. At one point, Rune is swept out to sea on a log by a flash flood and picked up by fishermen who sell him to a European circus. The trapeze artist, Mary, takes the cub under her wing and uses him in her act until Rune hears from a flock of migrating storks of the troubles his father is having in the jungle and Mary arranges for him to get on a ship bound for Africa.<br><br>Unfortunately, the two plotlines never merge effectively, each tending to undercut the other. One is a deadly serious adventure story (similar to plotlines in Edgar Rice Burroughs) while the other is a more fanciful Disney-style cartoon tale of a cute little lion cub and his relationships with humans and other animals. (Interestingly, all the animals can talk to each other-in Japanese!-but not to humans.) The journey to Mount Moon is fraught with peril and concludes on a tragic note of self-sacrifice that might have seemed noble back in the 1950s when this story was first published, but seems uncalled for in this new adaptation, in which human encroachment on the jungle is viewed with considerably less sympathy than it once was.<br><br>Still, the film is fluidly animated and full of imagery of spectacular scope, aided by computer animation in certain intricate moments, some of which deliberately recall Disney's 1994 hit, THE LION KING, which is widely believed to have been inspired by the original KIMBA series, a charge Disney strenuously denied (\"Kimba? Never heard of it.\"). The scenes of the lion cubs at play here are as relaxed and genuinely cute as anything one is likely to see in animated depictions of animal life, yet without the forced humor, modern slang, show tunes and high-speed drive of Disney cartoons. There is also a stirring background score punctuating the film's more dramatic moments. However, while the film remains highly enjoyable, it lacks the intense storytelling and raw artistic vigor of Tezuka's original 1965 series, some episodes of which are available in the English-dubbed version, KIMBA THE WHITE LION.","user":"BrianDanaCamp","rank":[17,18]},{"title":"What can I say besides wow!","rating":10,"date":"2 February 2018","review":"For those who enjoy enjoyment, this is a series of pictures to find useful should your life circumstances allow you to grasp the context &amp; deep, deap history!<br><br>The entertainment, the story, the cast &amp; crew, the directing, &amp; the rest are just as good as it gets.<br><br>4 limbs up.","user":"frankhedden","rank":[3,3]},{"title":"This was a great finish of the 1966 Kimba TV show!","rating":10,"date":"1 April 2006","review":"If you liked the 1966 \"Kimba the White Lion\" you will LOVE this movie. VERY WELL DONE, not another cheap knockoff!!! The animation work is even better than the original. <br><br>When you see this movie, you will wonder what the TV series would have been like with a big budget! Based loosely on some of the 1966 story lines and some new ones.<br><br>You do miss the voices of 1966 crew but this crew did a very good job. Again, the voice over work in this movie is much better than any of the KIMBA KNOCK OFFS that have turned up through the years.<br><br>If you have not seen the ORIGINAL 1966 KIMBA THE WHITE LION TV series, this would be a good movie to introduce you to the main characters. The names have changed but the personalities remain much the same, and as with the original the hero doesn't always win!","user":"pdp-8","rank":[5,7]}]