[{"title":"generally likable comedy","rating":7,"date":"18 August 1999","review":"It's hard not to like \"Big Daddy\", though diehard fans of Adam Sandler may well cringe at this further step in the sentimentalization of the comic actor.  For although this film has raised the hackles of a number of overly sensitive worrywarts for its seeming endorsement of permissive parenting, the film is, in reality, far more soft-hearted than hard-edged.  Actually, this seems to be, probably, the wisest direction for Sandler to go in at the moment because, as an actor, he conveys an aura of genuine likability that fits well with his Average Joe persona.  \"Big Daddy\" might have been a better film if it had not given in so easily to sentimentality and predictable emotional uplift, but Sandler's deadpan portrayal of an immature adult forced to grow up into responsibility-laden fatherhood makes the film relatively enjoyable.<br><br>Sandler portrays a 30-something loser living in South Manhattan, who has been milking a minor foot injury to the tune of a $200,000 court settlement and whose life, consequently, consists of miniscule employment, a general lack of direction, and a girlfriend who's ready to move on to an older man with a \"5-year plan\".  When a little boy suddenly shows up on his doorstep (the hitherto unknown son of a friend of his), Sandler decides to temporarily take him under his wing in the hopes of winning his girlfriend back.  Thus, a man with almost no resources of adult maturity attempts to instill skewed life lessons into a willing, highly impressionable young mind.  This leads to Sandler's teaching the boy to indulge in predictable, but surprisingly timid, antisocial behavior such as urinating on public buildings, staying up late, tripping unsuspecting rollerbladers etc.  The film is not always at its peak of creative freshness at such times, but Sandler's lowkey cynicism provides some humor.<br><br>As Sandler grows to care for his tot and the inevitable forces array themselves against him to take the child away, the film veers off in the direction of sappiness and maudlin tearjerking.  One may be moved at times, but one also craves the satirical sharpness and bite that a more courageous screenplay might have provided.<br><br>The movie does display an enlightened view of gays (though Hollywood has yet to get past the point where gay characters can do more than merely twinkle at each other), but it loses points for its rather nasty tone towards old people.  Still, any film designed to send Dr. Laura into spasms of psychoanalytical outrage should be respected and honored.<br><br>Overall, \"Big Daddy\" is a movie that, if it had taken more audacious pathways, might have been a firstrate comedy.  As it is, it provides numerous chuckles and a cuddly warm feeling - and that, given the state of much of big screen comedy these days, is about all we dare allow ourselves to expect.","user":"Buddy-51","rank":[55,68]},{"title":"Adam Sandler in top form!","rating":7,"date":"25 June 1999","review":"While all of the somphoric pre-teens will be giggling silly at the childish potty jokes shown in AUSTIN POWERS 2, the real adults will be laughing their heads off in a much funnier film called BIG DADDY.  This is Sandler's sixth starring role feature, and it seems that the sixth time is a splending charm.  This is Sandler's best work yet! Now in case you are wondering, I enjoyed both HAPPY GILMORE, and THE WEDDING SINGER.  But there's something charming and wonderful on why I enjoyed BIG DADDY more.  Perhaps it's seeing a over-grown kid taking care of a little boy.  Or it's Sandler mixing his in your face attitude that he gave in HAPPY GILMORE with his soft-spot attiude from THE WEDDING SINGER.  Whatever it is, it works, and it works very well! The simple plot of BIG DADDY is a 5 year old child is left on the doorstep of Sandler's apartment.  It turns out to be the child of his roommate (Jon Stewart), who's on his way to China for a legal case.  So what is Sandler to do, but to give him to the child protective service.  But it's a holiday, and they are closed, so Sandler keeps him for a day, then another day, and... well you get the picture. But the plot doesn't matter much with this film, it's the laughs, and you do get plenty of those.  But you also get a wonderful supporting cast. There's a good support from Jon Stewart, the always wonderful and beautiful Joey Lauren Adams, Leslie Mann, and Kristy Swanson (the original Buffy the Vampire Slayer). And what's a Sandler movie like if you don't have his usual character actor friends in small comic roles; Rob Schrieder, Steve Buscemi, Josh Mostel, Allen Covert (the caddy from HAPPY GILMORE who was also the limo driver friend in THE WEDDING SINGER), and Jonathan Loughran (the lazy-eyed football player in THE WATERBOY).  There's even a funny cameo role by director Dennis Dugan, as the man who refuses to answer the door on Halloween, while Sandler is taking his adopted son trick or treating. This film was a lot more funnier that THE WATERBOY, it was also funnier than THE WEDDING SINGER and HAPPY GILMORE.  It was believe it or not, more touching.  You can understand why Sandler doesn't want to let this boy go, since he reminds him so much of himself.  And Sandler sees that being a father figure isn't only fun, but it redeems himself from the lost of his girlfriend. I have to give both Sandler and director Dennis Dugan (the same director of HAPPY GILMORE) a round of applause.  They teamed up for a comedy that is not only successful, but will make A LOT of money. Sandler and Dugan are the best comedian/director team since the late John Belushi and John Landis.  I'm just hoping that they will continue to do films together in the futrue.  Until then, take your date, your friends, or heck just go alone and enjoy one of the funniest comedies (next to ANALYZE THIS, ELECTION, and RUSHMORE) of this year. This is a wonderful treat!  ****1/2 (out of five)","user":"Brogan","rank":[32,47]},{"title":"Formula, silly, and actually funny!","rating":6,"date":"18 June 1999","review":"Big Daddy- Sonny Koufax (Adam Sandler) is the paragon of irresponsibility - he has no job, no manners, and no clue.   Although Sonny has somehow managed to get a girlfriend, she is tired of his aimless ways, and gives him an ultimatum - do something with your life or I leave.  Fate steps in with a ready-made 'solution': Sonny will raise the little boy who was dropped off at the apartment with a note proclaiming his roommate (Jon Stewart) the father, his girlfriend will realize his newfound responsibility, and all will be well.<br><br>Plausibility this movie doesn't have.  But we are talking about Adam Sandler, the man who has given us such brainteasers as Happy Gilmore, and Billy Madison.  Sandler's frat-boy humor - childish and, scatalogical - has however, drawn a huge following as evidenced by The Waterboy's huge box office, (a movie that I myself enjoyed and will surely be pilloried for).<br><br>I expected one thing from this movie - a good laugh.  And it delivered. The obligatory tearjerker scenes were painful, but thankfully few and far between.   If you are in the mood for some humor-light on cheap Tuesday, give this movie a chance.","user":"Shiva-11","rank":[15,21]}]