[{"title":"Rosencrantz and Guildenstern, victims of circumstance...","rating":9,"date":"13 July 2004","review":"Rosencrantz and Guildenstern Are Dead was one of my favourite films whilst growing up. The movie follows two irrelevant characters (irrelevant in that although they served a significant purpose, their characters were not developed in any depth... Rosencrantz and Guildenstern, as individuals, were relatively unimportant) through one of the most renowned stories ever told (Hamlet). It is a film about two characters that are completely unaware of the magnitude of the events taking place around them. This carries on throughout the entire film, and is also evidenced in their accidental discoveries of significant historical scientific findings (such as the steam engine or the concept of gravity). The characters stumble their way through the film, unaware of the consequences to their actions or their significance or importance.<br><br>The characters spend the entire film coming to terms with their existence. Shakespeare didn't provide any detailed character development of either Rosencrantz or Guildenstern, and as such, they are left confused as to the purpose of their own existence.<br><br>The film also looks at the concept of a predetermined destiny. Rosencrantz and Guildenstern's fate is already determined before the film begins. And although they play an important role in one of the greatest stories ever told, they are completely unaware of their destiny; they are merely victims of circumstance.<br><br>I should also note that the constant banter between the two characters (specifically in their 'Game of Questions') is pure quality.","user":"Baron_LaCroix","rank":[75,84]},{"title":"A comedy... about tragedy","rating":10,"date":"4 February 2001","review":"Imagine if you will, two talented actors. They are playing quite small roles... the smallest roles in the play so are given no form of direction or motivation for their parts. They are simply told they are \"sent for\". They are told they are \"Rosencrantz and Guildenstern\" but no one fully indicated to them which of them were which. No they are thrust bodily into the play itself (Hamlet) and stripped of all their memories of their life before... they have become the characters. They know their cues, instinctively know their lines, but no one bothered to tell them the plot of the play, leaving them to figure it out (or not) for themselves. Their only source of any kind of direction is a player (Dreyfuss) who gives them a rudimentary crash course on dying and tragedy itself (\"Generally speaking, things have gone about as far as they can possibly go, when things have gotten about as bad as they can reasonably get.\")... and (\"We are tragedians. We follow directions. There is no choice involved.\") This is Rosencrantz and Guildenstern Are Dead. And it is the funniest intellectually stimulating comedy I've ever seen. Oldman and Roth deliver a wonderful performance, always desperately struggling \"get it\" but never quite fully understanding what's going on around them. Oldman's portrayal of the existentially distracted Rosencrantz... or is that Guildenstern... was brilliant! (G: Is that you? R: I don't know! G: (disgustedly) It's you.) Viewers who delighted in the \"verbal tennis\" match might also notice that this really goes on through out the movie. (Player: But why? R: Exactly! G: Exactly what? R: Exactly why. G: Why what? R: What? G: Why? Why what, exactly?) It's truly sad that this movie doesn't get the recognition that it deserves. See Hamlet... become familiar with the story line... and then see this movie. It is quite worth the effort. I give it a 10 out of 10.","user":"NBulanski","rank":[59,69]},{"title":"plot within a plot within a plot...","rating":26,"date":"26 August 2004","review":"This clever screenplay by Tom Stoppard challenges the viewer to listen and watch closely as the Shakespeare tragedy Hamlet is turned on its ear via taking the perspective of the oblivious rhetorics, Rosencrantz and Guildenstern.  There are multiple 'plot within plot' twists which intersect and skew at will, sometimes creating a surreal experience for the observer. The script is brilliant, full of double-entendres and mixed reactions executed superbly by Tim Roth and Gary Oldman, along with a solid supporting cast (including American actor Richard Dreyfus).  Stoppard felt that the title characters, messengers in the original play, were under represented and so examines their possible perspectives in the tale by way of exploring their destiny and their lack-of-awareness of it.  Stunning and hilarious wordplay with excellent repartee between Oldman and Roth.  Refreshing and creative spin of the tale of Denmark's 'melancholy prince'.","user":"grlwndr23","rank":[57,67]}]