[{"title":"The real American pastime","rating":12,"date":"12 September 1999","review":"For Love Of The Game<br><br>Maybe I'm looking at this film through rose colored glasses. Sam Raimi is one of my favorite directors, a real talent with visual ingenuity and a penchant for silliness. With last holiday's bleak A SIMPLE PLAN, Raimi gave up his EVIL DEAD past and churned out the most satisfying dramatic thriller of last year. He is certainly growing by leaps and bounds as a storyteller, and his latest film, FOR LOVE OF THE GAME, is another surprise for those of us who are fans. A truly elegant, dashingly romantic, white-knuckled look at baseball and matters of the human heart, GAME represents what a true Hollywood soap opera should be, effective.<br><br>Kevin Costner plays Billy Chapel, an aging pitcher for the Detroit Tigers heading for the mound for may be his last time ever. The team owner has sold the organization to a corporation and they have plans to trade Billy. His arm continues to fail him more every time he steps up to thrown. And to top it all off, Billy must deal with his tempestuous relationship with Jane, a woman he met by a broken down car on the side of the road five years ago and has yet to fully commit to. With all these thoughts swirling inside Billy's head, he unknowingly begins pitching a perfect game. Unable to keep his mind clear, Billy thinks back on his life during the game and considers the mistakes he has made and the people he has met.<br><br>Told mostly in flashback, LOVE OF THE GAME is first and foremost a baseball movie. While being knocked for his recent professional choices (yeah, I liked THE POSTMAN, say what you will) Kevin Costner seems to have been crowned king of the baseball flicks. Ron Shelton's BULL DURHAM is pure genius, the best baseball film ever. FIELD OF DREAMS is more like GAME, both share a strong heartbeat and retaining a smart enthusiasm for the sport. Costner has been the glue that held both films together. He's always been a good actor, only reaching brilliance once (DURHAM). He has the rare charm the many actors forget to consider. While not technically proficient, Costner knows screen charisma well. GAME gives us a desperate Costner performance, one which lets the actor take his guard down for once. His Billy Chapel is a man used to success, yet unsure how to use it to his advantage. A man who can hardly imagine himself consumed by anything but baseball. It's a great performance from Costner. My only hope is that public opinion doesn't tarnish the acting for the paying crowd.<br><br>Kelly Preston has the more troublesome task of shining brighter than Costner. A working actress for sometime now, this new film feels like the first time Preston is really acting. I enjoyed her supporting work in 1998's underrated JACK FROST, and GAME finally puts her front and center. She bounces effortlessly of Costner, and the two - while skittish at first - melt into a nice chemistry that packs more emotion than I expected. The loopy John C. Reilly (BOOGIE NIGHTS) and Jena Malone (STEPMOM) are also quite pleasant in small roles.<br><br>Working with even more restraint than his SIMPLE PLAN, Raimi brings to the table his gift for camera placement and visual tenacity. The baseball scenes in GAME are very romantic, the title doesn't lie. A self-professed fanatic of baseball, Raimi's love of the game shows in each shot. With noted cinematographer John Bailey, the two create a pristine looking film. The stadium scenes are both frightening cinematic and realistic at the same time. The look of the film might not register with many people, but I couldn't help but to admire such attention to detail.<br><br>Screenwriter Dana Stevens made quite an impression with her spare and warm CITY OF ANGELS remake. What she brings to GAME is the feeling of courtship that I enjoyed in Costner's last film MESSAGE IN A BOTTLE. Costner and Preston really show the genesis of a relationship, warts and all. The structure of flashback that Stevens uses to tell the story isn't as unfortunate as it sounds. It's all a rather nice mix of familiar baseball melodrama and a hearty dose of Hollywood soap opera. Stevens proves once again that she has a wonderful ear for romantic entanglements.<br><br>Call me a sucker for the obvious, but FOR LOVE OF THE GAME really worked for me. I really was moved by the story and enjoyed all the nuances and quirks. This classy film might not have a hero with a chainsaw for a hand, a crispy scientist with a reliance on synthetic skin, or a quickdrawing Sharon Stone. What it does have is strong emotional resonance. A audience film that the mainstream will love and the arthouse will abhor. I'll take that any day.-------- 10/10","user":"Kindo","rank":[58,69]},{"title":"I CAN'T THINK OF A BETTER MOVIE TO CURL UP WITH.","rating":10,"date":"10 February 2002","review":"This has to be one of the best movies I have ever watched and watched and... well, you get the picture.It is a revealing account of relationships and feelings and trust. Set during one major league baseball game, a man relives the past five years of his life from the pitchers mound. He realizes, over what may be the course of a perfect game, that his life has been anything but perfect. That the really important things in life are slipping away from him.This movie is full of life, it's sweet. It draws you in and holds your interest. I think the movie was underrated because of the subject matter. A romantic baseball movie? but that's just the surface. This movie goes very deep. If you give it a chance you will see that the reality of the setting and the people are extremely captivating, as well as fun. I can't think of another movie that has made me feel so good and so satisfied at the end. If you like baseball you can't help but love this movie. It's full of the most realistic ball playing I have ever seen in a film.If you like a sweet romance that doesn't have to rely on sex and nudity to tell the story, well, this is it. This has to be my all time favorite movie. I own it on vhs as well as dvd. The spotlight on location is a wonderful feature on both versions. It gives a fun look at the making of aspects. It also shows you interview clips from the professional ball people who were involved in the making of the film. I urge anyone who just wants to relax, enjoy a good story and feel better for watching it, to get this movie .","user":"candiepruitt","rank":[42,50]},{"title":"Even If You Hate Baseball -- and Kevin Costner -- This Movie Still Rocks!","rating":8,"date":"12 October 2006","review":"Why do I love this movie so much? I'm not a baseball fan. I didn't really like FIELD OF DREAMS. And I hated BULL DURHAM. Yet this movie just captivates me every time I watch it.<br><br>Part of it is the tight, real-time structure -- the whole movie takes place in a man's head while he pitches a perfect baseball game on the mound. It therefore combines the tension of a thriller with the poignant emotions of an elegy.<br><br>But what I loved most about this movie is that there are no clichés. Kevin Costner's character, Billy Chapel, is not a \"sports underdog.\" It's very clear he is a great athlete who has had a great career, and that he can walk away at any time with lots of money and lots of respect. The only reason that pitching the perfect game matters to him is purely for the perfection of his art -- for the love of the game.<br><br>At the same time, not all the action is on the baseball diamond. In the romantic drama, Kevin Costner does much more than play the usual Costner \"nice guy.\" Billy Chapel can be cold, egocentric, and difficult -- just like any other creative artist. But he always surrounds himself with people who are strong enough to challenge him and help him stay grounded. It's no exaggeration to say that the supporting cast in this film -- John C. Reilly as the catcher, Kelly Preston as the girl friend, and Jena Malone as the girl friend's adorable teenage daughter -- are very much the stars. They really set Costner up for an unusually mature, disciplined performance. Just the way Chapel's team mates set him up for the perfect game! This movie wasn't that well received by the critics. I remember one frightfully cultured fellow at the NEW YORKER sniffing that Costner's character is \"arrogant.\" Note well that if an artist or an intellectual is cold and demanding, it's okay. But athletes should be jolly, ape like simpletons, the kind who know their place. This complex, poignant movie is actually quite subversive, since it forces you to realize that baseball is a thinking man's game and that athletes (and their working class fans) are not nearly as stupid as the real simpletons who write for the NEW YORKER.<br><br>Shocking!!!","user":"Dan1863Sickles","rank":[38,46]}]