[{"title":"A Beautiful Film","rating":6,"date":"6 March 2002","review":"This film, based on the love story of C.S. Lewis, noted author, scholar and religious apologist, and Joy Gresham, American poet, is so very haunting and beautiful.  Those familiar with Lewis will know the tragic outcome of this love story for the ages and will appreciate the realistic adaptation to the screen.  Sir Richard Attenborough could have been tempted to cast glamorous actors in the leads but instead he chose Anthony Hopkins and Debra Winger whose characterizations more closely resembled the true life couple. Hopkins, who should have been nominated for the Academy Award for this role, plays Lewis to a T.....rumpled, vague and totally naive in the ways of the world and certainly where love is concerned.  Winger, looking frumpy, is appropriately brash and out of place in the world of Oxford academia. She approaches Hopkins' character with a refreshing honesty that is sometimes hurtful but always straight to the heart of the matter. In the end, it helps him to cope.  She captures his soul and therein begins the short but wonderful love story that forever changes their lives. The intensity of their relationship and the inevitable ending will make you weep and a box of Kleenex is recommended.  Heavy breathing and graphic loves scenes are not what this is about.....it's about love that transcends the physical and it will steal your heart away.  You will weep and rejoice at this film....see it!","user":"Bucs1960","rank":[65,68]},{"title":"Intelligent, Powerful, and Joyous","rating":10,"date":"14 April 2000","review":"I probably watch this film every two years, yet like fine wine, it grows even better after time. This picture is a beautiful, thought provoking, and highly effective meditation on how love, death, god, joy, and pain all coexist in the strange universe that is life. With subject matter as complex as this, the viewer can see where one could easily become lost in C.S. Lewis's story, but \"Shadowlands\" never falters. The film remains quiet, simple, and highly effective through Attenborough's understated direction, and its cast's uniformly excellent performances. <br><br>However, what sits at the very core of \"Shadowlands\" beauty is its ultimate truth. There are moments in this film so full of genuine, unflynching emotion that its power practically hits the audience member in the gut. Yes, the film's magnificently depicted scenes of death and grieving never fail to jerk tears from my eyes, but Lewis's closing lines regarding the choices he made as a boy and a man make me sob. <br><br>\"Shadowlands\" is undoubtedly representative of filmaking at its very best. I recommend this film without reservation to anyone!","user":"Texasguy","rank":[72,77]},{"title":"An Extremely Touching Film","rating":10,"date":"20 March 2006","review":"C. S. Lewis is making a bit of a comeback with the \"Chronicles Of Narnia\" movie of late, but here's a film portrait of him made in 1993 starring the great British actor Anthony Hopkins.<br><br>To Christians, Lewis has always been a familiar name: one of the greatest and most well-known Christian apologists theologians (\"Merre Christianity,\" \"The Screwtape Letters,\"etc.) and fiction (the Narnia series) writers of all time. But this film - no surprise - doesn't really deal with that: it's mainly a love story, the love he had toward his American wife, played by Debra Winger.<br><br>Being a Brit, the film takes place in England and features some wonderful landscapes of that great country. Hopkins exudes warmth in the role of Lewis and Winger is okay, New York City accent and all, as the American. I would have chosen someone else for the role, but Winger gets by. <br><br>Not to be forgotten is the fine job Edward Hardwicke did as \"Warnie,\" Lewis' brother. Joseph Mazzello, one of the top child actors of the early '90s, is the Lewis' young boy. When father and son cry together at the end, it is one of the most touching scenes I've ever viewed on film.<br><br>It's a touching story, period, and if it doesn't get your eyes moistened at least once, check your pulse. The dialog in here is excellent, too. I particularly enjoyed the by-play of dry wit between the professors and Winger's various comments to her husband.<br><br>Nice films like this are unusual and should be treasured, as Lewis and his works are by so many people, Christian or non-Christian.","user":"ccthemovieman-1","rank":[62,68]}]