[{"title":"Kung Fu Lesbians","rating":19,"date":"19 February 2016","review":"The Vixens of Kung Fu (1975) <br><br>** 1/2 (out of 4) <br><br>Oddfall porno has a woman walking through the woods when three rednecks jump out at her. After shooting her in the back the men rape her but she finally gets away and runs into the arms of some sexy females who just happen to be practicing kung fu.<br><br>I had never heard of THE VIXENS OF KUNG FU until Exploitation.TV asked on their Facebook page what the most viewed film on their website was. Well, it turned out to be this rather nutty film so with so many people watching it I decided to join in and see what the hype was about. Is this a classic porno in the same light as THE OPENING OF MISTY BEETHOVEN? Not even close but this thing is campy enough to make it worth sitting through at least once if you're into this type of thing.<br><br>There are some really campy moments here and especially the various kung fu battles and the poor editing job to make it appear we're watching real \"experts\" so to speak. The film is mostly sex scenes with very little plot, which isn't always a bad thing. The women are all extremely attractive and there are quite a few rather erotic lesbian scenes. Again, if you're into that type of action then you're going to get plenty of it here. The silly dubbing adds to the charm as does the nutty music score.<br><br>Again, THE VIXENS OF KUNG FU isn't what you'd typically call a good movie but for a film of this type it's entertaining.","user":"Michael_Elliott","rank":[6,6]},{"title":"Everybody was kung-fu fornicating!","rating":8,"date":"12 March 2014","review":"Without a doubt one of the single most uproariously silly porno oddities to emerge from the loopy 70's, this one merges your standard sexathon with the then trendy martial arts craze with positively ridiculous and hence quite sidesplitting results. A young prostitute (gorgeous brunette Bree Anthony) gets raped in the woods by a group of scuzzy guys who include a giggly Bobby Astyr and the ever-sleazy Jamie Gillis. Fortunately, the hooker gets taken in by a secret sect of beautiful distaff kung-fu masters who teach her all about the erotic side of the martial arts (i.e., these ladies meditate buck naked until smoke comes out of their vaginas and make out with each other a lot). Director Bill Milling pokes hysterical fun at the glaring shoddiness of low-rent chopsocky fare: Hilariously obvious dubbing, cheesy protracted slow motion, hokey narration done by some dude with a phony and unconvincing Chinese accent, tacky freeze frames, wonky editing for the fight scenes, jarring use of music (Anthony gets raped to jaunty hillbilly bluegrass music!), and even the unavoidable arduous training montages. The smoldering presence of the always delicious C.J. Laing as the martial arts teacher provides plenty of heat. The bright cinematography gives this flick an attractive sunny look. A total hoot and a half.","user":"Woodyanders","rank":[3,5]}]