[{"title":"Another tack on a fascinating flick","rating":27,"date":"27 April 2004","review":"I only read the most recent 12 reviews, but it seems you either really appreciate this film or you think it sucks.  Apparently, some folks see art in the tragic and angst-ridden characters, and others are disgusted by their actions and the depressing imagery.  Personally, my motives were not too sophisticated:  I found it in the \"horror\" section at the video store and it looked pretty stylish and of course, Aragorn was in it, so I said what the heck.  I thought the film, though disturbing, was indeed a fascinating and thought-provoking piece of cinematic art.<br><br>Anyway, I'm wondering if Philip Ridley was commenting on the narcissism, arrogance, violence, and corruption of U.S. culture.  Not that others couldn't be accused of similar vices, but...  I think the boy Seth and the other lead characters symbolize our national conscience.  We run around blowing up frogs and tearing up peoples' property with no remorse, then create our own moral/spiritual sources to console us out of empty, dead things (like a stillborn child).  We wallow in our domestic dysfunctions, while excelling at denial about them (like the nutty mother).  We like a good witch hunt, accusing the depressed widow or the agonized former pedophile, while ignoring the obvious handsome suspects in the nice Caddy. We flit around wrapped in our flag thinking we're innocent, all the while nuking children in war only to focus on how their radiated skin looks like a mirror in which we can see our lovely reflections.  But someone else gets the last laugh, since we're all self-destructing as a result of it all, and while at first Seth's screaming frenzy as the finale confused me, I realize now it's a fitting end to that interpretation.<br><br>Or something like that.  It might just be about a bored rural kid with no conscience and a wild imagination whose failure to tell the truth ends up hurting everyone around him.  Or about the price of tea in China.  It's worth the view, though, if you like Gothic thrillers.","user":"shlemmy","rank":[88,100]},{"title":"Hard to respond ...","rating":30,"date":"30 May 2004","review":"This film is certainly unique.  It creates a dark and haunting atmosphere against a rural town in the 1950s.  It keeps sneaking so many weird and unsettling images into its narrative that by the time the really weird stuff starts you're totally accepting of it.  The film opens with a group of cruel boys inflating a hapless frog and then exploding it in the face of a woman, spattering her with blood and frog entrails.  That sets the tone.<br><br>I was not in the right frame of mind for this.  But I cannot utterly dismiss it either.  I was taken by the filmmaker's vision, and I had to appreciate his imaginative approach to narrative.  But I was expecting the violence to be a little more stylized--actually, it's quite bleak and nihilistic.  This film belongs in a pantheon of indigestible films like SALO, brilliant movies to be sure, but hardly the kind of stories to tuck you in at night.  This is a compliment, by the way, as SALO is one of my favorite films.","user":"sober_gaijin","rank":[40,52]},{"title":"American Gothic","rating":10,"date":"19 October 2000","review":"British playwright, author and scriptwriter Phillip Ridley turned his hand to directing for this beautifully beguiling film about a child's view of a bewilderingly complex world. The protagonist-Seth-is confronted by the horrors of mortality when he meets the mysterious \"vampire\", Dolphin Blue, a lonely widow he encounters when he and his friends explode a frog in front of her. The film follows Seth through his deepening understanding of the fragility of existence.<br><br>A highly evocative and stylised tale of small town life and death set amidst swaying corn fields and clear blue skies, but, there is a foetus in the barn and death drives a black car through town... Not for all tastes, this is a poetic piece of Americana that will probably appeal to fans of David Lynch. Ridley's vision is not a cheery world view but one in which cruelty and fate stalk the innocent hand in hand. This is a beautiful and tragic piece of work and I just wish there would be a DVD release soon","user":"PaulLondon","rank":[44,60]}]