[{"title":"If I were judging this film purely on its content and style, I would call it a ramshackle mess...","rating":3,"date":"29 March 2001","review":"... the plot isn't even that interesting, just some soft-core pornography dressed up in amateur psychology.  The structure is lazy, the performances done on autopilot, and the suspense virtually nil.  All of this I was expecting, however, and NONE of this was WHY I was watching.  It promised us Alicia Silverstone in her first vaguely steamy role.  Is it steamy?  Not really, but Alicia is cute enough fully CLOTHED for the guys to only feel mildly annoyed that she doesn't whip 'em off.  If you're expecting a great film - or even a good one - you'll be disappointed, if you're expecting a raunch-fest - disappointment again.  If you just want an excuse to ogle Alicia for roughly two hours, it does its job.<br><br>   Finally, what was J.T Walsh doing in this??  It represents a blight on what was a fine career.  Maybe he was duped into expecting sex scenes with Alicia too...","user":"Howlin Wolf","rank":[22,26]},{"title":"A turkey.","rating":3,"date":"7 September 2001","review":"\"The Babysitter\" is a bizarre, repetitive and often campy turkey. Most of the film consists of endless fantasy sequences that are never as steamy as they are supposed to be. A fine cast is totally wasted, especially George Segal, whose role couldn't be more pointless. This movie was misconceived all along and is worth watching only if you're curious.... (*1/2)","user":"gridoon","rank":[17,22]},{"title":"Miss Silverstone is never better than the pictures she appears in...","rating":19,"date":"19 March 2002","review":"...so it's hard to believe anyone is checking out THE BABYSITTER for her lisping, nymphet presence.  What you have here is low-grade, late-night, Cinemax fare trying to capitalize on Silverstone's ability to come off as Lolita to a reasonably capable cast of old pros like George Segal and J.T. Walsh (along with one of those London twins for youthful good measure). This kind of a film needs some sexual momentum to keep it entertaining; and, sadly, this movie is lacking in eroticism...Silverstone more so.","user":"TheVid","rank":[10,12]}]