[{"title":"Not just for teens, this is...well...awesome...","rating":10,"date":"16 January 1999","review":"I understand why teenage girls would like this movie--the thrilling rush of new found deep friendship tied together with nascent sexuality and all that comes with it...the defying of the confines of the world around them...the incredible power of unfettered creativity and self-delusional belief...<br><br>What's amazing is that a jaded thirty-something man like myself would consider it to be his favorite film of all time. Peter Jackson shows a deftness in handling interpersonal characterizations and blending in amazing special effects in a way that seems so natural...so fluid...that you while you're awed by what you see, you're not so aware of the process that you're distracted.  The oh-so-1993 effect of \"morphing\" is used better here than any other film (save, perhaps, Terminator 2--but in that movie, the morphing WAS the film...when here, it is merely one element.)<br><br>The direction is exemplary.  The cinematography is awe inspiring.  The script is sharp.  The acting...down the line...is superb.  Melanie Lynskey delivers a brave performance--giddy, childish, frightening, sexual, clouded...  She's everything Christina Ricci pretends to be.  Kate Winslet--hyper-bright and wonderful...her performance here reminds you that her \"Titanic\" performance was \"sunk\" (sorry!) by the extremely poor dialogue she was given.  Her character's overly cheerful demeanor is a mask that covers her disappointment in her parents--but it's extended so far that it no longer seems like a mask...it seems to be a force of nature that drags Lynskey's Pauline along for a dangerous ride...a ride that Winslet's Juliet is in no position to control.  There are crisp performances from all of the supporting cast as well.<br><br>Jackson should be listed with Gilliam and even Lynch when it comes to directors who can achieve a glorious, if dark, vision.  The fact that Jackson's movies (save for \"Meet the Feebles\") are mainstream accessible--in ways that Lynch, especially, could barely consider (although \"The Frighteners\" was painfully overlooked by the US market)--makes me wish that he'd try his hand at more mainstream material.<br><br>Imagine what a Peter Jackson \"Titanic\" would have been like...and compare that to what a James Cameron \"Heavenly Creatures\" would have been like and you get my point.","user":"pgreyy","rank":[132,166]},{"title":"A disturbing story told with imagination and confidence by a talented director and lead actresses","rating":10,"date":"10 July 2004","review":"When Juliet Hulme moves from England to New Zealand with her parents, she meets Pauline Rieper  a rather disaffected girl who is happy to have a friend. As they get to know each other, Pauline is pulled into the fantasy world of Royals and scandal that Juliet has written. However as the two fall deeper and deeper into the characters they have created, their relationship becomes ever more intense and their parents step in to separate them. Facing a geographical separation, the two plot to take revenge on the adults who seek to split them up.<br><br>At the time of release I remember thinking that this was an unusual film for Peter Jackson to have made given that he was more of a gore merchant as I was aware. Watching it not it still feels like a strange film for him to have done, but now it is for different reasons  that is, that he has made one of the biggest trilogies of all time etc! Ignoring his previous and later works, this is a great little film and it acts as a showcase for Jackson as it shows he can be imaginative and also sensitive when required  certainly coming to this on the back of Bad Taste, I had low expectations on how he would do it but he did it. The true story is adapted from Pauline's diaries and, while it must be impossible to see how they saw the world, the fantastic fantasy worlds we see here are better than the probably quite repressed world they had in mind  from this film I saw the two as being more insular and self defensive than the elaborate fantasy scenes would suggest. The film did well to depict their relationship, immediately having worrying signs but being the sort of thing kids do  and the killing hinted at by the film's opening is brutal and unpleasant  we are never allowed to side with these people.<br><br>The direction is great, creating normal domestic scenes with the same confidence as it uses full size plastic models within the fantasy sequences.<br><br>The cast also do well, in particular two great lead performances. Naturally Winslet gets all the kudos for her character is ott at times and spins wildly emotionally  a hard role to carry off but she does it very well and showed great promise (even if she looks too old for the role in my opinion). Lynskey impressed me much more as her role was more controlled and was delivered a lot better by an actress who looked like a shy, embarrassed little girl. Both were great for different reasons and they are a big reason this film works so well. Support from the likes of O'Connor, Kent and a few other well known faces are also good but there is never a question about their role within the film  they are supporting the main two.<br><br>Overall I imagine this film will get a audience boost now as lots of LOTR fans go trawling through Jackson's back catalogue to see what else he has done (boy are they in for a surprise!) and I'm glad more people will see it.<br><br>The direction is great and it delivers a complex story in a colourful and fanciful manner, but the main praise should go to the two lead actresses who deal with really difficult characters and do so in a confident and believable manner  even if the material means that many of us will want to find what they did abhorrent.","user":"bob the moo","rank":[91,119]},{"title":"Kate Winslet is Oscar worthy!","rating":10,"date":"18 May 2005","review":"This film is astonishing. Really, I rank it tied in first place as the best film of 1994, shared with PULP FICTION.<br><br>Peter Jackson's masterpiece (thougth I love the Lord of the Rings films) is definitely HEAVENLY CREATURES. It's a challenging film, very difficult to watch at times. But it brilliantly captures the brightly burning, constantly changing, wild emotions of these two intelligent and creative but seriously damaged teenage girls.<br><br>Sarah Peirse as the mother is incredible in her role. Melanie Lynskey reaches such a depth with her character...I actually think it's a bit frightening how good she is. And Kate Winslet...ahhh KATE WINSLET! At first glance...the performance might just be blown off as over the top and amateur. But that's only at first glance. Look closer, and stay with it, and you will see what amazing things she has done with this character. It's a remarkable achievement unlike any other acting I've seen in any film of this kind, which is to say a true life crime thriller.<br><br>Heavenly Creatures is, and I say this with absolute certainty, the best true life crime thriller ever made. Because instead of trying to be a classic thriller with cheap tricks, Peter Jackson gets you inside the twisted minds of these two girls, and whether you hate them in the end or not, you completely understand why these girls did what they did...and that it was doomed from the start. Kate Winslet is just brilliant. WHY wasn't she given every award under the sun for this?!?!??!","user":"dusan711","rank":[72,96]}]