[{"title":"\"Choose between yesterday and tomorrow. Pick one. Stick with it.\"","rating":8,"date":"8 June 2008","review":"While on vacation, a single mother identified as Theresa discovers a 'message in a bottle' on the shore that has moving honest words of love addressed to a woman named Catherine <br><br>The trail leads her to a sailboat builder named Garrett and also to his father, Dodge in a small North Carolina coastal town It turns out that Catherine is Garret's deceased wife, and the intriguing letters were written, two years earlier, after her decease <br><br>Some people find the one true love of their lives, if they're fortunate enough Luis Mandoki's film, in part, turns out to be a choice about what occurs when a person finds that right kind of love, then when he is faced with the impossible, and then when he is given the right to continue with his life and is brave enough to love again no matter how unpleasant his grief is <br><br>As a reclusive widower, Garret was still in deep pain, and entirely devoted to Catherine's memory He had hard time letting go of the past Catherine was dead but not forgotten and was simply everywhere <br><br>As a sailor Costner didn't inherit the charm of Newman He was drawn to Penn by her smile, her beauty, even her mistakes <br><br>Robin Wright Penn was beautiful, delicate and sweet as Theresa She soon insinuates her way into Garret's life Her expectations were always too high Since the beginning, she just had to meet the person that wrote those letters Her life was changed by them Eventually when she met Garret that morning, she accepted, without hesitation, to step aboard <br><br>Paul Newman as Dodge liked Theresa instantly He saw in her the key to his son's emotional recovery <br><br>With a very nice music, and a stunning coastal photographyalso the ocean scenes are wonderfully taken\"Message in a Bottle\" is definitely a weepy melodrama and a must see for those who believe, or don't, in love","user":"Nazi_Fighter_David","rank":[51,63]},{"title":"9 out of 10... Loved it!","rating":9,"date":"8 April 2005","review":"I really enjoyed the peacefulness of the surroundings. The beautiful foggy mornings near the ocean is an all natural calmer. Just overall a wonderful movie. Very moving. Each of us Have loved or will have loved so deeply as to make our very souls leap into unfathomable joy. This movie grabs hold of the heart of the viewer and keeps you intrigued from the beginning to the end. It engages the inner self to want to reach out, take hold of life and love with the clarity to which we all want to be loved. It reminds us when you love, let it be always unconditional. Let it be forever. A well written movie. One, every person should take time to see.","user":"melloheart","rank":[43,54]},{"title":"Kevin Costner....","rating":10,"date":"27 June 2004","review":"I can't help but love this movie.  When watching this movie, I felt as if I was right inside with the people and it was real life.  All the emotions that Kevin's character goes through shows this sensitive side of him that is not always shown in his movies.  I cried for his loss and cheered him on in finding another person to understand and love him for who he is.  The depth of this film made me want to be in love and to share that experience with someone.","user":"hershykissed26","rank":[20,24]}]