[{"title":"A Childhood classic for those who enjoyed being a kid.","rating":10,"date":"17 November 2004","review":"I love this movie and the other two movies in this series. I believe that it is the best of the series b/c it was a lot lighter than the other two. My favourite part might have been in the end when everyone is around the campfire and they burst into a horrible version of \"We Are The Champions.\" Though it was horrible it was hilarious and very cocky. I'm sure all of us would break into this song after beating everyone in the world in hockey....though it's hard to believe Canada didn't kick Americas asses. I am a fan of Queen also and I believe this movie may have had a great deal with that as well.As a girl I have to say that when I was ten this was the first movie that I saw boys for more than just stupid pricks. If you want to be a kid again watch this movie and enjoy but don't bash it b/c it wasn't made to entertain teenagers and adults.","user":"EmpressClaudia","rank":[25,33]},{"title":"The Greatest Film of All Time","rating":10,"date":"3 February 2006","review":"This is clearly above and beyond all other movies ever made and it definitely deserves the number one ranking on IMDb. It's not even close. Why, you ask? Only because it has everything a movie could possibly need. Think about it, you've got Coach Gordon Bombay, Pacey from Dawson's Creek, kids from Morgan Park High School in Chicago(I live a block away!) which actually does not have a hockey team, Keenan's knuckle puck, Team Iceland, Goldberg for comic relief, the team from Trinidad &amp; Tobago whose fans play Caribbean drums after they score a goal, that hot chick from Maine, and We Are the Champions! Come on, it doesn't get any better.<br><br>Evereybody now, \"Quack! Quack! Quack! Quack! Quack! Quack!\"","user":"aclott789","rank":[35,49]},{"title":"A review of the second review","rating":7,"date":"12 January 2019","review":"I felt I just had to say, the second review, 10/10 \"The Greatest Film of All Time\", is one of the funniest things I've read in a while and made my night. I've never reviewed a film or show, I laughed so hard I had to post something. It's a good movie, I don't know, watch it. Underrated and often left unmentioned decent sequel. Ducks fly together. And the second review helped me big time.","user":"skessler3","rank":[4,4]}]