[{"title":"A wickedly funny look at the SciFi inner sanctum","rating":26,"date":"26 December 1999","review":"Comedies are usually pretty tricky for me.  Either I'm laughing my head off and nobody else gets it, or everybody else is laughing and I'm looking for the nearest exit.  But Galaxy Quest had everyone in the theater laughing, including my companion--who hates science fiction.  It cut across ages and backgrounds with a very simple premise--you are what you believe yourself to be.<br><br>As a fifteen year veteran of science fiction conventions, I've seen the phenomenon from both sides of the stage.  I've met the get-a-lifers, the just-for-fun guys, and the not-so-rare I'm-only-in-it-for-the profit gang. I've met actors who loved the whole shebang, actors who loathed it, and actors who didn't have a clue what was going on.  Fandom is a very big place, with room for all sorts.<br><br>And Galaxy Quest got it right--the conventions, the costumes, the geeks, the groupies, even the mocking \"mundanes\" who attend cons looking for kicks. It took notice of all the science fiction cliches, acknowledged them, and then twisted them to its own comedic purposes.<br><br>Galaxy Quest captured not only the silliness of fandom, but the inspiration of it.  In the end, the demoralized and cynical actors found strength and meaning in the same characters which stereotyped them.  The geeks saved the day.  The good guys won.  The bad guys provided entertainment to masses of fans.  Things blew up.  And isn't that what science fiction is all about?<br><br>The entire cast was excellent, especially Tim Allen and Alan Rickman doing their best Shatner and Nimoy impersonations.  Special credit must go to the four actors who played the naive aliens.  Their wide-eyed innocence reminded me of the quality that drew me, and draws children of all ages into the world of science fiction.<br><br>This movie didn't rely on vulgarities or overt violence.  It didn't need to resort to meanness or cruel jokes, either.  While it poked fun at science fiction and its fans, it never resorted to the kind of mockery you see in other films.<br><br>Galaxy Quest is a solid, funny movie.  Go see it.  Take the kids.  Go see it twice.","user":"Debbie-44","rank":[308,318]},{"title":"Funny, thoughtful spoof","rating":9,"date":"8 October 2004","review":"I still don't quite understand why \"GQ\" never conquered the box office. The movie is clever, hysterically funny, surprisingly moving and, as one reviewer pointed out, more respectful of (and better at communicating) the ideals of \"Star Trek\" than any of the recent \"Trek\" movies or television incarnations. The script is inventive, the special effects are vivid and powerful (especially when the actors see the real ship for the first time, and when the rock monster rampages through the ship), and the characters are incredibly well drawn.<br><br>I'm also puzzled by the negative reactions some people have to the film. Does the film fail to register because the \"Trek\" social phenomenon is unfamiliar to them, thus there's no frame of reference? I'd really like to know.<br><br>Comedy is possibly the hardest genre to get right, because line delivery, timing, direction and character shading all have to be pretty much perfect or the movie just won't be funny. GQ nails these elements -- right on the head and in virtually every scene -- and keeps up the pace by constantly moving its characters forward. Tony Shalhoub (Fred), Sam Rockwell (Guy Fleegman) and Enrico Colantoni (Mathesar) in particular are so dead-on perfect in their scenes that lack of box office and the Academy's traditional indifference to comedy are probably the only reasons these guys didn't get Oscar nods. (Okay, well, 1999 was also an incredibly strong year for American cinema.)<br><br>But GQ is also strangely moving -- particularly in the way it derives comedy from despair. The actor characters' lives are in ruins, not unlike the aliens they eventually save from extinction. Perhaps this is why -- even though the characters don't know it yet -- the two groups get along so well and why the actors make the decision to actually become their TV characters in the end. This may also be why the dismay in Mathesar's face when he learns the truth is so painful.<br><br>I suspect GQ also got lumped in with the likes of \"Scary Movie\" and \"The Naked Gun\" movies in the public's collective conscious: It was perceived as just another spoof and therefore not worthy of significant attention. I hope the movie develops enough of a cult following that it one day reaches that wider audience it deserves.","user":"PMApollo","rank":[376,392]},{"title":"A great film, much underrated at the box-office.","rating":10,"date":"19 December 2002","review":"I generally rate films highly based on how often and how much I'd like to watch them again. I can watch most films more than once, but only a few have the necessary qualities to watch over and over again. Comedy films are never that high on my list of \"watch agains\". After seeing a joke or comic scene once, it's hard for it to have the same impact again and again. I well recall being in tears of laughter when I first saw Airplane at the cinema. But now I find it hard going and even the inflatable pilot only raises a smile.<br><br>So it's rare that a film like Galaxy Quest (a scifi comedy) comes along, but very welcome when it does. There's a lot of homage paid to Star Trek, of course, and old scifi shows in general and fans of those will have no trouble spotting the moments culled from those shows.<br><br>The cast are all exemplary in their roles as ex scifi stars who get catapulted into the real thing and have to save the galaxy. Tim Allen and Sigourney Weaver give good, solid performances here. In particular, Weaver shows a talent for comedy here that was lacking in Ghostbusters. Tony Shalhoub's bumbling, out-of-his-depth technician is also a nice addition.<br><br>But out of all of them two really shine for me. Alan Rickman, whose facial expressions throughout the film just have you laughing out loud without needing to listen to what's being said. And Sam Rockwell, who plays the \"extra crewman\" who's always convinced he's going to get killed, because he's a nobody and not one of the regular cast.<br><br>The whole film is chock full of delightful silliness and memorable scenes, such as where they enlist the aid of geeks to navigate them through their own ship as the geeks know the plans off by heart.<br><br>A great film, much underrated at the box-office and destined to become a classic.","user":"Rob_Taylor","rank":[267,279]}]