[{"title":"Dark, brutal, and powerful","rating":9,"date":"21 February 2000","review":"A film that explores the criminal lifestyle in a remarkably brutal and cynical fashion, American Me is the stunningly assured directing debut of Edward James Olmos. Olmos also stars, and gives a terrific performance. Even better is William Forsythe as his lifelong friend and right hand man. This film features some of the most unflinching moments of violence I've seen in a mainstream American film. The violence isn't necessarily graphic, but you generally get the idea. One scene involving a brutal gang rape has deservedly achieved notoriety, and yet it doesn't seem gratuitous. It works within the confines of the story. Olmos should be applauded for this achievement, and it's a shame that this film is overshadowed by other gangster films. It belongs right up there with them.","user":"contronatura","rank":[34,35]},{"title":"Intense Disturbing and Underrated Film","rating":9,"date":"24 November 2005","review":"\"American Me\" is arguably the most significant film not discussed in the same breath with crime epics such as \"The Godfather.\" It was clearly made, both consciously and perhaps subconsciously to be the Mexican Godfather film and that is hardly a bad thing. Its honesty regarding the emotional costs of violence and murder are on par with that film. I don't know what to say to anyone who critiques Edward James Olmos. First, this actor's capacity to convey a complicated range of emotions without words is absolutely staggering and has been seen to great effect in many great films including \"Blade Runner.\" Additionally, he is inarguably the premiere Latino / Chicano filmmaker and actor of all time. If you look at the films he has been involved with, think about how they have dominated the way Hispanic people, Mexicans in particular, have been seen by others who would, largely, not even know of the experiences of their neighbors. \"American Me\" is so unflinching that, after seeing it, I had to see it again to believe it was actually made by or released by a major studio. Once upon a time studio films featured honest portraits of life but rarely any more. \"American Me\" tho hardly the knee-slapping comedy some reviewer wanted or expected, conveys an honest sense of the life lived by many without the hope of education or prosperity but with the same need for respect and something bigger than themselves to believe in that you or anyone else has and lives their life by. If you want to see a life perhaps very different than yours depicted with uncommon honesty, watch this film.","user":"tmcclus","rank":[37,39]},{"title":"Excellent directorial debut from Edward James Olmos.","rating":10,"date":"22 June 2004","review":"American Me (1992) was the directing debut of long time character actor Edward James Olmos. This film is a historical fiction depiction of the rise of La Emme, The Mexican Mafia. The movie follows the lives of three street gang members who by a sad twist of fate end up in Juvenille Hall. From there they graduate to the big time. Folsom Prison. Inside the walls of Folsom, the three form the most powerful gang inside the California Penal System.<br><br>Olmos turns the story into a Shakespherian tragedy. A story about a dangerous cycle that repeats over and over within certain communities and how the lack of education can be dangerous. Like they say, an idle mind is the devil's playground. Many of these characters had too much \"idle time\" before they hit rock bottom. Olmos' direction, editing and use of lighting is that of a long time film-maker. The cinematography complements his directorial style. He makes these figures into noble persons who live and die by a code forged from blood, shanks and sweat. Great stuff from Mr. Olmos, a true masterpiece from a first time director.<br><br>Sadly, Mr. Olmos has took a lot of flack for this film and has made some powerful people very angry. If I were him I would have taken a safer route and gave the prison gangs some fake names and cut all ties to any \"Technical Support\" but that's not his style. He should be commended for his efforts because others wouldn't have the courage or conviction to do this. Mr. Olmos doesn't glamorize the lifestyle either. Although they're men of honor amongst themselves I wouldn't want to be in their shoes. But what people have to do to stay alive in prison should not be looked down upon and on the other hand, when one's on the outside they should leave what they learned within the prison walls. Because it's a whole different ball game out here.<br><br>Highly recommended.","user":"Captain_Couth","rank":[32,34]}]