[{"title":"Revealing, but Skewed","rating":6,"date":"13 August 2005","review":"The War Room does a good job of extolling the skills of James Carville and George Stephanopolous. Clearly, their work had much to do with Clinton's victory. A little known fact about the film is that the actual campaign manager, David Wilhelm, refused to participate in it. He didn't like the idea of a camera crew roaming the headquarters and recording conversations that he felt should have been private. Clinton overruled him, of course. As a result, the documentary skews history a bit. The nuts and bolts of running a campaign are ignored while the craft of spin doctoring is glorified. In a visual medium, that's not altogether surprising, and it may even have been unavoidable. But the misrepresentation -- or rather, the selective representation -- has had the unintended consequence of contributing to public cynicism about political campaigns, which now appear to be all about the spin, the framing -- the very things that make voters feel like they're being manipulated. Perhaps a stronger emphasis on the heavy lifting of door-to-door canvassing, phone banking, meetings with interest groups, outreach to local officials, event set-up, and the like, would have given a more complete picture. Then again, those aren't exactly telegenic activities, and documentary filmmakers may have been hard-pressed to incorporate them even if Wilhelm had cooperated. But the troublesome implications remain, and are worth considering.","user":"miggsathon","rank":[19,29]},{"title":"Fascinating and hilarious","rating":9,"date":"27 June 1999","review":"I first saw this at Doc Films at the University of Chicago.  I was expecting it to be interesting, but dry.  Wow, was I wrong.  The entire audience was enthralled and frequently laughing their heads off.  You couldn't make up comedic characters like these if you tried.  James and George are just amazing.  (Of course, there would be times where HALF the audience was laughing, split along party lines. :-) )<br><br>The filmmakers also liven up the proceedings with good choices of music and little bits of Americana tossed in here and there.  Invite over all your political junkie friends, get a few beers, rent this movie, and enjoy.","user":"jaffray","rank":[13,21]},{"title":"A Political Education","rating":24,"date":"24 May 1999","review":"As a student of Political Sciences, I believe this to be one of the most fascinating and introspective documentaries regarding the subject of campaigning.  The first modern campaign, the 92 Clinton war is an amazing melodrama of quick rises to power, downfalls, villains, heroes, and the precursor to one of the most vicious political battles of our nation's history.  In the film, if you look hard enough, you see the seeds of weakness being sown which would lead to an awesome political showdown which is more grand, more high-stakes, and more dark than the plotline of any film in this database.  Note:  If you like \"The War Room,\" read Woodward's \"The Agenda.\"","user":"J.Bond","rank":[11,19]}]