[{"title":"A Remake of a Film that Never Needed to be Remade","rating":6,"date":"3 November 2004","review":"If one wants to remake a movie, the best option is probably to choose and original that was good, but not a great classic. Clearly, any attempt to remake a concept that failed first time around is fraught with danger, but an attempt to remake a classic runs the risk that one's film will be unfavourably compared with the original. The original 1968 film of 'Planet of the Apes' is one of cinema's great science fiction classics. More than an adventure story, it touches on some of the concerns of the late sixties- the fear of nuclear war, race relations- and also raises more fundamental issues about the relationship between man and nature, the relationship between religion and science, Darwinism and animal rights. It was therefore a brave move on Tim Burton's part to try and remake it. <br><br>The main concept of Tim Burton's film is basically similar to Franklin Schaffner's. An astronaut from Earth travels to a planet ruled by intelligent apes. Humans exist on this planet, but they are regarded as an inferior species, despised and exploited by the apes. There is, however, an important difference. In the original film, the apes are the only intelligent and articulate beings on the planet. Although they have only attained a pre-industrial level of civilization (they have firearms, but no power-driven machinery, and no means of transport other than the horse or horse-drawn vehicles), they are a far more advanced species than the planet's human inhabitants, who lack the powers of speech and reason and live an animal-like existence. In Burton's remake, humans and apes have similar powers of speech and intellect; it is only the apes' greater physical strength that enables them to dominate the planet and to treat the humans as slaves. <br><br>It was this ironic role-reversal, with apes behaving like men and men behaving like beasts, that gave Schaffner's film its satirical power. That film was advertised with the slogan 'Somewhere in the Universe, there must be something better than man!', and the apes are indeed, in some respects, better than man. Their law against killing others of their kind, for example, is much more strictly observed than our commandment that 'Thou shalt do no murder'. There is no sense that the apes are bad and the humans good. Even Dr Zaius, the orang-utan politician, is not a wicked individual; by the standards of his society he is an honourable and decent one. His weakness is that of excessive intellectual conservatism and unwillingness to accept opinions that do not fit in with his preconceived world view. (In this respect the apes are very human indeed). <br><br>Burton's film takes a less subtle moral line. It is a straightforward story of a fight for freedom. The villains are most of the apes, especially the fanatical, human-hating General Thade. The heroes are Captain Davidson, the astronaut from Earth, the planet's human population who long for freedom from the domination of the apes, and a few liberal, pro-human apes, especially Ari, the daughter of an ape senator. The apes are more aggressive and more obviously animals than in the original film; they still frequently move on all fours and emit fierce shrieks whenever angry or excited. <br><br>There are some things about this film that are good, especially the ape make-up which is, for the most part, more convincing than in the original film and allows the actors more scope to show emotion. (I say 'for the most part' because Ari looks far less simian than do most of the other apes- Tim Burton obviously felt that the audience would be more likely to accept her as a sympathetic character if she looked half-human). The actors playing apes actually seem more convincing than those playing humans. Tim Roth is good as the militaristic Thade, as is Helena Bonham-Carter as Ari. Mark Wahlberg, on the other hand, is not an actor of the same caliber as Charlton Heston, who played the equivalent role in the original film, and Estella Warren has little to do other than look glamorous. (Heston has a cameo role as an ape in Burton's film, and even gets to repeat his famous line 'Damn you all to hell'). <br><br>Overall, however, the film is a disappointment when compared to the original, a simple science-fiction adventure story as opposed to an intelligent and philosophical look at complex issues. It tried to copy the device of a surprise ending but failed. Schaffner's famous final twist is shocking, but makes perfect sense in the context of what has gone before. Burton's makes no sense whatsoever.<br><br>Tim Burton can be a director of great originality, but with 'Planet of the Apes' he fell into the standard Hollywood trap of trying to copy what had already been done and remaking a film that never needed to be remade. It was good to see him return to form with the brilliant 'Big Fish', one of the best films of last year. 6/10","user":"JamesHitchcock","rank":[221,289]},{"title":"As shallow as the water he crashlands in.","rating":21,"date":"21 August 2001","review":"After seeing Tim Burton's excellent Sleepy Hollow, and superlative Ed Wood, I was expecting much more of a character driven movie, with the characterization and spiritual philosopies that elevated the original movie out of the pure science fiction genre and into a cerebral adventure film with acutely observed social comments.<br><br>Unfortunately, the film suffers from poor script and direction right from the minute the astronaut crashlands.<br><br>They knew from the outset that they would never produce an ending to rival the original, and any cinema-goer in their right minds would never expect one.  But they could have at least got the beginning right.  Neither Mark Wahlberg's character nor the tension is ever developed, so when he is confronted by the apes: we feel nothing.<br><br>The humans, though they have the benefit of increased intelligence and speech, are poorly utilized.  And Kris Kristofferson is criminally wasted.<br><br>The make-up and effects are, as you would expect, fantastic.  However, despite improved flexibility in the make-up, there is little warmth in either the performances or direction that made millions of kids go ape-nuts in the seventies.  Bonham-Carter's Ari, whilst convincing, is not a patch on Kim Hunter's Zira.  Roth's quite brilliant performance as Thade virtually carries this film and makes it the one reason to stick with it to the end.<br><br>Did I say end?  Well, the less said about that the better.","user":"seemore-3","rank":[148,209]},{"title":"Planet of Shallowness","rating":3,"date":"27 August 2002","review":"Thank you Hollywood. Yet another movie classic utterly ruined by a cheap, shallow, effect-heavy and redundant remake. The original \"Planet of the Apes\" was an intelligent and thought-provoking movie with a very clear message. It was a movie that focused almost entirely on dialogue, which sounds very dull but was in fact very interesting. <br><br>This movie, on the other hand, seems to have done away with pretty much ALL the dialogues. Instead of a great movie we get an incredibly stupid two hour chase movie. Dialogue has been reduced to a mere minimum, character interaction and development are non-existent and most of the time it's extremely hard to figure out what's going on. Instead, we get a bunch of pointless action scenes, some marginally funny one-liners and some very hollow quasi-intelligent conversations. <br><br>The only thing worth mentioning about this movie is that it looks absolutely fantastic. The make-up of the apes is magnificent, and the sets and backgrounds are beautiful too. However, this does not distract from the fact that \"Planet of the Apes (2001)\" is a very shallow and simplistic movie, filled with paper-thin characters, stupid dialogue and a nearly non-existent plot. Please Hollywood, stop ruining great movies by turning them into senseless blockbusters.<br><br>Oh yeah, the ending did not make ANY SENSE WHATSOEVER.<br><br>\n* out of **** stars, mainly for the visuals","user":"basrutten","rank":[254,373]}]