[{"title":"An unappreciated and underrated gem","rating":7,"date":"20 September 2009","review":"As a young child, Barry Levinson's 1992 film \"Toys\" was one of my favorite movies. At a young age I was fascinated by such a visually beautiful and surreal world that this mostly forgotten and seldom talked about film portrays. While the story of the film, which you can read about in the other reviews, is not the most well put together or best flowing story ever written, the witty comedy and especially the surrealism of it make up for this. Even Roger Ebert wrote in his review \"Visually one of the most extraordinary films I've seen, a delight for the eyes, a bright new world.\"<br><br>While \"Toys\" was a box office flop and panned by critics, if you ask me, they failed to fully indulge themselves in the power of the film and it's special message about peace, joy, and innocence prevailing over war and evil.<br><br>If you are a fan of Salvador Dali's work or just a fan of surrealism in general, \"Toys\" is the perfect film for you. It's hard to think of another film with such vivid set designs that uses surrealism is such a creative and intelligent way. If you are just looking for a good comedy film to watch you might like \"Toys\" but this film is not for everyone. Approach the film with an open mind and I think you will either \"Get It\" or you won't.","user":"joshwinkler87","rank":[23,24]},{"title":"One of the most underrated movies of all time","rating":10,"date":"15 December 2004","review":"It's hard to think of a movie that divides its audience as deeply as \"Toys\" does. Few people will say this movie is \"fair.\" Instead, people often call it the best movie ever made or the worst... and they mean it! <br><br>Even its severest critics grudgingly admit that it's visually stunning and has perhaps the best soundtrack of the decade (\"Happy Worker\" is a classic, and \"At the Closing of the Year\" is, in my opinion, the best Christmas song written in the past 30 years). It's clearly Oscar-worthy in the categories of music and set design. <br><br>Most people who've seen it agree that Joan Cusack's quirky characterization is wonderful and that the vignettes provided Robin Williams with a springboard for some of the best ad libs of his career. And the story, a whimsical fable of innocence versus corruption, is as unlikely to give offense as any you can name. So, you'd expect the movie's critics to say \"I didn't care for it,\" instead of \"Everyone associated with this movie should be ashamed!\"<br><br>When I like something and others don't, I hesitate to say they don't \"get it,\" but in the case of \"Toys,\" it really is true. It's no coincidence that many visual references to the work of Rene Magritte keep popping up. \"Toys\" is a surrealist movie, and like any work of surrealism, it has a simple veneer over a more sophisticated message, one that defies explanation and works on the level of a dream. This movie is more \"Mulholland Drive\" than \"Willie Wonka.\"<br><br>Whether you will like this movie depends entirely on how your mind works. Poets will probably love it. Engineers will probably hate it.","user":"RingoZeitgeist","rank":[127,172]},{"title":"A Window to Enlightenment","rating":10,"date":"14 October 2012","review":"On the surface I suppose its easy for one to judge this movie as nothing more than an early 90's wacky comedy that lacks depth and meaning. I actually saw this movie in theaters when i was a kid, and quite honestly didn't think that much of it, however, the images always stuck with me for some reason. Watching this film again as an adult, I can honestly say that not only is this a great movie, but it is truly a work of art. To me, this film represents innocence, and what happens when innocence is threatened by forces of destruction. The shots and images in this film are astounding. It feels as If you are staring at a fine abstract painting. The music is well done and only enhances the beautiful imagery. Sure it has its corny parts, but in a way, that's what adds to this film's personality. Overall, this movie will either move you or it wont. If you are someone who only likes big Hollywood movies then you probably wont enjoy this film. If you are an abstract thinker then this may be your cup of tea. Overall, Toys is an acquired taste, however, once acquired you will be staring into a window of enlightenment.","user":"mikefox1983","rank":[27,34]}]