[{"title":"Not As Good As The Original, But Good None The Less","rating":6,"date":"11 November 2009","review":"The crew of \"Wayne's World 2\" had a nearly impossible task of following up the amazingly successful \"Wayne's World\". Needless to say, this does not compare to the original. <br><br>However, this film is pretty good. Myers and Carvey are back with just as much wit and splendid timing as the original. This time they are opposed by the brilliance of Christopher Walken who, as usual, plays his part to a tee. <br><br>The plot of setting up a festival does not have the power of that of the original and I was not crazy with the Jim Morrison character. <br><br>The amount of cameos was a bit too extreme at time as what seemed like every other shot had some other famous person wanting to be part of the film. <br><br>You would think that a film like this would not be as good hearted as it is, but it really is just a good film on so many levels. <br><br>It's not a must see like it's predecessor, but I would still recommend it to anyone.","user":"kylehodgdon","rank":[15,15]},{"title":"How Is This Movie a 6 out of 10!?!?!?!?","rating":9,"date":"27 April 2013","review":"I am shocked to find that this classic movie is so poorly reviewed. This movie is very funny and has fantastic cameos. I know that many people have a real hate on for Mike Meyers which I don't particularly understand. I do think that the Austin Powers Series is overrated but still good. The first Wayne's World is a great movie. The sequel is one of the best comedy movies ever made. If you don't like comedies don't waste your time, that is pretty simple. If you like to laugh give this movie a try. The cameos alone are quite impressive. Couple that with the great writing that reminds me of The Simpsons in the earlier best years they had, and add in great comedic actors and you have a comedy classic that is worth watching.","user":"joerowling","rank":[13,14]},{"title":"It's party time again!","rating":7,"date":"18 November 2003","review":"In 1992 we were given the comedy classic, Wayne's World, it was stupid, immature, and silly, but it's what we needed for a great laugh. Mike Myers comes up with a lot of creative characters and he hit the nail in the head with Wayne Campbell and Garth Algar. After the huge success of Wayne's World, it was pretty obvious that they could go for another round. Unfortunately Wayne's World 2 wasn't as big of a splash as the original, but it still made me laugh so hard. As stupid as it was and some of the jokes were a little recycled, I still had such a great time watching this movie. It's silly and over the top, but how could you not have fun with Wayne and Garth? This is a fun sequel that should be given a fair chance.<br><br>Wayne and Garth are a year older and everything has stayed basically the same, except Wayne has moved out of his parents' house and lives with Garth in an abandoned factory loft in Chicago. Wayne has a dream where he meets Jim Morrison and a weird naked Indian, in which Morrison tells Wayne that his destiny is to organize and put on a big concert. Cassandra, meanwhile, spends a lot of time out of town where she is working with record producer Mr. Big on recording music. Her new producer, Bobby Cahn, slowly tries to seduce her away from Wayne. After Wayne admits that he was spying on her, Cassandra breaks off the relationship and hastily gets engaged to Bobby on the rebound. Garth meets a beautiful woman, Honey Hornee, at the laundromat, and she quickly ropes him in with her charms. Wayne and Garth re-enter Wayne's previous dream and meet Jim Morrison again. They decide to go for one more try and make \"Waynestock\" a success, get Cassandra back, and see if Garth can find real love since his new girl is kinda homicidal.<br><br>Honestly if someone asked me if Wayne's World 2 is worth the watch, I'd definitely say yes. This is always guaranteed a good laugh, just Garth's story alone with Kim Bassinger as Honey Hornee is worth the look. I also love the scene where the guys end up in a gay bar and end up singing \"Y.M.C.A.\" song, I nearly died laughing. Also Christopher Walken is in this movie, what more do you need to watch a movie? Christopher was such a great addition to the characters and made a great villain. It was great to see all the characters back together and this was a fun sequel, so if you need a good laugh, don't hold back, this is a movie that is sure to tickle you're funny bone.<br><br>7/10","user":"Smells_Like_Cheese","rank":[15,18]}]