[{"title":"One of the most unique and daringly good films in years","rating":10,"date":"31 May 2001","review":"Ghost Dog: Way of the Samurai   <br><br>* * * * Stars <br><br>Forest Whitaker stars in this amazingly good character driven film. Whitaker is Ghost Dog, a New York hitman who lives by the code of the ancient samurai. When a job for the mob goes wrong they decide to cut their losses and put a hit out on him. But since he's a samurai and not just a normal hitman this proves to be a huge mistake for them. <br><br>This film really works on three levels. First is the duality of the film's coolness factor and the strength of Whitaker's performance. Whitaker radiates cool in this film. In every scene and every frame, through both action and inaction we know he is being of awesome power. His performance is note perfect. There's one scene where a grievous wrong has been done and we see Whitaker absorb the devastation, then he narrates that when a making decision it should be done in the space of seven breathes. Once that decision is made and we realize Whitaker's full fury will now be unleashed upon his enemies, it sends a tingle up the spine of the viewer. Whitaker's resolve shines through the screen and through his subsequent acting the pace builds until we reach the film's ultimate battle, which is a really, really good fight scene-one of the most satisfying ever filmed.<br><br>Furthermore we have the film's philosophy. This aspect of the film is the most important of all even more so than Whitaker's superb performance. As the film's tale unfolds we do need learn about the Way of the Samurai through the eastern philosophy Whitaker espouses as he narrates the film. Often times the film breaks from the action just to linger on the narration and let in sink in. It's a technique that helps set the tone of the film and makes it a completely absorbing experience. <br><br>The third thing that the film does really well is it is character and not plot driven. At least just as much time is spent following Whitaker through his day to day life as he interacts with people in his community as is spent on the action parts of the plot. In many ways the film works as commentary on the values of modern society. The scenes with Whitaker and his best friend, a Haitian ice cream vendor provide this film with true heart and soul. We see repeatedly that the two friends can understand each other because they are at peace with the world and in tune with their surroundings, so that their bond transcends mere language. Ghost Dog also has a touching relationship with a young girl that he hopes to impart his code to so that she may one day have the tools of knowledge necessary to escape life in the inner city. These are characters that would have been interesting a two-hour film just living their lives without the samurai and hitman aspects of the film. However both aspects work exceptionally well, the effect taken as a whole make this one of the best films of the past few years.<br><br>Besides Whitaker and his friends, one other great performance is given by Tricia Vessey as Louise Vargo, the young girl that sets all that happens in motion. It's a small part but a key one that she does an admirable job with.<br><br>If there is a flaw with this film it is that the gangster villains are unnecessarily racist. These scenes are somewhat jarring on first viewing, but are at least consistent with the film's ultimate tone that the gangster's way of life is dying, while the code of the samurai is timeless. It is no coincidence that all the mobsters are much older than Whitaker. Both characters note numerous times that the world is changing, the difference is the gangsters say it with fear and trepidation, while Whitaker notices it as observation. Like the changing of the wind the changing of time and circumstance is neither good nor bad when weighed against his code.<br><br>While Whitaker deserves infinite praise for his performance, almost just as much praise must be given to director Jim Jarmush. His directing of this film is quite daring and even more skillfull. His approach to the narration is unusual and yet it works on multiple levels and lets us this is a film more about tone than action. The character driven film is a rare commodity. Most films are plot driven moving from point A to point B with no more creativity than a child connecting a dot-to-dot. Here we have a film that starts with its characters and lets them live the lives they've always lived before the central plot elements invaded their existence. The plot is addressed in a timely enough manner, but we see the characters have their own commitments to fulfill too. It's a hard trick to make a character driven film really work without seeming disjointed or slowly paced but Jarmush succeeds masterfully. Jarmush also fills the film with other references in the background that emphasize the character's natures-such as book on bears or the dialogue of a few cartoons here and there. Many films of try to do this, but few films I have ever seen do it as well as Ghost Dog does.<br><br>A final note, the ending of this film that is one that will be very divisive. People will either love it or hate, personally I loved it. It is an ending that is true to all that his come before for both the characters and their conflicting codes but also one that is both surprising despite being adequately foreshadowed.","user":"bmfilmdude","rank":[164,204]},{"title":"a fascinating, strange hybrid of black, Japanese and Italian culture, with a perfectly detached, somber lead in Forrester","rating":9,"date":"9 July 2004","review":"Jim Jarmusch is one of the few filmmakers in Hollywood able to make bodies of work that are challenging, thoughtful, and with a distinctive voice. Like the Coen Brothers, it's hard to make his films accessible to the public like many other films at the cineplexes, and that's part of the joy in watching a film such as Ghost Dog. It's such a strange kind of story, but it's a story that extremely well crafted, even when some of the characters aren't developed enough past a certain point. While I can't really say that it's a great film, there are plenty of great things about it.<br><br>Such as a pulsing, rhythmically engaging soundtrack (I'm not a big fan of rap and hip-hop, but the artists on here are better than expected) with the RZA behind the seat. Delicate, finite cinematography by Robby Mueller (who's other superb collaboration with Jarmusch was on Down By Law). A performance from Forrest Whitaker, as the dedicated, un-hinged-from reality 'samurai' known as Ghost Dog, which ranks among his best and shows in plain sight that he can carry an action film with patience and cool. And the film also carries a fine sense of humor to many scenes - the fact that these gangsters (one of which Dog's boss) watch more cartoons than take care of business is as funny as the way they interact sometimes. While it tends to streak on parody, in the characters there's still the fascinating Jarmusch has in mixing the cultures. <br><br>It's a hard film to classify, for even though it's a martial-arts movie, the only sight of a sword is used for practice and not a blood-bath in Kill Bill. It's a gangster movie, but every five minutes or so there's philosophical notes on the way of the samurai that seems more in place in a (good, thematically engaging) art film than a (good, shoot-em-up) Hollywood actioner. It's a movie about urban-life, yet the only signs of Urbana are shown from a distance, where the only two who will talk to Ghost Dog are a Haitian ice cream guy (who provides a wonderfully weird scene on the roof with Ghost Dog), and a little girl who likes to read. But it's this mixture that can keep a viewer on his or her toes, especially once you realize the psychological state of the lead as much as his spiritual state.<br><br>Parts of the film might turn off one group, but the other parts of the film might keep the same group enthralled. In fact, it's as interesting a comparison to be made to Kill Bill (itself a hybrid) as it is in the spiritual and stylistic parent, Le Samourai by Melville. Like those films, at the least, Jarmusch's film asks to be looked at more than once...Anyway, three cheers for Garry \"Nobody\" Farmer!","user":"Quinoa1984","rank":[94,116]},{"title":"I live by a code","rating":19,"date":"19 November 2004","review":"The movie is about codes of conduct, with 2 main codes that are dying out or are dead.<br><br>One is the code of the Mafia the other is the Samurai.<br><br>The basic plot is this. One of the Mafia wiseguys must be killed as he is having an affair with the daughter of the Mafia Don.<br><br>The person they get to do it is an African American who lives by the code of the Samurai and goes by the name of Ghost Dog. To be honest, I have met many Japanafiles so this is not so unbelievable. <br><br>But the code of the Mafia means that if you kill a wiseguy then you must be killed or the Mafia person who hired him must be killed.<br><br>Jim Jarmusch makes movies where the characters close relations based on only very small things. The Mafia wiseguy saved Ghost Dogs life, so now he must be his retainer. He lives off the land (lives on a roof, steals the cars and equipment he needs to do a job). There is also a friendship between 2 people who don't speak the same language. It is the connection between people that is so important here. <br><br>If you saw Dead man and like it, then you will love Ghost Dog. It is funny, serious, dark, tragic and beautiful all at the same time. Dead man missed the mark with some similar themes (though the DVD of Dead man has some deleted scenes that would have made the movie much better and reflected better the idea of small connections being strong connections).<br><br>I loved this movie, and I don't expect everyone else to. Art house movies have small audiences for this exact reason. I know a lot of people who avoided this movie because they thought it was cheesy. The answer is, yes it is, and most of the bad reviews reflect this same idea.<br><br>Also I love the sound track, with lots of Phat beats, and uses Hip Hop (African American culture) to reflect Japanese culture.","user":"flingebunt","rank":[58,72]}]