[{"title":"One of my all-time favorites.","rating":10,"date":"12 March 2000","review":"This movie doesn't get the credit that it deserves. Travolta's speech at the end of the movie to the doctor is incredible. Rarely do I ever see a movie that acknowledges the value of a single human life like this movie does. Most movies glorify sacrifice. This movie glorifies life. I highly recommend it.","user":"a16a16k","rank":[165,185]},{"title":"An Inspiration!","rating":9,"date":"6 September 2001","review":"An ex-girlfriend talked me into seeing this movie, and I am happy she did. In my opinion, John Travolta deserved at least a nomination for an Oscar here, if not the award itself. The story was decent, but the performances of Travolta, Forest Whitaker, Robert Duvall, and Kyra Sedgwick made me care about what was happening on the screen. By no means is this a romantic comedy. It's romantic, probably the most romantic film I have seen in a long time. The reason for that is simple...it's real. In most movies you see the main characters sleep together within a day at the most, which rarely happens with two people who are really in love. True love has to take time and effort, which is exactly what you see here. Travolta's George is patient, but not because he wants to be. If you're a romantic at heart you will understand and relate to him, and you will hope for his success as you would for your own. Without giving anything away, I will tell you that the ending is sad, but also heartwarming. George has his \"experience\" for no other reason than to suggest what we as humans can become. Phenomenon is a story about our potential, the good and bad things that can happen to us if we achieve it. We could only be so lucky, and watching the movie is a good start. I give it 8 out of 10 stars.","user":"jhazelett72","rank":[91,107]},{"title":"A Phenomenal Experience.","rating":23,"date":"23 June 2004","review":"An ordinary small-town man (John Travolta) sees a flash of light in the sky one night and then starts to experience super-intelligence and telekinesis. Soon he is changing everyone's life for the better (most notably love interest Kyra Sedgwick, town doctor Robert Duvall and best friend Forest Whitaker). Slyly funny and innovative at first and then impressively dramatic and thought-provoking, \"Phenomenon\" is an effective picture that comes through because of good performances across the board and smart screen-writing. Travolta and Duvall are excellent together and they share the spotlight in the venture. Under-rated production that should be given a try. It is one of those films that will cause your emotions to come shining through. 4 stars out of 5.","user":"tfrizzell","rank":[60,70]}]