[{"title":"thought provoking","rating":10,"date":"5 November 1999","review":"Fascinating longitudinal study of the changes in people over time.  My college students were so engrossed several asked to borrow my copy to watch again at home.  Can't wait for \"42 Up\" to come out in video.  I recommend this film for anyone who likes to think about what they've viewed, and anyone interested in the power of class differences.","user":"Ed-90","rank":[12,14]},{"title":"Are they at middle age, now 35 years old??","rating":17,"date":"17 February 2006","review":"In a sense it is remarkable that over the 28 years up to this film, all of the original subjects are still alive.<br><br>I still wonder if way back then, Michael Apted had this great vision for, or if he just stumbled upon, this superb study of human nature and how humans grow up. The whole series has been a fascination for me. Now my public library has the whole DVD series, 6 films on 5 discs, and right now it is in my viewing room. Having seen \"42 UP\" a few years ago, the DVD series has given me the opportunity to see all of them. What a fine series it is. Now I want to see \"49 UP\"!!<br><br>At 35 each of the subjects are well into their lives and it is fascinating to see into how many directions they have gone. And, in a real sense, all of them are successful, when we define success as finding fulfillment in where you are and in what you do. Neil is the only possible exception, but Neil is bright and, although he thinks he may be slowly going mad, he accurately sizes up the whole mad world around all of us. So, from my point of view, even Neil is successful.","user":"TxMike","rank":[9,12]},{"title":"Carry on \"Up!\"","rating":9,"date":"2 August 1999","review":"This was the first of the UP series that has since led onto 42 UP. for anybody who doesn't know, the series was created to document childrens attitudes and behaviour over the years. The first was entitled 7 Up (the children were 7) and ever since, every seven years the film makers return into the peoples lives to see what has changed since the last film.<br><br>The combination of the series of films from the past is interesting. We are shown what the subjects had to say seven years ago (i.e. their hopes and dreams, expectations for the future) and we actually see if the carried out those actions. One of the highlights is a section where we are shown footage from the original 7 Up, where the children were allowed to play in an adventure playground. And after seeing the lifestyle of a builder for example we are shown footage of him building a playhouse, etc.<br><br>I watched an interview of the film maker shortly after seeing 35 Up, in which he admitted that 35 Up seemed to have a very down, gloomy feeling to it. A lot of the \"subjects\" were at a stage in their lives when their parents were dying and various challenges were facing them.<br><br>The part of the movie that people can really sink their teeth into is one of the \"subjects\" who's life has taken an extremely interesting path. He developed (possibly because of his involvement in the Up series?) a number of personality disorders, and has found it difficult to lead normal life.<br><br>\nThe film 28 Up saw him homeless and hiking his way across Britain. 35 Up sees him in a small abode, with a job, but still having difficulties in functioning normally.<br><br>The entire series is an extremely interesting project, that the subjects are lucky to have been involved in. The viewers find themselves helplessly drawn to the people and we actually start to care about what happens to them.<br><br>35 Up though is of particular interest, for this movie sets up the crossroads that most of them are undertaking. The future of the series looks like it will be extremely healthy.","user":"Snap Dad","rank":[13,19]}]