[{"title":"Fantastic, a true piece of art","rating":10,"date":"14 July 2004","review":"\"Babe\" is one of my favorite movies.<br><br>A lot of people laugh at me when I say that. But I know that this film is one of the best ones ever made. It's simple, beautiful, positive and original.<br><br>The story is about a farm pig who wants to become a sheep dog. Pretty strange considering a pig's place is in people's plates. But Babe has something the sheep dogs don't have: gallantry. His kindness, determination and good intentions will make him a truly unique individual, one that stands out from his peers, proving that no matter who you are, you can make a difference.<br><br>I love the way the story is made. It is cut into chapters with a bit of narration, giving us the warm \"grandfather story\" or \"old school\" feeling. It's a very comfortable ambiance, and every animal brings its personality into making an awesome story.<br><br>Now I am sure you've all seen talking animal movies before, with voice-overs. Babe took it one step further with the animals' lips being in sync with their lines! Talk about realism! The sets are very friendly to the eyes and contribute into making this movie a classic.<br><br>Babe is one great movie for everyone to see, it's magical and enchanting!<br><br>The Master T Score: ***** out of 5 Stars","user":"Bobino-2","rank":[114,121]},{"title":"An astounding film","rating":17,"date":"17 December 2003","review":"I was dragged to this film by my girlfriend (now wife) when it first came out in fall of 1995. I had zero interest in what seemed to me nothing more than a kids movie. I recall sitting in the theater before the movie commenced, looking at my watch and estimating the time it would end, when my life could begin again after this rude 90 minute interruption.<br><br>Then the film began. The moment Babe said a tearful goodbye to his mother as she was being led off to the slaughter house (\"Pig Paradise\", the narrator says), I was hooked. What stood out to me was not the tearful \"Goodbye Mom\", but the fact that after we see Babe's mom loaded into the truck, the camera goes back to Babe, siting in the corner of his industrial pen, sobbing profusely. This moment, maybe 90 seconds into the movie, is filmed so well, so perfect, that instead of coming off as melodramatic, it is heartrending. I know that word is used often to describe this film, but I do not know how else to describe it. This is one of many \"heartrending\" moments in this beautiful film.<br><br>This is by far the best childrens film I have ever seen, but it really is a mistake to even call it a childrens film. It is simply a great film. A film that shows how wondrous things can happen as a result of common decency; how any individual can triumph if they believe in themselves; how vital is the help of family and friends in life's arduous journey.<br><br>This a film not to be missed. It should have beaten Braveheart.","user":"ChristopherRice","rank":[145,156]},{"title":"Family Classic","rating":8,"date":"26 August 2007","review":"This is a family film in the classic sense of the word, and it'd be hard to find a more charming and heartfelt tale. Ideally for children, but it can be enjoyed by adults too. It is a fantasy world where animals speak just like humans do.....albeit not in Australian accents, which is where the film is meant to be set.<br><br>The hero of this tale is a young pig named Babe, who is transfered from the pig pen, to the village fête, to the hands of Farmer Hoggett who wins the little fellow in a prize raffle(James Cromwell). It is on the farm he meets the locals, and is taken under the wing by a kind sheepdog named Fly, who has been characterised as the warm and motherly type. Not so warm is Rex (voiced by Hugo Weaving of Agent Smith fame), her growling no nonsense other half, who believes pigs do not belong with sheepdogs.<br><br>Babe is portrayed as the personification of innocence, and his gleeful and inquisitive nature brings him into contact with a host of farmyard animals. Not too sure why they felt he needed a furry little toupee between his ears, but each to his own. As Babe gets closer to Fly and the sheepdog role, he even begins to assume this role, much to Rex's dismay. But Babe has an awful lot of ambition for a little animal, and his heart is set on being a \"sheep-pig\".<br><br>There are moments of sadness in this film, such as loss and death, but it is mainly sweet natured and enchanting. It is one of the few Universal rated films I enjoy watching, and that is saying something for me!","user":"Jakethemuss","rank":[35,36]}]