[{"title":"A surprisingly fun and gooey b-movie flick!","rating":8,"date":"15 June 2005","review":"If you are in the mood for a fun horror movie that doesn't take itself too seriously and has all the right gross out gimmicks- check it out. If it wasn't for a friend mentioning this movie title I would have passed it up. But I trusted his judgment since he is a horror aficionado- and I read some decent reviews in some of my old issues of Fangoria/Gore Zone.<br><br>The acting is silly, but it is obvious that this is the way it was written. The key difference between a movie like Ticks (Infested) and some really bad Sci-Fi Channel movie is that everything is done in the Evil Dead 2/ Bad Taste slap stick kind of way. And they go for the gross out money shots in every other scene (lots of pulsating blistering skin waiting to explode, etc). And thank God this didn't have any of the cheesy computer animated gore and FX. I love the latex, goo, and prosthetic body parts of the old school- even if it does look fake. At least you know the actors are actually interacting with it rather then a \"green screen\".<br><br>So, gather a few friends, kick back a few beers or Mountain Dews, and be prepared to rewind a few scenes so you can watch them again!","user":"ericdetrick2002","rank":[19,21]},{"title":"T&A (Good Ticks and Great Actors)","rating":5,"date":"5 March 2000","review":"This movie was pretty good, but the cast is classic! Seth Green, Ami Dolenz, and Alfonso Ribeiro. I bet Panic looks familiar, yeah that's because he's Carlton on Fresh Prince of Bel-Air. And the icing on the cake is Clint Howard. What an actor. He makes another great appearance in this film as a marahuana farmers.<br><br>This movie is not too bad, but definitely entertaining. You'll love Ribeiro's character, especially since he is a hardcore inner city kid. This total contrast to Carlton make nearly everything he says a joke.<br><br>\nIf you're looking for a movie with a funny cast, check this movie out. What a sidetracker for a lot of these people's careers. Classic!","user":"joehed","rank":[15,17]},{"title":"Lean and mean","rating":8,"date":"14 May 1999","review":"I don't really understand the criticism about this film ; maybe if it had a 50 millions $ budget, everybody would find it \"cool\"? Tony Randel did his best and the movie still boasts good production value despite the numerous troubles they had on the set. This one's mean, politically incorrect (no \"back-to-the-nature\" crap) and without the shoddy humour and cute one-liners everybody seems obliged to include in his horror just because Freddy said so (c.f. \"Nightwatchers\"). I saw it three times with friends who enjoyed it as much as I did. And I don't care if some of the actors ended up in some moronic TV fodder for brainwashed teenagers. Not a great movie (unlike Brian Yuzna's \"Return of the living dead 3\"), but strong, however.","user":"Phroggy","rank":[17,24]}]