[{"title":"What professional football is really like...","rating":8,"date":"9 October 2005","review":"Tony D'Amato(Al Pacino) is the head coach of the Miami Sharks who are owned by the Christina Pagniacci(Cameron Diaz) who is using the Miami Franchise only for profit. Trouble stirs up after long time star quarterback Cap Rooney(Dennis Quaid)is injured along with his back up bringing in third string quarterback Willie Beamen(Jamie Foxx) who becomes the face of the franchise after having great game after great game. The only problem is that he plays only with his head and not with his heart, with an aging team that needs an emotional leader to guide them to victory. Also Starring: James Woods, Matthew Modine, LL Cool J, Bill Bellemy, Lawrence Taylor, Charelton Heston, Aaron Eckhart, and John C. McGinley.<br><br>In a cinema that rarely produces pro football movies, this is the cream of the crop. It captures the reality along with the heroic story of a nobody rising to the top. The movie is humorous, dramatic, and a thriller for all sports fans.<br><br>This is not only one of Oliver Stone's best films but this is also the start of Jamie Foxx's \"good\" acting career. Forget what the critics said about Collateral or Ray being the beginning for Jamie Foxx. It was Any Given Sunday. Willie Beaman is a complex character and Foxx nailed the part. He was magnificent. He played the part to perfection and out shined the great Al Pacino. The supporting cast was also incredible with great performances from Cameron Diaz, LL Cool J, James Woods, and surprisingly John C. McGinley. It is very rare to find a great dramatic football movie but this is definitely one those small few.<br><br>Overall, this is one of the greatest sports movies of all time and it is highly enjoyable for adult audiences.<br><br>I highly recommend this movie.","user":"SeminolePhenom","rank":[84,113]},{"title":"Very Underrated and Well Overlooked","rating":10,"date":"22 November 2007","review":"It seems that many people dislike this movie and I can see why. First of all it shows that professional athletes are far away from being perfect. A lot farther than we would like to believe. The movie shows that many athletes as we know are just out their for the money. It also shows the corruption in the owners and politicians. But for me, all of this is good thing. I like seeing a movie that does not include glory in sports.<br><br>Another aspect of the movie was the cast. I thought the cast that was put together was very well put together. I was especially surprised at the performance of Cameron Diaz. I thought she played very well as the viscous and corrupt owner. Specifically in the part were she black-mails the mayor into giving the team money for a new stadium. Jamie Foxx also gave a very well played performance as the new upcoming quarterback. His role shows that he has become sick with fame and fortune and has seem to forgotten who helped to reach his superstar status. For example when he ignores most of the plays called in and decides to run the game the way he wants to. He reaches as point were he just flat out ignores everyone. For example he says: \"I'm trying to win coach. I ain't trying to disrespect nobody, but winning is the only thing I respect.\" I think Oliver Stone shows that this is the problem we have in our society, that everything is about winning. His relationship falls apart with his girlfriend and seems to believe that their is nothing that could stop him. He almost reaches a point were he believes he is like a god. But, he realizes he needs a wakeup call or he will end up like the some of the people around him. I liked the way Dennis Quaid played as the long time starting quarterback who nearly becomes paralyzed. Now my initial reaction after he got hit was that his family would want him to immediately retire. What happened was the opposite, his wife wanted him to risk being paralyzed and brain damage so he can get one more contract although Dennis Quaid was trying to explain to her that he is worried about what might happen to himself. Or one of the confrontations between wife and husband when he mentions to her that they should put the kids to bed and the wife responds by saying:\"Why can't we hire a maid?\" This also adds on to Jamie Foxx's role and shows that the players are pressurized by their families towards good decisions and bad decisions and that the families have also lost touch with what is important in life. As well with Lawrence Taylor's role which shows the player-doctor relationship and the role that age and lack of education forcing players to push themselves over the limit for that last bonus, knowing after they retire they may not survive in the real world. LL Cool J's role as the star running-back shows that he no longer cares about the team or the game itself and feels threatened by Jamie Foxx because he has brought a new style of playing to the team and they tend to not agree with each other but above all with this new style of play may not let him reach a certain amount of rushing yards to reach his bonus. Again Jamie Foxx comes into this part of the movie at the end when he hurts his arm but does not tell anyone worried what might happen to his career. I think overall this show that their is too much emphasis in sports and I'm saying this even though I'am a big sports fan.<br><br>A very interesting part of the movie is the Al Pacino's role as the head coach. His ongoing fighting with Cameron Diaz shows the relationship between owner and coach. The coach wants to win games and have control of the team but the owner wants the money, the power and the credit for building a team. Pacino has fallen into a slump and doesn't like the ways are looking for the future of the his job and the sport. For example when he says: \"It's TV, it changed everything, changed the way we think forever. I mean the first time they stopped the game to cut away to some commercial that was the end of it. Because it was our concentration that mattered, not theirs, not some fruitcake selling cereal.\" He believes the game no matters any more it is the money and this is what I believe is the main point of the movie. It is no longer the game that matters it is the people who put the money into it and this is what has been or what will be the downfall of sports or really anything.<br><br>I think that a good message through all these downfalls is that if you stick together and focus on your goal you will succeed no matter how big the obstacle, hence the title \"Any Given Sunday\".","user":"alexkolokotronis","rank":[39,51]},{"title":"Sports in its most brutal moments","rating":7,"date":"15 May 2002","review":"Wild and outrageous, Any Given Sunday gives the viewer a glimpse into an athletic world not too far from the real thing. While some of the scenes were a little too over the top, it proved to be a very enjoyable experience. As a major football fan, I was disappointed in the fact the NFL did not allow Stone to use their logos and stadiums. Oh well, I seemed to enjoy the fictional league even better, even if some of the team uniforms were a dreadful. Jamie Fox portrayed Willie Beamon perfectly, epitomizing the selfish athlete with a cultured ease. While the speed of Beamon's rise proved to be a little too quick, the message in the rise and fall of stardom was more poignant than anything.","user":"Agent10","rank":[26,35]}]