[{"title":"One of the best action movies of the decade; Ford and Jones are in top form.","rating":10,"date":"26 June 1999","review":"Nothing is more thrilling to see than two characters with superior intelligences, pitting their wits against each other. A thriller does not require a great deal of plot or techno-babble to be involving or complex, although many distributors of blockbusters today seem to think so. For these reasons, \"The Fugitive\" is a huge blessing for a movie critic such as I. I was just thrilled by the excitement, the performances by Harrison Ford and Tommy Lee Jones, and the whole Hitchcockian aura that this sensational film delivered. Even though we have been seeing too many films based on television series come out lately, \"The Fugitive\" is certainly not one of those that we can add to that routine bushel.<br><br>Ford is Dr. Richard Kimble, a vascular surgeon who is wrongfully accused for the brutal murder of his wife (Sela Ward), and therefore sentenced to be executed. After escaping from a bus crash/trash collision, he finds himself running from the Chicago police and especially the U.S. Marshall service, led by Lt. Gerard (Oscar-winner Tommy Lee Jones). At the same time, Kimble attempts to prove his innocence and in turn discover who did kill his wife. What ensues is a tangled web of medical conspiracies, along with a search for a notorious \"one-armed man.\" As I have stated, this is a simple plot that requires no superficial decoration.<br><br>Ford, who has always been a less dramatic presence in movies and more of a subtle but affected persona, fits the part of Kimble perfectly. With this role, the last thing required is a melodramatic actor that sticks out like a sore thumb. Ford casually settles into the role of the man on the run, bringing intelligence and style to a less ostentatious character. Jones, who has never really been considered a headliner until now, creates a character that is extremely humorous but also calmly diligent. His only goal is to carry out the task he is assigned to, and nothing will stand in his way, least of all a rivaling police force or Richard Kimble himself. One of the fascinating Hitchcockian elements of the film is how it allows its audience to not be able to take sides. We are constantly rooting for both Ford and Jones when either of them come into perspective. We familiarize with both of them and are amused by both equally. The film's finale, which I won't dare give away, satisfies both sides of this rooting coin.<br><br>I have not previously been a fan of the director Andrew Davis's work, but with this entry, he certainly has sparked my interest. With such films as \"Under Siege,\" \"Code of Silence,\" and \"Above the Law,\" he has been able to work with action stars that are both larger than life (Seagal, Norris). Here, he uses more intrigue and atmosphere to reach his audience, building suspense and excitement through simple film tools rather than things blowing up or guns going off (However, there is a phenomenal opening crash scene to boot). With quick pacing, a never-a-dull-moment storyline, and great actors, \"The Fugitive\" ranks itself as one of the best action films of this decade, and definitely one of the best films of 1993. Rating: Four stars.","user":"movieman9","rank":[140,154]},{"title":"Good acting and directing, constant action and tension. Even after many years this movie still stands","rating":9,"date":"26 December 2004","review":"\"The Fugitive\" is one of those movies that you may already have seen a dozen of times, but which still seems to surprise every time that you watch it. I don't know what it actually is that makes this movie so good, but it sure works. It's probably the combination of a good script, good acting and the abundance of action that's always present, but never exaggerated.<br><br>The movie is about a doctor who's wife has been murdered by a one-armed man. He's innocent but is accused of the murder and convicted by court. He will get a lethal injection soon, but as he is transfered to another jail, the bus in which he is transported with some other inmates, crashes. He knows to escape and is determined to find his wife's murderer, but has to try to stay out of the hands of the police. The result is an interesting cat-and-mouse game between him and the police that never allows your attention to fade away.<br><br>The story is perhaps not exceptional, but thanks to the good directing and acting and the constant action and tension, this movie really delivers everything that you can expect from it. I give it an 8.5 - 9/10.","user":"philip_vanderveken","rank":[97,107]},{"title":"One of the Great Thrillers!","rating":10,"date":"10 September 2003","review":"There is a kind of magic when a superb cast, a truly gifted director, and a literate script with equal parts 'over-the-top' action, riveting suspense, and rich characterization, come together. The end result attains a luster that only grows through the years, as new audiences, through DVD and VHS, experience the same excitement we felt, viewing it on a theater screen. In the last decade, only a handful of suspense films could be called 'great'...and on top of the list is THE FUGITIVE.<br><br>Based on the popular David Janssen TV series, the film faithfully follows the same premise; a doctor is accused of his wife's death, but escapes before his execution, and tracks down the 'one-armed man' responsible for the murder, as a driven law officer attempts to recapture him. Being a big-budget film, however, the scale of everything is expanded...Dr. Richard Kimble is now a brilliant vascular surgeon, at a major Chicago hospital; the handicapped killer is a dirty ex-cop working on orders from crooked board members of a billion-dollar pharmaceutical firm; and the lawman is no longer a solitary police lieutenant, but a deputy United States Marshal, and his team of agents! While some fans of the original series complained that the 'intimacy' the series had was lost, director Andrew Davis only used the 'bigger' aspects as plot elements, placing the focus, wisely, on the dual stories of Kimble's search, and Gerard's pursuit.<br><br>Despite the esteem the film has achieved over the years, Harrison Ford has gotten a bad rap for his very understated performance as Richard Kimble. While Tommy Lee Jones certainly had a far flashier role (earning him an Oscar as 'Best Supporting Actor'), Ford's intent wasn't to play 'Indiana Jones', but a man whose whole life was dedicated to his career as a surgeon, and his wife (played, in flashbacks, by the lovely Sela Ward). Seeing his wife brutally murdered devastated him (his scene in the police interrogation room, going to pieces, was largely improvised on the set, and displays some of his finest acting). His search for the killer was not the confident quest of an action hero, but based on uncertain, spur-of-the-moment decisions made by a desperate man, whose medical background was his only tool. Fear does not lend itself to flashy theatrics...<br><br>Jones, as Marshal Sam Gerard, on the other hand, was a seasoned veteran, the best at what he did, and pursuing a fugitive was 'old hat' for him. With a confidence bordering on arrogance, he ordered people about like chess pieces, multi-tasked without breaking a sweat, and still could charm with a wicked smile and sarcastic remark. Of COURSE he wins the audience's heart!<br><br>Featuring some of the most spectacular action scenes ever recorded on film (the train/bus wreck that frees Kimble, the dive off a dam into the churning maelstrom of the reservoir), as well as two slam-bang fistfights when Kimble finally gets 'justice', THE FUGITIVE still is remembered primarily for the suspenseful Jones/Ford 'cat-and-mouse' chase, cross-country, and the grudging respect that grows between them...which, ultimately, was what the TV series was best remembered for, as well.<br><br>There is magic, here!","user":"cariart","rank":[100,111]}]