[{"title":"Brilliant","rating":31,"date":"31 August 2004","review":"I'm only sorry that the director didn't make more feature-length films. I absolutely loved this. The plot is well laid out - it explores the reminiscences of a daughter who is coming to terms with her mother's death. The acting is first rate, particularly from the two female leads. It is thought-provoking in a very British way which is unfortunately lacking in many emerging UK films. The film incorporates lingering shots of scenery in Edinburgh and Orkney. It is careful and measured but in a way that, for me, does not detract from the pace of the film.<br><br>It certainly takes a mature outlook and some patience to enjoy the film. Perhaps it is one that you either love or hate.","user":"kmd2uk2001","rank":[9,9]},{"title":"A study of three generations in Edinburgh and Orkney","rating":9,"date":"6 August 2001","review":"The film deals with relationships between three generations in Edinburgh and Orkney.  It is partly about the familiar problem of trying to reconstruct what people thought when it is too late to ask them.  Much of the film is presented in a matter of fact way, but some of the issues left open will make you think about them long after you have seen the film.<br><br>The main professional actors in the cast have enjoyed active careers in theatre, radio and television in the UK.  The Orkney photography and characters, probably played by local people, are sufficient reasons in themselves to see the film.  If you do not know the director Margaret Tait, try to guess her biography from the film.<br><br>It is only the lack of comments from other people that has made me write about a film I have seen only twice, most recently about two years ago in Edinburgh.  Some of the audience applauded at the end, which does not happen often here.  Perhaps they were visitors being polite about the Edinburgh setting.  This may not be a great film, but it is a good film with several images I shall always remember.  I have not gone near a sea-cave since.","user":"michaelromer2000","rank":[8,8]},{"title":"A strange, somewhat banal picture","rating":4,"date":"22 August 2018","review":"The only feature film to be directed by Margaret Tait, made when she was in her seventies, is this memory piece that looks at the lives of three generations of Scottish women. It's a demanding, non-narrative picture as much concerned with buildings, props and landscapes as it is with people. Indeed, with the exception of the superb Gerda Stevenson, the rest of the cast act in a blank, one-dimensional fashion. Tait obviusly had no real experience of working with actors and her dialogue is largely banal. It is the look of the film that matters and even that is largely banal, too. Tait photographs everyday objects with an almost fetishistic glee. It might have been a better film had she dispensed with dialogue altogether. Apart from the odd art-house screening at the time of its (very limited) release it hasn't been much seen and has now built up something of an (undeserved) cult reputation.","user":"MOscarbradley","rank":[4,7]}]