[{"title":"Wonderful movie, worth re-watching...","rating":10,"date":"22 May 2006","review":"I watched Immaculate Conception back in 1993 and always placed it amongst one of the best - possibly because it depicted some true facts about shrines and life in general in Pakistan, something I had no inkling about. Nevertheless, life behind religious shrines as brought about in the movie gives the viewer an aspect of life that has not gained public knowledge.<br><br>Sixteen years later, I watched the movie again - difficult as it was to find it in the first place! But once again, my views on this movie remain the same. Award winning performances by Zia Mohuidin and his entourage.<br><br>A must watch!","user":"rajiv-sethi","rank":[17,25]},{"title":"3/5 - Average","rating":7,"date":"4 June 2002","review":"&gt; MAY CONTAIN SPOILERS!<br><br>Hannah, the daughter of a US senator follows her British lover James to Pakistan and discovers a group of enuchs whose esoterical practises may help her become pregnant. As she becomes more and more immersed in their eastern philosophies, James cheats on her with a rich Pakistani woman, and her brother comes over from America to stop the scandal she is creating.<br><br>Besides being a look into the politics and culture of Pakistan anno 1990, IC is also a film that explores, or attempts to, the meaning of faith. This fails, however, as the 'poor little rich girl in a foreign land' played by Melissa Leo is unsympathetic and does not establish the link with the audience that is needed to make such a film work. It is thus left for a flamboyantly gay antiquarian (the late James Cossins) and Kamal (Ronny Jhutti), the only true male in the enuch shrine, as well as the only truly sympathetic character, to add some much-needed spice. That is not to say this indie film is not worth watching. In particular, the intricacies of the enuch shrine make it interesting enough to sit through. One moment to watch: Hannah and Kamal visit a cinema, in which they see a Pakistani version of The Godfather!<br><br>Rating: 3/5","user":"mishadeclercq","rank":[5,8]},{"title":"Not About the Virgin Mary","rating":8,"date":"16 August 2017","review":"This is an unusual and intriguing study of a woman's desperation to have a child, set against the background of Pakistan.<br><br>Stiff upper lip Brit James Wilby plays an employee of the World Wildlife Organization who's married to blonde American senator's daughter Hannah (Melissa Leo). The pair, despite several efforts, are increasingly frustrated in their attempts to have a child, and partly out of curiosity, partly out of desperation, Hannah explores possible \"folk\" remedies to her problem.<br><br>Her photographer friend Shamira introduces he to a shrine run by eunuchs which claims to cure infertility. Hannah is encouraged to bring her husband for the weekend. James reluctantly agrees and to their delight she becomes pregnant shortly after. But the sect decides to stake an unwelcome claim on Hannah's child, especially when it is revealed how the \"miracle\" took place.<br><br>Although it takes an unconscionable time to get going, this is a new approach to a timeless theme. The cinematography and use of Karachi locations are breathtaking, and the screenplay audaciously tackles issues of racism and interracial sex.<br><br>Wilby is convincing as the harassed environmentalist observing helplessly as a nightmarish scenario unravels around him, while Melissa Leo is as attractive as fearless playing the fatally flawed Hannah encumbered by her maternal desires.<br><br>A tat too long, but worth the time.","user":"dariuslanghoff","rank":[2,3]}]