[{"title":"Solidly enjoyable anthology effort","rating":8,"date":"28 January 2019","review":"An unrelated series of segments detailing the torture and oppression carried out against women in Feudal Japan.<br><br>The Good Stor(ies): Story 1-After being smitten with a strange man, a woman agrees to help him with his debt to a local mobster by making extra money as a geisha worker. When she realizes that he's been playing with her emotions as well as working in a rather limited capacity, they find their lives changed forever. This straightforward piece offers a rather intriguing start this one. The opening half, detailing Oito falling into Hanji's trap and becoming romantically linked together before realizing what's going on, offers an incredibly dream-like poetic lyricism with their tender relationship taking on a deeply haunting quality. While the exploitation angle is just as artistic, the scenes in the brothel offer a straightforward view of the geisha society she's been sold into which offers lingering views of the topless chicken fighting, the attempt to strip her naked to show off her and the various scenes of the girls taking their clients to bed. This part of the segment works nicely, but the sudden turn into torture a comeuppance at the end is incredibly awkward and doesn't really feel earned, coming across as a series of violent acts without purpose as it just erupts into the segment and then disappears. Still, there's plenty to like here.<br><br>Story 2-After hearing of a strange individual, a man goes in search of a famous woman nearby who claims to have the fetish of being attracted to men with grossly abnormal bodies. As he witnesses firsthand what's happening to her, her husband tries to set himself right in his wife's eyes. This segment was enjoyable if you're willing to go along with it. That all comes from the brazenly bizarre imagery and psychosexual fantasies at play here, which were much more apparent in this segment as we see what's going on in her mind. From being pawed at by dwarfen circus performers to riding her husband around like a horse and having a man with obscenely hairy legs sleep with her. That this is all displayed in grand fashion through a flashback detailing her abduction as a young woman and being repeatedly sexually degraded by a freakish person with burnt skin before being rescued gives us a truly deranged glimpse into her psyche which comes full circle once the finale comes in and we see the true extent of the impact the activities had on him as these final scenes pack a true punch as it's filled with the best gore and most nudity of the entire series.<br><br>The Bad Stor(ies): Story 3-Held captive in a lord's courtyard, a woman begins to form a savage and bizarre bond to him through his penchant for bondage games and sadistic tendencies. When their interactions inspire the wrath of a former hostess of the lord, she reveals plenty of troubling facts that put them in danger. There was quite a lot to like in this segment. The fact that it's the most overt exploitation ready of the stories comes into no doubt with the opening segment featuring a woman being abducted by a horse-bound riding, ensnared with a rope and dragged away through the countryside while other riders chase off after him as she gets carried off to her death. It's then equally matched by a wild and frenzied sequence of red kimono-wearing geisha's being stalked by a swarm of bulls with their horns lit on fire, emerging as a truly captivating piece with the chaotic animals charging at the fleeing girls who strip to avoid being punctured although not everyone does, making for a special dash of red to help things along. Although it stops from there in order to go for a plot-driven series of feudal intrigue, the scenes of the girl covered in gold body-paint offer some rather memorable moments. The advent of the revelation that comes about due to the later game being played where she enacts her revenge sets up the greatest part of the segment with the comically-fake but no less graphic C-section performed which are impactful mainly for the idea behind it more than anything. However, this does end on a whimper makes for a rather bizarre offering.<br><br>Rated Unrated/R: Continuous Nudity, Graphic Violence.","user":"kannibalcorpsegrinder","rank":[2,2]},{"title":"SEXUAL EXPLOITS IN JAPAN","rating":7,"date":"6 December 2018","review":"Trying to decide what to title my review of this film was difficult. The film is not a pornographic feature but at the same time contains moments what would qualify to place it in that category, if on the tamest side. At the same time I don't think I would consider the film a straightforward drama. It has dramatic elements but not solely. Then there is the criminal elements of the stories here. All of these combine to make an interesting yet at times disturbing film. Considering that it was made in 1969 can be stunning when one thinks of the self-censorship seen in this country. How it was able to play here would be interesting to read about.<br><br>The film takes place in the past, an anthology film with three separate stories woven around a central character, a doctor who is witness to each one. The first involves a young woman who owes a group of thugs money. When they tell her they will take it out on her physically she is rescued by a young man. What she doesn't realize is that he is working with these thugs. He romances her and then gives her a sob story of owing money and forcing her to work as a prostitute. But things go from bad to worse for our heroine.<br><br>The second story involves a woman with an incredibly strange fetish. She is only aroused by deformed or scarred men. While not letting the rest of the world know of her secret she has her servant procure men for her. He watches distastefully, in love with his mistress but unable to provide for her in his own appearance that which she seeks. Unless he can do something to change that.<br><br>The third story involves a cruel and vicious master of a household whose taste run the strangest of the three stories. He begins by having a group of women clad in red dresses perform in the central area of his home but then release bulls into their midst with horns aflame. The bulls attack and gore the women with the exception of one who discards her clothing to eliminate the red that attracts the bulls. This fascinates the man who takes her on as his lover. But there is more to be learned from these events that only come alive as the segment ends.<br><br>The film features what is considered more normal fetishes in today's world like bondage, sadomasochism and nudity that seems a bit much for a film made that in year. But strangely enough director Teruo Ishii shoots the film with an artistic eye that moves it up a notch from sheer exploitation to another level. Scenes are done with style and panache that one would not expect in a film like this. An example is in the first segment when the young con man chases the woman in question with romance on his mind in a field of tapestries laid out for them to run around.<br><br>Some have called the movie a cult film and I would have to agree. It offers all of the things cult films seem to contain plenty of from nudity to fetishes to subversive storytelling. It may not be a movie that many will enjoy but those who seek out the grindhouse style feature or who are interested in the movies that have made their way to our shores from Japan will want to make sure and look for this one.<br><br>Arrow Video. I know you're tired of me singing their praises but too bad because they deserve it. The picture here looks clean and clear with a sharp eye for color to be enjoyed in high definition. Extras this time are limited but worthwhile, including THE ORGIES OF ISHII an exclusive newly filmed interview with author Patrick Maccias, the theatrical trailer, a reversible sleeve featuring original and newly commissioned artwork by Matt Griffin and for the first pressing only an illustrated collector's booklet with new writing on the film by author Tom Mes.","user":"kirbylee70-599-526179","rank":[2,2]}]