[{"title":"Great!!!!!! Stupid looking cover though!","rating":8,"date":"10 December 2005","review":"stars: Shelly Duvall and Margot Kidder.<br><br>This is so good. It's a kids horror movie about a doll that a kid buys that bears a small resemblance to his teacher. Soon it starts looking more and more like her, and when the doll falls, the teacher falls, like voodoo. The doll is really funny and the doll and teacher are played and voiced by Shelly Duvall. It seems like they were trying to imitate Tales from the Crypt, because it starts off in a school. The bell rings and the kids go to their classes and a bandaged up Grim Reaper comes down the halls in to a strange room and tells the tale. This was so cool, and even the ending was fresh. I highly recommend it! my rating-B plus. 87 mins. PG for some blood and mild language.","user":"TOMNEL","rank":[8,10]},{"title":"best movie ever made","rating":10,"date":"7 January 2001","review":"This is the best movie ever made!!!!!!!!  The doll is hilarious when she says anything from, \"Ouch!\" to \"Traitor!\" to \"eeeeeeeek shoulda used a ladder!!!\" to \"when you lie you pay.\"  Geneva is also a great touch with her librarian Sol.  They are both like hippies and say things like \"snatch your soul and take control\" to \"nighttime-in graveyards!\" to \"whats up little brother!\" to \"that's cool\" and \"the place near waaater\" and do things like scurry over to $14.95 jewelry or rolling over their eyes saying \"real trouble.\"  The doll smashes forks and plays cards.  She has little legs that walk and says, \"Ohhhh.\"  The little sister named Annabel says things like, \"don't you ever knock\" \"where's my milk?!?\" and \"oh what it walked.\"  If you ever see this movie buy it.  My friend and I are even buying the versions that are in spanish.  This movie has changed my life forever.  It is so funny and on a scale out of ten it is about a 157,943,474,917,323,865,345,999.99 I love this movie sooooooo much.  vote for it and give it a ten!!!!!!!!!!!!!!!!!!","user":"matt_34812","rank":[10,24]},{"title":"Kiddie horror done on the cheap","rating":5,"date":"31 December 2019","review":"Kiddie horror? Well, if there is such a movie genre this movie would be a good example. We watched this with the kids for family movie night. I can't say I was very impressed, although the youngest of the kids were riveted to the screen. The older ones got bored halfway through and out came the iPads. I know how they felt. This movie boasts some pretty lame acting, even from well known actors like Shelley Duvall and especially from Margot Kidder. John Neville's turn as the mysterious shopkeeper was a treat though. The special effects were pretty rudimentary and the animatronics or puppetry or whatever it was that brought the doll to 'life' were very amateurish. I suppose these days they would use CGI, although I don't think this movie would have warranted the trouble or expense. To top it off, the movie becomes quite mawkish in the last 15 minutes, as it moves towards its quite predictable ending.<br><br>I'd like to be able to recommend this film but I really can't. I didn't hate it, but I didn't love it. It's too silly for tweens and older and while younger kids may be engrossed, I'm not too sure that they should be introduced to voodoo, dark magic and questionable behavior standards (e.g. the doll states that it is empowered by the main character's HATE for his teacher) at their age as a form of entertainment.","user":"CabbageCustard","rank":[1,1]}]