[{"title":"A good, heart-warming movie","rating":9,"date":"3 January 2003","review":"Flipper is a good movie that you can just sit down and watch with the little ones without having to worry about shielding their eyes at any point during it.  Sure it's a bit cheesey at times and the writing is not on scale with an actor of Elijah Wood's caliber, but it is an entertaining film to watch and it's nice to see him playing a somewhat normal teenager.  His character Sandy does lean towards the overly obnoxious side of things in the beginning though.  So much so that you know if you were in the uncle's place, you'd take him out for a midnight ocean ride and not return with him.","user":"Ten13Grl","rank":[12,13]},{"title":"Fun and heartwarming fare with everyone's favourite dolphin","rating":7,"date":"6 June 2006","review":"I was rather appalled to see the low rating this movie received here, personally considering it fun family fare. It revolves around a young teenager, Sandy Ricks, who is sent by his mom to Coral Key to spend the summer with his Uncle Porter. While there he befriends a dolphin named Flipper. Lots of adventures ensue amid the predictable nephew / uncle bonding as well as a little romance for Sandy with a local girl.<br><br>I'm a great Crocodile Dundee fan myself so absolutely loved Paul Hogan in his role as crusty and comical Uncle Porter. For starters, he keeps an endless stock of Spaghetti-O's in his house to serve as his usual meal, heated with a blowtorch! Elija Wood, Frodo from The Lord of the Rings, appeared quite competent playing the young Sandy, a boy at first none too fond of his forced summer vacation locale.<br><br>Of course the dolphin is magnificent and there are some wonderful underwater scenes. Set in the Florida Keys, it was apparently filmed in the Bahamas. This adaptation of Flipper makes great family entertainment, a sweet, sentimental, and fun movie that is infinitely superior to many of the cinematic offerings for youngsters nowadays.","user":"roghache","rank":[6,6]},{"title":"It's a lot like Casablanca really","rating":2,"date":"2 September 2004","review":"Dolphin - cute<br><br>Elijah Wood - very very cute, especially when wet and partially nekkid<br><br>Paul Hogan - strangely attractive, must have been the leather bondage cuff he wore through the whole movie<br><br>Plot - very silly<br><br>Cute blonde - romance sub-plot highly unconvincing, clearly no girl can come between a boy and his dolphin and Elijah doesn't even make a vague attempt at kissing her, instead choosing to spend all his time fondling Flipper<br><br>Ending - strangely similar to Casablanca, as Elijah says farewell to the finned love of his life...<br><br>Lij: Last night we said a great many things. You said I was to do the thinking for both of us. Well, I've done a lot of it since then, and it all adds up to one thing. You're going out into that sea with your family where you belong.<br><br>Flipper: eee eee eee<br><br>Lij: Now you've got to listen to me! Do you have any idea what you'd have to look forward to if you stayed here? Nine chances out of ten we'd both wind up in SeaWorld. Isn't that true, Paul Hogan?<br><br>Paul: I'm afraid the kid is right<br><br>Flipper: eee eee eee<br><br>Lij: I'm saying it because it's true. Inside of us, we both know you belong with your family. You're part of their life - the thing that keeps them going. If that pod leaves here and you're not with them, you'll regret it. Maybe not today, maybe not tomorrow, but soon. And for the rest of your life.<br><br>Flipper: eee eee eee<br><br>Lij: We'll always have that time under the pier. We didn't have - we lost it until you found the poison barrels. We got it back last night.<br><br>Flipper: eee eee eee<br><br>Lij: And you never will. But I've got a job to do, too. And where I'm going you can't follow. What I've got to do, you can't be any part of. Flipper, I'm no good at being noble, but it doesn't take much to see that the problems of one little boy and his dolphin don't amount to a hill of beans in this crazy world. Some day you'll understand that. Here's looking at you, kid.<br><br>I'm so moved I may weep.<br><br>In summary, approximately 5000 times better than Queen of the Damned, not quite as good as Lord of the Rings.","user":"marysia","rank":[25,35]}]