[{"title":"Breakfast Club meets The Thing","rating":7,"date":"29 January 2008","review":"Is a rough way of putting it. And never mind those Scream rip-offs or all those other cheap alien/creature-feature films from the 90's. This is a teen horror movie that gives you everything you'd want from a teen movie and everything you'd want from a creature feature, all in one. But what else is to be expected when you got Robert Rodriguez behind the lens? Any other director and this film would be tossed aside as just a teen body snatcher movie. But Robert Rodriguez shows here that he has the style to make it more than that.<br><br>Now, I've read the script to this movie before I even saw it and I kept thinking to myself, there has to be another draft of this, no way this could really work and be taken seriously... or as serious as you can take a movie like this. Yet not only was I surprised to see how much of the original script Rodriguez kept in, but I was even more surprised to see how well things actually played out. Sometimes I really love being wrong.<br><br>This film delivers, just as much as any other Rodriguez picture that calls back to the good old days of the Grindhouse and makes us forget that those movies weren't even close to par with these \"tribute\" films that somehow manage to surpass the movies they're tributing. You get everything you want and leave wishing you could spend more time in high school... or at least at this high school.<br><br>This film, to me, is the second in Rodriguez's own unofficial Sci-fi Grindhouse trilogy. Starting with From Dusk Till Dawn and ending with Planet Terror. Want to treat yourself to some fun? Watch all three back to back to back. You won't be disappointed.<br><br>7/10","user":"JimmyG100","rank":[40,43]},{"title":"Invasion of the Breakfast Club Snatchers!!","rating":9,"date":"9 September 2002","review":"Herrington High School in Ohio has the usual groups of disaffected youths  the jock, the goth, the geek, the prom-queen, the drop out etc.  However they are not the only ones acting out of the ordinary  the teaching staff all seem to be acting out of the ordinary  drinking water, acting sinister. Geeky Casey has the idea that the staff have been infected, taken over by aliens using their bodies as hosts.  Casey's theory spreads to a group of students who decide to take a stand.<br><br>Oh my God  an enjoyable and quite clever teen movie!  Something must be wrong!  The plot is basically a teen twist on The Invasion of the Body Snatchers, but is filled with clever references and jokes related to sci-fi. This makes it stand out from other teen movies in that it cleverly plays with the usual stereotypes and makes them feel fresh.  The group itself is close to the usual group that learns to get along and accept each other (a la Breakfast Club)  except here they get along through drugs and the battle against aliens!<br><br>The director is better known for his big OTT action stuff but here he does a good job with a slow build up and a real feeling of paranoia.  Of course it's not as good as the actual Body Snatchers but it still has a real good feeling of fear and tension.  The effects are good but Rodriguez uses them sparingly for the most part helping the mood of uncertainty and fear.<br><br>The cast are all good.  The teens play the stereotypes well but they are outshone by the adults who all get to ham it up in sinister roles.  Many of the adults are wasted in minor roles  Hayek for one is barely in it, and MacDonald deserves more than a few minutes.  Patrick is very good considering that it could have easily been his T2 role again  running in that distinctive way etc, but he is suitably sinister.  Janssen is also good  transforming from a shy flower into her usual vamp.  Cameos from Usher, Summer Phoenix and a seemingly pointless role for Harry Knowles (he's been bought!) don't spoil this.<br><br>Overall as a sci-fi horror it's pretty good if not great  there are better films around.  But as a teen movie it is head and shoulders above the rest of this rather sorry genre and has enough tension, drama and references to be very enjoyable.","user":"bob the moo","rank":[49,57]},{"title":"Sparkling '90s sci-fi/horror hybrid fun!","rating":8,"date":"3 August 2011","review":"Robert Rodriguez's spirited sci-fi/horror hybrid is one for the books, even if solely for rekindling the 'alien invasion' genre during the '90s. Taken over by alien parasites, this time it's high school teachers who can't be trusted anymore with a small group of students – amongst them soon-to-be famous faces of Josh Hartnett and Elijah Wood – discovering the terrifying truth. Kevin Williamson splendidly has his way with stereotypical teenagers in a clever script stuffed with titillating genre references. All performances are outstanding - particularly Robert Patrick eats up every scene he's in - and the K.N.B. Effects Group delivers some of their best work, mixing CGI with traditional monster mayhem. Even with its plot-twists revealed after a first time viewing, this one's worth revisiting.","user":"Vomitron_G","rank":[11,11]}]