[{"title":"Films I wish people would make!","rating":10,"date":"7 June 2004","review":"Often we see so many stereotypical movies about minorities in film. This time a black child, that could just as easily have been a white kid with a script rewrite, begins to experience adolescence as a young man. He has some issues he is dealing with and is counseled by several adults throughout the movie. What I liked most about this movie was the beautiful portrayal of blacks in love. The kids, and the parents. It was like watching an old home movie of my own family.<br><br>Too bad Matty Rich disappeared after this film. I was kinda hoping it would turn into a trend. Blacks in positive roles in films.","user":"junkmailsogk","rank":[7,7]},{"title":"These are the types of films that need to be made.","rating":4,"date":"4 December 1999","review":"I really liked the film, well acted, well directed. As a director myself I felt a sense of sadness that the black audience didn't support the film. We keep crying for better images on film but when they come we don't support it. If you are an African-American you owe it to yourself and Matty Rich to see this film and hopefully some other ethnic groups will see it and understand that we're not all drug dealers and pimps.","user":"jdb-4","rank":[11,13]},{"title":"Underrated beyond belief","rating":10,"date":"11 May 2009","review":"The story: Drew has problems coping with his life after he accidentally burns down his house. His mom(played by Suzzanne Douglas and Dad(Joe Morton)move with her sister and from then Drew's life changes.<br><br>Larenz Tate is pretty good as the naive but likable Drew. Suzzanne Douglas is great as Drew's mother and Joe Morton is perfect as Drew's father Kenny. Glynn Turman is good also as the ignorant and arrogant Spencer Phillips. Duane Martin is just hilarious as Jr Phillips. And for me the silliness only made this movie more appealing.<br><br>Its a shame that Matty Rich(the director) never had another movie after this one. But I understand all too well that any gifted black director that gives us positive images will not last in Follywood. There is no high demand for them and a lot us will only promote the black films that these childish schizophrenics promote. If you are over the age of thirty and you still allow these freaks to dictate to you what quality entertainment is then you should be ashamed of yourselves. The negative reviews for this movie are the reason why positive black movies will never get the love they need. You cant pine about positive images for Black people and you would not support a movie like this. We owe it to Matty Rich as well as all other talented black filmmakers to support movies of this ilk. Two thumbs up for this touching coming of age movie.","user":"Newsense","rank":[5,5]}]