[{"title":"A Sensual and Spiritual Experience","rating":8,"date":"8 July 2002","review":"Baraka is an ancient Sufi word, translated as a blessing or as the essence of life from which the evolutionary process unfolds. With the theme of man's diversity and his impact upon the environment, Baraka is a documentary photographed on six continents in 24 countries including Tanzania, China, Brazil, Japan, Nepal, the U.S. and Europe. It has no story and no dialogue, yet transcends geography and language to provide a sensual and spiritual experience that enables the viewer to look at the world in a totally different way.<br><br>When the film opens, a lone snow monkey sits in the middle of a hot spring, biding its time. The expression on its face is one of deep reflection and weariness. When it looks up at the stars, then closes its eyes, shutting itself off from its surroundings, I sensed my own inner longing for the infinite. <br><br>As the film progresses, we see the edge of a volcano in Hawaii, the Church of the Holy Sepulcher in Jerusalem, the Ryoan-Ji temple in Kyoto, Lake Natron in Tanzania, and the fire plains of Kuwait, their oil fires burning after the 1991 Gulf War. Through Fricke's camera, we glimpse various forms of religious expression from the chanting of monks to tribal celebrations in Africa and Brazil. <br><br>Baraka is almost like an updated version of Godfrey Reggio's 1983 film, Koyaanisqatsi. Using speeded-up images of hectic big city life with its homelessness and deprivation, interspersed with mountain vistas and forests, it depicts the mechanical nature of modern life as contrasted with the beauty of the natural world. <br><br>This film allowed me to see things I never knew existed, and to glimpse patterns of interconnectedness and a sense of balance and proportion in the world I was barely aware of. I was moved to simply look into people's faces and have them look back at me, allowing me to connect with the universality of the human spirit. <br><br>Fricke has said that Baraka was intended to be \"a journey of rediscovery that plunges into nature, into history, into the human spirit and finally into the realm of the infinite.\" Unique in its beauty, sensitivity, and perception, Baraka succeeded, in the course of 90 minutes, in moving me from the humdrum of everyday reality to a calmer and more spiritual space","user":"howard.schumann","rank":[119,129]},{"title":"A true GAIA experience","rating":3,"date":"3 May 1999","review":"When I first experienced (that's the most striking word for it) this movie at the Gothenburg Film Festival 1994, I was truly amazed. Never before - or since - have I had such an over all explain-it-all feeling after a show.<br><br>\nRon Fricke has made a documentary about the World today for a day: starting at dawn with monkeys in hot springs in Japan, and the morning rituals of various religions. This is followed by the awakening of the human race, both in the big cities and on the country side. Brilliantly edited together follows every aspect of human daily life combined with the general changes of the planet itself and all the ecological systems upon it.<br><br>The over all glue of the story are the various religious rituals. Maybe this is my personal interpretation, being a teacher of Religion, but the only time giver, except for the turning of the sun, are the praying times and times of worship peoples practice around the globe.<br><br>My comparison of the film to the GAIA idea (that the Earth as a whole being a unit, a living organism) is detectable both in the way every different cultures shown are found to be very similar to one another, as well as the speeded up people at side walks and zebra crossings look very much like the stream of blood in the veins of an organism.<br><br>All in all this is a marvellous movie pointing out both the uniqueness of the individual and the unity with all people. Go see it - now!","user":"jcnteach","rank":[98,110]},{"title":"A masterpiece! Spiritually uplifting. Touches the heart and soul deeply.","rating":26,"date":"26 August 2000","review":"It is perplexing to read a few comments below that rubbish this film.  To me, and to so many others, it is unequaled in it's beauty, sensitivity and deep spiritual perception into this amazing world that we inhabit.<br><br>Really, I think if anyone watches this film and cannot feel uplifted to the heavens, then they must be spiritually deadened by cynicism and negativity.<br><br>Even without DVD and the big screen, we have enjoyed repeated viewing of this EXCEPTIONAL film.  I first saw it in Sydney, in Panavision's huge screen, and was totally blown away by the cinematography as well as the profoundly moving music.  But even on VHS here at home, it touches me ever so deeply.<br><br>10 out of 10.  An incredible experience!!","user":"nz man","rank":[152,175]}]