[{"title":"Harmless fun","rating":6,"date":"8 January 2001","review":"This is one of those harmless sequels that seems to draw unnecessary ire. This is a \"rip-off\" sequel, but the cast plays it well, and it's true to its formula.  Michael Ironside is a fine villain.  And Hillary Swank, who went on to win a Best Actress Oscar, shows sparkle and potential in the lead. There are many worse movies to rent to watch with your niece.  My score -- 6/10.","user":"aromatic-2","rank":[36,49]},{"title":"Rather delightful","rating":7,"date":"16 January 2013","review":"Having seen the other Karate Kids, I was curious about this film, though I had never seen or even heard of it. The usual elements are back. New kid in town that struggles to adjust; a Mr. Miyagi that helps to instill self-confidence in the teen; and the climax of needing to use the recently learned karate in a pivotal fight scene. I was taken in both by Hilary Swank's character, expressing the range of emotions and soon willing to be positively formed (the Karate Kid characters are always so kinetic, aren't they?) and Mr. Miyagi as the walking book of Oriental proverbs. I loved it! Slow in some parts, but some intriguing scenes.","user":"regahsof","rank":[10,12]},{"title":"The Next Karate Kid,Why so much hate?","rating":9,"date":"21 April 2014","review":"Personally i have seen this movie about half a dozen times.I think it is great.Do not get me wrong,in my humble opinion the original karate kid(1984)with Ralph Macchio was better but Hilary Swank gets the job done nevertheless.An exciting story,a lot of action,a little bit of drama and sentimentality when it was required and exceptional acting;What is not to love?All that hate does not make any sense.Someone who liked the first movie should like this one too and even if you were not a big fan of the first movie you absolutely have to give it a try.Mr Miyagki for once more turns out to be an excellent teacher that every (karate)kid would want to have.<br><br>This is a must see and it goes in my personal top 25 movies.","user":"Chamilakisgeorgios","rank":[15,20]}]