[{"title":"Switch of your brain for once and enjoy.","rating":6,"date":"8 October 2004","review":"Before I watched this movie I already read the reviews on IMDb. Almost everybody says it is an awful movie. Well, I'm in a good mood today and I'm not going to follow everybody's opinion. I liked it, not all the time, but it was OK.<br><br>Joe Pesci is a mobster who has two days to deliver 8 heads of other criminals to his boss. If he fails his head will be the next to be cut off. Of course on the airport his bag is switched with another one.<br><br>Not all the gags and jokes are good. There are some very predictable and embarrassing ones. Not only embarrassing for a great actor like Joe Pesci, but also for the guy who came up with them. However, there were some terrific ones as well, the best perhaps is the dream sequence. I'm not going to tell what happened, but it is really hilarious. <br><br>Overall I would call it an enjoyable movie when you are able to switch off your brain for once. I gave it a 6/10, which isn't bad for this kind of movies.","user":"philip_vanderveken","rank":[21,27]},{"title":"A Pleasant Surprise","rating":6,"date":"16 September 2006","review":"The rest of the IMDb reviewers have got it about right. This is a good film. Nothing special or brilliant, but it does what it sets out to do which is to make you laugh - and it does so much better than most films of its kind.<br><br>I started watching this expecting to change channels quite quickly. I only gave it a chance at all because Joe Pesci was in it - which is never a bad asset for a film. What happened was I found myself smiling quite a lot, and then laughing quite a lot. Not uproariously or uncontrollably. But out loud, and more than once.<br><br>Pesci is good - but so is just about everyone else. And the script is wickedly funny too. It's much less predictable than most of its kind, There are twists which are genuinely surprising and interesting, and the film stays pretty fresh (even though in truth it's probably 20 minutes too long).<br><br>I'm quite a harsh marker, so a 6 from me is quite a compliment for a film like this. Well-written, nicely-paced, silly without being annoying, and containing some funny performances and a lot of good moments, you will like this one if you give it a chance.","user":"tohu","rank":[20,26]},{"title":"A pretty entertaining comedy of errors","rating":7,"date":"24 August 2000","review":"Quite a load of laughs in this movie. Funny and entertaining, as well as maintaining interest by throwing in a few surprises and twists. Fine acting by most of the actors, in the sense that they manage to capture the uproarious mood of the movie throughout, with its series of laugh-invoking antics designed to prevent innocent people of knowing what's in the duffel bag, while seeking to try to either get rid or exchange for the correct bags. Not a classic comedy in any sense, but one which will keep you laughing and smirking throughout, without resorting to gags all the time to make you enjoy.","user":"Mike-DD","rank":[17,22]}]