[{"title":"One of my favorites...","rating":10,"date":"27 August 2006","review":"One of the few more-modern animated films I still enjoy; maybe that's because it doesn't happen to revolve around \"The power of friendship/love/whatever\" and isn't some sappy love story, like many of Disney's drek has been (though it does have a minor, slightly sleazey love-ish story in the background). Dreamworks is a breath of fresh air in times like these, it would seem.<br><br>The plot works on many levels; it's straightforward enough for the general kid to understand and enjoy, but is piled under levels of wit and more jokes that rely on understanding more of it, making it balanced and still funny the 150+th time I watch it.<br><br>The songs are catchy (as can be well-expected from the good man Elton John), the characters are lovable yet total sleazeball con-men, and the humour is on many levels; and with it, it brings many good, memorable lines (\"'For three days?!' 'YES! Don't even breathe!'\" and \"'You're buying your own con!' 'At least I'm not DATING mine!' '... oooh, low blow.'\" come to mind).<br><br>As a basic rundown, there's Miguel, the fun-loving, more light-hearted of the two con-men; he tends to appreciate the beauty in fun and people. Tulio, the other half of the duo, has a bit more preoccupation with material possessions and wealth, though he still remains human. Then there's Chel; the seducer from the city of gold, able to help the two (at a price). And our main antagonist? Tzekel Khan (spelling unsure), a rather nutsy high priest and speaker for the gods, who proves to be... well, a basket case.<br><br>The animation pulls itself off well; the movie is bright and colourful, but not a kiddie flick at all- rather, it's humorous on all scales- my friend's 6-year-old-brother, I, and my 55-year-old dad agree. The Road to El Dorado is enjoyable on all accounts. If nothing else, consider renting it.","user":"demonelipso","rank":[68,77]},{"title":"People are Missing the Most Important Point.","rating":10,"date":"10 July 2002","review":"Of course, i was missing it too, until about fifteen minutes in.<br><br>Okay -- the title is \"THE ROAD TO El Dorado\"  Hands up, everyone with whom that rings a bell.<br><br>No?<br><br>Okay -- its stars are two fast-talking con men who get out of trouble by faking fights with each other,and who *almost* play pattycake at a point.<br><br>Still no bells ringing?<br><br>How about if i point out that, at one point, our heroes' images are briefly morphed into the faces of Bob Hope and Bing Crosby for about two frames?<br><br>Right.<br><br>This is a tribute to/animated version of those hilarious (if you're in the right frame of mind) \"B\" comedies starring Bob Hope and Bing Crosby (and Dorothy Lamour in a sarong -- does Chel look any more familiar, now?), all of which were entitled \"The Road to...\" somewhere or other.<br><br>Nothing in them was meant to be taken seriously, and very little in this film is.<br><br>I have to agree with a number of reviewers who say, with varying degrees of indignation, that this is not a kids' film.<br><br>Duh.<br><br>It wasn't meant to be. It was meant to ba a general-audience, PG-rated film.<br><br>WILL you people PLEASE get it through your heads that \"animated\" does not, necessarily, equal \"kids' movie\"?<br><br>Animation is just another film-making technique, to be used to make any kind of film the animator wants to make, and if you think that animation is automatically for kids, check out... oh, say... \"Akira\" or \"Fantastic Planet\" or \"Heavy Metal\".<br><br>\"Road to El Dorado\" is an excellent all-ages film, (with the caveat that is IS a PG-rated one, and that you ought to think about what you want your kids to watch) and anyone who sees anything bad or prurient in the scenes that everyone has been complaining about should take a close look at themselves...","user":"krasnegar","rank":[102,120]},{"title":"They don't make movies like that anymore","rating":8,"date":"14 June 2003","review":"You probably think the one line summary of this comment is a bit strange, since The Road to El Dorado isn't in fact that old, but what I meant by it is that they do not make feature films like this anymore. Sure every now and then there is a great animated film that revives the Adventure genre of film-making, but that's basically it. If you're an adventure freak like I am and you simply love Indiana Jones or Stargate or The Mummy for all I care you should definitely watch this film. I bet you'll enjoy it, disregarding your age (although very small kid's might get frightened at times). Thank you Dreamworks for providing me with a fantastic story of adventure. I appreciate it. It's been so long since I've seen any good adventure (The Mummy was last and Indy before that).<br><br>\nTO ALL STUDIOS I MUST SAY THIS: start making feature films like this again please, I miss them. Does it seem right' to you that I I have watch an animated film mostly aimed at children, to get a film with a good plot, a good villain, great action, enough thrills, blood and emotion? It does not sound right to me. No Bad Boys II, no Triple X 2, no stupid and expensive action. You can do big with little as long as elements fit together.<br><br>\n8 out of 10","user":"stamper","rank":[36,42]}]