[{"title":"Exuberantly entertaining","rating":9,"date":"13 June 2005","review":"Many years ago I hitchhiked through Yugoslavia and found a diverse, down to earth people living in harmony. Many years later, after economic decline and the breakup of the Soviet Union, Slovenia and Croatia declared their independence and signaled the end of the country of Yugoslavia. Emir Kusturica's Underground is a bold recreation of the events that led to the breakup, spanning the years of the Nazi invasion of World War II to the present wars. The film has been called Serbian propaganda, self-indulgent, an anti-Communist tract, an anti-war tome, cynical, nihilistic, and it may be any or all of those, but primarily it is a work of art whose surreal vision and poetic language makes any search for a coherent message elusive.<br><br>Underground traces the lives of Marco (Miki Manojlovic) and Blacky (Lazar Ristovski), two charming but immoral black market profiteers who fight the Nazis while hiding in a massive cellar with friends and family where they produce and sell munitions. Marko and Blacky both compete for the attention of actress Natalija (Mirjana Jokovic) after Blacky's wife Vera (Mirjana Karanovic) dies in childbirth, but Natalija plays both of them off against the German soldier Franz ((Ernst Stotzner). After the war, perhaps as a metaphor for the constricting rule of President Tito, Marko fails to inform the underground community that the war has ended, keeping everyone in the dark so that he can support the Communist regime and make a profit selling arms to middlemen.<br><br>Natalija helps Marco keep up the charade when he makes Blacky into a venerated national hero even though he is still alive. The only innocent characters in the film are Marco's slow-witted brother Ivan (Slavko Stimac) and his pet monkey Sino who form a lifelong bond after German bombs destroy the zoo where he was working. It is only when Sino crawls into the barrel of a tank and fires its guns do the inhabitants of the cellar work their way toward freedom and, in the process of discovery, react like space travelers finding a new world. The new world, however, looks very much like the old and when brother turns against brother, the disintegration of Yugoslavia is complete.<br><br>Underground is an exuberantly entertaining three-hour carnival filled with wild characters, singing, drinking, and fighting and a brass band that keeps the energy high with Gypsy melodies. While it is a broad comedy that often descends into borderline lunacy, it is also a tragic vision of the betrayal of a people. Its final Felliniesque image of all the characters reunited on a piece of land drifting into the sea tells more than the obvious metaphor of a broken land and a broken people. It is a testament to the endurance, the acceptance of life, and the commitment to joy of the Yugoslav people and a passionate cry for their regeneration.","user":"howard.schumann","rank":[134,152]},{"title":"Brilliant Cracking Thriller!!......","rating":10,"date":"23 December 2004","review":"Those who have seen \"Underground\" have probably noticed that we are not watching one film but a collection of at least 10 films in one single masterpiece!!<br><br>I watched with great enthusiasm the work of Kusturica after \"Underground\" in films like \"Arizona Dream\" or \"Black Cat White Cat\" films which prove to be more elaborate and \"smoother\" in terms of direction (brilliant works as well!!) but none of these films could ever equal the \"nerve\" and strength of a very young Kusturica at his best! One could see the passion and boldness that is at stake in this motion picture. It's as if he gambled his own life doing \"Underground\"<br><br>How else can you describe this work of art if not a mixture of devilish and holy images that take the shape of a flawless piece of theater-dance!!<br><br>The actors speak, dance and create (more than interpret) with a vigor rarely found outside the Balkan Circle!<br><br>In terms of theatrical aesthetics the film incorporates Stanislavski( realism at its best), Brecht (at certain points the actors step out of their roles and mock at themselves) and Artaud (they are flames more than humans)<br><br>Needless to say more!<br><br>Shocking, raw, heart-breaking!!<br><br>One of the most beautiful I have ever seen! 10/10","user":"sebbastiann","rank":[181,217]},{"title":"Absolutely Brilliant Film","rating":10,"date":"18 July 1999","review":"When I first saw this movie on the indie channel, I taped it. I immediately watched it again, totally stunned by the extent of energy, imagination, ideas, images with which I was being blasted. Talk about a universal masterpiece! This movie should be required viewing on every screen, large &amp; small in the US. We Americans lead such narrow sheltered lives; we are so eager to see things in black &amp; white, to have our opinions dictated by columnists &amp; newscasters. This movie should take off a few blinders. On the other hand, people will still opt for easy cartoon ideologies over the indisputable truth about the ferocious &amp; predatory predilections of all \"sides\" of humanity. Thank god for visionary humorists like Kusturica.","user":"inframan","rank":[163,203]}]