[{"title":"One of my favourite animal movies ever!","rating":8,"date":"8 May 2005","review":"I was very young when I first watched this movie, and I love it just as much today as I did then. The main idea of \"Homeward Bound: The Incredible Journey\" is three pets, Shadow, a wise old golden retriever, Chance, a goofy, fun-loving American bulldog puppy, and Sassy, a hilarious Himalayan cat who are left in the care of their owners' friend that lives hundreds of miles away on a farm. After several days, the pets begin to worry. Thinking that their owners must be in some kind of trouble, they set out on their adventure home.Along the way they encounter many unexpected surprises but their determination and love for their owners helps them in finding their way. For me, this was an unforgettable story of love, courage and devotion that will inspire everyone who watches it. A must see for animal lovers! I give it a 10!","user":"horsecrazy6791","rank":[36,36]},{"title":"Very Nice Family Movie","rating":4,"date":"4 October 2006","review":"Robert Hays and Kim Griest play normal human beings while Sally Field, Michael J. Fox and Ameche are voices of animals. All of them combined to make a nice family movie here, and a pretty successful one at the box office.<br><br>There are many funny lines given to Fox to read as the main character, the dog. Field also has a good lines as the cat while Ameche plays it straight as the mature Golden Retriever.<br><br>The only somewhat-bothersome character is the 13-year-old boy who is impatient and pouty at times, but he gets out that after awhile.<br><br>The scenery is nice, too, with photographers doing a fine job capturing the beauty of California's Sierra mountain range. <br><br>All in all, a very nice movie and highly-recommended for one of those 'family nights.'","user":"ccthemovieman-1","rank":[26,27]},{"title":"one of my top 10 favorites!","rating":10,"date":"10 July 1999","review":"This movie is definitely on the list of my top 10 favorites.  The voices for the animals are wonderful.  Sally Field and Michael J. Fox are both brilliant as the sassy feline and the young inexperienced pooch, but the real standout is Don Ameche as the old, faithful golden retriever.  This movie is a great family movie because it can be appreciated and loved by children as well as adults.  Humorous and suspenseful, and guaranteed to make every animal lover cry!  (happy tears!)","user":"Denny","rank":[22,23]}]