[{"title":"Throw back to Z-Movie Drive in! Solid Gold!","rating":7,"date":"30 December 2005","review":"I rented this movie several years ago solely because I could not pass up on a movie with this title. And believe me baby, it delivered! I am a huge fan of B-movies and this is one of the best. It had a great mix of humor and horror that isn't seen enough in this millennium. The plot was a little non-sensical but who cares? The Murders were carried out in such outrages situations as an electric (yes extension cord needed) piece of lawn care equipment, butchering a victim in a telephone booth. Rock On! The lead characters are an odd couple detective duo and the movie does a great job of poking fun at this formula. The one detective is a grizzled veteran and his partner is a weak stomached sissy. Let the carnage and puke flow! The character of the wife was also humorous. Well anyone who needs to use a voice box at any point in anything is what I would consider funny. If you are a fan of the old time Z-movie of the B-movie horror Comedy pick this movie up. You will be seriously surprised by it's quality!","user":"nixons_smelly_vagina","rank":[7,7]},{"title":"DELICIOUS!","rating":10,"date":"7 March 2004","review":"Do you like B movies?  REALLY like B movies?  This is the one for you!  If you prefer to watch REAL FILMS, don't bother.  I doubt the Academy ever watched this one, and they certainly wouldn't be nominating it for any awards.<br><br>A twisted comedy/thriller (listed as horror, but thriller seems more appropriate), this flick -- I dare not call it a FILM -- was refreshing, like a spring rain. Think Naked Gun on a low, LOW budget. Serial killer, brutal murders of prostitutes (with the most enticing weapon selections), a cop who vomits at the sight of blood, AND a porn star (Jane Hamilton as dull-witted roller-skating waitress Grace) . . .<br><br>There's no point in discussing cinematography; I'm guessing film-school camera work and editing.  Better than Blair Witch, not as good as Suspiria. Acting is mediocre, but at a level appropriate to the genre.<br><br>Keep your eyes open for occasional sight gags, and your ears open for the one-liners.  Corny sometimes, but again, appropriate to the genre.  A few good laughs, some pretty good gore (much more convincing blood than Argento uses), and a fun plot twist.<br><br>If I've learned one thing from this movie, it is: If you are a prostitute, and your trick brings a generator, run. Fast.","user":"traineraz","rank":[11,13]},{"title":"Tomato salmon casserole","rating":9,"date":"23 September 2006","review":"A masterpiece from the opening scene; this film is both a hilarious parody of \"buddy cop\" films (LETHAL WEAPON, 48 HOURS, BAD BOYS, etc.) and a superior precursor of the present lame &amp; un-funny comedy-horror films of the SCARY MOVIE ilk.<br><br>Beverly Penberthy steals the film as Sweeney the cop's wife, Erma Birdwell. Erma, despite her aerobic fitness, is a cigarette smoker who worries that her husband is no longer attracted to her. Attempts to stop smoking haven't worked. Her travails finally lead to an appearance by an avatar of the Egyptian God of the Dead. \"The f--k it isn't, I know Anubis when I see It!\"<br><br>Also wonderful is MISTER ROGERS NEIGHBORHOOD veteran Don Brockett as the raving homicidal Police Chief. And Veronica Hart, as Grace, continues to be one of the few \"actresses\" from porn films who can actually do a passable job acting.","user":"jjjjjjjjjjjjj-4","rank":[4,5]}]