[{"title":"Sha-tow Lafite!","rating":7,"date":"12 April 2003","review":"If you like Dana Carvey, you'll dig this movie. If you don't, well, then it's pretty lame. But as a vehicle for Mr. Carvey, this story of a con-man weasling his way into an affluent family in order to fleece them, only to fall in love with their daughter, it's even better than it needed to be. The lines and scenes are all pretty good, if not somewhat non-offensive and restrained. The county club lunch with the old couple is classic and Carvey is about as charming as he gets. The wine ordering scene and the expression on his face when he finally takes a sip of the Chateau Lafite is practically worth the price of admission alone. \"Hey Milt, think he's gonna come by and burp me after lunch?\" Robert Loggia is also excellent as the successful but down-to-Earth CEO who is charmed by Dana's rough edges. Corny, predictable, and yet a totally worthwhile way to spend two hours with one of SNL's favorite sons.","user":"colparker","rank":[11,13]},{"title":"Fun, \"Good Feeling\" Movie","rating":3,"date":"3 April 2011","review":"I'm the first to be skeptical of any movie like this. In fact, most movies I watch these days involves at least one visit to IMDb.COM first. But some movies, no matter how accurately they may be reviewed for technical merits just can't review the sentimental or personal value they may have to you. This is one of them. Oh, trust me - I've watched my share of movies like this that have left me more than high and dry - but this one is different (at least for me). I've always felt Dana Carvey was a special comedian and has never reached his full potential as an actor. However poor the writing, or perhaps his acting, the movie is engaging enough to keep this harden skeptic enthralled for greater than 90mins. That's saying a lot.<br><br>This movie will surely not go down in history as a one of the 'greats' of comedy - but is well worth an evening if you're just looking for something funny, heart-touching and romantic.","user":"m1965","rank":[6,7]},{"title":"Don't miss the opportunity to see this movie!","rating":8,"date":"13 April 2005","review":"Eddie (Dana Carvey) is a small time conman in Chicago. He and his partner get in a little over their heads, however, when they take/borrow a car that belongs to the top dog crook in the city. On the lam, Eddie gives himself a new identity when he poses as an ace businessman for a firm that markets hand blow dryers. In his pretend role, he meets Annie (Julia Campbell), the daughter of the firm's president. Is it love or is he just after her family's money? Will Eddie be found out? Dana Carvey makes this movie something special. His performance is highly amusing, of course, but he also displays a talent for the dramatic elements of the film. The rest of the cast prove themselves to be quite capable of supporting Carvey's hijinks and Campbell makes a beautiful love interest. The Chicago scenery and the lovely costumes add nicely to the movie's enjoyment, too. For the many romcom fans across the globe, this one should be added to a must-see list. Those who appreciate the laudable talents of Carvey will not want to bypass this one, either.","user":"inkblot11","rank":[6,10]}]