[{"title":"Better than expected","rating":7,"date":"9 May 2005","review":"Much better movie than I expected. Jim Belushi and Tupac Shakur have a good chemistry as 2 crooked, conflicted cops. Tupac Shakur actually played a very good character as the increasingly troubled cop. He was willing to bend some rules, and put some money in his pocket, but things have now gone entirely too far for him. Jim Belushi plays a morally dumb cop who continues to make the situation worse, and continues to believe he can probably manipulate his way out of anything.<br><br>Dennis Quaid, James Earl Jones and Lela Rochon were all excellent.<br><br>I didn't expect too much from this, but I was drawn into a well-done, well-acted movie.","user":"jmorrison-2","rank":[29,32]},{"title":"A gritty crime thriller.","rating":9,"date":"28 September 1998","review":"Gang Related had a great premise, which was enough to get me to want to see it.  James Belushi (K-9, Race the Sun) and the late Tupac Shakur (Gridlocked, Poetic Justice) play two corrupt cops.  They sell stolen drugs, kill the guy they sold it to, take the drugs &amp; money, and label the crime as gang related.  This has worked for the first ten times, but the 11th doesn't.  The 11th guy they killed, turned out to be an undercover cop.  So the two are put in charge of finding the killer.  So knowing that they themselves killed him and could be in huge trouble, they begin to look for possible candidates to take the fall.  Eventually they decide on a homeless man, wonderfully played by an unrecognizable Dennis Quaid (Switchback, Dragonheart).  They then get Belushi's girlfriend and stripper, Lela Rochon (Waiting to Exhale, The Chamber) to testify against him.  Soon though things don't work out as Rochon starts to lose confidence and more evidence comes out about the mysterious homeless man.  Belushi and Shakur start to lose their trust and confidence with each other.  This is a well-written film with some great dialogue and an awesome ending.  James Belushi is great as the mastermind behind the plot and the one who won't give up.  Tupac Shakur is just as good (in his final role) as the partner who has at least some sort of a conscience.  Rochon is good.  Fine support work is turned in by James Earl Jones and David Paymer as Quaid's lawyers.  I highly recommend this movie. Rated R: (violence, language, nudity)","user":"Brad K.","rank":[23,26]},{"title":"Great film","rating":9,"date":"3 January 1999","review":"I really didn't want to rent this film, but one of my friends, PA(nick-name)who was a big fan of Tupac Shakur talked me into it. I am glad he did, because this was one of the best films of 1998. James Belushi was great in this film, and so was Shakur and Lela Rochon. James Earl Jones appears in a little role in the last 40 minutes of the film.He was great, too. However, the film is about two corrupt cops who sell drugs, then they kill<br><br>the buyer and  steal the drugs and everything else of value on him. It had worked 10 times. But unfortunately the 11th time(The one we saw) goes wrong.The buyer was a undercover-cop and they has been set to do the investigation.Now the film really starts. The two cops now start looking for someone to blame, and a<br><br>homeless man named Tom looks like an easy target. The rest you can see for yourself.You really should. The  movie   is   Great<br><br>I gave it 9/10!","user":"NBK-2","rank":[17,20]}]