[{"title":"Can't decide if it's thriller or drama","rating":7,"date":"20 March 1999","review":"I had been long awaiting this movie ever since I saw the trailer, which made it look like a political drama, starring three of my favorite actors; Al Pacino, John Cusack, and Bridget Fonda.  And even though it was directed by Harold Becker, who has done uneven work, he and Pacino did combine on SEA OF LOVE, which ranks among each of their best work.  But interference on some level(for starters, several of the scenes in the original trailer don't appear in the movie) and changing of tone(subsequent trailers make it look like a thriller) make this, while watchable, nowhere near as it could have been.<br><br>Which is too bad, because I really wanted to like this movie.  There was great potential here to be a film about how government can still be worthwhile despite all the corruption, and to make a complex statement about that corruption, not the usual good guys vs. bad guys.  And there is good acting here.  Pacino and Cusack are both very good, and Danny Aiello gives one of the best performances of his career.  But Fonda is wasted in her role, having nothing to do, and while there is merit in the central storyline, when it turns to a thriller, the movie loses its way, briefly recovers in the final scene between Cusack and Pacino, and then falls down completely in the end.  I wish I could like this more, but no.","user":"SKG-2","rank":[32,36]},{"title":"Good.","rating":3,"date":"3 September 2005","review":"I liked this neglected movie quite a bit, for a number of reasons.<br><br>The characters. I found them believable, real, with some depth, in conflict. Not cardboard, cartoon-like. I found that I could really identify with and care about them.<br><br>The story. I thought it was really interesting and realistic. The behind-the-scenes look at political machinations was exciting. I tend to like movies without special effects, that are not unrealistic fantasies. (\"Ordinary People\" generally comes to my mind.) I thought that this movie simply took real-life type people, put them in interesting situations, filled with conflict, and had us watch them deal with the problems they were in.<br><br>I also think the movie had a message for us, in terms of right and wrong. In fact, it's downright Shakespearian. (Contrast this with another Al Pacino movie, \"Heat\", where the criminals are portrayed just as sympathetically as the law enforcement officers, and there is no inkling at all that there is anything morally wrong with armed robbery. I'm uncomfortable with that.)<br><br>It's refreshing to see a movie in this day and age without gratuitous sex, violence, bombs and bullets, profanity.<br><br>On a cinematic level, I found the directing, acting (the entire cast) and production to be first rate.<br><br>I realize that many, many people (possibly the large majority) don't see things as I've described here. But if what I've written resonates, then you'll probably like this movie a lot.","user":"yisraelh","rank":[35,43]},{"title":"Intelligent political thriller not pretending anything","rating":8,"date":"23 January 2002","review":"Well, there is a plenty of ways how to spoil a political thriller. Usually they are derivative or too ambitious, often they feature a conspiracy that is totally paranoic and unbelievable. But City Hall does not do neither of the above mentioned. The plot is cleverly crafted, story is believable. As far as characters go I would say this movie is a solid average. No character seems out of place and Al Pacino is brilliant as always. His portrayal of a charismatic NYC mayor is superb and proves again that Al Pacino belongs to the absolute top of American actors nowadays.","user":"pivko","rank":[26,34]}]