[{"title":"Successful and FUNNY melding of East and West","rating":7,"date":"20 July 2003","review":"Great fun!<br><br>Jackie Chan brings his brand of physical comedy to Hollywood with another buddy movie.  Similar to his \"Rush Hour\" series with Chris Tucker, Chan sets this one in the American old west and chooses Owen Wilson as his partner.<br><br>I like these better than the Rush Hours.  Tucker and Owen are both excellent playing opposite Chan in both series, but the Shanghai series seems to offer Jackie better venues for his elaborate fight sequences.  Saloons, brothels and even wilderness settings are used with great success.<br><br>And make no mistake, the fight sequences are what make (or break) a Jackie Chan movie.  \"Fight sequence\" of course means something different in a Chan movie as opposed to normal action fare.  Rather than true violence, Jackie's fight scenes are more Vaudeville than \"Pulp Fiction\".  More Chaplin than Jet Li.  Each fight is painstakingly choreographed to interact with the set surrounding it.  Tables, chairs, vases, antlers, shrubbery... the list goes on.  <br><br>A successful Jackie Chan movie seems to contain a comedy-oriented story, a lightly delivered moral message, and lots of action.  Shanghai Noon certainly delivers here.<br><br>I spent the entire movie either chuckling to myself or laughing out loud, and had a very satisfied smile when the credits rolled.  Highly recommended.<br><br>7 out of 10.","user":"CMUltra","rank":[48,48]},{"title":"A Winner For Jackie Chan","rating":8,"date":"20 April 2006","review":"It seems this film has been out longer than just six years but I remember it was one of the first modern-day humorous martial arts films to be seen in North America. It also introduced a much wider English- speaking audience to the charm and talents of Asian star Jackie Chan, who now is well-known everywhere, even if he is getting up in age.<br><br>This is considered one of Chan's better films and the setting certainly is different than normal for him: the American Old West. Good action scenes, some solid humor, fun characters and nice cinematography are all the pluses. Chan speaks English so there is no need for dubbing, either. <br><br>The only \"minus\" I found was the final action scene going on too long, but that's typical of films. All in all, this is a very entertaining movie. Owen Wlson and Lucy Liu also are two big reasons this film became so popular.","user":"ccthemovieman-1","rank":[38,40]},{"title":"One of the most enjoyable lightweight entertainments in years!","rating":9,"date":"11 January 2004","review":"Pairing Jackie Chan and Owen Wilson together may seem the most unlikely thing to do since color televisions were first invented. But both of these actors are funny, in one way or another--Chan through his innocence, Wilson through his sarcastic, snide remarks. Wilson is as impressive an actor as he is a writer--he shares writing credits on such films as \"Rushmore\" and \"The Royal Tenenbaums.\"<br><br>Chan, on the other hand, is a better martial arts master than Jet Li and a more likable character actor than Chow Yun Fat (whose disastrous film \"Bulletproof Monk\" made me want to split his head open to prevent him from ever making another American mainstream motion picture ever again).<br><br>In \"Shanghai Noon,\" Chan plays Chon Wang, a 19th century Chinese martial arts master who ventures out to Nevada in order to rescue the kidnapped Princess Pei Pei (Lucy Liu), whose name is misused by Roy O'Bannon (Wilson) on at last one occasion.<br><br>After Chon Wang (mistakenly pronounced \"John Wayne\") meets up with Roy, the two decide to form an alliance and rescue the princess -- one for honor, the other for loads of money awaiting them upon her safe arrival back home in Imperial China's Forbidden City.<br><br>Roy is a lousy wannabe cowboy who used to stage clumsy train robberies along with his band of thieves, who betrayed him and left him for dead. He offers his help to Wang, and tries to play it cool, but he can't -- after all, he's not a very convincing cowboy. But, as the smarmy wisecracking sidekicks always are, O'Bannon just wants money. But as his friendship with Chan grows stronger, he realizes that money isn't everything.<br><br>Sounds routine, doesn't it? Well, it is, to a certain extent. But it succeeds due to a fine cast -- Chan and Wilson are extraordinarily good together; so good, in fact, that Chris Tucker is just a forgotten memory by the time that the film is over.<br><br>It's a classic spin on the Old West formula; what \"The Princess Bride\" or \"Shrek\" did for fairy tales, \"Shanghai Noon\" does for Westerns. All the old cliches are poked fun at in a light way. And as great as Chan is, and as much as he carries most films he's in with his sweet charms and likable personas, Wilson comes across as equally likable as Chan.<br><br>Chan's martial arts are usually the highlights of these films, but in this he proves he can do more than just kick -- he can be funny. Well, okay, he proved that in \"Rush Hour\" (1998), but I like this better.<br><br>The jokes in \"Shanghai Noon\" aren't \"great,\" but I laughed a lot at this film. It's smarter than one might think, and is certainly one of the most enjoyable experiences I've had in quite some time. Probably years. I wasn't expecting much (especially because I wasn't an enormous fan of the sequel--see below), but if fun could be rated on a scale of 1 - 10, this would be an 11.<br><br>I give this film nothing more than four out of five stars because it's not a great film on all critical levels. But it's certainly fun--likely more fun than any film you'll see for quite some time--and for that it will soon be earning a place in my sacred DVD collection.<br><br>I must say that I wasn't a huge fan of \"Shanghai Knights,\" the sequel to \"Shanghai Noon,\" which involved Chon Wang and Roy O'Bannon venturing to England in order to save Wang's sister. But after seeing this film I'm thinking I might just have to pay a small revisit the sequel again.<br><br>\n4/5 stars.<br><br><ul><li>John Ulmer</li></ul>","user":"MovieAddict2016","rank":[36,42]}]