[{"title":"It's \"pure luck\" this movie is bashed so unfairly!","rating":23,"date":"23 August 2003","review":"Why does Martin Short always get the fuzzy end of the lollipop? And even more so, why does he get the fuzzy end unrightfully? \"Pure Luck\" is a funny movie with some very funny moments of genuine comedy. It relies more on subtlety than on loud antics; more on characters than on pure gags. It's pure luck this movie is bashed so unfairly.<br><br>Short plays Proctor, a bumbling man who doesn't find bad luck - bad luck finds him. He would be the one the automatic sliding door doesn't open for; he would be the one that chooses a chair with a broken leg; he is the one who would be capable of finding an equally unlucky woman lost in Mexico, whose father is Proctor's boss. <br><br>Proctor's boss figures that singe he's such a bad luck charm, his daughter - who is just like Proctor - would be found much quicker if they used another luck-impaired civilian to find her. Of course, Proctor thinks he has been chosen for being a great mystery solver. During the entire film he walks around thinking that he was chosen for the job because he is good. But alas, that is not the case.<br><br>Danny Glover is the head honcho looking over Proctor to lead him along - but Proctor thinks he himself is in charge, and that Glover is his co-detective. Some funny scenes come out of this.<br><br>A movie like \"Pure Luck\" is fun not because it is wildly outrageous (i.e. not Jim Carrey humor), not because it has great direction, but simply because it has a more subtle humor reminiscent of an older type of film; its actors are terrific (whatever happened to Danny Glover and, even more so, Martin Short?); the script is funny.<br><br>Is it just me or is Martin Short a funny guy? He's got the comedic timing all down-pat, he has comical facial expressions, comical guestures - what can I say, he's a comical guy. People seem to forget his roles in \"The Three Amigos\" (alongside Steve Martin and Chevy Chase), \"The Father of the Bride\" (also with Steve Martin), and so on. But I think he's talented.<br><br>And Danny Glover (\"Lethal Weapon\") is a great character actor who hasn't appeared in many films over the past few years. Maybe \"Predator 2\" put him out of the game for a while. But he was in \"The Royal Tennenbaums,\" so . ..?<br><br>This is a funny movie more character-driven than anything; it has an element of subtle humor that adds a charm to it. I really don't care if people don't like this movie - it's one of those that everyone I talk to loves, yet the general public seems to have a different opinion. Odd - is it just me, or is this funny stuff?<br><br>3.5/5 stars -<br><br>John Ulmer","user":"MovieAddict2016","rank":[20,27]},{"title":"It can cheer up your day","rating":17,"date":"17 October 2004","review":"Is a great funny film that can cheer up any day of your life and keep you thinking on some of the scenes after it's been finished.<br><br>The combination between Danny Glover and Martin Short even when is a bit strange it really works out in a funny way and how the story been such a simple plot can take you from the desert to end up in the waterfalls in the beautiful Mexico.<br><br>There is a certain American humor that i can enjoy a lot, this film belongs to that type, because even when is about bad luck and how funny that could be, is never over the top and you are just waiting what would be the next thing to happen.<br><br>I didn't stop laughing.","user":"0llin","rank":[12,15]},{"title":"Good, but still only a remake","rating":7,"date":"28 January 1999","review":"I didn't expect to like this film, but I have to admit that it was a better than average comedy, and I laughed several times even though I knew exactly what was about to happen.  So on it's own terms, this is a good enough movie.  However, I have a problem.  The problem is that this American remake of \"La Chevre\" pales in comparison.  There was just something about the pairing of Pierre Richard and Gerard Depardieu that easily outshined the American tandem of Martin Short and Danny Glover.  Only watch this inferior version if you really hate subtitles, but instead of watching a great movie, you'll only be watching a good one.","user":"Tito-8","rank":[14,19]}]