[{"title":"Not given enough credit","rating":18,"date":"18 January 2002","review":"This is a great movie that simply doesn't get alot of credit. An amatuer band known as the Lone Rangers (Fraser, Buscemi, Sandler) sneak into a recording studio to have their demo tape played on the air.  When refused, things get out of hand and they hold the place hostage.<br><br>This movie has an original plot line with good humour and good acting. Keep in mind that this movie comes very early on in the careers of all three title characters.  Personally I find the calibre of acting that Fraser and Sandler have in this movie better than some that came afterwards.<br><br>When you start watching this movie, you'll want to finish it.  Perfect example, my room mate who came in the room looking for something ended up staying for the whole movie.<br><br>Give this baby a chance.  If you don't like it, you've lost the price of a rental.","user":"insanitytrain","rank":[63,68]},{"title":"Hilarious","rating":29,"date":"29 December 2002","review":"Let's face it, if you go into a movie called \"Airheads\" expecting an intellegent, well-written, highbrow piece of cinematic art, then you deserve exactly what you get, so to everyone out there who gets off on trashing this movie, go rent \"O Brother Where Art Thou?\" and stop bit#$ng.<br><br>Now, if you want a good mindless way to blow a Friday evening, then look no further.  You've come to the right place.  Yeah, this movie is stupid beyond belief.  It's also friggin' hilarious.  Any movie that has Steve Buscemi as a long-haired, foul-mouthed bass player, and Ernie Hudson in general, I'm going to love.  For me, Buscemi was the highlight and I loved everyone of his pseudo tough-guy lines like \"Hey pal, you wanna try gettin' physical with me?\"-Hilarious.  Speaking of Buscemi, this one has a GREAT cast with Brenden Fraser as the leading man (Chaz), Adam Sandler as the pool cleaning drummer (Pip) and also features Joe Mantgena, Michael McKean, Chris Farley, David Arquette, and a whole slew of others, even Michael Richards. <br><br>\nThe soundtrack rocks and the laughs come so often (very dumb laughs) that it's impossible to keep count.  <br><br>Enjoy.","user":"billybrown41","rank":[45,53]},{"title":"It's just a good movie.","rating":7,"date":"17 July 2004","review":"I'd like to start off by saying that most people who submit comments or reviews should not take this movie so seriously. It's not Schindler's List or Chicago. I'm pretty sure when the film makers made this they wasn't trying to win an Oscar or anything. They was just trying to make a funny movie and they succeeded. This is a hilarious movie. It's one of those movies that if I'm flipping though the channels and I catch this on, I have to watch it. I heard when it came out that it bombed. I don't see how (What do critics know?). If you're one of those people who take their comedies too seriously, go read Dickens. But if you want to see a funny movie, rent this. Everyone in this is good. The plot is good. The acting is good. It's just a good movie.","user":"DanielWRichardson","rank":[23,29]}]