[{"title":"This film is a grand slam","rating":7,"date":"15 April 2003","review":"Tom Selleck has been for most of his career a box office bust. Even though this movie did not score a home run with movie goers, it is still a nicely done film. It doesn't play down Japanese stereotypes, as the writers of this film did their homework on life in Japan. I used to watch Japanese baseball, and I can tell you that the film does a pretty good interpretation. In Japan, the manager of a ball club is more of a nurturing father. It's also more like work than sport. Players run fundamental drills all day and talent takes a backseat to skill. The movie is nicely done and Selleck does a good job as selfish, self-centered Jack Elliot. Dennis Haysbert is also nice in the supporting role of Max DuBois (He had enough practice being in baseball movies after being in Major League). Ken Takakura is good as the no-nonsense manager of the club. It's a shame he hasn't done any other American films after this one. Aya Takanashi is also nice as Jack's love interest. If you can, get the video or DVD because the TV version makes some of the most absurd edits and cuts I have seen.","user":"MichaelMovieLoft","rank":[26,27]},{"title":"Actually, a very very good film.","rating":26,"date":"26 June 2001","review":"I lived in Japan at around the period in which this film is set, and I must say--this film does an OUTSTANDING job of capturing the \"feel\" of what Japan was like.  Unfortunately, the accuracy of this is not appreciated by most viewers.  Whoever chose the shots and locations really understood Japan well.<br><br>The movie itself should rate among the best baseball movies EVER, but doesn't because it's not about American baseball.  Take \"field of dreams\" or whatever.  That basically boils down to some plot contrivance about ghosts and whatnot and is only REALLY about the game at a very superficial level (despite pretentions otherwise).  This one has an intelligent and realistic view of many aspects of the game--clubhouse behavior, on-field action, player-manager interactions, the business of sports, and so on.  If you're into baseball movies, view this one--and if you don't like it, I challenge you to find ONE other baseball movie that does as well as capturing so many aspects of the game intelligently with a minimum of sap.<br><br>Characterizations in this movie:  yes, we all know that by the end of the movie the Tom Selleck character will do something to redeem himself.  In this regard, except for one interesting plot nuance (not really a twist), the plot itself is straightforward.  But the characters all stand on their own--I dont think there is a single bad characterization there with the possible over-stereotyped American agent.  From Yoji the interpreter through the teammates who are Japanese jocks to the strong female love interest.. well.. let's put it this way.. if you still think all Japanese look and act alike, see this movie.<br><br>Clearly this isn't the best movie ever made, but I really like it on a lot of levels enough that on a scale of one to ten, I honestly have to give it a 10 (and I rate a lot of movies poorly).  You probably won't like it quite that much, but I think you will enjoy it--whether you are male OR female, by the way.  Definately a good rent.","user":"LydiaOLydia","rank":[29,33]},{"title":"Really enjoyable.","rating":9,"date":"10 November 2001","review":"A lot of the comments seem to treat this film as a baseball movie, but I feel this is only secondary.  It's really about living in Japan, and it really succeeds.<br><br>I spent a few years living in Japan, and I suppose the reason that this movie didn't do too well is that you sort of have to have experienced Japan to get it.  I was watching this with a well-travelled friend who's never been to Japan, and he noted that many of the events in the movie were so ludicrous that they destroyed the suspension of disbelief.  My reply was that those events were the absolute unvarnished truth about life in Japan!<br><br>I think that this movie is definitely worth watching, especially if you've lived in Japan or are interested in it.","user":"lethalweasel","rank":[26,30]}]