[{"title":"Shattered Past / Clever Twist!","rating":20,"date":"20 July 2011","review":"Pretty clever mystery that will leave you gasping when the shocking twist is revealed. Tightly woven together, Wolfgang Peterson delivers a smart story about Dan Merrick, a San Francisco businessman who can't remember his past after surviving a horrific car crash. While recovering at his lovely secluded home, Dan discovers his adoring wife Judith, played by Greta Scacchi, is cheating with another man. Dan sets forth to discover that all is not what is seems to be. Bob Hoskins as Gus, the pet shop owner / part time private eye, gives a wonderful performance as well as Joanne Whalley, who knows much more than she ever wanted to know about Dan. Slick scoring by Alan Silvestri, knock out sets, and direction make this mystery / thriller a winner!","user":"Jim Sgambaty","rank":[14,14]},{"title":"Vastly Underrated Suspense Film","rating":8,"date":"17 April 2002","review":"With a maze of plot twists and surprises, \"Shattered\" is one heck of a guesser.<br><br>The plot follows Dan Merrick (Tom Berenger) after a horrifying car accident. He suffers from amnesia, and must piece his life together post-accident. As he learns more and more about his past, his life spins out of control, leaving the most horrifying revelation for the end.<br><br>\"Shattered\" is carefully constructed and directed by Wolfgang Peterson. His cast really brings this one together, with great performances by Berenger and Bob Hoskins. It is simply impossible to guess the events in this film as you are watching it, and it is best to go into it knowing as little as possible.<br><br>\"Shattered\" is an excellent effort and film that has been wrongly ignored over the years since its release. This is a great rental for a cold and rainy Saturday night.<br><br>Grade: A","user":"Redfoot9681","rank":[55,63]},{"title":"An Underrated Gem If There Ever Was One","rating":9,"date":"21 April 2013","review":"Late one night, I found myself working late in my college apartment, studying or trying to study for Spanish and it just so happened that I also had the TV on (which I wasn't really paying much attention to) when I just happened to look up and see that a new movie was starting called \"Shattered\". Seeing that it was directed by Wolfgang Petersen, I became a little curious but didn't really plan on watching it. Well, that thought went out the window when the movie opened with a bang. Husband and wife Dan and Judith are involved in a devastating car crash. But despite all odds, both survive; however the husband (played by Tom Berenger) is in critical condition and is left with no memory of who he is or what happened. His seemly loving wife (Greta Scacchi) does everything she can to help him readjust after getting out of the hospital but, alas, something just doesn't seem right. He slowly begins to realize that everything may not have been as rosy as his wife would have him believe and things get even more interesting when he learns that he paid for services by a street wise private detective named Gus (played by Bob Hoskins).<br><br>\"Shattered\" is one of those unassuming movies that, going in, you're not expecting to find anything too shocking or surprising and that's where you'd be wrong. I've seen a lot of thrillers and mysteries, so much so that eight out ten times, I can probably tell you what the ending will be. However, I got to tell you, the twist at the end of this movie is so well done and so shocking that I didn't see it coming for a million miles, and believe me, that's saying something. The movie also does a good job drawing you, the viewer, deeper and deeper into the movie without even realizing it with the direction of Petersen, the story, and the actors; Tom Berenger does an excellent job in his role, as does Greta Scacchi. However, my favorite actor out of this is probably Bob Hoskins, since he's able to provide a little bit of comedy and heart to his role. If you're one who's looking for a lost gem of a film or is just looking for a good surprise at the end, then I highly, highly recommend \"Shattered\". You won't regret it!","user":"bayardhiler","rank":[12,12]}]