[{"title":"Widescreen not-dubbed Mandarin version is much improved.","rating":8,"date":"28 October 2004","review":"It is understandable that some reviewers got such a poor impression of this film, because the commonly available China Star DVD (found at Best Buy et all) has a horrid Cantonese dub language track, and for some odd reason also has a poor Mandarin dub. It is also cropped badly (pan and scan). But the language problem is the most glaring enjoyment inhibitor, totally ruining the humor and timing of this very enjoyable western spoof/martial arts action flick. This film was actually filmed with live mikes right here in Texas, in live Mandarin, English, and some Cantonese. This original track is only found in the rare official Taiwan DVD from Thunder Media. The action and stunt-work in this film is almost the eighth wonder of the world. The things Jet Li does with his fighting and acrobatic skills are truly amazing. Great story, too. Very humorous in places- also being a spoof of the Once Upon a Time in China series in general. Since many of the stunts are rather large scale, the widescreen really helps also. Plenty has been said here about the story itself, so I don't need to add much. I agree this is not on the same level as the first two Once Upon a Time in China movies, but really neither is the third. I would rank this almost as good as OUATIC3, if viewed with the original soundtrack and aspect ratio.","user":"johnlewis","rank":[11,14]},{"title":"Enjoyable hokum","rating":7,"date":"16 August 2001","review":"The sixth film in the series, and the welcome return of Jet Li after a break in parts 4 and 5.  This time around Wong Fei Hung and his cohorts take a trip to the wild west, a reasonable idea but ultimately one of the weakest of the films. The plot limps along rather pointlessly, although the frequent fight scenes (choreographed by Sammo Hung) are as exciting as ever. Their power is somewhat diminished, however, as at no point do you feel the characters are in any real danger.<br><br>Jet's cool bullet-dodging in the climactic fight is fun, but only real highlight is the scene where Fei Hung's loyal comrade Seven attempts to cure his master's amnesia by fighting him in the styles of villains from the previous films.<br><br>The supporting cast are a painful bunch of stereotypes, and their acting ability leaves a great amount to be desired, but if you can get past that this is enjoyable enough hokum.","user":"Mike Astill","rank":[4,4]},{"title":"Excellent martial-arts movie.","rating":8,"date":"6 November 2002","review":"This is one of the best movies in the \"Once upon a time in China\" series. Funny once in a while with its goofy Chinese humour and filled with fast fightingsequences that are beyond us \"normal\" people. :) The synchronized sound is, as usual not the best, but it does the trick..","user":"7echnoid","rank":[3,3]}]