[{"title":"Great one for late at night","rating":6,"date":"21 March 2017","review":"Delightfully strange beginning half hour (giggle-inducing, embracing death versus will-to-live horror premise) gives over to a seemingly disconnected, or conveniently connected yet meandering, subplot which somehow becomes the bulk and main thrust of the film. It's all deliriously macabre, languidly mad and dark. A great late night mind tickler.<br><br>Why this film is not widely available on home video as a cult classic is anybody's guess but for now it is available in its entirety on YouTube as part of the Korean Film Archive. The English subtitles are there, you just have to turn them on.<br><br>A film for those who like exploring outside of the mainstream oddities.","user":"Mike_Olson","rank":[9,10]},{"title":"I Can See The Strings On The Butterfly Of DEATH","rating":6,"date":"29 January 2020","review":"Tells the tale of life and death and s···. Woman Chasing The Butterfly Of Death has all the makings of a very strange yet somehow philosophical Korean horror film. Unfortunately, I'm ambivalent with this one. It does have some \"interesting\" if not cheap ass special effects, some weird moments and an interesting concept but in typical South Korean fashion it's moves slowly and there is too much idle chit chat fillers and it's 25 minutes too f···ing long. It's not a disappointment but it's only worth watching once or twice at the most.","user":"ThyDavideth","rank":[0,0]},{"title":"Just wow. Wow.","rating":6,"date":"12 December 2019","review":"Also known as The Girl with the Butterfly Tattoo or The Killer Butterfly, this South Korean film, directed by Kim Ki-young (The Housemaid), is something else. I mean, Mondo Macabro is already known for releasing slabs of pure mayhem, blasts of eye-rendering insanity that those with normal brains may not make it through. And even they said, \"Over the years we've released some pretty strange movies here at Mondo Macabro. But this might very well be the strangest yet.\"<br><br>Um, wow. Just wow.<br><br>After a young man survives a picnic date with a girl who wants to poison him, he falls into a suicidal depression. Of course, their date gets started because he's trying to poison a rare butterfly and she thinks that whole thing is kinda hot. Different strokes, as they say. She was waiting for another guy to show up and do the orange juice suicide pact with anyways, but our man shows up and barely survives.<br><br>He'd kill himself if it wasn't for a Nietzschean bookseller whose will is so strong that he refuses to die, even when buried alive or set on fire. Then there's an ancient mummy whose skeleton transforms into a gorgeous woman who just so happens to be a cannibal. They have a night of passion that's punctuated by them getting blasted with dough from an automatic bread making machine.<br><br>And oh yeah - the archaeologist who wants the skeleton is also trying to get his daughter some aardvarking. Then there's a masked grave desecrator, a cop on the trail of all this murder and yes, a beach dance party.<br><br>As Stan Lee would say, \"True believers, this one has it all!\"<br><br>This being a Mondo Macabro release, it's packed with so much more, including audio commentary from Kenneth Brorsson and Paul Quinn of the What's Korean Cinema podcast, as well as interviews with actress Lee Hwa-si, producer Jung Jin-woo and cinematographer Koo Joong-mo.<br><br>You know those YouTube lists of Top Ten Mindblowing movies that start with Donnie Darko and don't go any further than that? If your list of messed up cinema is similar, you might not be ready for this blu ray. But if you're looking for the blu ray equivalent of 900mcg of weapons-grade LCD, good news. This is certainly the movie you've been looking for.","user":"BandSAboutMovies","rank":[0,0]}]