[{"title":"PERFECT movie if you are looking for goofy entertainment.","rating":8,"date":"17 January 2000","review":"Most importantly, Knock Off is unlike any other Van Damme movie.  It is much more like your Hong Kong action movie, and is actually quite better in the action respect than any of his other movies.  Rob Schneider is really funny, and the acting (even from Van Damme) is pretty good.  Probably the best thing about this movie is it's cinematography, which has such great shots as the foot-cam, the shoe-cam, and the box-cam, in which a little window opens up so you can see Jean-Claude's hand as it's reaches into a box!  This movie is great for one goofy laugh after another, while not beeing too bad to watch.  If you see it, rent it!  If you like it, buy it!","user":"elsmacko","rank":[14,15]},{"title":"Pure Genius! A modern epic!","rating":7,"date":"7 January 2001","review":"How can anyone hate such a beautiful film?  The combination of poor dubbing, Van Damme's \"acting\" and \"grasp of English\", Schneider's queer-ass jokes, and Lela Rochon's breasts, I thought, would make Knock Off an Oscar contender for sure.  In addition, it is a valuable tool for young amateur cameramen.  They clearly just bought a new camera before they started filming, and were trying out all the new gadgets (when Van Damme reaches into the box of watches, or when they go into the barrel of the gun, or when they pan up from everyone's feet, or use multiple exposures to create the illusion of a quality film).<br><br>As for the soundtrack, Ron and Russell Mael deserve a Grammy, or, at eh very least, a Source Award.  I mean, \"It's a Knock Off\" emerges as the single that will truly be the soundtrack for the lives of teens in the new milennium.  All-Star Sam Hui also contributes to the album.  His ground-breaking \"Ten Girls\" ,which goes a little sumthin' like this:<br><br>\"Sal pon ass hi cow go yang si ming ming hi lo how wow bom hi sam chung gay yeah chop hay bing si ching chun may li chow mo so pli\" ...is sung by Van Damme.  It speaks to you. It tells you to leave the theater.<br><br>Another interesting aspect of this film is that it was the only Western film allowed to be in production in Hong Kong during the handover to China. They try to work this into the first action sequence (which is 90 minutes long and followed by the credits)by making sporadic, frenzied, obscure references to the ceremony that don't make sense or have any effect on the outcome of Van Damme's struggle against the Russian mafia.<br><br>Ultimately, if you want to see green explosions, Paul Sorvino returning from the dead, Rob Schneider and Van Damme engage in S&amp;M during a rickshaw race, Lela Rochon's breasts, and a Russian with bronchitis chop people up with his eyeglasses, Knock Off is the movie for you.","user":"beirnesteinbear","rank":[35,42]},{"title":"Excellent Van Damme film!","rating":8,"date":"30 January 2000","review":"Knock off is Van Damme`s second movie to be directed by Hong-Kong director Tsui Hark. The story and acting of this movie is not important at all, because it focuses mainly on its many actionsequences. Van Damme is good as always, and the movie contains many well-directed actionscenes. Don`t watch it if you prefer quality acting, realistic characters and stunning special-effects, because this movie is a low-budget action-flick made for the fans of Van Damme. 8/10","user":"action-6","rank":[33,42]}]