[{"title":"topnotch drama about the strength of family","rating":29,"date":"29 April 1999","review":"I must put in a word of defense for this excellent movie, which was sadly underrated by both critics and audiences. The true story - of a Polish baker in Pittsburgh who raised his orphaned grandson at the age of 70+ and put him through medical school - sounds like a formula for sentimentality and cliches. However, the movie transcends that to become a moving story of the strength of family, with many wonderful touches of humor. Peter Falk's portrayal of the irascible, curmudgeonly, and indomitable Rocky Holzcek dominates the movie. We are made to care about all the people portrayed. I don't understand the criticism about the movie \"not having a story\" to tie it together. The changing relationship of Rocky and his family as the years go by has plenty of elements of drama. This movie touched me deeply. It's a real sleeper.","user":"rupie","rank":[16,16]},{"title":"Personally, I loved it.","rating":10,"date":"4 December 2004","review":"I am not much of a sappy movie kind of guy, but I for one LOVED this film. Peter Faulk performs splendidly. Although slow in a few parts, the storyline more than makes up for it as it shows the trials and tribulations of family separated and joined together by generational gaps. Julian Moore give a great performance and looks absolutely beautiful in this film, even though her character is not as in depth as the main characters. And DB Sweeny shows that he can have a softer side, as well as a wise cracking smooth talking side. It was a little bit of a stretch from what he is normally known for doing, but he pulled it off very well. Roommates is definitely going into my collection. I give this one 8/10. Bravo guys.","user":"confushus6","rank":[11,11]},{"title":"An amazing film","rating":9,"date":"8 January 2002","review":"Roommates is one of my favorite movies. I have no idea why it was largely ignored by critics and the general public as well. The remarkable chemistry between Rocky and his grandson is just incredible. The story never fails to touch me - even after quite a few viewings!","user":"pjgeerlings","rank":[10,10]}]