[{"title":"A great Movie, Overlooked by too many","rating":8,"date":"18 January 2005","review":"This movie has 2 stories that that run side by side, depicting the same image of war from different perspectives.<br><br>Denzel's story is one of sadness and guilt over the death of a friend during the Gulf war, a friend that he himself killed in a 'Friendly Fire' incident, during the confusion of battle. His country won't let him speak, and they shower him with medals; this only adds to the pain that begins to tear him apart.<br><br>Denzel's Character is given an assignment to determine whether a female helicopter pilot (Meg Ryan) deserves the medal of honour.<br><br>Meg's story, played out in flashbacks, is about a helicopter pilot and her crew saving a handful of soldiers, from the Iraqi onslaught. She is the first female to be considered for the medal of honour, and the question is, does she deserve what the American people would so love too see her receive.<br><br>Denzel, determined to get this one right, collects evidence and testimony from Ryans crew and the men that were saved. The problem is, Denzel's superiors want this medal awarded, but the simple truth is difficult to unveil. Every shred of evidence leads to more and more uncertainty as to whether this medal should be awarded.<br><br>Truly compelling direction and very special character portrayal make this an extremely enjoyable, very dramatic movie.<br><br>If you've over looked it, then give it a try. I think you'll be glad you did.<br><br>8/10","user":"mjw2305","rank":[79,90]},{"title":"Worth Watching","rating":7,"date":"27 July 2003","review":"The story is a simple one. Washington is a Lt. Colonel responsible for some accidental deaths during a tank battle in the Gulf War. The experience leaves him feeling pretty lousy. He neglects his family and begins drinking. He's assigned to investigate the suitability of Meg Ryan as a posthumous recipient of the Medal of Honor. She was flying a medevac helicopter to a crash site when her aircraft was shot down by small arms fire and, apparently, she stayed behind voluntarily and ordered her crew to save themselves while she covered them. Washington interviews the crew members and gets different stories. In one story Ryan behaves heroically as described. In a second, she is a coward and collapses under fire. In yet a third, the truth emerges. Yeah, it's Rashomon, but not as original or subtle.<br><br>Still it's pretty good. And, Gott sei dank, it is not a story in which a woman proves herself as a good as a man, despite the fact that she is a member of the weaker sex. (What condescension.) Meg Ryan is a capable and courageous officer who happens to be a woman. Her sex is important to the politicians who are positively drooling over the prospect of awarding her the decoration, but isn't really important to the narrative.<br><br>The performances are better than I'd expected. Everyone, in fact, is quite good in their different ways. Matt Damon, in particular, gives a sensitive performance as a guilt-ridden medic, and looks the part, somewhat ascetic, his facial features askew with uncertainty. Meg Ryan doesn't have a chance to do more than shout orders with a Texas accent but she registers pain and determination well. Lou Diamond Phillips is perhaps the least articulated character, but that may be the fault of the role as written, which is fairly complex but a little obvious. Denzel Washington is the central figure. He's good as carrying that burden of guilt left over from his battlefield mistake but isn't too convincing as a drunk. In the end, he relieves himself of some of that torture by visiting the parents of one of the men he had killed and confessing his part in the incident. The first few times I saw this I kept thinking what some other actors would have done with this scene, but the last time I found his incarnate remorse rather moving.<br><br>There is one scene delicately shot, an uneasy exchange between the lying Damon and the perceptive Washington that's beautifully staged and acted, and another memorable first encounter between Washington and Phillips, in which both actors probe the edges of insubordination. Michael Dolan stands out in a featured bit part as a hospital orderly.<br><br>The battle scenes are well done, although a little confusing, as I'm sure they would have been at the time. Some generic conventions are adhered to. Four of our guys can slaughter dozens of them. The enemy runs headlong into a hail of bullets. But there are some interesting twists given to the situation. The Iraqis on the other side of the hill can be heard laughing at our boys (and our woman). And the ending is revisionist, but I won't go into it. Justice outs, let's say that.<br><br>It's a worthwhile watch for any number of reasons. Craftsmanlike if not poetic.","user":"rmax304823","rank":[44,55]},{"title":"Profound, intelligent, and moving; one of Zwick's best...","rating":8,"date":"6 November 2008","review":"Edward Zwick's second war-based movie (following the successful GLORY) is almost as good as his first, and every bit as watchable. I have particularly liked stories that use different viewpoints to tell the same story (hence creating different versions of the same story). These types of movies stemmed no doubt from Akira Kurosawa's epic RASHOMON, and while films that use this strategy rarely live up to Kurosawa's original in terms of intelligence and portrayal (the most recent being the slightly-better-than-mediocre VANTAGE POINT), COURAGE UNDER FIRE is still a rewarding Motion Picture.<br><br>Denzel Washington is near his brilliant best as the troubled Lieutenant Colonel on the verge of alcoholism due in part to his overwhelming feelings of guilt following a military procedure gone wrong. His depression and curiosity fuel his determination to get to the bottom of the 'mystery' even if it puts him out of favour with his Commanding Officers. Meg Ryan is equally superb, and as each re-telling of the story demands her to take on a different personality (similar to the female lead in RASHOMON), she manages to pull each one off effectively. Matt Damon puts in a reliable shift, even losing upward of 20 pounds to take on the role. For me, the biggest surprise is Lou Diamond Phillips who is actually quite watchable, and does not overact, as is his tendency.<br><br>Zwick's COURAGE UNDER FIRE is an examination of war from a less visceral point of view, and will stay with the viewer long after watching the movie. It deeply delves into themes of responsibility, guilt, and truth in an overall compelling Motion Picture. The script is effective and the buildup to the somewhat sentimental ending is quite commendable.<br><br>8/10. 3.5 stars (out of 4). Highly recommended. Should enter my Top 200 at around #183.","user":"varundelpiero","rank":[22,26]}]