[{"title":"Gabriel Byrne steals the show ...","rating":5,"date":"5 October 2003","review":"... his version of \"My Way\" is hysterical (especially after I read somewhere that he truly thought - before he heard himself later - that it was Paul Anka that was out of tune and not himself!) and he gets all the best lines. That said, I thought Jeff Goldblum was also excellent - more understated than the rest of the characters which was a good foil for them.<br><br>The film is just simply great fun.  It's not a classic, clever masterpiece of its time, but it is immensely enjoyable and well worth seeing at least once.","user":"shellemk","rank":[28,33]},{"title":"Misunderstood yes. Terrible film? Heck no!","rating":2,"date":"2 August 2001","review":"Despite the disparaging comments by other reviewers here, and the savaging this film received by mainstream critics, I've got stand by my original assessment of the piece which I made in 1996 on its release. This is a taut, sardonically funny, very well done flick, and I think it's detractor's may be missing the point a bit by pointing out that it plays like a rough draft. Were not many of the so called `Rat Pack' movies nothing more than hastily thrown together vehicles for whatever `Packer' happened to be starring? Of course it's rough around the edges! Of course it never seems to be getting its own joke! Unfortunately the joke ends up being on the film itself because it does its job too well. It looks at the genre from the coatroom, behind a row of smoke-scented overcoats. If it looks and feels like the reels were left on a smoky card table for a few weeks before being run - then it's doing its job. It's that very patina that gives Mad Dog Time it's credentials as a well done and mutli-faceted darkly funny movie that belongs not so much with it's erstwhile Rat Pack brethren as has been suggested so often, but rather with The Player and other movies whose joy, in part, is the fact that the players are so clearly having a ball making the thing. Goldblum and Dreyfuss stand out from an altogether superb cast. Goldblum for his ability to keep the audience guessing as to whether or not he really feels as confident as his character acts throughout and Dreyfuss for proving that nobody in the business can look both smugly amused and supremely confused at the same time as well as he. That's all I have to say. Now I think I'll hop home, pack my bags and leave town.","user":"corky244","rank":[29,39]},{"title":"Strange and Interesting, a Classic of film art","rating":9,"date":"20 April 2012","review":"If the Godfather can be rated as the greatest of realistic crime or gangster movies then Mad Dog Time should be rated as the greatest of surrealistic movies. This is a film which takes the serious reality of the mob world of killers and shows them in a strange weird way that should rate this film as one of the great films of the cinema art. It is like watching mobsters in a way the painter Picasso viewed reality with his famous Cubism. In some ways it is Film Noir but in other ways it is comic and even romantic. If you want to see a different kind of crime movie that is well acted and whose meaning may be no more than the art of strange film or showing what creative film making can do, then catch this one.","user":"rekall1900","rank":[12,15]}]