[{"title":"I can't help myself when it comes to Harrison Ford...","rating":8,"date":"30 December 2005","review":"I rented this a few days ago having discovered it was a Harrison Ford movie I somehow missed. Even though I'm a big fan of his, I really didn't expect much based on the jacket description. But, Eureka! I was completely charmed by this movie. Ford has a very low key way of delivering comedy and when you see a manly man like him being funny, it is all the more hilarious. Anne Heche is captivating as the gamin New York fashion sophisticate who happens to be very smart &amp; sassy but grounded. She also has a tremendous flair for comedy and she plays off Ford in a grand way that Melanie Griffith couldn't even dream about doing in Working Girl. Griffith sleepwalked through that script whereas Heche embraces her character fully.<br><br>There is a very unique thing that happens in this film that we don't see very often and that is how the romantic chemistry builds between the lead characters. It is as natural as the flora and fauna of the island they are trapped on - rather randomly and sometimes awkwardly taking root - and I give a lot of credit to Reitman for capturing this feeling between Ford &amp; Heche. With most films like this, the leads either hop into bed right away and then sort out their differences, or there is no indication of increasing mutual affection until the last 10 minutes when someone slaps their forehead and a light goes on. In this movie, you see so many small moments when one character is creeping into the heart of the other. Despite this, it never gets sappy.<br><br>I'd rate this movie as a 7 but am giving it an 8 to try to raise its overall score. It's a very, very good romantic comedy with a funny script, witty direction, great tropical locales, and an eclectic but engaging supporting cast.","user":"jax713","rank":[70,83]},{"title":"It's like a small vacation","rating":8,"date":"1 November 2009","review":"I don't write many reviews, unless I really feel close to the movie or believe it was unfairly rated, like this one. This movie has found it's way back to my DVD player several times since it's first release to DVD about 10 years ago. It whisks you up from your easy chair to a sunny vacation spot in the Polynesian Islands and never slows up or misses a beat. One scene moves to the next in a seamless manner often foreshadowed by a soundtrack that is very good and quite catchy.<br><br>The film was well cast with Harrison Ford as the crusty cargo pilot - Ann Heche as the assistant editor of a fashion magazine - David Swimmer as her pasty but very nice fiancé and Jacqueline Obradors as the beautiful but dingbat club dancer. This romantic comedy and action adventure film pits two people together from different backgrounds and age groups. Normally the two would never get along long enough to get to know the other. But, forced to spend time together and under challenging conditions, a small attraction begins to develop and grow stronger. The character development of the cast moves forward with the same speed as the rest of this cute story.<br><br>While the film is certainly not for everyone, judging from IMDb ratings and rotten tomatoes, I really believe it was the message and not the movie that failed to impress. This story expresses a throwback to traditional values in the relationship of Ford and Heche and their experiences on the Island. This may explain the reaction to the film by many of the younger viewers. Some of the more mature viewers may have been turned off by news of Ann Heche and Ellen Degeneres in real life. This may explain why some seem to love the movie, while others have curiously rated it rather poorly.<br><br>In any case, if you need a quick escape and love flying to beautiful Polynesian Islands loaded with beautiful scenery and good-looking people, then his film may be your ticket!","user":"Bogie27","rank":[25,29]},{"title":"See Whatcha Get","rating":10,"date":"24 July 2005","review":"This film probably wasn't made to make you laugh nonstop, but when they turn on the humor, the writers and those involved with the final cut have very nice timing and awesome lines! This movie is one of my favorites, because if i'm having a bad day...they (Heche and Harrison) are having a much worse one and manage to pick up my mood with the delivery of lines that make me laugh, so, yeah the humor. But also the style, pacing, and emotional involvement they make me feel as a viewer. <br><br>I'm invested. And though I may think that Schwimmer's character is a shmuck, I can understand his POV, so, he's okay. <br><br>David and the cast did an outstanding job, and while the filmed script may not have been the original one (I'd love to see it sometime) the end result is fabulous. If you haven't seen it, you should, and I hope you too laugh, and smile, and chuckle, and enjoy a rather grand movie. Enjoy!","user":"reesesb4mnms","rank":[34,43]}]