[{"title":"So Much More Than Cannibalism","rating":9,"date":"12 July 2000","review":"If someone were to ask what Ravenous is all about, the easiest thing to say would be: `It's about cannibalism in a remote Army outpost in the 1800s.' That's exactly right, and that's probably what kept audience members away from Ravenous when it briefly ran in theaters back in 1999.  Cannibalism? Who needs to watch that?  Indeed.<br><br>Yes, there is cannibalism in Ravenous.  Quite a lot of it, in fact.  The film is steeped in murder, the eating of human flesh, and is flavored with madness.  At times the film can be downright difficult to watch, though the compelling nature of the narrative keeps the viewer's eyes locked on the screen for the full ninety-eight minutes.<br><br>Ravenous is so much more than a meditation on people eating other people, though it's obvious there was a great deal of confusion about how exactly to present this dish to the public.  Its plot is fairly simple for the first half: Mexican War hero (and hidden coward) Lt. Boyd, played by LA Confidential's Guy Pearce, is assigned to an end-of-the-Earth fortress in the western Sierra Nevadas.  This fort, populated over the winter by a tiny handful of misfit officers and enlisted men, receives a visitor in the person of a starving man with an awful story of a failed mountain crossing that eclipses the Donner Party's.  What happens then is so twisted, but skillfully crafted, that it would be criminal to spoil what transpires.<br><br>But Ravenous is not just a horror story.  What lies at its heart is an allegory about man's relationship to other men and how society structures itself around the powerful and the powerless.  Issues such as the morality of Manifest Destiny and even the ethics of simple meat eating are touched upon.  Guy Pearce gives an underplayed performance so low-key that he almost vanishes into the film stock, while co-star Robert Carlyle (most recently in The World is Not Enough) plays opposite him with delightful nuance.  The material even brings deeply textured work out of Tim Burton stalwart Jeffrey Jones as the commander of the fort, and scattered around these three are solid supporting actors like Jeremy Davies, who's much better here than he was in Saving Private Ryan, and David Arquette.<br><br>If anything works against Ravenous at all, it's the curious inclusion of humor at the outset of the picture.  Director Antonia Bird, who also made Priest and Safe, is not known for her lighter side, which makes the appearance of a goofy epigram at the very start of the picture, and the use of some bizarrely inappropriate music during a later sequence, seem more like some producer's half-hearted attempt to blunt the sharp edge of the film's commentary with silliness.<br><br>Luckily for the viewer and the film, however, Ravenous is far too powerful a motion picture to be undercut in this fashion.  By the time the final reel has passed, any memory of earlier missteps is forgotten as the pace grows more deliberate and the action becomes bloodier and bloodier up until the final moments.<br><br>Unjustly neglected on the screen, Ravenous is a film with a great deal to say.  It's only too bad that cannibalism was the best way to say it.","user":"James Kosub","rank":[155,176]},{"title":"Not only underrated, completely misunderstood","rating":10,"date":"30 March 2001","review":"I don't know whether the previous comments on this film show how badly the film was marketed (I never saw any advertising for it) or whether they're a terrible condemnation of just how tunnel-visioned people can be.  This is only a horror film in the sense that Macbeth is or The Godfather.  It's about the horror of monstrosity, particularly the monstrosity inside ourselves.  It's not about cannibalism, nor is it a black comedy.  It has those things in it, but they are not it's raison d'etre.  It's about the horror of war, conquest, taking things which don't belong to you with the sole justification that that's how you get ahead in life.  You have what the other man has literally by consuming it. The hero of this film is branded a coward when really all he's done is preserved himself from the madness going on around him, a fight in which he has no part, just like this one.  And yet, I see reviewers here referring to his 'cowardice' as a given.  They haven't even got to first base about questioning whether he might not actually be a coward in the first place.  It looks like everybody's checked their brains in at the door with this one.  I'm glad I  never directed this movie, it would be soul-destroying to be this misunderstood.  It's a great movie.  Savage, brutal,poetic. You watch the whole thing with your mouth hanging open in sheer disbelief.  It's a feast for the eyes and ears and has one of the most fey, eerie qualities I've ever seen in a film.  It's a masterpiece and I would urge anyone out there who can leave their preconceptions and genre expectations at home to see it.  Give yourself a treat - be amazed.","user":"Chancery_Stone","rank":[165,192]},{"title":"Delicious horror film.","rating":8,"date":"30 November 2003","review":"Antonia Bird's \"Ravenous\" is one of the finest low-budget horror movies of recent years.It's a brilliant mix of cannibalism,gruesome gore,sly black humour and quasi-philosophy.The script by Ted Griffin is absolutely stupendous.It's an irresistible blend of Native American legend(you absorb the strength or spirit of who you eat),the Donner tragedy,and the story of Sawney Bean.Bean with his wife and his numerous offspring,dwelt in a cave in Galloway,Scotland,during the sixteenth century.The family cave was close to the sea and they lived by highway robbery:ambushing,killing and then eating passers-by.Any parts of the body which they were not able to eat once were pickled in brine or hung in their cave.Over a period of twenty-five years it was proved that Bean and his family were estimated to have killed and eaten more than a thousand people.The acting is wonderful-Guy Pearce shines in a difficult role as a Lieutant John Boyd.\"Ravenous\" was shot in the Czech Republic and Slovakia,and the landscape and climate is put to fantastic use.The score by Damon Albarn(of British band Blur)and Michael Nyman is very spooky and atmospheric.The film is loaded with brutal violence and gore,so if you're squeamish give it a miss.However if you're a horror fan with a taste for something dark and sinister,then you're in for a rare treat.Highly recommended.","user":"HumanoidOfFlesh","rank":[97,117]}]