[{"title":"Comedy Classic!","rating":10,"date":"12 August 2013","review":"I am really shocked by this movie's super low rating of not even five out of ten, I figured it probably would be kind of low since it was not as good as Chris Elliott's TV show Get a Life and a lot of people didn't like his humour or this movie, but it was pretty good. It's obviously not for everyone with a really \"out there\" sense of humour but for what it was it was really funny, with a lot of laugh out loud gut busting moments. David Letterman's \"wanna buy a monkey?\" cameo is fantastic and Chris Elliott is great as the full of himself, super annoying rich kid turned cabin boy. I really recommend it if you like any of his other work or Get A Life.","user":"siavash_khavarnejad","rank":[15,15]},{"title":"misunderstood comedy is a true masterpiece","rating":10,"date":"2 May 2005","review":"what can be said of cabin boy's idiotic genius? Chris Elliot proves he is the master of absurd comedy in this one of a kind, off the wall masterpiece! I'm almost ashamed to love it so dearly. The movie propels itself through a bizarre mythological backdrop using Elliots uncanny knack for brilliant, stupid, amazingly funny dialog and antics. Cabin boy stays true to all that is Elliot from beginning to end. It doesn't change its mind halfway through, and is too unassuming to attempt to deliver any heartwarming morally relevant conclusion. Chris Elliot's antihero is so lovably hate able that you feel the desire to both punch him in the face, and gently rock him to sleep in a comfy blanket. This comedy is probably not for everyone, but the payoff for those who understand its naive, cynical hilarity is worth the rental fee. Hell, you can buy it for under six bucks almost any where. It is truly a misunderstood work of pure cinematic bliss.","user":"moore9157","rank":[48,56]},{"title":"God, I love this movie...","rating":8,"date":"9 January 2007","review":"No, not in the 'it's so bad it's good' way. I truly think it's one of the funnier comedies of the last 20 years or so. Perhaps a lot of it depends on how you feel about Chris Elliot to begin with. I think he's priceless. Used to love his old show Get A Life and have followed him ever since. The plot of this, kind of a twisted version of Captains Courageous, really doesn't matter. What's fun are the numerous sight gags, Elliot's constant barrage of sarcastic one-liners and the generally anything goes attitude of the whole enterprise. The ship's crew, filled with a number of character actors we're not used to seeing in this kind of thing, are a wonderfully sleazy bunch. David Letterman's hysterically amateurish cameo at the beginning is the stuff of legend. \"Wanna buy a monkey?\" Ha! OK Citizen Kane it ain't. I own that on DVD btw. Right next to it is Cabin Boy.","user":"rich56","rank":[9,9]}]