[{"title":"Haunting & darkly erotic tale of teen alienation","rating":8,"date":"15 January 2007","review":"Drew Barrymore turns in the most memorable performance of her career, in this strange, beautifully filmed tale of betrayal and teenage alienation. The introverted Sylvie meets the mysterious Ivy at the posh private school they attend, and become fast friends. It seems Sylvie idolizes Ivy just a bit, for her beauty and fearless, outgoing style. And Ivy, coming from a broken home, begins to envy Sylvies life, as Sylvie lives in a gorgeous home, and has a mother and father who care deeply for her. The tale is more sad than suspenseful, and this is more of a teen drama than 'an erotic thriller. The friendship that develops between the two girls is done in a very believable way, and it is sad when things begin to go wrong, and it becomes clear that Ivy has some deep emotional problems. The plot here is not so original, but so many elements elevate 'Poison ivy' above other films of this type. The acting all around is impressive; Cheryl Ladd is beautifully fragile as the sick, bed-ridden mother, and the relationship that develops between her and her daughter's mysterious friend is touching, as the two look very similar. It is obvious that when 'Georgie' looks at 'Ivy' she is reminded of her own youth, and her own days of being wild. And this is how the connection develops between the mother and Ivy. The daughter unfortunately is unable to connect with her own mom, as the two are so different. 'Gerorgie,' like Ivy, is blond, pretty, and glamorous, while Sylvie is mousy-haired and wears glasses. This causes immediate, but subtle tension between the two girls from the outset. Tom Skeritt is perfect as the brooding, wounded husband, who feels abandoned by a wife who has given up on living. This fact makes him easy prey for Ivy as well, whose desire to become a part of this family soon escalates to a disturbing level. Sara Gilbert is likewise perfectly cast as the shy but intelligent Sylvie. So much attention is paid to small details, which is so important with films of this sort. Ivy's tattoo, which turns out to be fake, and the Egyptian eye that is shaved into Sylvie's scalp, gives these characters depth. The film possesses a strong, atmospheric tone, and Ivy's strange, childlike sexuality has an almost hypnotic quality about it. The background music as well, is lush, and darkly romantic. And many scenes are absolute eye candy, and truly erotic. Among them, the scene where Tom Skeritt's character 'takes' Ivy on the hood of his Mercedes in the forest, while the rain pours down and that haunting melody plays; classic. And the film succeeds in being erotic without being very graphic, and this is not easy to accomplish. I was lucky to see this in the theater, and was happy to find the DVD, which contains both versions of the movie, the theatrical, 'R' rated version, and a slightly more graphic unrated edition. There were some sequels to this, that were released straight to video, and are, not surprisingly, terrible exploitation trash that has nothing to do with this legitimate film. 'Poison Ivy\" is an above average 'teen angst' film, and deals effectively with it's subject matter. Recommended, especially for fans of Drew Barrymore. Fans who are only familiar with her more recent films will be amazed at how great she is, and how amazing she looks, in this very special film.","user":"Falconeer","rank":[33,37]},{"title":"Better than it should be","rating":12,"date":"12 March 1999","review":"By all rights this should have been yet another R-rated sex and violence flick about a piece of immoral jailbait having her wicked way with everyone around her, but the directing and acting are good enough to make it more effective than most, even touching.  The atmosphere is almost haunting, and the relationships between the characters (especially the two teenage girl leads) are well developed enough to hold your interest.<br><br>Sara Gilbert gives the film a sympathetic center, she's excellent as a bright, likeable high school girl who finds herself in far over her head when she befriends poor little bad girl Drew Barrymore.  Her misery and frustration as Barrymore takes over her family, her life, even her dog are moving enough to make the flimsy story work.  Barrymore wasn't much of an actress at that age (still isn't, in my opinion), but she's very effective nonetheless.  She doesn't need to act, she needs to do what she does, look sexy.  Really, really sexy, like it's all she ever thinks about.  Cheryl Ladd also does surprisingly well as Gilbert's slowly dying mother.<br><br>The movie also has moments of an almost haunting quality.  The score is lovely, alternately passionate and strangely moody, and gives the film enough emotional intensity to make me forgive its many flaws.  Even Barrymore kissing Gilbert.  Eeeew.","user":"otter","rank":[41,48]},{"title":"A movie that's more about loneliness than it is an erotic thriller","rating":9,"date":"27 November 1999","review":"I really enjoyed the two main characters in the movie - Cooper ( played by Sara Gilbert ) and Ivy ( Drew Barrymore is brilliant in this character ). The film focuses on there friendship and feeling alone as a teenager. I really liked the dialogue between the characters. Especially when Ivy meets Cooper's mother ( played by Cheryl Ladd ) and talks about her own mother and how she flinched every time she touched her and how she died long before she really did. It's just great. Ivy's loneliness soon starts to evaporate as she gains a mother in Chery Ladd, a friend in Sara Gilbert, but then she sets her eyes on Cooper's father ( played by Tom Skerrit ) and wants him in an intimate way. And this is where the movie starts to get erotic as she seduces her best friend's father. But Cooper is starting to see Ivy's evil intentions .....","user":"Firefly-28","rank":[24,30]}]