[{"title":"Gripping...","rating":5,"date":"5 July 2002","review":"Misery is a dark, but witty venture into Stephen King territory.  It's about a popular novelist who crashes his car on a snowy mountain road and is rescued by a nurse who claims she is his number one fan.  As the time goes by, he realizes she has no intention of letting him leave.<br><br>The film moves with a brisk, taut pace thanks to director Rob Reiner, who helmed another excellent Stephen King film, Stand By Me.  Tension is kept mostly throughout (there are some predictable moments...but who cares?) And the performances are also a major plus.  James Caan is very easy to empathize with, and he manages to keep his cynical sense of humor. Richard Farnsworth, as a grizzled sheriff was a nice addition to the film since his character didn't exist in the book.  He also has a nice sense of humor, and he's the kind of guy who you want to root for.  But the most amazing performance is from Kathy Bates, who treads a fine line alternating between sweet and lovable to amazingly evil.  She won an Oscar for this movie, and whole-heartedly deserved it.<br><br>Side note:  This is one of the few films which took an Oscar, that you can actually say the Academy had the guts to give out.  Can anyone name another horror film which won such a notable prize?<br><br>ANyway...by the end, the novelist and the viewer or put through some torturous activity.  We sometimes feel his pain, and it is so much fun to hate this woman................the book is excellent.....the movie is just as good in about 1/6th of the time it would take to read.  Either way, enjoy!","user":"goodfellamf","rank":[146,175]},{"title":"One of the best thrillers of the 90's.","rating":9,"date":"8 September 2017","review":"Misery is without a doubt one of the finest movies of the 90's and one of the best movies in the thriller genre. It is an ingeniously crafted horror masterpiece that seamlessly intertwines its incredibly tense and cleverly paced story with inventive cinematography, tight editing and exquisite performances. In my opinion Misery is one of the better adaptations of Stephen King's works and truly a movie that cannot be missed, especially for the genre fans.<br><br>Paul Sheldon (James Caan) is the author of a successful series of romance novels about a character called Misery, who decides to take a more serious approach regarding his future novels. On his way to publish his new manuscript, Paul drives from his hotel in Silver Creek to New York. Due to the extreme weather conditions, he has an accident that leaves him severely injured and hopeless. A local nurse named Annie Wilkes (Kathy Bates) finds Paul and brings him to her remote home in order to help him recover. Claiming to be his number one fan, Annie discovers that in his last Misery novel her favorite character dies and then her obsession about him takes a dark and twisted turn as a long story of captivity and abuse begins.<br><br>The direction by Rob Reiner is phenomenal and on a Hitchcockian level as the film has a plethora of perfectly crafted suspenseful moments that have the audience on the edge of their seats from the beginning till the amazing climax. The editing of the movie is also flawless, as the shots are specifically designed to induce tension in any moment they can. The cinematographer and Reiner both ace the perilous atmosphere of the picture, using close up shots of the moonfaced Wilkes both in her fits of rage and kindness which magnifies the polar extremes that Wilkes is prone to unexpectedly visit. What is also triumphed is the slow convergence of the audience and Paul Sheldon. The movie received a lot of critical acclaim, especially due to Kathy Bates' chilling and memorable performance as Anny Wilkes that earned her the 1990's leading actress Oscar award, which remains the only Oscar ever given to a Stephen King film adaptation. No matter how great Kathy Bates' Oscar-winning performance is, James Caan's cannot go unnoticed as it definitely qualifies as one of the best performances in his extensive career, despite how demanding and challenging his role as Paul Sheldon was.<br><br>In conclusion, Misery is a dark and tense masterpiece that is an amalgamation of excellent direction, skillful writing, taut editing, amazing cinematography and stellar performances, which succeeds into creating the feeling of captivity and helplessness that the thriller genre was purposefully built for, and that makes it one of the best movies of the 90's and one absolute classic in its genre.","user":"notoriousCASK","rank":[45,51]},{"title":"Perfect performances by Bates and Caan","rating":9,"date":"7 May 2003","review":"Based on the novel by him, 'Misery' is a real Stephen King film. It is a drama film, but also a thriller and sometimes even a horror. In one scene the horror is very clear, you will know what scene I mean.<br><br>Writer Paul Sheldon (James Caan) gets in a car accident. He is helped by Annie Wilkes (Kathy Bates) who claims she is his number one fan. In his latest novel Sheldon has killed the favorite character of Annie making her a little mad. She keeps Sheldon in her home; he has to bring the character back to life in his next novel.<br><br>Bates, who won an Oscar, is terrific as Annie, one of her finest performances. James Caan who is in bed or a wheelchair most of the film is very convincing. The room he is living in is one of those spaces in the movies you will not forget very soon. Directed by Rob Reiner this is a great film, although it could be a bit slow for some from time to time.","user":"rbverhoef","rank":[129,161]}]