[{"title":"I have very mixed feelings about this movie","rating":7,"date":"26 June 2005","review":"When I was in 10th grade, I read the novel Lord of the Flies in English class, and right after that, we watched this movie. I really loved the novel so I was excited about seeing the movie. <br><br>The novel Lord of the Flies is very provocative. While it stands as one of the greatest novels of the 20th century, it also stands as one of the most controversial and frequently banned novels of the century. For a novel of that much greatness, it is hard for a movie to do it any justice.<br><br>Part of the reason for why Lord of the Flies is a classic and is still read today is because of its theme, which involves kids killing each other. There has always been a sensation and terror about that kind of theme. This movie tries to catch that theme, while it succeeds at being a disturbing movie, it fails at living up to the novel. There is also a lot of symbolism in the novel that isn't really present in the movie as well.<br><br>The directing in this movie isn't done very well. The beginning of the movie just kind of opens up and never really gives you much background. As the movie goes along, there isn't much of a flow to it. The book had a great flow which kept the story moving, but the movie was pretty choppy, and as you watch it, you don't think the director even cared about keeping the flow of the novel.<br><br>The child actors aren't much better. The kid who played Ralph was good, as well as the kid who played Jack. The kid who played Piggy was pretty good, but not quite up to par with the other two that I mentioned. The kid who played Piggy fits the description pretty well, and I kind of feel bad for him because his performance in the movie sort of affects how people look at him as a person. All of the other kids in this movie didn't do very well at all.<br><br>One of the key elements in the novel is done very poorly in the movie. In the novel there is a scene where the kid Simon sees a pig's head on a stick and has a conversation with it. In the movie all that happens is Simon looks at the pig's head and you see a flash of lightning. The director sure expects a heck of a lot out of the audience if he wants them to believe the kid is having a conversation. Another key scene from the novel, Piggy's death, was also done very poorly in the movie. In the novel it was shocking and depressing. In the movie it is depressing that he dies, but the scene looked pretty fake. There are also a few random things that were put into the movie and had not much impact on the story, like the glow stick, and the pilot who survives the crash, unlike the novel.<br><br>A couple of scenes in the movie are done pretty well. There is one scene where the kids are all gathering around the fire at night and are reenacting a hunt that took place. This scene is done pretty well, but the real key to that scene is the score in the background. The score is pretty good and helps guide the movie at times. At the very end, when the kids see the marine standing on the beach and they realize what they had done, the director did pretty well at showing the kids' emotions over what had gone on at the island. Unfortunately, the ending is very sudden and is over before you would expect it to be.<br><br>I loved the novel, but I have very mixed feelings about the movie. There are plenty of things in the movie that you will be disappointed by, but there are also some redeeming factors. It is worth watching once, but only if you have read the book. If you haven't read it, this movie will ruin it for you, so read the book first and then see the movie.","user":"FrankBooth_DeLarge","rank":[21,24]},{"title":"A Society Without Perspectives and Rules","rating":8,"date":"30 March 2007","review":"After a plane crash in the ocean, a group of military students reach an island. The boy Ralph (Balthazar Getty) organizes the other kids, assigning responsibilities for each one. When the rebel Jack Merridew (Chris Furrh) neglects the fire camp and they lose the chance to be seen by a helicopter, the group split under the leadership of Jack. While Ralph rationalizes the survival procedures, Jack returns to the primitivism, using the fear for the unknown (in a metaphor to the religion) and hunger to control the other boys. His group starts hunting and chasing pigs, stealing the possession of Ralph's group and even killing people.<br><br>I found this impressive movie very scary, since it shows the behavior of children (and human beings) fighting to survive in a society without perspective and rules. My immediate association was with my and other Third World countries, where many children are abandoned by the Government in their poor communities, and without education, perspectives in life and laws, become very young criminals working in gangs of drug dealers and thieves. In this movie, it is exposed how primitive a kid can be without the authority and respect, and this sort of violence is in the headlines of our newspapers almost every day. There are many discussions presently in Brazil about juvenile criminality. I have never the chance of reading this visionary novel; therefore I can not comment is it is a good or a bad adaptation, but I found this movie a frightening study of characters and sociology. My vote is eight.<br><br>Title (Brazil): \"O Senhor das Moscas\" (\"The Lord of the Flies\")","user":"claudio_carvalho","rank":[45,56]},{"title":"What golding was going for","rating":8,"date":"16 February 2006","review":"Though this movie could of been better in many areas it still fit into what Author William Golding was going for.<br><br>The transformation of the language in the movie is just to keep up with the time. Does any one believe this movie would gain any respect in this day and age if 9-12 year old children were going \"Wizard!, Wacco!, Doink!.\" (Actual quotation from point when they are excited). No of course not (By the way 9-12 year olds enjoy swearing more than any other age group). I know personally I would be laughing all the way through the entire movie, which would not portray the decay of mankind to politely. So, yes they came onto the Island swearing. But if you remember Jack was never innocent. Though he was eviler at certain points, he always had the evil side.<br><br>I believe other than the fact they were missing Simon's epileptic episode, the movie was a fine representative of the book. The beastie though clearly not a dead parachuter like in the book, still provided the same role as in the book. That is a source of false power to Jack.<br><br>Though the movie was a bit of a modern adaptation it still provided the same dark and hopeless feel of the book. I personally loved the book, the movie changed a few important events that I feel should of been left in. Either way the movie painted many of the scenes exactly how I imagined them and for that I give them credit. I just hope that if they make a modern adaptation they should be more creative, possibly change the setting, and the characters, but still have a similar plot. That way the audience has to fill in the blanks between the book and the movie so they are in suspense not critization of the dissimilarities between the two.","user":"Da_Piscator","rank":[20,24]}]