[{"title":"Underrated Conspiracy Thriller","rating":7,"date":"11 February 2006","review":"Snipes puts in a fine performance as Neil Shaw, a united nations defence agent who is wanted for the assassination of the Chinese U.N. ambassador at a time where U.S. and Chinese relations are already strained.<br><br>Snipes teams up with a beautiful U.N. translator (Marie Matiko) in a search for the truth behind the conspiracy that is engulfing the duo. The Art of War delivers action, thrills and good plot twists and overall is a satisfying thriller. However it is not without some minor flaws, the story although complex and interesting is somewhat dis-jointed in its delivery and the ending lacks impact, even if it does ring true to the plot line.<br><br>All in all 'The Art of War' is a good, yet less than perfect action thriller, that will certainly satisfy Snipes fans.<br><br>7/10","user":"mjw2305","rank":[25,28]},{"title":"Awesome guilty pleasure!","rating":7,"date":"10 July 2001","review":"Wesley Snipes has always been trusty in the action genre.  He has great charisma and looks totally cool when kicking the crap out of the bad guys. Ever since his breakthrough role in \"Passenger 57.\"  There are many great moments of action in \"The Art of War.\"  Sure, the plot is far from compelling, but the energy and fast pace keeps it fueled.<br><br>\n\"The Art of War\" is not a work of art, but it's a great popcorn flick and one that won't put you to sleep!  I just wish they could've done something about the cliches.  I'm not going to give anything away, so I'll just say, \"Why is it in these movies the characters never seem to know who their limo driver is?\"  It's an overused cliche and a cheap surprise.<br><br>\nMy score:  7 (out of 10)","user":"mattymatt4ever","rank":[31,37]},{"title":"What a good action movie should be!","rating":8,"date":"9 February 2002","review":"Disclaimer first: This is not Citizen Kane, obviously. But THE ART OF WAR is about as fun as an action movie can get.<br><br>\nYes, Snipes is a runaway agent wrongly accused, we have seen this in US Marshals and Murder at 1600 (by the same Writer.).  But this movie has two things that those movies lacked, STYLE and an enjoyable supporting cast. ART, with all its chase scenes and fight sequences (and there are a truck load), is beautifully shot.<br><br>The sets and camera work are great, and most importantly (partially because I live there) you buy that you are in NYC. Few signs of the Canadian stand in, Montreal. Everything is slick and well shot.<br><br>Behind Snipes are a great cast of action cronies, Maury Chaykin as Capella the FBI agent who doesn't know whether to arrest or help Snipes,  Marie Matiko, Julia the VERY attractive hostage/eyecandy (Hollywood should learn from the TASTEFUL handling of her strip scene) and a bunch of good character actors who could be of course our villain(s).<br><br>Yes, ART OF WAR has too many twists, it tries hard, too hard at times. But it is better than the other action flops that have stopped trying all together.<br><br>Bottom line this is The Fugitive meets James Bond (with a little Jackie Chan).  Its a fast paced, slick, action flick, that has half a brain in it. Snipes is awesome in it and should look to move forward from roles like this.  Ignore the cynical critics who are obviously trying to suck the fun out of action movies and see it.","user":"MAFfilms","rank":[10,11]}]