[{"title":"The white mafia's surgical knife.","rating":13,"date":"13 May 2018","review":"A portrait of a pushy surgeon :this man is so unscrupulous and so cynical that Luigi Zampa felt compelled to end his movie with lines that read : \"for one man like Valloti ,there are plenty of Doctors Schweizer whose main purpose is to relieve the human sufferings .\"<br><br>Professor Valotti appears first as benefactor , almost a saint: on their way to his office, a worker sings his praises to his pal who ,he claims,can be treated for free ;when they enter the place ,lots of people call Valotti a saint on Earth .When he talks to his students in the university, he insists they must treat the poor the same way as the poor.But the young ones are not really fooled .<br><br>It's just a front ;the man reigns over his peers ,he makes them work for him , he may help them or destroy them ;in his private clinic, the surgeons seem to work on a production line,under their boss' watchful eye,who occasionally intervenes.He charges the VIP outrageously ,even though his operations are thoroughly useless ;if a medicine is subject to side effects in Switzerland or in Germany , no problem :our climate ,here in Italy is not the same.<br><br>Valloti is the Godfather of a \"white mafia\"of corrupt practitioners ,whose weapon is the bistoury(check the title) ;actually his megalomania knows no bounds and he does think he is a god the simple human beings must implore and adore if they want their sufferings to be relieved .One of his colleagues ,though,is revolted by his ruthlessness after being edified by a sister/nurse.But can one individual struggling against the authorities hope to win?<br><br>Zampa is not particular about details and his pushy surgeon is a caricature,although he tries to show another side of his character ,a\" Dr Jekill \" who loves his child who lost his mom at an early age .Fortunately ,Gabriele Ferzetti gives a restrained effective performance,and the rest of the cast follows suit;sexy Senta Berger is cast against type as the compassionate nun.","user":"dbdumonteil","rank":[1,2]}]