[{"title":"Top of the line martial arts film","rating":8,"date":"23 August 2001","review":"\"Twin Warriors\" is one of the best martial arts films I have seen, there are at least 20 different fight scenes all of them spectacular. Jet Li does a good job of acting here, he isn't as serious as he usually is, Michelle Yeoh who proved she could kick ass in \"Crouching Tiger, Hidden Dragon\" shows her skills here as well. The action scenes for the most part are believeable, a few of them go over the top but other than that I was totally into them, if you're looking for pure martial arts action with a decent story and acting, give Twin Warriors a look.","user":"claudonio","rank":[21,25]},{"title":"Jet Li Shines In \"Twin Warriors\"","rating":8,"date":"23 October 2006","review":"\"Twin Warriors\" is one of my favorite Jet Li movies. It is about two monks who grow up together and befriend one another. After getting kicked out of their temple, they have to live in the world outside of the temple for the first time of their lives. Unfamiliar with the real world and how it works, they end up choosing different paths. In the end they end up fighting one another and throw their long friendship out the window. Also joining them is Michelle Yeoh, famous for \"Crouching Tiger, Hidden Dragon\", and does a good job as well. The story is pretty good, and it even has some funny moments. There is no sexuality or hard language which is good for this film. The action in it is over the top and non-stop. It is definitely why you would want to see this movie, all different kinds of combat and martial arts. You have one on one fights, huge wars, hand to hand combat, weapon combat, and even the grab anything and use it as a weapon combat. The dubbing is pretty decent, and I don't think you can even find it in the States with the original voices. There are some minor flaws, like a times you can see wires, or things just look really fake, but it doesn't really take anything away from the film and is very entertaining. If you are a martial arts, Jet Li, or action fan, you should like this one. It has an R rating, but really could be PG-13 as there isn't anything very gory or sexual.","user":"titan-28","rank":[7,7]},{"title":"Jet Li's best and most definitive Shaolin film","rating":10,"date":"5 July 2002","review":"Twin Warriors is without a doubt Jet's Li's finest Shaolin movie.   This movie has it all: friendship, love, betrayal, corruption, murder, and comedy, not to mention the kung fu Style of Shaolin which will never cease to amaze, bewilder, and captivate the viewer.<br><br>The plot itself is simple and easy to follow.  Junbao and Chin Bo are misfit friends inside a Shaolin temple.  Feeling both ambitious and outcast form the others in the temple, these two secretly practice kung fu while performing menial tasks such as sweeping the temple floor and doing laundry. Things come to head when Chin Bo takes things a little too far during a kung fu initiation, attacking a master with some of the master's own secret kung fu moves.<br><br>Forced to leave the temple Junbao and Chin Bo are forced to live as street entertainers, demonstrating their kung fu and ability to absorb punishment for money.  That is until the Government wants a cut of that money.  It's at this point that that the yin and yang relationship develops between Junboa and Chin Bo, one sticking to the virtues of Shaolin, while the other becomes a corrupt power hungry officer of the provincial army. The struggle between good and evil that rips two old friends apart is masterfully captured in this movie.  Thankfully there are two key elements of the movie that save it from being a depressing tale about a friendship gone awry.<br><br>The first element of relief is comedy.  While this is by no means a funny movie, there is a fairly long segment where Junbao becomes insane and partakes in some hilarious shenanigans.  First he believes he is a duck and hides underwater in a fountain.  Then he believes a pillar that holds up a building is his long lost Shaolin master.  He even get mad when at a weeble-wobble `Mr. Tao' doll when it will not answer his questions.  This comic relief is much needed, saving the film form being depressing.<br><br>The second element that makes this film a must see: The incredible martial arts sequences.  From beginning to end this movie is packed with the best kung fu I have ever seen in a movie.  So many different styles and techniques are used, and jet Li makes them all look as if they were child's play.  Fight sequences are beautifully choreographed putting the ART back into martial Arts.  I highly recommend this film for any casual or die hard fan of Jet Li, he is simply amazing in this film 10/10 stars!","user":"hayabusa-1","rank":[19,24]}]