[{"title":"A Cult classic, one of the best Sci-Fi action flicks of Stallone!","rating":10,"date":"4 November 2015","review":"Demolition Man (1993) is one of the best epic classic science fiction/action film of all time! AN ALL TIME CLASSIC, has it all, explosions, practical effects, one liners, 80s songfests, soundtracks. It is one of my personal favorite movies. I love this film to death it is Stallone-Snipes futuristic science fiction action flick of the 90's. They don't make like this anymore.<br><br>Demolition Man is my favorite best Stallone Sci-fi, action movie, very awesome alongside with Rambo films. Demolition Man is one of the funniest, most action-packed and most poignant social satires of at least the last 22 years. It's not necessarily the easiest film to appreciate, as it makes its points through extremely over-the-top \"mindless\" action and tongue-in-cheek, purposefully cheesy plot and dialogue, but it's well worth trying to acclimate oneself to the style if you're not an action or sci-fi fan, as the satire cuts deep. There are other films with somewhat similar aims, such as Total Recall (1990) and Starship Troopers (1997), which are perhaps just as good as Demolition Man, but they certainly can't top it, and they have aims other than the purely satirical. As a social commentary, it's extraordinarily on-target. I mean, come on, this is the movie where the joke was made that Schwarzenegger would be president and Taco Bell would win the franchise wars, and what do you know? Now people want the constitution amended so Arnold can run for president and Taco Bell is winning the franchise wars (they merged with Pizza Hut and KFC). One of Stallone's best Sci-fi action packed films. This film is phenomenal!<br><br>Send a maniac to catch a maniac!!!!!!!! <br><br>Sylvester Stallone is a legendary bad-ass cop John Spartan Demolition Man he plays by his own rules and he does what he does best to catch the bad guys. He will blow things up to get the job done and he does in this movie. Demolition Man defies my childhood and I love this movie to death! <br><br>The cast, the script, the story itself all of these elements come together to make this one of the best action movies of the 90s. This movie does have a few surprises and it is not above making fun of itself or the action movie genre (Denis Leary is a wonderful touch!). It is a perfect addition to an action movie night or collection. The movie has humor, a little comedy and pure action that the gunplay is delivered in perfect Stallone-Snipes style - you'll see lots of heavy automatic and explosive weapons, and you'll see them used well. Stallone uses hand guns including a Remington shotgun. The film is absolutely filled with great, classic moments (I counted TEN all-star ones during my last viewing), and they're evenly spaced through the movie. The martial arts are excellent, so are the cryoprision scenes. Terrific special effects and art direction. Marco Brambilla did a great direction debut of directing of one of my all time classic sci-fi action movies! <br><br>This is an action film that actually has a brain in its head and has something to say. The vision of future world here is undeniably original and memorable. What is more admirable is that many of things seen here are happening in REAL world. Demolition Man shows what would happen if the politics will went to far with it.<br><br>Anyway I love this film, I grew up with Demolition Man, beside Cliffhanger is my second best favorite action Stallone movie!!! The rating I am giving is a 10, because the film isn't a 6, but it is a perfect 10. It is a film that is an underrated cult classic movie that I will always enjoy and cherish it to death!!! <br><br>Demolition Man is a 1993 American science fiction action film directed by Marco Brambilla in his directorial debut. The film stars Sylvester Stallone and Wesley Snipes. The film was released in the United States on October 8, 1993.<br><br>Demolition Man is a 1993 science-fiction action film starring Sylvester Stallone as John Spartan, a Los Angeles cop with a reputation for destruction who in the then future year of 1996 is found guilty of a crime he didn't commit and is subsequently sentenced to be frozen in a cryogenic prison along with his nemesis Simon Phoenix (Wesley Snipes). Spartan is then revived in the year 2032 and finds himself in the city of San Angeles when Phoenix escapes. Spartan is then asked by the San Angeles police force to use his old school tactics to take down his archenemy. <br><br>The film's cast also includes Sandra Bullock, Benjamin Bratt, and Denis Leary. The film is notable for featuring one of the first and only appearances of the Heckler &amp; Koch G11, an experimental rifle at the time that was portrayed as futuristic magnetic pulse rifle. 10/10 Grade: Bad Ass Seal Of Approval","user":"ivo-cobra8","rank":[132,143]},{"title":"Excellent cultural satire","rating":10,"date":"3 May 2005","review":"John Spartan (Sylvester Stallone) is a reckless Los Angeles policeman, known as the \"demolition man\" for the destruction he routinely engenders while apprehending big baddies. After a particularly ruthless criminal, Simon Phoenix (Wesley Snipes), sets him up by making it appear that Spartan wantonly caused the deaths of a bus load of hostages, Spartan is sentenced to 60 years or so in prison. The film begins in a not-too-distant future (relative to its 1992/1993 production date) of 1996. Prisons are quite a bit different, and there's a new policy of cryogenically freezing inmates. We cut forward to 2032. Phoenix is up for an obligatory parole hearing when he escapes. The film's 21st Century society is extremely different (worsening cultural chaos, exacerbated by a huge earthquake, precipitated the change), and the \"San Angeles\" police cannot capture Phoenix or keep him in check. Chief Earle makes a decision to revive Spartan, reasoning that an out of control but effective cop mired in the ways of the late 20th Century may be the only one who can capture the out of control criminal, but he, and the future society, may be in for a lot more than they bargained for by reawakening the Demolition Man.<br><br>Demolition Man is one of the funniest, most action-packed and most poignant social satires of at least the last 30 years. It's not necessarily the easiest film to appreciate, as it makes its points through extremely over-the-top \"mindless\" action and tongue-in-cheek, purposefully cheesy plot and dialogue, but it's well worth trying to acclimate oneself to the style if you're not an action or sci-fi fan, as the satire cuts deep. There are other films with somewhat similar aims, such as Total Recall (1990) and Starship Troopers (1997), which are perhaps just as good as Demolition Man, but they certainly can't top it, and they have aims other than the purely satirical.<br><br>The opening scene feels like a typical late 1980s/early 1990s action sequence. At least until we realize that there's not going to be a happy ending for the hostages that Spartan is trying to save. Once we arrive at the future, a lot of viewers might misjudge the performances of the principal cast besides Stallone and Snipes. Sandra Bullock, as Lieutenant Lenina Huxley (a reference to Aldous Huxley's book Brave New World), and Benjamin Bratt, as Alfredo Garcia (a reference to Sam Peckinpah's 1974 film, Bring Me the Head of Alfredo Garcia), at first seem to be turning in bizarrely incompetent performances. It's only later that we realize they are spot on for the film's \"brave new world\", which is basically an instantiation of a staunchly moralist cult run by Dr. Raymond Cocteau (a reference to famed director Jean Cocteau combined with Cocteau's friend, novelist Raymond Radiguet).<br><br>Technically, the film is quite impressive. The production design, cinematography, effects, staging of the action sequences, score and soundtrack are excellent. But what sets Demolition Man a cut above the rest are the script and the performances--yes, even from Stallone and Snipes, although Bullock, and especially Denis Leary, in a relatively minor part where he gets to do his motor-mouthed, ranting comedy schtick that made him famous, both threaten to steal the show.<br><br>Director Marco Brambilla (who has remained oddly inactive since Demolition Man, which was his first film) and his writing \"team\" skewer a lot of cultural norms as relatively arbitrary conventions. Radio and television commercial jingles are considered the pinnacle of musical art in the film's world. Strict morality is enforced through constant computer monitoring of behavior combined with fines--a running joke throughout the film is that profanity results in fines. Meat and alcohol have been outlawed. So has physical contact, including sex. All restaurants are now Taco Bells (in some cuts of the film intended for foreign markets, this was changed to Pizza Hut instead). There is an underground, outside of the cultic mainstream society, but they're literally underground, living relatively lawless (well, at least they eat meat and drink beers) in tunnels strewn with utility pipes.<br><br>As a result, serious crime is a thing of the past, swept under the rug (or into the sewers) and labeled with Orwellian newspeak. Phoenix and Spartan's reintroduction of violence and mayhem, including \"murder/death/kill\", results in a reawakening of cultural freedom, analogous to their own thawing out. The anti-utopian, anti-utilitarian political message, like that of Orwell's 1984 and later films influenced by the same, such as Equilibrium (2002), couldn't be clearer. And the message can be extended to situations that are not political. I didn't use \"cult\" above carelessly. The idea is that the society's warts are necessary for individual authenticity. Yes, things can run smoother under a dictatorship, but who wants to live under a dictatorship, even a supposedly \"benevolent\" one?","user":"BrandtSponseller","rank":[204,227]},{"title":"Not as bad as people say!","rating":8,"date":"9 February 2002","review":"This is one of those films that it is popular to think is rubbish.  I'm not quite sure why.  Don't take it seriously and it's a fun ride.<br><br>Wesley Snipes and Sly Stallone play off each other well as the forces of bad and good -- old foes that have come out of chryo-generic storage hundreds of years into the future.<br><br>Sandra Bullock as the nostalgia [for Stallone's time, naturally] struck cop isn't even rubbish and annoying -- a first time for everything!<br><br>Watch out for a fun performance by Nigel Hawthorne also.","user":"redkiwi","rank":[117,143]}]