[{"title":"An Underrated Adaptation","rating":23,"date":"23 September 1998","review":"When I found out that Jessica Lange, Michelle Pfeiffer, Jennifer Jason Leigh, and Jason Robards were teaming for a film based on a Pulitzer-Prize winning novel, I went out and read the book immediately.  \"A Thousand Acres\" was one of the best reading experiences of my life, and while the film couldn't capture the book in its entirety (no film could, unless it were six hours long), I really enjoyed it.  Michelle Pfeiffer should have received another Oscar nomination for her fearless portrayal of Rose Cook Lewis, the character modeled after Shakespeare's evil Regan from \"King Lear.\"  While all of the performances are solid, they seem somehow timid next to Pfeiffer, who once again proves that she is most definitely not just another pretty face.","user":"Red7Eric","rank":[23,31]},{"title":"Superb performances by the two leads","rating":6,"date":"13 October 1998","review":"I was really looking forward for this picture since i heard that Michelle Pfeiffer and Jessica Lange would star together. But when i eventually went to see it i must say i was a bit disappointed. I don't say that the movie was bad ,but the fact that i expected much more from it , make me regard it an average movie. The direction was very poor and the editing unacceptable. The adaption seemed to lack in many ways and Jennifer Jason Leigh was unbearable. But seeing Pfeiffer ang Lange together on screen made me forget everything. These two great actresses proved for once more their talent. When you see them together on screen you forget all the disadvantages the movie has and there's nowhere else you want to be. They both deserved Oscar nominations and Lange probably the award too. Jason Robards though not as good as in some of his previous roles was great too.","user":"CineMan-8","rank":[12,15]},{"title":"Surprisingly good","rating":31,"date":"31 March 2000","review":"I didn't actually have high hopes for this film because I had read some critics reviews when it first came out. I have not read the novel either. I thought the film was very well done and was moved by it. I agree that many of the supporting characters are underdeveloped but I could overlook that because I knew what was motivating the main characters. The two lead actresses are brilliant, especially Jessica Lange, who deserved an Oscar nomination for this. I loved the way her character slowly changed through the movie and Lange can evoke so much emotion in the viewer with something as small as a hand gesture. Pfieffer is strong as well although the story mainly revolves around Ginny and I don't really see why Pfieffer gets first billing here. I strongly recommend the film, espeically on dvd.","user":"Phillip-7","rank":[18,25]}]