[{"title":"Dark, yet oddly funny","rating":10,"date":"8 March 2004","review":"I taped this movie on the USA Network at three o'clock in the morning, watched it some time afterward, and I was blown away by this film. Former gangster Carlo Bartolucci aka Charlie Barrett (Christopher Walken in one of his best roles ever) attends a bistro where he finds that a group of swaggering young men, consisting of Max (Sean Patrick Flanery), Avery (Henry Thomas), Brett (Jay Mohr), T.K. (Jeremy Sisto), and Ira (Johnny Galecki), have taken over his usual booth. Charmed by the guys, Charlie takes them for a ride, only for them to knock him out with some chloroform while going down the Queens tunnel in a hilarious sequence. Charlie regains consciousness inside of Ira's mansion taped to a chair with one of his fingers missing, having been cut off to compensate for Avery's kidnapped sister's missing limb. The guys keep Charlie prisoner in the mansion, but soon, Charlie starts to play head games with them, and it soon becomes obvious that there is a traitor in their midst.<br><br>This darkly humorous crime thriller can be described in the most simple terms as \"The Breakfast Club\" meets \"The Godfather\" or something like that, even though I myself never saw \"The Godfather.\" Walken is increasingly laughter-provoking, suave, and creepy all at the same time as he delivers witticism after witticism despite his usual situation. Four of the lead males (Henry Thomas, Jay Mohr, Sean Patrick Flanery, and Jeremy Sisto) all portray swaggering rich boys, while Johnny Galecki (David from TV's \"Roseanne\") is screamingly funny as the nitpicking nerd of the bunch and Denis Leary is his usual laid-back self as slick and wisecracking gangster Lono (what a funny name!).<br><br>I said it once and I'll say it again -- \"Suicide Kings\" is a darkly comical film, but it is highly recommended (for those with kids) that you watch this either late at night or while the kids are away.<br><br>I give \"Suicide Kings\" a 10 out of 10 on a scale of 1-10 in my humble opinion.","user":"kalel32688","rank":[47,63]},{"title":"Creepy cool thriller","rating":27,"date":"27 August 1999","review":"It's hard to name a genre for Suicide Kings,  so I put it in my beloved category of \"twisted thriller\".  I compare it with movies like Reservoir Dogs, The Usual Suspects,  U-Turn,  Kalifornia,  Wild Things,  True Romance and A Simple Plan.  Like all of the above,  SK was violent,  bloody and full of surprising twists.  To add to its shadowy charm,  it had a psychotic sense of humor.  But the most amazing thing about this movie is Christopher Walken's subtly venomous performance,  which complements the sharp, individualized performances of the younger cast members.  Walken plays Charlie Barrett,  a man who is unwittingly \"recruited\" to help five college-aged rich kids rescue one of their sisters,  who has been kidnapped for a $2 million ransom.  The five kids:  nervous Avery (Henry Thomas),  the one whose sis Elise (Laura Harris) is endangered;  handsome Max (Sean Patrick Flanery),  who is Elise's sweetheart;  Brett (Jay Mohr),  the one with a hell of an anger problem;  aspiring doctor TK (Jeremy Sisto);  and ultra-neurotic Ira (Johnny Galecki) whose house becomes a hideout for the kids after they kidnap Barrett.  Brett concocts the plan.  Max drugs him, TK severs one of his digits,  and Charlie is duct-taped to a fancy office chair,  hooked up to an IV which is pumping more drugs into him.  Meantime, Avery broods nervously over his missing sis and Ira squeals endlessly about the blood TK is getting all over the nice varnished floor.  While the boys bicker at each other about how to continue their insanely flawed caper, Barrett regards this group of inexperienced whipper-snappers with a myriad mix of sympathy,  amusement and anger.  But anger from a man like Charlie Barrett is not to be taken lightly,  it is to be feared.  Charlie is a man who with one spoken word,  could have these five kids murdered and their bodies hidden where no one will ever find them.  You know that from the minute you meet him,  but the scariest thing about Charlie is his quiet mannerism.  This serpent is indeed subtil.  He does not shout,  he gently whispers hints of warning to the kids that they've made a bad mistake messing with him.  He taps into these kids early on,  uncovering their dirty little family secrets and their own individual not-so-secret addictions,  to drink,  to drugs,  to gambling.   And he uses devices, honed from years of experience in a world these kids know nothing about, to his advantage.  He may be physically incapacitated,  he may be outnumbered,  but he knows the kids are still no match for him.  There's no arrogance in this knowledge, and it is truly creepy.  It's a battle of wits that kept me on the edge of my seat,  gave me the most delicious shivers of perverse anticipation,  and it was honestly very hard to know which side to route for.  I really love this movie.  See it if you haven't.  : )~","user":"PeachHamBeach","rank":[33,43]},{"title":"Kidnap Yarn Done Very Well","rating":30,"date":"30 June 1999","review":"Kidnap films have been made for decades. (Check out Ransom for a typical example.) In a way Suicide Kings starts out like a low budget \"B\" movie of the 40's and 50's. The beginning is obvious and a bit overly dramatic. But this is when Suicide Kings began to surprise me.<br><br>Christopher Walken in an amazing performance shows that an actor can be the center of a film while sitting down for almost an hour. Also, this movie pulls no punches in showing organized crime/mob violence. Yet, the vigilante college kidnapers are shown in such a harsh manner that after a while you begin to root for the mobsters over the ivy league losers. It's an amazing turn around.<br><br>On top of this there is some wicked humor in the film not unlike Goodfellas. Denis Leary as he was in the Ref is great as the abusive and befuddled thug.<br><br>What was very satisfying was that the ending was just right. Finally a movie that does not have a ridiculous happy ending tacked on to it. Suicide Kings is brutal in its logic but the story makes sense from start to finish. Despite its low budget and its routine beginning, this is a very good film.","user":"BB-15","rank":[32,42]}]