[{"title":"Don't Miss The Point","rating":3,"date":"3 July 2008","review":"This will be a short review. I have seen a lot of pro and con on this movie, but almost all of the con's talk of the unbelievable plot. I will give you that the plot has some problems, and if this was a serious spy movie, then I'd be there with you, but that is not what this film is. This film is a total romance with some action thrown in. If you watch it and see how two people will risk all they have for each other because they are in love then you will enjoy this film. Sure there are holes in the plot...but not in the romance. Melanie is very likable in this movie and I think there is great chemistry! If you don't scrutinize the plot so much you may even find yourself routing for them as they cross the Swiss border.","user":"dawilliams40","rank":[34,40]},{"title":"Entertaining World War II romantic thriller","rating":7,"date":"22 May 2006","review":"Though I never read the book, personally I feel that this is an overly criticized and highly under rated movie. It's been awhile since I saw it so forget all the plot intricacies, but do recall enjoying this wartime romance at the time. As others have noted, it is definitely more a love story than a spy thriller. Also, I was sufficiently impressed with the performances by all three leads but especially Liam Leeson.<br><br>The plot revolves around an American spy master, Ed Leland, who reluctantly sends his secretary, Linda Voss, on a dangerous mission to Berlin, refusing to admit to himself that he has feelings for her personally. Voss is sent to spy on a high level German army officer named Dietrich, being deemed suitable for the task because she speaks fluent German. This secretary is half Jewish herself, and part of her motivation is actually to find some of her relatives who are in hiding. She thus goes undercover into Nazi Germany as a secretary turned spy, with little training in survival or espionage. However, she is a great fan of old spy movies and has gleaned a few tips! Perhaps the plot is not that plausible, but the same charge could be laid against any number of other movies. This is mainly a romance and a highly entertaining one.<br><br>Melanie Griffith is charming here in the role of Linda Voss. She is not a dumb blonde bimbo, nor does she even appear to be. Quite the contrary. Some have complained about her German, but I was interested in the story, and no expert on her accent. Michael Douglas competently portrays the American spy, Leland. Whether or not it is believable that someone in his position cannot speak a word of German, he has a very credible chemistry with Griffith. Liam Neeson is especially excellent, playing with dignity and charisma the complex role of the sensitive but potentially ruthless Nazi officer and devoted family man. Sir John Gielgud, the ultimate professional, is masterful as always and commands any scene in which he appears.<br><br>I confess that I'm a sucker for wartime romances, love the drama of that era as well as the 1940's styles, so would lap up just about any representative of the genre. While this one may not be a classic, it is a good love story with some gripping action, tension, and suspense. As another also noted, though it may indeed be highly improbable, it is nevertheless highly watchable.","user":"roghache","rank":[30,39]},{"title":"Great Romance!!","rating":9,"date":"19 May 2004","review":"I loved this movie. I saw it for the first time when I was 21, and I've watched it several times a year ever since. Melanie Griffith gives one of the best performances of her career, and Michael Douglas is, of course, wonderful. Although this movie is presented as a action/drama set in WWII, the romantic story is what makes this movie so powerful. Griffith and Douglas have great, believable chemistry. The set decoration and cinematography are a throwback to the old 40's movies, which is ironic because those movies are mentioned throughout the film (Griffith's character is a huge fan of war movies that were shown at that time.) If you like great romantic stories with just enough action thrown in, watch this one. You will not be disappointed.","user":"lindajordan29","rank":[48,67]}]