[{"title":"There's no place for pride in the courtroom","rating":22,"date":"22 May 1999","review":"Courtroom drama is a robust dramatic formula; there is human conflict, suspense and, in the verdict, resolution. In the real world court cases don't run to the formula; many cases are stillborn, many are settled before trial, some seemingly decisive victories are reversed on appeal. The lawyers generally seem to survive though. In the American system of civil litigation the contingent fee is common - the lawyer gets paid only if the client succeeds, usually a third of the verdict or settlement amount. This can lead to some pretty crass conduct.<br><br>In this film, based on a very fine book about real events in the Boston area, we have a rather rare example of a lawyer trying so hard he defeats his own cause. Yet at the end he may have brought about a greater social good. Jan Schlictman (played with smarmy aplomb by John Travolta) is a seasoned plaintiff's lawyer in personal injury cases who knows all the tricks, both in pre-trial negotiation and before a jury. He is persuaded by an associate to look into a claim by a small community that its water has been poisoned by industrial waste resulting in the deaths of at least eight children from leukemia and other ailments. The case captures his attention and before long the entire resources of his four-partner firm are concentrated on it. They are up against a local tannery owner and two huge corporations, Beatrice and W&amp;R Grace. Beatrice is represented by Faucher (a stand-out performance from Robert Duvall) a crusty veteran of 45 years litigation (and Harvard Law School lecturer), and he doesn't have much trouble cutting Jan down to size.<br><br>Despite the escalating cost Jan doesn't seem to know when to stop. His partner James (another gem-like performance from William H Macy) does everything he can to raise money, including applying for credit cards from banks as far away as Fargo, North Dakota (those who saw Macy in \"Fargo\" will chuckle over that one.) Total disaster is averted but it seems that Jan has been fighting the wrong battle.<br><br>To fit the mood the lighting is dull (surely the Boston Courts are not quite as gloomy as portrayed) and the weather awful. I've never seen it rain so much in a movie. Against this dismal backdrop the performances are luminous. Apart from those already mentioned there is John Lithgow (of \"Third Rock from the Sun\" fame) as a conceited judge, Kathleen Quinlan as a bereaved parent, Bruce Norris as Cheeseman, Grace's super nerd lawyer, Dan Hedaya as O'Reilly the evil tannery owner and Stephen Fry as a very English geologist. And who should pop up at the end as a bankruptcy judge but Kathy Bates.<br><br>This is a case where I have read the book (by Jonathan Harr) and for the movie the film makers have rather sidelined the plaintiff/victims and focused more on Jan's manic prosecution of the case. This helps the drama but does give the impression that the plaintiffs were helpless bystanders. This was not so, as the book shows.<br><br>As a movie this one succeeds very well. Some have complained it's a bit slow and requires rather too much legal knowledge from ordinary filmgoers but there is plenty of tension and the ending is as satisfactory as one gets in real life. It's a movie to make a lawyer cringe, and that is probably recommendation enough.","user":"Philby-3","rank":[34,36]},{"title":"Thankfully not another pretty conversation piece","rating":9,"date":"10 August 2004","review":"I'm usually put off by courtroom films simply because I associate them with either the tendency for pompous and ornate speech-making a la \"A Few Good Men,\" or cheap audience-manipulation a la \"Primal Fear.\" Yes, they are entertaining, usually with great actors and fine performances - thinking man's thrillers. But generally they remain nothing more than that - a well-done conversation piece. <br><br>\"A Civil Action\" was a pleasant surprise because it is not only like neither of those films, but also because it is a good film starring John Travolta. While he had his moments in the spotlight for good reason (think: \"Pulp Fiction\") his movies are generally not that great. But that's just a personal opinion and I may be wrong.<br><br>Still, \"A Civil Action\" is a great courtroom film. For one, it's a true story (which doesn't necessarily say much), and it is told with restraint, quietness and respect for the characters involved (which should be saying a lot). It takes the best from \"Silkwood\" and \"Verdict\" and it gives us people who are real and who engage in battle the way we imagine real people would. They don't have dramatic moments in the courtroom upon which an unreal stillness descends so as to be shattered at the end of the speech by the thunderous sound of unanimous, emotionally-fraught clapping.<br><br>John Travolta is great here and so is the rest of the cast, among them William H. Macy, Kathleen Quinlan, Sydney Pollack, John Lithgow, Stephen Fry (in a small cameo role), Kathy Bates (in an even smaller cameo role) and the great Robert Duvall. In the end, it is Duvall who steals the show in his quiet, unemotional musings, advice-givings and deliberations with Travolta. He embodies the restraint for which the film strives. <br><br>\"A Civil Action\" is quiet in its proceedings and, consequently real. It tells the story of a lawyer who reluctantly accepts a case having to do with the contamination of water and the deaths of many children in a small town and becomes obsessed with it to the point of going bankrupt. His obsession mirrors the self-destructiveness of Paul Newman's lawyer in \"Verdict,\" and it has real results. His adversaries are not evil people, per se (think Jack Nicholson in \"A Few Good Men\"), but people who are simply doing their jobs damn well, defending their interests. We shouldn't expect them to cave in to pretty speech-making, nor should the jury.<br><br>And watching \"A Civil Action\" we don't and it doesn't. The personalities clash, personal tragedy is pitted against financial burdens of the legal process, and it yields startling conclusions about the American Justice system. And that is what \"A Civil Action\" chooses to focus on more so than the true story it tells (though it doesn't ignore it either). The film shows the price of justice and how justice is understood in the legal process. In fact, it draws a very fine dichotomy between non-legal justice and legal justice and shows how hard it is to get \"justice\" in a legal setting. Needless to say, it becomes a very expensive ordeal full of re-interpretations of the law and annoying manipulations of it. What we can gather from the story, however, is that we should be grateful for people who are willing to go to extreme lengths, at great personal cost, to define justice on their own terms and to fight for it.","user":"canadude","rank":[61,69]},{"title":"Skillful rendition of the book on film.","rating":31,"date":"31 January 1999","review":"How to interpret viewer comments on this film:<br><br>\"Slow-moving\" = ...no car chases.<br><br>\"poor acting\" = ...no karate chops<br><br>\"too long\"    = ...longer than a music video<br><br>\"dull\"        = ...See \"Slow-moving\"<br><br>\"A Civil Action\" was a fine book, and the film does it justice.  No, it's not perfect, but it is emotionally moving, and faithful to the non-fiction account of the case.<br><br>Some of the heart-rending short scenes featuring parents of the child-victims (the father at the deposition; the parents trying to revive the dying child in the car) were absolute masterpieces.  There should be special Academy Awards available for brief scenes of this kind that are too \"small\" for Best Supporting Actor awards, but are, in themselves, worthy of acclaim.","user":"toenails","rank":[19,20]}]