[{"title":"Unexpectedly Great Movie","rating":9,"date":"19 February 2001","review":"I wasn't going to comment, but after reading some of the negative comments, I felt I must. I \"waited for the video\" for this movie because a movie about boxing didn't seem interesting. But that's just the thing. It's not about boxing. So if you're thinking you're going to see Raging Bull, you're not. There are a few boxing scenes, but they only serve to move the story along.<br><br>I have seen this movie more than once. The first time I was touched by the underlying theme of the movie, which was in my opinion, love conquering hate and injustice. Then I watched it again. I realized Denzel did a superb job. It WAS NOT a \"typical Denzel role.\" He convincingly played Rubin \"Hurricane\" Carter, raised full of hate for and distrust of white people. When he goes to prison for the murder, he does an excellent performance showing the different personalities in his head, as well as showing how his inner spiritual journey transformed him. Any good movie shows the hero growing and changing. And Denzel again does this well towards the end of the movie, after befriending Lazarus and the Canadians. My favorite line which to me sums up the entire movie is when they're waiting to hear the judge's verdict and Rubin tells Lazarus, \"Hate got me in here. But love's gonna bust me out.\"<br><br>I don't know much about the real Rubin Carter or the details of the case. What I found compelling about the movie was the fact that some people - be they white or black - can harbor such hatred for another person (I'm referring to Della Pesca's hatred toward Rubin). Another thing that got me was the friendship and love between Rubin and Lesra and the whole message of examining the higher principle of truth for which the law was meant to serve. It's just one of those movies that makes you think. Yeah, some of the writing is \"just OK\" in places, but the theme of the movie is wonderful and I think Denzel gave an Oscar worthy performance.<br><br>I gave this a 9 out of 10.","user":"kmsairam","rank":[110,143]},{"title":"good old-fashioned entertainment","rating":16,"date":"16 January 2000","review":"Jewison's film is an old-fashioned biopic, complete with pivotal backstory, voiceover narration, and a character who enters the protagonist's life and changes it immeasurably.  It's one of those stand-up-and-cheer movies where everyone seems to be against the hero, but above all odds (and with more than a little help from some of his friends), he rises above The System and gets his belated due.  It's an oft-used scenario, with many scenes that could easily have been taken from Jewison's other films A SOLDIER'S STORY or IN THE HEAT OF THE NIGHT.  Yet despite the familiarity of the storyline, I'll be damned if I wasn't choking back tears of elation at the movie's triumphant conclusion.  It's a masterful piece of filmmaking that proves Norman Jewison's skill as a director, as he transcends the cliche-bound script and, with the help of Washington and company, makes it a powerful entity all its own.<br><br>As the Hurricane, Denzel Washington proves he is one of the best actors (if not THE best) in the business today.  He can run the gamut from cold hatred to hearty laughter like few others can. He brings dignity and class to every one of his pictures (he was the only thing worth watching in THE BONE COLLECTOR).  Here, he makes you FEEL every single thing he's feeling.  In times of righteous indignation, you feel morally outraged alongside him.  When he's at his most vulnerable, you can feel your throat constricting and your eyes watering.  He has an uncanny knack for reaching into your soul and making you part of the picture itself; it's almost as if he's channelling the viewer while acting.  Other actors delight in wowing the audience with grand theatrics and histrionics, but neglect to make the audience care; Denzel is usually soft-spoken and low-key, but always holds your attention.<br><br>In summary, THE HURRICANE was one of the most exhilarating motion picture experiences I've had all year.  Norman Jewison directs with a deft surehandedness reminiscent of his late 1960s/early 1970s glory years, Denzel Washington delivers perhaps the most awe-inspiring performance of the year, and the audience goes home happy and feeling good about themselves and the world.  What more could be asked for?","user":"fiennes1","rank":[57,78]},{"title":"An incredible film, with superb acting","rating":10,"date":"26 January 2000","review":"Denzel Washington is so convincing as Rubin Carter that one forgets that he is, indeed, an actor playing a role.  From the beginning to the end, Denzel is perfect. The film made me think about how poverty and prejudice can ruin a person's life when misfortune, such as being in the wrong place at the wrong time, visits.  I didn't think that I could possibly like a movie that I already knew so much about.  With boxing in it, yet!  But when Denzel received the Golden Globe Award, I felt I had to see it.  What a moving experience!  Anyone who enjoys superb acting and a story with a rewarding, emotional ending should not miss this film.","user":"rosie-54","rank":[78,119]}]