[{"title":"The original is way better; evidence against the Hollywood film system","rating":3,"date":"3 December 1998","review":"This film is way inferior to the Dutch original (the fact that the same director directed both is another story). This movie has obviously been toned down for American audiences, which is insulting if you've seen them both (I stumbled onto the remake on cable late at night). The original is a thriller in the truest sense of the word, and is far more intelligent, disturbing, and scary than the Hollywood version. I bet the producers assumed American audiences couldn't handle disturbing well so they gave us a more friendly version, very insulting. If you're going to see this version, make sure you rent the original too and watch it first, just to see how much the remake pales in comparison. If you don't like psychological, disturbing, riveting, and no-downbeat-endings in your thrillers, the 1993 version is for you. But if you want to be truly blown away, the Dutch original is very highly recommended over this one.","user":"Sam-68","rank":[109,134]},{"title":"Hmmm...2 versions. Which should I watch?","rating":21,"date":"21 August 1999","review":"As everyone who has reviewed this film here has mentioned, there are two versions of this movie, one Dutch, one American, both directed by the same fellow.  Which should you see first?  Which should you avoid, if any? Decide for yourself... I saw the Dutch version in 1994, and it absolutely blew my socks off.  I was horrified, didn't want to keep watching it, but I was pulled in and couldn't stop until the brilliant, ultra-chilling, uncompromising finale.  This was my first foreign film, and so I was completely unprepared for such a non-Hollywood experience.  I will remember this movie for the rest of my life. Later on, I caught the American version in the theatres, watched it, a few thrills here and there, yadda, yadda.  Jeff Bridges was pretty creepy, but quite frankly, I would have completely forgotten about it by now if it weren't for the original.  It's not horrible, it just pales in comparison to a masterpiece.","user":"SuperMovieFanatic","rank":[66,80]},{"title":"So-so","rating":6,"date":"26 February 2005","review":"Had I not seen the original Dutch film \"Spoorloos\" I might have given \"The Vanishing\" more credit. But it's a weak remake which gives American audiences all the gore that the original lacked and a reasonably happy ending which was nowhere to be found in the original. <br><br>\"The Vanishing\" is the story of Jeff, whose claustrophobic girlfriend Diane goes missing from a gas station and never returns. For years, Jeff is plagued with guilt and never gives up on the search for Diane, not even after meeting Rita, with whom he begins a serious relationship. But Rita soon becomes sick of Jeff's obsession and leaves him after a bitter confrontation. It is at this point that Jeff's obsession pays off and Barney comes looking for him. Barney knows what happened to Diane, because he is the one who kidnapped her. But Barney will only tell Jeff what happened if Jeff agrees to go through everything that Diane went through without knowing in advance what that might be. Jeff agrees and disappears, and now it is Rita who is obsessed with discovering what has happened to him.<br><br>This isn't a terrible film by any means. The performances are great, particularly by Keifer Sutherland as Jeff. His portrayal of the guilt-ridden, haunted man is near perfect. There are some great moments of comedy provided by Park Overall as Rita's friend Lynn. But \"The Vanishing\" lacks the power of \"Spoorloos\" despite a harrowing scene in which Jeff learns the fate of Diane firsthand, a scene which is identical to the original. Still, I don't understand why when a foreign film is remade for American audiences, it is almost always assumed that we want more gore and a happy ending, thank you very much. Both cheapen the story in this case. \"Spoorloos\" was a film of terrible sorrow and grim reality, both of which will (or at least SHOULD) leave even the most hardened horror fan shaken. \"The Vanishing\" is slightly less effective, going in for cheap thrills and a kick-ass finale a la Hollywood. <br><br>I would recommend seeing it ONLY if you're going to watch \"Spoorloos\" as well.","user":"Gafke","rank":[61,88]}]