[{"title":"An Almost Flawless Masterpiece","rating":9,"date":"1 September 2001","review":"Although I was aware of the original plan to renew the Fantasia concept every so often, and that it was visualised as an ongoing project, I felt that going back after 60 years was too much, and that the original classic should be left alone. However, my initial scepticism was dispelled within seconds of the opening sequence. What we have here is a lush, vibrant fusion of animation and music, each fully complimenting the other to perfection. It's hard to pick a favorite sequence, but if really pressed, for personal taste alone, it would be the awesome sequence with the whales. Mickey's Sorcerer's Apprentice sequence is the only carry over from the original, and a worthy match for it in the 2000 lineup is the Donald \"Noah\".<br><br>The only criticism I have of the film is the bridging sequences, featuring Steve Martin, Penn &amp; Teller, Bette Midler and others. I would have preferred that they stuck to one presenter, preferably James Earl Jones or Angela Landsbury. They seemed to take the material and the project far more seriously than Martin and Penn &amp; Teller who's humor detracted from the dignity of the movie as a whole.","user":"Robin-58","rank":[32,39]},{"title":"Beautiful Sequel of a Classic Animation","rating":8,"date":"30 November 2013","review":"\"Fantasia 2000\" is a beautiful sequel of the classic animation \"Fantasia\" (1940). The conductor is James Levine and each segment is introduced by the actor Steve Martin, the violinist Itzhak Perlman, the actress Bette Midler, the entertainer Penn &amp; Teller, the actor James Earl Jones, the conductor Quincy Jones and the actress Angela Lansbury. The audio is in DTS and THX and the program is the following: <br><br>(1) Symphony No. 5 in C minor-I. Allegro con brio, by Ludwig van Beethoven.<br><br>(2) Pines of Rome, by Ottorino Respighi.<br><br>(3) Rhapsody in Blue, by George Gershwin.<br><br>(4) Piano Concerto No. 2 in F Major-I. Allegro, by Dmitri Shostakovich.<br><br>(5) The Carnival of the Animals, Finale, by Camille Saint-Saëns.<br><br>(6) The Sorcerer's Apprentice, by Paul Dukas.<br><br>(7) Pomp and Circumstance – Marches 1, 2, 3 and 4, by Edward Elgar.<br><br>(8) Firebird Suite – 1919 Version, by Igor Stravinsky.<br><br>My vote is eight.<br><br>Title (Brazil): \"Fantasia 2000\"","user":"claudio_carvalho","rank":[14,16]},{"title":"Pretty good, but I wish it was longer.","rating":7,"date":"7 January 2001","review":"Top quality animation and a sense of humour make this sequel/add-on a formidable animated movie in its own right. The running time of 74 minutes is a bit of a let-down. I would have liked to have seen more pieces and more imagination. And be warned, The Sorcerer's Apprentice remains. As this was the original's ONLY real selling point they decided to stick it back in there, so you're really only get just over an hours worth of new footage. Which feels like a bit of a rip-off.<br><br>But my favorite segment is the one with Donald Duck, in fact they were all cool, especially the one with the volcano. The music matches the story perfectly and it has some truly beautiful animation. Far superior to those ugly CGI crap we get these days. And the TV show style introductions were more watchable than the dubbed Deems Taylor segments in the original.<br><br>This was the first animated movie to be made for IMAX screens and the digital picture is amazing. See this preferably on an IMAX screen or on DVD. Watching it on VHS would only insult the brilliant animation. It's sad that Disney has abandoned traditional hand-drawn animation for theatrical projects. It's what the studio was built on after all. But Disney is shadow of its former self, we all know that.<br><br>Just as good as the original Fantasia, but loses points for not being longer and more ambitious.","user":"CuriosityKilledShawn","rank":[9,10]}]