[{"title":"Two Creepy Stories by Edgar Allan Poe and Directed by Two Masters of Horror","rating":8,"date":"18 April 2015","review":"\"Two Evil Eyes\" is a creepy movie with two segments directed by two masters of horror, George A. Romero and Dario Argento, and based on short stories by Edgar Allan Poe. <br><br>\"The Facts in the Case of Mr. Valdemar\": The gold-digger Jessica Valdemar (Adrienne Barbeau) and her lover Dr. Robert Hoffman (Ramy Zada) plot a scheme to take the money of her old and terminal husband Ernest Valdemar (Bingo O'Malley). Robert has hypnotized Valdemar to give his money to Jessica. Out of the blue, Valdemar dies while hypnotized and is stranded between the world of the living and the dead. Robert finds the experience fascinating and Valdemar asks him to take him out of the trance since other spirits are stalking him. However Jessica shots the corpse of Valdemar twice expecting to finish his contact with the world of the living. But soon she learns that Valdemar had been already possessed by evil forces. This segment is based on a creepy and macabre tale of greedy with a weird and bizarre conclusion. <br><br>\"The Black Cat\": In Pennsylvania, the tabloid photographer Roderick Usher (Harvey Keitel) that explores gruesome crime scenes where Detective Legrand (John Amos) is investigating. Rod has been living for four years with his girlfriend Annabel (Madeleine Potter), who is a violinist. When she brings a stray black cat home, Rod immediately hates the animal. Soon Rod takes photos torturing the cat for his book and the cat vanishes. When Annabel sees the photos of the cat in a bookstore, she concludes that Rod killed her cat and she decides to leave him. Meanwhile Rod finds a stray cat in a bar identical to the one he killed and the owner Eleonora (Sally Kirkland) gives the animal to him. Annabel is leaving the house but she overhears the cat and returns to her room. Rod kills her and builds a wall to hide her body behind a bookshelf and prepares a solid alibi. But his fate is doomed by the black cat. This segment has a great version of the well-know tale by Edgar Allan Poe. Harvey Keitel has a magnificent performance and the direction of Dario Argento is top-notch. <br><br>My vote is eight.<br><br>Title (Brazil): \"Dois Olhos Satânicos\" (\"Two Satanic Eyes\")","user":"claudio_carvalho","rank":[11,11]},{"title":"Not The Masterpiece One Might Expect From Romero/Argento, But Certainly Good Horror","rating":7,"date":"10 July 2007","review":"When the two greatest Horror directors alive (and two of the greatest of all-time), George A. Romero and Dario Argento make a movie together, a fan of Horror might rightly hope for a masterpiece. \"Due Occhi Diabolici\" aka. \"Two Evil Eyes\" from 1990 features two separate 1 hour films based on the work of Edgar Alan Poe, \"The Facts In The Case Of Mr. Valdemar\", directed by Romero, and \"The Black Cat\" directed by Argento. \"Two Evil Eyes\" is certainly great entertainment and a pleasant Horror experience, however it does not quite come up to the high expectations one might have of a film by these two brilliant directors. It must be said, however, that it may be very difficult for a Poe-themed movie to impress me after Roger Corman's brilliant Poe-cycle from the sixties, starring my all-time favorite actor, the great Horror icon Vincent Price. These films, such as \"Pit And The Pendulum\", \"The Haunted Palace\" and \"Masque Of The Red Death\" (just to name the three most ingenious masterpieces of this brilliant cycle) are essential all-time Horror greats, no Poe-themed film has ever come close to those flicks, and it is very unlikely that any ever will.<br><br>The second segment, Argento's \"The Black Cat\" is, in my opinion, a lot better than Romero's \"Mr. Valdemar\", not only for the fact that one of the greatest living actors, Harvey Keitel, plays the lead, but also since it is far more twisted and atmospheric. <br><br>\"The Facts In The Case Of Mr. Valdemar\", mainly based on Poe's short story of the same name, tells the tale of a woman named Jessica (Adrienne Barbeau), who, alongside her ex-lover (Ramy Zada), is willing to do quite anything to inherit the entire property of her terminally ill older husband (Bingo O Malley)... The 1 hour segment has some very eerie moments, and a chilling atmosphere over-all. As mentioned above, however, Roger Corman handled the same topic with a lot more depth in 30 minutes as the final segment of \"Tales Of Terror\" (1962). Admittedly, Corman had a brilliant cast, Vincent Price, Basil Rathbone and Debra Paget.<br><br>\"The Black Cat\", is also mainly based on Poe's short of the same name. However, this second segment furthermore contains elements from certain other Poe works. A crime-scene photographer with a familiar name, Roderick Usher (Harvey Keitel) and his younger girlfriend Annabel (Madeleine Porter) live happily together in a nice old building. Until one day Anabel takes a black cat home... The second segment is highly atmospheric, nightmarish and very eerie, and crowned by Harvey Keitel's leading performance.<br><br>All said, \"Two Evil Eyes\" is neither a highlight of Romero's nor Argento's career, however it is still a good film. Let's not forget we're talking about two geniuses here! If you set your expectations too high and expect a masterpiece of the brilliance of \"Night Of The Living Dead\" Or \"Suspiria\" you'll be disappointed. Nevertheless, this is great Horror entertainment. Just keep in mind that you're not about to watch something comparable to Romero's or Argento's masterpieces in quality, and you will have a great time as a Horror fan. My rating: 6/10 for Romero's segment and 8/10 for Argento's segment, makes an overall 7/10. Recommended!","user":"Witchfinder-General-666","rank":[21,23]},{"title":"Minority Opinion But I Liked Romero More","rating":6,"date":"17 February 2014","review":"George Romero and Dario Argento, two great horror directors, tackling two short stories by Edgar Allan Poe. Sounds like a surefire hit. So why isn't it? Romero writes and directs his story, \"The Facts in the Case of Mr. Valdemar.\" It's about a woman (Adrienne Barbeau) whose rich husband, Ernest Valdemar, is on his deathbed. A doctor (Ramy Zada) she's been having an affair with hypnotizes Valdemar into signing over all of his money to his wife. But Valdemar dies while hypnotized so he's stuck in between life &amp; death and is surprisingly unhappy about it.<br><br>The biggest problem with Romero's story is that it feels like it was made for television. The annoyingly cheap and ceaseless music score doesn't help. Barbeau is the best part. She makes a paper-thin character work. She's also some very nice eye candy. E.G. Marshall plays Valdemar's attorney, who knows something is up but can't do much about it. Tom Atkins plays a homicide detective who conveniently answers 911 calls about screaming neighbors. The climax sees Romero turning Poe's story into something that belonged in Creepshow, which Romero directed and Barbeau, Atkins, and Marshall also appeared in. If this story was the entire movie, I might rate it a little higher. It's not great and there are big problems (that music!) but it's a passable time-killer. However, the other story drags the score down.<br><br>The Argento story is more stylishly directed, as you might expect. It's also more poorly written, as you might also expect. It's got lots of Poe references to establish Argento is clearly a fan but there's nothing of Poe's talent in this one. The story is \"The Black Cat\" and it's about a crime scene photographer (Harvey Keitel) who kills his girlfriend's cat. Then he goes crazy and it's a whole thing. Honestly, even with Keitel's bizarre performance and Argento's visuals, this one was a snoozer for me.<br><br>I think if you look at some of the other reviews here, particularly from those who love the movie, you'll see I'm in the minority on this. Most people seem to prefer Argento's story and hate Romero's. In a way, I get that. Argento has more style and a devoted cult following. I have enjoyed several of his horror films, though not enough to call myself a big fan of his. So take that into consideration. If you're someone who generally prefers a Dario Argento type of horror film, you are likely to prefer the second story to the first. Either way I'll be surprised if you love either of them, as they are both pretty mediocre.","user":"utgard14","rank":[9,9]}]