[{"title":"What's not to like? This movie is a classic like the first.","rating":9,"date":"9 August 2004","review":"I've read many comments about the Vacation movies. Most people give the original \"Vacation\" high marks, but trash the others. I think a lot of people just like to be pick on Chevy Chase. \"Vacation\" is the best, but I liked the sequels and \"Vegas Vacation\" is my favorite of them. My kids just love to watch \"Vegas Vacation\". You can't pop in the DVD expecting to watch a movie that will be thought provoking or life altering. It was made to make people laugh and it accomplishes that very well. Chevy Chase and cast are very funny in this movie. The Wayne Newton bit was great. I love going to Vegas, and I love this movie. When my wife and I fly to Vegas, we always kid about going to the bathroom to join \"the club\" like Clark and Ellen. Numerous other things remind us of the movie when we are in Vegas, and it has made those trips even more enjoyable. Just wish Chevy would do another \"Vacation\" movie.","user":"tvandagriff","rank":[48,66]},{"title":"I love this one !","rating":8,"date":"13 December 2018","review":"The original is obviously the best one.\nEuropean &amp; Christmas ones have some funny moments.\nBut on the whole this movie is funny &amp; great.\nRusty as mister Papageorgio (?) and the escapades with Clark and cousin Eddie are hilarious.","user":"kdupes-1","rank":[9,10]},{"title":"The Griswalds Parade In Vegas","rating":14,"date":"14 November 2004","review":"\"Vegas Vacation\" makes no pretenses to be a good, hearty, intelligent piece of cinema: it features many critical, inexcusable flaws, such as: trafficking in mindless frivolity, some occasionally cheesy dialogue, and even wavers constantly from scene to scene without any means of resolution or connection. Yet, if you can ignore its many irksome qualities, the latest outing with the Griswalds is simply an outrageous, hilarious, and pleasurable romp of a movie. If you laugh at something senseless and absurd, such as Cousing Eddie babbling on about his worthless, pathetic existence, or Clark Griswald finding himself at the edge of the Hoover Dam, or even a busload of tourists crashing into the estate of \"Mr. Las Vegas\", Wayne Newton, so what? Where logic and reasoning are scarce behind the odds of the scenarios the Griswalds encounter, laughs are aplenty to make this one gleeful, jovial outing full of some really effective comedy. The idea of the dysfunctional Griswalds venturing to Vegas for yet another \"family vacation\" and finding themselves experiencing the whims of the city of entertainment in their own individual ways, with Clark being a hapless, compulsive gambler, Ellen having somewhat of an affair with Wayne Newton, Rusty hitting it rich at the casinos and masquerading as a \"playboy\", and Audrey aspiring to be an exotic dancer, how hilarious can it get? Couple this with the outrageous imbecilic likes of Cousin Eddie continuing to plague Clark's existence, and \"Vegas Vacation\" succeeds in delivering a royal flush of laughs. If it's silly and inane, if scenarios are too illogical for words, and if not everything really comes together by the end, at least you have plenty of funny material to laugh away at, and that makes for a jolly good outing, when you find yourself laughing consistently throughout the film, which warrants a solid recommendation for \"Vegas Vacation\". Hilarious! *** out of ****","user":"CurtMan@LVCM.com","rank":[17,23]}]