[{"title":"You'll never have me - but we can try","rating":10,"date":"8 October 2005","review":"Just watched this for the first time, and enjoyed it immensely. Some here have suggested that there's no 'real' story at all. I don't agree: Lynch doesn't work like that - no matter how bizarre and reticulated, there's a story there, all right, but you have to dig for it.<br><br>'Mulholland Drive' informs this film considerably. Having deconstructed that one to my satisfaction, I have a clearer view of how Lynch does things; how he shows us the elements, the language he uses, and what he leaves out for us to discover. So, then - *SPOILERS*, if I'm right:<br><br>As with MD, there's a big clue in the first few seconds: Fred is shown in close-up, looking thoroughly wrecked, smoking a cigarette unsteadily. There's a buzzing sound, and light sweeps across his face and the room. *The sound is one you'll become familiar with later, in the jailhouse.* Fred looks up, warily.<br><br>Major premise: I believe this scene shows Fred, in the last moments of his life, having his last cigarette before they come to take him to the chair. This may, in fact, be the only 'real' scene in the film, with everything else being Fred's distorted recollection, and the rest a psychotic break fantasy he constructs to escape from his grim situation.<br><br>As the door to his cell opens, Fred rejects the awfulness of reality, and transforms the buzz into the sound of his door intercom, and at this point we go into his personal flashback as the story continues.<br><br>The acting and dialogue is often stilted and unrealistic in this flashback. What we're seeing is Fred's recollection, which - as he himself says - is not necessarily the way it actually happened. His relationship with Renee is tense and unreal, with lots of suppressed rage. Cleverly, the undercurrents are conveyed mostly by the background sounds - listed in the credits as 'Ominous drones' - and these provide the significance that the dialogue alone would lack.<br><br>At the party scene several events take place: his suspicions about Renee and the impossibly sleazy - because he's seen through Fred's eyes - lounge-lizard Andy are effectively confirmed (for him). And he meets the 'Mystery Man', a devil-figure who tells Fred \"You invited me (into your home). It is not my custom to go where I'm not wanted\". I suspect that this figure is Fred's attempt to unload his guilt onto someone else: a 'devil who made him do it' - don't you have to invite the devil into your house? Perhaps he's the personification of Fred's insanity, or his jealousy. Or all of the above - all the dark influences in Fred's life and head.<br><br>As the flashback continues, we see the progression up to the point where he finally does murder Renee, horribly. Again he attempts to reject the reality by showing it all on video, but reality intrudes and a few seconds are shown of him 'really' sitting among the dismembered parts of his wife. His subsequent trial and sentencing are skipped over - they're a blur to Fred - and he winds up on Death Row.<br><br>Facing execution, and unable to tolerate his real state, Fred then creates a fantasy in which he escapes his fate by miraculously turning into another person - an innocent: young, enjoying a simple life, good at his simple job; with groovy, understanding parents and a pliable girlfriend.<br><br>The scenes around Fred's miraculous replacement are classic Lynch fantasy-made-real: the dialogue is ludicrous; the events comic-book. We see the same in the fantasy world of the central character in MD.<br><br>Although safe in this new fantastical environment, Fred/Peter is unable to resist being drawn back into danger, initially via his unlikely relationship with the - again comic-book - gangster boss, Mr. Eddy. This gangster character is a one-dimensional, violent crazy man who recalls the fantasy mafia types invented by the central character in MD to 'explain' her bad break.<br><br>Even so, Peter's life will remain peaceful if he avoids any dealings with Eddy outside of the grease-monkey relationship. But Fred's paranoia demands danger, and Peter begins an even less plausible and obviously perilous association with Fred's new incarnation of Renee: the pure-hearted damsel in distress that is Alice.<br><br>Except that, once again, Peter's life is contorted by Fred's paranoia, and Alice slowly metamorphoses into a spiteful, greedy psychotic who leads Peter further into danger. <br><br>(I looked for the 'Eye of the Duck' peripeteiac scene that Lynch always puts into his films, and one of the candidates is, I think, the moment where Alice points the gun at him after raiding 'Andy's' house. The tableau is held long enough to allow you to contemplate all that could happen if she shoots Peter and takes off. But that's not possible in a Fred/Peter fantasy, so we continue, with the point about her ruthlessness made.)<br><br>What else? The storyline continues as might be expected, with Alice now in total control. The cabin we've seen before just prior to Fred's metamorphosis. Alice disappears. The Mystery Man returns, and so does Mr. Eddy and Fred. All of this in a fight, during which the devil-figure hands him a knife that allows him to defeat Eddy/Dick Laurent (as we have discovered), and finally everything turns to crap as Fred heads back onto the highway with retribution on his tail. Things look hopeless, and the escape fantasy has brought him back to the point where he came in.<br><br>And then Fred begins another metamorphosis, which we never see completed, and the film ends. Is this another fantasy escape, or his death in the Chair? <br><br>I don't know how much of this is correct. Perhaps one day someone will tie Mr. Lynch to a rack, put electrodes on his nuts, and extract the line-by-line details of his wonderful creations. Until then we must wonder and worry. And marvel.","user":"cdimdb","rank":[112,128]},{"title":"An intense experience","rating":9,"date":"21 June 1999","review":"Clearly, as with most of David Lynch's films, Lost Highway is not for everyone.  It is, as Lynch intended it to be, a film realization of a dream. In this regard, it is comparable, in terms of artistry and raw intensity to Kurosawa's _Dreams_.  Indeed, in terms of sensory experience - cinematography and sound, for example - Kurosawa and Lynch have few rivals. However, the comparison falls away rather quickly in consideration of the film's content.  Lost Highway is really no dream, but a nightmare.<br><br>Let's face it, like it or not, everything Lynch does is intentional.  This film has inspired polarized reviews here on IMDB.  Those looking for a plot-heavy movie that they do not necessarily have to pay attention to tend to despise it.  Those who are open to allowing this manipulative, intensely disturbing and thought-provoking film to carry them into its own parcel of hell love it.  This is, in my opinion, what good art can do.<br><br>Like a dream, Lost Highway has as many plots as it does viewers with their own individual interpretations and perspectives.  It forces itself upon you with a vengeance, but simultaneously encourages the kind of disengagement you experience when you are conscious that you are dreaming.<br><br>I recommend Lost Highway highly.  See it with intelligent, open-minded friends who like to talk about film experiences.  And expect that the conversation will keep you up way past your bed time.","user":"mst-2","rank":[242,289]},{"title":"For those, who try to understand the Movie","rating":9,"date":"13 August 2004","review":"First of all let me say, that it is not as serious, if you don't get the movies of David Lynch at once (or even never). Lynch is not a film maker who tries to make movies with a problem-solving message, but an artist. Moreover he started as a painter and so he tries to create an atmosphere more than to develop a story.<br><br>Most viewers will have realized that \"Lost Highway\" is a story about a schizophrenic murderer (even Lynch mentioned it). But that is not the complete clue to the movie. Cause everyone is aware of Fred's metamorphosis (although no one seems to really care about). So his mutation seems to be real and till the end no one proves the opposite! But \"Lost Highway\" is not a common movie about schizophrenia like \"Beautiful Mind\" or \"Das weiße Rauschen\" (Which is a must-see, too!). INSANITY IS NOT THE SUBJECT, BUT THE NARRATIVE PRINCIPLE OF THE MOVIE! In other words: The movie is not a presentation of mental sickness, but a complete sick presentation, which means that the subjective perception of the protagonist becomes the objective reality! You'll find this way of telling a story quite often in surrealistic literature (i.e Franz Kafka's \"Die Verwandlung\" engl.: \"Metamorphosis\" - just note the title!!).<br><br>All Lynch-Movies refer to mental illness or the state of dreaming: No character ever seems to care about the illogical and irrational twists of the plot(just like in dreams), the landscapes are unrealistic and change appearance or size and the story takes place at deserted areas (forests, claustrophobic rooms, industrial areas, desserts) far away from civilization or reality!<br><br>Insanity - Sanity/ Evil - Good/ Reality - Fiction are no longer categories one can rely on. The protagonists see their surroundings and environment always threatening, but they never question it! They act with such a matter of course, that one has to ask whether it is ignorance, naiveté or self-deception. Perhaps you don't have to ask yourself how far you are able to UNDERSTAND the message. Perhaps you have to ask yourself how far you are willing to ACCEPT the message. Be aware, that once you started seeing the world at a different way you will follow that white rabbit right the way in his burrow...","user":"knockpasheemore","rank":[275,338]}]