[{"title":"Solid crime thriller","rating":8,"date":"29 October 2006","review":"Nick Chen is a tough as nails New York cop who works on both sides of the law. When a new rookie cop is assigned to his unit he sees how the local crime boss tries to corrupt him and Chen reconsiders his ethics. All the while a few twists and turns show who is really playing who.<br><br>This is by no means a very original movie, especially for Chow Yun-Fat. His first American film, 'The Replacement Killers,' also was kind of a re-run, but what is there to say? He's good at this type of stuff.<br><br>Just like 'The Replacement Killers' this film was also a flop at the box office and it is probably through its gritty and uncompromising tone. Yeah, there's action and intense shootouts, but it is not like 'Die Hard' or anything. Innocent people die, the ending isn't happy, but what matters is that the film isn't cheesy - it pulls no sucker punches or cheap thrills. It sticks to the characters while keeping the action secondary, but no less intense. The plot too is also pretty interesting and is a little more intricate than 'The Replacement Killers' or Chow Yun-Fat's cult hits from Hong Kong like 'Hard Boiled.' It is not quite a masterpiece of genre, but remains a solid crime thriller nonetheless. 8/10<br><br>Rated R: strong violence, and profanity","user":"BroadswordCallinDannyBoy","rank":[28,29]},{"title":"East meets west in an interesting mix of styles","rating":8,"date":"1 July 2001","review":"This is a Hong Kong action flick with a distinct taste of the west.  The movie starts off with a bombing and small store shoot-out that is right out of John Woo's stylebook but then it under goes a change.  The story starts taking over and it is one of intrigue within intrigue.  There are great moments of action with two guns blazing and an unbelievable amount of bullets but the story becomes the main thing.  This works as glue that a lot of Hong Kong movies don't have.  There are long pauses of plot developments between double crossing bad guys that are a real change to what is a typical Hong Kong action flick.<br><br>The director John Foley likes to place people in positions where they have to make critical decisions under pressure (At Close Range and Fear) and this is no exception.  A caring cop caught up in a situation of corruption is under constant pressure to decide what is right.  You are kept guessing as to his ultimate decision but the pressure is there under a dozen different situations.  The sub-plots add to the texture of this movie and add to its richness.  These side stories of the bad cop father in trouble, the interaction of rival Chinese gangs and his love of Asian culture are all parts of the puzzle that is Danny Wallace played by Mark Wahlberg.  Foley knows Wahlberg from the direction of his acting breakthrough in Fear and uses him at what he does best, the confused tough guy with the sensitive agenda. (His latest movie `The Yards' is an example of what I mean). Nick Chen the experienced street cop played by Chow Yun-Fat is the perfect slightly crazy hard-hitting loner, who has embedded himself in the struggle of rival gangs in New York's Chinatown.  There is no black and white here, only shades of gray, in a world of who is doing what to whom but like the cultural differences between East and West the relationships between individuals overcomes the hard facts of doing business on the street.<br><br>A very good blend of the Hong Kong actions movie that was brought in by Chow Yun-Fat (if you hear the commentary that Foley never saw a Woo movie) and what Foley's image is for street life in New York.  Coming from New York and living and working in Asia gives me insight into the homework that went into the making of this movie and I will say they did a very good job.","user":"hmarcy","rank":[24,27]},{"title":"Misunderstood - A Great Film","rating":10,"date":"13 March 2005","review":"The Corrupter is beset by expectations of Yun-Fat Chow in another John Woo flick. This isn't a John Woo flick (and I mean the old John Woo pre-American Studio), but it does evoke moments that are very John Woo/Yun-Fat Chow esque ala The Killer and the blind girl.<br><br>This film is a character study of Nick Chen and Danny Wallace (played very well by Mark Wahlberg) as cops that must make decisions that may compromise their professional and personal integrity, but the lines drawn are not as simple as that. The film really asks people under what circumstances is it okay to bend the rules in order to achieve results that otherwise would not be possible? Would it be okay to let one guilty person go in order to catch ten more in the future? Would it be okay to convict one innocent person in order to catch a thousand guilty in the future? <br><br>Danny Wallace joins Nick Chen in the Chinatown task group. Danny is forced to ask himself whether the short term actions, and their moral implications, are worth the long term good of the force, himself, and his family.","user":"letsroll","rank":[41,49]}]