[{"title":"Delightful comedy -- a fresh breeze to typical violent, sarcastic Hollywood movie making","rating":8,"date":"19 April 2003","review":"\"Dear God\" is a movie the whole family can enjoy. Despite a predictable plot and an ending anyone can spot a mile away, the overall ensemble acting and dialogue are surprisingly fresh and sometimes poignant. The conversion of Tom from a conniving con who thought of every angle to profit himself to a do-gooder is gradual and quite convincing, avoiding a common pitfall of many feel-good movies. Jaded cynics may sneer at the religious tone, but it is actually not about any religion but about the uplifting experience one can gain by helping each other. <br><br>The cast of Kinnear, Metcalf, Pitillo mixed with old pros like Conway, Elizondo and Browne really deliver. Conway is especially enjoyable, a scene stealer up to his old tricks, and Metcalf is deliriously wacky. A special mention goes to the director, Gary Marshall, using subtle yet funny touch to parody the American media and court system.   Overall, this movie is very delightful for everyone who is not a total cynic. Rating: 8/10.","user":"bhcpc","rank":[10,14]},{"title":"Starts awfully, then improves measurably","rating":5,"date":"27 January 2000","review":"\"Dear God\" is the rare example of a movie that starts abysmally but slowly gains its stride. Most films these days are the opposite. They grab you right off, then run out of steam. To be fair, \"Dear God\" never fully grabs you or has much steam. But it gets to the point where it becomes worth watching, eliciting several pleased chuckles, while still falling far short of out-and-out funny.<br><br>Greg Kinnear plays a two-bit hustler whose honest face and convincing stories allow him to con working joes out of their money. He has a gambling debt to repay to Junior, an overweight thug who teaches him a lesson or two about horses and stables at a disastrous visit to the track. Kinnear's Tom Turner is arrested while trying to scam two undercover cops disguised as foreign sight-seers, and in a ridiculous plot convenience, is sentenced to find a paying job for one year. Most criminals should be so lucky. But of course, Turner has that honest face.<br><br>Anyway, he ends up at the post office, where he's assigned to a dead letter office filled with whacko postal cast-offs, played with sufficient nuttiness by Laurie Metcalf, Jon Seda and Tim Conway, among others. Conway's character once memorized the entire layout of the city of L.A., but was demoted when he lost it and bit a dog. Metcalf plays a former lawyer who needed a \"less stressful\" job. You get the idea.<br><br>Through a series of accidents, this motley crew begins answering letters to God, and, through their limited means, they begin making minor miracles happen throughout L.A. The press picks up on it, which draws the attention of the U.S. Postmaster General (played with his usual rabid energy by the director, Garry Marshall), and brings heat on the do-gooder crew, whose activities are technically illegal. (Opening the mail is a federal offense). Meanwhile, Kinnear's Turner remains on the run from the gangsters and tries to woo a single mother played by the adorable Maria Pitillo, whose character has no function in this film other than as a weak romantic interest.<br><br>Extraordinarily lame-brained from the get-go, \"Dear God\" actually gets on course, as the relative uniqueness of its storyline manifests itself in some sweet, quiet moments, and as the ensemble group of veteran actors really begins to relish their roles. Metcalf is always funny, although she's a little over the top here, and Kinnear is notable for his ability to play a likeable everyman. Conway has a very-funny apology scene with a dog and is otherwise likeable in his eccentricity.<br><br>The movie ultimately only reaches the level of so-so -- but I guess the fact that I felt compelled to write about it means that it made some impact on me, and that I can marginally recommend it. 5 out 10.","user":"Vance-11","rank":[8,11]},{"title":"Dear God, thanks for this funny and uplifting movie!","rating":8,"date":"7 April 2005","review":"Tom (Greg Kinnear) is a petty conman who poses as a burn victim (among other things) to elicit money from innocent bystanders. He has quite a reputation around town so law enforcement goes to some length to catch him in the act. Brought in front of a judge, she decrees that he will get a real job or end up in the pokey. So, a job it is for him. Tom has his eye on a pretty lady named Gloria, anyway, so it might help his image with her, too. Strings are pulled to get him into the postal service's dead letter office. Once there, surrounded by kind and interesting people, he begins to turn his life around. He even reads some of the letters addressed to God and performs random acts of kindness. What could be wrong with that? This movie leaves the viewer with feelings of great joy. Kinnear is a charmer, in every way, and with cast members such as Maria Pitillo, Tim Conway, Roscoe Lee Browne, and Hector Elizondo, he is in great company. The script has a buoyant message to give about helping others, only to receive kindness back in return. How nice the settings and costumes are, too. A love story develops quietly for any viewer who longs for comedies with romance. This film is recommended for individuals or families who need their faith restored in humanity, but who also enjoy laughter and nonsense along the way.","user":"inkblot11","rank":[8,13]}]