[{"title":"A film that deserves far more than it's given credit for","rating":28,"date":"28 March 2006","review":"Somewhere in the dark recesses of over-fluffed and processed Stephen King movie adaptations, there lies this jewel of a film: \"The Dark Half.\" <br><br>After having it watched it about three times, I'm still quite at a loss as to why this movie has been, more or less, forgotten or simply passed over by the horror movie community. Not only is it a fairly neat adaptation of a great King novel, but it's also directed and written by a true horror movie icon: the one and only George Romero. Isn't this the kind of \"team-up\" that fans would, under normal circumstances, go absolutely bananas over? I know that I did.<br><br>Anyway ... the movie is about a writer, Thad Beaumont (Timothy Hutton), whose past - quite literally - comes back to haunt him. As a young man, he wrote pulpy crime novels (that I can only imagine were directly inspired by Richard Stark's hardboiled, master thief, Parker) that sold well ... though his literary yearnings tended to veer toward a much less marketable direction. We learn that when he was writing those pulps, his personality suffered. He drank, yelled at his wife, probably slept around, too. Having successfully exorcised that particular demon, when we meet him, Beaumont has a couple kids and an office at some New England university, teaching - you guessed it - creative writing. But when the bodies of folks close to him (i.e.: his agent, biographer) begin cropping up, the small-town police fun finger is pointed at Beaumont. But ... there's a much more sinister twist in this jet-black yarn. We learn that Beaumont indeed has a \"dark half.\"<br><br>The direction is perfect, the writing is perfect, the acting is perfect. What more do you want in a film? I'm not exactly certain what King's response was to this film ... I've heard rumors that if he's not directly involved in the production process, he generally scoffs at the final film product. (For example ... he's all but urinated on all the goodness that was Stanley Kubrick's adaptation of \"The Shining,\" which not only marked a substantial turning point in horror cinema, but it's also one of my personal favorites.) Then again ... from what I understand to be true of King and Romero both ... they're friends. Hell, they made \"Creepshow\" together ... which is another favorite of mine, though I'm more than just a little bit guilty about it. <br><br>\"The Dark Half\" also does one hell of a job at creating a genuinely creepy atmosphere. And who could listen to \"Are You Lonesome Tonight\" again the same way ... after hearing its soft melodies during a particularly uncomfortable dream sequence?<br><br>All of this, compounded with the fact that Timothy Hutton is a damned fine actor (albeit sinfully unknown by most these days) ... makes \"The Dark Half\" an explosively well made horror/thriller. The proverbial mind meld of King and Romero made \"Creepshow\" an instant cult classic. So, I ask again ... why was \"The Dark Half\" a blink-or-you'll-miss-it flop? Maybe these horror titans just can't share the same marquee, anymore.<br><br>I dunno.","user":"TigerMann","rank":[57,63]},{"title":"One of the Better Stephen King Movies","rating":8,"date":"16 May 2009","review":"The Dark Half is a very good horror movie which is not surprising considering the novel was written by Stephen King. George Romero a man who has done a wonderful job with horror movies is the man in charge of taking this from a novel to a movie and he delivers.<br><br>The plot revolves around author Thad Beaumont. Beaumont had written several best selling novels under the pseudonym George Stark. However a law student makes the connection and threatens to reveal it to everyone. Before this can happen Beaumont goes public and tells everyone he is Stark, essentially killing off his pseudonym. Stark isn't content with being dispatched and he comes to life determined to stick around. Stark then goes around killing those responsible for his demise. Beaumont must fight Stark because only one of them can survive.<br><br>Timothy Hutton does a spectacular job as both Beaumont and Stark. He really makes you believe the two are separate people but are tied together. The plot is suspenseful and full of unexpected twists. There are also supernatural elements such as the sparrows or bringers of the living dead.<br><br>So to sum it up The Dark Half is one of the better adoptions to Stephen King's works. It follows the story accurately and succeeds in scaring the audience which is the aim for horror movies.","user":"Sabrz","rank":[18,20]},{"title":"\"The sparrows are flying again.\"","rating":8,"date":"8 February 2004","review":"The Dark Half is one of the finest Stephen King adaptations.  It's also one of George Romero's most under-appreciated works.  The two of them have collaborated on many occasions to produce nothing but good things, but this takes it to a new level.  Romero is known for casting unknowns for his leads.  This time he went against the grain.  He used the amazing Timothy Hutton.  Hutton, in a dual role, plays both mild-mannered Thad Beaumont and mean b*stard George Stark.  But when he's Stark, he really comes to life. He's both cool and creepy.  The sparrows are also a crucial part of the overall eeriness of the movie.  Although he will always be known for the unforgettable Dead trilogy, this may be Romero's finest, most high-brow picture to date.  The production values are the cleanest I've seen in any Romero flick, the acting is top-notch, and story is solid.  Getting a scare at the theater is fairly easily achieved.  Getting me to jump in the privacy of my own home in another thing altogether.  Romero made me jump while watching the movie on a crappy 19 inch television.and I've seen the movie before.  That's saying something.  Royal Dano and Michael Rooker co-star.","user":"Backlash007","rank":[40,50]}]