[{"title":"Don't Take It As Gospel","rating":8,"date":"9 April 2007","review":"The Champo - a small cinema du quartier in Paris - is to be applauded for staging this major retrospective of Sacha Guitry; since January of this year they've been screening one Guitry title twice a day from a pool of twenty five which means they've now screened all of them at least twice. Most of the time it's difficult to believe they come even close to the nut but today, perhaps because it was a Bank Holiday, there were about 60 patrons for the second screening at 4 pm. This is Guitry in urban mode which means sophisticated well-dressed people sitting in salons dishing dirt and playing sexual games. The only thing that comes anywhere near Guitry in this mode is Noel Coward and even that is slightly misleading; they were both primarily playrights, yes, and they tended to write with a swizzle stick rather than a pen, yes again, but really they were chalk and cheese. This is prime Guitry, nuff said.","user":"writers_reign","rank":[6,9]},{"title":"Unknown Cuvée Grand Cru","rating":10,"date":"15 May 2009","review":"As a forever and a definitively Sacha Guitry fan,<br><br>eventually failing to be original in my commentary, I almost could be dithyrambical...<br><br>Once more, a SG movie brought me a lot of fun and tears of laughter !<br><br>Astonishing actor, script writer and director he was !<br><br>Spicy and sparkling flavourous dialogs, funny situation and great acting,<br><br>this \"Le Nouveau Testament\" is at least an unknown \"Cuvée Grand Cru\". <br><br>And as always, the major thing to enjoy such comedy is that you have first to like comedies, than to accept rather long dialogs.<br><br>But for me, if he could have done a thousand movies with such quality scripts, I would watch all of them... Yes, Sir !<br><br>I also guess unless you're really fluent in French speaking, and with French social and psychological background from the 30'/40's, it will be uneasy, as unfortunately usual with any translation, to understand and enjoy all the beauty and subtle of the \"action\".<br><br>SG was using his sharp pen for sharp spirit movies...<br><br>In fact there are only two possible ways with him :<br><br>you are a converted devotee to his church, bowing deeply to his mastering...<br><br>the one I belong to... Isn't it rather funny ? ... because in fact don't like churches :-)<br><br>or... you just don't understand... and as a consequence, you despise him ! <br><br>This movie was sleeping at home since two years, and I just watched this evening... I tell you, a hidden gem !<br><br>You bet ? I just loved it !<br><br>A film is never really good unless the camera is an eyes in the head of a poet, Orson Welles","user":"ifasmilecanhelp","rank":[7,12]},{"title":"Husbands,wives,lovers ,sons and daughters","rating":6,"date":"28 February 2011","review":"It has nothing to do with the Bible ,as my good friend writers' reign wrote in his insightful comment.<br><br>Not one of Guitry's best ,but even when he was a little off color,he was better than most of the rest .There is a \"Theatre DE Boulevard \" side ,this side of Feydeau.Wives ,husbands and lovers show at every turn and the reading of the \"legacy\" is one of the best moments in Guitry's whole canon.If all were on the same level ,it would be a first-class work.But one must admit some scenes drag on .I've seen all of Guitry's movies before the war (and most of the post -war works) and it's no match for \"Roman D'un Tricheur\" \"Perles De La Couronne\" \"Vie D'Un Honnête Homme\" or \"La Poison\" or \"Assassins Et Voleurs \"or ......... (fill in the blanks :we deal with one of the richest canons of the French cinema) To Feydeau's vaudeville,Guitry,however,adds another dimension : nostalgia for his youth ,when the world was in his arms (\"now that we are older,says he,we have to accept all the happy events in life\" ).The two young people epitomize what the hero has lost.Mortality(or immortality ,which is the same) and nostalgia for the bygone salad days would become prominent in the director's final years .In spite of a happy end (Guitry leaves for a holiday with a girl who could be his daughter) ,it leaves a bittersweet taste in the mouth ( the girl IS his daughter) <br><br>We learn something even more important:in Paris,never arrange to meet your lover under the statue of Joan of Arc :there are plenty of them !","user":"dbdumonteil","rank":[2,3]}]