[{"title":"touching portrait of a real relationship","rating":6,"date":"6 April 2003","review":"This is a beautiful little movie. Juliet Stevenson (as Nina) plays one of the most authentic female leads I've ever seen: She bawls full-out, complete with fluids; she looks like a man in bad lighting; she's passive aggressive and irritable and loveable and likeable and real. Likewise, Alan Rickman's character, Jamie, is peevish, like all of us, self-centered, like all of us, but beautiful and unique and again, real. Unlike the schmaltz we're fed here in the states, where dialogue consists of rehearsed speeches (think Jerry Maguire) and love seems skin-deep, this is a couple that seems not only to love each other but to genuinely like each other; a couple that has their own language, as long-term couples do (and it's not translated, which is so refreshing), a couple that can be silly with each other and irritated with each other within minutes; that can have spats that are not high drama or the beginning of the end or anything other than the end of a long day in a too-hot apartment. The ending broke my heart yet seemed like the most natural and right course of action. Truly stunning.","user":"jennifer-137","rank":[57,58]},{"title":"A lovely examination of grief and grieving.","rating":10,"date":"30 November 2005","review":"A nice look at what it means to lose someone, and to be the lost as well. All too often (as in the treacly \"Ghost\") we are treated to a fantasy version of love and loss, where you get to have your cake (looking fab in that graveside outfit) and eat it too (dead person is wonderfully available as he guides you to your next, even better for you, love). Here, we see a woman who cannot let go, who is so paralyzed with grief she cannot live the life left to her. The man she lost untimely loves her so dearly he returns, not to take up where they left off (which is all she asks), but to guide her back into life, life he can never have again. What makes this movie admirable is the deft and sensitive rendering of the act of letting go, from both the point of view of the lost and the living.","user":"niteotaku","rank":[69,72]},{"title":"Wow!!","rating":12,"date":"12 February 2007","review":"Now, I like a weepy, I'm not ashamed to admit it. I actively seek out those films that are most likely to make me cry. However, more often than not, I end up disappointed because usually this type of film is either wildly melodramatic or painfully sentimental.<br><br>That's what I was expecting from this, to tell the truth. A woman overcome with grief at the death of her boyfriend? Give me a break!... I was in floods by the end, and promptly watched it again.<br><br>This film is testament to how well us Brits can do when we put our minds to it. It's charming, funny, warm and absolutely heart-breaking. All the performances are grouped under an umbrella label 'very good', with one notable exception: that of Juliet Stevenson as Nina. She is magnificent, and is, at times unbearable to watch. I'm still absolutely astonished at her performance. This is a woman who has had her heart and soul ripped out I love this film. I'm getting a lump in my throat just thinking about it. It's wonderful! (Blub! *Sniff*)","user":"john-mitchell77","rank":[37,38]}]