[{"title":"Highly Entertaining","rating":7,"date":"9 May 2016","review":"After spending more than five years in prison, Harry Talbot (Michael Madsen) plays poker with his comrades and wins a large amount and a Lincoln. However Harry does not know that his buddies have dumped a body in the trunk of the car. Meanwhile, a young woman called Kit Califano (Patricia Arquette) is trying to revenge her father killing the mafia kingpin Santino (Seymour Cassel) that killed him. Kit is the granddaughter of the also mafia kingpin Grandma Martucci (Florence Stanley) that sends her henchmen to bring her back home. When Harry meets Kit in a bar, she escapes from the men and he gives a ride to her. Meanwhile Harry's buddies discover that the key that they need to open a safe with money is with the corpse and they hunt him down while the mobsters seek Kit out to accomplish Grandma's order. The hunting begins while Harry and Kit want to get rid of the body,<br><br>\"Trouble Bound\" is a highly entertaining action-comedy with a funny story. Michael Madsen is in the top of his career and the lovely Patricia Arquette is sweet and gorgeous. The corpse steals the show and might have been the inspiration for the 1989 Weekend at Bernie's. My vote is seven.<br><br>Title (Brazil): \"Arriscando Tudo\" (\"Risking Everything\")","user":"claudio_carvalho","rank":[8,9]},{"title":"Pretty good stuff...","rating":9,"date":"6 March 2001","review":"This is the kind of movie it's a joy to discover on some off cable channel on a deep dark wintry night. Pure contemporary film noir. Topnotch actors - Madsen (today's Mitchum in my book, Arquette - one of the best in all modes, Thornton - a genius). The plot moves right along, it's a classic road/mafia comic romance flick. The cinematography is amazing - I looked up the guy &amp; he went on to do Jerry McGuire &amp; 3 Spielberg flicks including Private Ryan. What more can I say? I've always loved great trash - Jim Thompson was My Man!","user":"inframan","rank":[14,18]},{"title":"Nothing special but it passes the time nicely enough","rating":7,"date":"17 April 2003","review":"It's true that the formula to this movie is more than a little overused these days, but it's acted well enough by Madsen and Arquette, and being less than an hour and a half in duration, it keeps you interested anyway. I found it a very easy to watch, albeit fairly predictable film that's inoffensive and, occasionally, great fun. Patricia Arquette looks gorgeous in \"Trouble Bound\" (I seem to have developed a thing for her after seeing \"Human Nature\"!) and the overall result is a slightly above average action comedy. 6.5/10","user":"loz-1","rank":[11,14]}]