[{"title":"Gripping; definitely _not_ a carbon copy.","rating":21,"date":"21 February 2000","review":"Contrary to what several users have written, \"Copycat\" is _not_ \"Silence of the Lambs 2\". Nor is it a rip-off of \"Se7en\", or an exploitation flick, or any other negative labels that have been foisted upon it. Rather, it's a gripping, and largely intriguing thriller that succeeds thanks to performances by two confident female leads, competent direction, intelligent writing, and an appropriately foreboding score courtesy of Christopher Young, who's fast becoming one of my favorite film composers.<br><br>Sigourney Weaver hits the right notes as the agoraphobic psychiatrist, especially early on, as we see the depths to which she has shut herself off from the outside world, creating her own safe little corner. Holly Hunter, in a role that instantly brings to mind Jane Craig from \"Broadcast News\", is effective as the investigating detective. Hers is a performance that is three-dimensional and fully-realized.<br><br>If there's a weakness in the film, it's the ongoing beef between Ruben and Nico. It's a meritless p***ing contest stemming from one character's jealousy, and could've easily been dropped or retooled. This small gripe, however, didn't deter my enjoyment of the film.<br><br>Much credit has to be given to director Jon Amiel (\"Sommersby\", \"Entrapment\") for effectively capturing the atmosphere and tension prevalent throughout the film. In addition, writers Ann Biderman and David Madsen deserve credit for a intelligent, well-researched screenplay. No clichés here, just sharply-crafted dialogue. And Christopher Young's inspired score is brilliant; just listen to the theme that plays early on, as Helen calms down after a panic attack.<br><br>\"Copyat\" may not be classic material, but it's a strong entry in a genre that's too often consumed by formulas and gore. Highly recommended.","user":"Rid.X","rank":[87,101]},{"title":"One of the best serial killer movies","rating":8,"date":"24 May 2005","review":"The serial killer genre is one that became popular after \"Silence of the Lambs,\" and since then the only ones that have really stuck out are \"Se7en,\" \"Copycat\" and \"Saw.\" \"Copycat\" is about a psychologist who lectures students on serial killers, and one day finds herself to be a victim at one of her speeches. Attacked in the bathroom, she narrowly escapes death and becomes a social recluse in the years that follow -- living through the Internet, anonymously chatting on Internet chat rooms and so on and so forth.<br><br>Until the terror begins again, this time involving not only the ex-pschologist (Sigourney Weaver) but also a cop played by Holly Hunter.<br><br>\"Copycat\" was much better than I thought it would be. I originally saw it on TBS years ago; I remember the ads claiming it would be on, but for some reason the rights fell through and it didn't air for another month or so... through this time period I hadn't heard anything about the film, but within the very first few minutes I instantly knew it was going to be much better than the standard \"Silence\" rip-off.<br><br>I may be alone here (and trust me, I know it) but I enjoy this more than \"Silence of the Lambs,\" which kind of bores me at times. \"Copycat\" is dark and unexpectedly intelligent -- it is also perfectly cast. Weaver is fine (if unexceptional) whereas Hunter's macho-female traits are put into play perfectly by her casting as a cop.<br><br>The killer in the movie is played by Harry Connick Jr., and even he does a good job, which is saying quite a lot.<br><br>The movie has unexpected twists and is very clever in its own right. It is undoubtedly influenced (heavily) by \"Silence of the Lambs\" but is successful in the way it adds its own qualities to the mix -- much like \"Se7en\" this is a serial killer movie cashing in on the success of \"Silence,\" but not necessarily stealing its content.<br><br>Very surprised. Catch it if you can.","user":"MovieAddict2016","rank":[64,81]},{"title":"excellent thriller","rating":10,"date":"27 August 2002","review":"This is an overlooked, intelligent, frightening thriller.   It poses a sick, shrewd serial killer against a brilliant psychologist/writer/professor (Weaver) and an attractive team of cops. Weaver delivers an outstanding performance as the brilliant agorophobic (sp.?) who has been emotionally devastated by a prior run-in with a serial killer. Offers a clif's notes review of the century's major serial killers, constant tension, crisp writing and outstanding performances.  In short, it is a very good, very scary movie, and you should see it it you haven't yet. <br><br>  Personally, I also think Weaver looks fabulous.  Brains and beauty and character.  Nice combination.","user":"keys72","rank":[49,62]}]