[{"title":"Three Phenomenal Actors Give The Performances Of A Life Time","rating":1,"date":"1 September 2003","review":"Six years ago, a director by the name of Curtis Hansen came out with a small time film named L.A. Confidential. Though the movie garnered several big nominations at the 1997 Academy Awards, the nation had been swept up by the gigantic and romantic blockbuster, Titanic, thus shrinking the chances of this brilliant movie from garnering any real awards. 1997 completely screwed this phenomenal film, in which three brilliant actors gave the performances of their careers.<br><br>Russell Crowe plays Detective Bud White, a tough L.A. cop who bends the rules in order to bring justice to the city. He is ruthless, and unforgiving of anyone, which brings him into direct conflict with Detective Lieutenant Ed Exley, played by Guy Pearce. Russell Crowe became with this role a full pledged character actor,: the cop with a steel physique, and a vulnerable heart. He becomes so believable and real to the audience, you can not help but sympathize for his character under the circumstances.  From this role, Crowe went on to garner three best actor nominations, winning for his role in Gladiator.<br><br>Guy Pearce, the little known Australian body builder, became the character known as Ed Exley, a straight, uptight detective trying to live up to the legend his father created before him. Exley has so much to prove to the LAPD, trying to show them that he is just as good, maybe even better, than his father. He plays the politics in a corrupted police department very well, and is able to use these skills in solving the corrupt and mysterious case of the Night Owl murders. This film officially put Guy Pearce in the big leagues of film, making his next appearances in Memento and The Count of Monte Cristo. He is a severely underrated actor who deserves better than what he has been getting.<br><br>Finally, the ever wonderful Kevin Spacey. Spacey plays Lieutenant Jack Vincenes, a cop who gives a popular LA police show, Badge of Honor, real solved cases in return for money. Jack sees his life as an ever going soap opera, until he comes across a case that somehow has a connection to the Night Owl murders. Kevin Spacey has proved time and again his abilities as an actor, and he continues with this performance. <br><br>Curtis Hansen does a wonderful job bringing this story to the big screen. His talents, although recognized, have not been awarded as of yet. I can only hope that someday, someone will give this amazing director something worthy of his talents. <br><br>Highly Recommended. <br><br>MJR","user":"flipgirl38","rank":[306,350]},{"title":"Everything in this film is fantastic.","rating":10,"date":"11 January 2000","review":"L.A. Confidential is, without a doubt, the best film of the 1990s, and quite possibly one of the best films ever made.<br><br>As with any great film, it all starts with the writing.  The story is riveting, the dialogue is smart and quite funny, and the characters are written in three dimensions.<br><br>The acting is phenomenal.  Perhaps a bigger tragedy than L.A. Confidential's loss to Titanic in the Best Picture race is that none of the three lead actors even garnered nominations.  Russell Crowe, Guy Pearce, and Kevin Spacey are absolutely phenomenal; it is their characters that drive this fascinating story about police corruption in 1950s Los Angeles.  We get to know these people, to understand who they are and why they do what they do, and to root for them to overcome their imperfections.<br><br>The directing is fantastic.  Curtis Hanson doesn't shove anything in the audience's face; instead, he allows the audience to discover the film's nuances on their own.  (That makes this an excellent film for repeat viewings, you truly catch something new every time).  1950s Los Angeles is reproduced beautifully.  The editing is quick and seamless, the music is perfect for the film (Hanson should teach other directors how to do a montage effectively), and the cinematography is great.<br><br>I can't find a negative thing to say about this film.  It's truly a masterpiece.","user":"Giuseppe Giuseppe","rank":[414,478]},{"title":"A fascinating look at life in the big city","rating":8,"date":"19 August 2005","review":"Give a collection of great actors a great story to work with and you are likely to end up with something rather special. Such is the case with L.A. Confidential. The boldface names jump off the page...Kevin Spacey, Russell Crowe, Kim Basinger, Danny DeVito, James Cromwell and, in his first big-time role, Guy Pearce. And none of these big names are just mailing it in, here to collect a paycheck. They're all on top of their games, undoubtedly helped to no small extent by the wonderfully nuanced and utterly intriguing story.<br><br>This story takes place in 1950s Los Angeles but this is a side of L.A. most people don't get to see. Behind all the Hollywood glamour L.A. has a seamy side which will be the focus of this tale. At the heart of the movie are three cops who ostensibly are supposed to be working together but who go about the business of dispensing justice in very different ways. Crowe plays aggressive hothead Bud White. Spacey is Jack Vincennes, who takes more pride in his work as an adviser on a popular television cop drama than he does in his actual police work. And Pearce plays Edmund Exley, a young up-and-comer in the department who plays things by the book. As we will soon see Exley is rather unique in an LAPD which believes in doing whatever is necessary to bring the guilty to justice. Even if it means becoming a little guilty themselves.<br><br>The movie really begins to move forward with a massacre at a coffee shop. It seems a pretty cut and dried case but initial appearances can be deceiving. Soon White, Vincennes and Exley will find themselves caught up in a maze of lies, deception and mystery. It will be a great test for these very different men as it appears they may well need each other's unique talents to solve this puzzle. And quite the elaborate puzzle it is. One important piece is Lynn Bracken, a high class call girl played by Basinger. Tying together many of this complex story's strands is gossip writer Sid Hudgens who is played with appropriate sleaziness by DeVito. And in the background the whole time is the somewhat mysterious Captain Dudley Smith, played by Cromwell. Here is a man who believes in bringing the guilty to justice by any means necessary. That's all well and good if you know who the guilty are but in L.A. Confidential you're never quite sure who to believe. The viewer is guessing right along with the investigators on the screen. And in the end it all comes together and pays off brilliantly.<br><br>L.A. Confidential is first and foremost a great story, with many fascinating twists and turns along the way. The film also serves as a showcase for some of this generation's finest acting talents. Each of the main characters is wonderfully unique and each of the actors involved does a terrific job in bringing those characters to life. These are complex characters in a complex tale. It's so involved that the acting had to be stellar if this film was going to work and none of the stars disappoint. Terrific storytelling brought to life by a collection of inspired performances makes L.A. Confidential an absolute winner.","user":"hall895","rank":[95,108]}]