[{"title":"I enjoyed this.","rating":14,"date":"14 March 2001","review":"I thought this flick was great fun. I thought the acting was pretty decent and not as bad as other people say. Sure, the three leads are all teen idols, but I am not going to knock their performances because of that. Still, I continue to enjoy this flick, and always will","user":"marcfantozzi","rank":[14,17]},{"title":"Don't expect a teenage version of \"The Edge\"","rating":4,"date":"5 February 2017","review":"Released in 1997 and directed by William Dear, \"Wild America\" is a family adventure about three Arkansas brothers in the late 60s, Marshall, Marty and Mark Stouffer (Jonathan Taylor Thomas, Scott Bairstow and Devon Sawa respectively), who dream of becoming nature filmmakers. Their dream comes true when their parents (Jamey Sheridan and Frances Fisher) allow them to travel America, filming alligators, moose, grizzly bears and more. Don Stroud, Tracey Walter, Zack Ward and Claudia Stedelin have peripheral roles.<br><br>The movie's based on the true-life story of the brothers who went on to become big-time nature photographers, particularly Marty Stouffer, who directed the Wild America TV series (I even have a couple of those VHS tapes somewhere). The movie was released two months before the excellent \"The Edge\" was released, but don't expect anything within the realm of quality as that movie. Don't get me wrong, there is some good in \"Wild America,\" it's just offset by the BAD.<br><br>The good includes an effective cast and stellar locations, not to mention a glorified cameo by an actor whom I'm not going to name, but he was a fairly big-time actor at the time. There's also some quality animal photography. Unfortunately, the kinks weren't worked out in the script. For instance, near the end the youngest brother has some mature dialogue that no kid his age would ever speak (both my wife and I thought this). Furthermore, the story has no narrative drive and so when the plane sequence occurs in the third act it's simply not moving or believable (although I enjoyed the sky photography). Speaking of unbelievable, there are three animal sequences that utterly destroy any suspension of disbelief: The moose sequence, the snake scene and, the worst, the entire bear cave episode, which almost single-handedly ruins the movie. Then there's the boys' film that was shown at their school. While this may have really happened I can guarantee you that the film looked nothing like what is shown.<br><br>Bottom Line: \"Wild America\" might be good for pubescent girls who are fond of the teenage protagonists and entertained by the fun antics, but adults will be turned-off by the lack of story drive and realism.<br><br>The film runs 106 minutes and was shot in South Carolina (Jasper County), Georgia (Rincon &amp; Tybee Island), Arkansas (Fort Smith), Utah (Monument Valley), Arizona (Sedona) and Alberta, Canada.<br><br>GRADE: C-","user":"Wuchakk","rank":[4,4]},{"title":"Really, it's not that bad!","rating":12,"date":"12 November 2002","review":"Despite the three young actors being \"teen idols,\" they pulled off really good chemistry throughout the film.  My primary faults with the film are not with the acting at all, but with the screenplay.  Because of the writer's desire to put everything possible into one movie, he sabotaged its overall effectiveness.  Is this a classic teen idol flick?  Is it a nature film?  Is it comedy/drama/action?  It's really hard to say, as it doesn't succeed as any of the above!  There are too many side-plots -- does the owl really need to be there?  Or Leon?  Or the man in the mountain?  There are too many relationships given just a hint of substance, such as that with Mom, the town bully, the local girls, the college girls...  In addition, Mark's character has little opportunity to develop, and the other boys leave a great deal to the imagination.  And I ask you, is it necessary for Marshall to have three different nicknames?    This is, unfortunately, one more movie that could have been really great.  As it is, it is a fun film without enough substance.<br><br>On a side note, is there any particular reason that only one of the Stouffer brothers was involved in producing the show?  I find that a little odd, myself.","user":"musicnina","rank":[11,15]}]