[{"title":"Surprised how much I liked it","rating":8,"date":"15 January 1999","review":"When this was on TV the other night, I expected to stick out about two minutes of it. Being a follower of Tarantino, all I'd heard recently of Spike Lee was wholly negative. In addition, I know nothing of black culture and/or jazz. Imagine my surprise then when, two hours later, I found myself entirely intoxicated by the blend of atmosphere, empathy, humour and pure depth of character and relationship in this exceptional movie. Next up, I'm watching all his other movies... Quentin, make your peace!","user":"AndyInThePieWithAlmonds","rank":[18,19]},{"title":"Spike's cool, modern poem to jazz","rating":3,"date":"3 November 2000","review":"After the commercial and critical success of \"Do The Right Thing,\" in which Lee announced his arrival as a major player, he choose to follow up his breakthrough with a more personal film.  If you examine history, it seems all iconoclasts choose to do so after their first big success (\"The Conversation,\" \"Close Encounters Of The Third Kind,\" \"Talk Radio\"), and Lee decided to pay homage to what he's always referred to simply as \"the music.\" Set in then-present day 1990, \"Mo' Better Blues\" tells the tale of Denzel Washington as Bleek Gilliam, a selfish trumpeter who fronts his own jazz quintet in an upscale Brooklyn club.  The strength of the film deals with Bleek juggling his loyalties.  On the love side, Bleek is caught between two women; Clarke is a sexy bombshell in constant need of Bleek's attention who's too busy centering in on his music.  She's also an aspiring singer hoping Bleek will give her a chance to shine.  Bleek, obviously, does not want to share the spotlight.  Indigo is a thoughtful schoolteacher who is not fragile with Bleek's tremendous ego but is careful with his somewhat callous heart.  At work, Bleek is wrestling with a hungry band demanding pay raises given the success they're achieving at the \"Beneath The Underdog\" club.  Clumsily working towards the band's raise is Giant, Bleek's lifelong friend and incompetent manager, who also has a considerable gambling problem.  Bleek must decide whether to trust Giant or risk losing his band, while deciding how long he can keep up the game between Indigo and Clarke.<br><br>This, simply, is one of my favorite Lee films.  Thank God someone finally made a jazz film for the late 20th century, jazz had not received a proper modern makeover since 1961's \"Paris Blues.\"  Lee creates a wonderful, intimate world set off by moody lighting in shades of red, yellow and blue. His camera and editing - which was spontaneous and lively in \"Do The Right Thing\" - is slow and deliberate here, carefully punctuated in all the right places.  This film marked the debut of some of Lee's trademark camera moves, including the 'gliding sidewalk' dolly and his slow-spin-upward pans.<br><br>\nLike his previous films, Lee is adept and balancing out scenes between comedy and drama.  A lot of the 'band' scenes are engagingly funny, mostly guy talk with a spin of that \"cool daddy jazz vibe\" added.  Lee is also skillful at making Bleek the antagonist of the film without rendering him completely unlikable.  The \"Love Supreme\" montage ending seemed to stretch the film for longer than some would have liked, but I feel it was justified in order to illustrate the beauty and necessity of Bleek's redemption.  Lee was also smart to reduce screen time given to the film's true protagonist, saxophonist Shadow Henderson (rendered with cool, suave sophistication by Wesley Snipes), in order to keep the audience focused on Bleek. You will also get a delicious sampling of great jazz in this film if you're a novice to such.  Aside from the concert numbers written and performed by Branford Marsalis and the dreamy jazz score by Lee's father, Bill, there are great pieces by John Coltrane, Miles Davis and Dizzy Gillespie, among others.  A cool, sexy film.","user":"JawsOfJosh","rank":[26,29]},{"title":"Spike Lee, ya got this one right!","rating":10,"date":"4 December 1998","review":"One of Spike Lee's best, \"Mo Better Blues\" captures the atmosphere of jazz. The soundtrack flows with the acting like a song.  Denzel Washington does a great job of portraying a jazzman's quest for perfection, while living in a \"real world\" full of problems.  Being a musician myself, I appreciated the struggle Washington's character was going through.  All of Spike Lee's trademark camera angles (which I've disliked in some of his movies) worked to perfection in this movie.  Great music, good acting, and a solid plot. Recommend!","user":"Rhythm-2","rank":[19,22]}]