[{"title":"A Space Adventure!","rating":7,"date":"12 November 2008","review":"I don't think Lost in Space was a bad movie. Is it a movie to be honored the all-time best? No, it's not. There are flaws in this movie, but I don't care too much. The movie is about a family, the Robinsons trying to go to the other habitable planet in the galaxy. They do all right until the villain, Spider Smith tries to kill the family and he ruins the navigational system. Now the Robinsons are lost. The acting is OK. Some of the actors did a great job such as Matt LeBlanc and Gary Oldman. The rest did OK. The special effects are not as good as movies from the time period such as Armageddon or Godzilla. The effects are good, though. I was disappointed in the writing. Akiva Goldsman is a respected writer with talent. For a bad script, all the actors did a good job. The music is pretty good. I liked the electronic soundtrack. I give this movie a 7/10 because I liked the space scenery, the gadgets, and the action.","user":"g-bodyl","rank":[48,57]},{"title":"A Near Miss","rating":9,"date":"9 January 2000","review":"Frankly, I don't think this movie is as bad as some people make it out to be.   I like the early episodes of the original series (particulary the first six), when the show had a more serious tone (and before Jonathan Harris sabotaged it by turning up the comic antics as Dr. Smith) and it's nice to see the film stay closer to that serious tone and not emulate the more campy aspects of the series from its later episodes.   The cast is good for the most part and I love the visual FX.<br><br>However, once the Jupiter 2 crashes on the planet and we get caught up in the time travel older Will Robinson bit, that's when the movie falls apart completely.   And the biggest mistake of all is that the older Will Robinson is not played by original Will Robinson, Bill Mumy, even though he badly wanted to play the part.  Having listened to the comments of the director on why he didn't cast Mumy on the DVD, I have to say his explanation doesn't wash.  Especially when both he and the scriptwriter concede that the device of using the \"older Will Robinson\" didn't work on the screen as it did in writing.   It never occurs to them that maybe the scene would have worked if this new character sprung on us was someone with a definable connection to the old show.","user":"Eric-62-2","rank":[92,116]},{"title":"Despite a terrific cast and a good beginning, this film just falls flat","rating":6,"date":"22 June 2007","review":"Dr. John Robinson (William Hurt) is taking his family into deep space to find a life-supporting planet for the human race. Things on earth are deteriorating, to say the least. Going along with him are his scientist wife Maureen (Mimi Rogers), his brilliant daughter, Judy (Heather Graham) and his equally intelligent children Penny and Will. Needing a good pilot, Dr. Robinson nabs hotshot airman Mark West (Matt LaBlanc) to fly their spaceship. Evil Doctor Smith (Gary Oldman) tries to sabotage the vessel but ends up getting caught on board. Amid the ensuing chaos, the ship goes off course and gets lost. Between battling spider-like creatures and their own killer robot, the Robinsons still hope to reach their destination. Will they? This movie starts off with a bang and ends with a whimper. The problem? Well, it is not the terrific cast. Hurt, Rogers and Oldman are wonderful in their respective roles, while Graham and LaBlanc delight the audience with their wit and charm as the couple who provide the movie's romantic elements. All other cast members are quite fine as well. The production looks nice, too, with great costumes, sets, and special effects. So, that leaves the uneven script. It starts off well, with a quick look at the Robinsons' quest and the plotting of Dr. Smith. There are even some great lines, such as the one Maureen hurls at John and Mark, as they are sparring. \"If you guys are done hosing down the deck with testosterone...\" had me laughing heartily. But, it all just fizzles somewhere in the middle and ends up being utter nonsense, a plot without a cause. What a shame. Those of us who loved the sixties television series deserved better. If you are partial to any of the cast members, from Hurt to Graham to Oldman, do make time for this film, someday. They are the reason to see this movie, for they are a joy to watch, even in a film as lame as this one.","user":"inkblot11","rank":[44,55]}]