[{"title":"Day-Lewis and Watson: Outstanding!","rating":2,"date":"2 April 2003","review":"Jim Sheridan's films are always powerful. Shakespearian in their intensity of character conflict, they bristle with grit, are masterfully acted, and propel themselves the way John Ford's best films do. I consider him, even with his limited output, one of the great A list directors. No, his camera work isn't stunning crane and rail ballet, it's old school - but GREAT old school - Zinneman, Ford. And if you're a filmgoer who likes to care deeply about characters, Sheridan makes your kind of film.<br><br>Acting doesn't get better or more truthful than Daniel Day Lewis and Emily Watson working together. They're  absolutely believable - inspiring actually - as a couple struggling through forbidden love after 14 years apart. The dialogue they work with is A plus and written by Sheridan;  thus it's probably tuned collaboratively during rehearsal.  Very organic. Great (!) work by Gerard McSorley, Brian Cox (L.I.E.) and David Stott as Ike.<br><br>\nYep, Northern Ireland as Sheridan portrays it can be dreary, as commented here. But it's also full of humanity, drunkeness, hope, cruelty, love, loyalty, oppression, and a desperate longing for change - all the stuff of true drama. The action commences at the moment Ireland is on the cusp of real but fragile peace. Boxing and the IRA? A one two punch.<br><br>I love this film and I'd watch it again with any friend who wanted to see an excellently written and played picture. If you want your blood to boil from some fine performers playing strongly written characters, check this out. Not quite \"Elizabeth\", but powerful. Good enough dramatically  (albeit not quite visually) to sit on the same shelf with Raging Bull.","user":"intuitive7","rank":[23,24]},{"title":"Difficult but rewarding","rating":9,"date":"16 February 1999","review":"I think the reason this wasn't as well received as MY LEFT FOOT and IN THE NAME OF THE FATHER (the previous collaborations of Daniel Day-Lewis and Jim Sheridan) is this is telling a more complex tale, and while I loved both of those films, this one you have to work harder for.  It should be said there are some lapses, particularly in the dialogue, which is often unnecessarily repeated.  And sometimes, in his attempt not to play on our emotions too much, Sheridan goes too far in the opposite direction, making the film too distant.<br><br>Still, this is a powerful film.  Sheridan was accused with IN THE NAME OF THE FATHER with making an anti-British film, but in that one and this one, he shows he's not afraid of taking on his own people as well.  At the same time, while his sympathies are with Day-Lewis' character, he's able to recognize all sides of the situation, as to emphasize the point that peace is always hard work.  Day-Lewis, as usual, gives an outstanding performance, though he's a little too old, and Watson continues to grow as an actress with her performance.","user":"SKG-2","rank":[23,27]},{"title":"Realistic, depressing and yet full of hope","rating":9,"date":"14 July 1999","review":"I really liked this film for several reasons. Firstly, it dares to tell the story of ordinary people caught up in a conflict that they don't want to be a part of, and having their best hopes crushed. The script isn't written to be a crowd-pleaser.<br><br>Secondly, the story and the style of narration is wonderfully subdued and lowkey, both fitting the story perfectly and allowing the viewer to really involve him/herself in the story and characters.<br><br>Finally, the performances of Day-Lewis and Watson are very good. Day-Lewis lends great credibility to his character. He is no Mel Gibson or Harrison Ford rising again with a firm jaw after each blow, but rather a believable portrait of a man believing and wanting to do his best, but time and time again having his hopes crushed.<br><br>But the real star performance of the film is by Watson. After \"Breaking the Waves\" I had written her off (sorry, but I tend to do that with people who have played in von Trier movies), but her performance in this film is simply outstanding. Her portrait of both pride, strength and vulnerability is amazing.<br><br>9 out of 10.","user":"BBCdk","rank":[26,31]}]