[{"title":"A refreshing, oddball little film! Phil Collins in a fine film role!","rating":7,"date":"13 December 2001","review":"Coming across this late at night on ITV1 was quite a find really. I had heard of it, and the idea of Phil Collins as a demented villain did appeal. I really liked the oddball quality of it all, with Collins wonderful as a jovial, buffoonish grinner, treading the line between menace and absurdity in portraying one Roland Copping, who one might call a tad eccentric. The lunacy and non-sequiturs build up very effectively in the middle of the film; perhaps the tone might have been made a little more dark, or perhaps less light, presumably with different, less jaunty music.<br><br>Maybe it tails off slightly, but the ending somehow seems to me a gem. The absurdism isn't compromised by a happy ending, it is strengthened by a subtle, fitting conclusion.<br><br>I wouldn't say this was a perfect film, but it is damn enjoyable, far from the mainstream and never bland. The sets, by the way, for Copping's house, are fab; just thought I had to add that!<br><br>Rating:- *** 1/2/*****","user":"HenryHextonEsq","rank":[6,6]},{"title":"A very interesting movie!","rating":10,"date":"30 January 2007","review":"By far this is one of my favorite movies. It is so different than the norm that Hollywood puts out. I came across it one morning on one of the movie channels. I watched the last 45 minutes of it, but was so intrigued I had to track down the movie. I finally found a copy on the PAL system, got it and had it transfered over to VHS. This was a few years ago. I wish they would release it on to DVD.<br><br>Phil Collins gives a wonderful performance, he needs to do more movies roles. Hugo Weaving is also a delight to watch, it is different to see him in a non-action role. I recommend this movie to anyone who is lucky to come across it.","user":"adrianlcampbell","rank":[8,11]},{"title":"Frauds....A winner to me","rating":8,"date":"13 March 2011","review":"I realise the first thing people who look at this movie will think 2 things. Australia and Phil Collins grumble, grumble, grumble...Well I watched this film in as best an objective observer as I could be. I like Phil Collins as a musician, I say like, I mean I really like, but however if I thought he was awful I would say so. Sure this film was not going to win an Oscar, But it's clever, Quirky and the humour is darkly rich. The 3 leads are excellent, All border line madness as their worlds collapse around them at various moments. I really enjoyed this film and also goes to show that not only do you not have to spent mega bucks on a good wacky thriller but keep your eyes peeled, The uk and USA don't have the rights anymore on making appealing movies. Rent it, Buy it, Watch it, It will make a good Saturday night :)","user":"schofy","rank":[3,4]}]