[{"title":"A seaside postcard from the depths of the human heart","rating":9,"date":"30 March 2004","review":"Not really a comedy - more a surreal, sometimes weirdly comic piece about comedians, about families, about the awfulness of having a famous father, about genius, about the problem of what makes a comic funny, about the sublime sadness of failure. Lee Evans is absolutely haunting as the tortured comic genius, the natural comic who is so purely a comedian that he can barely communicate except in gags, yet who will never be allowed to perform in public because of his dark past. Leslie Caron is heart-rending as his mother, a brave, faded French beauty stranded for ever singing mildly risque songs in Blackpool pubs, and their tender scenes together are for me the best thing in the whole film.<br><br>The whole cast is incredible...right down to Oliver Reed camping it up gloriously in a bizarre sub-plot which at first I thought might be part of the Evans' character's fevered imagination. It is a movie absolutely crammed with magic but in one of my favourite scenes, Oliver Platt arrives in Blackpool and instantly sees it peopled with characters from Donald McGill postcards - fat ladies, saucy girls with flouncy skirts, burly men. The ending is a bit wonky and looks to my eye to have been changed from a tragic one to a \"happy\" one to please audiences. In the two opening sequences, both Evans and Platt utter the words \"I'm going to die\" in very different circumstances, and mean very different things, and other variations on the theme of death and laughter follow - all this seemed to be pointing down a much darker alleyway than the one we got. Doesn't matter, though. Still a great movie.","user":"sarahcyn","rank":[24,24]},{"title":"Underrated","rating":9,"date":"19 September 2002","review":"This film is a very underrated gem - it cant be put into a nice little box like Hollywood always wants to do with projects. \"This is a wacky comedy\" \"This is a dark family drama\", etc. You could tell they did not know how to market the film when it first came out in the US. They made it look like a wacky farce which it is not. This film works as a dark comedy about talent, those that have it and those that dont and yes, Jerry lewis gives a strong performance (right up there with King Of Comedy)and Lee Evans is a marvel as a talented comedian and Oliver Platt gives one ofhis best performances as an untalented offspring of a legend. Worth seeing - just dont expect slapstick, expect three-dimensional flawed people trying to make peace with one another and get through their torn lives.","user":"shark-43","rank":[30,31]},{"title":"A very multi-faceted film","rating":13,"date":"13 October 1999","review":"When I first saw this film I thought that it was brilliant.  At first it seemed to have an amateurish quality about it, but this turned out not to be true.  What I thought was amateurish about it turned out to be the sound. The ever present ocean seems to add to the sound quality as if the viewer were really there, experiencing what actually happened.<br><br>This is undoubtedly one of Oliver Platt's best roles.  I thoroughly enjoyed watching the intriguing Mr.Fawkes.  Lee Evans was also unbelievably riveting in his portrayal as the mentally disturbed young man.<br><br>This film is very representative of the small town in Britain with it's quiet undisturbed population that seems to be frozen in time, in contrast to Fawkes's father's life in America, which is busy and ever-changing, where the most important thing in life is money, as opposed to memories being just as important back in the small British town.<br><br>The best part of the film is watching (in small parts) the unravelling of the horrific event that had happened so many years before and turned the young man (played by Lee Evans) into the person he is today.<br><br>A riveting watch.  See it.","user":"Valek-5","rank":[15,15]}]