[{"title":"Beautiful and Fresh","rating":8,"date":"14 March 2005","review":"This is a very fresh and unusual film that explores the experiences of two children in a small rural town in Turkey in a slow and stylized manner. It seems to encapsulate the experiences of one year into a day, with the morning and school set in the winter, the journey home in the spring, and the evening in the summer/autumn, giving the film a very different feel to it. It possesses a dream like quality, even at times blending dreams with reality.<br><br>Despite occasional spots where the camera movement is not very smooth, certainly a problem of the budget, etc., the cinematography is fresh and beautiful, very artistic. In fact, the focus on the senses and how the characters see and feel everything is one of the great strengths of this film, such as when the children are picking fruit in a cemetery and the wind picks up, blowing through the forest, or when their older cousin is loafing around at a fair.<br><br>There is no real \"plot\" with nothing to address and nothing in particular happening, etc., but that is not important here. The film does a great job at achieving its apparent purpose of presenting a thoughtful, sensitive, beautiful, even poetic image of these kids' normal experiences during a finite period of time.<br><br>The acting on the whole is very good. This is particularly true at the meal/fireside of the family in the woods, where the people roast maize/corn and children doze off listening to grandparents, parents, and cousin tell stories, argue, etc., in a very realistic manner that grips the viewer despite the slow pace and lack of any real event.<br><br>One of the main problems with the film is that there are some gaps or missing elements in the screenplay/development. An example is the introduction of the older cousin into the film in the first part. We see him, but have no idea who he is. how he relates to the two children, what he is doing there, etc. In fact, at first it almost seems like he is reminiscing and that the scenes of childhood are his memories. Similarly, the scenes of him at the fair are visually interesting and beautiful, but their value is hindered by the fact that the viewer has no idea what the point of this portion is, what is going on, or who this guy is. I found that this hampered the beginning and made it slightly confusing, so one didn't understand the value of it.<br><br>Another slight problem is that some shots seem to last a little too long for no real reason. This overall makes sense throughout the movie, considering its slow, dreamlike pace and emphasis on senses. However, sometimes, as when the camera sits on the kids' father as he thinks in the house near the end, it lasts too long without any apparent point artistically, etc. This is not too common, though.<br><br>In the end, this is a slightly flawed, but creative, contemplative, and beautiful film. It is not, however, a film for those demanding a real \"plot\" or action, etc.","user":"Wulfstan10","rank":[21,27]},{"title":"A Naive Pastoral But Original Turkish Movie","rating":10,"date":"17 December 1999","review":"A self motivated cinema volunteer Nuri Bilge Ceylan Shot Kasaba after his short film Cocoon (Koza)sounded successfully among Turkish Filmmakers. With a slow rhythm but not a routine, film takes you to a small town (kasaba). Photographic quality of the film is excellent. Script may have shortcomings but never mind with his full amateur crew Ceylan figured out a remarkable and promising vision for Turkish Cinema. Town deserved to be viewed...","user":"akutay","rank":[7,8]},{"title":"conjured up some other movies even if it seems like a different unique Turkish movie.","rating":8,"date":"8 May 2006","review":"Nuri Bilge Ceylan,the rising star of the Turkish cinema is surely a talent.I've been longing to see a movie by him for a long time.And this happened to be the first movie I found the opportunity to watch.This was one of those short(exactly 82 min)sweet movies about life.It has a bit of a traditional tissue in it.It's just like watching an American movie like \"Garden State\" or the \"Station Agent\". The plot and the setting is totally different but the feeling you got is similar.The movie is seen from the perspective of two kids in four somewhat interrelated scenes.In the first part we see a school environment in winter in which the kids are hailing out the national pledge in the cold school garden.We see the the family's 11 year old daughter as a pupil \"facing with her feeling of shame and some merciless clues of life \" in that scene this is obvious but what is more catching is that the teacher wants the students to read some part from a text-book about community-specifically the sense of belonging to a community-the need to belong to some social unit.The kids just read the passage without making sense of what is written there.You see Turkey revolutionized its alphabet from Arabic to Roman letters but basically there's still a \"maktap literacy\" going on in these traditional distant state schools.The kids do probably know something about human beings' social needs but they don't necessarily pay attention to the passage they're studying in theory. The second part is in spring. We see the girl with her 4 year younger brother, and their wandering towards the corn field where their family are waiting for them.They just drop in a graveyard to eat some plums.There is something inter-cultural here too.When her brother tries to reach the plums on the branch his sister says \"Hey you're stomping at the grave\" The adults in Anatolia scare their kids with a warning in such situations \"Hey the dead will inhale you\" This innocent tell-off results from the respect for the dead actually.This part has the least number of dialogs actually.While the siblings are discovering mysteries of nature they barely talk and the director turns his camera into nature.Even at one point he focuses on the eyes of a helpless donkey badgered by flies.In the third part the brother and sister arrive at the corn filed where the some sort of a bonfire is lit and the grandmother's are roasting maize cobs.The grandfather tells his experiences during the First World War, how he was taken prisoner by the British and sent to India, how he endured years of starvation. This is the nature of the old Anatolian man.Whenever they see a youngster they just think that they live in a tacky world so they tell how they suffered.While the grand-dad is such a spiritually mature man in consequence of his early sufferings the father of the kids is the only educated man in the family.He sort of had difficulties to educate himself he even taught himself foreign languages.But even though he is strong in analytical thought he has barely spiritual weltanschauung.He is a great admirer of Alexander and he tells about every war Alexander did wage.And then there is this cousin Saffet who is gritty nihilist.\"You worked all your life so what?\" You just came back to the point where you started?\"Even though he is coarse and ironic he is the most realistic one actually.The fourth part takes place at home.It ends with a placid river scene actually. As for the technical details.The movie is openly monochrome.The DVD details say the director wanted something simple so he used simple cameras and most of the cast are either his relatives or his acquaintances actually. At some points I thought there could have been more dialogs.Because while the second part has barely a flowing dialog the third part is inundated with dialogs.(The grandfather's war experiences and the father's Alexander admiration).Plus Nuri Bilge Ceylan's camera technique focusing on nature looks like Elem Klimov's strategy in Idi i smotri(Come and See)(1985).I had felt bored because of this lack of dialogs and excessiveness of such camera angles in Come and See. But since Kasaba is not that long it's better but if it were longer it would be definitely boring.All in all it was a good step for me to know Nuri Bilge Ceylan's art.","user":"elsinefilo","rank":[11,14]}]