[{"title":"I'm impressed by the comments here.","rating":9,"date":"6 January 2003","review":"This is a lovely, funny and well done romantic comedy. I have to admit I am impressed by the folks who continue to say they felt JG was too pretty to be Abby and that it just didn't ring true to them because of that fact. Well I'm here to tell you folks that this movie is closer to the truth than you realize. One of the things that DOES make this film soo good is that Abby is truly a lovely woman but is surrounded by main stream media and what it says beauty is, namely, Noelle, played admirably by Uma Thurman. Yes Abby is a beautiful woman, but as a woman who looks nothing like all the adds on TV or magazines like JG it is easy to see why she would think she isn't. And honestly I know way too many men who would pass her by in favor of the Noelles of this world. I have a beautiful friend who is very similar to JG and she has had the same problems Abby has in this movie because of perceived images of beauty. THAT is the message this film is trying to make that Abby is beautiful and the media has put too much emphasis on stereotypes. No I don't think they should have hired an UGLIER actress that is simply ridiculous, the film was not about an ugly woman but a beautiful woman who has fallen into the trap of \"THINKING\" she is unattractive! Watch the movie again folks, you'll see what I mean.","user":"drkjedi1-2","rank":[63,72]},{"title":"Playfully clever Cyrano adaptation","rating":8,"date":"19 July 2006","review":"A modern retelling of the Cyrano de Bergerac tale, except the genders are reversed. Janeane Garafalo is a veterinarian on a radio talk show who gives on-air advice to pet owners. However, she has a poor self-image about her looks, and cocoons herself away from possible relationships, in an effort to shield herself from inevitable disappointment and hurt.<br><br>If the movie has one weakness, it's the fact that Garafalo is cast as an ugly duckling. No way, folks; this woman is beautiful. Depending on whether one prefers petite brunettes or tall blondes, you may think she's even cuter than co-star Uma Thurman.<br><br>Both Garafalo and Thurman are splendid, and play off each other well in their awkward friendship/romantic rivalry situation. Thurman's ditsy wanna-be actress is very sympathetic; Garafalo's intellectual but emotionally guarded Dr. Abby at times is heartbreaking. Ben Chaplin as Brian, the object of their affections, turns in a good performance of his own. One scene where two of these actors interact with eyes only--no dialogue for at least 30 sec.--is extremely powerful.<br><br>Funny bits pop up at strategic moments. The banter between Abby and Brian is like a one-liner ping-pong match; their spontaneous wit is fun to ride along with (almost like a Neil Simon play). Brian's dog is one of the best animals in a flick that I've seen in a while, he did comedy as well as his human counterparts.<br><br>A good movie worth spending an evening on, especially as a date flick.","user":"MartianOctocretr5","rank":[14,15]},{"title":"Truth Must Be Told: I like this romantic comedy that echoes \"Syrano de Bergerac\".","rating":7,"date":"23 August 2005","review":"Janeane Garofalo stars as Abby, a veterinarian who has her own radio show. She is a cultured, educated woman, who is smart, has a good sense of humor and makes a great living. The problem is that her self-esteem is low because she does not find herself attractive being 5'1 brunette who once upon a time while in college had gained 40 pounds. Well, she looked like she lost all of them and she was charming if you ask me (perhaps, it is solidarity of another 5'0 brunette ) but when she developed a relationship over the phone with one of the callers, she tells him that she is 5'10\" statuesque blonde who is hard to miss. The blonde (Uma Thurman) happened to be her next-door neighbor, the aspiring model/actress who agrees to go on the date instead of Abby... It may sound like cliché, and the film has several holes in the plot but is very enjoyable thanks to wonderful performance by Janeane and to these words: <br><br>\"You know how someone's appearance can change the longer you know them? How a really attractive person, if you don't like them, can become more and more ugly; whereas someone you might not have even have noticed... that you wouldn't look at more than once, if you love them, can become the most beautiful thing you've ever seen. All you want to do is be near them.\" <br><br>7/10","user":"Galina_movie_fan","rank":[24,28]}]