[{"title":"TWO LEGS BAD!!!!!!","rating":22,"date":"22 June 2003","review":"Agreed, the acting could have been a bit less melodramatic but the actresses concerned did a good job when they weren't looking like supermodels. <br><br>\nThe trick about it was \"they had to look good\" and they did look good. Madeleine Stowe's \"Cool Cody\", Andie McDowell's Elegant Eileen, Mary Stuart Masterson's \"Arch Anita\", and Drew Barrymore's tomboyish \"Li'l Lilly\", were fetching and gave rise to Girl Power credence.  <br><br>I couldn't take my eyes off Barrymore who had come a long since E.T. and her drug/alcohol fuelled periods of teen angst/pain.  <br><br>The fight at the end in the corral blew me away, those  girls proved they could outshoot anything on two legs!!!<br><br>There should be a sequel!!!<br><br>4 out of 5","user":"nifabs","rank":[36,56]},{"title":"Cast off the shackles that bind women of the West","rating":5,"date":"24 April 2006","review":"Jonathan Kaplan's Bad Girls leaves an interesting taste in my mouth. It is an energetic and fun film, offset by its ridiculous characters and plot. The believability factor in this flick is low, which encourages its audience to view it as a swirling maelstrom of metaphor and symbol. Woman, as defined by the early 90's, can overcome any impediment and still be beautiful, no need to become manly (and lose her femininity) to assert herself. The Western genre serves as a perfect tableau for this discourse because it is one traditionally dominated by men. Likewise, the men in Bad Girls each represent an institution of American culture that is dominated by men and their mentality, conveniently dispatched by the bad girls.<br><br>Four whores raise hell by killing a Colonel and running out of town, complete with unnecessary slow motion of Drew Barrymore shouting \"heeyah!\" and the humiliation of every man who crosses their path. The military, traditional justice, and Christianity are trampled upon, left wondering how these motivated and hard working women could escape their clutches. The film from here takes some twists and turns, and several complete circles. In short, the whores chase a dream of establishing a home for themselves around a mill that Mary Stuart Masterson's late husbands owned, countering the murderous advances of men with their own sexual flaunting. Gunfights, smarmy dialogue, pseudo-lesbianic encounters, and female flesh fill the film to to a near bursting capacity, much like Barrymore's bosom.<br><br>It is not what I would call a smart film, however it does present itself as an interesting fable about the empowerment of women by women who remain women. I would liken Bad Girls to that of the Freudian dreams of those who struggle against \"the man.\" I feel that it deserves to be seen at least once.","user":"nguldner","rank":[20,31]},{"title":"Top Notch","rating":9,"date":"5 April 2005","review":"Best expression of women in westerns I have seen so far. This eclipses the Sharon Stone film The Quick and the Dead. The latter film softens the lead character by making her survival depend wholly on the Russel Crowe character. In Bad Girls Madeline Stowe eats up the dust on the west and shows a no nonsense gunslinger that has been rare since the Man With No Name hit his stride with a trilogy of spaghetti westerns that made Clint Eastwood a universal star. I can hardly ignore the great cinema style and the substance of this movie that transcends the gender of it's hero. Make no mistake about it this is Stowe's movie to win or lose and she comes away having broke the bank at Monte Carlo. See it with open eyes if you like westerns. If you don't see something else as this will surely disappoint. It is a western all the way.","user":"Buddy-52","rank":[25,42]}]