[{"title":"Check Your Brain At The Door","rating":5,"date":"21 June 2001","review":"Alicia Silverstone is looking for a killer. The sick twisted type. See she's a big fan of those 'True Crime' magazines hence the title. Now I've never been able to grasp the interest of these magazines, but that's of no consequence here. It seems very likely a murder is going to happen and she'll naturally investigate. Along the way hooking up with a police cadet (Kevin Dillon) who's off doing his own investigation. They form an unofficial partnership and from there things proceed pretty much how you expect in these sorts of movies. More bodies show up, as do many suspects, including the police cadet, cue the sexual tension. Can you say predictable yet?<br><br>The problem with True Crime like many movies is it has nothing new to say. It's watchable, but you've seen it all done before and to better effect. The premise could be decent, but there is no follow through. It's just another cookie-cutter thriller with way too many red herrings thrown at you and a scene that happens early in the middle half of the movie just ruins it all. I call it the \"point of no return\". Without giving away too much I'll say this: She ends up investigating a house and finds hard incriminating evidence in and outside the place. Then she gradually seems to forget about it. Time passes and attention shifts to other suspects but why!? Eventually we end up back at square one and yup you guessed it. The person's house which she found all that evidence at turns out to be the killer. Laughable.<br><br>True Crime is just below average in the end. The cast is passable, there's a creepy moment or two, but the end of the movie is a joke. Unless you're a big fan of Alicia Silverstone or have lowered expectations for thrillers you should pass. Especially with the blunder the movie makes that means you can easily predict who the killer is going to be. Nevermind the fact that a 16 year old girl is smarter than all the police officers in town put together. True Crime this is not.","user":"refinedsugar","rank":[11,14]},{"title":"....an entertaining story worth seeing","rating":7,"date":"20 August 2001","review":"I searched out this one after seeing the hilarious and linguistically challenging \"Clueless\" (1995), perhaps Alicia Silverstone's best known effort from early in her film career. \"True Crime\" has Kevin Dillon, which should be helpful in improving most film projects. In fact everyone in the cast does a good job . The only disappointment I think the movie has for me is an awkward \"feel\" to some of the scenes, coming from the need to run a quite uncompromising, grown up theme as part of what in tone starts out as a schoolgirl adventure.<br><br>Alicia Silverstone is pretty good in this one. She carries off well the naive enthusiasm and growing unease that affects Mary Giordano as she manoeuvres towards the truth behind the serial murders. I reckon her characterization of MG has some mileage in it too. The inference of the story line is that she goes on to a career in law enforcement. It could be really interesting for an older Silverstone to revisit Giordano at a time of crisis later in the officer's life. Just a thought!<br><br>\"True Crime\" shows its director in a good light. Pat Verducci also has the writing credit. I don't know of any other film work PV has done. I can only wonder what happened after such a promising start.<br><br>Like most productions, this one has a largely unknown supporting cast, although Bill Nunn (Detective Jerry Guinn) is hardly that. Over the past decade he seems to have been able to secure an impressive number of screen appearances. I recall seeing him recently in \"Carriers\" (1998), a made for TV presentation with a military theme. Bill Nunn played \"Captain Arends\". Fans of the classic US TV comedy show \"Who's the Boss\" may also have an interest in \"Carriers\" because the leading player is Judith Light, remembered with affection by many because of her lengthy involvement with the show.<br><br>\"True Crime\" could easily not have worked, but it does OK. I think it is an entertaining story worth seeing.","user":"blue hermit","rank":[6,8]},{"title":"very good","rating":10,"date":"21 January 2006","review":"I saw True Crime when it was first released back in the mid-nineties and I have watched it many times since. It is a great mystery about Mary (played by Alicia Silverstone), a high school senior in a California town who's classmate's younger sister was tortured and killed by an unknown murderer. Mary meets Tony (played by Kevin Dillon), a police cadet who sees how bright she is and they decide to work together to try to find the killer.<br><br>Many suspects in this one. True Crime feels very \"true\" or real to me. I read a newsgroup review where someone wrote that total suspension of disbelief is present here and it is so true. Alicia Silverstone is perfect in this role and Kevin Dillon and Bill Nunn do a great job, as do the other actors. The locations are right on and the writer/director, Pat Verducci, really captures some of the realities of teenage life and of Mary's loneliness (see the scene where Mary awakens from the dream sequence after having viewed the photos she took of Tony). I wish Verducci would make more movies.<br><br>I have not seen any other movie quite like True Crime. 10/10","user":"g404c","rank":[6,11]}]