[{"title":"One of the greatest my personal favorite best action John Woo-Van-Damme action style movie!","rating":10,"date":"1 January 2018","review":"Hard Target (1993) is one of the greatest and the best action packed movie in a John Woo-Van-Damme Style! Of all Van Damme movies this one of his, is the best of Van Damme ever and I absolutely love it to death. Like the title says Don't hunt what you can't kill. It is my John Woo's number 1 personal favorite action flick of all time, that I love to death. It is also one one of my personal favorite action films of all time. <br><br>\"Don't hunt what you can't kill.\"<br><br>The thrill of the hunt. It's the ultimate drug, and the more intense the rush, the higher the price. International superstar Jean-Claude Van Damme teams up with world-famous action director John Woo for this electrifying thriller Van Damme is the target of an evil mercenary (Lance Henriksen) who recruits homeless combat veterans for the \"amusement\" of his clients - bored tycoons who will pay a half a million dollars to stalk and kill the most challenging prey of them all: Man. Laced with dark humor and slam-packed with electrifying action Hard Target is a must see for action fans. \n <br><br>Hard Target is not only my John Woo favorite film, it is also my Jean-Claude Van Damme favorite best action film from my favorite action star. I put this film over Die Hard, this is my Die Hard movie. I love that the stunts were realistic I think that John Woo didn't allow Van Damme to make his own stunts and it is a shame that Jean-Claude Van Damme *beep* up his chance with John Woo by making on another film. It is Van Damme's ego fault. Still they don't make movies like this. <br><br>I heard that there is Driector's cut somewhere on DVD that I have never saw, I own this film on Blu-ray in my John Woo collection and I still love it. The stunts are crazy, the action are spectacular. Van Damme catching a snake wow incredible. (at one point, a movie's typical crazy stuntman; firing the Beretta 92FS 9mm while standing on the seat of a motorcycle and crashes in to the car.) Still the motorcycle chase sequence is my favorite scene in the film. <br><br>Van Damme \"launches thousands of bullets, slugs, and explosive projectiles into THIRTY of mercenary tycoons baddies.\" Arnold Vosloo is also underrated actor who plays Pik van Cleef he did a really pretty good job as the villain and Fouchon second mercenary henchman. Possibly best role for him. \"I don't get angry. I'm a professional.\" I love this movie the action is delivered perfectly. Honestly I love Arnold Vosloo more in this movie than Lance Henriksen and I love his character Pik van Cleef. <br><br>The trill of the hunt. It's the ultimate drug and the more intense the rush, the higher the price. Hard target was the film is saw as a teen when I was 18, I couldn't saw it as a kid I really don't know, it was never on TV and I have never seen a VHS cover in a video store. I didn't even know that movie exists. <br><br>Hard Target is a 1993 action film that marked the US directorial debut of acclaimed Hong Kong director John Woo, who brought out his Asian style of action to Western cinema.<br><br>10/10 for me I love this movie to death, It is my number 1 favorite action film.","user":"ivo-cobra8","rank":[92,111]},{"title":"Call It What You Will, But It IS Entertaining!","rating":8,"date":"19 March 2006","review":"Many people see \"Jean-Claude Van Damme\" in the lead and think this another stupid, no-brainer action flick and guess what? It is! BUT, it is also a very entertaining film, kind of ripoff of the old \"Most Dangerous Game\" storyline....and, if you can suspend belief for 90-100 minutes, you'll be vastly entertained....and that's the name of the game, folks.<br><br>Some of the action scenes are outrageous and big-time \"Rambo\" mentality, meaning an entire arsenal that could wipe out a small country is used against our hero and never seems to kill him! People are being shot in the streets but no is ever around in the middle of the day but the killers and victims? Usually that stuff annoys me, but I didn't seem to mind in this movie. In fact, it fits.<br><br>Despite the lack of credibility, Van Dame standing on top of a speeding motorcycle as it heads towards an onrushing car, and later dodging all kinds of pretty neat weapons as he tries to help Yancy Butler, is just fun. John Wood-directed films tend to be ridiculously exaggerated and loud, so that's what you get. I am not a fan of many of his films, but I am of this one. It's pure macho madness with a Lance Henriksen doing what he does best: be an incredibly-nasty and brutal villain. An added bonus in here - a real hoot - is old man Wilfred Brimley as Van Damme's French uncle who comes to his nephew's aid.<br><br>Add a great blues soundtrack and you have a great film to feed your male hormones with when needing to be fed some gratuitous violence.","user":"ccthemovieman-1","rank":[69,82]},{"title":"Don't watch what you can't enjoy!","rating":22,"date":"22 October 2003","review":"Typical of the absurd criticism comes the way of most any Van Damme film is a reviewer I noticed below, who protractedly raves on paragraph after paragraph about nothing more incidental than the credibility-challenging motor cycle sequence. Jesus wept, what the hell does it matter whether such is possible or not? Is the freeway chase in THE MATRIX or TERMINATOR 3 likely? We go to the movies primarily to be entertained....to take a step into a world where reality takes a rain-check half the time! HARD TARGET is right up there with Van Damme's best work, and yes he DOES work. Personally I consider it his best film. Being Woo's first American outing, he creatively put a lot into this. Although scaled down, I found it equally as entertaining as FACE OFF, which like BROKEN ARROW, offered insane, impossible but FUN action sequences.<br><br>HARD TARGET is a stylistic film that although admittedly ripped off from THE MOST DANGEROUS GAME (but so too was THE RUNNING MAN and DOGBOYS) delivers some superb sequencies. Van Damme is NOT wooden, he's not one half-bad Cajun with a real bad attitude. Matter of fact, HARD TARGET succeeds because it has that one vital spark necessary to any worthwhile flick - interesting characters!  Vosloo (Before THE MUMMY) is absolutely great as Henriksen's right hand man. A professional killer with no shred of decency.  Er, thats what a killer is SUPPOSED to be!  When he utters that line \"Randall, Randall, Randall!\" you just know that Randall is about to have a real bad day! Henriksen chews up the film as the soul-less Fouchon....he even goes out with class... \"Oops!\"<br><br>Yancy Butler is not one to ignore either. Spunky little thing who took her charisma to another level in DROP ZONE! And dear old Wilf Brimley as Chance's reliable and feisty Uncle. He almost steals the film.<br><br>If you don't like this one you're really hard to please and if you wanna complain about Van Damme's acting again? for God's sake go watch THE ENGLISH PATIENT.","user":"uds3","rank":[83,103]}]