[{"title":"Insanely incoherent comic-styled Asian sci-fi","rating":8,"date":"20 March 2001","review":"This movie rarely pauses to let you catch your breath (or figure out the plot) before another onslaught of stylish action wierdness happens.  Like Jackie Chan's CITY HUNTER, this is a Hong Kong adaptation of a Japanese manga (comic) which would explain all the tentacle monsters in the movie (a particular Japanese obsession).  I couldn't follow the plot but this film is so manic and overloaded with bizarre wham-bang special effects that only the most jaded of fans could dislike it.","user":"Eegah Guy","rank":[5,6]},{"title":"The Most Romantic Sci-fi movie ever made, and the best, too!!!","rating":10,"date":"23 September 1999","review":"I've seen this movie at least a dozen times, and never once, never, didn't I cry at the end! I'm glad this is my first impression of sci-fi movie (besides ET, when I saw it at 6, which I don't quite remember what was really going on until I become a grown-up) since I first saw it at the age 18.  It forever influenced my view of sci-fi movies.  Whenever I go to see sci-fi films, I always pay attention to the styles, the messages contained within, the connection between the imaginative world and the real life.  For me, that is what sci-fi movies really about, not some fancy special effects.<br><br>The other day I was surprised to find out we have copies for sale in America, I order a copy at once.  But I was also shocked to find that this wonderful film, probably the best Hong Kong movie I'd ever seen, was not received well here in America.  Almost all the people who praise the film are Asian.  I don't think this has something to do with culture gap, because this is a very unusual Hong Kong films, it didn't contain anything specific about the Asian culture.  And that's the point.  It is not anything you expect to see in a Hong Kong, or any other Asia films you can find here in the United States.  It didn't have fancy martial art, no strange custom (which I strongly disagree with. They always portray Asia as bunch of strange, mysterious, sick places.  Because that kind of films can easily won the prize in European film festivals). This is simply a film about humanity. At the same time, it was so beautifully done.  Very stylish, with the music that was so heartbreakingly beautiful. But do see this film in its original language with subtitle.  NO FOREIGN FILM SHOULD BE WATCHED IN ENGLISH DUBBED VERSION! IT IS ALWAYS THE BIG DISASTER!!! Do take a moment to think about what you see and enjoy that beautiful ending.","user":"Valentin-7","rank":[8,11]},{"title":"Stylish, science-fiction future noir for the next millennium!","rating":2,"date":"2 April 1999","review":"The Reptoids, an alien species from beyond rule the future.  They live amongst the human populace.  Intelligent, urbane, charming, aggressive...and malevolent by nature...  They control most of the international economy, and unknowingly to the people, the Reptoids manipulate most of the human race...<br><br>\nThroughout the city streets in Tokyo and Hong Kong, a lethal new drug is being distributed under the incognito known as the \"Happiness.\"  This drug promises the ultimate pleasure, the ultimate high...but it will lead to the ultimate demise...<br><br>Detective Taki (Jacky Cheung) has his hands full dealing with a series of drug related deaths.  The police department also happens to be breathing down his neck.  Taki is assigned to keep a surveillance over a enigmatic entrepreneur (Tatsuya Nakadai) who may hold the key to unlocking this entire riddle.  This opulent entrepreneur though may in fact, be one of the Reptoids...and the \"Happiness\" drug is the Reptoids' method of preempting the human race, bringing them down to their knees...  Only Taki, and his new partner, Ken (Leon Lai) can thwart the Reptoids' sinister plans for world domination...<br><br>Double-crossing, deception, and malediction are the name of the game as the stakes are rising..  Taki may very well realize that his partner is not who he claims to be.  As well, a gorgeous woman (Michelle Reis) whom Taki has encountered before enters his life one more time...but why now?<br><br>I am a huge fan of Hong Kong cinema, and this film is no exception.  WICKED CITY (The Cantonese title is YAO SHOU DU SHI) is one of East Asia's proudest pieces of work.  This movie has an amazing exhibition of imaginative and mind-blowing special effects ever witnessed, especially for a film that was not made in Hollywood.  The film makers throw in everything for this movie from martial arts, car chases and flying acrobats to lasers, metamorphosing creatures, liquid fiends, reptilian demons, and a humanoid pinball machine! There is even an incredible climactic confrontation aboard a moving passenger jet.  Also, the dazzling and sparkling Michelle Reis adds a provocative edge to this emotionally pervasive film.  Her beauty and grace are powerful enough to hypnotize the entire audience, thereby stealing the show from the two leads.  Strong special effects, fine set designs, and a sexy leading lady highlight this formidable sleeper hit.<br><br>WICKED CITY was created to capture the visceral nightmarish flair of a fast moving anime.  The intensity and sheer momentum in this film packs a wallop! The action sequences moves at a razor sharp pace and the surrealism of this film is omnipotent.  This movie features some of the most startling (and definitely grotesque) creatures as well.  The array of bestial monsters will paint an indelible picture in your mind after finishing the movie.<br><br>A stylish, science-fiction future noir for the next millennium!  WICKED CITY contains the components of a future noir including a hard edged detective full of asperity, a beautiful mystery woman with a past, a bleak atmosphere, deviant camera angles, and flashbacks.  Excellent characterization, magnificent cinematography, and a surprisingly abundance of plot twists make WICKED CITY a worthwhile pearl to collect.  The brilliant imagery and predatory mutants propel this film several notches above the typical Hong Kong action film.<br><br>As a future noir, WICKED CITY is a heart-stopping ride descending into a apocalyptic world where time has no meaning...and life may hold no value... Certainly a fiendish, brutal vision of a future where humankind is in crisis.  Director Tai Kit Mak did a great job adapting the famous Japanese manga as a big screen show where the objectives of good and evil are not always clearly defined...<br><br>For a precaution, DO NOT even bother trying to decipher a plot.  Just sit back and prepare to be blown away by the most dizzying collection of special effects ever seen!  While this movie is energetic and lively...just do not bother to have credibility and logic as top priorities...  WICKED CITY is thoroughly wicked indeed, deserving all types of encomium with a wildly original concept.<br><br>RATING: *** out of ****.","user":"ChoiBaby","rank":[6,8]}]