[{"title":"The title says it all","rating":7,"date":"22 April 2000","review":"Love and Basketball: Monica and Quincy have lived beside one another since they were kids, and they only care about two things in life - basketball and each other. <br><br>I am definitely more of a movie fan than a basketball fan, thus I went in expecting a jock flick with a token relationship thrown in to justify the title.  I could not have been more wrong.  Unlike \"He Got Game\" (another very good film), which dwells solely on the negative aspects of the sport - hustlers, hookers, drugs and death, L&amp;B concentrates on the positive things in life and basketball serves as the background rather than the focus.  The story is very well written and works on several levels - it refuses to be pinned down as simply a romance or drama, choosing instead a careful blending of different elements.  My only complaint - minor at that - would have to be the ending (and no I'm not going to tell you).<br><br>First, how could I find fault with a film that actually does a great casting job with Tyra Banks?  She has a small cameo role- she plays a beautiful stewardess, small stretch - with some great lines. Omar Epps brings his trademark cockiness to the role, and although it took me awhile to buy him as a basketball player -he's not exactly Goliath -he grows on you.  More importantly, he exhibits and a depth and range that he's never shown before. Sanaa Lathan however, goes one step further, and demonstrates an intensity both on and off the court that puts her in a league all her own.  Her performance can be summed up as superb. <br><br>L&amp;B is real, engaging, and enjoyable.  <br><br>Don't miss it.","user":"Shiva-11","rank":[18,18]},{"title":"Terrific Non-Stereotypical, Feminist African-American Romance","rating":9,"date":"12 December 2005","review":"\"Love and Basketball\" is one of the most feminist and non-stereotypical teen-through-20something movies I've ever seen. <br><br>It's in effect a tribute to Title IX and the WBNA, casually showing a girl with basketball dreams, and how it affects her personal life and those around her. Highly recommended for teens! <br><br>As good as Omar Epps was though, I thought he was a bit short to be believable as an NBA prospect.<br><br>Except for one talky section of the movie towards the end where everyone pretty much says the obvious about their relationships, the rest of the character development is done visually and through situations and not one sports movie (or African-American) cliché. It is a date movie because both leads change. <br><br>Stay through the credits to see a sweet shot at the end.<br><br>I was girding for a hip hop soundtrack, but it's old school R &amp; B all the way and lovely to listen to (complete with a wonderful line that the audience really appreciated: \"Mom, why are you drinking? I haven't seen you drink so much since Marvin Gaye died.\" <br><br>(originally written 5/6/2000)","user":"noralee","rank":[19,20]},{"title":"I never saw this side of basketball before","rating":14,"date":"14 April 2002","review":"Follows the relationship of Monica and Q from elementary school, through high school, college, and life afterwards as they grow to maturity on the court and off. Sanaa Lathan is great as Monica, the girl who wants nothing more than to be the first woman to play in the NBA yet slowly begins to realize there is something greater missing from her life. Omar Epps does his usual fine performance as Q, a boy striving to be better than his NBA star father who learns that a man doesn't necessarily have to be a star. The basketball scenes are well shot and pretty realistic in the aspect of how male and female teams are viewed by the fans. Overall a very enjoyable movie.","user":"chuckrules","rank":[24,26]}]