[{"title":"Not perfect, but definitely has its moments.","rating":7,"date":"15 March 2003","review":"Ted Raimi is Dennis Skinner, a friendly, grinning wacko who kills women, skins them and wears a suit made of their stitched-together flesh. He rents a room from lonely housewife Kerry (Ricki Lake), who's glad to have some company since her moody trucker husband (David Warshofsky) is always gone. Meanwhile, Heidi (Traci Lords), a depressed, soft-spoken, scarred, limping morphine addict who managed to survive an attack years earlier, balances her time in a grimy hotel room shooting up, crying and plotting revenge.<br><br>This is a dark, dreary, depressing and often awkward film and I hated it when I first saw it. However, I gave it another chance and am glad I did. Aside from the top-notch KNB FX work, it takes place in a unique, graffiti-tinged decaying urban hell landscape, has a great score from Contagion and plenty of clever movie references if you're looking for them. There's one odd and powerful moment in this film, where Dennis is talking to the shell of a victim he's just killed and skinned about his traumatic childhood and rubbing the hands of the deceased along his face for comfort. Moments like these, done with some thought and care, lift a film like this right up out of the gutter.<br><br>I completely disagree with the potshots made at Traci Lords. Many people just cannot put their perceptions of her behind them long enough to even consider the fact she's capable of giving a competent performance. I found Lords to be more than just a little competent in this particular role. It is by no means an easy or flattering part to have to play, but I thought she played it very, very well.<br><br>Speaking of unflattering portraits, you can learn more about director Ivan Nagy by viewing HEIDI FLEISS: Hollywood MADAM.<br><br>Score: 7 out of 10.","user":"capkronos","rank":[13,15]},{"title":"Serial Killer/Mutilator Pursued By Hooker Victim/Survivor & Husband Of Future Victim!","rating":10,"date":"12 November 2005","review":"Skinner is a Horror &amp; Suspense Classic that uses the killer's fantasies as flashback scenes. Dennis Skinner (Ted Raimi)a soft-spoken normal-looking drifter(with obsessive compulsions for water &amp; blood) rents an room from Kerry Tate (Ricki Lake) and Geoff Tate-Long-haul Truck Driver (David Warshofsky) while he's out on the road. Geoff leaves Kerry alone all the time due to work, ignores her when he's home, and she appreciates the new stranger's company and attention even though her husband hates him. Dennis finds a job at a local factory and is physically and verbally harassed by a black co-worker who he also skins. At night Dennis roams the streets with a gym bag filled with knifes looking for hookers or women victims to skin, constantly followed by the deformed junkie/hooker Heidi (Traci Lords) who was mutilated by him and is now hunting him for revenge. Dennis is attracted to Kerry and wants to show her the real him so he seduces her then kidnaps and takes her to his playpen to be the next victim/art piece. Heidi tipped-off by her landlord's forced confession find's their house and she and Geoff soon follow to try to save Kerry, but Heidi drugs Geoff as they close in after crashing the factory gates with his Semi-Truck and alerting the night watchman. Will Heidi get her revenge and will Kerry die? Also Stars:Richard Schiff  Eddie; Blaire Baron  Gloria; Roberta Eaton  Sandy;Christina Englehardt  Rachel; Dewayne Williams - Earl ;Time Winters - Night watchman; Frederika Kesten  Suzanne;Sara Lee Froton -Young woman. Ivan Nagy - Directed (former boyfriend of Heidi Fleiss-The Hollywood Madam). music by Contagion, Special Make-Up Effects by KNB EFX Group.","user":"bipvg71","rank":[3,3]},{"title":"Skinner by name, skinner by nature.","rating":7,"date":"10 September 2015","review":"If there's one thing I've learnt from Skinner, it's not to accept a dinner invitation from Ricki Lake: 20 minutes to prepare and cook an entire chicken?!?! That sounds like a recipe for some serious E.coli to me. And while we're at it, Ted Raimi isn't so hot on kitchen hygiene either: he fails to wash his hands after manhandling the chicken and proceeds to spread bacteria all over the place.<br><br>Of course, a bout of serious food poisoning is still preferable to being killed and flayed, which is what Raimi's character, Dennis Skinner, likes to to do hookers, using their skin to create a suit in which he can prance around in the moonlight (a man's got to have a hobby). When Skinner's landlady, Kerry Tate (Lake), becomes close to her loony lodger, the psycho decides that the time is right to reveal his secret to the lucky lass, much to her horror. Meanwhile, Heidi (Traci Lords), morphine-addicted survivor of one of Skinner's earlier attacks, hunts the psycho looking for revenge.<br><br>Skinner is by no means a great movie, suffering from an erratic narrative and plot details that are left frustratingly unexplained (what is up with Dennis's fascination with water?); it is, however, an entertainingly piece of trash, a sick little psycho flick with a wonderfully over-the-top performance from Ted Raimi, and solid support from Lake and Lords, the latter channelling Meiko Kaji and Christina Lindberg for her role as a vengeful junkie on a mission.<br><br>The film also features an impressive moment of graphic flaying (courtesy of KNB effects group) that is guaranteed to please gore fans: Skinner slices open his victim's back, works the skin loose, rolls the body over and yanks the skin down off the face (be sure to watch the uncut version of the film: there's an iffy copy on YouTube that is missing this splattery scene).<br><br>6.5 out of 10, rounded up to 7 for the delectable Ms. Lords, who doesn't get nekkid (for a change), but is still very hot (it takes more than a few scars and a lack of hair to stop her from being sexy).","user":"BA_Harrison","rank":[5,6]}]