[{"title":"Convincing low budget thriller","rating":9,"date":"31 December 2003","review":"One of the best low budget psychological horrors ever made.<br><br>Edward Furlong plays Michael, a teen-aged boy who lost his mother at a young age. As a result, he has lost his zest for life, and his respect for all things. He has ONE friend, and a healthy teen-aged fantasy life centered around the girl next door with whom he would love to enter into a relationship, but he lacks the courage and fortitude to even attempt it. Because of his loathing for his present life, like many of America's youth, he retreats into the world of video games as an escape.<br><br>Enters BRAINSCAN, the newest innovation in VR video games. Michael has played everything on the market, so there is little chance of this one being any better.<br><br>Wrong! This one, I think it's safe to say, completely alters his perspective on life, love, and death. It changes his life.<br><br>Excellent cinematography, adequate direction, and weak performances from Frank Langella as the local homicide detective (why was he even IN this movie?!); James Marsh as Kyle, Michael's only friend; and Amy Hargreaves as the girl next door tend to drag down the decent performance given by Edward Furlong and the excellent and compelling talents of T. Ryder Smith as Trickster. That character was an odd combination of Keith Richards, Mick Jagger, and Hannibal Lecter, portrayed beautifully by Smith.<br><br>While this movie is far below its possibilities, it still is a top notch mind twister of a thriller. There are no scary moments, however.<br><br>It is not that kind of movie. This movie was more of a psychological mind twist than anything else.<br><br>SPOILERS FROM HERE ON OUT.<br><br>Michael was forced by Trickster (and ultimately the game) to kill Kyle to show him that things DO matter; friends matter. And then later encouraged to do in the little cutie next door for the same reason; to show him that love also matters. And in discovering these truths, he came to understand that he, himself, mattered; a condition which he had never considered to be true.<br><br>This movie has many holes in the plot, some serious acting flaws, and tends to be a bit immature. BUT, it's still a very entertaining enterprise, and well worth a good viewing or two.<br><br>And lastly, some critics have labeled the ending as \"stupid.\" If you have the mentality to comprehend the element of a twist, you'll get the ending of this movie. Was it all in his head...or wasn't it? Was any single element of the game, reality? Or was it reality which is the game? Definitely worth watching. I rate this high on my list of mind twists along with \"Fallen,\" \"Identity,\" and \"The Game.\" <br><br>It rates an 8.9/10 on the \"B\" scale, from...<br><br>the Fiend :.","user":"Elswet","rank":[18,18]},{"title":"This has held up surprisingly well over time","rating":8,"date":"13 August 2005","review":"I originally saw this when I was maybe 13, and I found it a rather tense movie back then. While I wouldn't say that any part of the movie is \"scary\", I don't think that any of it even attempts to be. Instead, I found myself simply feeling uneasy while watching it.<br><br>I recently decided to rent it for the nostalgia factor and give it another watch, fully expecting it to be horrible and downright laughable, but I was surprised to find that this movie still has the power to make me feel uneasy and even uncomfortable while watching it.<br><br>The scriptwriter's alien ideas about how computers and games work are indeed rather laughable, but if you can forgive those, the movie does an admirable job of pulling you into Michael Bower's world. Anyone who has ever done something wrong, and felt that queasiness that comes with the knowledge that yes, you are going to get caught, can relate to the situation Michael is in. The main theme, played several times throughout the movie, is very creepy and mood setting; I loved it.<br><br>I found Brainscan far more compelling than the standard slasher flick or monster movie, and would readily recommend it to anyone looking for something a little more psychological.","user":"Dark_God","rank":[48,52]},{"title":"Unique Period Film","rating":10,"date":"3 January 2009","review":"A movie like Brainscan is unique. The characters in this film only exist in the time that the movie was made. Brainscan can almost be called a period film today due to its embracing the troubled youth subculture of the early nineties. Ed Furlong of Terminator 2 is a high school student that exposes himself to large amounts of Horror, Hard Rock, and Video Games. When his obsessions become his vices, he experiences the fear of losing control of the only thing he truly possesses; himself. A sinister antagonist called The Trickster drives the plot of the movie and forces the main character (Furlong) to become either a hero or a victim. The movie is well paced and has an entertaining score/soundtrack. This film should be highly recommended to fans of Horror, Sci-Fi/Fantasy and admirers of Frank Langella and/or Edward Furlong.","user":"andrew_hawkins","rank":[33,37]}]