[{"title":"X-Men","rating":10,"date":"12 February 2020","review":"I find X-men a good start to the x-men franchise since it brings the characters we all know in love from the comics or even the old animated TV show of x-men with people like the wolverine, jean grey or mystique, all of which we know from the comics and I get why some people say now that it doesn't really have good CGI anymore but in my opinion I honestly think that it still has good animation till this day. I give X-men 2000 10/10 stars, For its good story and how they put such good casting in this movie.","user":"MR_Heraclius","rank":[39,41]},{"title":"Pretty good!","rating":8,"date":"18 June 2019","review":"There are some films which take the genre to some other level. This film is definitely the one to do so in the superhero genre.<br><br>Good : There's a whole bunch of good things that I can talk about. Bryan Singer does his best to tell the story, considering the comparatively weak script for an experimental film like this. This was the first time in YEARS that a superhero film was taken seriously. Given that there had been no introduction to any of the characters prior to this film, it does a really good job to make them interesting. Plus, it establishes the conflict between Eric and Xavier, which have been an integral part of many films that came afterwards. Not to mention, the character introduction, especially that of Wolverine, was incredible. We instantly know the basic characterization given to each of them, which was enough to get behind the movie. Hugh Jackman was the optimal choice for the role of Wolverine, and he proved it for next 17 years. Every single actor have done a good job in their roles. Also, I believe that X-Men films have been the best superhero films when it comes to \"social\" themes. We get to see the first of many times two friends with different world views clashing with one another. It has grown incredibly stale now, but was great to see back then and some other films after this, especially First Class and DoFP. The mutants wanting to be accepted by humans, and the other mutants wanting to destroy mankind - what other superhero series have given such a theme, or a similar one? This movie is the reason we are getting films like Infinity War, Civil War, Endgame, Batman Begins and The Dark Knight. While I prefer these over the first X-Men movie, if it didn't bring the genre back on track, we would've never gotten such films.<br><br>Mixed : It feels dated. Had it been made today, it would've been a lackluster. It was clear that they were trying to experiment with this movie and still figuring out how to get things right. While they got most of the things right, they could've made the story a little more complex.<br><br>Bad : The story is quite a bit of a throwaway story. While there's an interesting twist, it still feels like the movie becomes a little goofy and cartoony after that twist. Some moments feel like they were shoehorned just to give some \"comic accuracy\", but they didn't feel justified. I believe that if you get the basic elements right, it doesn't matter if it's not deadly accurate with the comics. But if you want it to be so, make some baseline for that. Don't do it randomly.<br><br>Conclusion : It's a movie that set the genre back on track forever. While the story and script might feel a little lazy when viewed today, you can see that the execution of the ideas were as good as humanly possible. If you are a superhero movie fan, it's a must watch. Not because it's insanely great, but just as a reminder of what led us to where we are. I am a huge fan of the genre. All credits go to Nolan's Batman films, the good X-Men films and Raimi's first two Spider-Man films. I absolutely love the MCU and many DC films apart from Nolan's trilogy - Man of Steel, Wonder Woman, Shazam, The Dark Knight Returns, Superman/Doomsday, etc. But for me, like for the genre, it all started with the first X-Men movie. So, I have a very special place for this in my heart, as a fan.<br><br>Rating.<br><br>Score : 8/10<br><br>Grade : A-","user":"NpMoviez","rank":[17,17]},{"title":"Smart, stylish, and very cool","rating":8,"date":"16 August 2000","review":"\"X-Men\" is a rare treat-- a blockbuster that lives up to its hype and a comic book adaptation that hits the mark.<br><br>Along with Tim Burton's \"Batman\", this stands head and shoulders above all other superhero movies.  It's a genre that's usually synonymous with silly, campy, cartoonish crap, but Bryan Singer delivers a long-awaited exception to the rule.  \"X-Men\" is smart, stylish, and very cool... one of the better sci fi/fantasy films of the last decade.<br><br>Of course, it helps to have good source material.<br><br>The X-Men comics, which originated in the 1960s, are more politically progressive and morally complex than older superhero stories such as \"Superman\" where the heroes are always right, and truth, justice, and the American Way always prevail.  The series is a well-crafted parable about individuality and discrimination.  The characters are mutants--struggling to find a place in a society that rejects them.  Its primary villain, Magneto, isn't an evil lunatic-- he's a sympathetic character, a misguided revolutionary playing Huey Newton to Professor Xavier's Martin Luther King. The iconic character, Wolverine, is a beer-swilling anti-hero who cares little for ideals and fights only to protect himself and his loved ones. The female characters are as powerful and important as the men, rather than being mere love interests.<br><br>Rather than making just another flashy explosion-per-minute-special-effects-extravaganza, Singer practices the lost arts of character and plot development.  As a result, the movie has a far greater depth than the average big budget summer flick.  The acting is also quite good on the whole.  Hugh Jackman, who plays Wolverine, is fantastic--a bona fide Clint Eastwood caliber badass.  Some of the dialogue is fairly cheesy, but in the hands of Ian McKellan and Patrick Stewart it sounds quite convincing.  (Stewart has made a career out of making lame dialogue sound cool.)<br><br>Hard-core fans of the comics have complained about the omission of several popular X-Men.  This is silly.   A movie that gave the background on every character in the comic books would be 6 hours long.  There will be plenty of time to develop new characters in the forthcoming sequels.  Fans have also complained about the casting of Anna Paquin as Rogue.   I disagree.  Rogue is unable to touch another human being without harming them--she would not realistically act like a confident, sassy warrior.  Paquin did a tremendous job of conveying the fear and isolation that such a young woman would feel. She will undoubtedly grow into the part in future movies.<br><br>In the end, \"X-Men\" is a comic book movie.  Superpowers are explained with silly pseudoscientific babble, the plot revolves around a fairly ridiculous take-over-the-world scheme, and names like \"Magneto\" are spoken with a straight face.  Don't read all the glowing reviews and expect Citizen Kane. But don't underestimate \"X-Men\" either.  It is an intelligent movie that people will enjoy whether or not they are familiar with the comic.","user":"alafolle","rank":[156,186]}]