[{"title":"Carlito's Way -- The Master of its Genre","rating":10,"date":"27 October 2008","review":"Al Pacino, Sean Penn, and Penelope Ann Miller create an artistic and romantic twist to the gangster genre in Carlito's way, story of a convicted gangster by the name of Carlito Brigante, known to his ex-lover as Charlie, who manages to get his way out of jail thanks to crooked drug-addicted lawyer David Kleinfield. After his release, he's convinced himself that he's never going back to his life of crime, but before he knows it, he's inevitably being pulled back thanks to his corrupt friends and family.<br><br>While Scareface centered around the action and grittiness of the gangster life more then anything else, Carlito's Way tends to lean to the romantic side, giving the film an artsy twist. For example, in one scene there is a close up shot of a revolver, the chamber slowly moving to an empty slot. There is another famous scene with Carlito inside of a dark bathroom, his back against a wall with a pistol in hand. The way the camera is placed, the way Carlito is standing, and the way the lighting reflects off of the wall and his leather jacket are all taken in to account by De Palma. To make a long story short, Carlito's Way is very beautiful, and this is all thanks to De Palma. He directs the movie very well, you can tell that he put some true dedication in to this film.<br><br>Needless to say, the acting is incredible, no matter what you might be hearing. Al Pacino is as always great, and Penelope Ann Miller is as well. But most of the time you'll find yourself deeper inside Sean Penn's character then Pacino's or anyone else's. He's steals nearly every scene he's in, if not then he steals all of them. He's almost too convincing.<br><br>The scores are very, very strong and add on to the artistic feel to the movie. Not only do they add on to that, but it adds to the tension, the romance, and the tears as well.<br><br>To sum it all up, Carlito's Way is the best gangster film ever made. I love it more and more every time I think about it.<br><br>*****/*****<br><br>Riveting.","user":"Jigsaw_At_The_Disco","rank":[70,77]},{"title":"Great story, great acting","rating":8,"date":"17 March 2005","review":"Right well I can say this is one of my favourite gangster films ever, and I truly regard it almost as highly as good fellas or the godfather.<br><br>This is simply because of the way the story catches you. Pacino delivers an excellent performance (do you really expect any less from him?) as the main guy Carlito who just wants out of the whole gangster game. By his side is the almost unrecognisable Sean Penn. An afro wearing cocaine addict who just seems determined to lure Carlito back into the kind of world he is trying to leave.<br><br>This film is easy to enjoy with a great story and a great cast. And if you look carefully enough you can see a young Viggo Mortensen (Aragorn from lord of the rings in case you don't know) as a crippled low life. Made me chuckle.<br><br>Anyways, i give this movie 10/10","user":"rosaishere","rank":[142,161]},{"title":"Watch this film.","rating":9,"date":"4 June 2005","review":"Once again, one of the greatest actors of our time teams up with one of the greatest directors. Ther combination must surely be as good as, if not better than, Scorsese and De Niro. First the excellent Scarface, and then Carlito's Way, a film that blew me away when I first saw it.<br><br>Pacino's portrayal of ex-gangland boss and drug dealer Carlito Brigante is powerful, moving and at times very funny. Combined with great performances from Sean Penn and Penelope Ann Miller, this film is a roller-coaster ride of \"will he, won't he\" tension and heavy , though not gratuitous, violence.<br><br>So swept away do we get in Carlito's struggle that we actually forget that he's dying at the beginning of the film, and are praying that he'll make it by the end. This is a masterstroke from De Palma and a salute to the powerful and mesmeric acting of one Alfredo Pacino.<br><br>A modern classic - this film has everything you could want. Love, loyalty, betrayal, sadness, comedy, and most importantly of all - balls.","user":"carlito235","rank":[111,127]}]