[{"title":"Paranoia at its finest","rating":24,"date":"24 August 2000","review":"Maybe I'm very easily amused, but I thought this was one of the best movies I've ever seen about the sinking abyss of paranoia.  I think it's very difficult to make a believable movie about paranoia, and 'Arlington Road' is very believable--as least, while you're watching it.<br><br>Admittedly, after you've seen it, you'll see the holes, and how you've been manipulated--but while you're watching it, you'll be just as confused as Bridges' character, wondering, \"is he right?  Or just a nutcase?\"<br><br>This movie operates entirely on the psychological plane.  There aren't lots of cool explosions (well, OK, a few) and there isn't an expensive car being smashed every five minutes or someone's head being blown open with a handgun.  Yet it leaves you breathless, panicked, scared, and disturbed. How easy is *that* to do without endless special effects?<br><br>Some have complained that the timing of Robbins' character catching Bridges red-handed over and over was lame and unbelievable.  I think they've missed the point--it adds to the confusion, the paranoia, and the madness of Bridges' character, and to ours also.<br><br>In fact, the entire movie is structured this way.  Just when the plot seems predictable and we think we can settle back and watch it follow a familiar formula, the rug is yanked away and we don't know what to believe.  This happens not once, but constantly.<br><br>If you have to categorize it, think of it as 'The Sting', with a dastardly political agend--in other words, the gentile crime of that 1920's piece fast-forwarded into the dismal world of moral-less America, circa 1999.<br><br>The ending was extremely un-Hollywood, and left me angry, disturbed, and unsettled.  And this, friends, is why Hollywood doesn't make movies like this.  All anyone has complained about is how unsettling it is.  Well, the next time you watch a movie end in a boring, predictable way, remember that it's probably making more money and wooing more critics and fans than 'Arlington Road'.  (Reminds one of what they kept saying in 'The Player': \"because *that's* reality!\")<br><br>As an aside, the opening credits were the spookiest I've ever seen.  They set the tone perfectly for a movie that reflects the existential, empty, lonely, scary, frightening world that may or may not be right out our very door.<br><br>If you enjoy watching a movie that will cause you to slam your fist on the arm of your chair, put you in a bad mood for the next day, make you yell at the news \"YEAH RIGHT!\" and wonder if you'll ever know \"The Truth\" about ANYTHING, this is your flick.  I recommend it to anyone who wants some vinegar to balance the sugar of everything else made by Hollywood, and a reminder that things are rarely what they seem.","user":"TC Fenstermaker","rank":[9,9]},{"title":"Do You Know Those People Across The Street?","rating":8,"date":"15 August 2000","review":"Contrary to what you may think initially, nothing happens by coincidence on `Arlington Road.'  Outstanding performances by Jeff Bridges (As Michael Faraday) and Tim Robbins (Oliver Lang) highlight this taut thriller about terrorism in America, a disturbing film instilled with a sense of loss, fear and paranoia.  Director Mark Pellington perhaps does not mine this vein to the depths, but there is still a silver lining in this movie, which contains elements of two of Alfred Hitchcock's classics, `The Man Who Knew Too Much,' and `North By Northwest.'  Had this film been made forty years ago, in fact, Hitchcock would have been at the helm and we would have had James Stewart instead of Bridges and Richard Widmark in place of Robbins.  When Jeff Bridges stars in a thriller, you can usually bet that the project is going to be a cut above the average fare of the genre, and this one is no exception, arguably his best of it's kind since `Jagged Edge.'  This is a riveting film, and the tension builds steadily throughout as we uncover, along with Faraday, the dark secrets which ultimately lead to an explosive climax.  The excellent supporting cast includes Joan Cusack, Hope Davis and Robert Gossett.  A trip to `Arlington Road' is a jolt to the senses and may cause you to stop and rethink a few things about your life.  At the very least, you're going to want to finally meet that neighbor who moved in across the street last year.  I rate this one 8/10.","user":"jhclues","rank":[109,141]},{"title":"Flawed but resonant film","rating":8,"date":"13 September 1999","review":"It seems like every year, there's one or two films which are far from perfect but nonetheless shake us up in ways better films don't quite do. Last year, it was BULWORTH, and this year, it's ARLINGTON ROAD.  Obviously, after all that's happened this decade in America, from Waco to Oklahoma City, the time is ripe for a movie to explore the cracks in the American dream which brought about events like those.  This film ultimately asks more questions than it answers, but that may just be a condition inherent to this type of film.  More troubling is two things: (1) Though I agree with those(and I'll try not to give away too much here) who theorize the ending changes the whole perspective of the film, there are still too many key narrative cheats(a conversation Robbins supposedly had with Bridges' son seems unbelievable, and the traffic light scene near the end also is) to make it fully effective; (2) The film seems a little confused of what it's about; it is a study of one man's psyche, or the nation's?<br><br>Still, ARLINGTON ROAD shouldn't be dismissed.  There are troubling questions explored, and you don't have to be a conspiracy nut to believe those so-called \"fringe\" hate groups are entering the mainstream at a frightening rate for a so-called \"civilized\" society.  The ending is also powerful, and though I understand it, more than anything else, was responsible for the delays, I applaud whoever was in charge for not changing it(though again, how they got there is another story).  Bridges' performance is another thing which makes more sense once you look back with the ending of the film in mind, and it doesn't seem like over-acting.  Robbins is a little more problematic; there are scenes where he's convincing, and then scenes where he goes over-the-top and shouldn't.  Hope Davis doesn't have a big part, but she injects a lot into it as usual.  But the biggest surprise here is Joan Cusack.  Anyone who thinks of her only as a (good)comic actress will be in for a shock; there's one scene involving her which is the scariest in the film.<br><br>Again, ultimately, while it leaves you with nagging doubts about the quality, ARLINGTON ROAD makes you think enough to recommend it.","user":"SKG-2","rank":[81,110]}]