[{"title":"Could be used for torture","rating":1,"date":"11 August 2013","review":"It hardly gets any worse than Bio-Dome. Truly this is one of the worst films ever made, and I really hate it with all my heart. Everyone who worked on this abomination should be thrown in a concentration camp and be experimented on for the rest of their unnatural lives.<br><br>This film is supposed to be a comedy, but it's not. Not one single line of dialogue is funny, every performance is terrible, and the plot is virtually non-existent. The film revolves around two main characters, who are locked in the \"Bio-Dome\". They are played by Pauly Shore and Stephen Baldwin, who both do a terrible job. Their acting is beyond dreadful, their characters are complete lunatics, and not one single thing they say, or do is even remotely funny. The same goes for the other idiots who appeared in this picture.<br><br>It's really a mystery to me why some people like this rubbish. It's like it was made by some sick person, who wanted to create the best torture method to be used in Guantanamo Bay. There was nothing in this film that I liked. I would rather fight Wladimir Klitschko in a bare-knuckle boxing match, than watch this piece of excrement ever again.","user":"PhilipVier","rank":[17,21]},{"title":"Absolutely Terrible","rating":1,"date":"12 May 2005","review":"Bio-Dome is an all out failed attempt to make another classic Dumb and Dumber (1994) film. The story is stupid, the acting pitiful, and the comedy, not even present. The story is simple and tries to be a crusade for world ecological preservation but does nothing for the message.<br><br>The story is terrible. Bud (pauly Shore) and Doyle (Stephen Baldwin) are to morons who have just been ditched by there girl friends and are down on there luck. They take a drive out to a dump to find the girls not cleaning there. On the way back home Doyle has to go to the bathroom so they pull over at what looks like to be a new mall. Instead it is Bio-Dome, an ecological preservation center and now Bud and Doyle are locked inside with four scientists.<br><br>They cause chaos and homeostasis drops until somehow the idiots realize what they're doing and are able to become top scientists over night. I wanted to to throw up after seeing this. Pauly Shore is annoying beyond belief and Baldwin should really think twice about being an actor or working at a gas station. The film fails on all levels of comedy and acting and should be avoided by everyone.<br><br>Bio-Dome. Starring: Pauly Shore, Stephen Baldwin, William Atherton, Kylie Minogue, and Denise Dowse.<br><br>1/2 out of 5 Stars.","user":"mOVIemAN56","rank":[34,47]},{"title":"\"If you were yogurt....?\"","rating":1,"date":"27 February 2005","review":"This is a 50/50 movie, you either love it or you hate it. Funny lines are few and far between, but do exist. The rest of the film is just mindless humor that wasn't funny even for mindless humor. Great for Pauly Shore fans and for those who enjoy slapstick comedy. Otherwise the other 99.9% of the population will probably tire quickly of the lame jokes and one dimensional, almost cartoon like characters. You have to wonder why anyone thought it was a good idea to go ahead and make it. The movie ensnares the viewer by opening with a promising start. The movie quickly deteriorates from there. Stephen Baldwin only adds to the overall idiocy. As if one bad actor wasn't enough.","user":"prohibited-name-2275","rank":[58,91]}]