[{"title":"Not really a courtroom drama...","rating":8,"date":"19 July 2006","review":"As a fan of Hackman, Mastrantonio, and courtroom drama, I thought this might be another overlooked chestnut that might repay viewing. Well, I enjoyed the film thoroughly - but it was not really courtroom drama. So if that is what you're looking for, go elsewhere. People are in courtrooms, and there's some cross-examination, but that is not the core of the movie. The core is a story about a father-daughter relationship, and the ups and downs that the relationship can take. Criticized for being 'predictable' or 'smarmy', I found it to be a warm and occasionally humorous take on a plot that may have been presented before, but certainly bore presenting again, and I enjoyed the film very much.<br><br>Apted's directing is effective, though never innovative. The actors are all good - in fact, it is to their credit that they made simple lines and dialogue so effective. Hackman, of course, as always,is the professional he always is, and in Mastrantonio he has an actress who can take his words and put her own spin on them. Supporting cast is very solid, the music is early James Horner (good, but again nothing brilliant), setting and atmosphere were both average. <br><br>Overall, not a movie for a guy and his girl to watch, but a great movie for that girl and her father to watch. It would've been a great all-rounder if the drama had been in the court-room...","user":"AbedsBrother","rank":[19,20]},{"title":"Fantastic","rating":10,"date":"3 April 2006","review":"As a solicitor I normally like lawyer movies, but as a new father I loved this movie.<br><br>Most lawyer movies just have hypothetical issues which just raise my interest or remind me of my past.<br><br>This one awakened my imagination to the future.<br><br>My daughter is less than 12 months old and Hackman's character hit the exact note of feeling and pleasure, I feel when holding my daughter in my arms and watching her grow.<br><br>I can say that the scene at the end moved me to tears as I think about holding my daughter in my arms.<br><br>Hackman is by far on of the greatest actors I have ever seen. The others I can say did a fantastic job as well. You hate the villains and love the heroes.","user":"markstone001","rank":[20,23]},{"title":"father and daughter, both attorneys, duke it out","rating":7,"date":"27 September 2007","review":"Gene Hackman and Mary Elizabeth Mastroantonio are involved in a \"Class Action\" in this 1991 film that also stars Laurence Fishburne, Donald Moffatt, Joanna Merlin and Fred Thompson. Hackman and MEM, father and daughter, are both attorneys. \"I raised you,\" Jed (Hackman) yells at Maggie (MEM) during one scene. \"Mom raised me,\" she screams back. \"You had a date.\" Maggie's resentment over her father's infidelity erupts after the death of her mother (Merlin) in a powerful scene. Although Maggie has tried to reconcile with him, she finds there is too much in the way. Maggie is in an ethical quandary when the law firm she works for wants to suppress evidence about an automobile manufacturer's malfeasance; complicating things is that her father heads the team the other side of the case.<br><br>This is a very good movie that emotionally rings true, thanks to a good script and fine performances by Hackman and Mary Elizabeth. I had the pleasure of working with Mary Elizabeth when she was a Broadway actress - a lovely woman with a great talent, shown here to excellent advantage. Grieving for her mother and unable to accept her father's love, she is blindsided by her boyfriend/boss' ethics violation and has nowhere to turn. The viewer can really feel her pain. Hackman is wonderful as a shark attorney who loved his wife deeply but made some unfortunate choices and alienated his only child. He finds himself now vulnerable and confused; Hackman expresses these emotions beautifully. There is able support from the top-notch cast.<br><br>Compelling and at times powerful.","user":"blanche-2","rank":[11,12]}]