[{"title":"Not nearly as bad as everyone says...","rating":8,"date":"1 February 2005","review":"\"Waterworld\" is one of those movies that everyone would rather passively make fun of rather than take the time to watch. This is unfortunate, because it really is a good movie. Sure, it's borrowing a lot from \"Mad Max,\" but it's not like \"Mad Max\" was original fare to begin with. It's an interesting take on the genre, with some nice sets and costumes, a great soundtrack, and the coolest boat to ever appear on a movie screen. The script has thoughtfully and intricately worked out a new way of life in a post-apocalyptic world, and the supposed \"plot holes\" aren't as big as everyone makes them out to be (OK, we never really find out why dirt is so important in the future; so what? Is that enough to ruin the whole movie?).<br><br>If anything brings it down, it's Kevin Costner's performance. The brooding, gloomy hero shtick works, but he's still far too serious for a movie like this. If he'd had the good sense to be a little more tongue-in-cheek, it would have helped a LOT. Still, it's not a bad movie by any means, and I really think all the negativity toward it is unnecessary. Enough with all the complaining... just sit back and enjoy it! <br><br>8/10 stars.","user":"Chromium_5","rank":[348,406]},{"title":"NOT the worst movie ever made","rating":7,"date":"9 September 2003","review":"I want the Costner bashers to sit down and watch \"Rebirth of the Mothra III\" on Sci-Fi Channel some time. Then they'll know that they have seen the worst movie ever made.<br><br>\"Waterworld\" is an escapist fantasy/action picture, not unlike the James Bond and Indiana Jones pictures. Costner's performance works on exactly the same level as the Connery/Moore/Brosnan portrayals of 007 and Harrison Ford's portrayal of Indy -- straightforward, grim, stoic, a little mean-spirited, a little cruel, unafraid of dirt, grime, death, or salt water.<br><br>It's not perfect by any means. I'm sure Costner hacked it to pieces in order to accommodate the two-hour-running-time maxim imposed by the studio, so that corporate could get their investment back. Now is the time for the extended DVD version; maybe that will explain where all those cigarettes came from, and how the Smokers converted raw crude into gasoline.<br><br>7 out of 10. Costner bashers should get over themselves and start giving Michael Bay and George Lucas what they deserve.","user":"reporterman2000","rank":[277,331]},{"title":"Why do people hate this film?","rating":10,"date":"6 March 2004","review":"I honestly don't understand what all the fuss is about. Why do people hate Waterworld? Why was it instantly disregarded before it was even released? When you really think about it, how much different IS Waterworld from the more recent Pirates of the Caribbean: Dead Man's Chest? They are quite similar if you think about it. Waterworld also cost $75 million less than DMC. But because it has Johnny Depp in mascara the whole world loves it! Hypocrisy! With a lot of behind the scenes trouble (Reynolds walked off the film and Costner had to finish the final third of filming himself) and negative pre-release buzz, everyone expected Waterworld to fail. Boasting a budget of £175 million (the most expensive ever until Titanic 2 years later) it was sure to be a flop, especially with the snooty public and critics blasting it before its release. Then, the unthinkable happened. <br><br>Upon release, Waterworld actually managed to prove critic expectation wrong and be a good movie, receiving good (albeit ignored) reviews and finally earning a grand total of $255 million at the Box Office. This is before video, laserdisc, TV, DVD, HD-DVD and Blu Ray sales as well as all of the merchandise. Does sound like a flop to you? The plot is far-fetched. Yes, but so are the POTC plots involving fish-men, giant squids and Orlando Bloom as anything remotely masculine. But you accepted that quite easily. So just, for a minute, believe that if the polar ice caps DID melt that the world WOULD be covered in water. Set hundreds of years after this particular cataclysm, Waterworld follows the journey of The Mariner (Kevin Costner, who is only referred to a few times but never actually named), a man who is one step beyond human as he has the ability to breathe underwater and has webbed feet.<br><br>Early on in the movie, The Mariner comes across an Atoll, a floating small town complete with its own hill...er Waterbillies. When the Atoll is seized by crazed madman baddie boss Dennis Hopper as The Duke of the Deez (as in Exxon Valdeez), The Mariner escapes with Enola, a little girl who may hold the secret of Dryland and her guardian Helen (the totally gorgeous Jeanne Tripplehorn). Not happy with anyone leaving the party The Duke sends his army of filthy smokers to catch The Mariner and discover Dryland for himself.<br><br>Waterworld has a lot going for it. It's everything an action/sci-fi movie should be. There is so much escapism in the stunning seascapes and tropical feel. James Newton Howard's exotic score (replacing a rejected score by Mark Isham) is breathtaking and I seriously recommend you hunt down the soundtrack CD. The action is almost entirely special effects and stunt-work and it's brilliantly done. The editing is also quite impressive as is the amazing sound design. Waterworld is far superior to many, more expensive action films but still carries this burden of negative, unfair public opinion.<br><br>I have only ever seen the 136-minute cut of Waterworld that was released into cinemas and subsequent VHS etc. But a Director's Cut of 176 minutes has been shown on TV in America several times. This version apparently restores several scenes that tie up loose ends and answers a lot of questions about how the this particular watery future works as well as revealing that Dryland is actually Mount Everest. Other than TV airings, this version has never made available to the public. Which is quite annoying as there is a huge fanbase for it.<br><br>Don't have prejudices against this movie. Think different and see for yourself how cool it is.","user":"CuriosityKilledShawn","rank":[463,565]}]