[{"title":"Fun, entertaining movie!","rating":23,"date":"23 June 2003","review":"I never saw this movie in the theaters (it seemed like another Leo-mania \"no REAL talent\" type of film), but I remember a friend recommending it to me one night about 5 years back.  Since I love sword fighting movies/3 musketeer flicks, I just had to give it a try. Plus, I had seen the previews, and they looked interesting.  Well, let me tell you...from the opening scene to the ending credits, I was hooked with this film!  It grabbed my attention, and was just pure fun!! I don't know why this movie got such a low rating on IMDB.  It may not be a \"masterpiece\", but it's surely a great, fun, entertaining film!<br><br>First of all, the cast is great.  I mean, have you seen so many good actors in one film?? Byrnes, Depardieu, Malcovich, DiCaprio, and Irons.  All such a WONDERFUL cast, with good acting.  I liked Leo's duel roles too.  At first I thought it would be cheesy, but Leo delivered it well!  He played both roles of Louis (bad king) and Phillipe (good king) so diversely!  I liked how he had you loving one king, and totally despising the other!  Someone also mentioned the way Leo totally changed characters with his \"eyes\".  THe \"EYES\" say a lot, and Leo nailed it.  I almost had to ask myself if this was the SAME actor playing Phillipe!<br><br>The plot was good (eh...might have been predictable, but still...great), the cinematagraphy was awesome, the music was moving, the sword fighting/action was cool! I absolutely loved Gabriel Byrnes in this movie.  He was so great as D'Artagnan (sp?).  John Malcovich was perfect for his role of Athos too. I really felt his pain.  I have both the VHS (older) and the DVD version (hey, it was on sale for 9 bucks!! lol) of The Man In The Iron Mask, and the DVD version (although not a whole lot of extras) has a nice directors commentary.  It really tells the director's vision for the film and all the behind the scene info.  I STILL can't believe that this movie was his FIRST film!!<br><br>Very entertaining movie.  I really don't know why people dogged this movie so much.  It was SOOOO much better than that \"OTHER\" more RECENT musketeer movie that came out called \"THE Musketeer\".  UGghgh...what a dissapointment!<br><br>\nBut The Man In The Iron MASK is DEFINITELY a movie worth giving a try.","user":"crystalc1020","rank":[95,121]},{"title":"A film done with pride and conviction...","rating":9,"date":"13 March 2002","review":"Without ever attaining indisputable literary merit, Alexandre Dumas, succeeded in gaining a great reputation first as a dramatist and then as a historical novelist, especially for such works as 'The Count of Monte Cristo,' and 'The Three Musketeers.' He was among the first, along with Honoré de Balzac and Eugène Sue, who fully presented a rich, detailed picture of life in early 19th century - France, creating characters of formidable individuality and willpower...<br><br>'The Man in the Iron Mask' takes place in 1662, where a spoiled young king rules in decadent luxury while his subjects are starving in the streets... His armies fight unjust wars... His selfish actions result in deep resentment by the people... He is currently under siege by rebellions... His tyrannical disposition prompts the original 'Three Musketeers' to believe that France will never prosper unless a change is made... Our musketeers have all grown into middle age, and their exploits have become legendary...<br><br>When the son of Athos is sent to the front lines of battle, and killed the aging 'Three Musketeers' (Athos, Porthos and Aramis ) are forced to haul out their old uniforms into active rebellion against the crown... They come up with a plan to expel the tyrant from his throne... A carefully guarded secret works to their advantage...<br><br>Aramis knows of an enigmatic Bastille prisoner, a helpless victim of the king's justice, whose true identity and existence is unknown to most... This mysterious young man has been thrown into loneliness and pain in a dungeon for six years, forced to wear an affixed iron mask so no-one can notice how much he looks like the king...<br><br>In a risky maneuver to save France, the 'Three Musketeers' break the title character out of prison, teach him to behave exactly like the king, and then set off to make the 'switch' in a masquerade ball...<br><br>As their plan unfolds, they must confront their friend, the great D'Artagan, one-time \"fourth Musketeer,\" now head of the king's bodyguards, who has sworn an oath to protect the king with his life...<br><br>DiCaprio plays two characters so distinctly and effectively that you absolutely hate one and love the other...<br><br>He is King Louis, a non-caring leader who lets his subjects starve and riot in the streets of Paris... He is a vile ice-hearted seducer mostly interested in bedding attractive young women... He displays, with talent, King Louis' arrogance and cruelty... DiCaprio is also the gentle Philippe, the polar opposite of Louis... Philippe has the heart of a king, with eyes asking too much... <br><br>Gerard Depardieu is delightful as the old and weak Porthos, the womanizer, more concerned with the pains of growing older... Porthos feels useless unable even to \"straighten his sword\" when in the hay with three women... <br><br>John Malkovich is the straightforward Athos, now an impulsive widower and an angry father who has his own need for revenge against the King's treachery... Two time Oscar nominee for \"Places in the Heart\" and \"In the Line of Fire,\" Malkovich makes the point that ideally, they should have a king worthy of their service...<br><br>Jeremy Irons is the contemplative Aramis, the justice leader of a silent rebellion.... As the Jesuits oppose Louis' wars, and the starvation that results, Aramis is ordered to discover the true identity of the general of the Jesuit's order and to execute him... In one moment, Jeremy Irons (an Oscar winner for 1990's \"Reversal of Fortune\"), dignifies the true mission of a Musketeer when he states: 'When we were young men, and we saw injustice, we fought it!'<br><br>Gabriel Byrne is the faithful D'Artagnan who carries a mysterious secret with him... His dark romantic secrets are hidden in his sad look... Byrne has the right combination of gravity and flair for the conflicted D'Artagnan, especially in the scene where he placates an angry mob... He projects his character's romantic frustration and his crisis of conscience, and desperately tries to find a balance between his loyalty to the king and his ability to live up to the code of the Musketeers... <br><br>Anne Parillaud is the twins' mother, Anne d'Autriche, torn between her passion and her maternal love toward a son completely far from the path of compassion and honor...<br><br>Judith Godrèche is the damsel in distress, the beautiful Christine torn between being faithful to her dead love and helping out her poor family by basically selling her body to a lusting king...<br><br>The film's authenticity and visual presentation are as glorious in the decadent luxury surrounding the King of France as grotesque in the terrible place occupied by the man in the iron mask...<br><br>Randall Wallace (Oscar-nominated for \"Braveheart's\" script) brings the great palace of Versailles to life with elegance and finesse... The beauty of the gardens defies verbal explanation... The music is beautiful and epic, and the motion picture is done with pride and conviction...<br><br>The masked prisoner actually existed in reality... But his identity was never known and it's of little consequence here... The film, however, is not exactly faithful when it comes to historical facts... It has been created for pleasant entertainment purposes... Louis XIV of France, whose great prestige earned him the title of 'the Sun King', ruled France in one of its most brilliant periods and remains the symbol of absolute monarchy of the classic age...","user":"Nazi_Fighter_David","rank":[102,146]},{"title":"Loved this movie more than a crown! Well, unless the crown is made of diamonds, but you get the idea","rating":8,"date":"23 November 2003","review":"The Man in the Iron Mask, fresh off the massive success of Titanic, we got the next movie starring huge heart throb Leonardo DiCaprio along with some of Hollywood's strongest male leads. Including a couple of my favorite actors John Malkovich and Jeremy Irons, so this was a movie I was looking forward to seeing, not to mention I was 13 at the time of this release and was totally in love with Leonardo DiCaprio, oh yes, good times. So of course this movie was love at first site with me, but as I grew up and watched the movie without my crush influence, I still found it to be a good solid movie. Leonardo stays strong as his first duo role as King Louis and Philippe and proves he can stand up with the heavyweights of Hollywood. Jeremy and John together with Leonardo had great chemistry and made The Man in the Iron Mask a really good watchable movie.<br><br>France is under the reign of King Louis XIV, who is bankrupting the country with his unpopular wars. When starving peasants in Paris start to riot for food, he responds by ordering his chief adviser, to send them rotten food. Meanwhile, the King wallows in hedonistic luxury while seducing a parade of women. The legendary three musketeers have retired from their posts: Aramis is now a priest of the Jesuit Order; Porthos is running a Parisian brothel; Athos has a son named Raoul who is just back from the war and ready to marry the girl he loves, Christine. At a festival, the two lovers are greeted by an older D'Artagnan, just before Raoul can propose, the King's eyes fall on Christine. He arranges for Raoul to be returned to combat and killed in a suicidal charge. In the wake of Raoul's death, Aramis initiates a plot to overthrow the King with the help of his old comrades. Only Athos and Porthos agree to the plan; D'Artangan refuses to betray his oath of allegiance. The three musketeers sneak into an island prison and arrange the escape of a mysterious prisoner: a man in an iron mask. Philippe, the identical twin of King Louis. While he looks indistinguishable from his brother, Philippe is compassionate and gentle and the plan is to replace Louis with Philippe.<br><br>While I've expressed my love for John and Jeremy, the true talent comes out in Gabriel Byrne's performance as well as Leonardo DiCaprio. Gabriel as D'Artagnan was just beautiful, charming, dashing, and very charismatic. While the movie could have had a little better direction, in some ways this felt more like a made for TV film at times, just with the big names. I'd say that's the movie's main flaw, but they were not given a big budget to make it into a great movie. Also the fact that Leonardo as Philippe, they take the iron mask off his face and he's still pretty! Eh, still I'd highly recommend it, it's the actors that make this movie very delightful to watch, one for all and all for one this movie is just tons of fun! Hey, that almost rhymes, I made a funny! OK, there's my cheesy joke, I'm done, just watch the movie.<br><br>8/10","user":"Smells_Like_Cheese","rank":[72,101]}]