[{"title":"Variety Of Fighters, Nice Colors Made This Fun To Watch","rating":8,"date":"21 November 2006","review":"Although it took four viewings before I finally lowered my rating of this from \"9\" to \"8,\", I suspect I will still watch this lame-brain action flick a few more times and enjoy it. That's because it offers a great mixture of fascinating fighters in the tournament that covers most of the final 40 minutes of the movie; is a modern-day martial-arts action film with almost no swearing and no sex; and offer some tremendous scenery in the first half of the film as Jean Claude Van Damme and company travel to the Far East for this \"World's Greatest Fighter\" tourney.<br><br>That tourney is a lot of fun to watch except that it got carried away in the final bout, of course, that went on almost as long as all the preliminary bouts! However, the filmmakers were smart to make all the contestants totally different with different styles, making each one fun to watch. You didn't see the same thing each fight. There was everything from a huge Sumo-type wrestler to a little guy who imitated a monkey and a snake jumping and slithering around the ring. By the way, these were real guys, not actors imitating fighters.<br><br>The photography is magnificent, far better than you would except. The colors are beautiful and the Thailand scenery spectacular. The movie benefits from a classy actor like Roger Moore joining the cast, too. Yeah, it's stupid in parts, but it's fun and highly recommended for first-time viewers who don't know the outcome of the bouts.","user":"ccthemovieman-1","rank":[39,44]},{"title":"Van Damme's effort as a director is a good surprise!","rating":31,"date":"31 July 2000","review":"This film is Van Damme's first effort as director, and he is surprisingly good in his task!The Quest is, of course, a simple action film, but it has a lot of good intentions and the story, written by Van Damme, is good-hearted. The star plays Chris Dubois, a man who is saved by a group of mercenaries led by a smooth and charming thief (Roger Moore, who brings a little bit of comedy and softness to the story), and this guy takes Chris to the Lost City to fight in a highly dangerous tournament. The winner takes home a beautiful, enormous golden dragon. This isn't the best film of Van Damme's career, his best phase was with the Chinese directors (Hard Target, The Colony), but The Quest isn't a good film for those who want to see explosions, Van Damme blowing people's heads off and those kinds of thing. This is an adventure, the type of film that, if we were now ten years old, would love!you don't have violence, shootings and explosions, if you want to watch something like that rent Hellbound Hellraiser 2, this is a Raiders-of-the-Lost-Ark kind of film. If you want to give the movie a shot, try to forget your grown-up side and watch it as if you were ten years old again. Then you will love it!it's a simple, entertaining and very good movie!","user":"ary","rank":[27,33]},{"title":"Surprisingly good","rating":9,"date":"17 November 2001","review":"This film is a lot better than I expected, and much better than the other imdb comments would imply.  You can essentially split this movie in half, with the first half being an adventure movie and the second half being a fight competition.  I actually liked the adventure portion a lot more than the fight competition, which is surprising since I like stuff like Bloodsport (the fight part of The Quest is essentially a higher-budget version of Bloodsport).  At any rate, this movie is great visually -- it's filmed in a lot of exotic locations.  I also thought the direction was great...there were some interesting shots that really impressed me for Van Damme's first directorial effort.  The story kinda moves along too quickly and there are a couple parts where this strains the believability of the story (such as how easy it is for Van Damme to get the fight invitation/map from the boxer), but these are easily overlooked and don't really detract much.<br><br>I went into this expecting it to be low-budget and fairly dumb, but I was surprised at the lavish production and the fact that it has an actual story which I find more interesting than the fighting.","user":"Slaphammer1","rank":[16,19]}]