[{"title":"An Excellent Story of Modern Boxing","rating":9,"date":"16 October 2001","review":"I have to admit that when I rented this movie, I was expecting a dumb comedy that would fail to show the reality of boxing. However, this film is a very funny film that also has a rather keen insight into the current state of boxing. Samuel L. Jackson plays a \"Don King\" type guy that is stuck with the problem of having a champ that might be too good. No one wants to pay to see the guy, because there are no quality fighters out there to challenge him. So, Jackson goes about creating a contender for the champ. What is the one thing you need to get people in the arena to watch? Well, a white challenger of course, experience not necessary. Surely many white Americans will pay to see one of their own knock down the overly cocky, black champ. Berg plays the \"Great White Hope.\" The beauty of this film is the comedic way that it shows the real life corruption in boxing today. Fights are fixed, promotions are staged and very rarely do you have the best fighting the best. Moreover, we as viewers fall into the same trap that boxing fans do. Here you have an unqualified contender, that has no prayer of beating the champ. However, as we see the hype done by these snake oil salesmen, we start to believe that Berg's character actually has a chance to win. If you are a boxing fan, you will love this film, because it is real. Even if you are not a boxing fan, you will enjoy it. Very funny film and great acting performances. Believe the hype!","user":"Tiger_Mark","rank":[22,24]},{"title":"Very sharp boxing satire!","rating":8,"date":"8 May 2007","review":"Reading through the reviews on here, I can only assume that the humour in this film was wasted on a lot of people. Boxing is one of the few sports that translates well into the movies, with there being a decent number of great films based around the sport. This is slightly different to most however, as it takes a very humorous, cynical approach. There are so many memorable scenes and lines in the movie, right from the opening scene it's spot-on and I really can't work out where this criticism of the direction stems from! The fight scenes are over quickly and are nothing like the real thing - obviously - it's a comedy, not a documentary (sigh).<br><br>Like I said, I can only assume that the biting satire has been wasted on some viewers who were clearly expecting something different from the film. Each to their own, the film seems to have missed it's audience, but a 5 or 6 out of ten it certainly isn't! For me, it's definitely one of the better comedies out there. It's sharp, funny and well worth watching. 8 out of 10.","user":"Sammy_Sam_Sam","rank":[13,19]},{"title":"Likeable enough comedy slugfest","rating":2,"date":"2 November 1999","review":"Okay, it's not the best film ever made, but it's an affable little number which'll certainly keep you entertained for an hour and a half. The storyline always seems secondary and the satire's never quite as punchy (ahaha... ha) as it should be, but there are some great comedy moments and a host of memorable characters (Damon Wayans' drawling pot-bellied champ, Peter Berg's peabrained challenger, Jeff Goldblum's rambling TV crusader, John Rhys-Davies' sweaty, foul-mouthed trainer) - and Sam Jackson's permanent big grin is all too infectious. Genuinely funny comedies aren't that easy to come by these days, so this one could definitely be a contender, give it a shot at the title, stick it up your ring etc. I'll get me coat.","user":"Leigh L.","rank":[9,13]}]