[{"title":"Not Scorcese's best, but pretty good!","rating":9,"date":"12 September 2000","review":"Martin Scorcese's filmography as director is one of the most accomplished in modern film history.  While Cape Fear can't even hold a candle next to \"Taxi Driver\", \"Raging Bull\" and \"Goodfellas\", it is still a fabulous remake of the 1962 noir classic and it keeps the viewer on the edge right through until the closing credits.<br><br>Robert De Niro (in yet another brilliant teaming with Scorcese behind the camera) plays Max Cady, a psychopathic rapist who was sent to jail 14 years earlier for such crimes.  He leaves prison with vengeance.  Not for his victims or his prosecutor, but his defence councillor, Sam J. Bowden, played by Nick Nolte.  It seems Bowden did not defend Cady to the best of his ability.  Cady knows this and wants some payback.<br><br>Cady's initial return into Bowden's life could not have come at a worse time.  Bowden has been forced to move his family to Florida after his infidelities threatened his marriage and career.  His wife is distrustful and worst of all, Bowden is on the verge of beginning another affair with a female workmate.  Added to that, his daughter is at the difficult age of 15.<br><br>Almost by ozmosis, Cady understands these problems in the Bowden household and acts on them.  He begins terrorising Bowden and his whole family, taking it from one extreme to the next.<br><br>What makes Cape Fear such a good film is the rapidly increasing sense of claustrophobia.  Scorcese makes a point of using almost only close up shots towards the end of the film.  It is a great touch that makes the viewer that much more scared as the film goes on.<br><br>Along with that, Robert De Niro is superb as Cady.  Only occasionally does the role slip into parody.  Mostly he is expertly evil.<br><br>Nick Nolte is good if not great, the same for Jessica Lange as Leigh Bowden. It seems as if they were void of any great lines in this film, which is unfortunate given their immense talent.  Julliette Lewis is absolutely brilliant as the young daughter, Danielle.  She slips effortlessly between curious sexual awakenings, rebellious teen and straight thinking woman.  Add in small roles for Robert Mitchum and Gregory Peck (the leads of the 1962 version) and you have a great ensemble cast.<br><br>So not the best Scorcese film ever, but some tight editing, great camerawork, a haunting theme and devilishly over-the-top  acting help make this a frighteningly fun movie to watch.  Strongly recommended.","user":"exterminator_99","rank":[131,156]},{"title":"\"Counselor, Come Out! Come Out! Wherever You Are!\"","rating":10,"date":"10 April 2001","review":"Robert De Niro is one of those actors that just melts into a role.  His performance as rapist, convict, and all-around not-a-very-nice fellow Max Cady is certainly one of his most memorable performances for its stamina, strength, and excessiveness.  The film by Martin Scorsece is a remake of the classic film starring Robert Mitchum and Gregory Peck.  Although Scorsece keeps the spirit of the film intact, he does make some very modern changes. He changes the role of Sam Bowden and family from one of harmony to dysfunction.  No character is the epitome of a universal good, but rather flawed(very flawed) goodness.  Nick Nolte does a fine job as Bowden and Jessica Lange and Juliette Lewis both give deep, emotional performances. The film is really a sea of emotion...most of that emotion being fear. Scorsece adds some arty touches with the camera, but it is his gritty style that really dominates the film's impact.  Scorsece also is ever the protector of film as he gives cameos to Gregory Peck, Robert Mitchum, and Martin Balsam(all in the original film).  The other acting standout goes to Joe Don Baker as a hired private investigator.  But make no mistake....this is De Niro's film all the way.  He has some of the best lines as he harasses the Bowden family, terrorizes the Bowden family, and strips the Bowden family of all civility, pretense, and dignity.  This film is definitely a keeper!","user":"BaronBl00d","rank":[59,74]},{"title":"One of the better thrillers of the 90's","rating":9,"date":"9 December 2004","review":"I have wanted to see this movie for quite some time, and I finally saw it, and I thought that it was great. I am a huge Martin Scorsese fan, and I would have to say this is one of his most true to life films, even though its not his best film. The acting is great,and so is the music. The film will send shivers through your body. This is also one of DeNiro's most underrated performances and deserved more attention at the time of its release. Its also great to see some of the actors from the original version show up in cameo roles. If you like horror films and thrillers, you will most likely enjoy this. ***1/2 out of ****. A recommended viewing.","user":"Idocamstuf","rank":[76,97]}]