[{"title":"wonderful, old-fashioned movie","rating":10,"date":"15 May 2005","review":"I've always surprised when people don't like this movie. It was one of my favorites at the time, and it has aged very well. It's a real \"retro 30's\" picture, like \"The Shadow\", instead of being a modern reinterpretation of such movies like the Indiana Jones films (which I also like very much). <br><br>The reviews cover the plot enough, and there are no real surprises here, but it's great family fun. My kids really love this movie, and I end up watching it every year or two, and I have never tired of it. When it came out there were apparently sequels planned, but it got killed at the box office by T2, which ran over everything that summer, so Disney never did anything with the show. They have recycled the atmosphere and the music in the \"Soaring over California\" ride at DCA, and I have to say it always makes me wistful that the movie never got a sequel.<br><br>By the way, the movie doesn't follow the comics that closely, which I don't mind, but if you are a purist and a fan of the \"graphic novels\", you might keep that in mind.","user":"hbs","rank":[60,66]},{"title":"wonderful throwback to 30's serials","rating":10,"date":"5 February 2001","review":"This movie is what \"Spysmasher\" and \"The Red Skull\" wanted to be, but couldn't because special effects were too lame then and their budgets were too small. It's sad how a lot of critics dumped on Bill Campbell's performance in this movie, when he does precisely what he should -- he's the square-jawed, slightly naive, optimistic hero who is repeatedly double-crossed by the wily villain (if he were less of a Boy Scout and more of a James Bond, there wouldn't be any movie). Connelly and Arkin are just great as, respectively, the beautiful and plucky girlfriend and the brilliant mechanic father-figure/sidekick. If you liked those old serials, you'll love this movie. <br><br>Maybe the movie didn't have an audience, but if you watch the trailer it wasn't marketed right -- the trailer makes it seem like an Indiana Jones movie, and it is much more innocent (and sweeter) than that. Apparently Disney was planning to make another one, but pulled the plug because this one bombed at the box office. I recall expecting something else when I went into the theater, and being very pleasantly surprised by it. I was also very surprised when the movie wasn't a hit, but I even sort of liked the old Flash Gordon serials, so...<br><br>Another thing that is disappointing me at the moment is that I can't find any entries for the Spysmasher or Red Skull serials (the latter was the first one I know of with the Commando Cody character, although I don't recall him being referred to by that appellation -- I saw it 40 years ago, and then managed the catch the last hour or so in the middle of the night about 15 years ago one sleepless night, so it's kind of a blur).","user":"hbs","rank":[76,85]},{"title":"Great pulp/serial adventure!","rating":3,"date":"3 May 2004","review":"I was chomping at the bit, waiting for this movie to come out, back in 1991. I had loved the Dave Stevens comics since I first encountered them (ironically, at the same time I had read about Bettie Page in an article about Bunny Yeager, in a photography magazine).  The comic captured the spirit of 1930's aviation pulps, as well as the Doc Savage crowd.  It also brought along that Republic Studios flavor.  I couldn't wait to see this as a movie.<br><br>The movie captured the spirit of the comics beautifully.  Sure it was disappointing that Doc Savage couldn't be included, but Howard Hughes made a sensible substitution.  I was a bit annoyed that Disney felt they had to change Betty into Jenny, but with Jennifer Connelly in the role, I was in a forgiving mood.  The film was full of action and humor, cliffhangers and character; just like Stevens' creation.  If there was anything to criticize, it was the toning down of Betty/Jenny.  Yeah, I know, this is Disney, and she was far tamer in the comics than the real Betty/Bettie Page; but, hey, a guy can hope.<br><br>Bill Campbell was perfect for Cliff Secord.  He had that All-American look, with an impish twinkle in his eye.  Watching the movie, you could see the excitement when he was flying, and that he was head over heels in love with Jenny.<br><br>Alan Arkin made a great Peevy, although he was far less cantankerous than his print counterpart (incidentally, Peevy was based on Doug Wildey, creator of Jonny Quest).  He was more of a Connecticut Yankee than grouchy mechanic.<br><br>Timothy Dalton made a great pseudo-Errol Flynn.  I wasn't too happy that they trotted out that Flynn-as-Nazi Spy nonsense; but, it works beautifully for the story.  Paul Sorvino made a great 30's mobster, too.  Add Tiny Ron as Lothar, modeled after Rondo Hatton, and you have some pretty fun villains.<br><br>Then, there's Jennifer Connelly, one of the most beautiful and talented actresses in Hollywood.  As I said, I had hoped for a little sexier character; but, the compromise was still pretty good.  Connelly brought both a wholesomeness and sex appeal to the role.  She looked great in the period clothing, too.<br><br>Everything about this film worked.  The period detail was first rate, from the costumes, to he set design, to the slang.  The only thing that would have improved this would have been to make more films.  This is a great film for the whole family and captures the spirit of Republic and the pulps as well as Indiana Jones did.","user":"grendelkhan","rank":[62,69]}]