[{"title":"Pathetic end to the Candyman series","rating":3,"date":"3 November 2001","review":"I realized that I had never seen any of the Candyman movies, so I rented all three, and watched them one after another. The first two were really good. But this? The dark atmosphere has been thrown out the window. The awesome Phil Glass score is gone. Having a Baywatch chick as your lead?!! C'mon. This movie has no class. It was obviously thrown together by hacks. Heck, there's a shot of a building, where they obviously threw an orange filter over the sky in color correction, but it covers up the top of the building as well! This movie just looks cheap, which is a shame considering how well the first two were made. Candyman says \"Be my victim\" so many times it borders on self parody.","user":"scottmar","rank":[24,31]},{"title":"Candyman Day of the Dead: Further reason why Candyman faded away","rating":4,"date":"3 December 2017","review":"The Candyman returns once again to torment and kill a distant relative for further undisclosed or vague reasons.<br><br>This time it's Baywatch alumni Donna D'Errico taking the lead and boring the hell out of us for the films 90 minute duration.<br><br>Granted this is a marginal step up from Farewell To The Flesh (1995) but still spotlights why the Candyman franchise died such a death.<br><br>I've never understood how Tony Todds Candyman became so iconic, how do people place him alongside the likes of Freddy, Leatherface and Jason when he had just 3 rather mediocre films to his name.<br><br>I'd like to see Candyman reborn, whether a 4th film or a reboot I don't mind but we a) Need Todd to remain the titular role and b) New writers.<br><br>The Good: <br><br>Wade Williams <br><br>Donna D'Errico is far better here than I've seen her before <br><br>The Bad: <br><br>Plot is still pretty messy <br><br>Things I Learnt From This Movie: <br><br>Remaking the origin scene and making it different makes about as much sense as nipples on men <br><br>Donna D'Errico is allergic to bra's","user":"Platypuschow","rank":[11,14]},{"title":"A couple of good slasher scenes, plenty of cleavage and a poor ending.","rating":24,"date":"24 November 2000","review":"Did this film really have a chance at beating the hook stabbing prequels? I was pleasantly surprised at how good the follow up to the first was, however the third...well.<br><br>After avoiding this movie for ages, not wanting to be disappointed, I finally popped by my local video shop ( I may have gone to see it at the flicks if I had been given the chance ). Sat down with a mate who hadn't seen the others and watched him squirm, not from the horror but from boredom.<br><br>A poor low budget remake of the others this certainly was. A gripping glorious gore fest this was not.<br><br>We now find that Candyman had time to do a couple of sketches of his voluptuous lover (he's no Picasso) during his slave(?) days. Thankgod the writers kept his horrible demise the same.<br><br>Well I wasn't expecting the Earth, but how about a complete self parody instead of this, at least we could have laughed aloud in the correct places, like Scream. Was it supposed to be funny?<br><br>Some good ideas: an insensitive lover who had to get it, a subway scene that didn't stand a chance against 'American werewolf' but was still enjoyable, a great cop death and plenty of honey.<br><br>Okay it was bearable. Just. Maybe they'll repair the damage with another; until then I'll conveniently forget this one. Watch the others again instead.","user":"bilbobanta","rank":[4,4]}]