[{"title":"Simply a fantastic movie","rating":9,"date":"1 October 2003","review":"The critics, nit-pickers and historical pedants who've trashed this superb piece of truly cinematic movie-making have totally missed the point.<br><br>So what if Johnny Depp's English accent isn't exactly \"right\" for his character? (English accents have always been problematic for all but the most skilled of American actors: Depp pulls it off entirely passably, way way better than - say - Keanu Reeves, risible in Coppola's Dracula. Think of Kevin Costner, who didn't even bother trying in Robin Hood Prince of Thieves.) I'm a Londoner by birth, and for me the accent in no way detracted from Depp's excellent performance.<br><br>As for history, again, who cares if the filmmakers have employed a degree of dramatic licence? This is a movie, not a documentary. Nobody knows for sure who Jack the Ripper was, and in order to make the film interesting and enjoyable the writers have speculated a little. Fine by me.<br><br>OK, so Heather Graham was impossibly glamorous, but movies with big budgets need a little bit of star appeal. The notion of the \"tart with a heart\" is a cliché, sure, but nevertheless her character works in the context of the film. (Contrast the depiction of prostitution generally in this film with the utter garbage that is Pretty Woman.)<br><br>What's so great about this film? The quirky, literate script; the performances (all, with the possible exception of Graham, excellent); the wonderful photography and production design; the depiction of the murders themselves - elliptical, shocking, mesmerising; and above all the aura of brooding menace, gloom, cruelty, darkness, melancholy and downright despair running through it as deeply as the veins through a block of marble. This is marvellously thoughtful, evocative film-making, very bold and brave. No happy Hollywood ending, no phoney saccharine or cheap laughs to satisfy the popcorn brigade. This is a proper grown-ups movie that probes some of the darkest regions of the human psyche, places mainstream filmmakers like Lucas, Spielberg, James Cameron and their ilk don't dare to go, or couldn't go even if they wanted to. To me it appeals almost on a subconscious level, forcing us to confront our deepest fears and taboos - death, pain, suffering, human wickedness. I can't think of a recent major release that is so relentlessly downbeat.<br><br>Don't let the detractors put you off. It's hardly surprising a generation weened on MTV - folk with the the attention span of a gnat and the emotional depth of a paper cup - didn't like it. They've got their Screams and their Scary Movies, and they're welcome to them. This is super stuff, and the Hughes brothers and their collaborators should be heartily congratulated for it.<br><br>A classic, not so much for the plot, which is a little contrived, but for its sure command of cinema as a visual storytelling medium.","user":"KenLiversausage","rank":[243,300]},{"title":"Darkly stylish--not based on reality.","rating":8,"date":"17 May 2004","review":"The best thing about an enduring mystery is that people can feel free to take all sorts of liberties with the facts and create interesting \"what if\" scenarios.  FROM HELL is a perfect example.  For the record, the theory behind the killings is pretty much right out of JACK THE RIPPER: THE FINAL SOLUTION by Stephen Knight, and it's been pretty well discredited since it first came out twenty years ago, even though it makes a hell of an entertaining piece of fiction.<br><br>I completely discount any criticisms of the movie where people say \"it didn't happen that way\".  Of course it didn't; that's why this is a fictional film and not a documentary.  It's very loosely based on the Alan Moore graphic novel, and about all it retains of it is the Duke of Clarence theory and the stylish look of the architecture.  It's enough to make the film beautiful to watch.<br><br>Yes, I know that four of the five victims of Jack the Ripper were women in their late 40's, which on the streets of Victorian London would mean that they would resemble crones in their late 60's or early 70's.  Just try to make that fly past a Hollywood studio boss; the casting at least had women who looked fairly human rather than like fallen glamour girls.  I've read a couple of comments disparaging the accents.  Actually, Cockney accents were the norm in the street because people tried to blend in and often weren't eager to advertise Scottish or Irish origins.  <br><br>I call special attention to the performance of Jason Flemyng in the role of Netley, the coachman, arguably the most fascinating and believable character in the whole production.  Most of his best scenes ended up on the cutting room floor, unfortunately, and yet he still manages to pull the movie together into a cohesive whole just by his presence.  (It must have been a heck of a fun role to play!)  As well, Sir Ian Holm deserves special mention for stepping in when the original choice for his role, Sir Nigel Hawthorne, tragically became ill and died just before the film went into production.  I have never seen Sir Ian in any role that I didn't find completely believable, and that ranges all the way from KING LEAR to his role in ALIEN, for heaven's sake.<br><br>My interest in the whole Jack the Ripper case has been reawakened thanks to this movie, and I'm trying to hunt down a copy of Alan Moore's graphic novel (which is very difficult to find).  No, it's not even close to an approximation of what really happened; nobody will ever know the truth, Patricia Cornwell's arrogant claims notwithstanding.  It's still worth renting, if only for the beautifully ominous score and the fascinating transformation of Prague into Victorian London.  I thoroughly enjoyed it.","user":"keenan-1","rank":[85,107]},{"title":"A psychotropic thriller","rating":9,"date":"9 January 2002","review":"There are many things in media that have nearly insurmountable preconceptions that lead to generic truisms. One of these is 'comic books are pure fluff,' and another is 'no good movie is ever based on a comic book'. <br><br>From Hell is a project that takes both of those truisms and tosses them completely out the window.  Based on an ambitious graphic novel written by Alan Moore and illustrated by Eddie Campbell, From Hell (named for the signature on the Jack the Ripper letters written to the police), is one man's carefully researched theory into the eternal mystery surrounding the Whitechapel murders of 1888.   <br><br>This is not a factual display of guilt or innocence, as many of the answers behind these crimes will never be known, but as theory mixed with fact, it creates with chilling detail the mood of lower-class London in the late nineteenth century, where life was cheap, bloody and oftentimes short.<br><br>The Hughes brothers, noted for their stylish direction, do a very good job of creating the mood here, involving all the grunginess and hopelessness of the streets, and combining the more mystical elements of Moore's story into the crime tale.  Johnny Depp is Inspector Abberline - an opium-smoking criminal investigator that often follows up on hunches he receives during moments of hallucinatory revelation.<br><br>The style of the film - dripping with violent murder of prostitutes in alleyways - leaves more to the imagination than it reveals, although the gore level is by no means light.  The vicious throat-slashes and bloody crime scenes are definitely grotesque, but most of the time we are shown the crime after the fact, letting the viewer decide how horrible the murder itself was.  <br><br>All the performances are strong, fitting together into an ensemble piece, with Depp being as much a chameleon as ever as Abberline, and Robbie Coltrane equally strong as his colleague Godfrey.  Ian Holm, Heather Graham, and Ian Richardson also provide good supporting roles. <br><br>\nFor an historical perspective of the Jack the Ripper crimes, best to watch an A&amp;E documentary.  But for a theoretical description of the crimes, and an artful depiction of a carefully constructed tale, definitely check out the very chilling, very calculated, and very good From Hell.","user":"kmberger","rank":[104,134]}]