[{"title":"A Walk on the Moon","rating":8,"date":"22 July 2005","review":"I really enjoyed this movie. I think the soundtrack is amazing and appropriate although \"Helplessly Hoping\" is a cover of the CSNY classic. Still, we have Jefferson Airplane, Jesse Colin Young, Joni Mitchell, Judy Collins, and Richie Havens to drop a few names. Listen to the lyrics in this movie...apply them to how Pearl, Diane Lane's character is feeling... Diane Lane does a wonderful job of portraying a 60's housewife who, like so many other women of the time, found herself in a life she fell into. She meets a man who reminds her of who she wanted to be...of feelings she forgot she had. Movies aren't obligated to be lessons on morality, rather they are slices of the lives we all lead or dream of leading or hope to never lead. Some of the scenes in this movie are so powerful-they really rattle the soul. The love scene at the waterfall is wonderfully scored with the amazing \"Cactus Tree\" by Joni Mitchell. One can feel Pearl's guilt and confusion coupled with an excitement and verve for life she truly deserves. We see Pearl come of age metaphorically as she searches her heart to find out who she truly is. I recommend checking this one out and watching with an open heart and an open mind...the music alone is worth it.","user":"melanielellis","rank":[31,35]},{"title":"the best movie I've seen in sometime","rating":10,"date":"9 August 1999","review":"A Walk on the Moon was Tony Goldwyn's directorial debut,<br><br>and all I can say is MORE!  This is an excellently constructed film.  The script was written by Pamela Gray is<br><br>fantastic.  If you like a film with characters who could easily be real in believable situations that you come to care about, then you will love this film.  Set in upstate New York in the summer of '69 the movie focuses on the choices and the resulting consequences made by a young woman who feels trapped in her role as wife and mother.  That setting with the Vietnam War, social unrest, Woodstock, and the manned moon landing is arguably one of the most interesting times of the 20th Century and woven seamlessly into the film.  The soundtrack with songs from the era fits perfectly and is great. The casting and performances were flawless.  After seeing the film, I can't imagine anyone else in the roles.  This was the first time I had seen Liev Schreiber who plays Marty, the husband, and Viggo Mortensen, the carefree lover.  Both were terrific.  Tovah Feldshuh, the perceptive earthy mother-in-law, and Anna Paquin, the rebellious daughter, were perfectly cast as well.  And Diana Lane as Pearl, the lead, plays her multifaceted role well.  I believe this film to be worthy of Academy consideration.  The category that comes to mind (and there are others) is best supporting actor for Liev Schreiber. This film is a must see for the baby boom generation. Four stars!!!!","user":"T-10","rank":[50,59]},{"title":"Glad I finally had the courage to watch this film","rating":22,"date":"22 January 2003","review":"Warning: Spoilers ahead!<br><br>\"Sometimes I just wish I was a whole different person,\" Pearl Kantrowitz (Diane Lane) tells her friend in an unguarded moment of \"A Walk On The Moon\".  The friend's reaction?  \"Yuck.\"<br><br>Exactly.<br><br>Long review coming -- so sit, already!<br><br>When this movie's trailers came out in 1999, I cringed, avoided the film, walked past its posters with my eyes averted.  I had divorced the year before, within the years of my marriage had unfortunately been a deceived wife, and had no desire to re-visit that pain.  Fast-forward to 2003: Having grown a great deal, I decided to rent what I had avoided.  I'm so glad I did.  \"A Walk on the Moon\" is a lovely, authentic film with a light-seeming yet solid screenplay, great direction, and fabulous acting by a talented cast.  (Watch the expressions of Diane Lane and Viggo Mortensen, which subtly change to portray rainbows of emotions within a few seconds.)<br><br>The Kantrowitzes (culturally though not particularly religiously Jewish) have rented for the umpteenth summer one of many tiny lakeside cottages owned by a Dr. Fogler in the Catskills.  Friends they've met over the years there also rent near them.  Their children (Alison, 14 -- Anna Paquin in a totally believable performance -- and Danny, 6) stay there during the week while their father Marty (Liev Schreiber) drives back and forth from NYC and his job as a TV repairman.  Caring for the children is their paternal grandmother, Lilian (Tovah Feldshuh -- wonderful!), and their mother Pearl (Diane Lane).  Pearl is 32, we learn, and Marty perhaps a year or two older. It is the summer of 1969 -- culture, music, mores are changing, and the whole family is caught up in a loss of innocence.<br><br>Into their enclave of mah-jongg and Sinatra comes hippie-ish Walker Jerome (Viggo Mortensen), the new \"Blouse Man\" -- a relaxed-attitude businessman, he's bought the bus from the former blouse-man, and drives a circuit, making unscheduled stops at Dr. Fogler's to sell blouses and scarves, and later, at Pearl's suggestion (clearly she knows something about retailing, perhaps from her family-of-origin), sunglasses and jewelry.  We learn very little about Walker -- who possesses the mannerly, shy diffidence and \"that's cool\" attitude which characterized some people of the late-1960s but was often used to disguise inner struggle and pain -- although he lives alone nearby, has a vegetable garden, and reads the book \"A Place in the Woods\" (still in print, this 1969 account by Helen Hoover details how she and her husband left their jobs in Chicago to pioneer back-to-the-land in northwoods Minnesota).  We also learn that Walker's soldier-or-spook kid brother has been missing in Southeast Asia for four years.<br><br>Some reviewers below mention that Pearl leads a content, middle- (or even upper-middle-) class life.  Not true.  The Kantrowitzes do not have much money (why else would Pearl's mother-in-law live with them in what, judging from the neighborhood -- first minutes of the movie -- is an apartment? And did you see the car's interior on the drive up to Fogler's?  The reason Pearl walks quite a way to the kosher butcher, getting caught in rain, is that Marty's taken their one car back to NYC.).  Marty repairs TVs, but doesn't even own the business.<br><br>The back story, mentioned in passing by the grandmother and Pearl, is that one summer as a teen, Pearl visited one of the posh Catskills resorts with her family (recall the lakeside resort of \"Dirty Dancing\" or the even posher Grossinger's).  Marty worked there that summer as a waiter, earning salary and tips to attend college, then perhaps med school.  Marty spotted Pearl, was enthralled, they began to see each other over the weeks, she'd never had a boyfriend before, they made love, she got pregnant the first time.  At 17. In getting pregnant then (remember how illegal and dangerous abortion was in the summer of 1954 -- when Alison would have been conceived, if she's now 14 in the summer of 1969), in deciding to marry a young man at whom her parents were probably appalled, given their hopes for the lovely young Pearl, in becoming a wife and mother so very early, Pearl has missed out on a great deal of life.  (As has, of course, Marty, who gave up his educational plans to support wife and daughter.)<br><br>Now, this summer, Pearl's daughter has her first period.  This is a major moment for a mom, as well.  Put anthropologically, Pearl is no longer the only female of reproductive age in the house.  Therefore, as happy as she is about her daughter's growth, she also feels older.  (At a mere 32, an age when many women nowadays are just marrying.)<br><br>Having personally experienced what infidelity does to a family and to the betrayed spouse from a vantage point similar to Marty's, I'll say right now that the decision to be unfaithful is a poor one.  (Cliche but true:  You can't solve problems within a marriage by going outside it.)  It's clear, however, that Pearl has been trying to let Marty know that there IS a problem.  It's just that she doesn't know how to bang him over the head with it, and, like most wives, wants to preserve peace.  (What's the price of peace?  Oh, yes, eternal vigilance.)<br><br>Several reviewers below (male, I think) sound puzzled: what makes Walker seem so attractive to Pearl?  Okay, guys, here's a partial list: Walker Jerome is:  handsome and Aryan-looking (in the 1960s, Jewish girls were still taught that sex was the only thing Christian boys wanted); blond, long-haired and semi-bearded, therefore exotic to Pearl; soft-spoken; polite; gracious; good-humored and smiles easily; listens to Pearl; clearly admires her physically; takes her suggestions and thanks her for them; more relaxed than Marty; a man who seems to genuinely like women; courtly; sensual (watch his hands, and his intensity when he and Pearl finally make love); kind to others (e.g., his resolution of the blouse argument between Lilian and Selma), including kids; helpful (as with Danny's wasp stings -- the irony here! since \"Walker Jerome\" is an incredibly WASPy name, and he's certainly \"stung\" Pearl).  Even Lilian, Marty's mother, displays a certain amount of respect and gratitude toward Walker when his wasp-sting techniques turn out to be better than hers.  In fact, Walker really does embody many Boy Scout virtues.  (No one in this film is obviously given to evil -- though good people can certainly do unhealthy things.)<br><br>\nWalker wants Pearl, but she has to make the first move.  As he gets to know her, his feelings for her grow -- they're mainly visible through his eyes and mouth.  He can't offer her marriage, nor children -- she has the one, and would clearly prefer not to have more kids.  He does offer something new: making love outside, sleeping under the stars, a bodily connection and sensuality she's never known.  But he knows it's Pearl's decision.  Will she remain in her marriage, or not?  If she does, will it be from love -- or from obligation?  If she doesn't, will she come with him out West?  (When he suggests that they take her kids, too, she looks close to melting.)<br><br>Although Pearl feels attracted to Walker from the first time their eyes meet, she does not act on that by phoning to meet him until AFTER:<br><br>--  She asks her husband Marty to request more time off from his boss, so she can be with Marty more this summer at the lake, but Marty refuses even to ask;<br><br>--  She suggests to Marty that they \"experiment\" a little in their lovemaking, but instead of rejoicing in a sexually-interested wife, he asks what's \"wrong with the way we've been doing it\", and then, childlike, dresses up in their son Danny's cowboy hat and pistols;<br><br>--  Alison reveals that her first menstrual period has begun, and then that she has her first date;<br><br>--  Marty calls from New York to say that he can't come up this weekend, he'll be fixing TVs for people who want to watch the Apollo moon walk;<br><br>--  Pearl experiences the really yucky part of being a mom (Alison, told she's not permitted to camp out at Woodstock, screams, \"I hate you!\"), and naturally wants to be perceived as lovable.<br><br>As Marty asks later, was Pearl thinking when she began with Walker?  Was she thinking of anyone but herself?  Probably not.  Yet for her, infidelity is so big, so cataclysmic, that it's the accumulation of little hurts that finally turns her toward Walker.<br><br>Marty finds out from his mother, and the earlier confrontation between Pearl and her mother-in-law is fascinating.  Picking blueberries together, Lilian says to Pearl, \"You're shtupping someone....the blouse man.\"  Yet she doesn't try to dissuade Pearl so much on the simple basis of betrayal, her son Marty's prospective hurt feelings, \"how could you do this to us?\". Instead, she challenges her to act ethically, to be a mensch.  Lilian tells Pearl about Marty's dreams, too, so that Pearl will know she hasn't been alone in setting aside her own desires for Alison and Danny.  It's a wonderful scene, very mature.<br><br>Whether you prefer typical American film conclusions (up) or typical European endings (down), this ending is so bittersweet that, really, you can have it both ways.  Pearl and Marty have passed the crossroads.  Perhaps they're on a new footing, perhaps they'll learn to be more open with each other.  Perhaps not.  But they've begun to recognize the truth of their marriage, and how staying stuck in each of their roles has meant the marriage hasn't grown for a while.<br><br>Ten years from now, in 1979, perhaps they'll regard this summer as a terribly painful time -- that led them to rekindle their love and attention to each other.<br><br>\"Love doesn't just sit there like a stone; it has to be made like bread, re-made all the time, made new.\" -- Ursula LeGuin.","user":"pdianek","rank":[44,53]}]