[{"title":"Hiaasen should slap somebody","rating":5,"date":"4 October 2006","review":"for those of you who don't know (and I'm sure there's a lot of you) Strip Tease was actually a book written by Carl Hiaasen, and a damn good book at that. Brilliant characters, an intriguing storyline, hilarious incidents, sex, violence, the works...<br><br>I gave the movie a 5 because Robert Patrick and Burt Reynolds were absolutely hysterical and on-point (I'm sure THEY actually READ the book), but aside from those two gems this movie was a disgrace.<br><br>What happened to the plot?!? What happened to like half the story?!? What happened to my self respect?!? Why change the ending?!? The story was enthralling and thoroughly enjoyable when I read the book, the movie (breasts considered) not so much..<br><br>There's a gratuitous 3 minute topless dancing scene, followed by 3 minutes of Demi and the little girl crying and being superdramatic. CHOOSE which audience you're marketing this movie towards! Women won't respect a nonsense T&amp;A fest and men don't want to see a bunch of sappy overdramatics when the movie was advertised like a softcore porno flick.<br><br>The fact that a BOOK about strippers was exponentially better than the movie.. that's saying something.<br><br><ul><li>Anonymous Disgrunted Hiaasen Fan</li></ul>","user":"epic_of_mayhem","rank":[35,44]},{"title":"I feel bad for the author.","rating":16,"date":"16 February 1999","review":"I read the book first and I can only say that I feel sorry for its author, Carl Hiassen.  The book was an extremely funny satire of capitalism, politics, gender roles, etc. and the film was just an excuse for the lead actor to show off her surgically enhanced body.  I mentioned the book in a university tutorial for my course on literary satire, and no one would believe me that it was not trash because they could not separate it from the movie which followed it. Too bad - the book is good enough to have warranted a script that stays true to the original story rather than exchange wit and sophistication for extended dance sequences and the lubricatory possibilities of yogurt.","user":"snafooey","rank":[67,89]},{"title":"Good or bad? Funny or ridiculous? Misunderstood satirical masterpiece or...","rating":5,"date":"12 August 2005","review":"...the flop that deserves six of its Razzies and the nomination for Worst Picture of the Decade?<br><br>I think, \"Striptease\" (1996) directed by Andrew Bergman based on the book by Carl Hiaasen, is all of the above - a curious mixture of laughs, satire, absurdism, darkness, silliness, and over-seriousness. The latter comes from Demi Moore who plays Erin Grant, the FBI secretary - losing her job and the custody over her daughter to no good small time crook wheelchairs stealing husband (Robert Patrick looking and acting like a stoned, redneck version of Gary Oldman) and who takes a job as an exotic dancer in the local club \"Eager Beaver\" to earn money for her court appeal. In the club she becomes the hottest attraction and meets many...interesting characters, the most colorful being, of course Congressman David Dilbeck (Burt Reynolds) who \"just loves naked women. It's a character flaw\" and who is absolutely smitten by Erin. Erin also makes friends with a club bouncer, Shad (Ving Rhames) who is perhaps the best thing in the movie - clever, sharp, sarcastic, with the great sense of humor. One scene where Shad tells to Dilbeck's bodyguards that Meryl Streep used to work in \"Eager Beaver\" as an exotic dancer and they seem to believe him is brilliant. If only everything had been as good as he was we would've had a really great movie. What do we have now? Well, Demi Moore looks really good with the minimum clothes on. I mean, the woman was a 33 year old mother of three at the time and her body was marvel to behold. I just think that she was too serious, intense, and solemn doing the striptease numbers  after all it is not only strip it is tease, too. It goes to her acting in the movie in general. Reynolds seemed to have a lot of fun with his sleazy drunk Congressman David Dilbeck, election-day choice of Christian groups and a lot of laughs comes from his mannerism and quotes. There are plenty of laughs, actually, in \"Striptease\" but quite often they seem like the wrong and unintentional type for the movie material. <br><br>Who had the best laugh? I'd guess, Demi Moore did after been paid $12.5 million  one of the highest paychecks for an actress back then.","user":"Galina_movie_fan","rank":[43,57]}]