[{"title":"Refreshing","rating":8,"date":"3 April 1999","review":"An afternoon tea on a warm summer day is still seen by some people as an enjoyable way to rid oneself of the tensions of the day and to allow oneself to slow down and feel at ease. Waking Ned is a sort of afternoon tea for cinemagoers. Nothing really bad happens. There are no really tense moments, or serious threats to life or liberty, for the mostly likeable but roguish characters. That's what makes the film so appealing!!<br><br>There are maybe two characters that quickly lose the audiences sympathy and both get their comeuppance in different ways. One, a truly \"nasty piece of work\", is reminiscent of the wicked witch from The Wizard of Oz ( the parallel should be readily evident to the viewer). This character meets her demise in the most hilarious manner possible for a likeable film such as this.   <br><br>On the whole Waking Ned is a refreshing film that is \"Feel Good\" all the way through without laying on thick layers of mush. No need for the hankies folks but there's plenty of room to toast the villagers' of Tully Moor!!","user":"blade-21","rank":[57,61]},{"title":"Enjoyable quirky comedy","rating":9,"date":"4 April 2004","review":"A quirky comedy that could just as easily have been a TV hit, and to some extent it has that kind of feel. Some fine performances from the cast especially the late Ian Bannen.<br><br>Jackie O'Shea lives in a quiet little village, which is beset by the kind of gossip normal in such communities. When he finds that the lottery has been won by someone in the village, Jackie is obsessed by finding who the winner is. After a lengthy process of elimination, Jackie concludes that his friend Ned must be the winner.<br><br>But noone has seen Ned for days, so Jackie pays him a visit only to find that Ned has died of shock in his armchair in front of the TV when the lottery results were announced.<br><br>Realising that with no heir, Ned's winnings won't be paid out, Jackie persuades his friend Michael to impersonate Ned in order to claim the winnings, but things soon start to get very complicated as they attempt to keep up the facade.....<br><br>\nNot a blockbuster nor a 'split your sides laughing' type comedy (though it has it's moments) but thoroughly enjoyable all the same.","user":"ukcommando","rank":[41,45]},{"title":"A truly wonderfully enjoyable movie that everyone will love!*!","rating":10,"date":"14 February 2006","review":"I loved this film as has everyone in my family! Rarely does a film have such charm, humor, sense of place and wonderful ensemble performances. The spirit of Waking Ned Divine is at once uniquely Irish as it is universal. The joy of entering in to a community that is as insular as we imagine a small remote village to be and has the values of trust and loyalty to each other is completely heart-warming, and those one wishes everyone lived. Each character creates a memorable part of a thoroughly satisfying whole. Waking Ned Divine will be playing forever, but the sooner you see it the more enriched the rest of your life will be. My family and I love sharing art at its' highest level with all those who love and appreciate the same.","user":"StarcomEnt","rank":[14,14]}]