[{"title":"Fond of Fonda","rating":11,"date":"11 December 2000","review":"This movie is great in a number of ways. For a start, it shows Peter Fonda is a truly accomplished screen actor and not merely Henry's son, Jane's brother or Bridget's dad. It is  a pity that he has had so few good roles to play over the years and his acting career has been largely disappointing. However,he totally brings the character of Ulee to life . Ulee is a decent man trying to do the right thing and when you see this film you are behind him all the way, willing him to overcome all the obstacles he encounters.This film, while a mostly straightforward simple tale,lifts the spirits and  is  a direct result of how positive the script is. Peter Fonda should make more films like this or he soon might find himself looking for the few good 'grandfather' roles out there in the movie world.","user":"paul sloan","rank":[20,20]},{"title":"powerful story of family reclamation","rating":8,"date":"10 May 1999","review":"Surely one of the best human dramas of the last few years, Peter Fonda is great as Ulee Jackson, a deeply wounded but incredibly strong man who by sheer strength of will reaches out to drag back together a shattered family. His performance is a masterpiece of understatement;  we can almost physically sense the roiling depths of anger and resentment that lie below his cold, almost imperturbable exterior. The crime subplot never takes precedence over the gripping family drama that is the movie's core. It is wonderful to see the various characters gradually becoming re-integrated into a functioning family; i.e. the daughter's appearing late at night in the work area to help Ulee, whose restrictions up to then she has mightily resented, with his backbreaking work.<br><br>Few have commented on the double entendre of the movie's title. Ulee's \"Gold\" is, on its surface, the honey he works to produce. It is clear, at the film's conclusion, that the \"Gold\" is, in actuality, the family he has brought together again. (I suppose we could have a triple entendre in that it might also refer to the long-lost money that is at the crime subplot's core).","user":"rupie","rank":[21,22]},{"title":"Peter Fonda Finally Lets His Talent Shine","rating":10,"date":"10 October 2000","review":"\"Ulee's Gold\" is a simple little film that is reminiscent of Old Hollywood. Peter Fonda (Oscar-nominated) stars as a bee-keeper in Florida who has lived a somewhat uneventful life.  He's raising his two young grand-daughters because their father is in prison and their mother is nowhere to be found. When Fonda learns from his imprisoned son that his daughter-in-law needs his help, he rescues her from a life which has nearly been ruined by drug-use. Fonda brings her back to live with him, but also learns from his son that two thugs may create trouble because of a score they (the son and thugs) pulled off years earlier.  Now the thugs want the money and Fonda must show emotional strength at his family's darkest hour.  The film is above-average in every aspect, but it is Fonda that makes the film as good as it is. Everyone else is adequate, but this is his show.  The screenplay and direction are just good enough to keep the film above water.  Overall a good film.  4 stars out of 5.","user":"tfrizzell","rank":[13,13]}]