[{"title":"Clever Little Comedy","rating":9,"date":"14 November 2007","review":"It still boggles my mind that this classic working-person's comedy was overlooked at the box office. Unlike today's dumbed-down, unfunny comedy-schlock, Office Space's script was carefully written before the camera began shooting. Based on his Milton shorts, Mike Judge wrote and directed Office Space and did a great job. The film is cleverly written, nicely plotted and paced, and holds interest even after repeated viewings (something I can not say for most comedies).<br><br>Peter (Ron Livingston) and his friends have a permanent case of 'the Mondays.' Stuck in dead end programming jobs in an uncaring corporate environment, with a series of ridiculous, annoying and dysfunctional co-workers, Peter has motivation problems. At the request of his equally aggravating girlfriend, he subjects himself to occupational therapy via hypnotism, but just as he reaches a deep trance state, the hypnotist drops dead, and Peter is left in a state of blissful lack of inhibitions. And as things begin to go wrong, they actually get better - through the films twisted (but oh so truthful) logic.<br><br>Ron Livingston leads a nicely cast group of actors, including an early appearance by the now-famous Jennifer Aniston. Diedrich Bader is especially memorable for his heroic portrayal of Lawrence, the next-door neighbor and guru. And Ron Coleman and Stephen Root are wonderful.<br><br>I have seen Office Space at least ten times, and it, remarkably, does not get old. The recent tendency to dumb-down comedic film exhibits contempt for its own audience. A return to comedies that don't punish people for thinking would make me a fan of the genre, and this would be a great example to draw from.","user":"mstomaso","rank":[77,85]},{"title":"Unique comedy experience. HE-larious!","rating":9,"date":"14 February 2004","review":"Easily one of my favorite comedies, and sort of a source of medicine for the pains of working in an office with complete idiots. Ahh, cubicle life. Anyone who's ever worked in a corporate office can relate to this film on some level, and can probably swear that they know someone exactly like one of the characters depicted here. Mike Judge really captures the aspect that makes office life so miserable, which is without a doubt the characters that you must deal with that your personal life would normally exclude. There is no question that he must've had his own bout with the way of the office bitch, as he shows that he knows it all too well. Out of the comedies I've seen, I can most identify with this one.<br><br>Kudos to the casting department for putting together a unique group of people to portray the perfect characters for the story. Peter, Samir, Michael Bolton, and especially the Milton and Lumbergh characters, are all a true treat to watch and never get old upon reviewings.<br><br>\nA true comedic classic, but probably for more of a niche audience. Having never worked in an office before, you may not enjoy it as much as others...but then again, I could be wrong and is still worth checking out. But if you have or do work in an office, this movie is a must see!<br><br>Office Space has a special place in my heart for others reasons too. Parts of it were filmed within walking distance of my apartment, and my girlfriend lives in Peter's apartments from the movie, which is also right down the street! That just adds even more to the fact that I can identify with this film 100%, especially considering I drive the same way to work as Peter did! Too weird.<br><br>Um, yeah, go see it.","user":"Manthorpe","rank":[217,250]},{"title":"As is sure to be the saying by now, anyone who has ever worked in an office should get a pretty good kick out of this one.","rating":9,"date":"2 April 2001","review":"Every aggravating thing about working in an office, from the traffic on the way to work to that damn copier, is in this movie, and dealt with in ways that we've all wanted to, at some point or another. Well, except for the traffic, of course. The traffic  remains undefeated. Besides telling a highly amusing story about office workers who are just fed up with it all, Office Space is full of other little comments on society, such as the way the film points out the sheer goofiness of geeky white guys who listen to hardcore rap music. The film presents a heavily exaggerated version of the typical office, but underneath that exaggeration, the depiction is very accurate. You have the fairly timid but passive aggressive superior, Bill Lumbergh, portrayed hilariously by Gary Cole, the repressive office cubicles, the mumbly guy that kind of weirds everyone out, and of course, the disillusioned office employee who just doesn't care anymore.<br><br>Ron Livingston fulfills this last role very well, being very open about his dislike of his job and his intentions to do as little as possible for as long as he still gets paid, but it is the weird guy that really gets laughs consistently, whose name, in this case, is Milton. This guy's hilarious situation involves having been laid off years before without knowing because no one told him, because he still receives a paycheck due to a glitch in the payroll system, and whose primary concerns seem to be the location of his cubicle, his red stapler, and the fact that last year, he didn't receive a piece of cake at the office party. The way that this guy's situation gets consistently worse and the way that he is pushed further and further toward the edge of sanity is one of the funniest things about this movie. And we can't forget the Indian guy, Samir, whose grammatically flawed exclamations also provide for an endless source of comedic entertainment.<br><br>Jennifer Aniston plays a small role as Peter Gibbons' (Livingston) love interest, as well as that of a waitress who is also sick and tired of the ridiculousness of her job (such as a specified minimum of pieces of `flair' that employees must wear to work). Ron's home life is another thing that is parodied in this high quality comedy, as the shortcomings of living in an average apartment are clearly and side-splittingly portrayed. Clearly, the office scenes are by far the funniest of the film, and the eventual criminal plot to embezzle a huge sum of money from the company and take up a lifestyle of not really doing anything, despite the fact that it is also very well done, can be largely overlooked because of the sheer hilarity of the rest of the film. This is excellent stuff from the famous creator of the endlessly amusing Beavis &amp; Butt-Head who, with Office Space, has further proved that he is just the type of guy who knows what's funny.","user":"Anonymous_Maxine","rank":[183,214]}]