[{"title":"A classic in my home","rating":11,"date":"11 February 2002","review":"I really enjoyed it, and so did my 3- and 5-year-old (and yes, we read the book). The animation and live-action scenes showed a lot of love. Though elements of the story seemed a bit hurried or neglected, they weren't anything a fairy-tale fantasy couldn't absorb in stride. The music works well enough for this non-fan of musicals, and I prefer serviceable and inoffensive tunes to the treacly jingles and melodramatic scores of the usual Disney classics.<br><br>My only real complaint would be with the ending, as it really is unclear how the aunts drove across the ocean (did they obtain their own crocodile tongues?), and the slice of NY upon landing has a grim, Munchkin-town quality. Still, everything up to that point has left you with lots of goodwill towards the movie's makers.","user":"Dave Wilson","rank":[9,11]},{"title":"A Peach of a Picture","rating":10,"date":"13 January 2005","review":"James and the Giant Peach may not have the cult status of Nightmare Before Christmas, but, aside from mixing live-action bookends with the all-animated center of the film (not a great idea; should have been all-animation), it's a faithful and wonderful adaptation of Roald Dahl's classic dream-like story. The animation is superb, the voice talent wonderful (Susan Sarandon's sexy Eastern European Miss Spider takes the cake), and, as Time Magazine said, the film in many ways surpasses the book. Though there are flaws in the screen story by Karey Kirkpatrick, their effect on the overall emotional ride of the film is negligible. After seeing it again recently (first time in several years), I was amazed at what an incredibly beautiful film it is, beautiful colors and design and effects like teacup clouds and the cloud rhino. I especially loved the mechanical shark and the ships' arctic graveyard sequence where Centipede redeems himself by diving into the water to find a compass to get the peach back on course. Overall, a great film.","user":"slowbob","rank":[24,37]},{"title":"The book is better, but a nice adaption","rating":8,"date":"10 July 1999","review":"As a child James and the Giant Peach was one of my favorite books, so it was interesting to see how it would be formatted into a film.  They actually did a pretty good job, although the book is much better.  The animation was nicely done, and I liked  the way the characters changed from life form to animated form- it gave the film a real surreal type of film.  The songs were quite poor, and were obviously aimed at the kids to 'liven' things up a bit, after all some may say the  story ventures on the dark side of things. It's nice to see a film aimed at children that can also appeal to adults as well, although it does help that many of us are very familiar with Roald Dahl's stories.  In summary quite a good effort.","user":"Meredith-7","rank":[13,19]}]