[{"title":"Sublimely excellent","rating":10,"date":"10 December 2004","review":"After reading some of the reviews that trash this film I had to speak up.<br><br>This film is gritty and dirty. There is content which is not pleasant, swearing and violence amounts other things. What else would you expect a film about drug addiction to be about? Well more than that actually, it about choices and what you Choose! Never at any point did this film make drugs look at all appealing to me in any way, I never did understand why so many people thought that it did. At no point did it ever say \"Look at this, its cool.\" For those who think the level of swearing in this film is too much then they clearly haven't spent any time with working class people in Britain, not just Scotland. I being one of them can say its fairly accurate in that account.<br><br>That being said, those things do not take anything away from the film, the quality of plot and story, or the acting which is Stunning! Robert Carlise as Begbe was excellent, and Ewan MacGregor shined. Also the character Spud was worth a mention he really was quite good.<br><br>This film is in my Opinion a work of Genius, that represents the book accurately.","user":"lucidshard","rank":[372,426]},{"title":"One of the best films of the 1990s.","rating":10,"date":"25 March 2000","review":"In the aftermath of _Pulp Fiction_, much of the filmmaking of the 1990s thrived upon attempts to appear \"edgy\" within the constructs of independent films, or merely to provide empty shock value cliches. And no film ever came close to the sheer cleverness of Tarantino's masterpiece.<br><br>_Trainspotting_, however, somehow manages to take the excesses of the mid-90s and rise far, far above the cinematic cliches that it easily could have become. A film that tackles any hot-button social issue can, and usually does, simply become a didactic propaganda piece. Thankfully, _Trainspotting_ is vastly more intelligent in its edginess and its shock.<br><br>In order to appreciate _Trainspotting_ fully, the viewer must abandon any preconceptions about what defines truly great cinema, because this film defies convention at nearly every turn. And with the rapid pace of its plot, that's quite a bit of ground to cover.<br><br>Though a great deal of the picture's brilliance is derived from director Danny Boyle's consistent rejection of typical cinematic techniques, the most satisfying and _best_ aspect of _Trainspotting_ is that Boyle creates a film that is neither pro-drug or anti-drug. Instead, he maintains a rare objectivity throughout the film, depicting this fascinating array of complex, beautifully acted characters with an honesty that it seldom captured on film. And, given the life that each character lives, it's nearly incomprehensible that a director would refrain from influencing the viewer's impressions in any way, yet that's exactly what Boyle does.<br><br>The dialogue-- or at least what portions of the brogue-drenched dialogue American viewers will be able to comprehend-- is alternately hilarious, raw, and brutal. And Ewan McGregor, Jonny Lee Miller, and Robert Carlyle bring a remarkable compassion and depth to their portrayals of characters that could have easily lapsed into cliche.<br><br>Despite its sheer brilliance, _Trainspotting_ is not a film that's easy to watch. The viewer is bombarded with images that transcend visceral discomfort in their horror-- this movie contains two of the most graphic, horrifying scenes I've ever encountered. But, amazingly, none of these elements is used merely for shock value. Though the viewer will be mortified by some of the things that happen onscreen-- the well-documented dive into Scotland's most vile public toilet, for example-- these scenes all make _perfect sense_ within the context of a masterfully told story.<br><br>In order to notice all of the subtlety that also exists in _Trainspotting_, repeat viewings are necessary, primarily to reduce some of the most powerful shocks ever-so-slightly, though their effects are never lost entirely. Some of the images will likely haunt even the most cynical, jaded viewer for weeks.<br><br>RATING: 10 out of 10. Never patronizing and completely unpretentious, _Trainspotting_ is one of the most daring, unconventional films ever made. It inspires a level of discomfort rivaled by very few movies, because, even at its most graphic, Boyle never insults the viewer with mere shock tactics. Brilliantly acted, directed, and written, with a truly rare objectivity that allows each viewer to interpret its story on his/her own terms.","user":"omophagia-2","rank":[357,426]},{"title":"The Greatest British Movie of All Time","rating":28,"date":"28 February 2004","review":"This film became almost a cultural phenomenon as soon as it was released in Britain in February 1996.<br><br>Adapted from the first (and best) book by Irvine Welsh, the film shows the lives of a group of Edinburgh heroin addicts.<br><br>The film is a black comedy, at times hilarious, tragic, surreal, brutal and uplifting.  The film is full of memorable moments such as the chase down Edinburgh's Princes Street which opens the film (I happened to be there when they were filming that scene) and Ewan McGregor diving down the \"Worst Toilet in Scotland\" headfirst.<br><br>The film doesn't condemn drug addicts, but it is probably more effective then any amount of preachy moralising as it depicts the devastating consequences that can happen to drug users.  <br><br>The film is well acted by a cast who have (mostly) become pretty famous since.  Especially memorable is Robert Carlyle as the violent Begbie.<br><br>I have seen this film many times.  It is an instant classic.  Go check it out.","user":"RobertF87","rank":[274,339]}]