[{"title":"A surprising piece of entertainment.","rating":22,"date":"22 November 2004","review":"I stumbled upon this movie while channel flipping, ironically enough. I thought that the film was very well done, with just enough cheesy humor to keep me groaning and laughing. The jewels of the film were found in it's references and TV jokes. Some humor at actor Ritter's expense gives the impression that movie is making fun of itself. Jeffery Jones plays an excellent role, further showing off the actor's versatility. What the film lacked in plot, it made up for in originality. The highlight of the film is a cartoon segment done by the legendary Chuck Jones, parodying the Tom and Jerry clichés we all grew up with. All in all, a funny if not cheesy film, definitely worth watching.","user":"esotericstyle","rank":[27,28]},{"title":"Yes, The Devil Made Me Watch This!","rating":8,"date":"2 June 2007","review":"This was a clever and funny movie, much better than I anticipated. Most of the humor involves takeoff or parodies of television programs and movies. Being familiar with most of them, I enjoyed the humor. The takeoff involved having the devil take charge of some of these programs.<br><br>John Ritter and Pam Dawber play husband-and-wife \"Roy and Helen Knable\" who get sucked into buying a TV dish package straight from The Devil. After the purchase, which comes complete with 666 channels, mayhem ensues. There were a number of spots in here I just laughed out loud. Knowing a lot of the TV programs that were being spoofed helps a lot, of course, but there is a lot of good material in this film. The special-effects were pretty good, too, especially for a film that really never got a lot of exposure nor, I assume, had a huge budget. <br><br>Jeffrey Jones and Eugene Levy, two guys who are usually pretty funny, supply some good humor here, too. I looked at this strictly for laughs even though I know the devil is somebody to take seriously, but this film was anything but played for seriousness. As a bonus, we even got a Chuck Jones cartoon in the middle of the story.<br><br>This is one wacky movie and I'd like to see it on widescreen DVD. I last saw it on tape. This is recommended to those who enjoy dark humor.","user":"ccthemovieman-1","rank":[22,23]},{"title":"Great movie!","rating":10,"date":"30 August 2003","review":"Stay Tuned is a excellent movie! John Ritter, Pam Dawber, and Eugene Levy was good. Jeffrey Jones performed well. I like how the film was made. The scenes were really cool and the segment of Duane's Underworld was really funny! The wrestling match segment was awesome! George Gray played Mr. Gorgan. He was better known in the old wrestling days (when it was special in My opinion) of the WCW in the early 1990s as The One Man Gang and in the old WWF days in the 1980s as The One Man Gang and \"The African Dream\" Akeem! It was so cool seeing this 6'6, 400 plus pound wrestler because he is one of My all time favorites and also it was good to see Captain Lou Albano! Good music by Bruce Broughton and direction by Peter Hyams! Anyway, there is a whole bunch in the movie and is all I can say is that if you like Ritter, Dawber, Levy, and Jones and want a wild ride of a movie then I suggest you see Stay Tuned!","user":"Movie Nuttball","rank":[13,13]}]