[{"title":"Mark Whalberg: Urban Hit man - Gen X style","rating":7,"date":"23 January 2006","review":"This movie is about a day in the life of a hit man played by actor Mark Whalberg. Melvin (Mark Whalberg) has good life thanks to his talent as a hit man, but has very working class mentality going about his life. But none of the girls he associates with shares his work ethics, but just sees him as a cash cow, and a guy to dump all their troubles on to, until Cisco (Lou Diamond Phillips) kidnaps a Japanese mogul Jiro's (Sab Nishi) daughter Keiko (China Chow) and dumps her on to his lap. Keiko is the first to sympathize with Melvin and hits it off with him.<br><br>There are three stories going on simultaneously in this movie: One with Cisco and his boss Paris (Avery Brooks) who's a friend of Jiro's and wants the guy who kidnapped Keiko dead (not knowing that it's actually Cisco who did it). Second with Melvin's girl friend Pam (Christina Applegate) who's Jewish, and has a mother who is against her marrying this Irish Catholic guy. Third with Melvin and Keiko who's being kept at his house. All three converge at Melvin's house at lunch, and pandemonium breaks loose.<br><br>The story line is one of the most original, and is a feel good movie '90s style where the under dog anti-hero gets the good he deserves in the end. The riot is seeing all the other materialistic people around Melvin all trying to take advantage of him showing how nice of a guy he is despite his choice of profession.<br><br>Was this movie great ? Yes !! And is highly recommended.","user":"ebiros2","rank":[33,37]},{"title":"Ideal party-movie!","rating":8,"date":"3 December 2004","review":"Watch Melvin Smiley's more than complicated life erupt in chaos. His fiancée's parents are coming for a visit, his (other!) girlfriend is to blame that he's kind of out of money, he really ought to return the tape of King Kong Lives... On top of all that, Melvin soon gets problems of an even worse kind. A professional hit-man, Melvin suddenly finds himself in terrible danger of getting killed by his own co-workers when a kidnapping turns out to have been a bad idea.<br><br>It's crazy. Exaggerated, chaotic, full of somehow weird characters, often unrealistic action scenes, fun. I'm surprised this movie is so little known, and I am even more surprised that so many people hate it. Sure, if you expect a serious, realistic action movie, The Big Hit isn't the movie for you. You really need a sense of humour for this. Expect an action comedy, almost a parody, and you'll be entertained for sure.","user":"limette","rank":[25,28]},{"title":"If you think the movie was supposed to be serious, you missed the point...","rating":8,"date":"13 January 2001","review":"I had absolutely no idea that this movie was supposed to be a silly, spoofy action film when I saw it at the theater.  The first 10 minutes makes this perfectly clear.  I thoroughly enjoyed this movie for just being \"guilty pleasure\" escapist entertainment.  Yes the movie is silly and corny - but that was the intent of the film.<br><br>Its more than understandable that this movie isn't for everybody, either you love it or hate it.  However, if you watched the movie and took it seriously (ie the breakdancing during the first 'hit'), then you definitely missed the point.  8 out of 10.","user":"vincea1906","rank":[56,69]}]