[{"title":"Stylish, sexy and fun","rating":14,"date":"14 March 2004","review":"Violet is a gangster's moll, living with Caesar, who launders money for the mob.  Corky is a ex-con who has been hired to decorate the flat next door to Caesar's flat.  When the two meet they slowly begin a love affair behind Caesar's back.  After a while Violet comes up with a plan to steal mob money and frame Caesar for it while she and Corky make off with the cash. However, there is no such thing as a simple plan.<br><br>I saw this when it was released in the cinema where the overall view seemed to be of an enjoyable noir thriller with a lesbian twist.  A few years later, the Matrix has made the Wachowski brothers hotter than hot and everyone is clambering all over Bound and building up it's status and pointing to it as a hint of greatness.  Now, after two poor Matrix sequels, many will come back to this film as a sign of their ability before the dollars became more important.  That's the impression I get anyway, from the message boards, reviews and comments from proper critics.  However, I rewatched this and tried to meet it on it's own terms rather than be coloured.<br><br>Of itself, it does the business quite effectively as a noir crime thriller. The plot is tough and, although not all that twisty, does easily engage and keep the audience pretty gripped.  The lesbian stuff is done a little cynically I think - where do you draw the line between stuff that is required for us to know that the two are lovers, and the stuff that is titillation? I don't know, the film does it all very tastefully and it is not the film's fault that some sections of the audience will come to this film because it has a lesbian love scene in it.  I acknowledge that it was done quite sexily and was part of the film, but the crime is the focus.<br><br>The brothers direct with great style - set mainly in a couple of flats, the film moves slickly around the place.  Some shoot outs do reveal a style that was later used in the Matrix films (albeit on a sci-fi level).  The slow-mo stuff is pretty good here and not overly used - little tricks like the shooting over the white paint added to the style of the film no end. Despite being bogged down in a story I believe they took too seriously, I don't think they need to prove themselves as directors - their films speak for themselves in that regard, and I do hope they get back in the saddle.<br><br>The cast is deep in talent but mostly they play it in the stereotypical characters of the genre.  Tilly is a great moll, at first she appears to be the delicate flower of the film, but she is as much a femme fatale as Corky. Gershon is very sexy, despite being very glamorous for a supposedly butch ex-con; she plays her role well although I would have liked to see her become more of a fall guy towards the end, in true noir fashion - fooled by love!  Pantoliano is enjoyable; his character may not have a lot of meat on it but Joe does very well with a powerful performance.  Support from Meloni and Ryan is good even if they all fit the gangster clichés required by the script.<br><br>Overall this is an enjoyable genre film - no more and no less.  The lesbian stuff is a nice twist on the usual formula but it isn't pushed enough to be classed as exploitative (although there's no doubt that the film gained audience as a result of the love scenes).  The cast are good and the direction is stylish, making for a slickly enjoyable noir.","user":"bob the moo","rank":[64,76]},{"title":"The Wachowski brothers showed their talents long before The Matrix, but hardly anyone noticed because Bound is nearly direct-to-video material.","rating":10,"date":"16 February 2001","review":"Any way you look at it, Bound is a sex thriller. The story is very engaging and the direction is absolutely incredible, but the whole lesbian thing really overshadows all of that, which severely limits the impact that this movie could have had. Gina Gershon stars as a tough woman who falls in love with Jennifer Tilly, who happens to be the girlfriend of a gangster (Joe Pantoliano). The two concoct a scheme to steal $2 million from the mob, and this story is presented very skillfully and interestingly.<br><br>\nIronically enough, you have to look past all of the lesbian action between Tilly and Gershon in order to really experience the skill that this movie is full of. Bound is Larry and Andy Wachowskis' writing and directing debut, proving that they had the skills from the start. The style that made The Matrix so good can be seen in nearly every shot in this film, and this style is probably the best part of the whole movie.<br><br>But the excellent directing wasn't the only thing that made Bound so good. This is an great gangster film, despite a few cheesy or flawed moments. For example, it was a little weird that the mobsters who came to Pantoliano's apartment - suspicious of the murder that had recently taken place which Pantoliano was desperately trying to cover up - didn't see their own bloody footprints on the carpet, or at least feel the blood squishing up through the carpet as they walked on it. But that's okay, because where else can you see $2 million hung up in an apartment on dozens of wires, drying after having blood washed off of it? This is good stuff.<br><br>Gershon and Tilly work perfectly on screen, and not just in the sex scenes. Their unique relationship was made interesting by their skillful acting, which was best when they were beginning to distrust each other. Hey, that's what happens when you put your life into the hands of someone you just met. Gershon, in particular, delivered an excellent performance, flawlessly bringing out her masculine side to play the strong role in her relationship with Tilly. There is something to be said about a sex thriller that is as good and as engaging as Bound, because they never really are any good, you know? Don't be put off by this element of the film, because Bound is a trashy movie that definitely deserves your attention.","user":"Anonymous_Maxine","rank":[56,66]},{"title":"Perfect Noir Film- loved it!","rating":10,"date":"29 January 2006","review":"Late last night I caught 'BOUND'on the Independent Film Channel, and am still thinking about this film, shot in Red, White, and Black which further underlined the noir nature. Gina Gerson and Joe Pantoliano were memorable, as was everyone else- even the two policemen who come to check things out, having received a call about gunshots having been overheard. Clever, funny, occasionally sexy, but it hold your attention as the story unfolds and introduces many story lines. Unfortunately I am NOT a fan of Jennifer Tilly- her voice is like fingernails on a blackboard to me- but she was perfect for this role.<br><br>The final scene was perfect, and I didn't see it coming, which always pleases me. Check it out- you'll be glad you did.","user":"BobbiCrow","rank":[48,57]}]