[{"title":"Good film I enjoyed!","rating":7,"date":"22 February 2020","review":"This film has one of the better opening scenes of any action film. The banter back and forth between Smith and Lawrence is priceless not only at the beginning but throughout the whole film. Michael Bay loves to saturate his action films with comedy and having real comedians deliver the punchlines actually works, however, compared to forcing others to try it out like in Transformers or Armageddon. The action is great in this one as well as the script. Entertaining film all around.","user":"MR_Heraclius","rank":[40,44]},{"title":"Michael Bay: The Next Big Thing","rating":24,"date":"24 February 1999","review":"I had no high hopes when I walked into this film.  I like Will Smith, I like Martin Lawrence, so I figured this film will at least be funny.  And it was funny, and then some.  It was action packed, thrilling and a helluva good time.  I came out of the theatre thinking that the guy who directed that movie is going to be huge.<br><br>Michael Bay, former music video and commercial director, has made an incredible directorial debut.  The film never stops.  When it isn't action-packed, it is funny.  It is sexy, fun and always moving.  Christian Wagner's editing is phenomenal.  I love action movies that really try to be action movies.  A lot of action films know that they are action films so they try to incorporate other genres to make the film more complete, but they often fail miserably.  They try so hard to be something they are not that they forget what they are in the first place. The essence of the action film is the action. It is a necessary component, it needs to be there otherwise it loses its edge. \"Bad Boys\" doesn't just throw in the occassional action sequence to meet the expectations of the genre, but instead uses the action to help tell the story.  It is this use of filmmaking that allows an action film to remain an action film and still go beyond.<br><br>Watch \"Bad Boys\" again and every time there is an action sequence, ask yourself why that was there and what did it accomplish.  You will find that each sequence took the film to another level; it introduced an new conflict, it increased the present conflict, it eliminated a key character, it introduced a new character, and so on.  There are a lot of action films out there that sacrifice story for spectacle, and the audience notices this.  At the centre of all films lies the story and if it comes to a halt so does the interest of the viewers.<br><br>\"Bad Boys\" of course isn't the greatest story on film, or even in the action genre, but what is so appealing and memorable about \"Bad Boys\" is that it is just as entertaining with its story as it is with its action by combining the two without sacrificing either.  Michael Bay understands the importance of the story within the structure of the film.  He tells a visual story, entertaining and complete, and leaves you very satisfied. Watch for Michael Bay because he is here to stay.","user":"Casa2000","rank":[69,82]},{"title":"Pretty entertaining buddy comedy","rating":7,"date":"25 July 2004","review":"The 'buddy comedy' genre is fairly well-known, there have been plenty of them, all of them primarily based on the basic idea of having two main characters who are, well, buddies; they act like friends to each other, they get in fights, they help each other out, they compliment each other. It's a fairly easy genre to master, and an easy way to make a good movie. This is one of the best examples, since Smith and Lawrence really do compliment each other so well; Smith's the sleek, cool one who is popular with the ladies, while Lawrence is often nervous, and pretty much a direct opposite of Smith. They have pretty good on-screen chemistry, too; you believe that these are good friends and partners. My only real problem with the film is the way the comedy almost all is generated by stereotypes, and, worse, the age-old complications that arise from certain situations. I think that's a little unoriginal, but, hey, that's the only complaint about it, and the film does have some very entertaining comedy parts. The plot is pretty good, it keeps the film going and supplies every single scene with comedy, action, or both. It takes off immediately, and keeps a good pace throughout the 2 hour duration. The acting is all pretty good. The characters are well-written, well, for stereotypes at least(because, lets face it; they are). The comedy is well-done and often made me laugh out loud, and, believe me, I am not, in any way, shape or form, a Will Smith fan. The action was well-done too, intense and exciting. The film, all in all, was pretty good, very entertaining. For a buddy comedy, it's good. For an action comedy, it's good too. I recommend it to all fans of action comedies, and buddy comedies. 7/10","user":"TBJCSKCNRRQTreviews","rank":[45,65]}]