[{"title":"A great combination of suspense, psychology and politics.","rating":10,"date":"24 July 2006","review":"Death and the Maiden is a thriller. A woman who had been tortured in a repressive government meets a man who has been her torturer, or has he? <br><br>It is also a psychological film. A married couple deals with uncovering the whole truth about their past.<br><br>And it is political. Although it is supposed to be a fictional story, it has more than a strong resemblance with the brutal tortures during Pinochet's dictatorship in Chile. It is not filmed in that country, but they use Chilean money, they eat Chilean bread and they mention Tavelli, a popular café in Santiago. <br><br>Beautiful music. Schubert's Death and the Maiden, is played throughout the movie.<br><br>A great film to view with people who enjoy having discussions after.<br><br>Enjoy!","user":"patitas","rank":[17,17]},{"title":"Brilliant dark character study","rating":9,"date":"23 June 2005","review":"When it comes to dark and morbid thrillers, there's no one around that can handle them like Roman Polanski does. It is with that in mind, therefore, that I say Polanski is the best man for the job of adapting Ariel Dorfman's stage play; 'Death and the Maiden'. He proves this with the resulting movie, which is a thrill ride, combined with a character study all wrapped up in a layer of morbidity; needless to say, the film really hits home. Polanski handles this story, and his actors with the utmost precision and I have no qualms with labelling this movie as one of the man's masterpieces. I have no idea quite why it hasn't been better received, as although it's not up there with the likes of Knife in the Water, Chinatown and Rosemary's Baby; this is Polanski doing what Polanski does best, and when he's at his best; the man is brilliant. The story follows a chance encounter between a political lawyer and his neighbour, whom the man's wife is certain, is the same man who brutally beat and raped her while blindfolded under the reign of a fascist regime. What follows is a three-way character study between the victim, the man she thinks is her oppressor, and her husband; who is caught in the middle.<br><br>The themes of truth and justice are rampant in this tale and as we watch to see if the villain of the piece really is the man who oversaw torture in the oppression, we are always reminded of the idea of the difference between a right and just punishment, and otherwise. As this is based on a stage play, it is the actors that are very much the star of the show. The three-pronged cast makes for a great ensemble, and every single one of them impresses. Sigourney Weaver gives determination and anger to her victim, and it is easy to believe that this woman really was tortured and beaten. Stuart Wilson is great also as the man caught in the middle of a horrible situation, but it is Ben Kingsley that provides the real standout performance. He manages to skilfully tread a line between an evil madman and a pathetic innocent victim brilliantly, and he ensures that at all times we are asking the question \"did he?\". Polanski's direction is superb, and the thing that most impressed me is the way that he firmly positions the tale in the middle of nowhere. This ensures no distraction, and makes sure that we are put firmly within our character's plight.<br><br>On the whole, this is one of the best films that Polanski ever made. Considering his prowess as a filmmaker; that is really saying something and I wouldn't hesitate to recommend this film to anyone who enjoys movies.","user":"The_Void","rank":[71,80]},{"title":"Suspenseful, psychological thriller","rating":10,"date":"3 April 2005","review":"In this movie, Sigourney Weaver is thoroughly believable with her trademark edge, rarely seen in other women actors. The doctor, although obviously with selfish motives, kept me guessing until the end as to whether he was guilty of the crimes of torture she claimed he committed against her, having not seen the face of, but only having heard the voice of the man she remembered. You don't know the truth until the end. It is very riveting. Her relationship with her husband is very realistic, as well, and very revealing about both of their characters. All three roles were depicted as intensely real. I enjoyed this thriller from the moment it began to the very end. You are immediately engaged in her reality, rather than experiencing a slow build up seen with most movies. Very satisfying because no character was one-sided, but they were multi-dimensional, with each having a unique history. Bravo!","user":"cshipley10","rank":[49,56]}]