[{"title":"Resident Evil","rating":7,"date":"6 March 2020","review":"Exactly the right movie at exactly the right time. The music and atmosphere, the sets and costume design, the special effects, the cast. Everything lined up perfectly for a young shaggy. That kid was a gothy nerd with love for video-games, horror, industrial music and Mila Jovovich. This movie managed to check all the boxes. Watching it now, it still pretty much holds up. Maybe a little cheesy but stylish and entertaining. 6 stars for watchability, one for nostalgia.","user":"MR_Heraclius","rank":[42,53]},{"title":"Good survival horror","rating":8,"date":"16 January 2005","review":"I had to sift long and deep for a good comment on this. Why all the hostility? I think there was great chemistry on this production and it shows; the actors and crew involved loved the game and had a good time making this. This movie successfully recreated the feel of the game, and because it kept exposition to a minimum of what you needed to know for this particular story and didn't borrow from or revise any of the original characters or settings, it supported and strengthened the franchise. No story is retold here, no words are wasted, the setting, feel and pace is familiar to fans of Resident Evil and yet it's perfectly accessible to those unfamiliar with the broader storyline. Not giving the fan-boys their favorite characters was a good choice since characters tend to get mangled in adaptation, and yet the fan-boys still complain. With this film you have a good, watchable story that can partake of the Resident Evil cosmology, showing it due respect.<br><br>It did an excellent job establishing characters without too much unnecessary background, developing them just enough to make you want to know what they'll do next, to make you care before the sudden and gruesome happens to them. The acting was above par for a Resident Evil, certainly much better than the first game. The plot was no more comic bookish than any of the games. My one complaint was that the characters were too battle-trained, too slick, too good at fighting for them to be sympathetic horror subjects. This could've been balanced out with more reaction shots showing the soldiers wetting themselves. But Alice's over-the-top commando-style action made her too much of a super heroine to really make anyone concerned about her survival; characters made of Teflon make good action but apathetic horror subjects.","user":"enkephalin07","rank":[170,237]},{"title":"Solid!!","rating":9,"date":"29 November 2007","review":"As a big fan of splatter and horror films i was gladly surprised when i watched this. I haven't played the game so i had no idea what to expect and had nothing to compare with. I really feel that this pays homage to the old zombie films at least to an extent. The zombies here are a little bit faster though.<br><br>It begins with a nice back story and then builds slowly in pace to a climactic frenzy. The effects are top notch, solid directing, a really imaginative and eerie production design and great acting.<br><br>Yes, i may be a little biased but i really like Milla Jovovich. I think this is the kind of role that fits her best, strong kick ass attitude with an odd personality wrapped in a seemingly fragile shell. Her performance here reminds me a bit of the character she played in \"The fifth element\" and also the character in the later \"Ultraviolet\" The other actors did a good job as well so she's not the only one to get credit although the movie revolves around her character. The child AI is a very nice and creepy addition to the atmosphere.<br><br>The RE theme could have ended up as a nice trilogy but the sequel unfortunately lacks nearly everything(except Milla) that this film delivers. Not that RE2 is a complete mess but nowhere near this. I haven't seen the third installment yet but even if that one holds true in quality to this one number two becomes the odd one out.<br><br>If you like zombie and action films you'll certainly like this one.","user":"teslaman","rank":[70,97]}]