[{"title":"A burglar may be less of a crook than a politician","rating":7,"date":"27 December 2006","review":"Some actors, upon reaching their sixties or seventies, retire. Some enter into a sort of semi-retirement whereby they continue to accept cameo parts but not leading roles. Some, however, try and revisit the triumphs of their youth by making the same sort of films that they were making twenty or thirty years earlier. There are too many examples to list them all, but I was less than enthusiastic to note that Sylvester Stallone, at the age of sixty, has just made his sixth \"Rocky\" film and is currently working on his fourth \"Rambo\".<br><br>Clint Eastwood is a rare example of a star who managed to remain a leading man throughout his seventh and into his eighth decade, but did so without a desperate attempt to put the clock back. (Doubtless his status as a director and producer has given him a greater influence inside the industry than many of his contemporaries). In his early sixties he made \"Unforgiven\", one of the all-time great Westerns, in which he starred as an ageing gunfighter, and since then has made a number of other films, such as \"The Bridges of Madison County\" and \"Million Dollar Baby\", in which an older man takes centre stage. Occasionally his roles have contained elements of an old man's wishful thinking, such as his romance with Rene Russo in \"In the Line of Fire\", but even in that film his character's age was important to the plot.<br><br>\"Absolute Power\", made when Eastwood was sixty-seven, is another older man's film. His character, Luther Whitney, is a veteran burglar who has broken into the Washington mansion of an elderly millionaire named Walter Sullivan, where, from his hiding-place, he inadvertently witnesses a killing. Sullivan's young wife Christy enters the bedroom with her lover, who is none other than the President, Allen Richmond. What starts out as a consensual love-making session goes wrong when Richmond, clearly a lover of rough sex, starts slapping Christy. She takes exception to this and slaps him back. Things get out of hand, and she attempts to stab him with a letter-opener. Richmond calls for help and his Secret Service bodyguards burst into the room and open fire, killing Christy.<br><br>Some reviewers have described Christy's killing as \"murder\", but legally this is not correct. Had the two bodyguards ever stood trial for murder, they would have been acquitted as they were only carrying out their duty to protect the President's life, but things never get that far. Richmond is too shocked to take any action, but his Chief of Staff Gloria Russell, realising that if the truth ever came out it would destroy his career, organises a cover-up. When the President's staff realise that Luther was a witness to the killing, he is forced to go on the run.<br><br>This could have been the plot of a very mundane political thriller, but Eastwood, both as actor and director, is able to lift it above that level. Despite Luther's criminal tendencies, Eastwood is able to make him a sympathetic figure, a man with his own sense of decency and honour. He had the assistance of a very strong cast, featuring some of Hollywood's most accomplished actors. There is E.G. Marshall in his last feature film as Sullivan, Gene Hackman (always a very watchable villain) as the hypocritical Richmond, Judy Davis as Gloria and Ed Harris as the police chief who is investigating Christy's death and soon comes to realise that there is more to it than meets the eye. A particularly important role is played by the very talented Laura Linney as Luther's daughter Kate. She has become estranged from her father as she disapproves of his criminal lifestyle and now works as a criminal lawyer, prosecuting on behalf of the police. When she realises that her father is in danger, however, she comes to his assistance, and they start to rebuild their relationship.<br><br>The idea that their President might be a philanderer would have come as no surprise to most Americans in the mid-nineties, even though this film came out just before President Clinton was caught up in the Monica Lewinsky affair. Eastwood was not, however, interested in doing something along the lines of \"Primary Colors\" or \"Wag the Dog\"; there is no attempt to make Richmond a disguised portrait of Clinton, and we do not even learn if he is a Democrat or Republican. \"Absolute Power\" is intended as a thriller, not a satirical comedy. Nevertheless, it does tap into the feeling that many Americans have had, ever since the Watergate affair, that their Presidents cannot always be trusted to tell the truth. It is significant that the hero of this film is a burglar by trade; the implication is that such a man may be less of a crook than a politician. 7/10","user":"JamesHitchcock","rank":[47,51]},{"title":"Corrupts absolutely","rating":8,"date":"15 June 2000","review":"Absolute Power may not be an overly special film but it was the first movie I saw in the cinema after leaving high school. I was certainly not the target audience but it had my attention from the first scene and maintained the suspense for the during of the running time, even if it doesn't build to much.<br><br>Clint Eastwood plays Luther Whitney, an expert thief who targets billionaire industrialist Walter Sullivan (grouchy old EG Marshall, in his last theatrical movie) while he is off on vacation. While in the midst of cleaning out the vault the President of the United States (Gene Hackman) enters the room with Sullivan's wife. Whitney hides in the vault, which has a two-way mirror, and witnesses the President get a little too rough with the woman, which ends in her fighting him off and being murdered by the secret service. The Chief of Staff concocts a plan to cover up the murder not knowing that Whitney is watching the whole thing. As the group leave he escapes, taking a crucial piece of evidence with him.<br><br>Initially unsure what to do, Whitney decides to taunt the President, though it's not clear what his complete plan is or even if he's just free-forming. If one should fault Absolute Power for any reason it's that it establishes a lot of plot and potential but never really does anything with it and ends with an anti-climactic cop-out.<br><br>Where it succeeds is with the small cast of characters who really make the dialogue and relationships work. Ed Harris as the confused but dedicated cop investigating the case, Laura Linney as Whitney's resentful daughter, and the austere Scott Glenn as the self-doubting agent make every scene effortless even when there's not much happening.<br><br>Adapted from (and streamlined and improved in the process) the bloated novel by David Baldacci (I call them 'Airport novels' – those 600-page bricks with generic covers featuring nothing but the title and author in giant gold letters in a tacky font) the screenplay makes many changes but they are all for the better. Eastwood's direction is slow and steady – or 'mature'. The pace and framing is the antidote for anyone bored to tears with the nauseating aesthetic of today's comic-book movies and CGI nightmares.<br><br>A curious thing about the beginning of the movie is that Clint Eastwood only has 2 lines of dialogue for the entire 35 minutes. I don't understand why he didn't cut them out and remain silent, which would give the film a peculiar edge.","user":"CuriosityKilledShawn","rank":[51,60]},{"title":"An enjoyable Clint Eastwood","rating":6,"date":"14 January 2006","review":"Washington DC -1990s. Luther Whitney, reputed one the very best thieves of the country but supposedly retired, is in the process of executing his greatest robbery the private vault of a powerful billionaire, Walter Sullivan. But he is disturbed by the billionaire's young wife. Christy takes advantage of her husband's absence to receive her lover the US President himself. President Richmond is a sick pervert, and the love affair turns sour. In front of hidden Whitney, the lady is murdered. Before escaping, Whitney secures the murder weapon, but he will need all his experience and skills to manipulate the secret services and the very competent police investigator Seth Frank. Not only must he protect himself but also his estranged daughter Kate. Not to worry however Luther Whitney is Clint Eastwood, after all! And since the suspense in this respect is minimal, we can just relax and enjoy watching one of our coolest supermen smoothly make his way through a nicely structured scenario. Although the action itself is ageless, one sign definitely links the movie to the 90s the blatant lack of respect for the person of the US President and the undisguised criticism of political corruption. Maybe a way to exorcise the scandals that have been plaguing the White House over the last decades","user":"imichelet","rank":[13,14]}]