[{"title":"Reading these comments is as interesting as watching the film","rating":3,"date":"3 February 2003","review":"One of the joys of seeing \"foreign\" films is catching a glimpse into  other cultures. What do other people consider funny? Ordinary?  Terrifying? \"Cure\" puts a Japanese spin on an idea that several  American directors have touched on: that evil is something that can  afflict perfectly ordinary people. David Lynch's \"Twin Peaks\"  television series explored a similar idea to Kurosawa's: ordinary  people afflicted with evil, rather than evil people, as such.  The difference between Lynch and Kurosawa is that Lynch saw evil as  some sort of independent force, whereas Kurosawa sees evil more as an  idea. \"Cure\" presents us with a world in which words and ideas are a  kind of virus that passes from person to person, leaving destruction in  its wake. A carrier who doesn't fall ill himself, but who infects  others with murderous instincts.  For this reason, some of the comments here surprised me. Frequent  complaints about how elliptical the film is, and how the characters  need to be better defined. In particular, several complaints that the  film never explained who the drifter was or where he came from.  Surprising, because that, to me, was the point: he was nobody special.  He didn't come from anywhere special. Viewers brought up on a diet of  American cinema will find \"Cure\" frustrating: American thrillers always  explain who the killer is, why he kills, and, most importantly, why he  is different from you and me. This last point is to comfort the  audience, to let them know that they could never be like the killer,  that they are outside the drama, watching. Kurosawa presses the  opposite point: this could be you; there is nothing special about these  men. You should not be convinced that you are different from them.  I will admit that if you dislike slowly-paced cinema, a la Tarkovsky,  or if you don't buy the hypnotism \"mumbo-jumbo\" on which the film is  based, then you will probably find \"Cure\" tiresome. I enjoy Tarkovsky,  and I found that it wasn't a lot of work to suspend disbelief on the  point of hypnotism. Finally, this film is an intellectual thriller;  it's more frightening for its implications than for what actually goes  on. The point is not to scare you and then wrap it all up neatly at the  end (like most American thrillers), but instead to show you a possible  world and then scare you after you leave the cinema with thoughts of  what might follow.  Check out the interview at  http://www.reel.com/reel.asp?node=features/interviews/kurosawa as well.","user":"BusterB","rank":[88,96]},{"title":"Remarkable Craft","rating":10,"date":"15 January 2002","review":"This movie has a simple premise and a simple story that is nevertheless explored in an incredibly delicate and talented way. Kiyoshi Kurosawa is an extremely talented individual and perhaps the only writer/director who is able to simultaneously scare and mentally challenge me at the same time (note that very few are capable of doing one or the other). Although the writing is very good (story and dialogue), Kurosawa's real strength is his ability to represent visually the progressive denouement of his story. He rather subtly show you and let your imagination and intellect figure it out for you than to spell out bluntly what the straightforward storyline should be. It does not, however, get to the point of chaotic untidiness or pointlessness, for he is able to guide you slowly along the way (I would then say that he is slightly easier to follow than David Lynch is, but then again who is not). He uses here a strikingly effective technique where he shows you a room from one angle and later lets you discover that room more and more as the movie advances. His camera shots are always well planned and he is thus able to draw you in the movie bit by bit-quite an eerie sensation.<br><br>The acting is generally good and believable. The camera-work is a stand out.<br><br>There are many scenes where you will be able to appreciate this superior artistic and technical quality. The music is good and tenseful, but it is sparse and what is used instead is a contrast of minimalist and grossly amplified everyday sounds that vibrate through the movie. When there is no sound, you often find yourself holding your breath. This is not used strictly as a ploy, but rather creates a mood and further pulls you in the general atmosphere of the movie. Most of all, again, the directing is top notch. The pace which is slow enough for you to have the time to both think and be afraid is not slow enough that it gets boring, although you should not expect a North American expeditious run through the film. Everything is there, but it comes to you in slow, meticulously chosen dosage. Only, at the end can you truly see the masterpiece that has been drawn stroke by stroke in front of you.<br><br>One of the reason this movie actually works is that it is designed to play with your mind and trigger fear and reaction based not only on emotion, but on reason. People are dying, but everything is calm, rational. The tone and story are pretty much realistic and, at the end of the experience, you may feel beyond your volitional control that you are actually convinced of the \"strange\" things in the movie. Hopefully this feeling will subside...","user":"christian94","rank":[42,46]},{"title":"Possibly the spookiest movie I have ever seen.","rating":9,"date":"20 March 2003","review":"The only time I can recall being as spooked by a film was when my parents took me to see \"Hangover Square\" - a gothic Jack the Ripper thriller - when I was 8 years old. I guess they couldn't find a baby-sitter. That took me about a year to get over, a low-key, all-too-realistic chiller about the banality of insanity. <br><br>\"Cure\" is such a perfect depiction of madness that just about every shot could be framed &amp; hung in a gallery. You can't analyze this one, it doesn't follow a cartesian line of logic; nor does it blast you with halloweenish surprises in the style of Elm Street &amp; its knock-offs. This has far deeper &amp; subtler impact. I found as I relaxed into this film that images of recurring dreams &amp; nightmares I've had since childhood arose &amp; blended into what I was watching. Can't get much creepier than that. <br><br>That said, the images &amp; emotions that this film evokes are on a very high level of poetic art. One of the most impressive elements of \"Cure\" is the director's ability to convey the magnetic manipulative appeal of Mamiya - surely one of the scariest things in real life &amp; very difficult to convincingly convey on screen.","user":"inframan","rank":[50,57]}]