[{"title":"There's more to martial arts cinema than arthouse self-indulgence or slapstick comedy","rating":10,"date":"16 July 2002","review":"Watched this again as an antidote to \"The One\". Jet Li's done some good films, some TERRIBLE films, and then again  he's done a few genuine epics, like the Once upon a time in China series. These films are also among the best work of Tsui Hark.<br><br>The modern Wong Fei-Hung series contains elements of humour without being just broad slapstick (if you want kung fu comedy, rent a Jackie Chan film), but are mostly films about a troubled China where traditional values are being overwhelmed by Western style and influence. Iron-Robe Yim's line \"you can't fight bullets with kung fu\" resonates achingly with the failed boxer rebellion, during which chi-gung practitioners mistakenly believed they were protected from foreign guns.<br><br>Wong Fei-Hung's struggle to find an honourable, peaceful path through the collision between cultures should strike a chord with anyone who has moved on from chop-socky and realises that a kung fu movie can feature a great story as well as great cinematography.","user":"Fox in Socks","rank":[34,39]},{"title":"Not Exactly A Classic but Brilliant Nonetheless","rating":5,"date":"5 March 2008","review":"Jet Li's done some exceptional work in China. I have not been impressed by anything he did in America. Tsui Hark's 'Wong Fei Hung' has already been stretched into several sequels of which I have only seen the first. 'Wong Fei Hung' has all the ingredients to make it an enjoyable epic movie. There is a story with a heart, some very well crafted choreography, good acting, and enough action and culture. It's set on a historical backdrop of a pre-Communist China. The characters are very well written (with the exception of the non-Chinese who act like caricature villains). Jet Li, Biao Yuen, Rosamund Kwan, Jacky Cheung and Kent Cheng all act well. It also presents some taboo elements such as Wong's affection for his 'aunt' (it was taboo during the time) but this is all skillfully underused which prevents the film from appearing too preachy. The film has several layers but it tries to tackle too many things at once and becomes unnecessarily complicated at some point. The film slightly drags in the first half and the choreography of the action scenes without the main cast looked a little shoddy. Yet, the characters are very likable and the story also offers a lot to enjoy that I am looking forward to its sequels. In my humble opinion, it's certainly one of the better martial arts films and has a lot more substance than pretentious films like 'Crouching Tiger Hidden Dragon'. the only other Tsui Hark film I've seen is the magnificent 'Chat gim' and I've liked what I've seen so far.","user":"Chrysanthepop","rank":[15,17]},{"title":"Great martial film, too ambitious with all its intended messages","rating":9,"date":"26 July 2005","review":"This movie, directed by Tsui Hark, embodied some of the best Kong-fu fight sequences to be found anywhere in the entire genre. Not only were the fights choreographed with amazing skill and dexterity, there was also supreme creativity and use of forces at work here. The angle placement of the camera was always effective and the fight scenes between the hero and his enemies are set up with admirable presence and dignity. Furthermore, the editing was bold and crisp; for the most part everything flowed very well from one scene to the next. Jet Li was unparalleled in his martial arts glamour. His stern demeanor accentuated his role as a leader and a man of principle.<br><br>Jet Li played Wong Feihong, a doctor who also happened to be renowned for his skill in martial arts. Against his will, he became involved in combating the local gang, whose rivalry and antagonism was set up by a flimsy pretext. (Apparently gang violence usually are created over the most trifle of instances) On the one hand, Feihong, had to deal with the local thugs, on the other, he had to deal with government officials and foreign mercenaries.<br><br>Along for the ride were some touching characters playing Wong Feihong's students, the stuttering Western-educated nerd and the formidably huge pork merchant. The addition of Aunt 13 to the cast added shy romance, providing a nice contrast to all the fighting and constant strife and chaos.<br><br>The movie featured a convincing historical backdrop and captured the national Chinese character well, at least, the 19th century, pre-Communist era. The music score was very nicely done and complemented the film well. At times, the movie evoked as much emotion as the characters themselves.<br><br>The only problem with this film may be its overly ambitious goals of trying to tackle everything at once. There was the sentiment of saving China from \"foreign devils\" as well as the sentiment that China was rotting and corrupt at its core, with the Chinese betraying the Chinese. There was also the strong sense of there being too few good men like Wong Feihong, with a strong desire to do right by his country. Over all, the movie's message was multi-layered and complex and can be confusing to the unschooled audience.<br><br>Still, this movie, made in 1991, showed off Jet Li's lyrical martial arts grace in full glory and in its best moments, takes fighting to a transcendent level.","user":"aimayli","rank":[18,22]}]