[{"title":"Lots of Fun, and Tuneful Too!","rating":9,"date":"5 December 2002","review":"Waaaaaaaaaaaay back in the early 1990's, when Jeffrey Katzenberg was still a top exec at Disney, he had one of his less successful ideas -- to bring back the break-into-song musical.  So, as the story goes, he selected three scripts that were about to go into production and gave them to Disney Music Maestro Alan Menken and asked him which of the scripts could be turned into a musical.<br><br>And that's how NEWSIES was born.<br><br>It's a great story, too, being a fictionalized account of the newsboy strike in New York at the turn of the century.  It follows the exploits of a ragtag band of teenage boys, including Cowboy (Christian Bale), who dreams of becoming a ranch hand in Santa Fe, and David &amp; Les (David Moscow &amp; Luke Edwards), brothers who take up selling newspapers when their father is injured on the job.<br><br>Conflict arises when Joseph Pulitzer (Robert Duval) gets greedy and raises the price of his newspapers to the newsboys, but not to the public.  The outraged \"newsies\" decide to go on strike, which eventually galvanizes all the working children in the city to stand up for themselves.<br><br>It's a fun film, with Duval playing his villain to the hilt, but Ann-Margret is wasted in her role as a showgirl (both of her musical numbers are badly edited down to just snippets of song).  Bale is the real wonder here, though, singing and dancing with surprising aplomb.  The songs overall are quite good, but a couple of them are hard to distinguish from each other. My favorites are the opening number, \"Carrying the Banner,\" and the rousing \"The World Will Know.\"  It seems odd, though, that Duval doesn't get a musical number of his own, considering in Disney's animated musicals the villains usually get the best songs (\"Poor Unfortunate Souls\" or \"Be Prepared\" anyone?).<br><br>It's a shame that the film didn't do better financially, since as a result of its dismal box office Disney declined to ever make another like it. First time director Kenny Ortega, who also choreographed (he was known for his choreography of DIRTY DANCING), directed one more feature after this, the underrated Bette Midler flick HOCUS POCUS; since that film also failed to find an audience, he hasn't directed a movie since.  And that's a shame; he has a  very distinctive kinetic style that served both films well.<br><br>Seek out a copy of NEWSIES, and go for the widescreen version.  You won't be disappointed!","user":"kalel6868","rank":[52,57]},{"title":"Movie that never gets old!","rating":10,"date":"27 March 2005","review":"When I first watched this movie, I was just 3 years old.. My mom tells me that my little brother and I used to dance and jump off couches and try to spin around on the ceiling fan, and sing, when we watched this movie... <br><br>Recently, it was being mentioned to me for suggestions for our school chorus.. I began to look things up about the movie, and all of a sudden, had an urge to go out and buy it the next day. I've had the movie for a week, and have already watched it 6 times. <br><br>Around 12 or 13 years later, the movie still has me wanting to dance and sing along... This is a movie that never gets old, no matter what your age.","user":"fearfalls","rank":[47,55]},{"title":"Excellent Movie","rating":10,"date":"5 August 2004","review":"This is a fantastic movie for people of all ages. It has historical information presented in a fun, and exciting way that keeps viewers entertained throughout. It is a brilliant musical filled with catchy tunes by Academy Award Winner Alan Menken, that wrote songs for The Little Mermaid and Beauty and the Beast, that keep you humming and singing even after the movie is over. Great dialogue between characters and fantastic dance sequences. The Newsies is filled with a incredibly talented cast, including Christian Bale, Robert Duvall, Gabriel Damon, Max Casella, Aaron Lohr, Ann-Margaret, David Moscow, and much more. Overall, a very entertaining movie, highly recommended for everyone!!!","user":"vampireslayer277-1","rank":[35,43]}]