[{"title":"The Miraculous Imagination","rating":7,"date":"13 August 2010","review":"Miraculous Virgin is about the imagination, the escape it brings while it lives and the death it brings once it is physically manifested. Near the beginning of the film, Tristan, the painter, asks how he can portray emptiness. Uher answers his question by showing that the entity of emptiness can only be depicted through the acts of filling and emptying. We see a great vault of a room suddenly empty of people as bomb sirens sound and then refill as police enter to remove Tristan. We see a ladder descend to fill the space of a cellar. But most important of all, Uher spins a story of a mysterious girl, Anabella, filling the empty minds of the city's male inhabitants.<br><br>I think you have to consider the possibility that Anabella may just be the figment of the imagination, albeit a sort of collective imagination. The psychoanalyst calls her his libido, and for the other characters too, she represents a great internalized and creative force. Her relationship with Raven, the sculptor, is perhaps the most revealing. Raven creates plaster masks from the faces of dead women. He wants to create a mask of Anabella, but she has to be dead first. She may not literally die, but when her mask is made, it seems to signal the death of the imaginative essence that she represents. Once the imagination is manifested and shared, it loses its purity, its virginity. In sharing his imagination, the artist has sullied it in pandering to the desires of an audience. In an earlier scene, we see Anabella and the poet in his room. They imagine his mother approving her as his bride. It is fanciful and pure. Later, we see him caressing the mask. The scene is dirty and obscene. His mother actually is there, and she doesn't approve. Anabella's no longer a virgin. He calls her a slut and destroys the mask. As a lion, Raven speaks as to how he doesn't want to devour Anabella, but the opposite. Yet in projecting her he allows others to do the devouring.<br><br>And if the imagination reveals emptiness, what does it say about the time and place? The film could be read as one of many works that deal with the struggle against censorship and the desire to express something purely without compromising its value to the artist. Raven is commissioned to create a sculptor of a politician. He wishes to honor the land and people that he loves. But his commissioners don't envision the sculpture as he does. They only see art as a means of furthering their own power. Beware of the holy whore.","user":"Funchaleuse","rank":[20,20]}]