[{"title":"Yes, same plot, but it still gets the same laughs as the first one did if not more","rating":10,"date":"23 November 2003","review":"Now I'm aware that Home Alone 2: Lost in New York is the exact same plot as the first Home Alone, and not to mention how silly it seems that these folks would leave their kid behind, but come on, this movie was all in good fun. It still has me constantly laughing 'till this day, I think if you loved the first Home Alone, I'm sure that you'll just naturally love this one as well. Not too many folks are just giving it a good chance. I mean, the Wet Bandants are back and they are just as funny as ever! I think this house that Kevin set up was actually in some ways a little more fun than the first because of the traps he was able to set. Not to mention the Plaza Hotel plot was so great and fun to watch.<br><br>Kevin and his family are heading down to Florida for Christmas this year, but when Kevin gets mixed up at the air port and gets on the wrong flight, he ends up in New York. Instead of complaining or panicking, he just plain enjoys it. He goes on the ultimate tour with his father's bag of money and credit cards and cons himself into the Plaza Hotel claiming he's there with his dad. But the Wet Bandants who have now re-named themselves as the Sticky Bandants are in New York as well and are planning on stealing all the money from a toy store that is going to be given to the children's hospital. But Kevin is going to make sure that they don't mess around with the kids and has set his uncle's abandoned apartment up for a fun house of traps.<br><br>Home Alone 2: Lost in New York was an absolute blast. The reason I'm giving it a ten is because I think the rating should be higher. People really need to give this movie a shot. My favorite scene is without a doubt when Marv gets hit in the face with the bricks, also, the scene where the Plaza Hotel managers are asked by Kevin's mom \"What kind of idiots do you have working here?!\"... the lady just smiles and says \"The finest in New York!\", it was just too funny! I love this movie and I'm always going to recommend it for a good watch, I think you'll enjoy it if you give it a chance.<br><br>10/10","user":"Smells_Like_Cheese","rank":[165,180]},{"title":"I knew it was you, I could SMELL ya getting' off the elevata","rating":9,"date":"7 May 2004","review":"Too many sequels suffer from Deja Vu, and hardly any of those carbon copies improve upon the original. Home Alone 2 is a carbon copy, but it's also much better and more complex a movie than the first. In another mad rush to the airport the McCallisters make a point of remembering Kevin this time, but he gets lost in a crowd at the airport and follows a man who looks like his dad onto the wrong plane. Thirteen of the McCallisters are going to Miami for Xmas (do they never stay at home?) but Kevin is headed for the Big Apple, and he's going to have that once-in-a-lifetime vacation he's been wishing for.<br><br>There's much more for Kevin to see and do in New York. He scams his way into the Plaza hotel where a suspicious Concierge (Tim Curry) gives him mighty evil looks at every encounter. He goes to Duncan's Toy Chest, the biggest toy store in town and takes many scenic photographs. Though it is a little unnerving now seeing Kevin on the roof of the World Trade Centre.<br><br>But the Wet Bandits have escaped, and they have just arrived in New York with loftier ambitions and bigger heists to pull off. They even brush by Kevin a few times not knowing he's there. Typically though, once they get a hold of him the give away far too much info. Once Kevin escapes he takes matters into his own hands once more. His Aunt Georgette from the first movie is still in Paris so he uses her half-renovated home as a huge mousetrap for the bungling burglars.<br><br>The booby traps this time are much more painful and nasty, so it's all the more amusing for us. Who can possibly fail to laugh at Marv getting the shock of his life when he tries to turn on the taps? If the movie were to be released now I doubt if it would be let away with a PG rating. Still, it's nothing for any parents to worry about. Unless you fear your child is going to set your head on fire with a blowtorch.<br><br>Home Alone 2 has a more satisfying climax than the first. The film doesn't simply end once Harry and Marv are back in the slammer as there is more plot to it than that. Brenda Fricker has a (rather questionable) role as 'The Pigeon Lady' a woman who lives in Central Park and talks to no one-until Kevin reaches out. Plus Eddie Bracken shows up as Mr. Duncan and gives Kevin the best Christmas morning ever as a token of his appreciation.<br><br>With a bigger story (okay, some of it re-used) and more characters and a better playground for Kevin, Home Alone 2 manages to be a superior sequel. While not excessively so. There's loads of fun to be had in Kevin's antics, and Tim Curry is downright brilliant as the mischievous Concierge.<br><br>It's a great movie on it's own but sadly it will always be called a copycat. Watch it now from a fresh perspective and you might like it more.","user":"CuriosityKilledShawn","rank":[93,111]},{"title":"The cuteness ends here","rating":9,"date":"23 September 2008","review":"This should have been the end of the Home Alone series, seeing that the same premise and cast were used for two films but, naturally, Hollywood just can't resist trying to squeeze more money from a proved formula. I'm not one for sequels but this was one of the handful that I can enjoy time and again, not only because the original cast is in it, but because of Macaulay Culkin's comedic ability (even as a kid) and Joe Pesci's and Daniel Stern's reactions to getting their butts kicked, booby trap style. Kevin is not forgotten (like he was last time) but hops the wrong plane after he puts fresh batteries in the family camera right before he gets to the gate at the airport (his family had all the bad luck with high winds knocking out the electric - and the alarm clock - twice). He mistakes a man with the same coat as his father and after Kevin reassures a flight attendant he's on the right plane, takes his seat ... in a plane heading in the exact opposite direction the rest of his family is going (naturally, no one realizes Kevin's missing until they're in Miami and he's in NY). Who could have thought a vacant New York brownstone could be so much fun? Sure, Pesci's and Stern's characters are more banged up this time but, hey, they started it. (The adventures in the Plaza Hotel are hilarious, as well.) Anyway, this is one sequel worth the time to watch. Just don't bother with the irrelevant, contrived, and unncessary third installment of the series.","user":"Jasper76","rank":[41,48]}]