[{"title":"A Very Important Movie","rating":10,"date":"11 June 2008","review":"As a proud White American I must say that this movie is a powerful structure that requires a tremendous amount of understanding for another culture while swallowing a little pride of my own.<br><br>For those who think this movie is racist only proves that more movies like this one need to be made. You can't tell a race of people to just move forward if they are not sure where they come from. You can't just say, \"Slavery is over! Now go out and be successful,\" without understanding the conditioning slavery left behind. Economically and internally. Not to mention when African Americans try to reconnect with their past they are constantly bombarded by some of the same Whites who at times, seem a little bit too concerned with keeping this connection at bay, as if it were a threat of some sort. Meanwhile our toddlers are at school learning about their distant past great leaders like Caesar. Thus, encouraging them to be great leaders. While the black toddlers are learning about slavery and their minor, more modern American accomplishments like the creation of peanut butter or the civil rights movement, making their steps of stride smaller, surviving from day to day, check to check, with hopes of purchasing an apartment or a car as a major accomplishment.<br><br>Why are we afraid for African Americans to learn they're history? Is it because there were some Black leaders greater than Whites. Is it because most of our history might be tainted with a lot of lies and cover up? If we Whites really want to be Equal (and not just announce it all the time) then we will encourage more Blacks to become one with their distant past. And if it puts some of Europeans most powerful parts in history to the background then so what? We didn't have a problem when we where in the forefront, so why would it matter now if we're in the background? If we truly aren't racist, it shouldn't matter at all. One thing Hollywood and our school system shows us is that Europeans have done great things. But not all great things. And maybe, not even the greatest. But that in itself proposes a powerful question. What if Africans have done greater things, would we be willing to accept that? The truth is, we all know we won't. Does the psychological scar of racism really cuts that deep?","user":"ebolaisafraid","rank":[13,17]},{"title":"Just Ahead Of Its Time!!","rating":8,"date":"8 May 2006","review":"I believe this film was made w/ its creators knowing that it would be shot down by various \"types\" of people who'll just simply refuse to look at it objectively. In my opinion, it is a \"must see\" for everyone aimed particularly at the Black bourgeois. I like the fact that not only does the DROP Squad address the problems of Blacks self-exploiting racial stereotypes for personal financial gain, it also questions the tactics that must be enacted to solve these problems. The aim of the DROP Squad is very provocative but I especially like the human aspect whereas the \"Rocky\" character debates w/ \"XB\" and \"Garvey\" on how to deal w/ the captive individuals to be \"dropped.\" Rocky has a more diplomatic approach that seems to have been more effective back in earlier times around when the group was founded. Seemingly as time has passed and the situation has evolved to crazier proportions, XB and Garvey have resorted to more drastic tactics in order to \"get their attention first.\" I believe what many people fail to realize is that this picture is asking the question \"Which, if any, of these methods are more appropriate to addressing this problem?\" The tone of the film gets \"crazier\" as time moves on and the problem gets worse, thus developing the drama where the Squad questions itself altogether. Whether you like this movie or not, you've got to admit that it serves its purpose and that's to \"incite dialogue\" and not racism.","user":"gurochuck","rank":[9,12]},{"title":"a better Bamboozled","rating":8,"date":"20 November 2000","review":"Having just seen Bamboozled, this movie came to mind.  Comparing the two, I think this one was more effective.  The similarities are striking.  In both movies, there are blacks that made it in the establishment, one as an advertisement professional and in the other as a television writer producer. And in both roles, they are enmeshed in producing something for the black audience.  The advertisement professional is soon black listed by his family for having made television advertisements that use stereotypes such as fried chickens and malt liquor, and other parodies of which the family relatives are ashamed and hint of an Al Sharpton's \"genocide\".  The television production in Bamboozled is protested by Al Sharpton (playing himself). The sponsors of the televion series show ads of fashion clothing, malt liquor (\"The Bomb\").  While Bamboozled ends in violence, Drop Squad ends with the uppity black returning to his true self, reminded of his own \"blackness\". In Bamboozled, reflecting the interested by white teenagers in Hip Hop, one member of the rap group is white and is the only survivor of a police shootout (\"why me? why me? kill me too!\"), and in the followers of the television series is a \"Sicilian Nigger\", an italo-american that covered his face with blackface and wants to act \"black\".  Or is it \"blak\", since we don't need the \"C\", as one of the rapsters suggests.","user":"camel-9","rank":[9,13]}]