[{"title":"Beautifully done!","rating":10,"date":"30 November 1999","review":"How often are we forced to endure the uninsightful changes that are made to American classics in the process of turning them into feature films?  The 1939 version of this movie is a prime example.  It, very simply, was not the story that Steinbeck wrote.  The changes that were made were too sweeping to be seen as anything other than some ego thinking that Steinbeck could be improved upon.<br><br>Now, anyone who is truly familiar with Steinbeck knows that this is just not true.  Gary Sinise has proven this familiarity.  I have rarely had the pleasure of watching a movie that stayed so completely true to the original text.  Not only does this movie not add or subtract from the book, the characters themselves are almost exactly how I had pictured them when I read this story for the first time.<br><br>If you are looking for overblown sex and violence, for spectacular special effects, or for unbelievable demonstrations raw physical strength, move on. This movie will not interest you in the slightest.  However, if you are looking for a story of true love and true courage, if you are looking for a movie whose beauty stems from a raw sense of humanity, then find yourself a quiet place, where you won't be interrupted and watch this.  You won't be let down.","user":"tesscat","rank":[132,142]},{"title":"This one will touch you...","rating":21,"date":"21 January 2002","review":"This is a masterful and faithful portrayal of Steinbeck's classic novel. The screenplay brings to life the tragic yet uplifting story of loyalty and the kind of bond that can grow between men that we are often reluctant to acknowledge, much less show.<br><br>Aside from the story, the cast is what really makes this film.  I have always held a soft spot for Gary Sinise after his role in Forrest Gump, wherein his character portrayed another facet of the bonding between men made brothers by cruel circumstance, yet can grow and flourish as the years and other circumstances come to pass.  Here, as Lenny's friend and protector against a world that baffles and confuses him, he shows the kind of rough-edged tenderness and affection that both endears us to his plight, and fills us with the dread of what we know must come between the men.  John Malkovich shows his depth as an actor by bringing to life the dull-witted but pure-hearted Lenny, in a way that will tug at your heartstrings.  I found myself both laughing (in a sad way) at Lenny's ineptness in dealing with a world clearly more confusing than his limited wits can manage, and crying over his being targeted for taunting and abuse by cruel and crude men, and ultimately done in by his brute strength when it was lacking the direction and temper given by his friend George.<br><br>A pleasant surprise was Ray Walston as the aged but gentle and good-hearted ranch hand Candy, who has no one in life to love but his old sheepdog, who, like him, he knows, must ultimately be \"put down\" because of age and the wear and tear that a life of hard labor has worn down.  The scene of his finally surrendering his faithful canine companion to be euthanized by a gunshot to the back of the head by another well-meaning field hand is very heartbreaking.  Having grown up with the \"Uncle Martin\" of \"My Favorite Martian\" Walston, seeing his adept performance in a dramatic role gave me a new appreciation for his versatility as a character actor.<br><br>Those who watch this film should allow plenty of time alone to view it straight through with no interruptions.  Swallow your pride and keep a box of tissues handy, and some time afterwards for quiet contemplation and \"recovery\".","user":"joseph t","rank":[57,60]},{"title":"Tell me about the rabbits, George...","rating":9,"date":"25 March 2000","review":"I put off watching this movie for many years. I figured, what was the point? I had read the book \"Of Mice and Men\", watched earlier movie versions and seen it performed on stage. Why sit through yet another version? Finally one day at the video rental store I decided to take a chance and rent it. I am very, very glad I did.<br><br>So why sit through another version? Because it is extremely well done. Gary Sinise and John Malkovich are powerful in the leads, Sherilyn Fenn has never been more appealing and Ray Walston will break your heart.<br><br>This is just plain good storytelling and good movie making. I guess like Lennie never getting tired of hearing George talk about the rabbits, I'll never get tired of seeing a good version of this classic story.","user":"Junker-2","rank":[97,107]}]