[{"title":"A gorgeous film.","rating":10,"date":"17 November 2003","review":"A three hour film about death. It doesn't sound like much when you say it like that, but trust me, Meet Joe Black is an outstanding film and is without doubt one of the most underrated little gems I have ever seen. The film is beautiful in every regards; the photography, the sets, the music and the performances, especially the performances. The last time Anthony Hopkins and Brad Pitt were on screen together it was the equally sublime Legends of the Fall, here it is another sublime film and once again they are putting in some of their best work. The characters that they play, Bill Parrish and Death, bring out a fantastic chemistry between the two performers, especially in the more comedic moments when they two are getting to know each other. However, while death is the main theme of the film, director Martin Brest remembers to filter optimism into his wonderful tale in the shape of a love story between Parrish's daughter (played by the beautiful Claire Forlani) and Death himself. This results in one of the most gorgeous coupling in recent years as well as one of the most erotically intense love scenes I have ever watched.<br><br>Director Brest presents the film in a more artistically filtered view than most other directors might have done. The love scene is done without nudity with close ups on the actors throughout. The striking presentation of the lighting in the film is also fantastic, with a lovely golden glow pouring of the screen and lastly Thomas Newman's music is quite simply marvelous. Films like The Green Mile, The Shawshank Redemption and American Beauty which have featured music by this outstanding composer have been enhanced by the haunting, lyrical and moving melodies he has composed and this film is no exception. The mixture of piano and orchestra builds to an uplifting and emotional pull that cements his position as one of the best music composers working in modern film today.<br><br>The three hour running time would appears to be problematic, but alas it is not. In fact like another sweeping romantic epic, Titanic, you will not feel the time going in. The three hours fly by and not only that, like the Oscar winning epic, this is a film that makes one instantly want to re-watch it again and again. Meet Joe Black is a wonderful mixture of comedy, romance and drama and is done exceedingly well. Brad Pitt puts in one of his finest performances as Death finds himself enchanted by human emotions and then finds himself making a deeply human choice at the end of the film and then there is Hopkins. One of cinema's finest actors no matter what he is in, he shows with his complex range of emotions in his performance there is more to him  than playing Hannibal Lecter. His performance here restrained and quite frankly very well done. It is perhaps one of his best acting performances. His Shakespeare background obviously coming in handy for a film that contains many a Shakespearean like moment.<br><br>The film, while not a flop, was not the box office hit that was expected, especially considering the main casting, but if you can make up your own mind, do watch Meet Joe Black. This is a wonderful film and is a personal favorite of mine.","user":"eamon-hennedy","rank":[488,544]},{"title":"A powerful movie about not taking life for granted","rating":9,"date":"12 July 1999","review":"It's easy to wake up every day and see what is wrong with your life. Everyone has their vices and their shortcomings. Whether you are a billionaire with a perfect spouse, a cottage, a beach house, nice cars and wonderful parents or if you are a single parent struggling to get by on measly paycheck, we can all find something that is wrong with life. Such is human nature. But what can we do to remedy that situation. What can we do to try and ensure that our life gets better? And is it all really that bad? Meet Joe Black is a movie that asks us to look at ourselves and realize that this life is a gift and one that perhaps is taken for granted a little too much. Meet Joe Black asks us to ask ourselves: is it really all that bad?<br><br>Anthony Hopkins plays Bill. Bill is a very successful business man but it is his time. We all have to die one day, it is a part of life. And this is Bill's time. But before he goes, the Grim Reaper pays him a visit and offers him time. That is all. Just time. And in exchange Bill will show Death what it is like to be alive. A bit of an oxymoron for sure but true nonetheless. And what happens when Death starts to learn about what makes our life so precious is really something that has to be seen. Because what we take for granted, he sees as innocent and pure and magical. For instance, peanut butter. Joe Black tastes it and decides that it is the most amazing food that he has ever had in his short existence. And when people are eating their caviar at dinner, he refrains and has more peanut butter. This scene is one of the purest and most honest scenes in the film. Not for what is on the outside, but what it means, what it wants us to see. To me this scene is the microcosm of what the film and what life should be about.<br><br>Life is a gift. There are so many wonderful things that we have as human beings that we seem to forget what they are. We are so consumed with other things that at the time seem important but when you look at them closely they are trivial and it's the little things in life that bring us so much joy. Like peanut butter, aka tossing the ball around with your kids, aka. being lazy in the shade with your Collie. The point is that life is serious enough and it isn't until others are gone that we fully comprehend that.<br><br>Brad Pitt is perfect, absolutely perfect as Joe Black. He conveys the innocent wonder and pure joy of discovering human elements like the aforementioned peanut butter and more serious issues like falling in love.<br><br>Meet Joe Black has been criticized for its length but like all movies that are three hours plus, there is a reason for that. And that is because it has something to say. Something important to say. Meet Joe Black wants us to look at this film and then look at our lives and realize that there is a lot to live for. You just have to get through all the mist and cloudiness and you'll find it again. There is an innocence about how this movie feels and it is such a wonderful picture. It makes you feel good. Good to be in love ( if you are ) good to want to be in love ( if you are not already) and good to be alive.<br><br>See this film. It will make you glad that you did. I know I was and my life doesn't seem so bad right now even though there are many things that I could complain about like...... Ah hell, what's the point. Life can only get better. Meet Joe Black helped me see that.","user":"baumer","rank":[362,413]},{"title":"A Truly Enchanting Movie!","rating":11,"date":"11 December 2002","review":"Meet Joe Black is a beautiful film with a talented cast.  Because it is unique, the plot enables humor to be weaved within the dramatic and romantic elements.  The music, composed by Thomas Newman (Shawshank Redemption, Erin Brokovich) truly enhances the movie.  The many string and piano melodies are beautiful, and fit smoothly. There are so many memorable moments, like father-daughter conversations, and the scene in the coffee shop. Brad Pitt, in his portrayal of Death,displays naive and vulnerable feelings, skillfully in sharp contrast his behavior at the beginning of the film.  While some criticize its length and unrealistic aspects of the plot, I found it to be so captivating and quite well-made.  Meet Joe Black has an indescribable effect on me whenever I watch it. The story of Death being apprentice to a respected, accomplished man makes one realize the simple beauties of life-- passion, family, love... and peanut butter.","user":"PoorSlobWithoutAName","rank":[260,298]}]