[{"title":"Outstanding, realistic crime film","rating":8,"date":"30 January 2002","review":"This is a really good film, one of the most realistic films about drugs and the criminal underworld I've ever seen. The film examines a week in the life of a mid-level drug dealer on the streets of Copenhagen and pulls no punches.  Kim Bodina gives a great, nuanced performance as Frank, the dealer and main character.  He captures perfectly the snaky charisma, emotional detachment and nihilism of a street dealer.  Frank is essentially a sociopath, turning on the charm when it suits him and turning a blind eye on the people in his life when they can't be of any use to him.  Especially effective is the portrayal of Frank's relationship with Vic, the high priced call girl he obviously cares about but can't bring himself to get physical with because of his emotional coldness.  Frank blames this dilemma on her work, suggesting he can't touch her because she's a whore.  However it's Vic he always turns to when things go bad.<br><br>And things go very bad very quickly for Frank.  Through a series of miscalculations and bad luck, he finds himself indebted to a slimy dealer higher on the food chain who's patronizing attitude barely conceals a violent streak.  As the week progresses, Frank spirals downward into a desperate attempt to fix his broken life.  Trusts are broken, violence and mayhem ensue, and the film finishes on a surprising but perfect note.<br><br>The director, Nicolas Winding Refn, shows a good command of pacing and camera work.  The real star of the film, however is the script.  There is never a moment of Pusher that doesn't seem utterly real.  Though many may find this film dark and depressing (I won't argue), I think it's strong acting and excellent direction make it well worth seeing.","user":"snake77","rank":[60,67]},{"title":"\"You've got no chance! Grab it!\" Yes, I love it and its personal!","rating":10,"date":"12 April 2005","review":"Wow, I've just watched it. Probably, it'd be better to just lay back, think about the movie and, only after cooling down on emotions, review it.<br><br>But not this one.<br><br>\"Pusher\" tells us the story of, perhaps, the worst week of Frank's life, a 'middleweight' dealer caught in an unpayable debt to pay to Eastern European type mafia. And as his story unfolds, your blood pressure will rise just like the incredible tension increasing throughout the movie. No wonder, the debt grows higher and higher every day. Will Frank be able to ever repay it? Its just like the tag-line says:<br><br>\"You've got no chance! Grab it!\" <br><br>The fresh thing about this movie is that it shows what is actually happening somewhere in the middle of the 'food-chain' of drug dealing. Not at the top, covered by movies such as Casino, Scarface, Blow, or any other high budget movie made in Hollywood. After all Copenhagen is just not a world of amazing luxury and incredible piles of coke here and there. But the movie doesn't follow another cliché' either. It doesn't show us the bottom, where junkies scavenge on each other, sell their mothers for a gram of heroin, a topic which is usually covered by some low-budget off-movies.<br><br>Pusher is the ultimate, pure, refined truth about drug dealing. I have a personal experience, myself being for a time an immigrant into Denmark (I've never been a criminal or ever wanted to be, though, just to clarify that matter). And some guys, that I've came across upon coming here, went into this businesses and well, they all hit rock bottom. OK, the movie is hard to get into with its dramatic realism, but I assure you: this movie is as close to coarse truth and gritty reality as it gets!","user":"OriginalPirate","rank":[77,91]},{"title":"MEAN STREETS, Danish style","rating":15,"date":"15 June 2006","review":"PUSHER (Nicolas Winding Refn - Denmark 1996)<br><br>A genuinely original and completely fresh take on the gangster genre by first time Danish director Nicolas Winding Refn, giving us an insight in the live of Frankie, a lowlife Copenhagen drug-pusher. The film follows his day-to-day pusher-routine during a crucial week in his life but in this particular week things go wrong, as he sets up a heroine deal with a former mate of him, that goes completely bust because the police was informed. He is arrested but is released soon. Problem is, he lost the drugs AND a lot of money and now owes big time to one of the most dangerous criminals in town, a Balkan low-life Yugoslav mafia type, named Milo. Now he desperately tries to find money to repay him in what is very likely to be the last week of his life.<br><br>There must have been some buzz about this movie when it came out in 1996, but it completely passed me by. Luckily I managed to catch up at the 2006 International Film Festival Rotterdam when hordes of people were attending a screening of the complete Pusher-trilogy ( a bit too much for me at the time, it was sold out anyway). At the same time, Nicolas Winding Refn, was giving an intriguing interview for quite a huge crowd. He had a very dry sense of humor and a scene from MEAN STREETS by Martin Scorsese was shown as his main inspiration for this film, so it stuck with me and I simply had to see it for myself.<br><br>A tense, exciting storyline, executed in a raw almost documentary-like fashion with a hand-held camera, this film grabs you by the collar and never lets go once it's gets going. Not for the squeamish though, as the sometimes very violent and intense confrontations come very unexpected. Kim Bodnia, who was equally outstanding in NATTEVAGTEN (1994) is exceptionally good. His character, Frank, doesn't invoke much sympathy, but somehow he manages to make his character very much alive and even touching at times. The rest of the cast is equally good with some truly extraordinary performances.<br><br>Camera Obscura --- 9/10","user":"Camera-Obscura","rank":[31,35]}]