[{"title":"sad memories","rating":9,"date":"8 September 2001","review":"One of the reasons I love this film is the song 'always there' where littlefoot sings a verse about his mother. That has NEVER happened before or since this movie was made and it brought a tear to my eye.<br><br>The other songs are fun, the art brightly coloured and it's action packed...What more could a fan want?<br><br>Well better voices for one. Chomper and littlefoot both sound like they have a cold. ahh well I can't be too picky.<br><br>Kids and long time fans will love it.<br><br>oh and chomper comes back too.","user":"cyberbat","rank":[7,8]},{"title":"Land Before Time Luver","rating":9,"date":"20 October 2007","review":"I am a HUGE fan of the land before time series i started watching them when I was around 6 or 7. This movie is a very good one that goes by 2 titles. This one and The Journey To Big Water. Even though this is a very good movie I believe that number #6 is better. It is me all time favorite. Any ways this movie is awesome and I would watch it over and over again. Its AWESOME ! ! ! The Land before time series is an amazing series.It is awesome especially for kids all ages.it tells about a mysterious land again. Which no one really knows about. And Dinosaurs every child is fascinated by dinosaurs.The songs are also magical on any movie you watch from number one to the very newest one. They all take you on a magical journey of your own.","user":"brianelarayne","rank":[3,3]},{"title":"A weirdly good LBT","rating":7,"date":"29 December 2007","review":"This is a good LBT, not the best, but certainly is up ahead of quite a few of the others. One weird thing about this LBT: This was directed by Charles Grosvenor and (except for LBT7) all of his later ones did not have as much action, heart, kindness or plot and story as this. Yes, some of his other ones are good as well and yes, they do have action, heart, kindness, plot and story, but not in the same way as this one. The animation in this is also similar to the films before that and it is luckily good quality LBT animation as well.?<br><br>The plot is also very interesting, gripping and a little bit more heartwrenching than a lot of other LBTs (even more so than some of the ones before Charles Grosvenor). The first ten minutes or so is very gripping and exciting, showing a swarm of \"evil\" locusts ridding the great valley of all green. The film goes on, everyone in the valley has to leave to find more food in the dreaded mysterious beyond. The children (Littlefoot, Cera, Ducky, Petrie and Spike), go along with this. As the film goes on we see much betrayal, hard work, teamwork and hope. These feelings are expressed in a different way than a lot of the other LBTs and hopefully this will give pleasure to all who watch it (except for those who think that there should be no LBT sequels, however good they are).? ? So, enjoy \"Land Before Time V: The Mysterious Island\". :-)?<br><br>7 and a half out of ten.","user":"Mightyzebra","rank":[5,6]}]