[{"title":"\"Got a light?\"","rating":30,"date":"30 August 1999","review":"I know, I know. \"The Rookie\" is a critically lambasted action film, and from what I've read from the other IMDb users, it's considered one of the worst films since \"Ishtar\"! But, I'll cut \"The Rookie\" some slack, because I happen to enjoy this flick pretty much. Yeah, the dialogue is a bit crappy, especially by Pepe Serna's lines; he jitters while he talks most of the length of time of the movie!<br><br>Well anyway, I thought it is a pretty enjoyable cop drama, due to the funny chemistry between Eastwood and Sheen, who do great Mel Gibson/Danny Glover impressions. The action is intense, and the suspense is quite strong, too. \"The Rookie\" delivers the goods for fans of the action genre, but for those who want a more logical movie, avoid \"The Rookie\".","user":"crewcut6","rank":[44,53]},{"title":"Will likely disappoint action and/or Eastwood fans","rating":21,"date":"21 August 2010","review":"It's clear that upon watching \"The Rookie\" that Clint Eastwood's heart simply was not with this project - either as a director or an actor. Possibly he only decided to do this \"commercial\" project so that Warner Brothers would green-light the less commercial \"White Hunter Black Heart\" that came out the same year. Whatever the reason, Eastwood seems to be going on autopilot in front of and behind the camera. His performance here lacks conviction, and he comes across as a cranky old man instead of a man with grit and determination. And as a director, he slips up multiple times. The action sequences are dull when they should be spectacular - the freeway chase, for example, is flat despite all the vehicles that get destroyed. The night scenes and often the interior scenes are dark and murky, making it hard to see all the details about what's going on.<br><br>And what's the deal with the dream sequence at the opening of the movie? In fact, there are a number of script boo-boos that make me surprised that Eastwood didn't demand a rewrite. Why doesn't Eastwood call for backup at the opening action sequence? Why is Raul Julia's past and motives never properly spelled out, and why is Eastwood so determined to bust him? Why do Eastwood and Sheen hardly have any real conversations between them instead of clichéd \"tough cop\" talk? Also, the slow-moving story at times feels like the writers were writing it as the movie was being shot, instead of using a finished screenplay. It might also explain why key actions and scenes seem to be missing from the finished product.<br><br>What really annoyed me most about \"The Rookie\" was all the swearing. Don't get me wrong - I use the same words in my private life, and I have seen movies I've enjoyed with plenty of swearing. But here, every curse word comes across as forced, as if a child was making this movie and gleefully adding naughty language in an effort to appear tough. It's simply not convincing. Maybe with better direction and a heavily rewritten script, it could have worked. Those things probably would have greatly improved the rest of the movie as well.","user":"Wizard-8","rank":[12,15]},{"title":"nothing we've never seen before, but still fun","rating":7,"date":"9 April 2003","review":"This movie is a very standard cop buddy action film.  A veteran cop is assigned to work with a rookie cop to catch a crook who killed the vet's old partner.  This is so standard of action film's but that doesnt matter, its still good mindless fun.  I though the action was good in this film, especially the opening car chase, and I thought Eastwood gave s good performance and was even funny at times.  I am not a big Charlie Sheen fan but I thought he was ok in this one, and Raul Julia was solid as the bad guy.  3.5/5.  Recommended, even though its like so many action film's its very enjoyable.","user":"shakey_jake53","rank":[26,37]}]