[{"title":"As much happening behind the lens as in front ....","rating":9,"date":"6 November 2013","review":"Yes, I know the critics at the time panned it. But if that was the baseline for greatness, films like Wonderful Life and Citizen Kane would be lost to obscurity. Bottom line, this is a \"high concept\" film that is much more entertaining than you would guess. The timeline is fascinating. In the 1960s, after a half-century run, and massive exposure on the new medium called Television, the classic western started to disappear. But, as they say, nature abhors a vacuum; and at the same time the sun started to set on the traditional western, it started to rise on something called the \"italian westerns\" or re-imaginings of the genre from Europe. This is for example how Clint Eastwood went from forgotten TV actor (Rawhide) to #1 box office attraction. This new genre lasted barely 15 years or so and soon disappeared as well. Yet out of nowhere, 20 years later someone in Tinseltown gets the idea to re-imagine the ALREADY RE-IMAGINED western, this time starring a female. Sharon Stone was past the apex of her career by this point, making the project more of a challenge. The other talent was awesome. A pre-Oscar Russell Crowe, a pre-Titanic diCaprio, and all backstopped by Hackman, I mean, wow. The big question, did it actually work? Answer yes. It was uneven in parts and an argument could be made that Hackman overdid the \"bad guy\" role or, alternatively, the part was over-written. Stone was awesome, proving she had the chops to take on a bizarre role and make it hers. Actually gets better with each successive viewing.","user":"A_Different_Drummer","rank":[26,29]},{"title":"Splatter Western","rating":3,"date":"3 June 2002","review":"\"The Quick and the Dead\" is a \"splatter Western,\" directed by horror vet Sam Raimi (whose latest, as of this writing, is \"Spider-Man,\" but who cut his teeth on the \"Evil Dead\" trilogy).  It's set in the oh-so-ironically named lawless town of Redemption, a haven of grotesques that gives us an idea what the wild West would've looked like if had been painted, not by Frederic Remington, but by Heironymus Bosch.  <br><br>In a surfeit of Biblical nomenclature, the town's mayor/owner/capo is named Herod (Gene Hackman at his oiliest, complete with bad hair).  Into town there rides a mysterious stranger, not Clint Eastwood this time but Sharon Stone.  I'm not the world's biggest Stone fan, but this movie and \"Total Recall\" indicate that she has her uses in kick-butt action roles that make no demands on her limited thespianic skills.  As gunslinger Ellen, she's doubly armed--with a six-shooter, and with an axe to grind; even her \"inner child\" packs a gun.  She enters Herod's to-the-death fast-draw tournament, a no-win, no-exit, potentially no-survivors affair, with an agenda on her mind other than just winning the prize money.  <br><br>This is an overripe, over-wrought movie, but it mostly works.  Raimi all but erases the slim wall between the horror and Western genres:  Redemption is another Transylvanian village of simple peasants lorded over by by an evil baron, and the atmosphere--palpably oppressive and claustrophobic--could be cut with a knife.  Leonardo di Caprio and veteran character actors Lance Henriksen and Roberts Blossom effectively round out the cast, and the action scenes--exaggerated, mythic, often darkly humorous--deliver.  If you're more of a horror fan than a Western fan, this may be the Western for you.","user":"lwjoslin","rank":[21,25]},{"title":"More style than substance but good fun as a modern spin on the spaghetti genre","rating":6,"date":"6 July 2003","review":"In the Western town of Redemption John Herrod runs everything, they say he gets half of every dollar spent or earned.  In order to face his enemies face on he runs an annual quick draw contest where fights battle each other until only one remains.  The winner takes home a small fortune  the losers leave wounded if they are lucky.  Into this contest comes a group of hopefuls including a woman who has personal reasons for signing up.<br><br>Looking at the list of names it is evident that the casting director is very good at his/her job as they managed to catch several big names, get several stars who were a few years away from hitting big and also get veteran faces as well.  The ensemble of well known faces suits this film as the focus is very much on style and appearance than it is on substance.  As a plot it takes the well known genre of the revenge western and makes a sort of pastiche of it.  Thus we have the OTT and hyper direction of Rami and gun fights that are delivered with energy and shots that have no bearing to reality.<br><br>When I think about the actual plot, it really should bother me more than it does.  The plot is pretty thin and contains nothing that you can't see coming from about the first 20 minutes of the film  certainly the woman's `secret' will be no mystery to anyone who has seen `Once Upon A Time In The West' which it clearly apes in this regard.  What exists in the place of a wider plot is characters and style.  The style is fun and energetic and will appeal to fans of Evil Dead etc.<br><br>The characters themselves are also pretty good, each has a little back story which helps to fill out the running time without getting too serious.  Stone does surprisingly well in the lead, she's no Clint Eastwood but she leads the cast well  which is no mean feat when you look at the credits.  Hackman is a gleefully good villain  even more mean and unrepentant that his character in Unforgiven.  Crowe and DiCaprio were both a few years from the levels of stardom they now hold, but both are engaging and enjoyable.  The support cast is also full of names and faces you'll recognise  either as solid support actors of recent films or older faces.  For example  Henriksen, David, Sinise, Hingle, Bell and Blossom.<br><br>Overall this film might infuriate you if you are looking for a film that has more substance than style, as this is the other way round.  However fans of Rami's style and/or revenge westerns will find much to enjoy here.  Every time I see it I always find it hard not to get caught up in the atmosphere it creates.","user":"bob the moo","rank":[86,119]}]