[{"title":"Outstanding","rating":10,"date":"13 August 2006","review":"I heaven't read the book, but BICENTENNIAL MAN is a very touching and heartwarming movie about a house-robot (Robert Williams) that begins a 200-year journey to become and to be legally recognized as a human. During his journey, he has to face the fact and live with it that all loved ones around him grow older and eventually die while he is immortal.<br><br>I think that this was one of Robin Williams' best performances ever, if not the best. He proves that he can either play a 'funny wacky' character but also a serious character that will touch the hearts of the viewers. And this movie does just that.<br><br>I like the purity and the innocence of the story and I wonder why this movie has such a low rating. It's a must see for all open minded people.","user":"duffy047","rank":[161,180]},{"title":"uneven but often rewarding film","rating":25,"date":"25 June 2000","review":"Owing to the fact that it is based on an Isaac Asimov story, `Bicentennial Man' turns out to be a more interesting and meaningful film than both its advertising campaign and its own opening section would indicate.  The caveat for those seeking out a fun film for the entire family is that this movie, though initially sold as a warm cuddly comedy in the tradition of say `Mrs. Doubtfire,' actually deals with some very heavy and heady issues like sexuality, aging and dying, which may make it less-than-ideal viewing for young children.<br><br>The first section of the film is, by far, its weakest.  In 2005, the wealthy Martin family receives delivery of a brand new servant android (Robin Williams) who, almost immediately, begins to display a remarkable range of human emotions and interests.  Thus, we are set up for yet another in a long line of predictable tales (i.e. `Harry and the Hendersons,' `Stuart Little') in which a family comes to adopt a strange, not-quite-human creature, welcoming him in as one of their own.  Indeed, in the film's early stages, there is no shortage of either bland humor or drippy sentimentality as Andrew, the android, ingratiates himself with all but one of the Martin household.  The `wit' in the film consists, basically, of endless jokes about how Andrew takes all idioms at literal face value, a running gag that is, finally, as unoriginal as it is wearying.<br><br>Then, however, just as we are about to give up hope in it, the movie becomes more intriguing.  Rather than staying within the context of the present life of this one family, the screenplay begins to move ahead in time, exploring Andrew's gradual growth toward total humanity, while the initial family grows up and eventually dies off.  Actually, despite how one may feel about the film itself, one must admire its boldness and audacity, for it is not often that, in a film billed as a mass audience comedy, all the main characters pass on to their heavenly reward at one point or another  but, then again, how many comedies span a two hundred year time period? `Bicentennial Man' obviously has more on its mind than mere fish-out-of-water buffoonery, as it becomes an often-elegiac reflection on the transience of life, the meaning of being human and the search for societal acceptance.  The mood of the film is remarkably hushed and reflective at times, which again might make it slow going for the modern mass audience more conditioned to a faster pace and giddier tone, especially in a Robin Williams film (though, of late, his films have certainly been taking on a much more somber quality, vide `What Dreams may Come,' `Patch Adams' and `Jakob the Liar').  There are times when `Bicentennial Man' seems overly impressed with its own self-importance, yet one appreciates its refusal to settle for the easy path of cheap comedy and upbeat sentiments. There is, indeed, a real sadness to much of the film.<br><br>Special acknowledgement should be made of the superb art direction, set design, costume design, makeup and special effects that together give the film its understated and believable futuristic look.  In addition, James Horner's melancholic symphonic score, though a bit lubricious at times, does create an atmosphere of contemplative seriousness that perfectly matches the tone and purpose of the film.<br><br>`Bicentennial Man' may not turn out to be what you are looking for when you first seek it out, but, if you approach it with an open mind and a certain degree of tolerance and indulgence, you may be pleasantly surprised and, perhaps, even rewarded.","user":"Buddy-51","rank":[136,157]},{"title":"A beautifully Innocent Film","rating":9,"date":"16 January 2005","review":"Firstly, i have not read Asimov's book and therefore cannot remark on any errors in translation from book to film.<br><br>I have read many of the comments posted here on the IMDb, but fail to see why so many people feel the need to mention that the world is perceived as perfect in the the future, maybe it is, maybe it isn't, the fact is, it's not important. This movie quite simply follows the life of a man trapped in a robots body and his quest to be accepted in the world, and be allowed to love and cherish the people close to him.<br><br>I have to say that i didn't expect much from this movie, i thought it would be a kids film, full of typical Robin Williams style laughs, i was way off in my assumption. This is probably Robin Williams's best performance and it is a very emotional journey through change and development of the human condition.<br><br>Overall the film is quite amusing, very touching and is full of realistic characters all very well cast to not overshadow 'Andrew' as he quests over 200 years for acceptance.<br><br>A great movie 9/10","user":"mjw2305","rank":[143,166]}]