[{"title":"Nolan's Clever Debut","rating":8,"date":"14 April 2003","review":"The debut that plucked from obscurity one of the brighter stars of contemporary noir is an assured, if limited, stab at the con game and obsession.  Filmed for zero money, Nolan couldn't have chosen a better subject than the drab and seamy underside of London to ply his trade, given the lack of funds.  This short (67 min) is at its best in playing with the audience's and protagonist's expectations about who is scamming whom, though the initial set-up does ring some alarm bells in the credibility dept. The muddy cinematography (he often used natural lighting due to budget) can be mostly chalked up to noir stylization, though the limitations do show at times.<br><br>One can easily see Nolan's style developing in this fledgling effort; many of the same themes of blurred identity and expectation smashing recur in MEMENTO and INSOMNIA.  Not a masterpiece but good and certainly worth a look for modern noir and Nolan fans.","user":"secragt","rank":[103,108]},{"title":"Low budget masterpiece!!","rating":10,"date":"4 January 2004","review":"Christopher Nolan's first feature film wowed critics who saw it when it first came out. Shot on a micro budget of $6,000 this is a student film with real class. The film is shot in black and white, and features people who you assume are friends of Nolan's appearing in the movie. This is not to say they are bad actors because they are quite good. You could see Jeremy Theobald and Alex Haw appearing in other projects but unfortunately they haven't since this was made 6 years ago.<br><br>Nolan's thriller, much like Memento, does not play chronologically, it shifts the scenes around much like Pulp Fiction. The writing is fantastic. It is a great twisting thriller but because the temporal order of the film is shifted around it makes it even more interesting. I thought the last ten minutes in particular when everything starts to become clear were excellent.<br><br>\nFor a film of such a small budget and with no recognizable names at all, this is so good. It is superior to most that Hollywood studios offer and Nolan after three films (this, the superior Memento and the not quite as good but still excellent Insomnia) has cemented himself as the most exciting new talent of recent times. I can't wait for Batman.<br><br>This film is short and sweet and certainly a great watch. It is very professional and the twists are fantastic and completely surprising. I also thought that the score from David Julyan was also excellent, very atmospheric and had a chilly quality to it. He has gone on to compose Nolan's other films. <br><br>Overall I would recommend this, I intend to get all of Nolan's films. This is a low budget gem. *****","user":"supertom-3","rank":[167,184]},{"title":"Fascinating suspense film.","rating":8,"date":"26 October 2003","review":"Christopher Nolan's first directorial effort, a year before he did \"Memento,\" and this is almost as brilliant as that classic.  He uses time differentials in a similar manner to tell his story, and it's a very clever one.<br><br>Bill is this young writer who begins following complete strangers around just to see where they live and what they're all about.  One day, he follows this man, Cobb, who turns the tables and confronts Bill, who breaks down and confesses what he's up to.  <br><br>Cobb is a burglar and he takes Bill along on a few jobs to teach him the ropes.  Both men are voyeurs of a sort and a bond begins to grow between the two of them. <br><br>But there's an ulterior motive for Cobb nurturing this relationship, and it all ties in very smartly at the end.  No, I won't spoil it but this is a very cool movie and I'm beginning to think Christopher Nolan is a genius.<br><br>If you like suspense films with surprise endings, this one is a must see.","user":"senortuffy","rank":[76,82]}]