[{"title":"Good Sequel","rating":25,"date":"25 January 1999","review":"Candyman: Farewell to the Flesh is actually a good sequel to the successful original. This one goes more in-depth than the original as we find out how Candyman came about and we see how he was killed. The plot is somewhat similar to the original. Candyman has moved from the slums of Chicago to the streets of New Orleans, during Mardi Gras. A schoolteacher named Annie Tarrant, whose father was murdered \"Candyman-style\" a few years earlier, does not believe in Candyman and says his name 5 times into a mirror to prove to her students he doesn't exist. Wrong move Annie. Soon after she does this a series of brutal murders occur while Candyman seduces her to \"Be with him\". Lots of bees and blood in this good sequel!","user":"Keith-78","rank":[19,23]},{"title":"Poorly made but fun in a cheesy, entertaining way","rating":6,"date":"18 June 2005","review":"I think the original Candyman is a very good horror film and builds upon the mythos of such urban legends as \"Bloody Mary\" and so on and so forth. It didn't feature the best acting in the world but it was suitable and the atmosphere was very scary.<br><br>The sequel, \"Candyman II: Farewell to the Flesh,\" is as most horror sequels typically are -- inferior and less scary. It's like \"Halloween II,\" \"Friday the 13th Part II\" and \"Psycho II\": not as good as the original! Yet for what it is, \"Candyman II\" is quite entertaining, and still manages to remain rather atmospheric. The film takes place in New Orleans around the Mardi Gras and it's got some good scary segments. Some aren't so scary but are fun to watch. We know what's going to happen but it's still entertaining.<br><br>No this isn't expertly made but it isn't mind-numbingly bad as some of the genre are. Basically it's loads of blood but it also retains its creepy cinematography and the direction is better than expected.<br><br>Overall this kept me entertained, which is all I expected in the first place.","user":"MovieAddict2016","rank":[22,30]},{"title":"Rises above what could have been just another pedestrian follow-up","rating":8,"date":"9 January 2015","review":"Although its roots lie in the legend of Bloody Mary, the \"Candyman\" franchise built a mythos all its own in the span of three movies. Actor Tony Todd would argue that the entire series revolves around a tragic story of unrequited love and the vengeance rained down upon those who dare disturb the tortured soul of the title character. I would absolutely agree with him, especially after \"Candyman: Farewell to the Flesh\" expands on the backstory of our antagonist.<br><br>Candyman moves on to New Orleans and starts his horrific murders once more. This time, his intended victim is a school teacher. Her father was killed by Candyman, and brother wrongly accused of the murders.<br><br>Instead of the usual horror film retread we get when it comes to sequels, \"Candyman: Farewell to the Flesh\" actually expands on the history of the character by visually telling his tale on screen. It pounds home the tragedy surrounding Candyman and brings more of a sense of humanity to the \"villain\" of the story. <br><br>Tony Todd brings Candyman to life and makes you both feel sorry for and fear his character. He brings an air of refinement to what could have been just another slasher icon. Veronica Cartwright plays a widowed southern belle who has a secret of her own to keep. Even in 1995, she was already a veteran of the horror genre because of roles in \"Alien,\" \"The Birds,\" \"The Witches of Eastwick,\" \"Invasion of the Body Snatchers,\" and more.<br><br>I'm fascinated by writer and atheist Clive Barker's attraction to Christian religion and Catholic imagery as showcased once again in \"Candyman: Farewell to the Flesh.\" This time it's exemplified through the events of Mardis Gras in New Orleans and the religious meanings behind the celebration. I also found it interesting that one of the main focuses of the lynch mob was a middle-aged lady carrying her Bible and encouraging the torture of Candyman. <br><br>\"Candyman: Farewell to the Flesh\" is rated R for violence and gore, and for some sexuality and language. There's the expected amount of blood and on screen butchering you would expect from a horror movie. A couple are shown having sex in public on two occasions. They're nude and shown from the side, but no actual privates are shown. <br><br>\"Candyman: Farewell to the Flesh\" rises above what could have been just another pedestrian follow-up to a slasher flick. Instead of simply lining up new faceless victims for the killer to take out with his hook hand for no reason, our dreadful anti-hero is given substance and motivation for his actions. An air of mystery and a dark family secret add another level of elegance to the movie.","user":"ersinkdotcom","rank":[7,8]}]