[{"title":"Beautifully acted, powerfully moving","rating":10,"date":"15 October 2003","review":"I don't know where to start. When I'm asked of my favorite movie ever, this is ALWAYS the first to come to mind. This is one of the finest movies I've ever seen, and I've seen too many to count. <br><br>Once Were Warriors is, at its most stripped, about a woman named Beth and her struggle to just do what's best for her family. She is of Maori heritage, New Zealand's sort of Native Americans. Culture is a proud and powerful aspect of the movie, as Beth's strengths lie in her devotion to her family and her heritage. But that is little comfort, as her daughter is struggling to accept adulthood, her youngest son is heading towards juvenile detention, and her oldest son is fast on his way to joining a brutal gang. Worst of all, her husband Jake is a heavy drinker.<br><br>The film excels at painting everybody in full 3 dimensions. Each of her kids are troubled, but they all have fierce love and respect for their mother. The gang is cruel to the oldest son, but at the same time embraces him. The juvenile detention center separates the youngest son from his only home, but instills in him a pride in his ancestry. And Jake himself is a beast, a man built like a tank who will destroy you with anything available should you spill his beer...but somehow he also comes across as loving Beth. Sometimes.<br><br>The film follows Beth as she does her best to hold the family together even while the various problems tear them apart. At the center is Jake's drinking and further carelessness of his family's dissipation. While Beth's answer is to nurture and aid her children, Jake insists it's best to drink away the problems and quit being so \"soft\" on the kids. And we watch, through it all, as the family spirals further apart. Near the end, after seeing both happy and horrible things happen to each of the characters, we are jarred by a terrible tragedy. Beth and Jake both deal with it uniquely, as she draws once again on the tremendous power of family and human spirit, while Jake deals with it his own way. The last 15 minutes of the film keep us in suspense as we wonder whether a certain horrible injustice will be confronted, and if so, how. This scenario involves and encapsulates everyone in the family, and who they are inside.<br><br>The last few moments of the movie made me want to jump to my feet and applaud. I won't reveal what happens, but in the last 5 minutes, every person shows so much inner strength that I glow with admiration for their actions. Especially those of Beth and her oldest son, whose interaction with Jake results in my favorite scene in the movie. But don't think you know what's going to happen based on this description -it's a complicated scenario. I felt satisfied with the conclusion on all fronts, and thought that each character showed exactly where their strength lies. <br><br>Be forewarned that this movie is very heartbreaking. Its overall tone is one of futility, of better lives not received, of wanting the best but never quite getting it. It is very raw and intense in its portrayal of physical and domestic violence, and the easily upset may have a hard time waiting to see if it ends happily enough for their tastes. But no matter what your opinion is, it will definitely be a film that stays with you for a long, long time. My highest recommendation.","user":"manalone923","rank":[168,177]},{"title":"A Powerful Depiction of a Family Coming Apart","rating":21,"date":"21 November 2003","review":"There are films where you can see extensive carnage and it doesn't move you. This is a film where you see a man hit his wife and it hits you in the gut like you're being hit yourself.  An excellent depiction of the impact of anger and violence on the members of a poor family.  In this case, they happen to be Maoris living in New Zealand. The father dominates the family because he is so powerless in the other facets of his life.  He's addicted to boozing and carousing and the only way he can really express himself is with his fists.  The wife fights back, but can be beaten into submission. But she's also allowed herself to be seduced by the boozy lifestyle and fears responsibility.  The center of the family is the oldest daughter (13), who is really the only one who can communicate with all the other members. The boys are either lost in life or lost in their own rage.  The youngest daughter is simply too small and clings to her sister. It takes a tragedy to allow some of these individuals to reach out for each other and try to re-create a form of family life.  A very powerful film, not for the faint of heart.","user":"FADrury","rank":[81,84]},{"title":"brutal & compelling","rating":10,"date":"12 February 2003","review":"One of the best films of the 1990's, a brutal, brilliant &amp; compelling film from New Zealand.  Brilliant performances from Morrison, Owen &amp; Kerr-Bell as Gracie.  Morrison as Jake is one of film's most fearsome characters, full of true anger &amp; hate but by no means a one-dimensional character.  As see the characteristics that made Beth fall in love with him in the first place, the passion, the charisma. A great script based on the novel of the same name. A must see 10/10","user":"mighty_pickman","rank":[58,61]}]