[{"title":"Violent, stupid but enjoyable","rating":8,"date":"12 October 1999","review":"Yes, it's a bad remake of La Femme Nikita--yes, it's overly violent and amoral (but so was the original)--yes, it's REALLY stupid, but I enjoyed it. It moves quickly, Fonda manages to give out a pretty good performance and it's certainly never boring. If you can turn off your brain, and sit through bursts of graphic violence (and a really sick sequence involving Harvey Keitel as \"The Cleaner\") you should be able to enjoy it. No great movie, just a really good bad movie. Critics predictably hated this movie. There's a now infamous review from the \"New Yorker\" magazine that's only 9 words long--\"The end of French cinema as we know it.\" Ignore them--this is lots of fun.","user":"preppy-3","rank":[54,69]},{"title":"average movie, but great acting of Bridget Fonda","rating":7,"date":"13 October 2003","review":"Being a remake of Luc Besson's \"Nikita\" (1990), this is quite an average hollywood remake of a very interesting french movie. The french original is much better in terms of direction and story, but Bridget Fonda's acting is marvellous, outstanding and considerably better than her french counterpart's in \"Nikita\". And this is exactly the reason to watch this movie, Fonda's performance is a thing you should definitely not miss.","user":"firner","rank":[52,67]},{"title":"Good viewing","rating":8,"date":"3 April 2004","review":"The English version of the French movie La Femme Nikita. I think it is quite well done, and I enjoyed it.<br><br>A druggie girl kills a cop and is sentenced to death. She is given the \"opportunity\" to live, if she does what they say, and becomes an assassin. To the rest of the world she died.<br><br>She is determined, and she doesn't play well with others, but if she doesn't start playing their game, she really will be in her grave.. I'm not giving away any more.<br><br>But I would recommend it, it's worth seeing. Especially if you like Bridget Fonda, who kicks arse in this movie.","user":"Ja_Nina","rank":[47,66]}]