[{"title":"Creative genius","rating":10,"date":"15 September 2008","review":"This work of art is so over the top in it's creative genius it gives me chills. An amazing film. It is the best things in life that take our breath away, this film will and always does take my breath away. It has so many levels of beauty ; storyline, acting, cinematography, music, casting...Like any great form of art it evokes passion. The Concept here is LOVE. I never get bored with it....Reluctantly the rules require 10 lines of text without revealing the plot. What amazes me are the people who downgrade this movie. It seems to me how pathetically shallow or meaningless your life must be if you would go out of your way to not like this film. I have no respect for the academy awards. Afterall, didn't they choose Ernest Borgnine over James Dean as best actor in 1955. I was in Blockbuster and couldn't find anything so I asked a clerk she recommended this movie. I had never heard of it but she thought I would like it. I was so grateful to her later and asked her why she didn't emphasize how unbelievable it was. She told me the other clerks were unimpressed by it, so she was afraid i might be like them. Thank god I am not.","user":"stevenasarafian","rank":[10,10]},{"title":"Very well made","rating":16,"date":"16 September 1998","review":"I loved this film, it was simply well made for this modern time. I read the book by Charles Dickens and it is quite different, but very enjoyable.You never know do you? It was a bit confusing, I mean Gwyneth Paltrow's character, I guess you could say she was unique. And I understood Ethan Hawkes character perfectly. Wonderful film, I'd recommend it to anyone.","user":"Marcey13","rank":[9,9]},{"title":"Brilliant.","rating":10,"date":"9 June 2001","review":"I have never read Dickens' \"Great Expectations,\" but I can tell you that this is one of the best movies I have ever seen.  Let me clear something up right away.  This is not a b-movie, a cheesy remake, or even a remake.  It is my understanding that this movie is loosely based on the Dickens' book, but that it does follow the themes, just not the exact story. This is a great movie, it is a modern classic. The acting is excellent.  Ethan Hawk is amazing, he really is a top notch actor. He's not just a young sexy leading man type who gets by on looks and a touch of acting (as I had previously thought since he looks like the typical Matt Dillion or a Lowe type).   Gwyneth Paltrow is absolutely stunning and plays her role perfectly.  De Niro has a nice, powerful role, and duh, he's awesome in this movie.  Anne Bancroft was hauntingly superb in this movie, you'll see what i mean.  Hank Azaria and Chris Cooper play great supporting roles.  I think this movie was probably Chris Cooper's breakthrough role, and he was great.<br><br>      The movie was breathtakingly shot.  The cinematography was better then even the recent crouching tiger hidden dragon.  The movie gives you a feeling of awe and mystery because of it's settings.   It's a work of art. The writing...based on a classic Dickens novel..come on it is superb. No cheesy lines; yes there are heartfelt beautiful lines, but none cheesy or over-emotional or over the top dialogue.  The writing and actors clicked perfectly. Need I say the story was both interesting and intriguing (based on Dickens' Great Expectations).  It may be loosely based or not, but it was GREAT.<br><br>      The directing pulled everything together and added some nice tricks to make this movie a Modern classic.  And the way music was used to intensify this movie and when and where it was used was absolutely brilliant, and i suppose this is the director's job, WELL DONE.<br><br>      The music was almost as important as the acting in this movie.  The musical score for this movie is one of the best I have ever encountered.  It makes this movie move you.  And just as good are the music (songs) the movie uses, how and when they are used.  This is one of the few movies that thrives on sound (music) to help create it's mood, power and emotion and it is done masterfully.<br><br>      This movie is a masterpiece.  Beautiful on the eyes, ears, heart, and mind. I feel sorry for you if you don't ever get to experience this movie, it is a MUST see.","user":"superfly_tnt1","rank":[146,191]}]