[{"title":"A woman at the heart of one king and two writers.","rating":6,"date":"13 July 2002","review":"La Marquise (Sophie Marceau), an French actress of the 17th century, is another attempt to make a French movie about the times of Louis XIV.  The period is well depicted and the Court of the King is brought into images as it must have been at that time I imagine.  Special is the scene where King Louis XIV (Thierry Lhermitte) goes publicly into the fountains of Versailles - the first and only time that he took a bath - and he is accompanied after some hesitation by La Marquise.  We see also the struggles around the throne with Molière (Bernard Giraudeau) and Racine (Lambert Wilson) who have La Marquise as there mistress, and the architect of the gardens Le Nôtre and the composer Lully (Remo Girone).  King Louis is in this movie a young patron of the arts who encourages Molière while writing \"Tartuffe\" or Racine writing \"Andromaque\".","user":"silverauk","rank":[10,11]},{"title":"Versailles In The Sunset","rating":8,"date":"20 January 2007","review":"We've been here before, of course; Versailles, Sun King, decadence versus squalor, etc but having said that this is a painless way to expand - if you're not French - your knowledge of the era in which Comedy Francaise was born. Though that isn't really touched on here two of the principal characters are Moliere and Racine and they are linked economically by sharing the eponymous Marquise (Sophie Marceau) as a mistress - in this case Marquise is a Christian name rather than a title. Thierry Thermitte weighs in as a competent if unlikely Sun King and fellow Splendid alumnus Anemone is also on hand as what might be called Toxic Adviser. Vera Belmont handles a large cast well and has an eye for visuals. On balance an enjoyable romp.","user":"writers_reign","rank":[8,9]},{"title":"Beautiful film","rating":10,"date":"3 December 2001","review":"It is so nice to see a person encouraged to follow her dream - despite opposition from others, and despite having to overcome her own fears at times. The ending is sad but it fits with the film's whole tragic theme, and works well as the play-within-a-play. Excellent performances by Marceau and Giraudeau (as Moliere). Excellent insight into the lives of travelling players, and Louis XIV's era.","user":"cassandramunro","rank":[8,9]}]