[{"title":"Just a sweet and honest movie that I feel is a little under rated here on IMDb","rating":7,"date":"13 July 2006","review":"I recently saw I.Q. and even though I'm not a romantic comedy type of gal, I think that it was just a nice and sweet movie to watch. So many movies in my opinion lack honesty. You know that feeling when you're watching a movie and you just feel robbed because it's taking something from the story and it was like the director just threw it together like it was trash? The story between the scientists is a sweet and funny one. How they stuck together and they tried to help Tim Robbins character become smart. I liked the love story between Tim and Meg because it was simple and brought up a good point when it comes to love, \"nothing is what it seems\". I would recommend this for a Sunday morning.<br><br>7/10","user":"Smells_Like_Cheese","rank":[24,28]},{"title":"I.Q. Is Excellent","rating":10,"date":"22 May 2005","review":"Maybe I'm being too generous with the rating...but I just love this movie! I've seen it so many times, but every time I see it I fall in love with it all over again. It's just a simple romantic comedy, with nothing huge or monumentous that happens. But I'm a big romantic and this movie *is* romantic. I love Meg Ryan and Tim Robbins, and Walter Mathau is so funny. The scientists make me laugh so much...I definitely recommend this movie to anyone who hasn't seen it. It's such a clean, good movie - and those are so rare now! My 20-year-old brother likes this movie, too, so it's not just a chick-flick. ;-) I recommend it if you need to laugh, or if you're just lonely and need to *watch* a romance, if you yourself can't participate in one. It's a good 'un!","user":"ClassicGal","rank":[48,60]},{"title":"A lovely romantic comedy","rating":9,"date":"18 October 2003","review":"I just watched I. Q. again tonight and had forgotten how much I love this movie.  It is wonderfully entertaining and leaves you feeling that all is right with the world.  I love the allusions to Mozart all throughout from the opening with \"Einstein\" playing \"Twinkle, Twinkle Little Star\" on the violin to him humming Eine Kleine Nachtmusik during the IQ testing of the Ed Walters.  I love that a woman is portrayed as intelligent and encouraged to have a career, an especially unique situation for the 1950's, the time in which this movie is set.  (I myself have been a teacher but stayed at home to raise my children, so please don't think I am some staunch women's libber.) It's wonderful how a man who is \"only a grease monkey\" is finally seen to be just as important and worthy as Catherine's fiance, a clinical behavioral researcher.  The message to me is that we are not what we do, but who we are is defined by so much more - no labels.  There are so many little gags and one-liners that are almost throwaways if you don't watch and listen carefully.<br><br>I did catch a few things in the movie that are not listed on the goofs page. In the scene when Ed Walters is to speak at symposium, there are 3 instruments (protractor, ruler, etc.) hanging on the right from the chalk ledge.  In the next camera shot, there only 2.  In the credits on our video, it lists Tony Shaloub's character as Bob Watters, not Bob Rosetti as he introduces himself in the movie and is listed here on Imdb.<br><br>I highly recommend this movie.  It may be a piece of fluff in some estimations, but has lots more substance than many give it credit for. Not only that, what a great cast is assembled here.  Watch it and enjoy!","user":"joylily514","rank":[21,26]}]