[{"title":"the best animation film of disney","rating":10,"date":"21 February 2020","review":"One of, if not, the best Disney films ever made. The vocal talents of James Woods, Danny DeVito, Tate Donovan, and Rip Torn are all spot on. The music isn't the best work Disney has put out, but the movie itself is downright amazing. The tale of a son trying to regain his heroism to return home is one that has been told before. However, the way this one is told just feels fresh and new. James Woods as Hades is perfect casting. It is on the level as James Earl Jones as Darth Vader. I can't imagine anyone else playing the role of Hades. Great job Disney on this perfection. If anyone likes Greek mythology then this is a great, kid friendly, version of it.","user":"MR_Heraclius","rank":[37,38]},{"title":"Hilarious, great fun for kids and adults.","rating":17,"date":"17 June 2004","review":"I think this film is wonderful. It is sheer entertainment for kids and hilarious for adults.<br><br>I first watched this movie age 7, and i loved it...now i watch it again age 14 and I'm howling with laughter. The 'You wanna buy a sundial?' sequence renders me unable to breathe for laughter, whilst when i was younger it got not so much as a giggle.<br><br>As with all Disney films, the jokes are for the 'big kids' and the entertainment value is for the little ones.<br><br>This film has been criticized for not staying true to Greek Mythology. My response is, it doesn't matter. This a witty, sarcastic and enjoyable film. Accuracies play no purpose.<br><br>The characters are wonderful, particularly Phil and Hades. Also, Megara provides a feisty, totally non 'princessy' female character, which is wonderful!<br><br>Overall - 8/10","user":"crazy_child_of_the_south","rank":[83,91]},{"title":"Disney's funniest","rating":8,"date":"12 December 2000","review":"I'm shocked to see this movie with a rating below 7.  As a big Disney fan, I'll go out on a limb and say this is one Disney's top 5.  There isn't a Disney movie out there with wit as sharp as this one's with much of it probably lost on the audience guessing by the rating given to this movie. <br><br>\n\"Meg\" definitely emerges as my all-time favorite female Disney role. Breaking from tradition, her character is not all that lady-like in her biting wit and sarcasm, but it works, serving to make the movie funny and her character lovable despite working with questionable motives. <br><br>\nThe set-up and plot is typical for the movie but the script, animation, and music are most original AND good.  IF I had to register a complaint, I would say that it's perpetual humor kept the movie from being emotionally wrenching.  However, this movie remains one of the most entertaining I've seen.  8.5/10","user":"ntadema","rank":[107,124]}]