[{"title":"Funny spy-themed spoof with Weird Al in opening theme","rating":4,"date":"1 January 2006","review":"I caught 'Spy Hard' on television the other night, and the film really took me back to the early 1990s. I noticed Weird Al right away from his part singing the theme song. 'Spy Hard's' purpose is to create a comical version of James Bond and similar spy-themed films. Some of the comedy is very funny, but some of it wears thin throughout the film. (You'll either enjoy the sense of humour, or you will hate it.) WD40 is a great name for the secret agent, and Mr. T even makes an appearance. There is also a lot of adult-themed humour. By the end of the film, I was ready for it to be finished. It's funny, but it's not brilliant, but I cannot complain because it did let me laugh. If you like Austin Powers, you will probably like this, even though it is not as popular. It will also take you right back to the early 1990s. Not a perfect film, it does have some good humour.","user":"rebeljenn","rank":[12,14]},{"title":"Genuinely funny film starring the one and only!","rating":29,"date":"29 December 2007","review":"I've seen that this film has got mostly bad reviews on this website, and i heard that at the time of this movies release, it didn't do well in the box office and was also poorly received, in my opinion though, they are ALL wrong!<br><br>This is a great film, you can clearly see that it tries to live up to the great heights of the Naked Gun series, and it has a real go at it, but seriously, what will ever beat The Naked Gun, in comedy anyway...?<br><br>There are lots of good gags in the film but i'm not going to spoil it for you, just buy the DVD (VHS if your old fashioned!) and find them out for yourself, it will be worth it believe me!<br><br>I would recommend this to any Leslie Neilson fan (like me!) or anyone needing a good laugh....<br><br>8/10","user":"Hassard1994","rank":[16,20]},{"title":"Average fare but some good moments","rating":4,"date":"16 January 2001","review":"The dopey, deadpan character sculptured by Leslie Nielsen is back in a \"James Bond-esque\" comedy as agent WD 40. There are more gag misfires in this movie, than a parking lot full of dead batteries. However, he's such a likeable guy, you can make it over the hump.<br><br>Unfortunately, with the exit of the mad geniuses (The Zucker Bros. &amp; Jim Abrahms), there's little here in this script to wave the pom-poms about. It's all been done too many times before.<br><br>Of honourable mention is a priceless, very quick cameo with Pat Morita, which is an absolute gem. There are other assorted scenarios that came off well, too. See it if you must on a rainy Sunday, but this is pretty old, borrowed and blue.","user":"Mitch-38","rank":[14,19]}]