[{"title":"Beyond Surfaces","rating":9,"date":"17 November 1999","review":"A shimmering brightness infuses \"Tokyo Decadence\".  The neon-blasted streets, the eerie, artificial glow of offices and hotel rooms, even the translucent glow of daylight insinuates under the skin of the film.<br><br>\nThe antiheroine of the film passes through a sexual Seven-Circles-of-Hell in Tokyo, used and battered by clients, gangsters and even friends who ply her with drugs and subversive sex.  None of the sexuality is erotic, but it's also not presented as obscene or tragic.  The spare, minimal approach to the dialogue heightens the tension and sense of dislocation.  The film presents sex as a matter-of-fact commodity, flesh as spiritual bargaining tool in return for a temporary escape from alienation and fear.<br><br>\nIt's an intriguing film, difficult to watch but rich in visual beauty and its subtextual dimensions are quite rewarding.  The film fetishizes everything to the point of abstraction.  The city of Tokyo becomes a gleaming morass of lights, skyscrapers and soullessness.<br><br>\nA brutal and delicate work of art.","user":"Bishonen","rank":[43,50]},{"title":"powerful start meanders to bland finish","rating":5,"date":"16 September 2008","review":"Murakakmi's Tokyo Decadence starts out powerfully with an unflinching look at the shifts put in as a 'Delivery Health' (as these women get called in 21s century Japan) by hooker-with-a-heart-of-gold, Miho Nikaido. The crisp colours, seductive light and slowly dollying camera give a high productive sheen to the mesmerising scenes of Nikaido being humiliated by a Yakuza couple, then assisting a dominatrix in the wished-for degradation of one of her regular johns.<br><br>Murakami seems to be highlighting the amorality of Bubble-rich Japan, his characters speechifying against the 'real' whores in the corporate and government fields. The sexual and comedy elements are well-balanced, the highlight being the lost dildo in the toilet scene. Nikaido shows an impressive range, both vulnerable in and enraptured by her line of work. She also enlivens a long walk with a wild-eyed look she achieves in the film's final third.<br><br>However, her performance cannot rescue the meandering, insipid final episode when Nikaido goes in search of her true love. The introduction of a 'courage' pill is a clumsy plot device. The final section lacks clarity, and even continuity seems to be a minor concern. It is as if Murakami, having established his world so finely in the first half, is now at a loss regarding what he wants to say about it. A series of episodic and uninspiring tableaux plays out, the slightly surreal elements being the only thing that stops it from descending into an old-fashioned morality tale.<br><br>Tokyo Decadence is a film of two halves, with the director only trying in the first.","user":"CountZero313","rank":[19,24]},{"title":"subtlety is the power of this film!","rating":12,"date":"12 July 2001","review":"Most films dealing with prostitution that I've seen have been very straight forward. In other words, the characters have been very loud, and to the point about what's going on in their heads. However, the lead character in Tokyo Decadence comes out differently than you might expect . In most films that portray prostitution as a hard and unsettling life,  ( Whore, Leaving Las Vegas...) the main character is trying real hard to act like they enjoy what they're doing. But in Tokyo Decadence, it's quite the contrary, the lead character hardly says a word through the whole film. But you still learn so much from her expressions and way of dealing with the many different wack-job clients she has. (These include dominatrix, sadists, and necrophiles to name a few.) This is the first film like this where I've actually felt sympathy for the main character.  She obviously has big dreams, presses forward to improve her situation in life constantly, only to be brought down by the degrating clientel she encounters every night. Overall, the acting is superb! As far as story is concerned, there is a serious lack of information given toward the middle of the movie. She keeps carrying around a picture of her with this guy, even going as far as buying expensive jewelry as good luck charms to get him back, ....but we don't know who he is, how she knows him, ..nothing. But despite, minor holes in the plot, the film never loses sight of the point it's trying to make. And as I said, subtlety is what makes this film powerful. It's what the characters aren't saying and showing that brings you closer to the film. One last note, the film DOES live up to it's NC-17 rating. But then again, most asian films do.","user":"jrrunnin","rank":[9,11]}]