[{"title":"Beautiful, haunting, poetic and truthful.","rating":28,"date":"28 July 2003","review":"Just seen this for the second time. First time I saw it (about a year ago), I wasn't really sure what to make of it, but there were scenes from it (when Elias Koteas reveals why his connection to the disturbed and grieving father and the scene with the father and his daughter's babysitter at the end) that have always stuck in my mind. <br><br>A very haunting and beautiful movie (even though it gives a very unpleasant view of life), with a haunting snake charm style score and starring the brilliant Elias Koteas (from \"Crash\") and the lovely Mia Kirshner (from early first season \"24\" and \"The Crow: City Of Angels\"). Victor Garber (Sidney's dad in \"Alias\") also has a couple of scenes. Not to many tastes but very rewarding if you can appreciate it (although it's sense of detachment probably puts off a lot of people).<br><br>It seems to me to explore the theme of people trying to connect, in a very insular and ultimately unfulfilling way (the young gay man who goes to the ballet every night and gives away his \"extra ticket\" for companionship or the grieving father who pays a young girl to \"babysit\" his empty house so that he can have the illusion his daughter is still around for example), and also the theme of loss (variously of loved ones, innocence, youth, opportunity etc). The Exotica strip club seems such hollow place but at the same time it seems almost understandable that it would draw hapless souls night after night with nowhere else to go. Some of the dialogue seems poetic, cynical and truthful all at the same time. A film that you really need to watch to the end before you really feel you understand it's puzzle (and even then there seems to be something just out of grasp this viewing). A moving portrait of life that will linger in your mind afterwards.","user":"Django-21","rank":[44,50]},{"title":"Very Good","rating":9,"date":"26 July 2003","review":"Don't be fooled by the soft-porn title or the \"sexy thriller\" style art on the VHS box and DVD cover.  This, like Egoyan's follow-up masterpiece \"The Sweet Hereafter\" is an intricate, elliptical, and tragic look at grief and loss focusing on the people who work at and patronize a Toronto strip club. It's all very literary and symbolic (the exotic creatures of the pet shop being audited by Bruce Greenwood's tax man with a sad secret mirroring the exotic dancers of the club where he finds his solace after hours) and surprisingly emotional (especially at the end).  Character development, secrets, and inner truths are revealed slowly and carefully and in non-linear fashion by Egoyan's delicate director's hand.  The \"exotic\" flavored yet haunting musical score is an added bonus.  Worth a look if you are in the right mood and know what to expect from Egoyan.","user":"WriterDave","rank":[49,57]},{"title":"Amazingly beautiful, haunting film","rating":29,"date":"29 April 1999","review":"I can't remember seeing a film as intriguing, complex, and beautifully photographed as \"Exotica.\" I nearly didn't watch it because the video cover advertized it as an \"erotic thriller\" and the image on the front is of Mia Kirchner doing her strip-tease bit. Granted, \"Exotica\" centers around a \"gentleman's club\" of the same name, but to call this film a simple erotic thriller is to miss out on a lot, on too much.<br><br>\"Exotica\" follows four seemingly unrelated storylines: a man sitting alone at a table in a strip club, another man smuggling exotic parrot eggs into the country (\"Exotica\" takes place in and around Toronto), two apparent strangers walking in a field of green, and a young girl who plays a flute in an empty house.  Egoyan begins with these vastly different puzzle pieces then slowly, inexorably brings them together.<br><br>Atom Egoyan is one heck of a masterful director. He is the epicenter of this cinematic symphony that leads carefully from movement to movement until the finale bursts forth in equal measure of catharsis, discovery, and tragedy. Plot to him is like tapestry weaving. He threads narrative, characters, time, and setting in such complicated iterations that one is at once nearly overwhelmed by the intricacy and awed at his skill, a testament to his brilliance as well as his belief that a film-going audience is actually intelligent.<br><br>At it's heart, \"Exotica\" is a tragedy of circumstances. Or better yet, a collision of tragedies of circumstances.  Indeed, the film isn't so much about tragedy as it is about those who survive tragedy and the toll a single event can exact for the rest of the lives of those who survive.  Exotica, the gentleman's club, serves merely as a focal point where all these individual tragedies radiate to.<br><br>Equally haunting in all this is the music. Mychael Danna's score  sets the film's tone: dark, \"exotic,\" deceptively simple but savvier than it lets on. Also worthy of note is the music in the club itself, a blend of American house funk and Middle Eastern tones, warbled in Arabic.<br><br>I highly recommend this film. Ignore the naked women who sashay from time to time in front of the screen (difficult as that may be at times) in the scenes shot in the club. The really interesting stuff occurs at the margins of the film, as the gulf separating the storylines begin to vanish, and the final scene gives you the keystone to a horrifying clear vision of a sadness so overwhelming that no one in the film escapes unscathed.","user":"Gouda-3","rank":[54,64]}]