[{"title":"We give our full blessing to Mission of Justice.","rating":7,"date":"30 May 2011","review":"Kurt Harris (Wincott) is a cop on the edge. He and his partner Lynn (Sheperd) do their best to stop crime in the city of \"Eastgate\", California, and luckily they both know martial arts, so they make a formidable team. But there are some other supposed \"crimefighters\" in town - a group called \"The Peacemakers\". This group, reminiscent of Curtis Sliwa's Guardian Angels, patrol the streets and try to stop crime as well. They train at the Mission of Justice, where they practice their karate moves and wait for crimes to occur.<br><br>Enter the sinister Dr. Rachel K. Larkin (Nielsen) and her brother Titus (Hues). Larkin is a ruthless politician running for mayor. She will use any lethal tactics necessary to get to the top, using the Mission as a front for her dastardly operations. Meanwhile, Kurt Harris quits the police force in disgust at its red tape and bureaucracy, and its many other problems, not the least of which is jerkface Sgt. Duncan (Kriesa). Because Harris lives to fight crime, he goes undercover at the Mission and becomes a \"Peacekeeper\" himself. He wants to not only stop Larkin, Titus and the Mission, but get revenge for the murder of his friend Cedric (Burton). But he'll have to fight his way through many baddies to do so...<br><br>It's fun to watch Jeff Wincott's vigorous, energy -packed fighting style. He makes a good hero. And yet another one named \"Kurt\". After he becomes a Peacekeeper, he must wear the official goofy white T-shirt of the group. When he and his two compatriots patrol the streets, passing kids on bikes acknowledge them. It will remind you of Lenny, Carl and Homer in the \"cat burglar\" episode of The Simpsons. The way Cedric is killed and the presence of Brigitte Nielsen will remind you of Rocky IV (1985). Speaking of Nielsen, she was an interesting choice as the duplicitous, Hillary Clinton-like politician. For example, when she's evil, in private, she has sinister-looking short hair. When she's putting on her benevolent, public face, she has her \"nice hair\" on, which is long. Additionally, an Aryan foreigner running for public office in California predates Schwarzenegger by at least fifteen years.<br><br>But back to the action, Wincott is in top form, Karen Sheperd (remember her from Above the Law, 1986 in her fight scene with Cynthia Rothrock?) also displays some great moves, and we can't forget James Lew in a supporting baddie role. Wincott fights Hues in the final battle, naturally, and there's even some stand-out stick fighting. But like the movie Riot, which is filled with great scenes but has the one stand-out, they-outdid-themselves fight scene (the one with the motorbikes), Mission Of Justice has a similar gem: the absolutely killer fight scene in the chop shop. The movie is worth tracking down for that scene alone.<br><br>The title is has a clever double meaning, there are painful-looking hits in the fight scenes, and the main cast really makes it all work. We give our full blessing to Mission of Justice.<br><br>For more insanity, please visit: comeuppancereviews.com","user":"tarbosh22000","rank":[4,4]},{"title":"Great fighting movie!","rating":10,"date":"18 October 2003","review":"This movie really rocks! Jeff Wincott is terrific in the film! His fighting incredible! He is such a fast martial artist! Brigitte Nielsen &amp; Matthias Hues was very good! Mission of Justice is an action packed movie that is never boring! If you like fighting movies with incredible non stop action then check out Mission of Justice today!","user":"Movie Nuttball","rank":[4,4]},{"title":"Martial Law III","rating":10,"date":"25 January 2009","review":"It's a great American martial arts movie. The fighting scenes were pretty impressive for American movie made in 90's. Of course the fighting scenes aren't that good as in Honk Kong movies, actually only few American movies have fighting scenes which are as good as in Honk Kong movies, even nowadays. When you watch American martial arts movie, you are expecting to see less impressive fighting scenes, but still having some nice moves, which can be surprisingly good sometimes, or at least that's what I'm expecting from these movies. I was impressed by this film. Some fighting scenes were really impressive, the acting, direction and the plot were good enough, so it's a really worth watching movie, if you like American martial arts films of the 90's.","user":"kurciasbezdalas","rank":[5,6]}]