[{"title":"Adorable, funny, perfect voice casting for the lead roles","rating":31,"date":"31 October 2004","review":"I thought Billy Crystal and John Goodman were great. I like them anyway, but I can't imagine anyone else in their roles. John Goodman comes across as a warm, fuzzy teddy bear type in so many of his roles, and this time he was actually drawn that way. Crystal and Goodman were great together, even when their characters showed signs of not getting along. And Boo sounded so natural, so childlike. There's no way an adult could have done her lines the way they were executed.<br><br>And the writing was so intelligent, this movie was not just for kids. There were a lot of clever jokes that kids might not get. Still, the warm and fuzzy qualities of so many of the monsters make this a perfect choice for kids as well as adults, and I really don't get why ABC couldn't give this a TV-G rating. It may have been a little violent or scary at times, but never all that intense. Kids see worse on Saturday morning.","user":"vchimpanzee","rank":[57,59]},{"title":"Now here's a story children and adults can relate too. Monsters in the closet.","rating":10,"date":"12 December 2001","review":"While monsters in the closet may seem to be a scary reality for some children, `Monsters, Inc.' makes it light hearted by showing them it's all in a night's work.  The characters are as charming as the cast that speaks for them.<br><br>It's a learning experience children get to see how an industry works. Monsters, Inc. is an in-genius corporation that has scientifically learned how to channel children's screams into energy that is used for electrical power.  It has monster employees, an assembly line of doors (which give monsters access to children's bedrooms), a top-flight training program and some of the top Monsters in the scaring business.<br><br>There's a colorful Metropolis, filled with houses, buildings, businesses, cars and everything that makes a city run smoothly along with a population of colorful creatures.  One of the colorful groups of creatures is the yellow swat team.  Their job is to protect the Metropolis of Monsters, Inc. from human contamination.<br><br>But what happens when a human child mysteriously gets through the bedroom door and terrorizes the city with screams and boo's.  It's wondrous and funny.  In the mist of all this is industrial crime, brought on by greed. But, the story ends on a very happy note.<br><br>John Goodman is the voice of `Sulley' a colorful large blue-green ape like monster who's the star Monsters, Inc. employee.  He's some type of monster, cut, cuddly, and he has a conscience that leads him to feelings of regret about scarring children.  He becomes attached to Boo (voice of Mary Gibbs) a cute, little big-eyed girl who is mysteriously brought to Monsters, Inc. and in his quest to return her home becomes very attached to her.<br><br>Sulley's best friend is Mike (voice of Billy Crystal) who's a funny looking green ball with stick legs and one huge eye.  His comedy is seen through out the movie.  Mike is Sulley's driving force, acting as his agent.  Mike's job is to make sure Sulley remains the top Monsters, Inc. employee. But when it comes to laughter Mike proves he's on top.<br><br>Mike's girl friend Celia (voice of Jennifer Tilley) is the stylish employee who has Mike's best interest at heart.  Her job is to keep him out of trouble.<br><br>I give Monsters, Inc. a ten.  It is an animated movie that can be enjoyed by the whole family.  It makes for great family fun.","user":"ahill-1","rank":[130,148]},{"title":"Does For Monsters What \"Toy Story\" Did For Toys!","rating":10,"date":"12 March 2003","review":"Monsters, Inc.<br><br>We were all, at one time, scared of monsters under the bed. Shadows of clothes in the closet. Weird sounds outside in the trees. I remember thinking there were all kinds of monsters in my room - not as much under my bed as in the closet. And once again, Pixar, who brought us \"Toy Story\" 1 &amp; 2, plays on both adults' memories and children's dreams, making it equally enjoyable for both children and adults.<br><br>John Goodman voices James P. Sullivan, known as \"Sulley\" to friends. He is a big, blue, hairy monster with horns on his head and hands the size of a watermelon. Billy Crystal is Mike Wazowski, his wisecracking, one-eyed best friend. Both of these monsters live in Monstropolis, a world where monsters roam freely. Their city is powered by a rare source of power - children's screams. That is where Monsters, Incorporated comes in. At Monsters, Inc., monsters like Sulley and Mike open portals into children's rooms - through closet doors - and scare the children, capturing their scream in a little yellow bottle. Sulley is the top-scarer, bringing in the most scares. But Randall (the always enjoyable - even when animated - Steve Buscemi), a wormy, multiple-armed lizard-monster with the ability to change appearances to its surroundings, is jealous of Sulley, and will attempt anything to get more scares...even if it means taking a child from the real world and bringing it into Monstropolis. But after the child escapes, Sulley and Mike reluctantly look after it, all the while trying to get it back to the real world before Mr. Waternoose (the late James Coburn) and others find out about the incident...<br><br>\"Monsters, Inc.\" does for monsters what \"Toy Story\" did for toys. Pixar once again not only expands our mind, but our very worlds. I respect their company and commitment values very much, as you can read in my \"Toy Story\" review. They stick to the values that made Disney films so family-friendly back in the fifties and sixties: Respect for the audience, respect for quality, and respect for the audience's INTELLIGENCE, something Disney, who has recently coughed up a bunch of lousy, thoughtless sequels, has forgotten. Now, I know that LEGALLY Disney is co-creator of \"Toy Story\" and \"Monsters, Inc.,\" but they really are not. They just give Pixar the money and get their name branded on the front box of the film. And even then, I have heard multiple claims that Disney is very mean-spirited towards Pixar (read into sequel trouble for \"Toy Story 3\") and gives them the bare minimum.<br><br>But that is straying off the subject. \"Monsters, Inc.\" is one of the most enjoyable animated films I have ever had the pleasure of viewing. I didn't enjoy it as much the first time, but I then bought it, and have since watched it many times. It is an instant classic. I will be watching it years from now, when I am old and frail and in a rocking chair. It ranks right up there with \"Toy Story\" 1 &amp; 2, and all the OLDER Disney films from the 50's-70's. It has all the elements of a sweet, charming, emotional and pleasurably good-natured animated film. And, more coudos to Pixar: Thank you for not packing it full of the language and inappropriate content that Disney shoves into the dark recesses of their films nowadays.<br><br>Not only has Pixar brought back the \"Family Film\" genre to what it should be, but it also redefines it. Pixar's animated films are some of the most thoughtful, imaginative and enjoyable animated films ever - not to mention 100 % family safe. Thank you, Pixar, for getting back on track.<br><br>5/5 stars","user":"MovieAddict2016","rank":[115,131]}]