[{"title":"A good action-adventure film with great special effects","rating":7,"date":"11 May 2008","review":"Marshall is the kind of President referred to a change in the U.S. foreign policy He took a great risk when he stated that America will no longer tolerate any terrorist government His policy is soon put in practice when he boards his plane on his way home <br><br>Once is in the sky, 'Air Force One' is hijacked and currently controlled by Russian radicals who ask for the release of their leader or they'll execute a prisoner every half hour <br><br>Harrison Ford is the action hero making his way through the plane taking out few terrorists, managing to free several hostages, trying to get to his wife and daughter who are prisoners on board <br><br>Gary Oldman almost steals the show as the head terrorist Ivan Korshunov who takes over the president's plane<br><br>Beautifully directed by Wolfgang Petersen who controls the action with his usual extreme intelligence, building the challenge with captivating, tense sequences from every compartment of the huge aircraft to the White House contingent in Washington","user":"Nazi_Fighter_David","rank":[59,86]},{"title":"Fun to watch, if you do not make a big deal out of technical accuracy.","rating":7,"date":"19 June 2005","review":"Very entertaining action, once you get past the \"believability\" problems, i.e., terrorists getting on the plane at all, the plane having an on-board armory, Secret Service agents' inability to shoot accurately, etc.<br><br>Acting is good enough that you care about the characters.<br><br>As others have noted, the CGI aerial sequences sometimes have the aircraft moving in unnatural or impossible ways, and this is visually jarring. (After the touch-and-go, Air Force One turns a 180 almost like a helicopter) I gave it a 7 out of 10 - not brilliant, but makes for an entertaining evening.","user":"randallcameron","rank":[43,61]},{"title":"It is what it is......fun","rating":6,"date":"7 March 2005","review":"Nonstop action, thrilling suspense, dark humor, and a brilliant concept, this flag waving over the top action adventure was a good two hours in 1997.<br><br>The story: Enroute back to the States from Russia, Russian Nationals hijack the President's plane and hold him and his family (as well as most of his staff) hostage aboard Air Force One in order to release a Rouge General captured earlier.<br><br>Harrison Ford from his first minute to his last looks comfortable in his Presidential role. That's to say, Ford appears, acts and just plain feels like he should be President. (Come one who saw this movie and wanted him to run). Gary Oldman's performance as the main villain (Ivan) should be up there with the likes of Alan Rickman's Hans from Die Hard and John Malkovich's Leary-Booth-Carney from In the Line of Fire (coincidentally directed by Wolfgang Peterson as well). Glenn Close pulls of the Vice President role with smirks and spunk.<br><br>Stars aside I think the supporting cast should get an equal if not harder pat on the back. These guysand girls. really made the movie. They're the ones that brought the chuckles and caused gasps. Wendy Crewson (The Good Son) nailed her role with more grace than a first lady has actually shown in the last recallable years. Paul Guilfoyle (\"CSI\", The Negotiator), was the kind gentle, \"best buddy\", chief-of-staff, who brought a small smile to your face every time he is on-screen. Xander Berkeley (\"24\", Terminator 2), plays the chilling secret service agent Gibbs. The lovable William H. Macy plays the good-mannered Air Force Officer who puts himself in harm's way for the President more time than the Secret Service agents do. He just doesn't get enough screen time toward the beginning. And Dean Stockwell will have you cussing under your breath as the power-hungry Secretary of Defense. And it seems that Wolfgang Peterson watched every great Action/Military movie of the past 3 years and hired all those \"briefing room generals\". For this I applaud him. As for the terrorist, they rival those of Die hard. Cold, stone-faced, funny, smooth, and just plain hateable, they did their job.<br><br>The bulk of the movie takes place aboard the Air Force One no kidding eh?). And boy do you believe it. The production designer (Williams Sandell) obviously paid attention to detail, mimicking the real Presidential Aircraft. Small, claustrophobic and believable.<br><br>Andrew W. Marlowe's script gets it job done as well. Nothing award winning. It's everything you would expect given the story it has to tell. Couple times it will make you cringe, but again, look what it needs to accomplish.<br><br>The late Jerry Goldsmith's score for this movie is a hands down classic. Only having two weeks to score the film after Peterson rejected Randy Newman's work, Goldsmith with the help of Joel Mcneely composed one of the most bombastic, riveting, emotional, suspenseful, and patriotic scores I've heard come out of the film world. It works perfectly with the movie.<br><br>A few times your mind is going to be stretch you may have to resort to the \"It's just a movie\" mindset. Overall its fun. Not a bad way to spend 2 hours. Harrison Ford for President.","user":"Alvsy007","rank":[59,89]}]