[{"title":"A Little Something for Everyone.","rating":3,"date":"3 July 2002","review":"Wow. \"Wild Things\" is one of those trash masterpieces that is just so clever, so hot and so fun that it becomes one of the most interesting and under-rated films of the 1990s. The rich Denise Richards and the very poor Neve Campbell each accuse high school teacher Matt Dillon of rape, but there is something that is not quite right. Enter detectives Kevin Bacon and Daphne Rubin-Vega. They both doubt that the case is as simple as it seems. Boy are they right. The investigation leads to court where it is made clear by Dillon's attorney (Bill Murray) that the case lacks any real evidence to convict Dillon to prosecutor Robert Wagner's despair. The whole thing was a fabrication to get to Richards' mother's riches (Theresa Russell). But of course this is just the start and there will be double-, triple- and even quadruple-crossing and it is skewered who are good and who are evil or is anyone good? A brilliant screenplay by Stephen Peters and Alfred Hitchcock-styled direction by John McNaughton makes \"Wild Things\" a trashy, but highly impressive cinematic winner. 4 stars out of 5.","user":"tfrizzell","rank":[94,107]},{"title":"Seductive, slick and sexy; great entertainment!","rating":8,"date":"6 May 2006","review":"Wild Things is a fantastic example of what can be achieved by not worrying about substance and having a film play for straight entertainment value. Here we have a film that takes elements such as beautiful stars, beautiful locations and a bucket load of plot twists and blends it all into a highly enjoyable film experience. Of course, Wild Things doesn't always come across very realistically and, at times even, it's downright ridiculous; but it's done in such a way that it doesn't matter, and because of that we have a film that can do what it wants. The film is helmed by John McNaughton, who had his first success with the cult horror flick Henry: Portrait of a Serial Killer. It has to be said that the scene setting and way that the plot moves is somewhat ham-fisted, as sometimes it's painfully obvious that certain sections of the film exist only to give it another selling point; the argument that starts out between Denise Richards and Neve Campbell beside a swimming pool being a case in point. However, McNaughton makes good of these selling points, and for every three way sex scene and absurd plot twist, the film gains an extra point for trashy entertainment value.<br><br>It's not immediately obvious what Wild Things is going to be about, as the first twenty minutes serve only in setting the scene and from that base, the film could easily turn into any teenage school flick. However, it turns out that this time is well used; as by nulling the audience into a false sense of security, the film is able to make sure that every twist comes as a surprise. The film benefits from a great big name cast, which is anchored by Matt Dillon; who gives one of his best performances. Dillon clearly enjoys himself, and his persona is able to suit both the sleazy and upstanding nature of his character. Kevin Bacon sleepwalks and isn't really able to show his true talent, and similarly Neve Campbell looks out of place (sexy with it) in her role as a teenage junkie. However, Denise Richards rounds the piece of nicely with a charged performance and the ensemble is nicely topped off by the likes of Bill Murray, Theresa Russell and Robert Wagner. The settings that the movie takes place in look great, and ensure that there's more eye candy than just the female leads. Director McNaughton presents a fabulously mysterious atmosphere which obviously bodes well with the plot and, on the whole, if you want a couple of hours of entertainment; you can do a lot, lot worse than this twisty little flick.","user":"The_Void","rank":[81,92]},{"title":"Everybody's right!","rating":8,"date":"15 April 2008","review":"Yes, it's lurid. Yes, it's trashy. Yes, it doesn't stand up to close scrutiny. And yes, if you're the sort of person who specialises in spotting plot twists, then you're probably going to do well here.<br><br>But if you haven't seen this film before, and you're prepared for something a bit on the lurid and trashy side, and you can manage to steer clear of the many spoilers among the reviews here, then you just might find that Wild Things is a fun ride.<br><br>Because there are, it's true, a number of twists and turns, and not everyone sees them coming. And if you aren't a twist-spotter, but you enjoy movies with twists, then you are going to enjoy this one.<br><br>I thought it was great fun. And, let's be fair, who's watching Denise Richards' acting?","user":"neil-476","rank":[64,73]}]