[{"title":"In Space, Um, No One, Um, Nevermind","rating":7,"date":"11 January 2007","review":"In this fourth gripping installment of the Hellraiser series, we are treated to the story of the Lament Configuration (or Lemarchand's Box or whatever you call it). It involves demons, Pinhead, some French people, architecture and outer space. Pretty good deal.<br><br>This film is my favorite in the Hellraiser series. By itself, there is not much going on. I can understand why many think this film is weak. If I just watched it without the entire series, I would be like, \"what the heck?\" But I think this really ties the first four films together, explaining how everything fits.<br><br>I have read reviews that say the film is inconsistent and that it does not line up with the other films. I say hogwash. The film makes perfect sense. And it lines up with the others just fine. I guess you could say things like \"how did the box get from x to y\", but I think it is pretty clear. The French guy had it, then it went into circulation, then the Cottons had it in parts 1 and 2, then the news reporter in part 3, and she buried it in the cement where it was pulled out this time. What is not to understand? <br><br>I could say the space aspect was cheesy. Leprechaun has been to space, and later Jason Voorhees went to space. Others probably did, too, that I cannot think of offhand. But unlike Leprechaun, this made sense... it was actually central to the plot and could not have been done on Earth in any conceivable manner. So the space thing is not so bad.<br><br>As I mentioned in my review for \"Hellraiser 3\", I dislike how writer Peter Atkins introduced new cenobites. This movie has more, including twins and a former demon (which really makes no sense to me). What determines who becomes a cenobite? Pinhead? Maybe this will be explained in a later film, but probably not, and it is not really explained here.<br><br>The director disowned this film due to massive re-shoots he had no part in. I, for one, would love to see his version. While I have already said this is my favorite, perhaps the other is something worth checking out. Also, it would stifle some of those critics who think it was reassembled as a senseless pile of bangers and mash. I disagree with those critics and would love to see them eat their words.<br><br>After seeing parts 1 and 2 (and presumably 3), watch this. Do not listen to the nay-sayers. If you want to know how the whole Pinhead, box and whatnot started, this is the film to explain it to you. (You might ask how Pinhead got out before the box was created, but you would be silly, because he was not born yet.) I support this one and you should, too.","user":"gavin6942","rank":[34,40]},{"title":"Better than I expected","rating":6,"date":"6 November 2002","review":"Oh my! The dreaded space sequel. I must admit, I thought this would bump three out of worst in the series, but I was dead wrong. The one thing I found most appealing about this sequel, is the fact that it leaves room for more sequels, as long as the don't go past the year of Pinhead's final death. Which I may say, they took full advantage of, in making Hellseeker, and Inferno. I think that even though it was good, it still takes a backeat to the original two films. (Part two being my personal fave)","user":"tri_state_this","rank":[12,13]},{"title":"Very well done! C'mon, have you actually SEEN most other 'Horror' films...?","rating":8,"date":"31 December 2011","review":"Okay, I wasn't going to bother writing a review for this one and I rarely take the time to write reviews here, BUT... Seeing this undeservedly LOW score here made me feel that I really had to 'say' something.<br><br>First off, YES, I am indeed a BIG fan of the first three films; before these just recently came out on glorious Blu-ray, years ago, I even sprang for the UK Puzzle Box set of the first three films (mainly because at the time UNCUT versions were not available here in the States and also for the full commentaries and the bonus DVD that came with it : ) Now, I know it is hard to believe, but I just NOW for the very first time saw this one, part 4; the reason being is that from some casual stuff I had read, I was under the impression that pretty much all the other 'HELLRAISER' films were not very good. Well... Let me tell you, I was extremely surprised and impressed! As I said, compared to all the REALLY AWFUL Horror films out there that are excruciating and badly made, and that is most of them, I was surprised that this one was made quite well. <br><br>Okay, so a lot of the fans are sort of put off because it is really different from the other films. Fine... Isn't the POINT to try to come up with different angles and new approaches rather than just remaking the same film again and again...? I thought it was genuinely very creative and kept my attention very much so throughout the film. Sure, okay, it starts in space and your rolling your eyes, thinking \"Oh great,'LEPRECHAUN 3'\" :) well, it works; it really does. Obviously a LOT of thought was put into the timeline and the mythology of the box, etc., not to mention the follow through at the end. Sure, it wrapped it up rather quickly and left it kind of ambiguous, but so what?! Yes, of COURSE it doesn't have the intensity of the original or even the complexity of the next two films, but to me I was mainly impressed by their not only coming up with the new idea to show the origins, etc., but also I honestly felt that everything that made up the film was done very well considering that it is a damn 'HORROR' movie! : ) I gave it a good, strong '8' which it fully deserves considering the context and type of film. I think that people get SO jaded and expect SO dang much from sequels. I mean, C'mon, compared to what... 'WITCHBOARD' 1-9 or whatever the hell sequel they're at now, this here is pure art!<br><br>Heh, if THIS one threw you, just wait until you see part 5! I just this minute finished watching that one for the very first time also a few minutes ago and that is a WILD departure from the early films. However, it was made even much better than this one; the director was actually very, very good!","user":"lathe-of-heaven","rank":[11,12]}]