[{"title":"A Haunting, Strange Tale Of Forgiveness","rating":8,"date":"10 May 2006","review":"A strange movie. That's what I thought when I first saw this a decade ago. It was one of those films I thought about a couple of days later and couldn't get out of my head for a short while. When I saw it again a few years ago I almost had the same reaction.<br><br>What's different about this film is the message: forgiveness. That's really what it's about and it's done in a touching way even though most of the characters in here are anything but nice, sentimental people. <br><br>If you can enjoy a good character-development story and not get too dismayed by a depressing scene or two this movie will reward you with some intangibles that are hard to describe unless you've seen this. <br><br>Jack Nicholson, David Morse, Angelica Huston and Robin Wright make for an interesting foursome, I'll say that. Nicholson, particularly, impressed me with an untypically-subdued role for him. (Note: The profanity and nudity in here was totally unnecessary and the film would have been better without it. The story was powerful enough on its own.)<br><br>If you don't like this movie, I would understand that, too. It's not an easy film to like. It will either haunt you or put you to sleep. It haunted me.","user":"ccthemovieman-1","rank":[36,46]},{"title":"A powerful and compelling story, filmed well and with some great performances.","rating":9,"date":"18 April 2003","review":"A powerful and compelling story, filmed well and with some great performances.<br><br>Sean Penn seems to have managed to level the actors here, with David Morse, Anjelica Huston and Jack Nicholson putting in great performances and none of them stealing the scenes from the other. I found this very surprising as I expected Nicholson to flood the screen, as he so often does with such little difficulty.<br><br>However, the emotion between Huston and Nicholson in the latter half of the film during the coffee shop scene is so powerful to watch. Huston is such a wonderful actress, and Nicholson shows some emotional depth that I haven't seen before, or rather, not felt with his performance before.<br><br>The story is written and planned extremely well, with tension rising slowly and almost imperceptibly, until the final day. I found myself caught from the opening scenes of the counselling session cut with the drunken, partying Nicholson, right through to the pivotal moments of the main characters lives.<br><br>It is a fantastic way to address this subject. To examine it from both sides, and keep each side with its own sympathies and understandings. Cleverly your sympathies and hatred are swapped throughout the story.<br><br>I hope there's more to come like this.","user":"Rich B","rank":[33,44]},{"title":"Outstanding Film!","rating":15,"date":"15 April 2004","review":"I puzzle at those reviewers criticizing this film, which to my mind is a tour de force.  Of course, I do volunteer work with dying folks and help train aspiring grief counselors to deal with the traumas that life all too often brings us.  I can only assume that those who so quickly dismiss this powerful meditation on grief and remorse have yet to experience these real life emotions.  Something by Schwarzenegger may be more to their taste, or one of the ubiquitous comic book recreations we encounter most summers with cardboard characters and pseudo emotions.<br><br>Sean Penn is plumbing much deeper regions of the human psyche, and doing so with actors of rare talent, fully capable of sharing with us their heart rending vulnerabilities.  Few actors have the courage to go to the places these actors visit as they face suffering almost too great to bear.  I'm reminded of the more recent Mystic River for which Sean Penn received an Academy award for best actor, a movie that explores equally traumatizing events.  It was heartening to watch the joy with which this award was greeted by his fellow professionals who have long acknowledged this man's genius both in front of and behind the camera.  This movie deserves a much wider audience of discriminating movie viewers.","user":"CurtisGrindahl","rank":[26,41]}]