[{"title":"Poor Clay has the mother of all problems.","rating":7,"date":"9 November 2009","review":"When his elderly mother Emily (Jeanne Bates) is attacked by her lodger Nestor Duvalier (Brion James) and turns into a cannibalistic monster, TV news reporter Clay Dwyer (Mark Thomas Miller) struggles to keep dear old mom from satisfying her hunger.<br><br>Although the above plot summary conjures up images of trashy, over-the-top, 80s horror titles such as Flesheating Mothers and Rabid Grannies, Mom actually turns out to be a refreshingly original take on the werewolf/vampire/zombie mythos (exactly what Emily becomes is never really clear, but it ain't nice!), as well as a touching study of the close bond between mother and son: Clay's devotion to his mother leads him to abandon all of his other responsibilities, including his job and his relationship with pregnant girlfriend Alice (Mary Beth McDonough), whilst Emily's love for Clay ultimately drives her to self-destruction.<br><br>Technically, the film could be sharper, with more stylish direction and better effects (the shots of the creature are kept very brief, so as not to disappoint), and certain more experienced members of the cast frustrate with terribly cheesy performances (Yes, Brion James and Stella Stevens, I AM referring to you); fortunately, however, the strong emotional undercurrent in the well constructed story is enough on its own to ensure that Mom is an effective, compelling, and occasionally shocking tale—one which I have no hesitation in recommending to those looking for something a little different.","user":"BA_Harrison","rank":[13,13]},{"title":"Director Rand's one n only bland directorial effort. It's more of a sad story than a horror or comedy. The poster of a werewolf is misleading.","rating":4,"date":"13 December 2019","review":"I first saw this in the early 90s on a vhs. Revisited it recently.\nThe only saving grace is Brion James in a small stint.\nThere is zero tension n suspense, the kills r offscreen n the ending a big meh.","user":"Fella_shibby","rank":[13,14]},{"title":"MOM is truly a great American horror movie.","rating":9,"date":"30 July 2010","review":"The first time I viewed the film Mom, I was 12. It was one of the least expected horror films that I thought I would actually like having been raised on the classics of the genre including the 80's slasher and grindhouse fare that I loved. Late one night this film \"Mom\" was coming on Cinemax and I began watching it, wondering how dull and boring it would be. About a couple minutes in, this creepy guy turns into a creature and bites into this woman's stomach. I was like \"Hell Yeah.\" As film goes , A kindly old woman named Emily Dwyer takes in the creepy guy, who by this time is seen as a blind man looking for a room to rent, as the new tennant. The Tennant's name is Nester and he is rarely around during the night, having the need to \"go out to eat.\" As Emily decides to get more familiar with Nester by making him dinner one night, Nester attacks the nice old lady. After that, Emily's son, Clay Dwyer, a nightly Newsreporter, begins to worry about his Mother because he hasn't spoken to her in a few days. He soon comes to find out that Emily has become a flesheating ghoul and Nester is the cause of it all. After killing Nester in a fiery blaze, Clay is left to watch over his Mom, keeping her locked and barred in her room like a prisoner, starving her to the point of madness. Emily eventually escapses and goes on a rampage, killing an undercover cop. When Clay's pregnant wife tries to visit and check on Emily, Emily tries to attack and consume the flesh of her and her unborn child, only to be thwarted by Clay and a few cops. After taking care of the cops by killing and eating part of them, she knocks Clay out a window where he appears to be dead. The motherly instinct takes over and the beastly looking Emily screams into the night a cry of horror because she believes she has killed her son. The climax is the most saddening of any I have ever witnessed in any horror film, this is in part that Emily comes down the stairs, her face covered in blood, crying. She enters the kitchen as Clay comes crawling weakly and painfully through the front door. As Clay prepares to go up the steps, a sudden explosion comes from the kitchen. Clay scrambles for the kitchen where he comes to find the charred body of Emily lying on the floor, who waves an \"it's alright now\" frail and burnt arm as another explosion consumes her body in flames. Clay screams as he watches the exploison take his mother's life. Clay turns to see his wife, who has been untouched by the monstrous Emily, helping him to get out of the house. Then Credits.<br><br>This film is in a totally different league of it's own. It's fresh and takes the whole zombie/werewolf/vampire tale to a whole new level. It remains one of my favorite horror films because of it's uniqueness. My favorite line in the movie comes when Clay is starving his Mother, who has been locked in her room and hasn't eaten in days. As she claws and bangs on the door, she screams in a guttural demonic voice, \"Let me out of here!!! I'm your Mother,Goddamit!!!!\" I have never seen anything else like it. If you've never seen this monsterpiece, I highly recommend it... it will make you think twice before pissing off your Mom.","user":"godofthunder2099","rank":[8,9]}]