[{"title":"A very beautiful Irish setting, a most somber Irish tale","rating":6,"date":"16 January 2007","review":"It's 1957 and the setting is a small village in Ireland. Tara (Robin Wright Penn) lives with her sister and runs a tailoring/dressmaking shop. She has recently set the local tongues to wagging by having a baby out of wedlock and not naming the father. The town priest is encouraging her to look at Brendan (Albert Finney), a local police officer madly in love with her, as a possible husband. But, Tara is not in love with him and won't consider it. A second suitor actually commits suicide for the love of her, it is supposed. Only when a troupe of actors comes to town does Tara meet someone who interests her. That would be Tom (Aidan Quinn), a most friendly and engaging gentleman who stars in the troupe's productions. However, Brendan is most displeased to have a rival and thwarts Tom's attentions as best he can. Will Tara be able to find happiness? The Irish setting is beautiful, as no one can disguise the loveliness of the country. However, the story here is most somber. Life in this village is restrictive and sobering, with hardly a break, for anyone, from the harsh realities of life. Penn's Tara is a very worthy lady, who defies the odds to keep her son. Finney is wonderfully scary as the policeman who hounds Tara, day and night, to accept his hand. By contrast, Quinn's Tom is a breath of fresh air, with his good spirits and funny manners. If you wish to see Ireland, and can put up with a story of a depressing nature, this is a good view. For, although the tale is sad, it does have its moments and the scenery is a knockout. Just do not expect a mirthful tale, as depicted on the handsome box cover.","user":"inkblot11","rank":[15,16]},{"title":"great spirit; great acting","rating":10,"date":"29 October 2005","review":"In the tradition of low-key Anglo-European films, this is a brilliant depiction of the meeting of an independent spirit with a closed community. This is one of their own so they will not condemn absolutely. At the same time they cannot understand why, or how, anyone can take a radically different path. Paraphrasing Victor Borge, this is acting that is so low key it is off the keyboard but because of that it resonates in a register that affects absolutely. Absotutely brilliant. This is what real movies are all about. See it! I don't really have any more to say but the instructions are that one has to write a minimum of 10 lines and/or 10,000 words. Hopefully this entry meets that minimum requirement because if this entry convinces one more person to see this movie it will have been worth it.","user":"pwmushkat","rank":[15,16]},{"title":"A band of strolling players are we!","rating":7,"date":"7 June 2003","review":"This film was billed as a drama.  You could have fooled me.  The productions of the travelling group of thespians are the funniest things I have ever seen.<br><br>Forget the plot about the young unwed mother with two suitors and just watch the hilarious performances of the rag-tag travelling gypsy players who tour Ireland performing in a threadbare tent, led by the flamboyant actor manager played with gusto by Milo O'Shea. For those of you who are not familiar with this great Irish stage actor, Mr. O'Shea played Sam Malone's Irish Uncle in the Woody's Wedding two-part episode of Cheers, on TV.<br><br>\nThe troupe of players are not above changing the script to accommodate whatever actors or costumes are available, and they open up with a song and dance act, no matter what the play. Lines are read from cue cards, and even made up as they go along.  Even Othello begins with a can can.  You will never be able to watch Gone with the Wind with a straight face again after you have seen it performed as a musical in a tent in a small Irish town. I have not laughed as much since I saw the theatrical troupe in a Midsummer Night's Dream.<br><br>The lead actors, Robin Wright and Aidan Quinn make an attractive couple, and Albert Finney does well as the heavy, but it is the players who make this movie such a joy.","user":"emuir-1","rank":[14,22]}]