[{"title":"The Horse Whisperer","rating":9,"date":"10 October 2005","review":"This is a unique, moving story about a girl whose tragic horse-riding accident and subsequent trauma led her family to Montana in search of the man known as the Horse Whisperer. Little did they know that their lives were about to change forever during these few, memorable days spent on the farm. This is a truly beautiful story, a story for sensitive souls, a story for those who care about animals as much as people. The characters are finely drawn and it is a pleasure to watch them unfold as the film progresses. The dialogues are often memorable and wonderfully devoid of the clichés that most Hollywood productions are sprinkled with. <br><br>This is a film for people who understand that the 'little' moments in life are the best; a film where pictures truly speak more than a thousand words.<br><br>It is a story of love and courage, the courage to fight for you want, or accept things the way they are; the courage to risk losing everything, the courage to accept that loss. There is a wonderful message in this film for all of us - for all those who care enough to see it, that is.","user":"janela","rank":[35,39]},{"title":"Some of the most beautiful cinematography you will find","rating":9,"date":"12 January 2006","review":"It is one of Robert Redford's best - the quiet rancher - meets the pushy high powered NYC editor who is determined to help her daughter after a traumatic riding accident.<br><br>As others have mentioned the experience not only changes the horse but most of the \"supporting\" characters. <br><br>The cinematography was powerful - while I am not a student of the discipline I could see that the angles chosen for the subject, the landscape scenes of the beautiful Montana ranges and sunsets - one could watch and understand the movie without the dialog. <br><br>I believe Ansel Adams - if he were alive - would love some of these scenes. <br><br>I vote this as a \"must see\" for everyone. It not only has a powerful plot but beautiful cinematography...","user":"wbhome","rank":[42,50]},{"title":"Great movie. Great entertainment.","rating":26,"date":"26 August 2003","review":"I must have seen this movie at least five times, and somehow I never tire of seeing it even though it's not really my kind of movie.<br><br>I won't go into plot, and things like that, I'll just say it's exquisitely shot, beautifully acted by all with young Scarlett Johannson being a standout. But of course, Robert Redford deserves special mention for this is not only one of his best directed films, but also he gave himself one of his better roles. He's very good here. There's a close-up on him at the end of this film that has to be seen to be believed. Everything his character is feeling at that moment is revealed perfectly on his face. It's one of those moments that happen every once in  a while. One of those moments that make you glad there is a thing called film.","user":"Iceman-15","rank":[9,9]}]