[{"title":"Unsung genius with unsurpassed comical moments","rating":9,"date":"17 August 2009","review":"This is one of my favourite films of all times. I've watched it dozens of times. The plot of the film is probably less important than the brilliant one-liners and cameos, although maybe you have to be British to understand the subtle but incandescently funny subtexts that run through the whole film. <br><br>Margi is an excellent actress although I guess her in depth experience of the Liverpool psyche means she was playing a role that was kind of like just being herself a lot of the time maybe?<br><br>You have to realise that not all the lines are meant literally. Like in the fight scene at the beginning of the programme (has me in stitches every time I watch it). The wonderful Margi Clarke gets fisty cuffs with the superb actress Tina Malone. Tina warns Margi \"Now GIT... Before I throw a bucket of p&amp;*^ss water over ya\". This is a classically hilarious line. Please don't construe from this that all people in Northern England keep a bucket of urine water handy, ready to throw over aggressive strangers.<br><br>:)<br><br>A","user":"theandytaylor","rank":[6,10]},{"title":"Blonde Fist","rating":2,"date":"12 May 2018","review":"I was reacquainted with Blonde Fist a couple of weeks ago thanks to Talking Pictures TV; I only have a vague memories of this film's release back in 1991 - it was concieved, I assume, as a star vehicle for flavour of the then moment Margie Clarke, who was on something of a roll following an impressive turn on the long neglected (and unfairly so) social drama 'Making Out'.<br><br>Written and directed by her brother, co-starring her sister, Blonde Fist soon sank without trace. Drably shot and sluggish paced, the story seems to take forever to get going; Margi Clarke tries, but she is uncomfortable as she is unconvincing in the leading role - hampered by an unfunny script that's stuck between the far superior Boys From The Back Stuff, or an overlong episode of the dreadful Liverpool based situation comedy Bread, and a supporting cast of sanctimonious bullies and clichéd stereotypes.<br><br>Give this one a miss - it flopped for a good reason; the only point of note is an early appearance by Stephen Graham, and a small role for veteran Scottish actress Julie Graham; both made a better ''fist' of their careers than Margi ever did...and neither of them were related.","user":"wilsonstuart-32346","rank":[3,4]},{"title":"Misbegotten drama that swings and misses","rating":3,"date":"27 July 2019","review":"A British boxing drama; A working-class Liverpudlian, prone to using her fists to settle disputes and wrongs against her family and friends, travels to New York to find her estranged father. Needing cash to rebuild her life, she joins the women's boxing circuit.\nThis is a lumbering drama with a poor and blatant dialogue, particularly with all its fighting talk which doesn't sink deeply with its overly palpable delivery. Margi Clarke is at least striking for her efforts, packing a mean punch as a scrappy and devoted mother, but there is very little to engage with due to a story that doesn't grip, and performances that are weak. The fight sequences are choreographed well enough, but not impressive enough to be waiting around for.","user":"shakercoola","rank":[1,1]}]