[{"title":"Strangers on a Train vs The Usual Suspects","rating":6,"date":"1 July 2004","review":"It would appear that the writers of this rather muddled movie were in a big rush to get the script in.  They borrowed elements of a number of movies, including the two in my summary, patched them together and voila.  Instant movie.  <br><br>Don't get me wrong, this movie isn't a total loss.  If you just consider the acting, we have two standouts.  Peter Greene as one of the vilest villains I've seen in a while, and Clea Lewis as the greedy, vindictive wife of the best friend.<br><br>Let's not forget Halle Berry.  No, let's not.  Her acting is always credible, even when she's forced to recite lines like these.  And I can assure you she is as adorable in person as she is on screen.  I worked with her on a mini-series called \"The Wedding\" some years ago.  She was pleasant, professional, cheerful, friendly, and beautiful.  Gee, I almost sound like I'm gushing, but I have worked a lot of movies with a lot of actors, and she really did stand out.  <br><br>All in all, I don't think you can lose by spending a little time with this movie, but I have to warn you:  There are more plot holes in it than there are pot holes in Jersey City.","user":"howdymax","rank":[20,27]},{"title":"Really Not A Bad Movie","rating":27,"date":"27 February 2005","review":"I started watching The Rich Man's Wife, even though the title alone would suggest a crappy, soap-ish kind of movie. But I was pleasantly surprised with this murder mystery, although in flashbacks we see that there's not much of a mystery as to who was killing who.<br><br>What I liked was the way Halley Berry's character's handled herself in such a strong, almost \"Ripley\" like way; not some simpering, whimpering victim. She shoots the \"bad guy\" with a precision that professional marksmen would envy. It's a good movie, right up to the ending, then along comes that final twist-- the one plot twist too many-- that shot the whole movie to hell for me. Had the last five minutes not happened, for it me it would have been almost perfect movie, so I give this movie 5/10.","user":"ryon-2","rank":[15,21]},{"title":"It's worth taking a look at","rating":5,"date":"18 January 1999","review":"This wasn't a bad film, it was entertaining, made you guess most of the time, and was pretty tense, its only flaw is some stupidity, and the jump scenes in it are predictable. Plus the film itself is predictable, but it is good, and it worth watching. Halle Berry is sensational as The Rich Man's Wife. The ending is especially satisfying, making your jaw drop to the ground. I give it a 7 out of 10. Rated R for strong violence and language.","user":"MovieFan983","rank":[10,15]}]