[{"title":"A Perfect World Is Perfectly Watchable!","rating":8,"date":"27 September 2003","review":"Some aspects of this film work better than others, but overall A PERFECT WORLD is a highly watchable film.  Kevin Costner delivers a fine performance as escaped convict Butch Haynes. The film primarily focuses on the relationship between Haynes and an innocent 8 year old boy named Phillip whom he kidnaps and befriends (well played by TJ Lowther). Haynes has killed two people thus far and gives the impression of a being a loose cannon, but Eastwood evokes sympathy for the character as the audience learns about Haynes troubled childhood (raised without a father by a prostitute mother - killed a man by the age of 8) and observe his genuine care and concern for the boy. Their relationship is reminiscent of Allan Ladd and the young boy in SHANE. As he slowly feeds us more information about Hayne's history, and lets the audience wrestle with its ambivalent feelings towards Costner's character, Eastwood keeps the film moving with lots of close brushes with the law, car chases and shoot'em ups.<br><br>Where the film doesn't work quite is when Eastwood himself is in front of the camera,  playing a minor role - Chief Red Garnett - a Texas Ranger who's in charge of Haynes' capture.  The primary function of his character, and Laura Dern's (who plays Sally Gerber - a criminologist the Governor forces upon the Chief) in the script is to supply further information about Haynes' past. Unfortunately, Eastwood tries to flesh out the relationship between these characters through antagonistic chauvinist attitudes towards Gerber and creating a power struggle between the two which (big surprise!) over the course of the film, gradually leads to a mutual respect between them! Granted Eastwood and Dern have marquee value - especially Eastwood, are fine in their roles, and, of course,  chauvinism was alive and well in 1960's Texas, but I mostly found these minor subplots annoying and unnecessary. It's the scenes and issues focusing on Costner's character that are the life blood of this picture. This criticism aside, Eastwood does a solid job directing, weaving action, suspense and thought provoking human drama into a well knit weave and Costner delivers one of the best acting performances of his career.<br><br>7 1/2 out of 10","user":"tarryrob","rank":[77,90]},{"title":"All you Kevin Costner haters out there, WATCH THIS MOVIE!!!","rating":9,"date":"27 July 2003","review":"Kevin Costner's career has been in a downward spiral (to say the least) over recent years.  Now it seems like even people who admired him at first are suddenly forfeiting their compliments and jumping on the bandwagon, along with the rest of the Costner haters.  Well, I'm not gonna jump on that bandwagon.  This movie is sheer proof that Costner is a wonderful actor capable of playing characters of multiple dimensions.  Here, he's given the challenge of playing a likable villain, without having us forget that he has criminal tendencies.  I'm not condoning criminals, but do you honestly think every criminal in the world is a cold-blooded motherf***er with not a single scruple?  They're human beings like everyone else, only they choose to live dishonest lives.  In other words, the easy way out--at least that's what they think.  <br><br>Costner played a completely one-dimensional villain in \"3,000 Miles to Graceland,\" but it was fitting to the tone of that film, which plays out like a comic book fantasy.  His character of Butch is much more realistic, and his main scruple is treating children like dirt.  He himself was treated like dirt as a child, and whenever he sees mothers or fathers do the same to their children, he goes nuts and sometimes homicidal.  A very interesting character, which Costner plays to absolute perfection. <br><br>\nI have a theory about movies.  Whenever you have an adult story (excluding children's and family-oriented material) involving a child in a major role, the movie often turns out either good or great.  This one turned out great. Good movies come more often than you think.  Great movies don't come quite that often.  A real motion picture experience is when you get lost in the story to the point where you feel you're right there with the characters, and not sitting on your couch watching these characters on a TV screen. This is one of those experiences.  <br><br>The film is totally character-driven, which also appeals to me.  It took me a journey through the lives of Butch and the young boy.  I felt a deep connection to each of them.  The ending had me pouring with tears. <br><br>\nI have to give it up for Clint Eastwood, who usually scores behind and in front of the camera.  The film runs a little over 2 hours, but when you have solid characters like these the time flies by in a snap.  Hell, \"Corky Romano\" was under 90 minutes long and I may as well as have been watching it for 10 hours.  The most powerful scene, in my opinion, is when Butch and the boy stay over the home of the black slave.  Butch sees the way the father physically abuses his son, and goes to the extent of tying him down to a couch.  He then forces the father to say \"I love you\" to his son, like he really means it.  <br><br>\"A Perfect World\" is a film I'll never forget, and I'm so damn glad I spent my 14.99 to purchase the DVD.  I have only one very minor complaint:  the guy who plays Philip overacts like crazy in a cartoonish performance. <br><br>\nMy score:  9 (out of 10)","user":"MovieLuvaMatt","rank":[88,108]},{"title":"Eastwood and (especially) Costner Deliver","rating":9,"date":"18 December 2005","review":"Simply a great movie. I gained a new respect for Costner after seeing this movie. He's always good as baseball players and cowboys, but this character is really a perfect fit for Costner. Combines all the elements that add up to a great Costner performance: humor (Crash Davis from Bull Durham)+ dark violence seething under the surface (Charly from Open Range)+ Child-like enthusiasm (Ray Cansella from Field of Dreams). Severely underrated, A Perfect World stands right up there Eastwood's best behind the camera achievements. And in case you haven't figured this out yet; Eastwood is the man, so do yourself a favor and check this movie out.","user":"boprieto","rank":[24,27]}]