[{"title":"Exquisite cinematic poetry","rating":10,"date":"26 August 2007","review":"Carl Jung said \"What is not brought to consciousness comes to us as fate\". For Hiroko Watanabe, the passing of two years has not lessened the pain brought on by the death of her young fiancé, Itsuki Fujii (Takashi Kashiwabara) in a mountain climbing accident. She longs for healing but is unable to let go of his sudden death. Fate intervenes, however, and a single letter she writes to her deceased lover as a whim sets in motion a chain of events that allows her to discover the untold secrets of their connection. Written and directed by Shunji Iwai and based on his novel of the same name, Love Letter is a simple but very moving love story about two people who must redeem the past in order to be fully alive in the present.<br><br>While looking through her fiancé's old school yearbook after the memorial ceremony, Hiroko wants to find something of Itsuki that she can hold onto, some token that will allow her to let go. Finding his name in the yearbook, she jots down the address associated with the name Itsuki Fujii and mails a short letter addressed to him in Otaro in northern Japan. She asks \"How are you? and tells him, \"I am fine\". Thinking that she is sending a letter to heaven, she is supported by Akiba (Etsushi Toyokawa), a close friend of Itsuki who has fallen in love with her and strongly wants her to complete the past. To her surprise she receives a reply and, after the exchange of several letters, discovers that her correspondent is not a disembodied spirit but a very alive woman with the same exact name as her fiancé. Even more astonishing is that both male and female Itsuki Fujiis were classmates together in Junior High School.<br><br>While there is some initial confusion stemming from the fat that both Hiroko and the female Itsuki are performed by the superb Miho Nakayama in a dual role, each character's personality is so individual that any confusion is soon dispelled. As the letters continue, Itsuki uncovers some hidden truths about herself, her father's death, and her relationship with the shy student with the same name. Bringing to light memories from the past that she had long buried, she remembers how they were teased by fellow classmates for having the same name, how they developed a bond while working together in the library, and how the male Itsuki, checking out books from the library, wrote his name on five checkout cards saying to her in English \"straight flush\".<br><br>Sensing that Hiroko's quest for completion has reached a dead end, Akiba takes her on a trip to Otaru to meet the female Itsuki and to search for some memento of her fiancé. In a memorable scene in which, in the words of author Marion Woodman, \"the eternal crosses the transitory\", Hiroko cries out to the mountain that holds the body of her lost love, \"O-genki desu ka? \"Watashi wa genki desu\", \"How are you? I am fine\", and the words echo through the winter night to be repeated by the female Itsuki sitting in her home miles away.<br><br>Love Letter is a film of exquisite cinematic poetry that explores the subjectivity of memory and the idea of redemption. Author Robertson Davies says, \"One always learns one's mystery at the price of one's innocence\" Like gemstones of coral and quartz that fill our life with joy, Itsuki Fujii came into the lives of two young women, then as suddenly as he appeared, he was gone, yet now both Hiroko and the female Itsuki have established a strange connection and are, in the words of Elizabeth Lesser, \"no longer dead, but alive with something luminous and solid burning in their core\".","user":"howard.schumann","rank":[21,21]},{"title":"Beautiful, and platonic","rating":20,"date":"20 June 2002","review":"Itsuki Fujii writes letter for her dead boyfriend who died in climbing accident few years ago. And all of a sudden, she get's reply.<br><br>The movie is warm and beautiful description of longing for a lost love and nostalgia. Miho Nakayama is ever so beautiful and innocent, and her acting as both Itsuki Fujii and Hiroko Watanabe is just professional. I rather say, couldn't be better. The music and the very atmosphere of the movie is somewhat Japanese, it has something really distant and beautiful. In movie which deals with love, always good sign is that if it does have very few or none scenes where love is physical such as kissing or making love. This movie shows love as somewhat ideal very mindfull and platonic. Works for me, for you, I don't know. Really beautiful movie what I can recommen to everyone. I rated this 10, since couldn't find any reason to give 9.","user":"jaakkochan","rank":[27,28]},{"title":"Beautifully crafted, haunting movie. Iwai is a master of his art!","rating":17,"date":"17 April 2002","review":"I'm still trying to decide whether SWALLOWTAIL BUTTERFLY is the greatest movie ever made or not. If it were the greatest movie of all time, you'd think it would be a bit better known surely? But I really can't think of any movie I've ever seen that was better. This is obviously something of a difficult position for Shunji Iwai to find himself in, in relation to me. If the first movie of his that I saw was the greatest movie ever, then surely no matter what efforts he goes to he's never really going to impress me again. <br><br>Knowing that SWALLOWTAIL BUTTERFLY is very different to the rest of his filmography, in terms of themes and sheer scale of the production, I was quite apprehensive about paddling deeper into Shunji Iwai waters. The rest of his movies don't/didn't really sound like \"my sort of thing\".<br><br>LOVE LETTER is based on a strange premise of unlikely coincidence. Two years after his death, Itsuki Fujii's fiance Hiroko (Miho Nakayama) is still having a hard time moving on with her life. When she comes across his old address in his high school yearbook, Fujii's mother tells her that the house was demolished for a highway years ago. Hiroko hence figures that it is safe to send a letter there, seeking closure. <br><br>\"Itsuki Fujii, O' Genki desu ka?\", she writes. \"Genki Desu, Hiroko Watanabe\". <br><br>(\"How are you, I am well\") <br><br>Not the most heartfelt expression of mourning, it must be said. Still it makes her feel better... but when she receives a reply to the letter she is a little confused. <br><br>\"Mostly well... but I have a cold now. Itsuki Fujii\" <br><br>Is it a letter from heaven? She would like to believe it is. The viewer, however, knows that the reply is actually from a different Itsuki Fujii - a woman (Miho Nakayama) who lives in the same town where Hiroko's fiance grew up. Once the confusion is eventually cleared up, Hiroko and Itsuki begin to write to each other as pen-pals. It turns out that Itsuki Fujii (female) was in the same class as Itsuki Fujii (male), so she tells Hiroko stories and memories from her youth. <br><br>The attentive amongst you may have noticed that Miho Nakayama is credited twice above. No, it's not an even more unlikely same-name co-incidence. The same actress plays both Hiroko and Itsuki... I suppose it worked out cheaper that way. The movie is hence hinged heavily upon her performance(s), as most of the 115 minutes is filled with her either writing or reading letters to/from herself. <br><br>Thankfully, she is absolutely fantastic in both roles. I think I would have cast her as all the other characters too if I were directing. Thankfully, Shunji Iwai is more sensible than me and kept it to a more manageable 2 parts. <br><br>A movie about 2 people writing letters to each other sounds kind of boring, right? The movie is filled with such gorgeous music and imagery that it never gets at all boring though, and Miho Nakayama has such a beautiful voice (and face for that matter) that I could happily listen to her talk for a very long time. <br><br>It's not all letter writing though - we also get invited in to see all the little details of both women's lives, and through flashbacks we see quite a bit of the two Itsukis' youth as well (the young actor &amp; actress playing these roles are also very good). <br><br>You probably gathered by now that I enjoyed the movie... a lot in fact. It is an absolutely beautifully crafted piece of cinema in every aspect, and utterly fascinating and beautiful to watch. It's a slow movie... at nearly 2 hours it could maybe have benefited from the tiniest bit of editing perhaps... but an incredibly powerful one. I have to admit that it left me in tears when it finished, and I doubt if there are a dozen other movies that have ever had that effect on me. <br><br>There is no doubt in my mind that Shunji Iwai is a god of modern cinema. His movies are so well crafted it's almost like he's ripping his talent out of his body and shoving it right up in your face... but not quite so disturbing as that would be. Kurosawa, Kubrick, Iwai... not sounding incongrous to me at the moment.  All demonstrate a transcendent understanding of film as a medium, and make almost every other film maker out there look like an amateur!","user":"simon_booth","rank":[24,25]}]