[{"title":"SERIOUS FUN","rating":9,"date":"27 June 2004","review":"If you don't have a sense of humor or an appreciation for classic horror you won't like this film. It's a montage of homage that is devoted to capturing the pace, direction style, acting style, dialogue etc. of such films as Alien, The Haunting, Dawn of The Dead, Nosferatu on a relatively low budget. The pared down scenes accentuate the spoof sentiment and remind us why horror is fun. Take the Alien scene, hard talking', pulse rifle carrying space marines complete with transmission samples as background juxtaposed to the reefer madness-esque black and white, highly stylized scene of The Haunting. Battling evil can be funny and Bruce Campbell's cameo, as well as others, lends support. If nothing else, it's a treasure hunt for horror genre fans.","user":"tomaxxamot","rank":[18,20]},{"title":"A Great Homage Flick","rating":8,"date":"18 January 1999","review":"Waxwork II pays homage to so many genres of horror that half the fun is watching them and trying to catch what's going on.  The plot isn't much, but there's lots of laughs mixed in (particularly Bruce Campbell, in the Hell House segment).  There's a real sense that the producers and writer are having fun with a concept that really didn't need a sequel in the first place, so they said the heck with it and decided to do whatever they felt like.","user":"Gislef","rank":[17,19]},{"title":"Ah.... the good old days..","rating":10,"date":"26 November 2005","review":"The good old days, when horror didn't have to be a) Ironic b) Overtly gory or c) Pychologically damaging. The good old days when a horror movie could make you laugh out loud at it's plain stupidity and low budget. In fact if it didn't say 1992 on the label you'd swear this was a vintage 80's comedy horror. This is a film that revels in it's low budget; in fact it doesn't so much revel it basks in it, bathes in it even.. Yes the acting is suspect but then I'd be worried if it was up for acting awards. The tongue is firmly stuck in the cheek. In short, Lost In Time is fun. It won't cure cancer, it won't win Oscars but it'll make you laugh and it'll take you back to a time when horror could be fun. Ask yourself, when was the last time Horror did that intentionally? 8/10 And a special mention for director Anthony Hickox. Just why isn't he doing bigger films?","user":"darenwheeler","rank":[26,32]}]