[{"title":"Ya gotta have a sense of humor!","rating":8,"date":"22 April 2003","review":"When this film came out with all of the PR and things, I hated it. I hated it without even seeing it. Then, as with many movies, I caught this on Digital Cable TV, by accident. I had NO intention of seeing it, but once I did, I cannot tell you how much I loved it.<br><br>This is the Farrley Brothers at their funniest. The idea is simple, a guy (Ben Stiller) who had a crush on a woman (Carmen Diaz) he knew since high school and continued to yearn for her privately, finally getting an opportunity to try to reconnect what never got going. This is something almost everyone can identify with.<br><br>What makes this work...is its a dead-on hard hitting comedy.  The Farrley Brothers spared no one: male or female, handicapped or able bodied, black or white, rich or poor, job or not, straight or gay, animal or vegetable, blonde or brunette, educated or not. It is NOT a cinematic masterpiece so don't look for one, it is not a punch line comedy or slapstick comedy, it is sophomore humor done very well because you're going to be laughing at what you think you shouldn't no matter how much you want to say you would never laugh at something like that. <br><br>Plus the Farrley Brothers added in \"some things\" that...well... may have just happened to you at some point in your adolecence, and put a comedic/gross quality to it that shocks you into laughing at it. All through the film you might laugh because you're thinking, \"Better them than me\".....even if it was you!<br><br>Not for eveyone's taste, even those who think they know comedy, but this is that kinda comedy that is hard to do once you've reached maturity and forgotten what it was like to laugh at simple things. This is as simple as it gets. Don't put too much into it, it is what it is, and to me, it was really funny! Good Show!","user":"lambiepie-2","rank":[90,117]},{"title":"A real trend-setter.","rating":8,"date":"10 July 2011","review":"Whenver we refer to modern comedies I think we have to go all the way back to \"There's Something About Mary\" to see where this all started. It set the new standards for comedy and also became a much imitated movie. Movies however very rarely reached the level of this movie ever again, including all of the Farrelly brothers own later work.<br><br>It's the sort of raunchy comedy, that makes some completely inappropriate jokes and makes for instance fun of both psychically and mentally handicapped people, among many other things. This is the foremost reason why some people can't really stand this movie but luckily most others are able to see the talent and effort that were put into making this movie and why the movie works out so well.<br><br>As strange as it sounds, it's actually a real subtle done comedy. It's not predictable in any way and the build up and execution of it is spot on. It even makes all of the moments, that usually seem like something totally lame and forced, work out as something hilarious.<br><br>It also has a great, yet very simple premise, of a bunch of guys all falling for the same girl. It's the sort of story that provides the movie with plenty of silly comical moments, in which the characters lie and constantly are backstabbing each other, all to get the girl in the end.<br><br>Cameron Diaz forms the perfect centerpiece for this movie and the movie is filled with plenty of comical characters, all played by some capable genre actors. This movie is still from the time when it was cool to like Ben Stiller and yes, he also really is perfect in his role. But basically everyone is perfectly cast in this, which is obviously also a reason why the movie and all of its comedy works out so well.<br><br>Comedies like this only seem to come once every 10 years, or so.<br><br>8/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[19,22]},{"title":"Unconventional satire stays on course while delivering major laughs","rating":21,"date":"21 April 2000","review":"A lot of my friends said they hated this, but after i saw it and loved what I saw, it became apparent that many of these people hadn't seen it, they just KNEW they would hate it from the degradingly mysoginistic slapstick it supposedly represented.  Sorry, wrong movie.  This is a classic satire, replete with balladeer narrator.  The gags flow fast and funny and expertly walk the tightrope between politically incorrect and unkind.  This is surprisingly a movie that is very true to itself and its characters with a lot of plotlines that tie up nicely in unusual ways.  And, it's a feel-good movie too.  Cameron Diaz and Ben Stiller are marvelous together in the leads.","user":"rachdeveraux","rank":[70,94]}]