[{"title":"Misunderstood ???","rating":8,"date":"7 January 2004","review":"There's one guarantee in life : When you're reading 5 reviews on Mars Attacks, FOUR of them are negative ones! Why, I ask?? It's really hard for me to believe that all these movie-lovers fail to see the film like Tim Burton intended it. Mars Attacks! is a great film and - above all - a very effective parody. Burton takes the opportunity to spoof and laugh with almost every form of nowadays filth...Politics, religion, the army, television, greed in Las Vegas and God knows what else. Mars Attacks! is the purest form of cinema anarchy I've seen so far, and I really want to encourage you to see it again if you didn't like it the first time. Tim Burton is a genius. Practically all movies he did before ( and after ) Mars Attacks! prove that. Do you really believe that he would deliver a failure? Or do you think the entire brilliant cast would agree to starring in an inferior production?? They all acknowledged the genius of this movie...why can't the audience do the same?<br><br>Mars Attacks! is a very remarkable achievement for yet another reason. This very well might be only film that cost a fortune in order to look cheap! Burton probably wasted a huge budget to make the settings and the design look like they did in the typical 50's Science Fiction movies. Burton is a big fan of these movies and he saved  neither money or trouble to make his satire look like those films. The direct tribute to Edward Wood in the opening credits is an obvious example of this as well, I think. Perhaps, this would be the only real thing you can accuse Tim Burton of...Mars Attacks! is a very personal project of his. I really doubt he worried much about the question whether Mars Attacks! would become a success or not. He told his tale and he clearly enjoyed doing so...Why wouldn't you enjoy watching it then? <br><br>Note: This review is dedicated to Mailen. A great regular user here on this site and I know for a fact that she adores this film as well...","user":"Coventry","rank":[426,529]},{"title":"A guilty pleasure that grows on you","rating":9,"date":"30 January 2005","review":"When I first saw this in the theater with my granddaughter, we both found to be pretty lame and disappointing, but not without some wit to it. Since then, it's been on the cable channels multiple times, and I always find myself watching it again. I really hate to admit it, but this thing has really grown on me - so much so that I finally bought the DVD.<br><br>When I first saw it, I wouldn't have given it more than a 4 out of 10, but after repeated viewings, I now give it a 9. I can't really say why, and I certainly can't justify it in any rational sense, but it all just works for me. The wry wit, the blatant social and political commentary, I find it all immensely satisfying.<br><br>My confession's over, I'll do my penance. But I have to also say that my granddaughter's opinion of it has never wavered. She considers this movie as evidence of my incipient senility...","user":"rbsjrx","rank":[218,269]},{"title":"ACK!ACK! ACK!ACK!","rating":1,"date":"1 June 2004","review":"Anybody who hated this movie missed the point. This is a fun little satire on the American culture of assimilation, the great cultural melting pot. It dares to ask the question: What if another group of people doesn't want to be adopted into the American consumerist culture? The results are hilarious, as we have a group of Martians double-talking their way through the annihilation of the US of A, and the only people capable of stopping them are those who could really care less about the American Way: the President's daughter, who shows more respect for culture and history than her parents could ever muster; and Richie the donut store kid, whose primary concern is the welfare of others, specifically his grandmother, who ironically provides him with a way out of this mess. I've only seen this film twice, but it still makes me laugh my head off and provides me with the antidote for the jingoistic finale to the other alien invasion film of 1996, Independence Day.<br><br>In short, say what you want about Mars Attacks! If you don't understand it, that's not my problem.","user":"stiv-7","rank":[253,315]}]