[{"title":"Genius + Genius = ...","rating":19,"date":"19 May 2004","review":"'Fear and Loathing in Las Vegas' was originally an Article published in two parts in Rolling Stone Magazine. It was written by Hunter S. Thompson. It tells the story of a journalist reporting on the Mint 500 in Las Vegas.<br><br>Terry Gilliam (the Director) is an accomplished film maker who began his career as one of the members of Monty Python. He did all of their animations.<br><br>These two men on their own are incredibly clever and gifted artists in their chosen medium. What we get from this combination is one of the best films ever made. It is a more or less true story. It is a wonderful view on the warped nature of American 'Culture' from a completely askew angle. Drugs, drugs and more drugs, but instead of preaching their evils or telling you how fabulous life is when you're on acid, you get a very unbiased experienced approach to their use and abuse. <br><br>Visually the film is amazing and both Johnny Depp and Benizio Del Toro are true to the book. I couldn't possibly recommend this film more highly.","user":"whole_orange_truck","rank":[317,378]},{"title":"pointlessness is the point","rating":30,"date":"30 July 2003","review":"For all those of you who decry this movie for being pointless and lacking soul, that was the point! This is an excellent movie, a true adaptation of the book, nothing more and nothing less. It is an unflinching look at the sickening excesses of a consumption based culture of America during the early 1970's, who's vacuous heart resides in Las Vegas, a symbol of greed and debauchery. The pointlessness of the movie is a metaphor for the pointless pursuit of personal gratification and greed, the true heart of the \"American Dream\".<br><br>If you put aside the usual assumptions about a movie, i.e. that you are supposed to care about the characters, that their needs to conflict and resolution etc, then you will enjoy it much better. This movie is a magical ride and actually works on many levels, not only as testimony to the horrors of excessive drug use, and the tacky, ugly view of the worst parts of America, but also to the failed 60's generation, a generation that thought that \"somebody somewhere is guarding the light at the end of the tunnel\". Drug use is simply a way of escaping your present reality, and all the drugged out zeroes of the sixties were truly lost if they thought that enlightenment and peace could come from a hit of acid. This movie takes Timothy Leary's supposition of \"freeing  your mind\" to it's ultimate conclusion and the conclusion is that you are not actually freeing your mind, but destroying it.<br><br>Of course this movie is also fun to watch the incredible performances by Johnny Depp and Benitio Del Torro, both of whom I barely even recognized in their roles (Depp with a shaven head and the bloated Del Torro who gained 40 pounds for his portrayal of \"Dr. Gonzo\"). Del Torro has one scene in particular (the bathtub scene) which is both disgusting and very disturbing. Apparently his performance was so convincing that he had a hard time getting work after this film because everyone was convinced that he was wasted on the set. The truth is that he's just a damn fine actor who didn't hold back for one second, which is exactly what the film called for. Also the scene of Johnny Depp squealing like a banshee after imbibing some adrenocrome and Del Torro freaking out behind him is unforgettable.<br><br>The directing itself is fast paced with offseting angles a lot of wide angle lenses. Gilliam has a style which is unmistakable, it's like walking around inside of a Dali painting, everything is distorted and stretched to create a strong sense of surrealism. Yet his approach is much less offensive than Oliver Stone, who desperately throws every single filming trick at you repeatedly until you are pummeled into submission. Wow, look he switch to 8 mm, then black and white, now it's slow mo all in 3 seconds!<br><br>Anyway, I digress. This is a fine movie, don't watch it stoned, you'll get more out of it, repeated viewings are recommended. I also recommend getting the criterion DVD version, which has commentary by Gilliam, Depp, del Torro and Hunter S. Thompson himself!","user":"vincent-27","rank":[452,546]},{"title":"\"We can't stop here. This is bat country!\"","rating":10,"date":"6 May 2004","review":"\"Fear and Loathing in Las Vegas\" is a twisted, outlandish venture into the mind of a warped junkie, a reporter who is traveling to Nevada in order to cover a Hells Angels motorcycle race, along with his Samoan attorney Dr. Gonzo (Benicio Del Toro, who gained forty pounds for his role). \"We were somewhere around Barstow when the drugs began to take hold,\" is the line that opens the movie in an expeditious manner, as a red convertible roars from right to left, in the direction of Las Vegas. The vehicle's trunk is packed with an abundance of deadly drugs. \"We had two bags of grass, seventy-five pellets of mescaline, five sheets of high-powered blotter acid, a salt shaker half full of cocaine, a whole galaxy of multicolored uppers, downers, screamers, laughers. Also a quart of tequila, a quart of rum, a case of beer, a pint of raw ether, two dozen amyls.\"<br><br>The narrator of the story is Raoul Duke (played by Johnny Depp), a balding, stumbling shell of a man, constantly smoking or inhaling drugs, his body overloaded with deadly substances. He is in a permanent daze throughout the entire film, constantly consuming drugs every time the camera pans onto him. He is also the reporter, the main character of the film, and he is in such a daze that after the motorcycle race is over, he's not even sure who has won. So sitting cramped in his increasingly trashed hotel apartment, he begins clacking away mumbo-jumbo on his typewriter, desperately trying to make sense of the seemingly frenzied world surrounding him.<br><br>The year is 1971, the beginning of the after-effects of the frivolous sixties. Raoul still seems to think that he is living in the past decade. He explains that his carefree ways were out of place for such an area as Las Vegas, and in one of the funniest scenes in the entire movie, he visits a conference detailing the dangers of substance abuse, and inhales cocaine throughout the seminar (led by the late Michael Jeter).<br><br>The movie is based on the semi-autobiographical memoirs of Dr. Hunter S. Thompson, who traveled to Las Vegas in 1971 with an overweight \"Samoan lawyer\" named Oscar Zeta Acosta. According to Thompson's novel, \"Fear and Loathing in Las Vegas,\" originally published at the end of the decade, they broke many laws and were essentially high on various dangerous substances the entire time. In his novel, Thompson used the character Raoul Duke as a relation to his own past, and the pair's psychedelic weekend as a metaphor for the Lost America. After the sixties, during the Vietnam War, Americans were deeply confused, and turned to many dangerous substances for answers. Some critics claim that \"Fear and Loathing in Las Vegas\" glamorizes drugs. If anything, it demonizes them (sometimes quite literally), and the constant drug use is merely present to account for the duo's wacky behavior.<br><br>That's not to say that \"Fear and Loathing in Las Vegas\" is a harmless film. Under the wrong circumstances, it could be misunderstood, which is why it was nearly slapped with an X-rating by the MPAA, and -- along with the book -- caused outrage when it was released in 1998, alongside the utter disaster \"Godzilla.\"<br><br>Depp is the reason the film's narration succeeds as well as it does -- a lesser actor might come across as annoying. Depp seems to be channeling the physical freedom of Steve Martin and the slurred speech patterns of Thompson himself -- although he was given ample time to pick up on Thompson's mannerisms, since they spent much time together prior to shooting and throughout the filming process.<br><br>But what is essentially so fascinating about \"Fear and Loathing\" is its blazing style and blatant uniqueness. Brought to the screen by Terry Gilliam (\"Monty Python and the Holy Grail,\" \"Brazil\"), one can only expect the movie to be strange, but it is severely distorted to the point of insanity. What is even more intriguing is Gilliam's use of his camera, cinematography and backgrounds -- the camera essentially takes on the role of a third person, as it is constantly moving, positioned at awkward angles against harsh, dizzying backdrops, wallpapers and carpets. The overall effect of the movie is the equivalent of getting high -- only this probably isn't as dangerous. Probably.<br><br>In some ways, \"Fear and Loathing in Las Vegas\" is an utter mess of a movie -- pointless, sick, but yet it is also occasionally hilarious, and I found myself very entertained. I am not usually a fan of these sorts of movies, which only helps account for my extreme surprise in finding that I not only enjoyed \"Fear and Loathing in Las Vegas,\" but found it to be an important art house movie -- bizarre, mystifying, strange, bewildering. It is as if Fellini directed a Cheech and Chong movie. It is an experience unlike any other, and although I can completely understand the negative reviews it received upon its release years ago, I find myself somewhere in between the haters and the die-hard cult fans. The film was released on a Criterion DVD last year; a sign that despite its infamous background it actually has a fairly strong legion of fans. In some ways the movie is as confused and wandering as its narrator. It's somewhat pointless, but incidentally, I think that is the point.","user":"MovieAddict2016","rank":[300,364]}]