[{"title":"Fantastic entertainment...","rating":7,"date":"14 March 2020","review":"Despite of being from 1995, then \"Outbreak\" is still a movie that very much holds it own and is very watchable even now in 2020. Well, especially more so now in 2020 given the Covid-19 situation. Which, incidentally, is also the reason why I opted to sit down and watch this classic one more time.<br><br>The storyline in \"Outbreak\" is very riveting and captivating, drawing in the audience quite fast, with a very intense and interesting storyline. This movie is essentially about a small outbreak of a new strain of virus that crosses borders and quickly turns into a very dangerous virus that runs amok and out of hand.<br><br>Aside from a very interesting storyline, then the movie definitely also benefits from having a very impressive cast ensemble, which includes the likes of Dustin Hoffman, Rene Russo, Morgan Freeman, Kevin Spacey, Cuba Gooding Jr. and Donald Sutherland.<br><br>\"Outbreak\" is a movie that can be watched again and again, and it never ceases to be as intense and interesting as it was the first time I watched it. For this accomplishment the writers Laurence Dworet and Robert Roy Pool really deserve a lot of praise. And also director Wolfgang Petersen did a great job with this movie.<br><br>If you haven't already seen \"Outbreak\" for some reason, now is the right time, especially with the pandemic situation happening in the world today.<br><br>My rating of \"Outbreak\" is a very solid seven out of ten stars. I can warmly recommend that you take the time to sit down and watch - or re-watch - this movie, because it is very intense and very entertaining.","user":"paul_haakonsen","rank":[48,52]},{"title":"imperfect, but entertaining","rating":21,"date":"21 October 2002","review":"Hoffman is a U.S. Army doctor who specializes in disease control, and is burdened with personal problems following a recent divorce. He and his research team have their work cut out for them when they're assigned to try and contain a new, terrifyingly deadly virus that's made its way from Africa and caused an unprecedented epidemic in a small U.S. coastal town. It's a race against time as they try and locate the host animal carrying the virus, as well as save the lives of the town inhabitants before his Army superiors can carry out their own agenda. Suspenseful, well-crafted thriller is not always surprising, but it is believable and acted with conviction by a dynamite cast. ***","user":"Special-K88","rank":[43,52]},{"title":"Good Dramatisation of a Very Real Threat","rating":8,"date":"27 January 2005","review":"With a deadly virus spreading like the Flu in the town of Cedar Creek, Military and Civilian Viral Specialists Dustin Hoffman and Rene Russo, are caught up in a race against time to discover a cure for this Microscopic Menace, known as Motaba. This isn't the first time that the virus has struck, but last time out is was hidden from the public and remained in the hands of the Military, as the perfect Biological weapon.<br><br>Desperate to keep the Weapon Safe, Morgan Freeman and Donald Sutherland, will stop at nothing to protect it, even if that means killing innocent Civilians.<br><br>With the cast already mentioned and support from Kevin Spacey and Cuba Gooding Jr. the film is packed with fine acting performances, and enough thrills and tension, to show us exactly how serious the threat of this weapon is, and the lengths that people goto, to preserve it.<br><br>Very realistic in content, this is turns out to be a fine Dramatisation of a very real threat.<br><br>8/10","user":"mjw2305","rank":[25,31]}]