[{"title":"Good \"B\" movie about a girl who befriends a research dog.","rating":7,"date":"21 November 2004","review":"This is one of those movies that can entertain you as long as you don't get too critical. The basic premise of the story line is a good one but as with many low budget Sci-Fi films there are flaws in the telling.<br><br>The biggest flaw is in the title itself. Being as this dog befriends Ally Sheedy's character and basically snarls at all the men it come across the film probably should have been called \"Woman's Best Friend\" or better yet \"M.A.X.\".<br><br>Other than the title though the movie is basically a good film and you have to get pretty picky to find any real problems with it. It's not a great movie but it has some good scares, moments of comic relief, and some cool special effects.<br><br>I don't know why this film has gotten such a low over-all rating. I know that IMDb ratings tend to average a bit on the low side but still this movie deserves a lot better than a 4.4. I have given the film a 7 and feel this movie is good enough to add to any one's DVD library if found at budget prices.<br><br>Definitely worth a rental if you haven't already seen it.<br><br>EB","user":"ElvesBrew","rank":[17,20]},{"title":"Guilty pleasure of the highest order","rating":8,"date":"1 November 2008","review":"\"Man's Best Friend\" is a decent enough killer dog film.<br><br>**SPOILERS**<br><br>Attempting to do a serious story, Lori Tanner, (Ally Sheedy) and her camerawoman Annie, (Trula M. Marcus) sneak into a testing facility and find a wealth of caged animals undergoing illegal treatments. Discovered by Dr. Jarrett, (Lance Henriksen) they flee the scene and inadvertently free a dog from the lab's testing area. Bonding with him despite what her boyfriend Perry, (Fredric Lehne) says, she refuses to part with him and decides to keep him. When he discovers what is missing, he goes after the dog when she realizes that he's a genetically-modified killer dog possessing the traits of several animal species mixed together into a perfect killing machine and is out on the loose, forcing them all to come together in a showdown to stop the dog's rampage.<br><br>The Good News: This one wasn't that bad and actually had some decent stuff to it. The fact that the silly premise is allowed to be so silly and entertaining is a true plus here. It's hard to really get more goofy than this premise, but the fact that the film never once feels dull or boring is a huge plus and is partly due to what all it includes within. The first issue is the attacks on display, which are really cool and really enjoyable. Though it's to be expected, the mailman encounter turns out incredibly well and satisfies due to the effective conclusion, the police chase away from the house is pretty thrilling, as it takes the place of a normal car chase complete with the crashing cars and the escape of the target away from them, and of course the encounter at the junkyard is great as it's a retribution murder that is nicely, and cruelly set-up well with the treatment of the dog that results in some admittedly-cool effects before the deadly resolution. The main one, though, is the sequence of attacks at the end, where it leads from a short but effective car chase to a cool crash and into a fun and incredibly tense stalking through the lab, and with the majority done through the dog's vision so that we're low to the ground, it adds a little more tension to it than it already has. The blood and gore isn't that spectacular, mostly concentrating on bites to tons of areas around the body, including the legs, crotch, throat and more, but there's also a decent-looking chest mauling, and a cool scene where it urinates acid on a guy's face and it melts away in a pretty nice effect, and it's an acceptable film in the gore department overall. The last good plus here is the fact that the film builds up to the dog's violent tendencies. It's going to be pretty obvious that the dog will be a raving maniac, but the way it's built up with the home-environment and it's different scenes showing off the dogs' abilities around the neighborhood illustrate the great build to how the killer's abilities come out. All of these here are what make the film enjoyable.<br><br>The Bad News: There wasn't a whole lot here that didn't work. The main issue is that there's not a lot of time in here dealing with the dog actually going out and killing, which is the main thing that a film like this is built upon. The beginning to this, where he terrorizes the neighborhoods' animals, including an admittedly cool scene where it climbs to the top of a tree and devours a fleeing cat, are just not that interesting or exciting and are diverts away from the shots of the dog going after it's victims. The film also clearly has no idea of what it is talking about when it gets to genetic engineering. It seems to regard chameleon-like skin-changing ability and tree-climbing as instant abilities that one can just snip from another animal and graft onto dog genes, when it's widely known that the musculature in their legs renders them unable to use that particular trait, and with the relative size of the dog, becomes just plain impossible. The enhanced intelligence and strength bits were done right, but unfortunately genetically enhancing animals to turn them into chameleons is just taking it too far, as it's impossible believe the fact that a dog can blend into the background, especially when the background is a garage full of boxes and rusty metal. It really takes the viewer right out of the scene. The first flaw here is the love-scene on display. As a terrible, though appropriately titled love-song blares across the scene, the two dogs perform a pathetic people-pantomime sequence, such as looking shy while laying back in the bed or a ludicrous chase where she leads him into the bedroom, which is just overall atrocious. Then, as a neighbor woman searches for her cat, we hear the sonic resonance of her orgasm blaring through the neighborhood. It's just a totally unnecessary scene and serves just so as to provide something that makes the film's twist ending believable. These are what work against the film.<br><br>The Final Verdict: Even though it's not exactly a bad film, nothing of real importance sticks out enough for it to be anything more than watchable. Give this a shot if it appeals to you or you find these kinds of films interesting, otherwise this one isn't all to special and won't be a big thing if it's skipped.<br><br>Rated R: Graphic Violence, Graphic Language and a clothed sex scene","user":"slayrrr666","rank":[7,8]},{"title":"Doggone it!","rating":7,"date":"7 October 2011","review":"\"Man's Best Friend\", about a genetically altered dog that kills any perceived threat, is pretty much what you'd expect. Ally Sheedy really chews the scenery as the reporter investigating cruelty to animals and inadvertently releasing the bloodthirsty pooch. But no matter, the movie still is pretty fun to watch, with the full understanding that it's basically a totally dumb flick. Lance Henriksen, playing the scientist who created the murderous hound, lets his face do the acting.<br><br>Like I said, it's mostly just a fun movie to watch. Definitely nothing special about it. Although I should admit that I'd never heard of a Tibetan mastiff until I read a description of the movie.","user":"lee_eisenberg","rank":[4,4]}]