[{"title":"Cynical - just the way I like them!","rating":20,"date":"20 February 2000","review":"This is quite simply one of the finest movies I have ever seen. It has incredible pace and flair, with both the script and the direction demanding equal attention. And it just works so well on so many levels. Whilst it is a political satire, it also stands well as a story in its own right. It's great to see Matthew Broderick in a good film. Reese Witherspoone turns in what I consider to be a career-best, and Chris Klein is wonderfully endearing as a jock with a heart of gold.<br><br>What I really love about Election is the way its pace doesn't let up at all. By the time you've finished you feel like you've seen a good two and a half hours of movie. It's the only film I know that seems longer than it is in a good way.<br><br>This film made me laugh out loud more than any other I can remember that isn't just a dumb comedy. But Election also doesn't take itself too seriously. The direction can accurately be described as deadpan - with Chris Klein, stripped of his ability to play football, gazing soulfully out to sea, and falling asleep over a book on philosophy. The way that each major character is afforded a voice-over, giving us an amusing insight into their psyche, is a wonderful technique, and the freezeframes of Reese Witherspoone's contorted facial expressions truly are moments to treasure.<br><br>What more can I say? Election is smart, funny, and biting. It maintains its brilliance for the entire duration of the movie, and the ending is wholly satisfying. In fact, I can't actually think of one word of criticism. You'll have to search long and hard to find a better film anywhere, which is why I'm giving it a stellar nine out of ten.","user":"AsharaDayme","rank":[112,148]},{"title":"Flick for President?","rating":8,"date":"5 December 2005","review":"The Academy Award attention heaped on \"Sideways\" helped to make Alexander Payne a mainstream name among casual film goers, but many of us knew about his talent as a film maker long before. And his two more recent films--\"Sideways\" and \"About Schmidt\"--have been much gentler (thought still terrific) than his earlier efforts. Before \"Election,\" Payne had already made \"Citizen Ruth,\" a caustic, bracing satire of the abortion issue, and \"Election\" continued his penchant for harsh, uncomfortable comedy. I mean that in a good way, though. Payne's movies are funny, but they make you uneasy for laughing at them, and they have sharp, intelligent insights into the attitudes that drive American values.<br><br>In \"Election,\" Payne uses a high school class presidential election as an opportunity to lampoon everything that's goofy about the American political system. Just as in our national elections for president, the winner is not necessarily the person with the most integrity, and honesty is a liability, not a virtue. The person who is willing to play dirtiest comes out on top, and elections aren't about who is most qualified but rather about who is most popular. And, the best part about the movie is its acknowledgement of voter apathy. Most Americans don't really give a damn, something that makes them not so different from the majority of high schoolers who don't even understand the point of having a class president to begin with. In fact, in the film's best scene, the assembly at which each candidate gives her/his campaign speech, one of the candidates (who joins the race out of spite) gets the best reception from the crowd when she encourages everyone not to vote at all.<br><br>Reese Witherspoon gives a wonderful performance as Tracy Flick, the school's most likely to succeed, whose goodie-goodie exterior hides the fact that she's willing to do just about anything to get ahead. Matthew Broderick is refreshingly unlikable as a social studies teacher who would like to see Tracy fail just once, until the fact that his own life is falling apart turns this wish into an obsession. And Chris Klein has some fun as the dopey, Jesus-following popular guy who becomes Tracy's arch rival, but never really even knows it.<br><br>Payne doesn't tidy up his film's moral messages. On the one hand, Tracy is obnoxious, and we want to see her fail as much as Broderick's character does. But she does know how to play the game, and isn't that part of what makes someone a good leader? We sympathize with Broderick up to a point, but his motives really are driven by a personal vendetta, not by any altruistic ideal of right vs. wrong. So if you normally need someone to root for in order to enjoy a movie, you're probably not going to like this one. <br><br>But who expects a hero?...I mean, come on, we're talking about American politics here. <br><br>Grade: A","user":"evanston_dad","rank":[69,94]},{"title":"Looks like you could use a cupcake","rating":14,"date":"14 November 2011","review":"Everyone's a politician in \"Election\", Alexander Payne's dark comedy about a student presidential election. Genius and overachiever Flick (Reese Witherspoon) acts like a chirpy angel on the outside, but look closer and she's vindictive, mean spirited and sexually precocious. Teacher Jim McAllister, who enthusiastically helps his students and school, is no better, as he cheats on his wife and embarks on a plot to ruin Flick's electoral chances. And on and on it goes, Payne peeling back pretence to reveal a cast of nasty, predatory schemers. Teachers suck up to students for sex, students selfishly run for candidacy in an attempt to get kicked out of school, and others merely take part in the election because they were manipulated into running. The point: life's a political rally, everyone has an ulterior motive, everyone's a spin-doctor, everyone's constantly maintaining their own little user generated political campaigns, designed to mislead, sucker, curry favour and win votes of confidence. Open your mouth and you're playing the game too.<br><br>\"Election\" does well to depict human behaviour as a cycle of neural elections, biochemical ballots held in our heads in which conflicting aspects of our messy personalities vie for what we say and do. But there's no democracy in our heads, and often instead a predisposition to tyranny; a kind of soft, interior fascism. <br><br>Payne traces the damage and consequences of this, each of his characters unwittingly leaving a trail of pain and destruction in their wake. They all pretend to \"mean well\" but no one means what they say, self-interest trumps altruism and altruism masks darker, swirling emotions anyway. It's a hopeless film.<br><br>\"Election\" was released a year after Wes Anderson's \"Rushmore\", a film whose plot it heavily resembles. But Payne's tone is closer to Todd Solondz and to a lesser extent the follies of the Coens, Neil Labute and Woody Allen. It's a conceited film, too impressed with its own cynicism, pessimism, and cast of cartoonish cretins, perverts, jerks and losers, but Payne is also perceptive in the way he forces you to continually reassess his characters. Little Flick, for example, seems like Payne's villain, but on the other hand she's a marginalised, lonely, sexually abused girl whose drive to succeed is the result of external pressures working on her. A similar inadequacy fuels her teacher McAllister, who sabotages Flick's campaign because his own life is in shambles. McAllister rationalises his actions as being ethical because Flick sabotaged the campaigns of other candidates – and on one level he's right to do this – but Flick's plot to exclude the other candidates, which echoes McAllister's plot to exclude Flick, itself merely echoes the social exclusion (deleted scenes further highlight that Flick lives in poverty) or alienation that drives Flick into politics. It's a kind of feedback loop, selfishness and jealousy breeding selfishness and jealousy, in which every subject justifies their action as being ethical because the other has no ethics.<br><br>\"Election\" is often touted as a satire on political campaigns. But the film is barely a satire, and has very little to do with politics, other than its broad jabs and your typical US candidates. In this regard you have the stuck up conservative who is secretly liberal in her private life and eventually reveals herself to be a kind of joyless Orwellian freak. Then there's the rich airhead candidate who's privately moral and upstanding but nevertheless knows and stands for nothing. Meanwhile, another candidate embodies a form of very modern, impotency and apathy. She eventually ditches the system to make out with her lesbian lover. Matthew Broderick, formerly known as a youth star of 1980s high school movies, is well cast in a somewhat ironic adult role. In the 80s, his characters typically rallied against the type of character he plays here.<br><br>8/10 – Worth one viewing.","user":"tieman64","rank":[10,11]}]