[{"title":"Watch this one for Downey","rating":27,"date":"27 September 2004","review":"Robert Downey Jr. is fantastic in all of his 60 or so seconds in this film. I think he is one of the best comic actors of all time.<br><br>Brooke Shields also does a spot-on amateur documentary film-maker shtick. I didn't even recognize her in her dreadlocks in the first half of the film. She and Downey trail a bunch of rich white high school kids half their age, trying to be one of them as they go slumming. Shields best moment is when she meets a recently married old friend on the Staten Island ferry, and you feel the disparity between Shield's refusing-to-grow-up character and her ordinary, grown-up old friend.<br><br>Downey's best moments are when he tries to pick up Mike Tyson and when he tries to pick up one of the high school students, reprising his character in Wonder Boys. It's too bad Hollywood has an insurance clause against him now, because everything he does is exceedingly knowing.<br><br>The flattest moments are the James Tolback Obligatory Sex In Central Park scene, apparently a rehearsal for an identical one in this year's \"When will I be loved?\", and in the contrived Typical Banker's Family Dinner with the Sullenly Rebellious Daughter While The Manservant Ladles the Soup. Please. We know Tolback has a lot of celebrity friends; they're all in his movies. I doubt he has met a single real banker in his life.<br><br>Also we are treated to the same flaw which is in Black and White, namely the highly implausible plot devices that tie all of the characters together, wherever they live in the movie and whatever their social strata. He is a big buyer of the Deus Ex Machina.<br><br>He's also a big buyer of improvisation. In the DVD he says almost all the films are improvised except the one where Claudia Schiffer impersonates what one critic called \"the world's most unlikely graduate student\", and another called \"a surprisingly believable turn as a faithless brainiac\". Whatever. She looks hot for the most part except towards the end where they're one outdoor shot in a riverside park where her lips just look too big and she looks like a squeaky and insufficiently made-up skinny yin-yang. What can you do. Her funniest moment was the split second sitting next to and conversing with Robert Downey Jr. when he turns to compare perfume notes with the young man sitting next to him, and she figures out she's no longer the center of attention and suddenly gets up and walks away. Her least likely moment is when she is about to have sex in a bathroom with her boyfriend's best friend. Not that the premise is unlikely: She is just too Teutonic and awkward beneath all that prettiness to look like she's about to tongue-wrestle with a big sweaty gangster. (Much more believable is the news story about her I read the other day where she is applying to private schools for her unborn child.)<br><br>Tolback cast himself as Tolback pretty much, as usual. If you're the director, why not throw yourself a cameo? It's just a stone's throw from there to writing in a sex scene with the lead actress, but if he did that he'd have to write himself a lead part and then he'd be Vincent Gallo, but he's not, he's more of a voyeur; enough to write those Central Park scenes and shoot them in closeup with full improvisatory rein given to the actors. Let them really get into the moment, keep the cameras rolling.<br><br>Am I boring you with this review? Is it running on a little long? Does it seem a little disconnected?<br><br>If you think this is bad, go see the movie.","user":"erxnmedia","rank":[27,31]},{"title":"What a frustrating movie!","rating":22,"date":"22 July 2002","review":"I always find the idea of improvised (or semi-improvised) film making an interesting one, even if the results themselves are disappointing, and very rarely work (exceptions being some of the movies of Christopher Guest and Abel Ferrara). It's a risky idea because it's a true test of an actors talent. Some succeed and some fall flat on their faces. 'Black and White' is a perfect example of this, for every interesting moment involving say Ben Stiller, or yes, Mike Tyson, there's way too many dull and rambling scenes that go nowhere (come on down Brooke Shields and Bijou Phillips). What makes this movie even more frustrating is James Toback is obviously aiming for a BIG STATEMENT regarding race relations in contemporary America, yet the movie is so superficial and confused it ultimately says nothing much. Toback is a maddingly uneven film maker, but he is responsible for one of my all time favourite movies, the sadly underrated 'Fingers', so I usually give him the benefit of the doubt. Unfortunately 'Black and White' is a missed opportunity and has very little to recommend it. I suppose Toback deserves some credit for at least attempting to do something other than mainstream Hollywood dreck, but ultimately a crappy movie is still a crappy movie, no matter how good the intentions.","user":"Infofreak","rank":[29,34]},{"title":"Don't buy the hype!","rating":8,"date":"8 April 2000","review":"Black &amp; White: a documentary director and her husband follows several upper middle class high school kids to try and comprehend why they have chosen to emulate black inner city hip-hop rappers.  <br><br>What is intended to be an avante-garde-in-your-face mockumentary addressing serious sociological issues is a weak series of loosely interconnecting stories with poorly developed and uninteresting characters. The credits tout many big names - Robert Downey Jr., Ben Stiller, Brooke Shields among them - but the performances are lackluster at best: while Downey's stereotypical fey gay character borders on offensive, he can't compare with Mike Tyson's ludicrous attempts at philosophizing.  <br><br>At least there are no shades of grey here - it is all bad.","user":"Shiva-11","rank":[10,11]}]