[{"title":"Entertaining sequel with some big laughs.","rating":8,"date":"22 January 2009","review":"Lieutenant Frank Drebin (Leslie Nielsen) is now working in Washington D.C. with his two partners (Oscar-Winner:George Kennedy and O.J. Simpson). Their job is see if everything goes smooth for Dr. Albert Meinheimer (Richard Griffiths) speech for the President of the United States (John Roarke). His speech could be highly controversial for the whole world, since it involves the country's energy program. Quentin Haspburg (Robert Goulet) kidnaps Dr. Albert Meinheimer before the speech by using a look-like, which he doesn't want the world industry of fossil and nuclear fuels instead of the environmental ones. But Frank is still heartbroken after he left his girlfriend Jane (Priscilla Presley), who's now working for Dr. Meinherimer.<br><br>Directed by David Zucker (Airplane!, BASEketball, Ruthless People) made an enjoyable sequel to the original. The cast seems to be having an great time and there's some original new gags as well. This sequel was just as big at the box office like the original did. Although the film critics had mixed opinions with this one. <br><br>DVD has an sharp anamorphic Widescreen (1.78:1) transfer and an good digitally remastered Dolby Digital 5.1 Surround Sound. DVD includes the teaser trailer, original theatrical trailer and an humorous commentary track by the director, producer:Robert K. Weiss and Host:Peter Tilder. \"The Naked Gun 2 1/2:The Smell of Fear\" perphas lacks some of the great gags of the original. But if you enjoy spoof comedies, don't miss this one. TV Version adds some additional footage. Written by the director and Pat Proft (Bachelor Party, Hot Shots!, Police Academy). (****/*****).","user":"hu675","rank":[14,14]},{"title":"The Naked Gun 2 1/2: The Smell of Fear: 8/10","rating":8,"date":"11 October 2003","review":"Jim Abrahams and David and Jerry Zucker learned something from 1982. Their sequel to Airplane!, their smash hit, was named Airplane 2: The Sequel, but to their sequel to The Naked Gun was something that would be copied forever: Naked Gun 2 ½: The Smell of Fear. From now on, sequels never were just had `2' after it, it's always `2 ½' or `2.33'. And, thankfully, the title's shorter.<br><br>Leslie Nielsen's hilarious character of Frank Drebin is back for more adventures. He and his girlfriend Jane (Priscilla Presley) have broken up; he hasn't gotten over it, while she's going out with Quentin Hapsburg (Robert Goulet). What she doesn't know is that Hapsburg is in a conspiracy to avoid solar energy by doing a whole kidnapping scheme. It's up to Drebin, Nordberg (O.J. Simpson), and Ed Hocken (George Kennedy) to save the day!<br><br>Amazingly enough, many of the jokes from the first one (which I admit I don't remember much about) weren't repeated in this sequel. It would be hard to repeat much of those jokes, which would be impossible to change in any ways. Therefore, most of the jokes were fresh and hilarious. It did take a little while to get started, though, for there was about a fifteen minute stretch where there were no laughs, it was just for exposition, which I guess was OK, but I wanted more humor to start off with.<br><br>Nielsen was perfect for the part. I'm glad that he hasn't `sold out' like other comedians and gone on to dramatic roles. He delivers his lines almost like he didn't know he was in a comedy, which is always funnier than any other types. Many times, he misunderstands what is said, and other times he says something that you wouldn't expect him to say in 100 years. One of the funniest sequences in the film is a parody of Bond-ish films, when Drebin and someone else are fighting in a bathroom, and seem to be having trouble fighting when a towel is thrown on their heads, etc.<br><br>For once, a film has a formidable sequel. Amazingly enough, it's a film that's just as funny as the first.<br><br>My rating: 8/10<br><br>Rated PG-13 for sexual humor.","user":"movieguy1021","rank":[17,18]},{"title":"The mariachis","rating":7,"date":"16 February 2006","review":"David Zucker, the director of this spoof, shows he can give the viewer a fun time because the way he gave the right touch to this funny movie. \"The Naked Gun 2-1/2\" is a film which makes fun of other movies about an inept police detective who does everything wrong, but in doing so, he gives us an occasion for laughter that in most of the situations work.<br><br>Of course, one wouldn't imagine anyone playing this Lt. Frank Drebin, but Leslie Nielsen. This actor with the rubber face, is a natural for this type of comedy. The opening sequence with the White House dinner with the older Bushies is a hoot. Poor Barbara Bush is the butt of all the visual jokes as she is seated next to Drebin. But the best moment in the film is the rendition of \"Besame Mucho\" by Mr. Nielsen and George Kennedy dressed in mariachi costumes. It is a riot!<br><br>The leading lady, Priscilla Presley, seems to be the perfect match for Mr. Nielsen. They play well together. The others in the film, George Kennedy, Robert Goulet, Richard Griffiths, and the rest, do an excellent job in their clowning around to produce the laughter and good time we experience.<br><br>This is a film to recommend to anyone suffering depression.","user":"jotix100","rank":[21,24]}]