[{"title":"A cute, funny, guilty pleasure type of movie","rating":26,"date":"26 November 2001","review":"The story is nothing new, the acting ain't that great, but \"Two if by Sea\" has its moments.  It's an entertaining little movie, and Sandra Bullock's mixture of charm, sarcasm, and innocence play out well.  The movie knows it's not too sophisticated or shrewd (even the cop says of his own investigation, \"this is too easy\") and it's a great film to watch on an afternoon or just to be entertained.  If you're a Sandra fan, you'll like it no matter what.  :)","user":"WolverineGirl","rank":[28,30]},{"title":"Funny movie, but more appealing to Denis Leary fans","rating":7,"date":"30 March 2001","review":"I am a big fan of Denis Leary, and I thought this was a damn funny movie. The plot is cut-and-dry (the little plot that exists), but it works out nicely as a comedy, mostly due to Leary's funny dialogue and humorous arguments between him and Bullock.  I think Bullock was miscast, though. She did an OK job, but her accent drifted many times.  If you like Leary, you'll probably have a great time.  I especially loved the scene where Leary was going fishing and he shoots one of the fish.  Then he cooks it up, serves it up to Bullock and she spits out a bullet.  That was classic.  But for non-Leary fans...you might not enjoy it as much.  I don't consider him an acquired taste, but his foul-mouthed banter doesn't appeal to everyone.","user":"mattymatt4ever","rank":[23,26]},{"title":"Minor gem","rating":7,"date":"4 November 2006","review":"A blonde Sandra B. and her beau of longstanding, played by the equally blond Dennis Leary, romp their way through a romantic comedy having to do with a bunch of small-time crooks and a very valuable stolen painting. Shot in scenic Nova Scotia, the backgrounds are absolutely gorgeous, and Bullock and Leary have great rapport that makes their rocky relationship very believable. FBI agent Yaphet Koto is along for the ride in a role similar to the one he essayed in MIDNIGHT RUN. Leary co-wrote this, In a manner reminiscent of Donald Westlake -- which is a very good thing, if you know who Westlake is. If not, look him up. Leary is consistently Leary (maybe he was born a fully developed adult), while Bullock in 1996 is growing into the superstar that we know today. She's playing a role that might have been Julia Roberts' a few years before, as she did in several other pictures prior to SPEED and MISS CONGENIALITY, which she made her own.","user":"xredgarnetx","rank":[12,13]}]