[{"title":"Surprise, surprise","rating":7,"date":"19 August 2003","review":"SPOILERS.<br><br>There's just something about Sean Connery. He's a neat guy, and he's grown neater over the past forty years. He's bald and doesn't care. His hair is gray, except that his eyebrows are black. His face is lined but handsome. He moves with force and grace. He's the kind of older guy that every man ought to hope he grows into. And he doesn't take himself or his talent too seriously either, a saving feature. And he has a sense of humor. He tells the story of location shooting during \"The Man Who Would be King.\" Every day the cast and crew drove many miles from town up into the Atlas mountains. And every morning Connery's car passed an old man walking in the same direction with a huge load of firewood on his back. And every afternoon they would pass the same old man walking back home without the load. One morning Connery finally asked his driver to stop and offer the old guy a ride up into the mountains. The old guy thought for a while and refused the ride. Why? Because if he accepted the ride he would arrive back home too early and wouldn't know what to do with the extra time. That's the Morrocan version of the Protestant Ethic.<br><br>He's good in this movie too, as a Harvard law professor who comes to a dumpy small Florida town at the request of a death-row inmate. The inmate is handsome, black, and educated. He tells a horrifying story of having been made to confess to the murder of an eleven-year-old white girl. Now he's doomed. You've seen it before, I'm sure. Another redneck jury railroads an innocent minority-group member into the slams on what Lawrence Fishburn, the detective on the case, describes as pretty flimsy evidence, just barely good enough to convict. White guy then saves black guy from Old Sparky and the inmate embraces the loving family that has been waiting for his exoneration.<br><br>Not this time, though. The clean-cut black convict is guilty of the crime. He cuts a deal with another depraves maniac on death row, Ed Harris, than whom no one can act more depraved. Bobby Earl, the educated black murderer, will be released when Harris confesses to the murder of the eleven-year-old girl. In return, Bobby Earl will slaughter the parents that Harris loathes and will, as a kind of lagniappe, have a chance to destroy Connery's family too for a previous misencounter. <br><br>The finale loses it. It's been an engaging plot so far, although there is no believable exploration in character or anything. What I mean is that it is nothing more than a typical legal/moral drama with a surprising narrative, not a surprising execution. But the end is a typical shootout in an isolated gator-shack in the Everglades. People are stabbed, shot, kicked, pounded to a pulp, threatened with knives, and eaten by alligators. (Fat chance.) And all of this is preceded by a standard-typical car chase through the city streets and over half-open draw bridges. The climax degrades what would otherwise have been an effective legal thriller. <br><br>It is kind of interesting, though, to see the way the plot twists are carried out. And the cast is for the most part quite good, except that Bobby Earl is a bit bland. That blandness is okay when he's supposed to be innocent but it doesn't fit his true maniacal serial-killer child-molesting persona. The shooting is atmospheric, inviting and ominous at the same time. The score is generic. But except for the ending it's kind of enjoyable.<br><br>Of course, if you think about the movie, there's another whole perspective on it. It's a polemic against white Northern liberals who oppose capital punishment and are smitten with white guilt. It supports beating hell out of suspects and endorses a justice system based less on evidence than on intuition. And there is no racism at all in the South. Fishburn's daughter is like a sister to the little white victim; they are best friends and sleep over each others' houses. Why don't those Harvard egg heads just leave us alone here in Gatorville. We were all right until they started interfering.","user":"rmax304823","rank":[19,21]},{"title":"111 Everglades","rating":7,"date":"31 March 2006","review":"Never having seen this movie, based on the entertaining novel by Nicholas Katzenbach, and taking into consideration the first rate cast assembled for the production, we decided to take a look. \"Just Cause\", while not a horrible film, takes too many liberties with the original material that Jeb Stuart didn't quite succeed in his treatment. Arne Glimcher directed.<br><br>The first thing we think when a young black man is hauled to the local precinct for interrogation is police brutality. After all, sheriff Tanny Brown, and police officer Wilcox, show no mercy in beating Bobby Earl, who is accused of killing a young white girl. We feel horrified by what the officers do to the prisoner.<br><br>Then, the scene changes. Evangeline, Bobby Earl's grandmother is sent north to ask a distinguished Harvard professor, a retired lawyer, the young man wants Paul Armstrong to defend him. She old woman is convincing enough for Armstrong to take a look at the case. He is also convinced of the young man's innocence.<br><br>Things are not exactly what we thought they were. When Blair Sullivan, a man who is serving time in the same facility as Bobby Earl, comes forward to tell about how he is connected to the young girl's murder, and changes the dynamics of the case. The way it plays in the movie, it serves to confuse the viewer and distract Armstrong from arriving at the truth.<br><br>This thriller is made enjoyable by Sean Connery, who plays Armstrong. Laurence Fishburne, an intense actor, makes a fine impression as the Sheriff who, as far as we can see, is guilty of abusing his prisoner. Ed Harris has a wonderful opportunity to show why he is one of our best actors. Blair Underwood, Kate Capshaw, Ruby Dee and the young Scarlett Johansson are seen in supporting roles.<br><br>The film, even with its faults, will not disappoint.","user":"jotix100","rank":[30,35]},{"title":"A Conservative Is A Liberal Who's Been Mugged","rating":7,"date":"2 April 2007","review":"Just Cause takes some of the best parts of three films, Cape Fear, A Touch of Evil and Silence of the Lambs and mixes it together to come up with a good thriller of a film.<br><br>Sean Connery is a liberal law professor, married to a former Assistant District Attorney, Kate Capshaw and he's a crusader against capital punishment. Blair Underwood's grandmother Ruby Dee buttonholes Connery at a conference and persuades him to handle her grandson's appeal. He's sitting on death row for the murder of a young girl.<br><br>When Connery arrives in this rural Florida county he's up against a tough sheriff played by Laurence Fishburne who's about as ruthless in his crime solving as Orson Welles was in Touch of Evil. <br><br>Later on after Connery gets the verdict set aside with evidence he's uncovered, he's feeling pretty good about himself. At that point the film takes a decided turn from Touch of Evil to Cape Fear.<br><br>To say that all is not what it seems is to put it mildly. The cast uniformly turns in some good performances. Special mention must be made of Ed Harris who plays a Hannibal Lecter like serial killer on death row with Underwood. He will make your skin crawl and he starts making Connery rethink some of those comfortable liberal premises he's been basing his convictions on. Many a confirmed liberal I've known has come out thinking quite differently once they've become a crime victim.<br><br>Of course the reverse is equally true. Many a law and order conservative if they ever get involved on the wrong end of the criminal justice system wants to make real sure all his rights are indeed guaranteed.<br><br>Criminal justice is not an end, but a process and a never ending one at that for all society. I guess if Just Cause has a moral that would probably be it.","user":"bkoganbing","rank":[44,55]}]