[{"title":"Great Movie!","rating":10,"date":"30 May 2007","review":"How can anyone say this is not a great movie? Sure, you know what's going to happen, and it's lame, and silly, but so what? There are plenty of songs you hear that you know how they're going to sound less than 20 seconds into it. Pro wrestling is fake, but it's not about that. This movie is fun. People who look into it, and try to analyze the movie are missing the point. It's not Citizen Kane, or Schindler's List. The point is, there's a time and a place for those movies. This movie isn't supposed to be that. It's thoughtless fun, an escape just like anything else. Had a bad day, wanna relax without putting ANY thought into anything, just watch this movie. It brings a smile to my face every time i watch it. Where else will you get a movie with a guy named Wiley, or get to hear Terry kaiser say \"I'll even throw in a company car.\" Classic, simply classic cheese ball movie.","user":"mpavlic","rank":[14,18]},{"title":"great b-movie","rating":10,"date":"14 February 2005","review":"If you lower your standards and go in there expecting a B-movie, this one is fabulous. First of all, the cast:Peter Horton, C. Thomas Howell (wow, he grew up), Terry Kiser (he's alive for this one!), lovely Courtney Thorne-Smith. Even Kathy Ireland shows up... This movie came out right around the time that I was getting serious about volleyball, so of course my gang and I simply LOVED it. Of course it is totally unrealistic: a guy from nowhere ends up playing in an AVP final in 2 weeks! I wish. Anyway, it's also great to see all the legends of the game: O'Bradovich, Sinjin, Randy, Hov, Dodd, many of whom I have since met in person, wow, it doesn't get better than this. Even if you don't like volleyball, there's a decent plot. If you're a B-movie fan, you can't skip this movie. If every movie must have a deep inner meaning and soul to it, or has to make a statement, by all means skip it.","user":"karchad","rank":[14,20]},{"title":"This Movie Made Me Believe in God","rating":10,"date":"7 July 2008","review":"Seriously, if you want to learn the meaning of life, one man holds the answers - C. Thomas Howell.<br><br>His embodiment of Monroe Clark is Christ-like without ever being obvious - we see his divinity in the way he sympathizes with Zach Barnes' financial plight, giving him communion through his generous offer to play volleyball with him. No other living actor could have captured the holiness and generosity of this basketball player turned lawyer turned volleyball pro from Milwaukee with such nuance and yet, such gusto. Holding hands high with Barnes at the end he evoked that incredible sense of pride, pity, and ultimately, hilarity that one gets when one sees a retard so proud of his Special Olympics participation ribbon.<br><br>This movie is an absolute delight. Deserving of its place in the canon of all-time great works of art.","user":"cthomashowellisgod","rank":[14,24]}]