[{"title":"Crackerjack Thriller with a message...","rating":8,"date":"6 December 2003","review":"Why?  Well for starters there is the best chase sequence since The French Connection.  Then there is Will Smith as an actor - not just a star, though later in the movie he is admittedly overshadowed by veteran Gene Hackman.<br><br>There are two layers to this movie:  On the surface is a pacy thriller with edge-of-the-seat chases but underneath lies a telling commentary on government surveillance.  It is one of those truth-in-fiction stories which makes its point about government intrusion into privacy dramatically and effectively.<br><br>There are references to the classic, The Conversation: The surveilled couple talking in the park, and the Hackman character's premises are an obvious recreation of his workshop in the earlier movie.  If you haven't yet seen The Conversation - see it before you see this one - you will understand the Hackman character a lot better (besides, it is a superb movie in its own right).<br><br>Oh, and Jon Voight is terrific as the bad guy...","user":"neilmac","rank":[119,136]},{"title":"Whew!","rating":9,"date":"26 January 2006","review":"I don't know how I missed this in theaters, but I watched it for the first time tonight. I almost gave it a 10, because this is as good as the suspense/action drama gets. Somebody on the DVD special features called it \"...a combination of Crimson Tide, The French Connection, and 3 Days of the Condor.\" From my list of favorites I'd also say it has aspects of Marathon Man, The Fugitive, and The Firm. Will Smith, whose work does not thrill me 100% of the time, is terrific, and Gene Hackman could not have been better. They also receive support from some great character actors, many of them UNCREDITED (a fact which blew me away). <br><br>My enjoyment was enhanced by being familiar with Hackman's The Conversation, in which he plays Harry Caul, one of the world's greatest audio surveillance men. His hideout/office in Enemy is reminiscent of Caul's digs, and the photograph which the bad guys have on file for him is of his character from The Conversation. I sort of wish they'd named the new character Caul, giving long-term continuity to the story. <br><br>I'm running off at the fingers here, so I won't elaborate on the location, direction, etcetera, but will end with SEE THIS FILM!","user":"pswanson00","rank":[96,115]},{"title":"I like this one, also beeing somewhat realistic (not in every detail of course).","rating":8,"date":"24 August 2002","review":"Well, I like this one. I like the cast, the visuals are well done, but what is more important is the plot that I like really much. It's not the most sophisticated plot of all times, but I think it's quite good, and to some degree, realistic. Of course it's not possible to move sattelites that quickly, or zoom in on a videotape that much and still have crystal-clear visual, but quite some technology seen is realistic today, or in the near future. This is an hollywood flick, all right, so they have quite much action and everything looks very easy, steering a sattelite seems to be no harder than playing a video game, what makes it all seem a bit unrealistic/sci-fi-like, but today's technical posibilities are quite large, and continue to grow, so informing oneself about the issue (I mean the real world issue) is not a bad idea.<br><br>To give you some points to think:<br><br><ul><li>It's routine for the credid card companies to document every transaction made with the cards, go figure who gets the docs if police is investigating.</li></ul><br><br><ul><li>Every call / fax done is documented for billing, go figure, who...</li></ul><br><br><ul><li>At least for your ISP it's possible to read every unencrypted email you send or receive, go figure ...</li></ul><br><br><ul><li>Today there are MANY cameras in public areas in Great Britain, with numbers still growing.</li></ul><br><br><ul><li>Face recognition software is already being used in combination with some surveillance cameras.</li></ul><br><br><ul><li>Dictation software that can interpret your spoken word and convert it into written text is being sold to you today, maybe some organisations have much better versions at their hands ...</li></ul><br><br>The list could go on, but what I want to say is that one should think about the posibilities and listen to what the politicians say, and what they want to allow the federal organisations.<br><br>You want to be able to still _enjoy_ the movie in some years time, not thinking of it as being somewhat normal just as everyday life, all right?","user":"rolfhub","rank":[94,114]}]