[{"title":"Is This Some Kind Of \"Bust\" ???","rating":6,"date":"6 December 2001","review":"Like all B movies sequels are unavoidable, but fortunately for once it's an enjoyable sequel. Linnea and Ginger Lynn return to bust more bad guys and stop the evil doers the only way they know how, with their bras, guns, and brains (to bad they can't rely on the latter for much help). The film is missing the spark of the original with loss of characters like Chucky Long and Cherry Pop, but does have some laughs, and it is a good way to kill 80 minutes. Look for B movie queen Melissa Moore in the pre-credit sequence.","user":"kiddvideo","rank":[4,4]},{"title":"Garbage, but Ginger makes it smell a little better","rating":4,"date":"8 April 2007","review":"\"Vice Academy 2\" is worth sitting through only for Ginger Lynn Allen: she is cute, she appears in black lingerie, she wears a revealing dress, she performs (along with Linnea Quigley) a strip dance, and she throws one mean right punch. Other than her, the film is so PAINFULLY drawn-out, so insultingly lame, so persistently witless that you simply won't believe it (just one example: what a brilliant idea to create a powerful half-woman/half-robot crime-fighter and then put a switch on its back that anyone can easily move to \"worthless\" or \"overload\" mode). If complete lack of talent was a crime, writer-director Rick Sloane would be serving a life sentence. My rating is pretty generous for this one. (*1/2)","user":"gridoon","rank":[3,4]},{"title":"A perfectly stupid sequel to the lovably idiotic original","rating":8,"date":"19 August 2008","review":"Spunky Didi (the always cute and perky Linnea Quigley) and spoiled rich snob Holly Wells (the delightful Ginger Lynn Allen) are a couple of constantly sparring rookie cops who pose as strippers in order to stop evil villainess Spanish Fly (essayed with deliciously hammy brio by Marina Benvenga) from dumping a powerful aphrodisiac in Los Angeles' water supply. Writer/director Rick Sloane aims low and elicits plenty of cheap laughs by making amusingly broad jokes about such naturally sidesplitting topics as phone sex, vomiting, and bondage. The cast have a field day with their roles: Quigley and Allen have a nice chemistry as the two sexy leads, Jayne Hamil is an absolute riot as snippy, uptight superior Miss Thelma Louise Devonshire, plus there are nifty supporting turns by Scott Layne as smarmy, sexist, conceited stud muffin patrolman Petrolino, Jo Steele as sassy receptionist Jeanie, Jay Richardson as the bumbling police commissioner, Toni Alessandrini as enticing stripper Aphrodite, Teagon Clive as beefy cyborg BimboCop (an obvious parody of RoboCop), and Melissa Moore as brassy hooker Glaze. Tomas L. Calloway's decent cinematography is passable at best, although both Alan Der Marderosian's bouncy, funky score and the cool-rockin' soundtrack are on the money gnarly. Look fast for Duane Whitaker (Maynard in \"Pulp Fiction\") in a small role. Better still, the luscious Alessandrini struts her sizzling stuff with a much-appreciated striptease while Quigley and Allen steal the whole show with an equally yummy joint striptease act. Sure, this flick is undeniably dumb and silly, but it has a certain endearingly dopey charm to it that's impossible to dislike. Good, undemanding no-brainer fun.","user":"Woodyanders","rank":[1,1]}]