[{"title":"To Be Remembered Forever: 'Happy' And Bob Barker Trading Blows","rating":9,"date":"30 March 2006","review":"A \"pro\" golfer duking it out with veteran game-show host Bob Barker right in the middle of a tournament. That scene alone makes this one of the more memorable comedies of the last 30 years. Almost everyone I know has either seen or heard of that scene and everyone laughs at it.<br><br>It IS ludicrous and that's what makes it so funny. In fact, most of the movie is totally preposterous, totally unbelievable and totally wacky, which is Adam Sandler's trademark in these comedies. He's low key but violent, as he was in Mr. Deeds, Punch-Drunk Love and a few other films.<br><br>Here, Sander is even more vocal and violent than normal and definitely more crude, which is saying something since this actor usually doesn't play guys with a lot of class. \"Happy\" is a hot-tempered hockey player who can hit a golf ball 400 yards so he tries his hand on the PGA tour to help raise money for his grandmother. I just shake my head even writing that last sentence, it sounds so stupid....but this is a stupid movie with an incredibly stupid story but is hilarious, for the most part.<br><br>Anyone who is a golfer would appreciate this movie more than others, because Sandler says and does things we'd all like to do on the links at times but, thankfully, don't. In short: this is a crude but very funny movie.","user":"ccthemovieman-1","rank":[81,97]},{"title":"Turn off brain, watch movie, laugh, enjoy, laugh some more","rating":10,"date":"17 September 2002","review":"\"Happy Gilmore\" is the Adam Sandler movie to see. If everyone had to see one Sandler movie before their lives were complete, I would seriously hope this is the movie they see. It's nice to see golf and hockey in a movie again. I don't think there is another movie out there that makes me laugh as much as \"Happy Gilmore\" does. You have Happy, the ultimate hero, fighting to win a life of security for his grandma. There's Shooter McGavin, the villain you love to hate, who attempts to foil Happy's quest. And then there's Mr. Larson, Happy's 8' tall monster of a former employer, threatening Shooter at every turn. Hey Bob Barker is in this movie! It doesn't get much funnier than Mr. Price Is Right insulting our hero. Well maybe Ben Stiller's part in this movie is funnier, as he corruptly directs a retirement home. It doesn't matter what's the funniest. This whole movie is one hilarious moment after another.","user":"nucksfan4life","rank":[68,84]},{"title":"Apollo Creed with a wooden hand!! funny as hell","rating":7,"date":"30 April 2000","review":"Adam Sandler has a very funny movie here that works like no other since Caddyshack.  Sandler plays a lazy guy who has to save his grandmother's house from being removed.  So, he starts to play golf in a way that only Sandler can.  He is also instructed by Carl Weathers (who memorably played Apollo Creed in Rokcy), and wathcing his scenes I had to leave the theater from laughing so much (he had a wooden hand and it always gets knocked off). Sandler knows how to keep people rolling in the ailes, and this proves it. A++","user":"Quinoa1984","rank":[43,58]}]