[{"title":"An Arizona set fairy tale about growing up","rating":9,"date":"11 February 2005","review":"For me, the movie Arizona Dream gives a great account of how dangerous it can be to be caught up in your dreams and the little worlds those dreams can create and if you don't move beyond, you're dead alive. The only character that seems to be able to step out of his own little world and capable of reflecting is Axel. All throughout the film nobody else changes, but Axel. <br><br>Leo, a caring but wallowed in guilt character, can not see his nephew as a real person but just a boy who'd take over his business once he dies. He's so caught up in his own version of reality that he doesn't see that Axel has grown up in the meantime and may want to figure out life for himself. Leo tries to shove down his world as a ready-made future for Axel, who has none of it. At the same time, Axel can grow beyond this when Leo commits suicide and offers to help his uncle in his car-dealer business. Axel seems to have a deep appreciation for life  a trait no one else seems to have in the movie. <br><br>Elaine is completely caught up in her childhood dream for flying in order to overcome her own depression. The only thing that matters for her is her own survival. She is unaware how much she steals any independence from her stepdaughter and her self-serving nature makes her empty  a trait that Axel recognizes by the end of the film. In contrast, Axel is first drawn to this quirky world of flying high as it seems real, but once he discovers that flying is only a form of displacement for Elaine, he sees through her and she looses her magnetic energy for him. <br><br>Grace is the only other person capable of growing besides Axel in the movie. In her first appearances she seems like a two-dimensional depressed character totally overshadowed by a sexy stepmother and consequently too depressed to be more than a little destructive animal. At the same time she seems to relate to others at least emotionally  her destructiveness at least seems like a form of connection to others. Towards the end of the movie, she can grow beyond herself and can start showing love and appreciation  the other side of her negative emotions and thus turns into a real person. But this transformation is too much for her psyche as she doesn't know how to live a healthy life, and even though Axel recognizes the real person in her, she chooses to kill herself  she has no choice, really. <br><br>Axel  who at least makes the effort to connect with characters, symbolizes the strength one needs to grow up and beyond what is around him. He's the most involved emotionally but because he's not caught up in his dream  or because his dream is abstract enough, he can stay detached while being attached. He's capable of caring and he's the one who's always there for more adult people who need help  and he delivers: One thing I was sure about: The moment my parents died, my childhood was gone forever. And it was gone forever, he becomes more of a grown up than most grown ups around him. He knows how to keep a distance even when Grace abuses him and there's only one point in the movie when he almost looses it  when Grace invites him to play Russian roulette. <br><br>For me, the Eskimo scene wonderfully sums up why we are here and that's something I think Axel finds for himself by the end of the film. Instead of the existential questions brought by the first Eskimo scene  how do you survive by love; nature can kill you and save you; why do we replicate our lives in inhuman conditions;  in the last Eskimo scene he just talks about fish with his uncle. The message, for me at the end was that instead of asking all these questions you just get on with your life, learn a trade you love and your life grows into the answers. At the same time, coming to understand this, you may have to go through a real emotional discovery of love, dreams, reincarnation, death  and if at the end you survive and strong enough, life might be worth living. <br><br>It seems that Axel was lucky to have had the guidance he received from his parents, but he had to experience them through his own skin. That's how he embarks at living in New York as his Mom suggested that New York has one of the eight magnetic pulls. But initially he chooses a job that not only allows daydreaming but also fosters it; he tags fish for an organization. Later, he's taken or dragged into a more real life, but a life still of dreams and not his own yet  he moves first into his uncle's dreams and then into Elaine's and Grace's. First he has to discover responsibility by rejecting his uncle and he has to discover love and death through love. It's only after these experiences that he can leave other people's lives and dreams and start his own. It's a wonderful fairy tale where a young boy wades through the quotations from his parents to discover his own place and soul. <br><br>\"Good morning, Columbus.\" My mother's eternal words, reminding me America was already discovered, and that daydreaming was a long way from life's truths.\" <br><br>\"For 15 years, he'd smooth down the road between Mexico and Arizona, and every morning he'd be out there looking for footprints in the dirt. But my father always said that work was like a hat you put on your head. And even without pants, you didn't have to be ashamed of your ass.\"","user":"szigeti-ildiko","rank":[100,118]},{"title":"Surreal perfection","rating":10,"date":"28 May 2004","review":"It's very rare that I see a movie that is truly, in all aspects, perfect.<br><br>For example, while The Princess Bride ranks pretty high on my list of movies I'd want to spend the rest of my life watching, I fully realize that the camera angles and special effects of that movie are just plain bad. And while Fear &amp; Loathing In Las Vegas gets a perfect 10 from me, it still completely lacks plot. And so on.<br><br>Arizona Dream, however, is different.<br><br>The last movie I saw that was truly, in all aspects, perfect was Dog Day Afternoon, a 1975 true story starring Al Pacino and Chris Sarandon. For the longest time, it's been my obsession, my movified bible, everything other movies should aspire to be. And as of today, Dog Day Afternoon finally has competition in my personal top ten: Emir Kusturica's masterpiece very near surpasses Lumet's vision of captivating dialogue, insane details, and dodgy man-groping.<br><br>Let's change the subject for a bit. Do you know the scene in Gilliam's Twelve Monkeys, where Bruce Willis is in his cage, and a hamster is running inside a wheel in the corner? Don't say yes, because you don't. It's inaudible. It's impossible to see. But it's there. Kusturica, much like Gilliam, is willing to make his world more detailed than your wildest dreams. His backgrounds are filled with symbolism and surrealism, his dark corners filled with soft puppies. And like Gilliam, he can make you cry with laughter, your only worry in the world being, 'how will I remember all these great quotes in the morning?'<br><br>But unlike Gilliam, Kusturica has the power to, barely a scene after the happy happy joy, make you sit there in stunned silence, your number one worry in the world being, 'how will I get my brain to understand the sheer tragedy that is unfolding here?'. Your will find yourself thinking, 'how do I get my mind to comprehend how perfectly this music fits the dialogue?'. Your eyes will follow the camera angles, the expressions of the insanely lovable characters, the many things happening in foreground and background-and you know, you just KNOW, that you will have to watch the movie again, and again, and again.<br><br>If you're a fan of movies such as Big Fish and Amélie, movies about people finding happiness and warmth in a world of surreal ambition, Arizona Dream will be your next obsession. But even if you think massive explosions and a grunting Bruce Willis are the only thing that can make a movie worth watching, you will still want to give this movie a chance- for the 'explosions' it causes will far, far surpass anything you've EVER experienced before.<br><br>10/10.","user":"Rosear","rank":[173,223]},{"title":"What dreams are made of...","rating":9,"date":"30 June 2005","review":"Some movies only work if we let ourselves carry away by them. They present a surrealistic imagination world that comes from the mind of their creators. They are hard to watch, especially when they mix real characters that live their lives sometimes awaken, or inside one big dream or their own dreams.<br><br>Axel Blackmar (Johnny Depp) is a dreamer, and an unusual example of personal choices. His parents died and he went to New York, to work with fish. He could have sold cars with his uncle Leo (Jerry Lewis), but he's there, talking with that monotonous voice about what he does. Maybe it was a simple dream, where an Eskimo catches a fish with two eyes on the same side, and tells his kids to go out with their dog so he and his wife canAnd the kid with the dog allow to see an orange balloon that seems to go from Alaska to New York, where Alex sleeps in a truck. \"Wake up, Columbus\", the words of his mother and Axel's hope to find something in the land already discovered by that man.<br><br>Alongside fish flying through the air, we join Axel to be the best man of his uncle's wedding. With his friend Paul Leger (Vincent Gallo), the untiring chats go from movies to philosophies about cakes, pies and bananas. Paul is an actor: \"I'm having a great performance on Friday\", he says. \"It's an audition\", Axel says to humiliate him. The truth is that it's not even an audition. This stuff lived by Axel is a story for us, but is a personal rediscovering and rethought of decisions in life for the character. When he sees Elaine (Faye Dunaway) he feels something strong, but doesn't know how to call it. Days later he becomes the lover of a woman decades older than him. Elaine's daughter, Grace (Lili Taylor) is also there, and it doesn't goes long until Axel finds himself in a crossroad between the heart of two women, that as he describes them, are \"too similar and big to be in the same world\".<br><br>David Atkin's story and screenplay comes plagued of phrases that could come out of a lunatic's mouth, but they fit in the film's context and twist your head at maximum. \"I've got to climbIt's a long way to the moon\"; \"I'm gonna live forever until I become a turtleThey have infinite lives\", besides scenes of well known movies in crucial moments. And what music (Goran Bregovic)! And what editing (Andrija Zafranovic)! And what cinematography (Vilko Filac)! And what director! Known for his originality, recognized director Emir Kusturica puts his own signature to his movie, collaborating in the story he must have dreamed a little to; giving life to the dream with his flying camera, full of unexpected turns and in love of its surroundings. What he achieves is greater words, although not everybody could understand it, and, for that matter, appreciate it.<br><br>And his actorsJerry Lewis in a total comprehension of his character, and so involved in his work that you wouldn't believe it. So incredibly likable in one of those roles we never give much importance to. Faye DunawayWow! She got to work with some of these actors later, but here, as an old woman in character and, with respect, in person, she maintains that virtue of creating uniqueness, with her laughs, smiles and way of saying things. Lili Taylor was the most interesting character here. The silent daughter that could be crazy but no one can really tell. With imagination and freedom, Taylor makes her character believable and not as overacted as it might be. Vincent Gallo, who I respect mostly as a director and as an actor that does what he wants, the ability he has had to choose his roles is visible here again; as he shines without lights to help him. A wonderful performance his fans shouldn't miss.<br><br>But DeppHow can I explain? I've said it a lot, surely, but I will repeat it. He's like a magician, but not with the cards and the hat and the tricks. He is with his face, his looks, his way of talking, his perfection of movementBut it's not really something technical: \"in the acting world, Johnny Depp is a magician\". I'm sure he still has plenty of that for us, but here is where he let us know first.<br><br>In one scene, Vincent Gallo's character Paul, an actor, requests that no one touches his face, because it's important. \"Do you think they touch Brando's face? Do you think they touch Pacino's, De Niro's? Do you think they touch Johnny Depp's face? I don't know then, but not know; and if they did before, they shouldn't have.","user":"jpschapira","rank":[67,86]}]