[{"title":"Excellent movie and supreme eye candy...","rating":20,"date":"20 January 2002","review":"I've watched this film over and over again and it just gets better. It's actually based on a book called \"Hand-Me-Downs\" which you'll understand after you've watched it. As the last person who commented on this stated it's not the \"Kama Sutra\" you're thinking of. There IS sex, there IS a bit of violence, but don't watch this with the hopes of seeing your average vulgar action and sex film. The women in the film are instructed and shown how to the master the art of Kama Sutra, mind you the ART not the positions. Anyway, the film setting is gorgeous and the acting is superb. You'll recognize Sarita Choudhury as Tara if you've already watched Mississippi Massala. Indira Varma does an excellent job in expressing her revenge, regret, and mystery in Tara's character. Everyone and I mean EVERYONE did an excellent job in this film.","user":"LauraPalmerthemuffin","rank":[59,68]},{"title":"A feast for the eyes and the ears","rating":24,"date":"24 July 2004","review":"Produced in India by an Indian director and production crew for the primary purpose of introducing Europeans and North Americans to some aspects of the Hindu culture, this film was never intended for domestic markets and in fact I believe that it remains banned in most parts of India. Although in many ways the Hindu culture is highly erotic, eroticism is not normally featured in domestic Indian films and the Director had to recruit two British born actresses for the starring roles. It is a beautiful film which was quite successful in parts of Europe and it is unfortunate that it had only a limited release in North America.<br><br>\tUltimately the film is a Feminist Tract, which is said to be based on an Indian legend from the early sixteenth century - the period immediately after the foundation of the Mohgul (Mongol) empire in India. It is a story about an intelligent woman born  into a low cast who is the servant of a high cast compatriot betrothed to the local Raj. In most parts of the world the subservient status of women at the time of this legend made it very difficult for them to establish a satisfactory lifestyle except in the traditional role of wife to the master of a family and mother to his children. In India the difficulties were greatly compounded by the additional limitations imposed by the cast system. The film basically records the efforts of this woman to use her sexual attractiveness to develop a lifestyle that would be acceptable to her. In modern parlance Maya has the moral standards of a guttersnipe, but in the context of the period in which she lived she merely manipulated the weapons available to her to try to establish what any modern woman would describe as an acceptable independent lifestyle. Ultimately her plans basically fail and the film ends with her walking confidently towards an unknown future after losing her lover and every support that her former life had provided, but with a confidence that she could face the future, whatever it might bring, thanks to the lessons in life that she had learned during her period at the Royal Court. Women can clearly identify with this story - although IMDb users in general have only given this film fairly average ratings, the demographic breakdown of these ratings shows that younger women rate it most highly.<br><br>\tThe title \"Kama Sutra - A love story\" poses a problem, Many western viewers expected a near pornographic sequence of orgies with sexual encounters involving highly convoluted positions - their disappointment can be seen both in some of the viewer comments featured in this data base, and by the low ratings many viewers have given to this film. (One IMDb reviewer has made the interesting comment that the film might have been much more successful if it had simply been titled  \"A love story\".) The film has also been derided as an Indian version of a modern soap opera. The common feature of soap operas is probably their limited characterisation and a shallow one track story line; but if we look at European stories and legends from the same period we find that they mostly show similar features - think only of the Decameron or such works as Moll Flanders and Fanny Hill. I have never been a fan of the modern soap operas- perhaps because they cut too close to home- but I am a sucker for those such as \"Dangerous Beauty\" or \"Black Venus\" which have the ability to temporarily transport one into life during an earlier period. Consequently I greatly enjoyed this film which not only successfully recreates a long past period, but also provides a realistic glimpse of life as lived in a totally different culture to my own. Most soap operas are rather melodramatic, but despite its exotic locale and period, the film \"Kama Sutra - a love story\" remains somewhat underplayed. The Raj showed a fairly unsavoury character, but none of the petty vindictiveness we associate with European royalty of the period. The arrest and execution of the sculptor, Maya's lover, was clearly inevitable but it was not carried out with the oriental barbarism I expected to be displayed, and this Indian royal court was shown as both more civilised and more humane than say its European equivalent in the English court of Henry VIII.<br><br>\tFor a film to be a success there are basically two requirements, it must have something worth while to feature and it must be sufficiently competently made to hold the viewers attention whilst watching it. In my view this film fully meets both these requirements. Although the story line was a little trite and the characterisation was somewhat shallow, the camera work was superb and was a delight to the eye throughout. It is hard for a Westerner to judge how authentically the sixteenth century Mohgul royal court was represented, but as shown its visual impact was both exotic and exciting. A important part of this film was the outstanding score which contributed much to the mood and atmosphere. This score, the sets, the costumes and the camera work were outstanding throughout and provided a continual feast for both eyes and ears. What more can a viewer expect? I give this film a rating of eight out of ten, much higher than the average rating recorded in the IMDb database, and I do so deliberately not because it was a great story but because both the score and the camerawork justify this rating. This is at least as valid as giving a similar rating to films with a great story to tell, but with very indifferent camera work. After all the cinema is essentially a visual form of entertainment and any film which can, like this one, keep our eyes glued to the screen throughout has to be recognised as way above average.","user":"bbhlthph","rank":[62,74]},{"title":"Good Love Story / Drama","rating":28,"date":"28 January 2002","review":"When I rented KAMA SUTRA - A Tale Of Love, I thought my girlfriend would kill me for what the title implied.  We were plesantly suprised to find a Love Story / Drama which, yes, has some very sexy scenes in it.  Those looking for a movie version of the ancient text will be disapointed with the reasonable use of sexual content.  There is an actual storyline here! This film is about true love, and the struggle for that love in the face of adversity. The love triangle, along with enough character development to explain the relationships between the five main characters, speaks of the human condition.<br><br>The story takes place \"Once upon a time...\".  The costumes and sets are really well done.  The cinematography is richly textured, with India as the exotic backdrop, and you are transported back into time... and into the lovers' experience.<br><br>This movie can take you through a full range of emotions, see it with your significant other, and expect it to effect you for the rest of the night.","user":"toddphillips-1","rank":[53,63]}]