[{"title":"One of the best \"bad\" movies you'll ever see !","rating":7,"date":"28 August 2009","review":"This cheesy 80's classic with it's awful continuity, dreadful script, half baked story and wooden acting still rates as one of my favourite films of its kind.<br><br>The plot is loosely based around Dolph Lundgren's character \"Kenner\" setting out for revenge on the Yakuza Oyabun \"Yoshida\" who killed his parents when he was a child. Years later Kenner is an LA cop and crosses paths once more with Yoshida when he comes to the USA to set up a drugs syndicate.<br><br>As you'd expect, you get to watch Dolph and his side kick played by Brandon Lee kicking ass and shooting holes in everything that moves. There are a bevy of good looking, half naked women on display, the most delicious of which is a young Tia Carrere.<br><br>My personal favourite in all the filming errors has to be when Kenner sustains a gunshot wound and immediately clasps his shoulder in pain followed by the words ...\"Its OK, it went straight through\". A moment later the camera views him from the rear and there is no exit wound ! Even better though, a few moments later the camera re-focuses on Kenners naked chest and the bullet wound is no where near his shoulder, its actually in the left lung / heart region ! I don't think he would be in any state to carry on fighting with that injury !!!<br><br>Because \"Showdown in little Tokyo\" refuses to take itself seriously, much in the same mould as John Carpenters \"Big trouble in Little china\" did, all you have to do is relax and enjoy the total self indulgence that this film allows you ! <br><br>Great fun. 7 out of 10.","user":"RedRoadster","rank":[26,27]},{"title":"Give it a break!","rating":17,"date":"17 May 2001","review":"Reading some of these comments, it occurred to me no one seems to know how to have fun anymore.  This movie is not meant to be a great movie. I don't think any of the actors had intention of trying for an oscar.  It's simply a fun movie.  The action sequences are pretty cool and the one liners are hysterical. Dolph Lundgren and Brandon Lee are a great action pair. The chemistry between them is amazing. If you just want to watch a movie that's going to make you laugh, and get some good action with it, I highly recommend Showdown.","user":"Empire-7","rank":[28,30]},{"title":"What's The Problem?","rating":8,"date":"11 February 2001","review":"People seem to be awful hard on this movie. I guess they must not be action fans. I mean, come on, this movie's only purpose is to entertain. And it does its job well. It moves at a very fast pace for its short 79 minutes, has lots of good action, and a good sense of humor. What more could you ask for in an action movie. I don't know about you,but thats all I ask for in a action movie. Its not art and its not supposed to be. 3 out of 4 stars.","user":"mvilla","rank":[49,56]}]