[{"title":"More than a movie","rating":10,"date":"22 December 2005","review":"Porco Rosso is not just one of those movies that you watch and give back to Netflix. It is one of those movies that genuinely makes you hate your life, but in a good way. Watching a movie like Porco Rosso makes you wish that you lived in their world, and that you could fly your own plane between the Adriatic Islands and your own private hideaway. It is the kind of film that takes you inside it and leaves you with a sort of culture shock when you are forced to realize that you are in your modern-day room with no way to get around but a car or a bike. It is the sort of movie that you watch again not only because you love it so much, but also so that you can have a portal back into that magical world and dream that you can become like one of the characters in the movie with some sort of \"reality\". Who cares if there are flaws? Is the world absolutely perfect? So what if there is ambiguity about the ending? Is life always crystal clear? Porco Rosso is one of those movies that has the perfect mix of reality and fantasy; it gives you a world that you wish you were a part of, and COULD be, if only you can find it....","user":"walrashish","rank":[180,197]},{"title":"A magical European adventure that is too real to brand a cartoon. A visual splendor - the imagination of an artist unequaled in the animation world.","rating":10,"date":"4 July 2005","review":"Over the decades, Japan has established itself in the animation scene as a contender, creating some of the most mind boggling realistic, detailed animation the world has ever seen. However, Japan had primarily made cartoons involving their traditional, cultural and supernatural themes that the world felt alienated to.<br><br>It wasn't until a great artist came along in the mid-1970s that was to make Disney look like a second class citizen in the animation business. Hayao Miyazaki was Japan's inspiration to open their eyes to new horizons and show the world their hand in art. His first motion picture released in the late 70s was Lupin III: Castle of Cagliostro, which proved to be a world success. From that point on, he created some of the most memorable, brilliant and detailed masterpieces the western world ever saw - most having something to do with world issues and human's spiritual touch with nature. It wasn't until I saw Porco Rosso that I found my oasis in animation, a film that has no reason to be a cartoon due to its sheer realism and setting.<br><br>The premise is simple, subtle and imaginatively compelling. The story follows a humanoid pig known as Porco Rosso ('Crimson Pig' in English Translation), a bush pilot during the rise of the Nazis in the 1930s when Mussolini was a strong ally with Hitler. Whilst war is on the brink of initiation, Bush Pilot 'Pirates' roam the Italian coast, robbing ships, tourists and living the life few people could experience. Among these gambling, thieving, dirty pirates however, Porco Rosso stands as the ace pilot and feared by all. As he threatens the welfare of all the pirates, particularly the Mamma Aiuto Gang, the price on his head sky rockets. The only thing that lies between him and the pirates is a beautiful woman named Madame Gina, the singer and proprietor of an island resort popular with all the pilots that come through. Gina loves Porco since childhood, when he was a real human, and cannot bare to lose yet another close one, like her previous husbands. Both Porco's and Gina's world is turned upside down when an American ace pilot named Curtis intrudes into their lives, insisting on making a name for himself as he plans to fight Porco in an air battle all the while falling in love with Gina.......the American way.<br><br>Porco's subsequent adventures lead him to discover something about himself, about those important to him and about letting go of his constant turmoil and guilt of events that have haunted him for years, as he meets new characters that open his eyes and return him to what he once was.........just a human.<br><br>Rarily has an adventure movie been so fun, rich and captivating as Porco Rosso in addition to its overwhelmingly brilliant animation. Like I said before, there is no reason for this film to be a cartoon, but because it is and because it was realized in the way that it was, this is what makes it a masterpiece among World Animation.<br><br>The story, being very simple, could be taken on many levels with its inner meaning and symbolism. You forget that you are watching a cartoon after 5 minutes. It takes itself mildly seriously and the comic relief is timed to perfection. The characters vividly come to life and drain you of your emotions with each of their stories. The world Hayao Miyazaki creates is so real, that you are inevitably drawn into it. The magnificent romantic and exotic music and attention to authenticity make the film's atmosphere so convincing and breathtaking - the music always suiting at the right moments. I hardly believed this was a Japanese film, considering it felt completely like a European production. But no, only Hayao Miyazaki could accomplish such feats as to utilize your imagination and transport you to another world without any reference to his origins. That is his gift. This was evident ever since his motion picture debut. He has made many brilliant films, but Porco Rosso is the black sheep in the crowd. It is like something he's never done before, as all his films were supernatural in many ways.<br><br>This is my favorite cartoon of all time, and one of the great motion pictures you're bound to ever come across in world cinema. Forget about Disney. If you love animation and film, go no further than Hayao Miyazaki, one of the last great directors and story tellers in a world which has forgotten quality. Disney died a long time ago, and Miyazaki is a director in the old tradition - a tradition where plot and characters meant much more than special effects. Porco Rosso is an escape you'll come back to often. Few films have captured the essence of Europe, Flying and Adventure quite like it. It lifts your spirits and inspires you to see the world in a different way. The beautiful mix of music, color, animation, detail and setting make this a most unforgettable experience. 'Porco Rosso' is the definitive work from the legend of modern animation, Hayao Miyazaki.","user":"Freddy_Levit","rank":[122,139]},{"title":"It's a Miyazaki Ghibli... What else is there to say?","rating":10,"date":"14 January 2003","review":"If somebody were to start up an all-Ghibli network on television, I'd leave the set on that channel unless I heard a nuclear attack siren. Kurenai no Buta is one of those films that could fill up much of the schedule, as I could watch it over and over again.<br><br>Set in Fascist Italy in the late twenties, the story is about a cursed WWI Italian fighter pilot, Porco Rosso, doomed to live out his life in the form of a pig.  He spends his leisure hours basking on his secluded private beach with his bright red monoplane. He makes his living by tangling with air pirates, collecting rewards for recovery of valuables.<br><br>\nPorco Rosso has a lot to deal with in this story. He has the pirates to contend with, a swashbuckling American mercenary looking for a good dogfight, an increasingly intrusive Fascist presence eyeing his activities, a finicky airplane, and two women in love with him. Other than the vaguely appearing Fascists, there are no real villains in the film.<br><br>Mamma Aiuto is a heavy-set bearded chap, somewhat reminiscent of Bluto in the Popeye cartoons.  He and his gang of bungling pirates have honor, if not exactly fastidious bathing habits.<br><br>Donald Curtis, an American mercenary, seems driven to glory and fame-and falls in love with every pretty face he sees.  He's after notoriety and feels an air duel with Porco Rosso is the ticket to get there.<br><br>Gina, Porco's childhood sweetheart, runs a popular island resort.  She's still in love with him, but he doesn't quite get it.  All the pilots of the Adriatic love Gina, who was married and widowed thrice. Donald Curtis is right in there with everyone else vying for her attention.<br><br>Fio Piccolo, a 17-year old American aeronautical engineer, is commissioned by a reluctant Porco to fix his plane.  She also falls in love with him as she gradually sees his character. He gets it, but he's not really interested in that kind of arrangement--especially with one so young.<br><br>\nA working, radio-controlled scale model of his plane hangs in the Ghibli Museum in Mitaka, Japan, along with photos of it in flight as proof that the airplane depicted in the film actually could fly.<br><br> This story weaves together beautifully and leads to an ending that is a topic of discussion among those who have seen it.  This is a must-see film. I give it an easy 10.","user":"dballred","rank":[88,100]}]