[{"title":"\"Haven't held one of these babies in 20 years!\"","rating":7,"date":"11 July 2006","review":"Jippie, the first movie I comment!<br><br>Anyways, this was one baaaaaad bad movie, in fact it was so hilariously bad it just cracked me up and I thought it was good! Okay the beginning is pretty slow. This had some poor acting too but what can you expect? I actually rented this movie because it stood in the news section, it had just been released on DVD, don't know what the crap it was doing in the news section. The first 30 minutes I regretted renting it but after a while it became very entertaining to watch in all of it's marvelous crappyness.<br><br>So what we got here is basically mutated mosquito's that sucked the blood of an alien that crashed into their swamp. These bastards are huge and they suck humans dry, even makes their eyes pop out! So we got this small gang of people, running, hiding, and fighting these things. A plus on this movie is that one of them is none other than good old Gunnar Hansen, better known as \"Leatherface\" from 1974's \"Texas chainsaw massacre\". He even makes a very goofy, incredibly bold reference to his old days as leatherface by grabbing a really huge chainsaw to fight mosquito's with, saying \"I haven't held one of these babies in 20 years!\" The mosquito's though are a bit of a gag, looks kind of plastic, though they could have been worse... I guess they are acceptable. Anytime the camera follows a mosquito if we look closely, we can see the wire it's hanging from, though this happens a lot in movies, even in some quality ones so we can't hold a grudge against this movie for that old mistake. Though when several mosquito's are seen chasing after the gang the effects are so poor, it's like 8 frames per second, tops, looks more like paper cut outs, flying across the screen, though more like lagging across the screen.<br><br>Also one thing in a scene that really astonished me. The main character couple stumbles upon a small boat that moves around. If I remember correctly you could hear mosquito buzzing from inside of it. So they lift it and it turns out to be a local park ranger instead. (WTF?)<br><br>One scene that had me cracking up was when the group hides underground and the black guy (my favorite character except for Gunnar) mentions he was in nam, to which Gunnar responds him too. Then the young guy hasn't really got anything so he just says \"Yeah well I was in the boy-scouts!\" To this comments everyone actually starts laughing in the movie! It's completely unsuiting, but it was actually kind of fun, one of the funniest things in this movie actually. I don't know, maybe I was exaggerating a bit, rating this a 7, but it's just because it's so damn funny to me! It's worth a look if you enjoy watching B-flicks.","user":"Werewolfy","rank":[9,9]},{"title":"Either except it as a cheesy romp and love it or take it seriously and hate it","rating":9,"date":"28 January 2006","review":"This movie is in constant rotation on SciFi and its another one of those movies that I stop at each time its on. The plot has badly done giant mosquitoes attacking people in the country side. They have been mutated after feeding on the blood of dead aliens...I know you're shocked, you were expecting a high class movie (even with the title Mosquito) and instead you got a very silly movie played (reasonably) straight by everyone involved. Clearly the cast and crew knew this was a silly idea, but they milk it for all its worth turning the attack scenes into something you both wince at (for the idea of it) and groan at (the silliness of the execution). This is one of the rare modern attempts at a drive in movie that walks the fine line between being serious and being mocking to create something thats enjoyable despite the dumbness of it all. If you can take it on its own level its worth two bags of popcorn and a couple of sodas. If you can't take it for what it it is then you're in for a long painful viewing experience.<br><br>9 out of 10 on the brain dead fun-o-meter.","user":"dbborroughs","rank":[14,16]},{"title":"Old Fanshion Fun","rating":8,"date":"12 August 2006","review":"Okay first let's deal with the so-called fact. \"Factual errors: An oft-quoted rule of nature states that for an animal's increase in size, the weight increases by the cube of the increase while surface area only increases by the square. This means that neither the mosquitoes' legs nor their wings would be able to support them or let them fly. They would be helpless, trapped on the ground.\" That is not always true. Since these creatures are mutations open-minded scientist theorize that along with their size, the animal or insect's molecular density would also increase. Ergo, they would be stronger then a normal size bug that just \"got bigger\". Anyway, about the story, it's good old fashion fun, the characters are well written, the effects are totally assume. The story works, even though they never did find out why the craft crashed? Oh well, I liked the story; the cast did a great job and all and all, a great movie. I give it 8 STARS!","user":"lordzedd-3","rank":[6,7]}]