[{"title":"I'm so upset no one else loves this movie....","rating":10,"date":"11 March 2005","review":"I think I might cry. I feel so hopelessly misunderstood. This movie is brilliant.... I feel as though the epitome of my sense of humor has been rated \"two stars\"... this is depressing...<br><br>It's just... brilliant. It's completely nonsensicle and pointless and brilliant, much like a dream I might have when on too much cold medicine. Much like the dreams that I find most delightful...<br><br>It's one of those movies I find myself quoting all the time just to hear the lines again. Everyone thinks I'm nuts when I quote it because of course no one has ever heard of it. I've taken to making the little \"plop\" noise that Steve Martin does when he gets too flustered... when I get too flustered. Madeline Kahn is my hero. I relate too well to Mrs. Munchnik, sanity surrounded by chaos only to find that deep down, she too is a nut. If I were stuck on an elevator, I would have acted just as she had, making up little raps... It's the simple stuff... simple stupid stuff. That's what makes this film so brilliantly refreshing. It's so dumb! Take Adam Sandler, for instance. There was no reason for this character whatsoever. It was entirely random and uncalled for. It was almost as if he happened to be walking by and they called him over and said \"Hey, Adam! Wanna be in a movie?\"... the only thing he did was show off his mad ukulele skills. And he made me laugh... he was there for the sole purpose of being funny, no strings attached. It was so refreshing. As was this whole movie. Like a good dream! To me it is proof that when you have fun making it (which it appears impossible that they did not), you have fun watching it. At least I do... I'm gonna watch it tonight and appreciate it's wonderfulness.","user":"muzikla","rank":[99,128]},{"title":"Better than people think","rating":8,"date":"10 March 2018","review":"Anyone who leaves a bad review for this movie is just... what? It's not the best move ever by any means. You may read that's its silly, ridiculous and stupid or whatever else, but this movie isn't meant to be serious. That's the point, it knows that it's ridiculous. It's far better than people make it out to be. I mean, (spoiler) Steve Martin dancing with a trans woman because he runs a suicide hotline, Adam Sandler just showing up with a ukulele, hiding a dead body in a Christmas tree. It's funnt because it's ridiculous, not everything has to be witty humor.","user":"mikalashay","rank":[8,8]},{"title":"A brilliantly silly comedy.","rating":10,"date":"3 September 2005","review":"I can't believe how many people don't like this film! This is a must-see (many times!) each year before Christmas for my son and me. The beginning is a little slow but once the comedy really gets going it's hysterical! And in my opinion, the acting was priceless and each actor's comic timing brilliant. It would be very difficult for me to pick a favorite performance in this film, but if I had to, I would say Madeline Kahn as Mrs. Munchnick. Her facial expressions are adorable and I would say that her best scene was when she finally made it to the bathroom (won't give too much away!). Rita Wilson also gave a top-notch performance as the pathetically adorably Kathryn. Oh, and the soundtrack is great, too!","user":"christine_dld","rank":[38,48]}]