[{"title":"A truly rewarding movie for the patient viewer.","rating":9,"date":"24 November 2000","review":"Low-key thriller/drama about an ex-con seeking revenge on the man that caused his daughters death. That's the surface of this very interesting and fascinating movie from director Soederbergh. There's more than meets the eye, and the patient viewer will be highly rewarded.<br><br>This is, in my point of view, a film about all our efforts to review our own lives - i.e. trying to make memories of our past fit in with the reality of today. To try to understand all sides of an event between two people; how actions we take, and decisions we make, makes a difference in the long run in our lives.<br><br>Wonderfully directed and edited, this movie is really alive, and shines with various tricks and treats of pure movie magic. The score is perfect, and the acting is great (Stamp in the lead is amazing). The way the film makers intertwine dialogue and voice over is fascinating, and reminds me of the films by French movie makers in the sixties (the French \"New Wave\").<br><br>Obviously not in everyone's taste since this movie is quite demanding in attention and pace, this is still one of the best films ever from director Soederbergh. Rating: 9/10.","user":"perper","rank":[83,93]},{"title":"Russian Montage gets an upgrade","rating":10,"date":"29 April 2002","review":"I always thought the Russian Montage Theory was too outdated for modern cinema, but Steven Soderbergh had other ideas. The Limey had one of the more interesting editing styles I have ever seen, which is why it probably threw so many people in a loop. Its too bad we will never see another film like this from Soderbergh, considering he's probably going to keep making films like Oceans 11. Terence Stamp was especially good in this film, and Luis Guzman provided one of the best screen roles by a Mexican-American. What I especially enjoyed about this movie wasn't just the unique editing style, it was how it affected the emotional standpoint within the movie. You felt distanced, unsure how to look at this film due to the range of images passing before your eye. One of the more unappreciated films of 1999, especially when one looks at the amazing body of work which came out that year.","user":"Agent10","rank":[62,71]},{"title":"Artistic and simple","rating":8,"date":"21 July 2004","review":"The `revenge story' is a pretty overdone plot device, so when a film comes along that employs this theme and still remains fresh and compelling, it is safe to say that is a truly good film.  Steven Soderbergh's `The Limey' is able to do just that.  In `The Limey', Terrence Stamp plays Wilson, a career criminal who, upon being released from prison in England, finds out that his estranged daughter has died (or perhaps been murdered) in Los Angeles. Wilson's mission is to find out what happened to her, and prescribe his own brand of justice on the man behind her death.  <br><br>Soderbergh's direction in `The Limey' is superb.  While I enjoy and admire most of his filmography, I was so enamored with his second film, the barely-seen, highly acclaimed `Kafka' for its originality, its daring style and intellectual feel, that films like `Oceans Eleven' and `Erin Brockovich', while quite good, didn't reflect what I felt was to be his true maverick style.  Seeing `The Limey', made before `Erin Brockovich' and shortly a couple of years after `Kafka', I was happy to see that he kind of held on to that spirit (for lack of a better expression) for one more film before producing more commercial fare.  `The Limey' is told in a very non-linear style, and not even as clearly delineated as say, `Pulp Fiction' was; rather it is flashbacks and real-time events expressed by fluttering scenes and an almost wispy presentation.  Soderbergh also employs scenes from one of Terrence Stamp's films from the 1960's for some flashbacks, a thoroughly brilliant and creative tactic.  <br><br>Terrence Stamp certainly deserves mention for his performance as Wilson. Whether seeing him as General Zod in `Superman II' or as the drag queen Bernadette in `The Adventures of Priscilla Queen of the Desert' he is a true badass.  Watching him chase after Peter Fonda in `The Limey' was like watching a reincarnation of Yul Brunner in `Westworld'; he just never let up.  Anyone who would get in his way were pretty much toast, but it was all so coldly done that it was almost clinical  just by the hard and distant expression on Wilson's face you know that all of these people were incidental and he wouldn't receive any pleasure until he comes face to face with his nemesis; and even then, it's possibly more of a duty than a pleasure.<br><br>Check out this film  you won't regret it.  However, if you're expecting a film with the same kind of commercial tone as say, `Oceans Eleven' you may be in for a surprise, albeit, in this viewer's opinion, a pleasant one.<br><br>--Shelly","user":"FilmOtaku","rank":[74,86]}]