[{"title":"A Three Ring Circus of a Movie- I Loved It!","rating":20,"date":"20 August 1998","review":"Overblown, overdirected, overacted: that's why I always enjoy DePalma's movies.  He made the statement that the camera lies 24 times a second, and SNAKE EYES plays on that theme.<br><br>De Palma's camera is constantly in motion, roaming through the arena, casino , and hotel as if it had a life of its own.  At the beginning of the film we watch Nick Santoro (Nicolas Cage) as he swims through the sewer (his words) that is the Atlantic City casino world.  He tells us, \"This isn't a beach town.  It's a sewer.  It's my sewer, I am the king.\"<br><br>It's literally a dark and stormy night.  A hurricane (a tv reporter is pressured to refer to it as a 'tropical depression' on the air) is coming ashore, and 14,000 people are gathered at a casino complex to watch a prizefight.<br><br>There's a shooting during the fight, and Cage orders the exits sealed; who would go outside into a hurricane remains a mystery, but anyhow.  There are two mysterious women involved in the incident, and as time passes he realizes that there were lots of people involved, possibly even his longtime friend Navy Commander Dunne (Gary Sinese) who is as straight-arrow as Cage's character is sleazy.<br><br>By the end of the story Cage is working toward redemption- even though during the early part of the film it's made clear that he sees everything as having a price.<br><br>There's one point where he is offered a million dollars to reveal where one of the women (she knows a lot- too much- about a defense contract, and was talking to the Secretary of Defense when he was shot) is hiding.  And there 's a very real chance that he might give in, or be unable to protect her when the danger gets intense.<br><br>Men in De Palma's films have a way of failing to come through for women in critical situations.  An executive couldn't save his wife in OBSESSION.  A young actor couldn't protect a mysterious, beautiful woman in BODY DOUBLE. The nicest guy in school couldn't keep the outcast/prom queen CARRIE from humiliation and its awful consequences.  In the superb BLOW OUT a movie soundman rescues a young woman from a sinking car early in the story, but is too late to save her from a madman at the film's conclusion.<br><br>So there is no guarantee of a happy ending.  Self doubt weighs heavily in De Palma's films, and often people's best efforts are to no avail.<br><br>Admittedly David Koepp and De Palma's script is something of a problem. There's a complex conspiracy underfoot, and conspiracies are low on my list of compelling things- I got burned out on them in the seventies.<br><br>Far more compelling is the great fun that Cage has with his character.  Boy, does he get to chew scenery here.  Constantly in motion, talking on his cell phone (even during a hurricane; some of my friends can't use theirs when a cloud passes over the sun), interacting with the low life characters around the casino.<br><br>And, oh, does DePalma have fun with the whole thing.  Of course, nothing is what it seems to be.  He retells the action from the viewpoint of this or that character: we sometimes literally see what happened through that character's eyes.  An important setpiece in which we finally see what really happened in clear perspective uses split screen imagery- and in the theatre where we saw SNAKE EYES the use of stereo sound was an integral part of the seperation of images.<br><br>For all the bravado of his performance, I was impressed with Cage's ability and willingness to share the screen with other actors.  In some of the retellings he is a supporting character or featured extra, and as an actor he's more than willing to let our attention shift to someone else.  A lesser actor might have been afraid of that shift of focus.  Way to go, Nicolas.  That's a real sign of maturity as an actor.<br><br>So did I buy into De Palma's bag of tricks?  Yup, 100%.  It's nice to see a movie that isn't afraid of the old razzle-dazzle.  I do appreciate subtlety and complex ideas- that's why I'm a voracious reader.  I really don't think I'd enjoy De Palma directing an adaptation of a Jane Austen novel or REMEMBRANCE OF THINGS PAST.  The Merchant- Ivory people do that sort of thing so nicely.  But it was nice to sit back for an hour and a half and let a master showman use illusion to fool us and let our eyes fool our brains.<br><br>On a five scale, Pops gives it four slot machines.","user":"bababear","rank":[53,64]},{"title":"The Eye That Lies","rating":14,"date":"14 November 2000","review":"This is a wonderful experience. Never mind that the acting is poor and the story weak --that was never the point. This film was made because DePalma knows how to make his camera dance and wanted to make a film based on that notion.<br><br>A central question in most art concerns the role of the viewer. This dominated easel painting, then was the center of evolution of the novel and now sits at the core of thought about film. Is the viewer an omniscient God, or can the viewer be fooled like a person? Is the viewer a passive observer, or does she `walk' with the participants as an invisible character? So many clever questions.<br><br>DePalma thinks the camera is a whole new thing, The camera is a type of character, part narrator, part actor, part god. It can lie, be fooled, search curiously, document, play jokes. So this is a film about the camera's eyes. `Snake' both because the camera can snake around following Cage, going places that Cage cannot, but also `snake' because the camera sees with forked tongue.<br><br>So we have one seemingly continuous shot of the key scene, which is played first from Cage's perspective, then the fighter's, the Navy guy, the Girl, then the cop again, and finally the `flying eye.' Along the way, every eye trick DePalma can think of is woven in:<br><br>--The girl's glasses are crushed so she sees less than the audience<br><br>--The whole mess is about what a satellite sees<br><br>--The casino has 1000 cameras which our own eyes coopt<br><br>--The thing is framed by the TV eye<br><br>--God-like, we scan over several hotel rooms while Cage and Sinese are stuck in the hallway maze<br><br>--Splitscreen simultaneity<br><br>--The whole thing is in real time, as if you were living in the action<br><br>This is masterfully intellectual. See it. Forget the story.","user":"tedg","rank":[91,124]},{"title":"Careening through space","rating":16,"date":"16 August 2008","review":"Police detective Rick Santoro (Nick Cage) attends a championship boxing match. Also attending is Navy Commander Kevin Dunne (Gary Sinise), Rick's best friend. During the boxing match a bullet hits and kills US Secretary of Defense Charles Kirkland. What follows is a real-time mystery in which Santoro and Dunne seal off the boxing arena and work together to find the assassins. As the film progresses, Santoro gradually comes to realise that there's a conspiracy behind the assassination and that Dunne is involved. Santoro, an unscrupulous cop with a history of taking bribes, is thus faced with a choice: accept a million dollar payoff to keep his mouth shut, or arrest his buddy.<br><br>Stanley Kubrick once observed that \"most films don't have any purpose other than to mechanically figure out what people want and to construct some artificial form of entertainment for them.\" People seek the familiar. Whether it be a familiar genre, actors, or a specific kind of emotional gratification, films have become delivery systems for the feelings that we crave. <br><br>But director Brian De Palma is a bit of an anomaly. Like most of his thrillers, \"Snake Eyes\" has its fangs firmly in the past - in this case the conspiracy thrillers of Hitchcock, and Orson Welles' \"Touch of Evil\" - and yet annoys those looking for familiarity precisely because De Palma is relentless in bending the film toward his own private concerns. And so, typical of De Palma, this is a film in love with penetrating space, with shifting points of view, with explorations of memory, vision and the corruption (match fixing, blackmail, assassination, political spin) festering beneath all glitz. The script, written by David Koepp, itself serves only as a framework for De Palma to indulge in his fetish-like obsession with seeing, subjectivity and the fallibility of images.<br><br>Unsurprisingly, \"Eyes\" begins with a shot of a globe shaped statue. It's a nod to \"Touch of Evil's\" introductory Universal International logo, another trashy B movie in which a seedy tale of moral responsibility intersects with much camera wizardry. De Palma's camera then picks up a fumbling news reporter, her off screen director and a bank of television monitors, one of which shows Santoro jokingly addressing a camera. What then follows is a 13 minute single take in which De Palma gives us a tour of a boxing arena, familiarises us with its layout, and introduces us to the film's key players.<br><br>The film spells out its concerns with this very first shot. The reporter's monologue serves as a precursor to the elaborate long-take that follows. One slip and everything must be restarted/re-staged for the eye. The film is a technical exercise, a juggling match, framed (begining and end) by the TV image. The globe and the thunder storm will themselves appear later during the film's finale and Cage himself is introduced as a vessel designed to command the lens. He's a loudmouth centre of attention who, quite literally, learns to pay attention to things outside himself.<br><br>Much of the rest of the movie revisits this 13 minutes single-take from the perspective of different characters and cameras, none of whose optics can be trusted. Like most De Palma films, \"Eyes\" is thus primarily concerned with the dishonesty of the image. His camera is a snake, constantly prowling, searching, scheming and lying. One sequence, which recalls Jack Terry's patient rewind-and-play in \"Blow Out\", has Santoro watching a boxing KO from varying angles, as he tries to come to some measure of truth. Like Antonioni's \"Blow Up\", the film overwhelms us with its sheer number of lenses, points of views and visual trickery. A person can lie. A camera can lie. But a hundred cameras will add up to the truth more surely than a hundred fallible eyewitness accounts.<br><br>The first 70 minutes of \"Snake Eyes\" are crammed with bravura set pieces and exhilarating camera work. The real star here is De Palma, whose camera prowls the arena with relish, dipping, ducking and whizzing back and forth. Cage, his character torn from the pages of pulp magazines, does his best to match De Palma's bravado. His performance is hilarious; seedy but with heart.<br><br>During the film's final ten minutes, however, the film loses steam. There's no climax. But this ending was never intended. Like Orson Welles, much of De Palma's filmography has been tampered. \"Obsession\" had it's paedophillic sub-story removed by composer Bernard Herrmann, a prudish Tom Cruise had all the romance and sex scenes cut out of \"Mission Impossible\", \"Black Dahlia\" lost over 50 minutes of footage, \"Mission to Mars\" was subject to budget cuts which resulted in an abrupt last act and \"Bonfire\" was so rife with confusion that a book was written (The Devil's Candy) detailing De Palma's troubles with studios. \"Get To Know Your Rabbit\" and \"Redacted\" would face similar problems.<br><br>The original ending of \"Eyes\" tied into the first shot, and included a massive action/CGI sequence involving the previously seen globe and a hurricane. This sequence was similar in tone to the end of \"Femme Fatale\", in which noir fate comes crashing down. But the studio's balked at the numbers and a cheaper ending was quickly tacked on. <br><br>Still, the current ending is interesting in the way it pushes hard and fast past a typical happy ending. Rather than being redeemed, Santoro becomes a hero, only to be promptly brought up on corruption charges. In De Palma's world, past sins are never forgotten.<br><br>8.9/10 - Spielberg and Fincher would later hire screenwriter David Koepp for \"War of the Worlds\" and \"Panic Room\", two films likewise preoccupied with cameras and space. Alfonso Cuaron would cite \"Eyes\" as an influence on \"Children of Men\" and De Palma's overhead \"God's eye\" tracking shot would be borrowed by Spielberg in \"Minority Report\". \"Eyes\" made the top of many lists in France, but is treated with scorn every where else. <br><br>Worth multiple viewings.","user":"tieman64","rank":[20,26]}]