[{"title":"\"Kiddy\" and \"Kid Appropriate\" are two very different things.","rating":8,"date":"5 June 2006","review":"In reference to my review's my tag line, this is by no means a movie for \"kids only\". Looking back at Little Nemo as an adult, I'm surprised at how well it still holds up in my eyes. The writer's did a good job in making Little Nemo suitable for younger viewers, but without dumbing down the plot, dialogue, or artistic creativity of the film. There's no reason why a kids film can't be smart and original, and it really irks me when writers use a young target audience as an excuse to give us a second rate script.<br><br>Little Nemo is certainly unique if nothing else. The story follows a young, imaginative boy named Nemo as he travels through the mystical Slumberland. Nemo meets and befriends numerous people throughout Slumberland eventually earning the high esteem of the land's royal family. Unfortunately things go horribly wrong after Nemo's curiosity inadvertently leads him to unleash a virtual Pandora's Box, which threatens to destroy the kingdom. Can Nemo redeem himself and save his new friends?<br><br>The lead characters are very well developed, thanks in no small part to the great voice actors. They convey a genuine and convincing level of human emotion. Little Nemo has a very surreal atmosphere to it, which work perfectly at conveying the dreamy atmosphere of Slumberland. There are also some surprisingly dark and moody moments. Don't get me wrong, this isn't scary by any means, far from it, but the colors are very effective in conveying the tense emotion and gloomy atmosphere of these scenes. Likewise the more upbeat moments are also very well executed, with a bright vibrant array of reds, blues, yellows, etc. Really top-notch animation, that still holds up very well even by today's standards.<br><br>I would definitely recommend Little Nemo if you're looking for a quality children's film, that parents will likely enjoy as well.","user":"ca_dale","rank":[14,14]},{"title":"Visually fantastic!","rating":8,"date":"6 October 2000","review":"Ever rent a movie out of curiosity because, although you've never heard a good thing about it, you want to see it anyway because you thought it looked good?  That happened to me with \"Little Nemo\"; I rented it one summer and felt as if I had struck gold.<br><br>The thing that got me with this movie was that the animators managed to imitate the original Windsor McCay illustrations so closely.  Being an illustrator myself, that completely won me over and that alone would be cause to recommend it.  But this is also one of the most visually inventive animated films I've ever seen.  I will not spoil the surprise by describing anything, but the way this movie depicts Slumberland is surely the best thing about it.  This is definately worth hunting down.","user":"La Gremlin","rank":[21,22]},{"title":"It's nice to relive your childhood every now and then","rating":7,"date":"9 January 2005","review":"My sister and I used to go to this daycare where we watched a movie a day. We watched a lot of movies more than once and this was one of them, because everyone loved it so much. About a month ago, I remembered so little about the movie that I thought I had dreamed about it (kinda ironic, don't you think?). Then I looked it up on IMDb and realized it was a real movie. I got it for my sister for Christmas and having just watched it, I'm glad I did.<br><br>Nemo is a fun-loving boy who dreams that he goes to Slumberland, a magical kingdom that contains everything any kid would ever love. This place becomes a sort of reality for Nemo and he is entrusted as King Morpheus's heir and given a key to every door in the kingdom- however, he is asked to not open the door that has the key's symbol on it. Of course, he ends up opening it (with a little encouragement from a troublemaker named Flip) and the Nightmare King ends up kidnapping the king.<br><br>The movie is not an intricate masterpiece storywise, but the plot and characters are so much fun it really doesn't matter! The real joy here is the animated backgrounds and effects- this movie is a visual stunner.","user":"abum190","rank":[12,12]}]