[{"title":"Beautifully crafted and compelling story","rating":10,"date":"4 July 2000","review":"This is a magnificent adaptation of David Guterson's acclaimed book.  Scott Hicks took on a gargantuan task in attempting to make the book into a film, not only because it was so powerful and well received, but because it was so lengthy and daedal.  The result, however, was one of the best films I have seen in quite some time.<br><br>There were really three stories intricately interwoven into one.  The main story was the trial of a Japanese American for the murder of a fisherman who owned the land wrongfully taken from the accused's father.  The other two stories provide insight into critical events affecting the trial.  The first involves the childhood love affair of local newspaperman Ishmael (Ethan Hawke) and Hatsue (Youki Kudoh), who is now the wife of the accused.  He has uncovered information that can aid the defense, but his resentment for having been jilted by Hatsue stands in the way of his bringing it forth.<br><br>The second ancillary story is the persecution of Japanese Americans and Japanese immigrants during World War II.  We see depictions of hatred and bigotry, as law abiding Japanese citizens are shamelessly herded into internment camps.  This seething animus serves as the psychological backdrop for the trial, which occurs in the early 1950's when the memories of the war and lost loved ones is still fresh.<br><br>From a directorial and cinematography perspective, this film was nothing short of a masterpiece.  It is a cinematic work of art.  Between Hicks' brilliant camera perspectives and Robert Richardson's beautiful lighting and earth tone coloring, the film was resplendent in powerful and stirring images.  Many were so artistically done that if made into snapshots they could easily hang in any art gallery.  Each shot was meticulously thought out.  Many involved complex shots through windows, silhouette backlighting, elaborate blocking, and scenes where actors, props and camera were all moving in different directions to create fabulously fluid perspective shots that slowly unfolded to revealed the scene's full content.<br><br>The editing was also fantastic.  I have seen comparison's between this editing and The Limey'.  While there is some similarity in technique, this was far more elegant and flowing, whereas `The Limey' was jumpy and disconnected.  This style of editing was absolutely necessary to adhere to the book's non linear format.  Hicks needed to insert scenes that explained the feelings and motivations of the characters, and the only way to do this was with flashbacks and jump cuts.  Despite the fact that such editing is disconcerting to a large majority of viewers, it was an artistic decision that was exactly right for the story, and seamlessly done.  The same is true of the audio overlays with monologues of characters superimposed on one another, giving great power and emphasis to certain of the characters' lines.<br><br>The story itself, with all of its components, was engaging and well crafted. Unfortunately, there was not enough time to develop more of the characters. The scenes depicting the herding of the Japanese out of their homes for relocation were chilling.  The courtroom scenes were realistic, not forsaking court procedure for dramatic effect, as is so common nowadays. The love scenes were sensitive, romantic and passionate without the need for sexual explicitness.<br><br>From an acting perspective, this was more of an ensemble production.  All the actors gave wonderful performances, especially Youki Kudoh, who was torn between her love for Ishmael and her loyalty to her family and traditions. Kudoh was so emotionally involved with the part that she actually began crying during the featurette when recalling one of the scenes.  Screen legend Max von Sydow was also fantastic as the aging defense attorney fighting and pleading for justice amidst the racial hatred.<br><br>This is a beautifully crafted film with a compelling story.  It is a filmmaking 10/10.  It has unfortunately not found a wide audience since its strongest elements are not areas of mass appeal.  For the refined viewer who can appreciate filmmaking as an art, and enjoy an intriguing but deliberate story with exquisitely woven subtleties, this film is a delight.  For those who prefer Hollywood's movie success formula of fast paced linear stories with lots of violence, profanity, clever one liners and raunchy sex, this film will bore them to death.","user":"FlickJunkie-2","rank":[56,61]},{"title":"Almost perfect","rating":9,"date":"23 January 2000","review":"Adapting this novel with its tricky, time-shifting narrative was always going to be a big task, but Scott Hicks' sumptuous and elegant film very nearly pulls it off.  Hicks and co-writer Ron Bass move quickly into the courtroom and wisely use the trial to drive the plot, telling the backstory - the real story in this case - through a finely-woven complex of flashbacks.  The difficulty is that this story is a rich, long and emotional tale which requires a fair degree of exposition for it to be satisfying. The screenplay is superbly economical in this regard, but there is no escaping the fact that the only way to cover so much ground in a film of tolerable length is to fly over it at 30,000 feet.  The necessarily distant treatment this requires occasionally dilutes the emotional force which would have come from a more thorough and leisurely telling.  Hicks strives valiantly to compensate with a powerfully emotive score - this works, but it doesn't always hit the mark.  Rather than engendering emotion, James Newton Howard's musical is often so insistently overpowering that it locks the audience out.  On occasions I felt strangely alienated by a wall of sound when I knew I should have been in tears.  But that's a minor flaw in an otherwise excellent production.  Overall, this is an intelligent and considered adaptation - probably the best that could be made from a novel which would have been incredibly difficult to bring to the screen.  It's solidly acted, immaculately lit, and offers some of the most achingly beautiful imagery to illuminate the screen in years (the opening shots are magnificent).  Most rewarding of all is the fact that Scott Hicks takes some real stylistic risks with this film.  They don't always pay off, but when they do it's magical.","user":"Steven Reynolds","rank":[33,37]},{"title":"Love in the Cold","rating":9,"date":"27 May 2000","review":"Snow Falling on Cedars<br><br>Nominated for best cinematography, this film deserved to give American Beauty a better run for its money. Sadly savaged by many critics, who seemed to fail to grasp the depth of the story and the beauty with which it was told because they were too busy analyzing the parts. Snow Falling on Cedars follows a mixed race love that is complicated by the onset of war. The reactions of the two principle characters betrays not only how human love can transcend itself into something greater but how those involved can find fulfillment in themselves through its sacrifice. The exquisite symbolism (you could write a book on the different things snow could symbolize after watching this) is never overplayed - in other words, the viewer can enjoy the film as entertainment without having \"deeper meanings\" rammed down their throat - but they are there in abundance, from the way the scenery is developed to small details such as the main character's name (\"Ishmael\" - meaning \"He whom God hears\").","user":"Chris_Docker","rank":[29,33]}]