[{"title":"Dark, gritty and some very nice images","rating":8,"date":"28 March 2005","review":"\"U Turn\" seems to be a movie that not many people have enjoyed and I really wonder why that is. I'm not saying that it was the best movie ever, but it sure deserves better than what most people over here say about it.<br><br>The story starts with Bobby Cooper (Sean Penn), driving somewhere in the middle of the desert in Arizona, on his way to pay the bookies that have already taken two of his fingers because he was too late to pay them. His car breaks down and the only option that he has is to leave the main road and to go to a small, dusty town called Superior. In this town live all kind of weird people. A blind Indian who doesn't do much else but drinking Dr. Pepper on a bench, next to his dead dog; a dumb garage owner; a young macho, called T.N.T, who seems to come straight from the fifties and his nymphomaniac girlfriend... Bobby Cooper wants to get out of there as quickly as possible. But he has one problem. He's got no money because he was robbed and the mechanic charges him an enormous price for the repairs. He can't do anything else but to stay in the village, to try to live with these weird people and to stay out of the hands of the bookies until he has found some money...<br><br>I must say that I was quite surprised by this movie. The way everything was shot is really well done and the music (composed and selected by Ennio Morricone) gives it all an extra touch. Even all the acting was very convincing. With people like Sean Penn, Billy Bob Thornton, Joaquin Phoenix and Nick Nolte I don't expect anything less than a good performance. But it has to be said: Jennifer Lopez, who certainly isn't a great actress, was actually pretty good in this movie.<br><br>All in all this is a very good movie, plenty of dark humor, good acting and some very nice shots. Personally I think this is one of Oliver Stone's finer movies and that's why I give it a 7.5/10.","user":"philip_vanderveken","rank":[71,81]},{"title":"A grim but comic confection.","rating":9,"date":"9 August 1999","review":"In \"U-Turn,\" Oliver Stone narrows his focus from the broad-canvass projects he typically produces.  Those seeking the knowing profundities of \"JFK\" or \"Nixon\" will be disappointed. This is a genre picture of the desert southwestern potboiler variety, a much-updated \"Painted Desert\" kind of film. Lots of bad luck, scorpions, whiskey, sexual perversity, bullying, greed, lots of sweat and very little shaving.  The basic questions begged by a movie like this one are these:  Who will have sex?  Who will live?  Who will die?  And who will end up with the money?  By the final reel, all these questions are very satisfactorily answered.  For a picture of this type, \"U-Turn\" is very good indeed.<br><br>Sean Penn is smashing, Nolte has never been creepier, and Jennifer Lopez is, er, extremely effective in this film's only real female role.  John Voight, buried in the role a mystic Indian, is most entertaining.  And we get another patented oddball performance by Billy Bob Thornton that is absolutely worth the price of admission.  For good measure, Juaquin Phoenix and Claire Danes deliver a too-brief but electrifying turn as a young couple adept at creating trouble.  As if Sean Penn, in this picture, didn't have enough already.<br><br>Sure, the predictable desert atmospherics are a bit overdone. But the solid script by John Ridley, the letter-perfect performances, and Stone's sure directorial hand make this one of his better films.<br><br>This movie is out of the theatres, so one word to you parents about \"U-Turn.\"  This is not one to watch in the presence of the kiddies. It contains very graphic and violence and sexual material clearly unsuitable for young folk or the sensitive soul of any age.<br><br>But if you like your film noir with sand and scorpions thrown in for good measure, this is a sure-fire rental that will leave you fully satisfied.","user":"planzing","rank":[59,68]},{"title":"Black humour of a kind rarely seen in mainstream Hollywood","rating":8,"date":"11 April 2007","review":"As usual before adding my two ha'porth-worth of comment, I looked at other comments (including Roger Ebert). And, although I didn't read all of them (there are very many), I was surprised that none I read seemed to pick up what was perfectly obvious to me: this is a very funny film, but done in a deadpan style. So deadpan, in fact, that I'm not surprised that might be news to many. I have, coincidentally, recently been buying up on DVD quite a few classic film noir (Build My Gallows High, The Strange Love Of Martha Ivers) and like everyone else thought that the era of film noir had come and gone and that such films were no longer being produced. Well, blow me if I'm not very wrong: this is quintessential film noir (though done in colour and with the proviso that most film noir is not intended to be funny). It would be pointless to recount the plot, but if you liked all those classic Mitchum/Bogart/Van Helin/Edwrad g Robinson etc films, you will love this. Sean Penn never disappoints. By the way the very final twist in the plot had me laughing out loud. Go for it: you won't be disappointed.","user":"pfgpowell-1","rank":[36,41]}]