[{"title":"\"Every man dies, not every man really lives.\"","rating":10,"date":"24 February 2020","review":"The Academy Award winning war epic Braveheart is an extraordinary film that set a new bar for the genre. The story follows a Scottish peasant named William Wallace who's pushed into leading a rebellion against the tyranny of English rule when his wife is murdered. Starring Mel Gibson, Patrick McGoohan, Sophie Marceau, and Brendan Gleeson, the film has a strong cast that delivers outstanding performances. Additionally, the battle sequences are remarkably gritty and violent, which adds to the authentic tone of the film. And, composer James Horner provides a sweeping and majestic score that's incredibly powerful. A groundbreaking film, Braveheart does an exceptional job at depicting both the valor and the horror of war.","user":"MR_Heraclius","rank":[47,50]},{"title":"Mel Gibson Fights for Freedom in Braveheart, A Full-Throated Epic of Overwhelming Emotion and Intense Beauty","rating":10,"date":"11 May 2017","review":"Braveheart is a rousing adventure, a passionate romance, and a soul-stirring drama. In short, Mel Gibson's 1995 classic is everything a great Hollywood epic should be. Gibson's second feature film as a director was a revelation. Who knew that Mel Gibson, an established action superstar and leading man, would be capable of helming a grand Medieval epic with the artistry of Braveheart? The story of William Wallace's legendary fight against English tyranny in Medieval Scotland works as a strong action spectacle, but more than that, Braveheart is a heart-rending, almost spiritual experience, a rare film of bellowing passion that earns every towering emotion it conjures.<br><br>Braveheart tackles the ambitious task of retelling the legend of William Wallace (Mel Gibson), a Scottish warrior who led a revolt against the English occupants of Scotland in the early part of the 14th Century. After his secret love (Catherine McCormack) is killed by English noblemen occupying the Scot's village, Wallace begins a rebellion that eventually leads all the way to King Longshanks (Partrick McGoohan) of England. The story is not a historical retelling of the real William Wallace, but an account of the mythic figure of William Wallace, the larger-than-life Scottish hero. Mel Gibson is at his charismatic best as Wallace. His presence on screen conveys every bit of the folk legend that Wallace has become. It might not be an accurate portrait of a real historical figure, but it is an exquisite visualization of a fabled warrior. The movie is, after all, based on the epic poem written by Blind Harry in the 15th Century. The choice to treat the story romantically rather than realistically is treated as a negative by some, but it is actually a brilliant decision by Gibson and screenwriter Randall Wallace. The romantic approach opens the film up to more emotion, more drama, and more action than a straightforward docu-drama would. Braveheart relishes in the romance of a time and place. The story is massive in scope, and it plays to all those time-tested notes of classic Hollywood adventures. Braveheart is a sentimentalized version of William Wallace, no doubt, but it is also surprisingly authentic. From the muddy village huts and crude stone castles to the close-quarter violence of the battle scenes, Braveheart is a legitimately unvarnished look into the cold, cruel world of Medieval Scotland. This marriage of idealism and realism strikes at the heart of what makes Braveheart so special. It works just as well as a tear-jerker and an action adventure.<br><br>One of the standouts in Braveheart are the battle scenes, which Mel Gibson stages with tremendous scale and violence. The action is appropriately chaotic, but the way Gibson and editor Steven Rosenblum cut between the indecipherable mayhem and punctuative killshots gives the battles orientation. The violence is effective. Every brutal blow is wince-inducingly severe. This is not typical Hollywood sword and sandals action, this is real, visceral action, and it carries a purpose. Braveheart brilliantly captures the strategy, as well as the barbarism inherent in Medieval warfare.<br><br>Braveheart is a fantastic action epic, but it outclasses those trappings. There have been many historical epics that have come and gone before and after Braveheart, but precious few of them can compete with this film's craftsmanship. What Gibson has achieved here is almost miraculous. He takes what might be groaning clichés in the hands of a lesser director, and injects them with a poignancy that they frankly do not deserve. We get the obligatory love stories, the death scenes, the speeches, the evil kings and the treacherous allies. It's all been done before, but never with such unbridled passion behind the camera. The characters are archetypes, but they show what influence a great director and great actors can have on a character. The supporting cast is so filled with personality, you just cannot help but root for what could have easily become two-dimensional placeholders. James Cosmo's Campbell, Brenden Gleeson's Hamish, and Sophie Marceau's compassionate Princess Isabelle are excellent, and Angus MacFadyen as Robert the Bruce does Oscar-worthy work as a man who's loyalty balances precariously between the English and the Scottish sides of the conflict. <br><br>James Horner's music may be the under-appreciated key to Braveheart's success. The mournful bagpipes and spirited Scottish melodies of Horner's score are downright essential for the film's emotional climaxes, of which there are many. When those climaxes hit, they hit hard, and that is thanks in large part to the music. Horner's score carries the same earnest spirit of the rest of the production. The music of Braveheart is precisely as big and bold as the story demands.<br><br>Braveheart is a masculine story, a simple-minded tale of heroes and villains executed with brute force. Of course it is an exciting action movie, we might have expected that from the star of Mad Max and Lethal Weapon, but the real discovery in Braveheart is its beauty. For all its violence and primitive mayhem, Braveheart never lets go of its absolutely rousing grandeur. It doesn't just allow you to look on it with appreciation, it demands it. Braveheart is cathartic in the way it overpowers you with emotion. There are shots in this film that nearly brought me to tears by their sheer beauty alone. When the story, the characters, the images (filmed by cinematographer John Toll), and the music crescendo, it hits like a wave of overwhelming gratitude. The admirable thing about Braveheart is how Gibson and company stick to their guns. They don't conceal the drama or play it subtly. Gibson allows the tragedies, the treachery, and the triumphs of the William Wallace legend to be extravagant. The story is sprawling, the romances are passionate, and the emotions are let out with uninhibited fury. Braveheart is a man's movie, a brutal action epic that will satisfy any red-blooded man's desire for violence and carnage. The remarkable thing is that Braveheart is also a movie that moved me like few have before. <br><br>95/100","user":"jaredpahl","rank":[96,121]},{"title":"It's a Masterpiece. Best Movie of All Time","rating":10,"date":"4 August 2019","review":"Braveheart is the best movie ever made in history, an absolute sculpted work of art that depicts every emotion of human existence, from suffering, to courage to love, in front of the background of political astuteness and socio-hierarchal analysis.<br><br>Telling the quasi-true story of one man's conviction and courage to exact vengeance for the killing of his first wife and father at the hands of the ruthless King Edward the II of England, who in turn inspires his small province of Scotland to rebel and go to war in a real fight for freedom and independence, Braveheart is a stunning depiction of the capacity of the human spirit to overcome the odds, defy tyranny, and achieve justice, respect, and dignity against oppression.<br><br>Although its retractors and critics will dwell and harp on the historical accuracy of some of the movie, particularly what part Robert the Bruce played in real life, there is no denying the true power and emotional influence of this movie. It's understandable, particularly for Europeans, how this could be problematic due to their upbringing in studying history, but the movie is not really about being historically perfect; it's a work of art about things much deeper. A documentary it is not, and it's duplistic and hypocritical for the film's haters to dwell on this minor detail, but perhaps allow historical rewriting to slide and give it a free pass in something like Tarantino's Inglourious Basterds or Once Upon a Time in Hollywood.<br><br>On this topic, one of the dozens of best parts in the movie is when Robert the Bruce plays an important role in one of the battles, and eventually the movie does come around and get Robert's history back on track with more accuracy as to his part and character in the battle for Scotland's independence.<br><br>Without trying to get the history perfect, this movie is simply flawless. It's beyond flawless, really. A flawless movie can just be a technical masterpiece with very little power, but the raw power and emotion coming off the screen in practically every single scene in Braveheart is like an inferno.<br><br>James Horner's score is one of the greatest scores ever for any movie, and it successfully enhances the drama and emotion of each scene, without coming across as manipulative. It fits perfectly into every single scene it is used.<br><br>There isn't one acting role that is not well-done. This is one of Gibson's best acting roles, and the guy who plays Edward II gives an outstanding performance.<br><br>This is the greatest epic movie ever created in the history of Hollywood. A few years later, another great modern epic Gladiator came out and drew rightful comparisons to Braveheart, but while Gladiator is a very good movie, it lacks in the emotional depth, power, and ultimate inspiration behind the experience of watching Braveheart.<br><br>The final Act of Braveheart is one of the most powerful ever put on film. As a first time viewer, you really have no idea where the story is going to go (even as a repeat viewer it still holds weight). To this day, there is still nothing like it. Just when you think it's over or you know how it will end, it just continues to twist and turn, and then it closes with what is probably the best ending of any movie in history.<br><br>In addition to all of this, the body of Braveheart is loaded with outstanding battle scenes, incredible editing, and great dialogue rooted in inspiration, political strategy, philosophy, and stunning human experience of love, desire, passion, suffering, and identity.<br><br>When you look at the top rated movies on IMDB, it is laughable that comic book movies and good popcorn-fun movies are actually rated above this. This is without a doubt, hands down, one of the top 25 movies ever made, and in my opinion, it is the #1 best movie of all-time.<br><br>This movie is a masterpiece.","user":"heisenberg12","rank":[26,30]}]