[{"title":"Come for the fights, stay for the movie","rating":9,"date":"15 February 2006","review":"A remake of Bruce Lee's Fist of Fury, this movie gives us amazing martial arts sequences, with good plot and acting in between.<br><br>The fights are spectacular. A lot of martial arts movies incorporate wonderful movements and acrobatics, designed to show off the skill and grace of the fighter. However in a life or death struggle, these sometimes seem out of place. This is a \"realistic\" martial arts movie. You almost feel yourself cringing with each hit. As the man said: \"These lads are out to hurt each other.\" This is fighting in its purest, taking cue from Bruce Lee's personal style, where the aim is to defeat your opponent in the most efficient manner possible. The opening fight of the movie sets its style right away and continues to its climax.<br><br>But what made this movie go above and beyond a martial arts flick is the storyline and plot. This movie deals with themes of racism, tolerance and acceptance not only between the Chinese and Japanese, but within each group as well. Here Jet Li shines in his performance. While events cause him to lose his composure and give in to his feelings, at the core you see that he is a righteous person. When he realizes the correct course of action, either by himself, or when it is pointed out by others, he does what is right. And we see the people around him learn from his behavior and they seek to emulate it. <br><br>The movie also tries to present a rather fair view of both the Chinese and Japanese. Neither side is portrayed as good or evil, rather as normal human beings, running the whole spectrum from selfish to noble, from hateful to kind. <br><br>As a martial arts movie, this is one of the best ever made, but it stands on its own as a good film, one dealing with a historical subject that has a very strong resonance even today.","user":"gwailo247","rank":[44,45]},{"title":"Must see film for any Martial Arts movie fan.","rating":10,"date":"14 May 1999","review":"Fist of Legend, IMHO, is the best Jet Li movie to date, and among the best martial arts movies ever made.  A darker, more serious film than the bulk of Li's work, it shines in both story and action.  Reminiscent of OOIC in tempo and, to a lesser degree, tone, Fist of Legend surpasses its better known predecessor in intensity and elegance.<br><br>Using minimal wires, the fight scenes are absolutely breathtaking.  What they lack in wire-fu acrobatics and superhuman theatrics, they more than make up for in precision, creativity, believability and plotline relevance. Three of my all time favorite kung fu fight scenes are in this single movie. While still a well told story, there is more than enough kung fu for even the most die hard.  We simply don't get to see Jet Li fight like this anymore.<br><br>Jet Li, as always, is phenomenal, and his opponents are both skilled and artfully characterized.  His serious portrayal of Chen Zhen far surpasses his Jackie Chan-esque comedic roles, yet retains a vulnerability not found in Wong Fei Hung.  While originated by Bruce Lee, Chen Zhen was a role made for Jet Li.<br><br>The plot (as I'm sure you know) is derived from the classic Fists of Fury, but the depth and characterization of this rendition far surpasses the original.  The political and racial turmoil surrounding the characters is more capably written and tastefully portrayed, never subtracting from the action.<br><br>All in all, a top notch effort, and the best blend of storytelling and kung fu I've encountered.","user":"monkey-49","rank":[44,46]},{"title":"Ranks as one of the best Martial Arts movies in existence","rating":10,"date":"25 September 2000","review":"Well, what can I say but this is an AWESOME movie. Jet Li and Yuen Woo Ping team up once more to bring us some of the best fight scenes ever. The movie is more-or-less a remake of Bruce Lee's \"The Chinese Connection.\" Jet Li's master is killed in a match and Jet returns to Shanghai to investigate. He learns that his master was poisoned and finds himself going up against the Japanese. The music was good. The theme of racial tolerance was present. The performances were also good.<br><br>Now, let's talk about what really matters: the fights. Jet Li fights like he's never fought before. The wires are minimal. Many of fights are instant classics, such as him demolishing the Japanese school and his match with Yusuaki Kurata. The final duel with Billy Chow is one of the greatest single fights ever put on film. Li, Chow, Kurata, and Chin Siu Ho all put in excellent fighting performances. Basically, a must see for all fans of martial arts and action.","user":"drngor","rank":[46,51]}]