[{"title":"An overlooked gem of a thriller","rating":7,"date":"2 July 2005","review":"This picture that seems to have escaped the notice of the movie-going public is a stylish, murky thriller that has interesting twists and turns and good performances by Ed Harris and Madeleine Stowe. The premise of the story has been done before in several noir films of the past but Harris brings credibility to his role as a smitten cop. A crack detective who solves crimes with the best of them, Harris is a lonely man who is ripe for the picking by Stowe who is not all as she seems. The sexy brunette ranks right up there with Phyllis Deitrichson and Matty Tyler Walker as the genre's classic femme fatales. The supporting cast is good, among them are Benecio del Toro and Charles Dance in key roles. The music score is soft and sultry, very similar to John Barry's theme in \"Body Heat\".","user":"NewEnglandPat","rank":[49,51]},{"title":"Proof that not all straight to video thrillers are rubbish","rating":4,"date":"4 July 2002","review":"When homicide detective Kyle Brodine starts seeing the wife of businessman Rupert Monro he finds himself falling in love with her.  When her relationship gets violent with her husband he begs her to leave him, however she doesn't but when she accidentally kills him with an illegal gun she turns to him for help.  Unable to go to the police he helps her cover it up. However later the police suspect foul play and Kyle and his partner are put on the case.  As they investigate more evidence begins to point to Kyle and it appears that Rachel has not been totally honest with him.<br><br>Proof that good noir still exists.  This film never saw the inside of an UK cinema  it went straight to video on release.  However the plot is a good tangled web of murder, mystery and deceit.  It manages to be twisty despite the fact that this sort of thing has been done many times before.  The plot unfolds late and very quickly, managing to be believable and gripping.<br><br>The main reason for this is a great performance from Ed Harris.  The feeling of him being sucking into something is written all over his face  and the way he goes from cop in control of all the details into a hunted animal is really good.  Stowe is also really good and the support cast also has quality  whether it be Charles Dance or a young looking Del Toro.<br><br>Overall this may not break box office records but as a thriller it is twisty, contains plenty of good lines and has a great lead performance from Harris.","user":"bob the moo","rank":[35,40]},{"title":"Ah, film noir...","rating":3,"date":"3 May 2002","review":"I've rented a few movies lately that have been alright but have failed to really catch my attention. This, however, was different. First of all, it's film noir, and you gotta love film noir. \"Palmetto\", \"Body Heat\", \"Double Indemnity\", \"The Big Sleep\". A good guy gets screwed by a beautiful temptress. Only, in \"China Moon\" it's different. I won't tell the ending or any details. But this was a very well executed film, very suspenseful. It doesn't follow any cliches and it always has new tricks and twists. Like a lot of film noir, this film features heat, wetness, the night, and cops. A lot of movies attempt film noir but don't always achieve its true spark. This film achieves it.","user":"jadesliver","rank":[26,30]}]