[{"title":"Profound story of companionship and growth","rating":10,"date":"4 June 2004","review":"**(SPOILERS within)**<br><br>I read through all the comments and feel that a significant element of the movie was mostly overlooked -- the relationship that formed between Whale and Boone was not as one-sided as many have chosen to view it. While the movie appears to focus on James Whale's transformation into a human being at peace with his mortality, the more powerful dramatic transformation takes place with Clay Boone's character.<br><br>Clayton Boone inadvertently provided James Whale a means for revisiting and perhaps coming to terms with his past. More importantly, Boone's unexpected pity in the face of Whale's intentionally uncomfortable verbal and physical sexual assaults in effect provided Whale with the strength to end his life on his terms. <br><br>But what did Clayton Boone receive from this relationship? Boone is the son of an alcoholic father, emotionally confused and unable to connect with others (re: Frankenstein). His burgeoning friendship with Whale was a means for him to try yet again to understand and come to terms with his roiled emotions stemming from childhood. Boone failed to please his alcoholic tyrant Father (indeed, a Sisyphean task since children of alcoholics are doomed to fail in meeting the perceived emotional needs of the abusive parent), and thus Whale represents another Father figure for Boone, seemingly as impenetrable and emotionally unavailable as Boone's own father.<br><br>This film is actually more about a young man growing up and coming to terms with himself. However the notion that all Boone needed was to confront his homosexual fears and overcome his rigid concept of manhood is off target. Boone is still trapped in adolescence because he is desperately trying to please his father; this makes the willing commitment to befriend Whale despite his sporadically abusive behavior all the more realistic. And the removing of the towel near the end is a watershed moment in which victim opens up once more to the abuser in a moment of complete vulnerability and trust. That his trust is betrayed (as it must have been so many times before by the alcoholic parent in his life) is heartbreaking, and yet both men recover and acknowledge friendship, platonic love and mutual respect in the aftermath. In the process of reliving his childhood torment through a Father-Son relationship with James Whale it is Clayton Boone who transforms himself and is fulfilled through Whale's friendship and shared wounds from an over demanding father. Whale's suicide at the end was not a reaction to failed lust for Boone -- far from it. His suicide was borne from the strength and clarity he derived from Boone's compassion, allowing Whale to face his mortality and willingly make peace with his past.<br><br>I understand that many feel the ending scene with Boone stomping about in the rain like Frankenstein was unnecessary and over the top. But showing a contented Boone who had obviously progressed from one-dimensional relationships to become a caring father and husband himself was the most important story element in the movie. The James Whale character in the movie may have thought himself a monster, a sexual predator with few redeeming qualities, but before dying he made a connection with another wounded soul, enabling both to heal. Whale's own redemption may have been the A plot of the movie, but Clayton Boone learning to sort out his confusion and pain was the B plot and the exclamation point in the film's final scene. Watching him playfully 'Frankenstein-about' in the rain in recognition and celebration of the relationship that helped him achieve fulfillment was a celebratory moment, and not an unfortunate throw-in to appeal to typical Hollywood standards.","user":"trask77","rank":[72,91]},{"title":"And the Best Actor Oscar in 1998 went to....who???","rating":9,"date":"6 June 2004","review":"Admittedly, I am a sucker for films about Hollywood. From \"Sunset Boulevard\" to \"The Bad and the Beautiful\" and even \"The Carpetbaggers,\" watching a film about movies is always a pleasure, guilty or otherwise. \"Gods and Monsters\" can be added to that short list. The semi-fictionalized story of director James Whale's last days is a melancholy tale of an intelligent, creative mind that is beginning to fail and Whale's desperate fear of that mental failure. He sees in the handsome hulking form of his gardener an individual that reminds him of his most famous film creation, Frankenstein's monster, and he tries to reach out to him and offer the friendship that his film creation was denied. However, his mind is swimming in and out of fantasy, memory, and reality, and his gesture initially confuses the gardener, who sees it only as a sexual advance. In one of the Motion Picture Academy's most bewildering choices, the Best Actor Oscar for 1998 went to an Italian comic who has not been heard from since instead of to the brilliant Ian McKellan in what is arguably his finest film role as James Whale. Lynn Redgrave is funny and touching as his housekeeper, and Brendan Fraser, an adventurous actor who does not shy away from stretching his abilities, has yet to find a better role than that of Clayton Boone, the gardener. Beautifully written and directed by Bill Condon, the film is more than just an homage to old Hollywood. \"Gods and Monsters\" echoes some of the themes of \"Sunset Boulevard\" in its portrayal of a Hollywood veteran, who has been banished and forgotten by the industry and has retreated into a private world of his own making where he still directs the scenes.","user":"dglink","rank":[101,136]},{"title":"Sir Ian McKellen & Lynn Redgrave Were Robbed of Oscars!","rating":10,"date":"24 June 2007","review":"Among the most intriguing characters I've seen is Hanna (Redgrave). I knew she was in the film, there she was in the opening seen &amp; I still kept looking for her! That's how terrific her characterization is of the Hungarian Catholic widowed maid to the flaming gay famed director, James Whale (Sir Ian McKellen).<br><br>Is there 'any' character that Sir McKellen can't play to perfection today? In \"God's &amp; Monster's\", McKellen mastered Whale &amp; gave Fraser an acting lesson ::winking::. <br><br>To watch the two real life friends, Lynn Redgrave &amp; Ian McKellen, play purrfect foils--Hanna praying for her beloved \"Mr. Jimmy's\" 'unspeakable' sinful soul because he's gay was hysterical. McKellen pretending to flirt with Fraser, the epitome of a t-totally straight guy that any gay guy could clock in a heartbeat, was also side-splitting. Hanna believing they were having a romantic relationship was just too much fun as she threw serving trays at them &amp; gave Whale scorned looks as if to kill whenever he'd have Fraser in for lunch or tea. These subtleties made the movie an absolute delight.<br><br>Thus, while heavy drama was going on, there was a comedy line-in-cheek throughout the motion picture. Of course, the plot proves why \"Mr. Jimmy\" was provoking his hunk of a gardener (Fraser) . . . but I'm not telling. That's the best part of the picture.<br><br>Whoever claims this movie is 'gay-bashing' doesn't know the meaning of it. The movie was about the director of \"Frankenstein &amp; Bride of Frankenstein.\" He just so happened to be gay, &amp; thus, part of his life story as a gay man had to be featured in the film. Hanna playing a religious foil was right on time for the moment of the release of the film when the major church denominations are factionalizing over gays being equal in the churches! That's a great film--one that conveys a social struggle in the character of one great actor, Lynn Redgrave. She got the attitude of the church exactly right.<br><br>Doing a queer critique of \"God's &amp; Monsters,\" I rate it a 20 out of 10! This was not the silly, slapstick, \"To Wong Foo,\" bizarre, \"Stonewall,\" that was all out of context from the reality of the characters, or there ever so unreal (but cute), \"Priscilla Queen of the Desert.\" This story is very true to life then &amp; now. It came out right on time, as well.<br><br>Lynn Regrave delivered the performance of her lifetime! In my mind she won the Oscar. McKellen gave another of his stellar characterizations &amp; also won my Oscar. I also feel the picture should have been best picture of the year. Fortunately, many other notable awards were given that the blindered Film Academy was too dense to do itself. Redgrave was most robbed of her Oscar because she was anyone but herself! She wasn't even recognizable as Lynn Redgrave, for heaven's sake. <br><br>So if anything or anyone was gay bashing, it was the Film Academy itself, for overlooking the Oscar winning performances of Redgrave &amp; McKellen &amp; the Best Picture of the Year.<br><br>. . . &amp; I'm still watching it in late August 2007.","user":"goldie_80","rank":[57,74]}]