[{"title":"A tale of two films","rating":10,"date":"10 August 1998","review":"I was a little disappointed when I left this film, but not because of the overall result. I was disappointed because of the wonderful way in which the story was laid out and unfolded itself in the beginning, then seemed to fall away during its 2nd act. The reverse theme of bad kids turning good was fascinating, and the paranoid performance by Nick Stahl was worth watching and intrigued me. But then, as soon as Stahl was converted, the film started to fall apart. For one Stahl was the only character I found to be truly worth watching. Marsden and Holmes were just two pretty faces noticeably void of much talent; I never believed the two as a couple, and I never found any reason to invest myself in hoping for their well-being other the fact they were the lesser of two evils. But most noticeably, I grew disinterested because of the change in aim by the makers. The first half of the film, which by itself I would have given an 8 or 9 out of 10, was more of a grown-up horror movie, where the situation and plot rather than actions dictated the fear of the audience. But after Stahl disappears to the dark side, the film changed into a teen slasher film almost, where blood, violence and screaming is used in a vain attempt to induce fright. This 2nd half was worth a 4 or 5 out of 10. The length did not bother me as much as others (I've seen plenty of effective movies that were under 90 minutes). What bothered me more was the lack of development in some key plot points. I think the entire conspiracy plot behind the conversion of the teens needed to be fleshed out much more, characters needed to be drawn more distinctly, and so on. So I balance out the two halves and come up with a 6 out of 10. Worth renting, but could have been something special.","user":"Keyser-15","rank":[48,52]},{"title":"Disturbing but entertaining","rating":17,"date":"17 May 2005","review":"Steve and his family move from Chicago to Cradle Bay (which based on a road sign is outside Seattle). We later learn his brother Allen died, and that has something to do with the move. At his new high school, he meets Gavin and U. V., who take drugs and listen to depressing heavy metal music. Gavin has the hots for Lorna, but she's a Blue Ribbon, a member of a group of students that help out in the community and help each other study. Gavin wants nothing to do with these people.<br><br>It turns out the Blue Ribbons aren't as goody-goody as they first appear. To call them snobs is an understatement. Anyone who isn't a member is treated like dirt, but of course new members are accepted all the time. The organization had its beginning with a deadly car wreck, and Dr. Edgar Caldicott played a large role in getting it started.<br><br>This film reminds me of an episode of 'Smallville', except only the villains (who appear to be the good kids) have the super powers. Or maybe they're not actually super powers. This film had its own version of Belle Reve, where all the Smallville freaks seemed to end up eventually. Also, there was the loud alternative rock music in some scenes and the pleasant classical-style background music in others. I really liked the music in Roscoe's Yogurt Shoppe and in the asylum (I'm referring to Barry Manilow).<br><br>I actually found the bad kids appealing in this movie--Gavin, Rachel, and Dickie in particular. The real standout character, though, is the demented janitor Mr. Newberry, who comes across as if Gilbert Gottfried had played the Bill Murray role in 'Caddyshack'. Another good though brief performance came from Julie Patzwald as Betty Caldicott.<br><br>This was a little on the violent side, but I guess for the type of movie it wasn't too bad. A lot of bad language seemed to have been cleaned up for TV. And I'm not sure whether this is something that was edited out, but in one scene, the position of a girl's head relative to her date suggests something that happened in Bill Clinton's White House.<br><br>It wasn't a classic by any means, but it wasn't too bad.","user":"vchimpanzee","rank":[21,24]},{"title":"Disturbing Behavior by an Overzealous Editor","rating":6,"date":"21 February 2010","review":"A sci-fi/horror flick aimed at the \"Scream\" crowd, \"Disturbing Behavior\" concerns at idyllic coastal town where everything seems just a bit too peachy. The local high school is populated by picture perfect teens who, despite their wholesome love of yogurt, tend to get a little trigger happy when the hormones start flying. When the new kid in town (Jason Marsden) stumbles upon a dark secret, it's up to him and a few other mistfits (Nick Stahl, Katie Holmes) to shut down the powers that be.<br><br>There's loads of potential in this film that is, unfortunately, never capitalized upon. You can thank the editing department for that one. If the deleted scenes are any evidence, this movie was trimmed and dumbed down to the point of no recognition. While the uninterrupted flow makes for an easy, breezy viewing, the overall story lacks substance and coherence. Its 84 minute running time, in turn, is a redeeming feature.<br><br>The director, David Nutter, spends much of the film building up ample amounts of atmosphere and is aided wonderfully by a brilliant score by fellow \"X-Files\" alumnus Mark Snow as well as some striking scenery thanks to it's Vancouver location. So, the film isn't a complete waste. You'll get some kicks out of the dialog and while Katie Holmes in particular isn't given much to do, she at least looks good in skimpy outfits while doing so. Also, it's hard to hate on a movie that is of a more intelligent cut than the other teen-geared fare being produced in its time. The movie at least aims high, and even when it doesn't quite reach, it never bores.<br><br>A passable sci-fi teen romp, \"Disturbing Behavior\" is entertaining late-night fodder that, surprisingly, will inspire repeat viewings. It's a shame, though, to think of how much better the whole could have been.","user":"Mr_Censored","rank":[13,15]}]