[{"title":"Strangely appealing","rating":8,"date":"22 June 2002","review":"Ever since I saw a documentary on the making of horror movie special effects, I've wanted to see 'Vampires'. I wasn't disappointed. In this era of cheap computer effects it's really refreshing to see a movie where the special effects are done the old fashioned way. For some bizarre reason I really like Vampires. The plot is somewhat clichéd, the acting is nothing special and yet... I find myself watching this movie over and over again. Somehow the idea of a secret military force funded by the church, dedicated to fighting vampires is thrilling even though I'm not a religious man. I suppose it harkens back to the day of witch hunters. James Woods is great as the grim, dedicated man sworn to destroy all vampires and as the true shocker, the generic Baldwin appearing in the movie does a really good job as well! If you like gory movies, check it out!","user":"soralapio","rank":[88,100]},{"title":"An underrated Carpenter movie with bite!","rating":14,"date":"14 April 2007","review":"\"Vampires\" is great popcorn entertainment. While fans will always compare Carpenter's later movies with his early genre classics, \"Vampires\" is excellent entertainment, even if it isn't an \"important\" or \"milestone\" horror event.<br><br>James Woods is not the most likable of heroes here but he's very watchable. Daniel Baldwin delivers a believable performance as his dependable sidekick. \"Twin Peaks\"' Sheryl Lee plays the leggy small-town hooker who is unfortunately bit by a Master Vampire, Valek. There are also appearances from Maximilian Schell and \"Miami Vice\"'s Gregory Sierra.<br><br>In Carpenter's \"Vampires\", the undead don't exit this world peacefully. Instead, they explode like giant Catherine wheels. This is exciting to watch - you can't have enough sparking vampires, can you? With lots of action and a few dark laughs, you could do a lot worse than see this movie.<br><br>With an excellent score, great visuals and a fast pace, \"Vampires\" scores a strong 8 out of 10.","user":"DVD_Connoisseur","rank":[37,42]},{"title":"Much better than its reputation!","rating":10,"date":"4 August 1999","review":"I was puzzled by the low rating \"Vampires\" got, it's my favorite movie of 1998/99. Why do I give the date in that manner? I was (un)fortunate enough to see this movie in the uncut version (as shown in France), in the US version and just a few weeks ago in the German one.<br><br>But first things first -- I am female and I have read so many reviews and comments telling me, that I, as a woman, should feel disgust at the alleged misogynous undertone of \"Vampires\". I am sorry, but in none of the three versions I saw did I feel, hear or see anything which might support this allegation! Crow hated practically everyone except for Montoya and the first priest, Montoya -- while quipping left and right -- behaved quite kindly towards Lee's hooker except where she directly caused him to react violently and none of the other oneliners warrant, IMO, even a raised eyebrow regarding that special topic.<br><br>Let me add that I also am not religious, with my own perceptive view of enough past wrongs done by the Catholic church, so that any of the soi-disant \"hate\" directed at that church is in my opinion well-founded given the plot. Callan's explanation of how he views god, as well as several other references by Crow and Montoya underline the basic belief of the vampire hunters while maintaining their no-nonsense attitude.<br><br>With that back to why I liked the movie so much: it is in its own way as stark and streamlined as the best samples of its genre; the cinematography is just perfect with the right mixture of visual and non-visual storytelling; the dialogue is engagingly humorous throughout, feels real and allows each character his or her own voice; there are several deeply moving scenes, either visually or characterwise moving, which will stay with the audience; there are enough novelties incorporated to make this rendition of the vampire theme fresh and quite frankly, I liked Carpenter's score a lot too.<br><br>What wins me completely over is the very obvious fun all the actors had with their roles. James Woods was perfect as sardonic, illusion-free Crow and his brushing \"campiness\" with the tip of a finger, yet withdrawing just in time, is priceless. Daniel Baldwin makes the most of his character's arc, nicely underplaying his role, while he still manages to convey Montoya's journey by minimal changes of expression or voice. The final scene couldn't have been done any better. Sheryl Lee gives what I consider one of the strongest supports I've seen in quite a few years, whether by male or female actors, especially when you count in the scarcity of means she's handed over. Ian Griffith had several fine moments and the entire supporting cast was refreshing in their non-Hollywoody realistic, natural look and acting. The overall impression was of people enjoying what they're expertly doing.<br><br>An advice to the German audience,  I noted while watching the dubbed release that the translation killed practically every single punch line and nearly all of the humor. And it *could* have been translated properly. The voice actors dubbing for Woods and Baldwin did so without recreating even a tenth of what both actors put into their voices in the original version. I do think that some of the disappointment expressed there is due the extremely low quality of the translation and dubbing. See the movie in its original language. I also can't see any reason for the loss of those scenes which were cut out of the US release when compared to the French one. The movie loses quite some strength this way.","user":"leo-96","rank":[83,104]}]