[{"title":"This is one freaky movie...","rating":26,"date":"26 March 2001","review":"Cube is a movie that explores human nature and our instinctive urges for survival vs our humanitarianism. Not a new concept, I know, however this movie does it in style, with a plot so simple that it could only be the work of a conceptual genius. I don't intend to give too much away, as the power of the film lies in it's mystery, but I will say that this movie could almost be classified as disturbing, not due to its content, but rather the thoughts that it instills in the audience. I found myself rather shaken as I left the cinema, feeling as though I had been exposed to an ugly, hidden side of humanity and society. Don't get me wrong, this movie is definitely worth seeing, I would even be so bold as to say that it must be seen! I must admit that there are few movies I have seen that have had such a profound affect on me, and I don't think I am alone in my feelings.","user":"byrne_c","rank":[317,367]},{"title":"Low Budget, Does not have to equal Low Quality","rating":8,"date":"19 January 2005","review":"It probably cost about half the budget of this movie, to make the opening sequence, which successfully gets your attention. Once it has your attention it simply refuses to let you go, it is compelling to say the least.<br><br>The entire cast were pretty much unknown when the film was made (and most still are), but they all gave fine performances throughout. Without the successful casting this film could have easily been a disaster, as it is almost entirely character driven. I'm glad to say that definitely is not the case.<br><br>Despite the low budget and practically unknown cast, the film manages to be clever, intriguing, thought-provoking and highly enjoyable. sadly, this film is probably a one off, i can't think of another low budget film that has half the impact of this one.<br><br>8/10 and worth every point","user":"mjw2305","rank":[261,311]},{"title":"You ever get stuck in an elevator? Multiply that emotion by 1,000","rating":8,"date":"17 August 1999","review":"Great. Another shining example of how my inadequacy in mathematics could be the end of me. I used to skip math class. I took the bare minimum requirement expected of me and passed with something less than flying colours. The point is, math is all that separates our \"heroes\" from certain death in this arena.<br><br>\"Cube\" is an innovative little thriller that can safely dodge accusations of blandness or mediocrity. The premise is simple and the plight of the characters is highly relative despite its surrealistic science fiction setting. Six individuals find themselves trapped in a cube comprised of many rooms linked together, with no readily visible way out, no rations, tools or explanation for being there, with traps set up in some of the rooms. An apparent experiment on how people think and react to certain situations and the transformations they might undergo.<br><br>The simplicity of the film and the cube itself are the film's strongest assets and can probably account for it's international success, notably in Japan. It's low budget production costs came under $400,000. But they got a really good bang for their buck with some help from special effects houses that provided their services free of charge. As the director has commented on the audio commentary track of the DVD, one aspect they were going for was a way to have an action flick in one room. They pulled it off quite nicely. Another interesting tidbit brought to light was that each character's name is after a prison.<br><br>A curious aspect of this Canadian film was its surprisingly short run in Canadian cinemas. In speaking with one of the film's producers, Mehra Meh, I learned that despite it's award as \"Best First Feature\" at the Toronto Film Festival of 1997, the film run in Canada came a year later and was just for a few short weeks before it was yanked from theaters and then showcased internationally. When time came for the DVD release, I found another perplexing development. It was only available as an import. A Canadian film only available as an import in Canada? It wasn't until months later that it was released domestically.<br><br>In any case, the film is available now and worth checking out if you have interest in the psychological thriller fare. Those who work their days or nights (or both) in a cubicle may wish to pass on this one, as it just might be too close to home.","user":"ToldYaSo","rank":[119,146]}]