[{"title":"Children of the Corn 666 Isaac's Return: Potential squandered","rating":3,"date":"16 June 2018","review":"This astounding sixth addition to the Children of the Corn had potential from the start. The antagonist from the 1984 original was returning and being played by the very same actor, it had so much potential to steer the franchise back on course.<br><br>Alas it wasn't meant to be. Sadly Isaac returns into a mess of a film with a terrible cliched concept, an outstandingly dull pace and a film that contributes nothing to the series at all.<br><br>Credit where credit is due it does have a great twist and the final scene is great, but then immediatly ruins it by having a poor finale to that.<br><br>Starring the excellent Stacy Keach Isaac's Return should have been great but poor writing killed it stone dead.<br><br>The Good:<br><br>Decent twist<br><br>The return of Isaac and same actor is great<br><br>The Bad:<br><br>Very boring<br><br>Disapointing ending<br><br>Things I Learnt From This Movie:<br><br>Calling a sixth movie 666 is tacky when it has nothing to do with the source material<br><br>I thought \"He who walks behind the rows would be taller","user":"Platypuschow","rank":[5,5]},{"title":"A promising title amounting to nothing...","rating":19,"date":"19 October 1999","review":"Killer kids led by a charismatic bible-versed midget (Isaac) claiming to be a prophet of \"he who walks behind the rows\"...thus the series began. Although the first \"Corn\" was not a great film, the premise alone kept it engaging.  Amazingly enough, it has spawned 5 sequels.  The latest involves a daughter of a former cult member of the original \"Corn\" returning to the corn-stalked town of Gaitlin with the hopes of tracking down her mother. What follows is an incoherent mess including the return of Isaac from a 19 year long coma, a \"prophecy\" foretelling a breed of new \"killer kids\" coming from our lead character Hannah and Isaac's firstborn son, and a case of mistaken identity resulting in the definitive answer of the question who is \"he who walks behind the rows?\". You will be disappointed with the answer. Fans of cheap scares, ultra-gore, shoddy but entertaining special effects and other B-movie characteristics will find this movie absent of all the above.  Fans of serious cinema would not have rented this movie due to the title alone (try to tell your significant other that we are going to enjoy CHILDREN OF THE CORN 666: ISAAC'S RETURN tonight).  Consequently, this dull movie has no audience.  B-movie fans DYING to enjoy a COC sequel tonight should look up COC 3: Urban Harvest.  Directed by Anthony Hixox and effects by Screaming Mad George, it is the liveliest entry in a series that should have died before it even began.  I am no longer renting any more COCs unless John Woo wants to take a stab at horror.","user":"steve-545","rank":[11,14]},{"title":"The story about how dumb one human being can get.","rating":1,"date":"18 July 2009","review":"Seriously, the main hero of this movie is a complete MORON. The normal person would turn around and get the hell out, after seeing a priest-ghost, who says that she doesn't have a choice of not bearing a child. But no, chick doesn't get a clue, she doesn't get a clue when she gets almost strangled by a local doctor, gets assaulted by a madman, wakes up a leader of a religious group, who was in a coma for twenty years, simply by touching him, gets chased all over the place by jeep, after someone breaks into her room when she sleeps and leaves a message on the wall \"leave or die\" , she doesn't get a clue after seeing the illusions of dead birds all over the place, and she doesn't get a god damn clue even when she finally finds her dear mother, she was seeking in the first place and then the mother explains, that she is destined to be raped by religious fanatics and bear a child of a cult. She is still pretty much clueless at this point. Here of course she gets finally kidnapped, but is saved by some guy on the motorcycle and how does the nearly-raped victim decides to thank him for that? By having an unprotected sex with him, of course. Fortunately that guy turns out to be a main villain/demon in the first place, who for some reason has nothing better to do than cite lame catchphrases and blow the stuff up by saying \"boom!\" So in the end the dumb chick gets what she deserves - she technically gets raped and now has to bear a devils child, the end. (Aborion probably being out of question, as far, as movie lets as know. Some message here? I don't think so. IMO the writers of this story were even dumber than our main hero).<br><br>In conclusion - go watch COTC 1,2,3 or 4, ignore what everyone says, they are still enjoyable movies at most part, but 5 and 6 - stay away, trust me, you ain't gonna be happy if you won't listen to my advice.","user":"seveleniumus","rank":[7,9]}]