[{"title":"Of course you have to suspend your disbelief...","rating":7,"date":"7 November 2009","review":"In order for a movie to hold our attention by presenting interesting and exciting events that exceed what might happen in our normally more mundane lives, we have to suspend our natural critical view that, 'things wouldn't happen that way in real life...'. 'It's a movie', so we cut it some slack and accept things that on the whole, might be somewhat unlikely.<br><br>Right at the outset White Sands demands a great deal from our reserves of suspended disbelief, and this is because a small hick town sheriff, who turns out to be a very thorough and exacting crime scene detective, responds to the discovery in his jurisdiction, of an apparent suicide victim who has a briefcase containing a huge amount of money, by becoming the sole self-appointed investigator. Then he discovers a lead, and with no backup what-so-ever he decides to take the whole briefcase full of money and set out in a convertible '65 Corvette no less, on a quest to find information about the deceased through pretending to be that person!<br><br>As our good sheriff drives off and away from his beautiful wife, in his oddly chosen very valuable classic convertible sports car, all alone and with half a million bucks in unknown and unsecured evidence in a briefcase on the seat beside him, we know that he has no idea whom he might meet. What will such people think of this money-stuffed briefcase packing shill of the victim whom for all our sheriff knows, might know is in fact dead? We may well be excused for thinking, 'That wouldn't happen that way in real life'. <br><br>Do ya think?<br><br>With a lesser actor in the lead role we might be inclined to see if it isn't too late to get out of our seats and go back to the ticket booth and make a scene about a refund, or to make a phone call and see if the video store is still open, but it's Willem Dafoe and he does pretty darned well with the material.<br><br>If our next thought, seeing this lone man set off on his quest with his unsecured briefcase of money, is something along the lines of, 'This can't be good...' then we are treated to the fulfilment of our forebodings. It does become much better though. If we forgive the movie's presumption to this point then we are treated to a somewhat less demanding remainder. To say any more would be to do a job of telling that the movie actually does much better than I can.<br><br>There are several big names in the cast and they do a commendable job. The plot thickens, the characters develop and the viewer is never required to strain credulity to the degree demanded by that setup scenario. It's a generally satisfactory movie and if not in the league of the giants, you shouldn't regret viewing it.<br><br>Present ratings are rather harsh for this drama but for my part I'd think it warrants a solid 7.","user":"choatelodge","rank":[18,18]},{"title":"Entertaining and suspenseful","rating":7,"date":"27 August 2002","review":"A wonderfully subdued and suspenseful film about a police deputy who takes on the identity of an apparent suicide victim, ostensibly to locate the victim's \"killer.\" Of course, in the process he gets more than he bargained for--or did he? Perhaps he was seeking an exciting and intriguing diversion from boredom all along.<br><br>The story stretches the limits of believability throughout, yet this is easy to forgive and forget in light of magnificent performances by Willem Dafoe, Mickey Rourke and others, which draw you deep enough into the action that you'll soon forget none of this could ever happen. Rourke is the definition of \"cool\" as Gorman Lennox, a sleazy yet charismatic arms dealer. But it is Dafoe who turns in the best performance as an ordinary man who is compelled to put himself into an extraordinarily dangerous situation for reasons even he probably doesn't quite understand. I was thoroughly entertained just watching Dafoe's reaction every time circumstances threatened to blow his cover. All told, Deputy Ray Dolezal (Dafoe) is one of the most genuinely likeable characters I've seen on film.<br><br>With a clever script, plenty of plot twists, outstanding performances and marvelous desert cinematography, White Sands is definitely a film worth watching.","user":"fineanimal","rank":[32,36]},{"title":"Cult movie waiting to happen","rating":8,"date":"13 November 2008","review":"There is absolutely nothing wrong with this movie and it is an excellent rental option when you are undecided on what to get in your favorite movie rental service/place. Very good plot, the dialogs are great and the ending is definitely not predictable. Rourke was in his downhill after a flash rise to fame due to 9 1/2 weeks (if you are an 80s guy like me, you know what I mean), but he still gives a good performance and one of his lines was just the best of the whole movie. Samuel Jackson was solid and Dafoe balanced as always. As a bonus the sexiest performance of Mastrantonio in her career. The movie has ups and downs and does not keep you nailed to your chair, but that is the story telling style of the director and I am cool with it.","user":"cfredk","rank":[14,16]}]