[{"title":"You can't Rate your own childhood.","rating":10,"date":"18 December 2018","review":"When you are living in poor eastern Europe town, you see things in different colours))\nWhen I was kid, two things defined my interest for this Movie:\n<ul><li>Two American Ninjas in one film at the same time! Take 2!</li><li>Ninjas of all colours! Take 5!</li><li>New bad Ninja boss! Take 3! Now it's 10/10</li></ul>It is really sad to see grown aged men giving American Ninja 4 low ratings and trash critics. Wake up, critic, you are no longer a kid. You can't see Magic no more. This movie is part of me. It's bad, who cares. It was.","user":"SaintNinja","rank":[6,6]},{"title":"Good","rating":7,"date":"23 August 2014","review":"In part 4, the two American Ninjas, Joe Armstrong and Sean Davidson, team up to do battle against a terrorist and his band of Ninjas. It is always in people's nature to put down great things and to nitpick or sometimes just be plain mean. No matter what anyone says, this is utterly fantastic, an eye-popping cinematic treat. From an artistic standpoint, there were some plot elements and character developments I didn't think were totally needed. They do however drive the story, which seemed to be their purpose, so I can accept them. I am not saying the film is a classic, but I love it. My rating ends up being 7 out of 10.","user":"manitobaman81","rank":[6,7]},{"title":"Not What I expected But Still Good","rating":8,"date":"11 June 2011","review":"After a quite disappointing third sequel, the fourth one did bring back some grace into the franchise (eventhough it didn't work out as I hoped). Steve James resignation for the fourth sequel (and if I'm not mistaken, this film was made before he passed away) in my opinion was due to the fact that the director decided to bring Dudikoff back after a setback in the third installment<br><br>For me, the most interesting but could have used a little bit of polishing up in the film was the plot itself. A group of soldiers gets captured by an Arab and English terrorist building a bomb. The American government then sends Sean Davidson (David Bradley) to try and handle the situation and when he fails as well, they finally the send in the back the original kickass ninja pro Joe Armstrong (Michael Dudikoff) into the action since it was sort of like when everything else fails, Joe Armstrong doesn't<br><br>This was a pretty interesting sequel and probably the 2nd best of the entire series behind Annilation. To get to this film, I have no real idea why Dudikoff agreed to return back to this fourth installment (maybe he did it just for the sake of the fans of the franchise) but thankfully, he really brought the life back into the series (and for fans like myself) even though he didn't seemed like he was in the mood of acting in this sequel. David's character in this sequel in my opinion was far more respectable than in the third one. He might have done a decent if not good job on the 3rd sequel but in my opinion, his performance here as the 2nd leading actor was way better since he really looks more of a ninja expert in this one compared to the third installment<br><br>However, there were a few minor complaints that I have for the film. First off, I expected Dudikoff and Bradley to team up together and become buddies like almost immediately in the film but sadly this did not happen for until like the final 20 minutes of the film. The final fights from both sides (Dudikoff's and Bradley's) were not really that entertaining either since Bradley only had to fight a chicken whuss and Dudikoff once again made an Arabic ninja (whose even more quite in the film than Michael was throughout the film) look like a kindergarden amateur<br><br>Another complaint that I would like to bring up (although minor) is that I think that it felt like pointless having the scene where Joe was making his weapons (the sword and shurikens) and holding up the sword in front of his face like it was the most important possession that he ever had but in the end, he just fought the enemies with his own bare hands and never used them at all throughout the ending of the film. I think that maybe the director had accidentally forgotten about that part which was why we never got to see Dudikoff using his weapons in the end. <br><br>Another part that I have to complain was that they never really told the story of how Joe (Michael) and Sean (David) became friends in the first place and all in all, I felt like maybe this was more of like shrink and squeeze in as much as possible kind of plot story than the one that they had originally intended to create<br><br>However, these flaws did not ruin the film too much since I felt it really did make up for the rather disappointing third sequel. All in all, I would really recommend this to all American Ninja fans out there and anyone else who just wants to spend three hours of their time watching some mindless but still a rather fun action movie","user":"alucard_castlevania86","rank":[6,8]}]