[{"title":"Great","rating":9,"date":"15 February 2020","review":"I wouldnt change a thing. The acting was beautiful, the scenery, the costumes, the raw emotion. The best version of this tale yet.","user":"MR_Heraclius","rank":[39,40]},{"title":"A review of Baz Luhrumann's Romeo and Juliet","rating":12,"date":"12 November 2003","review":"Shakespeare gets a Hollywood make over in Baz Luhrmann's high-octane remake of Romeo and Juliet.<br><br>The Australian director manages to combine an exciting mix of original Shakespearean dialect and Hollywood action, which together delivers a brilliant new concept to film making.<br><br>The casting of Leonardo Di Caprio as Romeo and Claire Danes as Juliet are inspired choices, as they both give the best performance of their fledgling careers.<br><br>Although this is a story which has been told many times before, Luhrmann keeps the idea fresh, mainly by using a lovely mixture of fast editing and beautifully choreographed fight scenes, which wouldn't look out of place in a John Woo action film. It also combines a fantastic soundtrack with a stunning backdrop of 'Verona Beach'.<br><br>Right from the explosive beginning to the tragic ending, Romeo and Juliet will keep you captivated. This is a testament to Luhrmann's brilliant snappy direction, which will take you on a rollercoaster ride of car chases, gun fights and a love that was destined to fail.<br><br>Luhrmann's ablity to keep the audience wanting more is no more apparent than the ending. You would have to have been living under a rock, for the last 100 years to not know how Romeo and Juliet ends. But Luhrmann manages to keep the audience hoping that this time it will be different.<br><br>Would Will Shakespeare be happy with this adaptation of his work? We'll never know, although any fans of Shakespeare should leave the cinema pleased with this mordernised version.","user":"scaryclowns2001","rank":[113,138]},{"title":"Shakespeare Worthy","rating":10,"date":"17 May 1999","review":"Very underrated modernization of the classic Shakespeare play.  This movie has been pretty heavily criticized for the directors outlandishness in cinematography, but he understands when to tone down the often frantic pace of the storytelling during the dramatic scenes, and in fact this relationship tends to amplify their potency. Beautifully choreographed and shot, wonderfully acted by both the supporting cast and the main 2 stars, Leonardo DiCaprio and Claire Danes, and extremely sly modernization techniques to the dialogue.  All the elizabethan dialogue remains intact, yet it all seems coherent in the modern atmosphere. mostly due to good imagery and double meaning in the phrases (ex: their swords being a gun model, or the flash of money while quoting gold.).  One of the best shakespeare adaptations in the multitude of which have entered the cinemas in the past few years.","user":"Acetylcholine","rank":[178,261]}]