[{"title":"Little moments make 'Singles' one of my favorite movies","rating":9,"date":"27 December 2004","review":"Cameron Crowe is one of those directors that thrive on making the little moments in movies the most memorable ones you'll ever see in your life. In 'Almost Famous,' it was when everyone on the Stillwater tour bus was singing along to \"Tiny Dancer.\" In 'Say Anything...' it was when Lloyd was driving around and proclaimed how his heart was exchanged for Diane's pen. Crowe also creates many memorable little moments in 'Singles,' which may not be the most famous movie he's made but it's one of the best.<br><br>Even though 'Singles' is about twenty-somethings in Seattle, everything rang true to me as I am now, a teenager. The film is honest and real in how couples become couples and how relationships can fall apart. 'Singles' isn't at all mean-spirited or depressing in its portrayal of relationships or the dating game, so it might turn some people off who want to see the extremely ugly confrontations (a la 'Closer'). But the moments in 'Singles' that make it worth watching are when Linda (Kyra Sedgewick) gets to know Steve (Campbell Scott) while going through his record collection in his apartment. Or when Janet (Bridget Fonda) sneezes and gets a \"bless you\" from someone she (and the audience) would least expect.<br><br>Everything about 'Singles' is great. The cast, the music and the truth behind the movie will bring a smile to your face.","user":"femme_fish","rank":[56,62]},{"title":"Not to be confused with other 'gen-x' films","rating":21,"date":"21 July 2003","review":"SINGLES is a charming, romantic movie and one of Cameron Crowe's best. <br><br>\nAn oft-heard criticism of this film is that it's not an authentic portrayal of the Gen-X culture of the early 90's, but I've yet to see that done well in any film.<br><br>More importantly, the film never claims to be a Gen-X film.  It's set in Seattle during the height of Seattle Sound but the cast is made up of driven professionals and slackers alike.  It's more of a cross-section of 20-somethings, not a focus on Gen-X or Grunge.  The characters, settings and themes are all to a certain degree idealized, which is a staple of Crowe's style.  <br><br>Where this film's charm really lies is in capturing the spirit of the early-90's and the anti-classist sentiment embraced by teens and young professionals in opposition to the \"status is everything\" 1980s.  It's nice to remember a time when being socially and environmentally conscious was actually fashionable for a time.  <br><br>Sadly we all got sucked into the dot-com thing and realized we can be just as bad as our parents.","user":"jcasetnl","rank":[56,64]},{"title":"A Nutshell Review: Singles (1992)","rating":7,"date":"15 October 2005","review":"Love. Sex. Friendship. Companionship. These are the themes obviously explored in Cameron Crowe's early movie Singles, which revolve around the love lives of singles (naturally) living in a common apartment. We follow each of the protagonist Steve (Campbell Scott), Janet (Bridget Fonda), Cliff (Matt Dillon) and Linda (Kyra Sedgwick) through their ups and downs in dealing with the weird little emotion called Love.<br><br>Well, not quite. As we know early in the film, each have problems and their own peculiar viewpoints on the dating scene. We see Linda meeting and breaking up with a Spanish student she was so into, after seeing through his lies and sweet talk. It hurts, and she doesn't want to be hurt again. Steve too have had a bad experience, and (I can identify with this) swears off relationships for the next few years, deciding instead to focus on career. As Fate would have had it, these two will meet at the unlikeliest places and get into a relationship.<br><br>Cliff, an aspiring rocker, seemed to have taken his girlfriend Janet, for granted. And I think this is something that most people can identify with. When efforts go unappreciated, or when things go mundane, the question is, do you want to bail out? And when you do, what next? Would you give the ex another chance? If you do, how would you approach it? It's fun watching a movie that was made 13 years ago, and you wonder about how the initiating and sustaining of a relationship back then happened without technology which we are so used to these days. Back then, a mobile phone was a cordless one, and there is no such thing as an instant message, but an answering machine. Where Speed Dating was unheard of, but Video Dating was the rage (check out the funny Tim Burton cameo).<br><br>You wonder too about the career of the leads. Campbell Scott was noticed by many after his pairing with Julia Roberts in the movie Dying Young, but after this, seemed to have vanished into obscurity. And so has Kyra Sedgwick. Only Matt Dillon and Bridget Fonda are still around, somewhere.<br><br>Oh, the music. Peppered throughout the movie is the wonderful musical tracks that always seem to punctuate a particular moment succinctly. I like Tarantino and Crowe movies because music plays an integral part of the entire experience, and Singles too had excellent ballads blended with grunge rock, say, Pearl Jam (before they made it huge), which also made an appearance.<br><br>It's a beautiful, quirky little movie with excellent identifiable dialogue, music, humour, and a younger cast of stars whom we know today, thrown into situations that everyone in love would have experienced.","user":"DICK STEEL","rank":[30,35]}]