[{"title":"Interesting remake","rating":15,"date":"15 October 2004","review":"This remake is better than I expected. It sticks pretty close to the original but does change a few details here and there. Belushi is surprisingly effective in the Bogart role. The rest of the cast perform well. It's no substitute for the original but it is an interesting alternative take on the story. <br><br>I don't see this as anywhere near the debacle described by the other reviewer, who was obviously put off by elements of the story that were repeated from the 1943 original. Those were different times. And this film chose to honor those conventions rather than trying to rewrite history to kowtow to current thinking. Whether that was the right move or not is, I suppose, debatable. But I was expecting to hate this film, yet I found myself pleasantly surprised.","user":"jadortmunder","rank":[37,40]},{"title":"Better Than Expected","rating":8,"date":"3 November 1998","review":"Although I am generally against remaking classic movies, I must admit that this TV-movie starring Jim Belushi was very well done and was far better than I expected.  And Belushi's fine acting was a delightful surprise, too. I recommend that you see the original with Humphrey Bogart and compare. You'll enjoy both.","user":"harry-m","rank":[23,26]},{"title":"Good remake and highly under-rated.","rating":31,"date":"31 August 2004","review":"This was, IMO, one of Belushi's better portrayals. The subject is a part of history seldom touched upon by American movies (the American participation in the African theater against Rommel)and includes the Grant medium tank...a forgotten piece of equipment that shows just how unprepared America was to fight WW2.<br><br>The movie is well acted. The scenery is excellent and the action flows nicely. The soldiers don't come across as cartoon superheroes or Rambo clones. The rift between the Italian and German forces is portrayed rather nicely too.<br><br>The equipment is portrayed nicely and the tactics are sound.","user":"kaninz","rank":[26,31]}]