[{"title":"This black comedy/quirky crime thriller is one of the most underrated movies of the 1990s.","rating":20,"date":"20 September 2003","review":"'Miami Blues' fans nod at each knowingly like they share a secret. For some reason this super cool movie isn't all that well known by most movie buffs, but those that appreciate it see it for the highly original and quirky piece of work that it is. Writer/director George Armitage served his apprenticeship with exploitation king Roger Corman in the early 70s, as did Jonathan Demme who co-produced. If you like Demme's mid-period movies like 'Something Wild' and 'Married To The Mob' you'll love 'Miami Blues'. Armitage even uses Demme's mascot Charles Napier, the craggy faced character actor beloved by Russ Meyer nuts. The movie is based on a book by Charles Willeford which features his regular protagonist Hoke Mosely. Quentin Tarantino is a major Willeford fan, and much of 'Miami Blues' prefigures Tarantino's fresh mix of crime and comedy. Mosely is played by Fred Ward who gives one of his very best performances. Alec Baldwin also lucks out as Junior. You'll rarely see either actor as good as this anywhere else. Both of them are just brilliant in this movie, as is Jennifer Jason Leigh. The three of them together are just a joy to watch. Add to that small supporting roles by Napier, Nora Dunn ('Three Kings') and Shirley Stoler ('The Honeymoon Killers') and it's a film buffs dream. You even get a totally pointless cameo by cult favourite Martine Beswick! I don't know why she's even in the movie, but it's alright by me! I always enjoy watching 'Miami Blues' every time I pull it out of my collection. Lots of old favourites lose their appeal as the years go by, not so this one, which just gets better and better to me. Highly recommended fun!","user":"Infofreak","rank":[50,58]},{"title":"One of those obscure classics!","rating":6,"date":"6 October 2000","review":"This is one of those movies that perhaps not a lot of people saw, but for me, it's one of those 'obscure classics'.  A little quirky at times, but it just looked like a fun movie to act in, and definitely a fun movie to watch. The cast does a great job, especially Alec Baldwin and Fred Ward.  They just really seemed to be enjoy their characters.  Jennifer Jason Leigh gives her usual solid performance in yet another offbeat role. Alec Baldwin always seems to give some 'classic scene' deliveries (Glengarry Glen Ross, Malice, The Edge, etc.), and once again here in Miami Blues, he scores some big ones.  On the bed, counting the stolen money, doing Al 'Scarface' Pacino.  Rhyming while finding the 'very big' gun.  The entire dinner scene with Ward's Moseley.  Stopping the store burglar with a jar of spaghetti sauce.  His 'raid' of the betting room ('remain silent').  -Etc. etc.  These are just a few examples of some of his classic scenes or lines. They're usually hysterical!!<br><br>Anyway, there is some violence, some 'dark' comedy (e.g. Ravindra!), etc., but overall, I think this movie was very entertaining and a nice offbeat surprise with some great performances and lines.  Chalk it up under one of my 'Top Ten Favorites That Not Everybody Saw'.","user":"I M D Man!","rank":[34,39]},{"title":"Alec Baldwin walks away with quirky crime picture, having the time of his life","rating":8,"date":"2 March 2003","review":"Alec Baldwin sports a great haircut in Miami Blues and knows it.  He struts and swaggers through the movie like the cock of the walk, having a high old time and giving us one, too.  It's an exhilarating, watch-this performance that can't help but call attention to itself but luckily happens to fit the character.<br><br>The character isn't so much fun.  He's a happy-go-lucky psycho just sprung from prison and landed in Miami, where he brushes off a Hare Krishna acolyte in the airport by breaking his finger (the poor guy dies of shock).  At his hotel he orders up a hooker (Jennifer Jason Leigh); they hit it off and pair up, mainly because `Princess Not-So-Bright' has trouble with independent thought.  Then Baldwin is off and running through Dade and Broward Counties, stealing wallets and identities, staging impromptu holdups, and running giddily amok.<br><br>Tired old cop Fred Ward picks up his scent, and even shares a meal of many brews and Leigh's pork chops with the couple.  But Baldwin turns the tables and ambushes Ward in his ratty old residential hotel, putting him in the hospital.  The upside is that now Baldwin's got a new identity  Ward's  with a gun and a badge to prove it.  Flamboyant and reckless, he continues his felonious spree like an overgrown kid playing cops and robbers.  But he can't keep it up forever, not even in the anything-goes milieu of South Beach....<br><br>Miami Blues is drawn from a crime novel by Charles Willeford, who wrote (he died before the picture was adapted) in the playful, inventive Elmore Leonard vein.  There's not much plot, just enough to hold together the characters, which it's about (and the movie's full of quirky characters, memorably including Shirley Stoller).  But, though Ward gets top billing and Leigh flashes her credentials as a graduate of the Meryl Streep Academy of Accents, it's Baldwin's movie.  If you're fond of ham, you're in for a feast.","user":"bmacv","rank":[17,19]}]