[{"title":"Street Fighter Correction","rating":22,"date":"22 September 2003","review":"Following up the spectacular disaster of competing fighting game turned movie, Mortal Kombat succeeded where Street Fighter failed.  Not a fantastic movie nor one that goes in my top ten, but Mortal Kombat (without a doubt) is one of the better game-based-films.<br><br>MK wisely avoids inventing plot in unwelcomed places and sticks to the game as frequently as it can get away with.  Actually the biggest contradiction that comes to mind is Scorpion and Sub-zero on the same team.  Die hard fans will call the screenwriter on this, the rest of us won't care.<br><br>All the mistakes Street Fighter made, MK avoided.  Instead of colorful campy cameo-fest, Mortal Kombat comes across as a dark tale about a handful of martial artists shot with an exaggerated epic style with humorous undertones to provide comic relief every now and again.  Then again, it is ironic that Street Fighter would feel cartoony and Mortal Kombat more concrete when looking at the style of the games (drawn sprites versus live actors).  MK is a little silly when reproducing game effects and trademark moves, though now more and more films are moving in that direction (Matrix, anyone?)<br><br>\nThe movie's premise is the first Mortal Kombat arcade game featuring a few plot hints (journey to Outworld) and a few characters from Mortal Kombat 2 (Kitana, Jax, a youthful Shang Tsung.)<br><br>Christopher Lambert and Cary-Hiroyuki Takawa make the most memorable impact as Thunder God Rayden and Shape-shifting Sorcerer Shang Tsung.  Both ham up their performances just enough to remind us that we're watching a live-action video game, but they don't go overboard into Street Fighter's territory.  The rest of the cast plays their part straight forward and makes their characters believable.<br><br>It's a quick and slick film, gets to the action and gets over with before you can ask too many questions.  It's a pretty decent martial arts film, and an outstanding video game' film.  And in 1995, it was the best game-inspired film you could find.  Today it's still in the top five.","user":"jaywolfenstien","rank":[103,111]},{"title":"Though showing its age, \"Kombat\" is still as entertaining as it was in its heyday","rating":10,"date":"7 March 2002","review":"I was living in San Diego (particularly in the suburban armpit of Del Mar) in 1995, and I remember waiting eagerly well over a year for MK's release. And it was definitely worth the wait; I saw it a total of 13 times, which stood as my all-time record for nearly four and a half years. When all was said and done, it had grossed a strong $70 million domestically, plus $100 million worldwide.<br><br>I'm not a Mortal Kombat fanatic anymore, but in retrospect MK was one of the most entertaining movies of the 1990s. It was easily the first video game-turned-movie to contain a halfway decent plot, exciting special effects, good acting and spectacular martial arts action, the latter which was before all the present-day \"Crouching Tiger\" wire-work nonsense. The actors underwent a three-month crash course in martial arts training, and their hard work paid off beautifully. On screen, they looked like they were really performing those moves instead of just imitating them. Unlike previous video game movie washouts like \"Double Dragon\" and \"Street Fighter,\" MK also had a comprehensible plot that remained faithful to the games, and in the end won a space in gamers' hearts.<br><br>Along with the supporting cast of well-renowned martial artists, MK featured a nice cache of actors: Linden Ashby  whose screen personalities have all had a bit of a humorous smartass element to them  was perfect as Johnny Cage, likewise then-rising star Bridgette Wilson as Sonya Blade and Robin Shou as the film's centerpiece, Liu Kang. Christopher Lambert gave a witty performance as thunder god Raiden (constantly misspelled as  \"Rayden,\" much to the aggravation of many MK fans like myself), and nobody cared that he was a French actor playing a Japanese character. Cary-Hiroyuki Tagawa, who recently starred in Tim Burton's version of \"Planet of the Apes,\" clearly had a ball playing the evil Shang Tsung, and it showed. (Heck, how many evil sorcerers get to wear cool black leather jackets?)<br><br>Unfortunately, save for Tagawa and Wilson, MK unfortunately did not spell the worldwide exposure that many had predicted would come to the stars following the film's success, and the art of animatronics, used here to bring the four-armed Goro to life, is all but extinct in this day and age, but there was no denying that back in the day, the cast and filmmakers knew they had made an entertaining movie. While I hardly watch MK anymore, the bottom line is that it was undeniably a kick in the pants during its time, and for that reason alone it continues to maintain my highest vote to this day. 10/10","user":"SwingBatta","rank":[34,38]},{"title":"20 years later, still my favorite video game-to-film adaption!","rating":10,"date":"9 January 2015","review":"10/10 review, your eyes do not deceive you. \"Mortal Kombat\", simply put, is not only the best best game- to-film adaptations ever made, but one of my personal favorite movies of all time. I first seen this movie in the theaters in 1995. I was only five years old at the time! Back then it was a fantastic film, and in 2015, it's still a great film! Maybe it's nostalgia, but on the other hand compared to all the other overrated junk of 2014 and 2015, I consider this movie excellent and it is one of my favorites. This film and franchise even encouraged me to study martial arts for almost 15 years now.<br><br>Mortal Kombat, simply put, is a movie rendition of the original \"Mortal Kombat\" arcade video game. It's about a group of warriors from Earth who compete in an ancient martial arts tournament for the fate of the world. In more than one way, it borrows many concepts/ideas from \"Enter the Dragon\", but on the other hand, it has it's own unique twist and storyline to it.<br><br>Everything about this movie is awesome. Simple storyline with humor in the right spots, great casting, EXCELLENT choreography, and a fun soundtrack that still rocks today. In particular, this is one of my favorite fighting movies because the fights were excellently choreographed. Some standoffs between characters were extremely convincing and fun to watch. The fights were very dirty and not too over-the- top. They also paid homage to the video game with cool fatalities and even a funny \"friendship\" scene. Probably the ONLY weak spot in the film would maybe be some of the CGI (especially for Reptile); Reptile didn't look great in 1995 and the movie aging 20 years has not helped! With that being said, the non-CGI Goro looks better than any junk they would probably try to make today. <br><br>It makes me very sad that the franchise (as far as the big screen goes) is in limbo. But at least we have this great classic filmed by Paul Anderson! If you enjoy video game films, martial arts, or the new age MK video games, I recommend you check this film out. It is a fun film and worth adding to your DVD or blu ray collection.","user":"sedativchunk","rank":[25,28]}]