[{"title":"Unfairly trashed actioner from a master director","rating":8,"date":"17 August 2005","review":"Plot summary: In a prohibition era update of Yojimbo, Bruce Willis shoots a load of gangsters.<br><br>First off I will never understand why Walter Hill does not have a better reputation. He's probably best known for his commercial success with the 48 Hrs films, and his other brilliant features get criminally overlooked. He scored a cult hit with \"The Warriors\", he delivered one of the best westerns ever with \"The Long Riders\", and put all other car chase movies to shame with the ultra cool \"The Driver.\" As anyone who has seen these films should realise, Hill should be mentioned in the same breath as Peckinpah, Woo and Rodriguez when it comes to slow-mo gunplay.<br><br>\"Last Man Standing\" doesn't rival these earlier works, but it is a tough, gritty film with some fantastic shootouts. It doesn't hold itself back in terms of blood and violence, something current US films of the genre are guilty of doing. It has everything an action film needs; tough antihero, loath able bad guys, a creepy main villain and plenty of cannon fodder. As long as you don't get hung up on technicalities (ie the guns fire ten times more ammo than they hold) you should be entertained.<br><br>It doesn't feel like any effort went into the screenplay, but Hill adds some nice touches to the film in terms of nods towards the source material. I particularly like the opening where Bruce spins his empty whisky bottle on the ground to decide which road to take; a clear reference to Toshiro Mifune throwing a stick into the air to decide on his path. There is also an interesting cast; there's earlier Hill collaborator Bruce Dern (The memorable villain from The Driver), William Sanderson (Blade Runner) and of course Christopher Walken, who chews the scenery talking tough with his hoarse accent and threatening people with a Tommy gun. His performance is really the most memorable thing about the film. Willis is not Mifune or Eastwood, but he does suit the mysterious drifter character well and this is one of his better action man roles.<br><br>All things said, the film certainly doesn't come close to \"Yojimbo\", but it does give the more rough hewn \"Fistful of Dollars\" a run for its money. By no means a masterpiece, \"Last Man Standing\" should still provide enough for any action fans tired of watered down mainstream Hollywood nonsense that currently dilutes cinemas. It is certainly a lot better than its reputation makes out.","user":"wierzbowskisteedman","rank":[90,103]},{"title":"Stylish Mayhem","rating":8,"date":"21 February 2006","review":"This is simply what the above headline states: an ultra-violent movie done is stylish cinematography. Walter Hill, a nasty director who does this sort of thing (violent, profane films but usually with great visual appeal) did it in spades on this one. This is testosterone gone berserk.....and very entertaining.<br><br>Actually, I enjoy watching this film and don't apologize for it, although it has no \"redeeming qualities.\" However, I love the old-fashioned narration, here done by Bruce Willis in great Mickey Spillane/Mike Hammer-style, the period in which it's done (1930s) and the great colors in here. Love those orange colors!! This looks tremendous on DVD with a good flat-screen set.<br><br>If I'm feeling in the need of seeing a violent crime film, this usually fills the bill. It's a fun flick. I could do worse.","user":"ccthemovieman-1","rank":[77,92]},{"title":"It's very orange","rating":11,"date":"11 May 2003","review":"This film is a bit of an oddity. A remake of a remake, the story is so obvious you are never surprised by events, but the gunfights are pretty entertaining and Christopher Walken's turn as the husky baddie Hickey is suitably menacing. Also the fact that the attractive brunette has a completely pointless scene where she is topless in front of the mirror is a bonus. :) The camera work is stylish and the discordant guitar riffage of Mr.Ry Cooder is superb, the pace is slow but not sluggish and you can almost feel the heat and dust. This film is good but not great. Er... that's it.","user":"boraxx","rank":[66,80]}]