[{"title":"I loved it!","rating":20,"date":"20 November 2004","review":"I loved this movie - it had the kind of understated and subtle, intelligent humour that is all too rare these days. Witty, acerbic and thoroughly scurrulous. A titled brat with no brains and a very canny artisan who are both wanted by the law reluctantly join forces as highwaymen. Historically only as accurate as it suits the story at the time, it has a surreal quality that is enchanting. If you like intelligent, funny movies with a twist, this one's worth a look. A bit graphic in places, both sexually and in terms of violence, but what's a bit of the clap between friends!? I don't understand how this movie made so little impact on the movie going public but it deserves cult status as far as I am concerned.","user":"maryanneh","rank":[32,37]},{"title":"Big frocks, big choons, big laughs and edge of seat stuff","rating":8,"date":"17 April 1999","review":"Ah, how refreshing to see a vision of 18th century England complete with mud, the pox and gibbets... and accompanied by a delightful techno soundtrack to boot. This is the story of downtrodden highwayman Plunkett (Robert Carlisle) and Gentleman-fallen-on-hard-times Captain Macleane (Jonny Lee Miller), and how they get together and rob the aristo pigs. Plunkett is a hard nut, but MaCleane is far too polite for that, and thus becomes 'the gentleman highwayman'. He falls in love with Lady Rebecca (Liv Tyler), (who to be frank is the only weak part of the whole shebang) and wants to impress her.<br><br> The costumes are fantastic. Big, colourful, historically innacurate beautiful togs. Alan Cummings gets all the best threads, and the best lines as Lord Rochester, sporting a very non-18th century eyebrow piercing. The music shifts between swooping glorious choirs and thumping bass-laden techno, which doesn't jarr as you think it should do in a historical film. The script is fast-moving and peppered with modern-day colloquialisms; Merchant Ivory, this is not. There are hilarious parts, disgusting parts, sit-on-the-edge-of-your-seat-and-nibble-your-fingernails parts, but the whole thing chugs along and is wonderfully entertaining throughout. This is cheer-in-the-cinema stuff. Unmissable.","user":"Quinster","rank":[31,36]},{"title":"Plunkett and Macleane:History doesn't always matter","rating":12,"date":"12 April 1999","review":"Far from being historically naive, Plunkett and Macleane is a very cheeky comedy which uses modern touches to bring humour and vibrance to the story. In one hilarious scene modern music is used to turn a ball into a kind of rave. This picture probably conveys more of the spirit of England at that time than any of the tightly corseted period dramas that we see on our small screens. In those days London would no doubt have been (not much different than today) a hive of grime, guts, violence and sex. The best thing to do is to sit back and enjoy the energy,comedy and damn fine performances in this great little britflick. It's not exactly accurate but then this is not what was intended. Give it a go!","user":"Goldmine","rank":[19,22]}]