[{"title":"A fitting end for the crew of the NCC-1701-A.","rating":9,"date":"14 September 2004","review":"The journey that began on the small screen in 1967 comes to its end on the big screen in 1991, after three TV seasons, six films, and the creation of a cultural phenomenon unrivaled in the history of television. The crew of the original series had met with mixed results on the big screen, producing the excellent The Wrath of Khan, but also the inexcusably bad The Final Frontier; the other four ranged from passable to good. After the financial failure of Star Trek V, Paramount brought back Star Trek II director Nicholas Meyer, and commissioned from him the final voyage of the original cast. As Star Trek so often does, the events depicted mirror the glasnost of the late 1980s, as the collapse of the Soviet Union eased global tensions and heralded the beginning of a new era. In the Trek universe, the possibility of rapproachment between the Federation and the Klingon Empire raises the hackles of hardliners on both sides, and Kirk and co. must prevent the weak peace from being destroyed. The original cast is in fine form, all of them giving their all to make the (potentially) final appearances of their characters memorable. Despite William Shatner's reputation as a ham actor, he delivers a great performance here; his final log entry is one of Trek's finest moments. As the villain of the piece, we get General Chang (Christopher Plummer), a Klingon out to insure \"no peace in our time\". Plummer is superb, chewing scenery and spewing Shakespeare with a wonderfully loathsome presence. I would rank Chang below Khan and the Borg Queen, but far above all the other Trek villains. There are some tacky anachronisms typical of Meyer's style, and the usual amount of discontinuities and canon issues; but that's inevitable, and I can accept it if it leads to a good story. Trek VI is a good story. 9/10.","user":"colonel_green","rank":[79,86]},{"title":"Classic Space Opera","rating":9,"date":"24 May 2005","review":"The final Star Trek film to feature the original cast is an enormous improvement after the awful fifth film, and might just be the best in the series. Much of it is probably thanks to the return of director Nicholas Meyer, who is responsible also for the classic Star Trek II: The Wrath Of Khan (while film III through V were directed by cast members). Meyer's very professional directing shows in every scene on ST-VI, and the old cast - William Shatner (Kirk), Leonard Nimoy (Spock), DeForest Kelly (McCoy), James Doohan (Scotty) and the rest - give here what is without doubt their finest performance. Mind - Shatner and Nimoy are by now 60 years old, while Kelly and Doohan are well into their 70s. But there isn't a trace of the pathetic silliness that characterized the fifth movie; Meyer knows what to do with these aging actors that wouldn't make them look like idiots. What we see in Star Trek VI is a much more mature approach, and the crew members have to face, more than an outside enemy, their own aging, and their fear of change. That fear is a key element here, and it's an issue that is well handled and is always relevant.<br><br>While the old cast members are doing splendidly here, the movie introduces some fantastic new characters. First and foremost, the experienced Shakespearean actor Christopher Plummer makes a fascinating villain in the conservative and suspicious Klingon General Chang, endlessly throwing out Shakespeare quotes on every turn. ('You haven't truly enjoyed Shakespeare until you've read it in the original Klingon') Also, Kim Cattrall, who achieved much success lately in the acclaimed 'Sex And The City'), plays the Vulcan Lt. Valeris and gives a great performance. Finally, David Warner gives a brief but memorable performance as the visionary Chancellor Gorkon. The real stars here, though, are Shatner and Kelly, whose attempt to save the Chancellor's life, as well as their trial for assassination before a Klingon court (CAMEO: Michael Dorn, who plays Worf in the Next Generation, plays Kirk and McCoy's attorney here - Colonel Worf. An ancestor, probably) make for some of the best scenes ever seen on Star Trek. The directing and camera work are splendid, and the script has just the right amount of self humor, which was dreadfully lacking from the fifth movie (e.g.: Spock: 'If I were human I believe my response would be \"go to hell.\" ...If I were human.' All in all, a remarkable sign off for the original crew of the Enterprise and one of the best sci-fi movies of all time.","user":"itamarscomix","rank":[64,73]},{"title":"One of the best in the series!","rating":10,"date":"7 October 2002","review":"In the theatre years ago when I saw this film I thought gosh this is really different for a Star Trek film. It had so much suspense and conspiracy, and so much mystery that this was one of the best films in the collection. The acting is great, the action and the effect are superb, and the music is very good! I recommend this to all Star Trek and sci-fi film fans!","user":"Movie Nuttball","rank":[41,46]}]