[{"title":"Storytelling at Its Best","rating":9,"date":"25 March 2001","review":"I enjoyed this movie immensely.  This is one of the best examples of storytelling that I have seen.  The structure of the movie - alternating between the past and present, with multiple intertwining plots - keeps the viewer hooked on how the story will unfold.  It unfolds gracefully and is enjoyable throughout.<br><br>The acting is exceptional.  Mary Stuart Masterson and Mary Louise Parker carry the bulk of the acting load.  They are fantastic.  The relationship between these very different young women is complex and satisfying.<br><br>Since the movie is about women and the female roles are so strong, this movie has been dubbed a \"chick flick\", but that pejorative is unfair.  This is good film making and those who like plot-driven cinema will enjoy this immensely.  This one is in my DVD collection.","user":"chron","rank":[130,150]},{"title":"A Beautiful Film","rating":28,"date":"28 October 2004","review":"This is truly a beautiful film.<br><br>Well written and superbly acted it tugs at the heartstrings harder than almost any other movie. The way it sets up an obvious story line and then like a gentle roller-coaster suddenly takes you in another direction is unequalled in this type of film.<br><br>There are so many points of genuine sadness and whenever you think you have guessed the story you suddenly turn to find an outcome more surprising than you thought.<br><br>Major characters die, major characters do not \"fall in love\" and major characters are not allowed to cop-out; it is as a film should be.<br><br>Remarkable well written, produced with care and acted with understatement and love - it is a beautiful film.<br><br>Watch it.","user":"johnpearce48","rank":[123,148]},{"title":"An Excellent Story Within A Story","rating":10,"date":"9 July 2004","review":"I must admit. When I first heard of this movie many years ago, the title didn't sound that appealing and the few scenes that I saw didn't look very interesting. But what can I say? I was little then and didn't know what I was missing. My mother kept telling me how good of a movie this was, but I was just too stubborn and didn't pay attention. It was only a few months ago that I decided to watch it when it appeared on TV and boy was I surprised!!<br><br>This movie is beyond anything that I have ever viewed in my entire life. Usually, this sort of movie isn't the kind that I look at, but I fell in love with the story and the characters, as well as the wonderful actresses (Kathy Bates, Jessica Tandy, Mary Stuart Masterson, and Mary-Louise Parker) who did an outstanding job portraying their characters in a unique and unforgettable way.<br><br>Since I don't want to spoil anything for those who haven't seen it, let me just say that it's an astounding tale of a special friendship that goes way beyond what we would call a \"regular\" one. It will make you thankful for the friends you have and even give women a sense to stand up for their own rights. All in all, I give this movie a 10 out of 10. If you haven't seen it, what are you doing reading this?! Go out and rent it!","user":"azifucare","rank":[111,137]}]