[{"title":"Charming, delightful, fun and clever; \"One Fine Day\" is a hit!","rating":17,"date":"17 April 2004","review":"In \"One Fine Day\" Jack Taylor (George Clooney) and Melanie Parker (Michelle Pfeiffer) meet when their children miss a school field trip, and after much bickering they finally agree to take shifts in watching their kids.  Over the course of the day they run into countless mishaps and misadventures, and come close together, to understand each other in a sort of non-romantic romantic way.<br><br>The first time I saw \"One Fine Day\" it was 1996 and I was seven years old. I didn't like it.  I found it tedious and boring.  Now I'm fourteen, and I just finished watching, and I love it?  I get all the jokes I didn't get now, all the clever one-liners spoken with a bright, witty confidence that is reminiscent of Frank Capra films.<br><br>And clever they are!  I have to say, when you subtract a few (very few) somewhat cheesy lines from the script, it becomes perfect.  I'd go as far as to say Oscar worthy.  Yes, you may think its cheesy that Jack's a famed newspaper columnist bringing down a mob member and the mayor, and Melanie's an architect working on what we imagine is a multi-million dollar deal with big businessmen, but the way it's presented is not that it makes sense, it's that you don't care.  And that's not the focus of the film either, the movie would rather be about the minglings of the two leads.<br><br>And I have to say, Clooney and Pfeiffer have great, perfect chemistry. Clooney is his usual cool, intense self whereas Pfeiffer is an uptight, worrisome hard worker.  They play off each other perfectly.  It's not just their chemistry either, their performances stand alone as emotional, funny and smart.  I'd go as far as to call Pfeiffer's Oscar worthy.<br><br>The style and direction in the film is also notable.  There are split-screen conversations, some long steadicam shots, the whole placing of the camera fits perfectly with the light-hearted nature of the film.<br><br>A fun, witty, lovable family film, 7.5/10.","user":"NoArrow","rank":[29,30]},{"title":"Not all romantic comedies are created equal!","rating":9,"date":"16 October 2004","review":"I would probably never decide to watch this film, had it not been for my wife who rented the DVD. Just like many others, I expect romantic comedies to be all the same - usually terribly unrealistic (talk about suspension of disbelief!) as in the Pretty Woman, and the humor to be 3rd grade.<br><br>But, One Fine Day, surprised me in many ways! First, it is not \"I need insulin right now!\" sweet. Also it is surprisingly relevant for today's world, and not targeted at teeny boppers.<br><br>One Fine Day is a film with a very smart script, funny dialogues, beautiful acting, directing, and it all gels well together. Most of the moviegoers today expect blood, gore, darkness of warped minds, and it seems that films which don't have that have a hard time getting a good review. It is time we step back, and enjoy some of the subtleties of life and people, and laugh at ourselves, when it's all presented in a believable and funny way.<br><br>The film takes us through \"one fine day\" of a single mother and her son, and a single father and his daughter. Due to his error, they miss their kids field trip and are, reluctantly, helping each other out take care of kids. While he obviously likes her but has a problem with trusting again, and a questionable flirting tactics, she is more obviously shell shocked and uses every opportunity to put him down. In a single day they both go through so many humbling episodes that the relationship develops from \"I already have an opinion about you...\" and \"So do I...\" to \"I'll help you out if you say: 'Be my knight in shining armor...'\"<br><br>The control freak named Melanie and played wonderfully by Michelle Pfeiffer, manages to stay likable even though she \"beats every miserable bastard that comes her way to pulp\". George Clooney has an easier time being liked as he is his pretty much usual self, and that's exactly what the character requires. Both kids were much better then I would normally expect them to be; I am always put off by artificial adult gestures and \"too cool for you\" acting of today's kids in Hollywood films, and expected that this time it would be the same, but it was not.<br><br>The humor in this film is subtle, and you may actually miss it altogether if you expect things to blow in your face. I loved those brief encounters between Melanie (Pfeiffer) and Celia (Amanda Peet) in which a beautiful perfectionist with a heart (Pfeiffer) meets her less polite match... Amanda Peet was also fantastic! Just notice how Pfeiffer's facial expression changes when she realizes who she's talking to. Another one to watch and enjoy is the episode with Melanie's boss.<br><br>Also, this film can be watched more then once, as there is a lot to appreciate about it. <br><br>ps. A scene at the shrink's office made me laugh like never before!","user":"Nobody-27","rank":[49,54]},{"title":"How this film should be appreciated","rating":10,"date":"8 March 2004","review":"This film is one of my favorites. I absolutely love it. I'm not entirely sure why i just find it really sweet and the two stars are both perfectly charming throughout. I used to have this on in the background whenever I did homework. Maybe I was just at that age when I was starting to appreciate romance when I saw it in the cinema (3 times) but I still feel this is one of the best romantic comedies I've ever seen and would definately recommend it to anyone. It's a great shame that a gem like this is so underrated. ALL of the acting is suberb. George clooney is entertaining as always in this film he made whilst it was still being debated as to whether he could transcend tv and become a movie star.","user":"rfysh","rank":[49,58]}]