[{"title":"Technically impressive and enjoyable, but somewhat forgettable too","rating":6,"date":"31 December 2009","review":"This movie had a lot of potential. While technically impressive and very enjoyable with some genuinely funny moments, for some reason it falls short. Of course there are redeeming qualities, such as the fun music score by Danny Elfman, one of my all time favourite film composers and an amusing turn from Robin Williams. Also the special effects are greatly improved from the effects in the Absent Minded Professor, and Flubber who is so cute steals the show. The performances from Clancy Brown, Ted Levine and Marcia Gay Horden are entertaining, and Jodi Benson (who voiced Ariel in the Little Mermaid)is a delight as the voice of Weebo, whose death is absolutely heart-rending. However the story is very predictable, and offers few surprises, and the physical comedy was better than the patchy script which in places felt uninspired. That saying some of the physical comedy has strong hints of deja vu, and is rather hit and miss. Of course kids will lap it up, but adults probably won't like it as much. The second half of the movie is more meandering in quality compared to the first half, very little of interest happens and some of the situations come across as ridiculous. All in all, somewhat forgettable, but for a kids movie it is pretty entertaining. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[10,10]},{"title":"Mildly amusing kids film","rating":23,"date":"23 January 2002","review":"An absent minded professor discovers a new type of rubber that can be harnessed as an energy source.  However his discovery causes him to miss his wedding and lose his girlfriend.  While trying to demonstrate his discovery to Sara Jean to win her back, he gets the attention of mobster Hoenicker who wants the discovery for himself.<br><br>The story here is unimportant - it's all a bit daft and if you look too closely at it, it all falls apart.  For example - the professor has created a flying robot that has full intelligence and character but yet he hasn't made any money for himself or his college!, is the flubber alive or not? etc.  But really it's all about the set pieces and the jokes.  As such it falls down a little - it's good for kids but there's nothing in the crude slapstick for adults.  Jokes include the usual \"people getting hit in the head\" style humour.<br><br>Williams character is not funny at all - a bit of a weakness in a comedy lead.  In fact his forgetfulness is just stupid at times and doesn't have any charm to cover it.  The funniest bits actually revolve around McDonald's Wilson - he doesn't get good lines but he has lots of incidental laughs. Ted Levine and Clancy Brown have both done better than this and are limited to comedy thugs - although both were probably glad to be in a big movie. Other well known faces include Raymond J. Barry and Wil Wheaton, although these are also underused.  It's not really a movie about performances but I think it's still important.<br><br>The best characters are Weebo and the flubber.  Weebo is quite funny and actually has a deep character - she's the secretary in love with her boss type - she also creates a strangely moving scene.  The flubber is good - best in one big musical number halfway through and I wonder if they could have had more imaginative scenes with it as a character rather than just a bouncy ball.<br><br>Overall it's a kids film - don't expect anything more than that.","user":"bob the moo","rank":[26,36]},{"title":"Entertaining and visually impressive, the film nevertheless falls short of the joyous satisfaction found in the original AMP","rating":6,"date":"23 August 2007","review":"Philip (Robin Williams) is a chemistry professor at a college with financial woes. On a side note, the school's president, talented Sara Jean (Marcia Gay Harden) is Philip's girlfriend and she is deeply disappointed that he has left her standing at the altar THREE times. Yet, Philip truly loves Sara. His problem is, of course, that once he is into an experiment, he loses touch with everything else in his life. The day Philip misses his third trip up the aisle of love, he discovers something big...that is, flying rubber or flubber. Knowing this could be the invention that turns the college's ledger into the black, he is eager to tell Sara of the news. Unfortunately, she won't talk to him and is receiving the attentions of a rival chemistry prof at a nearby university. It is this rival's intention, along with a host of others connected to the school, to steal the rubbery substance for their own purposes. Will they succeed? This is a mildly entertaining film, mostly due to Williams star power and the spectacular visual effects the movie offers. Flubber, indeed, takes on a green personality not unlike the Pillsbury doughboy and bounces all over the place, causing much fun and havoc. There is also a tiny robot-computer, living with Philip, that is very appealing. Add on the eye-treat of flying cars and basketball superduper jumpshots and you have a technically impressive film. Yet, somewhere along the way, a bit of the original film's soul and joyous freshness is lost. No, its not the fault of the talented Williams, Harden, Christopher McDonald or the other cast members. They are quite fine. There are also some laugh out loud scenes, such as the one where Professor Philip starts giving a lecture, not noticing that he is in a figure drawing class, or the ones where a neighboring boy, quite rightly fears, to his father's consternation, what is outside his window when flubber is out and about. In summary, the film's problem is probably a case of trying too hard in the special effects category and not enough in the remaining aspects of film making. Even so, it is not a stretch to say that most families will like Flubber, as everyone will be amazed by the stunning look of the movie.","user":"inkblot11","rank":[12,17]}]