[{"title":"INTELLIGENT AND MATURE BATMAN CARTOON","rating":5,"date":"5 March 2002","review":"Firstly, let me say that the 1992 Batman cartoon series was the best Batman cartoon series ever made. Just like the 1989 Batman movie it returned Batman to his dark roots and was a fantastic series.<br><br>This was a great cartoon film. I haven't seen many great cartoon films but this was one. It has an interesting storyline, an interesting villain (The Phantasm), interesting subplot for Bruce Wayne and it's even got the psychotic Joker as well.<br><br>The Phantasm is the most interesting cartoon villain in a long time and with the Joker in this movie as well it makes for an exciting movie. If you want an intelligent and thought provoking cartoon film then this is the one for you.","user":"Big Movie Fan","rank":[72,76]},{"title":"An absolute classic, the best Batman movie so far","rating":9,"date":"1 January 2005","review":"Out of all the Batman films so far, including all the live action films, this one is still the only one to really explore the character of Bruce Wayne/Batman and examine what drove him to becoming Batman.<br><br>It has a great story that flashes back to just before Bruce took up the mantle of the bat and the woman he was involved with at the time, then skips forward to an unknown assassin killing Gotham City's mobsters, and we see how the 2 story's meet. The writing is top-notch, in no-way predictable and the voice acting by Kevin Conroy as Batman and Mark Hamill as the Joker truly amazing and bone-chillingly scary.<br><br>The only complaints is that the animation could have been better at some points, but that is because it was originally meant to be a straight to video release before Warner's saw what a masterpiece they had created, and also it should have run for a little bit longer, but oh well. If you haven't yet seen it i highly recommend it.","user":"thecosmicjester","rank":[78,86]},{"title":"The Greatest of all the animated Batman films!","rating":10,"date":"1 January 2003","review":"Not only the best animated flick but one of the greatest Batman movies ever made!<br><br>Alan Burnett, Paul Dini, and Bruce W. Timm are without doubt the best creative team of any involved in a Batman film or/television show. In this first animated film based on the animated series, the creative team does both a prequel and a sequel to the show as it introduces the characters of Andrea and Phantasm. Which both have an enormous impact on Bruce Wayne's journey to becoming Batman. And the character of Andrea helps us understand Bruce Wayne a little better. And know him a little better before becoming Batman.<br><br>Inspired by Frank Miller's \"Year One\" comic and Tim Burton's 1989 Batman film, Burnett/Dini/Timm create a magnificent Batman movie and a great movie as well!<br><br>4(****)out of 4(****)stars<br><br>AN ANIMATED MASTERPIECE!!!!","user":"TheMan3051","rank":[47,54]}]