[{"title":"Not just a fine work","rating":10,"date":"24 November 2004","review":"I spent over a decade watching and reviewing films for my job at MTV Europe. Even before and since I voraciously consume cinema of truly all kinds as a passion, I don't care about genre or even subject, only that a work is honest, inspired, effective. As with any art, of course. <br><br>I saw The Indian Runner at its Cannes film festival debut in 1991 and left the Grand Palais screening speechless. Where to start? We often hear about the usual checklist of script, acting, cinematography, editing, music, and so on, and of course all are stellar here. But it's the magic of the mix of all these and so many more subtleties about the experience of this film that makes it not just a terrific, achingly beautiful thing, moving, illuminating, but, I believe, having revisited it so many times over the last thirteen years (like so very few others among the hundreds seen once), one that is important and bound for a belated re- positioning as a cinematic gem in the history books of the future.<br><br>Cassavetes is clearly a major force behind this in the best possible way; he'd have stood up and applauded the way Penn took his spirit, his openness and gave it a more cinematic scope, color, pace, size, without compromising his own direct gaze on the human condition. Before this film Cassavetes' huge contribution had not been properly picked up, the baton in some respects still dangling where the late auteur had left it years back. In Indian Runner Penn points the way forward for this bold tone of cinematic voice (in a way to my mind even more clear than in his subsequent The Crossing Guard and The Pledge). The moment at the start of the film when Joe's dead victim's father begins singing a work song at the police station still stands out as the revelation that this movie had its own palette. I could go on and on but I'd probably bore... even ME (like Frank, no?).<br><br>What struck me in Cannes and forever since is how this massive achievement was so overlooked by other critics and then the public. I felt I was simply out of step but never wavered in my commitment to the film as a private cause which I'm pleased to say everyone I've talked into seeing it has agreed during exciting post-mortems. Also, as with great works in general, I notice it only gets better with repeated visits over the years. And seeing the comments about it on this site has cheered me up no end. I'm not alone!<br><br>It's one thing for a film to endure; another entirely for it to emerge from obscurity years after it was made and left aside. That very trajectory, likely, it seems now, for The Indian Runner, is going to become one of its many very special qualities. Conversations about its simple and complex strengths are gaining a new dimension with this look into what it was that made it so inaccessible to most of its viewers for its first decade and what it is and will be that finally unmasks the gem that until now was so oddly neglected. Suddenly it's on DVD and people are discussing it. Could it be good taste or whatever you call this kind of appreciation is on the rise? Wow. Reasons to be cheerful indeed. <br><br>And for those of us who first came across Viggo Mortenson here, imagine how itchy it made us sitting through his fine but passionless Lord of the Rings!<br><br>Here's to poetry, vision, and honesty about pain and life without judgment. Lord knows it's rare these days.","user":"john-1302","rank":[54,65]},{"title":"Best movie iv'e ever seen","rating":5,"date":"5 May 2004","review":"This film has deeply affected me.  The first time I saw it I had tears pouring down my face throughout.  The second time I found myself really getting into it.  Sure, you know what it's about from the other reviews. We ask ourselves why Frank isn't content with life.  Most of us would feel closer to Joe, but Penn enables us to sympathise with this wretched character of Frank.  He's not a nice guy.   Myself; I am happy that this film is not necessarily a period piece.  It takes a while for you to understand in what context the film is set.  What makes this movie so good is that is underlining message remains ambiguous.  This is certainly a film that will stand the test of time.  It's not about the nation of America during the 70's.  It's about the relationship of two brothers, and one just so happens to have come back from Vietnam.  It could have been set in 2003 and the underlying message would remain the same.  The talent of Penn is in that he never once blames Frank's actions on the Vietnam War.  He was a bad kid before the War.  I urge everyone to see this movie. You will either sympathise with the characters and understand the underlying message or you will not.  I also urge you to open your mind before you see the movie, and if you don't understand it.  Think about it for a while longer.","user":"youcancallmesusanifitmakesuhappy","rank":[52,63]},{"title":"Brilliant directorial debut from Sean Penn featuring superb performances from Morse and Mortensen.","rating":15,"date":"15 January 2003","review":"Few actors who move over to directing have done so with as much success (artistically) as Sean Penn. John Cassavetes, a major source of inspiration to Penn, did so in the past, and Penn is one of the very few to follow in his footsteps who could possibly end up rivalling  him as a maker of complex and haunting character based dramas. 'The Indian Runner' was Penn's directorial debut, and it is an extremely impressive achievement. Inspired by Springsteen's song 'Highway Patrolman' (from his underrated 'Nebraska' album from the early 1980s), it is a slow, almost hypnotic look at two brothers with totally different world views and their attempts to come to terms with each other. The siblings are played by David Morse ('Twelve Monkeys') and Viggo Mortensen ('The Prophecy'), and both performances are superb, and career high points. Mortensen is now a major movie star due to his involvement in the 'Lord Of The Rings' trilogy, but for his best acting work look no further than here. The rest of the movie features a first rate supporting cast which includes Valeria Golina ('Rain Man') and Patricia Arquette ('True Romance') as the brother's respective love interests, and veterans Dennis Hopper ('Blue Velvet') and Charles Bronson ('Death Wish'), testament to the respect Penn has in the acting community, I'd say. Bronson, who plays the father, puts in an uncharacteristically subdued performance, one of his best ever. Also keep an eye out for Benicio Del Toro ('The Usual Suspects') in a small cameo, and Penn's mother Eileen Ryan ('At Close Range'). This movie may not be to everyone's taste, but I was knocked out by it. Easily one of the most overlooked dramas of the 1990s. Highly recommended.","user":"Infofreak","rank":[38,47]}]