[{"title":"Mastery of storytelling","rating":9,"date":"22 August 2001","review":"Satoshi Kon is the extremely talented director who brought us the memorable Perfect Blue (1997) and perhaps changed the face of Japanimation forever. Here at his second feature film, ripe after a four years hiatus, he makes the wait well-worthed with a cunning cinematographic experience that literally plunges the viewer into the wonderful world of film.<br><br>Using the animation medium to push storytelling in film to new levels of effectiveness, Kon tells the story of a legendary actress who's life and career sparks the interest of documentary director Genya Tachibana.  Along with his trusted cameraman, he undertakes to interview the now very old Chiyoko Fujiwara, spotlight actress in her hay days, and together they delve into her past.<br><br>This session blooms into a captivating narrative, blending elements of her life with roles in some of her films, and exploring her great search for love.  The movie thus explores the personal challenges and self-realization that one undergoes through the different stages of life.  It does so with the help of probing questions from Genya and is not shy of being epic in scale, passing seamlessly through fictional eras and time periods, superimposing characters, persons and life teachings.  The fusion of reality and fiction is truly remarkable, and Satoshi Kon distinguishes himself from conventional dogmas in that aspect.  For him, sky is the limit.  He is only limited by his boundless imagination.  The result is something fresh and spectacular.  From the beauty of the vibrant images to the backdrop of lyricism and poetry, the movie explores life with us... and comes up with interesting conclusions.  You will have to see and judge for yourself, but I promise that, if nothing else, it will have made you think.<br><br>I was privileged to attend the world premiere at the Montreal FantAsia Festival and was greatly honored to be blessed with the incarnation of the director himself, in flesh and bone.  He strikes me as a very intelligent, very mature and wise man.  There is an old woman in the film who says to Chiyoko: \"I love you and I hate you more than you can imagine.\"  I asked him the significance of that and he simply answered: \"I do not really know what it means.  I know that I understand many things that I did not 15 years ago. I just tried to project myself in the future, and thought of what I might be able to bestow to a younger inexperienced person like myself, with this increased wisdom that comes with life's trials and tribulations.\"  I admit I am paraphrasing just a little (my japanese is not that good in any case), but that's essentially what he said, and this confirmed my belief, based on the artistic genius and masterful integration of complex thoughts into a simple, flowing, living piece, that this man is gifted.  He has an incredible depth and is able to conjure it up to the surface and present it to us.  One cannot but delight in his work and wait again for more enlightenment...<br><br>A suivre...","user":"christian94","rank":[60,62]},{"title":"Our loves and our youth.","rating":10,"date":"9 June 2009","review":"Without a doubt, Millennium Actress is a masterpiece. Fluid scene transitions, vibrant colors, and gorgeous pieces of music not only allow, but forces the viewer to feel empathy for the character. I admit, I was teary eyed for several scenes in the movie, it's cinema at its best.<br><br>The story, like Kon's Perfect Blue, is told in a way where reality and fantasy are blurred and joined. Unlike Perfect Blue, the truth and fiction are not important matters in Millennium Actress. Perfect Blue was a movie about an event. Millennium Actress is a movie about an emotion: Love. That search for the long lost love is the only thing that keeps one young. Chiyoko, the main character, travels through centuries and millenniums to find it, but always fails. Yet her zealous passion for this quest is what ultimately keeps her young, even at death.<br><br>Watching this film, we will all be reminded of that one passion we've had during our youthful days and be reminded about our quest to fulfill that passion. Maybe that feeling will return after you've viewed this movie. Maybe you'll regret certain actions and decisions that you've made in the past. But that's of no importance. Because at that point, the film has done its job and you'll feel a little warmer inside.","user":"wassapjy","rank":[27,28]},{"title":"A complex and beautiful film","rating":9,"date":"12 January 2004","review":"In some films, the dividing line between subjective and objective reality is very tenuous. In Satoshi Kon's poetic Japanese animé film Millennium Actress, it is almost non-existent. When the Ginei studio is about to be razed, documentarian Genya Tachibana decides to make a documentary about the studio and its greatest star, legendary actress Fujiwara Chiyoko who disappeared from public life more than thirty years ago. After finding an old key that belonged to the aging actress, he travels to her secluded mountain retreat with his assistant Kyogi Ida to interview her for the documentary. When Genya gives her the key, it unlocks a stream of memories that transports us (along with the cameraman and interviewer) to a different reality that allows us to relive one thousand years of Japanese history using the medium of cinema. <br><br>As she tells her story, Chiyoko recounts her birth at the time of the great Kanto earthquake of 1923 and how she was discovered as a child actress despite her mother's objection that she is too timid. She reveals how a strange young painter, a political outcast whose name she never discovers, gives her a key and then disappears, telling her that the key is \"the most important thing there is\". Chiyoko's dream of reuniting with her lover keeps her alive and becomes what her life is about. Unfolding more as emotion and mood than narrative, Kon takes us on a surreal journey through a series of films within films in which Chiyoko attempts to find her lost love, playing a princess, a ninja, a geisha, and even an astronaut. In the process, we witness a seamless tableau of Japan's history: the medieval period in the 15th and 16th centuries, the era when the Shogunate was in power, the Meiji period when the Emperor was restored, the Showa period before World War II, and the post-war occupation and recovery. <br><br>The line between events of Chiyoko's real life and scenes from her films is blurred and the film is difficult to follow on first viewing. To complicate matters even further, the interviewer, Genya, is cast in many roles in which he becomes almost a comic figure as Chiyoko's rescuer. Though the film is often puzzling, the search to recapture the defining moment in Chiyoko's life strikes a universal chord and we identify with her desperate quest. Though I found the ending somewhat unsatisfying, Millennium Actress is a complex and beautiful film and Susumu Hirasawa's hypnotic musical score adds to the blend of warmth, emotional power, and magical realism. Kon sees life as a big romantic movie full of melodrama, humor, and longing and seems to be saying that while there is often confusion between who we really are and the shifting roles we play in life, what remains constant is our longing for love.","user":"howard.schumann","rank":[40,43]}]