[{"title":"I had a very good time watching this movie","rating":8,"date":"22 November 2004","review":"Personally I had a very good time watching this movie, but it seems like I'm one of the few. I don't know why, but the voters on this website always seem to hate comedies if they aren't from the hand of some cult-director. Does a movie always have to be a great drama or an exciting thriller? Not if you ask me, but I'm only one of many over here of course.<br><br>It's true, the movie is a little chaotic from time to time. It isn't an overproduced Hollywood movie that takes itself too serious and that's exactly where its charm is in it for me. I loved to see Brad Pitt as the clumsy criminal who always is able to do something wrong. The same for Julia Roberts as his hysterical girlfriend and James Gandolfini as the gay hit man who has kidnapped her. <br><br>I know, it's not done to say that you liked to see Julia Roberts play a certain role and Brad Pitt can never be good as a comical actor... Well, perhaps it is time for some people to broaden their minds. Don't believe what everybody says, watch it for yourself and form your own opinion. I liked it and I give it an 8/10.","user":"philip_vanderveken","rank":[120,148]},{"title":"A chaotic, messy but brilliant commentary on relationships","rating":12,"date":"12 October 2004","review":"I'm genuinely surprised at the number of people who disliked this movie. Perhaps because it was a bit disjointed, chaotic, uneven, unpredictable and even incoherent at times. And that's just why I loved it. It's life. Yes, it's the crazy, seedy, shady lives of these people (the main characters being Pitt's and Roberts' characters), but at least it's honest... and darned funny. I thought the self-deprecating jabs at how most Gringos view Mexico/Mexicans were priceless. Raul!! The grainy flashbacks had my sides splitting.<br><br>People, this is a classic melodrama told in today's yucky, dirty, gritty, ugly times. A beautiful (if you look closely) story that doesn't take it self seriously at all. This is anything but formula Hollywood hype. It is a genius inside-joke that sandbagged most of the people hoping to come out and see a Pitt/Roberts version of Sleeping in Seattle or some similar chick-flick dreck.<br><br>When is enough enough? Never.","user":"paddyolguin","rank":[76,95]},{"title":"Not as bad, as people say.","rating":7,"date":"2 January 2002","review":"Being quite a harsh critic myself, I was surprised to see how badly recieved this film was. Admittably the film tended to drag a little length and was missing something to make it a little more entertaining.<br><br>\nBut the film has some interesting characters, situations, and scenery to make this film highly watchable. Pitt and Roberts are good, but have put in much better performances elsewhere. And spend the majority of the film apart. I suspect the main criticisms of this film are mainly to do with high expectations: in having Pitt, Roberts and the Sopranos guy in. But in summary, an alright film - but nothing special.","user":"Andy C-2","rank":[14,15]}]