[{"title":"Oh the neighbors, the neighbors!","rating":8,"date":"2 March 2018","review":"A terrific dark tale by Alex De La Iglesia with a phenomenal Carmen Maura. The film is a crazy relative of Polanski's \"The Tenant\" and Donovan's Apartment Zero\" It takes the sinister neighbors from those two masterpieces and creates something unique. Tension and laughter alternate and commingle in a constant state of euphoria. Compelling viewing for lovers of dark comedies, this is one of the most surprising and entertaining I've seen in a long time.","user":"marcosaguado","rank":[28,28]},{"title":"Beware: Hungry Tenants","rating":12,"date":"12 February 2012","review":"I watched Alex de la Iglesia's 'La Comunidad' on a whim and was pleasantly surprised. This black comedy farce may bear some resemblance to films like 'Le Lòcataire' and 'Apartment Zero' but the only similarity is that all three films take place in an apartment building and the story involves the tenants. While the aforementioned examples are far darker in tone and disturbing to an extent, 'La Comunidad' is more satirical and comic.<br><br>To get the minuses out of the way, the first half is quite slow but I'd suggest that one be patient because what follows is both chilling and funny. The suspense is brilliantly maintained.<br><br>Jorge Guerricaechevarría and Álex de la Iglesia have penned a fine screenplay. The sometimes-subtle sometimes-not-subtle humour works on various levels. The laughably pathetic tenant characters are a delight and the protagonist Julia is easily recognizable. The score fits well and the lighting is exceptional. The art direction deserves special mention. The apartment building in itself is a character and the interiors look authentic.<br><br>Carmen Maura is remarkable as her performance is completely natural. Plus, she looks very hot too. The actors playing the neighbours do a terrific job too.<br><br>In the end, I'm pleased I saw this as I can always enjoy a good black comedy.","user":"Chrysanthepop","rank":[17,17]},{"title":"One of the best films from Spain!!!!","rating":18,"date":"18 March 2003","review":"This movie was great, i really loved the character development,the way director Alex de la Iglesia used its shots and gave us this dark comedy with suspense filled film. Now as a part of my vast collection this film stands as a great film from its director, i was (and still am in some sort of way) in love with his \"Day of the beast\" now his latest La Comunidad is a great film that shows us a fun story about people ways into big time money. I hope you have a chance to see it and have a blast about its crazyness and its fun ways to entertain all ages. The starwars freak in this film was so funny, i just love his scenes. I want to give it a good 10 out of 10 on Spanish cool horror/suspense films.","user":"rogelioduron","rank":[22,26]}]