[{"title":"Good, but not great","rating":12,"date":"12 February 2001","review":"Anthony Hopkins gave an impeccable performance.  However, the material he was given to work with was not as good as Silence of the Lambs.  In fairness, perhaps there was no way it could be.  In SOTL, he was somehow more foreboding, more of a sort of superhuman monster; in Hannibal, he's more accessible, a guy you meet on the street.  Maybe it was impossible to maintain the mystery of Lecter that we saw in SOTL because of the risk of doing a rehash.  I'd give the overall Dr Lecter character a 9 of 10 in this film, vs. a 10 of 10 in the last one.  Not quite as good, but still very good.<br><br>Starling's character, on the other hand, fell flat in this film.  In SOTL, Foster perfectly portrayed Starling's flat surface with a turbulent depth; in Hannibal, there was nothing under her surface.  Foster's Clarice evoked feelings of sympathetic grief, Moore's Clarice evoked nothing.  I do not necessarily blame Moore, this could be due to writing and/or directing. Obviously, though SOTL focused mainly on Starling's character, Hannibal focuses on, well, Hannibal.  Still, that's no excuse for what was done to Starling.  Her character gets a 3 of 10.<br><br>The story was much weaker in Hannibal than in SOTL.  It almost seemed like an excuse to present us with the characters, rather than a story in and of itself.  Still, it had no other major flaws, so it gets a 6 of 10.<br><br>Now, there's another category I'll call the shock factor.  It's different than ordinary gore, it's... creative gore.  The sick, disgusting depravity we expect to see and like to see in this type of film.  I can't go into detail without spoiling it, but I'll have to say it goes even beyond what I expected.  Do not watch this film if you are squeamish or dislike gore. There isn't a lot of gore in the film, but what there was, was... concentrated.  Shock Factor, 10 of 10.<br><br>Overall I give the film an 8 of 10.  Very well done with a few weaknesses, well worth watching.","user":"webgrunt","rank":[170,228]},{"title":"A lot to chew on","rating":5,"date":"5 December 2003","review":"Many people were disappointed or flat-out disgusted by Ridley Scott's follow-up to \"The Silence of the Lambs.\" I can certainly understand their disgust, but I preferred this to its Oscar winning predecessor. It had been a long, long time since a movie made me turn from the screen in genuine horror, and I didn't believe it was even possible. \"Hannibal\"'s deservedly controversial climax took me by surprise. It may have been revolting (okay, it was very definitely revolting) but so few movies these days have any lasting impact and I appreciate that this one did. And it is, after all, about a cannibal, is it not? At some point in a series of films about a man of Lector's inclinations, we should see him at work. <br><br>Of course, the horror of the climax is effective because the rest of the film is so good. Hopkins, a little chunkier than the last time we saw him in this role, positively exudes menace especially in his final confrontation with Pazzi (an excellent Giancarlo Giannini whose sad eyes make him the most sympathetic character in the film). Then there's Gary Oldman's Mason Verger who is so contemptible that he never elicits sympathy no matter how he suffered at the hands of Lector. And Julianne Moore is an improvement over Jodie Foster who I have always believed was overrated.<br><br>\nBut the best thing about \"Hannibal\" is the atmosphere in which Scott and his team envelop the story. A cloud of dread hangs over this film, and beautiful Florence, Italy, though still beautiful, appears haunted by Lector's very presence in the city.","user":"bwaynef","rank":[140,210]},{"title":"Hannibal","rating":9,"date":"22 May 2006","review":"I like this film a lot, but of course it suffers - as all sequels do - by comparison to its predecessor, in this case 'Silence of the Lambs' The main reason for having a sequel at all was to showcase again the character of Hannibal Lecter, a monstrous creation everyone wanted to see more of after the first film. It could have bombed badly therefore if writer and actor had let us down by failing to catch the magic again. It was after all a decade after the original was made. But they don't, and Anthony Hopkins turns in another delicious performance as the man with the evil intent cloaked in inestimable, menacing charm.<br><br>Julianne Moore drew the short straw in having to re-create the Clarice Starling role that had been so memorably played by another actress. She does well in my opinion, but inevitably we keep thinking 'where is Jodie Foster?', and this lends her portrayal a lack of credibility which is entirely unfair. Gary Oldman's Mason Verger is suitably loathsome and manages to make Lecter seem almost like the hero in their battle of wits. If there is a weak link, Ray Liotta's Krendler seems a bit misplaced.<br><br>The direction deserves special mention. The lush, beautiful settings are mocked by the horror of what is happening in them and the perfectly-selected atmospheric music stayed in my mind long after the film had ended.<br><br>Once again, the film lacks realism, but as with the original, it doesn't matter. Of course things like this don't really happen - but so what? It's a film. Get over it! I was prompted after seeing it to read the books, and the right decision was made in changing the ending of this story from that written by Thomas Harris. <br><br>We were subsequently treated to another look at Lecter in a decent prequel movie, 'Red Dragon,' but I will not be alone in hoping that some day we will see yet more of him in a further instalment. Unlikely I suspect - but not impossible.","user":"tohu","rank":[71,108]}]