[{"title":"Great film. Make sure you watch all 3","rating":8,"date":"23 February 2020","review":"While not as coherent as the first film, The Matrix Reloaded is still great fun and attempts (but doesn't always succeed) to add some smarter ideas into the mix along with action that has to be seen to be believed.","user":"MR_Heraclius","rank":[37,39]},{"title":"One of the greatest action movies of all time!","rating":9,"date":"15 November 2015","review":"The Matrix Reloaded (2003) is the greatest action movie of all time and a good sequel to the original The Matrix (1999) that I went to see it with my mom in the movie theater in 1999 when the movie come out. I love this movie even if some people are saying is not that good I still love it and love The Matrix Revolutions as well. It is one of my personal favorite Keanue Reeves movies. <br><br>Granted things get bigger and a little darker. The visual effects, go way overboard and the CGI does not bleed in well with the live action. Nonetheless Reloaded is a fun film to watch. The visual aspects blows out of the water. The soundtracks to this movie are pretty good and they are fine of mix songs to the movie. <br><br>The sequel to successful original movie is an awesome film. Not just a visual wonder but the ambitious storytelling that demands more than your average action film. A wonderful follow up to the outstanding original and a great precursor to the inevitable finale. While it doesn't strictly adhere to normal flow of most films, that is one of its best traits. While it has its flaws, it makes for a fantastically entertaining experience. Not for those who don't want to think too much. <br><br>It is a good sequel who doesn't deserve to be hated for it. Keanu Reeves and all other cast crew did outstanding performance on their works. Nearly 12 years later have passed since no movie has come close to tapping into the myth, world and action that was created in Matrix Reloaded. For fans of action movies, the story can be as straight forward as you wish it to be, following the path of Neo as man kinds savior. For those who wish to dive deeper, you can see how far the rabbit whole really goes because the amount of hidden references, back plots and information in this movie is immense. For a film The Matrix fans this wouldn't be an action movie without some action. There's plenty of it, and it's perfectly done. The CGI effects creating more Smiths were astonish, were cutting-edge for the time, and still look great (whoever said differently below is simply incorrect) -- even if they're completely commonplace today. Insane action ensues as a well done plot follows. <br><br>Neo (Keanu Reeves) saving Trinity on the end of the film and than he collapses in to come was awesome and great ending with a cliffhanger so that viewer keeps guessing what will happened next, in the next movie that was just great. The Neo vs Smith fight is just excellent as is the Freeway chase. More Smiths (Hugo Weaving) I think Hugo Weaving did a perfect job as Agent Smith in this follow up sequel. I love his character and I think he is one of the best villains ever. Neo vs a 1000 Smiths fight scene just blew me away/ the martial arts were outstanding action sequences. Overall it is a good film at least it is for me. I will never understand the hate for the sequels for it. At the same time, the complexity of the storyline, and the unexpected plot twists left many viewers a little (or a lot!) confused. We'll admit that it's taken several viewings for us to figure some things out, and that there are still lots of pieces we haven't put into place. Some answers, we're sure, will not be revealed until Revolutions, and some will never be revealed. There are no words for Hugo Weaving except badass!<br><br>Neo, Morpheus, Trinity, and the rest of their crew continue to battle the machines that have enslaved the human race in the Matrix. Now, more humans are waking up out of the matrix and attempting to live in the real world. As their numbers grow, the battle moves to Zion, the last real-world city and center of human resistance. That is the basic main plot and it is good so I am giving 9/10 for been a good action movie. It is one of my personal favorite Keanu Reeves movies.","user":"ivo-cobra8","rank":[112,132]},{"title":"Good but the heavy plot and Shakespearean tone makes it more difficult for itself","rating":2,"date":"2 June 2003","review":"News reaches Zion of an army of sentinels amassing on the surface many miles above the city, clearly preparing for an invasion.  While the city prepares for a counter attack on the sentinels, Morpheus pins his hopes on Neo and obeys orders to stay with broadcast range to allow Neo to meet with the Oracle.  Neo meanwhile is plagued with dreams of Trinty's death in the matrix.  When the Oracle does contact Neo, she tells him of The KeyMaker  the man who can get him access to the very source of the matrix.  A rescue mission is mounted which is complicated by not only the agents, but rogue programmes and the return of a `freed' Agent Smith.<br><br>Many reviews (here and in the press) have tended to go one way or the other. Some have lavished praise on this film claiming it as a milestone and even better than the original, others have hated it and laid into it heavily. I'm not wanting to sit on the fence but I do feel that both camps have valid points and that the answer is somewhere in the middle.  The main reason I found it hard to get into this film was the heavy tone it has now developed. Seemingly the same bug that the Star Wars movies have caught (taking themselves too seriously) the matrix appears in danger of getting in a bad way.  The plot here is quite straightforward and not as twisty as the original  however it is delivered as if every line of dialogue was profound.  This really sucks the life out of the film as it is not profound but rather borders on the pretentious at times due to it's delivery.<br><br>I suspect that this was spotted and so the film is unnecessarily cluttered with minor characters that detract from the central tale.  And so screen time is given to Link and his wife as well as a seemingly pointless speech from Merovingian.  This makes it feel baggy and also slightly unsatisfactory when these strands appear to go nowhere but only fill time.  Also the plot is a little too complex (all this rogue programme stuff) and isn't delivered in a user friendly way  it is not always clear what the significance of certain things are until later in the film and even then it is uneven. However both these criticisms will be countered if, in Revolutions, these strands are brought together and minor characters in Reloaded are shown to have a bigger input.<br><br>On the plus side the action is very good.  I must admit that it wasn't as exciting as the original mainly because the plot wasn't as involving to me  I need a good story generally to get into the action side.  However in honesty the action still looks great and is a real leap forward from the Matrix  a great blend of wire work and visual effects.  Occasionally the special effects are slightly wanting (in Neo's fight with Agent Smiths it is clear when it is a visual effect rather than the real thing) but these are minor quibbles compared to some sterling work.  The car chase on the freeway may be a very easy way to get an action scene but it still works very well and is exciting.  The only downside to it is that I felt that an action scene should have been part of the end of the film  instead the `big' scene occurs a good 20 minutes before the end of the film.  The actual cliff-hanger itself doesn't really work and it could have done better with a general downbeat ending like Empire Strikes back had  did it think I needed a reason to watch part 3?  I'm already there!<br><br>The acting suffers from the same problems as the plot  it is all too heavy. The clearest way this is seen is in Fishburne.  In part 1 he was very good, especially when he exposed Neo to the matrix with a mix of playful wit and serious touches when they were needed.  Here in part 2 he seems to be mistaken that he is playing Othello again.  Watch him speaking to the crowds at Zion, he really plays it like he is playing Moses or something.  In fact all through the film he is very heavy  even compare his big fight with his previous face-off with Smith in part 1, there he was human and vulnerable here he is more like a rock and less fun for it. Moss is also serious but she was in part 1 too so it's not so noticeable.  Reeves is good and at least adds some humour but he plays it very serious again.  The additions add colour but are mostly distractions.  The support cast in part 1 were merely there, here the film feels it has to develop them to make a rich tapestry but the end result is it feeling too stretched.  It's hard not to watch Pinkett-Smith and feel that her character is more to do with the video game than the film itself.  Happily Hugo Weaving is fun and is back with his old sneer, while the twins are good value despite having minimal plot impact.<br><br>Overall it was always going to be hard to follow up the first film.  There the plot was gripping and it is difficult to make the growth of Neo's powers as interesting as his discovery of them was.  I enjoyed the film but just felt that the almost biblical significance that it tries to give itself was it's undoing  luckily the action and style was it's salvation.  Hopefully I will watch Revolutions and see how Reloaded works better in hindsight. Without that knowledge, many of the plot strands appear to be left loose. If I watched this as a film by itself then it would be irritating  if the conclusion to the trilogy can get back to the enjoyment and tone and spectacle of the matrix at it's best then this will be a much better film in company of it's brothers.  Far from perfect but I don't see how anyone can totally write this film off.","user":"bob the moo","rank":[163,206]}]