[{"title":"A solid genre movie that builds a good atmosphere and tension across the 90 minutes even if it isn't anything that special","rating":5,"date":"5 July 2006","review":"Sean Murphy and his crew are the top salvage experts in the land (well, sea). They have just completed one big job when a pilot, Jack Ferriman, comes tot them with a ship that he has spotted in remote, international waters. It hasn't responded to distress signals and it seems fair game if Murphy will give Jack a cut and let him come along. Murphy accepts and they set off. The fact that the ship doesn't show up on radar doesn't ring any alarm bells with the crew, who board the ship to find a deserted vessel ripe for the pickings. However she has sustained damage and has days before she will sink forever. Diver Maureen spotted a young girl on board is only the first of several strange things to occur and soon the crew find themselves in deeper than they planned.<br><br>Opening with a scene so brutal and gory (made all the worse for me knowing it was coming) that I literally couldn't watch, this film had me hooked at the same time as having me worried that this would just be a big gore fest with nothing else to it. Indeed this is what I had heard, having only read negative reviews for this film. However for the majority it avoids this by being spooky, atmospheric and engaging. The plot isn't anything amazing but it does the job. Many reviewers have said it turns rubbish in the final thirty minutes but to me it was still effective even if it did resort to genre by being gorier and more obvious. It will never win any awards for originality or anything else but it is an effective genre movie that avoids the b-movie schlock of stuff like Deep Rising.<br><br>Because it is mostly about atmosphere, the cast are only so-so as they are given little to do. Byrne is a good presence but is slumming it so obviously that he should probably have had a slot in his character's back with a studio exec feeding it every few minutes of screen time. Margulies is better as she has more to do and is a more interesting character; she can work at this level and does. Eldard has some terrible lines but does OK with Urban. Washington is better than this but is quite interesting and has a good screen presence. Harrington plays it so obviously that it is hard not to see him coming, which was a bit of a shame. The direction is good and the design/feel of the film is probably better than the material deserves  nicely building up tension and atmosphere as it goes.<br><br>Overall then a good genre movie. Better than b-movie stuff, it uses the gore sparingly for the most part and builds up to things well. In the end it may go just where you expect it to and not do anything that special but I found it quite enjoyable for what it was and, in the words of the advert, does exactly what it says on the tin.","user":"bob the moo","rank":[41,49]},{"title":"Love Boat' out of hell!!","rating":6,"date":"16 February 2004","review":"I'm rather pleasantly surprised after seeing Ghost ShipI expected it to be a lot sillier, more dumb and inferior than it actually is. Still a long way from being a good horror film but a step in the right direction, to say the least. Cast and crew paid attention to building up a horrifying atmosphere instead of attacking the audience with lame and violent killing scenes. That's an effort that gets my appreciation. The vicious opening sequence is professional horror a scene that grabs you by the throat and demands your complete attention and curiosity for the rest of the movie. The high quality level is held up a little while longer but unfortunately it loses his grip during the second half. For as long as the mysterious, deserted ship is portrayed as a complete riddle, the film is fascinating, interesting and beautifully shot. As soon as a few plot-aspects are clarified, Ghost Ship turns into a mediocre and predictable thrillerI'm convinced that, with a slightly more intelligent script, this could have become one of the better horror-thrillers since the new Millennium. Now, it's only regarded as a reasonable and decent effort that lacks a bit of talent. Nonetheless, the settings and decors make it worth watching. The graphic decorations aren't overused, so it remains a beautiful experience to observe at least once. Gabriel Byrne is acting far below his normal standards and yet he's still great! All the other cast-members are pretty uninspired and forgettable. I'd describe Ghost Ship as a nice waste of time. If you have the opportunity, I advise you to search for an 80's horror title called `Death Ship'a terrific piece of trash of which Ghost Ship borrowed a lot of ideas.","user":"Coventry","rank":[87,116]},{"title":"The Soul Collector","rating":8,"date":"11 November 2003","review":"The savage team of a tug is ready to rest after the transportation of a platform. When they are celebrating in a bar, the plane pilot Jack Ferriman (Desmond Harrington) offers them the chance of rescuing a passenger vessel vanished in the oceans in 1962. Captain Sean Murphy (Gabriel Byrne), Maureen Epps (Julianna Margulies) and the rest of the crew, tempted by the possibility of a great reward, decides to risk one more rescue operation before going home. Their greed leads them, of course, to a ghost ship, where they are spooked and threatened by ghosts. One of them, a little girl, shows Epps what happened to the passengers and crew during the voyage in 1962. A horrible unraveled secret will haunt the rest of the crew. <br><br>Ghost stories usually take place in a haunted house. This one is in a passenger ship. This movie is not in the same level of 'The Others', 'The Shining' or 'The Sixth Sense', but is also good film. The screenplay play has some clichés and is predictable, but the cast, direction and special effects work well. Probably, the fans of romances will not like it, but those who like a ghost story will appreciate this film. My vote is eight.<br><br>Title (Brazil): \"Navio Fantasma\" (\"Ghost Ship\")<br><br>Note: On 02 June 2017, I saw this film again.","user":"claudio_carvalho","rank":[84,118]}]