[{"title":"A really atmospheric and enjoyable thriller","rating":16,"date":"16 February 2004","review":"Over a year after he was suspended during an investigation into a shooting when he was undercover, Nick Tellis is given an opportunity to redeem himself by joining an investigation into the murder of another undercover cop who's partner is a suspect.  Nick and Henry Oak team up, investigating each other as much as the actual murder.  They follow a lead from a junkie but begin to uncover clues that point to police weapons getting onto the black market and the suggestion that someone within the Detroit force is in bed with the junkies.<br><br>A small film with big budget problems gets picked up at Sundance and has Tom Cruise's name added to it as executive producer.  Thank goodness that this film got bought up and received a bigger audience.  It is a shame that more people didn't go and see it but it still isn't bad for a film that was almost shutdown mid-shoot due to budget problems (ie, they didn't have any!).  The plot is a good cop thriller in the mould of the old 70's thrillers where the lines between good/bad, right/wrong are pretty blurred. The focus of the film is the mcguffin of the tunnel - what happened, who did what? but the film is much more than that, it has themes of family and scenes of violence and tension that move everything forward.  It is easily one of the best films released in 2003.  It manages to take a genre that is seen so often and make it feel fresh and enjoyable.<br><br>As both writer and director Carnahan is brilliant.  His script is well written and has plenty of tough dialogue but it is the feel and look of the film that is brilliant.  On top of the toning used to taint each scene (the job is mostly washed out blues, family scenes are reds but gradually lose their taint over the film) the film uses other tricks.  The framing of shots are different for each character and it really adds to the film.  If you like this film it is worth hunting out the DVD just for the extras, Carnahan talks in detail about the reasons behind the composition of some shots and it is impressive to hear and understand his thought process.<br><br>The cast are excellent, although really the film hinges on the two leads. Liotta is as good as he has ever been.  It would be easy to just accept his performance as a `powerhouse' but it also has sensitivity, emotion and layers to it.  Patric is also good, his themes with family and past are brought up well in a performance that accepts that he is very much secondary to Liotta.  Support from Busta Rhymes is minor but he plays it very well, not at all like many hip hop stars who do movies to enhance their bling-bling gangsta personae.  There are other solid support roles too, but it really is Liotta and Patric's film.<br><br>As a cop thriller this harks back to darker days and it is very effective, with a solid plot and a good sense of the unknown until some solid twists near the end.  The film has an impressive style to it and, while Liotta deserves the praise, the success and feel of this film are down to the skills of Carnahan as both writer and director.  With his talented and underpaid crew he has turned a good script into a great film.","user":"bob the moo","rank":[68,75]},{"title":"Good movie, great actors","rating":7,"date":"21 August 2004","review":"Seeing that Ray Liotta is one of my favourite actors, I was pretty sure this movie was going to be very good. And it is a good movie. It is dark, well acted and it tells a story of how far some people are willing to go to honour the memory of a friend and colleague. One cop, Nick Tellis, suspended after a stray bullet hits a pregnant woman, is put on a murder investigation of an undercover cop. He teams up with bad ass cop Henry Oak and together they try to solve it. But if everything as it seems? Both lead actors in this movie, Jason Patrick and Ray Liotta, do a great job. You really get the feeling like you are in the movie instead of just watching it. Most of all, the characters are believable and that is so important for a movie like this. If you like thrillers with a dash of action and drama, you will enjoy this movie. I know I did. I rate this movie 7/10","user":"udeaasykle","rank":[62,69]},{"title":"Good, tough and gritty cop film","rating":7,"date":"30 March 2003","review":"This film reminded me of those cop films from the late 60's and 70's like \"The Seven Ups\" and \"The French Connection\" but this film is really dark and dirty. One thing that stands out is the cinematography that I'll describe later. Film opens with a cop chasing a suspect into a park and when shots are fired at one another a pregnant woman gets hit. Month's later the force wants him back to work with an older cop and investigate a cop killing. Jason Patric and Ray Liotta star in this film and its directed by Joe Carnahan who employs a very good visual style to an already familiar story. The film has a dark and gritty look about it that suggests a touch of \"Film Noir\". One scene in particular stands out and its the one where Patric and Liotta are in a cafe having coffee and talking. The scene is dimly lit with both characters seemingly in shadows. It suggests that both are shadowy figures and have something to hide. Carnahan creates a dark mood for the film that I found very effective. Nothing seems forced here and it creates an indelible aura of bleakness. These are the streets that these cops work in everyday and you can understand some of the personality flaws of the characters. Ray Liotta stands out here and its the type of performance that reminds us why Scorsese cast him in \"Goodfellas\" in the first place. He gained 25 pounds for the role and along with Tom Cruise and a host of others helped produce this film. All the hard work paid off and I hope studios remember him with more work. He's always been a terrific actor and its hard to forget those eyes of his when he sinks his teeth into a role like this. They're was some talk of him being nominated for an Academy award in the supporting category which would be wrong. Both he and Patric are in the film about the same amount of time. They are both starring roles and its not a supporting performance. Some people complained of the dark edge and mood of the film but thats exactly what I liked about it. Well photographed and very well acted, this is a solid cop film that people should check out.","user":"rosscinema","rank":[38,43]}]