[{"title":"\"Mess with the Fro...you got to go!\"","rating":7,"date":"2 August 2010","review":"I first saw \"Undercover Brother\" on cable a few years ago and since then it's become one of my favorite comedies of recent years. Though it's basically a \"blaxploited\" version of the \"Austin Powers\" concept, \"Undercover Brother\" is funny enough to be enjoyable on its own merits.<br><br>As the film opens, we are filled in on the ongoing battle between the black community and a super secret organization known as \"The Man,\" who works tirelessly to negate African-American influence on the world at large. Fortunately, the black community has its own underground group, known as \"The B.R.O.T.H.E.R.H.O.O.D.\" created to undermine The Man's plans to \"Whitewash\" the world.<br><br>Eddie Griffin stars as Undercover Brother, a funky '70s throwback hero with a huge Afro and platform shoes, who drives around in a pimped-out Caddy performing acts of Kung-Fu derring-do to aid the African American cause. Normally a lone wolf, he is drafted into the B.R.O.T.H.E.R.H.O.O.D. when a black war hero (Billy Dee Williams)'s plans to run for President are derailed by a mind control drug designed by The Man. Now rather than run for the White House, he runs a nationwide Fried Chicken chain instead. Ably assisted by fellow B.R.O.T.H.E.R.H.O.O.D. agents Sistah Girl, Conspiracy Brother, Smart Brother, and \"Lance\" (Neil Patrick Harris in a hilarious turn as the lone white member of the group -- he got his internship through -- what else? -- affirmative action), Undercover Brother infiltrates The Man's organization to destroy the plot, though he nearly becomes a victim of their most potent weapon, the gorgeous Denise Richards, aka \"White She-Devil\" (whom \"The Man\" calls \"Black Man's Kryptonite.\") along the way.<br><br>I have seen a lot of discussion on IMDb about this film being \"racist\" towards whites, but to be honest, I found \"Undercover Brother\" to be an equal opportunity offender, with no stereotype about blacks OR whites going un-skewered. The cast is excellent, especially Dave Chapelle as the eternally paranoid agent \"Conspiracy Brother,\" and the always welcome Chi McBride as the long-suffering \"Chief\" of The B.R.O.T.H.E.R.H.O.O.D. Denise Richards looks amazing in a white leather catsuit (her catfight scene with \"Sistah Girl\" is worth the price of the DVD all by itself), and oddly enough, even though I usually find Eddie Griffin and Chris Kattan (who plays The Man's flunky, \"Mr. Feather\") quite irritating in other films, their shtick totally works in \"Undercover Brother.\" Fast, funny, and an utterly silly good time, \"Undercover Brother\" is -- in the words of its hero -- \"Solid.\"","user":"MetalGeek","rank":[21,21]},{"title":"Undercover Brilliance!","rating":10,"date":"3 September 2009","review":"These days, we're all used to the weekly deluge of movies adapted from novels, comics and other mediums, but 'Undercover Brother' – released in 2003 - was one of the first movies to be adapted from an internet source. The film is based on a series of internet-based short animated episodes, also called 'Undercover Brother'. The adaptation is successful (with some scenes lifted directly from the animated shorts), focusing on racial stereotypes while paying homage to spy movies and seventies blaxploitation films.<br><br>Eddie Griffin is brilliant as the confident, swaggering, yet good-hearted title character, who is called into the B.R.O.T.H.E.R.H.O.O.D organisation to stop The Man after he kidnapped presidential hopeful General Warren Boutwell (Billy Dee Williams) and brainwashed him to sell fried chicken, with an aim to wipe out the black community.<br><br>One of the strengths of this movie is the cast. Aside from the aforementioned Griffin and Williams, there's Dave Chappelle as Conspiracy Brother, in a role not dissimilar to his stand-up routine (in this case a good thing), Gary Anthony Williams (who provided many of the voices in the original internet series) as Smart Brother, Aujanue Ellis as the headstrong Sistah Girl, the backbone of the group, Neil Patrick Harris (before his breakout roles in the 'Harold and Kumar' movies and 'How I Met Your Mother') as the B.R.O.T.H.E.R.H.O.O.D's white intern Lance, Chris Kattan as Mr. Feather, the underling to The Man who is secretly enchanted by black culture, Denise Richards as White She-Devil, described as 'the black man's kryptonite', and a cameo from James Brown, the Godfather of Soul.<br><br>While there is a lot of silly humour in this film (like the 'Austin Powers' trilogy) and broad racial stereotypes – black people like fried chicken and hate mayonnaise – the black director Malcolm D. Lee, and the predominantly black cast ensures the black characters are never mocked for a cheap laugh.<br><br>The soundtrack is a highlight, with a lot of songs from the blaxploitation era, some Michael Jackson and more modern urban music. Even if you're not a fan of this genre of music, it's still fairly catchy.<br><br>Though it's very much a comedy (at times very silly but never stupid), the film has a lot to say about how ridiculous racial stereotypes are. The role of Boutwell as the possible first black president is relevant to modern viewers (even though the film's only six years old) with the presidency of Barack Obama only a few months old.<br><br>Overall, 'Undercover Brother' is a hilarious, silly film, which pays homage to the spy and blaxploitation genre and explores racial stereotypes without ridiculing them for cheap laughs.","user":"Donatien3","rank":[19,20]},{"title":"Underrated Comedy","rating":8,"date":"4 June 2006","review":"An Afro-American organization, the B.R.O.T.H.E.R.H.O.O.D., is in permanent fight against a white organization, The Man, defending the values of the black people in North America. When the Afro-American candidate Gen. Warren Boutwell (Billy Dee Williams) has a weird behavior in his presidential campaign, the Undercover Brother (Eddie Griffin) is hired to work undercover in the white organization and find what happened with the potential candidate.<br><br>I do not recall the last time I laughed so much with a comedy. \"Undercover Brother\" is one of the most hilarious and silly comedies I have ever seen, and very underrated in IMDb. The story is a big joke with the North American racism, both white and black, with very funny situations \"à la Austin Powers\". I believe this is the major point of the plot, keeping a neutral position and ridiculing and satirizing racism of Caucasians and Blacks. Dave Chappelle is the funniest, but Chris Kattan, Eddie Griffin, Aunjanue Ellis, Denise Richards and the rest of the cast are also amazingly funny. I did not understand the joke with mayonnaise, but I believe that usually Afro-American people do not like this dressing, or at least there is a clichés about in USA. There are many other jokes related to the North American culture that are impossible to be understood by an overseas viewer, but anyway I loved this movie. My vote is eight.<br><br>Title (Brazil): \"Undercover Brother  Com a Cor e a Coragem\" (\"Undercover Brother  With the Color and Courage\")","user":"claudio_carvalho","rank":[48,56]}]