[{"title":"A stunning, visual feast","rating":12,"date":"12 June 2001","review":"At the risk of sounding overly bombastic, \"Moulin Rouge\" is the best film I've seen all year, perhaps the best one I've seen in over a year.  It is operatic in the best sense of the word, being at once massively outlandish and deeply personal.  It is clear that a lot of people took career risks in choosing this film, and although \"Moulin Rouge\" may not rack up a huge box office, I think this film will become a classic alongside his other two films \"Strictly Ballroom\" and \"Romeo + Juliet.\"<br><br>In the showing of \"Moulin Rouge\" I saw last week, at least 5 people walked out.  At the same time I heard audience members audibly gasping at the films visuals and talking back to the screen.  The source of these strong reactions?  Baz Luhrmann's confidence in his garish cinematic vision and the commitment his actors have in him.  The cast fills their roles with relish, even when the entire scene totters on the edge of overkill--but oddly enough, it is the focus that sets \"Moulin Rouge\" apart from other films these days.  Whereas some actors sleepwalk through their roles as they collect their paychecks, everything about \"Moulin Rouge\" is done in earnest.<br><br>This movie is the anti-\"Pearl Harbor,\" because instead of being a hodgepodge of market-tested ideas, \"Moulin Rouge\" presents a bold vision and dares the audience to accept or reject it.  I, for one, accepted it with delight.  A telling comparison: Luhrmann has Nicole Kidman and Ewen MacGregor sing the film's love song.  Very daring.  For \"Pearl Harbor\" Michael Bay chose Faith Hill.  Very safe.  Too safe.  Can you imagine Ben Afleck belting out \"There You'll Be\"?<br><br>\"Moulin Rouge\" glitters with such bold decisions.  It is a sumptuous feast for ear and eye featuring gorgeous costumes, intricate sets (Nicole Kidman's boudoir in a gigantic elephant is a case in point), and outlandishly choreographed dance numbers are paraded with frenetic relish.  And the music, the MUSIC!  As you probably know by now, Luhrmann has thrown into his period piece a collage of musical snippets from, among many bits, \"The Sound of Music,\" Madonna, The Police, and Elton John.  In most cases, no one song gets performed without intersplicing.  Witness Luhrmann's audacity: the opening number includes a melding of Labelle's \"Lady Marmalade\" with Nirvana's \"Smells Like Teen Spirit.\"  And here's the spooky part: it works.<br><br>The entire movie plays this way, and for the most part it works.  Most surpising is that \"Moulin Rouge\" has a solid, deeply sincere emotional core. Although the film professes to be about love, I'd add that it is equally about loss.  The Moulin Rouge is a playground where adults pretend they are children with the added spice of sensuality.<br><br>All the performances are excellent, but the hidden gem is Jim Broadbent as Zidler.  Broadbent for years has been doing majestically understated supporting work, from \"Brazil\" to \"Enchanted April\" to \"Topsy-Turvy.\"  In \"Moulin Rouge\" he manages to be both repulsive and endearing.  His spirited rendition of \"Like a Virgin\" is classic.  Too bad it's not on the soundtrack.<br><br>Expect to be overwhelmed by \"Moulin Rouge\" in the most unexpected, delightful ways.  It will make you wonder why other films can't or won't dare to be that bold.","user":"Gouda-3","rank":[307,410]},{"title":"The most original and groundbreaking movie of recent history","rating":10,"date":"3 February 2003","review":"I have seen Moulin Rouge at least 25 times.  I think it is the most extraordinary movie of my generation and breaks every limit set by the industry.  I have heard all the traditional complaints...people didn't like the music, the editing was too swift, or it wasn't \"their taste\".  Moulin Rouge took a risk.  A risk films like A Beautiful Mind and Shakespeare in Love don't.  It risked by being controversial.  To make a likeable movie isn't hard, follow the Hollywood mold and stick in a few attractive actors, some bland dialogue and viola you have a film.  Moulin Rouge was made knowing that not everyone would like it, but knowing everyone would at least appreciate it for its artistic ingenuity.  Visually it is superb, an indulgent feast for the eyes with every breathtaking, artistic scene. Everything about it is over the top, every scene more stunning than the next, and as it continues your heart becomes more and more intertwined in the love story.  The editing in the Roxanne scene rushes through your body and is the most incredible of any movie in history.  Nicole Kidman and Ewan McGreggor are the most passionate on-screen couple; entirely convincing as their voices meld them together into one.  Never has a movie done what Moulin Rouge did.  It realized that the world of film is only being represented in one small way, whereas Moulin Rouge uses a camera and screen to make something bigger and more extraordinary than has ever been made before.  It pushes against the confines of convention and leaves you breathless.","user":"emandal_maggs","rank":[454,634]},{"title":"I am in love with \"Moulin Rouge\"!","rating":10,"date":"31 August 2001","review":"I have not ever felt for a movie the way I do about \"Moulin Rouge.\"  It is not just a movie...it is a cinematic experience the likes of which I have never before seen. The story, the music, the acting, the visual imagery strikes emotion in me I never before thought possible from a film. It is without a doubt the most brilliant piece of cinematic art I have ever seen. It is dizzy, maddening, beautiful, and heartbreaking!  The music is rapturous, and Ewan McGregor and Nicole Kidman's voices compliment each other and the story perfectly.  This movie takes its story to a mythic level and surrounds these two star-crossed lovers with music and imagery that simply will take your breath away.  The story is grand, huge, and operatic, as is the music. The brilliant score skillfully weaves many modern, popular songs, and rescores them as the libretto to this grand opera. There are some images in this film unlike anything you have ever seen. And the performances are absolutely incredible, particularly Nicole Kidman's.  I truly felt for these two people, and truly felt that they were in love.  My heart broke into a million pieces for them every time I saw this movie, and I've seen it 8 times. It's an absolutely breathtaking, visionary, masterpiece that did not get the credit it deserved by American critics, who seem to complain that every movie is the same. Yet when an original, daring, shocking film like this comes along, they don't know what to do with it. But then again, this really is not just a film. No mere film could strike me the way this one has, in a way that reaches to the very fibres of my being in a way only \"The Wizard of Oz\" ever has before. Yes, the story is sad, but what  a journey it takes you on! A journey I will be sure to repeat over and over and over again.","user":"morningperson_2000","rank":[281,392]}]