[{"title":"Cows aren't funny","rating":2,"date":"6 April 2004","review":"This is the most dispiriting Disney release since the dark days of the Black Cauldron.  The laughs were strained and ill-timed.  While the string of quality Disney movies carefully crafted humor aimed at adults as well as children, this one relied almost exclusively on belch jokes and inappropriate (not to mention inane) sexual innuendo.  Seemingly undecided whether it was to be Emperor's-New-Groove-goes-country or South-Park-in-the-West, it miserably fails its audience both young and old.<br><br>While Judi Dench and Jennifer Tilly struggle in vain to carry the film with some attention to character, it never ceases to amaze that Roseanne -- purportedly a former stand-up comic -- has such leaden delivery and a complete lack of comic timing.  Obviously, unless she is bellowing at another character, there is simply no way that her talented co-stars can create any rapport.  From her first words on screen, Roseanne sinks this movie like a stone.<br><br>A total waste of some talented co-stars.<br><br>Please, please, let this be the final death rattle of the Eisner era.  It is bad enough that Michael Eisner has ruined practically every character through badly-thought-out and badly-realized straight-to-video sequels, but to completely destroy the bedrock of the Disney empire -- animated theatrical releases -- is unforgiveable.<br><br>This one only gets a 2 out of 10.","user":"mjaxelrad","rank":[29,36]},{"title":"An absolute disgrace","rating":3,"date":"7 August 2007","review":"The 44th animated Disney \"classic\" is just one among other good examples of how Disney went downhill during these last years.<br><br>It's sad to see how Disney (which made so many timeless classics) declined that much. What happened to the traditional hand-drawn classics? All this CGI stuff only ruined Disney! \"Home On The Range\" isn't the worst Disney movie ever, but it is side by side with their worst movies.<br><br>This movie has lots of irritating moments, but the worst of all is a scene in a bar - one of the most ridiculous scenes in a movie! The \"humor\" of this movie isn't the classic humor which is really funny. What we see here is nothing but annoying, unconventional and pointless modern humor.<br><br>This movie has some nice backgrounds of the Old West, but only a few. The characters are very ugly in general and so terribly designed that it's impossible not to feel annoyed by them.<br><br>Stupid situations, terrible designs, very low picture quality, awful animation and boring songs are more weak points of this disgrace.<br><br>The characters in general are annoying. The only characters I liked were the little yellow birds, the little pigs and Rusty the Dog. But even these characters can't be compared with the beloved and legendary Disney characters of the great classics from the past.","user":"Atreyu_II","rank":[29,39]},{"title":"Ineffective, almost humourless, and not so well written Disney fare","rating":5,"date":"7 January 2009","review":"It has been nearly five years since the release of this recent traditionally animated Disney flick, made in a CGI-dominated time, and I definitely didn't even hear about it at the time of its release. It clearly didn't turn out to be a box office smash, which is probably why I never heard about it (unlike \"The Incredibles\", the hugely successful CGI-animated feature released the same year), and I don't think I knew about it until I saw it mentioned in a book about animated films a couple years ago. After seeing \"Home on the Range\", I can definitely see why it tanked.<br><br>In the old west, Maggie, Mrs. Calloway, and Grace are three cows, all with very different traits, who live on a dairy farm in Nebraska called Patch of Heaven, owned by an elderly widow named Pearl Gesner. Pearl owes a lot of money, which she unfortunately can't pay, so it appears she will soon lose her farm, and it will be auctioned off! So, the three cows decide to set out to try and save their home. They must track down an outlaw, a cattle rustler named Alameda Slim, who uses a false identity to claim many properties in the state, and hypnotizes cows with his yodeling! On their adventure, they meet others on the same mission, to try and stop Alameda Slim, and due to the different traits of the three cows, they don't always get along, with conflict between Maggie and Mrs. Calloway, which obviously won't make it easier! <br><br>Others have already mentioned the lacklustre plot of this film, and I'm going to have to agree wholeheartedly. The plot pretty much completely failed to interest me, since it's very simple and forgettable, and the real lack of humour doesn't help. I only rarely found amusing moments, and kept a straight face for almost the entire thing. For example, there's some weak slapstick, which may appeal to kids, but probably not many others. I found that the funniest parts involved Alameda Slim's dimwitted nephews, parts such as them not being able to recognise their uncle after they've seen him put his simple disguise on, but they are very minor characters. Not only is the plot forgettable, so are the gags and most of the characters. Basically, the film was put together fairly simply, and probably could have been more focused. I found myself indifferent to pretty much everything about it, and I'm sure I'm not alone.<br><br>It looks like this film marked the end of a very long era, the era of traditionally animated theatrical Disney movies, which began in 1937 with \"Snow White and the Seven Dwarfs\" and went on with the company long after Walt Disney's death in 1966. Through those decades, so many classics were made in the franchise, so it's unfortunate that they couldn't finish with a much more noteworthy picture. Instead, they finished with a dull one, one which is probably much more appealing to kids than adults, unlike probably most of them, which can be fun for all ages. \"Home on the Range\" reminds me a lot of \"Rock-A-Doodle\", a 1991 animated film from Don Bluth, and not one of his more popular efforts. Both are lacklustre animated films with anthropomorphic animals, ones which are basically for the kids, and I've personally found to be very unmemorable.","user":"Electrified_Voltage","rank":[16,20]}]