[{"title":"A Terrific Movie For Teens of All Ages","rating":8,"date":"6 September 2000","review":"I thoroughly enjoyed \"Bring It On\". The film's brisk pacing was  perfectly suited to its theme, thanks to director Peyton Reed, the writing smart, sharp, and consistently and authentically funny,(as well as, at times, genuinely thought-provoking)thanks to writer Jessica Bendinger, and the acting solid all around. I also liked \"Bring It On\" for what it didn't have-alot of tired, cliched boy-girl relationship stuff, and/or gratuitous sex/nudity. The opening dream/cheer sequence was a moment of sheer, brilliant comic/satiric movie magic, and later, when the professional choreographer shows up to help the Toros out, he almost steals the show. But what impressed me, perhaps, most of all about \"Bring It On\" was the wonderful chemistry between the two beautiful-and talented-young female leads, Kirsten Dunst and Eliza Dushku.","user":"kljucec9","rank":[48,56]},{"title":"Quite enjoyable","rating":8,"date":"7 September 2000","review":"This movie was extremely enjoyable and I recommend it. The characters are not annoying for the most part, and I especially enjoyed seeing new faces Elisa Dushku (Missy) and Jesse Bradford (Cliff).  They have screen presence and should be in front of the camera for many years to come, especially Elisa, who is really very beautiful.  When you look at her, there's so much there, unlike most actresses whose faces do not say anything.  You can tell there is alot going on in her mind just by her face. <br><br>The screenplay is intelligent and very funny and aside from a slow stretch or two, I really liked the movie. It is not like \"Clueless\" or anything else, which of course is a good thing. <br><br>One of my favorite scenes is when Cliff and Torrance (Kirsten Dunst) are brushing their teeth.  Its probably a throw-away scene and there is no dialogue, but it was really great, for me at least.","user":"Boyo-2","rank":[46,55]},{"title":"Energetic, Well-Scripted Fluff","rating":20,"date":"20 February 2001","review":"\"Cheerleaders are dancers who have gone retarded,\" says Sparky, the modern dance-influenced choreographer who from $2000 dollars a pop teaches cheerleaders the mysteries of Fosse-inflected \"happy fingers.\" Bring It On, which was a surprise hit in the fall of 2000, clearly believes that cheerleaders are far more  than hoofers gone to seed. Despite the frequent jokes at their expense in the film, Bring It On shows cheerleaders are spirited, athletic, graceful, and most importantly, relevant to the 21st Century. Colorfully shot, attractively cast, and snappily written, Bring It On is hardly a great movie, but it's perfectly appealing for most people and I'd guess that the millions of cheerleaders and former cheerleaders nationwide will get a lot more out of it.<br><br>The plot is simple. It's like Rocky. Or Varsity Blues. Or any other sports movie you've ever seen. New captain of the five time national cheerleading champions Toros, Torrance (Kirsten Dunst) is shocked when the new girl on the squad (Eliza Dushka), a gymnast, tells her that all of the routines that made the squad famous were stolen from an inner city school in East Compton, two hours up the coast. Determined to prove that they can do it themselves, the Toros go through a fairly short journey to self-empowerment. There's a pounding bass line, lots of teens in short skirts, some fun flipping, and a lesson about being true to yourself and believing in others.<br><br>The film also takes on any number of myths about cheerleaders. Are male cheerleaders all gay, or do they just like grabbing girls' rears? The answer, of course is a little from column A and a little from Column B. Are cheerleaders all airheads? Well, the issue of whether or not these girls go to class is done away with in two minutes at the beginning of the film. From that point on, education, books, and homework are never mentioned. Any occasional signs of intelligence are held up to ridicule, though these \"sweater puppets\" are all quick with a witty retort, so they must have something going on upstairs. And finally, is cheerleading a sport? Well, this film comes out firmly on the side of yes.<br><br>For all of its verve, Jessica Bendinger's script is too reductive for the movie to be taken very seriously. The white girls are obviously upper scale and spoiled. Naturally the white girls don't have any sass at first and naturally they borrow it from their African-American neighbors. The black girls are supposed to be poor. Not that that's really depicted in this day-glo colored world.<br><br>In fact, through the wonders of Hollywood Central casting, the squad from East Compton actually looked even more racially homogenous than the \"Buffys\" from San Diego. This is an inner city high school that has a cheerleading squad featuring a dozen girls with identical light complexions and straight hair. The racial assumptions at work here would be offensive if the movie placed any premium on reality. Instead, as directed by Peyton Reed, everything is colorful, glossy, and easy on the eyes. The intricate cheerleading routines are mostly shot from strange angles or awkward close-ups to make it impossible to tell if the cast is actually doing any of the cheering stunts at all.<br><br>When Kirsten Dunst makes good small movies (see The Virgin Suicides or Dick), nobody goes to them. So I suppose it's fitting that this movie was a smash. She's always an entertaining screen presence and for now she's still young enough that it isn't ridiculous for her to keep playing high school characters. How her career progresses as she matures remains to be seen. The rest of the cast seems like they were picked from the set of a WB series. Now since I kind of like a number of WB series, I don't mean this as an insult in any way. The Warner Brothers network has proven a good training ground for attractive young women to read catchy dialogue and everybody in Bring It On seems very skilled with the zingers. And as the aforementioned Sparky the choreographer, Ian Roberts is just hilarious and his scene is easily the funniest part of the movie.<br><br>In the end, Bring It On is fairly satisfying. It's also amusing to note the strange directions that this movie is able to stretch the limits of the PG-13 rating in terms of language and certain forms of implied sexuality. But that's neither here nor there. Bring it On gets a not-to-be-ashamed-of 6/10 from me.","user":"d_fienberg","rank":[51,63]}]