[{"title":"A highly successful French thriller by Mathieu Kassovitz...","rating":10,"date":"10 May 2004","review":"...who is famous for his intelligent films about social issues; such as 'La Haine'. The suspenseful story, IMO often wrongfully compared to David Fincher's 'Se7en' because of its seemingly similar thematic elements, is set in the French Alps, in the fictitious towns of Guernon and Sarzac. The marvellous scenery contributes a lot to the overall mysterious atmosphere of the film and is an ideal background for the movie's convincing cast. This is especially true for the leading roles which are portrayed by two of the most talented French actors: Jean Reno and Vincent Cassel.<br><br>The plot is based on a novel by Jean-Christophe Grange who, together with director Mathieu Kassovitz, also developed the screenplay. With the book being quite complicated due to its many carefully intertwined lines of action, a lot had to be simplified, altered or simply cut out, a well-known issue with adaptations. Unfortunately, many of the novel's explanatory scenes were omitted, so that ,you end up with a film which is not boring but quite confusing', as main actor Vincent Cassel puts it correctly. The following is a basic plot summary that intends to spoil as little of the story as possible:<br><br>Commissaire Pierre Niemans is called to the remote university town of Guernon to solve a gruesome murder case in which the victim - the university's librarian - was brutally tortured and mutilated. Neither the university officials nor the students prove to be too helpful during the investigation and Niemans soon gets the impression that there is something very suspicious about the whole situation. Meanwhile, Commissaire Max Kerkerian investigates the desecration of a grave in Sarzac. Soon it turns out that the seemingly unrelated cases are strangely connected with each other and, after a second corpse is found, the two very unlike cops team up to discover a long kept secret. This knowledge eventually gets them into life-threatening situations, the most deadly of them marking the end of the movie, which is set on top of a huge, snow-covered glacier.<br><br>The acting is simply excellent: Jean Reno portrays Niemans as a surly, reserved but brilliant professional with an attitude that often offends the people around him, even if he does not mean to. Vincent Cassel is Max Kerkerian, a quite lively character, sharp-witted but at times lacking self-control and totally unconventional in his methods (the book even mentions him being a former car-thief). The third leading role, Fanny Ferreira, a glaciologist working at the university and the one to find the first corpse, is portrayed by Nadia Farés. Her enigmatic character is more involved in the mystery than it seems.<br><br>The action is greatly enhanced by the spectacular panoramic views and camera trails used for the location shooting, even though the opening scene, where the camera follows Niemans' car as it approaches the first crime scene, is obviously a rip-off of Stanley Kubrick's 'The Shining'. One scene shows Niemans and Ferreira, the scientist, descending a glacier, a dangerous shot for which huge cranes had to be transported to the glacier in order to secure the actors. The wonderful score was composed by Bruno Coulais, who managed to provide each scene with the appropriate musical background.<br><br>As stated before, major changes were necessary to transfer the complex novel onto the screen. The outcome was that many viewers felt puzzled by the movie's abrupt, confusing and seemingly illogical ending, as much is left out in the film where the book provides extensive background information. This is where the movie's biggest flaw lies. Other alterations include the renaming of Karim Abdouf (novel) to Max Kerkerian (film). While his characteristics remained more or less the same, it was the author's original intention to include a police officer of Algerian origin in the story. The characters in general are darker in the novel where Niemans even kills a hooligan before the actual story begins. The conspiracy revealed by the cops is larger and was also one of the aspects which were simplified for the movie.<br><br>All in all, one could complain that some of the action scenes look rather out of place, like Kerkerian's fight with two skinheads or the obligatory car chase later on in the film. The 'mismatched-cop scenario' is not too innovative either, but since it is depicted in such a unique way, it would be unfair to dismiss it as a cliché. While I can only reiterate that it may be difficult to completely grasp the movie at once, it is not at all impossible to follow the storyline as some have claimed. ,The Crimson Rivers' is definitely a great movie in its genre, featuring spectacular camera shots and an excellent cast and is in this vein well worth a visit.","user":"decibelio","rank":[63,80]},{"title":"I'm talking about Demons, and you talk to me about the police?","rating":8,"date":"26 July 2007","review":"Mathieu Kassovitz's film featuring the incomparable Jean Reno (The Professional) and Vincent Cassel (Ocean's Twelve, Ocean's Thirteen) is a thrill ride that never stops.<br><br>The French countryside with the spooky houses is a feast for the eyes. Thierry Arbogast's (The Messenger: The Story of Joan of Arc) camera made this entire film a joy to watch. The scenery was complimented by the music of Bruno Coulais (The Chorus).<br><br>But, it was Jean Reno that brought me to this film. His Commissioner Niemans was just what I expected from him. He has a way that makes the perfect cop. That is not to dismiss Callel's Lieutenant Kerkerian, who was a perfect partner.<br><br>The story was definitely creepy with some graphic scenes of tortured bodies, but it was not off putting. It was essential to the story, which really had some extremely interesting twists and turns.<br><br>Niemans and Kerkerian prevail, of course, but it was the journey that was so satisfying.","user":"lastliberal","rank":[24,30]},{"title":"Stunning thriller, good story and characters, marred by badly thought-out finale","rating":12,"date":"12 August 2001","review":"Echoes of \"The Boys From Brazil\" and \"Name of the Rose\" in this fast-moving, gorgeously-set (small alpine towns near Grenoble) French thriller, which has a really nasty conspiracy in a closed community as an underlying subplot. Two interleaved storylines involve two detectives in towns 100 km apart. Young, feisty Kerkerian (Cassel) is investigating the desecration of the tomb of a young girl. Meanwhile, supersleuth Niemans (Reno) is drafted in from Paris to assist local gendarmes in solving a nasty torture-murder of an academic at a small private University. More bodies turn up, suspects become victims, and eventually the paths of the two cops cross. Visually utterly beautiful, particularly the College, the Library, and the glacier/ice tunnel scenes. Characters strongly drawn and sympathetic. One pretty straight fight scene, little dwelling on active perpetration of violence, but much lingering on the unpleasantly gory aftermath. This is particularly the case with the rather gratuitous opening sequence, which is overdone relative to the rest of the film. My main cavil involves the poor ending, where a last-minute surprise twist creates more loose ends than it ties up. Nevertheless, so watchable that this one gets 9/10.","user":"agc110","rank":[23,29]}]