[{"title":"I'm writing because I have changed my stance on the film, I like it and think you may too","rating":10,"date":"7 July 2004","review":"I took the time to write this because I had to come back to IMDB and change my original score of a 6 to a 10. After trying to understand the German, Spanish, and Chiricahuan (Indian) to correctly represent it in English, I noticed how beautiful this film was as stills and in motion.  The dance between actors, frame focus, and camera movement has never been clearer to me than after my task.  Every shot composition is meticulously gorgeous.<br><br>\nThis movie really needs to be viewed as a whole, judged only after it is complete and not during the film (which I am always guilty of).  At first I faulted the film for quickly covering a lot of ground, for seemingly bizarre transitions between plot stages, and short time spent on/in many interesting characters/situations.  After watching the film once, and not liking it all that much, I thought about it (as I wrote a better subtitle file) and realized how much better everything is \"after the fact\" - after watching it. Some people may say a movie is bad if it requires 2 viewings to appreciate and that is valid.  A good memory and a moment to reflect after the credits roll should change any viewers negative opinion on Blueberry as entertainment, a story, a depiction of the classic comic book, a movie, and finally art.  <br><br>This movie is definitely worth a purchase as an adventure tale similar to great comics.  <br><br>It is not an Action movie.  It is like the Indiana Jones series rather than the films, giving more story of a larger time period than more action in a short time period.<br><br>The Animation is CG that represents the mystical ~cacti induced Indian experiences.<br><br>Pay attention to the beginning credits.  Better yet, watch them again after watching the movie.  They will make a lot more sense.<br><br>Thank you for taking the time to read this.","user":"shaidarharan","rank":[85,110]},{"title":"Kick-ass character-based western with awesome visuals","rating":10,"date":"21 March 2005","review":"I cannot believe the low ratings this film has gotten. It's got something for everyone, and not only that, but it's the German chocolate cake for genre-lovers. I have a list of reasons why people SHOULD love this film: 1. Michael Madsen. He's the best thing about this movie. He plays it subtle but he's got bad-ass pouring out of him. He's got everything a villain needs: a quality of making you feel guilty for loving him, a presence that blows you away and keeps you intimidated, and most of all, he's got his own agenda. Not only is he a great villain, but a deep, complex character as well.<br><br>2. Everybody else. Vincent Cassel, Julliette Lewis, and Djimon Hounsou especially. Cassel plays Blueberry as a likable hero, although, properly and meaningfully, bugs the audience on the factor of \"he just hasn't learned yet\". Julliette Lewis, though isn't given much, well, makes what she's given seem like a lot more than it is. I'm sure a lot of her wound up on the cutting room floor, though. Djimon Hounsou has an amazing presence as well. He's responsible for one of the most memorable scenes in the film. The rest of the cast played their roles respectively too. Colm Meaney played a good friend and was more than just the \"comic relief character\", although delivers comic relief when it's needed. Eddie Izzard loses the German accent occasionally, and plays the easy-to-hate coward in a, well, easy-to-hate way. But by the time he delivers his \"men are monsters\" line, you know that's all changed. Temeura Morrison add more to being the sage (yes, that's a pun) than just being the proper race. He's got the being-in-the-know thing down.<br><br>3. CGI at its best. Though your purist self may usually be screaming at CGI, you will be screaming \"To Hell with practicality!\" by the end of this film. Marc Caro was behind the special effects department, and you truly will be convinced that Jean-Pierre Jeunet has been wrongfully taking his credit the whole time.<br><br>4. The music! We've got our smörgåsbord of properly American West flavors with a beautiful orchestra on top of that.<br><br>5. The balance. It was in everything. From pleasing us with proper Western blood and violence while still maintaining a lack of senseless gore. The dialogue being able to remain practical and not drawing attention to itself while still keeping a Tarantino-esque flare along with it. The French art dousing the film while keeping a western attitude as its proper foundation. The cinematography of making you feel dirty and sweaty but while still making you free within the film's beautiful scenery. The pure originality this film radiates while still not forgetting what genre it's in. Even the balance between our love and hate for every single character for this film.<br><br>Here are the only possible reasons I can imagine someone not being able to like it: 1. Genre-haters, this ain't for you.<br><br>2. The \"why-in-god's-name-did-Phil Collins-betray-me\" purists, this film may be a tad too original for you. This film definitely defies the laws of tradition 3. Impatient sitters. Yes, it's true the first act was slow and slightly confusing. But it makes the rest all the stronger.<br><br>4. People who hate French-style heavy-handedness. Yeah, they didn't exactly need the \"eyes of the eagle\" thing. There's also this really bothersome scene where they have flowers blooming cut in, just to show \"growth\". That's actually probably the only problem with the picture actually. There's many instances where they use symbolism to state what the viewer already knows.<br><br>5. People who hate Michael Madsen. Well, there's probably enough else in this movie for you to like about it. But after you watch, I'll probably be at your house already making sure you experience a slow, horrible death.<br><br>Bottom Line: Heartbreakingly UNDERRATED. But usually with underrated films I can understand why I'm the only one who liked it, but this film seems to have a whole lot anybody of any bias can dig. In my bias, it all traces back to the balance: this film is fun and re-watchable while at the same time complex and original.","user":"xordu1","rank":[89,119]},{"title":"The most unusual western I have ever seen","rating":10,"date":"12 May 2007","review":"Wow! That is all I can think of....wow!!! I have never been glued to the screen like I was with this movie. It is strange and unusual and there were times that I wasn't sure what was happening or why, but the visual effects are unlike anything I have seen before. I found the scenery gorgeous and breathtaking. I watched with interest to see just where it was filmed. The cast is very good. The main character I am unfamiliar with but there are a lot of good character actors in this movie. Geoffrey Lewis and his daughter Juliette play father and daughter. Ernest Borgnine is cast as \"Rolling Star\", a sheriff confined to a wheel chair. All of the characters are strong and well acted and the computer generated sequences are majestic and at the same time, eerie.<br><br>If you are like me and find it hard to sit through the predictable movie, you will want to put this movie on your \"must see\" list. I recommend it highly!!","user":"karen_g32","rank":[35,47]}]