[{"title":"What a pleasure it was to see Philip Noyce use his visual storytelling skills on a humane story.","rating":9,"date":"22 December 2001","review":"This powerful film follows the journey of three young aboriginal girls who are taken from their family and forced to assimilate into an empty culture by the white settlers of Australia. This is known as the \"STOLEN GENERATION\", a dark period in Australian history which the current prime minister of Australia refuses to say sorry for the past atrocities. But this is not to say that this film preaches or manipulates emotions for political gain. No! It just tells the story with powerful images that allows the viewer to enter the torment of the stolen generation. Dialogue is minimal as our heroes are taken from their family and driven to the other side of Australia. But their will and instinct to be with their strong culture has the girls escape the camp prison and follow the rabbit-proof fence back home. The rabbit proof fence was built down the centre of Australia to contain the plague of rabbits from entering farm land. It was this white-man built fence that lead the girls back home.<br><br>As for all journeys, they are filled with internal conflict and confrontations with strangers. These confrontations with certain people show the diverse group of settlers in Australia. Not all were ignorant but most were repressed and abided to the harsh cultured laws. For instance, the girls arrive at a farmstead and are given clothing and food by a white woman. The motherly instinct of this woman understood that the girls had to be with their mothers. But at the same token the farm woman could not jeopardise her own family by looking after the girls or else it would have brought trouble. It was wonderful scenes like these that was played out visually without having to dumb it down with words. As human beings we understand these actions and need no explaining.<br><br>The most interesting relationship was the one between the aboriginal tracker in search of the girls. He could sense the persistence of these girls to get home by making it difficult for him to track them down. This he respected and slightly dropped his guard. Once again, a string of images tell of this distant relationship between tracker and girls.<br><br>The images also became so strong during the scene when the girls were taken from their mothers in a horrific manner. I doubt there will be a dry eye during that scene. This hooks you in as you then become the spirit of their journey back home.<br><br>Only by the performances of the girls do these scenes work because they are so natural and heartfelt. Children who overplay their role just become cute but those who underplay and rely on emotions of  the situation deliver a powerhouse performance that a trained actor may sometimes find difficult to achieve. At first the name of a high calibre actor - such as Kenneth Branagh - in an Australian film warns you where the limelight will shine. But Kenneth just took a step back and become another important confrontational figure in the journey.<br><br>A bonus is the music  by Peter Gabriel. It is a mixture of his famous trademark of world music infused with that of the Aboriginal. It soars and plays with the emotions, maybe a little too much but when you are dealing with a thousand year old culture that has music as its central universe, then you may be able to understand that the overpowerful music is just an extension of that.<br><br>Congratulations to all who were brave enough to bring a project of this strength to the screen. And for those who may wonder how I saw the film prior to its release, lets just say I was lucky enough to be at the right place at the right time. And No! I'm not tied to the project in any way because I don't sell out that easily.","user":"DukeEman","rank":[55,63]},{"title":"True and important film!","rating":7,"date":"25 February 2003","review":"This is a very powerful film from the wonderful Phillip Noyce (The Quiet American) and its based on the shameful history in Australia where aborigine children were taken by force from their families and tribes to camps and taught to be servants. In the film 3 sisters escape and venture to walk 1,500 miles back to their tribe. The title refers to a fenceline that stretches for thousands of miles and the girls follow it. The wonderful aborigine actor David Gulpilil (Walkabout) plays a scout that is tracking the girls and Kenneth Branaugh plays an officer that is in charge of the whole operation. I guess the main flaw in the film would be the middle where most of the walking takes place and the film really slows down but its not a major complaint. The 1,500 mile trek is expertly paced and the film is by no means dull. Rather, its fascinating! The real footage that we see at the end of the film is so powerful that the whole essence of what you have just watched becomes even more devastating. This is more than just an important film, its a documentation of an ugly and shameful part of Australian history. A must see!","user":"rosscinema","rank":[72,85]},{"title":"A Scathing Attack on Racism","rating":2,"date":"2 December 2002","review":"\"And miles to go before I sleep/ And miles to go before I sleep\" -- Robert Frost<br><br>Set in Western Australia in 1931, Rabbit-Proof Fence, a new film by Australian director Philip Noyce (The Quiet American, Clear and Present Danger), is a scathing attack on the Australian government's \"eugenics\" policy toward Aboriginal half-castes. Continuing policies begun by the British, the white government in Australia for six decades forcibly removed all half-caste Aborigines from their families \"for their own good\" and sent them to government camps where they were raised as servants, converted to Christianity, and eventually assimilated into white society.<br><br>\nBased on the 1996 book, \"Follow the Rabbit-Proof Fence\" by Doris Pilkington Garimara (Molly Kelly's daughter), the film tells the story of three Aboriginal girls, 14-year old Molly Kelley, her 8-year old sister Daisy, and their 10-year old cousin Gracie. It shows their escape from confinement in a government camp for half-castes and their return home across the vast and lonely Australian Outback. It is a simple story of indomitable courage, told with honest emotion. Abducted by police in 1931 from their families at Jigalong, an Aboriginal settlement on the edge of the Little Sandy Desert in northwest Australia, the three girls are sent to the Moore River Native Settlement near Perth. Here the children must endure wretched conditions. Herded into mass dormitories, they are not allowed to speak their native language, are subject to strict discipline, and, if they break the rules, are put into solitary confinement for 14 days. <br><br>Followed by the Aborigine tracker, Moodoo (a great performance from David Gulpilil), the girls make their escape. Using a \"rabbit-proof fence\" as a navigation tool, they walk 1500 miles across the parched Outback to return to Jigalong. The rabbit-proof fence was a strip of barbed-wire netting that cut across half of the continent and was designed to protect farmer's crops by keeping the rabbits away. The girls walked for months on end often without food or drink, not always sure of the direction they are going, using all their ingenuity and intelligence along the way just to survive. The stunning Australian landscape is magnificently photographed by Christopher Doyle, and a haunting score by Peter Gabriel translates natural sounds of birds, animals, wind and rain into music that adds a mystical feeling to the journey. <br><br>The performances by amateur actors Evelyn Sampi, Tianna Sansbury, and Laura Monaghan (who had never seen a film before let alone acted in one) are authentic and heartbreakingly affecting. Though the white officials and police are characterized as smug and unfeeling, they are more like bureaucrats carrying out official policies than true villains. Kenneth Branagh gives a strong but restrained performance as Mr. Neville, the minister in charge of half-castes. Rabbit-Proof Fence is an honest film that avoids sentimentality and lets the courage and natural wisdom of the girls shine through. This is one of the best films I've seen this year and has struck a responsive chord in Australia and all over the world.  Hopefully, it will become a vehicle for reconciliation, so that the shame of the \"Stolen Generation\" can at last be held to account.","user":"howard.schumann","rank":[59,69]}]