[{"title":"This film is a Quirk. I liked it.","rating":9,"date":"20 February 2004","review":"Due to reading bad reviews and being told by friends that they couldn't believe how bad it was, I didn't go and see this film at the cinema. After watching it on DVD, I have to say I regret that now. I'm not saying it is brilliant, but I would venture to say that it is a good movie. I enjoyed it.<br><br>People have skulls thicker than Ned's helmet if they go to see a movie like this and expect it to be a documentary. If you read up the actual history behind most movies based on historical figures, there is usually a huge difference between the fact and the fictional portrayal. I don't think Ganghis Kahn has ever once been portrayed even remotely close to historical fact. What kind of man Ned Kelly actually was is a matter of debate, and quite passionate it seems. In spite of the efforts of governments and some historians, Ned Kelly has become a legend. Legends are stories, and stories say as much about those who tell and listen to them as they do about the actual figure himself. Ned Kelly has become such a popular identity because he does represent that aspect of Australian culture that doesn't trust or accept authority. A society in which there is no dissent or challenge to authority is crazier and more dangerous than any bushranger.<br><br>So not expecting this to be an accurate recreation of the historical Kelly gang, I actually found it a surprisingly unencumbered and refreshing movie. It was sentimental and romantic, but thankfully not anywhere as cheesy as it could have been; for my fellow Australians, watch 'The Lighthorseman' and you will see what I mean (it is a pity the way that story was treated so poorly). Perhaps the love affair business could have been forsaken for a bit more detail in other areas, such as the shooting of the troopers. Ironically, I actually enjoyed the movie because of that, because it would be those details that most of the focus on Ned's story would dwell. And they are the details of the story that are best discovered by reading the different viewpoints given by the various historians.<br><br>This movie was always going to have a hard time, having make a compromise of appealing to a global movie market (to pay the pills) and the legend as it means to Australians; perhaps a little of Ned's spirit is in this movie, because I think it rebelled against people's expectations, and unfortunately missed both targets. Fortunately it made for an enjoyable quirk of a film. For me it was an unexpected kind of movie about Ned, and that is why I liked it. Orlando Bloom's performance did a lot for the movie too - he really added something. I think he would have enjoyed being the monster instead of the pretty elf, for a change.<br><br>When you consider some other movies that are far worse than this one, your opinion of this movie should be reconsidered. Send me this on DVD for christmas rather than Croc Dundee or The Man From Snowy River anytime.","user":"jashael","rank":[50,63]},{"title":"A very nice story and some good acting make this an enjoyable movie","rating":8,"date":"26 April 2005","review":"I'm sure that not many people outside of Australia have ever heard of the legend of Ned Kelly. I once saw a documentary about the man, but that's the only time I once saw or heard anything about him. And I guess that this might be the biggest problem this movie will have to face. No-one knows anything about it and probably not many people will care about the subject.<br><br>The movie tells the story of Ned Kelly's life. The Irish immigrant has lived in north-west Victoria all his life, but has never been very welcome by the authorities. The police always accuses him of everything they can think of and they keep harassing his family. When Kelly is fed up with the way everything goes, he forms a gang with his brother and two other men. They start robbing banks and even hijack an entire town for 3 days. All this violence leads to a man hunt organized by the police and when they kill three policemen, they are outlawed. Finally they take over a pub in Glenrowan, where they have a party with all the visitors, waiting for a train full of police to derail at a part of the track that they tore up. But the train is able to stop in time because someone warns them and what will follow is a battle on life and death between the police and the four gunmen...<br><br>It's very hard to tell whether all of what is shown in the movie is true or false. I guess nobody really knows, because there will always be two camps who will each tell their own truth: one camp says he was a hero, some kind of Robin Hood, the others will say he was an ordinary criminal, a murderer and a thief. I really couldn't tell you which of them is right, perhaps both are, but what I can tell you is that the facts in the movie as well as is the documentary were about the same.<br><br>This movie was a nice addition to the documentary I once saw and I really enjoyed the performances of all the actors. Heath Ledger, Orlando Bloom, Naomi Watts, Geoffrey Rush are all actors who are pretty well known, but even the lesser known actors show in this production that they all know what good acting should look like. I really enjoyed this movie and I give it a 7.5/10","user":"philip_vanderveken","rank":[32,39]},{"title":"A breath of fresh air...","rating":10,"date":"30 December 2004","review":"There are few films that leave me with the feeling that Gregor Jordan's 'Ned Kelly' film did. Initially I had heard only half hearted recommendations, and decided to see it for myself. Since then, I have acquired both the video and soundtrack, and have to say that after several viewings, I am still very impressed with the underlying character of this film. It is also wonderful to see something Australian! I appreciate its down to earth quality, that if you ask me is a rarity, as well as the absence of tackiness that takes away from so many films. This film proves that you don't necessarily require fancy costumes and a glamorous set that absorbs how many millions of dollars to make a point. The cast was a bonus, including a variety of well known, and might I add, good looking people who did well to slip into the role of such unique characters. It is interesting to note, that much of the criticism regarding this film has been about who played what, and how they only said so many lines. However, if any criticism is due, it should constructively focus on the fact that a number of basic elements of the original events were excluded. In reality, these functioned to made it the hallmark that it is in Australian history. For example, on a closer examination it can be discovered that there was much, much more to the relationship between Joe Byrne and Aaron Sheritt, and that this was in fact responsible for many more of the final outcomes for the gang than were explored in the film. Also overlooked was the fact that it was not only Aaron Sheritt's efforts alone, that provided the Victorian police with their insights into the unfolding mystery. Yes, this is their interpretation of the story, and it is understandable that true stories require sensationalism and at times the modification of the original plot to grab the viewers attention. I feel that in this case, this is the only limitation. However, I can accept that perhaps historical accuracy is only of significance to those who have a particular interest in the realistic events behind a situation. It certainly inspired me to look more closely. So, watch it and decide for yourself. You might not like it at all, thats your opinion, and thats fine. Maybe it is a film that appeals largely to an Australian audience? For me, I'd call it a breath of fresh air!","user":"johannadavey","rank":[51,66]}]