[{"title":"The End of an Era.","rating":6,"date":"16 October 2007","review":"It's the 20th Bond film and premiered on the 40th anniversary of the series, and, in many ways, it is really a tribute to the entire series itself. This film's strength and its weakness both lie in the fact that it is a blend of the classic Connery films, the outlandish Moore films, and the grittiness of the Dalton films. It's rolling the entire series into a single two hour adventure and the result is actually pretty entertaining. The first half is definitely stronger than the second; a more serious adventure with a classic feel to it, before taking a nose dive down into utter camp territory. I didn't mind the idea of making some scenes a little over-the-top, but I think they went overboard at times. Throughout the movie, the filmmakers toss in little references to previous Bond films. I suppose it's a fun idea to stop and consider how far these films have come over the last 40-something years, and a long time Bond fan can find amusement in finding these subtle, but long remembered treasures that poke their head in this film for one last time. As for the technical aspects of the film: The special effects are a little too ambitious and don't always come across convincing. The dialogue goes back and forth from excellent to atrocious. The ensemble of actors is pretty strong, except for Halle Berry, who in my opinion was completely wrong for a Bond movie. The villains are a little more dynamic. The action sequences are an improvement, in my mind. Granted, there are some instances where the filmmakers push the envelope a little too far, as mentioned above. However, they also show a certain amount of creativity that seemed to be lacking in the previous two films. Overall, this film is really a mixed bag. At moments there is potential for one of the greatest Bond adventures. At other moments you're thinking, \"What the heck am I watching.\" Personally, I feel the positives balance out the negatives, but if anything, this film is a good popcorn movie. All in all, it wasn't a bad way to close out the series before rebooting it again with Casino Royale.","user":"namideo","rank":[76,104]},{"title":"Fourth Brosnan 'Bond' Starts Promisingly, but Falters...","rating":6,"date":"8 May 2004","review":"Creating new, exciting adventures for 007 after 20 feature films in forty years is a difficult task at best, particularly as public tastes change, and the character of James Bond has to maintain at least a degree of the 'persona' created by Ian Fleming. While the heirs of Albert Broccoli, his daughter Barbara and son-in-law Michael G. Wilson, have done a remarkable job in keeping the series 'fresh', if DIE ANOTHER DAY is any indication, the creative forces surrounding them seem to be losing 'touch' with James Bond, and his world.<br><br>After an astonishing pre-title sequence, climaxing with Bond being captured by the North Koreans, the film offers a horrendous montage of torture, with Bond only surviving due to a timely prisoner exchange (with an unsympathetic M remarking, \"If it had been up to me, you'd have stayed in North Korea...\", obviously forgetting that 007 had saved her life in THE WORLD IS NOT ENOUGH). Pierce Brosnan, at fifty, is superb in this sequence, vulnerable yet defiant, and to this point, DIE ANOTHER DAY has all the makings of a first-class Bond entry.<br><br>Then Bond jaunts off to find the agent who betrayed him, becoming involved in an investigation involving diamonds, solar power, and a 'too-good-to-be-true' industrialist (smarmy Toby Stephens), and all of the creativity of the opening is lost, with the film becoming an uneasy mix of references to past films and silly, unbelievable situations, sets and gadgets (culminating with an 'Ice Palace' and an 'invisible' Aston Martin).<br><br>As she had won an Oscar prior to filming DIE ANOTHER DAY, sexy Halle Berry, 36, was publicized extensively as Bond's latest leading lady, CIA agent 'Jinx'. Unfortunately, after a spectacular 'rising from the waves' introduction (borrowed from Ursula Andress, in DR. NO), and a few nicely choreographed fights, she spoke...and lost all of her credibility in the role. While much of the problem was certainly in the script, she was never believable as Bond's 'counterpart' in the American intelligence community. On the other hand, Rosamund Pike, 23, was both sexy and duplicitous as British double agent Miranda Frost, as chilly as her name, but capable of igniting under 007's gaze. In a part equally poorly written, she made far more of her scenes than the writers gave her. <br><br>The most interesting character in the film was certainly Rick Yune, as Graves' 'enforcer', Zao. Charismatic, ruthless, and nearly unstoppable, Zao was nearly a primal force, far more menacing than Graves at his worst.<br><br>While a sword-fight sequence between Bond and Graves provided a rare film highlight, and certainly ranks as one of the film series' more memorable sequences, much of the rest of the production was silly, with the story set at a break-neck pace to 'hide' the absurdities. The climax, as a solar 'ray' destroyed the minefield between North and South Korea, allowing an 'invasion' to occur, as 007 and Jinx attempted to commandeer the aircraft controlling the 'ray', stands as one of the most ludicrous finales to a Bond film since MOONRAKER.<br><br>Although DIE ANOTHER DAY would become Pierce Brosnan's highest-grossing Bond, to date, the film, despite heavily promoting Halle Berry's presence, failed to crack the 'Top Ten' box office attractions in the U.S., and disappointed many fans, worldwide.<br><br>With the purchase of MGM by Sony, which has wanted to produce a Bond film for years (the studios were entangled in a legal suit that ended just as DIE began production), surprising changes were in store...CASINO ROYALE, the only Fleming title NOT owned by Eon Productions was named as the next 007 adventure...and Pierce Brosnan was FIRED (a sad finish for an actor who'd worked so hard to make 007 viable in the new millennium!) While Broccoli and Wilson are still 'in charge' of Bond productions, they have to answer to new bosses, with definite opinions of their own on where the franchise should go...Can 007 survive THIS? <br><br>We can only wait and see!","user":"cariart","rank":[70,102]},{"title":"Well, what did you expect??","rating":23,"date":"23 November 2002","review":"Look, let's be clear about it...it's the year 2002, not 1962.  This franchise of movies has evolved over the years from a cool and clever spy series to an over-the-top slam bang action series.  When you go to see a James Bond film, you should EXPECT any or all of the following: 1)  A completely unrealistic, contrived plot 2)  Unbelievably cheesy and corny one-liners (almost all of which are sexual in nature) 3)  A supervillain seemingly brilliant and mad enough to quest for world domination, but is somehow stupid enough to let Bond get close enough to spoil the whole thing 4)  A female counterpart (or several) that looks good, gets captured, and ultimately gets saved by our hero 5)  Gadgets, cars, and weapons that do fantastic, unbelievable things 6)  Action sequences and stunts that defy fundamental laws of physics and logic<br><br>Having said all of that, and knowing what I knew, I was so excited to see this movie, and I loved it.  Why?  Because I got to escape for a couple of hours in a fantasy-spy world.  Because I've seen the other 19 movies and I got to see what other directions they went with the characters.  Because I love the characters and have gotten to know them over the course of the last 19 movies.  Of course it has its shortcomings (the CG was weak in parts) but it has everything that makes the franchise successful.  It pays homage to the older films while pleasing younger fans with it's incredible action sequences.<br><br>Like it or not, this is what the series has evolved to.  Personally, I like it, but having seen Dr. No, From Russia With Love, etc, I know that the newer movies don't really appeal to many of the fans of those movies (my dad hates the new movies) because they have completely moved away from reality (not to mention the novels).  So understand that before you go and see this movie.  If you can just sit back and enjoy the ride, you will.  But if you're looking for the magic of 1962 to return, than you might be disappointed.  But I will bet on this...judging by the reaction of the theater I was at, James Bond isn't going away anytime soon.<br><br>Oh by the way, what's with the comment \"Look out Bond, xXx is taking over.\" Huh?  When xXx has 20 successful movies under his belt, then we can start comparing the two.","user":"kphurley-1","rank":[29,39]}]