[{"title":"Top class Brit flick!","rating":23,"date":"23 January 2004","review":"You simply cannot put this movie down, a great all British cast and a great all British sport, being British and a great lover of Manchester United, i was up for this film and it didn't diasappoint me in the slightest. Vinnie Jones was brilliant as Danny Meehan and Jason Statham as the 'Monk' was simply classic vintage stuff. The match is what the watchers of this film want to see and it is fantastically constructed, just one tip of advice, don't p*** of the 'Monk'<br><br>10/10 stars, classic stuff","user":"graboidinator","rank":[36,42]},{"title":"Need more of these from our British cousins!","rating":10,"date":"19 July 2004","review":"I could understand not liking this movie if someone was expecting Citizen Kane (and if you were, you should be flogged). For a straight to video/cable movie, it had great prod. value, sharp dialogue, and a great supporting cast of Guy Ritchie characters. Throw in some solid football and you have a film to help you forget the worries of your day. The commentary by the two Bobs alone makes it worthwhile. Jones is good, but Statham steals the show in almost all of his scenes. Like the original (The Longest Yard), it was made to entertain the audience, not to provoke some deep introspective thought on the existence of God. See it, rent it, buy it! If you cant discern the heavy British slang, throw on the subtitles. If you don't have a DVD player, how in the hell are you managing to read this?","user":"MattIn718","rank":[39,50]},{"title":"1-0 to the Mean Machine.","rating":7,"date":"30 December 2009","review":"Mean Machine is an English reworking of Robert Aldrich's 1974 beefcake Burt Reynolds starrer, The Longest Yard. Substituting Gridiron for Soccer, director Barry Skolnick, along with his roll call of British \"faces\", is only aiming for one market.<br><br>That of the footie worshipping clan that primarily resides within the United Kingdom.<br><br>Very much a long way from competing on the same playing field as Aldrich's superior movie, Mean Machine does have enough about it to make it an enjoyable viewing outside of the excellently constructed soccer match that fills out the last third of the piece. But with the film's reputation being far from good, the chance that many others feel the same as me are pretty remote. About as remote as Accrington Stanley winning the English Premiere League one feels.<br><br>The problem would seem to lay with the first hour, violence and humour thrust together does not always yield great rewards, and so it be with the wet behind the ears direction from Skolnick. Caught between a tough portrayal of British prison life and outright slapstick, it's an odd bedfellow that Skolnick can't quite get right. And with Guy Ritchie on the sidelines donning the \"supervising producer\" shirt, one can't help thinking that Ritchie would have made substantially more with the material to hand. But as \"I\" say, there's enough there for the discerning fan of blood and banter.<br><br>Led by the watchable Jones, the cast, outside of the miscast David Hemmings as the Governor, pull out the stops to entertain the terrace faithful. Danny Dyer haters will enjoy him getting knocked about as he plays simpleton Billy Limpet, while Jason Statham is a joy as Monk, a Jock that even the Jocks are afraid of. While also putting in scene stealing shifts of note are Jamie Sives, Vas Blackwood and Omid Djalili. It's no piece of work to rank in the higher echelons of British movies - or sports movies in general for that matter. But in spite of its soggy formula and over reliance on the template film it's working from, it's very funny at times, and if you like soccer? Well the actual match is well worth the wait. 7/10<br><br>Footnote: The Longest Yard/Mean Machine was met with another re- imaging in 2005 with Adam Sandler as the disgraced lead protagonist. Proof positive that it's either a formula that many can't resist? Or that it's one that some feel still hasn't yet met its potential?","user":"hitchcockthelegend","rank":[11,13]}]