[{"title":"Ghost Rider","rating":6,"date":"24 February 2020","review":"This demonic Marvel adaptation is visually groundbreaking, no doubt, but is not an easy ride. Ghost Rider's exaggerated tone and dialogue and hell-driven sequences provides many speed bumps on this less-than-anticipated ride.","user":"MR_Heraclius","rank":[39,40]},{"title":"Awesome flick if you like some cheesy fun","rating":9,"date":"16 February 2007","review":"First off, I'd like to say that I really enjoyed this movie. I have read a lot of the bad hype that the flick has receieved, and I believe that this is partly due to the fact that people go into these types of movies expecting amazing advances in cinematography as well as a gripping and dramatic plot. Well, I hate to burst everybody's bubble, but that is really not the purpose of this type of movie. These bad reviews make me wonder just how serious you have to be (or just how snobby a critic) going into the theater to hate this type of movie making.<br><br>Far be it from me to say that this movie was perfect. It had its flaws and there were times when I found myself snickering at the silliness of it all, but that to me is good entertainment. The scenes where Cage turned into ghost rider for the first time were fairly intense, and I found myself marveling at the coolness of his transformation and powers. I also enjoyed the battle scenes including one involving ghost rider and a helicopter (I won't tell you what happens there, but it is pretty amusing). I also felt that the movie was pretty well-acted overall, and the entire flick maintained an aura of fun throughout (which I believe was the main purpose of the whole thing) while flowing smoothly through a simple plot.<br><br>If you are the type of person to over-analyze plots, scrutinize special effects, whine about some cheesy acting or if you get offended when a movie doesn't have a deep and philosophical meaning behind it, this is definitely not a movie you should waste your time or money on.<br><br>If, however, you are the type of person who enjoys some good laughs, some over the top (and at times cheesy) comic book acting, cool battle scenes, action and adventure, or if you simply just like to see some guy with a flaming skull, this is worth the 8 bucks to get into a theater seat.","user":"mystywolf","rank":[232,346]},{"title":"Hell of a Ride","rating":7,"date":"16 February 2007","review":"If you go into this movie hoping to see Academy Award caliber acting or a dramatic plot that's going to move you emotionally, then you're going to the wrong movie. However, if you're looking for a movie that's a lot of fun and is going to keep you entertained, then this is exactly what you're looking for.<br><br>The visual effects in this movie are, simply put, amazing. Ghost Rider is just one of those movies that's cool to look at. As I said before, the acting sometimes falls a bit flat, but Nicolas Cage does exactly what's expected of him for the role. It's a bit cliché and humorous at times, but this is a movie based on a comic book, so you have to expect that sort of thing.<br><br>Sam Elliot and Peter Fonda provide the best acting in the movie, while Wes Bentley does a solid job as Blackheart and Eva Mendez is just a very beautiful actress who fits in well as Roxanne.<br><br>There are a lot of little gripes about this movie if you look too hard and overthink it, but as a die-hard Ghost Rider fan, I didn't mind these things so much. It stayed relatively true to the original series, while borrowing elements from the 90's series to help make the movie more visually impressive, which I felt worked really well.<br><br>I've been waiting for this movie since they started trying to make it over eight years ago and overall, I'd have to say I really enjoyed seeing my favorite comic book character finally make it onto the big screen.<br><br>If you want to go see a movie where you can just sit back, relax, and enjoy the ride; then go see Ghost Rider without any worry of disappointment.","user":"Blackout2K5","rank":[338,538]}]