[{"title":"Deeper relationships","rating":8,"date":"10 August 2005","review":"I've always been a big fan of the first Mulan movie and when I heard about a sequel of course I started waiting for it impatiently. I bought the movie box which included both Mulan movies and when I saw the sequel for the first time I didn't like it that much but it was OK. I would say it's a movie which must be watched two times. I just watched it again and thought it was great this time! I noticed more things which I didn't notice first time. It included everything that was missing in the first movie for example love between Shang and Mulan :) Of course the original is always better but I'm delighted that Disney has made a good sequel. I don't see why they couldn't make some TV series or third movie :)<br><br>8/10","user":"Aeris_forever","rank":[26,32]},{"title":"This would be a good TV pilot but it makes a bland sequel","rating":7,"date":"8 September 2012","review":"This movie dosen't work much a sequel to \"Mulan\" (which is one my favorite Disney movies).<br><br>While the first had an epic plot, this one is very simple - in fact it's almost a sitcom setup. We only get one bigger action scene in the third act and the rest of the movie is character developing their relations as they travel from point \"A\" to point \"B\". We get more Mulan/Shang relation, we get romance between three warriors and Emperors daughters (new character) and more Mushu/Mulan relations... In fact it's almost like a romantic comedy set in ancient China.<br><br>And I will be honest - if this was the pilot for \"MULAN THE ANIMATION SERIES\" (or \"MULAN'S VALENTINE DAY SPECIAL\") I would enjoy it.<br><br>True the animation is far from movie standards but it's still pretty darn good. All the characters relation stuff are sweet (especialy all the stuff between the warriors and the princesses) and interesting, few scenes made me laugh and I actually like the songs.<br><br>So yhe, this movie isn't how a sequel should be made but if you love those characters you may actually find this interesting and enjoyable.<br><br>The only thing I didn't like is the fact that they made the ancestor ghosts characters less sympathetic and Mulan doesn't get to shine like she did in the fist movie (the lack of the whole \"pretend to be a boy\" aspect was what made here fun was the best thing about her in the first movie and we don't get this at all in this one... they just talk abut it)","user":"ggk-34-546807","rank":[11,12]},{"title":"Nice but not as great as the first.","rating":6,"date":"6 January 2007","review":"I watched Mulan II and i will have to say that it was abit disappointing. Mulan is back,and is engaged to be married to her fiancé,General Shang. When all of a sudden,they are given a mission to escort three Chinese princesses abroad. The music is great,but the animation was weak and at times went overboard with the details. The voice cast were'not as good as the first movie with Eddie Murphy out of the picture as Mushu and the other originals as well. But,i loved the music,the exceptional characters and how the story went. It wasn't as dramatic as the first but there was some parts that truly reminded me of the first. Overall,it's not a bad sequel...and i rate it a good ol' 6 out of 10.","user":"koolnut","rank":[11,12]}]