[{"title":"A gut-wrenching look at an all too possible future - but also an immensely entertaining thrill ride featuring some of the best cinematography you'll ever see","rating":10,"date":"11 January 2017","review":"I first saw 'Children of Men' when it came out, 10 years ago, and while I liked it a lot, I kind of forgot about it soon. At the time, it failed to resonate with me on a deeper level - which in hindsight I find astounding. <br><br>Last month, a decade later almost to the day, I suddenly felt the urge to revisit the film (because it was mentioned in an article about \"long takes\"), and upon re-watching it, it just blew my mind. This film is so, so, good! <br><br>It not only manages in many aspects to be the most prophetic - and most shockingly realistic - sci-fi film I have ever seen: it achieves that feat with a level of style and through such an abundance of fantastic creative choices and innovative camera techniques that I was simply left in awe. <br><br>I was forced to conclude that this film was a visionary piece of art (and how that fact had eluded me the first time around I couldn't - and still can't - explain). It's a cinéphile's dream come true; it's a masterpiece in the true sense of the word.<br><br>'Children of Men' is a gut-wrenching look at an all too possible future, but it also works as a heart-stopping, adrenaline-rush-inducing piece of entertainment featuring some of the most breathtaking camera work you'll ever see.<br><br>The performances are flawless. The artwork, the production design, the music; I could go on and on: this is one of those few real masterworks where everything just comes together right. And I believe the final 30 minutes of the film rank among the finest achievements in the history of Cinema. Period.<br><br>10 Stars out of 10.<br><br>Favorite films: IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[190,226]},{"title":"Highlights of the movie","rating":9,"date":"2 November 2006","review":"OK, I only got through the first 3 pages of comments but let me add my own. <br><br>1) Fantastic cinematography. Some like hand-held, some don't. It certainly worked very well here. <br><br>2) Related to (1), very long shots. There is one scene where the camera lens has blood splats on it for quite a few minutes. Hollywood would get rid of it, but for this movie it adds amazingly to the atmosphere that is being created. <br><br>3) Like \"Code46\" the technology is in the background. Just the way it should be, allowing us to focus on the story. <br><br>4) Theo as the central character NEVER picks up a gun, despite them being all over the place and easily available. As a viewer you are almost willing him to do so, to manage some of his challenges - but very deliberately the character does not. <br><br>5) I've read separately that yes this is a comment on current society. Being an Australian, with our controversial immigration laws and practices, that rings true. <br><br>6) Similar to (5), using the term \"Homeland Security\" in the movie is an obvious reference. <br><br>7) The revolutionaries/terrorists/fishes are shown to be just as political and militant as the government they oppose.<br><br>There are more, but that is enough. Overall a wonderful movie which leaves me thinking for a long time, which is all I ask.<br><br>Cheers!<br><br>Anton.","user":"anton_lak","rank":[661,939]},{"title":"Utterly transfixed","rating":10,"date":"22 September 2006","review":"I went to see this movie without catching any reviews, expecting something rather depressing and underfunded.<br><br>Let me stop there and start again.<br><br>This movie is a revelation from start to finish. A convincing future world, deftly conveyed with so many subtle signals that I'm sure it will benefit from further viewings. A completely \"other\" England which I was amazed to see realised in such detail. Clive Owen FINALLY has the heroic role we have been waiting for and is brilliant in it. Julianne Moore simply glows and I've never enjoyed Sir Michael Caine so much before. The soundtrack is beautifully eclectic. Aside from some excellent classical choices, there's an evocative and alternative Spanish take on \"Ruby Tuesday\" which is a signature on the film. Wait during the end titles to enjoy an excremental song from Jarvis Cocker.<br><br>The movie grabbed my attention right from the start, and never let go. Initially, it's the differences of this future world that intrigue. Then, when the action starts, what I found really surprising was the freshness of direction that made me react to bullets and violence as if I'd never seen them in a movie before. If the script wasn't so wonderfully leavened with wit, it would be a grim and scary movie at times.<br><br>Finally, the whole thing is lit brilliantly, from the authentic dim English days to the atmospheric ending.<br><br>One to watch alongside \"The Handmaid's Tale\" some time....","user":"GregWolf","rank":[802,1]}]