[{"title":"the end?","rating":6,"date":"6 February 2004","review":"It's a shame that \"Star Trek\" is having a tough time surviving in a market that's glutted with bigger budget, \"sexier\" stuff like The Matrix, Lord of the Rings, Harry Potter...<br><br>Compared to those blockbusters, Nemesis appears almost quaint, with its heavy reliance on computer graphics that were state of the art - several years ago.  Paramount simply isn't investing enough money in these films to keep them looking up-to-date, which is a shame, because Star Trek still has plenty of relevant things to say.<br><br>Or does it?  You could look at Nemesis as a triumphant return to form, filled with all the action and humanism we've come to expect from these films, or you could look at it as a clumsy rehash of plot elements from \"The Wrath of Khan\" (revenge! space fight! dramatic death!) and \"The Undiscovered Country\" (peace with our moral enemies!).  I have trouble deciding if this movie is good enough to justify continuing the franchise; I've got nostalgic feelings for the Next Gen crew, even though I prefer the originals, and maybe those feelings are acting in the same capacity as beer goggles.<br><br>So what works?  Stewart, Frakes, Spiner.  The battle is fun.  Some of the \"deep\" questions raised about identity, cloning, and nature vs. nurture got me thinking (although, in the end, they were largely irrelevant - the whole thing devolves into a fight!).  What doesn't work?  Stilted dialogue. Techno-babble.  Boring sets (particularly for the Enterprise).  Trying to pass off California filmed through a filter as an alien planet.<br><br>\nFinal verdict?  First, Star Trek needs a rest.  Then, it needs more money. That's what happened to Doctor Who in the last decade, and Godzilla and James Bond went through similar trials in the 1980s.  It's bound to happen to any long-running franchise.  When it comes back, it does need to be better than Nemesis, not because Nemesis is terrible, but because it's a bit tired.  New creative blood revitalized the original crew's films - Nicholas Meyer and Harve Bennet, who knew nothing of Star Trek, managed to give the series the jolt it needed to remain popular for a decade.  Another dose of outsiders, with outside perspectives, will be needed to get Star Trek up and running again, sometime in the future...","user":"dr_foreman","rank":[169,211]},{"title":"Boldly Going Into Dark Territory...","rating":10,"date":"10 February 2003","review":"This was a very different Star Trek film mainly due to its dark tone. Despite mainstream belief, I think 'Insurrection' was a beautifully written film and despite the simple story, it worked nicely as the characters were having fun.<br><br>This film is very serious and although I don't like action films,  this movie was pretty intense thanks to its villain. The characters aren't having fun at all which I think detaches the audiences a little cause it's not a fun adventure. The stakes in this film are more personal to the characters so there's no time for the regular jokes once the story kicks in as there's too much at stake.<br><br>That aside, this film is handsomely produced with a great production design and has some exciting conflict between Picard (Patrick Stewart) and his nemesis, Shinzon (Tom Hardy). The face off between the two characters in the final 30 minutes is very exciting.<br><br>The performances where all brilliant in the film and I hope to see the full version of the film on DVD as I think the mind rape suffered by Troi (Marina Sirtis) could have been further explored.<br><br>Why this film failed at the box-office was the timing. You don't release a Star Trek film 5 days before Lord of the Rings. L.O.T.R. is more popular than Star Trek right now but this film could have re-ignited the franchise if people went and saw it. Delaying its release in Australia was a good idea as this has given it a no. 1 spot on opening weekend which it deserves despite an almost non-existent marketing campaign here.<br><br>It wasn't a bad film by any means and I think the critics didn't like it because it was so dark and that there's little sense of fun.<br><br>I think 'Nemesis' is a very worthy chapter in the Star Trek franchise. It took a while to reach Australian audiences but most of us believe it was well worth the wait. 8 out of 10","user":"spaceboy_a","rank":[104,159]},{"title":"Death Knoll for an Era...","rating":6,"date":"6 December 2003","review":"STAR TREK: NEMESIS was doomed before it ever reached theaters. When four long years passed between INSURRECTION and NEMESIS, and Paramount (always skittish about the expensive series) chose to advertise the film as THE END OF TREK (\"A Generation's Final Journey...\"), you knew that not only the film, but the entire franchise was in serious trouble. Certainly Rick Berman's growing indifference was a factor in the demise of the legendary series of films, but other factors were involved, as well. First, the 'Next Generation' crew was facing the same obstacle that had destroyed the credibility of the original cast; they were getting too old for their roles. With the youngest 'regular', LeVar Burton, now 45, and series favorite, Brent Spiner, 53 (and getting pretty 'long-in-the-tooth' for the 'ageless' Data), the youthful edge of the 'Next Generation' had settled into middle-aged complacency. The only cast members who seemed believable reprising their TV roles were Patrick Stewart (at 62, still the 'father figure' he'd always been), and Michael Dorn, 49, as the Klingon, Worf (heavy makeup made him unrecognizable, anyway). The 'age' issue made NEMESIS feel more like a TV 'Reunion' special, created to tie up 'loose ends' than a 'cutting edge' Science Fiction film.<br><br>Second, competition both on TV and in film had not only 'caught up' with 'Trek', but passed it, in terms of originality and excitement. 'Babylon 5' had given 'Deep Space 9' all it could handle during their TV runs, and 'Voyager' and 'Enterprise' had everything from 'Stargate 1' to 'Farscape', 'Andromeda', and other SF series vying for, and capturing their audiences. At theaters, a crop of FX-heavy SF features exposed a 'Trek' series that had become 'quaint', and even the object of parody (GALAXY QUEST).<br><br>Of course, had NEMESIS been as dynamic as THE WRATH OF KHAN or FIRST CONTACT, none of these factors would have become issues. Sadly, it wasn't.<br><br>The premise, that a youthful 'cloned' Picard, Shinzon (Tom Hardy), leading a Remus rebellion that conquers the Romulan Empire, decides to attack the Federation to 'get back' at the Enterprise captain, defies logic or believability. \"Years spent in the mines\" as an explanation for his irrational behavior and variation of appearance are ridiculous (and brings up the question, 'Was Picard ALWAYS bald?', as it seems to be the only common trait Shinzon and Picard share). As a villain, Shinzon lacks the menace of the Borg Queen or the pathos of Khan, and seems more petulant than threatening.<br><br>There is a sense of desperation in NEMESIS, of trying to find some 'gimmick' to make the film memorable. Certainly the most flagrant case of this was falling back on the WRATH OF KHAN climax, and having Data die, to save the crew (conveniently after another 'Prototype' Data has received a copy of his memory chip). What was noble in Spock's gesture seems, in NEMESIS, to be nothing more than an excuse to give Spiner a 'big' scene, and to stir up loyal 'Trek' fans, when all else had failed.<br><br>With Patrick Stewart enjoying the worldwide success of the X-MEN films, it is unlikely he will don a Federation uniform, again (at least at a salary that won't break Paramount), which most likely finishes off the 'Next Generation' films. With no plans at present to move another 'Trek' TV series to the big screen ('DS9' lacked the wide appeal or ratings of 'The Next Generation', 'Voyager' concluded their 'mission', returning to Federation space, and 'Enterprise' is only barely holding it's own on the small screen), an era has come to an end. Perhaps an 'original' concept film can be produced (STARFLEET ACADEMY has long been discussed), but unless visionaries like Gene Roddenberry can be found to return the excitement to 'Trek', it will never get past the 'talking' stage at Paramount.<br><br>As the dying James Kirk said, in GENERATIONS, \"It was...fun...\" Certainly there is a legacy in the best of the 'Star Trek' films that those of us who grew up on them will always cherish...","user":"cariart","rank":[52,78]}]