[{"title":"If you like Recess on TV you'll LOVE the movie.","rating":8,"date":"11 March 2001","review":"Recess the TV show is about kids having fun, and teachers being teachers (good and bad). There's good character development and personality variation on the small screen and it carries well to the big screen.<br><br>The movie puts the kids in the role of spies who need to break INTO school to save their lifestyle. Along the way, there are great 60's flashback scenes and songs, lots of funny spy movie cliches including the mob-scene climax.<br><br>The characters are caricatures but it IS a cartoon after all. There's good voice casting (including James Wood, Melissa Joan Hart and a great sounding Robert Goulet). The plot is complicated (and just a little goofy), but my 8 and 10 year old had no trouble following the action.<br><br>There are good messages about friendship, respect, integrity, duty, but these aren't done in a preachy way.<br><br>The animation quality is variable. There are some great 3d zoom-sweeps, but for part of the movie the characters look like they've been singed. However, the few animation flaws are only an issue for nitpickers (like me).<br><br>\nSee it with someone who knows that characters and likes them. It'll be a good rental or a nice afternoon in the theater.","user":"jjs402","rank":[12,12]},{"title":"Not as good as the series - but damn close!","rating":10,"date":"28 August 2003","review":"I really liked the TV series - i used to watch every episode on the Disney Channel,But i don't think the movie is quite as good as the series:<br><br>For instance The writers are used to coming up with 10 minute stories, but with the movie it seems like a 10 min episode streched out to 80 minutes so i'ts not as good as i would have hoped, but the acting is still superb and very convincing. The animation is strangely NOT as good as the Series it seems very flat and uninspired. On the good side it's got a really cool story even if it could have been done in half the time &amp; JAMES WOODS (his voice anyway) is really good as the bad guy. It has really cool 60's songs towards the end of the movie.<br><br>all in all a really good movie which will delight kids and adults alike,just a shame it's not as good as the series<br><br>my rating 10/10 for pure enjoyment","user":"liammurphy1","rank":[12,13]},{"title":"A film about 6 school friends who are trying to save their school from bad guys.","rating":9,"date":"3 October 2005","review":"I love the film and thought it has everything a perfect film needs.The action,the comedy and everything else that makes the actual movie great.Rickey D'sh on Collins,Ashley Johnson,Paul Willson,Jason Davis,Andrew Lawrence,Courtland Mead,Pamella Segall,Dabney Coleman, April Winchell were perfect as the voices of the characters and so was everyone else that was involved with the movie.I love watching the cartoons on T.V. and don't really think that they are for little kids.Recess schools out shows the story about 6 school friends who find out some strange goings in their school and save it from bad guys who are trying to get rid of summer vacation.","user":"husnain_05","rank":[5,5]}]