[{"title":"I Enjoyed The Movie.","rating":7,"date":"23 July 2002","review":"I do not understand why more people have not seen this movie and/or have voted on it. It's a very good way to spend an hour and a half,some evening with some popcorn,a coke and your lady or gentleman. I really don't believe this film will win any awards. It has action,sex,crime and a lot of surprises. In this elderly mans opinion it was a heck of a lot better than some of the highly rated garbage they have turned out lately. Lou Diamond Phillips, Edoardo Ballerini and the rest of the supporting cast did a fine job, with an average movie. Yes, I do know what opinions are just like. No, I do not know anyone connected to this film. I'm just not sophisticated enough to tear it up, like some seem to do with many movies.I give it a 7.","user":"howdyg","rank":[10,14]},{"title":"Disappointing lack of editing finesse!","rating":3,"date":"12 March 2006","review":"It always amuses me when bad editing results in cars magically having regrown hubcaps that clearly flew off in an earlier scene - just seconds earlier.<br><br>It struck me that the final car chase scene was very familiar, from the way the blue BMW zigzagged across the park and jumped the wall, followed closely by a beige Dodge Ram. I thought it was remarkably similar to a scene I remembered from a Steven Seagal movie, probably \"Marked for Death\" which I saw in the early Nineties. Then I noticed that the mag wheels had miraculously changed from alloy spokes to gold BBS honeycomb style wheels... and the shade of blue wasn't right, either. If you're observant, you can clearly see both Seagal and his co-star companion in the truck (supposedly now driven by Phillips, who elsewhere is shown to be alone in the vehicle) at various times, but most noticeably when it spins round and enters the sidewalk, and again as it gets back on the street.<br><br>If you watch closely, you can even see those nasty Jamaican drug dealers from the 1990 movie in the BMW... in one scene there is a black hand hanging out of the passenger side window (when there's supposed to be no passenger at all in either car)<br><br>You sort of feel cheated when they pull this kind of stunt on the audience. Did they manage to save so much money after paying royalties to the owners of the Seagal movie? Or did budget constraints prevent them from staging their own car chase and doing their own stunts..? I'm told that the opening car chase was similarly taken from another movie which I haven't yet seen.<br><br>Recycling in general may be sensible and politically correct - but this is taking the concept too far. Moviegoers should be entitled to a partial refund - or free copies of the movies from which these scenes were lifted.<br><br>Lou Diamond Phillips has done better work for decades. It does him no favors to be associated with a production which relies so heavily on disingeniously regurgitated material.","user":"mwagrp","rank":[8,11]},{"title":"Unsatisfying thriller","rating":22,"date":"22 December 2011","review":"If you are a person who likes to check out made-for-DVD movies, there is one film company you should be aware of - and not for positive reasons. That company is Cinetel Films. More often than not in their movies, they use footage from big budget major studio films, and in \"Malevolent\" they do this twice. I didn't recognize the footage from \"The Corrupter\", but I certainly recognized the climatic vehicle chase as being taken from \"Marked For Death\". As for how the rest of the movie appears, it's low budget but has some decent production values like good photography. The script, however, leaves a lot to be desired. The hero makes some pretty dumb decisions along the way that prolong things - if he had been smarter, things would have been wrapped up much quicker. And when things are wrapped up, the movie abruptly ends - the movie really needed another scene after the climax. Not the worst movie made by Cinetel Films, but there's no real reason to seek it out.","user":"Wizard-8","rank":[4,5]}]