[{"title":"Growing Up Catholic","rating":8,"date":"29 April 2005","review":"I came across this indie gem one day at my local Blockbuster. I looked at it and it seemed like it would be an o.k. way to kill two hours. There was really nothing else in the videostore, so I decided to rent it. Boy, am I glad I did. I really appreciated the movie and related to it, after all I do go to a Catholic High School. 'The Dangerous Lives of Altar Boys' is actually a great coming-of-age tale set in the Catholic school setting of the 1970s. Just by reading the title I thought it was about pedophile Catholic priests or something, but it's really about two friends who are the altar boys at their church/school and their adventures as they discover what's life is all about... or their interpretation of it.<br><br>The two boys in 'The Dangerous Lives of Altar Boys' are Francis Doyle (Emile Hirsch - The Girl Next Door, The Emperor's Club) and Michael Sullivan (Kieran Culkin - Igby Goes Down, Home Alone). They are two fifteen year old rebels that have a passion for comics and writing and illustrating their own. They despise their tough-as-nails and strict one-legged Catholic nun school teacher, Sister Assumpta (played by Two Time Academy Award Winner Jodie Foster - The Accused, The Silence of the Lambs). The two boys make themselves their own creative superheroes in their comic and have Sister Assumpta be the evil motorcycle peddling nun from hell that the two superheroes battle, along with the boys' other two friends who provide superheroes for their comic too. The film switches from real-life to the creative comic book setting during conflicts in the story, and I think that it's done very stylish and neat. The two boys rebel against their teacher and misbehave in front of her constantly, especially Michael (Culkin) who drives her absolutely nuts. The boys rebel by doing other things that the nun doesn't know about like, drink, smoke pot and steal and damage church property. The film contains some funny moments, and as the story unfolds Francis (Hirsch) becomes interested in the girl who lives next door to him Margie (Jena Malone - Saved!, Cold Mountain), a cool, nice, beautiful and independent girl with a deep and dark secret that challenges Francis. I won't give it away though.<br><br>There are many great aspects to this film. Most notably is the acting. Emile Hirsch is nothing short of incredible as the genuine misfit Francis and Jena Malone is equally as good as the sweet yet complex Margie. Jodie Foster is hysterical and always a pleasure to watch as the uptight Catholic school nun and 'Law &amp; Order: Criminal Intent's' Vincent D'Onofrio has a somewhat small role as an interesting Catholic school priest who smokes like a chimney. The stand-out of the film however is Kieran Culkin. He is definitely the most talented performer in his family, and he gives an astounding performance as Michael Sullivan that puts him on the top of the list of the best child actors working in Hollywood currently. Culkin gave an equally amazing performance in Burr Steer's neurotic and darkly hilarious film debut 'Igby Goes Down' which was released the same year as 'The Dangerous Lives of Altar Boys'. Peter Care does a fabulous job with this, his feature film debut, and the valley's Todd MacFarlane (creator of Spawn) provides the comic book illustration for the animated scenes. <br><br>All in all this is a great coming-of-age movie, with a lot of heart and intelligence. It has some flaws like dragging a little towards the beginning, being a little unclear towards the end and having some freaky and unnecessary ghost sequence towards the middle of the film. I'd recommend this to anyone who attends Catholic High School because it is a great movie but it's also something you could relate to. Next time you are at the videostore and can't find anything to watch, maybe pick up 'The Dangerous Lives of Altar Boys'. Chances are you won't regret it. Grade: B+<br><br>MADE MY TOP 300 LIST AT #245","user":"MichaelMargetis","rank":[29,32]},{"title":"Totally great","rating":10,"date":"18 July 2004","review":"The Dangerous Lives of Alter Boys is kind of like a cross between The Virgin Suicides and Stand By Me. Set in the 70's (featuring many cool 70's haircuts) in small town Georgia, the story focuses on Francis, a 14-year-old dreamer and troublemaker. He and his pals, Tim, Wade, and Joey cope with life under the oppressive rule of one-legged nun Sister Assumpta (Jodie Foster) at the Puritan Christian high school they're unfortunate enough to attend. <br><br>One of their methods of escape is the 'The Atomic Trinity' comic book. Each of them have their own character with superpowers (such as The Muscle, Captain Asskicker and Skeleton Boy), battling against the tyrannical regime of Nunzilla/Pegleg (a gross caricature of Sister Assumpta). These fantasy stories make up the terrific animated sequences of the film. The cool thing is that they are not so totally removed from the reality of Francis, Tim, Wade and Joey.<br><br>The boys soon find their way into a lot of trouble though. After stealing the school's nun statue mascot the quartet plan to steal a cougar from the zoo and put in Sister Assumpta's office. A mad plan yes, but their determination and invention behind it is very clever.<br><br>Some scenes of the film are very emotional, so if you have soft spot you'll find it tough to get through the scene where Tim finds a dying dog by the side of the road or Francis reading a poem at the funeral.<br><br>Francis' relationship with Margie (the very cute Jenna Malone) also takes many curious and unique turns. The scene with the ghost watching them sleep was pleasingly weird. <br><br>Taken from the one and only book (posthumously) by Chris Fuhrman (a book I must get as soon as I see), The Dangerous Lives of Alter Boys is attractively shot, wonderfully acted and definitely worth getting.<br><br>The DVD is in 1.85:1 widescreen (strangely non-anamorphic, though the region 2 version is) with Dolby 5.1 sound and a mild bunch of extras.","user":"CuriosityKilledShawn","rank":[39,45]},{"title":"Surprisingly Great Original Coming to Age Movie","rating":9,"date":"19 September 2005","review":"In the Seventies, the fifteen years old troublemaker and leader altar boy Tim Sullivan (Kieran Culkin) and his three great friends, Francis Doyle (Emile Hirsch), Wade Scalisi (Jake Richardson) and Joey Anderson (Tyler Long), study in a repressive Catholic school, and they hate their nun-teacher Sister Assumpta (Jodie Foster). Francis has a crush on Margie Flynn (Jena Malone), who has a dramatic secret in her life. They like to write a comic book called 'The Atomic Trinity' and all of them have an alter-ego in their superheroes: Brakken (Francis), The Muscle/Skeleton Boy later (Tim), Captain Asskicker (Wade) and Major Screw (Joey), with Sorcerella (Margie) joining them later. Francis uses to fantasize reality with the fantastic situations the heroes face against the evil Nunzilla/Pegleg, a dark caricature of Sister Assumpta. The group plots an evil prank against Sister Assumpta, with tragic consequences.<br><br>\"The Dangerous Lives of Altar Boys\" is a surprisingly great original coming to age movie, one of the best I have ever seen in my life. The group of friends recalled me 1986 \"Stand by Me\" or part of 1981 \"Four Friends\" and the dramatic situation recalled somehow 1999 \"The Virgin Suicides\". The screenplay, alternating animation with film, is great: the boys escape and fantasize reality through their alter egos. The performance of the young cast is also excellent. Jodie Foster, as the severe teacher, and Vincent D'Onofrio, as Father Casey, magnificently complete this wonderful cast. I could never imagine Jodie Foster in such role. I highly recommend this great movie, much unknown here in Brazil. My vote is nine.<br><br>Title (Brazil): \"Meninos de Deus\" (\"Boys of God\")","user":"claudio_carvalho","rank":[28,32]}]