[{"title":"Explores New Ground","rating":5,"date":"5 July 2003","review":"Director Steven Soderbergh calls Full Frontal the unofficial sequel to Sex Lies and Videotape, his groundbreaking 1989 film. Most everyone else has called it a mess, or useless waste of time. One prominent American critic even suggested this might be the worst film ever by a major director. I can't say I agree with the harsh criticism. While I'm not exactly sure what the movie is about, and vast passages of it simply do not work, I do think it is a film with great passion and energy. Soderbergh has left behind the slickness of Ocean's 11 and Erin Brockovich and made an experimental film that bristles with inventiveness. Not everything works, but there are several nice performances, particularly by David Hyde Pierce and Catherine Keener and I enjoyed watching an A-list director stray from the tried and true and explore rockier ground.","user":"mrchaos33","rank":[28,38]},{"title":"A Huge Waste of Talented People","rating":3,"date":"26 April 2004","review":"`Full Frontal' is maybe my greatest deception this year. Directed by Steven Soderbergh and having such a cast, I would not believe that the film could be such a crap. There are lots of characters, but none of them is well developed. Therefore, the viewer sees many famous actors and actresses on the screen and is not able to understand who they are, what are their motives, where they are. The plot is very confused, and some actors and actresses perform more than one role. The image and photography are horrible, using a kind of fake Dogma '95 style. I do not know how such talented people could be part of such a mess: friendship or big money? Anyway, a huge waste of talented people and of my time and money, in a film that never works. My vote is three.<br><br>Title (Brazil): `Full Frontal'","user":"claudio_carvalho","rank":[68,101]},{"title":"That don't impress me much","rating":20,"date":"20 February 2004","review":"Too dreary to work as a satire, too wrapped up in its own cleverness to engage; this is an insubstantial vanity piece that might have been entertaining to make but isn't much fun to watch. I'd have thought that if Soderbergh wanted to show off, he could have come up with something better than this collection of over-scripted (and not particularly original) gimmicks.<br><br>It might have worked had we spent more time in the company of the interesting peripheral characters (the theatrical Hitler, Gus the producer) than listening to the self-absorbed droning of the others. Film students will probably love it.","user":"skymovies","rank":[6,7]}]