[{"title":"A solid entertainment weel done action heist movie","rating":10,"date":"17 October 2015","review":"The Fast and the Furious (2001) It is solid decent action film of the film franchise. I love this film it is my third favorite film in the series. I wasn't watching this film for the cars or street races this film is about robbery, as a string of high-speed electronics truck robberies rocks the area. The Team stole $1.2 million worth of major electronics and the cops doesn't have any leads who has done it. There is only one team that could be responsible, Dominic Torreto (Vin Diesel) and his gang of street racers. During the night Torreto and his crew of street racers are driving cars in Los Angeles. Brian O'Conner (Paul walker) a undercover LAPD officer under the alias \"Brian Earl Spilner\", is he assigned to find out who is stealing the merchandise. <br><br>This is my favorite film, it is an decent Action film about heist $1.2 million and not about the cars. Why I love this film? Because It is clever, intelligent, Entertained, fast paced and not boring film. The girls are beautiful in this team. The Action sequences are real and perfectly done. I love that late Paul Walker plays Brian O'Conner and undercover L.A. Police Officer who try's to do the right thing. I am Paul Walker fan and Brian O'Conner is my favorite character of the whole franchise and series. I am saying The Fast and the Furious is better than 2,3 and even 7 so the film is pretty good.<br><br>Paul Walker, Vin Diesel, Michelle Rodriguez and Jordana Brewster did a terrific job playing their characters.With these players set in motion, it's up to the script to deliver the real substance of the movie. (One often sees great performances in mediocre films..here the story transcends the performances -- an impressive feat.) The script delivers. These themes are reinforced by the fine performances by Paul Walker and, particularly, Vin Diesel. Diesel's Toretto is a tough, no-nonsense, street-smart and highly-skilled racer on the outside, but as O'Conner and the audience come to know him, it is revealed that he is a human being with feelings, a troubled and hard past, and doing his best to get along, even if it means skirting or breaking the law. He's the head of a household, and the patriarch of sorts of a gang that is more family than it is a collection of members. Diesel brings hard-nosed and gritty energy to the role, but compliments that with a softer, more accessible side that makes him an odd sort of antihero, a man clearly in the wrong but not maliciously or spitefully so. Walker, too, is excellent as the undercover officer that finds the world of underground racing not-so-seedy as it seems. <br><br>On the turbo-charged streets of Los Angeles, every night is a championship race. With intense full-throttle action, awesome high-speed stunts, and full-on pedal to the metal intensity, this fast and furious assault puts you in the driver's seat and dares you to exceed all limits.Los Angeles police officer Brian O'Connor must decide where his loyalties really lie when he becomes enamored with the street racing world he has been sent undercover to destroy.<br><br>It don't matter if you win by an inch or a mile. Winning's winning. <br><br>The Fast and the Furious is a gritty and gratifying cheap thrill, Rob Cohen's high-octane hot-car is a true rarity these days, a really good exploitation, the sort of thing that would rule at drive-ins if they still existed. The Fast and the Furious is a good Action movie. It offers a conventional plot but populates the story with well-developed primary characters that draw the audience in and make them care about their stories. In the movie, the line between good and bad becomes blurred to the point that, by the end, it matters not which side of the law the characters call home.<br><br>I love this film to death! It is my 3d favorite film in the series franchise. The Fast and the Furious kicks ass! Even for PG-13 film they kick ass! Brian O'Conner kicks ass!!!","user":"ivo-cobra8","rank":[95,105]},{"title":"There's something about Vin","rating":8,"date":"25 June 2001","review":"Every summer a film comes around that takes everyone by surprise.  Last year it was Scary Movie and I'm sure in 1977 it was a film like Star Wars and then in 1981 it was Raiders of the Lost Ark.  Now I am not saying that The Fast and the Furious is in the same class as Raiders and Star Wars, just that it surprised everyone on the same level.  F&amp;F is short on plot and dialogue and even some of the acting is lame, but what it is oozes is testosterone.  It pumps your blood, increases your adrenaline and attacks you with fast cars, sexy women and that one invariable that I think it has going for it... Vin Diesel.  There is just something about the guy, something that you really can't put your finger on, but he just has it. Maybe it is charisma, maybe it is charm, maybe it is just that he resembles some of the action heroes from the 80's with his chiseled triceps and his slabs of pecs.  Maybe it is all those things and maybe it is none of those things, all I know is that F&amp;F is exactly what I had hoped it would be and nothing more.  This is the summer movie that I have been waiting for.  It's not that the films that have been out so far aren't that great because some of them are, it's just that this is the one that epitomises what summer as a teen ager is all about.  It is no wonder that exit polls for this film were around 65-70% under the age of 21.  And maybe that is why I enjoyed it so much.  I am pushing 30 but isn't it cool to lose yourself in a film that reminds you what it was like to be in highschool.  And isn't it cool to watch street racers break 140 miles an hour wile they shoot NOS through their vehicles?  Well isn't it?<br><br>F&amp;F doesn't contain any machinations similar to a film like Mission Impossible and it doesn't dazzle us with special effects of impending doom like Armageddon did, but it takes us into a world where people live life \"a quarter of a mile at a time.\"  <br><br>Vin Diesel plays Dominic Toretto, a massive, bald mechanic that owns a garage but street races on the side to make some extra cash.  Paul Walker ( The Skulls, Varsity Blues) plays Brian Spindler.  He is a cop that has infiltrated the street gang to find out who is highjacking trucks and stealing all their merchandise.  There are about four rival street gangs in L.A. and one of them is pulling this off.  He has to figure out which one. Of course along the way he seduced by the life, but that is not what we really care about.  All we want to see is lots of racing, a few crashes, some fights and some sex.  F&amp;F doesn't disappoint.  If what you have seen in the trailers of the film excites and entices you, then you know exactly what you're in for.  This is not going to win any Oscars for anything but what it will do is entertain you.  It will expedite you for 90 minutes into a world where Honda's are souped up to look like Dragons and junkyard scraps are rebuilt from scratch to be better than they were before, better, stronger and faster.  If this film appealed to you in the commercial, it will appeal to you on the screen.<br><br>And of course there is Vin Diesel.  He first made a name for himself in Saving Private Ryan where he played Capparrzo.  Then he jumped onto the scene with his excellent and grandiose turn as Riddick in Pitch Black.  I think this is the film that got him noticed because no one had even heard of him before this.  Then he did Boiler Room and he showed a different side to him.  But F&amp;F is all muscle and sheer bravado.  I think Vin is going to do great things in the years to come.  He is not a nobody anymore.  This film will take care of that.  And face it, isn't it cool to see the genesis of a new action hero?  <br><br>8 out of 10-  The ultimate summer rush!","user":"baumer","rank":[93,121]},{"title":"Good","rating":7,"date":"23 February 2020","review":"A mindlessly entertaining film, The Fast and the Furious features fun action, sexy cars and women as well as having some cool characters. Don't go into this film expecting it to engage your brain though or any Fast and Furious film for that matter. Thank you Rob Cohen for starting this franchise!","user":"MR_Heraclius","rank":[41,51]}]