[{"title":"Surprise of the year! Impressive horror.","rating":20,"date":"20 July 2001","review":"Whoever marketed 'Ginger Snaps' should get some kind of award for sabotage! Looking at the packaging and it's name-dropping of 'The Craft'(??!) one would think you were in for your typical late 90s \"ironic\" MTV teen horror ala 'Scream' and the '..Last Summer' series, or some sort of 'Buffy' cash in. I nearly avoided watching it for exactly that reason. Am I glad I didn't! <br><br>'Ginger Snaps', while not totally perfect, is one of the freshest horror movies I've seen in ages, and one of the best werewolf movies of recent years. You can read the plot elsewhere so I won't bore you by repeating it. But I have to comment on the excellent script, with its realistic portrayal of teen life. No 90210/'Seventh Heaven' whitewash here! The teens act and talk like REAL PEOPLE, and the honesty about sex, drugs and puberty is rarely seen in contemporary movies, horror or otherwise.<br><br>\nI said not totally perfect because the climax was a let down. The last 20-25 minutes of the film lost its way a bit, and dragged in places. A bit more tightening up and a stronger ending could have made 'Ginger Snaps' a classic. As it is it's an original spin on an old concept, and highly recommended viewing!","user":"Infofreak","rank":[61,67]},{"title":"Ginger snapped alright!","rating":23,"date":"23 April 2004","review":"Somehow I had missed catching up with this almost \"underground\" flick although I had it mentally logged as one to check-out. (sorry, check 'oat'....it's Canadian) Addressed that problem yesterday when I picked up the dvd from a $5.95 bargain bin!<br><br>I'll keep it simple. This is, if not the best horror film I have ever seen...pretty damn close to it! It is the ONLY horror film that has ever \"touched me\" emotionally and that it achieved this is quite extraordinary. As a werewolf film it is simply outstanding - blows digitised crap like UNDERWORLD out of the water. The very budgetary constraints of the film HELPED ultimately - the director having to rely on old-fashioned \"acting\" to hold up viewer credibility. Although Isabelle is the \"Ginger\" of the title and she is soo damned good, it is Perkins as Brigitte that commands respect for her effort.<br><br>The Fitzgerald sisters with their fascination for 'staged horror' find themselves very much on the outer in the school social hierarchy. It is not until Ginger is bitten by a werewolf, in what is undoubtedly the most graphic and realistic lycanthropic savaging ever filmed...that they are forced even further into social isolation. What neither the sisters OR the film ever lose sight of however is their sisterly bond, itself consummated by a blood-pact at childhood.<br><br>There is nothing predictable or unoriginal about this film, from the script to the camera angles, right up to the heartfelt tragedy itself of Ginger's condition. And that is why this film leaves most other horror films in its wake - it is multi-dimensional with strong characterizations. Mimi Rogers even, in a smallish part as the girls' mother is spot on hitting the exact right note as a frustrated mother and increasingly unfulfilled wife.<br><br>The film weaves brilliantly the coming-of-age pains with the physical transformation brought on by the lycanthropic condition. Marvellous imagery of menstrual blood at critical moments.<br><br>Mention should also be made of Kris Lemche's role as Sam, the school druggie and the only friend they have, not that Ginger is interested. Somewhat Christian Slaterish in mannerisms, he contributes strongly to the film's success.<br><br>Superbly handled conclusion with both excellent werewolf effects and the saddest of photographic recollections....nothing one would expect to see in formula horror flicks devoted to this subject matter. The very last scene is both moving and inspired.<br><br>Obviously I am not alone in this perception. The film carries one of the highest rankings for its genre. I would personally nudge it up to a 7.5 but thats neither here nor there.<br><br>Why it received such limited theatrical release worldwide I cannot begin to imagine, but the production teams behind SCREAM, I KNOW WHAT YOU DID...., CABIN FEVER, TCM, DOG SOLDIERS and myriad other clones, should take a long hard look at this and find out HOW to make (and stage) a horror film with pretty much no money!<br><br>I would have considered that $19.95 for the dvd was money well spent!","user":"uds3","rank":[90,105]},{"title":"Superb teen horror movie ... almost perfect.","rating":9,"date":"6 April 2005","review":"The first thing you need to know before you watch Ginger Snaps is that's a real horror movie. That means genuinely unsettling, disturbing, makes-your-skin-crawl kind of stuff. And you're plunged right into this from the start. The opening scene involves a mother and her young son discovering that the family dog has been torn to pieces, bloody scraps and guts all over the back yard ... which pretty much sets the tone for the rest of the movie.<br><br>In a way it's not really that gratuitous. The whole movie is a metaphor for adolescence, which in itself is a pretty gruesome thing to have to go through. There are these two morbid sisters, Ginger and Bridgette, who are afraid of growing up so much that they have a suicide pact together. They are obsessed with death, and for art class they take photos of each other in disturbingly realistic fake death poses. Ginger begins going through puberty, has her first period, and whoosh! Cue the werewolf attack.<br><br>The initial changes she goes through are pretty common -- mood swings, bleeding, pains, hairy legs, growing a tail ... okay, maybe that last one isn't quite so common. Bridgette, along with a drug dealer named Sam who accidentally hit the original werewolf with his van, begin to suspect what's really going on and start thinking of how they can cure the disease of lycanthropy. The idea of werewolves is introduced early on, and the characters accept it pretty quickly after the things they see which means we can just get on with the story.<br><br>Karen Walton has written a fantastic script here, and John Fawcett proves himself a competent director. All of the leads are excellent in their roles, with the two lead actresses Emily Perkins and Katharine Isabelle expertly playing the disturbed Fitzgerald sisters with fantastic chemistry. Kris Lemche is also notable as the drug dealer, giving a performance reminiscent of Christian Slater's shining moment in \"Heathers\". In fact, the two movies are similar in tone in a number of ways, and both have become cult classics with very similar audiences. The special effects team, headed by Paul Jones who worked on such projects as \"Dracula 2000\" and \"Wolf Girl\", have also done a pretty good job, creating some great-looking physical effects, with blood and guts piling up in every passing minute. The design of the wolf itself is interesting and original, giving us something that we really haven't seen before.<br><br>And so, though not for the faint of heart, this dark and wonderful piece of work ranks as probably the smartest, most subtle and intelligent werewolf movie ever made.","user":"Teknofobe70","rank":[65,80]}]