[{"title":"Hulk","rating":5,"date":"24 February 2020","review":"Sappy, dry, dramatic and boring. Hulk (2003) has some aspects I like such as the three lead characters, the villain is meh, the Hulk scenes are pretty cool and it does have some interesting ideas. But this film is very slow paced, filled with pretty wooden dialogue and is too drama heavy rather than fueling us comic book fans with more action. Overall this film is a misguided attempt at a Hulk film.","user":"MR_Heraclius","rank":[39,44]},{"title":"Wonderful Piece of art - incredibly underrated","rating":8,"date":"23 February 2011","review":"In a time where superhero movies seem to come from the assembly line and standards are (sadly) set already it is hard to find gems that really transcend these paradigms.<br><br>Ang Lee made a different approach to the superhero genre - and the people didn't like it! Why? After Daredevil, Blade, Elektra, Aeon Flux, League of extraordinary gentlemen, Spiderman (yes, i mean it), Spawn, etc etc there are many parallels you can draw between superhero films. And Hulk is the only thing that the others aren't: un-American! In a very rare exception we have a film here that doesn't have the arrogance and straight-forward story that we seem to have gotten used to too easily.<br><br>Spiderman (in particular) follows the EXACT steps you can read in a tutorial for film making - that may be neat to watch but leaves no space for surprises or artistic inputs. Ang Lee seems to have taken especially this thought very seriously and created a piece of art that the average pop-corn-formula-film-liking movie-goer may find hard to digest. No doubt, this movie is not made for assembly-line-film-lovers - it is constructed very thoughtfully and goes beyond the interpretation of a superhero. It plays with the chaos that erupts out of the events rather than glorifying another world saviour.<br><br>There is no real good and evil, there only is an overcharge from both sides that don't know how to master the situation. The American movie-goer averagely wants black and white sides, a proud US-flag waving and a hero that saves the day (+nation and eventually the world, maybe even the universe). Nope, not in this one. While most of the other films establish superheroes as something that fits perfectly into our society, Hulk plays with the idea of what would happen if unknown uncontrolled untameable power surfaces - and that both sides act incredibly humane. At this point 80% of movie-consumers are out and 90% of movie-lovers come in (that number is small as we know).<br><br>I appreciated the rather unconventional storytelling, I admire the cast, I treasure the artistic hybrid of comic and reality and I enjoyed the portrayal of energy. Now, anyone who has seen Asian action films will find many parallels - the question is, are YOU ready to adapt to some of those standards when they are being poured over a western story? I was... And I was overwhelmed!<br><br>Anyone calling this movie the worst film they've ever seen (and there are quite few stating this) should stay with Spiderman, Transformers and Blade and get the same product over and over again (because they keep buying it). For my part I was grateful to see that there are people out there who get the chance to put a very distinctive stamp on their work making it unique and deep.<br><br>Five years later the audience won and an assembly line version was released, not as bad as some others but definitely not as creative and visionary as this one. Great job Ang!!!!!","user":"borkoboardo","rank":[145,185]},{"title":"The most underrated film of all time","rating":10,"date":"17 May 2019","review":"I first watched this film in 2003 when I was a little kid, despite it being a film more fitting for mature audiences I still understood it to a certain extent and enjoyed it. When the other Hulk film came out in 2008, I initially enjoyed that one more because it had more action in it and I was still too young to appreciate the story of the Ang Lee Hulk film fully. Then a few years later I rewatched Ang Lee Hulk and realised just how great it was and how underrated it was. My point is, only intelligent people realise how great this film is, and from my life experience I can prove that personally as I didn't like this film nowhere near as much during my childhood when I was of course less intelligent than I am now. If people were smarter on average the ratings for this film would be far higher.<br><br>I thought the CGI in this film was brilliant, especially for it's day. It's quite pathetic that with the new Ruffalo Hulk in the Avengers, they have millions more dollars to spend extensive CGI work done to that and newer technology but despite that Ang Lee's Hulk still looks better in my opinion. The Hulk in this film not only looks the most ferocious out of all the Hulk incarnations from films but it's also truer to the comics as well, in this film Hulk actually grows in size the angrier he gets unlike in the other films and his colour is also more accurate to the comics, more green and in general more of a better colour. Another reason why I think the 2003 Hulk character is better is because Hulk in this film seems to far more powerful than the 2008 version and more powerful than the new one, for example I can't imagine the Hulk from this movie losing to Thanos like the Hulk from the MCU did because this Hulk actually had unlimited power and clearly got much stronger the angrier he got.<br><br>A lot of people criticise this film because it doesn't have as much action of the Hulk smashing things. But that's part of the problem, if the typical Marvel fan got what they wanted then 90% of this film would've just been non-stop action involving the Hulk, but that's simply not what intellectuals crave, certainly not in that enormous quantity, of course though if it was like that then it would be hardly any different from a typical MCU movie of today but probably even worse. I think it had a good mix of action, drama and emotion in this film. If Marvel fans want mindless action then they should go see a random Bruce Willis flick instead, this film is for smart people who appreciate the sheer emotion this film dishes out.<br><br>I think Thunderbolt Ross was far better in this than the other Hulk films. The Thunderbolt Ross in the 2008 version was pretty much straight up villain whereas the one from this film was more like an anti-hero, a grey character, which made him all the more interesting. He actually had legitimate reasons to go after the Hulk which made the film more tragic. meaningful and memorable. The acting was superb, to the extent I think all the actors/actresses did a well above average job in this film with the possible exception of Jennifer Connelly, but her great looks make up for it. I was very impressed with the anger the actors portrayed, it seemed very real and realistic nothing like the so called anger MCU characters have in the MCU films nowadays.<br><br>The action scenes were superb such as the Hulk vs mutant dogs scene, Hulk vs the army and of course Hulk vs his Dad at the end. I liked the fact some of the camera shots were like a comic book and it also made fans connect closer to Bruce at the time, as his angry mind and eyes during those comic book scenes would've been all over the place so the comic book movie scenes really do help the viewer connect with Bruce in that regard. Eric Bana's Bruce Banner wasn't so geeky compared to Norton's and Ruffalo's Banner, and I liked that aspect. The 2003 Banner also had much more of a backstory than any of the others, and it certainly turned out to be an interesting background. The 2003 Banner is a far more complex character than the others, mainly due to his background, the 2008 one and Ruffalo version on the other hand, well we hardly hear anything of their backstories at all, at least the 2003 version has plenty of backstory information available to viewers.<br><br>Last but certainly not least I would just like to say that David Banner from this movie is my favourite Marvel villain ever Very complex villain and a lot more grey than people might initially think. It's very interesting working out some of his hidden motives in the film, I recommend fans of this film to watch the film again but watch it from David Banner's perspective, it's extremely interesting. David Banner was a very power hungry villain, that's the thing he cared about the most but his love for his wife and his Son when he was a small boy (before he tried to kill him and before he wanted to harness his Son's powers for himself) has made me sympathise for him which makes all the more interesting and tragic villain. I recommend this film to anyone who has a mind and has patience.","user":"jamesnicholls-58600","rank":[63,77]}]