[{"title":"Take 2","rating":8,"date":"17 May 2004","review":"John Singleton did an excellent job portraying a young African American urban male, who is not a gang member or a street pharmacist. Jody is just trying to live. I thought the opening scene was very artistic, didn't love it though. I loved the relationship between Jody and his best friend Sweetpea. Both are trying to live but with different ways to do it. But despite differences, they both have each other's back. I liked Ving Rhames character as well (Melvin). Melvin showed that the street mentality never leaves a street thug, but he can learn to make better and more positive choices. His character showed that anyone can make it in life, once they have accepted who they are and where they are going. The women played strong roles as well. Not the typical cinematic role for a black woman either. Both Yvette and Jody's mother, Juanita, proved to be strong black women in their own way. Excellent movie, a little sluggish once or twice, but whose life isn't?! Singleton kept it true to the game. No one's life is truly cinematic, if it was then we wouldn't need cinema.","user":"capitoldog","rank":[29,34]},{"title":"\"Baby Boy\" has value beyond stereotypes","rating":12,"date":"12 June 2002","review":"I really liked \"Baby Boy.\"  But maybe that's because I'm as white as they come.  I've just read some other User Comments here, and whether John Singleton does or does not dish-up nothing but stereotypes about blacks, I won't debate.  Look, I totally dug this film because of other reasons. While watching \"Baby Boy,\" I had two thoughts:  1) that I don't relate to the 'black' culture presented, but 2) this didn't matter because I did relate TOTALLY to a lot of the issues at the core of this story. Psychological and emotional issues about growing up, about cheating, about love, about undesirable characters working their way back into your life and screwing everything up.  And so on.  OK, I understand Users' complaints here about \"stereotypes,\" but I say to them, \"Don't worry about it... this white guy kind of thought the same thing, too, and so this movie didn't paint a picture for me of 'what all blacks' lifestyles must be.'\"  Dudes, all I saw were universal themes about, like I said, about love, about becoming a responsible adult, and all that.  White people go thru exactly the same shi.. stuff.  Those universal themes just happened to be wrapped up in some kind of black wrapping paper.  This viewer set that paper aside, and appreciated the gift inside.  This movie really pressed some emotional buttons with me, and I appreciated it.  [And by the way, we white people don't assume that all black people see all white people as the characters we are presented as in films: all the terrorists, rapists, mid-western nerd housewives, financiers, CEOs, trailer-trash, etc etc etc.  Why do (some of) you assume we think ALL blacks \"are\" as presented in films such as \"Baby Boy\"?  We don't.  Period.]<br><br>In fact, I could relate to the issues of this film's men AND women.  So, this script was universal in that way, too.  Anyway, here's all what I really wanted to say about this film:  All these emotional issues were brought to life by EXCELLENT performances.  (I say Ving Rhames is one of our best actors working in America today.  He is consistently excellent; I never see him \"acting,\" I always only see him \"being\" his character.  And his performance here in \"Baby Boy\" was Oscar-worthy, if you ask me). <br><br>\nI had no idea, until the ending credits, that \"Baby Boy\" was written and directed by John Singleton.  Honestly, while watching it (on cable) I was convinced that it must have been written by a woman, because it so perfectly expressed such poignant emotional moments.  Of course, the actors - and Singleton as director - can also share credit for those moments.  Also while watching, I had the thought that \"this is well-directed; who did this?\"  I guess my point here is [and this comment may annoy some Users here] that \"Baby Boy\" offers proof of Singleton's talents as one of those very good filmmakers who actually DESERVES the accolades critics and \"industry\" people give him.  [Although, I never saw \"Higher Learning,\" which Users here say stunk.]  Anyway, not the BEST film ever, but a solid 3 out of 4 stars. [Okay, one more word about the acting in this flick:  I'm an actor myself, and many of the performances here made me LOVE acting... there were nice meaty scenes and speeches here, and always so well done that it made me proud to be an actor.  (Especially one monologue by Mr Rhames -- phenomenal, Sir!).  Bravo to all this cast.]  Perhaps the best overall thing I can say about \"Baby Boy\" is that it left me wanting to see it again.","user":"Sardony","rank":[24,32]},{"title":"An intelligent and intensley emotional (including powerful) film by Singleton","rating":8,"date":"1 July 2001","review":"Baby Boy, the sequel-cum-remake of Singleton's last great feat Boyz 'N' the Hood, returns to the same neighborhoood 10 years later to look at new people in the hood, very personally at that, and it is fascinating.<br><br>The film stars in a debut of Tyrese Gibson (some may remember Cuba Gooding got his first speaking role with Boyz) as Jody, a boy (age 20) who still lives with his mother, is the father of 2 children from 2 different mothers, has no real job and often just hangs about complaining and being spoiled. The film looks at this character, but also the forces that sort of make him into what he is.  It is a really good character portrait that also has some really fired up performances from Ving Rhames, as a new ex-con boyfriend of his mother, A.J. Johnson as the mother, Omar Gooding (Gooding Jr.'s brother) as Jody's good friend, especially Taraji P. Henson in one of the best female performances of the year as Jody's girlfriend and also mother of one of his children, and of course, Snoop Dogg as a version of himself (albiet evil). It's a delight from the streak of not that good movies out now, and it should be able to appeal to both black and white audiences.  Definately reccomended.  A-","user":"Quinoa1984","rank":[18,25]}]