[{"title":"Slight and nothing new, but enjoyable nonetheless","rating":20,"date":"20 September 2003","review":"When a top secret camouflaged plane is stolen and hidden, secret agency BNS needs to get an agent into Hungary to uncover and prevent the sale of the weapon.  Agent Alex Scott is selected to go undercover with civilian boxer Kelly Robinson and use his upcoming fight to gain access.  However Kelly is less co-operative than first hoped and the mission risks being compromised. Can they stay out of trouble long enough to stop the sale?<br><br>Take a little bit of Shanghai Noon, a little bit of Rush Hour, remove the oriental spice from the stew et viola!  you've got I Spy!  By mixing the essence of Jackie Chan's sidekicks from both these films and putting the resultant stew into a comedy spy movie you have this enjoyable if unspectacular film.  Wilson does his usual stuff but is still effortlessly funny, Murphy does his best Chris Tucker impression and does a good job playing a little dumb and is funny as well.<br><br>The plot sees them doing, well, it doesn't really matter what they're doing, just that Wilson is Wilson and Murphy is playing up to good effect!  The plot just about provides enough material to keep the film going, but the odd moment where the comedy banter quietens down, the weaknesses of the plot are immediately laid bare.  This is not to say it isn't good enough for this type of film, but just that at times it is all very slight and a bit thin. The comedy is more based on banter than anything else, so if you like the two aforementioned Chan movies then this should be enjoyable as the humour is of the same vein.<br><br>The support cast are all pretty average.  Janssen does an OK job looking pretty but Malcolm McDowell just shows his face to no great effect.  The funniest cameo is Gary Cole who plays an Irish spy playing a Cuban  he is just so unexpected in his actions that I had to be amused (of course he is helped by Wilson'' reactions to his character).<br><br>Overall this was kinda overlooked at the UK box office and I think it was because it was very slight and flimsy.  However for gentle laughs based on good banter rather than set up jokes, this is a surprisingly fun comedy despite not sticking in your mind for longer than 15 minutes after you watch it.","user":"bob the moo","rank":[26,33]},{"title":"Hilarious sometimes, annoying at others","rating":18,"date":"18 July 2003","review":"\"I Spy\" is an action comedy starring Owen Wilson as the opposite of your usual James Bond, and Eddie Murphy as the cocky boxer assigned to help him. Wilson and Murphy are pretty funny together, but sometimes their constant arguing gets overdone and rather old.<br><br>Still, the two have good chemistry and you will always be sure to laugh when you put on \"I Spy\".  About the action, well, it's okay.  It sure isn't as good as \"Bad Boys\" or \"Bad Company\", but that's not really what this film is geared for anyway.  Plus, Murphy and Wilson are STILL ARGUING during the action (this is when it gets old!).<br><br>Entertaining, but a little annoying, I give \"I Spy\" a 6.5/10.","user":"NoArrow","rank":[20,25]},{"title":"A Decent Laugh","rating":5,"date":"10 January 2003","review":"I always liked Owen Wilson and Eddie Murphy, so I thought, in case the movie is worth nothing, I'd still get to see some friendly faces. For better or worse, I can say it was about what I expected.<br><br>I put this movie in two categories, and I think I placed it right: it's a decent comedy, with parts attempting to live up to an action movie. At its heart though it tries to be comedic and funny, so that's upon what it should be judged. Thankfully, you will get the chance to laugh out loud, but unfortunately not as much as you'd like to laugh out loud at a comedy. I won't even mention rolling on the floor. <br><br>The story isn't something really new, but it has quite a few humorous plot twists. The so-called funny character is Kelly, who really inflicts a fair amount of pain on his adversaries, but he is just such a nicely drawn, egocentric guy, that it actually works on a comedic level. It's always just about him, and him and then some more. <br><br>The actors have their charm but I won't really dwell on this as they are as high profile as it gets, Hollywood style, so you know what you get. Perhaps Wilson could have spiced up his game with a bit of the unexpected, but all in all he does what he does best.<br><br>I did feel a bit let down by the special effects, with some flimsy looking explosions placed here and there. However, the host city of Budapest looked really gorgeous throughout, making it well worth it's money shots.<br><br>To draw the line, the film isn't great, but it's fine enough. No brilliant ideas, or anything like that, just the usual comic stuff.","user":"tributarystu","rank":[35,48]}]