[{"title":"Stunning","rating":19,"date":"19 April 2003","review":"I was lucky enough to see this in the theater in the United States when it first came out. I had seen a few Shahrukh Khan films on tape (thanks to a friend), and when I noticed \"Devdas\" in the online movie listings, I decided to go have a look at what would be my first Hindi film in a theater. I was the only Anglo in a packed house and I aroused as much curiosity as I felt.<br><br>I was completely blown away by Devdas, from the first moment of the opening credits to the last bitter tear on Paro's cheek. Every shot, every frame of this film is like an artist's canvas. Aishwarya Rai is breathtakingly gorgeous, Madhuri Dixit's quiet beauty increases with each scene, and Shahrukh has never looked so good. All the supporting actors are incredible, particularly Jackie Shroff as Chuni-babu and Kiron Kher as Paro's mother.<br><br>The sets and the costumes are fabulously opulent...almost too fabulous, in fact, and at times threaten to overwhelm the story. But I was far too enthralled in the theater to do anything but gasp in open-mouthed wonder, and enjoy.<br><br>The story of Devdas, a famous Indian novel written in the 1920's by Saratchandra Chattopadhyay, has been made into film numerous times by Bollywood. It is about the spoiled son of a wealthy man, who is loved by Paro, his lower caste neighbor and childhood playmate. Devdas is a weak, aimless sort who is blown about by destiny, never taking action until it is too late. He is unable to recognize his love for Paro until she has been married off to an older man and is lost to him forever. He then turns to the bottle, and to the prostitute Chandramukhi, for comfort and forgetfulness.<br><br>This story will probably be hard for westerners to relate to...there is no corresponding literature of the west that I can think of...perhaps Romeo &amp; Juliet is closest. Bhansali's version differs in many respects from previous versions, and from the book, in that Devdas is a more forceful presence who declares his love for Paro, only to be kept apart by scheming family members. In the novel, however, it is Devdas' own flawed character that keep the lovers apart. He is simply too weak and indecisive to know what he wants until it is taken away forever.<br><br>Having seen the earlier Dilip Kumar/Bimal Roy version, and read the novel, I can say that Shahrukh Khan truly made the character his own and breathed a new life into Devdas, making him more lovable, and more a victim of fate than of his own tragic weakness. In the novel, and in the earlier Bimal Roy film, Devdas has almost no personality at all...he moves through the story like a mere shadow, and we only see his character reflected in the love of the two women who worship him.<br><br>Much attention has been given to Aishwarya Rai for her performance, which I agree was outstanding. She is almost inhumanly beautiful in this film. When I saw this in the theater I was in half love with her myself.<br><br>But it was Chandramukhi who haunted me after the film was over. Madhuri Dixit deserves much, much more attention than she has received for her wonderful performance, which has been relegated to a \"supporting\" role, when actually her role is every bit equal in importance to that of Paro. Chandramukhi is the only character in the film who is completely unselfish in her love...her love is the purest of the three, because she loves with no expectation of being loved in return. While Devdas and Paro are busy destroying each other's chances for happiness, Chandramukhi's love is always uplifting and positive.<br><br>Besides the award-winning performances (Devdas swept all the Bollywood popular awards in 2003) and the fabulous sets and costumes, Dedas has one of the best music scores I've ever heard, and dance numbers to match. I wished the opening number, Mere Piyar (performed by Rai), could have gone on forever, and toward the end Dola Re Dola (performed by Dixit and Rai) is a treat. Some viewers felt that the up-beat drinking song Chalak Chalak (performed by Khan, Shroff and Dixit) was out of place in such a dramatic story, but it is my favorite number in the movie.<br><br>There are so many things to recommend this film, I could go on, but I will just call it a masterpiece of Indian cinema and leave it at that.","user":"dmul53","rank":[113,126]},{"title":"lavish and dazzling, another classic","rating":9,"date":"10 March 2004","review":"I have not seen the other previous versions of Devdas, but as far as this Devdas goes, I can say that it is really difficult to transform such an old and popular story into such an amazing film without being boring, and the director has successfully managed this task.<br><br>\nThe set decorators, choreographers and the costume designers must be lauded very very highly. It is truly amazing and a real pleasure to just even observe these three elements. Of course, Aishwarya Rai (Parvati) is so incredibly beautiful, the camera loves her, and she sparkles like a diamond. Still, (also credited above Aishwarya) Madhuri Dixit (Chandramukhi) is the real acting talent.<br><br>\nI had great pleasure watching this lyric melodrama, although it lasted about three hours, it deserves all kinds of appraisal.","user":"leandros","rank":[42,49]},{"title":"A Bittersweet Classic","rating":9,"date":"9 August 2004","review":"Gloriously excessive Bollywood epic starring former Miss World Aishwarya Rai. Set in the 30s and sumptuously shot, it follows a lovelorn suitor's slide into alcoholism and despair <br><br>Bhansali's film boasts the biggest budget for an Indian film ever and boy, does it show. An extravagant tale of love, loss and serious drinking, it operates on a scale previously unseen in Bollywood. <br><br>Essentially a tragic love triangle, the story follows tortured Devdas (Khan) as he mucks things up with childhood sweetheart Paro (Rai), meets courtesan Chandramukhi (Dixit) and then drinks himself to death. A spirited anti-hero, in India his name his synonymous with a sort of heroic failure.<br><br>\nEverything about the film - costumes, sets, songs and sentiments - is larger than life and the sheer spectacle demands respect. The musical numbers cast Devdas and Paro as the mythical lovers Krishna and Radha. Cheeky, sexy and dizzyingly complex, the dancers display astonishing energy and precision, whole sequences shot from above to resemble the shifting patterns of a kaleidoscope. <br><br>Certainly there are moments of daftness. A half-cut Devdas resolves a financial dispute by setting fire to a sofa, for example, and nobody tries to stop him. But there's also humour, style and a conclusion that's plenty teary. As Western directors continue to look to Bollywood for inspiration this is a shining example how it should be done. Intoxicating.<br><br>\nVerdict Starts big, gets a whole lot bigger then gets twice as big after that, this is Bollywood at its most flamboyant. The song and dance numbers alone are worth the price of entry and whether you're familiar with the genre or not this is irresistible from start to finish.","user":"ginger_sonny","rank":[39,47]}]