[{"title":"Not bad, but not great","rating":5,"date":"9 May 2008","review":"Some movies are made just for action, some just for story.<br><br>Unfortunately, the Hunted doesn't seem to fit either category.<br><br>There is not much depth to the story here, although they try hard to make it seem that way.<br><br>Simply: A killing machine is on the loose, so they send the guy who trained him to get him. No side story needed to forward the plot.<br><br>Tommy Lee Jones gives a decent performance as L.T. Bonham, the \"hunter\". Nothing spectacular, but not bad either.<br><br>Benicio del Toro gives a good performance as Aarom Hallam, the killing machine who does not give much purpose as to why he IS a killing machine.<br><br>Connie Nielsen and Jose Zuniga are OK as FBI agents Durrell and Moret.<br><br>There were some great action scenes, and a few interesting moments. I wouldn't call them extraordinary though.<br><br>Over all: OK movie. Watch if you have nothing better to do.<br><br>5/10","user":"emperor_bender","rank":[22,25]},{"title":"No Middle Ground","rating":1,"date":"1 July 2004","review":"This is one of those movies that people will either love or hate. It has it's flaws for sure, but this movie speaks to primitive, macho mano-a-mano movie lovers.<br><br>How realistic the knife fights are in this movie remains to be seen, although kali, the martial art used as the base for the fight scenes, is a powerful fighting style. But they are exciting to watch, and both Jones and del Toro inhabit their characters with enough gusto and panache that the movie can be very enjoyable to watch.<br><br>It definitely won't be everyone's cup of tea, but the Hunted will make lots of action movie and martial arts movie fans pleased and satisfied.","user":"terenceallen","rank":[66,85]},{"title":"let me explain the low scoring reviews","rating":3,"date":"12 February 2012","review":"Here are several reasons for the low scoring reviews, for those of you who thought it was terrific. Watch again and tell me that any one of these is incorrect (NOTE. I'd warn about possible spoilers, but if you're actually thinking about what you're watching, you'll see the following plot elements coming).<br><br>The repetitive chase (hunt, find, fight, escape, hunt,find,fight,escape, huntfindfightescape) leaves little room for character development, e.g. what was it ABOUT his war experience that made Hallam decide to kill irreverent sport hunters? Do he and Bonham feel a father/son bond for each other, and if so when and why did that come about?<br><br>The sloppy digital effects (Tommy Lee's flailing torso spliced into the waterfall, flashes of Benicio's face spliced onto the fountain's cascade, as if he were in the cavity behind it.<br><br>Really? You're going to stop in the middle of the chase to forge a knife from scrap iron? Really??? You know how long that would take, and how noisy? So Bonham doesn't like guns, he's gonna knap one from flint rather than ask an agent for a combat knife? In the middle of a pursuit? REALLY????<br><br>The battlefield Kosovo set looked like a cross between Disneyland and Colonel Kurtz' most apocalyptic delusional nightmare. Too many pretty explosions, overstuffed setting, too populated by extras (who don't even react to the pretty explosions occurring feet away), too designed and manufactured looking, etc.<br><br>Yes ,the knife fight scenes were well choreographed, bloody, and inventive, with nice portrayals of effort and gravity (no wire work or movieland physics), but they needed to be cut more tightly. The way aging Tommy Lee broadcast his moves, Benicio would have filleted him like a fish, nine ways to Sunday.<br><br>If there's a deeper message to the film (Show some respect for the beings you kill, Honor thy Fatherfigure, whatever) it's trampled as badly by the pursuit as the ground is by the set dresser making blatantly overdone footprints for Tommy to \"track\".<br><br>I'd add more but this film's hardly worth it.","user":"psuddeth-290-884139","rank":[47,64]}]