[{"title":"whacked-out comedy with a lot of laughs","rating":1,"date":"1 September 2002","review":"`Austin Powers in Goldmember' provides us with an hour and a half of inspired silliness.  Not all of the film's elements work equally well, of course  a seemingly common occurrence in even the best of comedies  but this third in the series of popular spy spoofs generates more laughs than almost any other movie released in 2002.  <br><br>Prime credit goes, of course, to Mike Myers, who both co-wrote the screenplay and inhabits no fewer than four of the movie's main characters. By this time, Myers has become so adept at his characterizations that watching him at work and at play here provides one of the prime pleasures of our viewing experience.  Also in attendance are the usual suspects:  Verne Troyer as Mini-Me, Michael York as Basil, Robert Wagner as Number 2, Seth Green as Scottie and Mindy Sterling as Frau Farbissinia.  Folks added to the brew this time around include Fred Savage, Michael Caine and Beyonce Knowles as Foxxy Cleopatra, a bad-ass soul sister brought back from 1975  Afro hairdo and all - to help Austin rescue his kidnapped father and prevent Dr. Evil from yet again trying to destroy the world (this time by using a giant meteorite to melt the polar ice caps and flood the earth).<br><br>Co-written by Michael McCullers and directed by Jay Roach, the film has the good sense to throw caution to the wind and give Myers free rein to indulge himself in his own brand of inspired lunacy.  The film starts off with a deliriously clever and funny opening credit scene in which many of Hollywood's biggest names make surprise, good-natured cameo appearances. That sense of unbridled fun carries through pretty much the entire film, although there are, as to be expected, ideas, bits and jokes that seem less effective than others.  As with the two previous films, this `Austin Powers' suffers from the unfortunate tendency to both repeat and explain too many of its jokes.  Sometimes you do find yourself wishing that the writers would put a bit more faith in the audience to get the humor the first time around. Still, there seems to be much less of that in this particular episode, and there are plenty of laugh-out-loud moments to more than compensate for the occasional  though not all that frequent  clunker or lull that manages to sneak its way in there from time to time. <br><br>`Austin Powers in Goldmember' wallows a bit overmuch in the sordid moments, the gross-out gags, the locker room and bathroom humor that have become, alas, the hallmarks of the modern comedy.  In short, this is probably not the film to take the family to see if your family includes impressionable children and/or easily offended adults.  The sexual and scatological meters run into the red zone rather often in this film.  <br><br>Nevertheless, `Austin Powers in Goldmember' works well if you enjoy a comedy where the actors seem for once to have been actually having a fun time while making it.   Their infectious joy spills off the screen in a way that it doesn't in movies like `Mr. Deeds,' `Men in Black II' or, perish the thought, `The Master of Disguise,' to name just a few of the comedic bombs that have been foisted upon the unsuspecting public this summer.  In contrast to the makers of those films, Mike Myers knows how to deliver the goods and, in the process, give his fans their hard-earned money's worth. Reserve us a seat for the next installment.","user":"Buddy-51","rank":[66,86]},{"title":"The weakest of the series, but Myers still has his mojo","rating":7,"date":"4 May 2010","review":"After thoroughly enjoying the first two Austin Powers movies, they were daft but enormous fun, I watched this third instalment. I was disappointed admittedly, but I enjoyed it nonetheless. The plot takes the whole meaning of daftness to a whole level, so some of it verges on ridiculous, and while Mike Myers is brilliant as Austin and Dr Evil, he overdoes it as the Dutch villain Goldmember and the cameos are very hit and miss. That said, the sets and costumes are still wonderful, the soundtrack is groovy and the script is comedy gold with the cool catchphrases, bad-taste buffoonery and surreal slapstick. In terms of supporting performances Beyonce Knowles is a knockout as sexy and sassy Foxxy Cleopatra and Michael Caine is a dentally-challenged delight as Austin's dad. Seth Green is also fun as Scott Evil. Overall, an inferior sequel, but it was still a lot of fun, with Myers still having his mojo. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[16,20]},{"title":"Austin's Anatomy","rating":8,"date":"21 January 2007","review":"While the first two Austin Powers films in this comedic series concentrated on spoofing the late '60s/early '70s, James Bond movies and concentrated on female anatomy in the process, this one was centered on penises. I kid you not. (Hence, the title, a play-on-words from \"Goldfinger.\") <br><br>I watched this film twice, within two weeks of each as I showed a friend the second time. The first time I thought it wasn't as funny overall as the other two Powers films and was a bit too raunchy, especially for the PG-13 rating which is ridiculous. After the second viewing, I changed my mind about the comedy (not the rating): it is just as funny if not more than the other two.<br><br>A couple of the scenes were hilarious, although very crude in spots but some of the crudeness is what makes it funny. However, most of time I laughed more at the many subtle double entendres and all the double takes by Mike Myers, who plays at least four characters in here...all of them very well.<br><br>It's goofy, stupid and nothing spectacular but definitely fast-moving and entertaining. If you've seen the other Austin Powers films, you know what this basically is going to be, humor-wise.<br><br>Beyonce Knowles, who played the female lead, didn't have the beauty or body of Heather Graham or Elizabeth Hurley, stars of the other two films, but she isn't bad. There are numerous cameo appearances in here, starting right off the bat with Tom Cruise.<br><br>Overall: sick (again) but funny (again.)","user":"ccthemovieman-1","rank":[49,73]}]