[{"title":"Funny, likable, lightweight comedy","rating":7,"date":"26 December 2001","review":"This is not a biting Hollywood satire, and I'm sure there were some missed opportunities to poke fun at the biz.  But as long as that's not what you're expecting, you should have lots of fun.<br><br>I'm an avid Billy Crystal fan, and though he's not the star of the film, I was really looking forward to this movie--being that he also co-wrote the script.  There are some trademark zingers you'd anticipate from the Oscar's favorite MC:  \"Sixty pounds?  That's a Backstreet Boy.\"<br><br>\nThe cast is superb.  Hank Azaria, like always, steals the show.  He is absolutely hilarious as Catherine Zeta-Jones' new Spanish lover.  There is a great scene near the end where he gets outraged at a rumor of his inadequate \"size.\"  Just like his role as the flamboyant butler in \"The Birdcage\" he brings out tons of laughs, taking on a phony accent.  He really is a man of extraordinary talent.  John Cusack shows us his more...goofy side.  I've always enjoyed him in past movies, but he usually plays the straight man. This was something different.  Well, I guess you can say he plays the straight man, but he stumbles into all sorts of slapstick situations that causes him to overreact in comic fashions.  And he's great at it!  Julia Roberts is...well...Julia Roberts.  I have nothing against Julia, but I don't patronize her in the same way others do.  I don't think she's the most beautiful woman and I don't think she's the most brilliant actress.  But I'm sure many were looking forward to this movie because of Julia, and if you're one of those people, you won't be disappointed.  Catherine Zeta-Jones is extremely beautiful, but she is so great as the whiny, bitchy ex-wife of Cusack/spoiled actress that I wanted to stab her every moment she was on screen.  Alan Arkin is funny as the pretentious, preposterous spiritual healer.  There is a great deleted scene with him and Cusack over the phone, while Arkin rides the streets of Vegas in a pink convertible.  Those renting the DVD--don't skip the deleted scenes!  And last but not least, Christopher Walken (Da Man!) has a brief but memorable appearance as reclusive director Hal Wideman.<br><br>Don't expect any surprises.  The story's as predictable as can be.  The whole movie is superficial fluff.  But it's enjoyable superficial fluff. If you just want to kick back, have some good laughs, without having to kill any brain cells--curl up on the couch with your man or woman and watch \"America's Sweethearts.\"<br><br>My score:  7 (out of 10)","user":"mattymatt4ever","rank":[42,51]},{"title":"Translates to the small screen well","rating":7,"date":"12 April 2002","review":"When I saw this movie in the theater, I left a bit disappointed, which is hard to say because I love Julia Roberts.  For some reason, it just did not click.  However, when it came out on video, I watched it again and I laughed so hard I couldn't believe it was the same movie.  It just worked so much better at home on the small screen.  So my advice to anyone who saw it in the theater and was not struck by it, try it again as a rental and you may be surprised.  And of course, if you haven't seen it, I do recommend it, for it is a fun movie and is actually quite entertaining, especially if you like the stars, which most people do.","user":"joshuastephen4","rank":[15,17]},{"title":"A good Fun Movie","rating":7,"date":"23 December 2006","review":"Gwen (Catherine Zeta Jones) and Eddie (John Cusack) are America's favourite sweetheart couple, but since breaking up Eddie has had a breakdown and Gwen's career is floundering. Their latest movie is shortly due for release and their press agent Lee (Billy Crystal) with the help of Gwen's sister Kiki (Julie Roberts) have to get them back together and promote the movie.<br><br>Written and produced by Billy Crystal 'America's Sweethearts' is a good giggle, and has some fine performances from Cusack, Crystal, Roberts and Jones (Although Catherine Zeta Jones's performance as a press hungry b*tch, is maybe a little too believable). For me though the ending makes the movie, its not entirely what your expecting and Christopher Walken, helps to bring the closing scenes to life, with his patented brand of acting genius.<br><br>Worth a watch 7/10","user":"mjw2305","rank":[18,21]}]