[{"title":"What is everyone complaining about?","rating":8,"date":"21 July 2005","review":"I've owned this movie for a while, and only needed to see it once before deciding to run to the store to buy it. As a matter of fact, I'm watching it right now, but I got on here and looked it up because I wanted to see what other movies the writer had written (unfortunately---it's the only one.) After looking at the ratings and comments I had to voice my own opinion.<br><br>\"The Wedding Planner\" has everything you could ask from a romantic comedy. Predictability is always a factor, but come on! Do we really watch these types of movies expecting to be surprised at the ending? This film is quirky; all the actors and actresses don't miss a beat and they keep it real. No matter how many times I watch it, I still find something to laugh or smile at.<br><br>I haven't yet met a MAN that likes this movie, but if you're a girl that wants something sweet, funny, entertaining, and the \"romantic dream\"..... in other words: a flick you watch with a pint of ice cream ( =P ) then this is the one for you.<br><br>The directing is great, the dialog is entertaining, the acting is enjoyable, the movie over-all is fantastic. It's just sweet...even my mom likes it! O_O<br><br>Honestly, stop judging the movie like you're some kind of almighty critic, and watch it for what it is. If you don't like the genre, then pick something else to watch ^_^ Me? I'll stick with \"The Wedding Planner\".","user":"TylerDurden_FC","rank":[64,90]},{"title":"Cant give it negative","rating":1,"date":"11 December 2002","review":"Seriously, this movie gets about a negative 20.  Jennifer Lopez has always been a mystery to me, why does she do acting?  She's obviously awful at it. The characters are pretty flat, the story is painfully predictable and upsettingly trite.","user":"reinx","rank":[11,13]},{"title":"Brutal and excruciating","rating":1,"date":"7 August 2001","review":"The only thing more baffling than how movies this bad could ever be made is how movies this bad could go to #1 in the box office. I despair for humanity at times. The Wedding Planner features a rehashed and unoriginal plot, poor acting, no funny moments, and a ridiculous scene where Jennifer Lopez is prepared to risk getting flattened by a runaway dumpster in order to pull her shoe out of a hole in the street. riiiiiight!","user":"GMeanie","rank":[13,16]}]