[{"title":"Good escapist entertainment","rating":8,"date":"1 November 2003","review":"I think people have been a little to harsh on this movie. No it is not revelatory but it is a nice glossy diversion. The all-star cast, especially Hugh Jackman, is more than competent though they aren't really challenged. There are enough special effects and stunts intermixed with a fairly compelling narrative (it is not confusing if you just pay attention) to make the film more than worthwhile. Overall good entertainment, 7/10.","user":"perfectbond","rank":[57,73]},{"title":"Cool, Slick and Sexy","rating":8,"date":"4 February 2005","review":"What is the highest pressure job interview you've ever had?<br><br>Well, Stanley Jobson (Hugh Jackman) a convicted Hacker, fresh out of prison and desperate to see his daughter again, can beat you, i'll bet on it. He has to hack into the FBI Computers in a fairly public place, with a gun to his head and a beautiful woman performing an act of Felacio on him, and he has just one minute to do it. (A Great Scene, Not Explict, just cool)<br><br>Anyway, he is recruited by John Travolta to hack into a dormant DEA Fund worth 9.5 Billion Dollars to finance his terrorist activities.<br><br>Full of Slick Dialogue, cool Direction and the simply gorgeous Halle Berry, this turns out to be a very enjoyable Thriller, with some clever twists (some of which don't quite work) but are forgivable anyway.<br><br>Not a classic, but a good film none the less. 8/10","user":"mjw2305","rank":[101,141]},{"title":"A lot of style and action, little substance","rating":6,"date":"26 February 2007","review":"This movie can be summed up as: lots of very cool action scenes (fans of both bullet time and explosions will really enjoy this), a lot of style, and a standard implausible plot. This movie is very entertaining if you like non-stop action in a cool high-tech environment.<br><br>The ingredients are pretty standard. There's a stylish kick-ass villain (Travolta) with a plan, being a high-tech bank robbery. This is all garnished with lots of weapons, technology, car chases and beautiful women. This movie really delivers on the action front, I don't think there's any 'quiet' scene that lasts more than 2 minutes. It also contains the now standard implausible hacking scenes, where getting into the computer system of a bank involves solving a kind of Rubik's cube on your computer screen. I hope you're not offended by product placement because a certain computer brand is quite prominent when IT hardware is involved in this movie. But it's by far not as obnoxious as in \"I, Robot\".<br><br>The filming is top-notch, unlike some other movies you can actually see what's happening in the action scenes (which is sometimes due to the amazing slow-down effects in some scenes). Unfortunately the entire plot becomes quite thin when the movie is stripped of all this action and style. However, it works. The ending is rather vague, as if room was left for a sequel without making it too painful if there wouldn't be one after all.<br><br>Overall I would say this is a pretty OK movie, but don't expect the best cinema ever.","user":"DrLex","rank":[34,45]}]