[{"title":"OK, i'm sticking my neck out for this movie","rating":7,"date":"8 October 2005","review":"The only problem i found about \"Thirteen Ghosts\" is that it is not scary. It has the elements to be a horror movie, the ghosts, the gore, but it is not frightening at all.<br><br>So this film can be a real party pooper if you're watching it with the lights off at your girlfriend's house waiting for her to grab your arm through the hard scenes, or expect to enjoy having some nightmares about it. But, omitting that--yeah, i know it's hard to omit that a movie labeled as \"horror\" is not scary--, i judge it as a very interesting film. The production design is great; the glass house is a state of the art, away from your typical haunted house, looking both luxurious and somehow creepy at the same time. That innovation, carried out with such a splendid result, is worth my applause. So is the decision to make the ghosts be real actors in the set, not digital freaks. Human monsters, even if having to go through 4+ hours of make-up sessions, even if having to use a double amputee actor to play a particular ghost, are the film's best trump card. There are good ideas in this film, and they're very well developed. It doesn't deserve a bad score.","user":"el_EdGaR_again","rank":[95,120]},{"title":"A fun movie...","rating":24,"date":"24 October 2001","review":"The movie was fun. It wasn't a horrible flick my any means. The acting didn't make me want to leave, which is a definite plus for a horror movie. I thought the computer graphics were impressive. The ghosts were definitely freaky, and yes, I jumped a few times. I rarely jump in horror films, but this one I did...more than once.There were times where it was predictable however. This didn't take away from the entertainment factor though. I mean, this film isn't going to win any Academy Awards for best picture or anything, but it was a fun film. If you're looking for something to do this Halloween, take your friends out to see it.","user":"CambotORiley","rank":[82,110]},{"title":"A lot better than I expected","rating":7,"date":"26 January 2002","review":"It doesn't rely on too much splatter and it doesn't try to startle you out of your seat every two minutes so that immediately makes it better than the average horror flick. The ghosts were unusual enough to be memorable and there was not a lot of familiarity to the plot. This was very nearly an excellent film with a solid cast and very good effects. Five or ten more minutes of scary interaction between the ghosts and the children(if you can call Shannon Elizabeth a child) would have made the movie much better. I call it a near miss which is as good as most horror fils can aspire to.","user":"kismit","rank":[24,31]}]