[{"title":"Gorgeous, but leaves you wanting more","rating":7,"date":"17 September 2001","review":"When you sit down to view Blood: the Last Vampire, the style and setting of this gothic noir anime grabs you instantly.  Using a mixture of animation cells and computer-generated backgrounds, this is an effortlessly stylized visual breakthrough that hopefully will launch future endeavors in the style.<br><br>The problem with this particular film, though, is that it is far, far too short.  At just over forty minutes filmed length, the story of a strange girl called Saya that seems to be some sort of vampire slayer barely gets the ball rolling on the enigmas behind this girl, the organization she works for, and the beasts she vows to slay before fading into the end credits. This makes you sit back, blinking at all the dazzling visual beauty that went into this well-crafted film, and wonder, 'what next?'  Hopefully, there will be further adventures of Saya and the dingy, grimy world she lives in, each as well-designed as this one was, though with much more payoff.<br><br>All in all, worth looking at if only to see what the future of animation might look like.","user":"kmberger","rank":[13,13]},{"title":"Great Film, But A Little Short....","rating":8,"date":"8 September 2001","review":"When I picked up the DVD, it said on the back 80 minutes, so that's what I expected.  Instead, I ended up with a 45 minute film.  The other 35 minutes has been reserved for the \"Making Of\" and the trailer  (Actually, the \"Making Of\" was only 20 minutes.  Where did the other 10+ minutes go?). That said, \"Blood: The Last Vampire\" is very much like a roller coaster: Very fast, a lot of fun, but over before you know it.<br><br>The first three minutes drew me into the whole story very quickly.  It has an impressive beginning, a moderately slow-paced lead up, but once the action starts, it becomes very, very cool.  I guess that's why after the last battle, I was expecting more, and when it started rolling credits a few minutes after \"officially\" revealing Saya's history, I was expecting this new (but obvious) information to start adding into the story and her character.  In the age of 2-3 hour epics, the abruptness caught me off guard.<br><br>But enough harping about the short film aspect.  This is an enjoyable film to watch for its pacing, visuals and sound.  The music was very dark and atmospheric, and I thought the voice acting for Saya was good.  The CG in the film leads to some very cool effects, but as strange as this sounds, some of its realism (especially with the plane scenes) offsets the animated look.  It was an unusual combination of \"CG realism\" and animation.<br><br>All in all, \"Blood: The Last Vampire\" is worth a watch.  It has a lot of really good things going for it, and I'll definitely show it off to friends. Recommended","user":"GuyCC","rank":[26,29]},{"title":"Poor Development of the Lead Character","rating":6,"date":"2 October 2013","review":"In Japan, the vampire-hunter Saya, who is a powerful original, is sent by her liaison with the government, David, posed as a teenage student to the Yokota High School on the eve of Halloween to hunt down vampires. Saya asks David to give a new katana to her. Soon she saves the school nurse Makiho Amano from two vampires disguised of classmates and Makiho witnesses her fight against the powerful demons.<br><br>\"Blood: The Last Vampire\" is an animation of 48 minutes running time with the tormented and skilled samurai Saya. The story is too short and has a poor development of Saya, especially for those that do not know the character. I saw the movie \"Blood: The Last Vampire\" (2009) a couple of years ago and the character Saya is better developed. My vote is six.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[10,10]}]