[{"title":"Surprised me","rating":8,"date":"3 January 2005","review":"I caught five minutes of this then decided to watch more of it and I was pleasantly surprised at what a superb actress Kirsten Dunst is! She is so natural and at ease in front of a camera. The chemistry between her and the boyfriend is the best you will ever see and that's why I watched this movie. I felt like I was eavesdropping in on two young teenagers throughout the whole movie. The story is very simple and just chronicles the life of these two high-schoolers who fall in love by pure chance (the romance is instigated by Dunst and she does a great job). I think everyone will be able to relate to the characters and story in this movie. These are real-life characters and they are not overly stereotyped which was surprising, as well. The leading actor did a fantastic job, too. There is zero shock value thrown into this movie to try and put you on the edge of your seat which is something you don't find in Hollywood movies and which was really nice. Mostly every scene involves Kirsten and her boyfriend and they pull it off. There aren't many actors that can say that they can do that. This movie is entertaining throughout and will keep your attention. Already I like Kirsten more than I ever liked Julia Roberts, Gwyneth Paltrow, Daryl Hannah, Winona Ryder, Chistine Ricci, Catherine Zeta Jones, Kate Winslet, Sharon Stone, or any of these younger female celebrities. The direction in this movie is very good. If you want a real nice relaxing evening and you don't want to watch something with a lot of hype, drama, violence, stereotypes, people pitting each other against one another, etc. then I recommend this movie. I will definitely look for more of Kirsten in the future.","user":"rjc739","rank":[24,24]},{"title":"Nicely crafted teen movie--for a change","rating":7,"date":"19 November 2001","review":"It's not often that we see a REAL teen movie nowadays.  I live in Jersey City, so I personally can't relate to these teen flicks involving blonde airheads and guys who look like they just jumped off the pages of \"Tiger Beat.\"<br><br>In \"Crazy/Beautiful\" one of the main characters is a Hispanic--played beautifully by Jay Hernandez who I hope to see in more and more movies--which I CAN relate to.  Most of the friends I know are of Hispanic origin, and it's very rare that you see a Hispanic as a lead in a film like this.  And Jay's Hispanic character wasn't used merely as a tool in creating melodrama in a preachy \"West Side Story\" manner.<br><br>Kirsten Dunst pretty much gives the best performance of her career.  I like how they didn't put much makeup on her face, giving her a much more real look.  I think Kirsten is one of the most beautiful young actresses in the biz, so I think she's beautiful no matter how little makeup she wears.  So I'm not going to say it was a plus that they made her look \"ugly.\"  She didn't look ugly, but at the same time she looked like a real teenage girl and it added to her character.<br><br>Bruce Davison has a great supporting role as Kirsten's father.  Of course, in all teen movies, they feel it's needed to add a top-class, veteran actor to the cast to give it a touch of class.  Well, that's one cliche of teen movies that I don't mind and Bruce was great, proving himself as one of our great, underrated actors.<br><br>I like how Jay's character is never really discriminated against by Kirsten's white-collar Dad--who's a Congressman.  None of this \"You're dating a man of another race???\" or \"You're dating a man of low-class\" crap. The film skips through all that, being that Jay is a well-to-do individual who has his head up high and wants to become a pilot.  The Dad has nothing against that, in fact he wants to help him out, setting him up with an interview and everything.  But he doesn't want him to see his daughter, because of the way she is.  I don't want to give anything away, so I won't reveal what exactly her problem is.  So I thought that was a good way of flipping this sub-genre on its head.  Usually it's the father who doesn't want the daughter to date the guy, because he doesn't like who she's dating. In this case, he didn't want the two of them to go together, because he's concerned about the boyfriend.<br><br>I only have a few problems with this film.  First off, you never really get the feeling that Kirsten has a severe problem between the beginning and end. So it feels like her disorder was used strictly as a dramatic tool. Through most of the film, she's amazingly jovial.  We see her drinking once in a while, but let's face it--what teen doesn't?  And I thought--especially for a PG-13 film--they went overboard with the sex scenes.  I'm not saying that they were explicit, but there was a good deal of them.  I was thinking, as watching certain portions of the film, what my Dad said:  \"The love in most romantic movies nowadays seems to be based more on sex than love.\" Don't get me wrong, we do get a feel of the love--not lust--between Jay and Kirsten, but they could've trimmed the sex just a bit.  It just came off in the wrong way.<br><br>For those looking for an escape from most of the lame teen flicks that have been fed to us in previous years, I recommend you check this one out. It's a shame that this movie didn't reach a big audience in theaters.  I really hope more people will go out and rent this film, because it's very good.<br><br>\nMy score:  7 (out of 10)","user":"mattymatt4ever","rank":[21,22]},{"title":"Wild rich white schoolgirl and much poorer Latino form a relationship. Great acting. Sensitively portrayed","rating":26,"date":"26 November 2001","review":"In Crazy Beautiful Kirsten Dunst (Interview With A Vampire, Bring It On) plays Nicole a rich girl at high school who befriends a first generation Mexican lad called Carlos (Jay Hernandez).\t<br><br>        Nicole and Carlos hit it off in spite of Carlos's reservations about the wild (crazy/beautiful) Nicole. He's from a poor family and keen to do well at his studies. She's on a path of self destruction, at least academically, probably physically. Carlos hopes to go to the navy academy and become a pilot. <br><br>\tNow this sounds fairly ho hum but is brought successfully to the screen by very strong acting performances from both Dunst and Hernandez and also by Bruce Davison who plays Nicole's Dad Tom. <br><br>\tThese characters are flawed and therefore interesting. The film is mindful of how complicated real people are. <br><br>\tNicole is a carouser, drunk or stoned most of the time. Jay is level headed but becomes overwhelmed by Nicole. Dad certainly doesn't think he has all of the answers.<br><br>\tCrazy/Beautiful is inspired a little by the inter racial aspect of the relationship but much more by the veracity of the performances.<br><br>\n4 Crazy Flys Out Of Five","user":"Steve-176","rank":[25,27]}]