[{"title":"ethnic musical comedy","rating":6,"date":"18 February 2007","review":"I was well aware of the thriving Yiddish film industry in the United States,but before i saw this film i was totally unaware that ethnic films such as this had been made in the UK.It features Jack \"Kid\"Berg in his only featured role in a version o0f Brewsters Millions.He was the World Welterweight champion in 1930-31 and therefore not unnaturally the film manages to incorporate a boxing match into the film.What rather intrigues me is whether this film was made mainly to be shown in the East End,his nickname being the \"Whitechapel Whirlwind\" or whether this was for wider circulation.This film is obviously a bit dated but it is of some historic interest.","user":"malcolmgsw","rank":[9,9]},{"title":"Money Talks","rating":4,"date":"29 January 2020","review":"This obscure British film is an oddity. In essence a Jewish comedy set in the east end of London.<br><br>Abe Pilstein (Julian Rose) business has failed but finds out that he stands to inherit a large sum of money from an aunt in America. The only condition is that he needs to show that he really needs the money. So in 30 days he needs to be almost penniless.<br><br>Abe spends whatever money he has on betting on horses, making bad investments, a theatre show, he even tries to throw it out of the window but finds himself getting wealthier.<br><br>There is also a subplot of two prizefighters who want to marry his daughter and they take part in a winner takes all contest.<br><br>The film is not that far removed from Brewster's Millions. It is also a bit of a revue with several song and dance numbers.<br><br>Money Talks is really a curate's egg. It is not a good film as it takes a while before it gets to its main plot. It does have historical significance due to its focus on the Jewish community.","user":"Prismark10","rank":[0,0]},{"title":"Just Because It's Talking Doesn't Mean You Have To Pay Attention","rating":3,"date":"16 January 2020","review":"Julian Rose's business has failed, and his friend has given him five hundred pounds for the good will. He moves with his daughter, Judy Kelly, into a boarding house where all the tenants - and the landlady - try to get him to 'invest' in their money-making schemes. Then lawyers tell him that his aunt has died and left him a hundred thousand, providing he have no more than fifty pounds at the end of the month.<br><br>Yes, it's a cut-rate BREWSTER'S MILLIONS, topped off with two boxers who want to marry Miss Kelly.<br><br>There's lots of bad acting and bad jokes in this one. Also, for writer-director Norman Lee, who had written for Hitchcock (his co-writer, Edwin Greenwood, would also contribute to two of Hitchcock's scripts), it's so old and decrepit, it stinks.<br><br>Yet there are moments, through the movie, when Rose throws in an ad lib, and you can see a glimmer of what they were trying to do with this movie.\\: make a cheap ABIE'S IRISH ROSE, sure, but it becomes clear that Rose, while no actor - a distressingly large number of people with speaking roles in this one aren't - he was what we called on the American vaudeville circuit, a monologist, someone who could assume a character, act within that character, and tell an amusing story, like Will Rogers or Fred Allen. It all comes together during the wedding that ends the movie, when he gives a toast to his movie daughter and her movie husband. Then I could hear the echoes of now long dead relatives and their self-deprecatory and loving humor.<br><br>It doesn't save the movie. It still stinks. Too bad.","user":"boblipton","rank":[0,0]}]