[{"title":"seriously creepy","rating":8,"date":"15 August 2004","review":"A town in Japan is being taken over by a horribly brutal abstract shape: the spiral.  It's becoming a theme in everything from animals to clouds to people and twisting them, mentally and literally.  This film shows it happening to several groups of people.  Some demonic possession is implied, but nothing is entirely sure except that the best bet is to get the heck out of dodge.  The film progresses really well from normal life to abnormal phenomena (giant snails and crazy people) to the truly supernatural (walking dead).<br><br>As a jaded American horror movie fan, this was just what I needed.  Maybe it was just the novelty of a different culture's film, but it seemed to have a very original progression, set of characters, and the premise was definitely new.  The Japanese may think \"horror shapes\" (uzumaki means \"spiral,\" I'm told) are old by now, but it was nice for me because I'm used to monster/alien/virus/disaster/undead films.  In an American movie, you know who's going to die (the annoying/nasty/lascivious/racist characters) and who will live (the children/heroine/dogs/cats/nice guy).  That's not true in Japanese horror.  It was not predictable how they would fight the evil or how it would end up.  Also, it had this really new (but probably typically Japanese) color leached Pacific Northwest style cloudy day thing going, which was a fresh visual effect for me.  The horrific moments were seriously creepy, relying on a little gore but mainly just impossibly overdone facial expressions (think The Ring) and body manipulations.  This should be one of the greats, up there with once-original ideas like the first Nightmare on Elm Street or Night of the Living Dead.","user":"ShimmySnail","rank":[34,41]},{"title":"Like a circle in a spiral, like a wheel within a wheel...","rating":6,"date":"24 July 2004","review":"The residents of a small island community are slowly becoming obsessed with spirals. Young schoolgirl Kirie first notices this strange behavior when she comes across the father of her solemn boyfriend Shuichi videotaping a snail, lost in a reverie. Soon, other people begin to manifest the same strange obsession. A boy leaps to his death from a spiral staircase with a smile on his face. Shuichi's increasingly weird dad starts a spiral collection and throws a fit when they run out of spiral fishcakes for dinner. When he commits suicide by spinning himself to death in a washing machine, the investigation begins. <br><br>Don't waste your time trying to fathom the mystery behind Uzumaki, just enjoy it. Or, if you must, take the few vague clues that the movie provides and come up with your own theory behind the spiral madness. References are made to an ancient cult of serpent worshippers who spent a lot of time at Dragonfly Pond. Spiraling stormclouds are seen to touch down at said pond, where a beast-god may once have lived. Offerings of ancient mirrors are unearthed from the bottom of the pond...but none of these facts are ever tied together and handed to you with the words \"Reasonable Explanation\" printed on the wrapping paper. It doesn't really matter anyway. As the spirals consume the cursed island, the amazing visuals rule the film: bodies twisted into tight circles, hair coiled into gravity defying spirals, eyes spinning like whirlpools, people transformed into snails. It's as though Lovecraft penned a slightly disgusting comedy, and the film feels very much like the manga comic on which it was based - colorful, exaggerated and silly, but also sick and disturbing as well. <br><br>This is a beautifully shot and well acted film with some stunning effects. If you're not the type to concern yourself with sensible details and neat story lines, you may just enjoy the sheer weirdness of Uzumaki. It's a comic book come to life. Seven out of ten stars.","user":"Gafke","rank":[28,34]},{"title":"Intriguing Horror","rating":8,"date":"8 April 2003","review":"Uzumaki is an entertaining film for any horror fan. True, cultural differences between Japanese and American perceptions create some difficulty in fully appreciating the horror aspects. I found some of the film slightly funny instead of scary; but it is captivating nevertheless. I believe that if I were to view more films of the genre I could fully appreciate the intent of this film, because it is skillfully done.  There are subtleties that I perceived, but that did not fully impact me. I hope to see the film again soon.  One reviewer lamented the want of a DVD that we can all play on our equipment. I must concur that it's a shame, because this is a film I would love to own. <br><br>The little lead actress is compelling and quite adept. Her delicate and minute facial expressions mirror her dialogue well, and this comes across even with the subtitles. I think her performance is what kept me intrigued with the film long enough to really get into it and keep watching. I recommend that if you are a horror fan, and see this film playing, take the time to see and enjoy it.","user":"teuthis","rank":[6,6]}]