[{"title":"My 10th Review: Hugely Enjoyable Caper","rating":7,"date":"15 December 2006","review":"Best surprise I've had in a long time: funny, sweet, and just well, good. It's not crude, or rude ('cept for a couple of obligatory phallic jokes and a couple of swear words) : it could be Rowan Atkinson in the title role. Here Steve Coogan, for my money, leaves behind the skewering satire and parody that made him a household name and a cult figure on UK television, and by half way through the film develops a character that you root for 100%<br><br>Nice storyline, a fun caper, and mixed bag of personalities make this a much better mix than expectations might lead you to believe. <br><br>I love Ealing Comedies, and good British comedies like Brassed Off, and thought the recent US remake of the Ladykillers was just about everything you don't want a crime comedy movie to be... <br><br>... the thing about the Parole Officer is that it is simply enjoyable; it has great pace, some tension and thrills, good laughs, with enough silliness, and ideas to keep it afloat; but it also has a sweet heart and a decency at its center. We thoroughly enjoyed it: especially the last hour: once Coogan stops trying to prove he can develop figures only to poke fun about - he becomes a really likable character - and that's no bad thing. <br><br>It's fun - pure and simple - which is a quality sadly lacking in films these days. Definitely worth viewing.","user":"intelearts","rank":[11,11]},{"title":"Not great but silly and rather amusing at times","rating":21,"date":"21 June 2004","review":"Simon Garden is a parole officer but not a particularly successful one. When one of his assigned ex-cons, Kirsty, steals a car and some drugs Simon believes that the arresting officer, DI Burton, has pocketed the drugs. He follows Burton to find out more and ends up witnessing him murdering a known underworld accountant. Intimidated and moved out of his job, Simon realises that the whole thing was caught on cctv and he can use it to prove Burton's guilt but there's only one problem  the security tape has been placed in the vault of the local bank. Against all his values and beliefs, Simon calls together a collection of the ex-cons that he had put straight and puts together a plan to rob the bank, steal the tape and use it to prove the murderer. <br><br>Many films are not really worth the bother of going to the cinema and paying your money to see and, for me, The Parole Officer was one such film. So three years later I decided to watch this for free when it arrived on channel 4 and, while it was a silly little thing, it still made me laugh a few times and that was enough for me. The plot is silly and simple but it has a nice little comic touch to it that creates a general air of humour as well as several specifically funny moments. Of course it is nonsense and not hilarious but it did the job for me and was funny in a rather basic and silly way  although if you are expecting to be laughing out loud all the way through it then I imagine you will be disappointed.<br><br>The cast is pretty good and features a lot of well-known faces (well, certainly well known to fans of UK comedy). Coogan is hardly at his best here and this is not a great showcase for him (it just doesn't compare to his better work) but he is still funny even if his Simon is just a very poor man's Alan Partridge. Support is good for him from the likes of Om Puri, Emma Williams, Steve Waddington and the great Ben Miller. None of them really shine but they are as good as the film deserves and help support Coogan well enough. Omar Sharif makes a very strange cameo (but an effective one) and the wonderful Simon Pegg showed just how able he is by getting laughs by simply exchanging a glance with Julia Davis.<br><br>Overall this is a silly British comedy without a great deal of style or imaginative wit but one that still managed to make me laugh several times throughout the film. The humour will appeal more to a British audience than anyone else; certainly the casting is designed to appeal to an UK audience and the sense of humour will too. Not a great film by any means and far from being the best example of the abilities of those involved but it raised a few laughs and had a humorous tone all the way through that I quite enjoyed.","user":"bob the moo","rank":[16,18]},{"title":"Conventional feelgood caper movie, unconventional lead character","rating":25,"date":"25 August 2002","review":"You've seen similar plots, characters, tension/release \"will the good guys prevail against unbelievable odds\" elements if you've seen any movies at all. But you probably haven't seen too many lead characters like Steve Coogan's rather ungifted parole officer in this. <br><br>Coogan specialises in 'little' English characters (though quite a diverse range over his career) - graceless, irritating, of terrific drive but little achievement, and prone to finding the greatest possible embarrassment and humiliation in any situation. They're somewhat like Michael Palin's favourite type of characters (if you know Eric Olthwaite from the TV series \"Ripping Yarns\" that's probably one of his) but Palin had more affection for them as a rule. <br><br>Somewhat unusually for Coogan he displays a certain affection for his parole officer here - he has his triumphs - but this is a more conventional kind of entertainment than Coogan is normally prone to. <br><br>It really is just a feelgood comedy caper movie, with a stand-out lead character, but the feelgood stuff is done pretty slickly, and the protagonist is invariably hilarious - Coogan is funny every time he puts himself at the centre of a scene. <br><br>I can understand why other long-term Coogan fans are surprised or disappointed about the conventional nature of this movie, as opposed to his TV work. But I think \"The Parole Officer\" achieves everything it intended to. Steve Coogan is an exceedingly talented man.","user":"leapso","rank":[12,14]}]