[{"title":"Almost a quarter of a century since The Thing, and still people don't get Carpenter.","rating":8,"date":"22 October 2005","review":"Firstly, if I see another review labelling Ghosts of Mars, Vampires or Escape from L.A 'Carpenter attempting to have another hit movie' my head will explode like Snake Plissken's would have done. Hello people: CARPENTER HAS NEVER HAD A HIT MOVIE! Besides maybe Halloween, Starman, Christine and Escape from New York to a lesser extent, Carpenter has made bomb after bomb. Certainly the films that have the biggest following today; The Thing, Big Trouble in Little China, They Live, they all were torn apart on release. So, surprise surprise everyone hates Ghost of Mars like they did The Thing. Now, I am in no way comparing Ghosts to The Thing, which is an vastly superior film. But Ghosts is in the same position; as it will be in fifteen years time when people will look back on it and say 'Maybe it wasn't that bad.' WHICH IT ISN'T. What elements in this film aren't Carpenter? The western atmosphere? The focus on action and story, and not character? Vast hoards of nameless enemies? These were all in Assault on Precinct 13. Oh wait, no one liked that in 1976 because they were so brain dead they had to wait for a cult following to develop before they gave it a second chance. So it must be the structure. Is the structure, with it's flashbacks-within-flashbacks and weird editing any more bizarre than the corkscrew science behind 'Prince of Darkness'? Oh that's right, everyone hated that in 1987. So I'm looking for the faults. That's it, the action isn't very good. Oh damn, it wasn't very good in 'Big Trouble in Little China' either. Wait, didn't it take people fifteen years to 'get' that film as well? Maybe it's the fact that it has Ice Cube in the lead. Yeah, Carpenter defiantly shouldn't have let a non-actor take the leadoh wait, Roddy Piper! If 'They Live' was made in 2001 that would be bashed for having an non-actor carrying it, but for some reason because it was made in 1988 (blasted on release) Roddy Piper's performance is the stuff of cult legend.<br><br>All said and complained about, if Ghosts of Mars was released in 1987 or something it wouldn't be getting bashed now. Hell, Jason Statham might have been the new Kurt Russell. There's plenty of fun to be had here, and Carpenter certainly hasn't 'lost his vision' as a lot of the so-called fans who are stuck somewhere around 1982 claim. If anything, with Ghosts of Mars and it's OTT structure, Carpenter is developing on it.<br><br>Maybe it's just me, but I can't understand how someone can hate Ghost of Mars and have unconditional love for Assault on Precinct 13. Give Ghosts another go, and watch it with an open mind. If you can't at least do that, you are not a fan of John Carpenter.","user":"wierzbowskisteedman","rank":[230,323]},{"title":"red west","rating":2,"date":"2 February 2004","review":"John Carpenter, together with Brian De Palma, are the only active directors who had created a body of work consisting of the representation of a particular, personal world, forged by the mixture of a number of themes and subjects, reinserted on tracks left by classic directors (Hawks and Hitchcock respectively). They make one single movie over and over again, reaching outstanding levels of accomplishment in style and coherence.<br><br>Thus `Ghost of Mars' is full of Carpenter's imaginary. The plot, the characters, the tone, everything can be linked to his previous work, most notably `Assault on Precint 13', that was yet a reworking of Hawks' `Rio Bravo'. And that's a significant point regarding this film: despite the zombies, the gore, the futuristic set-up, the red Martian atmosphere, the heavy metal score, `Ghost of Mars' is essentially a western in the most classic way. There is a train, a lawman (played by an actress), a group of deputies, a gang of bandits, a frontier town surrounded by the desert.<br><br>As in Hawks, the individuals work as a group, defined by codes of professional skill in a strictly masculine environment. Interestingly, Capenter portrays the Martian society as a matriarchy, but the elements operate the same way: the good guy and the bad guy differentiate from each other just for the fact that they are in opposite sides of the law, but are nevertheless exchangeable. Also, following Hawks' epic, the vulnerability of the hero is determined by a fault or weakness (Melanie's addiction to drugs is a progression of Dean Martin's alcoholism in Rio Bravo).<br><br>\nTold in a peculiar series of flashbacks from different points of view, and as in `Vampires', with the use of long, continual dissolves, the story introduces some original points, like the ghosts taking possession of human through the ears and Desolation's smart device to save Melanie with the aid of drugs. There are some plot holes, yes, some bad acting and gratuitous -though stylized- violence. But it's Carpenter unpretentious as ever, telling us how dark our future appears, not from a pulpit but from his director's chair. And I'm very grateful for his effort.","user":"TheFerryman","rank":[101,144]},{"title":"Misunderstood brilliance","rating":9,"date":"2 January 2020","review":"I avoided 'Ghosts of Mars' for years based on all the bad reviews. As soon as I finally committed to watching it, I immediately fell in love.<br><br>There are movies like 'Godzilla: Final Wars' or 'Jason X' that throw in all the most outrageous concepts imaginable and say \"why the hell not?\" There are movies like 'Escape from L.A.' that are like watching well-regarded, established classics through a funhouse mirror. For however ridiculous they may be, the one thing these all have in common is a knowing wink to the audience, a subtle nod that says \"Yup. This is what we're doing.\"<br><br>'Ghosts of Mars' isn't much different. A hard-charging rock score (featuring the likes of Steve Vai and Buckethead), gratuitous explosions, cartoonish injuries &amp; deaths, blockheaded dialogue, numerous flashbacks that do more to disrupt the flow of the film than advance the plot. All the hallmarks of a cheesy, over-the-top Hollywood action blockbuster.<br><br>Like 'Final Wars,' 'Jason X,' or 'Escape from L.A.,' it's all done very deliberately. Unlike these films, there's no knowing wink, no subtle nod. Just a deadpan stare. And it's absolutely delicious.<br><br>I can understand horror fans generally, or Carpenter fans specifically, being taken aback by such a dramatic shift. Even coming from a filmmaker who has given us such less-than-serious classics like 'Big trouble in Little China' or 'They live,' 'Ghosts of Mars' has a vastly different tone. But for all the backlash and bad press, what's ultimately clear is how surprisingly little people understand John Carpenter.<br><br>After this movie was received so poorly, Carpenter is on record as saying that it's intentionally over-the-top, a spoof, and people didn't get it. This is either an earnest defense of a misunderstood film, or a desperate defense of a bad one. Personally, I'm unclear how anyone can watch 'Ghosts of Mars' and not see it for what it is.<br><br>If you watch this movie expecting genuinely frightful horror, you're going to be disappointed. If you watch it looking for Carpenter's signature emphasis on atmosphere and building suspense, you're going to be disappointed. But if you watch 'Ghosts of Mars' with an open mind, ready to accept whatever may be coming your way, prepare to be pleasantly surprised.<br><br>It's not for everyone. But then, not everyone is in on the joke.","user":"I_Ailurophile","rank":[6,6]}]