[{"title":"A Very Human and Affecting Drama...","rating":8,"date":"21 December 2005","review":"Denzel Washington continues to prove why he is one of the best actors in the business with his performance in JOHN Q, a moving, emotional, and tension-charged drama about a family man whose son needs a heart transplant; however, due to financial problems, his insurance won't cover the cost of getting his son on the donor list so John Q decides to take hostages in the hospital until someone arranges for his son to be on the donor list. Despite a preachy and simplistic screenplay, the intense direction and first-rate performances make this film work. I particularly loved Denzel's work here because this was a character unlike he had ever played before...Denzel usually played well-educated, intelligent lawyers and/or businessmen (with the obvious exception of TRAINING DAY), but here Denzel is playing an average Joe...a working stiff, struggling to pay bills and keep food on the table and a roof over his family's head who is driven to extreme measures to protect the family he cherishes so dearly. Washington gets strong support from Robert Duvall, solid as always as the hostage negotiator, James Woods as a wimpy surgeon, Anne Heche as an unsympathetic hospital administrator, and especially Kimberly Elise as John's wife. An emotional drama, wrought with tension, that will rivet you to the screen.","user":"ijonesiii","rank":[72,85]},{"title":"A movie full of suspense and meant to open your eyes","rating":10,"date":"8 April 2008","review":"A very well cooked thriller, with every necessary ingredient, and a plot meant to surprise the viewer.<br><br>Full of love, passion, family issues, commercial interests and politics all blended into a magnificent work of art topped with Denzel Washington's performance The film shows many aspects of life, and should be seen by all people to evaluate one's point of view on each of the parallel stories depicted.<br><br>The Author takes an everyday situation and sows the seed of self - criticism in every spectator, making this more than a thriller to pass the time away.<br><br>The Director plays with the characters as a Master would play his pieces on a chessboard, giving each actor enough role and having a defined objective: to checkmate the audience, and I must say he does this with very few elements, mainly dialog sequences and very few Special effects, thus turning this film into a masterpiece.<br><br>Denzel Washington is the perfect choice for this film, due to his ability to play poker face situations, and his ability to play any kind of character he is offered.<br><br>I do highly recommend this movie, to see it two, three or more times. Every time one sees the film, gets a new detail to one's collection and a new question to answer. Ideal for family discussion and highly recommended for teenagers","user":"quincymd","rank":[47,55]},{"title":"Excellent acting alive with emotion","rating":10,"date":"28 December 2004","review":"Denzel Washington's portrayal of a desperate dad is excellent and compelling as he struggles to find a way to get his son to be treated and operated immediately, no matter what cost. He takes the whole hospital hostage until he gets it. One may say what he is doing is bad and illegal, but at the same time he stands up to the system, and fights the odds, but hey, he's doing it for his son. I praised him when he said \"I don't want to bury my son, I want my son to bury me!\" In a way, he's willing to sacrifice himself to save his son. The hostages he takes, seems to support him and the mass of audiences viewing are on his side. And he also seems to be calm and friendly to them too. The ending was also perfect, and overall a great film, and not to mention the great performances from Robert Duvall, James Woods and Ray Liotta of The Good Fellas, who uses his Tommy Vercetti voice again! Gotta love that guy, gotta love that Denzel Washington, recommended for those who love him.","user":"au_law2001","rank":[66,81]}]