[{"title":"A beautiful film about bringing families together","rating":10,"date":"22 February 2005","review":"This film shines from start to finish, and runs the gamut of emotions. The cinematography, sets, and costumes are brilliant. The sparkling performances of six of India's leading actors alone makes the movie worth seeing, even if some might not feel comfortable with the deep sentimentality displayed by the leading men (women are fine with this; American men sometimes find it unnerving). Hrithik Roshan is pure eye candy for women of all ages, somehow oozing sweetness and innocent sexuality at the same time. The catchy song and dance number he performs with the lovely Kareena Kapoor at their 'prom,' \"You Are My Soniya,\" has gotten regular replays in this household for weeks (even by my 79-year old mother, who will say, \"I need a Soniya fix\" - it really cheers her up!). The other musical numbers are very enjoyable, too, and never seem out of place or at odds with the flow of the film. Shahrukh Khan is adorable, as always, as the favorite son, and can hold his own in the dance numbers, too. Kajol gets to show her comic side, and was great at it! And knowing that the 'parents,' Amitabh and Jaya are a married couple in 'real life' just makes their interactions in the film that much better. Don't miss this wonderful movie! If you see just one Hindi movie, make it this one! (I am adding this question, for anyone who knows the answer: I wanted to find out what actor played Rohan at about age 12; the cast list shows three names for \"Fattie\" but no further details for any of these actors. If you happen to know the answer, please email me at punzelle@cox.net. Thank you!)","user":"punzelle","rank":[77,86]},{"title":"hoorah! for Bollywood!","rating":10,"date":"1 August 2002","review":"I have never been a Bollywood-fan, believe me. Especially with all those movies full of cobra's, killing and corrupt policemen. But today I decided to go for a handsome face on the poster of the cinema, and sat down to watch about 3 hours of typical Bollywoodfun. No regrets! A modern story about conflicts between generations, growing up in different ages, with different traditions. A story that will make the audience in many countries feel could be their own story of life. Even the music was not disturbing, and the humor is refreshing at times. The music is even for a westerner like me something to ad to my collection of cd's, and the only minor thing for me was the sudden apearance of Egytian pyramids as background for a romantic song. After movies from Indonesia have won my heart earlier in 2001, and France with 'Amelie', Bollywood is the next, with Hollywood loosing ground.","user":"hansbearnl","rank":[53,71]},{"title":"Trademark Karan Johar","rating":9,"date":"12 March 2006","review":"I respect Karan Johar. He is an honest director. There are a lot of young directors out there today that are taking the Hollywood approach to film making and the end result is a mish mash of a desi product in a foreign packaging. Karan Johar, on the other hand, takes a desi story, puts it in a desi package but only refines it more than most others do. What you get is a very good Bollywood movie that has elements of emotion, melodrama, comedy, family values, romance and music in equal doses. Yes, I admit that the story does leave a lot of questions unanswered, but that's OK considering the desired target market is one that is alright with that and sheds expectations of credibility before walking in to the cinema.<br><br>K3G is a beautiful example of what a good director can do. Agreed, the movie may not have been as great without the power star cast, but then, let us not forget that before those people are stars, they are very good actors. Well, except maybe Kareena and Hritik.<br><br>This is where the minus points are. Hritik did nothing but weep perpetually. Kareena played an overbearing slut. And to top it off, she and her friends all spoke American slang and also had that slight twang of an American accent. (PHAT: Pretty Hot And Tempting?? That's ghetto lingo!) And I really didn't like the national anthem thing. i felt it was a little pushed. I think KJ went a little overboard there in trying to make the NRI audience cry. The only time that trick has worked effectively was years ago in \"naam\" when Pankaj Udhas sang the \"Chitthi Aayi Hai\" song.<br><br>There are certain scenes that I found really well done in the movie. The last time Rahul meets Rohan before the latter goes off to boarding school, he has a talk with him about taking care of Mum, losing weight and joining he cricket team. They are sitting on a bench, side by side having this talk. Years later, in the second half of the movie, after Rahul realizes that his brother has been living with him all this while, the scene again cuts to them sitting on a bench, this time ten years later. It could've been shot anywhere, but the fact that the setting is so similar just makes it even more memorable.<br><br>The scene where Nandini (mom) meets Rahul after years at the shopping mall, she places her hand on his shoulder and he turns around. Wow.<br><br>And the finale of course. Amitabh breaking down with SRK.<br><br>One mustn't expect great international cinema here. this is what great Bollywood is all about.","user":"nomanali77","rank":[32,41]}]