[{"title":"Entertaining","rating":7,"date":"30 April 2004","review":"Like \"Desperado,\" the film offers nonstop action and a gargantuan body count.  Robert Rodriguez knows how to please his audience, and the movie does work for the most part.  As expected in a Rodriguez film, the action scenes are very well-choreographed and all possess a certain slickness and originality.  Johnny Depp steals the show in his supporting role, and seems to be having the most fun.  I actually looked at him as more of an action hero than Antonio Banderas.  Then again, Banderas seems to be going through the motions.  After all, he has played roles of this type many times before and is probably almost bored.  I like how most of the movie is in subtitles. As I heard in the commentary, the reason for that was because most of the cast only spoke Spanish.  But I'd rather see Mexican characters speaking in their native language, and having to read the subtitles, than them speaking in a second language that they obviously haven't mastered totally. Hollywood appears to have a fear of subtitles, and it's a stupid fear.  Now onto what I didn't like about the movie...I'm not exaggerating when I say that it has nonstop violence.  I'm not one of these people who gets bothered by excessive violence, but after a while all that action and killing can get a little dull.  You just sit there waiting for the next body to fall to the ground.  The story isn't non-existent, but I think if Rodriguez paid a little more attention to developing characters and story, his films might be even more interesting.  But altogether, I was entertained.  You don't view a film like this in the same way you view a Kubrick film.  So what you see is what you get.  <br><br>My score:  7 (out of 10)","user":"MovieLuvaMatt","rank":[49,63]},{"title":"Wait For The End!!","rating":7,"date":"10 December 2005","review":"Once Upon A Time In Mexico is good, but not as strong as Desperado. Our hero, El Mariachi (Antonio Banderas) barely has any lines. Throughout the movie we forget this talented actor is the star of the movie. The explosive action is incredible, and including Sands (Johnny Depp) is the only thing worth raving about. Depp's role is actually the best part of this movie. Salma Hayek's role has been chopped to flashbacks, so there is not a lot of crazy Action and Romance between Banderas and her. You want Antonio Banderas to save the day and he does, but this Sequel did not give him that fire. Eva Mendes is in about 4 scenes but does a great job including the rest of the cast (Ruben Blades, Cheech Marin, Mickey Rourke, Willem Dafoe, and Enrique Iglesias). It would have been nice to hear some hot new songs from Enrique Iglesias for the soundtrack but I am more than satisfied with Salma Hayek's \"Siente Mi Amor\". It is an incredible Spanish track, worth watching the entire credits!","user":"marcelik","rank":[71,102]},{"title":"Rodriguez serves up a mess...","rating":9,"date":"9 March 2004","review":"I am a fan of Robert Rodriguez's previous offerings of El Mariachi and the wonderful Desperado. Here he once more returns to the same character as portrayed in the two earlier outings but this time seems to miss the mark by a country mile. Although the first two movies were simple 'revenge' films which served to give the shoot-outs their purpose; this movie tries to embellish this idea with a few sub-plots which frankly just don't work. I was bored throughout and even though he returns with his trademark comic-book violence, this time round it just seemed to be one big yawn-fest.<br><br>I had no interest in any of the characters, I am madly in love with Salma Hayek but frankly here I could care less about her character. Banderas does fill the screen when on but sadly, it just isn't enough to lift this movie above more than mere average.<br><br>Sorry Robert, if a bigger budget means we have to suffer this, then please go back to the low budget movies that made your name, in those you were brilliant; here, merely less than average.","user":"paul-bissette","rank":[16,20]}]