[{"title":"Powerful","rating":9,"date":"14 August 2004","review":"In Ring O, which takes place 30 years before the events of Ringu, we are introduced to Sadako Yamamura, a painfully shy young girl who is literally torn in two by her mysterious heritage. Sadako, haunted by frightening visions of ghosts and bloody omens of the future, is a tense and silent girl with an ethereal beauty. She has found happiness in a local drama troupe, despite the fact that few of her fellow actors like her - Sadako is too quiet, a little creepy, and always seems to have something \"standing behind her\" - something that no one can quite see. The cast of an upcoming play all begin to have similar dreams in which an old house, a forest by the sea and a crumbling well all make an appearance. When the star of the play dies unexpectedly, and Sadako is given her role, suspicion mounts. Odd occurrences plague the set, a news reporter with a secret agenda begins to investigate Sadako and Sadako herself falls in love with a handsome sound engineer named Toyama, the only one who believes that Sadako is innocent. But if she is, then what is causing the poltergeist activity in the theater? What is the source of the strange, eerie sound that everyone can hear? And whose voice said \"You will die\" on a recording made at the time of a young woman's death? <br><br>This is a strong entry in the Ringu series, more of a psychological drama than anything else. Sadako, like Carrie White, is a girl with no self-esteem, wandering through the film in dumpy clothes with her hair in her face. She is truly a good, sweet girl who is simply pushed too far at last. There are some creepy moments scattered through the film featuring grainy dream sequences, stricken corpses and a very creepy shot of Sadako's insane mother during a flashback. There's also a great climax featuring Sadako as we all remember her - hair in her face and clad in a long white dress - literally jumping into view and then creeping up on her two victims in a scene that was clearly shot backwards and then run forwards, giving her movements a hideous jerkiness. Yukie Nakama is very good as Sadako, giving us a tragic heroine who is good and pure and possesses the power to heal the sick. Your sympathy will lie with Sadako, even as her dark past is revealed. The good Sadako suffers unbearably and you will suffer with her, right up to the chilling, but inevitable, ending. <br><br>This is a must see for Ring fans. Very highly recommended.","user":"Gafke","rank":[45,47]},{"title":"Beautiful and haunting","rating":10,"date":"20 October 2002","review":"After the disappointment of a still decent \"Ring 2\", \"Ring 0 : Birthday\" is a return to form.  Yukie Nakamo does a wonderful job of portraying the tragic final days of Sadako's attempt at a normal life.  The sweet, innocent side of her was never suspected when I first glimpsed the malevolent presence of Sadako in the first installment.  Yukie is very moving in her portrayal and evokes sympathy and empathy for the character. Similarily, Daisuke Ban gives a opens up the character of Dr Ikuma from the glimpses we've seen in previous installments.  Here we see a tortured and resigned man who genuinely loves Sadako as a daughter, but can't escape from the knowledge of how dangerous she is and the steps he may have to take to prevent her harming others.<br><br>Despite the main love story and drama of Sadako's attempt at a normal life, there are still plenty of creepy moments and supernatural happenings.  The scenes with the school teacher relating her experiences of teaching a young Sadako are genuinely intriguing and eerie. Indeed the story of the kids swimming in the sea and Sadako's prediction of their fate, is truly gripping, despite nothing actually being shown.  The excitng scenes in the woods and cabin show how deadly Sadako can be when her evil side has control.  The weird appearance and way of walking from the first \"Ring\" is seen again here and there's some great bonesnapping moments when Sadako hunts down her final prey.  These scenes and the conclusion give \"Ring 0 : Birthday\" the standout sequences that \"Ring 2\" never quite managed to sustain from the original film.<br><br>Some of the plot points do bear a resemblance to \"Carrie\" but the film handles them in a different way.  The story, although slow paced is always enthralling (a hallmark of the \"Ring\" series to date) and it seems poor Sadako never really had a chance from what awaited her.  Aligned against her are: an inability to control the dark powers of her alter ego, a creepy director who learns of her secret and wishes to use her, a reporter with a grudge and a suspicious and unfriendly acting troupe who never seem to have made any real attempt at welcoming the shy, withdrawn girl into their fold.  Mob paranoia and fear contribute to Sadako's fate and make her the malevolent presence she is today.  As the film reaches it's conclusion, you can't help but wish that things could end differently for the unfortunate lovers but anyone who's seen the previous installments, knows that there's only one place this prequel can end.  The last few minutes of the film are heartbreaking and the film's end credit song beautifully encapsulates the finality of Sadako's backstory.  <br><br>Don't expect too many absolute answers here though. \"Ring 0 : Birthday\" maintains the mystery and ambiguity of the first two films and once again, imagination is a required element from the viewer.  If you enjoyed the previous films and want to see more of Sadako, this film will give you quite a thrill ride.  Whether it's poignant doomed love story, another part of the Ring puzzle or an eerie and haunting Japanese ghost story, \"Ring 0 : Birthday\" is a winner on every level.","user":"Django-21","rank":[31,34]},{"title":"Good prequel to round out the Japanese Ring series","rating":7,"date":"26 September 2003","review":"Combining elements of drama and horror, Ring 0 is a very worthy installation of the indie horror franchise.  This film really starts, though, as a drama, telling us the story of Sadako in a very linear fashion (which, deliciously, has become the more difficult and confusing path to take, since we already know the end of the story).  We see Sadako as a human (!) who is not scary or evil at all but actually seems rather pleasant and almost painfully shy. A while later in the film, we see that Sadako is actually warring desperately with herself . . . and is losing.  Her eventual slide into the monstrosity of the first and second Ring films is a sight to behold (and, hardcore fans will note, is echoed by a similar fall of Ando Mitsuo in the less popular Rasen).<br><br>The social overtones of this film are also outstanding and a fine addition to the series.  Whereas the first two films are more exercises in combining psychological terror with techno-horror, Ring 0 takes a more Romero-esque approach to the social aspect of Sadako's transformation, meditating on the cruelty of her peers and the burning need for revenge of one journalist that brings the whole tragedy crashing down.<br><br>Incidentally, although it takes some time, this film WILL scare the hell out of you at the end.  Just wait for it.<br><br>Very, very good.  See it.","user":"evilmatt-3","rank":[14,16]}]