[{"title":"Sometimes a film becomes a place","rating":10,"date":"30 August 2019","review":"I loved this movie the first time I saw it. And it grows on me a little bit every time I rewatch it. It's like going to visit an old friend's house. Anderson did such a marvelous job building this odd little world. It's just one indelible image after another. Gene Hackman is just marvelous. And that shot of Margot getting off the bus.","user":"dafoat","rank":[12,12]},{"title":"Quirky and highly original.","rating":8,"date":"23 July 2008","review":"Wes Anderson has been the face of a new brand of comedy ever since he burst onto the scene in 1996 with Bottle Rocket. He further established himself with the 1998 hit Rushmore. The Royal Tenenbaums is considered by many to be his finest work and it is kind of hard to dispute that. This is a rich, complex movie dealing with multiple characters that all suffer from serious trouble in one way or another. Gene Hackman plays the father of a family that was once quite prominent in the world of geniuses. The oldest son Chas was a successful real estate dealer, daughter Margot became a famous playwright in the ninth grade, and youngest son Richie went on to become a great tennis player. Still, all their talent couldn't keep their father from leaving them, and now he returns to see them because he tells them he is dying.<br><br>This movie works, but not as easily as some other comedies. Being a Wes Anderson movie, the humor here is very dry and there are multiple scenes when you will ask yourself if you should be sad, angry, or laugh at the characters. The look of the movie is remarkable and it perfectly matches the feeling of each character. The acting is tremendous, especially by Hackman, as well as Ben Stiller, Gwyneth Paltrow, Luke Wilson, and Angelica Huston. The whole movie is filled with weird and quirk situations, yet it all makes sense somehow. The story gives us these people and their problems and we watch as they try to piece their life back together after being apart for so long. If you are a fan of Wes Anderson, you owe it to yourself to see this. If you aren't, it still is worth seeing, but give it some time. Watching it a second time really helped me understand the characters and the story better. It may do the same for you.","user":"bobsgrock","rank":[12,12]},{"title":"The perfect balance of drama and comedy","rating":10,"date":"9 November 2004","review":"I loved this film.<br><br>The Tenenbaum's dysfunction (while amplified for the screen) is quite an accurate portrayal of family life. Families are, essentially, groups of people living in each other's pockets, and, invariably, those people who love you and hate you the most.<br><br>Don't get me wrong, Royal and his (thermo)nuclear family of brilliant buffoons do not represent my family (or any other in the world I think!) but the family united against a miscreant father is a motif a lot of people can understand. It is this common humanity that really appeals to me as a film watcher, and what, ultimately made this film so very memorable to me.<br><br>The ensemble cast is astonishingly proficient. They all lend a perfect quirkiness to the roles. Anjelica Houston is the perfect former Mrs Royal Tenenbaum, down to the smallest nuance, Ben Stiller and Luke Wilson turn in wonderful performances, and this is the only role I've seen Gwenyth Paltrow in where I actually thought she was someone other than Gwenyth Paltrow (this is not an insult, it's just that people don't always do it for everyone, you know...?). Bill Murray, Gene Hackman, Owen Wilson, all excellent, all the time.<br><br>The black comedy counterbalanced with the drama of the issues raised in this film left me feeling like I'd witnessed a film event, rather than just another film. I loved every frame of it, from the Baldwin narrated opening, to the final tying up of ends. It never dwelled on melodrama, or the more potentially unsavoury elements, and it didn't sink into the schmaltzy \"We all love each other\" end it could well have. It began perfectly, and it ended perfectly.<br><br>I can't recommend this movie more highly. It's a must see for anyone who loves quirky and emotive storytelling, great characters and beautiful dialogue.<br><br>10/10","user":"mneilson-2","rank":[191,255]}]