[{"title":"The ending","rating":9,"date":"1 October 2004","review":"I've read many of the comments regarding Adaptation, and it seems as though most people have disliked this movie because of its ending. They make claims such as, \"Kaufman's script was great until the end,\" or, \"Why did Kaufman talk about not wanting to \"hollywoodize\" his script, and then do it in the end anyway?\"<br><br>I don't think most people understand why he did it.<br><br>Throughout the movie, Kaufman's character keeps stressing how much he doesn't want to make a \"Hollywood\" film. Hollywood-type films have sex, drugs, car chases, and most importantly, characters who succeed in the end. So at a glance, it seems that Kaufman goes against his inner most desires regarding the film because he does \"hollywoodize\" it. <br><br>But that is what I find to be the most clever part of his screenplay. To explain my point, try to imagine this-what if Kaufman did not \"hollywoodize\" his script? If he didn't do it, Kaufman would not have added car chases, sex, and drugs. So in a way, if this were the case, Kaufman would have succeeded. But you see, that is the point. Kaufman DID NOT want his character to succeed in the end. Like he explained throughout the movie, \"I don't want to have a film...where characters succeed in the end.\" Thus, since Kaufman ultimately fails at his attempt to adapt Susan Orlean's book into a screenplay in how he originally intended, he delivers a screenplay that is not your normal hollywood film, i.e., a film where the protagonist prevails.<br><br>Basically, in order to make his film \"un-hollywood,\" he \"hollywoodizes\" it. Can nobody see the genius of this? <br><br>Anyway, I just thought that I could offer everyone my take on the movie so that you all may perceive Kaufman's ending in a different light.","user":"steezo","rank":[445,508]},{"title":"\"The script I'm starting, it's about flowers. No one's ever done a movie about flowers before.\"","rating":9,"date":"20 July 2007","review":"After the phenomenal success of 'Being John Malkovich' in 1999, screenwriter Charlie Kaufman was commissioned to adapt Susan Orlean's non-fiction novel, \"The Orchid Thief,\" for the screen. However, it didn't take long for him to realise that Orlean's book was basically unfilmable, its sprawling and ponderous story lacking any clear structure or coherence. After some months of struggling vainly to write a screenplay from the novel, Kaufman's script inexplicably became the story of a writer's effort to adapt an unadaptable novel. Kaufman's completed script was presented to his financial backers with some trepidation, but they reportedly loved it so much that they decided to abandon the original project and film his screenplay. Spike Jonze, who had also directed \"Being John Malkovich,\" returned to direct \"Adaptation,\" the quirky, twisting, self-referential film that received almost universal critical acclaim. Much like Federico Fellini's classic 1963 film, '8½,' from which Kaufman almost certainly drew inspiration, 'Adaptation' tells the story of its own creation.<br><br>Nicolas Cage plays Charlie Kaufman, the lonely, insecure and socially awkward screenwriter who is hired to adapt \"The Orchid Thief,\" written by Susan Orlean, who is portrayed by Meryl Streep. The novel itself concerns the story of John Laroche (played by Chris Cooper), a smug plant dealer who was arrested in 1994 for poaching rare orchids in the Fakahatchee Strand State Preserve. As Kaufman struggles to write the script, his troubles are compounded by the presence of his twin brother, Donald (also played by Nicolas Cage), who is Charlie's exact opposite: reckless, carefree, over-confident and perhaps even a bit dim. The script for 'Adaptation' darts back and forth between different moments in time, either chronicling Kaufman's screen writing exploits or Orlean's experiences in writing her novel. At several points in the story, more dramatic flashbacks take place: we see Charles Darwin first penning his theories of evolution and adaptation, a brief history of the grim activity of orchid-hunting, and, in one particularly impressive sequence, we are taken back billions of years to the beginning of life, to trace how Charlie Kaufman came to be here today.<br><br>Though purportedly based on a true story, the events of the film are highly fictionalised, and the story always treads a fine line with reality, with the audience never certain of whether or not an event is real (in the context of the film) or merely a creation of Charlie's (or even Donald's) imagination. Charlie Kaufman (the true-life writer, not the character) often receives most of the accolades for the film, but it is director Spike Jonze who shared the vision to execute \"Adaptation\" on screen. His approach to film-making is always original and daring, never tentative of trying something unique for the sake of the film, even if it may offend the tastes of an audience that is unaccustomed to anything other than the mundane clichés of the modern movies that are churned out daily by Hollywood studios. If this wasn't completely obvious after the weird, twisted, fascinating 'Being John Malkovich,' then 'Adaptation' put any lingering doubts to rest. The director, who started his career directing music videos, seems to share a singular understanding with Kaufman the writer, and a mutual agreement on what the film is actually trying to say.<br><br>In addition to a clever story, 'Adaptation' contains some of the finest acting of the 2000s, presenting an excellent selection of seasoned talents at the top of their games. In arguably the greatest role(s) of his career, Nicolas Cage is phenomenal as both Charlie and Donald Kaufman, twin brothers whose complete polarity is startlingly evident in the execution of their respective film scripts. Charlie, whilst writing his adaptation, is determined to avoid the usual clichés and construct a film without any conventional plot, to write a movie \"simply about flowers.\" Donald, however, blissfully oblivious to his own unoriginality as a writer, churns out a hackneyed psychological thriller, entitled 'The 3,' in which the serial killer, his female hostage and the cop are the very same person. In an ironic twist of fate, Donald's trite treatment is hailed as a masterpiece, adding further to the inadequacy already being felt by his disillusioned brother. Cage is excellent, and often absolutely hilarious, as both characters, giving each brother a distinct attitude and personality, so that it is possible to tell immediately which is which even though their physical appearance is exactly the same.<br><br>Meryl Streep is equally excellent as Susan Orlean, the journalist for \"The New Yorker\" who researches John Laroche and endeavours to catch a glimpse of the famed and very rare Ghost Orchid, if only to understand what it feels like to be passionate about something. Chris Cooper arguably steals the entire show as the charismatic and enigmatic Laroche, whose tragedy-afflicted life is dedicated to mastering numerous obscure fields (such as orchid-collecting, or fish-collecting), each of which is sporadically cast aside and permanently forgotten as soon as he feels it's time to move on, to \"adapt\" to another hobby. From four Academy Award nominations, only Cooper walked away with a statue. Notably, Charlie Kaufman's screenplay was also nominated for an Oscar. Since the script was credited to both \"Charlie Kaufman and Donald Kaufman,\" the latter became the only entirely fictional person in history to have been nominated for an Academy Award.<br><br>In a nutshell, 'Adaptation' is all about failure. Charlie Kaufman is absolutely determined to write an original script, without cramming in \"sex or guns or car chases or characters learning profound life lessons or growing or coming to like each other or overcoming obstacles to succeed in the end.\" However, after he eventually asks Donald to complete the script for him, it descends into exactly that. A visit to a screen-writing seminar by Robert McKee (memorably played by Brian Cox)  who is famous for warning strongly against Deus Ex Machina  is used as exactly that. Charlie Kaufman the character fails miserably in writing his script, but, ironically, Charlie Kaufman the writer succeeds ever so magnificently!","user":"ackstasis","rank":[119,133]},{"title":"Clever... too clever?","rating":9,"date":"21 May 2004","review":"John Laroche (an excellent, award-winning Chris Cooper) is a plant lover, specialized in orchids. Susan Orlean (Meryl Streep) writes a story about it, and later a book. Charlie Kaufman (the always cool Nicholas Cage) has to adapt the book to a screenplay.<br><br>Basicly, that's the story right there. But this movie comes with so many twists, it's hard to catch up.<br><br>First of, Susan Orlean and her book really exist. As does Charlie Kaufman (Being John Malkovich, Eternal Sunshine o/t Spotless Mind). In fact, Kaufman has written this movie. So Kaufman wrote a movie about Kaufman writing a movie. You get it? Then there's the fact that all storylines are happening at the same time (think The Hours). Add to that the twin brother Donald Kaufman, who's also writing some parts. Or is he...? Does he even exist at all?<br><br>The most confusing (and amusing) part is that movie-Kaufman (that's Cage) is talking about making this movie. He's telling himself 'we open with a van on the highway' and we've actually seen that part. It goes even beyond that, when we hear him talk to his recorder: 'Charlie Kaufman is talking to his recorder'. I loved that part.<br><br>But it's a movie you have to go along with. Kaufman and Jonze try desperately to be clever and they've managed to do so. It's one of the most original movies of the last ten years, but I'm sure it's not for all tastes. If you like Being John Malkovich you should probably give it a go though.<br><br>My score: 8/10.","user":"TheOtherFool","rank":[107,131]}]