[{"title":"I didn't really like it that much","rating":5,"date":"21 February 2020","review":"Its not as great as the mummy films, and it felt more like a cheap tv show. However, the performance by dwayne wasnt all that bad. Overall still not enough to say what a decent action adventure.","user":"MR_Heraclius","rank":[36,38]},{"title":"An enjoyable film that got action, comedy and a love story","rating":8,"date":"22 September 2008","review":"Dwayne Johnson plays a natural-born hero called Mathayus He starts off as an Akkadian mercenary crossing the ancient lands looking for his brother who is slain before his blazing eyes by a Nordic barbarian horde whose name is Memnon <br><br>What has kept the vicious tyrant as the absolute conqueror of the land is the fact that he has a visionary sorceress by his side who knows when he should attack his enemies Mathayus finds out that she's a sexy gorgeous woman who looks amazingly beautiful (Surely the audience is teased ceaselessly by her cleavage-revealing). So Mathayus forgets his commission to kill her, and a kind of romance begins to flourish between the two as he tries to carry out his assignment <br><br>Kelly Hu plays Cassandra, the female sorcerer who had beauty, charisma, cleverness, and enigma In the beginning of the film, we're not quite sure where she stands But when she first sees Mathayus, she's interested in the well-mannered warrior who's strong, brave, loyal and sincere She realizes that he might me the future king who can save her from her power-mad jailer <br><br>As the ruthless conqueror, Memnon (Steven Brand) has got all of the skills needed to attain global domination He has also got the force and the will to accomplish it The combination was pretty scary <br><br>Michael Clarke Duncan plays the fearsome Balthazar, the Nubian King, the strong ally of Mathayus <br><br>Chuck Russell's \"The Scorpion King\" is a visual feast, and an entertaining action film It has sexy harem girls, poison arrows, quicksand, an army of red ants, black scorpions, cobras, explosions, and a lot of fun So don't miss it!","user":"Nazi_Fighter_David","rank":[63,77]},{"title":"So he's...the bad guy?","rating":7,"date":"24 October 2004","review":"Okay, I'm confused. The Mummy Returns portrays the Scorpion King as some evil tyrant who wants to take over the world by smiting any and all civilizations in his way. But that's exactly the opposite of the same character in his very own movie. In fact he struggles to overthrow an evil ruler for those very reasons.<br><br>So when, and why, did he become bad? I'm afraid I'm not following this. The movie, however, is entertaining, if rather short and silly. Chuck Russell tries to cram in loads of fighting and hokum as he can. It works and The Rock is very cool as said King (or Mathayus) and former Jason victim Kelly Hu is gorgeous as the scantily-clad Cassandra. Grant Heslov and Michael Clarke Duncan fill out their usual roles as ethnic comic-relief and big, muscley guy.<br><br>The film has slightly less integrity to it than the Mummy movies. This is evident with the fun and lively, but completely inappropriate, score by John Debney. I'm not expecting anything like his Passion of the Christ score but blaring death metal guitars seem kinda out of place in a movie set 3000 years BC.<br><br>But this movie is a cheeseburger, not a 17-course dinner. So why bother complaining. After all it's a prequel of a sequel of a movie that was a re-make of a movie that was made in the 30's. But it's well made and loads of fun so just go along with it and you'll enjoy.<br><br>Filmed in Panavision the DVD is in perfect 2.35:1 anamorphic widescreen with very loud and thrilling Dolby/DTS 5.1 sound. The extras are fluff, but that's to be expected.","user":"CuriosityKilledShawn","rank":[83,118]}]