[{"title":"as a retired Van Damme fan, I was actually really surprised.","rating":8,"date":"26 April 2003","review":"I used to be Jean-Claude Van Damme's biggest fan back when I was 13 or so, having seen HARD TARGET on video and then watching every subsequent Van Damme movie up to MAXIMUM RISK (which for some reason I just didn't feel like watching). As it would turn out, I didn't end up seeing any more of his work for the next five years or so, half because it just sounded awful (UNIVERSAL SOLDIER 2) and half because it didn't make it to the theater. Now I'm in video stores all the time seeing flicks like LEGIONNAIRE, DERAILED, and DESERT HEAT, wondering \"when did that come out?\". They just seem to spring up without warning. REPLICANT was one of those, and I laughed when I first saw the poster in a video store, immediately assuming it was just some awful BLADE RUNNER rip-off.<br><br>That said, I finally broke down after two years and rented it based on all the positive stuff I've heard, and I'll say I'll have to go with the flow on this one - it's surprisingly good! Van Damme looks a bit older but he's still in great shape and has more energy than your typical 14-year-old. The problem was that his acting has usually been so stiff that it's hard to root for him as the good guy (watching SUDDEN DEATH I actually was hoping the bad guys would win) - not the case with this movie.<br><br>No, believe it or not, Van Damme actually displays an amazing, intriguing, and very believable performance (or is it one?) playing the moronic and childish clone. Michael Rooker, the other reason I broke down and rented this movie, has some really great scenes like when he gets so angered by a call from the psycho-killer that he throws the phone on the ground and smashes it into a million pieces. Rooker also looks a great deal younger and in better shape than in THE REPLACEMENT KILLERS or THE BONE COLLECTOR, playing a more youthfully-minded loner as opposed to a tired old sheriff or something. While this film has a really familiar concept, a lot of those \"oh god that's dumb!\" moments, and some pretty unmotivated fight scenes (why have the scene where he beats up all the government types in the abandoned building - why were they even there in the first place?), it's really good considering they had a great deal less than $10 million to make this movie, about half of what it would cost to even hire Schwarzenegger to do a film. Take this movie and the extremely similar THE 6TH DAY and run them side by side, and it's almost sad how much better Van Damme's acting is, how much better the cloning concept is handled, and how surprisingly \"fresh\" everything seems.<br><br>Van Damme really does a good job and actually made me care about his character (the clone one, anyway). The best scenes in the movie though have to be Van Damme as the evil twin cutting a swarth of destruction around the city - like kicking old ladies, shooting corpses, or (my favorite) when he shoots the driver of a stopped car he's running past in an intersection FOR NO REASON! If actions spoke louder than words, Jean-Claude would have at least one Academy Award.<br><br>Well worth a rental for anyone actually interested in this movie enough to find themselves reading this.","user":"Aylmer","rank":[63,70]},{"title":"At least it's better than Knock Off and Universal Soldier 2","rating":24,"date":"24 December 2001","review":"Replicant stars Van Damme as a killer who is cloned by scientists so that the clone helps capture him.<br><br>Van Damme scores his best since Sudden Death in this better than average DTV movie. Ringo Lam delivers some great action scenes and explots Van Damme's physical ability to great affect making Replicant a good movie.<br><br>Overall Replicant would have been better if it wasn't so long but in anycase Replicant is a nice change of pace for the muscles from brussels. *** (Out of four)","user":"COMICBOOKSTOREGUY","rank":[13,14]},{"title":"Very different!","rating":19,"date":"19 February 2003","review":"This was very different for a Van Damme movie. Even though this is like the 100th time Van Damme has done the double role thing, this is the best out of them. Van Damme really plays his roles well in this one. I don't really like Michael Rooker as an actor, but he does well with what he is given. Some of the characters are underdeveloped, but the movie still is decent.","user":"PlayerSS","rank":[15,17]}]