[{"title":"I almost skipped this one because of the comments above...","rating":9,"date":"3 November 2001","review":"and that would have been a real shame.  This movie was thoroughly enjoyable. I think this would make an excellent introduction to Korean cinema because it was MY introduction to korean cinema and I didn't find it inaccessible in any way.<br><br>It was not as gruesome or hard to stomach as I was expecting, nor was it really as dark as mentioned above.  If you could sit through Fargo, you could certainly sit through and really enjoy this film.<br><br>\nTo say it does not have many jokes misses the point, because some of the situations that characters find themselves are quite hilarious--especially the chase scenes.  The acting and directing are excellent.  If you get a chance to catch \"Barking Dogs Never Bite\" don't miss it.","user":"bross3","rank":[50,65]},{"title":"Indie Filmmaking at its Best - Bong Joon Ho's Understated Masterpiece","rating":9,"date":"6 December 2015","review":"I'm leaving this review to hopefully attract even the smallest bit of attention to this incredible film, that is sadly so hidden to mainstream and fringe film audiences alike. I believe Bong Joon Ho is one of the greatest modern filmmakers, who has gained a strong following due to films such as Memories of Murder (2003): a bleak and haunting serial-killer masterwork, The Host (2006): a comic and gripping creature feature, Mother (2009): an unexpected and layered murder mystery, and Snowpiercer (2013): a breathtaking Orwellian Sci-Fi tour de force based on a French graphic novel. If you are new to the world of Bong Joon Ho, I highly recommend all of these works. However his debut film, Barking Dogs Never Bite (2000), is a much lesser-known work of his, but despite its lower budget and smaller scale, I believe it to be one of his finest creations.<br><br>Danny Boyle once said: \"I think your first film is always your best film. Always. It may not be your most successful or your technically most accomplished, whatever. It is your best film in a way because you never, ever get close to that feeling of not knowing what you're doing again. And that feeling of not knowing what you're doing is an amazing place to be. If you can cope with it and not panic, it's amazing. It's guesswork, inventiveness and freshness that you never get again.\" I feel that this quote summarizes why Barking Dogs Never Bite is such an amazing film. It was Bong's passion project, and even though he lacked the experience and guidance that makes his later works so great, he had a nervous and adventurous tenacity that couldn't be replicated in the future. I definitely believe this to be Bong Joon Ho's most personal film, and one that analyzes the interactions between characters. I won't waste time discussing specific plot points or characters/character actions; that's the film's job. What I do want to share are the subtle themes included throughout the film that have resonated with me.<br><br>Probably the most prevalent theme throughout the film is chasing one's dreams...or at least what one believes to be one's dreams. Yun-ju ultimately wishes to gain employment as a college professor, and is determined to do whatever is necessary to achieve this goal. But is this surely what he wants, or is it just what he thinks he wants? How do we even know what we want in life is what we truly want? It's not like we have achieved that goal to know if it is actually what we were expecting it to be. It is common to have a goal in life in which, once achieved, doesn't bring as much satisfaction as it was originally speculated to bring. Or it even may end up being something that you didn't want at all. The opening wilderness and closing curtain shots of this film, in relation to how they tie into the theme of achieving falsely desired goals is flawless filmmaking. Hyeon-nam has a similar experience with achieving desired goals. This film has several set pieces that play off of one another like a domino effect, which usually peaks my interest when accomplished properly (as it was here). There are also one or two segments of the film that have very little to no relation to the overarching story, but were executed incredibly. Specifically, one scene where the janitor tells a story about the building's boiler room, which introduces such a sudden change of tone, but is handled so skillfully. I really appreciate when directors are able to break the conventions of filmmaking like so, while still making it work to their benefit. This movie is also absolutely hilarious (probably Bong's most comedic), but the humor is very dark. That being said, there are so many witty, honest, humane, and even sadistic moments that made me laugh and smirk.<br><br>There are a few warnings that I would like to share. First off, there are a few scenes that depict animal cruelty and canine consumption (I'm a dog lover, so don't think that just because you love dogs you won't be able to watch this movie). However, literally the first thing you see when watching this film is text that states \"No animals were harmed in making this film.\" You have to remember that at the end of the day, you're watching a movie, and the events depicted on screen are not real. On the other hand, Bong Joon Ho is also portraying how animals (specifically dogs) are viewed and treated in South Korea. The consumption of dog is not too uncommon, and that's a cold hard fact that you'll have to stomach (pun intended), not only while watching this film, but throughout life in general. In short, Bong Joon Ho depicts lifestyles that actually exist, despite seeming uncommon and harsh to other cultures. Secondly, I acknowledge that this film might not be for everyone. This is a small scale and personal dark comedy about human interactions. The pacing is slow, there is no action, and I wouldn't use \"pure entertainment\" as a term to define this film. But if you have patience and are able to give Bong Joon Ho a chance to guide you through his quirky little story, I believe this film can provide unique gratification. It may be hard to get your hands on a copy, but I highly suggest going through the effort to do so. This is a true gift to cinema, even though it's hidden so far beneath all the others that only very few have uncovered it.<br><br>If you enjoyed this film and want to see which others I recommend, or you'd like to see my taste of films to decide if this film would be worth watching for you, feel free to check out this list: http://www.imdb.com/list/ls052767730/","user":"ajr93","rank":[15,18]},{"title":"A ten plus comedy noir about zero sum lives","rating":10,"date":"24 August 2001","review":"This is something of a rarity, a indie Korean film.  It's also Joon-ho Bong's directorial debut.  It's brilliant.  Slow, but impeccably paced and broadly intermixed with multiple levels of wonderful comedy, acting, atmosphere (a kind of existential (and cement) wasteland), and directing. Be warned.  Pet lovers are going to be shocked, and maybe outraged.  But really, don't take this too literally, Joon-ho Bong knows he is playing with your sensibilities and he knows that you know it (or you should know it by now, if you have been watching film, tv, and advertising for your entire life).  This is real cinematic virtuosity.<br><br>The promotion for this film compared it to American Beauty and that was a somewhat surprising but very apt comparison.  American Beauty would be a fine double bill with this.  But, if you have not seen any other Korean films you should give some a try.  I saw this as part of a festival with JSA (Joint Security Area), The Isle and some others, but those two were very good and would also be good for a double bill.   A little farther afield might be Tsai Ming Liang's the HOLE, or even farther, (and certainly not for the fainthearted) Go Go Second Time Virgin by Kosi Wakamatsu.  Both intense looks at life in barren modern times and barren apartment complexes.","user":"theorbys","rank":[31,46]}]