[{"title":"A fun movie","rating":7,"date":"2 November 2001","review":"After watching most of the recent action movies, I left the theatre with a headache brought on by incredibly tight/shaky shots and edits so fast that any hope of seeing anything is lost.  This movie takes a step back from that.  It isn't entirely devoid of those annoyances, but is much better than most.  In fact, at times, you can even see a whole string of punches and blocks without a cut or a shake!  Of course there is the inevitable wire work, that combined with the necessary special effects to allow Jet Li to fight himself.  But for once there is an excuse other than \"because we can\".<br><br>The story is pretty simple.  A murdering criminal is killing all the copies of himself in all the other \"universes\".  Each time one dies the life force/resonant string thing, gets divided amoungst the survivors.  Of course this leaves a ton of questions that aren't addressed at all in the movie, but I can live with that since those are more topics for debate after having fun at the movie.  That is one of the strengths of the movie, the progressively more intense action.  As the movie progress, rather than trying to deal with any question the viewer might have, the pace and intensity of the movie goes up.  The final action sequence is probably ten minutes long all told, which, to me, is a sign of a true action movie, as opposed to movies with action.<br><br>Overall I give it a 8/10 for fans of the genre.  If you aren't particularly interested in sci-fi/martial arts, especially if you have a problem with wire work and blue-screens, then you might want to skip it.","user":"BigGuy","rank":[69,91]},{"title":"Jon Monsarrat review: action movie fans, rally!","rating":7,"date":"1 April 2002","review":"Hey! Why'd this film get such a low rating?<br><br>I hope it's not due to the drama / arty types. I swear they walk into an Arnold Schwartzenegger film and start critiquing the dialogue or the deep cinematic reflections on life. I think they may have formed a false expectation. Action movies don't aim for that stuff, so it's a little unfair to then expect it.<br><br>Mostly stuff blows up in \"The One\", and I'm totally OK with that, being an action movie buff. What's weird is that you know they're using lots of wires and some of the stunts are a little overdone. But forget the fictional character's skill -- just the skill you'd need as a stuntman or stuntwoman making this movie to perform some of these stunts is truly impressive!<br><br>Let me warn you that the plot is a pretty stupid, and while billed as a science fiction film it really is not. However, it's nowhere near as bad as sub-intelligent flicks \"Independence Day\" and \"Mission Impossible\". It was more like \"Mission Impossible 2\". And lots and lots of stuff blows up.<br><br>Compared to Jackie Chan, Jet Li's films have more action, but it's stunt-like rather than natural, more of an \"edge\" (including blood and gore), less comedy, and he speak better English. I still prefer Jackie. If you're new to martial arts films, ease yourself in with accessible Jackie Chan action/comedies \"Shanghai Noon\" or \"Twin Dragons\".<br><br>Who should see this film:<br><br>-- action movie buffs and borderline action movie types<br><br>who will trade over-violence for under-plotting.<br><br>And don't drag along your SO.<br><br>-- sci-fi movie buffs who don't form expectations of real sci-fi<br><br>and like action flicks<br><br>-- I can't think of anyone else. <br><br>I'll give \"The One\" an 8 out of 10.","user":"johnnymonsarrat","rank":[71,104]},{"title":"nice movie","rating":10,"date":"17 February 2002","review":"I can't understand why all the Matrix fans are claiming a special effect as their own and that no other movie can make use of it.<br><br>The Matrix copied the Chinese movies that used those pulleys to keep the actor in mid air after jumping and doing all those kicks before they land back on the ground. And using those pulleys to fly backwards thru the air after getting hit.<br><br>I think that once a technique or special effect has been created then everyone's allowed to make use of it.<br><br>This is a nice movie to watch. Jet Li's English is such an improvement on his past efforts and you can feel the affection in his voice when he talks to/ about his wife. Jackie Chan, as wonderful as he is, still hasn't mastered English to Jet Li's level.<br><br>The action was great. I'm not looking for realism in a sci-fi movie. I had no expectations. Just watched to see what I'd get - and for the 1.5 hours, I was entertained. It's a simple story, simple concept.<br><br>I wish people would go to see this movie and not try to compare it to Matrix. Matrix itself is not innocent of \"borrowing\" special effects already used in other movies. As for the \"there can be only one\" theme, look back to the old days of Astroboy. There was that robot war thing where they had to kill each other so there would be only one winner. Big deal.<br><br>I will definitely be buying the DVD. But then again, I do have most of Jet Li's movies on DVD :-)","user":"normano","rank":[53,78]}]