[{"title":"BWA!","rating":9,"date":"1 September 2002","review":"I didn't expect to enjoy this movie but loved it almost from the start.  I don't understand the scathing vitriol heaped at this movie from US critics -- how is it more \"offensive\" or \"insulting\" than 'American Pie' or 'Animal House'?  Is it because in this movie the women are the ones being bawdy and crass and not in their usual roles as naive school girls, there to be played by the male leads?  It's not a coincidence that the majority of critics who panned this movie are crotchety old men.<br><br>I laughed out loud constantly, the dialogue was pretty good -- there were lots of quote-worthy scenes and the best part was that the girls seemed to have such a good time.  I had fun watching them goofing around.  The interaction between the female characters and the depth of their friendship was entirely realistic.  Women DO sit around being crass, they DO (sometimes) use men for sex and leave them to eat dirt and have fun all the while.<br><br>What endeared me forever was the scene where Christinia Applegate is dressed up as Vivian the hooker from 'Pretty Woman' -- her send up of Julia Robert's horsey overlaugh (TM fametracker.com) was SPOT. ON.  (America's Sweetheart? Gag me with a fork).  The scene where Cameron Diaz kisses the male lead was great because the producers allowed her to get her lipstick all messed up. That is such a refreshing change from movies where the makers seem to think it's perfectly normal that a woman who has been skydiving/engaged in mortal combat/enjoyed a night lovin' has not even smudged her makeup.","user":"mledinh","rank":[35,47]},{"title":"adult sex comedy","rating":6,"date":"19 February 2003","review":"This movie is very funny.I laughed out loud a lot.A lot of people here criticize it as if it was supposed to be some serious movie.Its a silly and sexy comedy with a lot of adult language.If you are offended by sex jokes its not the movie for you.I think Diaz and Applegate were great in it and its soooo refreshing to see actresses not being afraid to make fools of themselves on screen.","user":"jimakros","rank":[47,66]},{"title":"maybe its just me","rating":7,"date":"31 January 2006","review":"it could be just me but i really love this movie. i don't know one girl who doesn't have it in their DVD collection and i'm proud to be one of them....the movie is funny, stupid, and all around a good time. so its not gonna win any awards or looked upon as \"superior\" but come on, don't you remember what its like to watch a movie just for the sake of entertainment? i have a section of my movie collection devoted to those chick flicks that while embarrassing to have are my guilty pleasures and i can't feel bad for that. what more do you want out of a stupid/funny movie? please don't pull some critical analysis on this movie people cause it is what it is. take it for face value and relax...","user":"lauren_peterson06","rank":[98,146]}]