[{"title":"Star Power Overcomes Some Comic Weaknesses","rating":10,"date":"18 December 2004","review":"There are many movies where the performances are so good that the weaknesses of the movie itself are almost oblivious.<br><br>The casting in this film, bringing together the stars of the original with Dustin Hoffman and Barbra Streisand as Greg aka Gaylord Focker's parents, is sensational.<br><br>While I admit that I believed I would read comments and reviews about the crudeness of the material, I believe the reason this is not a typically tragic Hollywood farce is due to the strength of the performances and the interaction of the characters.<br><br>As you know, the premise of the movie is very simple. Prior to the wedding of Greg and Pam, the two families will meet. In typical Hollywood sequel fashion, we already know that the Byrnses are somewhat reserved, set in their ways. So it is no surprise that the Fockers are almost the complete opposite.<br><br>Hilarity ensures, some crude, some overtly sexual. But the cast is skillful and it plays more like a comic version of \"Closer\". You will believe that Bernie and Roz (amazing performances by Dustin Hoffman and Barbra Streisand) are Greg Focker's parents. Not only is their interaction genuine, their love for their child is as well. Part of Greg's embarrassment is the knowledge of his parents' \"quirks\" and how different they are from the Byrnses. Ben Stiller aptly conveys this while not backing down from his love for his parents.<br><br>Meanwhile, stern Jack Byrnes scans the Fockers for clues to prove why he should not like them, therefore not allowing his daughter to be married into that family. His design of the RV is classic Jack Byrnes. What is an improvement in this film, is that Jack discovers some things about himself and his relationship with his wife and daughter that change him. This may be the funniest performance in Robert DeNiro's career.<br><br>Throughout the film, there are themes that everyone has experienced but most of all, how important love is. The love of another and the love of family and friends. There is a very good example of this in a scene between Teri Polo and Ben Stiller, after some new information is exposed that could possibly tear them apart once again.<br><br>All in all, when you know the cast is having a good time, the audience does too. I will be seeing this one more than once.","user":"realangst","rank":[197,299]},{"title":"Worth Watching For One Reason: Dustin Hoffman","rating":6,"date":"6 November 2005","review":"I enjoyed the sequel \"Meet the Fockers\" more than the original \"Meet the Parents\" for one reason: the performance of Dustin Hoffman. Overall, it was a fine ensemble cast and good scripting of the jokes and situations surrounding the irrepressible ex-CIA agent and family patriarch Jack Byrnes (Robert DeNiro). But Hoffman's character Bernie Focker, an attorney who retired to become a full-time dad to his son Greg (Ben Stiller), grounds this comedy in solid human values that raise the film beyond the level of nutty comedy.<br><br>I admired how Hoffman's character revealed genuine pain following the nasty remarks of Jack Byrnes. For example, the shrine of framed memorabilia of his son's accomplishments was ridiculed by Jack. One could empathize with Bernie's pain which he registered at the criticism. Indeed throughout the film, the most memorable scenes were those with Hoffman's character on the defense, but also taking the offensive against Jack. <br><br>The film also included some wildly funny moments, such as the teenager born out of wedlock to Greg's babysitter, a young lad with humongous eyebrows who was a dead-ringer for Ben Stiller's character and Jack's outrageous motor home rigged with listening devices, which provided him with his command center for spying on the Fockers. Much credit should go to director Jay Roach for outstanding comic rhythms, timing, and pacing.<br><br>In the end, this was thoroughly enjoyable movie, which had the surprising effect of providing a good window into family values unusual for Hollywood film comedies.","user":"lavatch","rank":[34,46]},{"title":"We've Been \"Focker-ized\"!","rating":9,"date":"20 December 2004","review":"\"Meet the Fockers\" sounds like \"Meet the f-u-u-\". Oops! Can't say that because of FCC guidelines. Just the same, the title pretty much describes the level of the humor in this Ben Stiller comedy. But that's redundant because it IS a Ben Stiller movie. Clearly my expectations for this movie were not high and, maybe because of that, I found \"Meet the Fockers\" quite funny.<br><br>Don't get me wrong. This is not a movie for everyone. First off, the writers did not miss a single opportunity to play off of the name \"Focker\". It's silly and gets a little old but it somehow works with the other repetitious low-down gags.<br><br>Focker is the family name for Greg (Focker), Ben Stiller. The funniest Fockers, however, (now I'm doing it) are Greg's parents Bernie and Roz, a loose and liberal Florida hippy couple still living in the last century and enjoying every minute of it. Dustin Hoffman, as Bernie displays a previously unrevealed talent for over the top comedy. Fitting perfectly with Hoffman's Bernie, is Barbra Streisand as Roz Focker, reminiscent of the \"zaftig\" Lainie Kazan. Bernie is a yesteryear lawyer who has not practiced since who knows when. Roz is the main breadwinner from her business as a sex therapist to the elderly.<br><br>Greg is not too eager to reveal his parents' true nature to his fiancée's parents as they all come to visit to get to know one another better. Teri Polo nicely plays Greg's fiancée Pam. Robert DeNiro and Blythe Danner play her stiff and straight parents, Jack and Dina Byrnes. Oh  also add in some baby low-brow by Spencer and Bradley Pickeren, two adorable twins playing Little Jack.<br><br>So, go low, go loose -- or don't go at all -- but if you like Ben Stiller, go see \"Meet the Fockers\". Dustin's antics will crack you up and you'll enjoy Barbra back on the big screen after so long. Rated a B+.","user":"Radio_Lady","rank":[165,254]}]