[{"title":"Strange, touching and beautiful","rating":10,"date":"26 December 2013","review":"Personally, I've never seen anything as original in an animated film as in this deeply mythical fairytale. What a surreal idea for a movie! It's hard to find an adequate description (because I also don't want to spoil this in the slightest way) but this film has a sense of \"otherness\" to it - for lack of a better word - like none I've ever seen. And the strange, mythical nature of this film - apart from the amazing artwork - is probably one of the main reasons for its appeal to me. <br><br>Maybe the themes of the story don't feel quite as strange to an eastern audience because they fit to a certain degree with some eastern/Asian mythologies - to me, this beautiful piece of wonder was something new. And a profoundly moving experience. <br><br>Outstanding animation; funny, weird, scary and touching at the same time, this unique work of art is one I can't recommend enough. 10 out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/","user":"gogoschka-1","rank":[235,256]},{"title":"Great","rating":10,"date":"15 February 2020","review":"Despite an overlong run time, Spirited Away is a visually stunning film filled with some of the most imaginative characters I've ever seen. In addition to the visuals, the music is beautiful, and the story has something for audience members of all ages.","user":"MR_Heraclius","rank":[41,42]},{"title":"An Amazing Achievement in Animation.","rating":20,"date":"20 July 2004","review":"'Spirited Away' is the first Miyazaki I have seen, but from this stupendous film I can tell he is a master storyteller. A hallmark of a good storyteller is making the audience empathise or pull them into the shoes of the central character. Miyazaki does this brilliantly in 'Spirited Away'. During the first fifteen minutes we have no idea what is going on. Neither does the main character Chihiro. We discover the world as Chihiro does and it's truly amazing to watch. But Miyazaki doesn't seem to treat this world as something amazing. The world is filmed just like our workaday world would. The inhabitants of the world go about their daily business as usual as full with apathy as us normal folks. Places and buildings are not greeted by towering establishing shots and majestic music. The fact that this place is amazing doesn't seem to concern Miyazaki. <br><br>What do however, are the characters. Miyazaki lingers upon the characters as if they were actors. He infixes his animated actors with such subtleties that I have never seen, even from animation giants Pixar. Twenty minutes into this film and I completely forgot these were animated characters; I started to care for them like they were living and breathing. Miyazaki treats the modest achievements of Chihiro with unashamed bombast. The uplifting scene where she cleanses the River God is accompanied by stirring music and is as exciting as watching gladiatorial combatants fight. Of course, by giving the audience developed characters to care about, the action and conflicts will always be more exciting, terrifying and uplifting than normal, generic action scenes. <br><br>Through Chihiro, Miyazaki is clearly (but non-patronisingly) talking to youth of Japan. There's a certain sense of revile about the youth of Japan at the moment. Many people consider them to be ill-mannered and baring no respect for their elders or their forefathers. They are simply bi-products of their material world and consumerism. 'Spirited Away' taps into this. At the start Chihiro is a selfish, spoiled, whiny brat. But as she plunges deeper into the spirit world, she becomes more independent, more assured, more respectful and learns some manners. No Face, a black figure with a white mask, is the catalyst behind Chihiro's transformation. Once he is let into the bathhouse, we are no longer tourists  the story propels forth. Watching No Face prey on the greed of the workers is a terrifying delight. The three main characters in Miyazaki's youth allegory are Chihiro, No Face and Bô. All of these characters are disconnected with their world. They are lonely, misunderstood and largely ignored. But when they go on their journey together, they united and become stronger individuals.<br><br>Miyazaki also talks about the ecology of Japan. What was once a beautiful; grassland has now turned into the Asian New York. That The Last Samurai had to be filmed in New Zealand to get a turn of the century Japanese look speaks volumes. The River God sequence is an unsubtle but unpretentious commentary on pollution. While these two themes are very much current in Japan, they are also universal themes  which makes 'Spirited Away' a universal story that most of us can connect with. I'm willing to bet everyone reading this has at some time seen bicycles lying on a lake bed or have had a child talk to them disrespectfully. Sure these themes aren't advanced philosophy. They are everyday issues told in an inventive, fun way.<br><br>The animation is wonderful, if not as smooth as Disney's works  but there's something superior to that. 'Spirited Away's imperfect, but detailed world is far more fascinating than the perfected blandest of Disney's latest offerings. The animators successfully balanced the tight-rope between not-enough animation on characters and too much animation on characters. No Ralph Balski ADD antics here! The film is full of vivid images  both beautiful and horrifying. The line between those two extremes is crossed over seamlessly. From Chihiro and Haku running through an opening flower field to Haku's dragon snarling with a bloody mouth, both extremes seem to belong in the film. It's also excellently done with the characters. Kamaji can be seen as a scary, daunting figure at the beginning, but soon he seamlessly changes into a humble, wise figure. Yubaba also seems to be able to turn from kind to witch with the snap of a finger. <br><br>The sound on the film was expertly done. The sounds perfectly match the on screen actions and objects. My sub woofer got a wonderful workout when Haku swoops Chihiro past the bridge at the beginning. And while I don't speak Japanese, I think the voice actors did a wonderful job of conveying their personality and emotions true their voice. Joe Hisaishi's music is sublime, definitely one of my favourite scores. His main piano theme is simple and evocative. His thunderous action music hits the viewers on the chest like a hammer. Like all great scores it heightens the greatness of a scene about three times. The score, unlike many American composers', is unobtrusive. It plays excellently with the scenes, but never overbears them. A lot of the time the it is barely noticeable, a sole piano plays softly in the background evoking a dreamlike/lullaby quality. <br><br>'Spirited Away' is a simply a modern masterpiece, easily one of the Top 10 films of the new millennium. It works on a multitude of levels; a social commentary on Japan, a homage to ancient Japanese/Russian mythology, a moral film for both children and adults. But most importantly, it is a simple story brilliantly told by a great filmmaker who appears to be at the top of his game. 'Spirited Away' works much like a relaxing journey. Pop in the DVD; leave this world for two hours and when you will be almost certainly enriched and ready to take the trip again.","user":"Le-Samourai","rank":[684,778]}]